{"authors": [], "date_download": "2024-10-12 14:13:56", "date_modify": "2024-10-12 14:13:56", "date_publish": "2022-05-05 22:55:08", "description": "Senior health officials made similar remarks about the Covid Zero strategy last week. Read more at straitstimes.com.", "filename": "asia_east-asia_chinas-top-leaders-reiterate-support-for-covid-zero-cctv_1728742436.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/05/mi_lockdown_050522.jpg?VersionId=EoqlLkHVFUer44IbSVyBYyOmvAWmtxIP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinas-top-leaders-reiterate-support-for-covid-zero-cctv_1728742436.html", "title": "China's top leaders reiterate support for Covid Zero: CCTV", "title_page": "China's top leaders reiterate support for Covid Zero: CCTV | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (BLOOMBERG) - China's top leaders have warned against questioning Mr Xi Jinping's Covid Zero strategy, as pressure builds to relax virus curbs and protect the economic growth that has long been a source of Communist Party strength.\nThe Politburo's supreme Standing Committee pledged on Thursday (May 5) during a meeting led by Mr Xi to \"fight against any speech that distorts, questions or rejects our country's Covid-control policy\", state broadcaster China Central Television said.\nThe body reaffirmed its support for the lockdown-dependent approach, saying China had made progress toward overcoming its worst outbreak since the first wave in Wuhan two years ago.\n\"Our pandemic prevention-and-control strategy is determined by the party's nature and principles,\" the seven-member committee said, according to CCTV.\n\"Our policy can stand the test of history, and our measures are scientific and effective.\"\nThe Standing Committee's comments follow remarks from White House medical adviser Anthony Fauci, who said China's virus lockdowns were unlikely to be successful in the long term.\nThe nation's economic activity contracted sharply in April as restrictions to contain outbreaks closed factories and snarled supply chains.\nChina is facing sustained criticism and public discontent over its lockdowns.\nWhile new cases in Shanghai fell slightly to 4,651 on Wednesday, infections in Beijing held steady at 50.\nThe outbreaks are forcing the party to choose between the economic growth that has provided a source of legitimacy for more than four decades and Mr Xi's efforts to show China's model is superior to Western democracy.\nMr Xi can afford little internal dissent as he prepares for a twice-a-decade leadership reshuffle leader this year, when he's expected to secure a precedent-breaking third term.\nSenior health officials made similar remarks about the Covid Zero strategy last week.\nThey said it gives China time to boost vaccination rates among the elderly and other vulnerable groups, increase hospital capacity and develop and produce more antivirals before declaring victory over Covid-19.\nChina has a large elderly population with insufficient overall medical resources, as well as imbalances in regional development, the Politburo Standing Committee said.", "url": "https://www.straitstimes.com/asia/east-asia/chinas-top-leaders-reiterate-support-for-covid-zero-cctv"}