{"authors": ["Lok Jian Wen"], "date_download": "2024-10-12 14:07:04", "date_modify": "2024-10-12 14:07:04", "date_publish": "2023-11-08 09:30:00", "description": "PAS politician claimed founding Singapore premier and former DAP leader have family ties. Read more at straitstimes.com.", "filename": "asia_se-asia_lim-kuan-yew-lim-kit-siang-are-cousins-malaysian-opposition-mp-under-fire-for-false-claims_1728742024.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/08/Snapinsta.app3207576375462368673860242622008522446018235n1080.jpg?h=2448c040", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_lim-kuan-yew-lim-kit-siang-are-cousins-malaysian-opposition-mp-under-fire-for-false-claims_1728742024.html", "title": "‘Lim’ Kuan Yew, Lim Kit Siang are cousins? Malaysian opposition MP under fire for false claims", "title_page": "‘Lim’ Kuan Yew, Lim Kit Siang are cousins? Malaysian opposition MP under fire for false claims | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Malaysian opposition MP Siti Mastura Muhammad is under fire for telling an audience that former Democratic Action Party (DAP) leader Lim Kit Siang is a cousin of Singapore’s founding prime minister Lee Kuan Yew and former Malayan Communist Party leader Chin Peng.\nThe Parti Islam SeMalaysia (PAS) MP made the claims while speaking at a by-election rally in Kemaman, Terengganu, last week. A video of her speech has been widely shared on social media.\n“Lim Kuan Yew, Lim Kit Siang, Chin Peng, cousins. Can you see the link?” Dr Siti asked her audience. “Lim Kuan Yew lives in Singapore today. What he did in Singapore, we see the model happening in Malaysia.”\nDr Siti referred to the late Mr Lee as “Lim” Kuan Yew more than once in the video.\nShe also claimed that Mr Lim Kit Siang’s son, former finance minister Lim Guan Eng, is related to other DAP leaders, including Mr Anthony Loke, Ms Teresa Kok, Mr Nga Kor Ming and Mr Ngeh Koo Ham.\nHer claim has prompted a sharp rebuke from the younger Lim, who is chairman of the DAP.\n“This is not just a personal attack but has racial undertones as well. It is a spiteful allegation against my father, Tan Sri Lim Kit Siang, and me,” Lim said during a press conference at Parliament on Tuesday.\nHe stressed that he and his wife have no family ties with the four DAP leaders.\n“What is most important is that there is no family relation with Chin Peng and Lee Kuan Yew,” he said. “Lee Kuan Yew has passed away, and is not alive like she mentioned.”\nLim added that their surnames are different and that any Malaysians who believe Dr Siti’s claims are simply “frogs in a well”.\nHe said he will give the Kepala Batas MP a chance to substantiate her claim with evidence by Thursday.\n“If she fails to provide evidence, I will take further action,” he added.\nWhen Dr Siti was speaking in Parliament on Tuesday, numerous MPs attempted to interrupt her speech and asked her to explain her claims. She ignored them.\nShe also dodged reporters’ questions about Lim’s demand for evidence on Tuesday, and urged them to “watch the video until the end” instead.\nLim said his father has remained a target of PAS leaders’ attacks even after retiring from politics.\n“This is another example of PAS’ politics of extremism and slander,” he said. “Even they know their claims are unfounded.”\nPAS leaders and delegates have over the years repeatedly linked the Chinese-dominated DAP to communism. They have also likened DAP to Singapore’s People’s Action Party, saying that DAP, which is part of the ruling Pakatan Harapan coalition, could pose a threat to the special rights of Malay Muslims.\nMalaysia’s Deputy Communications Minister Teo Nie Ching on Tuesday advised leaders of the opposition bloc against stirring up racial sentiments.\n“The opposing side uses this rhetoric continually to tarnish the image of DAP leaders,” she said.\n“The spread of such slander can divide the unity of Malaysia’s ethnic groups.”", "url": "https://www.straitstimes.com/asia/se-asia/lim-kuan-yew-lim-kit-siang-are-cousins-malaysian-opposition-mp-under-fire-for-false-claims"}