{"authors": ["Joyce ZK Lim"], "date_download": "2024-10-12 13:43:39", "date_modify": "2024-10-12 13:43:39", "date_publish": "2024-05-25 17:14:00", "description": "The trend reflects the stiff competition and weak consumer demand in the Chinese market, analysts said. Read more at straitstimes.com.", "filename": "asia_not-your-average-internet-celebrity-china-s-ceos-turn-online-influencers_1728740619.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/25/hzlei250524.jpg?VersionId=kwCBse1JvdmQ5M85kyPboTXCVK2i8W4o", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_not-your-average-internet-celebrity-china-s-ceos-turn-online-influencers_1728740619.html", "title": "Not your average internet celebrity: China’s CEOs turn online influencers", "title_page": "Not your average internet celebrity: China’s CEOs turn online influencers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – “I really want to become a wang hong (internet celebrity),” said Mr Lu Fang.\nAnd while internet stardom is something younger people typically aspire to, the 48-year-old chief executive of a Chinese luxury electric vehicle maker recently voiced the same aspiration.\n“I hope everyone will help me become a wang hong,” Mr Lu, the head of state-owned automaker Dongfeng Motor’s subsidiary Voyah, quipped to local media in April.\nMr Lu, who says that he works hard on microblog posts every day, is not alone in his quest for internet fame.\nChina’s chief executives are increasingly fashioning themselves as online influencers, in a bid to boost sales as a slowing economy squeezes their companies’ bottom lines.\nThis phenomenon has gained prominence following the Covid-19 pandemic, analysts have said, in a reflection of the stiff competition and depressed demand that China’s businesses have to contend with today.\nCEO-influencers\nThese CEO-influencers hold hours-long live streams, star in video clips and pen short notes on platforms such as Weibo, a microblogging site, and Douyin, China’s version of TikTok.\nThere, they tout their companies’ products, discuss industry developments and share light-hearted snippets of their lives, sometimes multiple times a day.\nTheir goal: the eyeballs, hearts and – ultimately – wallets of China’s consumers.\nChina’s CEO-influencers include head honchos from industries spanning electronics to tech to education.\nOne of the most successful is Mr Lei Jun, founder of consumer electronics giant Xiaomi, who has over 23 million followers each on Weibo and Douyin.\nThe charismatic 54-year-old made his debut as his company’s live-streaming salesman on Dou­yin in August 2020, when the pandemic spurred more corporate leaders to use live streams to reach consumers who were isolated at home. The revenues that he brought in then made headlines – over 100 million yuan (S$19 million) in less than two hours.\nMr Lei is now leaning hard on his personal brand to break into China’s hyper-saturated electric vehicle market, most recently with a 3½-hour live stream on May 18 that saw him drive Xiaomi’s SU7 Pro from Shanghai to Hangzhou while 39 million people watched online.\nThe internet traffic that he generates, seen as a precursor to sales, is the envy of his peers.\nIn a Weibo post in February, billionaire tech tycoon Zhou Hongyi cited Mr Lei as one of the CEO-influencers he sought to learn from, so he can speak for his company while saving on advertising fees.\nThe 53-year-old co-founder of cyber-security company Qihoo 360 has stepped up his social media presence in 2024, with a wide range of straight-talking videos and written content ranging from artificial intelligence to his exercise regime.\nHe hopes to amass 10 million followers before the year is out – to date, he has over 6.4 million on Douyin and 11.5 million on Weibo.\n“If possible, I think entrepreneurs should all go be wang hongs,” he said on a live stream in January.\nAs live streams and short videos reshape how people consume information, it is important for business leaders to reach out to the public through these means, he explained.\nSinging for their supper\nChinese chief executives’ growing pursuit of an online following is a reflection of the state of the economy, where demand is conservative and competition is aggressive, analysts told The Straits Times.\nThe practice of corporate leaders becoming brand ambassadors through a strong social media presence is neither new nor unique to China.\nBut marketing expert Zheng Yuhuang observed that the country has seen a renewed surge in this phenomenon after the pandemic – especially in the form of live streams and short videos.\n“The economic environment is not great” and business leaders are forced to step forward as online influencers to push sales, the associate professor at Tsinghua University in Beijing told ST.\nRetail sales in China, a barometer of consumer spending, saw its slowest growth rate in over a year in April, as domestic demand remains weak amid an uncertain economic outlook.\nSpurring consumption is key to the resilience of China’s economy, and Chinese businesses would be under pressure to deliver in this regard, Prof Zheng added.\nAssistant Professor Wei Wuhui, a social media expert from Shanghai Jiaotong University, said the rise in the number of CEO-influencers is a symptom of the intense competition playing out in the market.\n“Such phenomena arise only when sales are not going all that smoothly,” he noted, pointing to how the leaders of China’s most profitable companies saw no need to put themselves online in this manner.\nThe CEO-influencer model is useful insofar as it helps companies attract attention to their products, while cutting down on hefty advertising costs, he told ST.\nIt might also help businesses find alternative paths to profitability, said Prof Zheng, citing tutoring giant New Oriental Education’s successful pivot to e-commerce after it was hit hard by a nationwide clampdown on the private education industry in 2021.\nThe company found a new lease of life through selling agricultural produce, books and other items via online live streams that doubled as English lessons, with the company’s founder Yu Minhong making appearances as well.\nBut the approach is not without its risks.\nThis strategy essentially ties the success and failure of the brand to the chief executive, meaning that “if the CEO does something wrong, it will negatively affect the brand”, said Associate Professor Li Xiu­ping from the National University of Singapore Business School.\n“Like celebrities, CEOs can err or have scandals,” she added.\nChina’s CEO-influencers also have to pay attention to political correctness – just like their counterparts in other countries, said Prof Wei.\nThe country’s internet celebrities have found themselves in trouble over ill-advised posts or comments that rankled netizens.\nFor example, top live-streamer Li Jiaqi faced an uproar in 2023 after dissing a thrifty viewer, and had his feed abruptly cut off in 2022 after showing footage of a supposedly tank-shaped cake just before the anniversary of the 1989 Tiananmen Square crackdown.\nBut by and large, business leaders are seasoned operators who “know how far to go”, noted Prof Wei. They focus mainly on their products, while staying out of sociopolitical commentary, he added.", "url": "https://www.straitstimes.com/asia/not-your-average-internet-celebrity-china-s-ceos-turn-online-influencers"}