{"authors": [], "date_download": "2024-10-12 13:36:32", "date_modify": "2024-10-12 13:36:32", "date_publish": "2024-08-06 19:25:56", "description": "Two rockets were fired on Aug 5 at the Ain al-Asad air base in western Iraq. Read more at straitstimes.com.", "filename": "asia_iraq-condemns-reckless-attacks-on-bases_1728740192.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/06/FILES-IRAQ-US-SYRIA-CONFLICT-092733.jpg?VersionId=_hTwmpp05hBAV5na3rjElrvTWT3r98hG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_iraq-condemns-reckless-attacks-on-bases_1728740192.html", "title": "Iraq condemns ‘reckless’ attacks on its bases", "title_page": "Iraq condemns ‘reckless’ attacks on its bases | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BAGHDAD – Iraq’s military on Aug 6 condemned “reckless” actions against bases on its soil and said it had captured a truck with a rocket launcher a day after at least five US personnel were wounded in an attack amid an escalation of Middle East conflict.\nThe region is on edge over the Gaza war and possible reprisals by Iran and its allies after the killing of senior members of militant groups Hamas and Hezbollah.\n“We reject all reckless actions and practices targeting Iraqi bases, diplomatic missions, and the whereabouts of the international coalition’s advisers, and everything that would raise tension in the region,” the Iraqi military statement said.\nThe military did not confirm that US personnel were injured, as American officials had told Reuters, but did say two rockets were fired on Aug 5 at Ain al-Asad air base in western Iraq from the nearby town of Haditha.\nA small truck was seized with a rocket launcher fixed on the back. Eight unfired rockets were dismantled, the Iraqi statement said.\n“The formations in our security forces, through intelligence and security work, have obtained important information about the perpetrators of this attack against Ain al-Asad, and they are currently being pursued to bring them to justice,” the statement added, without giving more details.\nA rare ally of both the US and Iran, Iraq hosts 2,500 US troops and has Iran-backed militias linked to its security forces.\nIt has witnessed escalating tit-for-tat attacks since the Israel-Hamas war erupted in October. REUTERS", "url": "https://www.straitstimes.com/asia/iraq-condemns-reckless-attacks-on-bases"}