{"authors": [], "date_download": "2024-10-12 14:01:24", "date_modify": "2024-10-12 14:01:24", "date_publish": "2024-04-20 18:06:16", "description": "The four-Bill package also includes funds for Israel and a measure that includes sanctions. Read more at straitstimes.com.", "filename": "asia_us-house-to-vote-on-long-awaited-95-billion-ukraine-israel-aid-package_1728741684.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/20/LYNXNPEK3J031-1.jpg?VersionId=GP4ZYQljgRYaNNda5DNrlt6XrJ4ul3iv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_us-house-to-vote-on-long-awaited-95-billion-ukraine-israel-aid-package_1728741684.html", "title": "US House to vote on long-awaited $129.3 billion Ukraine, Israel aid package", "title_page": "US House to vote on long-awaited $129.3 billion Ukraine, Israel aid package | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The Republican-controlled US House of Representatives on April 20 is set to vote on, and expected to pass, a US$95 billion (S$129.3 billion) legislative package providing security assistance to Ukraine, Israel and Taiwan, over bitter objections from party hardliners.\nMore than two months have passed since the Democratic-majority Senate passed a similar measure, and US leaders from Democratic President Joe Biden to top Senate Republican Mitch McConnell have been urging embattled House Speaker Mike Johnson to bring it up for a vote.\nMr Johnson this week chose to ignore ouster threats by hardline members of his fractious 218-213 majority and push forward the measure that includes some US$60.84 billion for Ukraine as it struggles to fight off a two-year Russian invasion.\nThe unusual four-Bill package includes funds for Israel, security assistance for Taiwan and allies in the Indo-Pacific and a measure that includes sanctions, a threat to ban the Chinese-owned social media app TikTok and the potential transfer of seized Russian assets to Ukraine.\n“The world is watching what the Congress does,” the White House said in a statement on April 19.\n“Passing this legislation would send a powerful message about the strength of American leadership at a pivotal moment. The administration urges both chambers of the Congress to quickly send this supplemental funding package to the President’s desk.”\nA bipartisan 316-94 House majority on April 19 voted to advance the Bill to a vote, and Senate Majority Leader Chuck Schumer told senators to be ready to work over the weekend if it passes the House as expected.\n“It’s not the perfect legislation, it’s not the legislation that we would write if Republicans were in charge of both the House, the Senate and the White House,” Mr Johnson told reporters on April 19.\n“This is the best possible product that we can get under these circumstances to take care of these really important obligations.”\nSome hardline Republicans have voiced strong opposition to further Ukraine aid, with some arguing the US can ill afford it given its rising US$34 trillion national debt.\nThey have repeatedly raised the threat of ousting Mr Johnson, who became Speaker in October 2023 after his predecessor Kevin McCarthy was ousted by party hardliners.\nRepresentative Bob Good, chair of the hardline House Freedom Caucus, told reporters on April 19 that the Bills represent a “slide down into the abyss of greater fiscal crisis and America-last policies that reflect Biden and Schumer and (House Democratic leader Hakeem) Jeffries, and don’t reflect the American people”.\nBut Republican presidential candidate Donald Trump, who carries huge influence in the party, on April 12 voiced support for Mr Johnson and in an April 18 social media post said Ukraine’s survival is important for the US.\nThe Bills provide US$60.84 billion to address the conflict in Ukraine, including US$23 billion to replenish US weapons, stocks and facilities; US$26 billion for Israel, including US$9.1 billion for humanitarian needs; and US$8.12 billion for the Indo-Pacific. REUTERS", "url": "https://www.straitstimes.com/asia/us-house-to-vote-on-long-awaited-95-billion-ukraine-israel-aid-package"}