{"authors": [], "date_download": "2024-10-12 13:44:04", "date_modify": "2024-10-12 13:44:04", "date_publish": "2023-02-07 00:22:21", "description": "The propellers of both engines went into “feather in the base leg of descending”. Read more at straitstimes.com.", "filename": "asia_nepal-aircraft-that-crashed-had-no-thrust-motion-in-engines-before-landing-says-panel_1728740644.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/07/btcrash20230207_1.JPG?VersionId=Og8Zd6e5.d8sCkH9p4oBJtiheaNOb_wy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_nepal-aircraft-that-crashed-had-no-thrust-motion-in-engines-before-landing-says-panel_1728740644.html", "title": "Nepal aircraft that crashed had no thrust motion in engines before landing, says panel", "title_page": "Nepal aircraft that crashed had no thrust motion in engines before landing, says panel | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KATHMANDU - An aircraft that crashed in Nepal in January, killing 71 people on board, had no thrust motion in its engines in the final leg of its descent, said a government-appointed panel investigating the accident on Monday.\nThe plane crashed just before landing in the tourist city of Pokhara on Jan 15, in one of Nepal’s worst airplane accidents in 30 years.\nThere were 72 passengers on the twin-engine ATR 72 aircraft operated by Nepal’s Yeti Airlines, including two infants, four crew members and 10 foreign nationals. Rescuers recovered 71 bodies, with one unaccounted person presumed to be dead.\nAnalysis of the cockpit voice recorder and flight data recorder showed that the propellers of both engines went into “feather in the base leg of descending”, the panel said in a statement.\nAviation expert K.B. Limbu said propellers going into feather means there was “no thrust” in the engine, or that it did not produce any power. REUTERS", "url": "https://www.straitstimes.com/asia/nepal-aircraft-that-crashed-had-no-thrust-motion-in-engines-before-landing-says-panel"}