{"authors": [], "date_download": "2024-10-12 13:44:54", "date_modify": "2024-10-12 13:44:54", "date_publish": "2023-02-17 20:53:00", "description": "Scoot will start taking delivery of nine E190 E2 jets from 2024. Read more at straitstimes.com.", "filename": "asia_se-asia_scoot-reaches-deal-for-embraer-e2-jets_1728740694.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/17/2022060233000463fd75e9e1-a5bb-40e0-b4fb-d5c11a9b0820_1.jpg?VersionId=INXvNCIIKHZOl0fNaYz52XClNJ8SVa9O", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_scoot-reaches-deal-for-embraer-e2-jets_1728740694.html", "title": "Scoot reaches deal for Embraer E2 jets", "title_page": "Scoot reaches deal for Embraer E2 jets | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore Airlines’ budget arm Scoot signed a letter of intent to add Embraer regional jets to its fleet in a push to fly to smaller destinations in Asia’s emerging markets.\nScoot will start taking delivery of nine E190 E2 jets from 2024, the carrier said in a statement on Friday.\nThe aircraft will be sourced from leasing company Azorra, and will allow Scoot to tap growth and match capacity to demand as it enhances its regional network, the statement said.\nThe agreements marks the first time Singapore’s main airline is ordering Embraer planes and is a major boost for the Brazilian planemaker, which is seeking to secure the future for its flagship commercial aircraft.\nBloomberg News in December first reported on Embraer’s efforts to sell regional jets to Singapore Airlines’ low-cost unit in an order that could grow to as many as 50 planes over time, as the carrier seeks to widen its reach in neighbouring Indonesia, Malaysia, Vietnam, Thailand and the Philippines.\nScoot’s fleet accounts for about a quarter of the wider Singapore Airlines Group’s 200 aircraft. The budget unit currently operates Airbus A320neo and Boeing 787 Dreamliner jets.\nScoot chief executive officer Leslie Thng said last week that the carrier could recover to 100 per cent of its pre-pandemic capacity in 2023, and potentially go beyond that from its current level of 80 per cent. BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/scoot-reaches-deal-for-embraer-e2-jets"}