{"authors": [], "date_download": "2024-10-12 13:38:47", "date_modify": "2024-10-12 13:38:47", "date_publish": "2024-01-08 19:36:15", "description": "The Pakistan Taliban claimed responsibility. Read more at straitstimes.com.", "filename": "asia_pakistan-bomb-blast-kills-five-polio-vaccination-guard-police_1728740327.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/08/LYNXMPEK070DO-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_pakistan-bomb-blast-kills-five-polio-vaccination-guard-police_1728740327.html", "title": "Pakistan bomb blast kills five cops on polio vaccination guard duty", "title_page": "Pakistan bomb blast kills five cops on polio vaccination guard duty | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PESHAWAR, Pakistan – A bomb blast in north-west Pakistan near the Afghan border killed five police officers on polio vaccination guard duty and wounded more than 20 on Jan 8, the latest in a series of attacks by Islamist militants ahead of the Feb 8 national elections.\nThe Pakistan Taliban, an umbrella group of militants also known as Tehreek-e-Taliban Pakistan (TTP), claimed responsibility in a statement sent to Reuters.\nThe blast hit a truck full of police officers on their way to guard a polio vaccination drive in the Bajur tribal district, police official Kashif Zulfikar said.\nIslamist militants in Pakistan often target polio vaccination teams, believing the immunisation effort is a Western tool to spy on them and make Muslims infertile.\nThe TTP has been waging a war against the state for years, seeking to overthrow the government and replace it with a harsh brand of Islamic rule.\nThe militants have ramped up their attacks since they revoked a ceasefire with the government last year.\nPolitical analysts have voiced concern, with some politicians calling for a delay in the elections in the north-west.\nA six-man suicide squad drove an explosive-laden truck into a military camp in north-west Pakistan in December 2023, killing at least 23 soldiers, the heaviest death toll in a single attack in years. REUTERS", "url": "https://www.straitstimes.com/asia/pakistan-bomb-blast-kills-five-polio-vaccination-guard-police"}