{"authors": ["Tan Dawn Wei"], "date_download": "2024-10-12 13:48:18", "date_modify": "2024-10-12 13:48:18", "date_publish": "2022-06-28 11:11:00", "description": "The new guidelines are the first update since May 2021, but the country is still closed to international tourists. Read more at straitstimes.com.", "filename": "asia_east-asia_beijing-and-shanghai-log-zero-covid-19-cases-after-four-months_1728740898.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/29/ac_ch-univeral_290622.jpg?VersionId=aAlNRf8MdOh6W.hOOm0Ts6xE5bsQ7NkK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_beijing-and-shanghai-log-zero-covid-19-cases-after-four-months_1728740898.html", "title": "China slashes Covid-19 quarantine for overseas arrivals in biggest shift so far", "title_page": "China slashes Covid-19 quarantine for overseas arrivals in biggest shift so far | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - In a major revision to its Covid-19 policy since the start of the pandemic, China has halved the number of days required in centralised quarantine for inbound travellers to a week.\nInstead of a mandatory 14 days in isolation at a designated hotel and another seven days of health monitoring at home, the number of days has been reduced to seven and three respectively.\nChina has shut its borders since March 2020 and severely restricted the number of international flights in a bid to keep out the virus as the pandemic spread across the globe.\nSince then, those allowed into the country such as returning Chinese nationals and foreigners with valid residence permits or visas have had to do mandatory isolation on arrival for up to 21 days, depending on individual local policies.\nChinese nationals are also not allowed to make “non-essential” travel overseas.\nThe National Health Commission did not say on Tuesday (June 28) when this policy change will take effect. Neither has it signalled when the country will reopen its borders. It is also unclear if local health authorities will implement this measure, especially if zero-Covid-19 continues to be its priority.\nThere have, however, been some easing of health protocols.\nA number of cities including Beijing have since April begun to pilot a reduced quarantine duration of 10 days, as health authorities acknowledge that the Omicron variant has a shorter incubation period.\nPre-departure testing for those travelling to China has also been relaxed in a few countries in recent weeks, while those applying for work or family visas from certain countries no longer require a government-issued letter of invitation. Both these changes benefit travellers from Singapore.\nBut getting a plane ticket remains a major challenge for travellers, as China still suspends airlines on inbound routes for bringing in infected passengers.\nBesides cutting quarantine time for international travellers, health authorities on Tuesday also eased their risk classification criteria, which would make it easier for people to travel within the country.\nClose contacts of those infected will also be allowed to now spend seven days isolating at home instead of at a centralised facility.\nBeijing and Shanghai had both reported no new cases on Monday for the first time since late February, after both cities battled their worst outbreaks since the beginning of the pandemic with lockdowns, school and business closures and city-wide testing.", "url": "https://www.straitstimes.com/asia/east-asia/beijing-and-shanghai-log-zero-covid-19-cases-after-four-months"}