{"authors": ["Nadirah H. Rodzi"], "date_download": "2024-10-12 14:05:21", "date_modify": "2024-10-12 14:05:21", "date_publish": "2023-02-22 18:15:00", "description": "Ex-Malaysian PM is seeking a review of the court decision that confirmed his conviction and 12 years’ jail sentence. Read more at straitstimes.com.", "filename": "asia_se-asia_najib-s-failure-to-adjourn-hearing-was-self-inflicted-not-breach-of-justice-prosecutor_1728741921.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/22/2021-09-19T053605Z1573369559RC29SP9E0HE6RTRMADP3MALAYSIA-POLITICS_1.JPG?VersionId=m1m_8P7nY.SiGcfr7UXuhAZPbvB_D8nx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_najib-s-failure-to-adjourn-hearing-was-self-inflicted-not-breach-of-justice-prosecutor_1728741921.html", "title": "Najib’s failure to adjourn hearing was self-inflicted, not breach of justice: Prosecutor", "title_page": "Najib’s failure to adjourn hearing was self-inflicted, not breach of justice: Prosecutor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PUTRAJAYA – Former Malaysian prime minister Najib Razak’s failed bid to adjourn his final appeal hearing against a 12-year jail sentence was “self-inflicted” and not a breach of natural justice, a prosecutor told the Federal Court on Wednesday.\nDeputy Public Prosecutor V. Sithambaram said Najib’s lawyers had at the hearing in Aug 2022 maintained a “blind confidence” that their application for additional evidence and adjournment would be allowed by the Federal Court, and were unprepared for legal argument when the appeal hearing proceeded instead.\n“There was no breach of natural justice by the refusal of adjournment as it is self-inflicted. There was no ‘Plan B’ in the event the court did not allow the adjournment. Najib’s then lead counsel Datuk Hisyam Teh Poh Teik and Zist treated the whole appeals complacently and expected that they would be entitled to an adjournment despite the clear instruction from the top court that the main appeal would proceed,” Datuk Sithambaram said, referring to law firm Messrs Zaid Ibrahim Suflan TH Liew & Partners (Zist).\nMr Sithambaram was making submissions at the hearing for Najib’s application to review the court decision that confirmed his conviction and 12 years’ jail sentence for misappropriating RM42 million (S$12.9 million) belonging to former 1Malaysia Development Berhad (1MDB) subsidiary SRC International, claiming that he was not given a fair hearing.\nThe prosecutor said that after the adjournment was refused, Najib’s defence team then filed an application to recuse Chief Justice Tengku Maimun Tuan Mat from the panel of judges hearing the appeal.\n“This was again nothing but another desperate attempt to scuttle the hearing of the appeals,” he added.\nIn August 2022, Mr Hisyam asked for a postponement of three to four months, as he had taken over Najib’s case only several weeks earlier.\nThe request was dismissed by a five-judge panel led by Chief Justice Maimun.\nMr Hisyam then refused to make any submission on Najib’s behalf.\nThe Federal Court subsequently upheld Najib’s conviction and sentence on Aug 23, 2022.\nMr Sithambaram said Mr Hisyam and Zist should not have accepted the case when hearing dates were already fixed, unless they were prepared to proceed with the appeal.\nHe added that Najib’s move to switch counsel midway was a strategic move to adjourn the appeal hearing.\n“Najib had four months to engage solicitors and prepare the case if he indeed wanted to change his existing solicitors and counsel. Discharging his long-time counsel Tan Sri Muhammad Shafee Abdullah from Messrs Shafee & Co was a strategic move to adjourn the appeal,” he said.\nNajib is also seeking a review of the court’s decision to dismiss his attempt to postpone his appeal hearing, as well as its decision not to recuse Tun Tengku Maimun from the Federal Court appeal due to Facebook posts made by her husband in May 2018.\nThe latter had allegedly demonstrated negative views of Najib’s leadership and had concluded that he had siphoned funds from 1MDB into his personal bank account.\nIn addition, Najib is attempting to nullify his hearing in the High Court on the basis of trial judge Mohd Nazlan Mohd Ghazali not recusing himself over an alleged conflict of interest.\nOn Jan 4, Najib petitioned the United Nations Human Rights Council’s Working Group on Arbitrary Detention to rule that the dismissal of his appeal by the Federal Court in August 2022 was unjust and flawed as he “was sent to jail without the opportunity to defend himself”.\nHis legal team had said that a failure to give a new set of lawyers more time to prepare – after being appointed three weeks before the appeal in the federal court – had unjustly punished Najib.\nThe hearing continues next Monday.", "url": "https://www.straitstimes.com/asia/se-asia/najib-s-failure-to-adjourn-hearing-was-self-inflicted-not-breach-of-justice-prosecutor"}