{"authors": [], "date_download": "2024-10-12 13:38:34", "date_modify": "2024-10-12 13:38:34", "date_publish": "2024-04-25 19:28:04", "description": "WASHINGTON - Lawyers for Ryan Corbett, an American held by the Taliban for nearly two years without charge, on Thursday sought U.N. help to secure his immediate release, contending that he has been tortured and is suffering physical and mental health problems. Read more at straitstimes.com.", "filename": "asia_lawyers-seek-un-help-for-release-of-american-held-by-the-taliban_1728740314.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/25/LYNXNPEK3O0J8-1.jpg?VersionId=YcClbcvhOw9aj5qVNdUM_xdzE7Rzk9Mk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_lawyers-seek-un-help-for-release-of-american-held-by-the-taliban_1728740314.html", "title": "Lawyers seek UN help for release of American held by the Taliban", "title_page": "Lawyers seek UN help for release of American held by the Taliban | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Lawyers for Ryan Corbett, an American held by the Taliban for nearly two years without charge, on Thursday sought U.N. help to secure his immediate release, contending that he has been tortured and is suffering physical and mental health problems.\nThe lawyers filed urgent petitions with the Geneva-based U.N. Special Rapporteur on Torture Alice Edwards and the U.N. Working Group on Arbitrary Detention arguing that Corbett's fundamental rights have been violated, justifying U.N. action on his case.\nThey urged Edwards to \"urgently reach out to the Taliban to secure Mr. Corbett's immediate release and freedom from torture\".\nTaliban administration spokesman Zabihullah Mujahid did not immediately respond to a request for comment. He had previously said on Afghan broadcaster Tolo News that several foreigners, including two Americans, were in Taliban custody and that anyone who visited Afghanistan must abide by its laws.\n\"There is no ambiguity here: Ryan's life is in danger,\" his wife, Anna Corbett, was quoted as saying in a statement issued by the lawyers announcing the petitions. \"There is still time for the Taliban to do the right thing and let Ryan go.\"\nThe State Department in October declared Ryan Corbett wrongfully detained and has raised his case with the Taliban.\nSuch designations elevates a case to the special presidential envoy for hostage affairs, currently Roger Carstens, to lead efforts to win the detainee's release.\nThe United States, however, has had no diplomatic presence in Kabul since it fell to the Taliban in August 2021 as U.S. troops pulled out after 20 years of war.\nThe Corbetts moved to Afghanistan in 2010. Ryan Corbett worked with non-governmental organizations and then started his own - Bloom Afghanistan - to bolster the country's private sector through consulting, micro-finance and project evaluation.\nThe couple and their three children left following the Taliban takeover, but he continued working with his organization. He went back in January 2022 to renew his business visa.\nDespite having a valid visa, he was arrested by the Taliban that August after he returned to pay and train his staff, his lawyers said. A German and two Afghans with whom Corbett was arrested have since been released.\nBut he has been held in a basement and tortured by being threatened with beatings, forced to listen to other prisoners being tortured and held in a bloodstained cell, said the petitions based on recently released detainees' testimonies.\nCorbett was seriously malnourished and had lost significant weight, suffered blackouts and other physical and mental health problems and had been denied adequate medical care, said the petitions.\nHe has been allowed five short calls with his family, including one resulting from a hunger strike, in which he did \"not appear to be speaking freely\", the petitions said.\nIf the petitions are taken up by the U.N. independent experts, they have a mandate to do their own investigations and release legal interpretations on the case. These are non-binding and cannot be enforced. REUTERS", "url": "https://www.straitstimes.com/asia/lawyers-seek-un-help-for-release-of-american-held-by-the-taliban"}