{"authors": [], "date_download": "2024-10-12 13:55:02", "date_modify": "2024-10-12 13:55:02", "date_publish": "2024-05-10 10:05:00", "description": "The dog escaped while at a convention 20km away from home. Read more at straitstimes.com.", "filename": "asia_east-asia_korean-dog-returns-home-41-days-after-going-missing_1728741302.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/10/jindo.PNG?VersionId=jMD3OQgXZRP8WhDNlANfWxbAhPisyA2N", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_korean-dog-returns-home-41-days-after-going-missing_1728741302.html", "title": "Korean dog finds its way home 41 days after going missing", "title_page": "Korean dog finds its way home 41 days after going missing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DAEJEON – A one-year-old Korean Jindo recently made headlines after the dog travelled a substantial distance to make it back home after going missing for 41 days.\nA South Korean YouTube channel on May 7 posted the story of the dog Hong-min, which lives in the city of Daejeon with his owner Yoon Jeong-sang. Mr Yoon, an avid soccer fan and owner of 10 Jindos, named the dog after soccer superstar Son Heung-min, mistaking the footballer’s name for Son Hong-min.\nThe one-year-old dog went missing on March 24, when Mr Yoon took him to a dog convention held in Moksang-dong in Daejeon. The then 11-month-old dog, scared by the sounds from the loudspeaker and the other dogs barking, ran off.\nMr Yoon was unable to find him despite contacting local animal shelters and district offices. Hopes were not high for the dog to return home on his own, as the convention was held more than 20km away from their home and the area was completely new to the young dog.\nOn May 3, Mr Yoon was alerted by the dogs barking at the junkyard he runs. He saw brown fur that reminded him of Hong-min and called out: “Hong-min, is that you?”\nHe approached the animal, which was wagging its tail, and found that it was indeed his young dog that had gone missing.\nDespite wandering the streets for over a month, the dog did not lose much weight or suffer major injuries, according to Mr Yoon. The only medical care he needed was for the ticks he attracted while in the wilderness.\nMr Yoon said that Hong-min spent a few days back home lying down, but has since fully recovered and is eating and playing well.\nThe owner noted that the dog had been particularly smart and gentle from a very young age, and that he picked up on basic commands like “sit” or “get up” unusually quickly.", "url": "https://www.straitstimes.com/asia/east-asia/korean-dog-returns-home-41-days-after-going-missing"}