{"authors": [], "date_download": "2024-10-12 13:47:33", "date_modify": "2024-10-12 13:47:33", "date_publish": "2022-06-18 08:57:48", "description": "Core factors include continued mask-wearing, extensive vaccination and an already healthy population. Read more at straitstimes.com.", "filename": "asia_east-asia_how-japan-achieved-one-of-the-worlds-lowest-covid-19-death-rates_1728740853.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/18/afjapan180622.jpg?VersionId=Qtgq0RSy3VgqHJfQDHJDlClviCfZNom4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_how-japan-achieved-one-of-the-worlds-lowest-covid-19-death-rates_1728740853.html", "title": "How Japan achieved one of the world's lowest Covid-19 death rates", "title_page": "How Japan achieved one of the world's lowest Covid-19 death rates | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO (BLOOMBERG) - Japan's Covid-19 death rate is the lowest among the world's wealthiest nations, with health experts pointing to continued mask-wearing, extensive vaccination and an already healthy population as the core factors behind its success.\nThe population has continued to adhere to basic infection control measures, including avoiding crowds and poorly ventilated venues, as other parts of the world grapple with pandemic fatigue. Japan's measures have also been bolstered by a robust vaccination programme and free medical care.\nBut what truly sets it apart from many places, particularly Asian neighbours like China, is that it has managed to limit deaths without mandates and with few restrictions. The Constitution prevents imposing lockdowns backed by police actions, meaning that even during a state of emergency, the government puts the onus on businesses and individuals to change their behaviour.\nThis soft approach has had remarkable results. Japan's Covid-19 deaths per capita is 246 per million people, the lowest out of the 38 members of the Organisation for Economic Cooperation and Development (OECD), according to Our World in Data.\nIt is all the more significant given that Japan has the highest proportion of elderly people - typically some of the most vulnerable to coronavirus - in the world. New Zealand's rate, previously the lowest, sits at 257 per million after the country faced its first substantial virus wave upon opening up and lifting curbs.\nTo be sure, capturing an accurate picture is difficult as reporting standards differ country by country. The World Health Organisation has said Japan's excess deaths declined in 2020 and 2021, while a study published in Lancet in March said excess mortality in the country was six times higher than reported coronavirus fatalities during 2020 to 2021. There were around 9,000 fewer deaths in 2020 than in 2019, although that rebounded last year, government figures show.\nWhile every nation has its own standard for identifying Covid-19 deaths and different testing policies that can make comparisons difficult, Japan's low rate of fatalities shows its strategy works, said Dr Norio Ohmagari, head of the disease control and prevention centre at the National Centre for Global Health and Medicine, and an adviser to the Tokyo government.\nJapan's measures may hold lessons for how other countries can deal with the current or future pandemics. Here is what experts say the country got right:\nSocial compliance\nJapan's virus-fighting strategy relied on the population complying willingly with social distancing guidance, particularly when cases were rising. This proved more effective than top-down measures in other places, which in some cases made people resistant and defiant.\n\"People are using their own judgment to avoid risk and modify their behaviour and this plays an extremely important role,\" said Dr Ohmagari.\nThis includes wearing masks, which was embraced during the early days of the pandemic and remains almost universal even as the government relaxed its recommendation to wear one outdoors. Mask use in Japan has typically held above 90 per cent, a threshold other Group of Seven (G-7) countries have only occasionally neared, according to Institute for Health Metrics and Evaluation data.\nThe government's \"Three Cs\" slogan - which touts avoiding closed spaces, crowded places and close contact situations - has also reinforced how it wants the population to act.\nIn addition, buildings to taxis have undertaken efforts to improve ventilation, including the use of carbon dioxide monitors to show that indoor air is being exchanged.\nThe relatively light nature of restrictions also meant that Japan did not face the extensive disruption to daily life of a harsh lockdown, deployed in countries from Italy to China and New Zealand at various times. This might have helped people comply with restrictions for longer and saw the nation avert the kind of social unrest seen overseas.\nEven as other populations have rushed back to life as normal, Japanese people appear to remain cautious. Activities in Tokyo's night-time entertainment district are still down almost 40 per cent from 2019, according to one estimate.\nVaccination\nBefore the pandemic, Japanese people had one of the lowest rates of vaccine confidence globally. But they are now among the best-protected populations in the G-7, swiftly catching up to countries like the United States that had started their inoculation programmes months earlier, and doing it without a mandate.\nExperts have pointed to the initial slow roll-out of vaccinations and an early shortage as creating a sense of urgency, especially among the elderly, while the act of inoculation was not politicised like it was in the US.\nAbout 93 per cent of Japanese aged 65 and older have had two shots, and 90 per cent have had a booster, according to data from the Prime Minister's Office. That compares with 81 per cent of the total population having had two doses, and 61 per cent receiving a third.\nIn the US, 94 per cent of people aged 65 to 74 are fully vaccinated and 88 per cent of the population aged 75 and above have received two shots.\n\"Thanks to the protection Japanese people gained through vaccination and natural infection, I don't expect Japan's hospitalisation or deaths to increase dramatically any time soon,\" said Dr Kenji Shibuya, an epidemiologist at the Tokyo Foundation for Policy Research.", "url": "https://www.straitstimes.com/asia/east-asia/how-japan-achieved-one-of-the-worlds-lowest-covid-19-death-rates"}