{"authors": [], "date_download": "2024-10-12 13:48:17", "date_modify": "2024-10-12 13:48:17", "date_publish": "2022-07-05 11:37:06", "description": "HK leader John Lee said he asked the health secretary to look into it but did not give details.   Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-considers-shorter-covid-19-quarantine-for-travellers_1728740897.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/05/ac_hhkarrivals_050722.jpg?VersionId=0mzqw7Shw9qRiFCayeoQ2FEjEpVfeVn9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-considers-shorter-covid-19-quarantine-for-travellers_1728740897.html", "title": "Hong Kong considers shorter Covid-19 quarantine for travellers", "title_page": "Hong Kong considers shorter Covid-19 quarantine for travellers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (REUTERS) - Hong Kong will look into shortening Covid-19 quarantine requirements for travellers, while still aiming to curb the spread of the virus and prevent hospitals from being overwhelmed, the city's new leader John Lee said on Tuesday (July 5).\nMr Lee spoke at his first weekly news conference as the city's chief executive after being sworn in on Friday by China's President Xi Jinping following celebrations marking 25 years since the former British colony's return to Chinese rule.\nChina is alone among major countries to pursue a Zero Covid strategy that aims to stamp out all outbreaks at just about any cost.\n\"I am conscious of the need for Hong Kong to remain open and convenient to travellers, but it is also important that we address the risks at the same time,\" Mr Lee told reporters.\nHe added he had instructed Health Secretary Lo Chung-mau to look into shortening mandatory quarantine for travellers, but did not give further details.\n\"I'm giving him time to look at the statistics so that he will formulate some options that we may consider,\" Mr Lee said.\nHong Kong, which has some of the most stringent travel restrictions in the world outside mainland China has reported daily case tolls of around 2,000 infections in the past week, without tightening rules.\nSuch numbers would lead to very stringent curbs on daily activities in any mainland city.\nThe city still imposes a seven-day hotel quarantine on arrival, at the traveller's own cost, and demands a raft of forms and strict testing requirements from passengers boarding flights to Hong Kong.\nAirlines face suspensions if they bring in too many passengers who test positive after landing, leading to cancelled flights and people struggling to re-book trips and hotels, ending up stranded, in some cases for months, outside the city.\nDr Lo said on Monday he hoped the border with Shenzhen would reopen before Aug 4.\nThe Asian financial hub, which faced a large wave of Covid-19 infections this year, has officially reported more than 1 million cases and more than 9,000 deaths - one of the highest fatality rates in the world since the start of the pandemic.\nSome epidemiologists estimate more than 4 million people in the city of 7.4 million may have been infected.\nHealth officials have said the city's hospitals are not under any significant pressure as Covid-19 cases rise again.", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-considers-shorter-covid-19-quarantine-for-travellers"}