{"authors": ["Walter Sim"], "date_download": "2024-10-12 13:51:08", "date_modify": "2024-10-12 13:51:08", "date_publish": "2022-09-26 19:19:10", "description": "Pre-departure tests waived for those jabbed thrice with these or other WHO-approved vaccines Read more at straitstimes.com.", "filename": "asia_east-asia_japan-to-accept-china-made-vaccines-as-it-opens-to-visa-free-travel-from-oct-11_1728741068.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/26/sv_jpntravel_260922.jpg?VersionId=ymBk7rInp1jrynR5HtuOfuHveOz8GCn5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-to-accept-china-made-vaccines-as-it-opens-to-visa-free-travel-from-oct-11_1728741068.html", "title": "Japan to recognise China-made jabs when visa-free travel restarts on Oct 11", "title_page": "Japan to recognise China-made jabs when visa-free travel restarts on Oct 11 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - From Oct 11, Japan will waive the need for pre-departure Covid-19 tests for those who have received three shots of China-made vaccines, as it reopens to visa-free travel.\nThis marks a key change from the current regime that recognises all Covid-19 vaccines on the World Health Organisation's emergency use list except China-made Sinopharm, Sinovac and Convidecia.\n\"On and after Oct 11, so long as a visitor has been vaccinated three times with any of the World Health Organisation (WHO) approved vaccines - including China-made vaccines - they will be able to enter Japan without having to submit or produce a negative test,\" a government official told a background briefing on Monday in response to a question from The Straits Times.\nVisitors who have not had three doses must still produce a negative pre-departure polymerase chain reaction (PCR) test taken within 72 hours of the flight.\nOn-arrival PCR tests will only be conducted for those who are picked up by border quarantine stations as exhibiting Covid-19 symptoms, such as fever.\nThese changes are part of the relaxed Covid-19 measures that will take place from Oct 11.\nPrime Minister Fumio Kishida said last week that Japan will resume visa-free travel, allow individual tourists and lift its daily entry cap from that day in the country's most decisive step yet in reopening its borders.\nVisa-free entry will resume for short-stay visitors from all 68 countries and regions with which Japan has had such exemption arrangements before the pandemic.\nAll arrivals are highly recommended to install the MySOS application, through which they can pre-register either their vaccination certificate or PCR test result. Submissions are allowed within two weeks of the scheduled entry date, up until six hours before their flight is scheduled to land.\nDoing so will facilitate fast-track entry, allowing visitors to \"avoid the quite cumbersome procedures at the airport of producing their certificates\", the government official said, adding that this would result in \"needless time spent at the airport\".\nVisitors will be expected to follow the same Covid-19 guidelines as ordinary Japanese people - including recommended mask-wearing - officials said.\nBut they added that there was \"no strong legal basis\" for hotels and restaurants to refuse service to any guests who do not comply.", "url": "https://www.straitstimes.com/asia/east-asia/japan-to-accept-china-made-vaccines-as-it-opens-to-visa-free-travel-from-oct-11"}