{"authors": [], "date_download": "2024-10-12 14:15:35", "date_modify": "2024-10-12 14:15:35", "date_publish": "2024-06-19 19:05:46", "description": "NEW DELHI - A delegation of U.S. lawmakers met the exiled Tibetan spiritual leader the Dalai Lama on Wednesday in India's northern town of Dharamsala. Read more at straitstimes.com.", "filename": "asia_explainer-why-has-a-visit-by-us-lawmakers-to-india-upset-china_1728742535.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/19/LYNXMPEK5I0BC-1.jpg?VersionId=sYhEb7KK1lyGCB9SNI88_ZNJaoK48OrI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_explainer-why-has-a-visit-by-us-lawmakers-to-india-upset-china_1728742535.html", "title": "Explainer: Why has a visit by US lawmakers to India upset China?", "title_page": "Explainer: Why has a visit by US lawmakers to India upset China? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI - A delegation of U.S. lawmakers met the exiled Tibetan spiritual leader the Dalai Lama on Wednesday in India's northern town of Dharamsala.\nThe meeting annoyed Beijing, which urged the United States on Tuesday to \"fully recognise the anti-China and separatist nature of the Dalai clique\" and refrain from \"any form of contact with it\".\nWHY IS THE DELEGATION IN INDIA?\nThe bipartisan seven-member group of American lawmakers is visiting India to meet the Nobel peace laureate, the Dalai Lama.\nThe United States has long supported the rights of the Tibetan people to practice their religion and culture, and has accused China of human rights violations in the remote Himalayan region that borders India.\nA bipartisan bill passed this month by the U.S. House of Representatives aims seeks to push Beijing to hold talks with Tibetan leaders, stalled since 2010, to secure a negotiated agreement on Tibet and spur China to tackle Tibetan aspirations on historical, cultural, religious and linguistic identity.\nAmong the delegation are the two authors of the act, titled 'Promoting a Resolution to the Tibet-China Dispute Act' or the Resolve Tibet Act, along with Nancy Pelosi, the former speaker of the U.S. House of Representatives.\nThe delegation also met officials of Tibet’s government in exile, which functions from India.\nWHO IS THE DALAI LAMA?\nBorn in 1935 as Lhamo Thondup, the Dalai Lama was identified as the reincarnation of his predecessor at the age of two, and enthroned in 1940 as the 14th Dalai Lama in Lhasa, the Tibetan capital.\nBeijing invaded Tibet in 1950, and the Dalai Lama fled to India in 1959 after a failed uprising against its rule, since when he has lived in exile in the Himalayan town of Dharamsala.\nHe was awarded the Nobel Peace Prize in 1989.\nWHY IS THE VISIT CONTROVERSIAL?\nIt has riled China at a time when Beijing and Washington are struggling to improve ties, and India's relations with China have also been strained since a military standoff on their Himalayan frontier killed 24 soldiers in 2020.\nU.S. President Joe Biden is expected to sign the Resolve Tibet Act soon, in a bid to find a resolution for the dispute, although Washington considers the Tibetan Autonomous Region to be a part of China.\n\"This visit should highlight the bipartisan support in the U.S. Congress for Tibet to have a say in their own future,\" the chief of the U.S. delegation, and one author of the bill, Michael McCaul, said ahead of his departure from Washington on Friday.\nWHAT ARE CHINA'S OBJECTIONS?\nChina accuses the Dalai Lama of being a \"splittist\" or a separatist, but he says he wants genuine autonomy for his remote Himalayan homeland.\nWhile Beijing has always objected to his meetings with foreign leaders, this has not prevented the Dalai Lama from meeting them, including U.S. presidents, although Biden has not met him yet.\nHowever, the most contentious issue is the task of appointing his successor.\nWhile Beijing has said it has the right to approve a successor, in a move set to strengthen its control over Tibet, the Dalai Lama says only the Tibetan people can make that call, and his successor could be found in India. REUTERS", "url": "https://www.straitstimes.com/asia/explainer-why-has-a-visit-by-us-lawmakers-to-india-upset-china"}