{"authors": [], "date_download": "2024-10-12 13:50:36", "date_modify": "2024-10-12 13:50:36", "date_publish": "2024-05-05 12:58:00", "description": "The thickness of fat in samgyeopsal has been long debated, even prompting government intervention in 2024. Read more at straitstimes.com.", "filename": "asia_east-asia_debate-rages-over-overly-fatty-pork-belly-cuts-popular-in-kbbq_1728741036.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/05/meat-1052571150.jpg?VersionId=GLCg4fukwcTlv8Z_79iMEonDuJhhtfFG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_debate-rages-over-overly-fatty-pork-belly-cuts-popular-in-kbbq_1728741036.html", "title": "Debate sizzles over ‘overly fatty’ pork belly cuts served in South Korea barbecue eateries", "title_page": "Debate sizzles over ‘overly fatty’ pork belly cuts served in South Korea barbecue eateries | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – Samgyeopsal, the pork belly cut popular in Korean barbecue restaurants, has become a sizzling issue for some diners who complain that they are being served with excessively fatty slices.\nIn online forums in South Korea, a heated debate is under way over the fat content, as people share their dining-out experiences.\nThe debate was sparked off by a post on website Bobaedream.\nAn anonymous user posted photos of sizzling Jeju black pig samgyeopsal at a Jeju Island restaurant. The person claimed that the cuts had a “98 per cent fat content” and that the bill came up to around 150,000 won (S$149) for two servings of the meat and one bottle each of soju and beer.\nThe post mentioned that the eatery is well-known and has drawn visits from celebrities.\nAs the post gained traction, attracting both public and media interest, the restaurant owner issued an apology, adding that it would offer a complimentary serving of 200g of ogyeopsal, a five-layered cut, to diners for one month.\nHowever, the dispute over the level of fat in samgyeopsal has not gone away. On the same website on May 1, another user posted a photo of fat-laden samgyeopsal which was supposedly provided at a restaurant in Daegu. The staff allegedly said the meat was a “delicious cut”.\nAs at the morning of May 3, the post had amassed around 110,000 views, with the most-liked comment stating “as someone who runs a butcher shop, that cut leaves me speechless”.\nThe controversy prompted a response from Governor Oh Young-hun of the island province of Jeju, renowned for its black pork cuts.\nAt a press conference on May 2, he spoke of a review to assess a necessity for stricter management of the livestock sector. He confirmed that the authorities had initiated inspections of restaurant management practices.\nHowever, recognising the difficulties in regulating private businesses, Mr Oh also called for consideration of “differences among local food cultures”.\nThe thickness of fat in samgyeopsal has been a long-debated topic, even prompting government intervention in 2024.\nIn response to unhappiness over excessively fatty pork cuts sold as part of the “Samgyeopsal Day” promotions in March 2023, the Ministry of Agriculture, Food and Rural Affairs established new guidelines in January 2024 for businesses in the livestock industry and store chains, limiting fat in regular pork belly cuts to less than 1cm thick. THE KOREA HERALD/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/debate-rages-over-overly-fatty-pork-belly-cuts-popular-in-kbbq"}