{"authors": [], "date_download": "2024-10-12 13:38:38", "date_modify": "2024-10-12 13:38:38", "date_publish": "2024-06-16 10:40:00", "description": "The permission would likely be part of revisions to Japan’s national energy strategy. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-to-consider-allowing-nuclear-plant-expansions_1728740318.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/16/FILES-JAPAN-NUCLEAR-ENERGY-FUKUSHIMA-041343.jpg?VersionId=qQjPzqnZ6_sMsbmR4e.X3M33jwWOYDpC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-to-consider-allowing-nuclear-plant-expansions_1728740318.html", "title": "Japan to consider allowing nuclear plant expansions", "title_page": "Japan to consider allowing nuclear plant expansions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan’s Economy Ministry is considering allowing the expansion of nuclear plants as older ones are being decommissioned, according to the Asahi newspaper.\nThe permission would likely be part of revisions to Japan’s national energy strategy, which is reviewed every three years, the paper reported, without saying where it got the information.\nThe revision is expected to include a provision allowing power companies that are decommissioning nuclear plants to build new reactors at existing nuclear power plants, according to the Asahi.\nThe revised energy strategy is expected to frame the change as “replacing” nuclear plants, and the number of plants will not increase, according to the report.\nNuclear plants are still a politically sensitive issue in Japan after the 2011 Fukushima nuclear disaster.\nThe current version of the national energy strategy says that Japan will reduce dependency on nuclear as much as possible.\nJapan has pledged to cut greenhouse gas emissions by 46 per cent by 2030 and become carbon-neutral by the middle of this century. BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/japan-to-consider-allowing-nuclear-plant-expansions"}