{"authors": [], "date_download": "2024-10-12 13:45:25", "date_modify": "2024-10-12 13:45:25", "date_publish": "2024-09-28 14:04:29", "description": "The typhoon saw 299 people killed and 34 others missing. Read more at straitstimes.com.", "filename": "asia_vietnam-estimates-damages-of-331-billion-from-typhoon-yagi_1728740725.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/28/LYNXMPEK8R01B-1.jpg?VersionId=8ytMqj0A_w06bB0Eqz9zsyDxFMlPVpT3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_vietnam-estimates-damages-of-331-billion-from-typhoon-yagi_1728740725.html", "title": "Vietnam estimates damages of $4.2 billion from Typhoon Yagi", "title_page": "Vietnam estimates damages of $4.2 billion from Typhoon Yagi | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANOI – Asia’s strongest storm in 2024, Typhoon Yagi, caused damage estimated at 81.5 trillion dong (S$4.2 billion) across northern Vietnam, or twice as much as previous estimates, the state media said on Sept 28.\nThe typhoon, which killed 299 with 34 missing, devastated export-oriented industrial hubs, destroying factories and facilities, besides flooding farmland, damaging homes and tearing up a bridge.\n“The total economic damage is initially estimated at over 81.5 trillion dong, with most damage triggered by landslides and flash floods,” the state-run Vietnam News Agency quoted Agriculture Minister Le Minh Hoan as saying.\nThe figure exceeds a preliminary estimate of US$1.6 billion (S$2.1 billion) made in September by the Planning Ministry that threatened to chip 0.15 percentage point from a forecast for economic growth of 6.8 per cent to 7 per cent in 2024.\nMr Hoan urged the authorities to help people resume production while ensuring supplies and holding down prices, as farm and agricultural land were among the areas hit hardest.\nLive pig prices in Vietnam have risen steadily since Typhoon Yagi and subsequent flooding affected several pig farms, Reuters has reported.\nOn Sept 26, rating agency S&P Global said Vietnamese banks’ profitability would be hit because of typhoon debt relief measures ordered by the central bank. REUTERS", "url": "https://www.straitstimes.com/asia/vietnam-estimates-damages-of-331-billion-from-typhoon-yagi"}