{"authors": [], "date_download": "2024-10-12 13:59:29", "date_modify": "2024-10-12 13:59:29", "date_publish": "2022-12-28 15:47:20", "description": "Daniel Duggan is accused of breaking US arms control laws by training Chinese military pilots to land on aircraft carrier. Read more at straitstimes.com.", "filename": "asia_australianz_australia-grants-extradition-of-former-us-pilot-over-china-military-training_1728741569.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/28/dw-miralis-duggan-221228_1.JPG?VersionId=Mo1bsfHds4alPl8cRz5MfT52P6ngc8nw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australia-grants-extradition-of-former-us-pilot-over-china-military-training_1728741569.html", "title": "Australia grants extradition of former US pilot over China military training", "title_page": "Australia grants extradition of former US pilot over China military training | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Australia has approved a request to extradite former US Marine Corps pilot Daniel Duggan to the United States, where he will face charges that he trained Chinese military pilots, according to an Australian Broadcasting Corporation report on Wednesday.\nDuggan, who was arrested in Australia in October and remains in custody, is accused of breaking US arms control laws by training Chinese military pilots to land on aircraft carriers, according to a 2017 indictment unsealed by a US court in December.\nThe broadcaster said the matter would go before a magistrate in January, although Duggan has avenues to appeal.\nAttorney-General Mark Dreyfus, his office, and Duggan’s lawyer Dennis Miralis were not immediately available for comment.\nMr Miralis has said Duggan was an Australian citizen who renounced his US citizenship and denies breaking any law.\nThe 2017 indictment says that “Duggan provided military training to PRC (People’s Republic of China) pilots” through a South African flight school on three occasions in 2010 and 2012, while he was a US citizen.\nThe violations he is accused of also include providing aviation services in China, evaluating Chinese military pilot trainees, and instruction in landing on aircraft carriers.\nHe faces four US charges, including conspiracy to export defence services to China, conspiracy to launder money, and violating the Arms Export Control Act. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/australia-grants-extradition-of-former-us-pilot-over-china-military-training"}