{"authors": [], "date_download": "2024-10-12 13:51:27", "date_modify": "2024-10-12 13:51:27", "date_publish": "2024-06-04 15:43:00", "description": "Johor’s Chief Minister has asked for special tax incentives for firms that invest in the SEZ. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-govt-to-consider-tax-incentives-for-halal-industry-investments-in-johor-s-pore-sez_1728741087.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/04/Screenshot202024-06-0420152545.png?VersionId=_XoWSJqfq8yLJYBo3SVTEkb1Aoe0wbnX&h=f14de6bf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-govt-to-consider-tax-incentives-for-halal-industry-investments-in-johor-s-pore-sez_1728741087.html", "title": "Malaysia will consider tax incentives for halal industry investments in Johor-Singapore SEZ", "title_page": "Malaysia will consider tax incentives for halal industry investments in Johor-Singapore SEZ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JOHOR BAHRU - The Malaysian government will discuss tax incentives for businesses investing in the halal industry within the Johor-Singapore Special Economic Zone (JS-SEZ), Deputy Prime Minister Zahid Hamidi has said.\nHe added that he would raise the matter with Prime Minister Anwar Ibrahim during the Cabinet meeting on June 5.\n“The Johor Menteri Besar has requested a tax holiday. I will whisper this to the PM, for the matter to be given due reconsideration.\n“I will try to follow through... he may consider including (the tax holiday) as one of the incentives given to halal industry players in his Budget 2025 speech in October,” he said after launching the Halal on Track programme at the Persada Johor International Convention Centre on June 4.\nAt the event, Datuk Seri Zahid also emphasised the potential of the halal market, urging local entrepreneurs to seize the opportunity to introduce more halal-certified products, and not just in the food and beverage category.\nIn his welcome address earlier, Johor’s Chief Minister Onn Hafiz Ghazi asked for special tax incentives for firms that invest in the JS-SEZ as well as the improvement of infrastructure such as roads.\nThe prime ministers of both countries have agreed to finalise the full-fledged JS-SEZ agreement during the Singapore-Malaysia Leaders’ Retreat later in 2024.\nA memorandum of understanding was inked in January to jointly develop the special economic zone. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-govt-to-consider-tax-incentives-for-halal-industry-investments-in-johor-s-pore-sez"}