{"authors": ["Shefali Rekhi"], "date_download": "2024-10-12 13:57:54", "date_modify": "2024-10-12 13:57:54", "date_publish": "2024-07-13 16:00:00", "description": "His Singapore stop is scheduled to include visits to St Theresa’s Home and Catholic Junior College. Read more at straitstimes.com.", "filename": "asia_se-asia_pope-francis-will-promote-intercultural-interreligious-dialogue-on-asia-trip-vatican-official-says_1728741474.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/13/POPE1207a.JPG?VersionId=.BYSyjYfZwSn24jCeO6pmmlDceG3BRix", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_pope-francis-will-promote-intercultural-interreligious-dialogue-on-asia-trip-vatican-official-says_1728741474.html", "title": "Pope Francis will promote intercultural, inter-religious dialogue on Asia trip, Vatican official says", "title_page": "Pope Francis will promote intercultural, inter-religious dialogue on Asia trip, Vatican official says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Pope Francis has long wanted to visit Asia and will be seeking to promote intercultural and inter-religious dialogue during his upcoming visit, said Bishop Paul Desmond Tighe, one of the key officials overseeing cultural affairs at the Vatican.\nPope Francis is scheduled to visit Indonesia, Papua New Guinea, Timor-Leste and Singapore from Sept 2 to 13.\nHe is due to meet heads of state, groups of young people, local Catholic clergy, missionaries and parishioners while presiding over four public masses in stadiums in Jakarta, Port Moresby, Dili and Singapore, according to a provisional schedule of his trip published by the Vatican.\n“I think he’s always had this fascination with Asia, and (been) wanting to spend time there. It’s a gesture of support for (the) local church and a gesture of support for local countries and to learn from (them),” added Bishop Tighe.\nThe secretary of the Section for Culture at the Vatican’s Dicastery for Culture and Education was speaking to The Straits Times on the sidelines of a World Economic Forum meeting in Dalian, China, on June 25.\nIn Jakarta, Pope Francis is due to have an interfaith meeting at the Istiqlal Mosque and meet the president of the world’s most populous Muslim-majority country. More than 3 per cent of Indonesia’s nearly 280 million people are Catholic.\n“He’s also interested in the future of the Church. Sometimes (when) we think of the church and our model of the church, we think of a Western model,” Bishop Tighe said.\nBut Christianity has been thriving in smaller communities in Asia and “it is a modelling of a certain way of being Christian (that) is also attentive to other cultures”, he added.\nThe pontiff’s trip will be his first abroad since a two-day visit to Marseille in France in September 2023, and will be the longest that he has ever been away from Rome in his 11-year papacy. Pope Francis turns 88 in December 2024.\nHis fragile health has forced him to skip several engagements, including a trip to the UN Climate Change Conference COP28 in Dubai in November 2023. He has sometimes been seen publicly in recent years on a wheelchair or using a cane.\n“It is an ambitious trip for a man of his age. But it is symbolically important for him,” Bishop Tighe said.\n“The Pope often has a sense that many people come to Rome to see him,” he added. “But he likes to show respect for their cultures and tradition by also visiting and seeing different parts of the world.”\nPope Francis will be in Indonesia from Sept 3 to 6, Papua New Guinea from Sept 6 to 9, and Timor-Leste from Sept 9 to 11.\nHis Singapore trip from Sept 11 to 13 is scheduled to include visits to St Theresa’s Home and Catholic Junior College.\nPope Francis has visited several countries in Asia in previous years. These include South Korea in 2014, followed by Sri Lanka and the Philippines in 2015.\nTwo years later, he travelled to Myanmar and Bangladesh, and in 2019, he went to Thailand and Japan. Kazakhstan figured in his itinerary in 2022, and Mongolia in 2023.", "url": "https://www.straitstimes.com/asia/se-asia/pope-francis-will-promote-intercultural-interreligious-dialogue-on-asia-trip-vatican-official-says"}