{"authors": [], "date_download": "2024-10-12 14:02:52", "date_modify": "2024-10-12 14:02:52", "date_publish": "2023-05-19 19:12:00", "description": "A Pacific Islands leader has called on the US and China to not bring adversarial competition to the region. Read more at straitstimes.com.", "filename": "asia_pacific-isles-fear-becoming-theatre-for-us-china-rivalry_1728741772.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/19/JAPAN-G7-SUMMIT-043558_0.jpg?VersionId=qWYjJkOjm7LXkeW3IfHVAfLydx8ER6o0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_pacific-isles-fear-becoming-theatre-for-us-china-rivalry_1728741772.html", "title": "Pacific isles fear becoming theatre for US-China rivalry", "title_page": "Pacific isles fear becoming theatre for US-China rivalry | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HIROSHIMA - A Pacific Islands leader on Friday called on the United States and China to not bring “adversarial competition” to the region, as the rival powers intensify their bids for influence.\nCook Islands Prime Minister Mark Brown – invited to represent the region at a Group of Seven summit in Hiroshima – told reporters that increased superpower interest in the Pacific was welcome, but could not come at any cost.\nIn recent years, China has dramatically ramped up its economic, political and military footprint in the strategic ocean region.\nBeijing has snapped up mines and ports across the Pacific and inked a secretive security pact with the Solomon Islands that allows China to deploy troops to the country.\nThe United States fears that a Chinese military foothold in the South Pacific could outflank its facilities on Guam, and make defence of Taiwan more complicated.\nThe self-ruled, democratic island lives under constant threat of an invasion by China, which claims Taiwan as part of its territory to be seized one day – by force if necessary.\nUS President Joe Biden has said the US would defend the island in the event of a Chinese invasion.\nWashington has opened or reopened a string of Pacific Island embassies and deployed a steady stream of envoys to court island leaders.\n“We welcome that engagement into the region,” said Mr Brown, who currently chairs the Pacific Islands Forum, a regionwide bloc.\nHe hailed a White House summit between Mr Biden and Pacific Islands leaders last year, but added: “What we don’t want to see is our region being an area of adversarial competition by our development partners. We want our region to be an area of collaboration.”\n“I think it’s important to understand that what our development partners may see as areas of national security, are not necessarily what we see as national security priorities,” he said.\n“For us, national security priorities are economic security, they are climate security.”\nMany Pacific island nations are debt-burdened, low-lying, vulnerable to rising sea levels and exposed to ever-stronger storms, droughts and floods fuelled by climate change.\nMr Brown said he would call on leaders of G-7 wealthy democracies to help combat urgent climate challenges.\n“The Pacific island countries are at the forefront of the impacts of climate change, a large proportion of it caused by the G-7 countries.”\nMr Brown said a reduction in carbon emissions was a worthy long-term goal, but that there are more pressing needs.\n“For us in the Pacific, we’re already facing those climate impacts now. So the focus for us is on adaptation measures and financing for adaption.”\n“We need to find a way to come up with financing solutions that fit the Pacific’s needs and priorities,” he told AFP.\n“We’ve all got a common enemy that we have to fight and that’s climate. For every dollar we put into other areas, we’re losing out on an ability to combat the impacts of climate change.”\nMr Brown added that Pacific Islands leaders were disappointed that Biden cancelled a meeting with them in Papua New Guinea next week, but that it was “understandable” due to a US domestic budget dispute. AFP", "url": "https://www.straitstimes.com/asia/pacific-isles-fear-becoming-theatre-for-us-china-rivalry"}