{"authors": [], "date_download": "2024-10-12 13:49:58", "date_modify": "2024-10-12 13:49:58", "date_publish": "2024-08-30 11:15:00", "description": "It was not the first time the President delayed his relocation to the future capital. Read more at straitstimes.com.", "filename": "asia_se-asia_indonesia-president-delays-relocation-to-nusantara-once-again-until-airport-ready_1728740998.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/30/2024-08-21T135806Z1799710683RC20H9A8N5RQRTRMADP3INDONESIA-POLITICS-PRESIDENT.JPG?VersionId=g53w2AADA4DEuzszbRU6cnQA2WiObu7C", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_indonesia-president-delays-relocation-to-nusantara-once-again-until-airport-ready_1728740998.html", "title": "Indonesia’s Jokowi delays relocation to Nusantara once again ‘until airport ready’", "title_page": "Indonesia’s Jokowi delays relocation to Nusantara once again ‘until airport ready’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – President Joko Widodo of Indonesia has, once again, postponed his planned relocation to Nusantara in East Kalimantan, saying that he will wait for the future capital’s airport to be up and running first.\n“(We) have to look at the conditions in the field because there are still many things that have not been completed, such as the airport,” Mr Widodo, popularly known as Jokowi, told the press on the sidelines of his visit to Yogyakarta on Aug 28.\nThe outgoing President went on to say that once he takes up office in Nusantara, he will need an airport nearby to ensure ease of mobility to various provinces in the country.\n“(Once I relocate), if I want to go to Papua, it should be (from the airport) in Nusantara. If I want to go to East Nusa Tenggara, it should be from Nusantara, and if I want to go to Aceh, it should also be from Nusantara,” he explained.\nThis was not the first time the President delayed his relocation to the future capital. He was initially scheduled to start working in Nusantara in July, but the plan was postponed as key infrastructure for water supply and electricity failed to meet the July deadline.\nLater that month, however, Mr Jokowi spent his first few nights at Nusantara’s presidential palace, as his administration raced to complete preparations for the country’s first-ever Independence Day celebration in the future capital, which also marked its unveiling on the global stage.\nThe celebration on Aug 17 was attended by about 1,300 official guests, including Cabinet members.\nMr Jokowi led the flag-hoisting ceremony that day along with his successor, President-elect Prabowo Subianto, who has promised to continue the tradition of holding future Independence Day celebrations in Nusantara. THE JAKARTA POST/ ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/indonesia-president-delays-relocation-to-nusantara-once-again-until-airport-ready"}