{"authors": [], "date_download": "2024-10-12 13:44:02", "date_modify": "2024-10-12 13:44:02", "date_publish": "2024-06-17 08:52:00", "description": "Mr Luxon is spending four days in Japan, where he is expected to meet with Japan's Prime Minister Fumio Kishida. Read more at straitstimes.com.", "filename": "asia_new-zealand-prime-ministers-plane-breaks-down-on-way-to-japan_1728740642.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/17/PNG-AUSTRALIA-DIPLOMACY-032512.jpg?VersionId=VWrM19KZIN_QXUG04.WqOzyQbRY5R63D", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_new-zealand-prime-ministers-plane-breaks-down-on-way-to-japan_1728740642.html", "title": "New Zealand Prime Minister's plane breaks down on way to Japan", "title_page": "New Zealand Prime Minister's plane breaks down on way to Japan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WELLINGTON - The New Zealand Defence Force plane flying New Zealand's Prime Minister Christopher Luxon to Japan broke down on June 16, forcing the Prime Minister to take a commercial flight, his office confirmed on June 17.\nMr Luxon is spending four days in Japan, where he is expected to meet with Japan's Prime Minister Fumio Kishida and spend time promoting New Zealand business.\nNew Zealand media reported that the Boeing 757 broke down during a refuelling stop in Papua New Guinea, leaving the business delegation and journalists stranded in Port Moresby, while Mr Luxon flew commercial to Japan.\nThe New Zealand Defence Force's two 757s are more than 30 years old and their age has made them increasingly unreliable.\nNew Zealand Defence Minister Judith Collins told radio station Newstalk ZB on June 17 that the consistent flight issues were “embarrassing” and that the ministry was looking at flying Luxon and his delegation commercially from now on.\nNew Zealand's defence force is struggling with ageing equipment and retaining sufficient personnel. The government has said it would like to spend more on defence but is also trying to reduce spending as the country faces economic headwinds. REUTERS", "url": "https://www.straitstimes.com/asia/new-zealand-prime-ministers-plane-breaks-down-on-way-to-japan"}