{"authors": ["Elizabeth Law"], "date_download": "2024-10-12 13:49:01", "date_modify": "2024-10-12 13:49:01", "date_publish": "2023-02-04 12:24:28", "description": "But it also adopts a mollifying tone, calling for communication at all levels to be maintained. Read more at straitstimes.com.", "filename": "asia_east-asia_china-says-spy-balloon-incident-hyped-up_1728740941.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/05/2021-12-05T000000Z1087392028RC2C8R94DFSRRTRMADP3ASIA-SECURITY.JPG?VersionId=_LbBalMyXCFmVvO0sOM8VTHSNiagp1zl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-says-spy-balloon-incident-hyped-up_1728740941.html", "title": "China says ‘spy’ balloon incident ‘hyped up’", "title_page": "China says ‘spy’ balloon incident ‘hyped up’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - The threat of a Chinese balloon drifting over the United States has been overplayed by some American politicians and media to smear Beijing, China’s foreign ministry said on Saturday.\nThe comments come after US Secretary of State Anthony Blinken postponed a trip to Beijing to have taken place on Sunday, in light of the incident and following an outcry from lawmakers led by Republicans who have called on the Pentagon to shoot down the balloon. The US assessed it to have been a spy balloon, while the Chinese maintains it was for meteorological research.\n“We have no intention to violate and has never violated the territory or airspace of any sovereign country,” China’s Ministry of Foreign Affairs said in a statement.\n“Some politicians and media in the US have hyped it up to attack and smear China. The Chinese side is firmly opposed to that.”\nBut the ministry also adopted a mollifying tone, calling for contact and communication at all levels to be maintained and adding that it is a responsibility of the diplomatic teams to be able to handle such situations.\nThe ministry added that no visit had been officially announced by either side, a seeming signal that it was trying to downplay the deferment of Mr Blinken’s trip. “It is the US’ own business to release relevant information, and we respect that.”\nIn a separate statement, the ministry also said the top diplomats of both countries had spoken on Friday night about dealing with “accidental incidents in a calm and professional manner”.\n“In the face of unexpected situations, what both parties need to do is to stay focused, communicate in a timely manner, avoid misjudgments, and manage and control differences,” said the Communist Party of China’s Central Foreign Affairs Commission director Wang Yi.\nA statement from the US Department of State struck a similar tone, adding that Mr Blinken would visit Beijing “as soon as conditions allow”.\nBoth governments have sought to play down the incident, insisting that they will continue to keep communication lines open, while China has made a rare admission of error in expressing regret the balloon drifted off course.\nBeijing insists that the balloon was meteorological research equipment that has deviated from its planned route, but Washington says otherwise.\n“We know that it’s a surveillance balloon,” said a Department of Defence spokesman during a media briefing.\nThe balloon was first spotted earlier this week and had been loitering over Montana, home to intercontinental ballistic missile silos. A Department of Defence official said the balloon posed no intelligence threat and such incursions have happened before.\nThe incident comes amid hopes for thawing relations between the world’s two largest economies after nearly five years of a bruising trade war and tense diplomatic ties. Mr Blinken was set to have a series of meetings in Beijing early next week, the most senior US politician to have made such a trip since 2018.\nIf there is any silver lining to the incident, it is that both governments appear to be soothing things over – something impossible as recently as four months ago before Presidents Xi Jinping and Joe Biden met in Bali, said Assistant Professor Dylan Loh of the Public Policy and Global Affairs division in Nanyang Technological University.\nAnd both sides are likely to continue to work towards guard rails in the relationship. But he expects ties to remain turbulent given an expected visit by House Speaker Kevin McCarthy to Taiwan in April. A rescheduled Blinken visit could take place later in the year.\nProfessor Shi Yinhong, director of Centre on American Studies at the Renmin University of China, is similarly pessimistic. Given the number of confrontations in recent months, ranging from tensions over Taiwan, an increased military presence in the Philippines to restrictions on semiconductors, there is “little prospect” for any leaps in improving the US-China relation in the short term, he said.\n“The increasingly bad state of US-China relations is too delicate to accommodate even a single ordinary blow. ‘Remarkable and lasting improvement’ (in the relationship) has become something that is dependent on almost (a) miracle,” he said.", "url": "https://www.straitstimes.com/asia/east-asia/china-says-spy-balloon-incident-hyped-up"}