{"authors": [], "date_download": "2024-10-12 13:59:48", "date_modify": "2024-10-12 13:59:48", "date_publish": "2024-07-08 07:42:04", "description": "The Chinese leader met Hungarian PM Orban, who was visiting Beijing on what he called a \"peace mission\". Read more at straitstimes.com.", "filename": "asia_hungary-pm-orban-arrives-in-beijing-for-talks-with-chinese-president-xi_1728741588.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/08/LYNXMPEK660B0-1.jpg?VersionId=Oic0f5hKNypiWKjAuduRIExe7hsSPC2q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_hungary-pm-orban-arrives-in-beijing-for-talks-with-chinese-president-xi_1728741588.html", "title": "Xi calls on world powers to help Russia, Ukraine ‘resume direct dialogue’", "title_page": "Xi calls on world powers to help Russia, Ukraine ‘resume direct dialogue’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Chinese President Xi Jinping told Hungarian Prime Minister Viktor Orban on July 8 that world powers should help Russia and Ukraine restart direct negotiations during a visit to Beijing branded a “peace mission” by the European leader.\nMr Orban’s trip to China comes a day before Nato is due to hold a summit to mark its 75th anniversary, with setbacks in Ukraine expected to dominate discussions, and follows surprise visits by the Hungarian Premier to Russia and Ukraine in the past week.\nHis trip to Moscow sparked criticism from the European Union, which said it threatened to undermine the bloc’s stance on the conflict, while Kyiv’s foreign ministry said the visit was made “without any agreement or coordination with Ukraine”.\nChina has refused to condemn Russia’s invasion of its neighbour and in 2023, released a paper calling for a “political settlement” to the conflict, which Western countries said could enable Russia to retain much of the territory it has seized in Ukraine.\nChinese state broadcaster CCTV quoted Mr Xi as saying the “international community should create conditions and provide assistance for the two sides to resume direct dialogue and negotiations”.\n“Only when all major powers exert positive energy rather than negative energy can the dawn of a ceasefire in this conflict appear as soon as possible,” Mr Xi told Mr Orban, according to CCTV.\nCCTV said in a readout: “Xi Jinping stressed that it is in the interests of all parties to cease fire and seek a political solution as soon as possible.”\n“The current focus is to abide by the three principles of ‘no spillover of the battlefield, no escalation of the war, and no fuelling of the flames by all parties’ to cool down the situation as soon as possible,” it added.\nFollowing the talks, Mr Orban wrote on social media platform X that China was “a key power in creating the conditions for peace” in the Russia-Ukraine war.\n“This is why I came to meet with President Xi in Beijing, just two months after his official visit to Budapest,” he said.\nMr Orban – who said his unannounced trip to Beijing was a “Peace mission 3.0” – wrote on his Instagram page he would be heading to Washington after Beijing.\nThe friendliest EU leader towards Moscow, he held talks on July 5 with President Vladimir Putin, who said Ukraine must withdraw its troops from regions that Russia has annexed if it wants peace.\nHungary took over the European Union’s rotating presidency at the start of July, and the EU’s foreign policy chief Josep Borrell said Mr Orban’s trip to Russia was purely a bilateral affair and he “has not received any mandate from the EU Council to visit Moscow”.\nClose to both Mr Xi and the Kremlin, Mr Orban has refused to send weapons to Kyiv, unlike his fellow EU leaders.\nChina and Russia’s strategic partnership has grown closer since the invasion of Ukraine.\nBeijing presents itself as a neutral party in the war and says it is not sending lethal assistance to either side, unlike the United States and other Western nations.\nIt has however offered a critical lifeline to Russia’s isolated economy, with trade booming since the conflict began.\nMr Xi visited Hungary in May, for the final leg of a European tour that also took him to France and Serbia.\nFollowing a meeting then with Mr Orban, Mr Xi said Beijing placed “great importance” on its relations with the EU.\nDespite its small size, the Central European country of 9.6 million people has attracted a flood of major Chinese projects in recent years, mostly related to battery and electric vehicle manufacturing.\nThe Hungarian government boasted about having around €15 billion (S$21.9 billion) worth of ongoing projects originating from the Asian country.\nMr Orban has been championing an “Eastern opening” foreign policy since his return to power in 2010, seeking closer economic ties to Russia, China and other Asian countries.\nLast October, the Hungarian Premier was the sole EU leader to attend the summit for Mr Xi’s flagship Belt and Road initiative in Beijing. AFP", "url": "https://www.straitstimes.com/asia/hungary-pm-orban-arrives-in-beijing-for-talks-with-chinese-president-xi"}