{"authors": ["Shannon Teoh"], "date_download": "2024-10-12 14:05:55", "date_modify": "2024-10-12 14:05:55", "date_publish": "2018-05-09 18:25:48", "description": "Tun Mahathir Mohamad claimed a stunning victory in Malaysia’s 14th general election early Thursday, ending Umno’s long rule which the former and new premier played a key role in entrenching for over two decades. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-ge-mahathir-claims-victory-but-unconfirmed-by-ec_1728741955.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/brightcove-thumbnails/xH1HUBstoFI9VNEZqX2Z80Gm-tRKfZ2qKtUWy_kolnc.jpg?VersionId=DOwFylaVfrmNyZN8PYI.sHZvYxlwLo6d", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-ge-mahathir-claims-victory-but-unconfirmed-by-ec_1728741955.html", "title": "Malaysia GE: Opposition coalition Pakatan Harapan set to form govt after winning simple majority", "title_page": "Malaysia GE: Opposition coalition Pakatan Harapan set to form govt after winning simple majority | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Tun Dr Mahathir Mohamad claimed a stunning victory in Malaysia's 14th general election early Thursday (May 10), ending Umno's long rule which the former and new premier played a key role in entrenching for more than two decades.\nHis Pakatan Harapan (PH) alliance made significant gains against the incumbent Barisan Nasional (BN) and even trounced Datuk Seri Najib Razak's party - which has been in power for six decades since independence - in its birthplace of Johor.\nThe Election Commission's official result confirmed that PH and its allies had surpassed the 112 seats required in the 222-seat Parliament.\nMeanwhile, BN leader Najib Razak cancelled his scheduled press conference, telling supporters who had been waiting hours on Wednesday night for him and other party leaders to appear that he would make a statement on Thursday at 11am instead.\nSeveral top BN leaders, including Malaysian Chinese Association (MCA) president and transport minister Liow Tiong Lai and Second Finance Minister Johari Abdul Ghani, were defeated as the pact suffered an erosion of support nationwide.\nReflecting the sombre mood in the BN camp, Umno Youth chief Khairy Jamaluddin said the coalition will \"accept the will of the people but the prime minister will be issuing a statement\".\n\"Whatever it is, we need to respect the will of the people and we need to make sure the election result is respected and we move on,\" he told reporters outside Mr Najib's house where Umno leaders had gathered for a meeting.\nThe big winner of the night appeared to be Dr Mahathir, who led Umno for 22 years up to 2003. He told a press conference at 3am that his coalition would form the government.\n\"Now that we have majority, the Palace has requested for the leader of PKR Wan Azizah Wan Ismail, who's also our designated Deputy Prime Minister,\" he said, referring to Parti Keadilan Rakyat, whose logo all four PH parties had used for the election.\nThe 92-year-old added that \"tomorrow (Thursday) we will have the swearing in ceremony of the PM. Then the PM, at his leisure, can appoint the DPM and other ministers.\"\nAt the Umno headquarters, no BN leader made an official comment to reporters there, as official results showed PH and its allies leading by 118 to 79 parliamentary seats at 3.30am. BN held 131 seats in Parliament before it was dissolved.\nAn Umno official told reporters at 1.30am that BN will hold a press conference at 11am on Thursday.\nIn a press conference just after midnight, EC chairman Hashim Abdullah said that the commission was still receiving results from officials across the country.\n\"Of course, the public is waiting and we fully understand this. But please give us a bit of time to make an official announcement. Please don't worry, there is no conspiracy. We will make a declaration immediately. We ask the public to be patient,\" he said.\nThe EC also announced as at 3am that eight state governments can be formed with a simple majority, half of them by PH. BN retained Perlis and Pahang, Parti Islam SeMalaysia (PAS) - which also has 18 parliamentary seats to its name - won in Kelantan and Terengganu and PH took Johor, Melaka and Negeri Sembilan from BN, while retaining Penang and Selangor.\nHowever, the Perak and Kedah state assemblies are hung, with PH one seat short of a simple majority.\nPH's targeted campaign in Johor, the birthplace of ruling party Umno, yielded some shock defeats for BN and several of its ministers and deputy ministers, including Malaysian Indian Congress (MIC) president S. Subramaniam in Segamat and Malaysian Chinese Association (MCA) vice president Chua Tee Yong in Labis.\nAs promised, Dr Mahathir has instructed the government to declare Thursday and Friday public holidays, and Friday and Sunday for states which have their weekend on Friday and Saturday.\nEarlier during polling on Wednesday (May 9) there were claims from the opposition that the slow voting process and long queues had denied some of the 15 million registered voters their right to cast their ballot.\nThe final turnout is estimated at 76 per cent of registered voters, well below the record 85 per cent that turned out in 2013.\nJust before polling centres closed, Dr Mahathir called on the Election Commission to ensure that voters are accorded their rights. PH had hoped for a high turnout to overcome the impact of what they claim are electoral boundaries skewed in BN's favour.\n\"We have received reports that many are still gathered at polling centres and voting has been slow. By 5pm, they may not be able to vote if ballots are closed at that time. This denies their right to vote. I hope the EC will take note of this as it is not their fault, but because the voting process took too long,\" he said in a video posted on his Facebook account.\nIt is unclear if there were still queues at any polling centres when voting closed at 5pm, but The Straits Times correspondents have observed the long queues at several centres gradually disappearing over the day and polls closing without incident.\nElection Commission chief Hashim Abdullah dismissed the need for a time extension.\n\"We will close at 5pm for those not in the voting room,\" he said in an interview with RTM1.\nTan Sri Hashim said this is because the 5pm closing time has been gazetted and votes cast past that time can be challenged in court to the detriment of certain parties.\nBoth sides said on Wednesday that they are set to claim victory. Dr Mahathir told reporters in the morning he is \"confident unless Najib cheats\" as \"the people are not supportive of Najib. Even his 10 goodies that he offered yesterday, nobody cares\".\nMr Najib made a last-ditch pitch on Tuesday night, offering to waive income tax for Malaysians aged 26 and younger, and toll fares for all expressways during next month's Hari Raya Aidilfitri celebrations.\nHe batted off Dr Mahathir's claims, saying the opposition is \"so desperate to spread these accusations and lies\".\n\"BN has presented a very comprehensive and credible manifesto that not only focuses on driving national development, but more importantly improves the well-being of the people. Based on that fact, God willing, I believe and am confident the people will give their votes to BN,\" he said after casting his vote in his hometown seat of Pekan, Pahang, on Wednesday morning.", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-ge-mahathir-claims-victory-but-unconfirmed-by-ec"}