{"authors": [], "date_download": "2024-10-12 14:11:11", "date_modify": "2024-10-12 14:11:11", "date_publish": "2024-03-20 14:10:00", "description": "A top Chinese regulator accused Hui Ka Yan of “making decisions and organising fraud”. Read more at straitstimes.com.", "filename": "asia_east-asia_china-evergrande-founder-accused-of-exaggerating-revenue-by-105-billion_1728742271.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/20/aiEvergrande200324.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-evergrande-founder-accused-of-exaggerating-revenue-by-105-billion_1728742271.html", "title": "China Evergrande founder accused of exaggerating revenue by over $105 billion", "title_page": "China Evergrande founder accused of exaggerating revenue by over $105 billion | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – China Evergrande Group exaggerated its revenue by more than US$78 billion (S$105 billion) and committed securities fraud over two years before its spectacular collapse in 2021, said a top Chinese regulator.\nThe China Securities Regulatory Commission accused Evergrande founder Hui Ka Yan of “making decisions and organising fraud”, the company reported in a filing to the Shanghai and Shenzhen stock exchanges on the night of March 18.\nHui was fined US$6.5 million and banned from China’s financial markets for life. Xia Haijun, a former chief executive, was fined US$2 million and also banned from financial markets, along with several other executives. The company’s main onshore unit, Hengda, was fined US$580 million.\nThe New York Times reported in December 2023 that questionable accounting and poor oversight led to Evergrande’s demise. Over the years before it defaulted on its debt, Evergrande had been treating money it received for apartments as revenue even though, at times, it had not built those apartments, the Times reported.\nIn the company filing, Hengda laid the blame solely on Hui. As chairman of Evergrande, Hui was in charge of all of the company’s real estate business and “instructed other personnel to falsely increase the performance”, the company wrote. He did so, it added, “with exceptionally bad means and exceptionally serious circumstances”.\nRegulators found that Hengda inflated its revenue by nearly US$30 billion in 2019 and by US$48.6 billion in 2020. Then it raised money in financial markets based on the falsified numbers.\nThe development is yet another blow to Evergrande’s already shattered reputation. Once an emblem of China’s entrepreneurial success and ambition, Evergrande is now a name that angers home owners across China.\nIt has become the most visible example of China’s real estate crisis. Its failure, under US$300 billion of debt, heralded the largest wave of property defaults in modern history. China’s top leaders are now trying to wean the US$18 trillion economy off construction, a sector that once contributed to a third of the country’s growth and employed many of its workers.\nAfter it defaulted, Evergrande tried to work with private lenders and international investors who had lent it tens of billions of dollars overseas. In the summer of 2023, the company reported that it had made progress towards a restructuring deal. Then, in September, Hui was detained by the authorities and all restructuring talks came to an end.", "url": "https://www.straitstimes.com/asia/east-asia/china-evergrande-founder-accused-of-exaggerating-revenue-by-105-billion"}