{"authors": [], "date_download": "2024-10-12 13:34:39", "date_modify": "2024-10-12 13:34:39", "date_publish": "2023-10-14 05:18:51", "description": "A UN Security Council resolution needs at least nine votes in favour and no vetoes. Read more at straitstimes.com.", "filename": "asia_russia-proposes-un-security-council-resolution-on-israel-hamas-conflict_1728740079.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/14/LYNXMPEJ9C10L-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_russia-proposes-un-security-council-resolution-on-israel-hamas-conflict_1728740079.html", "title": "Russia proposes UN Security Council resolution on Israel-Hamas conflict", "title_page": "Russia proposes UN Security Council resolution on Israel-Hamas conflict | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "UNITED NATIONS - Russia on Friday proposed a draft United Nations Security Council resolution on the Israel-Hamas conflict that calls for a humanitarian ceasefire and condemns violence against civilians and all acts of terrorism, according to a draft text seen by Reuters.\nThe draft resolution also calls for the release of hostages, humanitarian aid access and the safe evacuation of civilians in need. The text was given to the 15-member council during a closed-door meeting on the conflict on Friday, diplomats said.\nThe move comes after countries urged Israel to hold off attacking northern Gaza, where more than a million civilians largely defied an Israeli order to evacuate before its forces go after Hamas militants who slaughtered Israeli civilians last weekend.\nThe one-page Russian draft resolution refers to Israel and the Palestinians but does not directly name Hamas.\n\"They have not consulted anyone and it does not even mention Hamas, so they are clearly not serious or aligned with most council members,\" a council diplomat, speaking on condition of anonymity, told Reuters.\nA UN Security Council resolution needs at least nine votes in favour and no vetoes by the United States, Britain, France, China or Russia. The United States has traditionally shielded its ally Israel from any Security Council action.\nIt was not immediately clear when or if Russia would put the draft resolution to a vote.", "url": "https://www.straitstimes.com/asia/russia-proposes-un-security-council-resolution-on-israel-hamas-conflict"}