{"authors": [], "date_download": "2024-10-12 13:31:58", "date_modify": "2024-10-12 13:31:58", "date_publish": "2024-06-29 12:09:00", "description": "Higher-risk workplaces must undergo stringent safety inspections and comply with regulations. Read more at straitstimes.com.", "filename": "asia_east-asia_fatal-fire-at-lithium-battery-plant-exposes-5-year-oversight-lapse_1728739918.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/29/11435790.jpg?VersionId=vnbLa4eSRm_fL1jU2k6Ovz4EXG.hzjfa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_fatal-fire-at-lithium-battery-plant-exposes-5-year-oversight-lapse_1728739918.html", "title": "Fatal fire at lithium battery plant in South Korea exposes 5-year oversight lapse", "title_page": "Fatal fire at lithium battery plant in South Korea exposes 5-year oversight lapse | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - Aricell, a lithium battery plant that recently experienced a fatal fire resulting in 23 deaths, had not undergone any government industrial safety inspections in the past five years, despite the hazardous nature of the materials it was using, according to the South Korean Ministry of Employment and Labour.\nData obtained by Democratic Party lawmaker Park Hae-cheol from the ministry confirms that no government industrial safety inspections or supervision had been conducted at Aricell in Hwaseong, Gyeonggi province, those five years.\nAnnually, the ministry selects high-risk workplaces, particularly those involving dangerous machinery and hazardous substances, for industrial safety supervision and inspections.\nThe Occupational Safety and Health Act mandates the Ministry of Employment and Labour to oversee and inspect workplace safety to prevent industrial accidents and protect workers.\nHigh-risk workplaces, especially those handling hazardous materials or operating dangerous machinery, must undergo stringent safety inspections and comply with regulations.\nThe police are focusing their investigations into the deadly fire on two main aspects: determining the cause of the fire and understanding why there were such a large number of casualties.\nThe Gyeonggi Nambu Provincial Police Agency’s special investigation team on June 28 said they are intensifying their efforts. They consider the incident a disaster caused by comprehensive negligence rather than isolated factors.\nHead of the Labour Ministry’s special investigation team Min Gil-soo said at the June 28 briefing that the government had completed work to prevent further damage. The explanation given was that the “disposal of the waste electrolyte, which was left on the first floor of the affected building, was safely completed to prevent additional harm”.\nThe electrolyte used in the batteries, which facilitates the movement of electrons between the cathode and anode in batteries, was highly flammable and could pose a significant risk.\nIt was also confirmed that the remains of all 23 victims had been identified as at June 28. The final DNA results confirmed the identities of 17 Chinese nationals, five Koreans and one Laotian among the dead, according to Mr Min.\nChinese Consul-General Zhong Hongnuo on June 28 visited the memorial altar at Hwaseong City Hall to pay his respects to the victims. After that, he had a brief meeting with Hwaseong Mayor Jeong Myeong-geun to discuss the incident and extend support to the grieving families.\nAfter the meeting, Mr Zhong said: “We will assist the bereaved families in managing the aftermath of the accident and work with the relevant departments of the Korean government to ensure proper compensation is provided.”\nHe further told reporters: “We hope the Korean government will promptly investigate the cause of the fire and thoroughly explain the findings to the families, implementing effective measures to prevent future incidents.”\nMr Zhong also emphasised: “We must value and protect the lives and property of all workers, including Chinese nationals, and take steps to prevent such tragedies from happening again.” THE KOREA HERALD/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/fatal-fire-at-lithium-battery-plant-exposes-5-year-oversight-lapse"}