{"authors": [], "date_download": "2024-10-12 14:05:18", "date_modify": "2024-10-12 14:05:18", "date_publish": "2024-01-10 12:11:25", "description": "Fugitive financier accused of buying jewellery with money traceable to two 1MDB subsidiaries. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-high-court-allows-1mdb-units-to-question-jho-low-s-mother-over-23-million-jewellery_1728741918.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/10/file61mg41zvolc1bjzp3hrv.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-high-court-allows-1mdb-units-to-question-jho-low-s-mother-over-23-million-jewellery_1728741918.html", "title": "Malaysia High Court allows 1MDB units to question Jho Low’s mother over jewellery worth $2.3m", "title_page": "Malaysia High Court allows 1MDB units to question Jho Low’s mother over jewellery worth $2.3m | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – The High Court in Kuala Lumpur on Jan 9 allowed two subsidiaries of state fund 1Malaysia Development Berhad (1MDB) to serve a notice of interrogatories on Goh Gaik Ewe, the mother of fugitive financier Low Taek Jho, better known as Jho Low, reported news publication The Edge.\nGoh is expected to respond to nine questions in relation to US$1.7 million (S$2.3 million) worth of jewellery that she had allegedly received from her son, a flamboyant businessman who fell from grace after being outed as the bridge for former Malaysian premier Najib Razak to loot funds from 1MDB-related projects.\nLow was accused of buying the jewellery with money that could be traced to two 1MDB subsidiaries, 1MDB Energy and 1MDB Energy (Langat).\nGoh’s whereabouts is unknown. She has 14 days to provide her written reply through an affidavit.\nShould she fail to comply with the order, she will be barred from defending herself in the proceedings, reported The Edge.\nGoh is now unrepresented. The court in November 2022 allowed law firm Messrs Valen, Oh & Partners to discharge itself from representing Goh.\nThis case is part of a broader lawsuit initiated by 1MDB and its subsidiaries to recover millions of dollars from Low, his parents, two siblings and close associate Eric Tan Kim Loong.", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-high-court-allows-1mdb-units-to-question-jho-low-s-mother-over-23-million-jewellery"}