{"authors": [], "date_download": "2024-10-12 13:44:14", "date_modify": "2024-10-12 13:44:14", "date_publish": "2024-05-30 17:35:00", "description": "South Korea plans at least three more space launches by 2027 and aims to launch military satellites. Read more at straitstimes.com.", "filename": "asia_east-asia_south-korea-plans-for-mars-landing-in-2045-as-it-launches-first-space-agency_1728740654.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/30/btkorea20240530.jpg?VersionId=bj8ODJPw9u7HB9YCtcbmU4GRk_M7a8Hf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_south-korea-plans-for-mars-landing-in-2045-as-it-launches-first-space-agency_1728740654.html", "title": "South Korea plans for Mars landing in 2045 as it launches first space agency", "title_page": "South Korea plans for Mars landing in 2045 as it launches first space agency | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – South Korea plans to make a Mars landing by 2045 and spend 100 trillion won (S$98 billion) until then on space exploration, President Yoon Suk Yeol said on May 30 at the launch of the country’s first space agency.\nThe Korea Aerospace Administration (Kasa) will lead the country’s “space economy,” with hundreds of businesses and enterprises working to catapult South Korea into the ranks of the world’s top five space powers, Mr Yoon said.\n“Kasa will usher in a new space era by cultivating experts while intensively supporting the aerospace industry ecosystem and fostering challenging and innovative R&D (research and development),” Mr Yoon said. The country’s first lunar lander is planned for 2032.\nSouth Korea became the seventh country to own an indigenous space launch vehicle and satellite development technology with the launch of the Nuri rocket in May 2023 that put a commercial grade satellite in orbit.\nThe agency will streamline policy and development functions shared among different government ministries and will bring under its structure the aerospace research institute that developed the Nuri and its precursor space launch vehicles.\nSouth Korea plans at least three more space launches by 2027 and aims to launch military satellites.\nMr Yoon’s announcement highlights the increasing efforts Asian nations are putting into space programmes for practical reasons, such as honing rocket technology, and to bolster national pride.\nOn May 27, North Korea launched a rocket but failed to put its second military spy satellite in orbit, which it blamed on a new type of engine failing. But one expert noted the attempt as a “huge leap” in the heavily sanctioned country’s race for space.\nSouth Korea, Japan and the United States condemned the North’s launch as violating UN Security Council resolutions banning it from developing ballistic missile technology.\nChina’s space programme has developed heavy-lift rockets such as the Long March 5, the Tiangong space station, unmanned moon probes and the rover Zhurong that reached Mars in 2021.\nIn January, Japan became the fifth country to place a lander on the Moon. In 2023, India became the fourth nation to land on the Moon, after Russia failed in an attempt the same month.\nJapan also plans a rover mission to Mars. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/south-korea-plans-for-mars-landing-in-2045-as-it-launches-first-space-agency"}