{"authors": [], "date_download": "2024-10-12 13:38:29", "date_modify": "2024-10-12 13:38:29", "date_publish": "2024-08-08 11:26:00", "description": "China General Nuclear Power opened online booking for tourists to plan visits to 9 power stations. Read more at straitstimes.com.", "filename": "asia_east-asia_china-s-nuclear-tourism-opens-atom-splitting-plants-to-public_1728740309.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/2024-05-22T230040Z1421414826RC25D7ACOEGQRTRMADP3COBALT-CHINA-STOCKPILES.JPG?VersionId=QsrjRvuPNvPeZCW4_UhhThCTPl0SwWSP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-s-nuclear-tourism-opens-atom-splitting-plants-to-public_1728740309.html", "title": "China’s ‘nuclear tourism’ opens atom splitting plants to public", "title_page": "China’s ‘nuclear tourism’ opens atom splitting plants to public | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China is giving people a peek behind the curtain of its atomic energy programme, hoping that “nuclear tourism” can help shore up support for a sector key to its clean energy ambitions.\nChina General Nuclear Power Corp, or CGN, the country’s largest atomic electricity generator, opened an online booking system to allow tourists to plan visits to nine nuclear power stations across the country.\nThe company also published a booklet of tourist information, including hand-drawn guide maps for the facilities, the company said on its WeChat account.\nAt a launch event on Aug 7 at the Ningde nuclear power plant in Fujian province, officials beckoned visitors to see its four CPR-1000 reactors along with nearby fragrant white tea gardens.\nAnother option offered was heading to Guangxi’s Fangchenggang station, where “majestic” Hualong One reactors sit near famous tourist islands home to the Jing ethnic minority.\nOfficials also claimed the San’ao generator being built near Wenzhou’s coastline has become a popular photo backdrop for social media influencers.\nIn addition to providing a boost to local tourism, CGN is hoping the initiative can enhance public trust in the nuclear sector by sharing information on topics like radiation and safety controls.\nPublic backing for the sector will be important as China expands its nuclear fleet to help meet its target of zeroing out emissions by 2060.\nChina is now building 30 reactors, accounting for nearly half of the global construction pipeline.\n“This is not only a public science popularisation activity, but also an important exploration in the field of nuclear tourism,” CGN spokesman Guo Xingang said at the launch event.\n“This will not only help enhance the public’s understanding and trust in nuclear power, but also contribute to the high-quality development of my country’s nuclear power industry.” BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/china-s-nuclear-tourism-opens-atom-splitting-plants-to-public"}