{"authors": [], "date_download": "2024-10-12 13:28:07", "date_modify": "2024-10-12 13:28:07", "date_publish": "2022-07-27 11:16:08", "description": "Labourers have been slow to return because of red tape and difficult negotiations with countries of origin. Read more at straitstimes.com.", "filename": "asia_se-asia_bitter-harvest-malaysian-palm-oil-farmers-face-labour-crunch_1728739687.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/27/md_palmoil_27072022.jpg?VersionId=UVXhsdtJ9yVgHKfm2sCSLGVQWlVLIPGN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_bitter-harvest-malaysian-palm-oil-farmers-face-labour-crunch_1728739687.html", "title": "Bitter harvest: Malaysian palm oil farmers face labour crunch", "title_page": "Bitter harvest: Malaysian palm oil farmers face labour crunch | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "IJOK, MALAYSIA (AFP) - Overripe palm oil fruits hang untouched in trees while others lie rotting scattered around a plantation, as Malaysian farmers reap the bitter harvest of a severe labour shortage.\nThe tropical country is the world's second-biggest producer of the edible vegetable oil, which is found in many everyday goods from chocolate to cosmetics.\nThe sector has long been reliant on migrants from neighbouring Indonesia for back-breaking plantation work, which is shunned by most in more affluent Malaysia.\nLengthy Covid-19 border closures had already reduced the foreign labour force, but now bureaucratic hurdles and a ban by Indonesia on sending new workers have dramatically worsened the problems.\n\"A lot of bunches of fruit are rotting on the trees,\" Mr Suzaidee Rajan, 47, who owns a 300-acre (120ha) plantation in Ijok, central Selangor state, told AFP.\n\"We usually harvest twice a month. But now due to the labour shortage, we can (do so) just once a month. Our income has plunged and locals are angry.\"\nWith just four foreign workers - two fewer than the number he needs - Mr Suzaidee now has to drive into his plantation and load the fruit onto a lorry himself.\nPalm oil is a controversial commodity, blamed by environmentalists for fuelling the destruction of rainforest in Malaysia and Indonesia, which together produce 85 per cent of global output.\nGreen groups say rapid expansion of plantations has destroyed rare animals' habitats, while there have been allegations of foreign workers being abused and mistreated on some estates.\nThe sector nevertheless remains a major contributor to Malaysia's economy, and has continued to attract foreign workers who can earn higher wages than back home.\nAgricultural firms run large estates, while there are also numerous small-scale farmers like Mr Suzaidee.\nOther Malaysian industries, including construction and manufacturing, also rely on migrant workers from across Asia, and suffered as a result of lengthy pandemic border closures.\nWhile authorities ended a freeze on hiring foreigners in February, labourers have been slow to return because of red tape and difficult negotiations with countries of origin.\nProblems in the plantation sector have been particularly acute, however, and look set to get worse after Indonesia banned sending new workers to Malaysia earlier this month.\nMr Hermono - Indonesia's ambassador in Kuala Lumpur, who goes by one name - said Jakarta took the decision as Malaysia was not abiding by an agreement aimed at protecting his compatriots.\nThe Malaysian estate owners' association says there is currently a shortage of about 120,000 workers.\nAnd this month Minister Zuraida Kamaruddin, who oversees the plantation sector, said the industry lost RM10.46 billion (S$3.26 billion) in the first five months of 2022 as palm oil fruit was left unharvested.\n\"I can see only darkness on the horizon unless migrant workers are brought into the country immediately,\" farmer Sahman Duriat, who has a plantation in Ijok, told AFP. \"My earnings are falling while inflation and production costs are rising.\"\nAfter the Indonesian ban was announced, Malaysia's human resources ministry vowed to address Jakarta's concerns quickly to ensure it is reversed.\nFor Indonesian plantation workers still in Malaysia, there is now much more to do.\n\"Usually we work in a group of five... but now there are just two of us,\" said Mr Zan, who goes by one name, as he cut fruit from a tree while a second man loaded it into a wheelbarrow.\n\"We harvest 200 tonnes a month with five people but now only 80 tonnes with just two of us.\"", "url": "https://www.straitstimes.com/asia/se-asia/bitter-harvest-malaysian-palm-oil-farmers-face-labour-crunch"}