{"authors": [], "date_download": "2024-10-12 13:38:37", "date_modify": "2024-10-12 13:38:37", "date_publish": "2024-06-13 04:45:48", "description": "But the escalation is not as big as many had feared, the diplomats said. Read more at straitstimes.com.", "filename": "asia_iran-expanding-enrichment-capacity-after-iaea-resolution-diplomats-say_1728740317.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/13/IRAN-ISRAEL-PALESTINIAN-US-CONFLICT-172855.jpg?VersionId=vHaFfhlQI5Oz9z_IoLG5gZaSwc5ttmkP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_iran-expanding-enrichment-capacity-after-iaea-resolution-diplomats-say_1728740317.html", "title": "Iran expanding enrichment capacity after IAEA resolution, diplomats say", "title_page": "Iran expanding enrichment capacity after IAEA resolution, diplomats say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VIENNA/PARIS - Iran is responding to last week’s UN nuclear watchdog board resolution against it by expanding its uranium-enrichment capacity at two underground sites, but the escalation is not as big as many had feared, diplomats said on June 12.\nIran bristles at such resolutions by the International Atomic Energy Agency’s (IAEA) 35-nation board of governors, and it reacted to the previous one 18 months ago by enriching to up to 60 per cent purity, close to weapons grade, at a second site and announcing a large expansion of its enrichment programme.\nThis time, it plans to install more cascades, or clusters, of centrifuges, the machines that enrich uranium, at both its underground enrichment sites, five diplomats said. IAEA inspectors observing Iran’s progress plan to issue a report to member states on June 13, three of the diplomats said.\n“It’s not as much as I would expect,” one Vienna-based diplomat said, referring to the scale of Iran’s escalation.\n“Why? I don’t know. Maybe they’re waiting for the new government,” they said, referring to the deaths in a helicopter crash in May of Iranian President Ebrahim Raisi and Foreign Minister Hossein Amirabdollahian, and the presidential election due to be held on June 28.\nThe IAEA board passed a resolution a week ago calling on Iran to step up cooperation with the agency and reverse its recent barring of inspectors despite earlier US concerns Tehran would respond with atomic escalation. Only Russia and China opposed it.\nDiplomats did not go into specifics on the number or type of centrifuges being added or what level they would enrich to, though one diplomat said they would not be used to quickly expand Iran’s production of uranium enriched to up to 60 per cent, close to the 90 per cent of weapons grade.\nThe diplomats said they would wait to see what the IAEA said Iran had actually done but they were aware of Iran’s plans.\nThe move is “at the lower end of expectations and something we’re pretty sure they were going to do anyway”, one diplomat said, meaning it would have happened even without the resolution.\nIran did not fully follow through on its November 2022 announcement after the previous resolution. While it installed all the centrifuges that it said it would at its underground enrichment plant at Natanz, 12 cascades of one advanced model, the IR-2m, are not yet in operation.\nIran is only enriching to up to 60 per cent at an above-ground pilot plant at Natanz and its Fordow site, which is dug into a mountain. In November 2022, it started enriching to up to 60 per cent at Fordow but it has yet to install all the additional cascades it said it would. REUTERS", "url": "https://www.straitstimes.com/asia/iran-expanding-enrichment-capacity-after-iaea-resolution-diplomats-say"}