{"authors": ["Benjamin Kang Lim", "Danson Cheong"], "date_download": "2024-10-12 14:11:46", "date_modify": "2024-10-12 14:11:46", "date_publish": "2023-01-20 18:05:30", "description": "Experts say this could refer to officials’ family members and aides taking bribes on their behalf. Read more at straitstimes.com.", "filename": "asia_east-asia_china-turns-its-eyes-to-hidden-corruption_1728742306.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/24/CHINA-MYANMAR-HEALTH-ECONOMY-193553.jpg?VersionId=8uMd3qiNOvRW7f327egm8UbIsUUfDr0d", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-turns-its-eyes-to-hidden-corruption_1728742306.html", "title": "China turns its eyes to ‘hidden corruption’", "title_page": "China turns its eyes to ‘hidden corruption’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - After clamping down on chronic corruption in the past decade, the Communist Party of China (CPC) is turning its focus to fighting “hidden corruption”.\nThe party’s anti-graft watchdog, the Central Commission for Discipline Inspection (CCDI), said during its annual plenum that it will go after “new forms of corruption and hidden corruption”.\nThe CCDI did not elaborate on what this referred to during the meeting earlier in January.\nPresident Xi Jinping also vowed during the party’s quinquennial congress last October to crack down on new forms of corruption and hidden corruption, and to investigate leading cadres’ spouses, children, siblings and aides.\nAt the CCDI meeting, during which the commission detailed its priorities for the year, it said a key area would be “concentrations of power, funds and resources”.\nIt singled out targets such as state-owned enterprises, the justice and financial system, and areas relating to grain purchasing and marketing, according to a readout of the meeting.\nTraditional corruption involves officials accepting cash in exchange for approving bank loans, government subsidies, construction projects and job promotions, among other things.\nSome experts say the new and hidden forms of corruption could refer to officials’ family members and aides taking bribes on their behalf in the form of shares in privately owned companies, antiques, calligraphies, paintings, sculptures and consultancy fees. It could also refer to the business activities of current and former officials.\nThere are also signs that Beijing is now training its sights on this “collusion between such officials and business people”, said political analyst Willy Lam, an adjunct professor at the Chinese University of Hong Kong.\nOn Monday, CCDI deputy director Xiao Pei wrote in the official People’s Daily that Beijing would soon enact a law to restrict the business activities of current and former officials.\nIt would “clarify management mechanisms such as recusal of civil servants, and restrictions on part-time work, commercial dealings, and employment after they leave their jobs”, said Mr Xiao.\nDr Lam pointed out that China at the moment does not have comprehensive laws to govern civil servants’ dealings in the private sector.\n“This could also be a so-called ‘new’ form of corruption that they are tackling,” he said.\n“Since the beginning of economic reforms and the open door policy in the 80s, there were people who retired from the civil service or party bureaucracy and gone into business taking advantage of their connections, but relatively few officials have been prosecuted.”\nUnlike 2022, the readout of 2023’s CCDI meeting did not mention that the anti-graft agency will crack down on the “disorderly expansion of capital and platform monopolies”, which experts say is a clear sign that Beijing is shifting its focus away from private firms and tech giants.", "url": "https://www.straitstimes.com/asia/east-asia/china-turns-its-eyes-to-hidden-corruption"}