{"authors": [], "date_download": "2024-10-12 14:17:57", "date_modify": "2024-10-12 14:17:57", "date_publish": "2024-05-16 05:03:03", "description": "The Chinese President pledged to work with his Russian counterpart to “rejuvenate” their countries. Read more at straitstimes.com.", "filename": "asia_putin-to-visit-chinas-xi-to-deepen-strategic-partnership_1728742677.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/16/2024-05-16T033112Z1235086671RC2FR7AYZ03VRTRMADP3CHINA-RUSSIA-PUTIN.JPG?VersionId=lMrXZtpNjADUKUKc7ZG7_E70Db2NgeAf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_putin-to-visit-chinas-xi-to-deepen-strategic-partnership_1728742677.html", "title": "Xi, Putin slam US as they pledge to deepen already close military ties", "title_page": "Xi, Putin slam US as they pledge to deepen already close military ties | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW/BEIJING – Chinese President Xi Jinping and Russian President Vladimir Putin on May 16 condemned what they labelled as increasingly aggressive US behaviour, and pledged to deepen their countries’ already close defence and military ties.\nIn a clear snub to Washington, Mr Xi said China and Russia see eye to eye on a range of important issues, including the war in Ukraine, and will resist pressure from the West to downgrade their ties.\n“The China-Russia relationship today is hard-earned, and the two sides need to cherish and nurture it,” Mr Xi told Mr Putin.\n“China is willing to... jointly achieve the development and rejuvenation of our respective countries, and work together to uphold fairness and justice in the world,” he added.\nMr Antony Blinken, the US’ top diplomat, flew to China in April to persuade Beijing to scale back its relationship with Moscow.\nBut a joint statement spoke of concerns about what were described as US efforts to violate the strategic nuclear balance, Washington’s global missile defence initiatives that threaten Russia and China, and US plans for high-precision non-nuclear weapons.\nMr Putin, on his first overseas trip since being inaugurated for a new presidential term, described Moscow’s and Beijing’s cooperation in world affairs as one of the main stabilising factors in the international arena.\n“Together, we are defending the principles of justice and a democratic world order reflecting multipolar realities and based on international law,” Mr Putin told Mr Xi.\nMr Blinken’s China trip appears to have been an unsuccessful attempt to undermine a “no limits” partnership proclaimed when Mr Putin visited Beijing in February 2022, just days before he sent tens of thousands of troops into Ukraine, triggering the deadliest land war in Europe since World War II.\nBy picking China for his first foreign trip since being sworn in for a six-year term that will keep him in power until at least 2030, Mr Putin is sending a message to the world about his priorities and the depth of his personal ties with Mr Xi.\nMr Xi and Mr Putin’s joint statement was described as deepening China’s and Russia’s strategic relationship.\nIt spoke specifically of how joint cooperation in the defence sectors between the two nations improves regional and global security, and of their plans to step up military ties.\nIt also condemned initiatives to seize assets and property of foreign states, a clear reference to Western moves to redirect profits from frozen Russian assets or the assets themselves to help Ukraine.\nMr Xi said both sides agreed that a political settlement to the Ukraine crisis was a step in the “right direction”. He said both China and Russia were opposed to a drawn-out conflict in Ukraine and its possible transition to an uncontrollable phase.\nMr Putin said he was grateful to China for trying to solve the crisis, adding that he would brief Mr Xi on the situation in Ukraine, where Russian forces are advancing on several fronts.\nShared view of America\nLater, describing their initial session as “warm and comradely”, Mr Putin outlined sectors where the two are strengthening ties, from nuclear and energy cooperation to food supplies, and Chinese car manufacturing in Russia.\nRussia’s RIA Novosti news agency cited Mr Putin as saying: “It is of crucial significance that relations between Russia and China are not opportunistic and are not directed against anyone.”\nIn an interview with China’s Xinhua news agency before his departure from Moscow, Mr Putin praised Mr Xi for helping to build a partnership based on national interests and deep mutual trust.\nMr Putin said: “It was the unprecedentedly high level of the strategic partnership between our countries that determined my choice of China as the first state that I would visit after officially taking office as president.”", "url": "https://www.straitstimes.com/asia/putin-to-visit-chinas-xi-to-deepen-strategic-partnership"}