{"authors": [], "date_download": "2024-10-12 13:59:42", "date_modify": "2024-10-12 13:59:42", "date_publish": "2022-12-13 12:02:41", "description": "He also evaluated pilot trainees, tested equipment and gave instruction on tactics. Read more at straitstimes.com.", "filename": "asia_australianz_ex-us-pilot-accused-of-illegally-training-chinese-aviators-to-land-on-aircraft-carriers_1728741582.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/13/mdjet13122022_2.jpg?VersionId=y1QBuGQ4.msWFnDFcTrKSqihyWRejlI7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_ex-us-pilot-accused-of-illegally-training-chinese-aviators-to-land-on-aircraft-carriers_1728741582.html", "title": "Ex-US pilot accused of illegally training Chinese aviators to land on aircraft carriers", "title_page": "Ex-US pilot accused of illegally training Chinese aviators to land on aircraft carriers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Former US Marine pilot Daniel Duggan, who was arrested in Australia, is accused of breaking American arms control law by training Chinese military pilots to land on aircraft carriers according to an indictment unsealed by a United States court.\nThe 2017 indictment said “Duggan provided military training to PRC (People’s Republic of China) pilots” through a South African flight school on three occasions in 2010 and 2012.\nIt lists unnamed co-conspirators including one South African and one British national who were executives of “a test flying academy based in South Africa with a presence in the PRC”, and a Chinese national who acquired military information for the Chinese military.\nBritain announced a crackdown on its former military pilots working to train Chinese military fliers the same week Duggan was arrested in Australia.\nAustralian police provisionally arrested Duggan in the rural town of Orange at the request of the US government in October, pending a likely extradition request.\nDuggan’s lawyer, Mr Dennis Miralis of Australian law firm Nyman Gibson Miralis, did not immediately respond to a request for comment on the indictment.\nHe has previously said Duggan denies breaching any law, and is an Australian citizen who had renounced his US citizenship.\nThe District of Columbia court on Friday unsealed the indictment and a US warrant for Duggan.\nThe indictment said Duggan was allegedly contracted directly by the unnamed Chinese national to provide services to a Chinese state owned company, including evaluations of Chinese military pilot trainees, testing of naval aviation related equipment and instruction on tactics related to landing aircraft on aircraft carriers.\nDuggan did not seek authorisation from the US government to provide military training to China, although the State Department had informed him by e-mail in 2008 this was required to train a foreign air force, it said.\nThe indictment alleges he travelled frequently between Australia, the United States, China and South Africa between 2009 and 2012, when he was a US citizen and Australian citizen.\nDuggan’s alleged violation of an arms embargo imposed on China by the US also included providing aviation services in China in 2010, and providing an assessment of China’s aircraft carrier training, it said.\nThe indictment alleges the Chinese national brokered a deal between the South African flight school and a Chinese state owned enterprise to provide aircraft carrier landing training to Chinese military pilots in South Africa and China.\nA T-2 Buckeye aircraft was purchased from a US aircraft dealer for this training, by providing false information that resulted in the US government issuing an export licence, it said.\nDuggan faces four charges, including conspiracy to defraud the US by conspiracy to unlawfully export defence services to China, conspiracy to launder money, and two counts of violating the arms export control act and international traffic in arms regulations.\nDuggan is being held in custody in Sydney and his case will return to a Sydney court on Friday.\nA spokesperson said Australia’s Attorney-General’s Department “does not comment on extradition matters until after the person has been brought before the court pursuant to that extradition request”.\nDuggan moved to Australia in 2002 after a decade in the US Marines, later moving to Beijing in 2014 where he worked as an aviation consultant. He returned to Australia from China weeks before he was arrested, according to his lawyer.\nReuters previously reported that in 2014 Duggan shared a Beijing address with a Chinese businessman, Su Bin, who was arrested in Canada in July 2014 and sentenced to prison in the US two years later after pleading guilty in a high-profile hacking case involving the theft of US military aircraft designs. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/ex-us-pilot-accused-of-illegally-training-chinese-aviators-to-land-on-aircraft-carriers"}