{"authors": [], "date_download": "2024-10-12 13:33:50", "date_modify": "2024-10-12 13:33:50", "date_publish": "2024-01-31 11:37:19", "description": "Malaysia's Sultan Ibrahim from the southern state of Johor was sworn in as the country's new king on Wednesday, taking the oath of office in a ceremony at the national palace in Kuala Lumpur. Read more at straitstimes.com.", "filename": "asia_malaysia-installs-sultan-ibrahim-of-johor-state-as-new-king_1728740030.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/31/LYNXMPEK0U030-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_malaysia-installs-sultan-ibrahim-of-johor-state-as-new-king_1728740030.html", "title": "Malaysia installs Sultan Ibrahim of Johor state as new king", "title_page": "Malaysia installs Sultan Ibrahim of Johor state as new king | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Malaysia's Sultan Ibrahim from the southern state of Johor was sworn in as the country's new king on Wednesday, taking the oath of office in a ceremony at the national palace in Kuala Lumpur.\nThe monarchy plays a mostly ceremonial role in Malaysia, but its influence has grown in recent years, prompting the king to wield rarely-used discretionary powers to quell political instability.\nUnder a unique system of monarchy, the heads of Malaysia's nine royal families take turns to be the King, known as the \"Yang di-Pertuan Agong\" every five years.\nSultan Ibrahim, 65, succeeds Al-Sultan Abdullah Sultan Ahmad Shah, who is returning to lead his home state of Pahang after completing his five-year tenure as king.\nWhile the monarchy is largely seen as above politics, Sultan Ibrahim has been noted for his forthrightness and outsized personality, often weighing in on the country's political issues.\nKnown for his large collection of luxury cars and motorbikes, Sultan Ibrahim has wide-ranging business interests from real estate to mining, including a stake in Forest City - a $100-billion China-backed land reclamation and development project off Johor. REUTERS", "url": "https://www.straitstimes.com/asia/malaysia-installs-sultan-ibrahim-of-johor-state-as-new-king"}