{"authors": [], "date_download": "2024-10-12 13:38:41", "date_modify": "2024-10-12 13:38:41", "date_publish": "2024-08-21 18:17:29", "description": "Full membership of the ICC is a key part of Ukraine’s quest to eventually join the EU. Read more at straitstimes.com.", "filename": "asia_ukraine-ratifies-rome-statute-paving-way-for-icc-membership_1728740321.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/21/LYNXMPEK7K0AP-1.jpg?VersionId=U3P8q_KJBOXPo3QQ1DqDSY.lqI_6b3mM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_ukraine-ratifies-rome-statute-paving-way-for-icc-membership_1728740321.html", "title": "Ukraine ratifies Rome Statute, paving way for ICC membership", "title_page": "Ukraine ratifies Rome Statute, paving way for ICC membership | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine’s Parliament voted on Aug 21 to ratify the Rome Statute, officials said, allowing the country to join the International Criminal Court (ICC) in a step Ukrainian leaders have cast as central to Kyiv’s European aspirations.\nUkraine has recognised the ICC’s jurisdiction in the past, but full membership of the court is a key part of Ukraine’s quest to eventually join the EU.\nIt would also allow the authorities “to more effectively punish” suspected Russian war criminals amid Moscow’s war on Ukraine, according to lawmaker Oleksiy Honcharenko.\nThe ICC has issued arrest warrants for Russian officials including President Vladimir Putin and former defence minister Sergei Shoigu for their roles in alleged crimes against Ukrainian civilians. Russia has denied targeting civilians.\n“Ukraine has already worked effectively with the ICC to ensure comprehensive accountability for all Russian atrocities committed in the course of Russian aggression,” Ukrainian Foreign Minister Dmytro Kuleba wrote on social media platform X.\n“This work will now be even more effective.”\nIn an interview with Reuters in June, senior presidential adviser Iryna Mudra said the ratification process had been held up because of a “disinformation campaign” falsely suggesting Ukrainian troops would be more vulnerable to prosecution.\nMr Kuleba also described Kyiv’s bid for ICC membership as “a long journey full of challenges, myths, and fears. None of them have been true”.\nLawmaker Yaroslav Zhelezniak said deputies had been presented with letters of support from Ukraine’s General Staff and the head of Kyiv’s military intelligence before voting. REUTERS", "url": "https://www.straitstimes.com/asia/ukraine-ratifies-rome-statute-paving-way-for-icc-membership"}