{"authors": [], "date_download": "2024-10-12 13:45:11", "date_modify": "2024-10-12 13:45:11", "date_publish": "2023-02-23 09:47:40", "description": "The city extended the regulation by two weeks to March 8. Read more at straitstimes.com.", "filename": "asia_se-asia_hong-kong-extends-mask-mandate-to-nearly-1000-days-despite-reopening-campaign_1728740711.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/23/HONGKONG-CHINA-BORDER-HEALTH-VIRUS-064728_7.jpg?VersionId=veRyKRsxcuL_O.DIP4St0mxY9U0bNgeJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_hong-kong-extends-mask-mandate-to-nearly-1000-days-despite-reopening-campaign_1728740711.html", "title": "Hong Kong extends mask wearing requirement by 2 weeks to March 8, despite reopening campaign", "title_page": "Hong Kong extends mask wearing requirement by 2 weeks to March 8, despite reopening campaign | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - Hong Kong is extending the mandatory wearing of masks in public places by two weeks to March 8, despite planning a number of campaigns to show visitors and residents alike that the city has escaped the shadow of Covid-19.\nNews of the extension was published in a government gazette late on Wednesday.\nBy March 8, the rule, which is enforceable by fines of up to HK$10,000 (S$1,700), will have been in place for almost 1,000 days.\nThe move comes amid efforts by the government to attract tourists and overseas workers to help revive the battered economy.\nAlthough Hong Kong leader John Lee has said a number of times that he hopes to remove the mask rule after the winter surge ends, he has yet to be more specific.\nRetaining the pandemic rule makes Hong Kong stand out among global financial centres. The city dropped most of its other curbs earlier in the year.\nThe extension drags mask wearing into March, when the city will host a number of global events, such as the World City Championship golf tournament and the Museum Summit 2023, making it the busiest month in more than three years.\nTo lure tourists, the city is giving away more than half a million airline tickets as part of its Hello Hong Kong campaign.\nFinance chief Paul Chan on Wednesday said the government would soon launch a Happy Hong Kong campaign to boost the economy. This would include gourmet experiences and activities to create “fun amusements and an exciting ambience”, he said in his annual budget address.\nHong Kong’s economy shrank in three of the last four years, while the population fell by 187,300, or 2.5 per cent, to 7.33 million from the end of 2019 to the end of 2022 as residents left for other cities.\nThe city closed its borders after the pandemic struck and imposed extreme social distancing rules. Yet it still had a wave of deaths caused by the Covid-19 Omicron variant.\nIn another sign that the city has yet to leave the pandemic era, the Education Bureau said on Tuesday that pupils in kindergartens, primary and special needs schools will need to continue to do daily Covid-19 tests at least until March 15.\nThe requirement will be dropped for secondary school students from March 1. BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/hong-kong-extends-mask-mandate-to-nearly-1000-days-despite-reopening-campaign"}