{"authors": [], "date_download": "2024-10-12 13:48:49", "date_modify": "2024-10-12 13:48:49", "date_publish": "2023-02-10 15:49:07", "description": "China had responded to a trip by his predecessor by launching missiles over the island. Read more at straitstimes.com.", "filename": "asia_east-asia_half-of-taiwanese-support-a-visit-by-us-house-speaker-mccarthy-defying-china_1728740929.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/10/10456898_9.jpg?VersionId=3vm.AdsRpBLCFx7Xskcgp4sR9Dp78G4I", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_half-of-taiwanese-support-a-visit-by-us-house-speaker-mccarthy-defying-china_1728740929.html", "title": "Half of Taiwanese polled support a visit by US House Speaker McCarthy", "title_page": "Half of Taiwanese polled support a visit by US House Speaker McCarthy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TAIPEI – More than half of Taiwanese surveyed in a recent poll say they support a visit by US House Speaker Kevin McCarthy – even though China responded to a trip by his predecessor by launching missiles over the democratically run island.\nSome 56 per cent of respondents to a survey by TVBS, a major Taiwanese broadcaster, said they were very much or slightly in favour of a visit by the Republican lawmaker, who earlier said he would go if he won the speakership.\nJust 23 per cent of people said they were slightly or very much against a visit, and one-fifth indicated they had no opinion. The survey was conducted from Monday to Thursday, and published on Friday.\nMr McCarthy would plan a trip to the island either later in 2023 or in 2024, said House Foreign Affairs Committee chairman Michael McCaul on Tuesday – an event that would set up a potential confrontation similar to the one in August 2022. Mr McCaul, also a Republican, said he plans to lead a bipartisan delegation to Taiwan this spring.\nLast August, Mrs Nancy Pelosi became the first House speaker in 25 years to visit Taipei, where she met Taiwanese President Tsai Ing-wen. The People’s Liberation Army responded by holding unprecedented military drills around the island.\nChina regards Taiwan as a renegade province to be reunified, by force if necessary, and it views visits by foreign government officials as them recognising the island’s sovereignty.\nTaiwan rejects China’s sovereignty claims, saying that only the island’s 23 million people can decide their future.\nChina has urged Mr McCarthy not to make the journey. Foreign Ministry spokesman Mao Ning said in January that “certain individuals in the US” should “stop doing anything that violates the basic norms in international relations”.\nMs Mao did not refer to Mr McCarthy by name, but she was answering a question at a regular media briefing about him making a potential visit.\nAsked later to respond to those comments, Mr McCarthy said: “I don’t think China can tell me where I can go, at any time, at any place.” BLOOMBERG, REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/half-of-taiwanese-support-a-visit-by-us-house-speaker-mccarthy-defying-china"}