{"authors": [], "date_download": "2024-10-12 13:48:21", "date_modify": "2024-10-12 13:48:21", "date_publish": "2021-11-12 12:03:16", "description": "Unlike last outbreak linked to tour group, new cases linked to conference held in the city. Read more at straitstimes.com.", "filename": "asia_east-asia_beijing-facing-severe-covid-19-control-and-prevention-situation-officials_1728740901.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/11/12/af_beijingguards_121121.jpg?VersionId=MrCO.lyqZSD41dlJevmhy7ViOriFIaKo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_beijing-facing-severe-covid-19-control-and-prevention-situation-officials_1728740901.html", "title": "Beijing facing severe Covid-19 control and prevention situation: Officials", "title_page": "Beijing facing severe Covid-19 control and prevention situation: Officials | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (CHINA DAILY/ASIA NEWS NETWORK, REUTERS) - A new cluster of Covid-19 cases in Beijing has involved a wider range of areas and more people with its fast spread, adding difficulties to the capital's epidemic control and prevention, a senior official said on Thursday (Nov 12).\nBeijing is facing a severe and complicated epidemic control and prevention situation that requires the departments involved to act with speed and precision to reduce transmission of the virus - that was the consensus at a meeting of the city's top epidemic control and prevention work group hosted by Beijing's party secretary Cai Qi on Thursday morning.\nUnlike the last outbreak in the city, in which every case was linked to a tour group that travelled to the Inner Mongolia autonomous region, the new cases in Beijing are all related to a conference held in the city.\nBeijing reported six locally transmitted cases and one asymptomatic case on Thursday and many of the patients are employees of PetroChina, which is headquartered in the capital, said deputy director Pang Xinghuo of the Beijing Centre for Disease Control and Prevention.\nThose employees had been to a company conference in Beijing between Oct 28 and Nov 10. A participant in the conference was later confirmed in Jilin province to be infected with Covid-19.\n\"Beijing took immediate action once it learnt of the confirmed case involving someone who travelled to Beijing from Jilin for the conference,\" said Mr Xu Hejian, a spokesman for the Beijing municipal government, at a news conference on Thursday afternoon.\nThe authorities started mass nucleic acid testing for all close contacts of the confirmed patient and related areas starting on Wednesday night, he said.\nOne of the employees lives in a residential community in Haidian district, and her family members were also infected with the virus.\nThe community was designated as a medium-level risk area for Covid-19 on Thursday.\nCommunity worker Wang Dan, who from 1am until 9.30am on Thursday helped organise the testing, said all the residents have shown understanding and support for the control measures.\n\"It's cold outside, but the testing process has been smooth and efficient,\" she said. \"There are many volunteers working with us.\"\nA resident surnamed Wang completed his sample collection within a few seconds.\n\"We will fully cooperate with all the measures,\" he said.\nAll PetroChina institutions and subsidiaries in Beijing have been placed under a state of emergency in response to the outbreak, and all employees are being required to be tested for the virus for three successive days. As of noon on Thursday, all test results were negative.\nTo reduce the risk of new infections, Beijing is requiring conferences that can be held online to do so.\nMeanwhile, a growing Covid-19 cluster in China's Dalian has spurred the north-eastern port city to limit outbound travel, cut offline school classes and close a few cultural venues after being told by the national authorities to contain the outbreak more quickly.\nDalian reported 52 locally transmitted infections with confirmed symptoms on Thursday, a daily count higher than any other Chinese city affected in an ongoing nationwide outbreak since mid-October, and more than doubling from 21 cases a day earlier, official data showed on Friday.\nOn Friday, Dalian called on its residents not to leave their home unless it is necessary.\nDalian, a leading port for seafood shipments as well as fruit and some meats, has also ordered all businesses handling imported chilled and frozen foods to suspend operations, according to the state-backed newspaper Global Times.\nAs of Thursday, mainland China had reported 98,099 confirmed symptomatic Covid-19 patients, including both local cases and those arriving from abroad. The total death count remained at 4,636.", "url": "https://www.straitstimes.com/asia/east-asia/beijing-facing-severe-covid-19-control-and-prevention-situation-officials"}