{"authors": [], "date_download": "2024-10-12 13:42:01", "date_modify": "2024-10-12 13:42:01", "date_publish": "2023-11-02 00:16:18", "description": "These blobs may be relics from a cataclysm early in Earth's history. Read more at straitstimes.com.", "filename": "asia_relics-of-huge-primordial-collision-reside-in-earths-deep-interior_1728740521.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/02/LYNXMPEJA01K7-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_relics-of-huge-primordial-collision-reside-in-earths-deep-interior_1728740521.html", "title": "Relics of huge primordial collision reside in Earth's deep interior", "title_page": "Relics of huge primordial collision reside in Earth's deep interior | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Seismologists have recognised since the 1970s that two mysterious continent-sized blobs reside in the deepest part of Earth's mantle, one under Africa and the other under the South Pacific region.\nThese blobs, denser than the material surrounding them, may be relics from a cataclysm early in our planet's history hypothesised to have spawned the moon - the collision between primordial Earth and a Mars-sized object called Theia, researchers said on Wednesday.\nThis giant impact, which recent research determined occurred 4.46 billion years ago, blasted molten rock into space that orbited Earth and coalesced into the moon. But chunks of Theia may have remained inside Earth, sinking to a location just above our planet's wickedly hot spherical core of iron and nickel.\nThe researchers ran computer simulations examining the impact event, geophysical properties of the material that likely made up Theia and the evolution of Earth's mantle - the broadest of the layers that comprise our planet's interior structure at about 1,800 miles (2,900 km) thick.\nBased on these simulations, they proposed that most of Theia was absorbed into Earth, forming the blobs, while residual debris formed the moon.\n\"The bottoms of these blobs are 2,900 kilometers below our feet. The two blobs are about 2 per cent of Earth's mass. They were detected by seismology as seismic waves travel slower within these two regions compared to the surrounding mantle. Each of the blobs are twice the mass of the whole moon. So, the blobs are massive,\" said Caltech geophysicist Qian Yuan, lead author of the study published in the journal Nature.\nIf the study's conclusions are correct, these blobs would represent the first direct evidence of the hypothesised moon-forming collision.\n\"There hasn't been much consensus on whether we can find evidence for this event not just in the moon but also in some observable property of the modern Earth,\" Caltech geology and geochemistry professor and study co-author Paul Asimow said.\nThe two blobs, Asimow added, \"are the biggest deviations in Earth structure from a simple layered planet.\"\n\"It is incredible because we can uncover relics of another planet - Theia - if we dig deep enough in Earth's mantle,\" added planetary scientist and study co-author Hongping Deng of the Chinese Academy of Sciences' Shanghai Astronomical Observatory.\nThe increased density of the blobs is thought to arise from their high level of iron - much like moon rocks, which would make sense if they are made of the same source material from Theia.\n\"After the impact, these impactor materials would sink down to the core-mantle boundary because they likely have higher density than ambient mantle, and it is the extra density that allows them to survive Earth's whole history,\" Yuan said.\nThe moon, which orbits Earth at an average distance of about 239,000 miles (385,000 km), has a diameter of about 2,160 miles (3,475 km), a bit more than a quarter of our planet's diameter.\nAsimow said that if their conclusions are correct some volcanic rocks that reach Earth's surface may provide samples of a vanished planet.\n\"If our model is correct, the blobs should have isotopes - trace elements - that are similar to the lunar mantle rocks, which can be tested in future lunar missions,\" Yuan said.\nGaining a greater understanding of the hypothesised giant impact may provide insight concerning the evolution of Earth and other rocky planets in our solar system and beyond.\n\"We suspect that large impacts are common in the later stages of accretion of all terrestrial (rocky) planets and exoplanets,\" Asimow said. \"As we try to develop a catalog of what the possible outcomes of planet formation are - how likely is a planet like Earth, rather than like Mars, Mercury, Venus or none of the above, and hence how likely are we to find other Earth-like planets - it follows that we need to work out the consequences of these impacts.\" REUTERS", "url": "https://www.straitstimes.com/asia/relics-of-huge-primordial-collision-reside-in-earths-deep-interior"}