{"authors": [], "date_download": "2024-10-12 13:45:44", "date_modify": "2024-10-12 13:45:44", "date_publish": "2023-09-30 08:17:54", "description": "Indian Foreign Minister Subrahmanyam Jaishankar said on Friday there was a \\\"climate of violence\\\" and an \\\"atmosphere of intimidation\\\" against Indian diplomats in Canada, where the presence of Sikh separatist groups has frustrated New Delhi. Read more at straitstimes.com.", "filename": "asia_indias-jaishankar-says-canada-has-climate-of-violence-for-indian-diplomats_1728740744.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/30/LYNXMPEJ8T009-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_indias-jaishankar-says-canada-has-climate-of-violence-for-indian-diplomats_1728740744.html", "title": "India's Jaishankar says Canada has 'climate of violence' for Indian diplomats", "title_page": "India's Jaishankar says Canada has 'climate of violence' for Indian diplomats | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Indian Foreign Minister Subrahmanyam Jaishankar said on Friday there was a \"climate of violence\" and an \"atmosphere of intimidation\" against Indian diplomats in Canada, where the presence of Sikh separatist groups has frustrated New Delhi.\n\"Because there is freedom of speech, to make threats and intimidate diplomats, I don't think that's acceptable,\" Jaishankar told reporters on Friday evening in Washington.\nRelations between India and Canada have been tense of late, mostly due to the presence of Sikh separatists in Canada who have kept alive the movement for Khalistan, or the demand for an independent Sikh state to be carved out of India.\nCanada's foreign ministry did not immediately respond to a request for comment.\nEarlier this month, Canadian Prime Minister Justin Trudeau alleged that Indian agents may have had a role in the June murder of Sikh separatist leader and Canadian citizen Hardeep Singh Nijjar, who was labeled a \"terrorist\" by India.\nNew Delhi dismissed the allegations as absurd. Washington has urged India to cooperate with Canada in the murder probe.\nIn 2018, Trudeau assured India that Canada would not support anyone trying to revive a separatist movement in India, while repeatedly saying that he respects the right to free speech and assembly of protesters to demonstrate.\nCanada is home to an influential Sikh community, and Indian leaders say some fringe groups there remain sympathetic to the cause of an independent Sikh state. The cause hardly has any support in India.\nThe demand for Khalistan has surfaced many times in India, most prominently during a violent insurgency in the 1980s and 1990s which paralyzed the state of Punjab for over a decade.\nThe insurgency killed tens of thousands of people and the Khalistan movement is considered a security threat by the Indian government. Sikh militants were blamed for the 1985 bombing of an Air India Boeing 747 flying from Canada to India in which all 329 people on board were killed.\nIndian Prime Minister Indira Gandhi was assassinated in 1984 by two Sikh bodyguards after she allowed the storming of the holiest Sikh temple, aimed at flushing out Sikh separatists. REUTERS", "url": "https://www.straitstimes.com/asia/indias-jaishankar-says-canada-has-climate-of-violence-for-indian-diplomats"}