{"authors": [], "date_download": "2024-10-12 13:44:05", "date_modify": "2024-10-12 13:44:05", "date_publish": "2023-01-15 14:24:28", "description": "Hundreds of rescue workers scoured the hillside where the flight carrying 72 people came down. Read more at straitstimes.com.", "filename": "asia_south-asia_at-least-68-killed-in-nepal-s-worst-air-crash-in-three-decades_1728740645.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/23/rryeti1601.jpg?VersionId=kF5Rk3K3UOmTEZMOAFT3NMXJCeaLQRgz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_at-least-68-killed-in-nepal-s-worst-air-crash-in-three-decades_1728740645.html", "title": "At least 68 killed in Nepal’s worst air crash in three decades", "title_page": "At least 68 killed in Nepal’s worst air crash in three decades | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KATHMANDU - At least 68 people were killed on Sunday when a domestic flight of Yeti Airlines crashed in Pokhara in Nepal, the worst air crash in three decades in the small Himalayan nation.\nHundreds of rescue workers scoured the hillside where the flight carrying 72 people from the capital Kathmandu went down.\nOfficials late in the evening called off the search operations for the day, saying they will resume on Monday.\nLocal TV footage earlier showed rescue workers scrambling around broken sections of the aircraft. Some of the ground near the crash site was scorched, with licks of flames visible.\nThe weather had been clear and there was no immediate indication of what caused the crash.\nIt was Nepal’s deadliest air crash since 1992, the Aviation Safety Network database showed, when a Pakistan International Airlines Airbus A300 crashed into a hillside upon approach to Kathmandu, killing all 167 people on board.\nNearly 350 people have died since 2000 in plane or helicopter crashes in Nepal - home to eight of the world’s 14 highest mountains, including Everest - where sudden weather changes can make for hazardous conditions.\nThe European Union has banned Nepali airlines from its airspace since 2013, citing safety concerns.\nThe plane on Sunday made contact with Pokhara airport from Seti Gorge at 10:50 a.m. (0505 GMT), the Civil Aviation Authority said in a statement. “Then it crashed.”\nAt least 68 people were confirmed dead, it said.\n“Half of the plane is on the hillside,” said Mr Arun Tamu, a local resident, who told Reuters he reached the site minutes after the plane went down.\n“The other half has fallen into the gorge of the Seti river.”\nMr Khum Bahadur Chhetri, another local resident, said he watched from the roof of his house as the flight approached.\n“I saw the plane trembling, moving left and right, and then suddenly it nosedived and it went into the gorge,” Mr Chhetri said.\nThe government has established a panel to investigate the cause of the crash and it is expected to report within 45 days, finance minister Bishnu Paudel told reporters.\nFrance’s air accident investigation agency BEA said it would participate in the probe into the causes of the crash and coordinate with all other parties involved.\nThose on board the twin-engine ATR 72 aircraft included three infants and three children, the Civil Aviation Authority’s statement said.\nPassengers included five Indians, four Russians and one Irish, two South Korean, one Australian, one French and one Argentine national.\nYeti cancels flights\nThe journey to Pokhara, Nepal’s second largest city tucked under the picturesque Annapurna mountain range, from the capital Kathmandu is one of the country’s most popular tourist routes, with many preferring a short flight instead of a six-hour-long drive through hilly roads.\nA Pokhara Airport spokesman said the aircraft crashed as it approached the airport, adding that the “plane cruised at 12,500 feet and was on a normal descent.” The weather on Sunday was clear.", "url": "https://www.straitstimes.com/asia/south-asia/at-least-68-killed-in-nepal-s-worst-air-crash-in-three-decades"}