{"authors": ["Elizabeth Law"], "date_download": "2024-10-12 14:12:20", "date_modify": "2024-10-12 14:12:20", "date_publish": "2022-10-23 15:33:35", "description": "Mr Li, 66, has also been named the seventh member of the Politburo Standing Committee. Read more at straitstimes.com.", "filename": "asia_east-asia_guangdong-party-chief-li-xi-named-china-s-anti-corruption-czar_1728742340.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/23/10260291_0.jpg?VersionId=mb6iNKKJuatEHjuNMgVuRsYH8dgLrtBO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_guangdong-party-chief-li-xi-named-china-s-anti-corruption-czar_1728742340.html", "title": "Guangdong party chief Li Xi named China’s anti-corruption czar", "title_page": "Guangdong party chief Li Xi named China’s anti-corruption czar | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Guangdong party chief Li Xi will be China’s new anti-corruption czar, an official announcement showed on Sunday, following a meeting of the Communist Party of China’s (CPC) new Central Committee.\nThe 20th Central Committee, which had been unveiled on Saturday following a week-long meeting of some 2,300 party cadres from all over the country, picked members of the Politburo Standing Committee (PSC), China’s apex leadership body.\nMr Li, 66, who has been named the seventh member of the PSC, was also named in the same announcement as head of the Central Commission for Discipline Inspection (CCDI), China’s anti-graft watchdog.\nA native of north-west China’s Gansu, Mr Li spent most of his early career in the province before moving to Shaanxi province in 2004. He later spent four years in Shanghai and three years in Liaoning province before becoming party chief of Guangdong, an economic powerhouse.\nMr Li is believed to have close ties to President Xi Jinping. He used to be a former assistant to Mr Li Ziqi, a former Gansu party secretary who was close to Mr Xi’s father Xi Zhongxun. It was through this connection that Mr Li Xi eventually became a close confidant of President Xi. While Mr Li was party chief in Liaoning, he was an enthusiastic supporter of Mr Xi’s call for stricter enforcement of party discipline.\nThe powerful CCDI, ostensibly in charge of party discipline, also serves as China’s anti-graft body. Since President Xi came to power a decade ago, he has made fighting corruption a hallmark of his term, cleaning up what he felt was a culture of privilege among officials.\nBut critics said the campaign was also used to take down powerful rivals, including former Chongqing party boss Bo Xilai, who was jailed for life in 2013 for corruption, embezzlement and abuse of power.\nMembers of the CCDI, along with the CPC Central Committee, were picked by party cadres in elections on Saturday.\nOn Saturday, the party congress voted to pass a resolution on CCDI’s work report from the past five years, acknowledging that the commission members have “faithfully performed their duties as prescribed by the party constitution”.\n“(They have) remained committed to improving party conduct, promoting integrity, and combating corruption, and have advanced high-quality development of discipline inspection and supervision in the new era,” said the resolution that was read out during the closing ceremony of the congress.", "url": "https://www.straitstimes.com/asia/east-asia/guangdong-party-chief-li-xi-named-china-s-anti-corruption-czar"}