{"authors": [], "date_download": "2024-10-12 13:37:28", "date_modify": "2024-10-12 13:37:28", "date_publish": "2023-03-16 07:50:25", "description": "Some of Japan’s best-known brands are reluctant to invest in the military side of their businesses. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-battles-to-persuade-its-big-brands-to-join-military-buildout_1728740248.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/16/aijapan1603_2.JPG?VersionId=IM08hwV5lqQL0N4MdMXr_h7ih_D0d3rO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-battles-to-persuade-its-big-brands-to-join-military-buildout_1728740248.html", "title": "Japan battles to get big brands to invest in military expansion", "title_page": "Japan battles to get big brands to invest in military expansion | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - As Tokyo spins up its defence industry for the country’s largest military expansion since World War II, it has run into a challenge: Some of Japan’s best-known brands are reluctant to invest in the military side of their businesses.\nJapan, which renounced war in 1947, unveiled in 2022 a five-year US$315 billion (S$425.7 billion) military expansion to deter Beijing from using force in the East China Sea amid growing concern that Russia’s attack on Ukraine could embolden China to invade Taiwan.\nBut a key part of Tokyo’s strategy hinges on persuading companies such as Toshiba, Mitsubishi Electric and Daikin Industries, which for decades have quietly armed the country’s Self-Defence Forces (SDF), to ramp up production.\nIn a country with an ingrained public sentiment against militarism, that is proving a hard sell for some suppliers, according to Reuters interviews with six government and company officials.\nIn private meetings with the Defence Ministry over the last year, some companies have raised concerns such as low profit margins, the financial risk of building manufacturing plants that could be left idle after Japan completes its military expansion, and potential damage to their public image from arms sales, said an official involved in the talks.\nThe official declined to be identified or attribute the complaints to specific companies, citing the confidential nature of the talks.\nThe government is preparing legislation that includes raising profit margins on military gear from a few per cent to as much as 15 per cent, and the provision of state-owned factories that companies can use to expand production risk-free. Some are concerned that might not be enough.\n“Until now, the ministry has taken the defence companies for granted,” said Mr Masahisa Sato, an influential ruling-party lawmaker and former deputy defence minister.\nMr Sato said it was increasingly difficult for Japanese executives to justify defence sales out of “patriotic duty” to shareholders focused on more profitable civilian ventures.\nPrime Minister Fumio Kishida’s military build-up plan identifies defence manufacturing as a key pillar of national security.\nJapan, however, does not have a national defence champion such as Lockheed Martin in the United States or Britain’s BAE Systems, and many of the companies supplying the SDF are associated with more mundane products.\nAt Japan’s biggest defence company, Mitsubishi Heavy Industries, which is developing Japan’s next fighter jet and new longer-range missiles to help deter China, military contracts account for only a tenth of its US$29 billion in revenue in 2022. Most of its business is civilian aircraft components, power plant equipment and factory machines.\nAir-conditioner manufacturer Daikin has a munitions sideline; Toshiba, which makes electronic goods such as printers, produces military-grade batteries; and Mitsubishi Electric makes radars and missiles alongside fridges and vacuum cleaners.\nSince 2022, defence officials have been meeting these companies and other suppliers like car and helicopter maker Subaru, to urge them to expand their military units.\nReuters contacted 15 leading Japanese defence manufacturers whose chief executives the Defence Ministry invited to talks with then Defence Minister Nobuo Kishi last April, and in January with his successor Yasukazu Hamada.\nThree of them, Mitsubishi Heavy, Mitsubishi Electric, and IHI – which makes jet engines, bridges and heavy machinery – confirmed they had also taken part in other lower-level discussions.\nFive companies did not reply and the rest declined to say whether they had joined in other discussions. The companies which responded declined to give details of the meetings or any concerns they raised during the talks.\nMany companies are reluctant to talk about their defence units, fearing it might put off customers at home, where anti-military sentiment lingers, or overseas, particularly in China, where resentment over Japan’s wartime past could be politicised.\nReuters asked 10 of Japan’s military suppliers, including Toshiba, Mitsubishi Electric, Daikin and Subaru, for interviews with their defence unit managers. Only Mitsubishi Electric agreed.\nMr Masahiko Arai, head of Mitsubishi Electric’s defence systems division, said he welcomed government proposals and hoped that contributing to Japan’s “safety and security” would be beneficial for the company.\nHis biggest concern, he said, was what would happen after Japan’s five-year military build-up ends. His unit accounted for about 4 per cent of the US$34 billion in sales the company recorded in the last business year.\nAn official at another major Japanese defence supplier, who requested anonymity because of the sensitivity of the issue, said being directly involved with regional tensions might be bad for business.\n“Reputation risk worries us a lot,” he said. “There have been occasions when our Chinese customers expressed their discomfort when the topic of defence came up.”\nDespite diplomatic tensions, China is Japan’s top trade partner and a major manufacturing base for many Japanese companies.\nWhen Japan ended a decades-long ban on military exports in 2014, it did not spur industry growth because of corporate timidity and overly cautious bureaucrats, analysts say.\nMitsubishi Electric is the only company to have sold defence equipment overseas, with a deal in 2020 to supply radar systems to the Philippines.\nChemical company Daicel announced it would close its pilot-ejection system unit in 2020, and Sumitomo Heavy Industries said it told the Defence Ministry in 2021 that it would stop making machine guns.\nDaicel cited low profitability, while Sumitomo Heavy said it was difficult to maintain production and train engineers.\nAn opinion poll published by the government in March suggests there is growing public support for a bigger military as regional tensions with China and North Korea escalate.\nIn the survey of 1,602 people, 41.5 per cent said they wanted to expand the SDF, up from 29.1 per cent in the last poll five years ago.\nEven so, Japanese companies often refer to their military products as “special equipment”, the government official said.\nDaikin, which generates 90 per cent of its revenue from air-conditioning systems, is among them. It does not list the artillery and mortar shells it makes at its Yodogawa plant in Osaka, western Japan, on its website.\n“We aren’t keeping our defence business secret; we disclose information about it in a regular way,” a Daikin spokeman said. “It’s not about reputation risk.”\nOn a street outside the barbed wire-topped wall that surrounds the Daikin factory, Ms Reiko Okumoto, 66, said she had lived in the working-class neighbourhood surrounding it for more than 40 years without knowing it produces shells.\n“It would be good if (Daikin) could step away from military work,” she said. “But given how the world is, I know that’s unrealistic.” REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/japan-battles-to-persuade-its-big-brands-to-join-military-buildout"}