{"authors": [], "date_download": "2024-10-12 13:38:01", "date_modify": "2024-10-12 13:38:01", "date_publish": "2024-03-24 11:23:47", "description": "The confrontation on March 23 caused severe damage to the vessel, the Unaizah May 4, said Manila. Read more at straitstimes.com.", "filename": "asia_china-vows-to-safeguard-its-territorial-integrity-after-south-china-sea-incident_1728740281.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/24/LYNXNPEK2N00L-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-vows-to-safeguard-its-territorial-integrity-after-south-china-sea-incident_1728740281.html", "title": "Philippines says 3 soldiers hurt in water cannon incident; China vows to safeguard territorial integrity", "title_page": "Philippines says 3 soldiers hurt in water cannon incident; China vows to safeguard territorial integrity | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – Three Philippine troops were injured in the latest China Coast Guard water cannon attack on a Filipino supply vessel near a South China Sea reef, Manila’s national security adviser said on March 24.\nThe Philippine government said the confrontation on March 23 caused severe damage to the vessel, the Unaizah May 4, while it was on its way to deliver troops and provisions to a Philippine navy ship grounded atop the Second Thomas Shoal.\nChina claims almost the entire South China Sea, brushing off rival claims from other countries, including the Philippines, and an international ruling that its assertion has no legal basis.\nPhilippine National Security Adviser Eduardo Ano said three navy personnel aboard the vessel were injured in the latest incident.\nThe extent and nature of their injuries were not disclosed, although the military said the personnel were treated aboard a coast guard escort ship.\nFour crew members were injured by broken glass in an earlier China Coast Guard water cannon attack on the same vessel on March 5.\n“This is just an ordinary rotation and resupply or provision operation, but look at how the Chinese are reacting,” Mr Ano told reporters.\nHe said the damaged vessel has returned to the western province of Palawan after its crew managed to restart its engine.\n“We will not be deterred. We will not be intimidated,” Mr Ano said, vowing that the Philippines would continue to resupply the garrison on Second Thomas Shoal.\nThe United States, which has a mutual defence pact with Manila, has denounced the attack.\n“The (Chinese) actions are destabilising to the region and show clear disregard for international law,” State Department spokesman Matthew Miller said in a statement.\nChina’s Defence Ministry defended the coast guard’s actions, and warned the Philippines on March 24 against “provocative” actions.\n“We warn the Philippines to stop making any remarks that may lead to the intensification of conflicts and escalation of the situation, and stop all infringing and provocative actions,” the ministry said in a statement.\n“If the Philippines repeatedly challenges China’s bottom line, China will continue to take firm and decisive measures to firmly safeguard its territorial sovereignty and maritime rights and interests,” it added. AFP, REUTERS", "url": "https://www.straitstimes.com/asia/china-vows-to-safeguard-its-territorial-integrity-after-south-china-sea-incident"}