{"authors": [], "date_download": "2024-10-12 14:14:53", "date_modify": "2024-10-12 14:14:53", "date_publish": "2022-03-20 09:38:38", "description": "Vice-Foreign Minister Le Yucheng also acknowledged Moscow's point of view on Nato, saying the alliance should not further expand eastwards. Read more at straitstimes.com.", "filename": "asia_east-asia_chinese-official-calls-sanctions-on-russia-increasingly-outrageous_1728742493.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/20/42933349%20REUTERS%20china%20flag.JPG?VersionId=qiZD_BONSppEeP2B19pfyPYJuQZqgXzy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinese-official-calls-sanctions-on-russia-increasingly-outrageous_1728742493.html", "title": "China’s Vice-Foreign Minister calls sanctions on Russia increasingly 'outrageous'", "title_page": "China’s Vice-Foreign Minister calls sanctions on Russia increasingly 'outrageous' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (REUTERS) - A senior Chinese government official said on Saturday (March 19) that sanctions imposed by Western nations on Russia over Ukraine are increasingly \"outrageous\".\nVice-Foreign Minister Le Yucheng also acknowledged Moscow's point of view on Nato, saying the alliance should not further expand eastwards, forcing a nuclear power like Russia \"into a corner\".\nChina has yet to condemn Russia's action in Ukraine or call it an invasion, though it has expressed deep concern about the war.\nBeijing has also opposed economic sanctions on Russia over Ukraine, which it says are unilateral and are not authorised by the UN Security Council.\n\"The sanctions against Russia are getting more and more outrageous,\" Mr Le said at security forum in Beijing, adding that Russian citizens were being deprived of overseas assets \"for no reason\".\n\"History has proven time and again that sanctions cannot solve problems. Sanctions will only harm ordinary people, impact the economic and financial system... and worsen the global economy.\"\nRussia calls its actions in Ukraine a \"special operation\" that it says is not designed to occupy territory but to destroy its neighbour's military capabilities and capture what it regards as dangerous nationalists.\nIn a call on Friday between Mr Joe Biden and Mr Xi Jinping, the US president warned his Chinese counterpart of \"consequences\" if Beijing gave material support to Russia's attack, the White House said.\nMoscow has demanded legally binding guarantees from Nato that it will stop its expansion and return to its 1997 borders.\n\"This pursuit of absolute security (by Nato) precisely leads to absolute non-security,\" Mr Le said. \"The consequences of forcing a major power, especially a nuclear power, into a corner are even more unimaginable.\"\nPresident Volodymyr Zelensky said this week that Ukraine could accept international security guarantees that stopped short of its longstanding aim to join Nato.", "url": "https://www.straitstimes.com/asia/east-asia/chinese-official-calls-sanctions-on-russia-increasingly-outrageous"}