{"authors": ["Michelle Ng"], "date_download": "2024-10-12 13:51:59", "date_modify": "2024-10-12 13:51:59", "date_publish": "2024-03-01 16:35:00", "description": "Analysts say it will take time for city to attract more foreign investments. Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-aims-to-boost-global-edge-with-new-budget-but-faces-challenge-in-returning-to-glory-days_1728741119.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/01/408170873.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-aims-to-boost-global-edge-with-new-budget-but-faces-challenge-in-returning-to-glory-days_1728741119.html", "title": "Hong Kong aims to boost global edge with new Budget, but faces challenge in returning to glory days", "title_page": "Hong Kong aims to boost global edge with new Budget, but faces challenge in returning to glory days | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "In a bold move, Hong Kong scrapped all of its decade-old property cooling measures and slashed the usually generous “sweeteners” in its latest Budget, as the city focuses on transforming its economy and reviving its global competitive edge.\nPlans to deepen innovation and technology, attract tourist and investment dollars as well as prioritise spending on new sectors are, collectively, a clear pivot from previous years’ Budgets to address Hong Kong’s waning competitiveness and narrow the fiscal deficit, say analysts.\nHong Kong Financial Secretary Paul Chan, in his Budget speech on Feb 28, said the short-term goal is to stabilise confidence “so as to resist the impact brought about by the weak market resulting from external factors”, referring to the United States’ high interest rates as well as the struggling economy in mainland China.\n“In the mid-term, we need to deal with some challenges... our work is to grab enterprises, grab talent and grab capital. That will be our main task. In this respect, we are making progress,” he said.\nIn recent years, critics have argued that Hong Kong has lost its shine. The city has been struggling to reverse an outflow of businesses and residents following massive and often violent protests in 2019, a subsequent roll-out of a national security law by Beijing in 2020 that bans subversion, among other things, and tough Covid-19 restrictions.\nHong Kong’s economy has also been affected by the struggling Chinese economy.\nIts tourism sector, for instance, which relies on mainland China for about 80 per cent of its visitors, has been slow to recover as there have been fewer Chinese visitors.\nDespite the fresh effort, some analysts say Hong Kong faces an uphill task in returning to its pre-pandemic glory days.\nMr Gary Ng, senior economist at investment bank Natixis in Hong Kong, told The Straits Times that the announced Budget measures are far from enough to help the territory mitigate structural problems such as a labour shortage and a greying population.\n“The only spotlight in the Budget with a clear policy direction is on the real estate sector,” said Mr Ng, who covers Greater China’s macro economy.\nHe added that the lifting of all measures, including stamp duty applied to home owners who wish to sell their homes within two years, shows that the authorities are “desperate to stabilise the home market”, given the pressure of falling land sales, which form around 20 per cent of total revenue for the government.\nThe immediate axing of all property cooling measures is aimed at boosting the city’s sluggish real estate market by making it easier for home seekers to achieve their home ownership goals.\nHong Kong’s home prices, once the most expensive in the world, have plunged almost 20 per cent since their peak in 2021.\nMr Joseph Tsang, chairman of property consultancy JLL in Hong Kong, said he welcomes the move to withdraw all cooling measures and expects the downward trend in property prices to slow down, bringing stability to the market.\nBut given that other headwinds such as high interest rates and weak economic sentiment remain, he said that the withdrawal of the measures alone is not enough to reverse the downward trend. As a result, he expects home prices to continue to fall by around 10 per cent in 2024.\n“It will require interest rate cuts and an economic improvement for prices to bottom out and rebound,” he added.\nThe China factor\nNatixis’ Mr Ng pointed out that the government “may be barking up the wrong tree” in focusing on minor matters, such as monthly fireworks and drone shows, in a bid to entice tourists.\nRather, Hong Kong should be focusing more on ways to generate jobs and wealth such as keeping it easy for companies to do business and make money in the city, he said.\nMr Ng also noted that Hong Kong has been focusing on attracting foreign talent rather than retaining local talent, which does not ease the emigration trend. This is unlike Singapore, which, in its latest Budget on Feb 16, pumped in more education and upskilling support for its residents, he said.\nIn the latest Hong Kong Budget, the usually generous “sweeteners” were slashed, with consumption vouchers and electricity bill subsidies scrapped and the cap on income tax deductions halved, to the disappointment of some residents.\nWhen asked about the lack of “sweeteners” at a press conference after his Budget speech, Mr Chan said: “We believe it is better to improve the economy, which in turn can make people happier and have more money to spend, than help residents increase their income through government support measures.\n“Thus, we will put more resources into pushing economic development.”\nProfessor Donald Low of the Hong Kong University of Science and Technology noted that it was mostly a “belt-tightening Budget” aimed at shoring up revenues and reducing expenditures incurred during the pandemic, with little for its lower and middle-income residents.\nIn the 2023-24 fiscal year, Hong Kong is expected to record a HK$101.6 billion (S$17.5 billion) deficit, almost double the forecast given by the government in 2023. Its reserves are expected to dip to HK$733.2 billion by the end of March.\nHowever, the Hong Kong financial chief said the city will return to a budget surplus in two years with the help of bond issuances, even as it plans to dip further into its reserves.\nOverall, the economy is expected to grow at a steady pace of 2.5 per cent to 3.5 per cent in the medium term.\n“The message to the world is that despite the slow growth in recent years, the Hong Kong government is still a prudent and disciplined steward of public monies, that it won’t splurge or spend indiscriminately, and that it is still a low-tax place for foreign investors and talent,” said Prof Low.\nThat being said, analysts point out that the latest Budget measures can only go so far in bringing back Hong Kong’s appeal, given China’s tightening grip on the city.\nAssociate Professor Alfred Wu, from the Lee Kuan Yew School of Public Policy in Singapore, said: “In the short term, people may be happy when Hong Kong offers them an incentive to invest. But in the long term, there’s the China factor to consider, which may not appeal to some.\n“It will take time for Hong Kong to attract more foreign investments and return to their glory days,” he added.", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-aims-to-boost-global-edge-with-new-budget-but-faces-challenge-in-returning-to-glory-days"}