{"authors": [], "date_download": "2024-10-12 13:37:38", "date_modify": "2024-10-12 13:37:38", "date_publish": "2024-08-27 09:48:07", "description": "Manila urged other countries to call out China’s “illegal acts” until it yields to pressure to stop its actions. Read more at straitstimes.com.", "filename": "asia_philippines-says-china-is-biggest-disruptor-of-peace-in-the-region_1728740258.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/27/LYNXMPEK7Q014-1.jpg?VersionId=phUOqojZn.6ygbK0hi71HdEFn6nETu7R", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_philippines-says-china-is-biggest-disruptor-of-peace-in-the-region_1728740258.html", "title": "Philippines says China is ‘biggest disruptor’ of peace in South-east Asia", "title_page": "Philippines says China is ‘biggest disruptor’ of peace in South-east Asia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA - China is the “biggest disruptor” of peace in South-east Asia, the Philippines’ defence chief said on Aug 27, as tensions between Manila and Beijing over disputed reefs and waters in the South China Sea escalate.\nMr Gilberto Teodoro made the remarks at a conference of the US Indo-Pacific Command after repeated confrontations between Philippine and Chinese vessels in the waterway over the past 12 months.\nBeijing claims almost the entirety of the sea, brushing aside rival claims by other countries, including the Philippines, and an international ruling that its stance has no legal basis.\nChina’s claims include reefs and waters inside the Philippines’ exclusive economic zone, which extends about 370km from the country’s coastal waters.\n“China... is the biggest disruptor of international peace in the Asean region,” Mr Teodoro said, referring to the regional bloc.\nChina deploys boats to patrol the busy waterway and has built artificial islands that it has militarised to reinforce its claims.\nSpeaking to reporters, Mr Teodoro urged other countries to call out China’s “illegal acts” until it yields to pressure to stop its actions.\n“We need a collective consensus and a strong call-out against China,” said Mr Teodoro. “We are struggling against a more powerful adversary.”\nHis comments come a day after China said it took “control measures” against two Philippine Coast Guard ships that had entered waters near Sabina Shoal in the Spratly Islands.\nThe Philippine Coast Guard had sent two vessels to deliver provisions to one of its ships at the reef.\nThey were forced to abandon the mission due to China’s “excessive” deployment of ships and rough sea conditions, Commodore Jay Tarriela, a spokesman for Manila’s coast guard, told AFP on Aug 26.\nSeveral confrontations have taken place in recent days around Sabina Shoal, located 140km west of the Philippine island of Palawan and about 1,200km from Hainan island, China’s nearest major land mass.\nBoth sides have stationed coast guard vessels at the shoal in recent months.\nManila fears Beijing is about to build an artificial island.\nRelations between the countries have frayed as Philippine President Ferdinand Marcos Jr’s administration stands up to Chinese actions in the contested waters.", "url": "https://www.straitstimes.com/asia/philippines-says-china-is-biggest-disruptor-of-peace-in-the-region"}