{"authors": [], "date_download": "2024-10-12 13:37:04", "date_modify": "2024-10-12 13:37:04", "date_publish": "2024-01-31 19:07:30", "description": "Talks between the U.S. and Chinese officials on stemming the flow of chemicals used for the production of deadly fentanyl have been \\\"substantive\\\" but \\\"much more\\\" needs to be done, the head of the White House delegation to Beijing said on Wednesday. Read more at straitstimes.com.", "filename": "asia_us-says-fentanyl-talks-with-china-meaningful-but-more-needs-to-be-done-official__gl=1_17qrz7z__gcl_au_MTQ1NjEwODM2LjE3MjMwNDE3MzI_1728740224.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/31/LYNXMPEK0U0DQ-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_us-says-fentanyl-talks-with-china-meaningful-but-more-needs-to-be-done-official__gl=1_17qrz7z__gcl_au_MTQ1NjEwODM2LjE3MjMwNDE3MzI_1728740224.html", "title": "US says fentanyl talks with China 'meaningful' but more needs to be done: Official", "title_page": "US says fentanyl talks with China 'meaningful' but more needs to be done: Official | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Talks between the U.S. and Chinese officials on stemming the flow of chemicals used for the production of deadly fentanyl have been \"substantive\" but \"much more\" needs to be done, the head of the White House delegation to Beijing said on Wednesday.\nWashington hopes for deeper law enforcement cooperation, including on tackling illicit finance, and wants Beijing to put further controls on the chemicals that can be used to make fentanyl, said Deputy Assistant to the President and Deputy Homeland Security Advisor Jen Daskal.\n\"There is a lot more action that's needed in a range of areas that we discussed,\" Daskal told Reuters in an interview at the U.S. embassy in Beijing after the talks, adding \"there's a renewed spirit of commitment to cooperate\".\nDaskal led an interagency delegation that held two days of talks with Chinese counterparts, resulting in the launch of a counter-narcotics working group - the first serious sign of cooperation on tackling the spread of fentanyl since late 2019.\nThe Beijing meetings follow a summit in San Francisco in November where U.S. President Joe Biden and Chinese leader Xi Jinping agreed to work on the issue, marking a notable shift in tone between the leaders and warming of relations.\nFentanyl is a leading cause of drug overdoses in the United States. The U.S. has said that China is the primary source of the precursor chemicals synthesized into fentanyl by drug cartels in Mexico. China denies this.\nFollowing the talks, China said on Tuesday they were \"in-depth and pragmatic,\" expressing hope the two sides could accommodate each other's concerns and \"enhance and expand cooperation to provide more positive energy for stable, sound and sustainable China-U.S. relations\".\nDaskal \"applauded\" China for taking a series of concrete steps after the November summit and even before the group had been launched, and urged further action.\n\"They've taken some enforcement actions against some particular companies that were engaging in particularly concerning illicit behavior,\" said Daskal.\nShe also said China has started to send information to the International Narcotics Control Board about particular incidents, \"that then allow global law enforcement agencies around the world to follow up on that information.\"\nTies between the two countries have been tense in recent years over a range of issues including the origins of COVID-19, trade tariffs, Taiwan and human rights, hampering Washington's hopes of persuading China to re-join its efforts to stop the flow of fentanyl into the United States.\nIn November 2019, in an unusual disclosure of Sino-U.S. cooperation in cracking down on fentanyl crimes, Chinese and U.S. law enforcement jointly announced that they had worked together to break up a smuggling ring.\nBut such cooperation on narcotics fizzled out when COVID-19 arrived, and multiple geopolitical headwinds pushed bilateral ties to their lowest in decades.\nDaskal said that \"there's a lot that companies can do...to stop selling to customers that are engaged in what is apparently bad behavior and to ensure they are labeling their exports correctly.\"\nShe said she expected to measure the progress of the cooperation during meetings between senior government officials in February and over the summer in Washington. REUTERS", "url": "https://www.straitstimes.com/asia/us-says-fentanyl-talks-with-china-meaningful-but-more-needs-to-be-done-official?_gl=1*17qrz7z*_gcl_au*MTQ1NjEwODM2LjE3MjMwNDE3MzI."}