{"authors": [], "date_download": "2024-10-12 13:48:20", "date_modify": "2024-10-12 13:48:20", "date_publish": "2021-11-13 12:48:28", "description": "Students are having online classes from their dormitories. Read more at straitstimes.com.", "filename": "asia_east-asia_chinas-dalian-city-locks-down-thousands-in-universities_1728740900.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/11/13/md_dalian_131121.jpg?VersionId=6vsWqEyeuOoYfpfU6MMzjsrwjuxnuAm5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinas-dalian-city-locks-down-thousands-in-universities_1728740900.html", "title": "China's Dalian city locks down thousands in universities to curb Covid-19 outbreak", "title_page": "China's Dalian city locks down thousands in universities to curb Covid-19 outbreak | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DALIAN (BLOOMBERG) - Tens of thousands of university students are under lockdown on their campuses in the north-eastern Chinese city of Dalian, which is battling the biggest flare-up in the country's current outbreak, according to newspaper Dushikuaibao.\nTwo universities in Zhuanghe in Dalian have imposed the curbs since the port city discovered Covid-19 cases on Nov 4, the report said, citing university students. Students are having online classes from their dormitories, the paper said.\nChina has been struggling to contain its fourth outbreak of the more infectious Delta variant of the coronavirus in the past five months.\nWith more than 1,000 locally transmitted infections spread across 21 provinces, it is already the broadest flare-up since the virus first emerged in Wuhan.\nDalian has become the country's latest Covid-19 hot spot, reporting 40 local cases on Saturday (Nov 13) out of the 57 new infections added nationwide.\nIn efforts to reduce transmission, the city's authorities have urged people not to leave their homes and halted operations at public venues deemed non-essential.", "url": "https://www.straitstimes.com/asia/east-asia/chinas-dalian-city-locks-down-thousands-in-universities"}