{"authors": [], "date_download": "2024-10-12 14:03:29", "date_modify": "2024-10-12 14:03:29", "date_publish": "2024-06-26 20:15:00", "description": "Japanese instant noodle giant Nissin Foods released a new pufferfish flavour on June 24. Read more at straitstimes.com.", "filename": "asia_east-asia_cup-noodles-in-japan-serve-up-notoriously-poisonous-pufferfish_1728741809.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/fdnoodle.png?VersionId=GjBWihXDPIdZGmAdGPnJbFS8VWE2u5Ky&h=53830f0c", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_cup-noodles-in-japan-serve-up-notoriously-poisonous-pufferfish_1728741809.html", "title": "Cup noodles in Japan serve up notoriously poisonous pufferfish", "title_page": "Cup noodles in Japan serve up notoriously poisonous pufferfish | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Pufferfish is regarded as a luxury in Japan and a meal featuring the potentially poisonous delicacy can easily cost up to 20,000 yen (S$169) at high-end restaurants.\nBut now, adventurous foodies in Japan can get a taste of “fugu” for a fraction of the price, from cup noodles.\nJapanese instant noodle giant Nissin Foods released the new pufferfish flavour on June 24, expanding its massive line-up. The noodles sell for a recommended price of 298 yen.\nThe “essence” of pufferfish is condensed into a small packet of oil to be added to the soup base, Nissin said in a statement on its website, though it did not divulge how the potentially deadly flavouring is prepared.\n“In recent years... ramen shops specialising in fugu ramen have been popping up, grabbing the hearts of many ramen fans,” it said.\nA Nissin spokesperson told CNN it has no plans to sell the fugu flavour outside Japan.\nEach cup comes with dried chicken meatballs, spring onions and Japanese-style shredded egg in a soup base enriched by a dash of yuzu, according to the statement.\nA CNN journalist who tried the instant noodles said they tasted of seafood broth and yuzu, a citrus fruit commonly used in Japanese cooking. Fugu generally has a mild flavour, which was not prominent in the dish.\nNissin was founded in 1958 by Mr Momofuku Ando, who saw a need for cheap, accessible food amid shortages following the end of World War II.\nThe company has since expanded into an international household name synonymous with its signature cup noodles.\nIt posted revenue of more than 732 billion yen in the year to March 2024.\nWhile pufferfish, served regularly as sashimi or in hotpot, is a prized item in the Japanese culinary world, almost all of them are poisonous and could, in serious cases, cause death if not properly prepared.\nThe fish’s organs, skin, blood and bones contain high concentrations of tetrodotoxin, a deadly poison. Eating it can cause tingling around the mouth and dizziness, which may be followed by convulsions, respiratory paralysis and death, medical experts say.\nAccording to Western Australia’s Department of Fisheries, pufferfish, which are found in tropical and subtropical ocean waters, are the second-most poisonous vertebrate in the world after the golden poison frog, which is native to Colombia.\nChefs in Japan must train for at least two years before being allowed to take an examination to qualify to prepare fugu.\nIn 2018, a supermarket in Gamagori city, in Japan’s central Aichi prefecture, issued an alert after two people consumed potentially dangerous fugu products they bought from a supermarket.\nThe pair did not report any health problems, but the authorities found that a licensed employee had failed to remove the fish’s poisonous liver.\nThe Japanese delicacy has also been gaining traction overseas in recent years, though it has caused the occasional food scare, or even death.\nIn 2020, three people in the Philippines died after they ate pufferfish from a barbecue stand.\nAn elderly couple in Malaysia died in 2023 after eating pufferfish, prompting an appeal from their daughter for stricter regulations.\nThe two, in their early 80s, unknowingly purchased at least two pufferfish from an online vendor and died after consuming them. CNN", "url": "https://www.straitstimes.com/asia/east-asia/cup-noodles-in-japan-serve-up-notoriously-poisonous-pufferfish"}