{"authors": ["Zunaira Saieed"], "date_download": "2024-10-12 13:27:04", "date_modify": "2024-10-12 13:27:04", "date_publish": "2024-10-11 15:00:00", "description": "From 2025, Johor will revert to a Saturday-Sunday weekend from the existing Friday-Saturday one. Read more at straitstimes.com.", "filename": "asia_se-asia_leave-johor-if-not-happy-with-weekend-change-says-tunku-ismail_1728739624.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/JKtmj9.jpg?VersionId=86a15PFLH0BZKwlYXKeyc8LwV21IUFJJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_leave-johor-if-not-happy-with-weekend-change-says-tunku-ismail_1728739624.html", "title": "Leave Johor if not happy with weekend change, says Regent", "title_page": "Leave Johor if not happy with weekend change, says Regent | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Johor’s Regent, Tunku Ismail Sultan Ibrahim, has said that those who disagree with the southern state’s decision to change the weekend to Saturday and Sunday can move to other Malaysian states that have Friday and Saturday as their weekend.\n“If there are parties upset or dissatisfied due to personal agendas, want to provoke the rakyat (people) or have political interests, you are welcome to move to states that still have Friday and Saturday as weekends,” said Tunku Ismail in a stern rebuke posted on Facebook on Oct 10.\nOther states in Muslim-majority Malaysia which follow the Friday-Saturday weekend are Kelantan, Terengganu and Kedah. These states are controlled by opposition alliance Perikatan Nasional, led by the conservative Parti Islam SeMalaysia (PAS) and Parti Pribumi Bersatu Malaysia.\nOn Oct 7, Tunku Ismail announced that Johor will revert to a Saturday-Sunday weekend in 2025 from the existing Friday-Saturday schedule. He said this decision took into account Johoreans’ desire for more family time and was in line with development projects that will benefit the state and its people.\nHowever, the decision was criticised by lawmakers from PAS and from Prime Minister Anwar Ibrahim’s Parti Keadilan Rakyat (PKR), who said Friday should be prioritised as it is the holy day for Muslims.\nJohor changed its weekend to Friday and Saturday in 2014, in a move to honour the significance of Friday for Muslims and to recognise Islam as the state’s religion.\nPKR MP Hassan Abdul Karim said that a Saturday-Sunday weekend aligns with the preferences of the British, Malaysia’s former colonists, and changing the existing weekend disregards the state’s culture, political history, and understanding.\n“Reverting to Sunday as a weekend and making Friday a working day was something the state had done a few years back. However, it did not last long because the Muslims in Johor did not support the move,” he said in a statement on Facebook.\nEchoing similar views, Johor PAS leader Mohd Mazri Yahya described the Saturday-Sunday weekend as a “colonial legacy”.\nCalling for parties to cease politicising the decision, Johor’s Menteri Besar Onn Hafiz Ghazi said on Oct 11 that issues like this could exacerbate tensions and disrupt harmony within the state.\n“The state government believes that not all matters should be politicised. Every decision is made in the best interest of the state and the people of Johor in mind,” he said in a statement on Facebook.\nAnalysts say the political parties’ criticism is economically regressive, pointing out that the new weekend arrangement helps Johor align its economic activities with the federal government and enhances international business relations with neighbouring countries like Singapore and Indonesia.\nSaid Mr Halmie Azrie Abdul Halim, a senior analyst at political risk consultancy Vriens and Partners: “With the anticipated increase in investments flowing into the Johor-Singapore Special Economic Zone, the new weekend changes will cater to the needs of incoming investors, as international businesses typically operate on Friday. PAS’ ‘colonial’ statement will be seen as economically backward.”\nThe current working week in Johor, which takes up four weekdays instead of the traditional five, could raise business costs for those investing in Johor with overseas operations, said Mr Amir Fareed Rahim, strategy director at political risk consultancy KRA Group.\n“For international businesses, Sunday is a holiday, and if they need to operate on a Sunday, the company would incur overtime charges for employees, which would increase the cost of doing business,” he said.", "url": "https://www.straitstimes.com/asia/se-asia/leave-johor-if-not-happy-with-weekend-change-says-tunku-ismail"}