{"authors": [], "date_download": "2024-10-12 13:51:05", "date_modify": "2024-10-12 13:51:05", "date_publish": "2024-01-09 12:21:36", "description": "There was no indication of how the reserves would be financed. Read more at straitstimes.com.", "filename": "asia_japan-to-expand-fy202425-budget-reserves-for-earthquake-aid_1728741065.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/09/LYNXMPEK0804C-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_japan-to-expand-fy202425-budget-reserves-for-earthquake-aid_1728741065.html", "title": "Japan to expand FY2024/25 budget reserves for earthquake aid", "title_page": "Japan to expand FY2024/25 budget reserves for earthquake aid | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan plans to expand its budget reserves for fiscal year 2024/2025 to support recovery from the Noto Peninsula earthquake, Finance Minister Shunichi Suzuki said on Jan 9.\nThe Cabinet earlier on Jan 9 approved 4.74 billion yen (S$43.8 million) in spending from fiscal year 2023/2024 reserves for aid, such as water, food, diapers and heaters, Mr Suzuki also said.\nUsing reserves allows for a faster and more “realistic” response than compiling an extra budget, Mr Suzuki told a press conference, indicating the possibility of further expenditure from reserves as damage from the temblor becomes clearer.\nThe magnitude-7.6 earthquake that hit Noto in Ishikawa prefecture on Japan’s west coast on New Year’s Day killed at least 180 people, making it the deadliest since the 2016 quake in Kumamoto on the southern island of Kyushu.\nChanges to the 2024/2025 budget plan will be submitted to Parliament’s regular session, starting later in January.\nThe Japanese government had approved a total budget of 112 trillion yen just 10 days before the quake, including 500 billion yen for general reserves and another 1 trillion yen in reserves for inflation countermeasures.\nMr Suzuki declined to comment on the size of the addition to reserves or how it will be financed.\nHe said only that the government is still examining the fiscal needs of quake-hit areas.\nMedia outlets, including the Nikkei and Yomiuri, reported that the expansion will be funded by more government bond issuance.\nMr Suzuki said he cancelled a trip to Cambodia slated for Jan 9 to focus on disaster response, but will visit Sri Lanka on Jan 11 to 12.\nJapan has urged Sri Lanka and its creditor nations to sign a memorandum of understanding on the island-nation’s debt restructuring following an agreement reached in principle in late 2023. REUTERS", "url": "https://www.straitstimes.com/asia/japan-to-expand-fy202425-budget-reserves-for-earthquake-aid"}