{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:53:57", "date_modify": "2024-10-12 13:53:57", "date_publish": "2024-02-29 12:25:00", "description": "Preliminary urine tests showed that the man had tested positive for methamphetamine. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysian-man-allegedly-beats-mum-to-death-with-safety-boot-and-hammer_1728741237.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/29/fhklang.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysian-man-allegedly-beats-mum-to-death-with-safety-boot-and-hammer_1728741237.html", "title": "Malaysian man allegedly beats mum to death with safety boot and hammer", "title_page": "Malaysian man allegedly beats mum to death with safety boot and hammer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Malaysian police have arrested a man for allegedly beating his mother to death with a safety boot and a hammer on Feb 28.\nThe suspect, a barber, was arrested at his workplace a few hours after the alleged incident took place at the victim’s home in Kampung Jawa in the port city of Klang in Selangor state.\nAccording to preliminary investigation, the 33-year-old man was involved in a “disagreement” with his 55-year-old mother, said Shah Alam police chief Mohd Iqbal Ibrahim.\n“The suspect was believed to have assaulted the woman with a safety boot and a hammer before fleeing,” Malay-language tabloid Harian Metro quoted Mr Iqbal as saying.\n“Preliminary urine tests conducted showed that the man had tested positive for methamphetamine and has a record for crime and drug-related cases,” he added.\nThe man is remanded as the police continue their investigation under Section 302 of the Penal Code for murder.\nThose convicted can face the death sentence, or imprisonment of between 30 and 40 years, and no fewer than 12 strokes of the cane.", "url": "https://www.straitstimes.com/asia/se-asia/malaysian-man-allegedly-beats-mum-to-death-with-safety-boot-and-hammer"}