{"authors": [], "date_download": "2024-10-12 13:33:23", "date_modify": "2024-10-12 13:33:23", "date_publish": "2024-05-01 19:26:41", "description": "Pictures show residents wading through a reservoir, with the water blanketed by dead marine life. Read more at straitstimes.com.", "filename": "asia_se-asia_mass-fish-die-off-in-vietnam-as-heatwave-roasts-south-east-asia_1728740003.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/01/don20nai.jpg?VersionId=0.ybvSADwOz6_Kgy4fT15EoRfusC3VpL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_mass-fish-die-off-in-vietnam-as-heatwave-roasts-south-east-asia_1728740003.html", "title": "Mass fish die-off in Vietnam as heatwave roasts South-east Asia", "title_page": "Mass fish die-off in Vietnam as heatwave roasts South-east Asia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DONG NAI, Vietnam - Hundreds of thousands of fish have died in a reservoir in southern Vietnam’s Dong Nai province, with locals and media reports suggesting a brutal heatwave and the lake’s management are to blame.\nLike much of South-east Asia – where schools have recently been forced to close early and electricity usage has surged – southern and central Vietnam have been scorched by devastating heat.\n“All the fish in the Song May reservoir died due to a lack of water,” said a local resident in Trang Bom district, who identified himself only as Nghia.\n“Our lives have been turned upside down over the past 10 days because of the smell.”\nPictures show residents wading and boating through the 300ha Song May reservoir, with the water barely visible under a blanket of dead marine life.\nAccording to media reports, the area has seen no rain for weeks and the water in the reservoir is too low for the creatures to survive.\nReservoir management had previously discharged water to try to save crops downstream, Nghia said.\n“They then tried to renovate the reservoir, bringing in a pump to take the mud out so that the fish would have more space and water,” he said.\nHowever, the efforts did not work and shortly afterwards, many of the fish died, with local media reports suggesting as many as 200 tonnes’ worth may have perished.\nTuoi Tre newspaper reported that the firm in charge of managing the lake had begun dredging in early 2024, initially planning to release extra water into the reservoir for the fish.\n“But owing to an unrelenting heatwave, the investor released the water into the downstream area, leading to the water level going down.\n“As a result, fish died en masse,” the newspaper reported.\nThe reservoir is the water source for crops in Trang Bom and Vinh Cuu districts of Dong Nai province.\nThe authorities are investigating the incident, while working to quickly remove the dead fish.\n“We hope the authorities will do their best to improve the situation,” Nghia said.\nAccording to weather forecasters, temperatures in Dong Nai province, 100km west of Ho Chi Minh City, reached 40 deg C in April, breaking the record high temperature recorded in 1998.\nThe soaring temperatures are also impacting neighbouring Cambodia, where the high could reach 43 deg C on the mercury.\nOn May 1, Cambodian Prime Minister Hun Manet ordered schools to consider closing to protect teachers and students from the heat, and put officials on standby in case of water shortages.\nThis came after Education Minister Hang Chuon Naronon ordered schools to shorten morning classes and delay those held in the afternoon in an attempt to avoid the worst of the midday heat on April 30.\nHe said the measures were “to prevent risks and to avoid illnesses that would harm the health” of students and teachers.", "url": "https://www.straitstimes.com/asia/se-asia/mass-fish-die-off-in-vietnam-as-heatwave-roasts-south-east-asia"}