{"authors": [], "date_download": "2024-10-12 14:02:10", "date_modify": "2024-10-12 14:02:10", "date_publish": "2024-03-22 17:48:21", "description": "President Vladimir Putin had, for a long time, insisted that the word “war” be avoided. Read more at straitstimes.com.", "filename": "asia_kremlin-says-russia-is-at-war-due-to-western-intervention-on-ukrainian-side_1728741730.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/22/LYNXNPEK2L0AQ-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_kremlin-says-russia-is-at-war-due-to-western-intervention-on-ukrainian-side_1728741730.html", "title": "Kremlin says Russia ‘in state of war’ in Ukraine due to Western intervention", "title_page": "Kremlin says Russia ‘in state of war’ in Ukraine due to Western intervention | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russia regards itself to be at war due to the West’s intervention on Ukraine’s side and cannot allow a state to exist on its borders that has shown itself ready to use any method to seize control of Crimea, the Kremlin said on March 22.\nThe comments from Kremlin spokesman Dmitry Peskov to the Russian publication Arguments And Facts, some of his most hawkish on Ukraine yet, followed a large-scale overnight Russian attack on Ukrainian energy infrastructure.\n“We are in a state of war. Yes, it started out as a special military operation, but as soon as this group was formed, when the collective West became a participant in this on the side of Ukraine, it became a war for us,” Mr Peskov said.\n“I am convinced of that. And everyone should understand this, for their internal motivation.”\nRussian officials, from President Vladimir Putin down, have gradually started to use the word “war” from time to time, having long insisted previously that the term be avoided.\nMr Peskov said also that Russia must fully “liberate” its “new regions” to ensure people’s safety there, a reference to the four Ukrainian regions which Russia claimed to have annexed in 2022.\nKyiv says Russia’s annexation was an illegal land grab and that it will not rest until every Russian soldier is ejected from its soil. It is also determined to return the Black Sea peninsula of Crimea, which Russia took from it in 2014.\nMoscow, which has invested heavily in Crimea, says the peninsula is part of Russia and that its status has been settled once and for all. REUTERS", "url": "https://www.straitstimes.com/asia/kremlin-says-russia-is-at-war-due-to-western-intervention-on-ukrainian-side"}