{"authors": [], "date_download": "2024-10-12 13:54:32", "date_modify": "2024-10-12 13:54:32", "date_publish": "2024-09-03 15:20:00", "description": "Dr Mashitah Ibrahim is still being investigated for alleged human trafficking activities. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-police-confirms-ex-deputy-minister-probed-for-human-trafficking-is-currently-in-myanmar_1728741272.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/MALAYSIA-FBL-CRIME-124546.jpg?VersionId=S.K_010We30zGVPT2HCvqjYOqZOCY34T&h=46f8122b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-police-confirms-ex-deputy-minister-probed-for-human-trafficking-is-currently-in-myanmar_1728741272.html", "title": "Malaysia police confirms ex-deputy minister probed for human trafficking was in Myanmar", "title_page": "Malaysia police confirms ex-deputy minister probed for human trafficking was in Myanmar | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Malaysian police have confirmed that a former deputy minister in the prime minister’s department went to Myanmar for real estate investment matters.\nHowever, Bukit Aman Criminal Investigation Department (CID) director Mohd Shuhaily Mohd Zain said police are still investigating Dr Mashitah Ibrahim in connection with alleged human trafficking activities.\n“Checks revealed that Dr Mashitah went to Myanmar on a real estate investment matter in Myawaddy, Myanmar,” he said, when contacted on Sept 3.\n“We were able to check and confirm it. This is after her statement was recorded last week.”\nHe said the CID is still collecting information to complete the investigation on an allegation of human trafficking in Myanmar involving Malaysians.\n“We also managed to record the statement of an individual with a Datuk Seri title for the same case as well,” he added.\nDatuk Seri Mohd Shuhaily said the police have recorded the statements of five individuals, including Dr Mashitah, so far.\n“We will also be recording the statement of a blogger from Indonesia today,” he said. “It will be conducted online as he is in Jakarta, Indonesia.”\nThe investigation also involved identifying other individuals involved in the case, he added.\n“We advise those who receive job offers overseas, especially in countries often linked to scams, to be more careful,” he said. “Check and verify the offer through official channels such as via the Home Ministry or the Labour Department.”\nIt was reported on Aug 28 that the former deputy minister is accused of being the mastermind of an international human trafficking syndicate operating in Myanmar.\nMalaysian International Humanitarian Organisation (MHO) secretary-general Hishamuddin Hashim reportedly said that the woman, along with her husband, held key positions as senior security officials in a company and were believed to be involved since early 2020.\nRecently, a video exposing the syndicate in Myanmar went viral on YouTube in Indonesia. It highlighted that many Indonesian citizens have fallen victim to the syndicate, which is openly engaged in human trafficking activities, including forced labour, torture, organ trafficking and even murder.\nDr Mashitah has since denied the allegations. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-police-confirms-ex-deputy-minister-probed-for-human-trafficking-is-currently-in-myanmar"}