{"authors": ["Walter Sim", "Lin Suling"], "date_download": "2024-10-12 13:35:57", "date_modify": "2024-10-12 13:35:57", "date_publish": "2024-09-17 22:20:00", "description": "Japanese officials are vexed by the offhand use of rhetoric against the US' closest ally in the Indo-Pacific. Read more at straitstimes.com.", "filename": "asia_east-asia_biden-blocking-nippon-steel-s-bid-to-buy-us-steel-on-national-security-risk-casts-pall-on-us-japan-ties_1728740157.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/416622336.jpg?VersionId=aawqf95YLyYPI6f7plp5cAOchyiEAyAN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_biden-blocking-nippon-steel-s-bid-to-buy-us-steel-on-national-security-risk-casts-pall-on-us-japan-ties_1728740157.html", "title": "Opposition over Nippon Steel’s bid to buy US Steel casts pall on US-Japan ties", "title_page": "Opposition over Nippon Steel’s bid to buy US Steel casts pall on US-Japan ties | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO/SINGAPORE – The United States is obstructing a bid by Japan’s Nippon Steel to acquire US Steel on the grounds of “national security”, employing language often reserved for their common perceived threat: China.\nThe episode has cast a pall over US-Japan ties, even as Japan’s Prime Minister Fumio Kishida – who has entrenched his country’s position as the superpower’s key ally in Asia – is due to visit the US for his farewell tour before stepping down in October.\nNippon Steel, the world’s fourth-largest steelmaker, announced in December 2023 that it intended to buy US Steel.\nBut the potential US$14.9 billion (S$19.3 billion) sale has run into opposition from US President Joe Biden as well as US Vice-President and Democratic presidential nominee Kamala Harris.\nUS Steel should “remain American-owned and operated”, Ms Harris said on Sept 2.\n“I will stop Japan from buying United States Steel,” former US president Donald Trump said in August, sending US Steel shares plunging by 6 per cent in one day.\nJapanese officials are vexed by the offhand use of rhetoric that blatantly calls into question Japan’s status as America’s closest ally and most stalwart advocate for US interests in the Indo-Pacific.\nExperts blame the episode on awful timing on Nippon Steel’s part and political expediency in the US.\nOn Aug 31, in a letter to both companies, the inter-agency Committee on Foreign Investment in the US (CFIUS), which vets foreign buyers for national security risks, said the deal would create such risks and hurt the supply of steel needed for critical transportation, infrastructure, construction and agriculture projects.\nNippon Steel is now making a last-ditch attempt to salvage the deal to buy US Steel, the world’s 24th-largest steel producer, amid reports that a presidential order halting the deal was imminent. It published tranches of e-mail transactions on Sept 11 to clear the air over “public mischaracterisations” of its commitments.\nOn Sept 11, six top US business lobbies and Japanese business federation Keidanren sent an open letter to CFIUS chairwoman and Treasury Secretary Janet Yellen.\n“CFIUS should never become a tool for political posturing and should not morph into industrial policy masquerading as national security,” they wrote. “We fear this political pressure may be unduly influencing the outcome of the CFIUS review. Indeed, America’s investment climate will be severely tarnished if such political interference prevails.”\nThe irony is that the deal makes sense. US Steel has described it as a financial lifeline that could save jobs. It is also a prime example of friend-shoring, at a time when China is producing more than half of the world’s steel and structurally driving down industry profits.\nMr Kishida’s administration has been reluctant to weigh in on the US Steel controversy, given that this is a business deal. But the incident has cast a pall over his farewell visit to the US later this week, where he will meet Mr Biden and attend a Quad leaders’ summit.\nSemantics appears to matter more in a knife-edge US election year amid a surge in nationalist sentiment, experts said, noting that the deal has been weaponised by all sides to win votes.\n“It’s not a very large steel company, and it’s in financial trouble,” Dr Tosh Minohara, who chairs the Research Institute for Indo-Pacific Affairs think-tank in Japan, told The Straits Times. “Nobody would likely care if its name was not US Steel. And everyone wants the union to be on their side.”\nThe saga comes as corporate Japan is riding on the crest of a merger-and-acquisition wave of US companies, with several multibillion-dollar deals in the last 12 months, including home-builder Sekisui House snapping up Denver-based MDC Holdings for US$4.9 billion, Ono Pharmaceuticals buying cancer drugmaker Deciphera for US$2.4 billion, and Japan Tobacco buying US tobacco maker Vector Group for US$2.4 billion. These deals have gone through smoothly, unlike the proposed deal over US Steel.\nThe United Steelworkers (USW) union, which represents about 850,000 members, remains vehemently opposed to the deal despite Nippon Steel’s promises to keep US Steel plants open, retain jobs, make additional capital investments and ensure a majority of board members are Americans.\nExecutives of US Steel are in favour of the deal, warning that the company may have to cut jobs and move its headquarters out of Pennsylvania, a crucial battleground state in the US election, if the transaction falls through.\n“Steelmaking in the US is dying. The business is simply unsustainable with its huge overheads and gross mismanagement,” Professor Sumit Agarwal, Low Tuck Kwong Distinguished Professor of Finance at the National University of Singapore’s Business School, told ST.\nUS Steel is struggling financially, with margins thinner than the industry average after failing to modernise its steel plants.\nHe said the sector will be boosted by a foreign firm like Nippon Steel, with its exposure to Asia, its sound fundamentals and investments.\nUS steelmaker Cleveland-Cliffs had also offered to buy US Steel but at half of Nippon Steel’s offer.\nThe timing was off, Prof Agarwal said, believing that the deal would have gone through if it was floated outside the US election cycle: “No government wants to be seen selling out to foreign interests.”\nMr Steven Okun, a former Clinton administration official and veteran of Democratic presidential campaigns, told ST that Japan was not being targeted.\nHe said: “Any foreign entity attempting to purchase US Steel in an election year would face the same reaction from politicians if as much were on the line.”\nThe US presidential race could easily come down to Pennsylvania, he noted, where just over 80,000 votes separated Mr Biden and Trump in 2020.\n“If one candidate were to be in favour of the acquisition over the objection of USW, it could tip the White House to the one opposed to it,” said Mr Okun, now chief executive of Singapore-based public affairs consultancy Apac Advisors.\nFounded in 1901, US Steel was once the world’s largest steelmaker and the world’s first company to be valued at US$1 billion.\nBut it is now a shadow of its former self after decades of competition with Japan, Brazil, Europe, South Korea and now, China.\nChinese steel exports are expected to reach an eight-year high in 2024, according to Shanghai-based consultancy Mysteel.\nMany Americans see the buyout of US Steel by a foreign entity as a clear sign of the country’s economic slide and a culmination of its decades-long slump.\nThe US is not the only one having elections this year.\nJapan’s ruling Liberal Democratic Party (LDP) is holding elections on Sept 27 to choose its next leader, and hence prime minister, and candidates have also weighed in on the US Steel buyout.", "url": "https://www.straitstimes.com/asia/east-asia/biden-blocking-nippon-steel-s-bid-to-buy-us-steel-on-national-security-risk-casts-pall-on-us-japan-ties"}