{"authors": [], "date_download": "2024-10-12 13:47:52", "date_modify": "2024-10-12 13:47:52", "date_publish": "2022-05-22 12:29:50", "description": "Many who ventured out wore blue protective gowns and face shields. Read more at straitstimes.com.", "filename": "asia_east-asia_shanghai-reopens-some-public-transport-still-on-high-covid-19-alert_1728740872.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/22/md_train_22052022.jpg?VersionId=ccSUdYcDV8ZtqWEPartDoLU8HaIyikmU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_shanghai-reopens-some-public-transport-still-on-high-covid-19-alert_1728740872.html", "title": "Shanghai reopens some public transport, still on high Covid-19 alert", "title_page": "Shanghai reopens some public transport, still on high Covid-19 alert | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI/BEIJING (REUTERS) - Shanghai reopened a small part of the world's longest subway system on Sunday (May 22) after some lines had been closed for almost two months, as the city paves the way for a more complete lifting of its painful Covid-19 lockdown next week.\nWith most residents not allowed to leave their homes and restrictions tightening in parts of China's most populous city, commuters early on Sunday needed strong reasons to travel.\nShanghai's lockdown and curbs in other cities have battered consumption, industrial output and other sectors of the Chinese economy in recent months, prompting pledges of support from policymakers.\nMany who ventured out in the commercial hub wore blue protective gowns and face shields. Inside the carriages, passengers were seen keeping some empty seats between themselves. Crowds were small.\nMr Xu Jihua, a migrant construction worker, arrived at a subway stop before it opened at 7am, hoping to get to a rail station, then home to the eastern province of Anhui.\n\"Work stopped on March 16,\" said Mr Xu, adding he had not been able to earn his monthly 7,000-8,000 yuan (S$1,400-$1,600) salary since then and would only return to Shanghai once he was sure he could find work. \"Is the lockdown really lifting or not? It's not very clear.\"\nA woman who asked only to be identified by her surname Li said she needed to visit her father in a hospital 8km from her final stop.\n\"I'm going to the heart hospital, but I don't know whether there will be any cars or transport once I get to the railway station,\" Ms Li said. \"I might have to walk there.\"\nFour of the 20 lines reopened, and 273 bus routes. Some had closed in late March, others later, although sporadic service continued with a limited number of stops.\nThe city of 25 million expects to lift its city-wide lockdown and return to more normal life from June 1. Most restrictions on movement will remain in place this month.\nShanghai's 800-km metro system averaged 7.7 million rides a day in 2020, according to the latest data, with an annual passenger throughput of 2.8 billion.\nTrains will run 20 minutes apart for limited hours.\nJingan, a key commercial district, said on Saturday it will require all shops to shut and residents to stay home until at least Tuesday, as it carries out mass testing.\nThe use of exit permits, previously given to residents that allowed them to leave their homes for short walks will be suspended, authorities said without giving a reason.\nSimilar actions were announced on Friday in the Hongkou district as well as on Saturday by Qingpu district's Zhaoxiang town, which said they wanted to \"consolidate\" the results of their epidemic prevention efforts so far.\nShanghai reported fewer than 700 daily cases on Sunday.\nSignificantly, none was outside quarantined areas, as they have been the case for much of the past week. The capital Beijing reported 61 cases, down from 70.\nBeijing has been gradually tightening restrictions since April 22, with many shops closed, public transport curtailed and residents asked to work from home. But it still struggles to eliminate an outbreak of dozens of new infections a day.\nTianjin, a key north-eastern port, found 36 new cases on Saturday, CCTV reported.\nRegulators said on Friday they will streamline the process of equity and bond issuance by companies hit by the pandemic, and urged brokerages and fund managers to channel more money into virus-hit sectors.", "url": "https://www.straitstimes.com/asia/east-asia/shanghai-reopens-some-public-transport-still-on-high-covid-19-alert"}