{"authors": [], "date_download": "2024-10-12 14:05:57", "date_modify": "2024-10-12 14:05:57", "date_publish": "2019-04-03 13:30:45", "description": "KUALA LUMPUR (AFP) - Malaysia's extraordinary 1MDB corruption scandal allegedly saw top officials loot billions from a state fund and go on a worldwide spending spree - buying up super-yachts, paintings by Van Gogh and Monet, and financing a Hollywood blockbuster. Read more at straitstimes.com.", "filename": "asia_se-asia_1mdb-malaysias-extraordinary-financial-scandal-0_1728741957.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/04/03/tgnajiba03.jpg?VersionId=6k537TsgQLtppWybQtfNlzLhpYU81ZpJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_1mdb-malaysias-extraordinary-financial-scandal-0_1728741957.html", "title": "1MDB: Malaysia's extraordinary financial scandal", "title_page": "1MDB: Malaysia's extraordinary financial scandal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR (AFP) - Malaysia's extraordinary 1MDB corruption scandal allegedly saw top officials loot billions from a state fund and go on a worldwide spending spree - buying up super-yachts and paintings by Van Gogh and Monet, and financing a Hollywood blockbuster.\nThe controversy has had a huge impact in Malaysia, contributing to the downfall of a coalition that had ruled the country since its independence from Britain in 1957.\nMalaysia's disgraced former leader Najib Razak goes on trial on Wednesday (April 3) over the scandal, facing seven charges of corruption and money laundering over the alleged theft of some RM42 million (S$13.9 million) from SRC International, a former 1MDB unit.\nIt is only a fraction of the money allegedly stolen from 1MDB - and only the first of several trials over Najib's alleged involvement in the looting of the fund. Hundreds of millions of dollars are believed to have ended up in Najib's accounts alone.\nHere is a look back at the saga:\nWHAT IS 1MDB?\n1Malaysia Development Berhad (1MDB) is a state investment fund which Najib launched in 2009 shortly after becoming Malaysia's prime minister.\nIts portfolio has included power plants and other energy assets in Malaysia and the Middle East, and real estate in Kuala Lumpur. The fund was closely overseen by Najib.\nWhistle-blowers say Low Taek Jho - commonly known as Jho Low, a jet-setting Malaysian financier close to Najib but with no official positions - helped set up 1MDB and made key financial decisions.\nConcerns escalated in 2014 as 1MDB slid into an US$11 billion (S$14.8 billion) debt hole, and intensifying public scrutiny led to a string of revelations concerning missing funds.\nThe issue exploded in July 2015 when The Wall Street Journal published documents showing Najib received at least US$681 million in payments to his personal bank accounts.\nRICH LIVING\nThe United States Department of Justice launched a probe due to claims that stolen Malaysian public money was laundered through the US financial system, and filed lawsuits seeking some US$1.7 billion in assets allegedly purchased with the cash.\nIn its civil suits, the department said more than US$4.5 billion was stolen from 1MDB by high-level officials at the fund and their associates between 2009 and 2015.\nTens of millions of dollars in stolen money was used in 2012 by Najib's stepson Riza Aziz, an aspiring film producer, to fund the Hollywood film The Wolf Of Wall Street, starring Leonardo DiCaprio.\nHundreds of millions were also used, mainly by Mr Riza and Low, to purchase high-end real estate in Beverly Hills, New York and London, a Monet painting for US$35 million, a Van Gogh for US$5.5 million, a US$35 million Bombardier jet, a US$100 million stake in EMI Music Publishing, and a US$250 million yacht.\nThe US Department of Justice believes US$4.5 billion in total was looted from 1MDB.\nELECTION MELTDOWN\nNajib desperately sought to contain the scandal, targeting critics and introducing repressive laws, but the allegations hit the popularity of his long-ruling coalition and contributed to its shock election loss in May.\nA new government headed by veteran politician Mahathir Mohamad, who is 93 and in his second stint as premier, came to office on a wave of public anger, and has reopened investigations.\nNajib has since been hit with dozens of charges. He denies any wrongdoing.\nGOLDMAN'S ROLE\nMalaysia has also charged Wall Street titan Goldman Sachs over the scandal, alleging the bank and its former employees stole billions of dollars from 1MDB.\nGoldman units and two former bankers are accused of misappropriating US$2.7 billion, bribing officials and giving false statements in relation to bond issues they arranged for the fund.\nThey are accused - along with Low and a former 1MDB employee - of misappropriating US$2.7 billion from the bond issues, bribing officials to ensure they were selected to carry out the work and giving false statements to investors.\nThe two former bankers named in the charges are Tim Leissner, who worked as South-east Asia chairman and managing director at Goldman, and Ng Chong Hwa, a managing director at the firm.\nThe bank has vowed to fight the charges.", "url": "https://www.straitstimes.com/asia/se-asia/1mdb-malaysias-extraordinary-financial-scandal-0"}