{"authors": ["Yong Li Xuan"], "date_download": "2024-10-12 13:32:50", "date_modify": "2024-10-12 13:32:50", "date_publish": "2024-06-28 22:10:00", "description": "No one was injured, according to post on social media platform Xiaohongshu. Read more at straitstimes.com.", "filename": "asia_se-asia_shopper-escapes-death-when-escalator-malfunctions-at-kl-s-mid-valley-megamall_1728739970.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/tc-lxmall28.jpg?VersionId=qdC94FNuamdq0bQtd9fUIVxy.eLMVdvn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_shopper-escapes-death-when-escalator-malfunctions-at-kl-s-mid-valley-megamall_1728739970.html", "title": "Shopper ‘escapes death’ when escalator malfunctions at KL’s Mid Valley Megamall", "title_page": "Shopper ‘escapes death’ when escalator malfunctions at KL’s Mid Valley Megamall | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A malfunction caused some parts of an escalator to “pop out” at Kuala Lumpur’s Mid Valley Megamall on June 28, according to a social media post.\nThe post on Xiaohongshu titled “Midvalley KL escape from death” was uploaded at 4.13pm on June 28.\nAccording to the post’s caption, which is written in Chinese, the user had taken the escalator at the shopping mall earlier that day.\nAs the post’s author stepped onto the escalator, there was a sudden, loud noise, and some parts “popped out” of the top of the escalator, the caption said.\nThe social media user, together with other shoppers, then ran down the escalator, it added.\nNo one was injured, according to the caption.\nThe user, who still feels afraid thinking back on the incident, reminded others to stay alert while riding escalators and not to listen to loud music so they can react quickly if something were to happen.\nThe post, which had about 2,500 likes as at 9pm on June 28, includes four photos of the aftermath of the incident. A step appears to have come off at the top of the escalator.\nIt is unclear what caused the malfunction.\nThe Straits Times has contacted Mid Valley Megamall for more information.", "url": "https://www.straitstimes.com/asia/se-asia/shopper-escapes-death-when-escalator-malfunctions-at-kl-s-mid-valley-megamall"}