{"authors": ["Magdalene Fung"], "date_download": "2024-10-12 14:20:27", "date_modify": "2024-10-12 14:20:27", "date_publish": "2024-06-27 05:00:00", "description": "Many Malaysians are multilingual, including in Cantonese, said the city’s labour minister. Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-wants-more-talent-from-malaysia-as-it-seeks-to-diversify-workforce_1728742827.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/27/gigi-MEwhzMxZJac-unsplash.jpg?VersionId=i0Ut8iF9vea2tT2VGGmfzq1TptNUOH36", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-wants-more-talent-from-malaysia-as-it-seeks-to-diversify-workforce_1728742827.html", "title": "Hong Kong wants more talent from Malaysia as it seeks to diversify workforce", "title_page": "Hong Kong wants more talent from Malaysia as it seeks to diversify workforce | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – The Hong Kong government plans to focus on recruiting talent from South-east Asia and Europe to supplement and diversify the city’s imported labour force.\nMalaysia will be a key potential source of talent, given that many Malaysians are multilingual, including in Cantonese, Hong Kong’s local language, according to the city’s labour minister.\n“Malaysians are fluent in English, and many also speak fluent Cantonese and Mandarin,” Secretary for Labour and Welfare Chris Sun told local media on June 18.\nMr Sun said such Malaysian talents would find it easier to integrate into the local community, and could help Hong Kong forge connections with the South-east Asian market.\n“There is a good talent pool (in Malaysia), and I think it’s worthwhile for us to give it a try,” he said, adding that the government also aimed to hire financial and technology talent from Europe.\nMainland Chinese people have made up more than 90 per cent of about 59,000 non-local professionals brought to the city under a Top Talent Pass Scheme since December 2022. The government did not provide a breakdown of the number of visas granted to Malaysians.\nThe scheme offers a two-year visa­ to applicants who earned at least HK$2.5 million (S$434,000) in the past year, or graduates from nearly 200 of the world’s top universities.\nThe Malaysian Chamber of Commerce in Hong Kong and Macau said the scheme had already benefited some Malaysian professionals with its simplified visa procedures.\n“The government’s focus on talent recruitment in Malaysia reflects its commitment to fostering a diversified and skilled workforce,” the chamber told The Straits Times.\nNurturing greater cultural sensitivity and ensuring more access to halal goods would also help attract more Malaysian talents including Muslims to Hong Kong, the chamber said.\nMalaysian Yee Lisan, 34, who relocated to Hong Kong as a regional marketing manager at a music label in April 2021, said she enjoys the quality of life in Hong Kong.\n“My favourite thing about Hong Kong is the fact that I can head to the beach, hills or to the city all within 20 minutes,” she said. “In Malaysia, I would have had to take a long stretch of leave just to spend a proper day at the beach. So, I appreciate the convenience of this compact city.”\nBut Hong Kong is lacking in some areas, she said. “When my Muslim friends visit, for example, it can be difficult taking them around for meals as the halal options here are extremely limited.”\nHong Kong officials said in May that they were striving to offer more halal food options across the city to woo more visitors from South-east Asia, the Middle East and other Muslim-majority regions.\nLawmakers have, in recent days, raised concern about a lack of diversity in Hong Kong’s imported labour force, with mainlanders accounting for three in four of the 180,000 workers brought to the city across all talent schemes since December 2022.\nBut Mr Sun on June 24 urged them to look past the newcomers’ nationalities. The fact that most of the younger candidates from the top talent scheme graduated from US universities also accounted for diversity, even if many of them were mainlanders, he argued.\nStill, as the possibility rises of foreigners – particularly in the lower-educated segment of the labour force – crowding the job market, local workers in some sectors are feeling threatened.\nTwo workers’ unions on June 20 jointly spoke out to oppose a government plan to further raise a quota for imported residential care home workers to 15,000. That quota was raised from 4,000 to 7,000 in June 2023, and will now more than double from July 1.\n“Rather than supporting local employment, the government has instead brought a huge threat to it,” the Health Services Employees Association and the Caregiving Services Employees Association said in their statement.\nIn April, unions representing workers in bus services lambasted a government move to allow bus service operator Citybus to hire 20 mainland drivers to alleviate what officials said was a “severe labour shortage”.\n“This time they will import only 20 drivers. But it will be a huge problem if they import more,” a member of the Motor Transport Workers General Union complained at the time.\nProfessor Terence Chong, an economist at the Chinese University of Hong Kong, told ST it was “myopic” to think that imported workers would necessarily hurt locals’ livelihoods, as an insufficient supply of labour would end up hurting the economy and all Hong Kongers.\n“Importing labour is a good way to fill up vacant job roles, especially in the jobs that most locals aren’t willing to take, such as being care home workers,” Prof Chong said.\nHong Kong has been ramping up recruitment of imported workers in an effort to plug large gaps in its labour force, in higher-skilled and professional services as well as other sectors including construction, transport and health.\nIt lost more than 250,000 members of its 3.99 million-member workforce between 2019 and 2022, as locals and expatriates alike left following the 2019 mass anti-government protests, the 2020 imposition of a national security law and tight Covid-19 restrictions during the pandemic that saw the city mostly shut to the world.\nLabour groups have criticised the government’s efforts to bring more workers into the city as bypassing union leaders’ scrutiny and disregarding local workers’ concerns.\nBut Prof Chong said the government’s labour importation policies since late 2022 have, in fact, helped replenish the city’s labour supply.\nThe workforce has since recovered to about 3.81 million as at May, according to the latest data from the Census and Statistics Department.\nHong Kong’s unemployment rate has also stabilised at around 3 per cent, compared with around 5 per cent during the pandemic, the economist added.\n“We have to look at labour issues from the interests of Hong Kong as a whole, rather than just from one side of any particular sector,” he said.", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-wants-more-talent-from-malaysia-as-it-seeks-to-diversify-workforce"}