{"authors": [], "date_download": "2024-10-12 13:48:26", "date_modify": "2024-10-12 13:48:26", "date_publish": "2024-04-09 14:30:00", "description": "Rising climate change impacts, from floods to droughts and extreme heat, are taking a disproportionate toll on women. Read more at straitstimes.com.", "filename": "asia_south-asia_dont-forget-women-in-new-un-climate-fund-policymakers-urged_1728740906.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/09/2024-01-16T065536Z318089185RC2QI5AI20C2RTRMADP3BANGLADESH-DAILYLIFE.JPG?VersionId=pHCPO3QFj3VwuNqM7oTHER.DNskT9pgP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_dont-forget-women-in-new-un-climate-fund-policymakers-urged_1728740906.html", "title": "Don’t forget women in new UN climate fund, policymakers urged", "title_page": "Don’t forget women in new UN climate fund, policymakers urged | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DHAKA - At home on a flood-prone island in northern Bangladesh, Ms Mosammat Shahina and her family take refuge from frequent inundations on a boat, causing upheaval that adds to her domestic workload.\n“I have to try my best to get food for the family as we float on water, and attend to my children who get sick during these disasters,” the 32-year-old told the Thomson Reuters Foundation by phone.\nAs officials race to set up the new UN climate loss and damage fund and start allocating aid, rights groups say they must take into account the uneven burden shouldered by women like Ms Shahina in hard-hit Global South nations.\nWithout that, they say the fund agreed at the COP28 climate summit in November will struggle to achieve its aim of helping communities repair damage, recover from losses, and become more resilient to disasters.\nA series of delays have slowed the fund’s launch progress and so far only seven of the 25 people appointed to serve on its 26-member board are female.\nThat has drawn criticism from women’s rights advocates, who say rising climate change impacts – from floods to droughts and extreme heat – are taking a disproportionate toll on women.\n“The growing impact of climate change affects female-headed households particularly badly – as women struggle to earn a living, put food on the family’s table and take care of the family members under strained circumstances,” said Ms Pearl Mokgatlhane from the Botswana Society for Human Development, a non-governmental organisation (NGO) in the drought-hit southern African country.\nClimate-linked disasters tend to exacerbate women’s unpaid care work burden, for example, forcing them to walk further to find water. Globally, about 76 per cent of such work is shouldered by women.\nWhen extreme weather causes shortages of food, they often sacrifice their portion for other family members and face particular risks to their health and well-being – from pregnancy complications to domestic violence.\nIn Botswana, as a drought becomes acute in the semi-arid country, Ms Mokgatlhane said the decimation of goat herds and dwindling incomes were hitting women’s mental health and forcing them to seek government aid from officials who had little understanding of their needs and priorities.\nWomen also find it harder to navigate the sometimes-complex bureaucracy to get help, she added.\nClimate justice\nAs the new global fund takes shape and potential recipients line up, quantifying and monetising the burdens and damages faced by women is vital for ensuring climate justice, said Ms Farah Kabir, country director for the ActionAid charity in Bangladesh.\n“It is pointless to vaguely speak about women’s additional burden – you need to do the studies and get accurate data to address it,” Ms Kabir said.\nWhile previous climate finance mechanisms were often born without clear gender guidelines, the loss and damage fund should integrate the gender lens from the start, Ms Kabir said.\nGathering gender-disaggregated data should be a priority, said Ms Lorena Aguilar, an expert on the gendered dimensions of climate change and executive director at the Kaschak Institute for Social Justice for Women and Girls at US-based Binghamton University.\n“Communities are not homogeneous, and the same community members are affected differently depending on age, sex, economic power,” she said.\nIn March, the UK-based International Institute for Environment and Development (IIED) think-tank unveiled a tool that could measure the various dimensions of loss and damage faced by vulnerable populations such as women.\nThe tool, called C-CIQ methodology, addresses the various kinds of loss and damage affecting communities – from the loss of assets such as crops or homes to more intangible damage including the destruction of an ancestral burial ground, or mental illness.\n“The whole purpose is to quantify and attach dollar values to loss and damage for even relatively less visible issues like mental health problems or a growing care burden faced by women – in a simple method that can be applied by even local NGOs,” said Ms Ritu Bharadwaj, lead researcher of the IIED’s climate and finance team.\nGrassroots women’s groups must have the possibility of direct access to the fund’s resources, said Mr Sunil Acharya, regional policy and campaigns coordinator for Oxfam in Asia.\nThe complex application procedures of existing climate funds, such as the Global Environment Facility (GEF), make it harder for small, local groups to access project funding, he said.\nIn countries at high risk from climate change impacts, such as Botswana, NGOs like Mokgatlhane’s are already using a bottom-up approach – consulting women in vulnerable communities and drawing on Indigenous knowledge when designing projects.\nThe strategy, which she urged the UN fund to adopt, means funding is more likely to hit the mark.\n“If a woman is kept abreast of the radical climatic impacts, consulted in the making of the climate action plans and policies, and given access to resources, then surely she can make our nation better,” Ms Mokgatlhane said. REUTERS", "url": "https://www.straitstimes.com/asia/south-asia/dont-forget-women-in-new-un-climate-fund-policymakers-urged"}