{"authors": ["Debarshi Dasgupta"], "date_download": "2024-10-12 13:52:15", "date_modify": "2024-10-12 13:52:15", "date_publish": "2023-07-11 21:40:00", "description": "Federal ministers as well as opposition leaders are sitting down with influencers for casual interviews. Read more at straitstimes.com.", "filename": "asia_south-asia_political-parties-reach-out-to-social-media-influencers-ahead-of-india-s-2024-general-elections_1728741135.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/11/Screenshot202023-07-1120at205.03.2620PM_4.jpg?VersionId=9mrcM2C3pO0U9FYnoUPiG0AG8DMb_sNB&h=64147656", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_political-parties-reach-out-to-social-media-influencers-ahead-of-india-s-2024-general-elections_1728741135.html", "title": "India’s political parties reach out to social media influencers ahead of 2024 general elections", "title_page": "India’s political parties reach out to social media influencers ahead of 2024 general elections | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI - Political parties in India are wooing social media influencers, opening up a new frontier for their public outreach ahead of the 2024 general elections.\nAt least five federal ministers have appeared on YouTube shows in recent weeks as part of a “collaboration” exercise initiated by MyGov, a government-run citizen engagement platform that has been working with social media influencers such as Mr Ranveer Allahbadia and Mr Raj Shamani, offering viewers a peek into their lives and work.\nBetter known as @BeerBiceps, the former has 5.7 million subscribers on YouTube and Mr Shamani has 1.37 million.\nThose who have gone online include the likes of External Affairs Minister S. Jaishankar who appeared on Mr Allahbadia’s show on June 16, and Minister for Road Transport and Highways Nitin Gadkari who was featured on Mr Shamani’s YouTube channel on May 31.\nIt is not just the Bharatiya Janata Party (BJP) but also Congress’ Rahul Gandhi and leaders from other opposition parties who have opened up to social media influencers.\nOn June 26 the Congress-led state government in Rajasthan, which goes to the polls at the end of 2023, even formalised its engagement with influencers, announcing it would issue them advertisements ranging from 10,000 rupees to 500,000 rupees (S$163 to S$8,144) a month, depending on their reach.\nThis trend of increased influencer engagement is an inevitability, given the growth in Internet users in India.\nAccording to a recent report by Google and Kantar India, a marketing data and analytics company, there are more than 752 million active Internet users in the country.\nMore than half of them access news online, with 45 per cent even stating online news is more popular in their peer circles than traditional TV channels.\n“There is an entire generation of digital natives who would be voting in 2024, those who have never consumed television news at 9pm or opened newspapers in the morning,” said Mr Akash Banerjee, a former journalist and now a news satirist who runs The Deshbhakt channel on YouTube with 3.2 million subscribers.\nIt is this youth segment that political parties are wooing through the online outreach. Influencers are also keen on such initiatives because of the surge in hits that political leaders bring for them.\nThe interview with Mr Jaishankar on The Ranveer Show (TRS) has racked up more than 6.2 million views. The two other podcasts with ministers on the channel exceeded one million views as well.\nBut this collaboration has not been without controversy, given the poor culture of public disclosures among these influencers that has led to a lack of details about their engagement with the government, a phenomenon that becomes more worrying with the increasingly blurring line between content creators and journalists online.\nAccording to Mr Viraj Sheth, chief executive of Monk Entertainment which produces TRS, MyGov got in touch with them in May with the idea of having some key cabinet ministers on their show.\nRevealing this to Newslaundry, a media critique and current affairs site, he said the government had “paid for their travel (from Mumbai to Delhi), lodging and board”, a fact kept from their viewers on YouTube.\nNo other payment was received, and all content and production aspects were handled by Monk Entertainment.\nYet, some note a conflict of interest with regard to payment from the government, even if it is just for logistics.\nIn January 2023, the government had made it mandatory for social media influencers to “prominently” disclose material benefits they receive from brands – including hotel stays.\n“This too very much falls in the category of promoting a brand, except that brand is the government of India,” said Ms Manisha Pande, Newslaundry’s executive editor.\n“If there’s any kind of financial transaction, even if it is simply for air tickets, your audience has a right to know in a simple disclosure.”\nWhile influencers may not pitch themselves entirely as journalists, the growing consumption of content offered by influencers as “news” by Indians raises the need for greater scrutiny by viewers.\nNearly all influencers – but for the exception of a few journalists who have switched to social media platforms – have no journalism training.\n“These guys approach everything as content creators, and a lot of what they do is dictated purely by views, by what gets them hits, by what gets them ad money,” Ms Pande told The Straits Times.\nPolitical parties have also carefully approached certain social media influencers, who are largely sympathetic to their views, giving their leaders a convenient way to appear in the public spotlight but without the critical questioning that may come from such positioning in print or TV media.\nThis has been the case in the recent shows, with politicians mostly facing softball questions from their hosts.\n“What is happening is that politicians are looking to escape tough questions, whether it is the Aam Aadmi Party, the Congress or the BJP. Everybody wants a convenient interview today,” noted Mr Banerjee.\nWith many young social media users even unable to distinguish between a journalistic interview and a puff piece online, he added that “responsible media” must call out such instances of public relations exercises.\n“It has to be understood this is not journalism, this is not asking questions the way a journalist should. This is not even citizen journalism,” said Mr Banerjee.\n“The only solution”, added Ms Pande, “is to have more media literacy in India, have more and more people who are aware of what they are consuming”.", "url": "https://www.straitstimes.com/asia/south-asia/political-parties-reach-out-to-social-media-influencers-ahead-of-india-s-2024-general-elections"}