{"authors": [], "date_download": "2024-10-12 13:31:57", "date_modify": "2024-10-12 13:31:57", "date_publish": "2024-06-26 11:27:47", "description": "The fire killed 23 people, and only three of the dead have been identified. Read more at straitstimes.com.", "filename": "asia_south-korean-authorities-order-battery-maker-to-halt-operations-over-deadly-blaze_1728739917.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/11435830.jpg?VersionId=.gr3CxDyWaDOO.H6yixyocae2qxERUvC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-korean-authorities-order-battery-maker-to-halt-operations-over-deadly-blaze_1728739917.html", "title": "South Korean authorities order battery maker to halt operations after deadly fire", "title_page": "South Korean authorities order battery maker to halt operations after deadly fire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - The South Korean authorities on June 26 ordered a halt to the operations of a manufacturer of lithium batteries after a fire killed 23 people, as they investigate three company officials for suspected safety violations.\nThe fire on June 24 at unlisted battery maker Aricell was one of the deadliest industrial accidents in recent years.\nDozens of South Korean workers lose their lives on the job each year, despite tougher laws and measures to improve safety.\nThe company in the industrial hub of Hwaseong, south-west of Seoul, was ordered to shut its only factory for inspections, Labour Ministry official Min Gil-soo told a briefing.\nPolice raided the company’s offices on June 26, the Yonhap news agency said.\nThe authorities did not identify the company officials being investigated, however. Safety code violations can lead to jail terms for fatal accidents.\nAricell chief executive Park Soon-kwan apologised on June 25 for the fire but said the company had complied with all safety regulations and training requirements.\nFlames quickly engulfed the factory, where 35,000 lithium batteries were stored, and the spread of toxic smoke probably rendered workers unconscious within seconds, fire officials have said.\nOnly three of the dead, all of them South Korean men, have been identified. The rest, including 17 Chinese people, have yet to be identified as their bodies suffered severe damage in the fire.\nInvestigators are trying to determine the cause of the blaze amid questions about Aricell’s hiring of foreign workers on a temporary basis and whether they received adequate safety training.\nThe office of a lawmaker, Mr Kim Sung-hoi, provided a copy of a March inspection report by the Hwaseong fire department that showed it had flagged serious risks, including possible “rapid combustion” at the building where the fire broke out.\nConfirming the inspection report, an official at the fire department said fire officials had also visited the company on June 5 to consult on fire prevention.\nSet up in 2020, Aricell has 48 full-time employees and makes lithium primary batteries for sensors and radio communication devices.\nIt also supplies batteries to the military for use in some communication and crypto devices, a spokesperson for South Korea’s defence procurement agency said.\nThe agency’s annual safety inspections cover suppliers in some categories, such as firearms and chemicals, but exclude battery makers such as Aricell, the spokesperson added.\nIts parent company, S-Connect, supplies lithium-ion battery parts to Samsung SDI, one of the country’s major secondary battery makers. REUTERS", "url": "https://www.straitstimes.com/asia/south-korean-authorities-order-battery-maker-to-halt-operations-over-deadly-blaze"}