{"authors": ["Connie Er"], "date_download": "2024-10-12 13:46:25", "date_modify": "2024-10-12 13:46:25", "date_publish": "2024-08-08 20:27:04", "description": "Asian Insider brings you insights into a fast-changing region from our network of correspondents and commentators. Read more at straitstimes.com.", "filename": "asia_asian-insider-what-are-bangladesh-s-options-minnesota-nice-v-new-york-nasty_1728740785.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/hzainl080824.jpg?VersionId=MlKT1grgeU7JIwkWetmixShT.3.HOx.v", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_asian-insider-what-are-bangladesh-s-options-minnesota-nice-v-new-york-nasty_1728740785.html", "title": "Asian Insider: What are Bangladesh’s options? | ‘Minnesota Nice’ v ‘New York Nasty’", "title_page": "Asian Insider: What are Bangladesh’s options? | ‘Minnesota Nice’ v ‘New York Nasty’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Dear ST reader,\nWhat an eventful week it has been.\nBangladesh is set to get an interim government headed by Nobel Peace Prize-winning economist Muhammad Yunus, after weeks of deadly student protests forced Prime Minister Sheikh Hasina to resign and flee to India. Senior Columnist Ravi Velloor says, however, that years of toxic politics will make finding an acceptable civilian government challenging.\nIn the US, Democratic presidential candidate Kamala Harris has picked her running mate, Minnesota Governor Tim Walz. The US presidential election is lining up to be a contest between “Minnesota Nice” and “New York Nasty”. Both can play vicious, of course, says US Bureau Chief Bhagyashree Garekar.\nWhile Mr Walz had spent a year teaching US history and English to high school students in southern China’s Guangdong province, his China experience may not mean warmer ties between the two countries, China Correspondent Aw Cheng Wei reports.\nMeanwhile, the world has been kept in suspense since Iran vowed revenge for the killing - blamed on Israel - of Hamas’s political leader Ismail Haniyeh in Tehran. Global Affairs Correspondent Jonathan Eyal examines if assassinations work, besides striking fear into one’s enemies.", "url": "https://www.straitstimes.com/asia/asian-insider-what-are-bangladesh-s-options-minnesota-nice-v-new-york-nasty"}