{"authors": [], "date_download": "2024-10-12 14:21:38", "date_modify": "2024-10-12 14:21:38", "date_publish": "2024-08-25 23:16:00", "description": "No injuries have been reported and the crew is currently safe. Read more at straitstimes.com.", "filename": "asia_se-asia_navy-vessel-kd-pendekar-sinks-off-johor-coast_1728742898.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/25/SINK.PNG?VersionId=F_H52ankcGH164kaM5hSO6JYtcudNx30", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_navy-vessel-kd-pendekar-sinks-off-johor-coast_1728742898.html", "title": "Malaysia navy vessel KD Pendekar sinks off Johor coast", "title_page": "Malaysia navy vessel KD Pendekar sinks off Johor coast | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA - The navy vessel KD Pendekar has experienced “severe flooding” following a leak, and has completely sunk off the coast of Johor.\nThe KD Pendekar sank at 3.54pm on Aug 25, two nautical miles south-east of Tanjung Penyusop, said the navy in a statement.\nConstructed by Karlskrona Varvet Shipyard in Sweden, this vessel was launched on Nov 11, 1978, and commissioned into the navy fleet on July 27, 1979.\n“Efforts to salvage the ship are still under way,” it said.\nThe navy also commended the swift action of the maritime community for the successful rescue of all 39 crew members of the vessel before the ship was fully submerged.\n“No injuries have been reported. The crew is currently safe and has been placed at KD Sultan Ismail, Tanjung Pengelih.\n“The navy assets have been deployed at the incident site to monitor the current situation and environmental safety,” it said.\n“The leak, believed to have been caused by the vessel colliding with an underwater object, was initially detected in the ship’s engine room.\n“Despite the crew’s best efforts to control the situation and stabilise the vessel, the leak quickly spread and became unmanageable.\nThe navy said its primary focus now was to conduct salvage operations to recover the vessel.\nIn the light of the incident, the navy has announced the immediate formation of a special investigation board to determine the cause of the leak.\nThe navy has also expressed its gratitude to the Malaysian Maritime Enforcement Agency (MMEA), the police, and the local maritime community for their swift response and assistance during the incident.\n“The public is advised not to create any speculation about the incident. For accurate and up-to-date information, please refer to official navy sources,” it added. THE STAR/ ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/navy-vessel-kd-pendekar-sinks-off-johor-coast"}