{"authors": [], "date_download": "2024-10-12 14:05:53", "date_modify": "2024-10-12 14:05:53", "date_publish": "2023-01-20 09:12:57", "description": "Businesswoman Nickie Mali Lum Davis admitted she was paid millions to lobby the White House to drop its probe of Jho Low.  Read more at straitstimes.com.", "filename": "asia_se-asia_hawaiian-gets-2-years-jail-for-trying-to-stop-1mdb-probe_1728741953.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/20/BL1_3.jpg?VersionId=1C8456mnUO3ELMoNA4MieEtxP58QDh4f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_hawaiian-gets-2-years-jail-for-trying-to-stop-1mdb-probe_1728741953.html", "title": "Hawaiian gets 2 years’ jail for trying to stop 1MDB probe", "title_page": "Hawaiian gets 2 years’ jail for trying to stop 1MDB probe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONOLULU – A Hawaii businesswoman was sentenced to two years in prison for helping to illegally lobby the Trump administration to drop an investigation into the 1MDB global bribery scandal and remove a Chinese dissident from the United States.\nNickie Mali Lum Davis, 47, was sentenced on Wednesday in Honolulu, where she had pleaded guilty to her role in an unregistered lobbying campaign that led to charges against several other people. Davis, who was paid more than US$3 million (S$4 million), had asked for probation for her cooperation with prosecutors.\nShe admitted she joined Elliot Broidy, a fundraiser for former US president Donald Trump; Prakazrel “Pras” Michel, a former member of the hiphop trio the Fugees; and George Higginbotham, a former Justice Department lawyer, in lobbying the White House to abandon its probe of Low Taek Jho, also known as Jho Low.\nLow was indicted in 2018 on charges of conspiring to launder billions of dollars embezzled from 1MDB, using the money to buy a private jet, a super-yacht and to produce Hollywood movie The Wolf Of Wall Street. Low has denied wrongdoing and is considered a fugitive. The 1MDB scandal toppled the previous Malaysian government of Najib Razak, ensnared Goldman Sachs Group and set off investigations across the globe.\nBroidy, who was paid at least US$9 million, pleaded guilty to his role in the scheme in October 2020 and was pardoned by Mr Trump. Higginbotham pleaded guilty and awaits sentencing. Michel is set to go on trial in Washington in March.\nDavis and her associates tried to arrange meetings with a Chinese minister, the US Attorney-General, the Secretary of Homeland Security and others during the minister’s visit to the US in May 2017, according to the Justice Department.\nIn arguing for leniency, her lawyers said she had helped prosecutors for four years, testifying to a Washington grand jury against Michel and helping to secure Broidy’s guilty plea.\nThey described her as a self-made entrepreneur who founded a musical-licensing company and music-production company.\nBut Davis also tried to back out of her guilty plea last year in a dispute with her previous attorney. US District Judge Leslie Kobayashi rejected that request.\nDavis agreed to forfeit the money she received as part of her plea agreement. BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/hawaiian-gets-2-years-jail-for-trying-to-stop-1mdb-probe"}