{"authors": ["Trinna Leong"], "date_download": "2024-10-12 14:06:11", "date_modify": "2024-10-12 14:06:11", "date_publish": "2018-09-12 12:19:28", "description": "Datuk Seri Anwar Ibrahim, the Parti Keadilan Rakyat president-elect, will contest the seat in Negeri Sembilan in a by-election. Read more at straitstimes.com.", "filename": "asia_se-asia_anwar-ibrahim-to-contest-port-dickson-seat-in-by-election_1728741971.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/09/12/ak_anwar_1209.jpg?VersionId=W6vpoFm_zY4tRunmWBU3yVa8Gu3zDFWt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_anwar-ibrahim-to-contest-port-dickson-seat-in-by-election_1728741971.html", "title": "Anwar Ibrahim to contest Port Dickson seat in next step to becoming Malaysia’s PM", "title_page": "Anwar Ibrahim to contest Port Dickson seat in next step to becoming Malaysia’s PM | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA - Malaysia's Anwar Ibrahim is aiming to make his political comeback by year-end as his party announced on Wednesday (Sept 12) that he will contest a by-election in Port Dickson, Negeri Sembilan.\nThe return of Datuk Seri Anwar to politics has been widely expected, as he prepares to ascend to power as part of an agreement within the ruling Pakatan Harapan pact to make him Prime Minister in two years.\nPort Dickson MP Danyal Balagopal Abdullah has stepped aside to allow the former jailed leader to run in his seat.\n\"Last night I was informed that after having discussed with party leadership, Anwar Ibrahim decided to accept my offer to ... contest in the Port Dickson constituency,\" Datuk Danyal said at a press conference on Wednesday.\n\"Hence I'm now announcing my resignation as MP with immediate effect,\" added the first-term lawmaker.\nPH had promised voters prior to the historic May general election that Tun Dr Mahathir Mohamad would be appointed Prime Minister if it won, on the agreement that Tun Dr Mahathir would hand over the post to Mr Anwar in due course after the imprisoned leader was allowed to run in elections.\nMr Anwar, who is president-elect of Parti Keadilan Rakyat (PKR), one of the four parties in PH, was serving a five-year jail sentence at the time. He was given a royal pardon and released from prison days after PH triumphed in the May elections.\nMr Anwar was not present at the press conference.\nDatuk Saifuddin Nasution, secretary general of PKR explained that the party selected that seat for Mr Anwar's anticipated political return due to several factors, one being that the ward is seen as a \"safe seat\".\n\"Port Dickson has been a constituency that's been represented by PKR in the last three terms. For that we consider it as one of the safer seats,\" said Mr Saifuddin.\nHe added that as of now, there are no plans for Mr Anwar to take a post in the administration on his return to Parliament, as Mr Anwar has said he prefers to focus on parliamentary reform.\nMr Danyal has submitted his resignation letter to Parliament's Speaker, after which the Election Commission will set a by-election date.\nThe semi-urban seat of Port Dickson has a population comprising 53 per cent Malays, 26 per cent Chinese and 21 per cent Indians, according to the Department of Statistics.\nDatuk Danyal is relatively new to politics. He was roped in to contest the May elections at the eleventh hour, after PKR's initial candidate was penalised by the Election Commission for failing to submit a document.", "url": "https://www.straitstimes.com/asia/se-asia/anwar-ibrahim-to-contest-port-dickson-seat-in-by-election"}