{"authors": [], "date_download": "2024-10-12 13:43:55", "date_modify": "2024-10-12 13:43:55", "date_publish": "2023-12-28 21:27:33", "description": "There were no survivors on the Yeti Airlines flight that crashed on Jan 15. Read more at straitstimes.com.", "filename": "asia_mistaken-cutting-of-power-caused-nepal-plane-crash-that-killed-72-report_1728740635.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/28/LYNXMPEJBR0BN-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_mistaken-cutting-of-power-caused-nepal-plane-crash-that-killed-72-report_1728740635.html", "title": "Mistaken cutting of power caused Nepal plane crash that killed 72: Report", "title_page": "Mistaken cutting of power caused Nepal plane crash that killed 72: Report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KATHMANDU - A Yeti Airlines crash in Nepal that killed 72 people almost a year ago was caused by the pilots mistakenly cutting power, leading to an aerodynamic stall, a report issued by a government-appointed investigation panel on Dec 28 said.\nThe ATR 72, operated by privately owned Yeti Airlines, crashed just before landing in the tourist city of Pokhara on Jan 15 in one of Nepal's worst aeroplane accidents in 30 years. There were 72 people on the twin-engine aircraft including two infants, four crew and 15 foreign nationals. There were no survivors.\nMr Dipak Prasad Bastola, an aeronautical engineer and a member of the investigating panel, said that due to lack of awareness and lack of standard operating procedures, the pilots had put the condition levers, which control power, in the feathering position, instead of selecting the flap lever. This led the engine to “run idle and not produce thrust”, Mr Bastola told Reuters. “But due to its momentum, the aircraft flew for up to 49 seconds before hitting the ground.”\nATR is based in France and the plane's engines were manufactured in Canada by Pratt & Whitney Canada.\nIt was Nepal's deadliest air crash since 1992, when a Pakistan International Airlines Airbus A300 crashed into a hillside on its approach to Kathmandu, killing all 167 people on board.\nNearly 350 people have died since 2000 in plane or helicopter crashes in Nepal – home to eight of the world’s 14 highest mountains, including Everest – where sudden weather changes can cause hazardous conditions.\nThe European Union has banned Nepali airlines from its airspace since 2013, citing safety concerns. REUTERS", "url": "https://www.straitstimes.com/asia/mistaken-cutting-of-power-caused-nepal-plane-crash-that-killed-72-report"}