{"authors": [], "date_download": "2024-10-12 13:36:12", "date_modify": "2024-10-12 13:36:12", "date_publish": "2024-06-12 01:30:26", "description": "US officials also denied the pier had been used by Israel for its June 9 hostage rescue mission. Read more at straitstimes.com.", "filename": "asia_gaza-pier-resumes-operations-after-pause-due-to-weather-us-officials-say_1728740172.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/12/LYNXMPEK5A0PX-2.jpg?VersionId=jkPtapmHnBXHrWOSa9A14QlbPqOi4Nmr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_gaza-pier-resumes-operations-after-pause-due-to-weather-us-officials-say_1728740172.html", "title": "Gaza pier resumes operations after pause due to weather, US officials say", "title_page": "Gaza pier resumes operations after pause due to weather, US officials say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - A floating US military pier off Gaza has resumed bringing humanitarian aid into the enclave after being suspended for two days because of rough seas due to weather, three US officials said on June 11.\nAfter the pier was out of operation for 10 days for repairs, the US military briefly resumed offloading aid on June 8, but bad sea conditions halted aid movement on the following two days.\nThe officials, speaking on the condition of anonymity, said the sea conditions had improved, allowing for aid to be brought to a marshalling area.\nThe Pentagon on June 10 sought to dispel what it said were false social media reports that Israel used the pier in a hostage rescue mission on June 9. The UN said it would review security before resuming aid deliveries from the dock.\nThe UN has not yet resumed transportation of the aid from the pier to UN World Food Programme warehouses. WFP chief Cindy McCain said on June 10 that those warehouses were struck on June 9 and one person injured.\nAid began arriving via the US-built pier on May 17, and the UN said it transported 137 trucks of aid to warehouses, some 900 metric tons, before the US announced on May 28 that it had suspended operations so repairs could be made.\nUS President Joe Biden announced in March the plan to put the pier in place for aid deliveries as famine loomed in Gaza, a Hamas-run enclave of 2.3 million people, during the war between Israel and the Palestinian militants. REUTERS", "url": "https://www.straitstimes.com/asia/gaza-pier-resumes-operations-after-pause-due-to-weather-us-officials-say"}