{"authors": [], "date_download": "2024-10-12 13:45:36", "date_modify": "2024-10-12 13:45:36", "date_publish": "2024-09-17 16:41:41", "description": "The possible new storm would approach the central city of Danang late on Sept 19 or early Sept 20. Read more at straitstimes.com.", "filename": "asia_vietnam-braces-for-another-storm-as-yagi-typhoon-death-toll-surpasses-290_1728740736.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/LYNXMPEK8G07C-1.jpg?VersionId=RkKZEsLlTFVoJZMC8crFaHNE3AjDL6vF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_vietnam-braces-for-another-storm-as-yagi-typhoon-death-toll-surpasses-290_1728740736.html", "title": "Vietnam braces itself for another storm as Yagi typhoon death toll surpasses 290", "title_page": "Vietnam braces itself for another storm as Yagi typhoon death toll surpasses 290 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANOI - Vietnam is preparing for more flooding with a tropical depression forecast to strengthen into a storm as it heads to its central coast, days after typhoon Yagi set off floods and landslides that killed more than 290 people in the north.\nWith a long coast facing the South China Sea, the South-east Asian country is prone to tropical storms that can cause large numbers of casualties and serious damage to industrial production and properties.\nThe depression is forecast to strengthen into a storm within the next 24 hours, the government said in a statement, as it sent a warning to coastal provinces.\nThe storm would trigger heavy rains in central Vietnam, it said, adding that “the depression is evolving in a complicated manner, with possible changes in course, speed and strength”.\nVietnam has been reeling from the impacts of Typhoon Yagi, the strongest storm to hit Asia in 2024, which made landfall in its north-eastern coast 10 days ago.\nThe typhoon and its subsequent floods and landslides have killed 291 people overall, with 38 others missing and nearly 2,000 people injured, the disaster management agency said on Sept 17.\nIndustrial production in several northern provinces was halted, 235,000 houses were damaged and more than 300,000 hectares of rice and cash crops were inundated.\nThe possible new storm would approach the central city of Danang late on Sept 19 or early Sept 20, according to the weather agency.\nThe authorities in Danang and neighbouring Quang Nam province have warned vessels at sea about the incoming depression and readied search and rescue plans, according to their disaster management departments. REUTERS", "url": "https://www.straitstimes.com/asia/vietnam-braces-for-another-storm-as-yagi-typhoon-death-toll-surpasses-290"}