{"authors": [], "date_download": "2024-10-12 13:37:30", "date_modify": "2024-10-12 13:37:30", "date_publish": "2023-06-14 10:15:39", "description": "Violent crime in Japan is extremely rare and gun possession tightly controlled. Read more at straitstimes.com.", "filename": "asia_east-asia_several-injured-in-shooting-at-japan-army-training-range-local-media_1728740250.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/15/dw-jgsdf-shooting-1-230614_0.JPG?VersionId=Cb5WZGUKPRNT.x3D03e14VrN3dV32fKp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_several-injured-in-shooting-at-japan-army-training-range-local-media_1728740250.html", "title": "Two killed in shooting at Japan army training range; teen suspect arrested", "title_page": "Two killed in shooting at Japan army training range; teen suspect arrested | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Two soldiers were killed and a third wounded when a fellow recruit opened fire at a training range in central Japan on Wednesday, the military said.\n“During a live-bullet exercise as part of new-personnel training, one Self-Defence Forces (SDF) candidate fired at three personnel,” the Ground Self-Defence Force (GSDF) said in a statement.\n“The death of another person has been confirmed of the three who were shot at,” the GSDF said later, after earlier announcing one death and two injured individuals.\nEarlier, government spokesman Hirokazu Matsuno said a suspect had been detained, but gave no further details.\nLocal police told AFP the shooter was an 18-year-old SDF candidate who was detained on the spot by other soldiers.\nHe has been charged with the attempted murder of a 25-year-old soldier, a police spokesman said, declining to be identified. The suspect “fired a rifle at the victim with the intent to kill”, the spokesman told AFP.\nNational broadcaster NHK reported that the wounded were a man in his 50s and two other men in their 20s.\nAerial footage broadcast by the station showed military personnel and civilians gathered around an emergency vehicle and police blocking nearby roads.\nSome of the individuals seen in the footage appeared to be investigating the incident, as they were wearing covers over their shoes and hair.\nA local resident told NHK that he saw several emergency vehicles rushing to the area at around 9.30am local time (8.30am Singapore time), but had not heard anything before that.\nThe training range is administered by the region’s Camp Moriyama and is a covered facility of more than 65,000 sq m.\nViolent crime in Japan is extremely rare, and gun possession is tightly controlled.\nBut several high-profile incidents have rattled the country recently. In July 2022, former prime minister Shinzo Abe was shot dead on the campaign trail by a man who allegedly targeted him over his links to the Unification Church.\nThe accused assassin, Tetsuya Yamagami, was due to make his first appearance in court this week, but the session was cancelled after a package sent to the facility set off a metal detector.\nIt was later found to contain no explosives, but rather a petition signed by thousands calling for a lenient sentence for Yamagami.\nHe has garnered a surprising amount of sympathy from some quarters over the effect that his mother’s devotion to the Unification Church had on his family and childhood.\nIn April, Prime Minister Fumio Kishida escaped unharmed after a man threw an explosive device towards him at a campaign event.\nThat incident came shortly before Japan hosted the Group of Seven leaders’ summit in Hiroshima and prompted renewed calls for stepped-up security.\nThousands of police were sent to secure the gathering, which passed without a security incident.\nIn May, police in Nagano, west of Tokyo, detained a man after an hours-long knifing and shooting rampage, followed by an extended stand-off. The man, reportedly the son of the Speaker of the local city assembly, killed four people, including two police officers, before he was detained. AFP", "url": "https://www.straitstimes.com/asia/east-asia/several-injured-in-shooting-at-japan-army-training-range-local-media"}