{"authors": [], "date_download": "2024-10-12 14:03:08", "date_modify": "2024-10-12 14:03:08", "date_publish": "2023-04-02 21:15:16", "description": "The ministers’ meeting comes just days after Japan unveiled export controls on 23 items used to make semiconductors. Read more at straitstimes.com.", "filename": "asia_chinese-foreign-minister-qin-gang-says-japanese-chip-curbs-to-drive-beijings-self-reliance_1728741788.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/02/2023-04-02T101138Z1930893355RC2560AYH082RTRMADP3CHINA-JAPAN_1.JPG?VersionId=7cMuQjVXU7IH6_ewGs3I7HZCBwOl._Oj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_chinese-foreign-minister-qin-gang-says-japanese-chip-curbs-to-drive-beijings-self-reliance_1728741788.html", "title": "Japan’s chip curbs will drive Beijing’s self-reliance, says Chinese Foreign Minister Qin Gang", "title_page": "Japan’s chip curbs will drive Beijing’s self-reliance, says Chinese Foreign Minister Qin Gang | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Chinese Foreign Minister Qin Gang told his Japanese counterpart on Sunday that Tokyo’s new export controls on semiconductor equipment will only further drive Beijing’s quest “to become self-reliant”.\nMr Yoshimasa Hayashi’s visit to China is the first by a Japanese foreign minister since December 2019, ending a gap of over three years during which bilateral ties have sharply deteriorated.\nThe ministers’ Beijing meeting comes just days after Japan unveiled planned export controls on 23 items used to make semiconductors, following US pressure for countries to restrict China’s access to the technology.\n“The United States used bullying tactics to brutally suppress the Japanese semiconductor industry, and now it is repeating its old tricks against China,” Mr Qin told his counterpart, according to a read-out of the meeting.\nHe also accused Japan of being Washington’s “minion”.\n“The blockade will only further stimulate China’s determination to become self-reliant,” he said.\nJapan’s controls were preceded by similar restrictions imposed in March by the Netherlands, where the authorities cited “international and national security”.\nIn comments to reporters, Mr Hayashi on Sunday defended the new restrictions as “consistent with international rules”, adding that they were “not aimed at a specific country”.\nSemiconductors have become a major flashpoint in the souring ties between China and Japan – the world’s second- and third-largest economies.\nThe foreign ministers also discussed China’s recent detention of a Japanese national working in Beijing for Tokyo-based pharmaceutical company Astellas under allegations of espionage.\nMr Hayashi told reporters after the meeting that Japan had “protested” against the detention, and called for “the immediate release of that individual”.\nMr Qin said on Sunday that “China would deal with him according to the law”, without offering further details on the case.\nThe two sides also discussed a disputed group of islands that Japan calls Senkaku and Beijing calls Diaoyu.\nMr Hayashi said: “We reiterated my serious concerns about the East China Sea, including the situation surrounding the Senkaku Islands, as well as China’s increased military activities in and around our country, including cooperation with Russia.”", "url": "https://www.straitstimes.com/asia/chinese-foreign-minister-qin-gang-says-japanese-chip-curbs-to-drive-beijings-self-reliance"}