{"authors": [], "date_download": "2024-10-12 14:03:57", "date_modify": "2024-10-12 14:03:57", "date_publish": "2023-02-02 17:46:20", "description": "“Sushi Terrorism” gained steam after a teen was filmed licking shared restaurant items like a soy sauce bottle. Read more at straitstimes.com.", "filename": "asia_east-asia_sushi-pranks-in-viral-videos-at-japan-s-conveyor-belt-restaurants-spark-outrage_1728741837.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/02/sv-sushicoll-020223_0.jpg?VersionId=xNPIMrErJV8xfLT8CFrnqMn_u7omiFqe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_sushi-pranks-in-viral-videos-at-japan-s-conveyor-belt-restaurants-spark-outrage_1728741837.html", "title": "Sushi pranks in viral videos at Japan’s conveyor belt restaurants spark outrage", "title_page": "Sushi pranks in viral videos at Japan’s conveyor belt restaurants spark outrage | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan’s famed conveyor-belt sushi restaurants are scrambling to tackle a craze for making viral videos in which customers commit unhygienic acts.\nThe phenomenon, dubbed “sushi terrorism”, gained steam earlier this week after a teenager posted a video to social media filmed in Japan’s largest conveyor belt sushi chain. He was filmed licking shared items, including a soya sauce bottle and a bowl, and touching sushi as it rolled past with fingers he had put in his mouth.\nThe video, taken in Gifu city, quickly went viral on platforms including Twitter, sparking a wave of copycat incidents and sending shares in the restaurant’s parent company down 4.8 per cent on Tuesday.\nThe video pranks come at a particularly sensitive time for Japan, which is suffering its deadliest Covid-19 outbreak since the pandemic began, and as restaurants struggle to survive amid surging inflation.\nFood & Life, which owns Akindo Sushiro, the chain whose outlet the incident occurred at, said in a statement this week that it had filed a police report and received an apology from the perpetrator.\nA spokesman for the company told Bloomberg the video had “caused a lot of anxiety among our customers and made them uncomfortable”.\nThe chain said it will add acrylic screens at some outlets to deter people from tampering with items on its conveyor belts, and said it would provide fresh seasonings and cutlery to those who request it.\nStill, investors are concerned. Despite paring some of its earlier losses, shares in Food & Life remained some 4 per cent down on Thursday.\nThe conveyor belt sushi restaurant format “was not designed for the era when individuals can post videos on the Internet”, said Citigroup analyst Shuhei Oba in a note this week.\n“We believe demand for cheap and delicious sushi will continue to grow longer term, but costs could increase as operators strengthen their response to such campaigns,” Mr Oba wrote.\nRestaurant chains were this week attempting to enforce stricter hygiene measures as older videos emerged and wall-to-wall media coverage inspired copycats.\nThe latest target involved a man using a communal spoon to eat his meal at a popular udon chain in Kitakyushu city.\nSpokesmen for two other major conveyor belt sushi chains, Zensho Holdings-owned Hamasushi and Kura Sushi, told Bloomberg they were considering methods like deploying artificial intelligence and cameras to deter potential pranksters.\nSushi chains are facing an additional “weight of investment”, said Mr Shun Tanaka, a restaurant industry analyst for SBI Securities.\nIf businesses, already squeezed by having to maintain low prices, cannot maintain profitability, “it’s possible that the conveyor belt sushi business itself will disappear”. BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/sushi-pranks-in-viral-videos-at-japan-s-conveyor-belt-restaurants-spark-outrage"}