{"authors": [], "date_download": "2024-10-12 13:55:54", "date_modify": "2024-10-12 13:55:54", "date_publish": "2024-04-05 21:33:01", "description": "BENGALURU - India's Godrej Consumer Products said on Friday that its operating conditions in India continued to remain subdued, with demand taking a hit due to an extended winter, while the devaluation of the Nigerian currency further hurt revenue. Read more at straitstimes.com.", "filename": "asia_indias-godrej-consumer-says-operating-conditions-remain-subdued-africa-sales-sting_1728741354.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/05/ST-logo-placeholder_27.jpg?VersionId=uWP.fPp68T11BreBj47c3g8hR2P2igso", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_indias-godrej-consumer-says-operating-conditions-remain-subdued-africa-sales-sting_1728741354.html", "title": "India's Godrej Consumer says operating conditions remain subdued, Africa sales sting", "title_page": "India's Godrej Consumer says operating conditions remain subdued, Africa sales sting | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BENGALURU - India's Godrej Consumer Products said on Friday that its operating conditions in India continued to remain subdued, with demand taking a hit due to an extended winter, while the devaluation of the Nigerian currency further hurt revenue.\nThe company, which makes the GoodKnight brand of household insecticides and the KamaSutra brand of sexual wellness products, had reported its slowest total revenue growth in 14 quarters in December-quarter, hurt by beleaguered demand for its products as India's inflation surged.\nThis continued into the March quarter as well, as an extended winter in the north and east of India meant that customers opted to buy fewer of Godrej's household insecticide products.\nIn addition, the devaluation of the Nigerian currency Naira in January brought about a double-digit decline in sales in Indian rupee terms, the company said in its update.\nAfrica accounts for over 25% of the company's revenue, as of Dec. 31.\nHowever, the India organic business continued to deliver strong underlying volume growth in the high-single-digit percentage across both the home care and personal care segments, the company said.\nIts Indonesia operations, which contributed nearly 13% of Godrej's revenue in the December quarter, delivered double-digit percentage sales growth, it added.\nRival Dabur India had noted a day earlier that overall demand remained \"sluggish\".\nGodrej's shares closed 2.8% higher ahead of the update, marking a 7% increase so far this year. REUTERS", "url": "https://www.straitstimes.com/asia/indias-godrej-consumer-says-operating-conditions-remain-subdued-africa-sales-sting"}