{"authors": ["Jonathan Pearlman"], "date_download": "2024-10-12 13:52:34", "date_modify": "2024-10-12 13:52:34", "date_publish": "2023-06-08 21:38:00", "description": "This push has resulted in a new partnership that could enable the US to invest in mining in Australia. Read more at straitstimes.com.", "filename": "asia_australia-moves-to-find-new-critical-minerals-partners-but-risks-china-s-ire_1728741154.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/09/2023-04-04T102901Z1413074730RC280K9GUI8FRTRMADP3ELECTRIC-RAREEARTHS-WASTE.JPG?VersionId=WKoh_LSzY1IalOU.fidbBuYQcejEh3jz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australia-moves-to-find-new-critical-minerals-partners-but-risks-china-s-ire_1728741154.html", "title": "Australia moves to find new critical minerals partners but risks China’s ire", "title_page": "Australia moves to find new critical minerals partners but risks China’s ire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - For decades, Australia has been a crucial supplier of the iron ore that has helped to quench China’s insatiable appetite for steel.\nThis massive flow of iron ore – which saw more than A$150 billion (S$135 billion) of sales a year – enabled China to build apartment blocks, shopping centres and infrastructure projects around the country as its economy expanded.\nBut in recent years, China has also invested in other Australian resources for its transformation into a technology superpower. Today, China is a major extractor and processor of critical minerals such as rare earths that are used to produce electric car batteries, superconductors, mobile phones and other high-end technologies.\nHowever, as tensions in the region have risen and concerns emerged about supply chain problems during the Covid-19 pandemic, Canberra has started seeking new “like-minded” partners to extract and process critical minerals to break China’s monopoly.\nThis push has resulted in a new partnership with Washington – announced following a meeting in May between Australian Prime Minister Anthony Albanese and US President Joe Biden – that could enable the United States to invest in mining in Australia for its defence needs.\nThe White House has said Mr Biden will ask the US Congress to add Australia as a “domestic source” within its Defence Production Act – a move that would mean the US could directly fund mining in Australia. Only Canada has this status now.\nThe push to diversify Australia’s critical minerals exports – including to Japan – comes as Canberra’s frosty ties with Beijing have been improving. But it is not yet clear whether Canberra’s moves will set back the diplomatic relationship or lead China to expand a series of trade sanctions it has imposed against Australia.\nDr John Coyne from the Australian Strategic Policy Institute, an expert on strategic intelligence, said he believes Australia needs to try to end China’s “almost monopolistic control of rare earths and a number of critical minerals”. But he added that the move could cause tensions with Beijing.\n“Beijing went to great efforts to secure control of critical minerals, and they are not likely to release that without a fight,” he told The Straits Times.\nSince Mr Albanese’s Labor Party won the election in 2022, Beijing has ended its freeze on high-level contacts with Canberra.\nStill, Dr Coyne does not believe Beijing’s pushback would jeopardise Australia’s current efforts to stabilise ties with China.\n“We are still open to foreign investment in mining infrastructure,” he said.\n“There wasn’t a great response from Beijing (to Australia’s moves to diversify the sector) but it didn’t degrade the relationship any further.”\nNoting that China’s economic sanctions have raised concerns about its reliability as a trade partner, Dr Coyne added: “We would never have reached this point if China hadn’t used trade to economically coerce countries.“\nAustralia produces about 52 per cent of the world’s lithium, according to analysis by BP. Of this supply, about 97 per cent goes to China. Lithium is used in rechargeable batteries for electric cars and consumer products such as mobile phones and laptops.\nAustralia is also a major supplier of the metals used to make rare earths, accounting for 8 per cent of global supply, behind China, which supplies 59 per cent, and the US, which supplies 15 per cent. China has a near monopoly on the production of rare earths, which are used to make electronic defence hardware and green energy products such as wind turbines and electric vehicles.\nAustralia’s Resources Minister Madeleine King has urged Canberra to find new partners for developing its critical minerals sector in order to break China’s dominance.\nWhile acknowledging that China’s strong role in the critical minerals market has benefited resource-rich countries such as Australia, she said Canberra should work with like-minded partners to ensure a diversified supply chain that prevents any single country having a stranglehold.\n“What we want to create is a more diverse supply chain,” she told ABC News in May.\n“They (China) have invested very heavily in renewables, in their critical minerals and rare earths industry, and the rest of the world, quite frankly, has been a bit caught behind on that. But now we are stepping up.”", "url": "https://www.straitstimes.com/asia/australia-moves-to-find-new-critical-minerals-partners-but-risks-china-s-ire"}