{"authors": [], "date_download": "2024-10-12 14:19:05", "date_modify": "2024-10-12 14:19:05", "date_publish": "2023-12-08 05:00:34", "description": "Costa Rica's president Rodrigo Chaves explained why Huawei is ineligible to run 5G mobile data networks in the country. Read more at straitstimes.com.", "filename": "asia_china-rejects-spying-concerns-from-costa-rica-leader-over-5g-network_1728742745.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/08/LYNXMPEJB60VF-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-rejects-spying-concerns-from-costa-rica-leader-over-5g-network_1728742745.html", "title": "China rejects spying concerns from Costa Rica leader over 5G network", "title_page": "China rejects spying concerns from Costa Rica leader over 5G network | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAN JOSE - China forcefully rejected cyber-security and spying concerns on Dec 7 raised by Costa Rica’s president as he explained why Chinese tech company Huawei is not eligible to run 5G mobile data networks in the Central American country.\nIn a statement, China’s embassy in San Jose blasted the government’s position as baseless, and in the past has said such statements could undermine economic ties with the Asian giant, the world’s second-biggest economy.\nOn Dec 6, President Rodrigo Chaves argued that his focus is to promote national security, while also saying that China’s government obligates Chinese firms to provide it with all information it requests.\n“The country where Huawei is based doesn’t have a solid judicial framework that prevents spying,” Mr Chaves told reporters at a regular government press conference.\nA day later, China’s embassy shot back, stating that the “accusations over cyber-security lack reason”.\nThe dispute over the development of Costa Rica's 5G mobile network – designed to provide more robust connections along with faster data and higher capacity – dates back to the summer, when a senior United States military commander publicly questioned Huawei's suitability.\nShortly afterwards in August, Mr Chaves signed a decree aiming to ban firms from 5G development countries that have not agreed to an international cybercrime convention.\nThe decree’s ban applies to tech companies from China, South Korea, Russia and Brazil, among others.\nHuawei currently provides Costa Rica’s government with other telecommunication services, and the firm is currently awaiting a ruling from the country’s constitutional court over whether it is being unfairly treated due to home base in China.\nChina \"categorically rejects\" all criminal wrongdoing, its embassy said in its statement, adding that it also opposes what it described as the politicisation of scientific and other technological issues.\nThe dispute risks upsetting ties between China and Costa Rica, which in 2007 was the first Central American nation to formally recognise Beijing. REUTERS", "url": "https://www.straitstimes.com/asia/china-rejects-spying-concerns-from-costa-rica-leader-over-5g-network"}