{"authors": [], "date_download": "2024-10-12 13:37:27", "date_modify": "2024-10-12 13:37:27", "date_publish": "2024-07-08 11:41:00", "description": "Major announcements are unlikely, but the visit is meant to signal that India and Russia remain close. Read more at straitstimes.com.", "filename": "asia_south-asia_putin-hosts-modi-after-hailing-best-in-history-ties-with-india-rival-china_1728740247.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/08/2024-07-05T130018Z86427611RC2DIW9OX7YARTRMADP3RUSSIA-INDIA.JPG?VersionId=et3Q9_RW1m.egZqdRSW8cEz6UTkRlmGf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_putin-hosts-modi-after-hailing-best-in-history-ties-with-india-rival-china_1728740247.html", "title": "Putin hosts Modi after hailing ‘best in history’ ties with India’s rival China", "title_page": "Putin hosts Modi after hailing ‘best in history’ ties with India’s rival China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI – Indian Prime Minister Narendra Modi landed in Russia on July 8 for the first time in five years at a time when Moscow is deepening its embrace of New Delhi’s rival, China.\nMr Modi is set to meet Russian President Vladimir Putin during the visit, which will stretch into July 9. India’s Foreign Secretary Vinay Kwatra told reporters in New Delhi that given the lack of recent summits, several issues on the bilateral agenda “have piled up, which need to be addressed”.\nSenior Indian diplomats, speaking on condition of anonymity, said while major announcements are unlikely, Mr Modi’s visit is intended to send a signal that the two sides remain close.\nRussia’s ties to India stretch back to the Cold War, and the country is India’s biggest supplier of weapons and oil.\nThat relationship has remained “resilient”, Mr Kwatra said.\nHailing his friendship with Mr Putin, Mr Modi said on July 8 that the two countries have made progress on a number of fronts in the last decade, including in energy, security, trade and investment.\n“I look forward to reviewing all aspects of bilateral cooperation with my friend, President Vladimir Putin, and sharing perspectives on various regional and global issues,” Mr Modi said in a statement as he departed for Moscow.\n“We seek to play a supportive role for a peaceful and stable region.”\nIndia is watching carefully as Russia draws closer to China, which has served as an economic and diplomatic lifeline amid sanctions over the Kremlin’s gruelling war with Ukraine. During a security summit in Kazakhstan last week, Mr Putin described relations with China as the “best in history”.\nRelations between India and China have been stuck at a low point since a border dispute erupted into violence in 2020, though the two sides have agreed to talks to resolve the disagreement.\n“India, situated between Russia, China and the West, seeks more predictability from Russia and is willing to play a bigger role in promoting peace” in Ukraine, said Dr Petr Topychkanov, an associate senior researcher at the Stockholm International Peace Research Institute.\n“Nevertheless, behind closed doors, Mr Putin may face questions from Mr Modi about the increasingly close ties between Russia and China,” he said.\nIt will be Mr Modi’s first bilateral visit since he won a third term in office in June. His decision to travel to Russia instead of neighbouring countries like Bhutan, Maldives and Sri Lanka marks a break in convention for Indian leaders.\nPublicity boost for Putin\nFor Moscow, the trip helps rebuff Western efforts to cast Mr Putin as a pariah over his February 2022 invasion of Ukraine, while also shoring up relations with an important trading partner and key buyer of its oil.\nMeasures to reduce a trade imbalance between the two countries are likely to figure prominently in the talks, Mr Kwatra said.\nIndia currently imports about US$60 billion (S$81 billion) a year in goods from Russia, which is buying less than US$5 billion from India. China’s actions in the Indo-Pacific could also come up, India’s top diplomat said.\nWhile in previous years the Indian and Russian leaders met annually, Mr Modi began skipping those summits after Mr Putin threatened to use nuclear weapons in Ukraine in 2022. The two last met that year on the sidelines of a Shanghai Cooperation Organisation meeting in Uzbekistan.\nFuture arms deals could also be on the agenda, according to Mr Ruslan Pukhov, director of the Centre for Analysis of Strategies and Technologies, a Moscow-based defence think-tank.\nHe said Russia could supply India with new air defence systems and Su-30MKI fighter jets, as well as the licensed production of Ka-226T multi-purpose helicopters.\nIndia is facing a severe crunch of fighter jets and is considering buying a dozen more from Russia to replace those lost in accidents.\nMr Modi’s trip comes just weeks after a team of senior US officials travelled to India to discuss cooperation in technology, security and investment.\nMr Modi has sought a deeper partnership with the US and is pushing Washington to boost technology transfers and foreign investment.\nThe US, for its part, sees India as a partner in its rivalry with China, but the relationship has at times frustrated Washington.\nMr Modi has declined to condemn Russia’s invasion of Ukraine even as India has pushed for diplomacy. US prosecutors also are investigating an alleged murder-for-hire plot on American soil that they say involved senior Indian officials.\nUS Deputy Secretary of State Kurt Campbell in late June said US officials have raised concerns about India-Russia ties with New Delhi, but that Washington retained confidence in India and wants to expand relations.\nIn addition to talks with Mr Putin, Mr Modi is expected to meet members of the Indian community in Russia. About 14,000 Indians, including 4,500 students, reside there, according to the Indian embassy.\nAfter Moscow, Mr Modi will head to Austria, becoming the first Indian prime minister to visit the country in more than 40 years. He is expected to meet President Alexander Van Der Bellen and Chancellor Karl Nehammer, and hold talks with business leaders to expand trade and investment opportunities, Mr Modi’s office said in a statement on July 8. BLOOMBERG", "url": "https://www.straitstimes.com/asia/south-asia/putin-hosts-modi-after-hailing-best-in-history-ties-with-india-rival-china"}