{"authors": ["Raul Dancel"], "date_download": "2024-10-12 13:54:06", "date_modify": "2024-10-12 13:54:06", "date_publish": "2024-02-08 21:15:00", "description": "Ms Janthira Chuenlam died after the elephant stomped on her chest, causing her lungs to collapse. Read more at straitstimes.com.", "filename": "asia_se-asia_begging-elephant-tramples-owner-to-death-in-thailand_1728741246.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/08/INDONESIA-WILDLIFE-CONFLICT-060054.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_begging-elephant-tramples-owner-to-death-in-thailand_1728741246.html", "title": "‘Begging’ elephant tramples owner to death in Thailand", "title_page": "‘Begging’ elephant tramples owner to death in Thailand | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "An elephant being used to beg for food and money in Thailand trampled its owner to death, with reports suggesting that she attacked because she sensed her calf was being taken away from her.\nA 17-second clip of a Facebook video posted on Feb 7 by 3Plus News in Thailand shows an adult elephant charging at someone off screen by a roadside in Nakhon Sawan province in lower northern Thailand.\nTwo men are then seen trying to help a woman lying on the ground and keeping the elephant away.\nThe police later identified the woman as Ms Janthira Chuenlam, 35, who was said to be the elephant’s owner, the Pattaya Mail reported.\nMr Nattaphak Piluek, 18, who recorded the video used by 3Plus News, told the Pattaya Mail he saw the elephant being accompanied by Ms Jathira and her husband, as well as six others.\nThey were begging for food and money, he said.\nHe said everything seemed normal when the elephant, after being handed money and a tiny bell was rung, suddenly became agitated and then violently charged at Ms Janthira.\nAnother witness, Ms Tippawan Kawiwon, 28, said Ms Janthira had been leading the elephant along an alley, as her husband was hawking items by a roadside a few paces away along with the elephant’s calf.\nIt was suggested in news reports that the elephant could have been triggered by not seeing her calf or by the bell.\nMs Kamrai Mokkasak, 48, head of the Mahaphot Rescue and Disaster Relief Association, said Ms Jathira died after the elephant stomped on her chest, causing her lungs to collapse.\nMs Jathira and the two elephants were transported back to Surin province, some 500km away.\nMr Jatesada Ong-Art, the provincial livestock officer of Nakhon Sawan, said using elephants to beg violates several laws in Thailand.", "url": "https://www.straitstimes.com/asia/se-asia/begging-elephant-tramples-owner-to-death-in-thailand"}