{"authors": [], "date_download": "2024-10-12 13:58:21", "date_modify": "2024-10-12 13:58:21", "date_publish": "2023-12-04 18:40:00", "description": "Tokyo wants the use of the Osprey suspended until checks can be made, but the US military has said, ‘No’. Read more at straitstimes.com.", "filename": "asia_east-asia_5-bodies-found-at-us-osprey-crash-site-in-south-eastern-japan-media_1728741501.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/04/JAPAN-US-ACCIDENT-MILITARY-103540.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_5-bodies-found-at-us-osprey-crash-site-in-south-eastern-japan-media_1728741501.html", "title": "5 bodies found at US Osprey crash site in south-eastern Japan", "title_page": "5 bodies found at US Osprey crash site in south-eastern Japan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Five bodies and the bulk of the wreckage are thought to have been located underwater after a US military Osprey aircraft crashed in south-western Japan last week, the United States military said on Dec 4.\nAir Force Special Operations Command said search teams were able to locate remains, along with the main fuselage of the aircraft wreckage.\n“The dive teams were able to confirm five additional crew members from the original team of eight that were involved with the crash,” it said in a statement.\nIt added that the “the identities have yet to be determined at this time”.\n“The main priority is bringing the airmen home and taking care of their family members,” it said.\nThe CV-22 Osprey operated by the US Air Force plunged into the sea off the island of Yakushima on Nov 29 with eight people aboard.\nThe body of one victim was found that day, and he was identified by the Air Force as Staff Sergeant Jacob Galliher, 24.\nJapan’s public broadcaster NHK, citing unidentified sources, said on Dec 4 that what appeared to be the front part of the aircraft, possibly including the cockpit, had been found.\nTokyo has called for US Forces in Japan to suspend the use of the Osprey, which has been involved in several fatal crashes, until checks can be made.\nThe US side appears to have effectively rejected the request, in a step that could worsen often difficult ties between US forces and the local communities that host them.\nAccording to a statement issued earlier by Japan’s Ministry of Defence, the US has six CV-22 Ospreys at Yokota Air Base in western Tokyo and 24 MV-22 Ospreys at Marine Corps Air Station Futenma on the southern island of Okinawa.\nThe US continued to operate Ospreys on the island after the Japanese government request on Nov 30, the ministry said.\nPentagon deputy spokeswoman Sabrina Singh released a statement on Dec 1 saying Osprey flights have been suspended in the Air Force unit that flew the crashed plane.\nShe said the tilt-rotor aircraft in Japan operate “only after undergoing thorough maintenance and safety checks”.\nIn August, three US Marines were killed and five others critically injured after a V-22 Osprey went down while performing drills off the coast of Darwin in Australia’s Northern Territory.\nPrior incidents with the V-22 Osprey included a crash in 2000 that killed 19 Marines in Arizona. The accident was blamed on pilot error. AFP, BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/5-bodies-found-at-us-osprey-crash-site-in-south-eastern-japan-media"}