{"authors": [], "date_download": "2024-10-12 14:01:47", "date_modify": "2024-10-12 14:01:47", "date_publish": "2020-09-08 18:06:26", "description": "HONG KONG (BLOOMBERG) - The most popular Chinese-owned social media platforms, from WeChat to TikTok, are increasingly censoring content in the US and elsewhere, taking practices honed for years behind the Great Firewall to an international audience. Read more at straitstimes.com.", "filename": "asia_east-asia_wechat-and-tiktok-taking-chinese-censorship-global-study-says_1728741707.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/09/08/yq-chinatiktok-008092024.jpg?VersionId=OAqgJvSQDMqXEi49Q.U7rqsucojb2BMO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_wechat-and-tiktok-taking-chinese-censorship-global-study-says_1728741707.html", "title": "WeChat and TikTok taking Chinese censorship global, study says", "title_page": "WeChat and TikTok taking Chinese censorship global, study says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (BLOOMBERG) - The most popular Chinese-owned social media platforms, from WeChat to TikTok, are increasingly censoring content in the US and elsewhere, taking practices honed for years behind the Great Firewall to an international audience.\nByteDance's TikTok often buries or hides words that reflect political movements, gender and sexual orientation or religion in most countries where it operates, the Australian Strategic Policy Institute said in a report released on Tuesday (Sept 8).\nMost of the content censored on WeChat supported pro-democracy activists in Hong Kong, as well as messages from the United States and British embassies regarding a new national security law enacted by Beijing at the end of June that has provoked protests across the city.\nTikTok, which began as a place where teens lip-sync to music, has become a forum for political protest, including the Black Lives Matter movement, said Mr Fergus Ryan, one of the authors.\nHashtags related to LGBTQ (lesbian, gay, bisexual, transgender and queer) issues were also suppressed in several languages, according to the report. Other topics censored in the past included criticism of Russian President Vladimir Putin.\nThe findings may lend ammunition to the Trump administration, which banned TikTok and Tencent Holdings' WeChat after accusing the apps of bending to Beijing's will in censoring content, potentially influencing the November elections.\nWhile social media services like Facebook scrub content such as hate speech, Washington accuses services like TikTok of blocking content considered sensitive to the Communist Party.\nWeChat has long complied with controls back home, while TikTok - which operates only outside China - has pushed back against claims it is influenced by that country's government.\n\"TikTok is a more curated experience where the platform has a huge amount of power to decide what content to serve up to users,\" said Mr Ryan. \"Most of these hashtags are categorised in TikTok's code in the same way that terrorist groups, illicit substances and swear words are treated on the platform.\"\nA Tencent representative declined to comment, while a ByteDance spokesperson had no immediate comment when contacted.\nThe Australian institute cited TikTok as saying some terms \"were partially restricted due to relevant local laws\".\nIt was also cited as saying it \"strongly supports our LGBTQ creators around the world, and is proud that LGBTQ content is among the most popular category on the platform, with billions of views\".\nWashington's moves against TikTok and WeChat underscore how the concept of an Internet decoupling is becoming reality.\nThe Trump administration's ban on TikTok and WeChat takes effect in mid-September, when both apps are likely to get taken off app stores but may continue to be accessible to many American users.\nWeChat can be a powerful vector in countries like the US where the Chinese diaspora is substantial, because it is often a major source of information for that population.\nBut principles like free speech do not form part of those apps' core values. Rather, they are more likely to over-censor to align with local government wishes, according to the report.\nByteDance is now embroiled in sensitive discussions about a TikTok takeover in the US with suitors, including Microsoft and Oracle, a deal estimated to fetch upwards of US$20 billion (S$27.39 billion).", "url": "https://www.straitstimes.com/asia/east-asia/wechat-and-tiktok-taking-chinese-censorship-global-study-says"}