{"authors": [], "date_download": "2024-10-12 13:32:49", "date_modify": "2024-10-12 13:32:49", "date_publish": "2023-07-28 10:40:00", "description": "The measures include installing more CCTV cameras to check for damage of airport facilities. Read more at straitstimes.com.", "filename": "asia_se-asia_travellator-incident-leads-to-removal-of-bangkok-airport-director-measures-to-improve-safety_1728739969.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/28/yudonmueangairport2906.png", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_travellator-incident-leads-to-removal-of-bangkok-airport-director-measures-to-improve-safety_1728739969.html", "title": "Travellator incident leads to removal of Bangkok airport director, measures to improve safety", "title_page": "Travellator incident leads to removal of Bangkok airport director, measures to improve safety | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BANGKOK - The director of Bangkok’s Don Mueang airport is being transferred following a probe into a travellator incident that saw a passenger lose her left leg, an informed source said.\nMr Karun Thanakuljeerapat is being replaced by Mr Wijit Kaesaithiam, who is currently the director of Chiang Mai International Airport. The transfers will come into effect from August.\nMr Karun’s transfer comes after Airports of Thailand (AOT) conducted an investigation into the travellator incident in June.\nOn June 29, a female passenger got her leg stuck in the moving walkway at the airport’s domestic terminal. Her left leg was eventually amputated.\nThe source said the investigation found that the incident was caused by one of the travellator’s plates slipping off its frame due to missing screws. Investigators reportedly found three loose screws in the pit beneath the travellator.\nThe travellator was originally installed in 1987 and underwent a complete part upgrade in 2015 by the original manufacturer.\nIt has five safety sensors but lacks one at the floor plates because it is an old model, said the source.\nAOT director Kirati Kitmanawat reportedly said the authorities have proposed the hiring of a third-party investigator to check the condition and safety of all walkways and related equipment at Don Mueang airport to restore passengers’ confidence.\nThe investigators must be experts in escalators, elevators and travellators.\nThe airport will also install additional CCTV cameras at all walkways to monitor if there is any damage or missing parts, he added.\nFinally, the airport will hire an external audit company to audit the maintenance of all mechanical equipment in the airport.", "url": "https://www.straitstimes.com/asia/se-asia/travellator-incident-leads-to-removal-of-bangkok-airport-director-measures-to-improve-safety"}