{"authors": [], "date_download": "2024-10-12 13:38:15", "date_modify": "2024-10-12 13:38:15", "date_publish": "2024-09-13 12:40:19", "description": "Initial plans were shelved following the Fukushima nuclear disaster and due to budget constraints. Read more at straitstimes.com.", "filename": "asia_vietnam-weighs-resuming-nuclear-power-development-plans_1728740295.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/13/VIETNAM-LIFESTYLE-115322.jpg?VersionId=HQlwByriGpLgMJomKSsM3GhyeR5wCz6i", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_vietnam-weighs-resuming-nuclear-power-development-plans_1728740295.html", "title": "Vietnam weighs resuming nuclear power development plans", "title_page": "Vietnam weighs resuming nuclear power development plans | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANOI - Vietnam is considering resuming plans to develop nuclear power in order to ensure national energy security and support economic growth, according to a government document reviewed by Reuters.\nThe South-east Asian country, a regional industrial hub heavily reliant on coal for power generation, is also seeking to boost its cleaner energy production to meet its net-zero target by 2050.\n“The Ministry of Industry and Trade is to conduct research on the nuclear power development experience of other countries and make a proposal to develop nuclear power in Vietnam,” according to the document, which was dated Sept 12.\nThe ministry did not immediately respond to an e-mail seeking comment.\nThe document said Vietnam has a target of raising its power generation capacity by 12 per cent to 15 per cent a year to “ensure national energy security... and support an annual economic growth of 7 per cent”.\nThe nuclear power development proposal will be submitted to the Politburo – the country’s most powerful decision-making body – for review, according to the document, although no time frame was provided.\nIn 2009, Vietnam approved plans to develop its first two nuclear power plants, but the plans were shelved in 2016 following the Fukushima nuclear disaster in Japan and due to budget constraints.\nThe proposed nuclear plants, with a combined capacity of 4 gigawatts (GW), were planned to be built by Russia’s Rosatom and Japan Atomic Power in the central province of Ninh Thuan.\nThe country has in recent years been seeking to develop cleaner energy, but its offshore wind and liquefied natural gas development targets are at risk due to regulatory and pricing hurdles.\nOfficials said Vietnam has for years been considering resuming its nuclear power option and has discussed possible support from Russia, South Korea, Canada and others on small reactors.\nNuclear power was not mentioned in the country’s long-awaited master power development plan, which was approved in May 2023. The plan, known as PDP8, would raise the country’s total installed power generation capacity to more than 150GW by 2030, from more than 80GW at the end of 2023.\nThe Ministry of Industry and Trade is now seeking opinions to update the PDP8, state media reported in early September.\nThe government office document said relevant ministries and agencies had also been told to remove hurdles facing offshore wind and gas-fired power development, without elaborating. REUTERS", "url": "https://www.straitstimes.com/asia/vietnam-weighs-resuming-nuclear-power-development-plans"}