{"authors": ["Danson Cheong", "Aw Cheng Wei"], "date_download": "2024-10-12 14:12:45", "date_modify": "2024-10-12 14:12:45", "date_publish": "2022-10-22 12:36:47", "description": "Some 2,300 party members voted unanimously to pass the changes to the party’s top guiding document. Read more at straitstimes.com.", "filename": "asia_east-asia_cpc-congress-changes-to-party-charter-further-cement-president-xi-s-power_1728742365.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/23/2022-10-22T052147Z1961028630RC246X9ZXQ47RTRMADP3CHINA-CONGRESS_1.JPG?VersionId=CvIIU0y43fAquogwviU5rYuXgcwgewkD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_cpc-congress-changes-to-party-charter-further-cement-president-xi-s-power_1728742365.html", "title": "CPC congress: Changes to party charter further cement President Xi’s power", "title_page": "CPC congress: Changes to party charter further cement President Xi’s power | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – Chinese President Xi Jinping has further consolidated his position in the ruling party, after key changes were made to the Communist Party of China’s (CPC) charter.\nSome 2,300 party members on Saturday voted unanimously to pass changes to the party’s top guiding document at the end of a week-long party congress, held once every five years in Beijing.\nThe changes include enshrining “new developments” to Mr Xi’s political ideology, also known as Xi Jinping Thought On Socialism With Chinese Characteristics For A New Era.\nThe full text of the amendments has not yet been released, so it is not immediately clear what the changes are.\nBut according to an announcer explaining the changes, they appear to include the incorporation of the term “two establishments” (liangge queli), which refers to establishing Mr Xi’s “core status” in the party, and his ideas as the party’s guiding principles.\nA second slogan “two safeguards” (liangge weihu), which refers to safeguarding the core status of Mr Xi within the party and the party’s centralised authority, also appeared to be included.\nThe announcer said the changes were necessary in order for the party to “resolve the acute problems and challenges undermining its long-term governance, the security and stability of the country, and the well-being of the people”.\nIn another key change, the announcer said delegates had agreed to include the phrase “resolutely oppose and deter separatists seeking ‘Taiwan independence’”, into the party charter.\nAnalysts say it is a further sign that Mr Xi is determined to make reunification with Taiwan, which the mainland sees as a renegade province, part of his legacy.\nIn his speech to close the congress, Mr Xi said that the amendments “set out clear requirements for upholding and strengthening the party’s overall leadership”.\nSince its founding in 1921, the CPC has amended its charter at each party congress to reflect the changing political doctrines that guide the party.\nIn the last congress in 2017, the charter was amended to include Mr Xi’s political ideology.\nHe is the second leader, after Chairman Mao Zedong, to have his political doctrine included in the charter while still in office.\nThe latest changes show Mr Xi is firmly at the helm of the party.\nHe is expected to receive a norm-breaking third term when the party elite meet on Sunday to elect the party’s new leadership.\nExperts also say the changes indicate that Mr Xi has further bolstered his already considerable authority within the party and consolidated his clout.\nIt would make opposition against Mr Xi more difficult, say analysts, as any divergent views could be seen as an attack on the party.", "url": "https://www.straitstimes.com/asia/east-asia/cpc-congress-changes-to-party-charter-further-cement-president-xi-s-power"}