{"authors": [], "date_download": "2024-10-12 13:52:48", "date_modify": "2024-10-12 13:52:48", "date_publish": "2023-05-18 18:00:00", "description": "“All the water is sent to Mumbai. We are left nothing,” says a resident of a hamlet that straddles a dam. Read more at straitstimes.com.", "filename": "asia_south-asia_women-children-trek-kilometres-in-summer-heat-to-get-water-near-india-s-mumbai_1728741168.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/18/2023-05-18T080041Z1470655555RC2GZ0ATG7AYRTRMADP3INDIA-WEATHER-WATERCRISIS_1.JPG?VersionId=zCx4Ho7fbBGjEVcPMBZdRkTrQZZRwCWD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_women-children-trek-kilometres-in-summer-heat-to-get-water-near-india-s-mumbai_1728741168.html", "title": "Women, children trek kilometres in summer heat to get water near Mumbai", "title_page": "Women, children trek kilometres in summer heat to get water near Mumbai | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TELAMWADI, India – Women and children in a hamlet near India’s financial capital used buckets to draw water from a well before pouring it through strainers into vessels and other receptacles for the journey home.\nThe scene unfolding during a recent visit by Reuters to the area, just 150km from Mumbai, plays out every summer morning, after residents have trekked close to 2km to fetch water from a dried-up well filled each day by tankers.\nEven though their homes are not far from a dam that provides water to the metropolis, villagers say supplies run short from March to May every year, when temperatures can run as high as 40 deg C, before monsoon rains bring respite in June.\n“All the water is sent to Mumbai. We are left with nothing,” said Mr Ashok Shinde, whose village is home to about 700 people rearing poultry and livestock.\n“The government encourages us to breed animals, but what will we give them to drink if we don’t have any water to drink ourselves?“\nThe Vaitarna dam, which supplies water to Mumbai, is just 50km from Telamwadi, but is not linked to it.\nIndia ranks among the world’s most water-stressed nations, the World Bank says, with just 4 per cent of global water resources, despite being the world’s most populous, accounting for 18 per cent of global population.\nThe authorities in India’s richest state of Maharashtra, home to both the village and Mumbai, say they expect to finish work by next summer on an alternative source of supply for Telamwadi.\n“Until the permanent solution is in place, we are providing water tankers to ensure residents do not face issues,” state water supply officials told Reuters.\nWater for Telamwadi and nearby settlements will eventually come from a dam on another river, the Bori, the officials added, adding that water would flow to the area naturally as the dam was located at a higher altitude.\nUntil then, residents will have to depend on daily tanker supplies arranged by the government in summer, when the well, about 2km away, dries up completely.\n“We use a strainer to make sure no solid waste goes in,” said one of the villagers, Mr Suman Bhutambare.\nBut when the implements sometimes fall in, someone must clamber in and descend a harrowing 4m to 6m to retrieve them.\nOne of the women usually makes the precarious journey, relying on numerous cracks in the walls to provide support.\n“It’s very risky, as there’s a chance of slipping and falling,” Mr Bhutambare added. REUTERS", "url": "https://www.straitstimes.com/asia/south-asia/women-children-trek-kilometres-in-summer-heat-to-get-water-near-india-s-mumbai"}