{"authors": [], "date_download": "2024-10-12 14:08:12", "date_modify": "2024-10-12 14:08:12", "date_publish": "2023-10-16 19:26:00", "description": "Both Najib and Nazifuddin lost their appeals last September to set aside the summary judgment. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-court-rules-former-pm-najib-and-son-have-to-settle-over-489m-in-unpaid-taxes_1728742092.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/16/LB181218U1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-court-rules-former-pm-najib-and-son-have-to-settle-over-489m-in-unpaid-taxes_1728742092.html", "title": "Malaysia court rules former PM Najib and son have to settle over $489m in unpaid taxes", "title_page": "Malaysia court rules former PM Najib and son have to settle over $489m in unpaid taxes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA - Malaysia’s Federal Court has ruled that former prime minister Najib Razak and his son Mohd Nazifuddin need to settle RM1.69 billion (S$489 million) and RM37.6 million in unpaid income taxes respectively.\nThe dismissal of the appeal was made on Monday, with the apex court dismissing the appeal by Najib and Nazifuddin.\nOn May 10, Najib and Nazifuddin were given the nod by the Federal Court to proceed with their appeals against the decisions of the two High Courts in allowing the Inland Revenue Board’s (IRB) applications to enter a summary judgment to recover more than RM1.7 billion in tax arrears from them.\nBoth Najib and Nazifuddin lost their appeals in the Court of Appeal on Sept 9, 2021 to set aside the summary judgment.\nA summary judgment is obtained when the court decides on a case through written submissions without a full trial and without calling witnesses.\nIn handing down the Federal Court’s decision, Justice Nallini Pathmanathan said the IRB is levying tax on the appellants in the same manner it does for all citizens of the nation.\n“The appellants have not been singled out for discriminatory treatment nor treated in a manner not provided for in the Income Tax Act. There is no evidential basis on the record to support such a contention.\n“Accordingly there is no basis for the contention that there has been a contravention of Article 8 of the Federal Constitution,” she said.\nShe further said that the appellants can still bring their case for reassessment before the Special Commissioners of Income Tax (SCIT).\n“However, it is equally clear from a perusal of the Income Tax Act 1967 (ITA) as a whole, that it is not a final determination of the sum due and owing by the taxpayer because Section 99 (1) of the ITA remains untouched and enables the taxpayer to proceed with his grievances through the SCIT and the entire hierarchy of the courts,” she said.\nTan Sri Nallini pointed out that the court, under Section 106 of the ITA, is fulfilling the purpose of recovery or collection only.\n“It is not undertaking a full judicial adjudicatory role. Its full adjudicatory judicial power is deferred to the appeal arising from the decision of the SCIT by way of questions of law, or administrative or constitutional judicial review at a subsequent stage.\n“This is consonant with the ‘pay first dispute later’ mode of tax imposition by the government. In our full grounds of judgment, we have examined cases from South Africa, Australia, Hong Kong and Ghana. It is evident that the pay first, dispute later mechanism inherent in the ITA is utilised the world over,” she added.\nAccording to Judge Nallini, Section 106 (3) of the ITA has a rational relation to the collection of taxes efficiently and expeditiously in that it serves to ensure that for the purposes of enforcement that section precludes matters which are deferred to the dispute resolution mode specified in the statute.\nShe said the power of constitutional review contained in Article 4 (1) of the Federal Constitution is a formidable instrument and should be wielded by the judiciary with great care.\n“If it were to be used indiscriminately or where there is no substantive basis for its invocation, the results could cause considerable damage.\n“In this appeal, it could stultify the country’s tax collection system as validly provided for, and adversely affect the functioning of the government and the people. Therefore, the appeal is dismissed with no order as to costs,” she added.\nThe other judges on the panel are the Chief Judge of Malaya Mohamad Zabidin Mohd Diah and Federal Court judges Mary Lim Thiam Suan and Abu Bakar Jais. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-court-rules-former-pm-najib-and-son-have-to-settle-over-489m-in-unpaid-taxes"}