{"authors": [], "date_download": "2024-10-12 13:54:29", "date_modify": "2024-10-12 13:54:29", "date_publish": "2022-12-20 17:33:31", "description": "An animal shelter operator brought cans and bags of dog food to the site. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysian-animal-lover-delivers-vanload-of-food-for-landslide-rescue-dogs_1728741269.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/21/landslide20at20batang20kali_3.jpg?VersionId=y_cZxNhH98Bya_pQkDVatMcF8pLaTlQ2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysian-animal-lover-delivers-vanload-of-food-for-landslide-rescue-dogs_1728741269.html", "title": "Malaysian landslide death toll rises to 25; animal lover delivers food for rescue dogs", "title_page": "Malaysian landslide death toll rises to 25; animal lover delivers food for rescue dogs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BATANG KALI - The body of a child was found late on Tuesday evening or just past midnight on Wednesday, bringing to 25 the number of those confirmed killed in the landslide that occurred on Friday at the foot of Malaysia’s Genting Highlands.\nSelangor Fire and Rescue Department assistant operations director Hafisham Mohd Noor, was quoted by New Straits Times daily as saying the remains were that of a young girl. “More details will be released later,” he said.\nThe search and rescue (SAR) operations, which were on its fifth day on Tuesday, are still looking for eight missing victims of the landslide at the Father’s Organic Farm campsite in Batang Kali, Selangor.\nThe authorities said a total of 94 people were caught in the landslide that occcured around 2am last Friday, with 61 of them managing to scramble out safely.\nTwenty-nine of the 94 victims were children. However, the total number of children killed in the disaster has yet to be confirmed.\nPolice have met 53 individuals as they investigate the landslide case, FreeMalaysiaToday news site said on Tuesday.\nSelangor police chief Arjunaidi Mohamed was quoted as saying that police have taken statements from the operator of the campsite, two of his employees, along with survivors and their families.\nMeanwhile, the hard work of the K-9 unit, comprising trained search dogs, in locating the victims has not gone unnoticed by animal lovers.\nDriving a van filled with premium canine food to the area on Tuesday, animal shelter operator Mohamad Rosli brought cartons and bags of feed in recognition of the canine rescuers’ perseverance in the ongoing SAR operations.\nHis contribution consists of over a dozen cans of wet dog food, which cost around RM16 (S$4.90) each, while the bags of dry dog food cost over RM150 each, he said.", "url": "https://www.straitstimes.com/asia/se-asia/malaysian-animal-lover-delivers-vanload-of-food-for-landslide-rescue-dogs"}