{"authors": [], "date_download": "2024-10-12 14:18:35", "date_modify": "2024-10-12 14:18:35", "date_publish": "2023-08-23 11:27:00", "description": "This may allow Huawei to skirt US sanctions. Read more at straitstimes.com.", "filename": "asia_east-asia_huawei-is-building-secret-network-for-chips-us-trade-group-warns_1728742715.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/23/CHINA-TECHNOLOGY-AI-CONFERENCE-103527.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_huawei-is-building-secret-network-for-chips-us-trade-group-warns_1728742715.html", "title": "Huawei is building secret network for chips, US trade group warns", "title_page": "Huawei is building secret network for chips, US trade group warns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – Huawei Technologies is building a collection of secret semiconductor-fabrication facilities across China to let the company skirt US sanctions, a Washington-based semiconductor association has warned, Bloomberg News reported on Tuesday.\nThe Chinese tech giant moved into chip production in 2022 and is receiving an estimated US$30 billion (S$40.7 billion) in state funding from the government, the Semiconductor Industry Association said, adding that Huawei has acquired at least two existing plants and is building three others.\nThe US Commerce Department had added Huawei to its export control list in 2019 over security concerns. The company denies being a security risk.\nIf Huawei is constructing facilities under the names of other companies as the Semiconductor Industry Association says, then it might be able to circumvent US government restrictions to indirectly purchase American chipmaking equipment, according to the Bloomberg report.\nHuawei and the Semiconductor Industry Association did not immediately respond to Reuters’ requests for comment.\nHuawei has been placed on a trade blacklist in the United States, restricting most suppliers from shipping goods and technology to the company unless they are granted licences. Officials have continued to tighten controls to cut off the company’s ability to buy or design the semiconductor chips that power most of its products. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/huawei-is-building-secret-network-for-chips-us-trade-group-warns"}