{"authors": [], "date_download": "2024-10-12 14:02:03", "date_modify": "2024-10-12 14:02:03", "date_publish": "2020-09-08 12:26:13", "description": "BEIJING (BLOOMBERG) - TikTok's Chinese parent has declared a rare half-month's salary bonus for employees, hoping to calm a 60,000-plus workforce across the globe as negotiations around the sale of the video service's US operations approach the Trump administration's September deadline. Read more at straitstimes.com.", "filename": "asia_east-asia_tiktok-owner-doles-out-bonuses-to-assuage-beleaguered-staff_1728741723.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/09/08/af_bytedance_080920.jpg?VersionId=BLud9FCh5i6lYEyv.mJ8g51FFFfJIsxn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_tiktok-owner-doles-out-bonuses-to-assuage-beleaguered-staff_1728741723.html", "title": "TikTok owner doles out bonuses to assuage beleaguered staff", "title_page": "TikTok owner doles out bonuses to assuage beleaguered staff | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (BLOOMBERG) - TikTok's Chinese parent has declared a rare half-month's salary bonus for employees, hoping to calm a 60,000-plus workforce across the globe as negotiations around the sale of the video service's US operations approach the Trump administration's September deadline.\nByteDance Ltd will dole out the bonus this month to reward employees at a time of unprecedented economic and social upheaval, the company said in an internal memo seen by Bloomberg News.\nWhile the Beijing-based startup is known for paying lavishly to poach experts in critical fields such as artificial intelligence, it's unusual for the firm to declare a handout in the middle of the year.\nA ByteDance representative confirmed the memo.\n\"Over the past few months, we have been working together to overcome challenges posed by the Covid-19 pandemic and changing macro environment,\" ByteDance said in its memo.\n\"To thank everyone for their efforts and dedication, we will be issuing a cash bonus to all eligible employees,\" it said, adding that it will pay out the bonus together with September's salary to any full-timer who's worked at least 26 days between July 1 and Aug 31.\nByteDance's move contrasts with belt-tightening across scores of Asian startups from Singapore's Grab to India's Oyo. It echoes a handout from Huawei Technologies Co in 2019, another Chinese company in Washington's crosshairs.\nByteDance's workforce, particularly in the US, is concerned about the company's future now that Mr Trump has banned the viral video phenom and prohibited American residents and entities from dealing with TikTok.\nWhile the Commerce Department hasn't defined the scope of that executive order, TikTok's once-sizzling pace of growth is slowing, users are migrating to rival apps such as Triller, and Washington officials continue to label the app a security threat.", "url": "https://www.straitstimes.com/asia/east-asia/tiktok-owner-doles-out-bonuses-to-assuage-beleaguered-staff"}