{"authors": [], "date_download": "2024-10-12 13:37:52", "date_modify": "2024-10-12 13:37:52", "date_publish": "2024-08-26 10:22:57", "description": "There was a clash in disputed waters over what Manila said was a resupply mission for fishermen. Read more at straitstimes.com.", "filename": "asia_chinas-actions-in-south-china-sea-patently-illegal-philippine-defence-min-says_1728740272.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/26/LYNXMPEK7P02E-1.jpg?VersionId=ny6HSeitVeEaCODHjlX_DcvUiGjpBHFF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_chinas-actions-in-south-china-sea-patently-illegal-philippine-defence-min-says_1728740272.html", "title": "Philippines says China’s South China Sea moves ‘aggressive, unprofessional and illegal’", "title_page": "Philippines says China’s South China Sea moves ‘aggressive, unprofessional and illegal’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA – The Philippine government slammed China on Aug 26 for “repeated aggressive, unprofessional and illegal” actions in the South China Sea after a string of clashes and incidents on air and at sea over the past week.\nThe Philippines’ National Maritime Council said Chinese aircraft made unsafe manoeuvres against a civilian aircraft conducting patrols over the Scarborough shoal and Subi reef.\nOn Aug 25, Chinese vessels also “blocked, rammed and fired water cannon” at a government fisheries vessel while doing a resupply mission to Filipino fishermen in Sabina shoal, it said.\nThese actions are “alarming”, the maritime council said in a statement.\n“It calls into question China’s supposed commitment to de-escalate the situation in the area and create a conducive environment for dialogue and consultation,” the council said.\nThe Philippines said it will continue to pursue diplomacy in managing the maritime issues and urged China “to return to the path of constructive dialogue” on South China Sea matters.\nPhilippine Defence Minister Gilberto Teodoro separately said on Aug 26 that China’s actions were “patently illegal” following the clash near Sabina shoal.\n“We have to expect these kinds of behaviour from China because this is a struggle. We have to be ready to anticipate and to get used to these kinds of acts of China, which are patently illegal, as we have repeatedly said,” Mr Teodoro told reporters.\nIn the incident at Sabina shoal, Manila’s South China Sea task force accused Chinese vessels of ramming and firing water canon at a Philippine fisheries vessel transporting food, fuel and medicine for Filipino fishermen.\nThe Chinese coast guard said the Philippine vessel “ignored repeated serious warnings and deliberately approached and rammed” China’s law enforcement boat, resulting in a collision.\nOn Aug 26, another incident transpired around the same shoal.\nChina’s coast guard said it took “control measures” against two Philippine Coast Guard vessels that “illegally intruded” into waters around Sabina and then approached its vessels in a “dangerous manner and incited hype”.\nOfficials from the Philippine Coast Guard and South China Sea task force did not immediately respond to a request for comment about the latest run-in. Aug 26 is a public holiday in the Philippines.\nAsked if the latest incident would trigger treaty obligations between the US and the Philippines, Mr Teodoro said: “That is putting the cart before the horse. Let us deter an armed attack, that is the more important thing.”\nThe Philippines and the US have a mutual defence treaty, and Washington has vowed to aid the Philippines against armed attacks on its vessels and soldiers in the South China Sea.\nThe Chinese Embassy in Manila did not immediately respond to a request for comment.\nChina claims sovereignty over nearly all of the South China Sea, including areas claimed by the Philippines, Taiwan, Malaysia, Indonesia, Vietnam and Brunei.", "url": "https://www.straitstimes.com/asia/chinas-actions-in-south-china-sea-patently-illegal-philippine-defence-min-says"}