{"authors": ["Azril Annuar"], "date_download": "2024-10-12 13:50:12", "date_modify": "2024-10-12 13:50:12", "date_publish": "2024-05-17 21:52:00", "description": "It shows JI is active and could make a comeback, leading to more such attacks across the region, they warn. Read more at straitstimes.com.", "filename": "asia_se-asia_killing-of-two-cops-in-malaysia-s-johor-state-raises-concerns-about-ji-terror-group-analysts-say_1728741012.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/17/FW1387014JB0817052024POLISTEMBAK.jpg?VersionId=BkxOdeXLE1Ih4abIJp3oyL11bf3iTMdo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_killing-of-two-cops-in-malaysia-s-johor-state-raises-concerns-about-ji-terror-group-analysts-say_1728741012.html", "title": "Killing of two cops in Malaysia’s Johor state raises concerns about JI terror group, analysts say", "title_page": "Killing of two cops in Malaysia’s Johor state raises concerns about JI terror group, analysts say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – The killing of two policemen in Ulu Tiram, Johor, on May 17 by a man linked to Jemaah Islamiyah (JI) has raised concerns about the terror group that has been dormant in the region for the past decade, experts said.\nThe attack on the police station in the southern Malaysian state signals that the terror group is still alive and could make a comeback, sparking concerns about more such attacks in South-east Asia, they added.\nSecurity and intelligence analyst Jasminder Singh told The Straits Times that the Malaysian authorities need to ramp up security in Johor, which borders Singapore, as well as throughout the country.\n“Malaysia has been looking at the Islamic State threat but now they have to look at JI as well. They need to go back to the old records and account for their ex-detainees, ex-members and the presence of Malaysian students studying in JI-affiliated schools in Indonesia,” said the S. Rajaratnam School of International Studies associate research fellow, referring to terror group ISIS.\nThe academic theorised that the police killings could have been carried out by a JI splinter group, seeing that the last JI terror strike took place on Sept 16, 2014, with the bombing of the Rizal Park Monument in the Philippines, which killed one person and injured seven others.\nFurthermore, he observed that JI had been “peaceful” in the past decade, with its founder Abu Bakar Bashir voting for the first time in the recent Indonesian elections in February.\nHe said there could be a split between JI leaders who want to obtain power through the ballot box, and those who may want to maintain its radical stance.\n“With this incident, there could be a splinter faction, which is not new with JI. The Bali bombings were conducted by leaders advocating a violent jihad instead of a peaceful jihad, such as Hambali and Malaysian bomb-maker Noordin Mohammad Top,” said Mr Singh.\nThe terror organisation’s most notorious attack was the series of bombings in Bali on Oct 12, 2002, which killed 202 people and injured 209 more.\nOther attacks include the 2003 JW Marriot bombing in Jakarta, the 2004 Australian embassy bombing in Jakarta, the 2005 Bali bombings and the 2009 Jakarta bombings.\nA notable JI member was Singaporean Mas Selamat Kastari, who escaped from detention in Singapore in February 2008 and was recaptured in Skudai, Johor, in April 2009. He is currently detained in Singapore under the Internal Security Act.\nEven though the group was officially founded in Malaysia in 1993 by Indonesians Abdullah Sungkar and Abu Bakar Bashir, Mr Singh said this incident is apparently the first attack in Malaysia as JI prefers to operate in Indonesia and the Philippines.\nMr Andrin Raj, who is a director with the Nordic Counter Terrorism Network told ST that JI has always been a serious concern in the region, and its threat has never been fully neutralised.\nHe observed that JI today is a “well established” organised terrorist group, similar to its affiliate Al-Qaeda, which was responsible for the 9/11 attacks in the United States.\n“Islamist groups and jihadists have seen the region to be a ‘safe haven’ for establishing a regional caliphate. The threat of terrorism in Malaysia is not a resurgence. The rise of radicalism in Malaysia has been ongoing for decades.\n“JI’s current attack after 10 years tells you that the threat remains, and if JI confirms the attack, it will remind the region that the threat is far from over,” said Mr Raj.\nHe said that the killing of the two police officers by a person believed to be a naturalised Malaysian of Indonesian origin, is a wake-up call for Malaysia’s law enforcement.\nThe incident took place at 2.45am at the Ulu Tiram police station with the attacker slashing the neck of a constable with a parang, killing him and then taking his gun. He then opened fire on two other officers, killing one of them and injuring the other.\nThe injured officer managed to kill the suspect, who has not been identified, in the shootout.\nInspector-General of Police Razarudin Husain told the media that the police arrested 20 suspected JI members, including the killer’s five family members aged between 19 and 62.\nMr Singh also pointed out that there are still many questions that remain unanswered, such as whether the killer acted alone or was part of a larger group.\n“Was there a mastermind behind him, how extensive is their current network in Malaysia and the region? The authorities must find out,” he said.", "url": "https://www.straitstimes.com/asia/se-asia/killing-of-two-cops-in-malaysia-s-johor-state-raises-concerns-about-ji-terror-group-analysts-say"}