{"authors": [], "date_download": "2024-10-12 13:47:28", "date_modify": "2024-10-12 13:47:28", "date_publish": "2024-03-09 11:00:00", "description": "Although global production hit a 60-year low in 2023, a wine glut is persisting. Read more at straitstimes.com.", "filename": "asia_australianz_the-world-has-too-much-wine-and-australian-farmers-are-ripping-up-vines_1728740848.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/09/LYNXMPEJ8N01H-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_the-world-has-too-much-wine-and-australian-farmers-are-ripping-up-vines_1728740848.html", "title": "The world has too much wine, and Australian farmers are ripping up vines", "title_page": "The world has too much wine, and Australian farmers are ripping up vines | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "RIVERLAND – Australian grape-grower Tony Townsend destroyed half his 14ha vineyard in 2023.\nThe fields were healthy and vibrant, but he estimates he would have lost about A$35,000 (S$31,000) to harvest them. While a heatwave is holding him back from ripping out the rest, he plans to finish the job once the weather cools – losing all the vines he has tended for the past decade.\n“I enjoyed being in the wine industry, but it was just economically unviable to continue this way,” said Mr Townsend from his farm, where a pile of discarded plants is waiting to be burned.\nHe lives in Riverland, a region in South Australia that produces about a third of the nation’s harvest. Since 2020, a convergence of Covid-19-fuelled cost increases and Chinese tariffs has pushed up supply and depressed prices in the country. While Mr Townsend was never fully reliant on grape growing for his income and works part-time in wine and food tourism, not every farmer has been so lucky.\n“There are a lot of people who don’t see a future in the wine industry,” said Ms Lyndall Rowe, chief executive of Riverland Wine, an industry group representing growers and winemakers.\nIt is a problem that is playing out all around the world. Although global production hit a 60-year low in 2023, a wine glut is persisting, signifying that demand is falling even faster.\nWhile data from the International Organisation of Vine and Wine shows that global consumption has lagged behind production of wine since at least 1995, the industry has hit an inflection point as changing drinking patterns and lacklustre economic conditions look like they are here to stay.\nCalifornia is currently experiencing “one of the worst imbalances in demand and supply we’ve seen in 30 years”, said Mr Stuart Spencer, executive director of the Lodi Winegrape Commission in the Central Valley.\nMeanwhile, Australia produced its smallest amount of wine in 15 years in the 2022-to-2023 season but continues to struggle with historically high inventory levels, according to a November report by industry group Wine Australia.\nOn top of Covid-19, costs for inputs like fuel and fertiliser have gone up because of the war in Ukraine, and insurance premiums are increasing due to climate change, said Mr Richard Halstead, chief operating officer of consumer insights at alcoholic beverage research company IWSR.\n“The recent sharp increases in input costs have destabilised wine’s very delicate economic model,” he said.\nSecular changes in drinking habits are taking root as well, with red wine feeling the pain more acutely.\nMore people are drinking lower-alcohol sparkling, rose or white wines instead of reds, said Mr Christophe Chateau, spokesman for the Bordeaux Wine Council. Gen Z consumers are also consuming less alcohol, fuelling a boom in non-alcoholic drinks.\nIn Riverland, for example, Ms Rowe does not expect many red wine producers, which make up almost all of the region’s output, to be able to sell at a profit this season, while some farmers are replacing the vines with other crops like almonds and watermelons.\nIn Spain, there is an oversupply of Rioja reds, according to Mr Jose Luis Benitez, director-general at industry group Federacion Espanola del Vino, while demand for white wine is high.\nFarmers “are going to have problems down the line in one to two years because you can’t transform reds into whites”, he said.\nThe French government originally allocated €200 million (S$291.2 million) to help farmers nationwide pull up vineyards and send their wine to be converted into ethanol, promising each farmer €75 per hectolitre. Bordeaux, a major red-wine-producing region, received additional funding to pull up 9,500ha of land.\nBut supply destruction is not having a major effect. France overtook Italy to become the largest producer of wine in the world in 2023. Sign-ups for the ethanol scheme were so large that each farmer could only offload half the volume they wanted to, according to Mr Chateau.\nBordeaux growers took part in the wider French farmer protests in January, blockading roads across the country over the removal of fuel subsidies and European Union green policies. Grape farmers won a further €150 million for uprooting vines and planting alternative crops.\nBut adjustments are particularly hard for an industry like wine to make. Many winemakers go back generations and are steeped in tradition, while the nature of grape growing means long lead times and the grapes themselves cannot be easily sold and repurposed.\n“What you plant today will be funding your children’s salaries – or even your grandchildren’s,” said IWSR’s Mr Halstead. “So when markets change, it can be incredibly difficult to respond quickly.”\nA well-maintained vine can last for more than 50 years, meaning that investment cycles tend to be measured in generations, he added.\nBrands also have not done enough to meet new changes, said Mr Spiros Malandrakis, industry manager of alcoholic drinks at Euromonitor International.\nFor example, by focusing on developing premium brands at a time when people’s budgets are being squeezed means the industry is failing to cultivate a new generation of wine drinkers.\n“If there are not cheap, economic, reliable wine brands to go to, you will just leave wine and just go into ready-to-drink cocktails or beer or cheap spirit brands,” said Mr Malandrakis, adding that Gen Z’s use of cannabis has also lessened wine’s appeal.\nThat leaves no option for many farmers but to leave the industry altogether. A survey carried out by Riverland Wine in 2022 found that about a quarter of the region’s growers are planning on quitting in the next three years.\nFor Mr Townsend, once he finishes removing his vines, he plans to repopulate the barren land with native plants.\n“The money that would’ve been lost from our vines towards the end will now return joy to us tenfold when we get to see the native animals and birds come back to our land,” he said. BLOOMBERG", "url": "https://www.straitstimes.com/asia/australianz/the-world-has-too-much-wine-and-australian-farmers-are-ripping-up-vines"}