{"authors": [], "date_download": "2024-10-12 13:33:36", "date_modify": "2024-10-12 13:33:36", "date_publish": "2024-04-15 09:47:00", "description": "The incident saw Ms Farah Md Isa’s personal bodyguard stepping in to save her life and taking a hit. Read more at straitstimes.com.", "filename": "asia_se-asia_kl-airport-shooting-targeted-wife-says-she-is-still-traumatised_1728740016.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/15/tc-fdklia14.jpg?VersionId=OXhFvIEwmqTYdQ5t7fDpEFDXjgOSffYW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_kl-airport-shooting-targeted-wife-says-she-is-still-traumatised_1728740016.html", "title": "KL airport shooting: Targeted wife says she is still traumatised", "title_page": "KL airport shooting: Targeted wife says she is still traumatised | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEPANG – The estranged wife of the man wanted for the shooting incident at Kuala Lumpur International Airport (KLIA) says she is still traumatised by the incident.\n“I am traumatised after the shooting at KLIA 1.\n“I apologise (for) the unanswered messages. Am still traumatised (due) to what happened in front of my own eyes.\n“My personal bodyguard has yet to regain consciousness. Let us all pray for Along’s recovery and health,” said Ms Farah Md Isa, better known as Farah Cie, on her Facebook page on April 15.\nThe incident during the wee hours of April 14 at the airport’s arrival hall saw Ms Farah’s personal bodyguard stepping in to save her life and taking a hit.\nThe woman, a travel agency owner, was waiting for the return of her clients from an umrah, the minor pilgrimage for Muslims, at about 1.20am when suddenly, there was a huge bang as a firecracker was thrown in her direction, injuring two passers-by.\nTwo shots were then fired at Ms Farah at close range, with one bullet missing its mark and the other wounding the bodyguard in his abdomen. The shooter then fled to his car at Block C of the airport’s carpark.\nBukit Aman Criminal Investigation Department director Datuk Seri Shuhaily later said police were looking for 38-year-old Hafizul Harawi, who has had several run-ins with the law.\nPolice said the suspect is a partner in the travel agency. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/kl-airport-shooting-targeted-wife-says-she-is-still-traumatised"}