{"authors": ["Walter Sim"], "date_download": "2024-10-12 13:37:17", "date_modify": "2024-10-12 13:37:17", "date_publish": "2024-07-12 11:59:00", "description": "The Self-Defence Forces faces accusations of financial improprieties, mishandling state secrets and workplace harassment. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-sacks-navy-chief-amid-scandals-as-annual-defence-review-sees-china-as-gravest-threat-again_1728740237.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/imgonline-com-ua-FrameBlurred-k0QlNKqtNV.jpg?VersionId=FUnwzxterpiUE5DKxbaAgxB509G6QTbG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-sacks-navy-chief-amid-scandals-as-annual-defence-review-sees-china-as-gravest-threat-again_1728740237.html", "title": "Japan sacks navy chief amid scandals even as defence report sees China as gravest threat again", "title_page": "Japan sacks navy chief amid scandals even as defence report sees China as gravest threat again | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan again identified China, North Korea and Russia as its top threats in an annual defence report on July 12, though its release was overshadowed by the dismissal of the top navy official amid a spate of scandals.\nThe 548-page defence White Paper, according to which Japan has found itself in “the most severe and complex security environment of the post-war era”, comes as the Self-Defence Forces (SDF) mark the 70th anniversary of their formation on July 1, 1954.\nBut the milestone was overshadowed by a spate of military scandals involving financial improprieties and corruption as well as accusations of mishandling state secrets and workplace harassment.\nThe Defence Ministry said on July 12 that it had punished 218 SDF members and senior bureaucrats, with 11 dismissals, two demotions and 83 suspensions. The rest either received pay cuts, formal reprimands or warnings.\nThe top navy officer, Admiral Ryo Sakai, was sacked as the scandals had mainly centred on the Maritime Self-Defence Force (MSDF).\nDefence Minister Minoru Kihara said on July 12 that he would voluntarily give up one month’s salary, adding: “The incidents are a betrayal of the public’s trust and should never have happened. I am deeply sorry.”\nPrime Minister Fumio Kishida, in Washington for the Nato summit, also apologised and said he would not replace Mr Kihara.\nThe scandals threaten to tarnish the SDF’s image even as it struggles to meet recruitment quotas. The Defence Ministry said on July 8 that the SDF hired just 9,959 people in 2023 – or a record low 51 per cent of the targeted 19,598 personnel.\nYet there is no magic bullet to a recruitment problem that will only become more acute amid Japan’s warnings of regional conflict. Japan has no military conscription and only a small reserve force.\n“Joining the military is not an attractive career path when war seems very possible,” Dr Tosh Minohara, who chairs the Research Institute for Indo-Pacific Affairs think-tank, told The Straits Times.\nThe defence White Paper noted that the world was “facing its greatest trial” since 1945 as it raised the alarm over Chinese actions around Taiwan.\nIt described China, with its “no limits” cooperation with Russia and opaque military growth, as “unprecedented and the greatest strategic challenge to which Japan should respond with its comprehensive national power and in cooperation with its ally the United States and like-minded countries”.\nIt also repeated language from previous years about North Korea’s nuclear and ballistic missile development, and Russia’s invasion of Ukraine.\nWhile Japan has accused China of “undermining (its) maritime interests” with the installation of a buoy off its southernmost island, Tokyo is now facing questions over its own actions.\nA Japanese MSDF destroyer temporarily sailed into Chinese territorial waters off the eastern province of Zhejiang on July 4, Kyodo News cited diplomatic sources as saying on July 10.\nA probe is ongoing, with a Japanese official saying that the incident could have been due to a “procedural error”.\nRegional tensions have prompted Japan to seek “multilateral and multilayered defence cooperation”, the White Paper said.\nBut experts, like Professor Heng Yee Kuang of the University of Tokyo’s Graduate School of Public Policy, argue that the Ukraine war shows “mass and quantity still matters” in terms of both arsenal and boots on the ground.\nYet, the SDF is under intense pressure given a chronic labour shortage with the private sector promising more lucrative wages. This is despite headline-grabbing measures to relax hairstyle rules, raise the enlistment age and expand the involvement of retired officers.\nIts image problem is worsened by a toxic workplace environment. Power harassment by uniformed officers and civilian bureaucrats in the SDF has inflicted psychological suffering on subordinates, while sexual assaults are said to be routine.\nAnd then there are fatal training incidents, including a helicopter crash in April 2024 and an army range shooting in June 2023.\nBoth Dr Minohara and Prof Heng said Japan could realistically consider filling its military ranks with foreigners, like in the United States and Britain, offering perks such as a path to citizenship.\nDr Satoru Nagao, a non-resident fellow at the Hudson Institute think-tank, urged for dramatic increments to military wages that are currently pegged to the public service, which is also facing recruitment challenges.\nWhile Japan has pledged to spend 43 trillion yen (S$363.3 billion) in a five-year plan announced in December 2022 to dramatically beef up its military capabilities, Dr Nagao argued for a larger share to be allocated to wages.\nYet the five-year plan was drawn up on the basis of an exchange rate of 108 yen to one US dollar. Japan’s spending power has now considerably weakened as the currency hovers around 160 yen to the dollar.\nThe White Paper acknowledged the impact on procurement, saying: “Amid the current inflation and weak yen, we will make all efforts to rationalise and improve efficiencies of procurement while scrutinising expenses, through such measures as acquiring equipment through bulk purchases and long-term contracts.”\nDr Nagao noted that Japan’s order of US-made Tomahawk missiles was reduced from 500 units, as initially reported, to 400 units.\nThe Defence Ministry must also recover from scandals exposed in quick succession since June.\nIn one case, dozens of MSDF divers were found to have allegedly made fraudulent claims of 43 million yen in allowances for diving missions that were not actually carried out. MSDF personnel were also found to have failed to pay for their meals on base cafeterias.\nIn another scandal, the MSDF’s fictitious transactions with submarine contractor Kawasaki Heavy Industries have come under the radar, with the profits going into a slush fund that was allegedly used to wine and dine MSDF officers.\nAnd finally, breaches were said to have occurred on board more than 10 military vessels, as officers allowed unvetted personnel to access state secrets, although there have not been any information leaks.\nOn what might have led to the scandals, Sasakawa Peace Foundation senior fellow Ippeita Nishida said: “One may argue that there are so many guidelines and administrative procedures that SDF officers must follow. But with fewer staff, that led to the mishandling of classified information.\n“And the funding scandal could be related to insufficient public recognition and financial rewards for submariners who do one of the most difficult jobs.”", "url": "https://www.straitstimes.com/asia/east-asia/japan-sacks-navy-chief-amid-scandals-as-annual-defence-review-sees-china-as-gravest-threat-again"}