{"authors": [], "date_download": "2024-10-12 13:34:42", "date_modify": "2024-10-12 13:34:42", "date_publish": "2024-09-24 16:31:00", "description": "The killer hid the woman’s body on his balcony by stacking bricks and pouring cement on it. Read more at straitstimes.com.", "filename": "asia_east-asia_murdered-south-korean-woman-found-after-16-years-encased-in-cement_1728740082.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/pexels-life-of-pix-2469.jpg?VersionId=lLBhqL9QiHTlj5iF0CoJY8Cm1g8MqOgT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_murdered-south-korean-woman-found-after-16-years-encased-in-cement_1728740082.html", "title": "Murdered South Korean woman found after 16 years encased in cement", "title_page": "Murdered South Korean woman found after 16 years encased in cement | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – A South Korean man has been arrested after confessing to murdering his girlfriend 16 years ago and entombing her body on his balcony under a layer of cement, police announced on Sept 24.\nThe man, who is now in his 50s, was charged with murdering the woman in October 2008 during an argument, according to the Gyeongnam Provincial Police and Geoje Police Station.\nHe fatally struck the woman with a blunt object and placed her body in a large travel bag, police said.\nHe then hid the body in his balcony by stacking bricks and pouring a 10cm layer of cement on it.\nThe woman was not reported missing until three years later, as she was not in contact with her own family.\nDuring a 2011 missing person inquiry, the man told police they had “broken up” and the case remained unsolved due to a lack of evidence.\nAn investigator told reporters the body was not discovered earlier as it had been fitted into the small balcony space, and that the room had been “virtually empty since 2016”.\nThat year, the perpetrator was arrested for drug use, and the landlord said the property was used for storage space.\nThe body was found in August, after a worker who was searching for water leaks found the travel bag.\nUpon inspection, police found the woman’s body “preserved to some extent”.\n“The body hadn’t completely decomposed to bones, allowing us to identify her using fingerprints,” police said.\nThe man was brought in for questioning and eventually confessed to the murder.\nA police official from Gyeongnam Provincial Police said the investigation and questioning is nearly over, and the man will be “sent to prosecution soon”. AFP", "url": "https://www.straitstimes.com/asia/east-asia/murdered-south-korean-woman-found-after-16-years-encased-in-cement"}