{"authors": ["Keval Singh"], "date_download": "2024-10-12 13:33:00", "date_modify": "2024-10-12 13:33:00", "date_publish": "2023-05-18 15:10:00", "description": "The mall said it had received clearance from the authorities to resume operations. Read more at straitstimes.com.", "filename": "asia_se-asia_kuala-lumpur-s-mid-valley-megamall-resumes-operations-a-day-after-fire_1728739980.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/19/adfire20FW1304178KL0517052023MIDVALLEYTERBAKAR.JPG?VersionId=gOI9iQ8K.xgSFHT1Ls5PWX6L1N0qaRF_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_kuala-lumpur-s-mid-valley-megamall-resumes-operations-a-day-after-fire_1728739980.html", "title": "Kuala Lumpur’s Mid Valley Megamall resumes operations a day after fire", "title_page": "Kuala Lumpur’s Mid Valley Megamall resumes operations a day after fire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Mid Valley Megamall in Kuala Lumpur, which closed on Wednesday following a fire at its premises, reopened on Thursday.\nThe mall confirmed its reopening in a Facebook post on Thursday. It said it had received clearance from the relevant authorities to do so.\nA 38-year-old employee at the mall, who spoke to The Straits Times on condition of anonymity, said the shopping centre resumed operations and customers had returned as per normal.\nHe added that just a day before the blaze, a fire drill had been conducted at the mall.\n“This was not the first time there was a fire at the mall, and ironically, there was a fire drill on Tuesday.”\nResponding to queries from The Straits Times, a spokesman for the mall said the fire drill was “a pre-planned and routine exercise” at one of the office towers within the Mid Valley City vicinity.\n“The drill was a proactive measure to ensure the safety and preparedness of the office staff and visitors in an emergency,” the spokesman said.\nWhen asked about preventive measures the mall might take to avoid future fires, the Mid Valley spokesman said the mall is “actively reviewing and assessing all aspects” of its safety protocols.\nThe mall is committed to “implementing any necessary improvements together with the Fire and Rescue Department and Tenaga Nasional Berhad (TNB) to ensure the well-being of their visitors and employees,” the spokesman added.\nA fire broke out at the main power substation at the mall on Wednesday.\nIt disrupted the mall’s power supply and caused traffic jams in the vicinity of the shopping complex.\nThe fire was brought under control by 12.07pm and completely extinguished by 12.44pm, over two hours after it broke out, according to Kuala Lumpur’s fire and rescue department.\nThe fire was believed to have been caused by overheating of oil that was meant to cool an electrical transformer at the substation, a fire department official told reporters on Wednesday.\nKuala Lumpur Fire and Rescue Department operations assistant director Fatta Amin said the oil can withstand temperatures of 137 deg C, news agency Bernama reported.\n“However, it is believed that the substation was excessively hot and suddenly started burning,” he told reporters at the mall, adding that only one of four substations belonging to the building was on fire.\nAll the substations were capable of supplying power within a 10km radius of Mid Valley, Mr Fatta said.", "url": "https://www.straitstimes.com/asia/se-asia/kuala-lumpur-s-mid-valley-megamall-resumes-operations-a-day-after-fire"}