{"authors": [], "date_download": "2024-10-12 13:58:34", "date_modify": "2024-10-12 13:58:34", "date_publish": "2024-07-09 10:30:00", "description": "The Australian Signals Directorate singled out the APT40 hacking group in a technical advisory note. Read more at straitstimes.com.", "filename": "asia_australianz_australia-sounds-warning-over-state-backed-chinese-hackers_1728741514.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/09/20201016105134501207574cd-673d-46aa-a85a-6a363b81bbe1.jpg?VersionId=4lThuiPxz7Y0nZ1WKP90AVnIvuIFp59x", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australia-sounds-warning-over-state-backed-chinese-hackers_1728741514.html", "title": "Australia sounds warning over state-backed Chinese hackers ‘repeatedly’ targeting its networks", "title_page": "Australia sounds warning over state-backed Chinese hackers ‘repeatedly’ targeting its networks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY – Australia’s cyber intelligence agency sounded a rare warning on July 9 about the rising threat of state-backed Chinese hackers, saying they were “actively” looking for targets to compromise.\nThe Australian Signals Directorate singled out the APT40 hacking group in an advisory note: “APT40 has repeatedly targeted Australian networks as well as government and private sector networks in the region; the threat they pose to our networks is ongoing.”\nThe Australian Signals Directorate said APT40 – meaning “advanced persistent threat” – conducted “malicious cyber operations” for an arm of China’s Ministry of State Security based in Hainan province.\nThe directorate said APT40 looked to infiltrate old and forgotten devices that were still connected to sensitive computer networks.\nUsing these computers to gain an undetected “foothold”, they were able to “rapidly” exploit vulnerabilities and plunder information.\n“APT40 is actively conducting regular reconnaissance against networks of interest in Australia, looking for opportunities to compromise its targets,” it said.\nAttribution of sophisticated cyber attacks is technically difficult and politically fraught, and comes at the risk of angering China.\nBeijing’s Foreign Ministry hit back on July 9 when asked about the report at a regular press conference. “Relevant parties have once again used China’s so-called “cyber attacks” as a pretext to smear and slander China,” spokesman Lin Jian said. “China is firmly opposed to this.”\nHe went on to say Chinese agencies had released their own reports highlighting APT organisations in the United States.\nThe Australian advisory note was co-authored with input from the United States, Britain, Germany, Japan, South Korea and other international partners.\nCyber security experts said inadequate safeguards and the stockpiling of sensitive customer information have made Australia a target for hackers.\n“In our current strategic circumstances, these attributions are increasingly important tools in deterring malicious cyber activity,” said Australian Defence Minister Richard Marles.\nMajor ports handling 40 per cent of Australia’s freight trade ground to a halt earlier in 2024 after hackers infiltrated computers belonging to operator DP World.\nRussia-based hackers in 2022 breached one of Australia’s largest private health insurers, accessing the data of more than nine million current and former customers.\nIn September 2022, telecom company Optus fell prey to a data breach of similar magnitude in which the personal details of up to 9.8 million people were accessed.\nNew Zealand’s government earlier in 2024 blamed APT40 for a 2021 cyber attack that infiltrated its parliamentary computer network. AFP", "url": "https://www.straitstimes.com/asia/australianz/australia-sounds-warning-over-state-backed-chinese-hackers"}