{"authors": [], "date_download": "2024-10-12 13:50:19", "date_modify": "2024-10-12 13:50:19", "date_publish": "2022-04-01 13:10:57", "description": "Residents are complaining about running out of food and not having timely access to medical care. Read more at straitstimes.com.", "filename": "asia_east-asia_china-censors-shanghai-protest-videos-as-covid-19-lockdown-anger-grows_1728741019.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/01/fhshanghaiprotest010422.jpg?VersionId=NSG2NI3phd6FZfYWYJWrf8W5CSsm40fN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-censors-shanghai-protest-videos-as-covid-19-lockdown-anger-grows_1728741019.html", "title": "China censors Shanghai protest videos as Covid-19 lockdown anger grows", "title_page": "China censors Shanghai protest videos as Covid-19 lockdown anger grows | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (BLOOMBERG) - China is struggling to manage growing public unhappiness over tough Covid-Zero measures in Shanghai, one of its wealthiest and most globalised cities, as some residents revolt against lockdown orders which have stretched in some instances to a month.\nTech giant Tencent Holdings took down two videos earlier this week of a rare protest at a Shanghai housing compound after they started trending on the company's WeChat microblogging and video publishing platforms, according to a person familiar with the matter.\nThe videos had been posted by users to their WeChat timelines, the person said.\nIn the footage viewed and independently verified by Bloomberg News, dozens of residents behind the gates of the Jiangnan Xinyuan housing estate in Shanghai's Minhang district chant phrases including \"we want to eat\", \"we want the right to know\", and \"we want freedom\".\nPeople there have been confined to their homes since March 2 and residents have undergone more than 10 rounds of mass virus testing, according to official notices from the compound's WeChat account.\nTencent told its employees the videos were taken down because they violated China's laws and policies, said the person, asking not to be identified due to fear of reprisal.\nA third video of the compound's residents demonstrating, where the chanting is less clear, and does not include terms such as \"freedom\", has been allowed to remain online, the person said.\nThe ramped-up censorship reflects China's growing dilemma over its zero-tolerance approach to the virus, which is extracting greater economic and social costs while leaving it isolated in a world that has chosen to live with Covid-19.\nShanghai's outbreak has ballooned to more than 32,000 cases in the past month, the biggest spread of infection in China since the novel coronavirus was first detected in Wuhan, the capital of central China's Hubei province.\nWhile officials have shown greater flexibility with the Covid-Zero policy in recent months - creating closed loop systems for businesses and factories to keep operating amid lockdowns and in the case of Shanghai, alternating lockdowns between its eastern and western halves - the pushback in China's financial hub underscores the domestic costs of practising the policy indefinitely.\nA Tencent company representative declined to comment while the Shanghai city government's news office did not immediately respond to a request for comment.\nFrustration and anger are palpable from posts on major social media platforms about Shanghai's Covid-19 control policies, with tens of thousands of users complaining about running out of food or criticising the government for failing to provide timely medical care to those in need.\nOne user posted on Weibo photos of what appeared to be a rally at another housing compound on Wednesday (March 30), saying that residents were protesting against a lack of food supplies.\nA topic on Weibo about an elderly person who died of asthma after ambulances refused to take him to a hospital in Shanghai attracted more than 55 million views and 23,000 posts on Thursday alone, with posts lamenting the state of medical care more than two years into the pandemic.\nWhile not citywide like elsewhere in China, the lockdowns in Shanghai have led to desperation among those with chronic conditions such as kidney failure in incidents which evoke the traumatic scenes of early 2020 when the virus first emerged.", "url": "https://www.straitstimes.com/asia/east-asia/china-censors-shanghai-protest-videos-as-covid-19-lockdown-anger-grows"}