{"authors": ["Sumiko Tan"], "date_download": "2024-10-12 14:06:12", "date_modify": "2024-10-12 14:06:12", "date_publish": "2018-03-25 05:00:00", "description": "ICYMI: \"I cannot afford to lose,\" Mahathir Mohamad told ST Executive Editor Sumiko Tan earlier this year. Read more at straitstimes.com.", "filename": "asia_se-asia_mahathirs-unfinished-business_1728741972.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/03/25/st_20180325_stlunchmahathir_3858477_0.jpg?VersionId=MsbJWOhoD07JuiNRKhe4Y.GEun5vWSkf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_mahathirs-unfinished-business_1728741972.html", "title": "Lunch With Sumiko: Mahathir Mohamad's unfinished business as Malaysia gears up for election", "title_page": "Lunch With Sumiko: Mahathir Mohamad's unfinished business as Malaysia gears up for election | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A waiter had told me earlier that \"Tun\", which is how most people address him, has bread, tomato slices and sugarless lemonade whenever he visits. I'm expecting him to order this spartan combination but he opts for spaghetti instead.\n\"I don't eat much,\" he says when I tell him I've heard he eats simply. \"Usually, every item on the menu I divide by two, share with somebody else.\"\nBreakfast for him is a slice of bread. Lunch is whatever the cook at home prepares. He has two spoonfuls of rice at night.\n\"I haven't had to change my measurements for 31 years. Same trousers I can still wear.\"\nIt's not just his measurements that have remained constant. His youthful looks have been a source of marvel and speculation for years.\nUp close, I am struck by how clear his eyes are, how much hair he still has and how full his face is. When he walks, his posture is straight and his gait is steady.\nHe is genial, polite and very soft-spoken, but you sense nothing escapes his eagle eyes. His answers are sharp and to the point.\nHe is often asked the secret to staying young. His answer is something food-loving Singaporeans will find hard to stomach - stop eating once something tastes delicious.\n\"Once you are fat, to become thin again is very difficult. This is the advice from my mother,\" he says. \"She told me that when the food is nice, stop.\n\"When I studied medicine, I realised how good that advice was. When you overeat, the stomach expands, and if you do that too often, it becomes very big.\n\"And if you don't eat enough, you feel hungry. So you eat a lot. And then it keeps on growing.\"\nHe has managed to train himself to eat very little. \"I'm very disciplined in many ways. At first it was very difficult, but after some time it was easy. You learn to curb your feelings.\"\nIn fact, he is turned off by the sight of a paunch. \"That is one thing that I don't like to see. Every time I meet a fat man, I poke a finger and tell him, 'Cut down on your food.'\"\nI ask about rumours that he has had stem cell or placenta treatments. He laughs. He has heard those stories.\n\"No. No injections of any kind. No stem cells. Nothing. Nothing.\"\nAT 92 turning 93 in July, Dr Mahathir is fighting what must surely be the final electoral battle of his life. It is also his strangest.\nIn 1981 when he was 56, the Kedah-born, Singapore-trained medical doctor became Malaysia's fourth prime minister. He first became an Umno Member of Parliament in 1964.\nHe was PM for 22 years and is credited with transforming Malaysia into a modern, thriving economy, pushing more Malays to be professionals and championing Asian values.\nBut he has detractors who say he weakened the judiciary, used the Internal Security Act too freely, promoted cronyism and did not do enough to stop corruption in government.\nHis tenure was also marked by the sensational case of Anwar Ibrahim, his deputy prime minister who was jailed for sodomy.\nWhen he retired in 2003, Dr Mahathir didn't quite go gently into the night. He fell out with his chosen successor Abdullah Badawi and backed Datuk Seri Najib Razak, who became PM in 2009.\nIn 2015, he became a fierce critic of Mr Najib after the 1Malaysia Development Berhad (1MDB) saga broke. He quit Umno and formed the Malaysian United Indigenous Party (PPBM) to fight Mr Najib.\nPPBM is a member of the opposition alliance called Pakatan Harapan (PH). It includes the Parti Keadilan Rakyat (PKR) party of Anwar, who is back in jail on sodomy charges, and the Democratic Action Party (DAP), whom Dr Mahathir once railed against as Chinese chauvinists.\nPH named him chairman of the alliance. In January, it said he would be its prime ministerial candidate should the opposition win the upcoming election.\nDr Mahathir has said he will pass the premiership to Anwar, who will be released from jail in June, after two years at most.\nThe turn of events has been nothing short of bizarre.\nDoes it feel weird to be in the opposition, I ask.\n\"Yes, it's very weird,\" he says. \"The very people who used to call me names - and I used to call them names - now they are working with me.\" And, he says, they chose him to be their leader. \"It is a strange kind of acceptance, you see, but I got to get on well with them.\"\nHe shares that Anwar and his family took a long time before they agreed to work with him.\n\"It was very difficult for him first to accept me as the chairman of the opposition, and then when my name was also put up for prime minister. It took a long time for him to decide, but eventually he realised, and people told him, there's no way you can put anybody else and win over Malay support.\"\nPragmatism, I suppose, rules in politics, even if it means gritting your teeth and sleeping with former enemies.\nHe puts a smooth - some might say unbelievable - gloss on things.\n\"Whatever difference we have is the past. We have to learn to forget it, although off and on it crops up. But generally he has accepted.\"\nOn his part, he says of Anwar: \"I don't care about the past, about what he did and all that.\n\"To me, it is nothing compared with what Najib is doing. Both of us agree that what Najib is doing is so terrible that we need to forget our past.\"\nHe also highlights, as he has done before, that Anwar is in jail this time \"not because of me, he was put there by Najib\".\nHe describes the opposition as being \"very\" united and says he has been surprised by how they have accepted him, especially its leaders.\n\"It was unthinkable at one time but I think they are quite sincere because we have the same goal - get rid of Najib.\"\nThat said, his biggest challenge has been explaining to his Umno base why he has joined forces with the opposition parties.\n\"They couldn't understand. For example, I used to condemn DAP and now I am together with DAP...\n\"I explain, but die-hard Umno followers just cannot accept DAP.\"\nSome friends now avoid him for fear of repercussions in their businesses.\nWhile he understands where they are coming from, he is disappointed they are \"so easily frightened\".\nThe opposition has other challenges, like funding, and whether PH will be allowed to be formally registered in time for the election. Otherwise, the opposition will have to contest under individual party flags which he thinks could lead to confusion.\nHe brings up Mr Najib's name no fewer than 20 times during the course of our 90-minute meal. He seems genuinely convinced that the way the government has run up debt to cover its spending will ruin Malaysia and make it \"become like Greece\". He also complains that the PM has intimidated those who support the opposition.\nOn his part, Mr Najib has come out strongly to defend Malaysia's debt. He has highlighted positive reports by credit rating agencies, and how other developed countries have higher debt-to-gross domestic product levels compared with Malaysia's 51 per cent.\nHe has also accused PH of irresponsible promises in its recently released election manifesto.\nAbolishing highway tolls and the goods and services tax (GST) will see the country incur a debt of RM383 billion (S$128.6 billion).\nDr Mahathir appears to share some common ground with Mr Najib on this, saying he has told his \"very socialistic\" coalition partners that they can't just \"give things to people\".\nBut he maintains the GST is not necessary. \"We never depended on the GST before and yet the country developed very well, and we didn't even borrow money.\"\nWhen I ask how he would describe his feelings towards Mr Najib, his reply is \"I am terribly disappointed\".\nHe adds that he owes his own rise in Umno and becoming prime minister to Mr Najib's late father, Malaysia's second prime minister, Tun Abdul Razak Hussein.\n\"I was very grateful to the father, and the father left a legacy which we are proud of because he concentrated on developing the rural areas... So I thought the son would be like that, but I was grossly disappointed.\"\nUp to the last general election in 2013, he supported Mr Najib.\n\"I campaigned for him. I even went on the stage to say that your choice is between Anwar and Najib. Do you like Anwar? So I campaigned hard for him and regained the state of Kedah for him. But when I hear about the 1MDB, that is something I cannot accept.\"\nHIS schedule in the run-up to the election has been punishing.\nHe travels up and down the country for events, continues to blog and is active on Facebook. He writes out his posts and they are uploaded for him. Before our lunch, he had filmed a Facebook Live session where he gave a policy talk on education.\nMost of his night events start late.\n\"Malay audience, they come out after 9pm.\n\"They always make me the last speaker, which means sometimes I'll be speaking at about 12.\"\nLast month, he was hospitalised for a chest infection. This has been practically cured, but he has a chronic cough which stems from a bout of pneumonia in 1999.\nHe believes he has the most support from Malaysians who had lived through the 1980s and 1990s when he was PM and who saw how the country progressed. \"They knew what happened. They can make comparisons.\"\nAs to where he will contest, he claims he has not made up his mind, although pundits say it will likely be in Langkawi.\nWherever he says he will contest, \"Najib comes along with a lot of gifts\", he laughs. \"People are grateful to me. They say because you come here, then we are getting all this.\"\nMore seriously, his decision will be based on winning.\n\"I cannot afford to lose. I will have to choose the best constituency where I could win.\"\nHe sees Johor as the main battleground because it is an important Umno stronghold. The opposition will have difficulty breaking into that state, he admits.\nHe rates the opposition's chances as \"50-50\". Most observers say it is much less than that, given PH's antagonistic factions and the high possibility of three-cornered fights.\nAn online poll in December found that Mr Najib's integrity and the 1MDB scandal - issues Dr Mahathir has been banging on about - were the least of the respondents' concerns, at 3 per cent and 2 per cent respectively.\nYou sense he is realistic about the opposition's chances. \"If we fail, well, we have to accept it,\" he says. \"But I'll be very sad indeed.\"\nIf the people cannot replace Mr Najib, \"they must learn that they should care for the country more than just personal gains\".\nI wonder if the desire for power again is the motivation behind what he is doing. Is power important to you, I ask.\n\"Power is important because with it, you can do a lot of things,\" he says. \"When I was prime minister, I knew I had power. There were things that nobody could do and they came to me. I said, 'Well, this is a good thing, you can do it.'\n\"So that is what power is meant for. Not to enrich yourself. Not to bully people and that kind of thing. I don't think that was right.\"\nHis critics, I think, would have a view on this.\nDoes he have any regrets of that period when he had that power? He says that working with the opposition has opened his eyes to their \"grouses\" about him.\n\"There were occasions when I was perhaps a bit harsh on people, and I could have asserted more authority over the police, for example. But I just couldn't insist on things.\"\nHe repeats the well-used example of how he had told the police chief not to use handcuffs when arresting Anwar. \"But they had their SOP, and that meant wearing balaclava and breaking doors and holding guns. It gave me a very bad image... The public thinks I asked them to do those things. But it was not my decision.''\nWITH so much going on in this late stage of his life, I am curious what makes him happy. His answer surprises me. \"It is when I am among friends who have the same views as myself. I feel happy then.\"\nHis family, of course, also gives him happiness, he says.\nHe has seven children and 18 grandchildren.\nMight his anger with Mr Najib be something that is eating away at him? It can't be healthy, I think to myself. \"No, it's not that kind of anger,\" he corrects. \"I'm angry because of the things he does, which I feel is destroying this country.\"\nHis wife, Dr Siti Hasmah Mohd Ali, 91, is often by his side. He says they quarrelled quite a lot in their early days. But being a person who \"doesn't succumb to emotion much\", he evaluated the situation and concluded that tolerance was key to a happy marriage. \"In the end, I had to put up with the things that she does, as much as she has to accept my way of doing things.\"\nI wonder who his closest friends are. He says there is \"a person who is quite unknown, not a politician, but he gives me a lot of information about what's happening on the ground\". He is comfortable with him and treats him like a confidant.\nIs he an old friend? \"Well, he's not so old,\" he says, amused at the question. \"I don't find people my age anymore for friends, you see.\"\nSingapore does not appear to figure much in his mind and he doesn't mention it until I raise it.", "url": "https://www.straitstimes.com/asia/se-asia/mahathirs-unfinished-business"}