{"authors": ["Debarshi Dasgupta"], "date_download": "2024-10-12 13:51:41", "date_modify": "2024-10-12 13:51:41", "date_publish": "2023-07-17 12:00:00", "description": "Perpetrators of such unfair trade practices could be prosecuted under the country's consumer protection law. Read more at straitstimes.com.", "filename": "asia_south-asia_india-sets-up-task-force-to-crack-down-on-dark-patterns-online-that-manipulate-consumers_1728741101.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/17/dw-online-india-230716.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_india-sets-up-task-force-to-crack-down-on-dark-patterns-online-that-manipulate-consumers_1728741101.html", "title": "India sets up task force to crack down on dark patterns online that manipulate consumers", "title_page": "India sets up task force to crack down on dark patterns online that manipulate consumers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI – Imagine you are booking a flight through a travel Web portal. It claims – falsely – that only two tickets are left on the flight you have chosen, creating a misleading sense of urgency that compels you to book the seats immediately.\nOr, how about a shaming pop-up that gets you to subscribe to an insurance company’s newsletter you never wanted? This because exiting the marketing pop-up would have meant clicking on a guilt-tripping button that reads: “No, thanks, I hate saving money.”\nInstances of such dark patterns – interfaces on websites or mobile apps that influence users to make choices not in their best interest – have proliferated in India as the Internet becomes accessible to more people, with one estimate pegging the country to have around 900 million active users by 2025.\nThe government now has such manipulative practices in its cross hairs.\nIt has set up a 17-member taskforce to prepare guidelines in the next two months to protect consumers against dark patterns, and has also urged Internet users to report such practices using the National Consumer Helpline.\nThis follows a letter sent out by the Department of Consumer Affairs (DCA) on June 28 to major online platforms in India asking them to desist from using dark patterns.\n“We took a soft approach and told (e-commerce businesses) on June 13 not to indulge in (the use of dark patterns). On June 28, we wrote a tough letter and asked them to stop this, otherwise (we) will take action,” said DCA secretary Rohit Kumar Singh.\nDark pattern practices that manipulate consumer choices could be prosecuted under India’s Consumer Protection Act, 2019.\nOther common forms of dark patterns identified by the government include “basket sneaking”, where firms add additional products or services to a shopping cart without the user’s consent, and “subscription traps” that make it easy for consumers to sign up for a service but difficult for them to opt out.\nIn 2021-22, the Advertising Standards Council of India (Asci), a self-regulatory body of the Indian advertising industry, found as many as 29 per cent of the ads it had looked into were from influencers who had concealed paid content.\nKnown as disguised advertising, this is another dark pattern practice through which advertisements come across as unbiased content, making it difficult for users to distinguish between paid content and genuine information.\nCategories with the most violations in the Asci report were cryptocurrency, personal care, fashion and e-commerce.\nMs Manisha Kapoor, Asci CEO and secretary-general, told The Straits Times in an e-mail that dark patterns, which often also trick users into sharing more personal information than intended, undermine consumer trust and confidence.\n“Entities employing dark patterns must acknowledge the detrimental consequences as these tactics erode consumer trust and damage the online shopping experience, leading to brand abandonment,” she said.\nOn June 15, Asci released a set of guidelines against four common forms of dark patterns used in digital media advertising in sectors such as e-commerce, airlines and food delivery. Patterns include “drip pricing”, where components of the total price are not revealed upfront to consumers but at the very end of the buying process.\nDark patterns are under scrutiny across the world of late. In April, South Korea’s Fair Trade Commission said it would revamp policies to root out dark pattern sales tactics online. A survey by the Korea Consumer Agency had shown about 97 per cent of the country’s mobile commerce apps were embedded with at least one kind of dark pattern.\nIn Europe, Amazon agreed in July 2022 to simplify the process of cancelling its Prime membership, allowing customers in the region to end their subscription in just two clicks, instead of “multiple pages” filled with “distracting information” and “unclear button labels” that Amazon had deployed to make the cancellation process cumbersome.\nThis change came after the European Commission took action in 2021 following a complaint by the European Consumer Organisation, the Norwegian Consumer Council and the Transatlantic Consumer Dialogue.\nThe Commission said in a 2022 report that it found that 97 per cent of the most popular websites and apps used by EU consumers deployed at least one dark pattern.\nCommon ones included hiding important information (from the consumers’ viewpoint), pre-selection, nagging, difficult cancellations and forced registration.\nMeanwhile, experts have suggested that Singapore, which currently also relies on industry self-regulation, could take a step forward in dealing with this menace by expanding the scope of its Consumer Protection (Fair Trading) Act 2003 to cover dark patterns.\nMs Kapoor said it is imperative to educate consumers about manipulative tactics employed by e-commerce platforms.\n“Effective regulation of dark patterns necessitates collective support from various stakeholders, including social media platforms, government entities, influencers, advertisers, brands and e-commerce companies,” she added.", "url": "https://www.straitstimes.com/asia/south-asia/india-sets-up-task-force-to-crack-down-on-dark-patterns-online-that-manipulate-consumers"}