{"authors": ["Lim Ai Leen"], "date_download": "2024-10-12 13:46:39", "date_modify": "2024-10-12 13:46:39", "date_publish": "2024-06-06 08:01:37", "description": "Asian Insider brings you insights into a fast-changing region from our network of correspondents and commentators. Read more at straitstimes.com.", "filename": "asia_asian-insider-what-s-behind-modi-s-bitter-sweet-win-when-garbage-brings-music-to-the-ears_1728740799.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/06/aiainlsty060624%20%283%29.jpg?VersionId=8DB7pliC4wMD4PgjH_PWBl4LkCtQ1.Bl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_asian-insider-what-s-behind-modi-s-bitter-sweet-win-when-garbage-brings-music-to-the-ears_1728740799.html", "title": "Asian Insider: What’s behind Modi’s bitter-sweet win? | When garbage brings music to the ears", "title_page": "Asian Insider: What’s behind Modi’s bitter-sweet win? | When garbage brings music to the ears | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Dear ST reader,\nWe hope you’ve been keeping well.\nWe had predicted weeks ago that caretaker prime minister Narendra Modi may not win as big as he had hoped in India’s general election, but Tuesday’s underwhelming result for his Bharatiya Janata Party still came as a surprise.\nAs our senior columnist Ravi Velloor puts it: How did the BJP, whose vote share has held overall, emerge looking as though it has lost the election even as it has held on to power, albeit without a standalone parliamentary majority?\nGet the election lowdown from our correspondent Debarshi Dasgupta in this video interview.\nLast weekend’s Shangri-La Dialogue in Singapore closed with a bang, thanks to the surprise appearance of Ukraine President Volodymyr Zelensky. Our correspondents not only reported on the discussions covering tensions in the South China Sea and wars in Ukraine and Gaza, they also offered their views from the gallery of Asia’s leading security forum.\nElsewhere, the construction of Indonesia’s new capital Nusantara hit some speed bumps this week when the project’s leaders abruptly resigned. President Joko Widodo flew to the site in Kalimantan the day after, in an apparent attempt to soothe concerns, report our correspondents Hariz Baharudin and Linda Yulisman.\nWe also have a collection of music-related stories for you this week, from Indonesia’s heavy metal hijabis set to rock Glastonbury and K-pop fans backing green causes, to Taiwanese artistes under pressure for making pro-China statements.", "url": "https://www.straitstimes.com/asia/asian-insider-what-s-behind-modi-s-bitter-sweet-win-when-garbage-brings-music-to-the-ears"}