{"authors": [], "date_download": "2024-10-12 13:50:51", "date_modify": "2024-10-12 13:50:51", "date_publish": "2022-09-28 08:53:18", "description": "Some uncertainty remains, as a limited reopening in June failed to attract any meaningful traffic. Read more at straitstimes.com.", "filename": "asia_east-asia_japans-businesses-brace-for-long-awaited-return-of-tourists_1728741051.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/28/md_japan1_28092022.jpg?VersionId=5c3QuPBI4bIHzmBXfHetZgJp_BmKwapD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japans-businesses-brace-for-long-awaited-return-of-tourists_1728741051.html", "title": "Japan's businesses brace themselves for long-awaited return of tourists", "title_page": "Japan's businesses brace themselves for long-awaited return of tourists | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - Japan's tourism industry is opening for business again. From the streets of Kyoto to the slopes of Hokkaido, retailers, restaurants and hotels are seeking to recover the revenue they lost during the pandemic with overseas visitors set to return from Oct 11.\nOne of the last remaining rich economies with tight border controls, and with the yen at quarter-century lows against the dollar, the archipelago is now an affordable and attractive destination for overseas visitors.\nThat is welcome relief, with more than 4,000 enterprises folding since early 2020 when retailers had to comply with Covid-19 curbs on operating hours and cope with the country closing its borders to tourists.\n\"When Covid hit, it was hard for us,\" said Mr Kenya Katayama, mayor of Niseko, a ski resort on the northern island of Hokkaido that is popular with skiers and snowboarders. \"So far, winter reservations are doing well.\"\nSpending by inbound travellers totalled 4.8 trillion yen (S$47.7 billion) in 2019 before lockdowns began, according to Nomura Research Institute. The question now is how much of that will come back, and how soon.\nEarlier this year, Japan topped the World Economic Forum's Travel & Tourism Development Index - which measures how effective policies are in enabling the sustainable development of the travel and tourism sector.\nJapanese airlines are also ramping up international flights.\nEven so, there is still some uncertainty. A limited reopening in June for group tours failed to attract any meaningful traffic. That is making it difficult for tourist-facing businesses to gauge the level of demand.\nSome firms have boosted staffing ahead of an anticipated surge, while others are waiting to justify spending on staff, facilities and services. The lack of workers, many of whom were let go during the pandemic or found other jobs, is complicating the issue.\n\"We are preparing so that we can do our best when inbound tourists return,\" said Mr Takehiro Nishiyama, who runs his family's Nishiyama Ryokan in Kyoto.\nThe inn's income shrank 90 per cent during the pandemic, he added. \"I think tourists will return in spring. Guest houses are on the brink of ruin, so we want to restart quickly.\"\nDomestic travel is picking up, with many residents taking advantage of the lack of lines and affordable prices.\nThe country was at the peak of a tourism boom before the pandemic, with inbound visitors reaching a record in 2019. The small trickle of foreigners allowed in last year spent 120 billion yen, a fraction of the total seen three years ago.\nJapan's biggest airline ANA announced last week that it will boost international flights and cabin staff to meet an anticipated rebound in air traffic. Instead of firing staff, it furloughed much of its staff and arranged jobs for them in other industries to await a recovery. Now, they are being brought back and hiring is picking up.\n\"We've long been waiting for the easing of restrictions,\" chief executive officer Shinichi Inoue told reporters at Haneda International Airport in Tokyo last week. \"We want to welcome visitors from overseas with increased flights.\"\nJapan Airlines is getting ready as well. \"We want to contribute to revitalising the Japanese economy by being fully prepared to welcome foreign visitors,\" the carrier said last week.\nIn Niseko, which before the pandemic saw a healthy influx of winter-sports enthusiasts from Asia, Australia and New Zealand, there appears to be a split between those betting on a surge of returning business and others taking a more cautious approach.\n\"People are still sceptical,\" said Mr Shinichi Shimoda, president of the Niseko Resort Tourist Association. \"They don't know if foreign tourists are really going to come, but even if they did, they can't secure enough workers in time.\"\nMr Paul Wright, general manager of Park Hyatt Niseko Hanazono, which opened inauspiciously in January 2020, said the hotel is already fully booked from just before Christmas through the first week of the new year. While occupancy rates are less clear after that, the hotel is preparing for more business, he said.\n\"No one was let go,\" said Mr Wright, who is seeking to reach full staffing of 240 to 250 people for the first time since opening, from the current 200. \"Because we've been able to sustain our team, we are able to scale up quite confidently and we are recruiting.\"\nAhead of the winter season, Niseko last week was mostly quiet, with many shops and restaurants still closed. There were few job ads on storefronts, but recruiting has been happening online.\nEven with a full border reopening, it is unlikely that Japan will see pre-pandemic numbers until China allows inbound and outbound travel, which currently is restricted due to its Covid Zero policy.\nBefore the pandemic, visitors from Asia's biggest economy accounted for more than a third of tourist spending in Japan. Kyoto, one of the biggest beneficiaries of the tourism boom, is now anticipating a rebound in visitor traffic.", "url": "https://www.straitstimes.com/asia/east-asia/japans-businesses-brace-for-long-awaited-return-of-tourists"}