{"authors": ["Tan Dawn Wei"], "date_download": "2024-10-12 13:48:47", "date_modify": "2024-10-12 13:48:47", "date_publish": "2024-03-02 21:54:00", "description": "The meetings are watched for signals about the direction the government will take in the coming year. Read more at straitstimes.com.", "filename": "asia_china-s-lianghui-meetings-which-start-on-march-4-back-to-business-as-usual-this-year_1728740927.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/02/IMG5506.jpg.JPEG?h=c423a5a4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-s-lianghui-meetings-which-start-on-march-4-back-to-business-as-usual-this-year_1728740927.html", "title": "Back to business as usual this year for China’s Two Sessions, which start on March 4", "title_page": "Back to business as usual this year for China’s Two Sessions, which start on March 4 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - As it shakes off a cold spell, Beijing is getting ready to host thousands of delegates and journalists for its most important political event of the year.\nFor the first time in four years, China’s annual parliamentary meetings known as the Two Sessions, or lianghui, look to return to the usual format, instead of the truncated and restricted versions under the country’s zero-Covid days.\nThe gathering, which typically lasts about two weeks, brings together lawmakers who will review the government’s work reports for the year, pass proposed legislation, and approve budget and personnel changes.\nIt also includes representatives of China’s top advisory body, who will propose and give advice on policies. The meetings are watched for signals about the direction that the government will take in the coming year.\nFrom 2020 to 2022, the annual sessions were shortened to eight days, with the 2020 lianghui postponed to May that year as Covid-19 spread across the country.\nIn 2024, the conclave looks to be back in full force as the authorities shed Covid-19 controls that were still in place in 2023, when delegates were subjected to a “closed-loop” bubble and journalists attending events had to quarantine overnight.\nThe top advisory body, the Chinese People’s Political Consultative Conference, will hold its meeting from March 4, while the legislature, the National People’s Congress, starts its meeting on March 5.\nAs many as 3,000 journalists have registered to cover 2024’s lianghui, including more than 1,000 from Hong Kong, Macau, Taiwan and other parts of the world, reported Xinhua news agency.\nUnlike previous years, organisers also appear to have lifted restrictions on media access to events at the main venue, the Great Hall of the People by Tiananmen Square.\nBut some remnants of those controls remain, as participants – including journalists and diplomats invited to the opening ceremonies of both the legislature and advisory body assemblies – are still required to do a Covid-19 test.\nWhile organisers have yet to release information on meeting schedules or how long the 2024 lianghui will last, it is likely to be kept short at nine days.\nThe Beijing authorities have banned the use of drones from March 1 to 12 in the city’s administrative areas, an indication that the event, which typically concludes with a press conference by the premier, will end on March 12.\nMeanwhile, the city has already gone into “lianghui mode”, with more-serious-than-usual traffic snarls and a stepped-up police presence at bridges, subway stations, embassy areas and major road junctions.\nObservers will be looking out for policy signals on boosting the sluggish economy from Premier Li Qiang as he delivers on March 5 his first work report after taking over from the late Mr Li Keqiang.\nEconomists expect that he will set an economic growth target of 5 per cent, similar to 2023’s. China said it hit growth of 5.2 per cent in 2023, although sceptics say the real figure could be as low as 1.5 per cent.\nThe International Monetary Fund and analysts have projected that China will grow by between 4 per cent and 4.8 per cent in 2024, as it grapples with subdued export demand and a weak property market.\nBut a 5 per cent target could signal more robust stimulus ahead, and help bolster persistently weak business confidence.\n“Even with multiple growth headwinds, high-quality development remains a central policy mantra,” said lead economist Louise Loo of advisory firm Oxford Economics.\nPresident Xi Jinping has repeatedly called for various sectors to pursue high-quality development as the country transitions from the heady years of high-speed growth to seek better productivity and sustainability – a priority Premier Li will no doubt emphasise in his work report.\nAssistant Professor Liu Dongshu of the City University of Hong Kong said that besides China’s economic development, political pundits will also be keeping an eye out for possible personnel changes.\nThese could include whether a new foreign minister might be appointed, and whether newly minted Defence Minister Dong Jun might be promoted to become state councillor, a senior government position that ranks above Cabinet ministers.\nHis predecessor Li Shangfu was abruptly removed as defence minister and state councillor in 2023 amid corruption allegations. Former foreign minister Qin Gang was also sacked and stripped of his state councillor position in 2023. While no official reasons have been given, speculation has been rife that Mr Qin’s removal was related to an extra-marital affair.\n“Beyond the two issues, it might be worth seeing how China describes its foreign relations situation with Europe and the United States, and how China describes its position on Taiwan,” said Prof Liu of the work report by the Premier.", "url": "https://www.straitstimes.com/asia/china-s-lianghui-meetings-which-start-on-march-4-back-to-business-as-usual-this-year"}