{"authors": ["Vihanya Rakshika"], "date_download": "2024-10-12 13:33:47", "date_modify": "2024-10-12 13:33:47", "date_publish": "2024-04-15 07:40:00", "description": "The suspect’s photo has been sent to Malaysia’s northern borders and authorities in a neighbouring country. Read more at straitstimes.com.", "filename": "asia_se-asia_kl-airport-shooting-suspect-s-photo-sent-to-malaysia-s-northern-borders-neighbouring-countries_1728740027.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/15/suspect20klia.png?VersionId=BKsxfKhuotAfKe4nrOYzfM5POcF.d0nK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_kl-airport-shooting-suspect-s-photo-sent-to-malaysia-s-northern-borders-neighbouring-countries_1728740027.html", "title": "KLIA shooting: Police didn’t open fire at suspect due to public safety concerns", "title_page": "KLIA shooting: Police didn’t open fire at suspect due to public safety concerns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Malaysian police said they had refrained from exchanging gunfire with a suspect linked to the April 14 shooting at Kuala Lumpur International Airport Terminal 1 (KLIA 1) due to the potential danger posed to bystanders.\nSpeaking to The Star at the KLIA district police headquarters on April 15, Selangor police chief commander Hussein Omar Khan said people had been questioning why the police did not take immediate action when the incident was unfolding.\n“If we engaged the suspect (in a shoot-out), it could have been worse. It was a public space with a lot of people, including children,” he said.\nMeanwhile, the police have disseminated images of the suspect to all northern entry points of the Malaysian peninsula and the authorities in a neighbouring nation, Bernama reported.\nThe authorities are seeking Hafizul Harawi, 38, to aid in their inquiries.\nInspector-General of Police Tan Sri Razarudin Husain said directives were promptly issued upon the identification of the suspect in the shooting that resulted in a bodyguard getting severely injured.\nSecurity measures have been tightened at border “rat lanes” to deter his potential escape to a neighbouring country.\n“I have faith in the efficiency of my personnel. The suspect will be caught soon,” Mr Razarudin told Malaysian news agency Bernama on April 14. He added that the suspect is believed to still be in Malaysia and efforts to find him have intensified.\nHe said initial investigations indicated that the suspect used a 9mm semi-automatic pistol in the shooting. Three bullet casings were recovered from the scene, with one failing to detonate.\nIt is suspected that the man acquired the firearm from a neighbouring country. The incident unfolded around 1.30am when he allegedly discharged two shots at his wife near the airport’s arrival hall entrance, narrowly missing her but striking her bodyguard.", "url": "https://www.straitstimes.com/asia/se-asia/kl-airport-shooting-suspect-s-photo-sent-to-malaysia-s-northern-borders-neighbouring-countries"}