{"authors": [], "date_download": "2024-10-12 13:55:11", "date_modify": "2024-10-12 13:55:11", "date_publish": "2024-03-18 15:07:06", "description": "The number of newly-weds rose to 7.68 million in 2023, according to data released last week. Read more at straitstimes.com.", "filename": "asia_more-chinese-tied-the-knot-in-2023-lifting-marriage-rates-for-first-time-in-nine-years_1728741311.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/18/LYNXNPEK2H05X-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_more-chinese-tied-the-knot-in-2023-lifting-marriage-rates-for-first-time-in-nine-years_1728741311.html", "title": "More Chinese tied the knot in 2023, lifting marriage rates for first time in 9 years", "title_page": "More Chinese tied the knot in 2023, lifting marriage rates for first time in 9 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – The number of new marriages in China jumped 12.4 per cent in 2023 from a year earlier, reversing a downtrend that has lasted for almost a decade as more youth tied the knot after delaying their nuptials due to the Covid-19 pandemic.\nThe number of newlyweds rose to 7.68 million in 2023, according to data released by the Ministry of Civil Affairs last week. This was up 845,000 couples from 2022, but still far below the peak of 13.47 million couples hit in 2013.\nThe data comes after China’s Premier Li Qiang pledged in March that the government would work towards “a birth-friendly society and promote long-term, balanced population development”, as well as reducing the cost of childbirth, parenting and education.\nPolicymakers are grappling with how to reverse a declining population, where the birth rate is falling and society ageing rapidly.\nRoughly 300 million Chinese are expected to enter retirement in the coming decade, the equivalent of almost the entire population of the United States.\nChina’s population fell for a second consecutive year in 2023, as the record low birth rate and deaths due to Covid-19 accelerated a downturn that officials fear will have profound long-term effects on the economy’s growth potential.\nMarriage rates are closely tied to birth rates, giving some cheer to policymakers, as an uptick in marriages could yield more babies and soften the population decline in 2024.\nMore babies are being born in hospitals across China in the Year of the Dragon, which began on Feb 10, financial news outlet Yicai recently reported, with the Dragon zodiac sign believed to be particularly auspicious.\nBut many young people are opting to stay single or put off getting married due to poor job prospects, record youth unemployment and chronically low consumer confidence as growth in the world’s second-largest economy slows. REUTERS", "url": "https://www.straitstimes.com/asia/more-chinese-tied-the-knot-in-2023-lifting-marriage-rates-for-first-time-in-nine-years"}