{"authors": [], "date_download": "2024-10-12 13:48:11", "date_modify": "2024-10-12 13:48:11", "date_publish": "2022-01-06 13:02:49", "description": "More cities in central China resorting to tough curbs. Read more at straitstimes.com.", "filename": "asia_east-asia_chinas-henan-imposes-more-covid-19-curbs-as-cases-spike-though-numbers-small_1728740891.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/01/06/mdcncovid106012022.jpg?VersionId=Wyc1ZNG8eOvyqi1IXA6JtiN5Zo5m_ue_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinas-henan-imposes-more-covid-19-curbs-as-cases-spike-though-numbers-small_1728740891.html", "title": "China's Henan imposes more Covid-19 curbs as cases spike, though numbers small", "title_page": "China's Henan imposes more Covid-19 curbs as cases spike, though numbers small | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (REUTERS) - More cities in central China resorted to tough curbs as new coronavirus infections in Henan province rose sharply, with the authorities taking urgent action to contain clusters ahead of the Winter Olympics and Chinese New Year peak travel season.\nHenan reported 64 domestically transmitted local infections with confirmed symptoms on Wednesday (Jan 5), up from just four a day earlier, official data showed on Thursday.\nAlthough the numbers are small compared with many places in the world, and no cases of the highly transmissible Omicron variant have been reported so far in Henan, several cities there imposed new limits on travel or economic activities in response to a rash of new cases.\nChina's national policy of stamping out clusters quickly as they appear has taken on extra urgency in the run-up to the Winter Games, being hosted by Beijing and nearby Hebei starting on Feb 4.\nChina’s state planner also said preventing the virus from spreading would become harder during the coming weeks, when masses of people travel for the Chinese New Year holiday.\n\"The international pandemic situation is serious and complex, the virus variant becomes more transmissible, and prevention and control are more difficult,\" it said on Thursday in a document on the travel season.\nGushi, a county in Henan of one million residents, reported one symptomatic case and one asymptomatic carrier on Wednesday (Jan 5).\nBut that was enough to persuade local officials to stop people from leaving town and dissuade others from coming.\nThe city of Xuchang required local officials to minimise movement of people as mass testing on its more than four million residents was being rolled out between Thursday and Friday.\nIn Yuzhou city, part of Xuchang's conurbation, one million residents are already under lockdown, with people in some areas unable to leave their homes. In other areas, each household can send out only one person every two days to shop for daily necessities.\nLuoyang, a city of seven million, has closed various entertainment venues, including cinemas. Shangqiu, with nearly eight million residents, has suspended in-person classes at all primary and middle schools.\nHebi city, without any new infections reported during the current outbreak, said on Thursday that it would shutter cultural and entertainment venues. Kaifeng city, also clear of cases, closed all tourist sites from Thursday.\nAlthough no local infections were reported on Wednesday in Yongji, a city in the northern province of Shanxi, the authorities there ordered all its 400,000 residents to remain indoors and businesses and schools to suspend activities on Thursday, after samples taken from a train station turnstile tested positive for the virus.\nThe north-western city of Xi'an, more than two weeks into a lockdown, reported 63 local symptomatic infections for Wednesday, up from 35 a day earlier, but still much lower than the daily case count seen in the last week of December.\nAll international flights in Xi'an Xianyang International Airport were halted from Wednesday, the official Xinhua news agency reported on Thursday. Domestic flights were suspended earlier.\nEastern Zhejiang province detected five local symptomatic cases on Wednesday.\nMainland China had 103,121 confirmed symptomatic cases as at Jan 5, including both local and imported ones, with a death toll of 4,636.", "url": "https://www.straitstimes.com/asia/east-asia/chinas-henan-imposes-more-covid-19-curbs-as-cases-spike-though-numbers-small"}