{"authors": [], "date_download": "2024-10-12 13:50:03", "date_modify": "2024-10-12 13:50:03", "date_publish": "2024-02-26 17:02:08", "description": "There was \"abuse of power, ranging from legal aspects to the use of state facilities\", it said. Read more at straitstimes.com.", "filename": "asia_indonesias-largest-party-seeks-parliamentary-probe-into-alleged-election-irregularities_1728741003.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/26/LYNXNPEK1P06F-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_indonesias-largest-party-seeks-parliamentary-probe-into-alleged-election-irregularities_1728741003.html", "title": "Indonesia’s largest party PDI-P eyes probe into alleged election irregularities", "title_page": "Indonesia’s largest party PDI-P eyes probe into alleged election irregularities | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA - The Indonesian Democratic Party of Struggle (PDI-P), the country’s biggest party, is seeking a legislative investigation into alleged violations around February’s presidential election and plans also to file a case with a top court, a senior party official said on Feb 26.\nPDI-P backed former Central Java province governor Ganjar Pranowo for the presidency.\nHe finished a distant third behind Defence Minister Prabowo Subianto, the clear winner according to unofficial vote tallies and an ongoing preliminary count by the poll body.\n“We found there was abuse of power, ranging from legal aspects to the use of state facilities,” PDI-P secretary-general Hasto Kristiyanto told Reuters, without providing specifics or evidence to support the allegation.\nThe presidential palace did not immediately respond to a request for comment on the allegations or the planned investigation.\nDespite various accusations by parties, none have provided specifics or details of the scale of the alleged violations.\nThough the Constitutional Court typically handles election disputes, Indonesia’s Parliament has the power to conduct investigations on government policy or implementation of certain regulations and can examine the conduct of public officials, including the president.\nMr Hasto said PDI-P and other backers of Mr Ganjar would file a case concerning the alleged electoral violations with the Constitutional Court, but gave no timeframe. He said the probe aimed to safeguard democracy.\n“If we did not do this comprehensive correction, then what’s the point of having an election in the future?” he said, adding it does not aim to impeach President Joko Widodo, better known as Jokowi.\nHuge win\nParliament reconvenes in March and for a probe to be launched, it must be approved by more than half of legislators present at a plenary session.\nMr Prabowo looks to have swept the Feb 14 election with almost 60 per cent of the votes, boosted by the tacit backing of Mr Widodo, who has faced mounting allegations of ethical breaches and meddling, which his allies deny.\nMr Prabowo also ran on a ticket with Mr Widodo’s son, owing to a last-minute decision by the Constitutional Court, headed by the President’s brother-in-law, to change election eligibility rules.\nPDI-P’s plan is backed by another pro-Ganjar party and has the support of three parties that endorsed second-place finisher, Mr Anies Baswedan. If combined, those constitute a majority, with 314 of 575 seats.\nIn a report on Indonesia’s election last week, poll monitor Asian Network for Free Elections noted widespread concerns about the independence of the election commission and mobilisation, and misuse of state resources to sway voter preferences, adding “it would be of a disservice to the electoral stakeholders” if those were to go unaddressed.\nMr Hermawi Taslim, a top official of NasDem, which backed Mr Anies, said his party supported PDI-P’s plan.\n“The probe is needed so the upcoming government is legitimate,” he added. REUTERS", "url": "https://www.straitstimes.com/asia/indonesias-largest-party-seeks-parliamentary-probe-into-alleged-election-irregularities"}