{"authors": [], "date_download": "2024-10-12 13:45:12", "date_modify": "2024-10-12 13:45:12", "date_publish": "2023-02-02 13:14:07", "description": "The government is seeking to revive the economy and repair the city’s global image. Read more at straitstimes.com.", "filename": "asia_se-asia_hong-kong-is-about-to-give-away-half-a-million-airline-tickets_1728740712.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/03/HONGKONG-CHINA-VIRUS-TRAVEL-TOURISM-101202.jpg?VersionId=dThS42UAvECcO2KMjFsv6WY2SurkXeGQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_hong-kong-is-about-to-give-away-half-a-million-airline-tickets_1728740712.html", "title": "Hong Kong to woo back visitors with free flights, after three years of Covid-19 curbs", "title_page": "Hong Kong to woo back visitors with free flights, after three years of Covid-19 curbs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Hong Kong leader John Lee on Thursday unveiled a promotion campaign that will include 500,000 free flights to woo back visitors, businesses and investors to the financial hub after more than three years of tough Covid-19 curbs.\nThe “Hello, Hong Kong” campaign was launched with dancers and flashing neon lights in the city’s main convention centre, next to its famous harbour, with a backdrop bearing the slogan in various languages, including Russian and Spanish.\nMr Lee, Hong Kong’s Chief Executive, said the campaign would show that the city is open for tourism, and is aimed at boosting business and investment in the Chinese special administrative region.\n“Hong Kong is now connected to mainland China and the whole international world, and there will be no isolation, no quarantine and no restrictions on experiencing... enjoying the hustle and bustle of Asia’s world city,” Mr Lee said.\nHe added that Hong Kong would host sports and cultural events and highlight attractions such as The Palace Museum and M+ museum, as well as a revamped Peak Tram with special vouchers.\nCelebrities, officials and business executives were featured in promotional videos streamed during the ceremony, with plans for them to be used to promote the city.\n“We have to let outsiders know that Hong Kong has a unique status, especially when the ‘one country, two systems’ principle will be implemented in Hong Kong for a long time,” Mr Lee said.\nThe free flight tickets will be distributed to overseas visitors for six months, starting from March 1, with airlines Cathay Pacific, Hong Kong Express and Hong Kong Airlines receiving them.\nThe launch was attended by several officials, including those from the city’s tourism, trade and aviation departments.\nHong Kong was largely sealed off behind closed borders for much of the past three years in a bid to ward off Covid-19, with mandatory quarantine of up to three weeks for people arriving, as well as intensive testing and screening.\nThe city closely followed China’s zero-Covid policy until the middle of 2022, when it began to unwind its rules.\nHong Kong dropped most of its remaining Covid-19 rules in December, but the wearing of masks remains mandatory except during exercise, as is daily rapid antigen testing for students.\nTesting requirements and a quota system for mainland Chinese visitors are set to be dropped, while three more border crossings with the mainland will reopen as early as Monday, the South China Morning Post reported.\nThe border reopened in January for the first time in three years.\nChina announced in December that it would scrap most of its Covid-19 curbs, and it reopened its borders to the world in January, despite a surge in infections.\nHong Kong business groups, diplomats and many residents deplored the city’s Covid-19 rules, saying they threatened its competitiveness and standing as an international financial centre, especially after a period of political tension over pro-democracy protests. REUTERS", "url": "https://www.straitstimes.com/asia/se-asia/hong-kong-is-about-to-give-away-half-a-million-airline-tickets"}