{"authors": [], "date_download": "2024-10-12 13:55:37", "date_modify": "2024-10-12 13:55:37", "date_publish": "2022-07-25 09:15:59", "description": "Data released on Sunday showed new births in 2021 the lowest in decades in several provinces. Read more at straitstimes.com.", "filename": "asia_east-asia_chinas-population-expected-to-start-to-shrink-before-2025_1728741337.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/25/ac_chpopulation_250722.jpg?VersionId=q4PV8KeyxNEo1OI3wtfWdphUwL5yjbAl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinas-population-expected-to-start-to-shrink-before-2025_1728741337.html", "title": "China's population expected to start to shrink before 2025", "title_page": "China's population expected to start to shrink before 2025 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (REUTERS) - China's population has slowed significantly and is expected to start to shrink ahead of 2025, the state backed Global Times reported, citing a senior health official.\nBirth data released late on Sunday (July 24) showed that the number of new births in 2021 was the lowest in decades in several provinces.\nThe number of births in central Hunan province fell below 500,000 for the first time in nearly 60 years, the Global Times said. Only China's southern Guangdong province has had more than 1 million new births, it said.\nChina is battling to reverse a rapid shrinkage in natural population growth as many young people opt not to have children due to factors including the high cost and work pressure.\nChina's population is expected to start to shrink in 2021-2025, the Global Times said, citing head of population and family affairs Yang Wenzhuang of the National Health Commission.", "url": "https://www.straitstimes.com/asia/east-asia/chinas-population-expected-to-start-to-shrink-before-2025"}