{"authors": [], "date_download": "2024-10-12 14:15:44", "date_modify": "2024-10-12 14:15:44", "date_publish": "2022-03-12 11:18:15", "description": "Local infections have ballooned to more than 1,500 from a little over 300 in less than a week. Read more at straitstimes.com.", "filename": "asia_east-asia_chinas-daily-local-covid-19-cases-hit-two-year-high-of-over-1500_1728742544.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/12/md_cncovid_12032022.jpg?VersionId=GWu74A6WcfZKesN1DTeZ_dV_wlsOFV5_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinas-daily-local-covid-19-cases-hit-two-year-high-of-over-1500_1728742544.html", "title": "China’s tech hub Shenzhen to work from home as Covid-19 cases hit two-year high", "title_page": "China’s tech hub Shenzhen to work from home as Covid-19 cases hit two-year high | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (BLOOMBERG, REUTERS) - China has asked residents in the technology hub of Shenzhen to work from home and has closed non-essential venues in the southern Chinese city as the country braces for a nationwide Covid-19 resurgence last seen in the early days of the pandemic.\nMainland China reported more than 1,500 new local Covid-19 infections on Saturday (March 12), the most since the initial nationwide outbreak at the start of 2020, as the Omicron variant prompts cities across the country to further tighten measures.\nDespite the rising caseload, only six Covid-19 patients are severely ill and China hasn’t reported a single coronavirus-related death for more than a year.\nChina's 588 daily cases were far fewer than those of many other countries, but the growing number could complicate Beijing's \"dynamic-clearance\" ambition to suppress contagion as quickly as possible.\nOf the daily total, 476 were locally transmitted, the National Health Commission said, including five people initially classified as asymptomatic who developed symptoms later.\nThe country reported 1,048 domestically transmitted asymptomatic infections, which China does not classify as confirmed cases, for Friday, the health authority said, up from 703 a day earlier.\nShenzhen has asked its almost 18 million residents to stay home next week while dining in at restaurants has been banned and non-essential venues such as bars and cinemas are closed, state media reported on Saturday.\nFive of the city’s 10 districts will also conduct daily mass testing for four consecutive days, according to local media.\nThe city, which neighbours Hong Kong, has been battling a growing omicron outbreak that has led to lockdowns of residential compounds and office buildings. Shenzhen is also under pressure to stave off infections from seeping in through Hong Kong, which has seen daily cases rise to tens of thousands.\nSeveral cities have taken measures such as cancelling group events, launching rounds of mass testing and cutting face-to-face classes in school.\nThe northeastern province of Jilin, which borders Russia and North Korea, and has been one of the hardest-hit regions, said it had dismissed the mayor of Jilin city and a district head in the capital, Changchun.\nChangchun has ordered all but essential businesses to halt operations and banned its nine million residents from leaving their residential compounds for non-essential reasons. Similar measures have been applied in urban areas of Jilin city.\nIn the financial hub of Shanghai, the Disneyland resort said it would reduce its guest capacity and from Sunday require visitors to present negative nucleic acid test results taken within 24 hours. China’s financial hub is also battling a rising number of omicron infections that have prompted school closures for students from kindergarten through secondary school next week.\nThe venue for the Canton Fair, China's oldest and biggest trade fair, has been temporarily closed as it was recently visited by a suspected confirmed case, local authorities in Guangzhou said.\nA meeting convened by a government taskforce, which coordinates China's Covid-19 response, said on Friday all localities needed to tighten prevention and control measures, and to treat this as their top political task.\n\"The hard-to-come-by results of prevention and control must not be allowed to go to waste,\" said state broadcaster CCTV. \"Do not relax, resolutely hold to the bottom line that there cannot be a large-scale rebound of the epidemic.\"", "url": "https://www.straitstimes.com/asia/east-asia/chinas-daily-local-covid-19-cases-hit-two-year-high-of-over-1500"}