{"authors": [], "date_download": "2024-10-12 13:55:53", "date_modify": "2024-10-12 13:55:53", "date_publish": "2024-03-20 08:12:44", "description": "Finland remained in the top spot, followed closely by Denmark, Iceland and Sweden. Read more at straitstimes.com.", "filename": "asia_gloomy-youth-pull-us-and-western-europe-down-global-happiness-ranking_1728741353.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/20/US-LIFESTYLE-STPATRICKS-183412.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_gloomy-youth-pull-us-and-western-europe-down-global-happiness-ranking_1728741353.html", "title": "Gloomy youth pull US and Western Europe down global happiness ranking", "title_page": "Gloomy youth pull US and Western Europe down global happiness ranking | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Rising unhappiness among younger people has caused the United States and some large Western European countries to fall down a global well-being index, while Nordic nations retain their grip on the top spots.\nThe annual World Happiness Report, launched in 2012 to support the United Nations’ sustainable development goals, is based on data from US market research company Gallup, analysed by a global team now led by Britain’s University of Oxford.\nPeople in 143 countries and territories are asked to evaluate their life on a scale from zero to 10, with 10 representing their best possible life. Results from the past three years are averaged to create a ranking.\nFinland remained in the top spot with an average score of 7.7, followed closely by Denmark, Iceland and Sweden, while Afghanistan and Lebanon held the bottom two spots, with scores of 1.7 and 2.7, respectively.\nSingapore came in at No. 30 globally but was ranked the happiest country in Asia for the second year running.\nThe other places in the top 10 in Asia, in descending order, are Taiwan, Japan, South Korea, the Philippines, Vietnam, Thailand, Malaysia, China and Mongolia.\nIn broad terms, the rankings are loosely correlated with countries’ prosperity, but other factors such as life expectancy, social bonds, personal freedom and corruption appear to influence individuals’ assessments too.\nThe US dropped out of the top 20 for the first time, falling to 23rd place from 15th in 2023, due to a big drop in the sense of well-being of Americans under 30, the report shows.\nWhile a global ranking of the happiness of those aged 60 and over would place the US 10th, the life evaluations of under-30s alone put the US in 62nd place.\nThe findings are at odds with much previous research into well-being, which found happiness highest in childhood and early teens before falling to its lowest in middle age, then rising around retirement.\n“Youth, especially in North America, are experiencing a midlife crisis today,” said economics professor Jan-Emmanuel De Neve of the University of Oxford, one of the report’s editors.\nMillennials and those in younger age groups in North America were significantly more likely than those in older age groups to report loneliness.\nBut Professor De Neve said a range of factors was likely to be lowering young peoples’ happiness, including increased polarisation over social issues, negative aspects of social media, and economic inequality that made it harder for young people to afford their own homes than in the past.\nWhile the phenomenon is starkest in the US, the age gap in well-being is also wide in Canada and Japan, and to a decreasing extent in France, Germany and Britain, which all lost ground in the 2024 rankings.\nBy contrast, many of the countries with the biggest improvements in well-being are former communist countries in Central and Eastern Europe.\nThere, unlike in richer countries, young people report significantly better quality of life than older people, often on a par with or better than in Western Europe.\n“Slovenia, Czechia and Lithuania are moving into the top 20 and that’s wholly driven by their youth,” Prof De Neve said. REUTERS", "url": "https://www.straitstimes.com/asia/gloomy-youth-pull-us-and-western-europe-down-global-happiness-ranking"}