{"authors": [], "date_download": "2024-10-12 13:55:03", "date_modify": "2024-10-12 13:55:03", "date_publish": "2023-07-20 17:43:00", "description": "Two Alaskan Malamutes were wedded on Friday in Jakarta at a cost of 200 million rupiah (S$17,700). Read more at straitstimes.com.", "filename": "asia_se-asia_not-fur-ever-after-indonesians-sorry-after-lavish-dog-wedding-backlash_1728741303.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/20/fddogs20.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_not-fur-ever-after-indonesians-sorry-after-lavish-dog-wedding-backlash_1728741303.html", "title": "Not fur-ever after: Indonesians sorry after backlash over $17,700 dog ‘wedding’", "title_page": "Not fur-ever after: Indonesians sorry after backlash over $17,700 dog ‘wedding’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Two Indonesian women have apologised after a lavish “wedding” for their dogs sparked a backlash in a nation where wealth distribution is one of the most unequal in the world.\nTwo Alaskan Malamutes were wedded on Friday at a mall in the capital Jakarta, donning traditional Javanese costumes alongside their owners and relatives at a fake ceremony that reportedly cost 200 million rupiah (S$17,700).\nA social media uproar followed after images emerged of the wolf-like dogs taking each other’s paws in marriage at the extravagant ceremony, forcing the owners into a contrite news conference.\n“We regret it very much, and we would like to apologise for the Javanese culture enthusiasts and all Indonesians who were uncomfortable and hurt by the event,” Ms Indira Ratnasari, owner of female dog Luna, said on Wednesday.\n“We had no intention to insult the Indonesian and the Javanese culture,” she said, according to footage posted on her makeup artist’s Instagram account.\nOstentatious displays of wealth in the world’s fourth-most populous country are frowned upon and often criticised because of its widening income gap.\nThe minimum monthly wage in Jakarta is 4.9 million rupiah, and the World Bank in 2022 said nearly a tenth of Indonesia’s 270 million people still live below the poverty line.\nMs Ratnasari is on the payroll of the Indonesian presidential office, local media reported.\nIndonesian President Joko Widodo told public officials in a March speech not to flaunt their extravagant lives in “improper” ways, including social media posts.\nMs Valentine Cahandra, owner of male dog Jojo, claimed the wedding took place to promote Javanese culture.", "url": "https://www.straitstimes.com/asia/se-asia/not-fur-ever-after-indonesians-sorry-after-lavish-dog-wedding-backlash"}