{"authors": [], "date_download": "2024-10-12 14:19:34", "date_modify": "2024-10-12 14:19:34", "date_publish": "2023-02-01 17:24:08", "description": "He has offered billionaire Elon Musk a mining concession, tax breaks and subsidies to convince him to assemble his Tesla EVs in Indonesia. Read more at straitstimes.com.", "filename": "asia_se-asia_jokowi-confident-tesla-will-invest-in-battery-car-factory-in-indonesia_1728742774.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/01/2022-12-27T104450Z898251341RC29EY9JPJYDRTRMADP3TESLA-CHINA_1.JPG?VersionId=hAMzz7ObHS_qas83pzbHE6flxFYYbLuP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_jokowi-confident-tesla-will-invest-in-battery-car-factory-in-indonesia_1728742774.html", "title": "Jokowi ‘confident’ Tesla will invest in battery, car factory in Indonesia", "title_page": "Jokowi ‘confident’ Tesla will invest in battery, car factory in Indonesia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – President Joko Widodo is confident Tesla will finalise a deal to invest in a production facility in Indonesia, having offered the US electric car maker incentives ranging from tax breaks to a concession to mine nickel.\nIndonesia, South-east Asia’s largest economy, has been wooing Tesla to invest in battery and car manufacturing since 2020, seeking to leverage its rich reserves of nickel ore, which can be processed for use in EV batteries.\nMr Widodo, widely known as Jokowi, has held talks with Tesla chief executive Elon Musk twice, meeting him in person at his SpaceX facility in Texas in 2022 and talking to him by phone, to try to secure a deal.\n“I said to him that if you invest in Indonesia, I will give the concession of nickel,” Mr Widodo said, referring to Indonesia’s offer of a mining concession.\nOther incentives include tax breaks and a subsidy scheme on EV purchases to build a market for Tesla in the world’s fourth most populous country, he said, adding that his ministers are finalising the subsidies.\nMr Widodo said he was “confident” Indonesia has the edge over other countries Tesla might be considering for investment because it has the largest nickel reserves and a big domestic market.\nHe said it was up to Tesla to take up the offer to mine nickel, underlining that Indonesia is open to investment in the EV battery and electric car supply chain.\n“If they want to start from EV battery, it’s OK,” he added.\nTesla is looking for an additional manufacturing hub. It currently manufactures EVs in four locations: Fremont, California; Shanghai; Austin, Texas; and outside Berlin.\nAnalysts estimate that Tesla would need to build seven or eight more “gigafactories” to meet Mr Musk’s target of selling 20 million electric vehicles by 2030.\nIn addition to Indonesia, South Korea, Canada and Mexico have been vying for Tesla to invest in manufacturing.\nA spokesman for Mexico’s president said on Tuesday that Tesla was considering setting up an assembly plant near a new Mexico City airport.\nAnalysts have said Mexico could have an edge to win the Tesla investment because of the proximity to its main market in the United States, an established supply base for components and because vehicles built there could qualify for Biden administration consumer tax credits. REUTERS", "url": "https://www.straitstimes.com/asia/se-asia/jokowi-confident-tesla-will-invest-in-battery-car-factory-in-indonesia"}