{"authors": [], "date_download": "2024-10-12 14:05:38", "date_modify": "2024-10-12 14:05:38", "date_publish": "2020-06-24 15:06:30", "description": "KUALA LUMPUR (BLOOMBERG) - Malaysian former leader Najib Razak applied to strike out accusations of tampering with an audit report on troubled state fund 1MDB after prosecutors amended the charges. Read more at straitstimes.com.", "filename": "asia_se-asia_najib-seeks-to-strike-out-1mdb-audit-charges-after-amendment_1728741938.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/06/24/yq-najib-24062020.jpg?VersionId=xltCK5mEHAsUDzQmCuY12LrkjdXlQKFW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_najib-seeks-to-strike-out-1mdb-audit-charges-after-amendment_1728741938.html", "title": "Ex-Malaysia PM Najib seeks to strike out 1MDB audit charges after amendment", "title_page": "Ex-Malaysia PM Najib seeks to strike out 1MDB audit charges after amendment | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR (BLOOMBERG) - Malaysian former leader Najib Razak applied to strike out accusations of tampering with an audit report on troubled state fund 1MDB after prosecutors amended the charges.\nThe judge allowed prosecutors to change the wording in Najib's charge sheet to allege that he along with former 1MDB president Arul Kanda are involved in tampering with an audit report \"finalised\" by the Auditor-General before it was \"finalised again\" and presented to Parliament's Public Accounts Committee, according to court proceedings in Kuala Lumpur on Wednesday (June 24).\nNajib has responded by applying to strike out the charges entirely, with the judge set to decide on the matter on July 23.\nThe earlier charge sheet said the two men are accused of being involved in tampering with an audit report \"presented\" by the Auditor-General before it was \"finalised\" and sent to the Public Accounts Committee.\nThe case is one of many that Najib faces for his alleged role in 1MDB, the Malaysian state fund that is at the centre of global investigations into corruption and money laundering.\nNajib's lawyer argued against the amendment earlier, saying the changes are not acceptable as a finalised report by definition could not be revised.\nHis defence team has previously argued that the audit report was still in a draft stage when Najib allegedly asked for changes to be made.", "url": "https://www.straitstimes.com/asia/se-asia/najib-seeks-to-strike-out-1mdb-audit-charges-after-amendment"}