{"authors": [], "date_download": "2024-10-12 13:51:09", "date_modify": "2024-10-12 13:51:09", "date_publish": "2022-03-29 14:31:03", "description": "Two major wholesale food markets in Changchun have shuttered, leading to a shortfall in food supply. Read more at straitstimes.com.", "filename": "asia_east-asia_capital-of-chinas-jilin-province-apologises-for-food-shortages-due-to-covid-curbs_1728741069.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/29/ads-jilin-26032022.jpg?VersionId=AXzmz267w61FjCFBTcNXmG2YXabuQr1q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_capital-of-chinas-jilin-province-apologises-for-food-shortages-due-to-covid-curbs_1728741069.html", "title": "Capital of China's Jilin province apologises for food shortages due to Covid curbs", "title_page": "Capital of China's Jilin province apologises for food shortages due to Covid curbs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (REUTERS) - The Chinese city of Changchun, capital of the COVID-hit northeastern province of Jilin, on Tuesday (March 29) apologised to its 8.5 million residents for food shortages related to shutdowns and disruption caused by Covid-related containment measures.\nDue to Covid-19, two major wholesale food markets in Changchun have shuttered, leading to a shortfall in food supply, said the city's deputy Communist Party secretary, Liu Renyuan, a problem aggravated by a shortage of workers that has delayed deliveries to homes.\n\"We are particularly anxious and angry about this, and we express our deep apologies to the public for the impact and inconvenience caused,\" Liu said at a local news conference.\nTo ease the dearth of sorting and delivery personnel, the provincial government of Jilin has organised about 1,000 tonnes of \"vegetable bags\" to be delivered to Changchun each day, he said.\nChangchun and the rest of Jilin have been battling with Covid cases increasing by thousands almost every day since mid-March.\nIn what they have called a \"last-ditch battle\" against the virus, authorities have put the entire province under lockdown and conducted mass testing to isolate infections.\nChangchun itself has completed more than 10 rounds of citywide testing of its residents.", "url": "https://www.straitstimes.com/asia/east-asia/capital-of-chinas-jilin-province-apologises-for-food-shortages-due-to-covid-curbs"}