{"authors": ["Hazlin Hassan"], "date_download": "2024-10-12 14:06:34", "date_modify": "2024-10-12 14:06:34", "date_publish": "2023-10-31 12:31:00", "description": "Non-Muslims are concerned that their rights may be eroded should the Islamist party come to power. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-s-pas-has-tough-task-to-woo-non-muslim-voters-analysts-say_1728741994.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/31/2023080752258811bum1718-01.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-s-pas-has-tough-task-to-woo-non-muslim-voters-analysts-say_1728741994.html", "title": "Malaysia’s PAS has tough task wooing non-Muslim voters, analysts say", "title_page": "Malaysia’s PAS has tough task wooing non-Muslim voters, analysts say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Parti Islam SeMalaysia (PAS) aims to woo more non-Muslims by the next general election due in four years, but analysts see this as a tall order for the party, given its deeply conservative stance.\nNon-Muslims are concerned that their rights may be eroded should the Islamist party come to power, with PAS already banning lottery draws and restricting alcohol sales in the four northern states that it controls.\nPAS’ penchant for calling non-Muslims “kafir” (infidels), often seen as an insult, has also engendered distrust towards it that has only grown with its ascent being labelled a “green wave” of conservative Islam, cementing the fear in the minds of non-Muslims and urban Malays.\nPAS is the largest party in Parliament by seats, and leads the opposition bloc. Its 43 MPs swept to victory in Malay-Muslim majority wards in the November 2022 general election.\nIn concurrent state elections, its Perikatan Nasional (PN) coalition snatched Perlis from Barisan Nasional (BN) by a landslide, bringing the number of states PN controls to four.\nPAS also retained control of Kelantan, Terengganu and Kedah in legislative assembly polls in August 2023.\nIt is hoping to ride this momentum to form the federal government in the 16th general election due in 2027 – but knows it needs to win over ethnic Chinese and Indians, who make up about a third of the population.\nTo win federal power, a party or alliance of parties must secure at least 112 of the 222 seats in Parliament.\nIn the 2022 election, PAS and its main ally Parti Pribumi Bersatu Malaysia won 74 seats. Prime Minister Anwar Ibrahim’s unity government has 147 – from his Pakatan Harapan (PH) coalition, Umno-led BN, and coalitions from Sarawak and Sabah.\n“PAS must win over non-Muslims in GE16,” its president Abdul Hadi Awang exhorted at the party’s annual congress on Oct 20. “In fact, we will continue to preserve freedom of religion and ensure justice, as enshrined under the federal Constitution.”\nNon-Malays, however, are unconvinced.\nPAS won just 3 per cent of the non-Malay vote in an October by-election in Pahang, noted Dr Mazlan Ali, senior lecturer at Universiti Teknologi Malaysia (UTM).\n“During the state elections in August this year, and last November’s general election, PN won only in Malay-majority areas and lost in the mixed seats, especially on the west coast,” he said.\nIn the rural north-east state of Kelantan ruled by PAS for more than three decades, some of its non-Malay residents are frustrated by the way it governs.\n“It will be hard for PAS to win over the non-Malay votes. I feel suffocated by PAS’ approach of using religion to win the Malay votes, condemning the non-Muslims and calling them ‘kafir’,” a self-employed 42-year-old Kelantan resident, who wanted to be known only as Mr Tan, told The Straits Times.\n“We non-Malays see PAS as having failed to govern the state properly, especially when it comes to managing the economy,” he added.\nKelantan is one of the poorest states in Malaysia, with absolute poverty levels – the proportion of households with a total income under RM2,208 (S$630) a month – at 12.4 per cent, among the country’s worst.\nA housewife from Kuala Lumpur, who wanted to be known only as Madam Liow, said she feels offended whenever PAS refers to non-Muslims as “kafir”.\n“I will never vote for PAS, not under president Hadi Awang. He just sounds like he hates non-Muslims,” she added. “It’s not so much the labelling but the intention to insult.”\nPAS leaders have taken pains to explain that non-Muslims would be allowed to retain their social freedom.\nReferring to the term “kafir”, PAS deputy president Tuan Ibrahim Tuan Man told the media on Oct 21: “It is not meant to be insulting. There are a few types of kafir – those who are hostile to Muslims, those who have no problems living among Muslims, and those who have made a pact with Muslims to keep the peace.”\nBut a PAS insider close to the leadership acknowledged that election results since November 2022 have showed that the party has failed to win over the non-Malay voters. “This is the reality, due to the propaganda spread against PAS, and efforts to paint PAS as an extreme party,” he told ST.\nAnother major challenge for PAS in its quest for voters is that its political foe, the Chinese-based Democratic Action Party (DAP), has sewn up the non-Muslim vote. The DAP forms the second-largest bloc in Parliament with 40 lawmakers.\nUTM’s Dr Mazlan said that to gain non-Malay support, PAS needs to pivot from focusing on Malay and Islamic issues to becoming more open to all races, as it used to be in the past.\nPAS was led by spiritual leader Nik Aziz Nik Mat, a counterweight to the party president, from 1991 until his death in 2015. He played a key role in boosting the party’s popularity among non-Muslims, with his moderate stance and the formation in 2004 of an unofficial wing for non-Muslims called PAS Supporters’ Club.\n“After the death of Nik Aziz, PAS went back to the Malay-Muslim approach. It is quite chauvinistic, ultra-Malay and ultra-Islam. Non-Malays don’t feel safe under a PAS rule, or under a party which focuses on Malay-Muslim issues, while PH is seen as a party that can uphold the rights of all races,” said Dr Mazlan.\nBetween 2008 and 2015, with Datuk Nik Aziz at the fore, PAS worked together with the DAP and Datuk Seri Anwar’s Parti Keadilan Rakyat under the now-defunct Pakatan Rakyat umbrella.\nThat alliance jointly governed several states, including economic powerhouses Selangor and Penang.\nBack then, the PAS agenda of forming an “Islamic state” was set aside, with its leaders espousing a “welfare state” instead, presenting non-Muslims an alternative to the BN coalition.\nPAS has also tasted federal power as part of a loose alliance that governed Malaysia between 2018 and 2022, which included racially diverse coalitions from Sarawak and Sabah, and Malay party Umno.\nToday, the Islamist party and its partners in PN know that they must gain wider non-Muslim backing to come to power under their own steam, and then persuade the Gabungan Parti Sarawak and Gabungan Rakyat Sabah coalitions to join in to ensure a stable government.\nAnd the party needs to continue to work with its two allies, Malay-based Bersatu and Chinese-based Gerakan, analysts say.\n“PAS also needs to work with a party that has the support of the non-Muslims, such as the DAP,” said Mr Zulkifli Sulong, former editor of the Harakah newspaper published by PAS. He is now a member of Parti Amanah Negara, a party that broke away from PAS and is now part of Mr Anwar’s government.\nWhile PAS has not mentioned for years its stated objective of turning Malaysia into an “Islamic state”, the restrictions it imposed in the four states it rules are clear signs of its ultimate agenda.\nA worry for non-Muslims is that a PAS federal government would tighten more freedoms. It has often opposed concerts by foreign artistes and imposed rules on attire for Muslim women.\nAsian Studies professor James Chin from the University of Tasmania said the biggest issue for non-Muslims would be PAS’ aim of setting up an Islamic state with syariah laws.\n“The non-Malays do not want that. So because of that, it is not possible for PAS to ever win the non-Malay votes.”", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-s-pas-has-tough-task-to-woo-non-muslim-voters-analysts-say"}