{"authors": [], "date_download": "2024-10-12 14:08:45", "date_modify": "2024-10-12 14:08:45", "date_publish": "2023-03-09 22:54:24", "description": "There is disagreement over how much the bank owes Malaysia in relation to the 1MDB scandal. Read more at straitstimes.com.", "filename": "asia_se-asia_anwar-appoints-goldman-sachs-critic-to-lead-1mdb-taskforce_1728742125.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/10/svjohari090323_1.jpg?VersionId=nWt_u48hbF5deY.Sgl8LuJSToDNNezKm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_anwar-appoints-goldman-sachs-critic-to-lead-1mdb-taskforce_1728742125.html", "title": "Anwar appoints Goldman Sachs critic to lead 1MDB task force", "title_page": "Anwar appoints Goldman Sachs critic to lead 1MDB task force | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Malaysian Prime Minister Anwar Ibrahim appointed a vocal critic of Goldman Sachs Group to chair a task force formed to resolve matters linked to the multi-billion dollar 1Malaysia Development Berhad (1MDB) scandal.\nDatuk Seri Anwar told Parliament late on Thursday that he agreed with criticism that Mr Johari Abdul Ghani had raised on Malaysia’s settlement deal with Goldman Sachs on 1MDB.\nMr Johari said last week the government should review its deal with Goldman Sachs for its role in the scandal, as the final sum was too low.\n“I myself disagree with the past decisions, which were too light when the understanding was made,” said Mr Anwar, speaking at the tail-end of the policy stage of the 2023 budget debate. “Goldman Sachs profited off our hardship and pain.”\nGoldman Sachs and Mr Anwar’s government are currently in dispute over how much the US bank owes Malaysia for its role in raising US$6.5 billion (S$8.8 billion) in 2012 and 2013 for 1MDB.\nThe bonds were earmarked for redevelopment, but all except US$2 billion of the money was diverted to pay bribes to government officials, US federal prosecutors said.\nThe settlement announced by the previous government in July 2020 called for Goldman Sachs to pay US$2.5 billion while guaranteeing the return of US$1.4 billion of 1MDB assets seized by authorities around the world, in exchange for Malaysia dropping charges against the bank.\nMr Johari last week said the US$2.5 billion figure agreed upon was too little, and Goldman Sachs should be made to pay the US$1.4 billion sum outright.\nHe told Parliament the bank was including in its accounting of 1MDB assets settlement payments recovered from other institutions that had been involved in the case, such as AmBank, Deloitte PLT and KPMG.\n“Why should we sacrifice money that we can get from the number one investment bank in the world?” Mr Johari said on Feb 27, to thumps of approval from fellow lawmakers. “How can we allow Goldman Sachs just to run away like that when Goldman Sachs’ senior management was involved?”\nMr Johari was the second finance minister during jailed former premier Najib Razak’s administration at the height of the 1MDB scandal.\nHe lost his parliamentary seat in 2018 but won it back in November’s general election.\nMr Johari has since raised the Goldman Sachs issue in Parliament and in interviews with local media. BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/anwar-appoints-goldman-sachs-critic-to-lead-1mdb-taskforce"}