{"authors": [], "date_download": "2024-10-12 13:40:39", "date_modify": "2024-10-12 13:40:39", "date_publish": "2024-08-29 18:33:45", "description": "ANKARA - Turkey's foreign minister hopes to make progress on improving Ankara's rocky ties with the European Union on Thursday as he attends a meeting of EU ministers in Brussels for the first time in five years, a source from his ministry said. Read more at straitstimes.com.", "filename": "asia_turkeys-top-diplomat-attends-eu-meeting-after-5-years-in-bid-to-boost-ties_1728740439.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/LYNXMPEK7S0ED-1.jpg?VersionId=WbB9QwA6HY0u6g.6sJq8krYW7Rf4SxZB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_turkeys-top-diplomat-attends-eu-meeting-after-5-years-in-bid-to-boost-ties_1728740439.html", "title": "Turkey's top diplomat attends first EU meeting in 5 years in bid to boost ties", "title_page": "Turkey's top diplomat attends first EU meeting in 5 years in bid to boost ties | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANKARA - Turkey's foreign minister hopes to make progress on improving Ankara's rocky ties with the European Union on Thursday as he attends a meeting of EU ministers in Brussels for the first time in five years, a source from his ministry said.\nTurkey's two-decades-old bid to join the bloc has been frozen due to EU concerns over its human rights record alongside policy disputes in the eastern Mediterranean and over Cyprus.\nAt the same time, the bloc depends on NATO member Turkey's help, particularly on migration issues.\nTensions in 2019 between EU-member Greece and Turkey led to Brussels threatening sanctions against Ankara and cutting off some dialogue channels. Ties have improved since 2021, with high-level talks restarting.\nAnkara saw the EU's invitation to Foreign Minister Hakan Fidan as an effort to seek dialogue, the foreign ministry source said. Deeper ties \"with the understanding that Turkey is a candidate country\" would benefit both sides, the source added.\nFidan will convey Turkey's expectation that the \"necessary will must be shown and concrete steps must be taken\" to strengthen ties, the source said.\nThe meeting will include discussions on visas and modernising the EU-Turkey Customs Union, the source added. Ankara has been calling for these talks to start for months, but little progress had been made.\nFidan will meet EU foreign policy chief Josep Borrell and enlargement commissioner Oliver Varhely, the source said, adding that Fidan would reiterate Turkey's position on Cyprus.\nAnkara and its breakaway Turkish Cypriot allies on the island seek a two-state solution to the decades-old problem, but the EU, Greece and the internationally-recognised Greek Cypriot administration, an EU member, dismiss that proposal.\nAhead of the meetings, Cyprus Foreign Minister Constantinos Kombos said he looked forward to \"frank and open\" talks with Ankara on contentious issues and ways to move forward.\nGreece's Foreign Minister George Gerapetritis told Fidan in Brussels of the need to restart dialogue on Cyprus within the framework of U.N. Security Council resolutions, making use of the opportunity created by improving Turkish-Greek ties, a Greek foreign ministry official said.\nThe official cited Gerapetritis as saying that while Athens supports Turkey's European prospects, \"the sovereignty and sovereign rights of all member states, and the EU's Common Foreign and Security Policy should be respected.\" REUTERS", "url": "https://www.straitstimes.com/asia/turkeys-top-diplomat-attends-eu-meeting-after-5-years-in-bid-to-boost-ties"}