{"authors": [], "date_download": "2024-10-12 13:33:34", "date_modify": "2024-10-12 13:33:34", "date_publish": "2024-07-25 13:45:46", "description": "It was related to comments he made to a foreign media outlet about the state of the country's democracy. Read more at straitstimes.com.", "filename": "asia_cambodian-politician-fined-15-million-for-defamation-after-democracy-criticism_1728740014.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/25/ST-logo-placeholder_6.jpg?VersionId=EInaHNeXWpNOh8vTrXYqEuTPb6Hw9M82", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_cambodian-politician-fined-15-million-for-defamation-after-democracy-criticism_1728740014.html", "title": "Cambodian politician fined $2m for defamation over democracy criticism", "title_page": "Cambodian politician fined $2m for defamation over democracy criticism | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PHNOM PENH - A Cambodian court has found opposition politician Teav Vannol guilty of defamation and fined him US$1.5 million (S$2 million) in damages for comments he made to a foreign media outlet about the state of the country’s democracy, rights monitors said.\nIn an interview with the Nikkei this February, Vannol, the president of the Candlelight Party, said democracy in the South-east Asian nation had worsened under the administration of Mr Hun Manet.\nHe is the son of the country’s long-time leader Hun Sen, and assumed power in 2023.\nThe Candlelight Party was barred from participating in 2023’s general election that saw a landslide win for Mr Hun Manet’s ruling Cambodian People’s Party.\nThe court in Phnom Penh on July 25 found Vannol guilty of violating Article 305 on defamation and ordered him to pay 6 billion riel (S$1.96 million) in damages, rights group Licadho, and an independent rights monitor, told Reuters.\nBoth had representatives in the court.\nA spokesperson for the court and government could not immediately be reached. Vannol is currently out of the country, and his lawyer did not answer calls from Reuters.\nSuccessive Cambodian governments have repeatedly denied cracking down on opponents and say politicians and activists are prosecuted only if they have committed offences.\nConcerns about political freedom in Cambodia have continued to deepen.\nAnalysts say Mr Hun Sen’s rule was marked by the suppression of the opposition, shuttering of independent media and the jailing of activists.\n“As an opposition party president, Vannol gave comments critical of his political rival to journalists – how can that possibly be a crime?” said Licadho deputy director Naly Pilorge.\n“Any hope for democracy and political freedom relies on the ability of all citizens to freely voice their concerns and criticisms of the country’s political leaders.”\nMr Kim Pisith, a human rights monitor present in court, said the ruling sent a chilling message that anyone who criticised the government may face court, jail time and massive fines.", "url": "https://www.straitstimes.com/asia/cambodian-politician-fined-15-million-for-defamation-after-democracy-criticism"}