{"authors": [], "date_download": "2024-10-12 13:37:48", "date_modify": "2024-10-12 13:37:48", "date_publish": "2024-06-15 12:08:00", "description": "A detention period of up to 60 days is allowed for “complicated cases”. Read more at straitstimes.com.", "filename": "asia_east-asia_china-s-new-rules-allow-detention-of-foreigners-in-south-china-sea_1728740268.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/15/2024-05-18T041003Z805787222RC2BF6AG4MI5RTRMADP3SOUTHCHINASEA-PHILIPPINES-MARCOS.JPG?VersionId=u4ysMYvWPXGo3qyngrbYkBjZEmQ1EVbf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-s-new-rules-allow-detention-of-foreigners-in-south-china-sea_1728740268.html", "title": "China’s new rules allow detention of foreigners in South China Sea", "title_page": "China’s new rules allow detention of foreigners in South China Sea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI - New China Coast Guard rules which allow Beijing to detain foreigners for trespassing in the disputed South China Sea are taking effect on June 15.\nNeighbours and the Group of Seven (G-7) nations have accused Beijing of intimidation and coercion in the body of water, which China claims almost in its entirety. Beijing has brushed aside competing claims from several South-east Asian nations, including the Philippines, and an international ruling saying that its stance has no legal basis.\nChinese and Philippine vessels have had a series of confrontations in disputed areas, including around the Second Thomas Shoal, with Beijing accusing Manila of illegally grounding a navy vessel on the disputed reef.\nChina deploys coast guard and other boats to patrol the waters and has turned several reefs into militarised artificial islands.\nFrom June 15, the China Coast Guard can detain foreigners “suspected of violating management of border entry and exit”, according to the new regulations published online.\nUp to 60 days of detention is allowed in “complicated cases”, the regulations say.\n“Foreign ships that have illegally entered China’s territorial waters and the adjacent waters may be detained.”\nManila has accused the China Coast Guard of “barbaric and inhumane behaviour” against Philippine vessels, and President Ferdinand Marcos Jr in June called the new rules a “very worrisome” escalation.\nChina Coast Guard vessels have used water cannon against Philippine boats multiple times in the contested waters, where there have also been collisions that injured several Filipino troops.\nPhilippine military chief Romeo Brawner told reporters on June 14 that the authorities in Manila were “discussing a number of steps to be undertaken in order for us to protect our fishermen”.\nPhilippine fishermen were told “not to be afraid, but just to go ahead with their normal activities to fish there in our exclusive economic zone”, General Brawner said.\nThe G-7 bloc on June 14 criticised what it called “dangerous” incursions by China in the waterway.\n“We oppose China’s militarisation, and coercive and intimidation activities in the South China Sea,” read a G-7 statement at the end of a summit on June 14.\nG-7 criticism\nThe South China Sea is a vital waterway where Vietnam, Malaysia and Brunei also have overlapping claims in some parts.\nMost recently, however, confrontations between China and the Philippines have raised fears of a wider conflict over the sea that could involve the US and other allies.\nTrillions of dollars in ship-borne trade passes through the South China Sea annually, and huge unexploited oil and gas deposits are believed to lie under its seabed, though estimates vary greatly. It is also important as a source of fish for growing populations.\nChina has defended its new coast guard rules. A Foreign Ministry spokesman said in May they were intended to “better uphold order at sea”.\nThe Chinese Defence Minister warned in June that there were “limits” to Beijing’s restraint in the sea.\nChina has also been angered in the past by US and other Western warships sailing through the South China Sea. The US Navy and others undertake such voyages to assert freedom of navigation in international waters, but Beijing considers them violations of its sovereignty.\nChinese and US forces have had a series of close encounters in the South China Sea. AFP", "url": "https://www.straitstimes.com/asia/east-asia/china-s-new-rules-allow-detention-of-foreigners-in-south-china-sea"}