{"authors": ["Yip Wai Yee"], "date_download": "2024-10-12 13:43:06", "date_modify": "2024-10-12 13:43:06", "date_publish": "2024-09-18 21:05:00", "description": "Taiwan’s Ministry of Economic Affairs said it had no records of Gold Apollo pagers being shipped to Lebanon. Read more at straitstimes.com.", "filename": "asia_east-asia_the-product-wasn-t-ours-taiwan-tech-firm-denies-making-pagers-that-exploded-in-lebanon_1728740586.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/19/LEBANONPAGERSEXPLAINER.JPG?VersionId=UKjOY6psPT7KMdFOj45nuGV78DlPEQsz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_the-product-wasn-t-ours-taiwan-tech-firm-denies-making-pagers-that-exploded-in-lebanon_1728740586.html", "title": "‘The product wasn’t ours’: Taiwan tech firm says pagers that exploded were made in Hungary", "title_page": "‘The product wasn’t ours’: Taiwan tech firm says pagers that exploded were made in Hungary | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TAIPEI – Taiwanese tech company Gold Apollo has denied manufacturing the pagers used by Hezbollah members in Lebanon that exploded on Sept 17, after images revealed that its brand label was pasted on the backs of the detonated models.\n“The product was not ours. It was only that it had our brand on it,” Mr Hsu Ching-kuang, the company’s founder and president, told reporters on Sept 18 at the firm’s office, which is situated in a business park a 30-minute drive from the Taiwanese capital of Taipei.\nInstead, the company that manufactures wireless communication devices said in a statement that the pagers were produced and sold by BAC Consulting, based in Budapest, Hungary.\nBAC had the right to use Gold Apollo’s branding under a licensing agreement.\nBut BAC later told a US network that while it worked with Gold Apollo, it did not make pagers.\nMeanwhile, a Hungarian government spokesman said that BAC “is a trading intermediary, with no manufacturing or operational site in Hungary”.\nHe said the case “poses no national security risk” and added that Hungary was cooperating “with all relevant international partner agencies and organisations” in further investigations.\nIn Taiwan, the Ministry of Economic Affairs said it had no record of Gold Apollo pagers being shipped to Lebanon.\nThe company primarily exported its beepers to European and American markets, and there had been no reports of explosions related to those devices, the ministry added in a statement on Sept 18.\nOn Sept 17, pagers used by Iran-affiliated militant group Hezbollah exploded almost simultaneously across Lebanon after receiving a message, killing at least 12 people and wounding nearly 3,000, including Iran’s Ambassador to Lebanon Mojtaba Amani.\nSome of the detonations appeared to have been captured on CCTV, and footage has since been shared widely on social media.\nIt is unclear whether all of those carrying the explosive pagers were Hezbollah operatives, or if some of the devices had made their way into other parts of society.\nIn a statement on Sept 18, Hezbollah said there would be a “severe reckoning” over the widespread blasts, for which it blamed Israel. Israel has refused to comment on the allegation.\nIsraeli forces and Hezbollah, which is based in Lebanon, have been clashing in cross-border attacks for more than 11 months, displacing thousands of people in both countries against the backdrop of the war between Israel and Hamas in Gaza.\nQuestions have been raised over how the seemingly sophisticated remote attack was coordinated, as well as the cause of the blasts.\nSome security officials have theorised that a hack may have led to the pager batteries overheating and exploding, while others say that the supply chain may have been infiltrated, with the devices tampered with while in transit or at the production stage.\nThe New York Times, citing American and other officials briefed on the operation, reported that small amounts of explosives were planted in a new batch of pagers that Hezbollah had ordered, along with an embedded switch to trigger the detonation.\nProfessor Li Jung-shian, a communications engineering expert at Taiwan’s National Cheng Kung University, said the addition of explosive material sounded plausible.\n“Batteries can overheat and burst into flames, but that would not have the deadly power (seen in this incident),” he told The Straits Times.\nHezbollah operatives favour pagers to avoid being tracked and intercepted by what is believed to be Israeli electronic surveillance on Lebanon’s mobile networks.\nIn a speech in February, Hezbollah chief Hassan Nasrallah described the mobile phone as a “listening device” as well as a “deadly agent that provides specific and accurate information”.\nPagers are also more resilient in emergencies as they can send messages without an internet connection, which is why they are still used by doctors and emergency services worldwide.\nSeveral security sources told Reuters the pagers that exploded were the latest model acquired by Hezbollah in recent months.\nProfessor Chiang Yachi, a tech law expert at National Taiwan Ocean University, said the attack has shown that even seemingly outdated devices are not necessarily a low security risk.\n“We’re always focused on the security risks surrounding internet-connected devices, such as our mobile phones and laptops, but this shows that we may have to scrutinise low-tech products, too,” she said.\nProf Chiang also noted how the incident could serve as a warning to other manufacturers in Taiwan to pay more attention to their supply chains.\nThe island is one of the world’s leading producers of information and communications technology products.\n“The Taiwan tech industry used to think they are only doing business when they manufacture these products, that they have nothing to do with geopolitics. But that’s not true, so there needs to be a shift in mindset,” she said.\nBack at the Gold Apollo office in Taiwan, Mr Hsu told reporters that he felt victimised and that he planned to sue the licensee.\nHis company started working with BAC Consulting about three years ago, but he has never met the latter’s boss in person, communicating only via video calls, he said.\nBesides pagers, his firm, which was founded in 1995, also manufactures the buzzers used by eateries alerting diners that their orders are ready.\n“I’m just doing business, how did I get involved in this attack?” Mr Hsu wondered.", "url": "https://www.straitstimes.com/asia/east-asia/the-product-wasn-t-ours-taiwan-tech-firm-denies-making-pagers-that-exploded-in-lebanon"}