{"authors": ["Lok Jian Wen"], "date_download": "2024-10-12 13:50:14", "date_modify": "2024-10-12 13:50:14", "date_publish": "2024-05-18 00:37:47", "description": "He lived about 7km away from the police station where the cops were killed. Read more at straitstimes.com.", "filename": "asia_se-asia_man-who-killed-2-cops-in-ulu-tiram-lived-isolated-life-schooled-by-father-at-home_1728741014.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/18/FW1387015JB0917052024POLISTEMBAK28129.jpg?VersionId=x6mlzNYto7wBm9hNhXpsmbCOhEg2bqTR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_man-who-killed-2-cops-in-ulu-tiram-lived-isolated-life-schooled-by-father-at-home_1728741014.html", "title": "Man who allegedly killed 2 Ulu Tiram cops lived in closed-off commune, ‘schooled by father at home’", "title_page": "Man who allegedly killed 2 Ulu Tiram cops lived in closed-off commune, ‘schooled by father at home’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The man who allegedly killed two policemen and injured another at the Ulu Tiram police station in Johor early on May 17 lived with his family in an isolated settlement likely comprising 18 families, Malaysian media reported.\nChecks by local reporters found that his residence was situated within a gated area with a sign warning trespassers against entering “private property”.\nThe suspect, who has not been identified, lived in Kampung Sungai Tiram, about 7km from the police station where the two officers were killed at 2.45am.\nLocal reporters counted around 10 houses within the gated community, which is close to the Luqmanul Hakiem Islamic School that was previously known as the nerve centre of the Al-Qaeda-linked Jemaah Islamiyah (JI) in South-east Asia and the training ground for the militant group.\nLocal resident Fauzi Faizal, 39, said the suspect, who has four siblings, was believed to have been educated at home by his father, a JI member.\nMr Fauzi told Malaysia’s New Straits Times that the closed-off settlement has been around for 20 years and houses about 18 families. He added that the area was constantly monitored by the authorities.\n“I believe the siblings did not receive formal education and were taught by their father, possibly with extremist teachings,” said Mr Fauzi, who is also a member of the Johor Bahru City Council for Tiram.\n“Residents are indeed worried with the suspect living here, but we trust the police to ensure this incident does not happen again.”\nMr Shazrul Idham Aziz, village head of Kampung Ulu Tiram, which is close to the police station, said the incident had caused some worry to residents in the area.\n“This incident is particularly worrying for the residents, but I believe the police will take action and investigate to maintain the peace and harmony of the village,” he told local reporters.\nAfter the attack, in which the suspect was fatally shot by another policeman, local police officers arrested five of the man’s family members at their home.\nThey also discovered texts pasted on the walls linked to the JI group during the raid.\nInvestigations into the motive of the crime are currently ongoing.\nThe police have fortified at-risk locations in Johor including police stations and the palace, said Malaysia’s Inspector-General of Police.\nUlu Tiram, some 20km from Johor Bahru, has long been a familiar place for JI leaders and members.\nThe Luqmanul Hakiem Islamic School was established by JI’s Indonesian founder Abu Bakar Bashir and his compatriot Abdullah Sungkar, according to various reports. It enrolled students aged five to 17, many of whom were from Indonesia or Singapore, and whose parents sent them there for religious education.\nNoordin Mohammad Top, once known as Asia’s most wanted terrorist, attended the madrasah, as well as Ali Gufron, also known as “Mukhlas”, who was convicted of coordinating the 2002 Bali bombings that killed 202 people.\nLuqmanul Hakiem doubled as a meeting place for the group’s operatives, including Singapore JI leaders Mas Selamat Kastari and Ibrahim Maidin. Mas Selamat reportedly fled to the Ulu Tiram school in 2001 when the authorities in Singapore moved in on JI cells, and then again in 2008, after he fled from a detention centre, sparking a nationwide manhunt for him.\nIndonesian terrorist Hambali reportedly met his wife Noralwizah Lee Abdullah at the same madrasah. Also known as “Encep Nurjaman” and “Riduan Isamuddin”, he was a permanent resident in Malaysia and said to be a key Al-Qaeda leader in South-east Asia.\nAbdullah has since died. Mukhlas was executed in Indonesia in 2008 for his role in the Bali bombings, while Noordin was killed in a police raid on militants in central Java in 2009.\nIn 2011, Bashir was jailed for 15 years for supporting a militant training camp. He was released in January 2021.\nHambali is currently being held in the US naval base in Guantanamo Bay, Cuba.\nThe Ulu Tiram madrasah was shut down in the early 2000s.", "url": "https://www.straitstimes.com/asia/se-asia/man-who-killed-2-cops-in-ulu-tiram-lived-isolated-life-schooled-by-father-at-home"}