{"authors": [], "date_download": "2024-10-12 14:00:09", "date_modify": "2024-10-12 14:00:09", "date_publish": "2024-09-03 21:15:00", "description": "The stamps are expected to amplify the message of the pope’s visit: Faith, fraternity and compassion. Read more at straitstimes.com.", "filename": "asia_se-asia_indonesian-postal-service-launches-stamps-to-welcome-pope-to-jakarta_1728741609.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/INDONESIA-VATICAN-RELIGION-POPE-092210.jpg?VersionId=CWL9O.0ZCo9YoK0Qgz21GpSf7_lqFzu8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_indonesian-postal-service-launches-stamps-to-welcome-pope-to-jakarta_1728741609.html", "title": "Indonesian postal service launches stamps to welcome Pope to Jakarta", "title_page": "Indonesian postal service launches stamps to welcome Pope to Jakarta | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – State-owned postal service Pos Indonesia has unveiled a set of stamps to celebrate the much-awaited visit of Pope Francis to Jakarta.\nThe special collection has two designs with a white-and-gold theme featuring Pope Francis. It comes in two denominations of 3,500 rupiah (30 Singapore cents) and 40,000 rupiah.\nAttending the launch of the commemorative stamps on Sept 2 at the Jakarta Cathedral, Jakarta Archbishop Ignatius Suharyo said the stamps were expected to amplify the message of the pope’s visit – faith, fraternity and compassion.\n“I believe the theme is not only applicable for Indonesian Catholics, but also for the nation,” he said in a press statement from the Communications and Information Ministry, which governs postal management in Indonesia.\nPope Francis arrived in Jakarta on Sept 3 for a three-day visit devoted to interreligious ties, as part of his four-nation tour of the Asia-Pacific region.\nA set of 18 Rp 3,500 Pope Francis stamps is on sale at Rp 63,000 at filateli.co.id and several major post offices across Java, as well as in Pontianak, West Kalimantan, Pos Indonesia said on Sept 3 on Instagram.\nA special collector’s sheet of two commemorative Rp 40,000 stamps is also available for sale.\nIt marks the second time Pos Indonesia has dedicated a limited edition stamp to a visiting pontiff, after a commemorative stamp for Pope John Paul II when he visited the country in 1989.\nPope Francis is scheduled to meet outgoing President Joko “Jokowi” Widodo on Sept 4 and then to visit the Jakarta Cathedral to meet church members.\nFrancis is expected to bring a message of interfaith harmony during an interreligious meeting at Istiqlal Mosque on Sept 5. He then will lead a mass at the Gelora Bung Karno (GBK) Stadium, where around 70,000 are expected to attend.\nThe head of the Catholic Church will leave Jakarta on Sept 6 to travel onward to Papua New Guinea, Timor-Leste and Singapore on his two-week tour. THE JAKARTA POST/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/indonesian-postal-service-launches-stamps-to-welcome-pope-to-jakarta"}