{"authors": [], "date_download": "2024-10-12 14:08:14", "date_modify": "2024-10-12 14:08:14", "date_publish": "2023-10-06 02:38:46", "description": "Ng was convicted in the US of helping loot billions from 1MDB, faces similar charges in Malaysia. Read more at straitstimes.com.", "filename": "asia_se-asia_former-goldman-banker-roger-ng-to-be-returned-to-malaysia-in-1mdb-case_1728742094.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/06/2023-10-05T163117Z1438994537RC2FM3ACL88MRTRMADP3GOLDMAN-SACHS-1MDB-NG.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_former-goldman-banker-roger-ng-to-be-returned-to-malaysia-in-1mdb-case_1728742094.html", "title": "Former Goldman banker Roger Ng to be returned to Malaysia in 1MDB case", "title_page": "Former Goldman banker Roger Ng to be returned to Malaysia in 1MDB case | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Former Goldman Sachs banker Roger Ng, facing 10 years in prison after being convicted in New York of helping to loot billions of dollars from Malaysia’s 1Malaysia Development Berhad (1MDB) sovereign wealth fund, will be returned to that country, where he faces related charges.\nChief United States District Judge Margo Brodie in Brooklyn on Thursday ordered Ng’s surrender to the US Marshals Service by Friday so he could be turned over to Malaysian law enforcement authorities, who would transport him to their country.\nNg would be required upon returning to the US to begin his prison term, prosecutors said, in an earlier letter to Judge Brodie.\nNg’s lawyers agreed to the proposed schedule, the letter said. The lawyers did not immediately respond to requests for comment.\nNg’s surrender date had been delayed from Sept 6, after US prosecutors said they needed more time to communicate with Kuala Lumpur about first letting him stand trial there.\nA day earlier, Singapore’s central bank banned Ng, also known as Ng Chong Hwa, for life, saying his “severe misconduct” made it “contrary to public interest to allow him to carry on business as a representative”.\nThe case stemmed from about US$6.5 billion (S$8.9 billion) in bonds that Goldman helped 1MDB sell in 2012 and 2013. US prosecutors said officials, bankers and their associates embezzled about US$4.5 billion of that sum.\nNg is a Malaysian national and Goldman’s former head of investment banking in Malaysia.\nJudge Brodie sentenced Ng in March, 11 months after jurors found him guilty of helping former Goldman boss Tim Leissner embezzle money from 1MDB, launder the proceeds and bribe government officials to win business. Leissner’s much-delayed sentencing is now scheduled for March 19, 2024.\nJho Low, a Malaysian financier and the scheme’s suspected mastermind, was also indicted but remains at large.\nGoldman settled with the authorities in October 2020, agreeing to pay US$2.9 billion and having its Malaysian unit plead guilty to a corruption charge.\nNg had been arrested in Malaysia in November 2018, and agreed to be extradited to the US. REUTERS", "url": "https://www.straitstimes.com/asia/se-asia/former-goldman-banker-roger-ng-to-be-returned-to-malaysia-in-1mdb-case"}