{"authors": [], "date_download": "2024-10-12 14:08:52", "date_modify": "2024-10-12 14:08:52", "date_publish": "2023-04-05 13:40:02", "description": "More than 17 million birds have been killed nationwide this season. Read more at straitstimes.com.", "filename": "asia_east-asia_bird-flu-is-so-bad-that-japan-is-running-out-of-land-to-bury-chickens_1728742132.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/05/dw-chickens-japan-230405_0.JPG?VersionId=WYrW9DAQMKtahLqRWH.9VYYYbEAI1roX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_bird-flu-is-so-bad-that-japan-is-running-out-of-land-to-bury-chickens_1728742132.html", "title": "Bird flu is so bad that Japan is running out of land to bury chickens", "title_page": "Bird flu is so bad that Japan is running out of land to bury chickens | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan’s worst bird flu outbreak has decimated its poultry flocks and sent egg prices soaring.\nNow there is a lack of space to bury dead chickens as more than 17 million birds have been killed nationwide since the bird flu season started in October 2022.\nThe disposal of carcasses must be done properly to prevent the spread of the virus or contaminating water supplies.\nLocal governments and farmers say there is a shortage of suitable land to bury the chickens, national broadcaster NHK reported.\nJapan’s case highlights the need for countries to review how they deal with avian influenza, especially as record-breaking death tolls of birds due to the virus are becoming the norm around the world.\nWhile outbreaks have occurred mainly in Europe, the United States and Asia, the disease has spread further to South America in recent months, with Argentina, Uruguay and Bolivia reporting their first cases.\nThis is roiling global meat and egg supplies at a time of heightened inflation fears.\nThe outbreak in Japan has forced companie,s including McDonald’s and 7-Eleven, to suspend the sale of egg-related items or increase their prices.\nFarmers and the authorities usually have plans in place to manage wastes - including carcasses, manure and personal protective equipment - generated during a bird flu outbreak.\nBut the number of chickens to be disposed of has increased beyond their expectations, NHK said.\nSome regions with incineration facilities are burning the dead chickens. BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/bird-flu-is-so-bad-that-japan-is-running-out-of-land-to-bury-chickens"}