{"authors": [], "date_download": "2024-10-12 13:57:01", "date_modify": "2024-10-12 13:57:01", "date_publish": "2023-03-15 22:01:22", "description": "The number of Chinese mainland visitors jumped to more than 1.1 million, while that for non-mainland travellers rose from 220,000 to 350,000. Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-sees-over-1m-visitors-in-february-first-in-3-years_1728741421.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/15/HONGKONG-CHINA-TOURISM-071424_0.jpg?VersionId=CjL6dlPbspbgCpQzUlqd50EhnJ8llcZt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-sees-over-1m-visitors-in-february-first-in-3-years_1728741421.html", "title": "Hong Kong sees over 1m visitors in February, first in 3 years", "title_page": "Hong Kong sees over 1m visitors in February, first in 3 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Hong Kong saw 1.46 million visitors in February, exceeding the monthly one-million mark for the first time since February 2020, official data showed Wednesday.\nThe number of Chinese mainland visitors jumped to more than 1.1 million in February, up from 280,000 in January, according to data from the Hong Kong Tourism Board (HKTB).\nThe rebound comes after normal travel between Hong Kong and the Chinese mainland fully resumed on Feb 6.\nIn February, non-mainland travellers to Hong Kong rose from 220,000 to 350,000, with short-distance visits mainly made by people from South-east Asia, the data showed.\nThe HKTB said the MTR Corporation will give away 100,000 airport express tickets, 100,000 tourist day passes and 100,000 coupons each worth 30 yuan (S$5.87) for high-speed rail tickets to attract visitors to Hong Kong.\nThe number of stores participating in HKTB’s promotion activities will also be increased from about 1,500 at present to about 3,000 starting in April. XINHUA", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-sees-over-1m-visitors-in-february-first-in-3-years"}