{"authors": ["Ram Anand"], "date_download": "2024-10-12 14:05:22", "date_modify": "2024-10-12 14:05:22", "date_publish": "2020-07-28 11:15:57", "description": "Najib has said that he would file appeals up to the apex Federal Court if the verdict went against him.  Read more at straitstimes.com.", "filename": "asia_se-asia_ex-malaysian-pm-najib-found-guilty-on-one-count-of-abuse-of-power-in-1mdb-linked-graft_1728741922.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/07/28/hznajib0728.jpg?VersionId=bvihY0gczVdsOH3nJyt5QXZKDS5ATPEZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_ex-malaysian-pm-najib-found-guilty-on-one-count-of-abuse-of-power-in-1mdb-linked-graft_1728741922.html", "title": "Ex-Malaysian PM Najib gets 12 years' jail in 1MDB-linked graft trial", "title_page": "Ex-Malaysian PM Najib gets 12 years' jail in 1MDB-linked graft trial | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Malaysia's former premier Najib Razak was on Tuesday (July 28) sentenced to 12 years' jail and fined RM210 million (S$68.1 million) after being found guilty of all seven charges in the first of his five trials relating to the 1Malaysia Development Berhad (1MDB) scandal.\nHigh Court Judge Mohd Nazlan Mohd Ghazali found Najib, 67, guilty of one count of abuse of power, three counts of criminal breach of trust and three counts of money laundering regarding the misappropriation of RM42 million from SRC International, a former subsidiary of 1MDB.\n\"I find the accused guilty and convict him on all seven charges,\" said the judge.\nDuring sentencing Justice Mohd Nazlan meted out 12 years jail and a RM210 million fine for abuse of power. Najib was given 10 years jail for each of the three counts of criminal breach of trust. He also received 10 years jail for each of the three money-laundering charges.\nThe judge ruled that the sentences would run concurrently, which means Najib is required to serve up to 12 years in prison.\nHe remains free as he was granted a stay of execution of the sentence pending appeal. He has to post RM1 million bail on Wednesday and is required to report to the police twice a month.\nNajib had said that he would file an appeal with the apex Federal Court if the verdict went against him.\nNajib, who spoke in court during the mitigation hearing, maintained his innocence and denied any wrongdoing. \"I did not demand for the RM42 million, I did not plan for it, it was never offered to me. No evidence to say so,\" he said.\nAfter the hearing he told reporters he was not satisfied with the decision but would appeal. \"It's not the end of the world because there's the process of appeal and we hope we will be successful then,\" he said.\nNajib had arrived in court slightly before 10am to shouts of \"long live Najib\" by hundreds of supporters who had gathered outside.\nVeteran actor Sulaiman Yassin said he was disappointed with the verdict. \"This is nothing but a political decision. I feel that he (Najib) was sabotaged in an unfair political game,\" he told The Star.\n\"This is my chance to clear my name,\" Najib had said in a Facebook post on Monday night. \"Whatever the decision tomorrow at the High Court, it does not end here,\" he said, adding that both sides would appeal any decision at the Federal Court.\nNajib's conviction appears to confirm Prime Minister Muhyiddin Yassin's commitment to \"not interfere\" in graft cases against prominent Umno politicians like Najib, even though they are his allies in the five-month old Perikatan Nasional (PN) government.\nDozens of these corruption charges were instituted under the former ruling coalition Pakatan Harapan (PH) after its shock win against Umno in the May 2018 general election.\nConcerns about political interference in the court process were raised after money laundering charges against Najib's stepson, Mr Riza Aziz, relating to 1MDB funds were dropped in May, in a settlement reached with prosecutors.\nThe opposition PH hailed Tuesday's verdict as a \"huge victory for the people of Malaysia\". It said the judicial process for the case would not have begun if the people had not delivered an election victory to PH in May 2018.", "url": "https://www.straitstimes.com/asia/se-asia/ex-malaysian-pm-najib-found-guilty-on-one-count-of-abuse-of-power-in-1mdb-linked-graft"}