{"authors": [], "date_download": "2024-10-12 14:03:09", "date_modify": "2024-10-12 14:03:09", "date_publish": "2023-05-07 11:45:00", "description": "His bilateral visit is the first by a Japanese leader to Seoul in 12 years. Read more at straitstimes.com.", "filename": "asia_japan-pm-kishida-visits-seoul-to-forge-closer-ties-amid-nkorea-threats_1728741789.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/07/2023-05-07T040246Z237996617RC2FT0AD2IRHRTRMADP3SOUTHKOREA-JAPAN_3.JPG?VersionId=Yq1QRdt.wjA8Q59_9R7eskJNhIVHS79M", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_japan-pm-kishida-visits-seoul-to-forge-closer-ties-amid-nkorea-threats_1728741789.html", "title": "Japan’s PM tells South Koreans his ‘heart hurts’ over pain caused by occupation", "title_page": "Japan’s PM tells South Koreans his ‘heart hurts’ over pain caused by occupation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – Japanese Prime Minister Fumio Kishida told South Koreans on Sunday that his heart hurts when he thinks of the suffering and pain during Japanese colonial rule, in a nod to historical disputes that have soured relations between the two US allies.\nMr Kishida was in Seoul for the first visit to the South Korean capital by a Japanese leader in 12 years, returning the trip South Korean President Yoon Suk-yeol made to Tokyo in March, where they sought to close a chapter on the historical disputes that have dominated Japan-South Korea relations for decades.\nSpeaking to reporters at a briefing after his summit with Mr Yoon, Mr Kishida stopped short of offering a new official apology for wrongs committed under the 1910-1945 occupation, but said his government inherits the stance of earlier administrations, some of which have issued apologies.\n“For me personally, my heart hurts when I think of the many people who endured terrible suffering and grief under the difficult circumstances of the time,” he said, without elaborating.\nMr Yoon said unresolved historical issues should not mean that no forward steps can be taken to deepen ties in the face of growing international crises, and that he wants to make relations better than ever.\nA senior official at Mr Yoon’s office said Mr Kishida’s remarks had not been arranged in advance, and Mr Yoon thanked him for “showing his sincere position even though there was no such request”, and said it would be “greatly helpful for future cooperation”.\nThe pledge by the leaders to boost cooperation has been welcomed by the United States as a way to better confront threats from North Korea and competition from China.\n“Cooperation and coordination between South Korea and Japan are essential not only for the common interests of the two countries, but also for world peace and prosperity in the face of the current severe international situation,” Mr Yoon said in opening remarks at their meeting.\nHistorical disputes\nThe historical differences between South Korea and Japan threaten to cast a shadow over the blossoming ties between its two leaders.\nUnder Mr Yoon’s and Mr Kishida’s predecessors, ties between South Korea and Japan plunged to their lowest in decades. Koreans accuse Japan of forcing women to work in wartime brothels for the Japanese military and using forced labour, among other abuses.\nAfter South Korean courts ordered Japanese companies to pay compensation in the forced labour cases in 2018, Japan restricted exports of high-tech material to South Korea, and Seoul threatened to pull out of a military intelligence-sharing deal with Tokyo.\nMr Yoon is facing criticism at home that he has given more than he has received in his efforts to improve ties with Japan, including by proposing that South Korean businesses – not the Japanese companies as ordered by a court – compensate victims of wartime labour. Polls show many South Koreans do not believe Japan has done enough to atone and apologise.\nMr Yoon has signalled that he does not believe Japan needs to “kneel” any more over what happened in the past, but South Korean officials were hoping that Mr Kishida would make a gesture.\n“I was moved by the many people who opened their hearts for the future without forgetting the painful memories of the past,” Mr Kishida said of Mr Yoon’s proposal.\nOn Sunday, small gatherings of about 50 people demonstrated in opposition to, and support of, Mr Kishida’s visit, but his presence did not spark widespread protests.\nDespite the lack of a new apology, Mr Kishida’s reaffirmation of reconciliation and the summit symbolism has value for the countries’ relations, said Dr Leif-Eric Easley, a professor at Ewha University in Seoul.\n“Publics will be reassured that Korean and Japanese flags fly side by side, national anthems play together, and leaders host each other at friendly dinners with their spouses,” he said.\nSecurity, economic cooperation\nThe focus of the summit between the two US allies revolved around security cooperation in the face of North Korea’s nuclear threats, with a particular eye on American interests in the region, said Dr Shin-wha Lee, a professor of international relations at Seoul-based Korea University.\n“Their military and economic capabilities are crucial for promoting multilateral regional security cooperation, and a poor relationship between the two countries could obstruct US objectives,” she said.\nMr Kishida said they discussed bilateral ties as well as regional and global issues such as North Korea. He said he had agreed to allow South Korean experts to inspect the planned release of water from the crippled Fukushima nuclear power plant, which has been controversial with Japan’s neighbours concerned about possible environmental effects.\nHe has invited Mr Yoon to the Group-of-Seven summit set for later this month in Japan and for trilateral talks with the US on the sidelines.\nWhile Mr Yoon and Mr Kishida did not mention points of friction with China at their joint press conference, they did speak about shared values for human rights, rule of law, and a free and open Indo-Pacific, Dr Easley said.\n“This suggests that Seoul and Tokyo are increasingly on the same page about strengthening supply chain security, resisting economic coercion, and deterring unilateral uses of force in Asia,” he said. REUTERS", "url": "https://www.straitstimes.com/asia/japan-pm-kishida-visits-seoul-to-forge-closer-ties-amid-nkorea-threats"}