{"authors": [], "date_download": "2024-10-12 13:39:31", "date_modify": "2024-10-12 13:39:31", "date_publish": "2024-09-12 13:13:21", "description": "Mr Sergei Karaganov's statements are closely watched by Western security experts as an indicator of Russian thinking. Read more at straitstimes.com.", "filename": "asia_russian-hawk-pushes-case-for-putin-to-toughen-policy-on-nuclear-weapons_1728740371.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/LYNXMPEK8B063-1.jpg?VersionId=prA6kGBdfJFrYNamHvgsbgYVcZArJFRo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_russian-hawk-pushes-case-for-putin-to-toughen-policy-on-nuclear-weapons_1728740371.html", "title": "Russian hawk pushes case for Putin to toughen policy on using nuclear weapons", "title_page": "Russian hawk pushes case for Putin to toughen policy on using nuclear weapons | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Russia should clearly state its willingness to use nuclear weapons against countries that “support Nato aggression in Ukraine”, according to an influential foreign policy hawk who is pressing President Vladimir Putin to adopt a more assertive nuclear posture towards the West.\nMr Sergei Karaganov told Kommersant newspaper in an interview that Moscow could launch a limited nuclear strike on a Nato country without triggering all-out nuclear war.\nThe United States, he added, was lying when it said that it guaranteed nuclear protection to its allies.\nThe main goal of Russia’s nuclear doctrine, Mr Karaganov said, “should be to ensure that all current and future enemies are sure that Russia is ready to use nuclear weapons”.\nIn comments published weeks after Ukraine captured a part of Russia’s Kursk region, from which Moscow’s forces are still fighting to eject it, he said: “It is time to declare that we have the right to respond to any massive strikes on our territory with a nuclear strike. This also applies to any seizure of our territory.”\nMr Karaganov’s statements are closely watched by Western security experts as an indicator of Russian thinking on foreign, defence and nuclear policy.\nHis opinions do not represent official policy but the Kremlin has given him repeated opportunities to voice them in influential forums and put them directly to Mr Putin.\nFor more than a year, he was the most prominent figure calling for changes to Russia’s nuclear doctrine, which Moscow has now said it will revise.\nThe current doctrine states that Russia would be prepared to use nuclear weapons in response to a nuclear attack by another country or a conventional attack that threatened the existence of the state.\nBut that doctrine was irresponsible and even suicidal, Mr Karaganov said, because it did not adequately deter Russia’s enemies and led them to believe there were hardly any circumstances in which Moscow would use a nuclear weapon.\nRussia was heading for disaster unless it succeeded in shifting that assumption and re-establishing deterrence, he said.\nTwo-and-a-half years into its war with Ukraine, it risked bleeding itself dry on the battlefield and exhausting itself economically, something that could lead to “decline and possibly even collapse”.\nInfluential voice\nMr Karaganov had called in the past for Russia to consider a pre-emptive nuclear strike to “sober up” its enemies.\nSince the start of the war in Ukraine, Mr Putin has issued repeated statements that the West has interpreted as nuclear threats. But he has also said Russia can win the war without resorting to nuclear weapons.\nSome analysts in the West say Mr Karaganov performs a useful function for the Kremlin by voicing views that stir alarm in the West while making Mr Putin appear calm and moderate by comparison.\nIn the interview, Kommersant journalist Elena Chernenko asked Mr Karaganov how he could be sure that the policy he was advocating would not lead to all-out nuclear war.\n“The assertion that any limited use of nuclear weapons will necessarily lead to a general nuclear Armageddon does not stand up to criticism,” he said.\n“I assure you that all nuclear powers have plans for the calibrated use of nuclear weapons under certain scenarios.”\nMr Karaganov added: “I am not calling for a dangerous path, I am calling for saving the world and Russia. Either we win this war, or we fall apart.\n“The West can fight endlessly, this war is very beneficial to it. And I am not calling for a nuclear war at all, I would very much like not to bring things to this, but to stop before having to make a terrible choice.” REUTERS", "url": "https://www.straitstimes.com/asia/russian-hawk-pushes-case-for-putin-to-toughen-policy-on-nuclear-weapons"}