{"authors": [], "date_download": "2024-10-12 13:38:55", "date_modify": "2024-10-12 13:38:55", "date_publish": "2024-05-15 20:13:21", "description": "JERUSALEM - Prime Minister Benjamin Netanyahu put forward a new conscription law proposal on Wednesday, one day before a deadline from Israel's top court, which has been pressing for resolution of a stalemate over the exemption from military service of ultra-Orthodox Jews. Read more at straitstimes.com.", "filename": "asia_israeli-pm-presses-bill-on-drafting-ultra-orthodox-jews-into-military_1728740335.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/16/LYNXMPEK4E0IY-2.jpg?VersionId=rZMIyGI2sTvdRIjuQaZ23cmRPj_Bkq4U", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_israeli-pm-presses-bill-on-drafting-ultra-orthodox-jews-into-military_1728740335.html", "title": "Israeli PM presses Bill on drafting ultra-Orthodox Jews into military", "title_page": "Israeli PM presses Bill on drafting ultra-Orthodox Jews into military | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - Prime Minister Benjamin Netanyahu put forward a new conscription law proposal on May 15, one day before a deadline from Israel's top court, which has been pressing for resolution of a stalemate over the exemption from military service of ultra-Orthodox Jews.\nEarlier in May, the Supreme Court gave Mr Netanyahu's ruling coalition until May 16, to come up with a new conscription plan to address festering anger among a majority of citizens at the exemptions granted to ultra-Orthodox Jews.\nThe conscription issue is especially fraught for Mr Netanyahu in 2024, with the country embroiled in an open-ended war in Gaza that has exacted the worst Israeli casualties - mostly among teenaged draftees and reservists - in decades.\nMoreover, his coalition includes two ultra-Orthodox parties for whom military exemptions are paramount, and who have in the past threatened to quit the government if the conscription law goes ahead.\nUltra-Orthodox Jews, who make up around 13 per cent of Israel's 10 million population, see conscription waivers as key to keeping members of their community away from a melting-pot military that might test their conservative values and their faith.\nThe proposed Bill put forward on May 15 would gradually increase national service recruitment among the ultra-Orthodox. It is based on a Bill put forward under the previous government by Benny Gantz, a centrist former army chief, who joined Mr Netanyahu's government early in the war as a gesture of national unity.\nHowever, Mr Gantz, seen as a likely candidate to replace Mr Netanyahu as prime minister, dismissed the Bill, passed in preliminary reading by a previous parliament, which he said was insufficient to meet Israel's current wartime needs.\n\"Israel needs soldiers, not political manoeuvres. The law agreed upon in the previous government is not relevant in the post Oct 7 reality,\" he said, in a tweet on social media platform X.\nThe stand-off underlines the deep divisions between former army commanders like Mr Gantz and his ally Gadi Eisenkot, who want to ease the personnel problems of Israel's military, and the Orthodox and national religious parties in the coalition that want to maintain the prized exemptions.\nMr Netanyahu's office said the prime minister is seeking to bridge societal and political divides and is calling on all parties that had supported the proposed conscription law in the previous parliament to back it once more.\nDefence Minister Yoav Gallant said he would support any conscription law that was supported by all the other parties in the coalition but would not support any unilateral moves to impose a law by any of the parties.\nEconomists argue that the conscription waiver keeps some of the ultra-Orthodox community unnecessarily out of the workforce, spelling a growing welfare burden for largely secular, middle-class taxpayers.\nIsrael's 21 per cent Arab minority is also largely exempted from the draft, under which men and women are generally called up at the age of 18, with men serving 32 months and women 24 months. REUTERS", "url": "https://www.straitstimes.com/asia/israeli-pm-presses-bill-on-drafting-ultra-orthodox-jews-into-military"}