{"authors": [], "date_download": "2024-10-12 13:46:12", "date_modify": "2024-10-12 13:46:12", "date_publish": "2020-03-24 13:10:16", "description": "As global deaths from the virus surge past 15,000, officials and experts worldwide are scrutinising South Korea for lessons. Read more at straitstimes.com.", "filename": "asia_east-asia_coronavirus-how-south-korea-flattened-the-curve_1728740772.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/03/24/nz_dongsanhosp_240384.jpg?VersionId=kmi6U2ohLriZlvd.Oc5ebbc6IJfD7WNI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_coronavirus-how-south-korea-flattened-the-curve_1728740772.html", "title": "Coronavirus: How South Korea flattened the curve", "title_page": "Coronavirus: How South Korea flattened the curve | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL (NYTIMES) - No matter how you look at the numbers, one country stands out from the rest: South Korea.\nIn late February and early March, the number of new coronavirus infections in the country exploded from a few dozen, to a few hundred, to several thousand.\nAt the peak, medical workers identified 909 new cases in a single day, Feb 29, and the country of 50 million people appeared on the verge of being overwhelmed. But less than a week later, the number of new cases halved. Within four days, it halved again - and again the next day.\nOn Sunday (March 22), South Korea reported only 64 new cases, the fewest in nearly a month, even as infections in other countries continue to soar by the thousands daily, devastating healthcare systems and economies. Italy records several hundred deaths daily; South Korea has not had more than eight in a day.\nSouth Korea is one of only two countries with large outbreaks, alongside China, to flatten the curve of new infections. And it has done so without China's draconian restrictions on speech and movement, or economically damaging lockdowns like those in Europe and the United States.\nAs global deaths from the virus surge past 15,000, officials and experts worldwide are scrutinising South Korea for lessons. And those lessons, while hardly easy, appear relatively straightforward and affordable: swift action, widespread testing and contact tracing, and critical support from citizens.\nYet other hard-hit nations did not follow South Korea's lead. Some have began to show interest in emulating its methods - but only after the epidemic had accelerated to the point that they may not be able to control it any time soon.\nPresident Emmanuel Macron of France and Prime Minister Stefan Löfven of Sweden have both called South Korea's president, Moon Jae-in, to request details on the country's measures, according to Mr Moon's office.\nThe head of the World Health Organisation, Tedros Adhanom Ghebreyesus, has hailed South Korea as demonstrating that containing the virus, while difficult, \"can be done\". He urged countries to \"apply the lessons learnt in Korea and elsewhere\".\nSouth Korean officials caution that their successes are tentative. A risk of resurgence remains, particularly as epidemics continue raging beyond the country's borders.\nStill, Scott Gottlieb, a former commissioner of the Food and Drug Administration, has repeatedly raised South Korea as a model, writing on Twitter, \"South Korea is showing Covid-19 can be beat with smart, aggressive public health\".\nLESSON 1: INTERVENE FAST, BEFORE IT'S A CRISIS\nJust one week after the country's first case was diagnosed in late January, government officials met with representatives from several medical companies. They urged the companies to begin immediately developing coronavirus test kits for mass production, promising emergency approval.\nWithin two weeks, though South Korea's confirmed cases remained in the double digits, thousands of test kits were shipping daily. The country now produces 100,000 kits per day, and officials say they are in talks with 17 foreign governments about exporting them.\nOfficials also swiftly imposed emergency measures in Daegu, a city of 2.5 million where contagion spread fast through a local church.\n\"South Korea could deal with this without limiting the movement of people because we knew the main source of infection, the church congregation, pretty early on,\" said Ki Mo-ran, an epidemiologist advising the government's coronavirus response.\n\"If we learnt about it later than we did, things could have been far worse.\"\nSouth Koreans, unlike Europeans and Americans, were also primed to treat the coronavirus as a national emergency, after a 2015 outbreak of Middle East respiratory syndrome in the country killed 38.\nThe coronavirus is thought to have a five-day incubation period, often followed by a period of mild symptoms that could be mistaken for a cold, when the virus is highly communicable. This pattern creates a lag of a week or two before an outbreak becomes apparent. What looks like a handful of cases can be hundreds; what looks like hundreds can be thousands.\n\"Such characteristics of the virus render the traditional response, which emphasises lockdown and isolation, ineffective,\" said Kim Gang-lip, South Korea's vice-health minister. \"Once it arrives, the old way is not effective in stopping the disease from spreading.\"\nLESSON 2: TEST EARLY, OFTEN AND SAFELY\nSouth Korea has tested far more people for the coronavirus than any other country, enabling it to isolate and treat many people soon after they are infected.\nThe country has conducted over 300,000 tests, for a per capita rate more than 40 times that of the US.\n\"Testing is central because that leads to early detection, it minimises further spread and it quickly treats those found with the virus,\" Kang Kyung-wha, South Korea's foreign minister, told the BBC, calling the tests \"the key behind our very low fatality rate as well\".\nThough South Korea is sometimes portrayed as having averted an epidemic, thousands of people were infected and the government was initially accused of complacency. Its approach to testing was designed to turn back an outbreak already underway.\nTo spare hospitals and clinics from being overwhelmed, officials opened 600 testing centres designed to screen as many people as possible, as quickly as possible - and keep health workers safe by minimising contact.\nAt 50 drive-thru stations, patients are tested without leaving their cars. They are given a questionnaire, a remote temperature scan and a throat swab. The process takes about 10 minutes. Test results are usually back within hours.\nAt some walk-in centres, patients enter a chamber resembling a transparent phone booth. Health workers administer throat swabs using thick rubber gloves built into the chamber's walls.\nRelentless public messaging urges South Koreans to seek testing if they or someone they know develop symptoms. Visitors from abroad are required to download a smartphone app that guides them through self-checks for symptoms.\nOffices, hotels and other large buildings often use thermal image cameras to identify people with fevers. Many restaurants check customers' temperatures before accepting them.\nLESSON 3: CONTACT TRACING, ISOLATION AND SURVEILLANCE\nWhen someone tests positive, health workers retrace the patient's recent movements to find, test - and, if necessary, isolate - anyone the person may have had contact with, a process known as contact tracing.\nThis allows health workers to identify networks of possible transmission early, carving the virus out of society like a surgeon removing a cancer.\nSouth Korea developed tools and practices for aggressive contact tracing during the Mers outbreak. Health officials would retrace patients' movements using security camera footage, credit card records, even GPS data from their cars and cellphones.\n\"We did our epidemiological investigations like police detectives,\" Ki said. \"Later, we had laws revised to prioritise social security over individual privacy at times of infectious disease crises.\"\nAs the coronavirus outbreak grew too big to track patients so intensively, officials relied more on mass messaging.\nSouth Koreans' cellphones vibrate with emergency alerts whenever new cases are discovered in their districts. Websites and smartphone apps detail hour-by-hour, sometimes minute-by-minute, timelines of infected people's travel - which buses they took, when and where they got on and off, even whether they were wearing masks.\nPeople who believe they may have crossed paths with a patient are urged to report to testing centres.\nSouth Koreans have broadly accepted the loss of privacy as a necessary trade-off.\nPeople ordered into self-quarantine must download another app, which alerts officials if a patient ventures out of isolation. Fines for violations can reach US$2,500 (S$3,600).\nBy identifying and treating infections early, and segregating mild cases to special centres, South Korea has kept hospitals clear for the most serious patients. Its case fatality rate is just over 1 per cent, among the lowest in the world.\nLESSON 4: ENLIST THE PUBLIC'S HELP\nThere aren't enough health workers or body-temperature scanners to track everybody, so everyday people must pitch in.\nLeaders concluded that subduing the outbreak required keeping citizens fully informed and asking for their cooperation, said Kim, the vice health minister.\nTelevision broadcasts, subway station announcements and smartphone alerts provide endless reminders to wear face masks, pointers on social distancing and the day's transmission data.\nThe messaging instills a near-wartime sense of common purpose. Polls show majority approval for the government's efforts, with confidence high, panic low and scant hoarding.", "url": "https://www.straitstimes.com/asia/east-asia/coronavirus-how-south-korea-flattened-the-curve"}