{"authors": [], "date_download": "2024-10-12 13:55:11", "date_modify": "2024-10-12 13:55:11", "date_publish": "2024-03-05 09:20:39", "description": "The measures come after China's population fell for a second consecutive year in 2023. Read more at straitstimes.com.", "filename": "asia_china-to-improve-childbirth-policies-boost-support-for-elderly_1728741311.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/05/LYNXNPEK2401N-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-to-improve-childbirth-policies-boost-support-for-elderly_1728741311.html", "title": "China to improve childbirth policies and boost support for elderly", "title_page": "China to improve childbirth policies and boost support for elderly | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - China will improve policies supporting childbirth, two official government reports said on March 5, which also detailed plans to support a growing elderly population by raising benefits and basic pensions and pushing forward a private pension system.\nThe measures come after China's population fell for a second consecutive year in 2023, with new births dropping to about half of those in 2016, while marriages hit a record low in 2022.\nChina will “work towards a birth-friendly society and promote long term, balanced population development” and develop “public interest childcare” to reduce the cost of childbirth, parenting and education, said a report released by the country’s state planner.\nThe country will improve policies to boost birth rates by “refining parental leave policies, improving the mechanism for sharing the related labour costs of employers and increasing the supply of childcare services”, according to a separate work report from Premier Li Qiang, also released on March 5.\nMuch of China’s demographic downturn is the result of its one-child policy imposed between 1980 and 2015. Couples have been allowed to have up to three children since 2021.\nHowever, a rising number of women are opting to not have children, put off by the high cost of childcare or an unwillingness to marry or put their careers on hold, while gender discrimination persists.\nThe authorities have tried to roll out incentives and measures to boost baby making, including expanding maternity leave, financial and tax benefits for having children, as well as housing subsidies.\nBut China is one of the world’s most expensive places to bring up a child, relative to its gross domestic product per capita, a prominent Chinese think-tank said in February, as it detailed the time and opportunity cost for women who give birth.\nPopulation ageing\nChina will pursue a “proactive national strategy in response to population ageing”, the reports said.\nThe minimum basic old-age benefits for rural and non-working urban residents will be raised by 20 yuan (S$3.80) per month, while basic pensions for retirees would continue to increase.\nA private pension system will also be implemented nationwide, and the authorities will encourage the development of “third-pillar pension plans”, outside the first two pillars, which are the basic state pension system and an employee pension plan.\nIn the coming decade, about 300 million people currently aged from 50 to 60 – China’s largest demographic group, equivalent to almost the entire US population – are set to leave the workforce at a time when pension budgets are already stretched.\nChina’s retirement age is among the lowest in the world, with 60 for men, 55 for white-collar women and 50 for women who work in factories. For men, it is five to six years below most developed economies.\nDemographers and economists say that the current pension system, which relies on a shrinking active workforce to pay the pensions of a growing number of retirees, is unsustainable and needs to be reformed.\nThe reports said that more products and services for senior citizens will be provided and a further push will be made to “develop the silver economy”.\nChina will build a system for providing elderly care services at home and develop a health system for the elderly, as well as redoubling efforts to strengthen elderly care services in rural areas. REUTERS", "url": "https://www.straitstimes.com/asia/china-to-improve-childbirth-policies-boost-support-for-elderly"}