{"authors": [], "date_download": "2024-10-12 14:12:16", "date_modify": "2024-10-12 14:12:16", "date_publish": "2023-10-07 16:34:56", "description": "The party has accused him of illegal activities and taking bribes. Read more at straitstimes.com.", "filename": "asia_china-expels-former-bank-of-china-chairman-from-communist-party_1728742336.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/07/10895204.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-expels-former-bank-of-china-chairman-from-communist-party_1728742336.html", "title": "China expels former Bank of China chairman Liu Liange from Communist Party", "title_page": "China expels former Bank of China chairman Liu Liange from Communist Party | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI - China’s ruling Communist Party has expelled the former chairman of the state-owned Bank of China from the party, accusing him of illegal activities and taking bribes, the top anti-graft watchdog said on Saturday.\nLiu Liange was accused of illegally granting loans and causing significant financial risks, the Central Commission for Discipline Inspection (CCDI) said in a statement on its website.\nHe also brought prohibited publications into the country and illegally took bribes and accepted entertainment at private clubs and ski resorts, said the commission, which is responsible for tackling corruption in the 97 million-member party.\nReuters was not immediately able to contact Liu to seek comment.\nLiu, born in 1961, had been working in banking and finance institutions, including in the central People's Bank of China and the Export-Import Bank of China, before he was promoted to become chairman of the Bank of China in 2019.\nHe resigned from that position in mid-March this year.\nTwo weeks later, state media reported that the CCDI had opened an investigation into him on suspicion of serious violations of party discipline and laws.\nFighting corruption to advance the party's \"self-revolution\" has been a signature policy of President Xi Jinping since he became supreme leader in 2012.\nMr Xi's campaign against corruption is popular among a public fed up with widespread graft. It has also helped him consolidate power by replacing rivals with loyalists, analysts have said. REUTERS", "url": "https://www.straitstimes.com/asia/china-expels-former-bank-of-china-chairman-from-communist-party"}