{"authors": [], "date_download": "2024-10-12 13:36:23", "date_modify": "2024-10-12 13:36:23", "date_publish": "2023-01-30 14:48:07", "description": "The military acknowledged the assault and harrassment of Ms Rina Gonoi, but lawyers for the assailants have continued to trivialise the incidents during settlement discussions, she said. Read more at straitstimes.com.", "filename": "asia_japanese-ex-soldier-to-sue-government-over-sexual-assault_1728740183.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/30/JAPAN-MILITARY-ASSAULT-GENDER-WOMEN-055926_4.jpg?VersionId=JjIJ0H3Wef5KA.cEcctJPJUQxGOzIqg.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_japanese-ex-soldier-to-sue-government-over-sexual-assault_1728740183.html", "title": "Japanese ex-soldier to sue government over sexual assault", "title_page": "Japanese ex-soldier to sue government over sexual assault | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - A Japanese former soldier who was sexually assaulted by her colleagues said on Monday she is suing the government and the perpetrators over the “superficial” apologies and mistreatment she received.\nLast year, Ms Rina Gonoi went public about the assaults she was subjected to, after an investigation was dropped on the grounds of insufficient evidence.\nThe military subsequently acknowledged the assaults and harassment that occurred in 2021, but only after public pressure by Ms Gonoi, including a petition signed by over 100,000 people demanding an investigation.\nLast December, five Japanese soldiers were dismissed over the case, but Ms Gonoi said Monday the apologies she has received were “superficial” and lawyers for the assailants continued to trivialise the incidents in discussions over a settlement.\n“I didn’t want to choose the option of fighting, but I have not received a message that reassures me they really regret what they did,” she told reporters.\n“Given the differences over the issue between their side and me, I think it’s necessary to open things up (to the public through the lawsuit), which I think will help prevent a repeat,” she added.\nMs Gonoi is seeking a total of 7.5 million yen (S$76,000) – 5.5 million from her attackers for mental distress, and two million from the government for failing to prevent the assaults and properly investigate them.\nHer case is also being re-investigated by prosecutors who are weighing possible criminal charges after she lodged a complaint about the failure to indict the men involved, her lawyers said on Monday.\nThe army acknowledged its probe found that Ms Gonoi routinely faced sexual harassment and assault at her unit and during training sessions.\nWhile Japan may rank high on education and healthcare for women, its male-dominated society has long lagged behind industrial peers in placing women in boardrooms and in high public office.\nGovernment data shows just 4 per cent of rape victims report the crime to police. AFP", "url": "https://www.straitstimes.com/asia/japanese-ex-soldier-to-sue-government-over-sexual-assault"}