{"authors": ["Zunaira Saieed"], "date_download": "2024-10-12 14:21:40", "date_modify": "2024-10-12 14:21:40", "date_publish": "2023-01-17 17:21:58", "description": "Issues which are \"ripe for resolution\" will be discussed, said Singapore's Foreign Minister. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-s-pm-anwar-to-visit-singapore-end-of-this-month-foreign-minister-zambry-says_1728742900.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/18/dw-anwar-vivian-230117_4.jpg?VersionId=Hg.k7oh1fglpMy8tXXdXyosAgMjmHAFm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-s-pm-anwar-to-visit-singapore-end-of-this-month-foreign-minister-zambry-says_1728742900.html", "title": "Anwar’s visit to S’pore will set stage for ‘significant progress’ in longstanding bilateral issues: Vivian", "title_page": "Anwar’s visit to S’pore will set stage for ‘significant progress’ in longstanding bilateral issues: Vivian | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Malaysian Prime Minister Anwar Ibrahim is slated to visit Singapore by the end of January. The visit will be his first to the Republic since he took office on Nov 24.\nThis will be Datuk Seri Anwar’s second official visit since becoming the country’s 10th prime minister, after his official visit to Indonesia on Jan 8 and 9.\n“Our prime ministers have been in contact, but nothing beats a face-to-face meeting between two old friends,” Singapore’s Foreign Minister Vivian Balakrishnan told reporters on Tuesday in Kuala Lumpur.\nSingapore’s President Halimah Yacob is also expected to make a state visit to Malaysia in March, Malaysian Foreign Minister Zambry Abdul Kadir said in a statement on Tuesday after a meeting with Dr Balakrishnan.\nDr Balakrishnan said Mr Anwar’s visit to Singapore will set the stage for bilateral talks between ministries of both countries, including follow-ups on outstanding issues.\n“It will be a useful, significant meeting, which will set the agenda and the timetable for the ministers and respective ministries to follow up. Connectivity, longstanding issues which we think are ripe for resolution will be discussed,” he said.\nDr Balakrishnan is on a four-day visit to Malaysia that ends on Wednesday.\nHe is confident that the leaders of both countries will make “significant progress” in resolving longstanding issues in the coming months.\n“I am hopeful we will make progress and not let us be held hostage to the past and look forward to the future.\n“We are now at the stage (where) the old emotional baggage has dissipated, and we still have experienced senior leaders on both sides with goodwill and sensitivity to negotiate in good faith and arrive hopefully at agreements which will be supported by both sides,” Dr Balakrishnan said.\n“People in Malaysia and Singapore want us to have a good relationship. Having settled the old issues, we can also look forward with greater confidence to the future.”\nIn December, Malaysia’s Attorney-General Idrus Harun was instructed to review matters pertaining to claims over Pedra Branca, which Malaysia calls Pulau Batu Puteh. Mr Anwar said this would allow negotiations with Singapore to be more fruitful.\n“The Cabinet has tasked the A-G to look into the matter so that negotiations and discussions with Singapore on Batu Puteh will have a meaningful outcome,” PM Anwar said to reporters in December.\n“Further, we do not want this to result in issues or problems in the relations of two neighbouring friends.”\nOn Tuesday, Dr Balakrishnan said that as close interdependent neighbours, Singapore hopes for “stability, continuity and consistency in policies” for projects to be continued between both countries.\nOne of the upcoming bilateral projects is the Johor Bahru-Singapore Rapid Transit System Link. This project is on track to be completed by end-2026, with the foreign ministers of Singapore and Malaysia noting the good progress in the project on Monday.\nFor the countries to move into new bilateral collaborations, the Singapore minister said that new areas such as the digital and green economies are important to reduce climate change and lessen carbon footprints.\nCiting examples of key sectors such as semiconductor and artificial intelligence, Dr Balakrishnan said mutual investments and support from both sides would create a productive ecosystem between Malaysia and Singapore for the future.\n“We will also be a buyer in the global carbon market, and there is an opportunity for both Malaysia and Singapore in these new areas,” he said.\nA comprehensive understanding of both nations’ history by officials from both sides will ensure greater bilateral ties, he said.\nDr Balakrishnan, who called on Mr Anwar on Tuesday, reaffirmed the excellent longstanding relations between Singapore and Malaysia. He said trade between both countries continued to grow despite the disruptions led by Covid-19. In 2021, total trade between both countries amounted to $128 billion.\nHe also met Malaysia’s Minister of Transport Anthony Loke Siew Fook, Minister of Economy Rafizi Ramli, Minister of Defence Mohamad Hasan, and Minister of Natural Resources, Environment and Climate Change Nik Nazmi Nik Ahmad.\n“The ministers agreed to enhance cooperation in various areas, including restoring full connectivity and new opportunities in digital economy and sustainable development,” said Singapore’s Ministry of Foreign Affairs.\nThis article has been edited for accuracy.", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-s-pm-anwar-to-visit-singapore-end-of-this-month-foreign-minister-zambry-says"}