{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:53:12", "date_modify": "2024-10-12 13:53:12", "date_publish": "2024-09-04 13:10:00", "description": "The unconventional leave was introduced to boost employees' well-being. Read more at straitstimes.com.", "filename": "asia_se-asia_thai-company-offers-tinder-leave-to-employees_1728741192.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/2024-07-16T115027Z113523033RC2AW8AO14JARTRMADP3MATCH-STARBOARD-STAKE.JPG?VersionId=mhjvZ6TyPSDQPw5tGGYOV.8mg3c8yVO9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_thai-company-offers-tinder-leave-to-employees_1728741192.html", "title": "Thai company offers Tinder leave to employees", "title_page": "Thai company offers Tinder leave to employees | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A company in Thailand has offered an unconventional benefit to employees – Tinder leave.\nMarketing firm Whiteline Group announced in August that from now until December, workers will be given paid time off to pursue romantic connections on the dating app.\n“Our employees can use Tinder leave for dating with someone,” the company said in its LinkedIn post.\nIt did not state the number of days allocated for such leave.\nThe company also covers the cost of the higher-tiered Tinder Gold and Tinder Platinum subscriptions for all employees. These members can see who like them, match with people from all over the world and send a note with every Super Like.\nThe unconventional initiative was put in place to boost well-being among employees, reported 9News Australia.\nThe company believes being in love increases happiness and this will contribute to increased productivity, say media reports.\nThe initiative started after the company’s management overheard a worker saying she was “too busy” to date, reported the New York Post.\nEmployees who want to utilise their Tinder leave will be required to put in a week’s notice.\nThe company, founded in Bangkok, has about 200 employees, according to its website.\nWhiteline Group is not the only company that provides such benefits.\nInfluencer marketing agency Gushcloud International also offered one day of Tinder leave and sponsored Tinder Platinum subscriptions to all its 300 employees in Indonesia, Malaysia, the Philippines, Singapore, South Korea, and Thailand.\n“We believe that fostering a healthy social life is essential, and this is a great way to take care of our employees in their relationship goals, whether that’s meeting new people, making new friends, or finding a life partner,” said Gushcloud co-founder and group CEO, Ms Althea Lim.", "url": "https://www.straitstimes.com/asia/se-asia/thai-company-offers-tinder-leave-to-employees"}