{"authors": [], "date_download": "2024-10-12 14:20:07", "date_modify": "2024-10-12 14:20:07", "date_publish": "2023-10-17 11:43:00", "description": "Malaysia is committed in delivering humanitarian aid for the Palestinian people, said Mr Anwar on Tuesday. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysian-pm-anwar-expresses-unwavering-support-for-palestinian-people-in-call-with-hamas_1728742807.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/17/anwar.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysian-pm-anwar-expresses-unwavering-support-for-palestinian-people-in-call-with-hamas_1728742807.html", "title": "Malaysian PM Anwar expresses unwavering support for Palestinian people in call with Hamas", "title_page": "Malaysian PM Anwar expresses unwavering support for Palestinian people in call with Hamas | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - It is crucial and paramount to prioritise the well-being and safety of all individuals affected by the Israeli-Palestinian conflict, said Malaysian Prime Minister Anwar Ibrahim.\nThe country is committed to delivering humanitarian aid, particularly in the form of food and medicine to alleviate the suffering of those in need, wrote Datuk Seri Anwar in a Facebook post on Tuesday.\n“Given the dire situation in Gaza, I strongly advocate for the immediate cessation of bombardment and the establishment of a humanitarian corridor in Rafah,” he wrote.\nIn his post, Mr Anwar said that he had a phone conversation with Hamas’ political bureau head Ismail Haniyeh on Monday to express Malaysia’s unwavering support for the Palestinian people.\n“It is also imperative for Israel to abandon their adherence to the politics of dispossession, immediately cease fire with Hamas and genuinely pursue a peaceful resolution to end the ongoing conflict.”\nOn Thursday, Mr Anwar will leave for Riyadh in Saudi Arabia to attend the Asean and Gulf Cooperation Council (GCC) Summit, which begins on Friday.\nAs part of his upcoming visit, Mr Anwar will meet Malaysia’s friends and discuss the need for meetings with other world leaders over the Israeli-Palestinian conflict. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/malaysian-pm-anwar-expresses-unwavering-support-for-palestinian-people-in-call-with-hamas"}