{"authors": [], "date_download": "2024-10-12 14:08:02", "date_modify": "2024-10-12 14:08:02", "date_publish": "2024-01-30 14:23:00", "description": "The report didn’t say when the decision would be made public.  Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-pardons-board-decided-on-jailed-former-pm-najib-s-case-report_1728742082.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/30/2024-01-19T044204Z1346517220RC2SK5A30DP0RTRMADP3MALAYSIA-POLITICS-NAJIB.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-pardons-board-decided-on-jailed-former-pm-najib-s-case-report_1728742082.html", "title": "Malaysia’s Pardons Board reportedly discusses jailed former PM Najib’s case", "title_page": "Malaysia’s Pardons Board reportedly discusses jailed former PM Najib’s case | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – The Pardons Board headed by the Malaysian King met on Jan 29, according to a Cabinet minister, after a report said the meeting had decided on an application from imprisoned former prime minister Najib Razak.\nDr Zaliha Mustafa, a Minister in the Prime Minister’s Department who sits on the Pardons Board, told reporters on Jan 30 that the meeting took place at the national palace. She did not say if Najib’s pardon bid was discussed.\n“Just wait for the official statement from the Pardons Board,” she said.\nThe Edge reported on Jan 30 that the board had discussed the case in what is King Abdullah Ahmad Shah’s last official meeting before passing the reins to Sultan Ibrahim Iskandar this week as part of the South-east Asian nation’s rotating monarchy.\nThe report did not say when the decision would be made public.\nThe board was scheduled to meet on Jan 29, and it was reported earlier that it might consider Najib’s bid for a pardon from his convictions related to the 1Malaysia Development Berhad scandal.\nUtusan Malaysia reported on Jan 30 that Najib had been granted a royal pardon, citing unnamed sources. But the Malay-language news outlet later issued an apology over the article.\n“Utusan has retracted the article because the facts cannot be verified. Therefore, we apologise to our readers,” it said in a statement.\nMalaysian Communications Minister Fahmi Fadzil said any news about Najib’s appeal for a royal pardon should come from the Pardons Board and not be based on unnamed sources.\n“Sometimes, the authenticity of the source cannot be ascertained, hence it is important to verify the information received,” he said.\nNajib is serving a 12-year prison sentence for several charges in the case involving RM42 million (S$11.9 million) in funds belonging to SRC International, a former unit of the troubled state fund.\nHe has exhausted all legal avenues of appeal and can be released from prison only by a royal pardon from Malaysia’s King.\nNajib’s lawyer and the Malaysian government did not immediately respond to requests for comment.", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-pardons-board-decided-on-jailed-former-pm-najib-s-case-report"}