{"authors": [], "date_download": "2024-10-12 13:39:46", "date_modify": "2024-10-12 13:39:46", "date_publish": "2024-08-06 13:04:00", "description": "The wars in Ukraine and Gaza “are deepening distrust and fear among nations”, the city’s mayor says. Read more at straitstimes.com.", "filename": "asia_east-asia_hiroshima-remembers-a-bomb-victims-as-global-tragedies-unfold_1728740386.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/06/2024-08-06T013548Z1645557606RC21A9AQQBTNRTRMADP3WW2-ANNIVERSARY-HIROSHIMA.JPG?VersionId=DJ87ZzNwurgYf8.b4GeqOhqz2nVq58nR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hiroshima-remembers-a-bomb-victims-as-global-tragedies-unfold_1728740386.html", "title": "Hiroshima remembers A-bomb victims as ‘global tragedies’ unfold", "title_page": "Hiroshima remembers A-bomb victims as ‘global tragedies’ unfold | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – The mayor of Hiroshima said on Aug 6 that wars in Ukraine and Gaza were deepening fear and distrust worldwide, on the 79th anniversary of the atomic bombing that devastated the Japanese city.\nMr Kazumi Matsui made a sombre speech at a memorial event to commemorate the victims of the US nuclear attack on Aug 6, 1945, that left about 140,000 people dead.\n“Russia’s protracted invasion of Ukraine and the worsening situation between Israel and Palestine are claiming the lives of countless innocent people and shattering normal life,” he said.\n“These global tragedies are deepening distrust and fear among nations, reinforcing the public assumption that to solve international problems we have to rely on military force, which we should be rejecting.”\nDays after the 1945 Hiroshima attack, a second American nuclear bomb hit Nagasaki in south-west Japan, killing around 74,000 people.\nThe two strikes led to the end of World War II, and to this day Japan remains the only country in the world to be hit by atomic weapons in wartime.\nDuring the Aug 6 ceremony, dignitaries, including Prime Minister Fumio Kishida, all clad in black suits, bowed deeply and laid wreaths at the memorial cenotaph featuring the inscription “rest in peace”.\nToday, Hiroshima is a thriving metropolis of 1.2 million people, but the ruins of a domed building stand in the city centre as a stark reminder of the attack’s horrors.\nFor the third year running, Russia and Belarus were not invited to the ceremony because of the Ukraine crisis.", "url": "https://www.straitstimes.com/asia/east-asia/hiroshima-remembers-a-bomb-victims-as-global-tragedies-unfold"}