{"authors": [], "date_download": "2024-10-12 13:39:33", "date_modify": "2024-10-12 13:39:33", "date_publish": "2024-09-04 12:45:20", "description": "Luxon's visit marks the first time in nine years that a New Zealand PM has been to South Korea. Read more at straitstimes.com.", "filename": "asia_south-korea-new-zealand-leaders-condemn-north-korea-nuclear-development_1728740373.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/LYNXMPEK8304W-1.jpg?VersionId=N7fZs2wId9ux8gE.M4GpN_FwroMhbZaE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-korea-new-zealand-leaders-condemn-north-korea-nuclear-development_1728740373.html", "title": "South Korea, New Zealand leaders condemn North Korea nuclear development", "title_page": "South Korea, New Zealand leaders condemn North Korea nuclear development | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - The leaders of South Korea and New Zealand condemned North Korea’s nuclear weapons development and its military cooperation with Russia, Seoul’s presidential office said on Sept 4.\nNew Zealand Prime Minister Christopher Luxon and South Korea’s President Yoon Suk-yeol also agreed to speed up discussions on elevating their relations to a comprehensive, strategic partnership at a meeting in Seoul, Mr Yoon’s office said in a joint statement.\nThe two leaders expressed support for Ukraine’s peace and condemned Russia’s invasion, according to the statement, as well as stressing the importance of preserving peace and stability across the Taiwan Strait.\nIt marks the first time in nine years that a New Zealand prime minister has visited South Korea, Mr Yoon’s office said.\nThe South Korean President has been raising the alarm about North Korea's nuclear and missile programme and its deepening military ties with Russia in meetings with world leaders. REUTERS", "url": "https://www.straitstimes.com/asia/south-korea-new-zealand-leaders-condemn-north-korea-nuclear-development"}