{"authors": [], "date_download": "2024-10-12 14:15:43", "date_modify": "2024-10-12 14:15:43", "date_publish": "2022-03-14 16:16:29", "description": "The Shanghai Tower was locked down as required by virus control measures from health authorities. Read more at straitstimes.com.", "filename": "asia_east-asia_china-locks-down-worlds-second-tallest-building-in-covid-19-fight_1728742543.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/14/AK_chsl_140322.jpg?VersionId=03Ex4_tjkvGCDB_O9CpdPEV8yvxK_XPf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-locks-down-worlds-second-tallest-building-in-covid-19-fight_1728742543.html", "title": "China locks down world's second-tallest building in Covid-19 fight", "title_page": "China locks down world's second-tallest building in Covid-19 fight | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (BLOOMBERG) - Shanghai Tower was locked down on Monday (March 14), trapping workers and visitors inside as authorities race to contain a spreading Covid-19 outbreak that's ensnared China's financial and tech hubs.\nChina's tallest building and the second-tallest in the world after Dubai's Burj Khalifa, the 128-floor skyscraper was locked down as required by virus control measures from health authorities, according to a statement from its property management firm.\n\"We will cooperate with government departments and take various measures in strict accordance with relevant requirements. At the same time, we will also make every effort to ensure the living needs of those staying in the building,\" Shanghai Tower CBRE Property Management said.\nShanghai Tower was locked down shortly after 8am on Monday and people inside are barred from leaving until they are tested for the virus and no positive cases are found, a security guard at the entrance of the building said.\nChina typically locks down buildings if there are confirmed Covid-19 patients inside, or even close contacts of known cases, to mass test and screen out infections. It's part of the country's zero-tolerance approach to the virus that is being challenged by the highly contagious Omicron variant and the scale of a new outbreak.\nHome to the offices of financial industry firms including JPMorgan Chase and Fitch Ratings, Shanghai Tower is a prominent feature of the Pudong district skyline.\nWhile it was unclear whether there were any confirmed cases in the building, a notice at the entrance said it had been \"blocked temporarily because of epidemic control needs\".\nChina's current Covid-19 outbreak is at a scale not seen since the start of the pandemic in Wuhan. Most schools and public parks in Shanghai have been closed and bus services from other provinces blocked. The city reported 169 new cases on Sunday. An outbreak in Shenzhen in southern China has led to the tech hub being locked down, impacting operations of a key Apple supplier and other companies.\nWhile staff at JPMorgan were told on Sunday they could work from home from Monday due to Covid-19 cases in Shanghai, they were informed the office would be open for those who needed to work there, a person familiar with the matter said.\nOn Monday morning they were notified that the building was closed, the person said, asking not to be named discussing information that wasn't public.\nA representative for JPMorgan in China didn't immediately respond to a request for comment.\nThe growing caseload and action in Shenzhen has stoked speculation Shanghai could also be locked down. It would be an unprecedented move for China to lock down a city of Shanghai's visibility and importance, with officials tending to favour more targeted virus mitigation measures in the biggest cities.\nBut Omicron is challenging the so-called \"zero-Covid-19\" strategy like never before, and China's responses are becoming more intense as it strives to avoid a repeat of the situation in Hong Kong, where the pathogen is out of control.\nMass testing and lockdowns to identify cases and prevent spread are key tools in the \"zero-Covid-19\" arsenal, along with stringent border curbs and compulsory quarantines for all incoming travellers. China's aviation regulator is discussing diverting international flights from Shanghai, Bloomberg reported on Friday, amid pressure on quarantine hotels and concern about the outbreak.", "url": "https://www.straitstimes.com/asia/east-asia/china-locks-down-worlds-second-tallest-building-in-covid-19-fight"}