{"authors": ["Mara Cepeda"], "date_download": "2024-10-12 13:36:57", "date_modify": "2024-10-12 13:36:57", "date_publish": "2024-05-12 05:00:00", "description": "Analysts say the locations of the recent US-Philippines military drills send a clear message to China. Read more at straitstimes.com.", "filename": "asia_se-asia_we-re-sitting-ducks-residents-in-northern-philippines-fear-being-caught-in-us-china-rift_1728740217.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/12/mawar20gabu20norte20seaside.jpg?VersionId=JtOeB2JqfzXInwJQxlgJnVVQ6TS8ZPit", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_we-re-sitting-ducks-residents-in-northern-philippines-fear-being-caught-in-us-china-rift_1728740217.html", "title": "‘We’re sitting ducks’: Residents in northern Philippines fear being caught in US-China rift", "title_page": "‘We’re sitting ducks’: Residents in northern Philippines fear being caught in US-China rift | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ILOCOS NORTE – There was a rumbling in the ground, and homes shook in the sleepy coastal village in northern Philippines where American and Filipino troops were pounding floating targets with artillery in a military exercise repelling a mock naval invasion.\nFisherman Macreno Racadio, 40, heard the explosions on the morning of May 6 as he sat at Gabu Norte village’s quiet seaport, his wooden boat among the scores tied up along the shore.\nFisherfolk had been banned from setting out for a week until May 10 from Laoag City, in Ilocos Norte province, while the armed forces of the Philippines and United States conducted two key exercises at the nearby La Paz Sand Dunes.\nThe annual month-long “Balikatan” or “shoulder-to-shoulder” war games, which kicked off in April and involved some 16,000 Filipino and American soldiers, were held as tensions between Manila and Beijing threatened to boil over in the South China Sea. The allies have been holding the exercises in strategic Philippine locations since 1991.\nThe 2024 drills were conducted in various areas in the Philippines, along its western coast facing the disputed waterway and up north close to Taiwan, the self-ruled island that Beijing considers as its territory.\nLaoag City not only faces the South China Sea but is also located just 408km from the southernmost tip of Taiwan. Ilocos Norte province is the closest on the Philippine mainland to China and is home to more than 609,000 people.\nMr Racadio said village officials had told them not to be afraid when they heard the blasts from the Balikatan exercises. But he could not help but cringe, he said.\n“It’s like they’re preparing for war already,” he told The Straits Times. “If that happens, we’re sitting ducks here.” He noted that his village was near the local airport, which could be a prime target if war breaks out.\nFisherfolk in the province also lost up to 3,000 pesos (S$70) per person per day in potential income because of the no-sail policy.\nNot only do the drills hurt the hundreds who depend on the sea for their livelihood, said Mr Genaro dela Cruz, spokesman for the progressive Ilocos Norte Human Rights Alliance, but the military exercises could also further stoke tensions with Beijing.\nBeijing claims almost the entirety of the South China Sea, ignoring a 2016 international tribunal that rejected its assertions over the waterway. In the past year, China has ramped up its military presence and activities in the disputed waters, including firing water cannon at both Philippine ships patrolling near Scarborough Shoal, west of Luzon island, and vessels sending supplies to Filipino troops stationed at a remote military outpost in Second Thomas Shoal, south of the Spratly Islands.\n“An imperialist war could erupt, much like what happened during World War II,” Mr Dela Cruz said. “And who would be the most disadvantaged? Us Filipinos, especially the poor.”\nChinese aggression has pushed President Ferdinand Marcos Jr to beef up defence cooperation with the US, which now has wider access to Philippine military bases, including locations close to the South China Sea and Taiwan.\nFlashpoints in the north\nThe US and Philippine militaries carried out two exercises in Ilocos Norte: the counter-landing live fire drills on May 6 and a maritime strike exercise on May 8, in which they used high-powered weapons systems to sink a China-made oil tanker.\nUS Marine Corps Lieutenant-General Michael Cederholm, commander of the joint task force for Balikatan, said the exercises were meant to improve military cooperation between the Philippines and the US. He told reporters on May 6 they were not meant to agitate any particular country, and insisted there was “no significance” to the training sites.\n“We don’t do this for any third party. We don’t do this for messaging. We do this to create interoperability,” he said.\nBut the strategic location of Ilocos Norte in the region and the weapons used in the Balikatan drills do send a clear message to China, said maritime security expert Collin Koh of the S. Rajaratnam School of International Studies in Singapore, noting that the drills demonstrated Manila’s and Washington’s capabilities in the event of an escalation in the South China Sea or over Taiwan.\nIn the counter-landing drills, troops launched Javelin anti-tank missiles, and fired a barrage of ammunition from Howitzer cannons and machine guns to sink five floating targets that represented warships.\nAnd in the maritime strike exercise held two days later, the Philippines and the US showed off their naval, aerial and ground firepower to sink the BRP Lake Caliraya, a decommissioned Philippine Navy oil replenishment tanker that had been acquired from China.\nThe Philippines also took the chance to showcase its first missile-armed frigate, the BRP Jose Rizal, which fired an SSM-700K C-Star anti-ship missile at the tanker.\nDefence analyst Don McLain Gill, a lecturer at De La Salle University in Manila, said the location of the 2024 exercises serves to show that the Philippines has improved its military capabilities to defend itself. “This is crucial for any sovereign nation whose utmost priority is to defend its territory against emerging threats,” said Mr Gill.\nFish vendor Jacqueline Racilas, 47, who operates a stall in Laoag, said she supported the drills, as they trained Filipino soldiers, even though she and her fisherman husband went without income for a week.\n“Of course, people like us living on the coast are scared of a possible war. But I still support this Balikatan drill so that if some other country invades us, our soldiers can fight back,” she said.\nNavigating rough terrain\nThe local dynamics in Ilocos Norte are also a microcosm of the larger balancing act for the Philippine government as it deals with the US-China rivalry in its backyard.\nThe province has close ties with China, welcoming a consulate to open in Laoag City in 2007, when President Marcos was still the governor of Ilocos Norte. It also has a sisterhood agreement with Shandong province in China, while Laoag has sister-city deals with Laibing City and Huangshan City. Economic opportunities and initiatives have been shared under these pacts.\nIlocos Norte has benefited from this, with China often one of the first foreign countries to donate supplies when calamities hit the disaster-prone province. A Chinese Garden was also opened in Ilocos Norte in 2021, and has become a tourist attraction.\nGovernor Matthew Marcos Manotoc, nephew of the President and son of Senator Imee Marcos, told ST that the conduct of the 2024 war games has thus far not affected relations with Chinese officials in the province.\nThe mayor said it was only natural for the drills to be held in the capital of the province considered the stronghold of the Philippine President. Still, Mr Keon said he maintains a “very good relationship” with the Chinese consulate in his city, noting that it was under his term that the sisterhood pact was sealed with Huangshan.\n“We’re not doing it (Balikatan) to provoke war. We’re just doing it to send a message that if push comes to shove, we will protect our territory,” said Mr Keon.\nAs Filipino officials continue to navigate the tricky geopolitical landscape posed by the US-China rivalry, residents can only hope that war will never come to the place they call home.\nLa Paz resident Norman Alejandro, 41, who lives on the outskirts of the sand dunes, asks only one thing of President Marcos. “I support what you’re doing, even if I’m a bit afraid now. So don’t forget us if the worst happens.”", "url": "https://www.straitstimes.com/asia/se-asia/we-re-sitting-ducks-residents-in-northern-philippines-fear-being-caught-in-us-china-rift"}