{"authors": [], "date_download": "2024-10-12 13:38:48", "date_modify": "2024-10-12 13:38:48", "date_publish": "2024-02-19 00:00:49", "description": "Televisions and pictures of living things were banned under the previous Taliban rule from 1996 to 2001. Read more at straitstimes.com.", "filename": "asia_south-asia_afghan-province-orders-officials-not-to-photograph-living-things_1728740328.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/19/AFGHANISTAN-DRUGS-OPIUM-153036.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_afghan-province-orders-officials-not-to-photograph-living-things_1728740328.html", "title": "Afghan province orders officials not to photograph ‘living things’", "title_page": "Afghan province orders officials not to photograph ‘living things’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KABUL – The authorities in the southern Afghan province of Kandahar, the birthplace of the Taliban, ordered its officials on Feb 18 not to take pictures or videos of “living things”.\nIn a letter addressed to civil and military officials, the provincial Department of Interior directed them “to refrain from taking pictures of living things in... formal and informal gatherings, because it causes more harm than good”.\nIt said text or audio content on officials’ activities was allowed.\nImages of humans and animals are generally avoided in Islamic art, extending for some Muslims to an aversion to any images of living things.\nA spokesman for Kandahar’s governor told AFP that the letter was authentic and that its instructions applied only to provincial officials.\n“It is not related to the general public and independent media,” Mr Mahmood Azzam said.\nTelevisions and pictures of living things were banned under the previous Taliban rule from 1996 to 2001.\nSeveral media outlets have refrained from using images of people and animals since the Taliban returned to power more than two years ago.\nHowever, official central government departments frequently distribute and share pictures of senior officials meeting foreign dignitaries. AFP", "url": "https://www.straitstimes.com/asia/south-asia/afghan-province-orders-officials-not-to-photograph-living-things"}