{"authors": [], "date_download": "2024-10-12 13:32:37", "date_modify": "2024-10-12 13:32:37", "date_publish": "2023-05-23 06:42:00", "description": "The suspects have been operating a digital currency exchange and converting them into USDT crypto token. Read more at straitstimes.com.", "filename": "asia_se-asia_singaporean-man-among-40-arrested-in-malaysia-s-online-gambling-call-centre-raids_1728739957.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/23/rrraid2305_1.jpg?VersionId=qiqfuuFc_JgoQHLzwzGtK0PVCatZdmL4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_singaporean-man-among-40-arrested-in-malaysia-s-online-gambling-call-centre-raids_1728739957.html", "title": "Singaporean man among 40 arrested in Malaysia’s online gambling call centre raids", "title_page": "Singaporean man among 40 arrested in Malaysia’s online gambling call centre raids | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA - An online gambling call centre that targeted overseas customers has been busted in raids in the Klang Valley.\nForty suspects, including 21 Chinese nationals and a Singaporean man, were arrested in the raids on May 19. They were aged between 28 and 58.\nThe raids were led by Bukit Aman through its Commercial Crime Investigation Department and were conducted with the National Financial Crime Centre.\n“The syndicate was found to have prepared an online gambling platform that targeted the Taiwanese market. Interested customers were instructed to transfer money into a mule account that we believe to be based in China.\n“After the money has been transferred, the customers will be issued points for the gambling platform,” Police secretary, Deputy Comm Norsiah Mohd Saaduddin, said in a statement on Monday.\nInvestigations also showed that the group had been operating a digital currency exchange by receiving money from China and converting them into the USDT, or Tether, crypto token. It would then be transferred back to China.\n“The source of the money received by the syndicate is still under investigation,” she said.\nItems seized included 88 mobile phones, three cars and multiple computers.\nA total of RM29,587 (S$8,700) and US$5,000 (S$6,700) cash were also seized.\nAll suspects have been remanded until Thursday. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/singaporean-man-among-40-arrested-in-malaysia-s-online-gambling-call-centre-raids"}