{"authors": ["Keval Singh"], "date_download": "2024-10-12 13:55:17", "date_modify": "2024-10-12 13:55:17", "date_publish": "2023-03-16 18:43:54", "description": "Some netizens said the money spent on the dog could have been used for a better cause. Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-dog-flies-business-class-and-some-netizens-bite-back_1728741317.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/17/STPhoto5.jpg?VersionId=6TWsPnOKViVX4hTAB1lyr4l.IzYlbmod", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-dog-flies-business-class-and-some-netizens-bite-back_1728741317.html", "title": "Hong Kong dog flies business class, and some netizens bite back", "title_page": "Hong Kong dog flies business class, and some netizens bite back | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Not quite a dog’s life, at least for four-year-old Fifi.\nThe miniature long-haired dachshund from Hong Kong has become an online sensation, after a video of the dog travelling in business class on a flight went viral, according to a report in the South China Morning Post (SCMP).\nIn the video, Fifi is seen snuggled under blankets on the flight from Hong Kong to Istanbul.\nThe dog’s owner, Helen Rosalie, said Fifi was “calm and collected” throughout the 11-hour journey.\nMs Rosalie, a Briton, adopted Fifi when the dog was one-year-old.\nFifi may have been comfortable and well-rested during its luxurious flight, but some netizens were not.\nThey took issue with Ms Rosalie’s travel arrangements and her posts about how she treats Fifi as if it were her daughter.\n“It seems a bit sad that you’d prefer to spend tens of thousands on a dog and call it your daughter, when there are thousands of children in care homes that could become a real daughter,” one person wrote.\nAnother netizen said the video was “hard for me to see”, because the money spent on Fifi’s travel could have fed starving children and saved lives.\nHowever, not everyone is complaining.\nThe business is booming for those who cater to pet travel services.\nA 2021 global market valued at US$782.4 million (S$1.05 billion), is now forecast to reach US$1.3 billion by 2031, SCMP reported.\nA growing trend within the sector is for people to share a jet.\nPet owners who want to travel with their furry friends charter a private plane and share the costs with other like-minded people.\nMs Olga Radlynska Naudot, founder of Hong Kong-based private aviation company, Top Stars Air, said chartering a private jet with one’s pet is not just for the rich and famous.\nShe said more people have turned to private planes due to the high cost of commercial flights, which soared during the pandemic.\nFor example, a chartered private plane from Hong Kong to Singapore costs around US$60,000 for eight people.\nAnother reason is that commercial flights tend to have restrictions on large dogs and certain breeds.\nFew commercial airlines accept pets, Ms Naudot said.\nThose that do allow pets have cabin restrictions, which means animals would have to fly in the cargo hold or as freight.\nThis can be traumatic for some pets and their owners, especially on long-haul flights.\nCloser to home, Singapore Airlines generally does not allow pets in its cabins, although assistance dogs are exceptions.\nEmotional support dogs are another exception, but not for much longer.\nIn late 2022, SIA said customers would no longer be allowed to travel with their emotional support dogs on board flights.\nThose with assistance dogs would not be affected, as long as they comply with specific conditions as well as the regulations of the countries they pass through on their journey.", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-dog-flies-business-class-and-some-netizens-bite-back"}