{"authors": [], "date_download": "2024-10-12 13:36:29", "date_modify": "2024-10-12 13:36:29", "date_publish": "2024-09-27 10:25:00", "description": "China this week urged the US to “promptly” remove all additional tariffs on Chinese goods. Read more at straitstimes.com.", "filename": "asia_blinken-to-meet-chinese-foreign-minister-wang-yi-on-sept-27_1728740189.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/27/aiblinken270924.jpg?VersionId=zq7LH2NA9fkIG3hJnW.nd12BeP6Y_zkS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_blinken-to-meet-chinese-foreign-minister-wang-yi-on-sept-27_1728740189.html", "title": "Blinken to meet Chinese Foreign Minister Wang Yi on Sept 27", "title_page": "Blinken to meet Chinese Foreign Minister Wang Yi on Sept 27 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – US Secretary of State Antony Blinken will meet Chinese Foreign Minister Wang Yi on Sept 27 in New York City, the US State Department said.\nTies between the world’s two biggest economies have been tense as they clash over US export controls on advanced chip technology to China, trade tariffs, Taiwan, human rights and the wars in Gaza and Ukraine.\nThe meeting between the two top diplomats will take place at 5.30pm on Sept 27, according to the State Department. Mr Wang is in the US for the United Nations General Assembly session.\nChina this week urged the US to “promptly” remove all additional tariffs on Chinese goods.\nWashington has expressed concern over China’s ties with Russia since Moscow’s invasion of Ukraine, while Beijing has repeatedly expressed worries over US ties with Taiwan.\nThe US is Taiwan’s most important international backer and arms supplier even though Washington does not formally recognise its government, maintaining official relations only with Beijing.\nThe challenges to the US posed by China exceed those of the Cold War, US Deputy Secretary of State Kurt Campbell said earlier in September.\nPresident Joe Biden’s administration has been explicit that it is not seeking a cold war with China, but increasingly, analysts and members of the US Congress have said escalating global competition between the two superpowers resembled a new style of the Cold War.\nThe two sides have kept lines of communication open in recent months. The White House said in August a call was being planned between Chinese President Xi Jinping and Mr Biden soon. REUTERS", "url": "https://www.straitstimes.com/asia/blinken-to-meet-chinese-foreign-minister-wang-yi-on-sept-27"}