{"authors": [], "date_download": "2024-10-12 14:05:34", "date_modify": "2024-10-12 14:05:34", "date_publish": "2020-01-16 05:00:00", "description": "Malaysia's Pakatan Harapan (PH) government faces another litmus test at the ballot box this Saturday, as its ally Parti Warisan Sabah takes on former ruling coalition Barisan Nasional (BN) in a by-election marked by issues of immigration and economic development. Read more at straitstimes.com.", "filename": "asia_se-asia_tough-fight-for-ph-ally-in-umno-face-off_1728741934.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/01/16/ST_20200116_XKIMANISLNC1_5384109.jpg?VersionId=iYKkk8dPPBPRGeuiTznOB0G4C_pWUs5P", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_tough-fight-for-ph-ally-in-umno-face-off_1728741934.html", "title": "Tough fight for Pakatan Harapan ally in Umno face-off", "title_page": "Tough fight for Pakatan Harapan ally in Umno face-off | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Malaysia's Pakatan Harapan (PH) government faces another litmus test at the ballot box this Saturday, as its ally Parti Warisan Sabah takes on former ruling coalition Barisan Nasional (BN) in a by-election marked by issues of immigration and economic development.\nThe key block of votes in this straight fight lies with the indigenous Kadazandusun Murut community, which forms 25 per cent of the electorate in the Kimanis parliamentary ward.\n\"Critical to this group is the migrant issue,\" said Dr Arnold Puyok, an academic at Universiti Malaysia Sarawak.\nWarisan has the advantage of controlling Sabah's state government and its resources, but it has run into hot water over an immigration document Malaysia's federal government plans to issue in June.\nThe Sabah Temporary Pass (PSS) is intended to streamline and improve how the authorities document migrants in the state by replacing the three existing passes issued by different agencies.\nBN politicians have, however, seized on long-held fears among Sabahans over the influx of largely Muslim illegal immigrants to their state, by saying the new document encourages these immigrants to stay on and eventually apply for citizenship.\n\"No matter how hard Warisan is trying to allay public fears over the PSS, the sentiment is that a substantial number of Sabahans are not convinced that it is an effective strategy to solve the problems of illegals in Sabah,\" said Dr Arnold.\nSabah is a politically strategic state as it contributes 25 of the country's lawmakers in the 222-seat Parliament.\nAt the last general election in May 2018, BN won 10 seats in Sabah but this count was whittled down to just one seat when its MPs defected to other parties after it lost the general election.\nPH and its ally Warisan gained from these defections, and have a total of 20 MPs from Sabah between them.\nA win for BN this Saturday, however, would add to the four by-elections it has won over the last year, and bolster its chances at the next general election.\nBut it will be a tough fight to win over Kimanis' nearly 30,000 voters, who are also angry that promised infrastructure, like better drainage and street lights, for their rural town just 55km from state capital Kota Kinabalu, has been slow in coming.\nBoth candidates - Warisan's Mr Karim Bujang and BN's Mr Mohamad Alamin, who is from former ruling party Umno - are local faces and seasoned politicians.\nWarisan's campaign has been spearheaded by Sabah Chief Minister Shafie Apdal, with Parti Keadilan Rakyat (PKR) president Anwar Ibrahim stumping for Mr Karim on Tuesday. PKR is one of the four member parties of PH.\n\"This is the time for us to make the decision which can benefit our fate and future,\" Datuk Seri Anwar said, urging voters to continue placing hopes on Warisan to develop Sabah.\nMeanwhile, former prime minister Najib Razak showed up in Kimanis twice during the BN campaign.\nLast weekend, Najib called Mr Karim an \"old horse\" and questioned the former Umno assemblyman's contribution as a politician.\nThe Kimanis seat fell vacant in December after the court nullified the May 2018 election result for electoral process discrepancies and non-compliance of election laws.\nFormer Umno minister Anifah Aman had then won the seat by just 156 votes over Warisan's Mr Karim.", "url": "https://www.straitstimes.com/asia/se-asia/tough-fight-for-ph-ally-in-umno-face-off"}