{"authors": [], "date_download": "2024-10-12 13:56:52", "date_modify": "2024-10-12 13:56:52", "date_publish": "2024-04-05 05:07:55", "description": "Has bird flu already killed hundreds, if not thousands of penguins in Antarctica? Read more at straitstimes.com.", "filename": "asia_scientists-investigate-thousands-of-dead-antarctic-penguins-for-bird-flu_1728741412.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/05/LYNXNPEK330S1-2.jpg?VersionId=xDmopAaMwlwHLyIs3pKkV22C0D9arMG1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_scientists-investigate-thousands-of-dead-antarctic-penguins-for-bird-flu_1728741412.html", "title": "Scientists investigate thousands of dead Antarctic penguins for bird flu", "title_page": "Scientists investigate thousands of dead Antarctic penguins for bird flu | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANTARCTICA - Has bird flu already killed hundreds, if not thousands of penguins in Antarctica?\nThat's what researchers are seeking to find out after a scientific expedition last month found at least 532 dead Adelie penguins, with thousands more thought to have died, according to a statement from Federation University Australia.\nWhile the researchers suspect the deadly H5N1 bird flu virus killed the penguins, the field tests were inconclusive, the university said. Samples are being shipped off to labs that the researchers hope will provide answers in coming months.\nScientists are concerned specifically that the often fatal H5N1 influenza could decimate threatened species of penguins and other animals on the remote southern continent.\nThe disease has spread more aggressively in wildlife than ever before since arriving in South America in 2022 and rapidly made its way to Antarctica, where the first case of H5N1 was confirmed in February.\n\"This has the potential to have a massive impact on wildlife that is already being impacted by things like climate change and other environmental stresses,\" said Meagan Dewar, a wildlife biologist with Federation University, who participated in the latest expedition.\nDewar told Reuters that the dead Adelie penguins were found frozen solid in the sub-zero temperatures and covered in snow on Heroina Island.\nDewar and the small team of researchers were not able to tally all of the carcasses on the large island, estimating that several thousand died in total at some time in the proceeding weeks or months.\nA colony of roughly 280,000 Adelies breed on Heroina Island each year. Having finished breeding, the live penguins had already moved on by the time the expedition arrived, Dewar said.\nDewar's expedition did find the presence of H5 strain bird flu on the Antarctic peninsula and three nearby islands in skua seabirds, predators which feed on penguin eggs and chicks.\nAbout 20 million pairs of penguins breed in the Antarctic each year, according to the British Antarctic Survey.\nThose include emperor penguins, which scientists fear will be nearly extinct by the end of the century, as sea ice dwindles due to climate change. Melting sea ice in 2022 led thousands of emperor penguin chicks to drown.\nEmperor penguins could now face the added threat of deadly bird flu, Dewar said.\n\"There is now the potential that emperor penguins could be affected come springtime next year,\" she said. REUTERS", "url": "https://www.straitstimes.com/asia/scientists-investigate-thousands-of-dead-antarctic-penguins-for-bird-flu"}