{"authors": [], "date_download": "2024-10-12 13:36:14", "date_modify": "2024-10-12 13:36:14", "date_publish": "2024-06-13 23:45:58", "description": "It provides Kyiv with $6.1 billion in 2024 and support for the next decade. Read more at straitstimes.com.", "filename": "asia_ukraine-japan-sign-10-year-term-security-agreement_1728740174.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/14/11408552.jpg?VersionId=fpr6X2rNkDtX8fKN8bilKgH5gY5ipvhx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_ukraine-japan-sign-10-year-term-security-agreement_1728740174.html", "title": "Ukraine, Japan sign 10-year term security agreement", "title_page": "Ukraine, Japan sign 10-year term security agreement | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BARI, Italy – Ukraine and Japan signed a security agreement during the Group of Seven (G-7) summit on June 13 that provides Kyiv with US$4.5 billion (S$6.1 billion) in 2024 and support for the next decade, the countries’ leaders said.\nUkrainian President Volodymyr Zelensky hailed the “unique document with one of the world’s most economically and technologically advanced countries”, signed on the sidelines of the G-7 meeting in Puglia, Italy.\nThe document provides for security and defence assistance, humanitarian aid, and help with reconstruction efforts, together with support in various other areas from cyber security to countering Russian disinformation campaigns.\n“In 2024, Japan will provide Ukraine with US$4.5 billion and will continue to support us throughout the agreement’s entire 10-year term,” Mr Zelensky wrote on X.\n“For Japan, this type of agreement and this level of support is a breakthrough,” he added, thanking Tokyo for its “unwavering solidarity”.\nIncluding the new funds pledged for 2024, G-7 member Japan has provided US$12.1 billion to Ukraine to date.\nDue to Japan’s Constitution and its legal framework, the country must limit the military equipment it provides to Ukraine to non-lethal weapons.\nBut the country has already been supplying mine-extracting machines and anti-drone detection systems to Kyiv, while it will boost anti-landmine efforts and power generators for humanitarian use, a Japanese government source told AFP.\nKyiv has signed more than a dozen similar deals with its major backers outlining multi-year commitments to fund and enhance Ukraine’s defence and military.\nThose agreements do not constitute mutual defence pacts or military alliances but are seen as an important commitment of long-term support to Kyiv with the Russian invasion now well into its third year. AFP", "url": "https://www.straitstimes.com/asia/ukraine-japan-sign-10-year-term-security-agreement"}