{"authors": ["Walter Sim"], "date_download": "2024-10-12 14:03:04", "date_modify": "2024-10-12 14:03:04", "date_publish": "2023-05-12 11:04:00", "description": "The bloc of wealthy industrialised nations will discuss on Friday ways to beef up resilience in supply chains. Read more at straitstimes.com.", "filename": "asia_east-asia_china-russia-loom-large-over-g-7-finance-ministers-niigata-meeting_1728741784.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/13/398236771_0.jpg?VersionId=3zUO4yFACjy.ZlthiDn0f_eeLaXHrLMV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-russia-loom-large-over-g-7-finance-ministers-niigata-meeting_1728741784.html", "title": "China, Russia loom large over G-7 finance ministers’ Niigata meeting", "title_page": "China, Russia loom large over G-7 finance ministers’ Niigata meeting | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NIIGATA, Japan – Finance chiefs of the Group of Seven (G-7) bloc of wealthy industrialised nations on Friday debated steps to counter China, amid concerns that the world’s second-largest economy is engaging in “economic coercion”.\nThis came amid discussions on how to beef up supply chain resilience, especially in terms of helping developing countries diversify their sources and wean off their over-reliance on China for critical products, including batteries, solar panels and wind turbines.\nChina’s production of these clean energy components has surpassed the G-7’s, a report by the Organisation for Economic Cooperation and Development (OECD) said on Thursday.\nJapan, which is using its G-7 presidency to drive engagement with low- and middle-income countries in the so-called Global South, is spearheading a “new mutually beneficial partnership proposal with the World Bank” to help these countries, a Japanese Finance Ministry official told reporters.\nThe plan aims to technically and financially support them beyond the extraction of resources, to realise more lucrative manufacturing activities.\nThe three-day meeting of G-7 finance ministers and central bank governors in the coastal central Japanese city of Niigata will close on Saturday, likely with a joint communique.\nThis serves as a prelude to the G-7 Leaders’ Summit in Hiroshima from May 19 to 21, where China is again expected to be the elephant in the room.\nAt their meeting in April, G-7 foreign ministers had called on China to “act as a responsible member of the international community” and “abstain from threats, coercion, intimidation, or the use of force”.\nThe G-7 countries, however, were understood to have differed on how far to go to countering China.\nWhile US Treasury Secretary Janet Yellen and British Chancellor Jeremy Hunt have said that the G-7 must lead efforts to counter “economic coercion” by Beijing of countries that it is not happy with, Germany has been cautious of forging a G-7 front against China.\nIn Beijing, Chinese Foreign Ministry spokesman Wang Wenbin told a regular news conference on Thursday: “To put it bluntly, the international rules that the G-7 talks about are Western values and ideologies, and the rules of a small clique that puts the US first.”\nHe added: “The G-7 demands that China abide by international rules, but it is a representative of those who violate and break international rules.”\nUnderscoring the slow pace of establishing high-level contact between the US and China, Dr Yellen told Bloomberg Television in an interview on Friday that she has not yet spoken with her Chinese counterpart, Vice-Premier He Lifeng, who took office in March.\nThe G-7 comprises Britain, Canada, France, Germany, Italy, Japan and the United States. The European Union is a “non-enumerated” member without right to the rotating presidency.\nOn Friday afternoon, G-7 finance chiefs and central bank governors hosted a rare outreach session with six invited nations – Brazil, Comoros, India, Indonesia, Singapore and South Korea. Singapore was represented by Deputy Prime Minister and Finance Minister Lawrence Wong.\nThe outreach session discussed topics such as cooperation for sustainable goals, quality infrastructure, supply chains, and debt issues affecting developing countries.\nOther issues on the agenda on Friday included ways to safeguard financial stability from bank runs.\nThree regional US lenders – Silicon Valley Bank, Signature Bank and First Republic Bank – have collapsed since March.\nThe G-7 finance chiefs on Thursday night discussed the ongoing Russian invasion of Ukraine, seeking to bolster the bloc’s sanctions regime against Moscow to push the Kremlin to end the war.\nUkraine’s Finance Minister Serhiy Marchenko participated online in Thursday night’s session.\nMoscow’s circumvention of sanctions, including through third-party loopholes, has been a headache for the G-7.\nThe Nikkei newspaper reported on Friday that countries such as China, India and Turkey have filled the gap by expanding trade with Russia, whose economy shrunk just 2.1 per cent in 2022.\nWhile trade volumes between the G-7 and Russia shrunk by US$52.1 billion (S$69.5 billion) in 2022, this was dwarfed by the US$103.2 billion increase in trade between Russia and China, India and Turkey, the report said.\nSaid Japan Finance Minister Shunichi Suzuki before Thursday’s session: “I expect to discuss the necessary response to maintain pressure on Russia’s ability to wage war.”\nDr Yellen added that the G-7 “will stand with Ukraine for as long as it takes to end the conflict”.\nFinance chiefs were also concerned by the risk that the US Treasury would run out of cash to pay the government’s debts.\nThis could come as soon as June 1 amid an impasse between US President Joe Biden’s Democrats and Republicans, Dr Yellen told Bloomberg TV.\nThe Democrats want to raise the debt ceiling without conditions, while the Republicans say any increase must be tied to sweeping budget cuts.\nA meeting between Mr Biden and top bipartisan congressional leaders has been postponed to next week.\nThe debt ceiling has been raised nearly 80 times since 1960, and a failure to raise the US$31.4 trillion limit will wreak economic and financial catastrophe on the global economy.\nGerman Finance Minister Christian Lindner told reporters on Friday that he hoped US politicians will take the “grown-up” decision.", "url": "https://www.straitstimes.com/asia/east-asia/china-russia-loom-large-over-g-7-finance-ministers-niigata-meeting"}