{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:46:51", "date_modify": "2024-10-12 13:46:51", "date_publish": "2022-08-13 05:00:00", "description": "Change in weather patterns at high altitudes leads to heavy rainfall which in turn triggers landslides. Read more at straitstimes.com.", "filename": "asia_climate-change-in-the-himalayas-heavier-more-destructive-floods-in-nepal_utm_campaign=ST_Newsletter_ASIANINSIDER_1728740811.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/13/dw-melamchi-main1-220812.jpg?VersionId=pbOQyZdkmwP.AX_XuFxf97ebDp6gkZEb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_climate-change-in-the-himalayas-heavier-more-destructive-floods-in-nepal_utm_campaign=ST_Newsletter_ASIANINSIDER_1728740811.html", "title": "Climate change in the Himalayas: Heavier, more destructive floods in Nepal", "title_page": "Climate change in the Himalayas: Heavier, more destructive floods in Nepal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "More than a year after disastrous flooding struck the Sindhupalchowlk district in central Nepal, intense floods from heavy monsoon rains are once again wreaking havoc in a village called Chanaute.\nClimate change expert Raju Pandit Chhetri, whose home is in the village, told The Straits Times last Saturday that some residents were fleeing the area, where temporary structures that were built following last year's flood had been swept away.\nThe flooding in June last year was the result of unexpectedly heavy rain in the high altitudes of the Himalayan mountains, which dislodged debris from an old landslide at a site known as Bremthang. The debris then plummeted down, causing another landslide that clogged up the Melamchi River with sedimentation, displacing the water from it.\nREAD MORE HERE\nFloods throw Nepal's largest water project into uncertainty\nCritics of a massive project to build a 26-km tunnel to channel water from the Melamchi River to Nepal's water-starved capital Kathmandu were vindicated when the tunnel was damaged by heavy flooding last year.\nThe same critics are now questioning whether other phases of the project should be built while also suggesting solutions to Kathmandu's water shortage problem.\nExperts have long criticised the huge investment of US$500 million in the Melamchi Water Supply Project, questioning its suitability for a country like Nepal, which is extremely vulnerable to climate change.\nREAD MORE HERE\nHow a deadly flood forms in 7 days\nOn June 15 last year, a massive flood in Melamchi, Nepal, killed at least 25 people and destroyed 200 houses.\nUnseasonal heavy rainfall - likely a result of climate change - began in the mountains on June 9, which caused a landslide and a series of cascading disasters further downstream.\nHere's a look at how it happened.\nREAD MORE HERE\nClimate change threatens hydropower projects in the Himalayas\nAs temperatures rise, the rapid melting of glaciers causes heavy flooding downstream that not only threatens homes and livelihoods. It also threatens one of the world's largest sources of renewable energy - hydropower - in the Himalayas.\nThe Straits Times takes a look at where the hydropower projects are, the potential problems caused by climate change and possible solutions.\nREAD MORE HERE", "url": "https://www.straitstimes.com/asia/climate-change-in-the-himalayas-heavier-more-destructive-floods-in-nepal?utm_campaign=ST_Newsletter_ASIANINSIDER"}