{"authors": [], "date_download": "2024-10-12 13:47:20", "date_modify": "2024-10-12 13:47:20", "date_publish": "2022-07-15 07:40:50", "description": "The bracelets monitor users' temperature and upload the data onto a phone app they had to download. Read more at straitstimes.com.", "filename": "asia_east-asia_some-beijing-residents-asked-to-wear-covid-19-monitoring-bracelets-sparking-outcry_1728740840.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/15/afcovidbracelets150722.jpg?VersionId=F9z83ehR_UCrwBrgx4tQCQa1aKh0PRjb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_some-beijing-residents-asked-to-wear-covid-19-monitoring-bracelets-sparking-outcry_1728740840.html", "title": "Some Beijing residents asked to wear Covid-19 monitoring bracelets, sparking outcry", "title_page": "Some Beijing residents asked to wear Covid-19 monitoring bracelets, sparking outcry | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (REUTERS) - Some Beijing residents returning from domestic travel were asked by local authorities to wear Covid-19 monitoring bracelets, prompting widespread criticism on Chinese social media by users concerned about excessive government surveillance.\nAccording to posts published on Wednesday (July 13) evening and Thursday morning on microblogging platform Weibo, some Beijing residents returning to the capital were asked by their neighbourhood committees to wear an electronic bracelet throughout the mandatory home quarantine period.\nChinese cities require those arriving from parts of China where Covid-19 cases were found to go into quarantine. The authorities have fit doors with movement sensors to monitor their movements but until now have not widely discussed the use of electronic bracelets.\nThe bracelets monitor users' temperature and upload the data onto a phone app they had to download, the posts said.\n\"This bracelet can connect to the Internet, it can definitely record my whereabouts, it is basically the same as electronic fetters and handcuffs, I won't wear this,\" Weibo user Dahongmao wrote on Wednesday evening, declining to comment further when contacted by Reuters.\nThis post and others that shared pictures of the bracelets were removed by Thursday afternoon, as well as a related hashtag that had garnered over 30 million views, generating an animated discussion on the platform.\nA community worker at Tiantongyuan, Beijing's northern suburb, confirmed to state-backed news outlet Eastday that the measure was in effect in the neighbourhood, though she called the practice \"excessive\".\nA Weibo post and a video published on the official account of Eastday.com was removed by Thursday afternoon.\nWeibo user Dahongmao wrote on Thursday afternoon that his neighbourhood committee had already collected the bracelets, telling him that \"there were too many complaints\".\nThe outcry against electronic bracelets comes at a time of growing Covid-19 fatigue around China, with disobedience and violation of the law on the rise since a nationwide outbreak in March.\nThe Beijing government could not be immediately reached for comment after regular office hours.", "url": "https://www.straitstimes.com/asia/east-asia/some-beijing-residents-asked-to-wear-covid-19-monitoring-bracelets-sparking-outcry"}