{"authors": ["Anjali Raguraman"], "date_download": "2024-10-12 14:07:04", "date_modify": "2024-10-12 14:07:04", "date_publish": "2023-11-10 22:30:00", "description": "MP Siti Mastura alleged several DAP leaders were related to Lee Kuan Yew and former communist leader Chin Peng. Read more at straitstimes.com.", "filename": "asia_se-asia_dap-chairman-lim-guan-eng-launches-legal-action-against-opposition-mp-for-false-claims_1728742024.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/10/20221117173462224b715c3d-0fe0-4620-8d34-608c3992f01c.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_dap-chairman-lim-guan-eng-launches-legal-action-against-opposition-mp-for-false-claims_1728742024.html", "title": "Malaysia’s DAP chairman Lim Guan Eng launches legal action against opposition MP for false claims", "title_page": "Malaysia’s DAP chairman Lim Guan Eng launches legal action against opposition MP for false claims | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Malaysia’s Democratic Action Party (DAP) chairman Lim Guan Eng initiated legal action against opposition MP Siti Mastura Muhammad on Friday, in response to her allegations about ties between several DAP leaders and Singapore’s founding prime minister Lee Kuan Yew and former Malayan Communist Party leader Chin Peng.\nThe Parti Islam SeMalaysia (PAS) MP made the claims while speaking at a by-election rally in Kemaman, Terengganu, last week.\nShe claimed that former DAP leader Lim Kit Siang, Mr Lim Guan Eng’s father, is a cousin of the late Mr Lee. She also claimed that the younger Lim, a former finance minister, is related to other DAP leaders, including Transport Minister Anthony Loke, Local Government Development Minister Nga Kor Ming, and MPs Teresa Kok and Ngeh Koo Ham.\nA video of her speech has been widely shared on social media.\nMr Lim Guan Eng said in a Facebook post on Friday that he has hired a lawyer to pursue criminal action and legal proceedings against Dr Siti.\nOn Wednesday, The Star reported that Mr Lim had given Dr Siti 48 hours to prove her remarks about his alleged communist ties.\nIn the Facebook post, he added that her remarks were a fabrication to incite fear of DAP and the ethnic Chinese community in Malaysia.\n“What makes Siti Mastura’s irresponsible behaviour more unacceptable is there is no remorse from Siti Mastura that she had made a hate speech full of outrageous lies, (that were) racist and extremist.\n“She has refused to show proof of the alleged family ties nor recanted or apologised for her outrageous lies and malicious slander,” he said.\nHe also asked that PAS president Abdul Hadi Awang and Perikatan Nasional chairman Muhyiddin Yassin publicly state their position on the claims made by Dr Siti.\nSeveral other lawmakers have called on the police to investigate Dr Siti for alleging that DAP stalwart Lim Kit Siang is related to Mr Chin, The Star newspaper reported.\nMP Syerleena Rashid from DAP lodged a police report on Thursday, saying that Dr Siti’s actions were malicious with intent to distort facts and create a negative perception of the DAP stalwart and his family.\nMs Syerleena told reporters that Dr Siti’s claims that the younger and older Lims were related to other DAP leaders like Mr Loke and Ms Kok were “a bid to say that DAP practises nepotism and abuse of power”.\nVarious media outlets have reported that Dr Siti has yet to retract her allegations.", "url": "https://www.straitstimes.com/asia/se-asia/dap-chairman-lim-guan-eng-launches-legal-action-against-opposition-mp-for-false-claims"}