{"authors": [], "date_download": "2024-10-12 13:48:03", "date_modify": "2024-10-12 13:48:03", "date_publish": "2022-07-08 18:05:11", "description": "The city has relaxed some restrictions amid a surge in cases. Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-health-chief-rules-out-quarantine-free-travel-for-now_1728740883.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/08/ads-travel-080722.jpg?VersionId=XtSRL.xwFBHiLoHNERWrDaI5k7dHe4EE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-health-chief-rules-out-quarantine-free-travel-for-now_1728740883.html", "title": "Hong Kong health chief rules out quarantine-free travel for now", "title_page": "Hong Kong health chief rules out quarantine-free travel for now | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (BLOOMBERG) - Hong Kong's new health chief has rejected calls for quarantine-free travel in the near future and to live with Covid-19, even as the city relaxes some restrictions amid a surge in cases.\nLo Chung-mau, who was appointed Secretary for Health by new Chief Executive John Lee, said in an interview with local newspaper Oriental Daily that it's unreasonable to pursue a full-blown border reopening with mainland China or the rest of the world, and that the government is currently targeting reducing inconveniences to allow more people to travel.\nThe city would see far more than 9,000 deaths if it were to live with the virus, Lo added, citing the large numbers of deaths in the US and UK after the countries reopened.\nIn an expansive response to questions at Hong Kong's daily virus briefing on Friday (July 8) - Lo's first appearance - he warned that residents needed to have appropriate expectations and said it won't be possible to reopen borders in the short term without quarantine.\nLee has said that Hong Kong must reduce travel inconveniences while curbing the spread of the virus, confirming that the city will continue to adhere to China's Covid-Zero policy and avoid lifting travel restrictions completely.\nThe Hong Kong government has relaxed some measures recently, including the suspension of a system that banned airlines if they carried too many infected passengers. However, local business groups have been pushing the government above all to cancel hotel quarantine, arguing the city risks losing its status as a global financial hub if travel continues to be restrictive.\nA surge in infections will test Hong Kong's ability to relax travel curbs further, though Lo said the government is working on reducing the quarantine period for inbound travelers. The city reported almost 3,000 cases on Friday, and health officials have warned that daily infections could double in two weeks.\nLo also said that the city won't relax social distancing measures and will continue to focus on testing and isolation in order to reduce transmission and support Hong Kong's health system. He urged more people to get vaccinated.\nAbout 89 per cent of the population has been fully vaccinated, but the ratio falls to 64 per cent for those 80 and above. The number of Covid patients in Hong Kong's hospitals has doubled from last month to more than 800, according to health officials. They've previously warned that if the situation deteriorates, hospitals may have to suspend non-essential care services to cope with the pressure.\nSeparately, Lo said in a Legislative Council question and answer session that a closed-loop quarantine arrangement proposed by the pro-Beijing Democratic Alliance that would see travelers isolate in Hong Kong before going to mainland China wasn't something that can be achieved in a short period of time. He is communicating with the Hong Kong and Macau Affairs Office about the plan, he said.", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-health-chief-rules-out-quarantine-free-travel-for-now"}