{"authors": [], "date_download": "2024-10-12 13:34:51", "date_modify": "2024-10-12 13:34:51", "date_publish": "2024-09-17 13:17:00", "description": "Two health departments officials were also removed. Read more at straitstimes.com.", "filename": "asia_south-asia_indian-police-chief-in-kolkata-sacked-after-protests-over-doctor-s-murder_1728740091.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/11603666.jpg?VersionId=GKVU2dIFh4QX62KTGLk8627xpWuolBp0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_indian-police-chief-in-kolkata-sacked-after-protests-over-doctor-s-murder_1728740091.html", "title": "Indian police chief in Kolkata sacked after protests over doctor’s murder", "title_page": "Indian police chief in Kolkata sacked after protests over doctor’s murder | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KOLKATA – Indian authorities in Kolkata have sacked the city’s police chief and top health ministry officials after furious protests at the brutal rape and murder of a doctor.\nThe discovery of the 31-year-old doctor’s bloodied body at a state-run hospital in the eastern megacity on Aug 9 has stoked nationwide anger at the chronic issue of violence against women.\nThe murder has triggered protests across India and repeated strikes by medics demanding safer conditions for women.\nWhile many protests and strikes have since calmed in the rest of India, regular demonstrations continue in Kolkata, the capital of West Bengal state.\nWest Bengal chief minister Mamata Banerjee announced the removal of the Kolkata police commissioner and two health departments officials after a meeting with medics late on Sept 16.\n“We have agreed to remove the director of health services and director of medical colleges,” Ms Banerjee told reporters after the meeting.\n“Vineet Goyal, commissioner of Kolkata police, will also be removed, as demanded by the junior doctors.”\nShe also urged the doctors to return to work, saying emergency operations were being affected by their strike.\nBut Mr Aniket Mahato, spokesman of the West Bengal Junior Doctors Front protest group, said they would not stop demonstrations until investigations in the case were completed.\nOne man has been detained for the murder, but West Bengal’s state government has faced public criticism over the handling of the investigation.\n“We reached an agreement on certain points, but disagreement remains,” Mr Mahato told AFP.\nThousands of protesters marched through the streets of the city on Sept 16, chanting slogans and demanding justice for the victim.\nIndia’s Supreme Court in August ordered a national task force to examine how to bolster security for healthcare workers, saying the brutality of the killing had “shocked the conscience of the nation”.", "url": "https://www.straitstimes.com/asia/south-asia/indian-police-chief-in-kolkata-sacked-after-protests-over-doctor-s-murder"}