{"authors": [], "date_download": "2024-10-12 13:58:58", "date_modify": "2024-10-12 13:58:58", "date_publish": "2024-06-11 23:45:26", "description": "AMSTERDAM - Dutch military intelligence said on Monday that Chinese cyber espionage was more extensive than it had initially thought, targeting Western governments and defence companies. Read more at straitstimes.com.", "filename": "asia_dutch-intelligence-says-chinese-cyber-espionage-goes-wider-than-it-suspected_1728741538.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/11/LYNXMPEK5A0NM-2.jpg?VersionId=RSFk0O7p5N0Znp8099sjMZMMPRDggPsg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_dutch-intelligence-says-chinese-cyber-espionage-goes-wider-than-it-suspected_1728741538.html", "title": "Dutch intelligence says Chinese cyber espionage goes wider than it suspected", "title_page": "Dutch intelligence says Chinese cyber espionage goes wider than it suspected | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AMSTERDAM - Dutch military intelligence said on Monday that Chinese cyber espionage was more extensive than it had initially thought, targeting Western governments and defence companies.\nThe MIVD agency said a Chinese state-backed hacking group that was behind a 2023 hacking attack on the Dutch defence ministry had claimed at least 20,000 victims worldwide in a few months, and possibly far more.\nChina's embassy in The Hague did not immediately respond to a request for comment. Beijing routinely denies allegations of cyber espionage and says it opposes all forms of cyberattack.\n\"Targets included dozens of Western governments, international organisations, and numerous companies operating in the defence industry\", the MVID said in a statement.\nIt urged organisations to adopt the \"Assume Breach\" principle, in which it is assumed that a successful digital attack has already taken place or will take place soon.\nIn April, MIVD said in its annual report that Chinese spies had targeted Dutch semiconductor, aerospace and maritime industries to try to strengthen China's armed forces. REUTERS", "url": "https://www.straitstimes.com/asia/dutch-intelligence-says-chinese-cyber-espionage-goes-wider-than-it-suspected"}