{"authors": [], "date_download": "2024-10-12 14:01:15", "date_modify": "2024-10-12 14:01:15", "date_publish": "2024-03-13 17:13:00", "description": "China’s Foreign Ministry spokesperson Wang Wenbin condemned the proposed ban. Read more at straitstimes.com.", "filename": "asia_east-asia_china-warns-proposed-tiktok-ban-will-come-back-to-bite-us_1728741675.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/13/2024-03-06T173519Z766627550RC2GG6AFAYXXRTRMADP3USA-TIKTOK-CONGRESS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-warns-proposed-tiktok-ban-will-come-back-to-bite-us_1728741675.html", "title": "China warns proposed TikTok ban will ‘come back to bite’ US", "title_page": "China warns proposed TikTok ban will ‘come back to bite’ US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Beijing warned on March 13 that a proposed ban on Chinese-owned video-sharing app TikTok would “inevitably come back to bite the United States”.\nThe US House of Representatives is set to vote later on March 13 on a Bill that would force the app to cut ties with its Chinese owner or get banned in the US.\nThe legislation is the biggest threat yet to the video-sharing app, which has surged to huge popularity across the world while raising fears among governments and security officials over its Chinese ownership and potential subservience to the Communist Party in Beijing.\nAhead of the vote, Foreign Ministry spokesperson Wang Wenbin condemned the proposed ban.\n“Although the United States has never found evidence that TikTok threatens US national security, it has not stopped suppressing TikTok,” he said.\n“This kind of bullying behaviour that cannot win in fair competition disrupts companies’ normal business activity, damages the confidence of international investors in the investment environment, and damages the normal international economic and trade order,” he added.\n“In the end, this will inevitably come back to bite the United States itself,” Mr Wang said.\nThe vote is likely to occur at 10am (10pm Singapore time) and is expected to pass overwhelmingly in a rare moment of bipartisanship in politically divided Washington.\nThe fate of the Bill is uncertain in the Senate, where key figures are against making such a drastic move against a hugely popular app that has 170 million US users.\nPresident Joe Biden will sign the Bill, known officially as the Protecting Americans from Foreign Adversary Controlled Applications Act, into law if it comes to his desk, the White House has said.\nTikTok staunchly denies any ties to the Chinese government and has restructured the company so the data of US users stays in the country, the company says.\nTikTok chief executive Shou Zi Chew is in Washington, trying to shore up support to stop the Bill.\n“This latest legislation, being rushed through at unprecedented speed without even the benefit of a public hearing, poses serious Constitutional concerns,” wrote Mr Michael Beckerman, TikTok’s vice-president for public policy, in a letter to the Bill’s co-sponsors seen by AFP. AFP", "url": "https://www.straitstimes.com/asia/east-asia/china-warns-proposed-tiktok-ban-will-come-back-to-bite-us"}