{"authors": [], "date_download": "2024-10-12 14:05:36", "date_modify": "2024-10-12 14:05:36", "date_publish": "2020-07-28 22:58:08", "description": "PETALING JAYA (THE STAR/ASIA NEWS NETWORK) - The Perikatan Nasional (PN) government respects the High Court's guilty verdict against one of its MPs, Najib Razak, on seven charges of abuse of power, criminal breach of trust and money laundering, Prime Minister Muhyiddin Yassin said on Tuesday (July 28). Read more at straitstimes.com.", "filename": "asia_se-asia_pm-muhyiddin-says-his-govt-will-always-uphold-rule-of-law-after-najibs-verdict_1728741936.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/07/28/yq-c1-28072020.jpg?VersionId=1A4Gaop9oJaqNAXyBhxaYoxbhbiCcoGy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_pm-muhyiddin-says-his-govt-will-always-uphold-rule-of-law-after-najibs-verdict_1728741936.html", "title": "Malaysia PM Muhyiddin says his govt will always uphold rule of law after Najib's verdict", "title_page": "Malaysia PM Muhyiddin says his govt will always uphold rule of law after Najib's verdict | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA (THE STAR/ASIA NEWS NETWORK) - The Perikatan Nasional (PN) government respects the High Court's guilty verdict against one of its MPs, Najib Razak, on seven charges of abuse of power, criminal breach of trust and money laundering, Prime Minister Muhyiddin Yassin said on Tuesday (July 28).\nHe called on Malaysians to continue to have faith in the independent judicial system, following the guilty verdict delivered in Najib's case.\n\"Let us continue to have faith in the judicial system.\n\"I understand the feelings and sentiments you are experiencing - but let me stress that the government will always uphold the rule of law,\" Tan Sri Muhyiddin said in a statement.\nHe said the government respects Najib's right to appeal and asked for space for the legal process to take place to ensure justice is upheld.\nFormer prime minister Najib was sentenced to 12 years' jail and fined RM210 million (S$68.1 million) after being found guilty of all seven charges in the first of his five trials relating to the 1Malaysia Development Berhad (1MDB) scandal.\nHigh Court Judge Mohd Nazlan Mohd Ghazali found Najib, 67, guilty of one count of abuse of power, three counts of criminal breach of trust and three counts of money laundering regarding the misappropriation of RM42 million from SRC International, a former subsidiary of 1MDB.\nMembers of the opposition on Tuesday hailed the court's decision, a reverse of their anger against the PN government in May, after money laundering charges against Najib's stepson, Mr Riza Aziz, relating to 1MDB funds were dropped, in a settlement reached with prosecutors.\nMeanwhile, Najib can remain as a Member of Parliament until the appeal process is exhausted, said Speaker of Parliament Azhar Azizan Harun.\nHe said Najib could still attend parliamentary sessions, with the ongoing session to last till Aug 27, Malay Mail online news quoted him as saying.\n\"According to the provisions of the Federal Constitution, his status as a Member of Parliament has not changed until all the appeal process is completed,\" he told Malay Mail when contacted.\nArticle 48 (1) (e) of the Federal Constitution states that an MP will be disqualified if he is sentenced to more than one year in prison or a fine of more than RM2,000, and does not receive a pardon.\nNajib, the MP for his home town of Pekan in Pahang, is the first former Malaysian prime minister found guilty of criminal charges.", "url": "https://www.straitstimes.com/asia/se-asia/pm-muhyiddin-says-his-govt-will-always-uphold-rule-of-law-after-najibs-verdict"}