{"authors": ["Zunaira Saieed"], "date_download": "2024-10-12 14:21:21", "date_modify": "2024-10-12 14:21:21", "date_publish": "2024-01-05 12:00:00", "description": "A memorandum of understanding on the SEZ is expected to be inked by both sides on Jan 11. Read more at straitstimes.com.", "filename": "asia_se-asia_state-govt-proposing-iskandar-region-be-designated-johor-s-pore-special-economic-zone_1728742881.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/05/2023112922535431img5073.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_state-govt-proposing-iskandar-region-be-designated-johor-s-pore-special-economic-zone_1728742881.html", "title": "Johor state govt proposes Iskandar Malaysia be designated special economic zone with Singapore", "title_page": "Johor state govt proposes Iskandar Malaysia be designated special economic zone with Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Johor’s state government has proposed that its business hub Iskandar Malaysia be designated as the special economic zone being planned between Singapore and Malaysia, The Straits Times has learnt.\nIt is not known, though, if Malaysia’s federal government agrees and will discuss the proposal with Singapore. A memorandum of understanding on the Johor-Singapore Special Economic Zone (SEZ) is expected to be inked by both sides on Jan 11.\n“The Iskandar development region is ready-made to be the SEZ,” said Mr Lee Ting Han, chairman of Johor’s state investment, trade and consumer affairs committee.\nIskandar, which was conceptualised as an economic growth corridor in 2006, spans 2,217 sq km across southern Johor, an area three times the size of Singapore. It includes Johor’s heavy industrial zone Pasir Gudang, its capital city Johor Bahru, Iskandar Puteri, Kulai, Sedenak and part of Pontian town.\nIt attracted foreign investments to the tune of RM153.4 billion (S$44 billion) between 2006 and 2022 in various industries, ranging from electrical and electronics and data centres, to pharmaceutical and food processing. Singapore is the second-largest foreign investor in Iskandar after China, with RM33 billion committed as at June 2023.\nInvestment slowed in recent years due to Covid-19 pandemic border restrictions, contributing to a property glut. Total investment in Iskandar since its inception was forecast to reach more than RM400 billion in 2023, said Mr Lee.\nAccording to him, Iskandar has the necessary infrastructure and facilities, such as highways, ports, utilities supply, townships and educational institutions, that would be suitable for the SEZ.\n“The Iskandar growth corridor would be a good start, as the area encompasses planned integrated development Ibrahim Technopolis in Sedenak town, the heavy industrial area in Pasir Gudang and the proposed special financial zone in Forest City,” he told The Straits Times.\nThe SEZ, which was officially announced in October 2023 during Malaysian Prime Minister Anwar Ibrahim’s visit to Singapore for the 10th Malaysia-Singapore Leaders’ Retreat, is an integrated zone for business and investment that is aimed at easing the movement of people and goods across the border between the two countries.\nMr Lee told ST that Johor’s proposal has been submitted to the federal government’s Ministry of Economy, which is in charge of Malaysia’s economic development. But it is not known if the proposal will form part of the SEZ plans being discussed with Singapore.\nThe Ministry of Economy did not respond to ST’s queries.\nAccording to an official source, Malaysia is hoping to attract nine sectors to the SEZ, namely logistics, energy, manufacturing, tourism, healthcare, education, financial services, business services and digital economy.\nThe definitive agreement with details of the SEZ, including its physical location, is expected to be signed in the fourth quarter of 2024, said Mr Lee.\nOn the face of it, both the Iskandar project and the upcoming SEZ have similar objectives and structures – they are both Singapore-Malaysia plans that aim to boost economic activity in the region. For example, ministers on both sides have discussed developments in Iskandar since 2007, when the Malaysia-Singapore Joint Ministerial Committee for Iskandar Malaysia (JMCIM) was set up.\nHowever, analysts say the SEZ will be a step up from Iskandar. Singapore’s Prime Minister Lee Hsien Loong said in October 2023 that the SEZ should enhance the ecosystem of the Iskandar development region.\nMaybank Investment Bank said in its research note dated Dec 16, 2023, that the SEZ will bring in more investments, especially from global companies that want to co-locate in both Singapore and Johor. It added that there will be “new infrastructure developments to support the higher economic activities ahead”.\nMr Lee Ting Han said the JMCIM currently covers policy-based matters for immigration, industrial cooperation, tourism and the environment between both countries, while the SEZ will be more focused on economic matters.\nIn particular, the SEZ is expected to ease the movement of people and goods across the congested Singapore-Johor border, one of the world’s busiest land crossings.\n“The SEZ will also include special treatment for professionals, managers, executives and technicians to obtain the necessary visa at the one-stop investment facilitation centre without much hassle,” said Mr Lee.\nHe expects to also see investment incentives such as tax breaks and improved trade procedures and Customs processes for businesses in the SEZ.", "url": "https://www.straitstimes.com/asia/se-asia/state-govt-proposing-iskandar-region-be-designated-johor-s-pore-special-economic-zone"}