{"authors": [], "date_download": "2024-10-12 13:40:22", "date_modify": "2024-10-12 13:40:22", "date_publish": "2024-08-25 23:47:46", "description": "The flood waters have left many people isolated and in urgent need of necessities. Read more at straitstimes.com.", "filename": "asia_twenty-dead-5-million-affected-in-bangladesh-floods_1728740422.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/26/LYNXMPEK7O04U-2.jpg?VersionId=ilGpVbnb0vKoYzDcECygW8BW4MsHHqpu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_twenty-dead-5-million-affected-in-bangladesh-floods_1728740422.html", "title": "20 dead, 5 million affected in Bangladesh floods", "title_page": "20 dead, 5 million affected in Bangladesh floods | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DHAKA – At least 20 people have died and more than 5.2 million have been affected in Bangladesh by floods caused by relentless monsoon rains and overflowing rivers, officials said on Aug 25.\nThe flood waters have left many people isolated and in urgent need of food, clean water, medicine and dry clothes, particularly in remote areas where blocked roads have hampered rescue and relief efforts.\nGovernment chief adviser Mohammad Yunus said in a televised address that the administration has adopted all necessary measures to ensure a swift return to normality for flood victims.\nMr Yunus, a Nobel Peace Prize winner, is leading the interim government that was sworn in after former prime minister Sheikh Hasina fled the country following a student-led uprising in August.\nMr Abdul Halim, a 65-year-old farmer from a village in the Comilla district, said his mud hut was swept away by a 3m-high surge of flood water in the middle of the night.\n“There are no goods and no water. Barely anyone has come with the relief (aid) deep inside the villages. You have to physically go close to the main road to collect it,” he told Reuters TV.\nSome people in Bangladesh have alleged that the floods were caused by the opening of dam sluice gates in neighbouring India, an assertion New Delhi has rejected.\nMr Yunus said: “We have begun discussions with neighbouring countries to prevent future flood situations.”\nThe Bangladesh Meteorological Department has warned that flood conditions could persist if the monsoon rains continue, as water levels were receding very slowly.\nMore than 400,000 people have taken refuge in around 3,500 shelters in the 11 flood-hit districts, where nearly 750 medical teams are on the ground to provide treatment, with the army, air force, navy and Border Guard Bangladesh assisting in rescue operations, the authorities said.\nAn analysis in 2015 by the World Bank Institute estimated that 3.5 million people in Bangladesh, one of the world’s most climate-vulnerable countries, were at risk of annual river flooding. Scientists attribute the exacerbation of such catastrophic events to climate change.\n“The impact of this year’s monsoon rains has been widespread and devastating,” said Ms Kabita Bose, country director of Plan International Bangladesh.\n“Entire communities have been completely inundated, and there are now millions of people, including children, in need of safe shelter and life-saving humanitarian assistance,” she added. REUTERS", "url": "https://www.straitstimes.com/asia/twenty-dead-5-million-affected-in-bangladesh-floods"}