{"authors": ["David Fogarty"], "date_download": "2024-10-12 13:28:43", "date_modify": "2024-10-12 13:28:43", "date_publish": "2023-11-14 19:05:00", "description": "An understanding of climate science will help judges as climate litigation cases spike. Read more at straitstimes.com.", "filename": "asia_see-you-in-court-training-equips-asian-judges-for-climate-litigation-cases_1728739723.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/14/aiindonesia141123.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_see-you-in-court-training-equips-asian-judges-for-climate-litigation-cases_1728739723.html", "title": "See you in court: Training equips Asian judges for climate litigation cases", "title_page": "See you in court: Training equips Asian judges for climate litigation cases | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Across the globe, courts are increasingly being used to rule on cases linked to climate change and environmental damage as the need to tackle worsening global warming and ecosystem destruction becomes more urgent.\nThat means judges are becoming vital adjudicators in cases involving everything from false claims by fossil fuel firms and regulations that fail to consider climate and environmental impacts on communities, to decisions that wrongfully approve polluting projects.\nAnd increasingly, lawsuits are being filed by ever more diverse groups, with litigants ranging from communities and cities, to environment groups and children fearful for their future.\nTo help strengthen judges’ skills and knowledge, a training course for 69 judges from India, China and South-east Asia, including Singapore, was recently held in Indonesia to share best practices, examples of recent cases and the importance of considering the latest climate science.\n“These kinds of sessions are very important because judges can connect and draw inspiration from each other,” said Ms Elizabeth Wu, a legal consultant for ClientEarth, an environmental law charity headquartered in London.\nShe said speakers and participant judges gave “great feedback” about the course, which was also a learning platform and enabled an enjoyable sharing of legal knowledge and insights among judges from different jurisdictions.\nClientEarth partnered with the Indonesian Centre for Environmental Law and the Judicial Training Centre of the Supreme Court of Indonesia to run the five-day course that began on Oct 30 and was supported by the United Nations Environment Programme.\nSpeakers at the course included senior judges known for being environmental champions and who have written key decisions around the world, as well as legal scholars and climate science experts.\nGlobally, the number of climate litigation cases has risen quickly, with over 2,300 filed to date, according to the Sabin Centre for Climate Change Law at Columbia University. Roughly two-thirds were filed since 2015, the year the Paris Climate Agreement was adopted.\nMs Wu, who is also a visiting researcher with the Asia-Pacific Centre for Environmental Law at the National University of Singapore, expected the growth trend for cases to continue.\n“That’s because climate impacts are intensifying and the green transition is becoming very urgent. And, more importantly, there’s a growing awareness among regulators, corporates and consumers and the younger population about the importance of climate change and the impact of environmental damage,” she added.\nShe said the disproportionate effects of climate change and environmental degradation on women, minorities and disadvantaged communities are also increasing globally, and often it falls to the courts to ensure legal redress.\nA June 2023 report by the Grantham Research Institute on Climate Change and the Environment and the Centre for Climate Change Economics and Policy shows challenges to the climate policy response of governments and firms have grown significantly outside the United States, which has the majority of climate litigation cases.\nIn the US, about 20 cases filed by cities and states against the carbon majors, such as leading fossil fuel companies, are now likely to go to trial, the report said.\nLitigation around investment decisions is also rising and can help clarify how decisions should be made in the context of climate change, while high carbon-emitting activities are now more likely to be challenged at different points in their life cycle, from initial financing to final project approval, the report added.\nThere have been more cases over “climate-washing”, which challenges the accuracy of green claims and commitments, the report said.\nCases will also need to consider how to incorporate the latest climate science.\n“Given that the judiciary will play an increasingly important role in climate-related justice issues, it is essential that members of the judiciary understand the scientific basis on what we know about human-caused climate change,” said Associate Professor Winston Chow from Singapore Management University, who spoke at the course.\n“A better-informed and well-educated judiciary about the basis of climate science and climate change would be more confident in assessing cases related to climate justice, such as those in which local communities affected by climate-driven impacts seek recourse from the judiciary.\n“If vulnerable communities understand that judiciaries know the basis of climate science and understand their rights, I’m quite certain it also gives these communities stronger support towards actions limiting the worst excesses of climate change,” said Prof Chow, who was recently elected as a co-chair of the Intergovernmental Panel on Climate Change, the United Nations’ top climate science body.\nJustice Bambang Hery Mulyono, chief of the Supreme Court of Indonesia’s Judicial Research and Education Agency, and a speaker at the course, said judges have a critical role in protecting and preserving the environment.\n“My hope is that by having judges with environmental certification, we can create environmental justice in the midst of the planetary crisis,” referring to climate change, biodiversity loss and pollution.\nMs Wu said challenges remain for climate and environmental cases. These include weak national climate and environmental laws that need to be strengthened, and greater scope for the involvement of regulators.\nAnother problem is that some areas of law are not fully aligned with environmental law, such as corporate and investment law.\nFor instance, corporate law tends to focus on the short-term interests of shareholders, rather than considering a broader spectrum of stakeholders and the medium- and long-term climate, human rights and environmental impacts of companies’ decisions.\nOn the international level, international investment laws that are not climate-aligned can stymie domestic regulatory reform in aid of the energy transition. So there has to be a far better alignment across different areas of law on these longer-term considerations, she said.\nJustice Suntariya Muanpawong of Thailand, who was also a speaker at the course, said: “When the executive and the legislature play an inactive role, the courts should do more. Climate litigation in many countries make real changes: The courts, especially the administrative and constitutional courts, can force the other actors to increase more protections.”", "url": "https://www.straitstimes.com/asia/see-you-in-court-training-equips-asian-judges-for-climate-litigation-cases"}