{"authors": ["Nirmal Ghosh"], "date_download": "2024-10-12 13:47:48", "date_modify": "2024-10-12 13:47:48", "date_publish": "2022-05-27 18:00:00", "description": "Shanghai is only slowly emerging now from a citywide lockdown that started in early May. Read more at straitstimes.com.", "filename": "asia_east-asia_how-covid-19-restrictions-are-choking-chinas-economy-asian-insider_1728740868.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/F-CGLX9NadnGvfk3tSH_uHdPsYeFZzFOnT5ByC_rrh8.jpg?VersionId=XUidF0V.Ifw1j7eBGJTKJOzpzhD2gLx5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_how-covid-19-restrictions-are-choking-chinas-economy-asian-insider_1728740868.html", "title": "How Covid-19 restrictions are choking China's economy: Asian Insider", "title_page": "How Covid-19 restrictions are choking China's economy: Asian Insider | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Shanghai is only slowly emerging now from a citywide lockdown that started in early May, and plans to end this lockdown by next month - but only if there are no rebounds in infections.\nNew cases outside of the quarantined areas have sent a few more districts back into lockdown.\n\"There's really no saying when the city will be fully opened, and when businesses can resume and people can go back to work,\" The Straits Times' China Bureau Chief Tan Dawn Wei said on an ST Asian Insider podcast.\nThe result: economic numbers are not looking very good.\n\"The April data across the board has been the worst since February and March, 2020, which was when Covid-19 first broke out in Wuhan and then spread to other provinces\" said Ms Tan.\n\"And this is for retail sales, and also for factory production, which has been hit badly by the lockdowns, which have disrupted supply chains. And, we've seen property sales and car sales plunge by nearly half.\n\"And also the jobless rate has gone up to about 6 per cent - also the highest since February 2020.\"\nEconomists have mostly revised down their forecasts for China's GDP growth for 2022, some to as low as 2 per cent, she said. Beijing on March 5 announced its official 2022 growth target of around 5.5 per cent - its lowest since 1991.\nAnd recent surveys have found that an increasing number of foreign companies in China are considering relocating their current or their planned investments out of China to other markets.\nThe bad news has not elicited a rethink, in fact, it is the opposite, Ms Tan said.\n\"They have doubled down on this policy, and that has been put forth through propaganda and the state media, basically saying why they need to stick to this policy, because if they don't, in a country as big as China, they will have a significant number of deaths and that would be too costly for them,\" she said.\n\"So, they have said time and again that, yes, we are facing challenging times economically, but then this is only temporary, and we will get through this.\"\nThe shock is being felt across the region and around the world, said Dr Lurong Chen, senior economist at the Jakarta-based Economic Research Institute for Asean and East Asia.\nChina as the \"world's factory\" has also stopped importing a range of products needed to feed its factories; thus it is not only China's reduced exports, but its reduced imports of raw materials and intermediate products, that have affected the region.\nAnd going digital may help people stay connected, but has its limits, Dr Chen said, speaking alongside Ms Tan on Asian Insider.\nThe Covid-19 pandemic changed the costs of trading, he said. \"Before Covid-19, we enjoyed low transportation costs and low communication costs, but during Covid-19 we've… seen the increased cost of transportation and also the increasing price of communication.\"\nDr Chen added: \"People always say that digital solutions can provide a backup or alternative. But we need to be more… realistic.\n\"Yes, digital solutions to some extent help to deal with the increasing cost in communication, because we can use smart phones and use the Internet to talk to each other… (facilitating the) ongoing global value chain.\"\nBut on the other hand, \"we still need ocean transportation. We still need flights to send cargo from one place to the other\", Dr Chen explained.", "url": "https://www.straitstimes.com/asia/east-asia/how-covid-19-restrictions-are-choking-chinas-economy-asian-insider"}