{"authors": [], "date_download": "2024-10-12 13:38:58", "date_modify": "2024-10-12 13:38:58", "date_publish": "2024-10-11 18:16:18", "description": "The Nobel Peace Prize was won by Japanese organisation Nihon Hidankyo, a grassroots movement of atomic bomb survivors from Hiroshima and Nagasaki and also known as Hibakusha. Read more at straitstimes.com.", "filename": "asia_reaction-to-nihon-hidankyo-winning-nobel-peace-prize_1728740338.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/LYNXMPEK9A0BY-1.jpg?VersionId=fiB9SPtq0jBiRKzHr8rsASOCUnys9tcn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_reaction-to-nihon-hidankyo-winning-nobel-peace-prize_1728740338.html", "title": "Reaction to Nihon Hidankyo winning Nobel Peace Prize", "title_page": "Reaction to Nihon Hidankyo winning Nobel Peace Prize | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Nobel Peace Prize was won by Japanese organisation Nihon Hidankyo, a grassroots movement of atomic bomb survivors from Hiroshima and Nagasaki and also known as Hibakusha.\nHere is reaction to Friday's announcement:\nNORWEGIAN NOBEL COMMITTEE\n\"The Hibakusha help us to describe the indescribable, to think the unthinkable, and to somehow grasp the incomprehensible pain and suffering caused by nuclear weapons.\"\nJOERGEN WATNE FRYDNES, CHAIR OF THE NORWEGIAN NOBEL COMMITTEE\n\"In a world ridden (with) conflicts, where nuclear weapons is definitely part of it, we wanted to highlight the importance of strengthening the nuclear taboo, the international norm, against the use of nuclear weapons,\" Frydnes told Reuters.\nTERUMI TANAKA, NIHON HIDANKYO CO-CHAIR, TO JAPANESE PUBLIC BROADCASTER NHK\n\"I think that the reason (we received the prize) is that the international situation today has made it so. With the war between Russia and Ukraine, and the war in the Middle East, I think the risk of nuclear weapons being used has increased greatly, and I personally have a premonition that a nuclear war will break out in the not-too-distant future.\"\nNIHON HIDANKYO CO-CHAIR TOSHIYUKI MIMAKI\n\"(The win) will be a great force to appeal to the world that the abolition of nuclear weapons and everlasting peace can be achieved,\" he told a news conference in Hiroshima, site of the Aug. 6, 1945, atomic bombing during World War Two.\n\"Nuclear weapons should absolutely be abolished.\"\nJAPANESE PRIME MINISTER SHIGERU ISHIBA\n\"It's extremely meaningful that the organisation that has worked toward abolishing nuclear weapons received the Nobel Peace Prize,\" Ishiba told a press conference in Laos.\nHIROSHIMA GOVERNOR HIDEHIKO YUZAKI\n\"We are in a situation where we’re seeing the Russian invasion of Ukraine and the use of military force in Gaza and Israel. In such tragic situations, there is growing debate around the world about whether we should use nuclear weapons, strengthen nuclear deterrence, or even have nuclear weapons. The atomic bomb survivors have been stressing how foolish this really is. The Nobel Foundation has reminded the world of this through the Peace Prize.\"\nSHIRO SUZUKI, MAYOR OF NAGASAKI CITY, ON X\n\"This award is proof that the long, steady efforts of the Hibakusha, whose average age is over 85, have been recognised internationally.\"\nJAPAN’S FORMER PRIME MINISTER FUMIO KISHIDA, ON X\n\"It is our country's mission, as the only country to have ever suffered atomic bombings during war, to continue to make efforts towards the realisation of ‘a world without nuclear weapons'.\"\nINTERNATIONAL CAMPAIGN TO ABOLISH NUCLEAR WEAPONS (ICAN), WINNER OF 2017 NOBEL PEACE PRIZE, ON X\n\"The Hibakusha, the inspirational survivors of Hiroshima and Nagasaki, have worked tirelessly to raise awareness of the catastrophic impacts of nuclear weapons and push for their total elimination.\"\nPEACE RESEARCH INSTITUTE OSLO\n\"Nihon Hidankyo's work reminds us of the devastating human cost of nuclear weapons, a message we cannot ignore. In an era where automated weapon systems and AI-driven warfare are emerging, their call for disarmament is not just historical — it is a critical message for our future.\"\nDAN SMITH, HEAD OF THE STOCKHOLM INTERNATIONAL PEACE RESEARCH INSTITUTE (SIPRI)\n\"The committee is drawing attention to a very dangerous situation in the world, with relations between China and the U.S., and between Russia and the U.S., the most toxic since the end of the Cold War.\"\nSmith said the Committee had achieved \"a triple strike\" with the prize: drawing attention to the human suffering of nuclear bomb survivors; to the danger of nuclear weapons; and to the fact that the world had survived without their use for nearly 80 years.\nRAVINA SHAMDASANI, U.N. HUMAN RIGHTS OFFICE SPOKESPERSON\n\"To us, it's recognition of the importance of grassroots organisations, and in particular survivors of horrific violations for their tireless and persistent work, often away from the spotlight without much recognition, with a lot of obstacles, with not always a tremendous amount of resources at their disposal, but for them to keep going in spite of the horrors they themselves experienced, to try to make the world a better place for all of us,\" Shamdasani told a press briefing in Geneva.\nALESSANDRA VELLUCCI, UNITED NATIONS SPOKESPERSON IN GENEVA\n“We have got now weapons that are so many more times more powerful than those that we use in Hiroshima and Nagasaki. And I think that the work of this grassroots movement (that) fights against ... even the idea that such a war can be fought again, it's absolutely critical, and that is why I think this Nobel Peace Prize is so important today.” REUTERS", "url": "https://www.straitstimes.com/asia/reaction-to-nihon-hidankyo-winning-nobel-peace-prize"}