{"authors": ["Hariz Baharudin"], "date_download": "2024-10-12 13:46:49", "date_modify": "2024-10-12 13:46:49", "date_publish": "2024-06-05 12:00:00", "description": "Some 340 foreigners were deported in 2023, a spike from 188 in 2022.  Read more at straitstimes.com.", "filename": "asia_se-asia_foreigners-working-in-bali-without-a-proper-visa-may-face-deportation-entry-ban_utm_campaign=ST_Newsletter_ASIANINSIDER_1728740809.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/05/380537136.jpg?VersionId=oJN_S3k4iw5oD1ZYCiq4ikZqKXb4m6By", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_foreigners-working-in-bali-without-a-proper-visa-may-face-deportation-entry-ban_utm_campaign=ST_Newsletter_ASIANINSIDER_1728740809.html", "title": "Foreigners working in Bali without a proper visa may face deportation, entry ban", "title_page": "Foreigners working in Bali without a proper visa may face deportation, entry ban | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Thinking of running an in-person workshop, organising an event or spending weeks working from a cafe during a Bali getaway? You risk being sent back home, as the Indonesian authorities crack down on foreign visitors breaking immigration laws.\nForeigners working from the popular Indonesian tourist destination must hold proper visas, and the authorities have emphasised how they will not tolerate those who flout the rules, amid recent news of travellers misbehaving on the island.\n“We will take firm action. There have been those who have been deported,” Indonesian Minister for Tourism and Creative Economies Sandiaga Uno said on May 29.\n“Repeat offenders will be given sanctions and will not be allowed to visit Indonesia for several years.”\nBali has been experiencing a post-pandemic tourist boom. The authorities said that in the first quarter of 2024, some 1.3 million people visited the island, an increase of about 32 per cent compared with the same period in 2023.\nBut reports of reckless, rowdy and disrespectful foreigners on the island have also increased, alongside those outrightly breaking the law or working without the necessary permits.\nIndonesia offers a variety of visas for those keen to work in the country, including temporary resident permits, visas for investors, and a remote worker visa that is valid for a year.\nIn May, the authorities raided a suspected drug lab in a villa in the Canggu district, that reportedly earned around four billion rupiah (S$330,000) in six months supplying drugs across the island.\nTwo Ukrainians, a Russian, and an Indonesian were arrested for running the lab that police alleged produced drugs including cocaine and hydroponic marijuana.\nA month earlier, two producers of a reality show featuring South Korean celebrities, including Hyoyeon from Girls’ Generation and Dita Karang from Secret Number, were deported by the Bali Immigration Office for unauthorised filming and for misusing their stay permit.\nIn November 2023, a 30-year-old Chinese man was deported from Bali after the authorities uncovered his covert travel agency operation and he had failed to produce proper documentation.\nDeportation figures have risen significantly. Some 340 foreigners were sent back to their home countries in 2023, a marked increase from the 188 in 2022.\nIn the first quarter of 2024 alone, 37 foreigners were deported and 27 others detained.\nMr Sandiaga noted that these numbers are small compared with the millions of tourists that arrive in Bali, but “we have to be more firm in cracking down on misbehaving tourists”.\nOn May 15, Coordinating Minister for Maritime and Investment Affairs Luhut Binsar Pandjaitan warned that troublemaking foreigners would be barred from entering Indonesia.\n“I propose anyone who creates chaos in our country, the foreign tourists who may toy around with drugs or online gambling or rampage, not be allowed to enter Indonesia any more,” said Mr Luhut, who is one of Indonesia’s most senior officials.\nMs Megawati Soekarnoputri, former Indonesian president and chairwoman of the ruling Indonesian Democratic Party of Struggle, recently criticised the way Bali is being run.\nIn a speech on May 27, she took aim at how the island has become a hotbed for drug trafficking, the lack of clean water for residents due to tourism development, and how the people of Bali were not reaping the benefits of tourism.\nIn response, Mr Sandiaga said on Instagram on May 29 that her criticism will be taken as “constructive input” for improving Bali.\n“From punishment to deportation, (that) is our firm action so that Indonesian cultural norms and customs are no longer trampled on... We will immediately take firm action against all prohibited things,” he added.", "url": "https://www.straitstimes.com/asia/se-asia/foreigners-working-in-bali-without-a-proper-visa-may-face-deportation-entry-ban?utm_campaign=ST_Newsletter_ASIANINSIDER"}