{"authors": ["Hariz Baharudin"], "date_download": "2024-10-12 13:49:34", "date_modify": "2024-10-12 13:49:34", "date_publish": "2024-07-25 12:15:00", "description": "Experts caution that without intervention, corruption in the country could worsen. Read more at straitstimes.com.", "filename": "asia_se-asia_experts-warn-of-rising-corruption-in-indonesia-as-nearly-half-of-voters-polled-were-offered-bribes_1728740974.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/25/LYNXNPEK2Q015-1.jpg?VersionId=rW13eI8inPLvFMC3ulj_uVqnA4wyw1u3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_experts-warn-of-rising-corruption-in-indonesia-as-nearly-half-of-voters-polled-were-offered-bribes_1728740974.html", "title": "Concerns over rising corruption in Indonesia as nearly half of voters polled were offered bribes", "title_page": "Concerns over rising corruption in Indonesia as nearly half of voters polled were offered bribes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Nearly one in two voters admitted to having been offered bribes during the elections in February, according to a recent study conducted by Indonesia’s official statistics board. It also found an increasing tolerance towards corruption in South-east Asia’s largest country.\nThese findings signal a worsening trend if stronger countermeasures are not swiftly implemented, experts warned, adding that poverty and a lack of education in the country were exacerbating the issue.\nOn July 15, official statistics board Statistics Indonesia (BPS) said in a report on its website that in the lead-up to the Feb 14 elections, more than 46 per cent of voters were offered money, goods or facilities to choose certain candidates.\nThe study did not say how many accepted such bribes during the polls, in which more than 200 million people registered to vote for a new president, legislators and other leaders.\nThe same report also said the country’s anti-graft index slipped to its lowest level since 2021, from 3.93 to 3.85, well below the government’s target of 4.1.\nThis index measures how permissive people are towards corrupt practices. A score of five indicates a strong rejection of graft, while zero represents a high tolerance for it. This figure was 3.92 in 2023, and 3.93 in 2022.\nThe BPS findings reflect how there is an understanding in Indonesia that corruption is widely accepted and even expected, Associate Professor Yohanes Sulaiman from Jenderal Achmad Yani University told The Straits Times.\n“If (candidates) want their votes, they have to pay a certain amount of money. Is it problematic? Yes, but at the same time, people are used to it. That’s why corruption is seen as ingrained,” he said.\nUnder Indonesian law, purchasing votes is illegal and can earn offenders fines and jail time. But that has not stopped the practice from becoming commonplace, particularly in rural areas.\nFor instance, a legislative candidate in the Bondowoso regency in East Java caused a stir during the recent hustings when he said he intended to sell one of his kidneys to finance his campaign expenses.\nMr Erfin Sudanto from the National Mandate Party said he needed US$50,000 (S$67,000) for his campaign, adding that a significant portion of that sum would be spent on what he called “tips” to gain the support of potential voters.\nThe expectation of having to buy the support of voters creates a deeper problem. When political candidates plan their budget, money has to be set aside not just to campaign, but also for this culture of vote buying, said Mr Nicky Fahrizal, a researcher at the Centre for Strategic and International Studies (CSIS) think-tank.\n“Candidates, whether willingly or not, often seek loans or financial support from any available source to cover these costs,” said Mr Nicky, who is part of CSIS’ politics and social change department.\n“This situation creates an entry point for corruption or bribery within the government, both at the central and regional levels, typically manifesting as bribes or fraudulent projects.”\nMr Made Supriatma, who is also a visiting fellow from the same institute, said that recently, bribery has manifested in a different way, with communities receiving benefits collectively, and not individually.\nHe cited, for example, how during previous elections, a hamlet in Bantul in Central Java pooled its residents’ votes for a legislative candidate who provided a down payment to build a community hall.\nIn a separate election, the same community pooled its votes for another candidate who was willing to pave roads in the village.\nNot all Indonesians see vote buying or bribery as bad, said Mr Made. “It may not change policy, but when voters choose to act collectively, these bribes become something useful for their community.”\nWhen asked what can be done to stamp out corruption and bribery in the archipelago, all the experts ST spoke to agreed that such practices will remain ingrained in Indonesia for the foreseeable future, on account of how deeply rooted they are.\nEffective leadership is needed to address this issue, said Mr Edbert Gani Suryahudaya from CSIS’ department of politics and social change.\n“Many elites and politicians are involved in these practices, creating interdependencies. We need a stronger state with the capacity to act impartially,” he added.\nPoliticians who say they wish to address corruption can automatically gain support, said Mr Made, but he added that whether they follow through with such promises is another matter.\n“Not many politicians are willing to take this path because it means cutting off the resources they need to get elected,” he said.\nProf Yohanes called for a reform of Indonesia’s Corruption Eradication Commission (KPK), as well as the judiciary and police force.\nAnti-graft activists and experts have decried how Indonesia’s amendment of its anti-corruption law in 2019 eroded the KPK’s powers, which was seen as a systematic effort to weaken the agency after it was touted to have stepped on too many toes of corrupt officials.", "url": "https://www.straitstimes.com/asia/se-asia/experts-warn-of-rising-corruption-in-indonesia-as-nearly-half-of-voters-polled-were-offered-bribes"}