{"authors": [], "date_download": "2024-10-12 13:39:18", "date_modify": "2024-10-12 13:39:18", "date_publish": "2024-08-29 17:23:44", "description": "LUCKNOW, India - Indian authorities captured on Thursday one of three wolves that have killed six children and a woman in the northern state of Uttar Pradesh over the last two weeks. Read more at straitstimes.com.", "filename": "asia_indian-authorities-capture-one-of-three-wolves-that-have-killed-six-children_1728740358.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/ST-logo-placeholder_16.jpg?VersionId=yg_pq6MMrVytHoGk6n40QLrwxHxQItMd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_indian-authorities-capture-one-of-three-wolves-that-have-killed-six-children_1728740358.html", "title": "Indian authorities capture one of three wolves that have killed six children", "title_page": "Indian authorities capture one of three wolves that have killed six children | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LUCKNOW, India - Indian authorities captured on Thursday one of three wolves that have killed six children and a woman in the northern state of Uttar Pradesh over the last two weeks.\nMore than 30 villages in the district of Bahraich, home to dense forest, have been attacked by wolves in recent days, said Akash Deep Badhawan, a senior officer of the Indian Forest Services.\nDuring the summer, it's common for villagers in India to sleep on mats or beds made from woven rope outside their homes where it is cooler, which made the victims vulnerable.\nThree wolves were identified as the killers and were tracked with drones equipped with cameras and thermal mapping software. Authorities continue to pursue the other two wolves.\n\"The district administration and forest department have deployed several teams to guard the villages and catch hold of them,\" Badhawan said.\n\"The situation is a bit tricky as this particular species of wildlife is very cunning in nature. We have advised the villagers to not sleep in the open along with their children.\"\nWhile leopard and tiger attacks are regularly reported in India, wolf attacks are unusual.\nAuthorities in Bahraich have also installed loudspeakers and flood lights to deter the animals. Forest officials from five nearby districts have been deployed to help capture the animals, Badhawan said.\n\"We are planning to use elephant dung and urine to keep the pack of wolves at bay from residential areas,\" he said, adding that wolves typically live in packs of six to 10 and avoid areas where big animals like elephants dwell.\n\"The burning of the dung cake would create an illusion of elephant presence in the area.\" REUTERS", "url": "https://www.straitstimes.com/asia/indian-authorities-capture-one-of-three-wolves-that-have-killed-six-children"}