{"authors": [], "date_download": "2024-10-12 13:36:51", "date_modify": "2024-10-12 13:36:51", "date_publish": "2024-08-16 12:31:04", "description": "China also backed a regional plan to find a way out of the ongoing crisis in Myanmar. Read more at straitstimes.com.", "filename": "asia_china-will-support-a-democratic-transition-in-myanmar-says-foreign-minister_1728740211.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/16/2024-07-26T025406Z1320049577RC2Q29AN8R95RTRMADP3ASEAN-LAOS.JPG?VersionId=8tNk4_V3djy0EjD93jv6EGFYbGQ0rdrf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-will-support-a-democratic-transition-in-myanmar-says-foreign-minister_1728740211.html", "title": "China will support a democratic transition in Myanmar, says foreign minister", "title_page": "China will support a democratic transition in Myanmar, says foreign minister | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CHIANG MAI, Thailand - China will support a democratic transition in Myanmar and backs a regional plan to find a way out of the ongoing crisis in the South-east Asian country, Foreign Minister Wang Yi said on Aug 16 during a visit to Thailand.\nMr Wang's comments at a media conference came after he met with Myanmar's junta chief General Min Aung Hlaing during a visit to the war-torn country this week.\n\"China continues its commitment to restore peace and stability in Myanmar,\" he said in translated remarks.\nChina has promised technical support and aid for conducting a census, followed by an election that is currently planned to be held next year, junta-run media said on Aug 15.\nMyanmar has been in turmoil since February 2021 when the military ousted an elected civilian government in a coup, abruptly ending the impoverished country's tentative steps towards becoming a full-fledged democracy.\nIn Thailand to attend a regional meeting, Mr Wang said that China also supports a peace plan agreed to by the Association of South-east Asian Nations (Asean), known as its five-point \"consensus\", to resolve the crisis in Myanmar. REUTERS", "url": "https://www.straitstimes.com/asia/china-will-support-a-democratic-transition-in-myanmar-says-foreign-minister"}