{"authors": [], "date_download": "2024-10-12 13:38:04", "date_modify": "2024-10-12 13:38:04", "date_publish": "2024-09-17 18:58:00", "description": "Extracting highly radioactive fuel and debris remains the most challenging part of decommissioning the facility. Read more at straitstimes.com.", "filename": "asia_japan-suspends-trial-removal-of-fukushima-nuclear-debris_1728740284.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/11596409.jpg?VersionId=7h4QlekKGtJtG2CssJfM8mJJicglU.LD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_japan-suspends-trial-removal-of-fukushima-nuclear-debris_1728740284.html", "title": "Japan suspends trial removal of Fukushima nuclear debris", "title_page": "Japan suspends trial removal of Fukushima nuclear debris | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – The operator of Japan’s stricken Fukushima nuclear plant said on Sept 17 that it has suspended an operation to remove a sample of highly radioactive material because of a new technical problem.\nExtracting the estimated 880 tonnes of highly radioactive fuel and debris inside the former power station remains the most challenging part of decommissioning the facility, which was hit by a catastrophic tsunami in 2011.\nRadioactivity levels inside are far too high for humans to enter, and earlier in September, engineers began inserting an extendable device to try and remove a small sample.\nHowever, Tokyo Electric Power Company (Tepco) had to halt the procedure on Sept 17 after noticing that remote cameras on the apparatus were not beaming back images to the control centre.\n“We are investigating the cause of the problem,” Tepco spokesman Tatsuya Matoba told AFP.\n“We need to find out the cause of the trouble before resuming,” he said.\nTepco originally planned to start on Aug 22, aiming to collect 3g for analysis, but technical problems caused a delay.\nThree of Fukushima’s six reactors went into meltdown after a tsunami triggered by Japan’s biggest earthquake on record swamped the facility in one of the world’s worst atomic accidents.\nJapan began in 2023 releasing into the Pacific Ocean some of the 540 Olympic-sized swimming pools’ worth of reactor cooling water amassed since the catastrophe.\nChina and Russia banned Japanese seafood imports as a result, although Tokyo insists the discharge is safe, a view backed by the UN atomic agency.\nIn a Tepco initiative to promote food from the Fukushima area, swanky London department store Harrods began selling peaches grown in the region in September. AFP", "url": "https://www.straitstimes.com/asia/japan-suspends-trial-removal-of-fukushima-nuclear-debris"}