{"authors": [], "date_download": "2024-10-12 13:50:10", "date_modify": "2024-10-12 13:50:10", "date_publish": "2022-04-08 20:10:50", "description": "Food shortages are hitting high earners after middle-class residents have been struggling for weeks. Read more at straitstimes.com.", "filename": "asia_east-asia_shanghais-elite-are-joining-hunt-for-groceries-under-covid-19-lockdown_1728741010.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/08/wgt-shanghaifood-080422.jpg?VersionId=JPA_e1kPYQZPSUJcvx31ToFhXdAYbiX1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_shanghais-elite-are-joining-hunt-for-groceries-under-covid-19-lockdown_1728741010.html", "title": "Shanghai's elite are joining hunt for groceries under Covid-19 lockdown", "title_page": "Shanghai's elite are joining hunt for groceries under Covid-19 lockdown | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (BLOOMBERG) - Even the wealthy are struggling to buy food as Shanghai's lockdown drags on.\nMs Kathy Xu, one of China's top venture capitalists and an investor in grocery businesses including Meituan, Yonghui Superstores Co and DingDong Maicai, turned to a community WeChat group to get bread and milk, according to a post seen and verified by Bloomberg News.\nCapital Today, the company she founded and which manages US$2.5 billion (S$3.4 billion), did not immediately respond to a request for comment.\nMs Xu's post reflects that food shortages are hitting the city's high-earners after middle-class residents have been struggling for weeks.\nShanghai is the epicentre of China's worst outbreak since the early days of the pandemic in Wuhan and authorities have doubled down on their Covid Zero pillars of mass testing and lockdowns to try and stamp out infections.\nIt has swiftly turned into a logistical nightmare as the city's 25 million residents - sealed off in their homes for more than a week already - struggle to get basic groceries delivered and officials seek to censor growing public discontent.\nOfficials have stepped up assistance in recent days, with some residents receiving packs including eggs, milk, vegetables and meat. But some areas of the city have not received them and delivery apps cannot keep up with the surging number of people trying to get a hold of daily necessities as drivers are also locked down.\nIt has sparked a rise in group-buying, in which a residential compound coordinates bulk purchases and distribution, typically through a WeChat group.\nMr David Fishman, a 32-year-old energy industry consultant, just bought 4,200 yuan (S$900) of bread for himself and more than 60 neighbours, which they hope will be delivered on Saturday (April 9).\nHe is in three other grocery groups, and still waiting for separate bulk orders of vegetables and pork to be delivered, as well as milk promised by the local resident's committee.\nReaching deals with wholesalers is not usually a problem, as long as orders meet their minimum price, according to Ms Vivian Feng, who has led group-buying efforts for her residential compound since going into lockdown in mid-March.\nStill, some residents can baulk at the expense or reject orders for other reasons, which can be a pain to manage, she said. While the buying groups have been effective at getting food to residents, even they are getting overwhelmed by demand.\n\"I only got to join the group buying in our residential compound once,\" said Ms Miranda Zheng, who lives in the eastern part of Shanghai and has been quarantined for almost 10 days. \"I found a delivery guy on Meituan and tip him hundreds of yuan everyday so that he can send me food.\"\nAuthorities on Friday said rumours that Shanghai would halt group purchases were false, and have previously pledged to step up supply efforts.\nAt a Shanghai municipal briefing on Thursday morning, Ms Mao Fang, vice president of Chinese e-commerce giant Meituan said the food delivery company would bring in 1,000 sorting workers from outside the city to speed up deliveries.\nShanghai's Vice Mayor Chen Tong has also said the city is working with online platforms and supermarkets to set up special emergency channels to meet the needs of residents especially the elderly and infants.\nWith group-buying one of the few ways that families can access enough food during the lockdown, its reliance on lightning-quick text messaging puts some at a disadvantage.\n\"It's definitely really difficult for the elderly to use as it's totally reliant on a bunch of communication through WeChat groups where information of 200 people is flying by at 20 messages a second,\" Mr Fishman said.\nFor these people, \"how are you supposed to get vegetables? How are you supposed to get food during this period?\" he said.", "url": "https://www.straitstimes.com/asia/east-asia/shanghais-elite-are-joining-hunt-for-groceries-under-covid-19-lockdown"}