{"authors": [], "date_download": "2024-10-12 13:38:06", "date_modify": "2024-10-12 13:38:06", "date_publish": "2024-09-20 11:42:00", "description": "The ban came after Japan released treated contaminated water from the Fukushima plant into the ocean. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-eyes-deal-to-end-chinese-ban-on-seafood-imports-media-say_1728740286.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/2024-08-12T055529Z1541999367RC22E9AS2SL8RTRMADP3JAPAN-ECONOMY.JPG?VersionId=_ypkOKFKTt_vVDxACcIJYq__3WfQb47e", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-eyes-deal-to-end-chinese-ban-on-seafood-imports-media-say_1728740286.html", "title": "China to ‘gradually resume’ seafood imports from Japan after Fukushima ban", "title_page": "China to ‘gradually resume’ seafood imports from Japan after Fukushima ban | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – China on Sept 20 said it would “gradually resume” importing seafood from Japan, after imposing a blanket ban in August 2023 over the release of water from the disabled Fukushima nuclear plant.\nIn August 2023, Japan began discharging treated contaminated water from the Fukushima plant into the Pacific Ocean in an operation it insists is safe, a view backed by the UN atomic agency.\nThe release, however, generated a fierce backlash from China, which branded it “selfish” and banned all Japanese seafood imports.\nBeijing and Tokyo said on Sept 20 they had come to a consensus over the wastewater release that would allow China to phase the imports back in.\n“China will begin to adjust the relevant measures based on scientific evidence and gradually resume imports of Japanese aquatic products that meet the regulation requirements and standards,” a Foreign Ministry statement said.\nChinese and Japanese officials recently conducted “multiple rounds of consultations” on the discharge of water from the stricken Fukushima Daiichi nuclear power station, the ministry said.\nIt said Japan had committed to “fulfilling its obligations under international law, doing its utmost to avoid leaving (a) negative impact on human health and the environment, and conducting continuous evaluations of the impact on the marine environment and marine ecosystems”.\nAround the same time as the announcement, Japanese Prime Minister Fumio Kishida said Tokyo had informed Beijing of “its readiness to carry out additional monitoring of the... treated water, while the Chinese side has decided to... steadily restore imports of Japanese fishery products that meet certain standards”.\nThe IAEA said in a statement that it would “coordinate with Japan and other stakeholders, including China, to ensure that the additional measures are implemented appropriately... to ensure that water discharge levels are, and will continue to be, in strict compliance and consistent with international safety standards”.\nIn 2011, three reactors at the Fukushima-Daiichi facility in north-eastern Japan went into meltdown following a massive earthquake and tsunami that killed around 18,000 people.\nSince then, plant operator Tepco collected water contaminated as it cooled the wrecked reactors, along with groundwater and rain that has seeped in.\nPositions unchanged\nBoth China and Japan on Sept 20 were keen to stress that there were limits to the consensus.\nA spokeswoman for Beijing’s foreign ministry said China still “resolutely opposes the Japanese side’s arbitrary discharge into the sea”.\n“This position has not changed,” Ms Mao Ning said at a regular press conference in the capital.\n“The fact China and Japan have reached this consensus does not mean that the Chinese side will immediately resume imports of Japanese aquatic products in their entirety.”\nMr Kishida, for his part, said Tokyo also remained resolute.\n“Japan’s position remains unchanged that the regulations should be scrapped immediately, and we will use this announcement to pave the way for the abolition of the regulations,” he said.\nBilateral tensions\nBeijing and Tokyo are major trade partners, and China imported more than US$500 million (S$645 million) worth of seafood from Japan in 2022, according to customs data.\nBut the two countries are also perennial rivals in East Asia, whose ties are freighted with the baggage of Japan’s imperial past and China’s more recent rise to superpower status.\nThe wastewater release has been a flashpoint in recent tensions, alongside squabbles over trade, territorial disputes and espionage allegations.\nWhen a Chinese aircraft carrier in September sailed between two Japanese islands near Taiwan for the first time, Tokyo called the passage “totally unacceptable from the perspective of the security environment of Japan and the region”.\nA Japanese boy was also stabbed to death in the southern Chinese city of Shenzhen this week, an attack that Beijing called an “individual case” but which prompted Mr Kishida to demand an explanation. AFP", "url": "https://www.straitstimes.com/asia/east-asia/japan-eyes-deal-to-end-chinese-ban-on-seafood-imports-media-say"}