{"authors": [], "date_download": "2024-10-12 14:02:19", "date_modify": "2024-10-12 14:02:19", "date_publish": "2023-05-20 10:20:00", "description": "Mr Sullivan said nothing in the G-7 joint statement should come as a surprise to China. Read more at straitstimes.com.", "filename": "asia_east-asia_white-house-says-g-7-will-align-on-shared-de-risk-not-decouple-approach-to-china_1728741739.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/20/2023-05-19T092214Z2060231510RC2L11A2YSU7RTRMADP3G7-SUMMIT_0.JPG?VersionId=EfHxaRFQ0YZ4nQJMH87fminJwG.05iwm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_white-house-says-g-7-will-align-on-shared-de-risk-not-decouple-approach-to-china_1728741739.html", "title": "White House says G-7 will align on shared 'de-risk, not decouple' approach to China", "title_page": "White House says G-7 will align on shared 'de-risk, not decouple' approach to China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HIROSHIMA – The Group of Seven (G-7) rich nations will issue a statement on a shared approach on China, White House national security adviser Jake Sullivan said early on Saturday, adding that G-7 members were looking to “de-risk, not decouple” from China.\nMr Sullivan said the G-7 leaders planned to outline steps to protect sensitive technology, including outbound investment measures, in their joint statement or communique.\n“The communique will note that each country has its own independent relationship and approach, but we are united and aligned around a set of common elements,” Mr Sullivan told reporters at the summit in Hiroshima, Japan, referring to the group’s plans to cooperate with China while addressing significant concern in a range of areas.\nMr Sullivan said nothing in the G-7 joint statement should come as a surprise to China, given that the concerns of G-7 members were “well known” to Beijing.\n“I think you will find the China language to be totally straightforward. It is not hostile or gratuitous. It is just direct and candid,” Mr Sullivan said, adding that the statement emerged after intensive consultations with G-7 partners in recent years.\nHe said the United States expected economic engagement to continue with China, but was still working through the timing regarding planned phone calls, visits and meetings for various administration officials with their Chinese counterparts.\nIn an early draft of the final communique, seen by Reuters, G-7 leaders agreed that China’s status as the world’s second-largest economy necessitated efforts to foster cooperation.\n“Our policy approaches are not designed to harm China, we do not seek to thwart China’s economic progress and development,” said the draft, which is still subject to change, calling for “stable and constructive” ties with Beijing.\nMr Sullivan said G-7 leaders would outline a common set of tools to address economic coercion, including steps to build more resilient supply chains and efforts to protect sensitive technologies through export controls and outbound investment measures.\nEach country would determine its own approach, he said.\nThe US had been working to develop the legal authorities for a targeted set of outbound investment controls and would lay out its approach after “full consultations” with G-7 partners, Mr Sullivan said. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/white-house-says-g-7-will-align-on-shared-de-risk-not-decouple-approach-to-china"}