{"authors": [], "date_download": "2024-10-12 14:20:42", "date_modify": "2024-10-12 14:20:42", "date_publish": "2024-02-16 18:38:15", "description": "A small-scale pilot scheme will start first, before more workers are allowed in, Taiwan said. Read more at straitstimes.com.", "filename": "asia_taiwan-agrees-to-bring-in-indian-migrant-workers-to-ease-job-crunch_1728742842.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/16/LYNXNPEK1F0AH-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_taiwan-agrees-to-bring-in-indian-migrant-workers-to-ease-job-crunch_1728742842.html", "title": "Taiwan agrees to bring in Indian migrant workers to ease labour crunch", "title_page": "Taiwan agrees to bring in Indian migrant workers to ease labour crunch | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TAIPEI - Taiwan and India signed an agreement on Feb 16 to bring in Indian migrant workers to the island as labour-strained Taipei seeks to expand its foreign workforce beyond its traditional source countries of South-east Asia.\nTaiwan is a major semiconductor producer but with an ageing society.\nIt is host to around 700,000 migrant workers who come mostly from Vietnam, Indonesia, the Philippines and Thailand, many of whom work either in manufacturing or as home helpers for the elderly.\nTaiwan’s Ministry of Labour said the memorandum of understanding had been signed between each other’s de facto embassies in Taipei and Delhi, but implementation details will still need to be worked out.\nThe ministry said demand for workers in Taiwan for manufacturing, construction, agriculture and other industries has continued to expand, which Taiwan is unable to fulfil itself, so demand for migrant workers has increased year by year.\n“The quality of Indian labour is stable, they are hardworking and well considered,” the ministry said.\nA small-scale pilot scheme will start first, and if that goes well, more Indian workers will be allowed in, the ministry added. It did not say how many workers may eventually come, only that the numbers would be decided by Taiwan.\nTaiwan has previously denied reports that up to 100,000 Indian workers may be allowed in.\nIndia, like most countries, has no formal ties with Chinese-claimed Taiwan.\nBut there is a close business relationship, with India wanting to encourage more Taiwanese tech companies to invest and manufacture in India.\nIndia also has a difficult relationship with China, especially over their disputed shared border. REUTERS", "url": "https://www.straitstimes.com/asia/taiwan-agrees-to-bring-in-indian-migrant-workers-to-ease-job-crunch"}