{"authors": [], "date_download": "2024-10-12 13:54:06", "date_modify": "2024-10-12 13:54:06", "date_publish": "2023-11-28 05:00:00", "description": "The authorities have also detained a group of beggars from Jordan who allegedly harassed foreigners. Read more at straitstimes.com.", "filename": "asia_se-asia_thailand-says-chinese-beggars-caught-in-bangkok-not-victims-of-trafficking-some-worked-in-singapore_1728741246.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/28/hzbeg2711.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_thailand-says-chinese-beggars-caught-in-bangkok-not-victims-of-trafficking-some-worked-in-singapore_1728741246.html", "title": "Thailand says Chinese beggars caught in Bangkok not victims of trafficking", "title_page": "Thailand says Chinese beggars caught in Bangkok not victims of trafficking | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BANGKOK - Six Chinese nationals with severe deformities caught begging on the streets of Bangkok were not victims of torture, physical abuse or coercion by human traffickers as believed earlier, Thailand said on Nov 27.\nSeven Chinese men and women have been arrested for begging for money in Bangkok since Nov 10, after posts on social media suggested that human traffickers may be exploiting Thailand’s visa waiver to bring in victims to beg on the streets.\nThe individuals caught exhibited facial deformities or had crippled hands or fingers.\nImmigration Bureau chief Lieutenant-General Ittipol Ittisarnronnachai told a press conference on Nov 27 that the detainees admitted to entering Thailand voluntarily, after learning begging in the capital could earn them up to 10,000 baht (S$380) a day.\nLt-Gen Ittipol said the first person from this group to be arrested was a 41-year-old woman who went by the name Kheng.\nShe was apprehended on Nov 11 at the BTS Skywalk in front of the Siam Square shopping mall.\nSubsequently, a Thai woman called Namee, posing as her interpreter, helped get Kheng out of prison before she was deported on Nov 17.\nOn Nov 18, a 34-year-old woman identified as Wu was arrested by Phya Thai police on a pedestrian flyover in front of the Platinum shopping mall on Phetchaburi Road.\nWu revealed that she had observed beggars earning substantial amounts in major sightseeing spots in a previous visit to Thailand. So, she decided to try her hand at begging, and sometimes earned up to 10,000 baht a day. She said she converted her earnings to yuan and deposited them in her WeChat Pay account.\nFollowing her arrest, the same interpreter delivered Wu’s passport and belongings at the Phaya Thai Police Station.\nIn the third case, a 39-year-old woman, Yuan, was detained by Bang Phlat police on Nov 19 in front of the Central Pinklao shopping mall in Bangkok Noi district.\nYuan said she and her husband Awu made a living by begging on the streets in China and had previously begged in Malaysia. She said they arrived in Thailand earlier in 2023 and earned well from begging.\nWhen his wife was arrested, Awu tried to flee the country, but since his visa was cancelled he was nabbed at the Cambodian border checkpoint in Sa Kaew’s Aranyaprathet district.\nBefore his attempted escape, he sent an interpreter, Sorapha, to deliver Yuan’s passport at the police station.\nThe couple remains in custody pending legal proceedings and deportation.\nIn the fourth case, a 28-year-old woman identified as Hu was apprehended by Thung Maha Mek police officers on Nov 20 at the BTS Sala Daeng station in Bangkok’s Bang Rak district.\nHu reportedly told police she had entered Thailand independently to beg after learning it was lucrative.\nIn the fifth case, a 28-year-old man referred to as Fan was arrested by Lumpini police on Nov 20 at the BTS Asoke station in Thawi Watthana district.\nFan claimed he had initially arrived in Thailand as a tourist, but lost his passport. While waiting for a replacement from the Chinese embassy, he resorted to begging to survive.\nIn the sixth case, a 33-year-old man known as Wang was arrested by Bang Rak police on Nov 20.\nHe allegedly told the authorities that he had arrived in Thailand as a tourist and stayed at a hotel in the Pathumwan area. However, he said, he ran out of funds and decided to start begging on Silom Road.\nThe immigration chief noted that some of the detainees knew one other and had come together to beg.\nLt-Gen Ittipol also said that several of the individuals had previously gone begging in Singapore and Malaysia.\nPolice investigators said that the deformities and scars on the detainees’ faces and bodies had been caused by accidents in their youth.\nLt-Gen Ittipol insisted none of them had been subjected to torture or abuse.\nHe also confirmed that the detainees had full control of their earnings and had not transferred money to anybody else.\nAs for the Thai women who acted as interpreters, Lt-Gen Ittipol said they were not associated with any criminal gangs.\nHe added that they had previously worked with acquaintances of the detainees, which led to them getting involved.\nLt-Gen Ittipol added that the police are still looking for a Chinese man who was reportedly seen begging in Bangkok’s Lat Krabang area.\nHe also said that the Chinese beggars had entered Thailand using their passports, which recorded their scars and deformities, and so the injuries were not new.\nSeparately, the immigration chief said the authorities have detained a group of beggars from Jordan comprising three men, four women and 16 children.", "url": "https://www.straitstimes.com/asia/se-asia/thailand-says-chinese-beggars-caught-in-bangkok-not-victims-of-trafficking-some-worked-in-singapore"}