{"authors": [], "date_download": "2024-10-12 13:52:49", "date_modify": "2024-10-12 13:52:49", "date_publish": "2023-05-23 15:00:00", "description": "Parametric insurance is on the rise across the developing world. Read more at straitstimes.com.", "filename": "asia_heat-insurance-offers-climate-change-lifeline-to-poor-workers_1728741169.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/24/2023-05-19T080301Z321927024RC20P0AS8R91RTRMADP3CLIMATE-CHANGE-PARAMETRIC-INSURANCE.JPG?VersionId=JOOeusJiIvYdv810hr50r3EnFDTRMJav", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_heat-insurance-offers-climate-change-lifeline-to-poor-workers_1728741169.html", "title": "Heat insurance offers climate change lifeline to poor workers", "title_page": "Heat insurance offers climate change lifeline to poor workers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AHMEDABAD, India – A bright sun beat down on the sprawling Indian market where Ms Kamlaben Ashokbhai Patni sat worrying about the brass jewellery on display in her wooden stall. When the heat rises, the metal blackens. Plastic pearls become unglued.\n“The colour of the jewels starts to fade as it becomes hotter, making them worthless and akin to junk,” said the 56-year-old mother of four on a late April day when temperatures simmered around 38 deg C in the western city of Ahmedabad.\nClimate change drove the heat in the city to a record-breaking 48 deg C in 2016. In 2022, it peaked at nearly 46 deg C.\nSuch high temperatures could mean a hit to business. But Ms Patni is now among 21,000 self-employed women in Gujarat state enrolled in one of the world’s first insurance schemes for extreme heat, launched in May by non-profit Adrienne Arsht-Rockefeller Foundation Resilience Centre, or Arsht-Rock, in partnership with microinsurance start-up Blue Marble and a trade union.\nIf temperatures climb high enough above historical averages and linger there for three days, Ms Patni will receive a small payout to help her cope and compensate for lost income.\nWhile traditional insurance can take months to pay, with so-called “parametric” insurance there is no need to prove losses. It can pay within days of a trigger being reached – a predetermined threshold beyond which conditions are considered extreme. Payments can be set to things like wind speeds or rainfall.\nThis form of disaster assistance is on the rise across the developing world, as vulnerable communities are hammered by worsening drought, storms and heatwaves.\nBut with climate change happening faster and causing more damage than scientists had predicted – and too little money being spent on protecting populations – such projects could struggle over the longer term, according to more than 20 industry experts consulted by Reuters.\nReinsurer Swiss Re reported that sales of parametric product jumped 40 per cent between 2021 and August 2022. Insurance analysts at Allied Market Research estimate the market, valued at US$11.7 billion (S$15.7 billion) in 2021, could reach US$29.3 billion by 2031.\nAt annual climate talks in Egypt in 2022, non-profits urged richer nations to help finance parametric insurance as a way of compensating victims of worsening weather extremes.\nIt is still somewhat niche “but it’s growing”, said Ms Ekhosuehi Iyahen, secretary-general of the Insurance Development Forum, an industry-led group that promotes insurance for non-traditional markets.\nThe past year has seen new products rolled out across Latin America, Africa and the Asia-Pacific. The United Nations Capital Development Fund, for example, recently developed parametric policies for Vanuatu, Tonga and Fiji covering cyclone damage.\nAt the moment, insurance schemes in the developing world are largely subsidised by non-profit groups, national governments or wealthy countries.\nMany of the programmes aspire to have policyholders eventually cover more if not all of the premium. But worsening extremes could make that difficult, said resilience researcher Viktor Roezer of the London School of Economics, noting the programmes could just become a “different channel for aid”.\nInterviews with more than a dozen groups involved in such insurance found that most products launched in the last five years had already paid out.\nThe products need to “geographically diversify – we have to have schemes spread out in different areas” to dilute the risk, said Mr Jaime de Pinies, chief executive of the Blue Marble group that developed the Gujarat heat programme and other programmes in Colombia, Zimbabwe and Mozambique.\nBuilding resilience\nOne way of avoiding constant payouts, industry analysts say, is for governments to implement better strategies to defend against weather extremes – for example, by planting crops more resilient to drought or building cooler homes to protect against rising heat, thus slashing losses. This could allow insurers to set triggers higher.\n“The beauty of the parametric is that it pays so quickly and it’s incredibly flexible,” said Ms Kathy Baughman McLeod, director of Arsht-Rock which is covering the US$10.30 per person premium in Gujarat.\n“But it needs to be paired with actions or tools that reduce the risk.”\nInvestment in boosting resilience remains marginal in most developing economies, with financing promised by richer countries not yet fully materialising.\nDonor nations mobilised just US$29 billion in 2020 to help poorer countries adapt to a warmer world – far below the US$340 billion estimated by the UN Environment Programme to be needed each year by 2030.\n“In most cases, there is zero adaptation spend,” said chief executive Jonathan Gonzalez of parametric start-up Raincoat, which has deployed five projects in Colombia, Mexico, Jamaica and Puerto Rico.\nHeat impacts\nAcross the world, heatwaves that once had a one-in-10 chance of occurring in any given year prior to the Industrial Revolution are now nearly three times as likely, and 1.2 deg C hotter, according to a 2022 study in the journal Environmental Research Letters.\nScientists expect things to get worse, with such heatwaves becoming nearly six times as likely if greenhouse gas emissions continue unabated and the world reaches 2 deg C of warming, the study found.\nIn the case of the Gujarat heat scheme, insured by ICICI Lombard with the Self Employed Women’s Association (Sewa) as the group policyholder, the calculation determining the trigger varies across five districts. It is based on temperature expectations from historical trends over six 10-day assessment cycles.\nIn Ahmedabad, for example, payouts occur when temperatures add up to between 134 deg C and 138 deg C over three days, assessed using satellite data. The policy can pay out multiple times, to a maximum of US$85.\n“For vulnerable women on the margins, enduring extreme temperatures for three days directly amplifies the chances of sickness or death,” said Dr Sahil Hebbar, a physician attending to the women in Sewa who work in construction, trash collecting and ship-breaking.\nInsurance payouts allow them to buy things like gloves to protect their hands from scorching hot metal tools, or fans to stay cool and avoid heat exhaustion.\nHad the insurance scheme been in place in 2022, it would have led to averaged payouts of US$28 per person, said Mr de Pinies.\nSitting with her jewels in the market, Ms Patni said if temperatures climbed higher she would put payout money towards medicine to help with heat-related headaches.\n“I spend 15 hours at the stall every day... In summers it becomes difficult to stay here,” she said.\nAcross the city, Ms Heena Kamlesh Parmar, 26, works as a daily-wage labourer at a construction site where she is building a high-rise residential complex, earning 350 rupees (S$5.70) a day.\nThe heat makes her want to take a break from hauling bricks to rest in the shade, she said, but she fears that could lead to a pay cut.\nIf she receives a payout, Ms Parmar said, she will “use it to buy things for my house, things to eat”. REUTERS", "url": "https://www.straitstimes.com/asia/heat-insurance-offers-climate-change-lifeline-to-poor-workers"}