{"authors": [], "date_download": "2024-10-12 14:01:58", "date_modify": "2024-10-12 14:01:58", "date_publish": "2024-02-05 12:00:00", "description": "Unlike dermatology clinics, paediatric clinics, for instance, cannot offer certain expensive treatments. Read more at straitstimes.com.", "filename": "asia_east-asia_why-paediatricians-are-opening-dermatology-clinics-in-south-korea_1728741718.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/05/pexels-negative-space-48604.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_why-paediatricians-are-opening-dermatology-clinics-in-south-korea_1728741718.html", "title": "Why paediatricians are opening dermatology clinics in South Korea", "title_page": "Why paediatricians are opening dermatology clinics in South Korea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - After 20 years of service, Dr Kim, a paediatrician in Gwangju, closed her paediatric clinic in July 2023 due to financial challenges and South Korea’s dwindling population of children. Instead, she opened a new clinic that primarily treats skin problems, chronic pain and mental health issues.\nDr Kim is not alone. One in 10 paediatric clinics in Seoul has closed in the past five years, according to a recent report released by the Health Insurance Review and Assessment Service. Doctors in essential fields such as internal medicine, surgery and obstetrics and gynaecology stress the financial challenges of pursuing careers in these crucial areas, pointing to the stark contrast with the more lucrative fields of dermatology and cosmetic surgery.\nDr Kim Yoon, a professor of health policy and management at Seoul National University College of Medicine, told local media outlets: “Korean doctors rake in sky-high pay on average compared to doctors in other countries, according to the Organisation for Economic Cooperation and Development’s data, but doctors in essential fields, especially those working at university hospitals or general hospitals, get paid relatively less, and they have to work longer hours and harder.”\nThe average annual income of self-employed doctors in South Korea was US$298,000 (S$400,000) as of 2020, measured by purchasing power parity, which takes into account local living costs, according to the OECD.\nThe fastest way for a doctor to start earning a living straight out of medical school in South Korea is by opening up a clinic – especially a skin clinic – as a general physician, according to local reports quoting the medical community. This way, doctors can skip the five to six years of specialised training as an intern and resident required for a specialised licence.\nIt is common for such general practitioners working at skin clinics to earn 10 million won (S$10,000) a month working just three days a week, and 14 million won if they work five days a week, according to local reports.\nThus, many general practitioners end up opening dermatology clinics there. Among the 979 clinics opened by general practitioners between 2018 and 2022, 86 per cent were skin clinics, according to the Health Insurance Review and Assessment Service.\nSkin clinics dealing in treatments not covered by the National Health Insurance Service (NHIS) allow doctors to set prices based on market rates that have no ceiling. In contrast, treatments covered by the NHIS have predefined prices, preventing doctors from altering them. One dermatology clinic run by a specialist in the southern Seoul district of Gangnam offers five rounds of skin booster injections plus face-cooling procedures for a whopping 4.15 million won.\nUnlike dermatology clinics, paediatric clinics, for instance, cannot offer such expensive treatments. Instead, they earn revenue primarily from consultation fees of 13,000 won per patient on average.\nDoctors have expressed opposition to the government’s plan to increase the medical school enrolment quota starting in 2025. According to them, the primary issue behind the physician shortage is not the total number of doctors, but the reluctance of doctors to work in specific medical fields that do not make the same levels of profit as the lucrative fields of dermatology and plastic surgery.\nFor example, 38 out of 50 university hospitals – 76 per cent – did not have a single paediatrician as of the first half of 2023, because there were no applicants, according to the Ministry of Health and Welfare.\nMr Kim Sung-ju of the main opposition Democratic Party of Korea said: “Thousands of doctors graduate medical school every year, but no matter how much the number of doctors increases, doctors will continue to be scarce in essential fields. The number of doctors in dermatology and plastic surgery only will continue to grow.”\nOther medical workers oppose the plan, saying it will not be a solution.\n“Increasing the medical student quota for medical schools will not be a sufficient solution for supplying doctors to the rural regions and unpopular but essential fields,” said Ms Na Soon-ja, head of the Korean Health and Medical Workers’ Union, comprised of nurses, nursing home care workers and other healthcare workers.\nMs Na stressed that other policies, such as establishing public medical schools – which would offer medical students nearly free tuition in exchange for requiring them to work in essential fields or rural areas - are needed to draw doctors to unpopular but essential fields. THE KOREA HERALD/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/why-paediatricians-are-opening-dermatology-clinics-in-south-korea"}