{"authors": [], "date_download": "2024-10-12 13:41:13", "date_modify": "2024-10-12 13:41:13", "date_publish": "2024-07-30 19:44:18", "description": "ANKARA - Turkey and Armenia on Tuesday resumed talks aimed at normalising ties after a two-year lull and agreed to simplify visa rules for some passport holders, the two countries said. Read more at straitstimes.com.", "filename": "asia_turkey-armenia-make-progress-in-normalisation-talks_1728740473.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/30/LYNXMPEK6T0HF-1.jpg?VersionId=p5v5Cd0aDS0dmNqTr.1PFLlcFrEheU5q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_turkey-armenia-make-progress-in-normalisation-talks_1728740473.html", "title": "Turkey, Armenia make progress in normalisation talks", "title_page": "Turkey, Armenia make progress in normalisation talks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANKARA - Turkey and Armenia on Tuesday resumed talks aimed at normalising ties after a two-year lull and agreed to simplify visa rules for some passport holders, the two countries said.\nAnkara severed diplomatic and commercial relations with Yerevan in 1993 in support of Azerbaijan during its war with Armenia over the Nagorno-Karabakh region, and has deepened ties with the ethnically Turkic Azeris in recent years.\nSince the Nagorno-Karabakh conflict ended, NATO member Turkey has sought to revive its historically strained ties with Armenia, though it has said any normalisation depends on progress in Armenia's peace talks with Azerbaijan.\nTurkish and Armenian special envoys held a fifth round of negotiations on the Alican-Magara border crossing on Tuesday, the Turkish and Armenian foreign ministries said in a joint statement.\nThey agreed to assess technical requirements for reopening the Akyaka-Akhurik border crossing to rail transport as well as simplify mutual visa procedures for diplomatic and official passport holders, the statement said.\nIt added the two sides reaffirmed a commitment to pursue normalisation without preconditions, but gave no date for the next round of talks.\nTurkey and Armenia have long been at odds mainly over the 1.5 million Armenians who Yerevan says were killed in 1915 by the Ottoman Empire, the predecessor to modern Turkey.\nArmenia says this constitutes genocide. Turkey accepts that many Armenians living in the Ottoman Empire were killed in clashes with Ottoman forces during World War One, but contests the figures and denies any genocide occurred. REUTERS", "url": "https://www.straitstimes.com/asia/turkey-armenia-make-progress-in-normalisation-talks"}