{"authors": [], "date_download": "2024-10-12 14:01:28", "date_modify": "2024-10-12 14:01:28", "date_publish": "2024-07-19 07:55:00", "description": "As part of the millions in South Korean shunning marriage, two women redefine the concept of family. Read more at straitstimes.com.", "filename": "asia_east-asia_as-many-south-koreans-shun-marriage-two-women-try-to-redefine-family_1728741688.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/19/SKOREAFAMILYREDEFINED1.JPG?VersionId=43fIPb3rOqrft.g57ay6ZTwAgew_L5WB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_as-many-south-koreans-shun-marriage-two-women-try-to-redefine-family_1728741688.html", "title": "As many South Koreans shun marriage, two women try to redefine family", "title_page": "As many South Koreans shun marriage, two women try to redefine family | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – The event was to celebrate and discuss the book written by Ms Hwang Sunwoo and Ms Kim Hana, both 47, about their life together as single women in South Korea, but a man in the audience was there to offer criticism.\nHe told the two women that they were making the country’s birthrate – already the world’s lowest – even worse. Their book, he argued, would encourage other women to follow suit.\n“The irony was that the man, of our age, was unmarried himself,” Ms Hwang said. “More people choose not to marry or not to have children, but it’s usually women to blame.”\nSouth Korean society is deeply patriarchal and built around the traditional idea of family. Many government benefits – tax, housing, insurance and other incentives – are tailored for families. In return, families are expected to shoulder much of social welfare, such as caring for sick or elderly relatives.\nSuch longstanding norms may yet change. On July 18, South Korea’s Supreme Court ruled that same-sex couples qualify for the national health insurance’s dependent coverage, a decision that rights activists hoped could pave the way for legalising same-sex marriage in the country.\nBut with millions of South Koreans shunning the institution of marriage, the family-centred support system is rapidly unravelling. The nation’s quality of support network – measured by whether people have someone to rely on in a time of need – is the lowest among developed nations. South Korea also has the highest suicide rate among those nations.\nFor Ms Kim and Ms Hwang, who say they are not romantically involved with each other or anyone else, the solution is to redefine the concept of family.\nTheir 2019 book, Two Women Live Together, has become a bestseller, and their subsequent weekly podcast, Two Women Talk Together, attracts hundreds of thousands of listeners – giving voice to South Koreans, especially women, who have challenged the traditional family structure by forming cohabiting unions outside marriage.\nBy law, a family in South Korea can include only spouses, parents and children. But with housing and education costs skyrocketing, nearly 42 per cent of all households in the nation now comprise just one person.\nMs Kim and Ms Hwang describe themselves as “a DIY family”. Their way of life is an option for women who want neither singlehood nor a typical South Korean family – in which the husband spends only 54 minutes per day on household work, but the wife spends more than three hours, even when both hold full-time jobs.\n“We combine the freedom of being single and the benefit of living together,” Ms Kim said.\nHistorically, a Korean woman’s duty was becoming “a wise mother and good wife”.\nWhen Ms Hwang was younger, people asked her marital status “as casually as if they talked about the weather”. Today, middle-aged women are routinely addressed as “eomeonim” or “samonim” – honorifics for a woman with children, or for a wife – regardless of their marital or parental status.\nMs Hwang and Ms Kim’s book recounts how they live together despite their differences.\nWhen Ms Hwang moved into the apartment they bought together in 2016, Ms Kim, a minimalist, gasped at Ms Hwang’s “natural disaster-size” heap of clothes and other belongings.\nBut they found each other complementary. Ms Hwang, a former fashion magazine editor, loved to cook while Ms Kim, a former copywriter, liked cleaning dishes. Both wrote books and kept cats, two for each.\nThey loved to chat – a talent they successfully channeled into their podcast, where they discuss everything from books and movies to how to overcome anxiety and stay fit in middle age. They now make their living as authors and podcasters.\n“The main takeaway is that it’s okay to be a woman in her 40s and not married,” Ms Kim said. “It’s not a failed life.”\nMs Kook Dongwan, 44, a visual artist in Seoul, said she enjoyed the podcast because “there’s a lot of content out there, but not much of middle-aged women talking about their lives in a way fellow women can empathise with”.\nMs Yumi Choi, 37, said married people are overrepresented in mass media, while people in alternative unions are marginalised.\n“The surprising success of Two Women Talk Together shows that there is a thirst for a platform respecting non-kin or unmarried households.”\nIn 2022, the National Human Rights Commission recommended legalising civil unions to give unmarried couples, including those of the same sex, most of the tax and other benefits and legal protections of marriage, including medical power of attorney.\nIn 2023, a government survey found that a majority of South Koreans believed that if the country supported unmarried couples by introducing civil unions, it would help reverse its declining birthrate.\nMs Hwang and Ms Kim realized how South Korea’s social support system excluded unmarried cohabitants in everyday life when they were shopping for a car: They were denied the discount in insurance premiums available for married couples. They also could not benefit from cellphone service discounts and airline mileage sharing available to married couples.\nNo matter how long cohabitants have lived together, they cannot take a leave of absence from work to look after a sick partner as a married co-worker can. They also cannot become legal representatives for each other in medical emergencies, as spouses can.\nBut the traditional family structure is losing appeal.\nIn a survey commissioned by the Ministry of Gender Equality and Family in 2020, nearly 70 per cent of respondents said that people who live together and share costs must be considered a family even if they are not bonded by marriage or blood ties.\nThe ministry also found that unmarried partners were happier – and fairer in dividing household work – than married couples.\nA 2022 government survey found that nearly 81 per cent of young South Koreans embraced the idea of unmarried cohabitation.\nA few businesses, including mobile telephone carrier LG Uplus, have begun offering a special bonus and holiday to workers who decided not to marry in order to match similar benefits for newly-weds.\nIn 2022, a woman in her 40s made news by adopting her cohabitant, her junior by four years, as her daughter. That was the only way the two women could make themselves a legally protected family.\nMs Hwang and Ms Kim do not plan to go that far, but it has become inevitable for South Korea to introduce civil unions, they said.\n“It will happen by the time we get old,” Ms Hwang said. NYTIMES", "url": "https://www.straitstimes.com/asia/east-asia/as-many-south-koreans-shun-marriage-two-women-try-to-redefine-family"}