{"authors": [], "date_download": "2024-10-12 13:40:04", "date_modify": "2024-10-12 13:40:04", "date_publish": "2024-04-17 15:21:00", "description": "Coral bleaching was observed on 73 per cent of the surveyed reefs in the Great Barrier Reef Marine Park. Read more at straitstimes.com.", "filename": "asia_australianz_coral-bleaching-afflicts-most-of-australias-great-barrier-reef-report-shows_1728740404.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/17/TOPSHOTS-TOPSHOT-AUSTRALIA-ENVIRONMENT-REEF-050133.jpg?VersionId=m1P3r_GlDVU_NQCkLSW83YxFEapWVouB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_coral-bleaching-afflicts-most-of-australias-great-barrier-reef-report-shows_1728740404.html", "title": "Coral bleaching afflicts most of Australia’s Great Barrier Reef, report shows", "title_page": "Coral bleaching afflicts most of Australia’s Great Barrier Reef, report shows | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Some three-quarters of Australia’s famed Great Barrier Reef is suffering from coral bleaching, the authorities said in a report on April 17, days after climate scientists warned the condition was blighting such reefs worldwide.\nAt least 54 countries and regions have experienced mass bleaching of their reefs since February 2023 as climate change warms the ocean’s surface waters, the US National Oceanic and Atmospheric Administration (NOAA) has said.\n“The Great Barrier Reef is an incredible ecosystem and while it has shown its resilience time and time again, this summer has been particularly challenging,” said Dr Roger Beeden, of the Great Barrier Reef Marine Park Authority.\n“Climate change is the greatest threat to the Great Barrier Reef and coral reefs globally,” added Dr Beeden, the chief scientist of the authority, which manages the area.\nCoral bleaching was observed on 73 per cent of the surveyed reefs in the park, the authority said in its report.\nBleaching is triggered by changes in water temperatures that cause corals to expel the colourful algae living in their tissues. But the corals cannot survive without the algae, which deliver nutrients to them.\nOn April 15, the world’s top coral reef monitoring body, Coral Reef Watch, which is run by NOAA, declared the fourth global bleaching event in the last three decades. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/coral-bleaching-afflicts-most-of-australias-great-barrier-reef-report-shows"}