{"authors": ["Mara Cepeda"], "date_download": "2024-10-12 13:37:12", "date_modify": "2024-10-12 13:37:12", "date_publish": "2024-09-16 20:50:00", "description": "Beijing could take advantage of Manila's withdrawal of its coast guard vessel at Sabina Shoal, say experts. Read more at straitstimes.com.", "filename": "asia_se-asia_philippines-in-a-race-against-time-to-stop-potential-china-takeover-of-disputed-shoal_1728740232.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/16/PHILIPPINES-CHINA-DIPLOMACY-064617.jpg?VersionId=cYMHCwDPZdeX_1kPXL4lkiZ7j6snukmS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_philippines-in-a-race-against-time-to-stop-potential-china-takeover-of-disputed-shoal_1728740232.html", "title": "Philippines in race against time to stop potential China takeover of disputed shoal", "title_page": "Philippines in race against time to stop potential China takeover of disputed shoal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA - The pressure is on for the Philippines to replace a vessel it pulled out from a hotly contested shoal in the South China Sea – or risk losing a strategic area in its maritime dispute with Beijing.\nGeopolitical analysts warned that China could take control of Sabina Shoal, after the Philippines on Sept 15 was forced to withdraw its 97m-long coast guard ship BRP Teresa Magbanua from its waters after a five-month stand-off.\nThe Philippines has already said it is planning to send a replacement vessel, but did not provide details for now.\nPolitical analyst Robin Garcia told The Straits Times that if Manila does not act fast, this could lead to a repeat of what happened to Scarborough Shoal in 2012.\nA tense stand-off between the two nations then led to the Philippines withdrawing its vessels and China seizing control of that shoal, which was traditionally a fishing ground for many nationalities, including Filipinos and Chinese.\n“It suspiciously feels as if it’s like Scarborough Shoal all over again. I hope we have learnt our lesson already,” said Mr Garcia, who heads the Manila-based public affairs firm WR Numero.\n“I hope the Philippine government will be able to do something soon, because China has demonstrated that if there’s an opportunity to control areas that are critical to them, they will do so.”\nManila had anchored the Teresa Magbanua, one of its largest and most modern coast guard vessels, at Sabina Shoal in April in a bid to stop what it suspects are Beijing’s efforts to build an artificial island there. China has denied this.\nThe submerged coral reef has become a new flashpoint in the South China Sea dispute, with Manila accusing Beijing in the past five months of ramming and firing water cannon at Philippine vessels near Sabina Shoal, as well as discharging flares at aircraft patrolling the area.\nThe Teresa Magbanua had to stay at the shoal with a gaping hole in its hull since colliding with a China Coast Guard vessel in late August.\nIt all came to a head over the weekend. The Philippine Coast Guard (PCG) decided to take the Teresa Magbanua back to shore after a mix of bad weather and depleted supplies left four crew members in need of immediate medical care due to dehydration.\nBut do not mistake that as Manila giving up on Sabina Shoal, said PCG spokesman Jay Tarriela at a press briefing on Sept 16.\n“It is wrong to say that we lost territory in Escoda Shoal. We have not lost anything. We did not abandon anything,” Mr Tarriela said, using Manila’s term for the shoal that Beijing calls Xianbin Jiao or Reef.\nHe insisted that the Teresa Magbanua’s mission was still a success, as it had barred China from pushing through with its suspected small-scale land reclamation activities in the area between April and mid-September.\nThe Philippine vessel’s return to port in Palawan also comes just days after Filipino and Chinese diplomats met in Beijing to discuss ways to de-escalate tensions in Sabina Shoal. Mr Tarriela said the PCG’s move “was not related whatsoever” to the talks, formally called a bilateral consultation mechanism (BCM).\nManila has much to lose if Beijing gains control of Sabina, a resource-rich atoll located just 150km from the westernmost Philippine island of Palawan, well within the country’s exclusive economic zone.\nIt also serves as a rendezvous point for vessels bringing supplies to troops stationed at a beached warship in Second Thomas Shoal, which both nations are also claiming.\nMaritime security expert Collin Koh of the S. Rajaratnam School of International Studies in Singapore said the withdrawal from Sabina Shoal has crippled the PCG at a time of mounting tensions with Beijing.\nApart from the BRP Teresa Magbanua, the Philippines has only two other patrol vessels capable of long-term deployment in the disputed waterway.\n“If you have capacity shortfall, then at the very least, you should put one ship out there on a consistent basis. (Deploy) one ship simply just to show that you’re not acquiescing to China’s claim,” Dr Koh said.\nMr Tarriela of the PCG, however, allayed fears that the Philippines would lose access to Sabina Shoal.\nHe said that unlike Scarborough Shoal, which has a lagoon with a single entrance, Sabina is much larger at 137 sq km and has multiple entry points. He said this means that the PCG would still be able to send ships to the shoal and that it would be “impossible” for China to completely block off these waters.\nDr Ding Duo of the Hainan-based National Institute for South China Sea Studies disagreed, saying China has the capacity to stop Manila’s replacement ship for the Teresa Magbanua.\nBut he doubts there would be a repeat of the Scarborough stand-off in this case.\nHe said the 2012 incident was triggered after Philippine military vessels detained Chinese fishermen who were “stripped naked and made to be baked under the sun on the ship deck”.\nBut Sabina has so far been uninhabited, and fishermen from both sides have been able to go to the shoal.\n“I believe China will not take over the shoal. The government has said that it wants to revert Xianbin Jiao (Sabina Shoal) to its original state of being uninhabited,” said Dr Ding.\nHe added that this is in accordance with the Declaration on the Conduct of Parties in the South China Sea, which stipulates that no side should intrude into uninhabited areas.\nIt is a sentiment shared by Mr Lucio Pitlo III, a research fellow at Manila-based think-tank Asia Pacific Pathways to Progress Foundation, who said that the Teresa Magbanua’s pullout was likely influenced by the latest round of the BCM between China and the Philippines.\n“The timing of the talks and the outcome of the talks seem to suggest that there is at least an effort to keep the situation within control, avoid further violence or untoward encounter, which might result in miscalculation on both sides,” said Mr Pitlo.\nChina has also removed its coast guard and military vessels from Sabina as at Sept 15. Mr Tarriela said only 11 Chinese maritime militia ships were spotted when Teresa Magbanua left the shoal.\nDefence experts in the region said the latest incident just puts more pressure on the Philippines to maintain a stronger presence in the South China Sea.\nMr Koh said the Philippine government should work to add more offshore patrol vessels in the PCG’s fleet.\nMr Garcia also suggested that Manila build permanent structures like artificial islands to bolster its claim over the disputed sea, like China and Vietnam are doing.\nWhile it remains to be seen if the Teresa Magbanua’s withdrawal has defused tensions in Sabina, what is clear for now is that neither Manila nor Beijing will back down over their claims.\n“In the near future, China probably won’t withdraw from the lagoon as we never know if the Philippines will return, and so we (China) need to be ready to prevent that,” said Dr Ding. “Right now, there is no political trust from the highest level to the working level (with the Philippines),” he added.\nAdditional reporting by Yew Lun Tian", "url": "https://www.straitstimes.com/asia/se-asia/philippines-in-a-race-against-time-to-stop-potential-china-takeover-of-disputed-shoal"}