{"authors": [], "date_download": "2024-10-12 13:55:10", "date_modify": "2024-10-12 13:55:10", "date_publish": "2024-01-16 17:22:00", "description": "More people are staying single due to poor job prospects amid record youth unemployment. Read more at straitstimes.com.", "filename": "asia_east-asia_some-wealthier-chinese-say-they-cant-afford-marriage-as-economy-slows_1728741310.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/16/2024-01-16T083958Z1176249242RC28H5AAV8OQRTRMADP3ASIA-POPULATION-CHINA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_some-wealthier-chinese-say-they-cant-afford-marriage-as-economy-slows_1728741310.html", "title": "Some wealthier Chinese say they can't afford marriage as economy slows", "title_page": "Some wealthier Chinese say they can't afford marriage as economy slows | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI - Mr Victor Li is determined to get married soon, but like many other young Chinese grappling with an uncertain economic outlook, the well-heeled Shanghai entrepreneur is not sure he can afford to.\n“It’s very expensive for us to get married, especially in a big city like Shanghai,” the 32-year-old said, as he took a break from a ticketed networking event for wealthier, top university-educated singles at an upmarket Shanghai jazz bar.\n“In terms of financial ability, it actually puts a lot of pressure on young people, including me.”\nAs the world’s second biggest economy slows, an increasing number of people are opting to stay single due to poor job prospects amid record youth unemployment and chronically low consumer confidence, leading to a record slump in marriage registrations in 2022.\nThis reluctance to tie the knot is worrying policymakers grappling with a decline in births and a rapidly ageing population in a country that was once the world’s most populous, and where marriage rates are closely tied to birth rates as unmarried mothers are often denied child-raising benefits.\nChina’s fertility rate is currently one of the world’s lowest, and official data on Jan 17 is expected to show that the population fell for a second consecutive year, renewing concerns about the demographic decline.\nIn 2023, Chinese President Xi Jinping said it was necessary to “actively cultivate a new culture of marriage and childrearing” to foster national development. Local governments have also announced various measures to encourage new families, including tax deductions and housing subsidies, as well as cash “rewards” for marriages if the bride is aged 25 or younger.\nMs Julia Meng, whose company Julia’s Events organised the Shanghai singles event, said an increasing number of people aged 35 and older had effectively “given up” on marriage.\nYounger Chinese, like event attendee Jack Jiang, say they want to get married, but high housing prices, uncertain job prospects and the general economic situation is not helping.\n“It’s not that we want to be single, it’s the urban structure, economic situation that have led to this result,” the 32-year-old entrepreneur said. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/some-wealthier-chinese-say-they-cant-afford-marriage-as-economy-slows"}