{"authors": [], "date_download": "2024-10-12 14:07:16", "date_modify": "2024-10-12 14:07:16", "date_publish": "2024-07-24 16:10:00", "description": "The agreement is to recover artwork by Pablo Picasso and a financial account in Switzerland. Read more at straitstimes.com.", "filename": "asia_se-asia_us-doj-reaches-agreement-with-ex-1mdb-lawyer-jasmine-loo_1728742036.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/24/2024-06-26T185106Z1LYNXMPEK5P0RRRTROPTP3MALAYSIA-MARKETS-FOREX.JPG?VersionId=Q0nlHl_ldZtJjjmvbFOCkEuqgXnUYuet", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_us-doj-reaches-agreement-with-ex-1mdb-lawyer-jasmine-loo_1728742036.html", "title": "US Justice Department reaches agreement with ex-1MDB lawyer Jasmine Loo", "title_page": "US Justice Department reaches agreement with ex-1MDB lawyer Jasmine Loo | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA – The US Justice Department (DOJ) has reached an agreement with 1Malaysia Development Berhad (1MDB) former general counsel Jasmine Loo Ai Swan.\nIt said in a statement on July 23 that the agreement is to “recover artwork by Pablo Picasso and a financial account in Switzerland traced to funds allegedly embezzled from 1MDB”.\n“Additionally, the Justice Department has obtained forfeiture orders on other assets allegedly purchased with 1MDB funds by Low Taek Jho, also known as Jho Low,” it said, referring to the alleged mastermind of the looting of Malaysia’s state fund 1MDB.\nThe DOJ added that this includes diamond jewellery and artwork by Vincent van Gogh, Claude Monet, Pablo Picasso, Jean-Michel Basquiat and Diane Arbus.\nThe department said the agreement with Loo resolves the civil forfeiture action against the Picasso artwork and financial account in Switzerland under her control.\nIt added that the artwork and account were worth about US$1.8 million (S$2.4 million).\n“The agreement with Loo does not release any criminal claims against her,” the DOJ said.\nThe department added that the forfeiture of the other artwork and jewellery allegedly purchased by Low is based on a recent settlement agreement entered into in connection with real estate and artwork forfeitures in two other cases.\nThe DOJ said this resolves three additional civil forfeiture cases filed in the US District Court for the Central District of California.\nThis comes after it brought civil forfeiture cases against assets that it alleges were acquired by Low and his co-conspirators using funds reportedly embezzled from 1MDB. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/us-doj-reaches-agreement-with-ex-1mdb-lawyer-jasmine-loo"}