{"authors": [], "date_download": "2024-10-12 13:41:36", "date_modify": "2024-10-12 13:41:36", "date_publish": "2024-01-22 16:20:00", "description": "Japan's space agency said it had disconnected the lander's battery when it had 12 per cent power remaining. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-says-possibility-moon-lander-power-can-be-restored_1728740496.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/22/2024-01-19T154103Z212276978RC23L5AVJCY6RTRMADP3JAPAN-SPACE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-says-possibility-moon-lander-power-can-be-restored_1728740496.html", "title": "Japan says ‘possibility’ that moon lander’s power can be restored", "title_page": "Japan says ‘possibility’ that moon lander’s power can be restored | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - Japan switched off its moon lander almost three hours after a historic touchdown to allow for a possible recovery of the craft when the Sun hits its solar panels, the space agency said on Jan 22.\nWith its unmanned Smart Lander for Investigating Moon (Slim) mission – dubbed Moon Sniper for the craft’s precision landing capabilities – Japan became the fifth country to achieve a soft lunar landing.\nBut after the touchdown at 20 minutes past midnight on Jan 20 (11.20pm on Jan 19, Singapore time), the Japan Aerospace Exploration Agency (Jaxa) could not confirm that the lightweight craft’s solar batteries were generating power.\nBefore turning the lander off remotely, mission control was able to receive technical and image data from its descent, and from the lunar surface.\n“We’re relieved and beginning to get excited after confirming a lot of data has been obtained,” Jaxa said on Jan 22, adding that “according to the telemetry data, Slim’s solar cells are facing west”.\n“If sunlight hits the Moon from the west in the future, we believe there’s a possibility of power generation, and we’re currently preparing for restoration,” it said.\nSlim is one of several new lunar missions launched by governments and private firms, 50 years after the first human moon landing.\nCrash landings and communication failures are rife, and only four other countries have made it to the Moon: the United States, the Soviet Union, China and most recently, India.\nJaxa said it had disconnected Slim’s battery just before 3am when it had 12 per cent power remaining, “in order to avoid a situation where the restart (of the lander) would be hampered”.\nThe agency is now carrying out a detailed analysis of the data, to help determine whether the craft achieved the goal of arriving within 100m of its intended landing spot.\nThe mission was aiming for a crater where the Moon’s mantle, the usually deep inner layer beneath its crust, is believed to be exposed on the surface.\nBy analysing the rocks there, Jaxa had hoped to shed light on the mystery of the Moon’s possible water resources – key to building bases there one day as possible stopovers on the way to Mars.\nTwo probes detached successfully, one with a transmitter and another designed to trundle around the lunar surface beaming images to Earth.\nThis shape-shifting mini rover, slightly bigger than a tennis ball, was co-developed by the firm behind the Transformer toys.\nJaxa said on Jan 22 it was preparing to make more announcements this week on the results of the mission, and the status of the Slim craft.\nAlthough not everything went to plan, “we may be able to produce plenty of results, and we’re happy that the landing succeeded”.\nPrevious Japanese lunar missions have failed twice – one public and one private.\nIn 2022, the country unsuccessfully sent a lunar probe named Omotenashi as part of the United States’ Artemis 1 mission.\nIn April, Japanese start-up ispace tried in vain to become the first private company to land on the Moon, losing communication with its craft after what it described as a “hard landing”. AFP", "url": "https://www.straitstimes.com/asia/east-asia/japan-says-possibility-moon-lander-power-can-be-restored"}