{"authors": [], "date_download": "2024-10-12 13:37:32", "date_modify": "2024-10-12 13:37:32", "date_publish": "2024-08-20 20:12:22", "description": "The Palestinian militant group says it remains keen on reaching an agreement with Israel. Read more at straitstimes.com.", "filename": "asia_hamas-says-biden-remark-about-group-backing-away-from-gaza-truce-deal-misleading_1728740252.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/TOPSHOTS-TOPSHOT-ISRAEL-US-PALESTINIAN-CONFLICT-DIPLOMACY-072358.jpg?VersionId=50_fgC_TJNfpi7D70kPOf6BQ9NGThE1n", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_hamas-says-biden-remark-about-group-backing-away-from-gaza-truce-deal-misleading_1728740252.html", "title": "Hamas says Biden remark about group backing away from Gaza truce deal ‘misleading’", "title_page": "Hamas says Biden remark about group backing away from Gaza truce deal ‘misleading’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI – Hamas said on Aug 20 that US President Joe Biden’s comment that the Palestinian group was backing away from a Gaza ceasefire agreement with Israel was “misleading”.\nMr Biden, responding to questions on a ceasefire deal, said: “Israel says they can work it out, they’re prepared. But I was told Hamas is now backing off.”\nWhile boarding a plane after giving a speech at the Democratic National Convention in Chicago on Aug 19, he added: “It remains to be seen. We’re going to keep pushing.”\nHamas said Mr Biden’s statements do not reflect the true position of the movement, which says it has been keen to reach a cessation of hostilities.\n“The proposal recently presented to us goes against what the parties had agreed on July 2. This is considered an American response and acquiescence to the terrorist Netanyahu’s new conditions and his criminal plans towards the Gaza Strip”, Hamas added, referring to Israeli Prime Minister Benjamin Netanyahu.\nUS Secretary of State Antony Blinken, who is on his ninth trip to the region since the war began, expressed optimism after meeting Israeli officials on Aug 19.\nOn Aug 20, Mr Blinken was in Cairo pushing for areas of possible progress on a ceasefire and hostage release deal in talks planned for later this week, with major areas of dispute still unresolved.\nThe United States has put forward bridging proposals that it and the other mediating countries – Qatar and Egypt – believe would close gaps between Israel and Hamas and end the hostilities that have destabilised the entire region. REUTERS", "url": "https://www.straitstimes.com/asia/hamas-says-biden-remark-about-group-backing-away-from-gaza-truce-deal-misleading"}