{"authors": [], "date_download": "2024-10-12 13:39:20", "date_modify": "2024-10-12 13:39:20", "date_publish": "2023-10-03 20:23:50", "description": "Pakistan on Tuesday ordered all illegal immigrants to leave the country or face expulsion after revealing that 14 of 24 suicide bombings in the South Asian nation this year were carried out by Afghans. Read more at straitstimes.com.", "filename": "asia_pakistan-orders-all-illegal-immigrants-to-leave-after-suicide-bombings_1728740360.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/03/LYNXMPEJ920F1-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_pakistan-orders-all-illegal-immigrants-to-leave-after-suicide-bombings_1728740360.html", "title": "Pakistan orders all illegal immigrants to leave after suicide bombings", "title_page": "Pakistan orders all illegal immigrants to leave after suicide bombings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ISLAMABAD - Pakistan on Tuesday ordered all illegal immigrants to leave the country or face expulsion after revealing that 14 of 24 suicide bombings in the South Asian nation this year were carried out by Afghans.\nInterior Minister Sarfraz Bugti said all illegal immigrants should leave Pakistan by Nov. 1 or face forcible expulsion. She said some 1.73 million Afghan nationals in Pakistan had no legal documents to stay.\nBugti was speaking in Islamabad after civil and military leaders met the prime minister and army chief to discuss law and order.\nTwo suicide bombings targeted religious gatherings in Pakistan last week, killing at least 57 people.\nThere was no immediate response from Kabul to Bugti's comments. The Afghan Taliban have denied accusations that Afghan territory is used for militant activity and said Pakistan's security is a domestic issue.\nMilitant attacks have surged in Pakistan since 2022 when a ceasefire broke down between the government and the Tehreek-e-Taliban Pakistan (TTP), an umbrella body of hardline Sunni Islamist groups. REUTERS", "url": "https://www.straitstimes.com/asia/pakistan-orders-all-illegal-immigrants-to-leave-after-suicide-bombings"}