{"authors": ["Aw Cheng Wei"], "date_download": "2024-10-12 14:14:39", "date_modify": "2024-10-12 14:14:39", "date_publish": "2022-04-21 21:20:56", "description": "The Chinese President also called for unity in tackling security risks during a video speech at the Boao Forum. Read more at straitstimes.com.", "filename": "asia_east-asia_countries-must-come-together-to-fight-covid-19-tackle-emerging-security-issues-says-xi_1728742479.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/21/mi_protectivesuits_210422.jpg?VersionId=gL9ndtFpx8TRv694_10_ndgnGTKRjBRq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_countries-must-come-together-to-fight-covid-19-tackle-emerging-security-issues-says-xi_1728742479.html", "title": "Countries must come together to fight Covid-19, tackle emerging security issues, says Xi Jinping", "title_page": "Countries must come together to fight Covid-19, tackle emerging security issues, says Xi Jinping | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - President Xi Jinping on Thursday (April 21) reaffirmed China's commitment to opening up its economy, and called on all countries to cooperate to step up the fight against Covid-19.\nHe also called for unity in tackling security risks that have emerged due to \"unilateralism\" and \"bloc politics\", in a veiled reference to Ukraine and how governments, mostly in the West, have imposed sanctions on Russia for invading its neighbour.\nThe world has yet to walk away \"from the shadow of a once-in-a-century pandemic, but new traditional security risks are already emerging\", Mr Xi said via video link at the opening ceremony of the high-level Boao Forum in southern Hainan province. He made no specific reference to any country or event.\n\"For humanity to clinch the final victory against the Covid-19 pandemic, more hard efforts are needed,\" said Mr Xi in his keynote address. \"We need to work together to promote economic recovery (and) stay committed to building an open world economy.\"\nThe world's second-largest economy is in the grip of its worst Covid-19 surge since the early days of the pandemic, and the government has been trying to contain the fallout from the tough measures imposed as part of its \"zero Covid\" policy.\nThere is a growing debate in the country on the costs of the tough measures as Shanghai, the nation's financial capital with 25 million people, continues to report daily infections around the 20,000-mark despite remaining under a messy, extended lockdown.\nMr Xi did not mention Shanghai in his address on Thursday.\nChina is the world's last major economy to insist on a strict dynamic-zero policy against Covid-19, an approach that has relied heavily on strict lockdowns.\nThe latest economic data released on Monday showed that the lockdowns across China - which have extended from tech and manufacturing hub Shenzhen in the south to north-eastern Jilin province, an automotive centre - caused retail sales, a key barometer of economic health, to plunge last month.\nMr Xi, who is widely expected to retain his post for an unprecedented third term in a major leadership reshuffle later this year, struck an optimistic note on the economy, saying that the uneven global recovery has been worsening inequality across the world.\nBut \"the fundamentals of the Chinese economy, its strong resilience, enormous potential, vast room for manoeuvre, and long-term sustainability remain unchanged\", he said. \"They will provide great dynamism for the stability and recovery of the world economy and broader market opportunities for all countries.\"\nMr Xi also proposed a Global Security Initiative that upholds the principle of \"indivisible security\". Although scant on details, it refers to a concept that Russian President Vladimir Putin used to justify his invasion of Ukraine.\nUnder the concept, the security in any country is inseparable from others in its region, and no state can strengthen its own security at the expense of others.\nMr Xi said countries should \"stay committed to taking the legitimate security concerns of all seriously\" and he criticised the \"wanton use of unilateral sanctions and long-arm jurisdiction\".\nDifferences and disputes, he added, should be settled through dialogue and consultation.", "url": "https://www.straitstimes.com/asia/east-asia/countries-must-come-together-to-fight-covid-19-tackle-emerging-security-issues-says-xi"}