{"authors": ["Albert Wai"], "date_download": "2024-10-12 13:46:34", "date_modify": "2024-10-12 13:46:34", "date_publish": "2024-06-27 19:56:48", "description": "Asian Insider brings you insights into a fast-changing region from our network of correspondents and commentators. Read more at straitstimes.com.", "filename": "asia_asian-insider-hostilities-intensify-in-south-china-sea-taiwan-companies-rekindle-south-east-asia-romance_1728740794.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/27/aiainlsty270624.jpg?VersionId=fBcUC2M3FbqFvqsoa4CGVxAYiUGdQePz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_asian-insider-hostilities-intensify-in-south-china-sea-taiwan-companies-rekindle-south-east-asia-romance_1728740794.html", "title": "Asian Insider: Hostilities intensify in South China Sea | Taiwan companies rekindle South-east Asia romance", "title_page": "Asian Insider: Hostilities intensify in South China Sea | Taiwan companies rekindle South-east Asia romance | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Dear ST reader,\nHostilities have intensified in the disputed South China Sea between China and the Philippines. Videos show Chinese personnel brandishing knives, spears and even an axe. Tan Dawn Wei looks at how Beijing’s recent aggression may be an attempt to figure out Manila’s red line.\nMeanwhile, Mara Cepeda reports that although the Philippines has exercised restraint in its response over the clashes, the government also needs to rethink how it deals with an increasingly aggressive China.\nOur Insight story over the weekend looks at how South-east Asia has seen a surge in investments from Taiwan amid uncertainties such as the US-China trade war and frosty cross-strait ties. However, moving operations to South-east Asia is no simple matter due to China’s influence in the region and language barriers. Yip Wai Yee reports.\nLim Min Zhang writes about how the knife attack on a Japanese woman and her child in Suzhou has triggered yet another wave of xenophobic comments on Chinese social media. Coupled with a recent stabbing attack on four Americans in Jilin province, there are concerns over growing anti-foreigner sentiments on the ground.\nOver in Indonesia, the government is planning to acquire Cambodian rice companies in order to beef up the country’s food security. But export restrictions and local ownership laws mean this is not a straightforward exercise, says Linda Yulisman.", "url": "https://www.straitstimes.com/asia/asian-insider-hostilities-intensify-in-south-china-sea-taiwan-companies-rekindle-south-east-asia-romance"}