{"authors": [], "date_download": "2024-10-12 13:47:50", "date_modify": "2024-10-12 13:47:50", "date_publish": "2022-07-11 18:38:42", "description": "Hong Kong will adopt a traffic light colour code to restrict movement of infected residents and close contacts. Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-to-make-covid-19-app-more-like-mainland-china-to-curb-infections_1728740870.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/11/sv_hkgqr_110722.jpg?VersionId=OmWBt6PSGdFnCLhkB92SfWl3oTGq1uCg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-to-make-covid-19-app-more-like-mainland-china-to-curb-infections_1728740870.html", "title": "Hong Kong to make Covid-19 app more like mainland China to curb infections", "title_page": "Hong Kong to make Covid-19 app more like mainland China to curb infections | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (REUTERS) - Hong Kong will update an app it uses for Covid-19 tracking to bring it more in line with mainland China, by requiring people to register by name and by adopting a traffic light colour code to restrict movement of infected residents and close contacts.\nPreviously, users were not required to register with their personal details, and the app was used to enter venues and display vaccination records.\nAnnouncing the changes at a news conference on Monday, Dr Lo Chung-Mau, the city's new health secretary, said that he hoped the app would be updated soon and that it would help to enforce quarantine orders for people required to isolate at home.\nPeople infected with the virus would be coded red on the app, and people undergoing quarantine would be coded yellow and have to wear tracking wristbands.\nResidents arriving into Hong Kong from overseas will be able to isolate at home after a set period in hotel quarantine under this system, Dr Lo said, without giving further details.\nAll arrivals into Hong Kong are still mandated to do one week of hotel quarantine and comply with frequent testing orders, including stool samples for babies and a raft of forms.\nThe Chinese special administrative region has some of the strictest coronavirus regulations in the world outside mainland China, which is pursuing a \"dynamic zero Covid\" strategy of eradicating outbreaks as soon as they occur.\nHong Kong enforces fewer restrictions, but its policy still contrasts to the rest of the world, which is co-existing with the virus.\nHong Kong's government last week suspended a rule that suspended specific airline flights if they brought in too many passengers infected with the Covid-19 virus.\nAt the same time, officials have ramped up coronavirus testing across the city.\n\"We understand the aspiration for better arrangements to connect with the world and to revive economic activities, we are looking at more precise quarantine measures,\" Dr Lo said.\nThe flight suspensions and mandatory hotel quarantine have hammered Hong Kong's competitiveness, said business executives who are hoping the city's new leader, Mr John Lee, will scrap quarantine rules.\nHong Kong has reported more than 1.2 million coronavirus infections and around 9,400 deaths.\nThe authorities reported 2,863 new cases on Monday.", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-to-make-covid-19-app-more-like-mainland-china-to-curb-infections"}