{"authors": [], "date_download": "2024-10-12 13:47:12", "date_modify": "2024-10-12 13:47:12", "date_publish": "2020-02-02 12:37:25", "description": "BEIJING (AFP) - The coronavirus outbreak has killed more than 300 people and infected more than 14,000 in mainland China and beyond, forcing governments around the world to take drastic measures. Read more at straitstimes.com.", "filename": "asia_east-asia_wuhan-virus-how-governments-reacted-to-the-outbreak_1728740832.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/02/02/wh_32907666_020231.jpg?VersionId=aJMNY2d2i_i.yp2kG4KRO673QYi9DcLS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_wuhan-virus-how-governments-reacted-to-the-outbreak_1728740832.html", "title": "Wuhan virus: How governments reacted to the outbreak", "title_page": "Wuhan virus: How governments reacted to the outbreak | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (AFP) - The coronavirus outbreak has killed more than 300 people and infected more than 14,000 in mainland China and beyond, forcing governments around the world to take drastic measures.\nFrom border closures to flight bans, here are some of the steps states have taken to limit the spread of the virus.\nTRAVEL BANS\nThe United States on Friday (Jan 31) temporarily banned the entry of foreign nationals who had travelled to China over the past two weeks.\nMajor restrictions were also placed on US nationals, with mandatory 14-day quarantines for those returning from the Chinese province at the epicentre of the outbreak.\nThe only foreign nationals exempted from the ban are immediate family members of American citizens and permanent residents.\nAustralia and Israel followed suit with a similar ban on non-citizens who have travelled to China in the last 14 days.\nSingapore, Malaysia, the Philippines and Mongolia have announced similar restrictions on people travelling from China.\nBORDER CLOSURES\nSome nations have closed their borders with China in a bid to protect their territory from the outbreak.\nRussia said on Thursday it was closing its frontiers with China in the Far East, while Kazakhstan has halted cross-border bus and passenger train services to China.\nMongolia has closed its border with China to cars, while North Korea - an isolated nation which relies heavily on its links with China - banned foreign tourists.\nVietnam on the weekend announced a suspension of all mainland China flights.\nNepal closed its Rasuwagadhi checkpoint on the Chinese border for 15 days from Jan 29.\nPapua New Guinea went further than the others: It shut its air and seaports on Wednesday to all foreign travellers coming from Asia. The impoverished nation also shut its only land border with the Indonesia-controlled province of West Papua.\nVISA BANS FOR CHINESE\nA number of countries have temporarily stopped issuing visas to Chinese nationals after the coronavirus outbreak.\nSingapore has stopped issuing all types of visas to Chinese travellers, while Vietnam - a popular destination for Chinese tourists - has halted tourist visas.\nRussia, a close Beijing ally, announced on Saturday that it would halt visa-free tourism for Chinese nationals and also stop issuing them work visas. It had already stopped issuing electronic visas to Chinese nationals that allowed them to cross the border in parts of the Far East and western Russia.\nSimilar visa restrictions of varying scale have been imposed by the Philippines, Sri Lanka, Malaysia and the African nation of Mozambique.", "url": "https://www.straitstimes.com/asia/east-asia/wuhan-virus-how-governments-reacted-to-the-outbreak"}