{"authors": [], "date_download": "2024-10-12 13:59:59", "date_modify": "2024-10-12 13:59:59", "date_publish": "2022-10-19 12:44:37", "description": "Up to 30 former British military pilots have gone to train China's People's Liberation Army, the BBC has reported. Read more at straitstimes.com.", "filename": "asia_australianz_australia-to-investigate-reports-that-its-pilots-trained-chinese-military_1728741599.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/19/49173951_5.jpg?VersionId=uAM7Ys64SQgDxwgxAXyXEbID94.iVHlB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australia-to-investigate-reports-that-its-pilots-trained-chinese-military_1728741599.html", "title": "Australia to investigate reports that its pilots trained Chinese military", "title_page": "Australia to investigate reports that its pilots trained Chinese military | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Australia is investigating reports that its former military pilots are accepting training roles in China, as Britain mulls over taking legal action on national security grounds to stop its pilots from being similarly recruited.\nThe British government said on Tuesday that it was taking steps to prevent China from trying to recruit serving and former British military pilots to train the Chinese armed forces.\nBBC reported that up to 30 former military pilots had gone to train in China’s People’s Liberation Army.\nAustralia’s Defence Minister Richard Marles said on Wednesday that he had asked the Defence Ministry to investigate claims that former Australian military pilots had been recruited to join a South African flight school that operated in China.\n“I would be deeply shocked and disturbed to hear that there were personnel who were being lured by a pay cheque from a foreign state above serving their own country,” said Mr Marles in a statement.\nBritain’s Ministry of Defence wrote on Twitter that the British pilots involved were told they risked prosecution under the Official Secrets Act, and a national security Bill would provide other paths to prosecution.\nThe South African company, Test Flying Academy of South Africa (TFASA), did not immediately respond to a Reuters request for comment on whether it had hired Australian pilots to work in China.\nIn an undated advertisement with the Society of Experimental Test Pilots available online, TFASA said it was seeking a number of fixed-wing and helicopter test pilot instructors to work at an undisclosed location in “Far East Asia” with an initial contract commitment of four years.\nThe requirements included having graduated from military test flight schools in the United States or Britain.\nAccording to its website, TFASA also runs a flight school for Chinese airline pilots in South Africa as a joint venture with one of China’s largest state-owned aeronautic companies, Avic. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/australia-to-investigate-reports-that-its-pilots-trained-chinese-military"}