{"authors": ["Trinna Leong"], "date_download": "2024-10-12 14:05:58", "date_modify": "2024-10-12 14:05:58", "date_publish": "2018-05-18 01:54:16", "description": "Five police trucks were loaded with hundreds of orange boxes containing Hermes Birkin bags. “The total sum worth of items cannot be ascertained now.\" Read more at straitstimes.com.", "filename": "asia_se-asia_dozens-of-hermes-birkin-bags-and-other-items-seized-from-najib-linked-apartment_1728741958.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/05/18/photo6336708377182316630.jpg?VersionId=SfwLfMOWHelpVfSa7M1nQmEkM1TkGz9s", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_dozens-of-hermes-birkin-bags-and-other-items-seized-from-najib-linked-apartment_1728741958.html", "title": "Malaysian police seize 284 luxury bags, 72 bags of cash and valuables from Najib-linked apartments", "title_page": "Malaysian police seize 284 luxury bags, 72 bags of cash and valuables from Najib-linked apartments | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Malaysian police on Thursday (May 17) night raided three apartments in a posh Kuala Lumpur condominium owned by former prime minister Najib Razak's family, carting away 284 boxes containing luxury handbags and 72 bags filled with jewellery, cash of various denominations, watches and other valuables.\nMr Amar Singh, director of police commercial crime investigations, said the police have searched six premises since Wednesday - the Prime Minister's Office, Mr Najib's residence in Taman Duta and four other residences linked to him.\nAt one of these residences, Pavilion Residences, the police took what was likely to be their biggest haul, loading five police trucks with hundreds of orange boxes containing Hermes Birkin bags. Astro Awani reported that a police officer emerged from the condominium with a money counting machine.\nMr Singh, who spoke to reporters outside the condominium early Friday (May 18) morning after the raid, said the apartments belonged to a \"Tan Sri\", but declined to say more.\n\"The total sum worth of items cannot be ascertained now,\" said Mr Singh. \"We'll be counting and will know by tomorrow.\" He said: \"The number of jewellery is rather big.\"\nMany of the orange boxes were labelled with pictures of different Birkin bags, with descriptions such as \"Brown Ostrich\".\nMadam Rosmah Mansor, Datuk Seri Najib's wife, is known for her penchant for Birkin bags. Each bag costs anywhere between US$12,000 (S$16,105) and US$300,000. She caused a stir when it was reported that she bought a US$200,000 crocodile Birkin bag in 2015. Her aide denied it.\nOn Saturday, members of Parti Pribumi Bersatu Malaysia (PPBM) youth wing filed a police report, claiming that they received video evidence showing an alleged attempt to \"hide\" at least 50 Birkin bags that could have belonged to Madam Rosmah. The video supposedly showed the bags being moved to Pavilion Residences in a Prime Minister's Department van.\nItems were also seized during the raid at Mr Najib's Taman Duta residence on Thursday morning.\nOn Friday (May 18) the crime investigation team lodged a report of the items seized from the Taman Duta mansion, which included over 50 luxury handbags from brands like Chanel, Gucci and Prada. Amongst the haul were ten luxury watches including several Rolexes and a Patek Philippe, as well as RM537,000 (S$181,000) and 2.87 million Sri Lankan rupees (S$24,400) in cash.\nThe police said the items were seized as the team had reasonable grounds to suspect they were the subject matter of a crime or crimes under Malaysia's Anti-Money Laundering, Anti-Terrorism Financing and Proceeds of Unlawful Activities Act 2001.\nMr Singh said early Friday morning that the police are still working on opening a safe in that house.\nMr Najib's lawyer, Datuk Harpal Singh, said the police took action to drill through the safe as the key had been misplaced, and the safe had not been opened in two decades.\nMr Najib and his wife have been tied to the country's most high-profile financial scandal. The US Department of Justice, in its probe, found that Ms Rosmah had purchased a pink diamond worth US$23 million with 1MDB funds.\n1MDB was founded by the previous administration as a sovereign wealth fund meant to generate economic development via strategic investments. However, the fund soon spiralled into debt, and at its peak, had amassed up to RM50 billion.\nMr Najib has denied any wrongdoing.", "url": "https://www.straitstimes.com/asia/se-asia/dozens-of-hermes-birkin-bags-and-other-items-seized-from-najib-linked-apartment"}