{"authors": [], "date_download": "2024-10-12 14:19:58", "date_modify": "2024-10-12 14:19:58", "date_publish": "2024-03-08 16:55:00", "description": "The shutdown is part of the company’s restructuring programme aimed at cutting costs by US$1 billion (S$1.3 billion). Read more at straitstimes.com.", "filename": "asia_se-asia_tyre-maker-goodyear-to-close-manufacturing-plant-in-malaysia_1728742798.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/08/2024-03-08T074318Z1832609334RC2IH6ACJFA4RTRMADP3MALAYSIA-GOODYEAR.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_tyre-maker-goodyear-to-close-manufacturing-plant-in-malaysia_1728742798.html", "title": "Tyre maker Goodyear to close manufacturing plant in Malaysia", "title_page": "Tyre maker Goodyear to close manufacturing plant in Malaysia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Goodyear Tire & Rubber, one of the world’s largest tyre makers, plans to shut down its plant in Malaysia on June 30, a decision expected to affect more than 500 employees, said the company and Malaysia’s investment promotion agency.\nGoodyear said the decision to shutter the plant in the Shah Alam district in Selangor state, which opened in 1972, was part of its Goodyear Forward corporate restructuring programme, aimed at delivering US$1 billion (S$1.3 billion) in cost reductions by 2025.\n“These decisions are not made lightly, and we remain committed to treating our associates with care and respect,” the company said in a statement on March 7.\n“We will continue to serve the Malaysia market with our industry-leading products and solutions from other manufacturing sites within Goodyear’s footprint.”\nGoodyear has faced accusations of labour abuses, including unpaid wages, excessive overtime and threats against dozens of migrant workers at the Malaysian manufacturing plant in recent years.\nThe company and the workers reached a settlement agreement in 2022, with each employee paid RM50,000 (S$14,200) to RM200,000 depending on the length of their employment, Reuters reported.\nIn a separate statement on March 8, the Malaysian Investment Development Authority (Mida) said the closing of the plant would directly affect about 550 employees.\nThe Malaysian government and Goodyear have been working to establish a support framework to help those workers, including upskilling and reskilling programmes and facilitating job placements, Mida said.\nMalaysia has faced accusations from its Human Resources Ministry and the authorities in the United States of labour abuses at its factories, which rely on millions of migrant workers to manufacture everything from palm oil to medical gloves and semiconductor chips.\nThe government has set a target of 2030 to eliminate forced labour practices. REUTERS", "url": "https://www.straitstimes.com/asia/se-asia/tyre-maker-goodyear-to-close-manufacturing-plant-in-malaysia"}