{"authors": [], "date_download": "2024-10-12 13:29:27", "date_modify": "2024-10-12 13:29:27", "date_publish": "2023-12-14 16:07:26", "description": "The UN agency said “urgent measures“ were needed to control them. Read more at straitstimes.com.", "filename": "asia_ban-flavoured-vapes-who-says-urging-tobacco-style-controls_1728739767.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/14/LYNXMPEJBD085-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_ban-flavoured-vapes-who-says-urging-tobacco-style-controls_1728739767.html", "title": "Ban flavoured vapes, WHO says, urging tobacco-style controls", "title_page": "Ban flavoured vapes, WHO says, urging tobacco-style controls | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - The World Health Organisation (WHO) on Dec 14 urged governments to treat e-cigarettes similarly to tobacco and ban all flavours, threatening cigarette companies’ bets on smoking alternatives.\nSome researchers, campaigners and governments see e-cigarettes, or vapes, as a key tool in reducing death and disease caused by smoking. But the United Nations agency said “urgent measures” were needed to control them.\nCiting studies, it said there was insufficient evidence that vapes helped smokers quit, that they were harmful to health and that they could drive nicotine addiction among non-smokers, especially children and young people.\nMore 13-year-olds to 15-year-olds are using vapes than adults in all WHO regions, helped by aggressive marketing, it continued.\n“Kids are being recruited and trapped at an early age to use e-cigarettes and may get hooked to nicotine,” said Dr Tedros Adhanom Ghebreyesus, WHO Director-General, urging countries to implement strict measures.\nThe WHO called for changes including bans on all flavouring agents like menthol and the application of tobacco control measures to vapes. Those include high taxes and bans on use in public places.\nThe WHO has no authority over national regulations, and only provides guidance. But its recommendations are often adopted voluntarily.\nThe WHO and some other anti-tobacco organisations are pushing for stricter regulations on newer nicotine products, taking aim at the alternatives on which some cigarette giants, like Philip Morris International and British American Tobacco, are basing their future strategies.\nTobacco company Imperial Brands and vape firm ANDS said vapes pose significantly lower health risks than tobacco and help reduce its harms, while flavours are key in encouraging smokers to switch - a position shared by some tobacco control advocates.\n“Regulating vapes like cigarettes would only serve to reinforce misunderstandings about the relative risks of vaping and send the wrong message to smokers,” said Ms Marina Murphy, senior director of scientific and medical affairs at ANDS, adding the WHO’s position was “detached from reality”.\nThe WHO said while long-term health risks were not understood, vapes generated some substances known to cause cancer, posed risks to heart and lung health and could affect brain development in young people. REUTERS", "url": "https://www.straitstimes.com/asia/ban-flavoured-vapes-who-says-urging-tobacco-style-controls"}