{"authors": ["Lim Ai Leen"], "date_download": "2024-10-12 13:46:23", "date_modify": "2024-10-12 13:46:23", "date_publish": "2024-08-15 20:00:53", "description": "Asian Insider brings you insights into a fast-changing region from our network of correspondents and commentators. Read more at straitstimes.com.", "filename": "asia_asian-insider-top-job-change-for-japan-and-thailand-will-climate-change-derail-future-olympic-games_1728740783.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/15/ainl_coll1508.jpg?VersionId=Q1bQMOfcDB7v3IMRdtSUQ29DpaJgBsRx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_asian-insider-top-job-change-for-japan-and-thailand-will-climate-change-derail-future-olympic-games_1728740783.html", "title": "Asian Insider: Top job change for Japan and Thailand | Will climate change derail future Olympic Games?", "title_page": "Asian Insider: Top job change for Japan and Thailand | Will climate change derail future Olympic Games? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Dear ST reader,\nWe hope you’ve been keeping well.\nTurmoils at the top – that’s the big news in Asia this week.\nPrime Minister Fumio Kishida sent shockwaves through the political system when he announced he will step down after a successor is chosen in the ruling party’s September election. Meanwhile, his Thai counterpart Srettha Thavisin was ousted by a court decision after barely a year in office.\nMr Kishida’s move kicks off a heated race to succeed him, reports Walter Sim, and saves him the indignity of being ousted at the party polls. And while Thailand’s lawmakers will convene to pick a new PM as early as tomorrow, horse-trading amongst them could leave government policies in limbo, reports Tan Hui Yee.\nTurning to economic issues, Tan Dawn Wei reports on the dilemma facing China, which needs to raise its retirement age to deal with an ageing population and shrinking workforce. We also have two big-reads – a commentary from Vikram Khanna on why Asean needs its own development bank, and Ravi Velloor’s take on India’s aviation sector taking off.", "url": "https://www.straitstimes.com/asia/asian-insider-top-job-change-for-japan-and-thailand-will-climate-change-derail-future-olympic-games"}