{"authors": [], "date_download": "2024-10-12 13:50:38", "date_modify": "2024-10-12 13:50:38", "date_publish": "2022-03-30 16:36:25", "description": "Many have questioned the practicality of persisting with China's zero-tolerance approach to Covid-19. Read more at straitstimes.com.", "filename": "asia_east-asia_we-demand-an-explanation-shanghai-residents-vent-covid-19-lockdown-irritation_1728741038.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/30/hzshanghai290311.jpg?VersionId=yUBv3H_CZk_WHm1HxiYR_WEI.QKgoFiq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_we-demand-an-explanation-shanghai-residents-vent-covid-19-lockdown-irritation_1728741038.html", "title": "'We demand an explanation!' Shanghai residents vent Covid-19 lockdown irritation", "title_page": "'We demand an explanation!' Shanghai residents vent Covid-19 lockdown irritation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (REUTERS) - Frustrated and locked down, residents of Shanghai have taken to social media to vent, questioning the practicality of persisting with China's zero-tolerance approach to Covid-19 in its most populous city.\nIn the home to 26 million people, videos and images of crowded quarantine centres were shared as the authorities extended lockdown from the east of the city to parts of the west, posting calls for help with medical treatment and purchasing food.\nOne video widely shared on Chinese social media featured an angry exchange between a group of patients and hazmat suit-clad healthcare workers at the vast Shanghai World Expo Centre - temporarily converted into a giant quarantine facility.\n\"We demand an explanation!\" the person filming the video shouts in the video.\n\"There's repeated cross-infection here, there's no water in the toilet, poo and pee everywhere, it's all a mess!\"\nShanghai authorities on Sunday (March 27) abandoned a targeted approach and announced a two-stage lockdown after the total number of new local cases reached close to more than 13,000 in nine days.\nOn Wednesday, officials reported that new daily cases jumped by a third on March 29 compared with the previous day.\nWhile the numbers are small by global standards, China's \"dynamic clearance\" approach means that all people who test positive are sent to central quarantine centres or hospitals.\nClose contacts and neighbours must quarantine at home.\nShanghai's distribution of millions of self-administered antigen testing kits to detect cases quickly, which China approved only this month, has also sown some confusion and fear.\nOne person who self-tested positive on Saturday, along with 10 work colleagues, told Reuters on Wednesday he was still waiting to be transported to a central facility despite repeated calls to a Covid-19 hotline.\nHe declined to be named, citing privacy reasons.\nOthers expressed frustration over access to medical care and complained about difficulties in purchasing food as delivery services were overloaded.\nThe authorities have pledged to keep food supply channels open and ensure people receive essential medical treatment.\nTo be sure, China's approach has broad domestic support, and many see its approach as successful in keeping Covid-19 case counts and deaths extremely low in China, while it has killed more than six million people worldwide and infected 480 million.\nBut given that the vast majority of cases in Shanghai have thus far been without symptoms, there have been calls to re-examine the feasibility of \"dynamic clearance\" in the city, given the strain on public resources.\n\"'Targeted prevention and control' is the undisputed king when the number of cases is small,\" commented an Internet user using the handle \"hemuch\", whose posting on experiences in central quarantine went viral.\n\"But now that the virus has spread so widely and so easily, is it possible to slowly reduce the resources used for tracking and tracing, and release the resources being used for asymptomatic cases who do not need treatment?\"", "url": "https://www.straitstimes.com/asia/east-asia/we-demand-an-explanation-shanghai-residents-vent-covid-19-lockdown-irritation"}