{"authors": [], "date_download": "2024-10-12 13:37:55", "date_modify": "2024-10-12 13:37:55", "date_publish": "2023-10-07 01:04:45", "description": "But nothing has been set up yet, he added. Read more at straitstimes.com.", "filename": "asia_biden-says-its-possible-hell-meet-chinas-xi-next-month_1728740275.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/07/LYNXMPEJ950QZ-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_biden-says-its-possible-hell-meet-chinas-xi-next-month_1728740275.html", "title": "Biden says Xi meeting in November ‘a possibility’", "title_page": "Biden says Xi meeting in November ‘a possibility’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – US President Joe Biden said on Friday that he may meet Chinese leader Xi Jinping in San Francisco in November as Washington and Beijing push to reset ties, but added that nothing is scheduled yet.\nThe leaders of the rival powers have not met in person or spoken for nearly a year, and tensions have mounted as an increasingly assertive China and the United States vie for global influence.\n“There has been no such meeting set up, but it is a possibility,” Mr Biden told journalists after reports that they were set to meet during the Asia-Pacific Economic Cooperation (Apec) summit in San Francisco. Mr Biden is set to host leaders from across the region on Nov 16 and 17 in the California city, and speculation has mounted that it could be the venue for a rapprochement.\nThe White House had begun making plans for a meeting on the sidelines of the summit in a bid to stabilise relations, The Washington Post reported, quoting one official as saying it “it’s pretty firm”.\nChinese Foreign Minister Wang Yi is expected to visit Washington at some point ahead of the Apec summit.\nBeijing, however, has not confirmed whether Mr Xi will attend the summit or meet his US counterpart. The White House has also declined to elaborate on a potential meeting with Mr Xi.\nThe last time Mr Biden and Mr Xi met was in November 2022 on the sidelines of a summit in Bali. Their talks were surprisingly cordial but relations then froze over again, and there has not been even a phone call since.\nMr Biden had said in September he was “disappointed” that Mr Xi was not attending a Group of 20 summit in New Delhi. He added that he was “going to get to see him”, although he did not elaborate.\nTensions between the United States and China have mounted as the world’s two largest economies push for diplomatic, military and economic influence.\nBilateral ties face a long list of problems, from trade disputes to Taiwan’s future to the expansive Chinese presence in the South China Sea.\nBut the United States has been working to restore a more effective working relationship, sending a series of senior officials to China in recent months despite continuing friction.\nWhite House national security adviser Jake Sullivan and Mr Wang met in the Mediterranean island nation of Malta in mid-September in the latest attempt to reach out.\nThe Apec forum will be a key test of whether their efforts are working, as the Asia-Pacific region is one of the main theatres where Beijing and Washington are going head to head.\nMr Biden has also been pushing to show that international groupings like the G-20 and Apec can still deliver on problems such as the economy and climate – even when China is not involved. AFP", "url": "https://www.straitstimes.com/asia/biden-says-its-possible-hell-meet-chinas-xi-next-month"}