{"authors": [], "date_download": "2024-10-12 14:15:23", "date_modify": "2024-10-12 14:15:23", "date_publish": "2022-04-06 11:59:38", "description": "Shanghai is building the world's largest makeshift isolation facility to contain the outbreak. Read more at straitstimes.com.", "filename": "asia_east-asia_chinas-daily-covid-19-cases-top-20000-as-isolation-efforts-expand_1728742523.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/06/md_cncovid_06042022.jpg?VersionId=wpoGovnFwwfySgGQnbJ8HpNkXQ0qkrR4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinas-daily-covid-19-cases-top-20000-as-isolation-efforts-expand_1728742523.html", "title": "China tops 20,000 daily Covid-19 cases as infections in Shanghai surge", "title_page": "China tops 20,000 daily Covid-19 cases as infections in Shanghai surge | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (BLOOMBERG, REUTERS) - Surging infections in Shanghai pushed the number of daily cases reported in China on Tuesday (April 5) to 20,472.\nThe financial hub detected a record 16,766 new asymptomatic cases, up from 13,086 a day earlier. There were also 311 symptomatic infections.\nLocal officials there are building the world's largest makeshift isolation facility to help contain the outbreak.\nThe National Exhibition and Convention Centre, a 1.2 million sqm space known for hosting international auto shows and other massive events, will be converted to house more than 40,000 people, according to local media reports.\nThe effort shows how far Shanghai will go to fight the virus, on top of the lockdown that has kept its 25 million residents confined to their homes.\nThe current outbreak in China has already surpassed the number of infections found in the early days of the pandemic, before testing was easily available, and encompasses a much broader swath of the nation.\nWhile President Xi Jinping is committed to getting the conflagration under control, his request to limit economic consequences is getting harder to do as the wildly transmissible Omicron variant continues to spread despite intense efforts to stop it.\nThe number of cases continues to rise in Shanghai and Jilin, a northeastern province that has been locked down since mid-March, showing the difficulty of halting the spread of Omicron once it has deeply penetrated a population.\nJilin recorded 973 infections and 1,798 asymptomatic cases on Tuesday, according to the National Health Commission.\nBoth areas are struggling with the economic and personal ramifications of the lockdowns, with food shortages, a lack of medical care and shuttered manufacturing plants bringing misery to residents.\nCase counts are rising even faster on the outskirts of Shanghai, though the numbers remain low. The seven-day average increased to 63 from 19 in Anhui province, while climbing to 59 from 21 a week earlier in Jiangsu.\nShanghai remains the hotspot for the current flareup, despite indefinitely extending a sweeping lockdown of its 25 million people.\nShe told reporters at the briefing that authorities were working hard to resolve bottlenecks and take care of the “basic living needs” of the population.\nShe said efforts would be made to ship food and other necessities to Shanghai from other provinces, and would also build emergency supply stations in and around the city to ensure vegetable supplies.\nShe said the biggest challenge was getting deliveries to homes.\nWith official delivery channels either unavailable or severely backlogged, residents have been using whatever method they can – including community WeChat groups – to try for fresh stocks of fruit and vegetables.\nMs Liu said Shanghai would work to “release delivery capacity”, saying the 11,000 riders working for major e-commerce platforms in the city could go to work if they submitted daily negative Covid-19 nucleic acid and antigen tests.", "url": "https://www.straitstimes.com/asia/east-asia/chinas-daily-covid-19-cases-top-20000-as-isolation-efforts-expand"}