{"authors": [], "date_download": "2024-10-12 13:48:19", "date_modify": "2024-10-12 13:48:19", "date_publish": "2021-11-14 10:51:08", "description": "The nation's strict prevention measures haven't hindered its economy, said Professor Liang Wannian. Read more at straitstimes.com.", "filename": "asia_east-asia_chinese-official-defends-chinas-covid-19-policy-strict-measures-to-stay_1728740899.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/11/14/ac_beijingstreet_141121.jpg?VersionId=JsASnneHRTc9mbBd5he0wxav6y7OZ7zI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinese-official-defends-chinas-covid-19-policy-strict-measures-to-stay_1728740899.html", "title": "Chinese official defends China's Covid-19 policy, strict measures to stay", "title_page": "Chinese official defends China's Covid-19 policy, strict measures to stay | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (BLOOMBERG) - China's Covid-19 tsar reiterated the need to aggressively quash domestic coronavirus infections early to keep the world's second-biggest economy largely intact and the country's people safe.\nChina has effectively contained local Covid cases and has managed to limit severe infections, Xinhua on Saturday (Nov 13) cited Professor Liang Wannian, an epidemiologist who heads the government's team of experts in coronavirus prevention, as saying in an interview.\nThe nation's strict prevention measures, an approach that is contrary to most other countries, haven't hindered its economy, the report quoted Prof Liang as saying.\nHe firmly defended the government's Covid-zero policy and called it the most efficient way to protect China's people, according to Xinhua.\nProf Liang's remarks are the latest affirmation of China's adherence to the so-called Covid-zero approach, even as authorities impose escalating restrictions on people's movements to smother the widest outbreak since the virus was first reported in the central Chinese city of Wuhan in late 2019.\nProf Liang said the Covid-zero policy doesn't mean China won't tolerate a single infection but rather it enables early detection and a swift response to prevent a wider spread of the virus.\nTens of thousands of university students are under lockdown on their campuses in Dalian after the north-eastern Chinese city became the latest hotspot of infections.\nThe local government of Beijing asked people travelling into the Chinese capital to present a negative Covid test result within 48 hours of entering the city.", "url": "https://www.straitstimes.com/asia/east-asia/chinese-official-defends-chinas-covid-19-policy-strict-measures-to-stay"}