{"authors": [], "date_download": "2024-10-12 13:35:52", "date_modify": "2024-10-12 13:35:52", "date_publish": "2023-10-23 06:32:00", "description": "The Chinese envoy for the Middle East called for a ceasefire. Read more at straitstimes.com.", "filename": "asia_east-asia_china-says-force-not-a-way-to-resolve-israeli-palestinian-conflict_1728740152.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/23/10931020.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-says-force-not-a-way-to-resolve-israeli-palestinian-conflict_1728740152.html", "title": "China says force ‘not a way’ to resolve Israeli-Palestinian conflict", "title_page": "China says force ‘not a way’ to resolve Israeli-Palestinian conflict | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China believes “force is not a way to resolve” the Israeli-Palestinian conflict and is once again calling for a ceasefire, its envoy for the Middle East pleaded in Egypt, the Chinese Foreign Ministry said on Sunday.\nEgypt on Saturday hosted a “summit for peace” where United Nations Secretary-General Antonio Guterres called for swift “action to end this god-awful nightmare”, after two weeks of war between Israel and the Palestinian Islamist movement Hamas.\nBeijing’s envoy for the Middle East, Mr Zhai Jun, met Arab League chief Ahmed Aboul Gheit on the sidelines of the summit.\nThe Chinese diplomat called for an “immediate ceasefire and an end to the fighting as quickly as possible”, his ministry said in a statement.\n“China believes that force is not a way to resolve the problem and that responding to violence with violence will only lead to a vicious circle of revenge,” Mr Zhai said according to the statement, which mentioned neither Israel nor Hamas.\nHamas militants stormed into Israel from the Gaza Strip on Oct 7 and killed at least 1,400 people – mostly civilians – who were shot, mutilated or burned to death on the first day of the raid, according to Israeli officials.\nIsrael’s retaliatory bombing campaign has killed more than 4,600 Palestinians, mainly civilians, according to the Hamas-run Health Ministry in Gaza.\nChina has so far maintained good relations with Israel, but it has supported the Palestinian cause for decades and traditionally backs a two-state solution.\nChina said on Thursday it was “deeply disappointed” by the United States’ decision to veto a UN Security Council resolution calling for a “humanitarian pause” in the Israel-Hamas conflict.\nWashington justified its veto because the text did not mention Israel’s right to defend itself.\nChinese President Xi Jinping said it was “crucial to prevent the conflict from expanding or even losing control and causing a serious humanitarian crisis”, as he met Egyptian Prime Minister Mostafa Madbouly in Beijing on Thursday. AFP", "url": "https://www.straitstimes.com/asia/east-asia/china-says-force-not-a-way-to-resolve-israeli-palestinian-conflict"}