{"authors": [], "date_download": "2024-10-12 14:04:19", "date_modify": "2024-10-12 14:04:19", "date_publish": "2023-10-01 22:52:45", "description": "The Chinese-made bullet train can take more than 600 people and will cut travel time between Jakarta and Bandung to 45 minutes. Read more at straitstimes.com.", "filename": "asia_se-asia_indonesia-to-launch-china-funded-high-speed-rail-first-in-south-east-asia_1728741859.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/01/INDONESIA-TRANSPORT-TRAIN-094446.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_indonesia-to-launch-china-funded-high-speed-rail-first-in-south-east-asia_1728741859.html", "title": "Indonesia to launch China-funded high-speed rail, first in South-east Asia", "title_page": "Indonesia to launch China-funded high-speed rail, first in South-east Asia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA - Indonesia is set to launch South-east Asia’s first high-speed railway on Monday, a delayed multibillion-dollar project backed by China that will cut travel between capital Jakarta and Bandung by hours.\nThe Chinese-made bullet train named “Whoosh” is built to take more than 600 people to and from Jakarta and the Javan city of Bandung in 45 minutes and is part of China’s Belt and Road infrastructure initiative.\nPresident Joko Widodo has lauded the project for the fast ride it will provide between the two cities on Indonesia’s most populous island Java, and he will inaugurate it on Monday, according to local media reports, citing officials.\n“We will launch it on Oct 2, because on Oct 1, the president is busy,” Transport Minister Budi Karya Sumadi told reporters on Friday.\nThe train can reach speeds up to 350km per hour and has cost a joint Chinese-Indonesian venture more than US$7 billion (S$9.6 billion) to build.\nIt was built by PT KCIC, which is made up of four Indonesian state companies and Beijing’s China Railway International Co.\nIt was set to cost less than US$5 billion and be built by 2019 but delays due to construction issues and the Covid-19 pandemic saw costs spike.\nThe authorities have been running public trials of the new high-speed journey of 142km before its opening.\nChinese Premier Li Qiang rode the train with senior Indonesian minister Luhut Pandjaitan last month on his visit to Jakarta for a series of summits with South-east Asian leaders.\nMr Pandjaitan told reporters on Thursday that Mr Widodo plans to welcome Chinese President Xi Jinping in the future to ride the train, without providing further details. AFP", "url": "https://www.straitstimes.com/asia/se-asia/indonesia-to-launch-china-funded-high-speed-rail-first-in-south-east-asia"}