{"authors": ["Hazlin Hassan"], "date_download": "2024-10-12 13:31:30", "date_modify": "2024-10-12 13:31:30", "date_publish": "2022-03-08 17:41:51", "description": "The move will allow travellers who are fully vaccinated against Covid-19 to enter the country without quarantine.   Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-pm-says-to-reopen-border-to-international-visitors-from-april-1_1728739890.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/08/hzkl080322.jpg?VersionId=PG4aNCleTYigshdzdy_b2BcYeAWpeNmO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-pm-says-to-reopen-border-to-international-visitors-from-april-1_1728739890.html", "title": "Malaysia to reopen border to international visitors from April 1", "title_page": "Malaysia to reopen border to international visitors from April 1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Malaysia will reopen its border to international visitors from April 1, allowing travellers who are fully vaccinated against Covid-19 to enter the country without quarantine, Prime Minister Ismail Sabri Yaakob said on Tuesday (March 8).\nVisitors will be required to undergo pre-departure tests (RT-PCR) and upon-arrival tests (RTK-Antigen under professional supervision) 24 hours after arrival.\nAt present, visitors can enter Malaysia only via the Singapore and Langkawi travel bubble for the fully vaccinated.\nIn an address broadcast live on several national television networks, Datuk Seri Ismail said the border reopening was part of the move to transition into the \"endemic\" phase of living with the virus.\nMalaysia shut its borders two years ago on March 18, 2020, when the coronavirus pandemic was spreading rapidly around the world.\n\"The government has decided to reopen the country's borders on April 1,\" he said.\n\"I believe this has been long-awaited by the people. This announcement will also boost the economy as a whole, in particular the tourism industry that has been badly affected by the pandemic,\" he added.\nTravellers who wish to enter Malaysia need only to download the MySejahtera tracking application and fill up a pre-departure travel form.\nInternational travellers will no longer be required to apply for MyTravelPass, which will be abolished.\nWhile masks will still be mandatory during the transition phase, Mr Ismail announced further easing of Covid-19 rules beginning April 1.\nUnvaccinated individuals will be allowed to cross state lines, and there will no longer be limits on opening hours or to the capacity of commercial and restaurant premises.\nMalaysia has been keeping its economy open despite the Omicron wave of the pandemic with daily caseloads hitting record highs and hospitalisations around five-month high.\nMalaysia logged 26,856 daily new cases on Monday (March 7).\n\"In the last few weeks, the number of daily Covid-19 cases has been spiking due to the Omicron wave. However, the number of cases in categories 3, 4 and 5 are very low, which is 0.7 per cent,\" said Mr Ismail, referring to the serious categories of Covid-19 that include hospitalisations.\nThe number of patients requiring intensive care are \"under control for now, at 42 per cent capacity\", he added.\nNearly 80 per cent of Malaysia’s total population have been fully vaccinated, while 64 per cent of Malaysians have taken a booster dose.\nThe country has also been gradually easing its virus protocols. Asymptomatic close contacts of Covid-19 patients are no longer required to undergo mandatory quarantine. Malaysia has also dropped a requirement for inbound travellers to undergo testing within six days of arrival under the vaccinated travel lane with Singapore.", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-pm-says-to-reopen-border-to-international-visitors-from-april-1"}