{"authors": ["Hariz Baharudin"], "date_download": "2024-10-12 14:00:23", "date_modify": "2024-10-12 14:00:23", "date_publish": "2024-09-01 15:05:00", "description": "Indonesia is Pope Francis' first stop on his 12-day tour of Asia. Read more at straitstimes.com.", "filename": "asia_se-asia_indonesia-ramps-up-security-ahead-of-pope-francis-visit_1728741623.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/01/11573062.jpg?VersionId=iC.8DKJ5FccaQnhkC6HCNuWJfm_qW93p", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_indonesia-ramps-up-security-ahead-of-pope-francis-visit_1728741623.html", "title": "Indonesia ramps up security ahead of Pope Francis’ visit", "title_page": "Indonesia ramps up security ahead of Pope Francis’ visit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Indonesia is stepping up security for Pope Francis’ visit this week – his first stop on a 12-day tour of Asia, with snipers being deployed and thousands of officers on standby.\nPope Francis, who is the head of the Catholic Church and sovereign of the Vatican City state, is scheduled to visit the Indonesian capital of Jakarta from Sept 3 to 5, before making stops in Papua New Guinea, Timor-Leste and Singapore.\nThis will be the longest trip yet for the 87-year-old Argentinian pontiff, who now regularly uses a wheelchair because of back and knee pain.\nIndonesia, one of the world’s most populous Muslim-majority countries, announced on Aug 30 that it would be deploying snipers around the capital to ensure that the religious leader is able to travel safely between locations.\nHe will hold a mass at the Gelora Bung Karno Stadium, with more than 80,000 worshippers expected to attend.\nBrigadier-General Tjahyono Saputro, head of public relations at the Indonesian National Police, said: “The teams have been trained if the worst-case scenario occurs... from terrorism (threats), demonstrations against the visit to earthquakes.”\nThe authorities have also set up a coordination team comprising the elite Presidential Security Forces, the National Counterterrorism Agency, the National Cyber and Crypto Agency, and the armed forces.\nBrig-Gen Tjahyono said the Pope will also be escorted by members of the Vatican Swiss Guard, which Indonesia will support.\nExcitement and preparations for the visit have been mounting in Indonesia’s Catholic community too. Over the weekend, the Jakarta Cathedral set up a photo spot on its premises featuring a large cut-out of Pope Francis. Merchandise such as statues and T-shirts bearing the pontiff’s face have also been on sale.\nMr Gugun Gumilar, director of the Institute of Democracy and Education (IDE) Indonesia think-tank, said that the papal visit would show the world that his country can maintain diversity.\n“May this important event strengthen the Indonesia-Vatican bilateral relationship, and make Indonesia... be seen as an example of harmonious and peaceful religious dialogue for the world,” he said on Aug 31 in an Instagram post.\nThe Pope will meet President Joko Widodo, as well as visit the famous Istiqlal Mosque and the Our Lady of the Assumption cathedral in Central Jakarta. The two religious sites are linked by an underground tunnel, known as the Tunnel of Friendship, which was built by the government in 2020 as a symbol of religious harmony.\nA key theme of the Pope’s visit will be Islamic-Christian dialogue amid concerns of increasing discrimination and harassment against religious minorities.\nAccording to official figures, Catholics make up slightly more than 3 per cent of Indonesia’s 270 million population. About 87 per cent of the country is Muslim.\nPope Francis is expected to hold meetings with representatives of Indonesia’s six official religions and denominations – Islam, Protestantism, Catholicism, Buddhism, Hinduism and Confucianism.\nThe chairman of the Indonesian Bishops’ Conference, Mr Antonius Subianto Bunjamin, said in a press conference on Aug 28 that worshippers in the country have been praying that the Pope’s visit goes smoothly. “This visit is not only about the Pope’s presence but also about practising his teachings in daily life,” he said.\nAt the same event, Cardinal Ignatius Suharyo, who is the Archbishop of Jakarta, highlighted Pope Francis’ commitment to promoting good relations between different religious groups. He stressed that a focus of the Pope’s visit is to help build bridges between diverse communities.\n“The Pope is the most influential leader on humanitarian issues globally,” he said, noting the pontiff’s focus on serving marginalised communities.\nAmong his aims for the trip to the region is pushing for global action on climate change. He posted about the issue on his Instagram account on Aug 31.\n“Let us #PrayTogether that each of us listens with our hearts to the cry of the earth and of the victims of environmental disasters and the climate crisis, making a personal commitment to care for the world we inhabit,” he said.\nPope Francis is the third leader of the Catholic Church to visit Indonesia in recent times. His trip comes after Pope Paul VI in 1970 and Pope John Paul II in 1989.", "url": "https://www.straitstimes.com/asia/se-asia/indonesia-ramps-up-security-ahead-of-pope-francis-visit"}