{"authors": ["Debarshi Dasgupta"], "date_download": "2024-10-12 13:52:17", "date_modify": "2024-10-12 13:52:17", "date_publish": "2023-07-09 16:15:50", "description": "These include lithium and graphite used in electric vehicle batteries, the demand for which is projected to skyrocket. Read more at straitstimes.com.", "filename": "asia_south-asia_india-seeks-to-secure-its-green-growth-strategy-by-identifying-a-list-of-critical-minerals_1728741137.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/09/75055661H3405055B15D_0.jpg?VersionId=FzVVMss.8GFG4YHc3jNEsodcQLuU6vQl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_india-seeks-to-secure-its-green-growth-strategy-by-identifying-a-list-of-critical-minerals_1728741137.html", "title": "India seeks to secure its green growth strategy by identifying a list of critical minerals", "title_page": "India seeks to secure its green growth strategy by identifying a list of critical minerals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI - Faced with the existential threat of climate change, the Indian government has come out with a list of 30 critical minerals that are central to its ongoing efforts to pivot away from a fossil fuel-intensive energy mix.\nThese include minerals such as lithium and graphite used in electric vehicle batteries, the demand for which isprojected to skyrocket by as much as 4,000 per cent over the next several decades.\nThe planet’s ongoing transition to clean energy technology to deal with climate change has brought the importance of critical minerals to the forefront.\nThe list is aimed at minimising risks to the country’s green growth strategy that may arise from supply chain bottlenecks associated with these commodities.\nWhile India reportedly has the world’s fifth-largest reserves of rare earth elements (around 6 per cent), the country is entirely reliant on imports for many critical minerals such as lithium, cobalt, nickel and germanium that go into the manufacturing of items such as solar cells, semiconductors and batteries.\nThese minerals are on the list, along with others such as beryllium, phosphorus and indium, which have applications in many sectors, including high-tech electronics, agriculture and defence.\nThe government has, in addition, recommended the creation of a Centre of Excellence for Critical Minerals within the Ministry of Mines to periodically update the list, shape India’s critical mineral strategy and develop an effective value chain for critical minerals in the country.\nThe supply of critical minerals is today highly constrained, as their deposits as well as processing capabilities are largely limited to some countries. For instance, Australia produces around half of the world’s lithium and China controls most of the market for processing and refining of cobalt, lithium and rare earth elements.\nIndia, the world’s third-largest greenhouse gas emitter, aims to achieve net-zero emissions by 2070 – a goal that hinges on the assured supply of these minerals.\nDr Rajesh Chadha, a senior fellow at the Centre for Social and Economic Progress (CSEP) in Delhi, said the list is an acknowledgement of how “skewed critical minerals supply chains will impact India’s green transition”, but added that the government’s attention should now be on securing a supply of these minerals for India’s needs.\n“It has to be a multipronged strategy that optimises on the supply chain. This means if we find an opportunity to own and operate a facility out of the country, we should not miss it,” he told The Straits Times.\nIn 2019, India formed Khanij Bidesh India (Kabil), a state-owned joint venture, to scout for and process strategic minerals overseas for use in India. Last week, Reuters reported Kabil is expected to sign an agreement with Argentina to secure a few lithium mining blocks there.\nThe focus has also been on striking bilateral as well as multilateral partnerships. In June, India was inducted into the Minerals Security Partnership (MSP), a US-led collaboration of 13 countries and the European Union that seeks to bolster critical mineral supply chains.\nOn the bilateral front, Australia and India launched a three-year Critical Minerals Investment Partnership in July 2022. The issue came up in May as well, when the Australian and Indian prime ministers met in Sydney and discussed increasing cooperation on mining and critical minerals.\nIndia is also working with a Japanese-owned subsidiary in the country to refine rare earth elements sourced domestically.\nThese partnerships, along with India’s membership of the Quad’s Critical and Emerging Technology working group as well as the Indo-Pacific Economic Framework, offer India an opportunity to work with like-minded partners to counter China’s dominance in critical minerals and help secure global supply chains.\nHowever, experts say India will first need a strategy to make better use of its untapped geological endowments and build competitiveness in its domestic industry spanning exploration, mining and processing, including by opening it up to private players.\nCurrently, Irel (India), a central government enterprise, has a monopoly over the mining of rare earth minerals in the country.\n“India has a massive potential but, broadly speaking, it is very difficult for private sector explorers to come in because they don’t have the incentives to explore, especially as they don’t easily get the right to mine the minerals they discover,” said Mr Ganesh Sivamani, a research associate at CSEP.\nMs Ritika Passi, lead programme manager at Global Trade Observer, a think-tank based in Delhi, added the country must also prioritise specific critical minerals and their value chains, especially those “where it’s able to build excellence” and secure investments and technologies for this goal, as China has done.\nChina, which accounts for only 14 per cent of global lithium reserves, has over the years acquired lithium mines overseas and built an efficient domestic processing industry that is today responsible for around 60 per cent of global lithium processing.\n“India must look at building competitiveness to the extent possible given national resources and by also taking advantage of the geopolitical opportunity that has presented itself as countries look to diversify investment and trade,” Ms Passi added.", "url": "https://www.straitstimes.com/asia/south-asia/india-seeks-to-secure-its-green-growth-strategy-by-identifying-a-list-of-critical-minerals"}