{"authors": [], "date_download": "2024-10-12 13:50:14", "date_modify": "2024-10-12 13:50:14", "date_publish": "2024-09-20 09:30:00", "description": "Cases of temple or shrine properties being extensively repurposed have triggered public outrage. Read more at straitstimes.com.", "filename": "asia_east-asia_as-sales-of-japan-temples-and-shrines-surge-a-crackdown-on-bad-faith-buyers_1728741014.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/2024-09-19T231118Z914853260RC2ET9AWSCXDRTRMADP3JAPAN-TEMPLES.JPG?VersionId=yJxM58Ek8WblsKkoshY3kYaKJAoKjfmk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_as-sales-of-japan-temples-and-shrines-surge-a-crackdown-on-bad-faith-buyers_1728741014.html", "title": "As sales of Japan temples and shrines surge, a crackdown on bad-faith buyers", "title_page": "As sales of Japan temples and shrines surge, a crackdown on bad-faith buyers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SANBAGAWA, Japan - Mr Benmou Suzuki’s dilapidated 420-year-old temple, located deep in the forest near a tiny Japanese mountain village, hardly looks like prized real estate.\nYet the monk was recently approached by two men, who said they were real estate brokers and wanted to know if he was interested in selling.\nHe suspects they were not really interested in the ornate building at the trailhead of a sacred mountain, but the special tax status that comes with running a religious property.\n“There are people out there who want a temple, even a mountain temple like this. In fact, considering the value of the religious corporation status, this temple could fetch quite a lot of money,” said 52-year-old Mr Suzuki.\nAs Japan’s population falls and interest in religion declines, there are fewer people to contribute to the upkeep of the country’s numerous temples and shrines.\nMr Suzuki’s Mikaboyama temple, for example, is located in Sanbagawa – an area three hours’ drive from Tokyo with only 500 residents, and which also has three other Buddhist temples, one Shinto shrine and a church.\nA surge in religious properties coming up for sale has the Japanese authorities worried that prospective buyers are not interested in them for heavenly purposes, but rather, are out to dodge taxes or possibly even launder money.\n“It’s already a sense of crisis for us and the religious community,” said an official at Japan’s Agency for Cultural Affairs, which oversees religious sites.\nCases of temple or shrine properties being extensively repurposed have triggered public outrage.\nIn Osaka, a temple sold in 2020 was later razed and dozens of graves were relocated to make way for a property development.\nIn Kyoto, a case about a temple that was demolished and turned into a carpark made headlines in 2024.\nOwning a temple, shrine or church recognised as a religious corporation in Japan can confer sizeable tax benefits.\nBusinesses under such corporations that offer religious services such as funerals do not have to pay taxes, while other non-religious businesses also enjoy preferential tax rates.\nA wide range of undertakings are allowed, from restaurants to hair salons to hotels.\nJapan had about 180,000 religious sites with corporation status as at end-2023, according to the agency’s data.\nThe number of so-called inactive corporations – such as those with no religious events for more than a year – jumped by a third to more than 4,400.\nWhen monks or priests die without a successor, the overseeing religious group will usually appoint someone to take over, or voluntarily relinquish the site’s corporation status.\nHowever, there are around 7,000 religious sites that operate independently of these groups and are considered easy to acquire, according to the agency and specialist brokers.\nThe cultural affairs agency said it has stepped up efforts to dissolve the corporation status of inactive religious sites to stop them from being targeted by dubious buyers.\nWhen big earthquakes hit, often damaging temples and shrines, agency officials visit religious groups in those areas, warning them about falling prey to such buyers.\nIn 2023, 17 religious corporations were voluntarily dissolved and six were ordered to dissolve. The agency said the number would increase in 2024 and 2025 as it ratchets up scrutiny.\nIt might seem easier for Japan to change its laws to more strictly control the criteria for purchasing religious sites.\nBut the agency said the government is wary about amending laws related to religion, as that could be seen as impinging on religious freedom, which is guaranteed by Japan’s Constitution.\nReuters checks of six websites specialising in brokering the sale of religious properties showed hundreds on the market.\nMost are only obliquely described online with brokers saying sellers prefer to conduct sales as privately as possible.\nOsaka-based broker Takao Yamamoto told Reuters interest is surging. A religious corporation licence alone can fetch 30 million yen (S$270,000), he adds.\nSome religious sites, especially those with profitable graveyards, are advertised for millions of dollars.", "url": "https://www.straitstimes.com/asia/east-asia/as-sales-of-japan-temples-and-shrines-surge-a-crackdown-on-bad-faith-buyers"}