{"authors": [], "date_download": "2024-10-12 13:55:28", "date_modify": "2024-10-12 13:55:28", "date_publish": "2023-08-10 10:40:00", "description": "Households spend an average of $61 per month to provide medical care for pets. Read more at straitstimes.com.", "filename": "asia_east-asia_s-korean-govt-to-unveil-medical-care-plans-for-pets-amid-growing-pet-population_1728741328.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/10/cat-323262150.jpg.png", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_s-korean-govt-to-unveil-medical-care-plans-for-pets-amid-growing-pet-population_1728741328.html", "title": "South Korea to unveil medical care plans for pets amid their growing numbers", "title_page": "South Korea to unveil medical care plans for pets amid their growing numbers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - The South Korean government plans to propose new policies to improve its medical care system for pets amid their growing population in the country.\nIn 2022, the number of households with dogs or cats in Korea came to 6.02 million, rising sharply by 65.4 per cent from 3.64 million in 2012, according to a Ministry of Agriculture, Food and Rural Affairs report at a meeting held on Wednesday.\nAccording to the ministry, local households spend an average of 60,000 won (S$61) per month to provide medical care for their pets, which takes up 40 per cent of the average monthly care expenses tallied at 150,000 won.\nRecognising the need to improve the medical care system for pets, the government will release a set of new policies in October. The policies will focus on offering specialised medical services for pets and lessening the financial burden for households.\nSeparately, the exemption on value-added taxes will be expanded to some 100 essential or frequently required veterinary services from Oct 1.\nThe exemption, currently granted to only a few medical services – such as vaccination and neutering – will be expanded to include X-rays, ultrasound scans, computerised tomography scans, and treatments for pneumonia and diarrhoea.\n“The expansion of exemptions on value-added taxes will lessen the burden of medical costs on households with pets,” said an official from the Agriculture Ministry.\n“We will work on a soft landing of the policies in close cooperation with veterinary circles.”\nThe authorities will work on standardising medical services for pets as well, as each vet clinic offers similar services under different names and procedures. The standardisation will come in January.\nThe pet insurance system will also be tackled. Less than 0.89 per cent of registered dogs and cats were covered under pet insurance as at 2022.\nThe government will encourage companies to expand their coverage to include serious conditions such as cancers and cardiac surgery.\nThe Financial Services Commission and the Agriculture Ministry will jointly announce the measures to improve pet insurance in September.\nAs Korea’s pet industry remains relatively small, valued at 8 trillion won – a small portion of the global market worth US$378.1 billion (S$509.4 billion) as at 2022 – the government hopes to expand the overall industry to 15 trillion won by 2027, nearly double its current size.\nIt has set the goal to export pet food worth US$500 million by 2027, up from US$149 million in 2022.\nIt will come up with a separate classification system for pet food, different from the existing system for livestock feed. Making pet food products that meet global standards in terms of nutrition, packaging and advertising is also on the agenda. THE KOREA HERALD/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/s-korean-govt-to-unveil-medical-care-plans-for-pets-amid-growing-pet-population"}