{"authors": [], "date_download": "2024-10-12 13:36:17", "date_modify": "2024-10-12 13:36:17", "date_publish": "2023-10-18 23:00:16", "description": "Egypt is the only state apart from Israel to share a border with the Gaza Strip. Read more at straitstimes.com.", "filename": "asia_israel-will-not-allow-gaza-supplies-from-israel-but-not-block-from-egypt-pm_1728740177.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/19/10922158.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_israel-will-not-allow-gaza-supplies-from-israel-but-not-block-from-egypt-pm_1728740177.html", "title": "Israel says it will not prevent aid entering Gaza from Egypt but no supplies for Hamas", "title_page": "Israel says it will not prevent aid entering Gaza from Egypt but no supplies for Hamas | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - Israel will not stop aid entering Gaza from Egypt but supplies will not be allowed to reach Palestinian group Hamas, the government said on Wednesday, after talks with US President Joe Biden who called for easing a humanitarian crisis in the enclave.\nEgypt, the only state apart from Israel to share a border with the Gaza Strip, has been stockpiling aid on its side of the border, but trucks have been unable to cross amid Israel’s heavy airstrikes in its war with Hamas.\nAfter Hamas launched a devastating attack on Israeli territory on Oct 7, Israel said it was imposing a “total blockade” on the narrow strip of land that is home to 2.3 million people, cutting electricity supplies and halting flows of food and fuel.\nThe UN has warned about a “humanitarian catastrophe”.\n“Israel will not prevent humanitarian assistance from Egypt as long as it is only food, water and medicine for the civilian population located in the southern Gaza Strip or (those)evacuating to there, and as long as these supplies do not reach Hamas,” the office of Prime Minister Benjamin Netanyahu said.\nIt said in a statement that Israel was taking this decision after a request from Mr Biden, but added that Israel would continue the blockade of humanitarian aid from Israel into Gaza “as long as our hostages are not returned”.\n“Any supplies that reach Hamas – will be prevented,” it said.\nIsrael has told people in Gaza to move from the north to the south for their own safety during the conflict.\nAid trucks had on Tuesday moved closer to the Rafah crossing between Egypt and Gaza from the Egyptian town of al-Arish, in the north of the Sinai Peninsula. But they had not been able to enter Gaza in the absence of an agreement to deliver relief.", "url": "https://www.straitstimes.com/asia/israel-will-not-allow-gaza-supplies-from-israel-but-not-block-from-egypt-pm"}