{"authors": [], "date_download": "2024-10-12 13:37:16", "date_modify": "2024-10-12 13:37:16", "date_publish": "2024-08-19 14:36:52", "description": "It would be the German navy's first passage through the strait since 2002. Read more at straitstimes.com.", "filename": "asia_east-asia_german-warships-await-orders-on-crossing-disputed-taiwan-strait_1728740236.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/19/LYNXMPEK7I05R-1.jpg?VersionId=CN_YZiLHfG_Ed8LENn0Lh8YAjQ843Vpm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_german-warships-await-orders-on-crossing-disputed-taiwan-strait_1728740236.html", "title": "German warships await orders on crossing disputed Taiwan Strait", "title_page": "German warships await orders on crossing disputed Taiwan Strait | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN – Two German warships await orders from Berlin, their commander said, to determine whether in September they will be the first German naval vessels in decades to pass through the disputed Taiwan Strait, drawing a rebuke from Beijing.\nWhile the US and other nations, including Canada, have sent warships through the disputed strait in recent weeks, it would be the German navy's first passage through the strait since 2002.\nThe Taiwan Strait is a major trade route through which about half of global container ships pass, and both the United States and Taiwan say it’s an international waterway.\n\"The decision has not been taken yet,\" the commander of the naval task group, Rear Admiral Axel Schulz, told Reuters in a telephone interview, adding that the weather would play a role.\n\"We are showing our flag here to demonstrate that we stand by our partners and friends, our commitment to the rules-based order, the peaceful solution of territorial conflicts and free and secure shipping lanes.\"\nAsked about the German ships’ potential passage, China’s foreign ministry said Taiwan was an internal Chinese affair and the key to stability was opposing Taiwan’s independence.\n“China has always been opposed to the undermining of China’s territorial sovereignty and security under the guise of freedom of navigation,” ministry spokesperson Mao Ning told reporters in Beijing.\nBefore their possible passage through the strait in September, the frigate Baden-Wuerttemberg and the replenishment ship Frankfurt am Main plan to call in Tokyo on Aug 20. They will also make stops in South Korea and the Philippines.\nThey will also take part in exercises in the region with France, Indonesia, Italy, Japan, Malaysia, Singapore, the Philippines, and the United States.\nOver the last four years, Beijing's military has increased its activities in the narrow strait.\nSailings through the waterway by foreign warships, especially American, are regularly condemned by Beijing, which says such missions “undermine peace and stability” in the region.\nGermany, for whom both China and Taiwan, with its huge chip industry, are major trade partners, has joined other Western nations in expanding its military presence in the region as their alarm has grown over Beijing's territorial ambitions.\nIn 2021, a German warship sailed through the South China Sea, for the first time in almost 20 years.\nIn July, the Luftwaffe deployed fighter jets to Japan for the first joint drills there.\nRear Adm Schulz said he was not planning for any specific security measures should the warships under his command cross the Taiwan Strait, calling it a \"normal passage\" similar to sailing through the English Channel or the North Sea.\nHowever, he anticipated any passage would be closely monitored.\n\"I expect the Chinese navy and potentially the coastguard or maritime militia to escort us,\" he said, describing this as common practice. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/german-warships-await-orders-on-crossing-disputed-taiwan-strait"}