{"authors": [], "date_download": "2024-10-12 13:32:56", "date_modify": "2024-10-12 13:32:56", "date_publish": "2023-03-04 22:01:42", "description": "The seizure is one of the biggest that Australian police have been involved in. Read more at straitstimes.com.", "filename": "asia_australianz_international-drug-bust-nets-911m-of-cocaine-bound-for-australia_1728739976.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/04/placeholderforeign.jpg?VersionId=A3gS7c9u2nCKR5FaVmrEGzyn2ql8BAM_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_international-drug-bust-nets-911m-of-cocaine-bound-for-australia_1728739976.html", "title": "International drug bust nets $911m of cocaine bound for Australia", "title_page": "International drug bust nets $911m of cocaine bound for Australia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - A joint US and Australian law enforcement operation busted an international drug ring after intercepting 2.4 tonnes of cocaine aboard a vessel off the coast of South America that had been bound for Australia.\nThe cocaine was linked to a Mexican drug cartel and had a street value of around A$1 billion (S$911 million).\nIt was equivalent to half of Australia’s estimated annual consumption, making the seizure one of the biggest that Australian police have been involved in.\nTwelve suspects have been arrested and charged in the case, Western Australian state police said in a statement on Saturday.\nIt was the first time details of the operation were released. It began last November when the US Drug Enforcement Administration (DEA) intercepted the vessel.\nWestern Australian police substituted the cargo with identically packed fake cocaine and dropped it roughly 40 nautical miles (74km) west of state capital Perth on Dec 28.\nThree suspected members of the “Australian arm of a drug syndicate” with 1.2 tonnes of fake cocaine were arrested on Dec 30, after allegedly making three trips out through rough seas to collect the packages.\nA further nine arrests were made through Jan 13, including a traffic stop on the Great Eastern Highway, roughly 600km east of the state capital Perth, where officers found more than A$2 million in cash.\nHailing the success of “Operation Beech”, Western Australia police commissioner Col Blanch said in a statement: “The operation sends a message to international drug traffickers – your deadly drugs are not welcome here.”\nA 39-year-old male US citizen was among the 12 charged, police said. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/international-drug-bust-nets-911m-of-cocaine-bound-for-australia"}