{"authors": [], "date_download": "2024-10-12 13:55:00", "date_modify": "2024-10-12 13:55:00", "date_publish": "2024-03-26 13:45:38", "description": "Couples were exhausted by the expense and time required for big weddings. Read more at straitstimes.com.", "filename": "asia_china-battling-low-birth-rates-and-high-costs-encourages-frugal-weddings_1728741300.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/26/LYNXNPEK2P05M-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-battling-low-birth-rates-and-high-costs-encourages-frugal-weddings_1728741300.html", "title": "China, battling low birth rates and high costs, encourages frugal weddings", "title_page": "China, battling low birth rates and high costs, encourages frugal weddings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG/SHANGHAI - Young couples in China planning “simple” weddings, rather than traditional banquets with hundreds of guests, was one of the top hits online after an article urging more frugal nuptials was published by the government body in charge of women’s rights.\nThe article by the All China Women’s Federation, featured on Chinese search engine Baidu’s “hot list” on March 26, said couples were exhausted by the expense and time required for big weddings.\nChanges include shrugging off rituals such as renting luxury cars, fancy photographers and souvenirs for the guests, instead opting for a small-scale party for family and close friends.\nOne couple interviewed said they spent around 6,000 yuan (S$1,100) for their nuptials, significantly lower than traditional wedding banquets that can cost more than 200,000 yuan.\nThe shift to a more simple style is important to develop good future customs, the article said.\n“From a social perspective, extravagant celebrations of happy events are a bad habit... the rise of minimalist weddings meets the demand for frugal weddings and will help to develop a good custom.”\nThe post comes as the number of new marriages in China jumped 12.4 per cent in 2023 compared with a year earlier, reversing close to a decade of declines as many young couples tied the knot after delaying their nuptials due to the Covid-19 pandemic.\nPolicymakers are grappling with how to reverse the fall in new births after China’s population fell for a second consecutive year in 2023.\nMarriage rates in China are closely tied to birth rates, giving some cheer to policymakers that a tick up in marriages could yield to more babies being born and soften the population decline in 2024.\nChina’s Premier Li Qiang pledged in March the country would work towards “a birth-friendly society and promote long term, balanced population development” and reduce the cost of childbirth, parenting and education.\nMany young couples have put off getting married and having children due to high costs.\nChina is one of the world’s most expensive places to bring up a child relative to its gross domestic product per capita, a prominent Chinese think-tank said in February. REUTERS", "url": "https://www.straitstimes.com/asia/china-battling-low-birth-rates-and-high-costs-encourages-frugal-weddings"}