{"authors": [], "date_download": "2024-10-12 13:46:43", "date_modify": "2024-10-12 13:46:43", "date_publish": "2020-02-08 06:34:30", "description": "Across mainland China, there were 3,399 new confirmed infections on Friday. Read more at straitstimes.com.", "filename": "asia_east-asia_coronavirus-chinas-death-toll-hits-717-as-hubei-province-reports-81-new-fatalities_1728740803.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/02/08/nz_ambulance_080220.jpg?VersionId=KrqYRC85DSAAYT9TqD6cnuXB3S7CZTn.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_coronavirus-chinas-death-toll-hits-717-as-hubei-province-reports-81-new-fatalities_1728740803.html", "title": "Coronavirus: China's death toll hits 722, surpasses Sars toll as Hubei province reports 81 new fatalities", "title_page": "Coronavirus: China's death toll hits 722, surpasses Sars toll as Hubei province reports 81 new fatalities | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WUHAN (REUTERS, AFP, BLOOMBERG) - The number of deaths from China's new coronavirus epidemic jumped to 722 on Saturday (Feb 8) after hard-hit Hubei province reported 81 new fatalities.\nThe toll is now higher than that of the Severe Acute Respiratory Syndrome (Sars) virus, which left nearly 650 people dead in mainland China and Hong Kong in 2002-2003.\nAcross mainland China, there were 3,399 new confirmed infections on Friday, bringing the total accumulated number so far to 34,546, the country's National Health Commission said on Saturday\nIn its daily update, Hubei's health commission also confirmed another 2,841 new cases in the central province, where the outbreak emerged in December, taking the total in the province to 24,953.\nWith the latest deaths, the total fatalities in Hubei province is 699. Most of the new deaths were in Hubei's provincial capital of Wuhan, where the virus is believed to have originated.\nWuhan reported 67 new deaths on Friday, up from 64 on Thursday. A total of 545 people in Wuhan have now died from the virus. New confirmed cases in Wuhan increased by 1,985 on Friday, up from 1,501 on Thursday.\nIn mainland China, excluding the 2,050 people who had recovered and the 722 who had died, the total number of outstanding cases stood at 31,774.\nA study has found that 40 health-care workers were infected with the novel coronavirus by patients at a single Wuhan hospital in January, underscoring the risks to those at the frontlines of the growing epidemic.\nOne patient who was admitted to the surgical department was presumed to have infected 10 health-care workers, according to the paper that was authored by doctors at the Zhongnan Hospital of Wuhan University and published in the Journal of the American Medical Association (Jama) on Friday.\nSeventeen patients who were hospitalised for other reasons also became infected by the coronavirus. A total of 138 patients got the virus in a period spanning Jan 1 to Jan 28, with hospital-associated transmission accounting for 41 per cent of all cases.\nMeanwhile, China has assigned two new officials to be in direct control of the efforts to manage the coronavirus outbreak in Hubei province.\nChen Yixin, who was previously the top Communist Party secretary in the capital of Hubei, will be the the deputy head of the central government's directing group on Hubei, according to a WeChat blog affiliated with state media.\nThe group is in charge of sorting out the epidemic in the province and is led by Vice-Premier Sun Chunlan.", "url": "https://www.straitstimes.com/asia/east-asia/coronavirus-chinas-death-toll-hits-717-as-hubei-province-reports-81-new-fatalities"}