{"authors": [], "date_download": "2024-10-12 13:59:12", "date_modify": "2024-10-12 13:59:12", "date_publish": "2024-05-11 21:28:00", "description": "They pilfered 1,014GB of data from a court’s computer system from January 2021 to February 2023. Read more at straitstimes.com.", "filename": "asia_east-asia_north-korea-hackers-stole-data-from-south-korea-court-computers-police_1728741552.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/11/2020101631517480b0e6c6f9-141e-4bb6-bb85-787c295762c6.jpg?VersionId=ReEttLMvw2rqIMDMek0VBzEfD9O3Qg2f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_north-korea-hackers-stole-data-from-south-korea-court-computers-police_1728741552.html", "title": "North Korea hackers stole data from South Korea’s court computers: Seoul police", "title_page": "North Korea hackers stole data from South Korea’s court computers: Seoul police | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - North Korean hackers stole sensitive data, including individuals’ financial records, from a South Korean court computer network over two years, Seoul police said on May 11.\nThe nuclear-armed North is known to operate an army of thousands of hackers operating both inside the largely isolated country and apparently overseas, and has been blamed for several major cyberattacks in the past.\nSouth Korean national police said the hackers pilfered 1,014GB of data from a court’s computer system from January 2021 to February 2023, citing a joint investigation with the country’s spy agency and prosecutors.\nThe hackers’ malware transmitted stolen data, including South Koreans’ marriage and personal debt records, to “four domestic and four overseas servers” before it was finally “detected by antivirus software”, the national police said in a statement sent to AFP.\nThe data breach was found to be the work of a North Korean hacking outfit after the authorities compared the detected malicious programmes, server payment details and IP addresses with those identified in earlier hacking cases attributed to Pyongyang.\nThe Seoul authorities have retrieved and identified just 4.7GB of the stolen data, which stored 5,171 documents related to personal debt rehabilitation cases, including marriage certificates and statements about debt and reasons for insolvency, police said.\nAnalysts say the North has stepped up cyberattacks in recent years in a bid to earn hard foreign currency in the face of United Nations sanctions imposed over its nuclear and missile programmes.\nAccording to Seoul, Tokyo and Washington, Pyongyang stole as much as US$1.7 billion (S$2.3 billion) in cryptocurrency in 2022 alone and supported its weapons programmes in part by gathering information through “malicious cyber activities”.\nIn February, Seoul’s spy agency said North Korean spies were using LinkedIn to pose as recruiters and entice South Koreans working at defence companies, so the spies could access information on the firms’ technology.\nNorth Korea’s cyber-programme dates back to at least the mid-1990s, but has since grown to a 6,000-strong cyberwarfare unit, known as Bureau 121, that operates from several countries, including Belarus, China, India, Malaysia and Russia, according to a 2020 US military report. AFP", "url": "https://www.straitstimes.com/asia/east-asia/north-korea-hackers-stole-data-from-south-korea-court-computers-police"}