{"authors": ["Walter Sim"], "date_download": "2024-10-12 13:51:29", "date_modify": "2024-10-12 13:51:29", "date_publish": "2022-03-16 22:55:45", "description": "More than 3 million homes are said to have lost power after the quake Read more at straitstimes.com.", "filename": "asia_east-asia_strong-earthquake-hits-east-japan-tsunami-warning-issued_1728741089.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/17/yu_quakemart.JPG?VersionId=ETUzujntT3j8DJMqqiaDZkAToCjokKpB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_strong-earthquake-hits-east-japan-tsunami-warning-issued_1728741089.html", "title": "7.3-magnitude quake strikes off north-east Japan, a Shinkansen bullet train derailed", "title_page": "7.3-magnitude quake strikes off north-east Japan, a Shinkansen bullet train derailed | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - A powerful earthquake hit off Fukushima in north-east Japan on Wednesday night (March 16), shaking buildings more than 200km away in Tokyo and knocking out power in millions of homes.\nThe magnitude 7.3 quake, which measured six-upper on Japan’s seven-point seismic intensity scale, struck at 11.36pm (10.36pm in Singapore) off a region that was devastated in the March 11, 2011 earthquake, tsunami and nuclear disaster.\nThe quake’s epicentre was off the coast of the Fukushima region, at a depth of 60km. The Japan Meteorological Agency warned of the risks of strong aftershocks over the next week.\nJapan’s seismic intensity scale measures the degree of shaking. The reading of six-upper recorded in north-east Japan meant it was impossible to remain standing or move without crawling. Tokyo had a reading of four, which meant it could be felt by most people.\nTsunami alerts were sounded for parts of the north-east coast, for waves of up to one metre. Evacuation advisories were in place for wide areas of the north-east coast.\nA Tohoku Shinkansen bullet train service derailed between Fukushima and Shiroishi-Zao stations, but no injuries were reported among the 100 passengers on board.\nSirens sounded in Tokyo and neighbouring Chiba, Kanagawa and Saitama due to the quake, with 2.1 million households plunged into total darkness, including 700,000 homes in Tokyo, utilities company Tokyo Electric Power Co (Tepco) said. Parts of Ginza, Shimbashi, Roppongi and Akasaka districts lost power temporarily.\nAnother 1.48 million homes were without power in north-east Japan, reports said.\nTrain services were immediately halted and highways shut after the quake to assess any damage, while both Haneda and Narita Airports shut their runways.\nPrime Minister Fumio Kishida, whose government has set up a disaster emergency centre, told reporters just after midnight that he was still gathering information on the quake, including the extent of damage.\nHe urged residents to take full precautions to ensure their safety.\nThere have been reports of some minor injuries and tsunami waves of 20cm have hit Ishinomaki in Miyagi prefecture.\nThere were no radiation abnormalities at the crippled Fukushima Daiichi nuclear power plant, though checks for facility damage were ongoing. The fire alarm was activated at the plant’s Unit Five turbine building.\nThe cooling pumps for the spent nuclear fuel pools of Units One and Three of the nearby Fukushima Daini nuclear power plant had shut down due to the earthquake, the Nuclear Regulatory Agency said.\nThe cooling pump for Unit Three has been subsequently restored, while the authorities are working to restore the pump for Unit One.\nThe agency said that the outage “was not immediately dangerous because there is still time before the nuclear fuel pool temperature rises”.", "url": "https://www.straitstimes.com/asia/east-asia/strong-earthquake-hits-east-japan-tsunami-warning-issued"}