{"authors": [], "date_download": "2024-10-12 13:38:57", "date_modify": "2024-10-12 13:38:57", "date_publish": "2024-05-15 18:18:22", "description": "UN Palestinian relief agency UNRWA has denied allegations of cooperation with Hamas. Read more at straitstimes.com.", "filename": "asia_battles-rage-across-gaza-strip-israel-shows-images-of-gunmen-at-un-site_1728740337.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/15/LYNXMPEK4E0FQ-1.jpg?VersionId=8bFUzLsVkeA9YWhYfRUxyj7ICayEqFVX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_battles-rage-across-gaza-strip-israel-shows-images-of-gunmen-at-un-site_1728740337.html", "title": "As battles rage across Gaza Strip, Israel shows images of gunmen at UN site", "title_page": "As battles rage across Gaza Strip, Israel shows images of gunmen at UN site | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CAIRO/JERUSALEM – Israeli troops fought militants across Gaza on May 15, including in the southern city of Rafah that had been a refuge for civilians, in an upsurge of the more than seven-month war that has killed tens of thousands of Palestinians.\nAntagonism between Israel and the United Nations worsened as the Israeli army sought an explanation for footage showing armed men next to UN Palestinian relief agency vehicles. Separately, the UN said it was investigating an unidentified strike that killed an international staff member in Gaza earlier in the week.\nPrime Minister Benjamin Netanyahu’s army has in recent days pressed into the east of Rafah in pursuit of what it says are four Hamas battalions, despite warnings from its ally the United States and others to hold off to avoid mass civilian casualties.\nSince Hamas’ Oct 7 attack, Israel has killed 35,000 Palestinians, according to Gaza health officials, with 82 dead on May 14 in the highest single-day toll for weeks.\nHamas-led gunmen killed some 1,200 people in their initial raid, according to Israeli tallies, and still hold 128 hostages out of 252 they captured in their cross-border raid.\nIn the northern Jabalia refugee camp, residents said Israeli tanks had destroyed clusters of homes but were facing heavy resistance.\n“They are bombing houses on top of their inhabitants. We know of many families being trapped inside their homes,” said Mr Abu Jehad.\nHamas ally Islamic Jihad said it killed some foot soldiers in Jabalia, while Israel’s military said it had eliminated “a large number of terrorists” in the camp, which it had claimed to have cleared months earlier.\nDeaths mount\nIsraeli tanks have been massed around the eastern edges of Rafah and in recent days, have been probing into built-up areas of the city, where hundreds of thousands of displaced people have been sheltering from fighting elsewhere.\nResidents said Israeli forces had pushed into three neighbourhoods and Palestinian gunmen were trying to prevent soldiers and tanks from moving towards the centre.\nIsrael said its troops targeted a training compound, killing militants in close-quarters combat and finding many weapons.\nIsrael reported one death in south Gaza which public broadcaster Kan said was the first such fatality since the start of a ground operation there last week.\nIn the north, Israel said it had concluded an operation in the Zeitoun area, killing “dozens of terrorists”. Residents said tanks had pulled back from the area, with dozens of homes destroyed or damaged, while Palestinian medics said dozens of civilians had been killed and wounded.\nIsrael said its troops had identified fighters in the central logistics compound of the UN Palestinian relief agency UNRWA east of Rafah and demanded an explanation. Reuters verified the location of the footage released by the Israeli army but could not verify when it was filmed or the identity of the men.\nIsrael’s Ambassador to the UN Gilad Erdan told Army Radio: “The UN has in part become a terrorist entity in itself because it cooperates with Hamas and covers for it.”\nThe UN said on May 14 it was investigating an unidentified strike on a car in Rafah earlier in the week, that killed its first international staff member since Oct 7, a retired Indian army officer who had been en route to the European Hospital.\nThe Israeli military said an initial inquiry had concluded that the vehicle, whose route it was unaware of, had been hit in an active combat zone and that the incident was under review.\nSome 254 aid workers have been killed in Gaza since the war began, according to the UN.\nUNRWA estimates 450,000 civilians have fled Rafah in the week since Israel told them to evacuate. But they have few places to go that are both safe and provide basic essentials.\nThe UN has warned of imminent famine and accused Israel of disregarding civilians and shooting at humanitarian convoys.\nGlobal watchdog The Committee to Protect Journalists said at least 105 media workers were among the dead in Gaza.\nAs the fighting intensifies, ceasefire talks mediated by Qatar and Egypt are at a stalemate, with Hamas demanding a permanent end to Israeli attacks and Mr Netanyahu’s government saying it will not stop until the group is annihilated.\nMr Netanyahu opposes the creation of an independent Palestinian state, which most foreign powers see as the only long-term solution to a conflict stretching back seven decades.\nThere was further unrest, too, in the second and larger occupied Palestinian territory, the West Bank.\nAyser Mohammad Safi, a 20-year-old Palestinian university student, was shot dead by Israeli forces in clashes in the city of Al-Bireh, according to official Palestinian news agency Wafa.\nNearly 500 Palestinians have been killed by Israeli fire in the West Bank since Oct 7, Palestinian authorities say. REUTERS", "url": "https://www.straitstimes.com/asia/battles-rage-across-gaza-strip-israel-shows-images-of-gunmen-at-un-site"}