{"authors": ["Tan Dawn Wei"], "date_download": "2024-10-12 13:48:40", "date_modify": "2024-10-12 13:48:40", "date_publish": "2024-01-28 05:00:00", "description": "The birthrate has been on the decline despite government efforts to reverse it. Read more at straitstimes.com.", "filename": "asia_baby-boom-expected-in-china-during-dragon-year-not-enough-to-save-fertility-crisis_1728740920.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/28/file7tv7wbe1ajddt7b128t.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_baby-boom-expected-in-china-during-dragon-year-not-enough-to-save-fertility-crisis_1728740920.html", "title": "Baby boom expected in China during Dragon Year not enough to save fertility crisis", "title_page": "Baby boom expected in China during Dragon Year not enough to save fertility crisis | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - At six months pregnant with a boy, actress Ma Qian is the envy of her girlfriends, many of whom want to have “dragon babies” as the auspicious year rolls around after a 12-year cycle.\nShe and her husband wasted no time after throwing their wedding banquet in July 2023 to try for a child.\n“It was all planned. As soon as we signed our papers, I started getting ready,” said the 27-year-old, who lives in Beijing with her 30-year-old husband, an investment manager.\nChina’s birth rate has been on a worrying decline for seven straight years, despite efforts by the government to persuade its young people to have more babies. The Year of the Dragon, however, has traditionally meant a baby bump for the country.\n“Although the dragon symbol doesn’t have a personal meaning for either of us, we have been taught from childhood that Chinese people are the descendants of the dragon,” said Ms Ma, who added that she has many friends who are now trying to conceive.\nMajority ethnic Chinese societies, including Singapore and Taiwan, also tend to have baby booms during dragon years, as those born under this zodiac sign are believed to bear desirable traits such as intelligence, leadership and good fortune.\nChina’s birth rate in the last Dragon Year, in 2012, increased from 13.27 per cent the year before to 14.57 per cent, before dipping to 13.03 per cent in 2013.\nExperts say there will also be more babies from couples who had put off getting married or having children during the Covid-19 pandemic, which ended in 2023.\nBut expectations are lower this time around.\n“Yes, I think there might be a rise, but it may be very moderate,” said Assistant Professor Mu Zheng, a sociologist who studies China’s fertility at the National University of Singapore.\n“Childbearing is still a big decision, involving extensive considerations. The auspicious connotations of the Year of the Dragon may motivate those who intend to have children to act on it, but for those who are reluctant, it may not be very effective.”\nThe blip will not be enough to reverse the rapid slide in the country’s birth rate, which its leaders have tried to stem with fertility-friendly policies ranging from extended maternity leave to cash rewards.\nIn 2022, China’s population declined for the first time since the 1960s, with India overtaking its lead to become the most populous nation in the world in 2023.\nStatistics released in January 2024 showed its population continuing to dwindle. Deaths outnumbered births by two million in 2023, with just nine million babies born in a country of 1.4 billion people.\nIts total fertility rate is now estimated to be about 1.0, well below the 2.1 that is required to maintain a stable population.\nIt is a crisis that is plaguing other Asian countries, such as South Korea, Singapore and Japan, which have total fertility rates ranging from 0.72 to 1.26.\nChina’s births have plunged in recent years – dropping dramatically by 50 per cent since 2016, the year after Beijing abandoned its 35-year-old one-child policy, and even after it revised it to a three-child scheme in 2021.\nLast year’s birth rate was just 6.39 per cent, the lowest on record since the founding of the People’s Republic of China in 1949.", "url": "https://www.straitstimes.com/asia/baby-boom-expected-in-china-during-dragon-year-not-enough-to-save-fertility-crisis"}