{"authors": [], "date_download": "2024-10-12 14:12:17", "date_modify": "2024-10-12 14:12:17", "date_publish": "2023-10-10 13:53:00", "description": "The arrest warrant for Du Zhaocai comes days after he was booted out of the Chinese Communist Party. Read more at straitstimes.com.", "filename": "asia_east-asia_china-orders-arrest-of-ex-sports-chief-accused-of-bribery-state-media_1728742337.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/10/LYNXNPEJ92044-2.jpg?h=8f3499bb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-orders-arrest-of-ex-sports-chief-accused-of-bribery-state-media_1728742337.html", "title": "China orders arrest of ex-sports chief accused of bribery: State media", "title_page": "China orders arrest of ex-sports chief accused of bribery: State media | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China has ordered the arrest of a former top sports official over alleged corruption, state media reported on Tuesday, as Beijing pursues a crackdown on graft in the sector.\nThe arrest warrant for Du Zhaocai, the former vice-head of China’s General Administration of Sport, comes days after he was booted out of the ruling Chinese Communist Party (CCP).\nChinese President Xi Jinping has been leading a clampdown on official misconduct since coming to power a decade ago. Proponents say the campaign helps to ensure honest governance, but critics say it allows Mr Xi to purge his political rivals.\n“China’s Supreme People’s Procuratorate (SPP) has ordered the arrest of Du Zhaocai... for suspected bribe-taking,” said a report by the state-run Xinhua news agency.\n“The case was transferred to procuratorial authorities for examination and prosecution following the conclusion of an investigation by the National Commission of Supervision.”\nA previous Xinhua report on Saturday said Du had “illegally accepted gifts and money” and was “found to have taken advantage of his posts to seek profits for others in business operations and employee recruitment”.\nIn addition to expelling him, the CCP would also “confiscate his illicit gains”, according to the report.\nDu joins a growing tally of sports figures in China investigated in 2023 for corruption.\nThat list includes Liu Jun, the head of China’s top professional football league, and notable football personalities such as former national coach Li Tie, who has been criminally charged with bribery and other violations.", "url": "https://www.straitstimes.com/asia/east-asia/china-orders-arrest-of-ex-sports-chief-accused-of-bribery-state-media"}