{"authors": [], "date_download": "2024-10-12 13:37:49", "date_modify": "2024-10-12 13:37:49", "date_publish": "2024-08-24 10:15:00", "description": "The two nations have been involved in tense maritime confrontations in recent months. Read more at straitstimes.com.", "filename": "asia_philippines-says-china-shot-flares-at-its-south-china-sea-plane_1728740269.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/24/2024-08-11T073405Z783677416RC2ID9A2HXFSRTRMADP3SOUTHCHINASEA-PHILIPPINES-CHINA.JPG?VersionId=SCDpjio3Ihjj1UJm5JX3zrf881lmYLaz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_philippines-says-china-shot-flares-at-its-south-china-sea-plane_1728740269.html", "title": "Philippines says China shot flares at its plane in South China Sea", "title_page": "Philippines says China shot flares at its plane in South China Sea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA – The Philippines accused China on Aug 24 of firing flares at one of its aircraft as it patrolled over the South China Sea in August.\nBeijing claims most of the strategic waterway and has been involved in tense maritime confrontations with Manila in recent months, sparking fears of armed conflict that could draw in the US, a Philippine military ally.\nA Chinese fighter jet “engaged in irresponsible and dangerous manoeuvres” on Aug 19 as the Bureau of Fisheries and Aquatic Resources (BFAR) plane made a “maritime domain awareness flight” near Scarborough Shoal, the National Task Force for the West Philippine Sea said.\nThe unprovoked Chinese “harassment” included “deploying flares multiple times at a dangerously close distance of approximately 15m from the BFAR Grand Caravan aircraft”, the task force added in a statement accompanied by video clips of the incident.\nFlares were also launched near the same plane from the China-held Subi Reef on Aug 22 as the patrol craft was “monitoring and intercepting poachers encroaching upon the Philippines’ exclusive economic zone and the territorial seas”, it added.\nFlares are usually employed by military aircraft as decoys to protect them from missiles, but also for illumination.\nThe statement said the Chinese actions “demonstrated hazardous intent that jeopardised the safety of the personnel on board” the Philippine plane.\nIn a post on social media platform X, US Ambassador to the Philippines MaryKay Carlson said her country “stands firmly with the (Philippines) in condemning the PRC (People’s Republic of China) for launching flares at (Philippine) aircraft operating legally near Scarborough and Subi Reefs”.\nBoth countries “call on the PRC to cease provocative and dangerous actions that undermine a #FreeAndOpenIndoPacific”.\nChina’s Foreign Ministry said on Aug 23 that two Philippine military aircraft flew into its airspace over Subi Reef, which Manila also claims, on Aug 22.\nThe Chinese side undertook “necessary counter-measures in accordance with the law, in order to protect its own sovereignty and security”, it said in a statement, without specifying the actions that were taken.\nThe Chinese statement did not mention any Aug 19 incident over Scarborough Shoal, which China seized from the Philippines at the end of a 2012 stand-off.\nThe Scarborough Shoal incident occurred hours after Philippine and Chinese coast guard vessels collided near Sabina Shoal, with the Filipino side reporting structural damage on both of its patrol ships.\nThe shoal is located 140km west of the Philippine island of Palawan and about 1,200km from Hainan island, the nearest Chinese landmass.\nThe Philippines has also accused a Chinese air force plane of making a “dangerous manoeuvre” and dropping flares in the path of a Philippine air force plane that was patrolling over Scarborough on Aug 10.\nIn June, the Philippine military said one of its sailors lost a thumb in a confrontation off Second Thomas Shoal when the Chinese coast guard, wielding sticks, knives and an axe, also confiscated or destroyed Philippine equipment, including guns.\nBeijing has blamed the escalation on Manila and maintains that its actions to protect its claims are legal and proportional.\nIt has continued to press its claims to almost the entire South China Sea, despite an international tribunal ruling that its assertion has no legal basis.\nManila on Aug 24 urged Beijing to “immediately cease all provocative and dangerous actions that threaten the safety of Philippine vessels and aircraft”.\n“Such actions undermine regional peace and security and further erode the image of the PRC (People’s Republic of China) with the international community,” its statement said. AFP", "url": "https://www.straitstimes.com/asia/philippines-says-china-shot-flares-at-its-south-china-sea-plane"}