{"authors": [], "date_download": "2024-10-12 13:56:20", "date_modify": "2024-10-12 13:56:20", "date_publish": "2022-03-10 11:51:48", "description": "The draughtsboard sharks were housed in a chamber that measures oxygen levels in the water. Read more at straitstimes.com.", "filename": "asia_australianz_aussie-researchers-prove-that-sharks-too-need-good-nights-sleep_1728741380.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/10/AK_shk_100322_0.jpg?VersionId=v158imorCtTV_GWSNuXRMs1.uCmLx6CJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_aussie-researchers-prove-that-sharks-too-need-good-nights-sleep_1728741380.html", "title": "Aussie researchers prove that sharks, too, need good night's sleep", "title_page": "Aussie researchers prove that sharks, too, need good night's sleep | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY (XINHUA) - A team of Australian and New Zealand sleep researchers have for the first time proven that sharks need a good night's rest even with their eyes wide open.\nThe research, published in the Biology Letters on Wednesday (March 9), was able to monitor the metabolic rates and changing posture of sharks in a controlled lab environment, giving the first solid evidence for sleep in this 450-million-year-old animal.\nLead author on the study, Mr Michael Kelly from La Trobe University, said all previous research of sleep in sharks had been based on behavioural observations, and this was the first time that concrete, physiological evidence had been drawn.\n\"The issue with behaviour is that it can be misleading, whereas physiology kind of doesn't lie,\" Mr Kelly told Xinhua on Thursday.\n\"This is concrete evidence...which is why I'm supremely confident now that these animals are indeed engaging in sleep.\"\nSince 2018, the team of researchers had been conducting studies in Leigh, a small fishing village on the northern tip of New Zealand's north island.\nThe draughtsboard sharks used in the study were caught off the coast and brought back to a lab and housed in respirometry chamber, a chamber which measures oxygen levels in the water.\n\"And this gives you an indication as to what's going on with the metabolism. And what we were looking at is what levels their metabolism is at when they're swimming, compared to inactive,\" Mr Kelly said.\nThe researchers soon noticed that after about five minutes of rest, the metabolic rate of the shark dropped, and its posture made a clear shift.\n\"They go from sort of sitting up on their pectoral fins with their heads up on the ground, to just lying completely flat,\"Mr Kelly said, adding that this behaviour correlated directly with a drop in metabolism.\n\"So, we debunked the idea that they had to have their eyes closed, but certainly posture and metabolism were spot on.\"\nMr Kelly said the discovery would open up new avenues by which \"we could study sleep, and how it has evolved from prehistoric animals all the way to humans\".\nHe added: \"We all do it (sleep), every animal studied thus far does. It's survived over evolutionary time, even though it's like a super risky behaviour to engage in.\n\"So that suggests that sleep really is serving either a number of or maybe one all-encompassing function. But we still haven't gotten to the bottom of that.\"", "url": "https://www.straitstimes.com/asia/australianz/aussie-researchers-prove-that-sharks-too-need-good-nights-sleep"}