{"authors": [], "date_download": "2024-10-12 14:04:04", "date_modify": "2024-10-12 14:04:04", "date_publish": "2023-01-06 11:26:44", "description": "Taiwan is seeking a voice in a debate that could have ramifications for the global chip industry. Read more at straitstimes.com.", "filename": "asia_east-asia_taiwan-wants-to-join-wto-talks-on-china-s-protest-against-us-chip-sanctions_1728741844.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/06/2022-12-14T110034Z2005983639RC2M5Y98T2P4RTRMADP3MEXICO-USA-CHIPS-INSIGHT_3.JPG?VersionId=R3q0OOcQ4ncb45mFjIo1IHXzlF6Hop0d", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_taiwan-wants-to-join-wto-talks-on-china-s-protest-against-us-chip-sanctions_1728741844.html", "title": "Taiwan wants to join WTO talks on China’s protest against US chip sanctions", "title_page": "Taiwan wants to join WTO talks on China’s protest against US chip sanctions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TAIPEI - Taiwan has asked to join discussions centred on China’s protest against US chip sanctions at the World Trade Organisation (WTO), seeking a voice in a debate that could have ramifications for the global chip industry.\nThe island has formally requested a seat at the table when consultations begin, based on the outsized role it plays in global chipmaking, Taiwan said in a statement filed at the WTO.\nChina filed a dispute with the WTO in an effort to overturn US-imposed export controls, which aim to limit the Asian nation’s ability to develop a domestic semiconductor industry and equip its military.\nBeijing accused the US of economic protectionism, undermining trade rules and harming the global supply chain.\nThe US is putting pressure on allies from Seoul to Tokyo to go along with the restrictions.\nTaipei’s goal in seeking to join the WTO negotiations is to better understand how the dispute may affect global semiconductors, Taiwan’s Office of Trade Negotiations said in a statement on Friday.\nChips are the lifeblood of the island’s economy. It produces the vast majority of the world’s most advanced semiconductors, and its largest companies including Taiwan Semiconductor Manufacturing Co have abided by the US curbs.\n“Taiwan is requesting to join the consultation procedure to understand the supply-demand situation of chips,” the Taiwanese agency said.\nThe island has no intention of supporting China’s complaint, nor does the move imply “any dissatisfaction with the United States’ measures”.\nUS trade officials are set to travel to Taipei for talks later in January. A spokesman for the US Trade Representative didn’t immediately respond to a request for comment.\nJapan and the Netherlands have agreed in principle to join the US in tightening controls over the export of advanced chip tech to China.\nThey are likely to adopt at least some of the sweeping measures rolled out in October to restrict the sale of equipment to Chinese firms, Bloomberg News has reported.\nYet even if China is successful with its case, the WTO lacks the ability to force the US to reverse its actions.\nCoupled with domestic economic turmoil, the curbs have hobbled a plethora of the Asian nation’s biggest chip firms.\nChina’s semiconductor firms are facing new challenges at home with Beijing now shying away from lavishing colossal resources on them as before.\nIt’s pausing massive chip investments as a nationwide Covid-19 resurgence strains the country and its finances. Top officials are discussing alternatives to costly subsidies that have not rendered concrete results and instead encouraged both graft and the American sanctions. BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/taiwan-wants-to-join-wto-talks-on-china-s-protest-against-us-chip-sanctions"}