{"authors": ["Wahyudi Soeriaatmadja"], "date_download": "2024-10-12 14:04:36", "date_modify": "2024-10-12 14:04:36", "date_publish": "2023-09-13 20:15:00", "description": "The project had been set to be operational by 2019, but faced problems with land acquisition and delays due to Covid-19. Read more at straitstimes.com.", "filename": "asia_se-asia_indonesia-s-first-high-speed-train-to-begin-commercial-operations-in-early-october_1728741876.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/13/INDONESIA-TRANSPORT-RAIL-075512.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_indonesia-s-first-high-speed-train-to-begin-commercial-operations-in-early-october_1728741876.html", "title": "Indonesia’s first high-speed rail to begin commercial operations in early October", "title_page": "Indonesia’s first high-speed rail to begin commercial operations in early October | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA - Indonesia’s first high-speed rail linking the capital Jakarta and the country’s fourth-most populous city, Bandung, will begin operations in early October, with the aim of reducing huge economic losses caused by severe traffic jams in both cities, among other issues.\n“We hope people (will) shift from using private cars to using high-speed rail, MRT, LRT... so traffic jams, pollution can be reduced. Economic losses due to jams in greater Jakarta and Bandung have reached over 100 trillion rupiah (S$8.9 billion) annually,” said President Joko Widodo after travelling on the high-speed rail (HSR) on Wednesday.\nBandung is 150km from Jakarta by road.\nThe commercial operations starting in October will involve eight trips during the month, with the frequency rising to 28, 40 and 68 trips, respectively, in November, December and January, according to the government.\nOriginally set to be operational by 2019, the HSR project faced problems with land acquisition and construction delays due to Covid-19.\n“It’s comfortable. We ran at a speed of 350kmh. Didn’t feel anything (vibration) at all. We expect this to open for the public in early October,” Mr Widodo told reporters at Padalarang station, during the first leg of his round trip. His entourage departed at 9am local time (10am Singapore time).\nThe train reached Padalarang station, just outside Bandung, capital of Indonesia’s most populous West Java province, in half an hour, compared with three hours by normal train.\nWest Java has a population of about 50 million – slightly smaller than South Korea’s 52 million – which offers a good base of travellers for the train service.\nMr Widodo’s trip on Wednesday was preceded by a series of comprehensive trials, with the speed of 180kmh first clocked in May and gradually raised to the maximum speed of 385kmh the following month.\nHe was accompanied by several Cabinet ministers including State-Owned Enterprise Minister Erick Thohir and Cabinet secretary Pramono Anung, along with a group of reporters, social media content creators and TV personalities.\nThe 30-minute train ride from Halim station in East Jakarta to Padalarang station was followed by a 20-minute feeder train trip to reach Bandung’s city centre.\nThis is less than half the typical 2½-hour car journey between the two cities.\n“Ticket fares of the high-speed rail must be kept affordable, otherwise the facility would be used only for tourism, while commuters would shun it,” said Mr Muhammad Abi Berkah Nadi, who teaches railway mechanical engineering at Institut Teknologi Sumatera in Lampung province in Sumatra.\nThe government has yet to announce the fares.\nA caller to Jakarta-based Elshinta radio, who identified himself as Mr Iswanto and said he is a frequent Jakarta-Bandung traveller, said on Wednesday: “I normally use a private car or shuttle bus. I have no problem if the HSR fare is 350 rupiah a trip maximum.”\nConstruction of the 142km-long project began in 2016. It forms part of China’s Belt and Road Initiative and makes Indonesia the first South-east Asian nation to have a high-speed railway.\nIndonesian state companies, including rail operator KAI and construction company Wijaya Karya, control 60 per cent of project consortium KCIC, while China Railway Engineering Corporation and other Chinese companies hold the remaining stake.\nThe total projected cost of the Jakarta-Bandung HSR was initially estimated at US$6.07 billion (S$8.3 billion), but Jakarta said in 2022 that an additional US$1.2 billion was needed to meet the deadline for a commercial launch by June 2023.\nMr Kartika Wirjoatmodjo, a deputy to Indonesia’s State-Owned Enterprises Minister, said earlier that the high-speed rail service will open up a number of new economic zones along the Jakarta-Bandung corridor, spurring development of residential areas and businesses such as shopping malls.\nJapan’s Maglev bullet trains have clocked speeds of up to 603kmh, followed by France’s TGV trains at 574.8kmh. The Shanghai Maglev comes third, hitting speeds of 460kmh, while Italy’s Frecciargento trains can reach a maximum speed of 300kmh.\nA semi-high-speed train linking China’s south-western province of Yunnan to Laos’ capital city Vientiane, which started in December 2021, runs at 160kmh.", "url": "https://www.straitstimes.com/asia/se-asia/indonesia-s-first-high-speed-train-to-begin-commercial-operations-in-early-october"}