{"authors": ["Walter Sim"], "date_download": "2024-10-12 14:03:05", "date_modify": "2024-10-12 14:03:05", "date_publish": "2023-05-12 23:46:40", "description": "Singapore was one of six non G-7 member countries invited by Japan, the host nation, to attend the meeting. Read more at straitstimes.com.", "filename": "asia_east-asia_dpm-wong-has-very-productive-day-of-meetings-in-rare-attendance-for-singapore-at-g-7_1728741785.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/13/398263486_9.jpg?VersionId=sZTkex2m4fAC1G2VqvoV9sqHb3ukpifN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_dpm-wong-has-very-productive-day-of-meetings-in-rare-attendance-for-singapore-at-g-7_1728741785.html", "title": "DPM Wong has ‘very productive’ day of meetings in rare attendance for Singapore at G-7", "title_page": "DPM Wong has ‘very productive’ day of meetings in rare attendance for Singapore at G-7 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NIIGATA, Japan – International cooperation through multilateral platforms is crucial to overcome the many challenges facing the global economy, Singapore Finance Minister Lawrence Wong said on Friday.\nMr Wong, who is also Deputy Prime Minister, was in the coastal central city of Niigata as Singapore’s representative at the Group of Seven (G-7) finance ministers and central bank governors’ meeting.\nSingapore was one of six non G-7 member countries invited by Japan, the host nation, to attend the meeting of finance chiefs, marking a rare occasion where the Republic attended a G-7 meeting.\nThe other guest nations were Brazil, Comoros, India, Indonesia and South Korea.\nAt dialogue sessions, the invited countries spoke on issues like cooperation on sustainable goals, quality infrastructure and supply chains. Debt issues affecting developing countries were discussed at outreach sessions.\nMr Wong said he had a “very productive day” at the meeting, which gave him the “opportunity to reconnect with friends old and new”.\nHe added that international cooperation through platforms like the G-7, as well as the Group of 20 (G-20) forum for major economies, was crucial. Singapore, while not a G-20 country, is frequently invited to participate at the forum.\nMr Wong said that it was Singapore’s honour to be invited to the G-7, with the six guest countries “sharing our views on how developed and developing countries can work together to create a better and more sustainable future for all”.\nHe said on Twitter that he met his South Korean counterpart, Mr Choo Kyung-ho, and they “discussed many new opportunities to strengthen bilateral cooperation”. Mr Wong said he congratulated Mr Choo, who is South Korea’s DPM and Economy and Finance Minister, for successfully hosting the Asian Development Bank meeting in Incheon earlier in May.\nThe meeting had led to a report that Asean economies will need infrastructure investment of at least US$2.8 trillion (S$3.7 trillion) from 2023 to 2030 to sustain economic growth, reduce poverty and respond to climate change.\nMr Wong also met Indian Finance Minister Nirmala Sitharaman on Friday, and they discussed the tie-up between India’s Unified Payments Interface (UPI) real-time payments system and Singapore’s PayNow facility launched in February.\n“We welcome others to come on board,” he said, adding that there were “many more opportunities to collaborate on the digital economy, both bilaterally and at the G-20”.\nIndia is the host of the G-20 forum of major economies in 2023, which holds its main summit in September.\nIndia’s Finance Ministry said the two ministers exchanged views on strengthening bilateral cooperation in food security, climate change and skills development. Ms Sitharaman highlighted the emerging role of artificial intelligence (AI), with the two ministers discussing ways to work together on AI research and quantum computing, the ministry added.", "url": "https://www.straitstimes.com/asia/east-asia/dpm-wong-has-very-productive-day-of-meetings-in-rare-attendance-for-singapore-at-g-7"}