{"authors": [], "date_download": "2024-10-12 13:43:57", "date_modify": "2024-10-12 13:43:57", "date_publish": "2023-05-28 11:50:00", "description": "The European Union Aviation Safety Agency and Federal Aviation Administration have not certificated the aircraft. Read more at straitstimes.com.", "filename": "asia_china-s-first-homegrown-passenger-jet-the-c919-takes-off-on-its-first-commercial-flight_1728740637.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/28/XxjpsgC00704020230528PEPFN0A001_2.JPG?VersionId=5Y.yMkmQJDh4SpWFQNrlwxeaVa16MVkW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-s-first-homegrown-passenger-jet-the-c919-takes-off-on-its-first-commercial-flight_1728740637.html", "title": "China’s first home-grown passenger jet, C919, marks first commercial flight", "title_page": "China’s first home-grown passenger jet, C919, marks first commercial flight | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING/SHANGHAI –China Eastern Airlines Corp Ltd entered China’s home-grown narrow-body C919 jet into passenger service on Sunday and completed its first commercial flight, marking a milestone in the country’s effort to become more self-reliant.\nThe C919 is the product of state-backed Commercial Aviation Corp of China (COMAC) which began developing the jet 15 years ago to rival Airbus SE’s A320neo and Boeing Co’s 737 MAX single-aisle jet families.\nPresident Xi Jinping has hailed the project as a triumph of Chinese innovation, while on Sunday state media trumpeted the plane as a symbol of industrial prowess and national pride.\n“After generations of endeavour, we finally broke the West’s aviation monopoly and rid ourselves of the humiliation of ‘800 million shirts for one Boeing’,” Beijing Daily wrote, referring to the early years of economic reform around 40 years ago when China manufactured mainly low-value goods.\nThe C919 took off at 10.32am from Shanghai Hongqiao International Airport where COMAC and China Eastern Airlines are headquartered, and landed two hours later at Beijing Capital Airport, showed flight tracker app Variflight.\n“I’m confident about the plane. The flight was smoother than expected,” one of about 130 passengers told state broadcaster CCTV as he disembarked.\nThe plane is scheduled to return to Shanghai on Sunday, then make a longer two-way flight to the southwestern city of Chengdu on Monday.\nMr Lv Boyuan, a 21-year-old student and aviation enthusiast, was at Shanghai’s airport on Sunday to fly to Chengdu from where he planned to return on the C919 the following day.\n“I’ve been really looking forward to its flight, especially because it’s a new-generation aircraft, unlike Boeing and Airbus equivalents which have been around for a number of years now,” said MrLv.\nThe C919 made its first flight in 2017 after years of delays and has undergone numerous test flights since.\nState-backed China Eastern Airlines ordered five of the jets in March 2021. It took delivery of the first in December and has said it expects to receive the remainder this year.\nIn total, COMAC had won 1,035 orders from 32 customers as at 2022-end. A company official has since told media the figure exceeds 1,200.\nThe planemaker expects annual production to reach 150 C919 jets within five years, domestic media reported in January.\nThough assembled in China, the C919 relies heavily on Western components, including engines and avionics, from firms including General Electric Co, Safran SA and Honeywell International Inc.", "url": "https://www.straitstimes.com/asia/china-s-first-homegrown-passenger-jet-the-c919-takes-off-on-its-first-commercial-flight"}