{"authors": ["Debarshi Dasgupta"], "date_download": "2024-10-12 13:51:35", "date_modify": "2024-10-12 13:51:35", "date_publish": "2024-08-10 18:10:00", "description": "They will have to appoint a grievance redressal officer and even join a self-regulatory organisation. Read more at straitstimes.com.", "filename": "asia_south-asia_india-s-proposed-law-to-regulate-news-influencers-sparks-fears-of-curbs-on-free-speech_1728741095.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/10/FILES-HONGKONG-CHINA-US-POLITICS-INTERNET-YOUTUBE-201035.jpg?VersionId=1VNJMeCGsOFACMEjsAHOEZENiZ9Jm8bg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_india-s-proposed-law-to-regulate-news-influencers-sparks-fears-of-curbs-on-free-speech_1728741095.html", "title": "India’s proposed law to regulate news influencers sparks fears of curbs on free speech", "title_page": "India’s proposed law to regulate news influencers sparks fears of curbs on free speech | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI – India’s new draft Bill to regulate broadcasting services has proposed sweeping regulations on independent news creators on social media platforms such as YouTube and Instagram, significantly expanding the government’s powers to regulate digital media content.\nThis has triggered concerns among many that media freedom and free speech online in the world’s largest democracy could be further impeded by the proposed legislation.\nMany Indian reporters in recent years have found professional refuge on social media after leaving their jobs in media houses that have come under greater control of a few corporate owners with close links to the government.\nIt is a switch that has enabled them to pose critical questions to the government – raising issues they could not in their earlier roles amid shrinking media freedom in the country. Several have even amassed millions of followers disenchanted with the largely uncritical coverage of the government by India’s largely private television stations.\nThe draft Broadcasting Services (Regulation) Bill, 2024, which covers over-the-top broadcasting among other service providers, has especially raised concerns because of its ambiguous definition of “digital news broadcaster” (DNB) and the “regulatory burden” imposed on them.\nThe draft Bill deems a DNB as any person who produces content or writes about current affairs or any other news online, including social media portals, as part of a “systematic business, professional or commercial activity”.\nThis wide definition could, for instance, potentially even include a fitness influencer who discusses government health and nutrition policies.\nDNBs will have to “intimate” their existence to the government within a month from the notification of the Act, appoint an internal grievance redressal officer to address complaints and even join a self-regulatory organisation set up in accordance with government rules.\nBreaches can result in warnings and fines ranging from 20,000 rupees (S$315) to as high as 25 million rupees.\nThis attempt to establish greater government control on online content comes at a time when many young Indians today turn to social media for news instead of newspapers or television. Around half of the Indian respondents of a 2024 study by the Reuters Institute and University of Oxford use YouTube (54 per cent) and WhatsApp (48 per cent) for news each week.\n“It gives me the sense that this is a government that’s very aware of the power of influencers and social media at this point in opinions and building opinion of the general public, and it wants to be able to have a handle on that power,” said Ms Faye D’Souza, a former news anchor with Mirror Now, a TV news channel owned by The Times Group, an Indian media conglomerate.\nAfter quitting in 2019, the journalist moved online, and has grown her Instagram following from around just 35,000 followers then to more than 1.8 million now.\nThe original draft of the Bill released in November has been replaced by the current version, which covers DNBs and other significant changes.\nIt has been shrouded in secrecy, with only some unidentified stakeholders given a copy of the new draft a few weeks ago, each of which carries a unique digital watermark to identify leaks.\nThe public discussion on the Bill has taken place based on media reports and an “open access copy” of the Bill that someone reportedly chose to, in the public interest, type out in its entirety.\nThe revised draft’s timing and closed-door consultations, which follow the recently concluded general election, have fuelled speculation that it may be a government attempt to curtail critical voices online.\nThe ruling Bharatiya Janata Party’s (BJP) lacklustre re-election in June was attributed to voters’ anger on issues such as unemployment and price rise – problems that many independent voices had raised on their online channels.\nAn anonymous senior government official, quoted in an Aug 7 report in The Indian Express, said a key reason for the revised Bill was the role independent content creators played in the run-up to the general election.\n“There were a number of instances where creators made videos on current affairs which made some sensational claims about the government and its senior leaders in the run-up to the election,” the official said. “That’s when it was decided that there has to be an accountability measure for these creators as well, to create a level playing field between mainstream press and independent creators.”\nThe opposition Congress party called the proposed Bill a “threat” to freedom of speech and independent media.\nDigipub News India Foundation – whose 100-plus members include major digital news publishers as well as several journalists – has not been able to have a conversation with the Ministry of Information and Broadcasting on the Bill, despite several attempts, its general secretary Ritu Kapur said on Aug 8.\nMr Sanket Upadhyay, co-founder of online journalism portal The Red Mike, said the proposed legislation risks placing an increased “burden of compliance” on small digital organisations or individuals, who are already covered by existing legislation such as the country’s official criminal code.\nThe conditions proposed in the draft, he told The Straits Times, could subject them to strict government control, allowing a bureaucrat to “sit over your future”.\n“Big media organisations with their money and muscle can depute lawyers or have an entire wing dedicated to dealing with the government but for small YouTubers, they will have a huge problem,” added Mr Upadhyay, who quit NDTV in 2023 to start The Red Mike along with two of his former colleagues. It now has around 640,000 subscribers on YouTube.\n“For a small set-up like mine, I frankly don’t know what I’ll do... Many may feel the need to just shut shop and not pursue their work online.”\nPress freedom in India has taken a beating under the BJP and the earlier Congress governments, with several journalists arrested, and media houses raided.", "url": "https://www.straitstimes.com/asia/south-asia/india-s-proposed-law-to-regulate-news-influencers-sparks-fears-of-curbs-on-free-speech"}