{"authors": [], "date_download": "2024-10-12 14:02:50", "date_modify": "2024-10-12 14:02:50", "date_publish": "2023-03-26 11:20:56", "description": "What is of particular concern with Russia is its posture on so-called tactical, or nonstrategic, nuclear weapons. Read more at straitstimes.com.", "filename": "asia_why-russia-s-nuclear-threats-are-difficult-to-dismiss_1728741770.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/26/FILES-RUSSIA-POLITICS-DEFENCE-SARMAT-094946_2.jpg?VersionId=KtVPCIAoR10hE7hdvdp5pE5JJvg8WIlq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_why-russia-s-nuclear-threats-are-difficult-to-dismiss_1728741770.html", "title": "Why Russia’s nuclear threats are difficult to dismiss", "title_page": "Why Russia’s nuclear threats are difficult to dismiss | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW – The use of nuclear arms had been considered practically unthinkable for the 77 years since the United States proved their destructive power. But a distinctive feature of Russian military policy is an express willingness to introduce nuclear weapons into an otherwise conventional war.\nThat helps explain why Russian President Vladimir Putin’s sabre-rattling about his nuclear arsenal since launching war on Ukraine in February 2022 has been so worrisome. What is of particular concern with Russia is its posture on so-called tactical, or non-strategic, nuclear weapons.\n1. What has Russia done to raise concern?\nIn a speech laying out Russia’s reasons for invading Ukraine, Mr Putin warned that any nation that interfered would suffer “consequences that you have never experienced in your history”.\nThat was widely seen as threatening a nuclear strike.\nOn Sept 21, in the wake of a Ukrainian counter-offensive helped by US intelligence and weapons donated by the West, Mr Putin portrayed the war as a fight to the death with the US and its allies and vowed to “use all the means at our disposal to protect Russia and our people. This is not a bluff”.\nRhetoric aside, Russia regularly holds drills to test its strategic weapon delivery systems, including practice launches of intercontinental ballistic missiles (ICBMs) and shorter-range cruise missiles; one was held just days before the invasion. Military experts have considered how Russia might use a tactical weapon in a conventional conflict, like the one in Ukraine.\n2. What is a tactical nuclear weapon?\n“Tactical” is an inexact term for a nuclear weapon that could be used within a theatre of war. Generally speaking, that means it has a less powerful warhead (the explosive head of a missile, rocket or torpedo) and is delivered at a shorter range – by mines, artillery, cruise missiles or bombs dropped by aircraft – than the “strategic” nuclear weapons the US and Russia could launch at each other’s homeland using ICBMs.\nArms control accords between the US and the Soviet Union (and, later, between the US and Russia) starting in the 1970s generally focused on reducing the number of strategic nuclear weapons, not tactical ones.\n3. How powerful can a tactical nuclear weapon be?\nWhere today’s most powerful strategic warheads are measured in the many hundreds of kilotonnes, tactical nuclear weapons can have explosive yields of less than 1 kilotonne; many are in the tens of kilotonnes.\nFor some perspective, the atomic bombs dropped by the US on the Japanese cities of Hiroshima and Nagasaki in 1945 had explosive yields of about 15 kilotonnes and 20 kilotonnes, respectively.\n4. How does a nuclear strike fit into Russia’s military doctrine?\nSince 2000, Russia’s publicly shared military doctrine has allowed for nuclear weapons use “in response to large-scale aggression utilising conventional weapons in situations critical to the national security of the Russian Federation”.\nThe Russian strategy known as “escalate to de-escalate” contemplates using a tactical nuclear weapon on the battlefield to change the course of a conventional conflict that Russian forces are at risk of losing.\nGeneral John Hyten, who served as the top US nuclear weapons military official, says a more accurate translation of the Russian strategy is “escalate to win”. Russian diplomats, in a bid to dial back fears about what might happen in Ukraine, have said nuclear weapons would be used against conventional forces only if Russia’s “very existence” were “in jeopardy”.\n5. What is in Russia’s arsenal?\nThe US Department of Defence reported in 2018 that Russia had “significant advantages” over the US and its allies in tactical nuclear forces and was improving delivery capabilities. Researchers at the Federation of American Scientists estimated that entering 2022, Russia had 4,477 nuclear warheads, of which 1,525 – roughly one-third – could be considered tactical.\n6. What would a tactical nuclear strike look like?\nDr Nina Tannenwald, author of The Nuclear Taboo: The United States And The Non-Use Of Nuclear Weapons Since 1945, paints a scenario of even a small nuclear weapon, one with an explosive yield of 0.3 kilotonne, producing “damage far beyond that of a conventional explosive”.\nIt could, she wrote in Scientific American in March, “cause all the horrors of Hiroshima, albeit on a smaller scale”. But it is possible that if detonated at the right altitude, a small-yield warhead might wipe out opposing forces beneath without leaving behind long-term radiation damage that leaves the battlefield off-limits to all.\n7. How would the world respond?\nBecause Ukraine is not a member of the North Atlantic Treaty Organisation – Mr Putin has demanded that it never be allowed to join – the US and its allies are not obliged to come to its defence. But the West would be under great pressure to respond to a nuclear attack, perhaps even with a tactical weapon of its own. From there, it would be anyone’s guess.\n“I don’t think there’s any such thing as the ability to easily use tactical nuclear weapons and not end up with Armageddon,” US President Joe Biden warned.\nThe US is thought to have about 150 B-61 nuclear gravity bombs – ones dropped from aircraft, with variable yields that can be as low as 0.3 kilotonne – stationed in five Nato countries: Belgium, Germany, the Netherlands, Italy and Turkey. Two other Nato members, Britain and France, are known to have nuclear weapons of their own.\nAnd Poland recently expressed interest in “sharing” US nuclear weapons, which could mean anything from offering escort or reconnaissance jets for a nuclear mission to actually hosting the weapons. BLOOMBERG", "url": "https://www.straitstimes.com/asia/why-russia-s-nuclear-threats-are-difficult-to-dismiss"}