{"authors": [], "date_download": "2024-10-12 13:54:51", "date_modify": "2024-10-12 13:54:51", "date_publish": "2024-07-04 14:01:00", "description": "Pet weddings are on the rise where government policies have had little success in encouraging more humans to wed. Read more at straitstimes.com.", "filename": "asia_east-asia_puppy-love-canine-weddings-on-the-rise-in-fast-ageing-china_1728741291.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/04/2024-07-04T050024Z100059996RC26L8A9RM1PRTRMADP3CHINA-DOGS-WEDDING.JPG?VersionId=HkEI7pGN6mYHpHCsZIGxmuHi41UdswPN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_puppy-love-canine-weddings-on-the-rise-in-fast-ageing-china_1728741291.html", "title": "Puppy love: Canine weddings on the rise in fast-ageing China", "title_page": "Puppy love: Canine weddings on the rise in fast-ageing China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – It was a dream wedding, complete with picturesque outdoor setting, white lace gown and a delectable cake. The perfect day for golden retrievers – Bree and Bond – to tie the knot in front of their closest human and canine friends.\nPet weddings are on the rise in China, where government policies have had little success in encouraging more humans to wed in this fast-ageing society where the population is declining and marriage and birth rates remain low.\nThe popularity of pets and an increasing willingness to splurge on them are driving the trend. Spending on furry companions in 2023 rose 3.2 per cent to 279.3 billion yuan (S$52 billion) from a year earlier, industry figures show.\n“People have weddings. Why can’t dogs have weddings?“ Bree’s owner, Mr Rye Ling, said after escorting his female pet down the aisle, where she exchanged vows promising to always share treats and play with her husband, Bond.\nAs of 2023, there were more than 116 million cats and dogs in urban China, according to figures by research firm Acuity Knowledge Partners. If distributed evenly across China’s urban population, roughly one in eight Chinese people own a cat or a dog, with a majority of owners under 40, according to the research firm.\nMr Ling and his girlfriend, Ms Gigi Chen, who said they are in no rush to get married themselves, meticulously planned the canine ceremony for months, arranging professional photographers, designing wedding booklets and ordering a custom-made, 800-yuan cake complete with toppers that resemble Bree and Bond.\nMs Yang Tao, whose Shanghai-based pet bakery prepared the cake, said she was initially surprised that customers wanted wedding cakes for their dogs.\n“I think there will be more and more dog weddings,” Ms Yang said, adding that she has already catered several similar ceremonies since her bakery was launched in 2022.\n“We have already received an order for a few months from now… and that’s for a dog wedding.”\nMr Ling said he hoped the ceremony would give Bree and Bond a “sense of ritual”. He also hopes to welcome puppies soon. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/puppy-love-canine-weddings-on-the-rise-in-fast-ageing-china"}