{"authors": [], "date_download": "2024-10-12 13:37:35", "date_modify": "2024-10-12 13:37:35", "date_publish": "2024-09-11 23:18:06", "description": "The Chinese foreign ministry said it reiterated its demand for the immediate withdrawal of a Philippine vessel. Read more at straitstimes.com.", "filename": "asia_seasia_philippines-says-had-frank-candid-talks-with-china-on-south-china-sea1_1728740255.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/LYNXMPEK8A0NR-1.jpg?VersionId=eoySJEzKcSYxc8QDu.JE.ub1G8Zo7DsZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_seasia_philippines-says-had-frank-candid-talks-with-china-on-south-china-sea1_1728740255.html", "title": "Philippines stands firm on Sabina Shoal but looks to ease tension with China", "title_page": "Philippines stands firm on Sabina Shoal but looks to ease tension with China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA - The Philippines will stick to its position on Sabina Shoal, it said on Sept 12, even while exploring ways to ease tension in the area during “frank and candid” talks with China on managing disputes in the key waterway of the South China Sea.\nThe South-east Asian nation’s sustained presence at the feature, aiming to monitor what it suspects to be China’s small-scale reclamation activities, has angered Beijing, turning the shoal into their latest flashpoint in the contested waters.\nDuring a Sept 11 meeting of officials in Beijing, China vowed to “firmly uphold its sovereignty” and reiterated a demand for the immediate withdrawal of a Philippine Coast Guard ship anchored at the shoal since April.\n“I reaffirmed the Philippines’ consistent position and explored ways to lower the tension,” Philippine Foreign Affairs Undersecretary Theresa Lazaro said on X, posting a picture of her handshake with Chinese Vice-Foreign Minister Chen Xiaodong.\n“We agreed to continue discussions on areas of cooperation, especially on hotline mechanism, coast guard cooperation, and marine scientific and technological cooperation.”\nThe two had a frank and candid exchange of views, the Philippine foreign ministry said in its statement.\nThe Sabina Shoal, which China refers to as Xianbin Reef, and Manila as Escoda Shoal, lies 150km west of the Philippine province of Palawan, well within its exclusive economic zone (EEZ).\nThe two nations have traded accusations of intentional ramming of each others’ vessels in a series of clashes in August, just after reaching a pact on resupply missions to a beached Filipino naval ship in the Second Thomas Shoal.\nChina claims sovereignty over most of the China Sea, overlapping into maritime zones of Brunei, Indonesia, Malaysia, the Philippines and Vietnam.\nIn 2016, the Hague arbitration tribunal voided China’s expansive and historical claims, a decision Beijing rejects.\nThe Philippine navy has said it recently monitored 207 Chinese vessels, including “maritime militia boats” within the country’s EEZ, with dozens observed near Sabina Shoal. REUTERS", "url": "https://www.straitstimes.com/asia/seasia/philippines-says-had-frank-candid-talks-with-china-on-south-china-sea1"}