{"authors": [], "date_download": "2024-10-12 13:39:25", "date_modify": "2024-10-12 13:39:25", "date_publish": "2023-10-07 16:14:00", "description": "The death toll may rise following reports of landslides and collapsed buildings, officials warn. Read more at straitstimes.com.", "filename": "asia_south-asia_magnitude-62-earthquake-jolts-large-city-in-western-afghanistan-epicentre-near-city-of-herat_1728740365.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/07/AFGHANISTAN-EARTHQUAKE-085328.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_magnitude-62-earthquake-jolts-large-city-in-western-afghanistan-epicentre-near-city-of-herat_1728740365.html", "title": "At least 14 killed, dozens injured as 6.3-magnitude quake rocks western Afghanistan", "title_page": "At least 14 killed, dozens injured as 6.3-magnitude quake rocks western Afghanistan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KABUL – A 6.3-magnitude earthquake hit western Afghanistan on Saturday morning, killing at least 14 people, with predictions the toll could rise following reports of landslides and victims trapped under collapsed buildings.\nThe United States Geological Survey (USGS) said the epicentre was 40km north-west of the city of Herat, and was followed by seven aftershocks with magnitudes of between 4.6 and 6.3.\nCrowds of residents fled buildings in the city at around 11am, as the quakes began, lasting for over an hour.\n“We were in our offices... Suddenly, the building started shaking, and wall plasters started to fall down, and the walls got cracks. Some walls and parts of the building collapsed,” 45-year-old Bashir Ahmad told AFP.\n“I am not able to contact my family. Network connections are disconnected. I am too worried and scared. It was horrifying,” he said.\nCrowds of women and children stood out in the wide streets of Herat, away from tall buildings, in the moments after the first quake and aftershocks which continued for roughly one hour.\nPublic health director of Herat province Mohammad Taleb Shahid told AFP 14 people were killed and 78 injured, but said he feared the tally would rise.\n“These are the numbers that have been brought to the central hospital so far, but this is not the final figure,” he said. “We have information that people are buried under rubble.”\nHundreds of fatalities were possible, according to a USGS preliminary report.\n“Significant casualties are likely and the disaster is potentially widespread. Past events with this alert level have required a regional or national level response,” it said.\nUSGS earlier reported the first quake’s magnitude as 6.2. It had a shallow depth of just 14km, it said.\nHerat – 120km east of the border with Iran – is considered the cultural capital of Afghanistan.\nIt is the capital of Herat province, which is home to an estimated population of 1.9 million, according to 2019 World Bank data.\nIn June 2022, more than 1,000 people were killed and tens of thousands made homeless after a 5.9-magnitude quake – the deadliest in Afghanistan in nearly a quarter of a century – struck the impoverished province of Paktika.\nIn March 2023, 13 people were killed in Afghanistan and Pakistan by a 6.5-magnitude quake, which hit near Jurm in north-eastern Afghanistan.\nAfghanistan is frequently hit by earthquakes, especially in the Hindu Kush mountain range, which lies near the junction of the Eurasian and Indian tectonic plates.\nAfghanistan is already in the grip of a grinding humanitarian crisis, with the widespread withdrawal of foreign aid since the Taliban returned to power in 2021. AFP", "url": "https://www.straitstimes.com/asia/south-asia/magnitude-62-earthquake-jolts-large-city-in-western-afghanistan-epicentre-near-city-of-herat"}