{"authors": ["Nadirah H. Rodzi"], "date_download": "2024-10-12 14:05:21", "date_modify": "2024-10-12 14:05:21", "date_publish": "2023-02-20 16:29:37", "description": "Najib is seeking a review of the Federal Court’s decision that affirmed his conviction and 12-year jail sentence for misappropriating nearly $12.9m. Read more at straitstimes.com.", "filename": "asia_se-asia_court-s-decision-to-force-najib-s-then-lawyer-to-stay-on-a-fundamental-error-says-his-defence-counsel_1728741921.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/20/svhisyam200223_1.jpg?VersionId=1Q6m26evp9L7NnjmLT5qUz79CJ._dbw2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_court-s-decision-to-force-najib-s-then-lawyer-to-stay-on-a-fundamental-error-says-his-defence-counsel_1728741921.html", "title": "Court’s decision to force Najib’s then lawyer to stay on a ‘fundamental’ error, says defence counsel", "title_page": "Court’s decision to force Najib’s then lawyer to stay on a ‘fundamental’ error, says defence counsel | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PUTRAJAYA – Forcing former premier Najib Razak’s lawyer to stay on despite his request to be discharged was a “fundamental” error by Malaysia’s apex court which amounts to the Umno politician not being given a fair trial, his current defence counsel told the Federal Court on Monday.\nLead defence counsel Muhammad Shafee Abdullah said Datuk Hisyam Teh Poh Teik, who was Najib’s lawyer at the final appeal in the SRC International case, was “compelled to remain in court” despite his attempt to discharge himself due to time constraints.\n“(This is) enforced obligation, which was not meant to happen,” Mr Shafee said, when making his submissions in Najib’s review application in the SRC International case.\nNajib is seeking a review of the Federal Court’s decision that affirmed his conviction and 12-year sentence over the misappropriation of RM42 million (S$12.9 million) from SRC International, a former 1MDB subsidiary, claiming that he was not given a fair hearing.\nIn August 2022, Mr Hisyam asked for a postponement of three to four months, as he had taken over the case only several weeks earlier.\nThe request was dismissed by a five-judge panel, which was led by Chief Justice Maimun Tuan Mat.\nMr Hisyam then refused to make any submission on Najib’s behalf. The Federal Court subsequently upheld the conviction and sentence on Aug 23, 2022.\nMr Shafee said: “The counsel (Mr Hisyam) said it’s not the fault of his client (Najib) but it is his fault because he had misjudged the timing (between taking over the matter and the hearing dates). So why punish my client?”\nHe said the apex court should have allowed Mr Hisyam to discharge himself, but instead, it forced the lawyer to remain on record as the lead counsel.\n“This goes against every rubric of law and jurisdiction of the court,” Mr Shafee said.\nMr Hisyam was still present during the final appeal proceedings. But this, Mr Shafee said, “was decorative at best” and “not sanctioned by law”.\n“And that is reviewable because that goes against the very root of fair trial, ” he said.\nNajib is also seeking a review of the court’s decision to dismiss his attempt to postpone his appeal hearing, as well as its decision not to recuse Tun Tengku Maimun from the Federal Court appeal due to Facebook posts made by her husband in May 2018.\nThe latter had allegedly demonstrated negative views of Najib’s leadership and had concluded that he had siphoned funds from 1MDB into his personal bank account.", "url": "https://www.straitstimes.com/asia/se-asia/court-s-decision-to-force-najib-s-then-lawyer-to-stay-on-a-fundamental-error-says-his-defence-counsel"}