{"authors": [], "date_download": "2024-10-12 13:37:47", "date_modify": "2024-10-12 13:37:47", "date_publish": "2024-09-11 12:39:00", "description": "An exhibition chronicles the stories of 24 Chinese officers who were with Allied forces in Normandy. Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-diary-shows-china-s-little-known-naval-role-in-d-day_1728740267.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/HONGKONG-CHINA-HISTORY-MILITARY-D-DAY-022623.jpg?VersionId=.izpoIJYcM2VJAQrxVboKAiSdPDj8Mpm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-diary-shows-china-s-little-known-naval-role-in-d-day_1728740267.html", "title": "Hong Kong diary shows China’s little-known naval role in D-Day", "title_page": "Hong Kong diary shows China’s little-known naval role in D-Day | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – The night before June 6, 1944, fleets of warships moved in darkness towards the beaches of Normandy, France, for a massive strike, with Chinese naval officer Lam Ping-yu on one of the vessels.\nThe ships were as “numerous as ants, scattered and wriggling all across the sea”, Mr Lam wrote in his diary. “Around 5am: HMS Warspite was the first to open fire.”\nMr Lam’s 80-page journal is the centrepiece of a Hong Kong exhibition launching in September, which for the first time chronicles the stories of 24 Chinese officers who helped Allied forces in their landmark D-Day operation.\nHistorians, documentaries and pop culture have often focused on the British involvement in the largest amphibious military operation, which led to the end of Nazi occupation of Western Europe in World War II.\nHowever, little is known about the Chinese naval officers sent to Europe for training.\nMr Lam, then 33, was serving on the British warship HMS Ramillies that, according to his diary, opened fire about an hour after HMS Warspite.\n“Throughout the day, Ramillies fired over 200 15-inch rounds, but the (Nazi) fort’s cover and positioning kept it from annihilation,” he wrote.\nDigital copies of Mr Lam’s previously unseen diary will be displayed at the Fringe Club and the Chinese University of Hong Kong in September.\n“We believe this historical episode belongs to everyone in both the East and the West,” Mr John Mok, 32, a public policy advocate and one of the organisers of the exhibition, told Agence France-Presse.\n“Sometimes we would ponder whether it was the Chinese who helped liberate the West, or the West helped train the Chinese navy? It was actually, ‘You are among us, and we are among you’,” he said.\n“I believe such inherent friendship is very precious these days as it’s beyond politics – the human solidarity in times of war.”\n‘First-person record’\nThe Chinese government selected 100 officers between 1943 and 1944 to receive training in the United States and Britain to rebuild China’s naval force after it was destroyed by Japan, one of the Axis powers aligned with Nazi Germany.\nThe first batch of 24 officers sent to Britain included Mr Lam and his comrade Huang Tingxin, whose son, Professor Huang Shansong, will attend the Hong Kong exhibition.\n“The strategic consideration at that time was to connect China’s fight with the world’s anti-fascist war... so that with the support from the US and Britain, China could better defend Japan’s invasion,” said Prof Huang, who teaches Chinese history at a university in Hangzhou.\nProf Huang published a book of his father’s oral history in 2013 but said he found Mr Lam’s diary more valuable for its accuracy, compared with his father’s decades-old memories.\n“Lam’s diary is by far the only first-person, on-the-spot record about the 24 men’s internship in Britain that is known to us today,” he said.\nHe has loaned his father’s Legion d’Honneur – awarded in 2006 for the elder Mr Huang’s contribution to France’s liberation – for the exhibition.\n“He always told me wars, in particular modern wars, were shockingly destructive,” Prof Huang said.\n“The importance of peace cannot be emphasised more.”\n‘A wider audience’\nMr Lam’s diary almost ended up in landfills.\nAfter the war, the naval commander lived in Hong Kong until the late 1960s and left the bulk of his personal items – including the diary – in his brother’s apartment.\nRescued by a photographer and an amateur historian before the building was demolished, the diary caught the interest of Mr Angus Hui, a former journalist who obtained a photocopy for his postgraduate study in Chinese naval history.\nMr Hui met Mr Mok in 2023, who suggested that the stories “deserve a wider audience”.\nDuring research trips to China, Taiwan, Singapore and Europe, where the veterans settled after the war, they found that Hong Kong was the most suitable place for the exhibition.\nMr Hui said he hopes that the exhibition can address Hong Kong’s place in today’s world.\nThe former British colony – once branded “Asia’s World City” – has fallen out of favour in recent years with Western governments, which have condemned Hong Kong over a rights crackdown following democracy protests in 2019.\nBut Mr Lam’s decision to come to Hong Kong “reflected the uniqueness of this place”, Mr Hui said.\n“People may say Hong Kong is no longer relevant... But from history and from our own experience, we find Hong Kong still relevant.” AFP", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-diary-shows-china-s-little-known-naval-role-in-d-day"}