{"authors": ["Walter Sim"], "date_download": "2024-10-12 13:51:05", "date_modify": "2024-10-12 13:51:05", "date_publish": "2024-01-13 14:30:08", "description": "Better road access to Nanao meant relief supplies could be more easily delivered to the area. Read more at straitstimes.com.", "filename": "asia_east-asia_movie-screenings-and-showers-bring-cheer-as-quake-rebuilding-process-gains-pace-in-nanao_1728741065.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/13/E29C9320IMG5562.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_movie-screenings-and-showers-bring-cheer-as-quake-rebuilding-process-gains-pace-in-nanao_1728741065.html", "title": "Japan quake aftermath: Movie screenings, showers bring cheer as rebuilding process gains pace in Nanao", "title_page": "Japan quake aftermath: Movie screenings, showers bring cheer as rebuilding process gains pace in Nanao | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NANAO, Ishikawa – Meeting for the first time a week after a deadly New Year’s Day earthquake upended their lives, two friends were all smiles as they held each other in a tight embrace.\nMrs Miyuki Kaji, 43, and Mrs Emi Hirose, 48, are mothers and eatery owners in the same community in Nanao city, where spirits are generally high as the cleanup and rebuilding effort gains pace after the magnitude-7.6 tremor.\nThe atmosphere is starkly different from the hardest-hit cities nearer the quake epicentre, such as Wajima and Suzu, as better road access to Nanao meant relief supplies could be more easily delivered. The government belatedly increased the military personnel involved in the quake effort to 6,300 soldiers from 1,000 on Jan 1, and air and sea transport options have begun that were earlier thought too difficult.\nDuring a visit by The Straits Times on Jan 8, convenience stores had already reopened for business. Local community leader Shinichi Iida said he believes Nanao will be out of the woods by the middle of February at the latest.\n“Because the roads are in terrible condition, aid that cannot reach the districts nearer the epicentre ended up being diverted here. We now have considerable supplies for survival,” he said.\nAs at Jan 13, a total of 220 people had died, including from quake-related causes, across Ishikawa prefecture. At least 1,014 were injured while 26 were missing.\nIn Nanao, five people died and three were injured. Two whale sharks at the local Notojima Aquarium also died after the quake knocked out the tank filtration system. More than 5,000 buildings sustained damage, with at least 225 having completely collapsed.\nAlthough the city continues to suffer a lack of water supply, electricity has been partially restored. Inspectors have begun risk assessments of standing buildings, pasting on entrances pink slips (unsafe), yellow slips (limited entry) or green slips (safe).\nThe quake was the worst that resident Takeo Kokubun, 76, had ever experienced, he said, gazing wistfully at the extent of damage to his neighbourhood.\nMr Kokubun, who lives alone, allowed ST into his home, which bore a yellow slip. Pointing to broken windows and toppled furniture, he wondered if the cleanup effort might be too exhausting for him, and if it might be better to move into temporary housing instead.\nHe now spends his nights at the local cultural exchange centre that serves as one of 28 evacuation shelters in Nanao, he said, as he offered this reporter a mandarin orange.\nThe 18th-generation chief priest of the Saibutsuzan Jofukuji Temple is looking ahead to rebuilding.\nThe main hall enshrining the Buddha statue was unscathed. But the structure with the temple bell, sounded just 16 hours before the quake to ring in the new year, collapsed, as did a stone pillar at the entrance that bore the name of the temple.\n“I’m full of anxiety, but I think all we can do now is to eat together as a community and build up our strength,” said Mr Kiyoshi Hatakeyama, 49. The temple is helping out in the relief effort by running a curry and soup kitchen, and has donated bottled water.\nAnother shelter, the Yadago District Community Centre, has tried to give cheer to its 262 evacuees – down from 700 after the quake – by hosting film screenings of Frozen and Star Wars, complete with popcorn.\nIt has brought in dentists and doctors for check-ups, while donated portable showers have been installed for evacuees and other residents to use.\nEleven Myanmar nationals who work at a local food factory were at the community centre for a shower. Among them, Ms Yamin Thu, 27, told ST that while they were at a loss after the quake, they were grateful for Japanese neighbours who advised them on what to do. Their dormitory was damaged, and they were putting up at a nearby evacuation centre.\nAt the community centre, Mrs Kaji and Mrs Hirose brandished their phones to show each other – and ST – the extent of damage wrought on their homes and shops, which remain structurally sound.\nBut the Kaji family is putting up at the shelter because the children, aged 16, 13, 10 and seven, are “terrified to return home due to the frequent aftershocks”, Mrs Kaji said. The Hiroses are staying at home, their three children left in the care of relatives in Tokyo.\nThey are eager to resume business as soon as water supply is restored, noting that it was also essential that the local economy be rebuilt.\nMrs Hirose, who runs the kushikatsu (deep-fried skewers) izakaya Nada, said: “I feel like we can do something to keep ourselves busy while we’re still active and moving, and my mind cannot stop thinking of ideas for what’s next.”\nMrs Kaji, who owns bento shop Kokone, agreed: “Even if we don’t have a kitchen, we can set up a food truck outside our store.\n“I cannot wait to see the faces of my regular customers again.”", "url": "https://www.straitstimes.com/asia/east-asia/movie-screenings-and-showers-bring-cheer-as-quake-rebuilding-process-gains-pace-in-nanao"}