{"authors": [], "date_download": "2024-10-12 13:43:21", "date_modify": "2024-10-12 13:43:21", "date_publish": "2024-09-03 11:05:00", "description": "Eight of Cathay’s nine scheduled Hong Kong-Singapore services on Sept 3 were scrapped. Read more at straitstimes.com.", "filename": "asia_east-asia_cathay-scraps-hong-kong-singapore-flights-amid-airbus-a350-inspections_1728740601.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/FILES-HONGKONG-CHINA-CATHAY-EARNINGS-050041.jpg?VersionId=owBYv7XHFC85R_HYb7r71.dg5738RoEM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_cathay-scraps-hong-kong-singapore-flights-amid-airbus-a350-inspections_1728740601.html", "title": "Cathay scraps Hong Kong-Singapore flights amid Airbus A350 inspections", "title_page": "Cathay scraps Hong Kong-Singapore flights amid Airbus A350 inspections | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Cathay Pacific Airways cancelled almost all its scheduled flights from Hong Kong to Singapore on Sept 3, as well as a raft of other services across Asia, after discovering a faulty engine component on some of its Airbus SE A350s.\nEight of Cathay’s nine scheduled Hong Kong-Singapore services on Sept 3 were scrapped, according to the airline’s website. The only flight still due to depart as at the mid-morning of Sept 3 was an afternoon connection on a Boeing 777.\nMeanwhile, nearly half of Cathay’s services on Sept 3 from Hong Kong to Bangkok and those to Tokyo’s Narita airport have also been axed. Of those still running, none are on an A350 aircraft. Cathay has said some 48 individual flights, including return legs, have been cancelled.\nThe Hong Kong-based airline, among the world’s biggest operators of the long-haul A350, identified the component failure on a plane that was forced to return from a flight originally headed to Zurich on Sept 2. A subsequent check of the fleet revealed several of the same engine parts needed replacing.\nThe Hong Kong-Singapore service is a flagship leg for Cathay, and a key route for regional connectivity, plied daily by hundreds of business people and other travellers. The airline did not specify the fault it had found.\nThe engine is made by Rolls-Royce Holdings, whose shares plunged as much as 8.2 per cent on Sept 2.\nCathay Pacific shares in Hong Kong were down 0.4 per cent. BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/cathay-scraps-hong-kong-singapore-flights-amid-airbus-a350-inspections"}