{"authors": [], "date_download": "2024-10-12 14:02:21", "date_modify": "2024-10-12 14:02:21", "date_publish": "2023-05-20 16:03:00", "description": "The Hiroshima summit comes as G-7 members are faced with challenges posed by Russia’s invasion of Ukraine and tensions with China. Read more at straitstimes.com.", "filename": "asia_east-asia_ukraine-president-zelensky-arrives-in-japans-hiroshima-for-talks-with-friends_1728741741.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/20/JAPAN-G7-SUMMIT-070024_2.jpg?VersionId=7ns18S0ZT.7jQLXetA3.MY32d5pYlsd8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_ukraine-president-zelensky-arrives-in-japans-hiroshima-for-talks-with-friends_1728741741.html", "title": "Ukraine’s President Zelensky joins G-7 in Japan as democracies take aim at Russia and China", "title_page": "Ukraine’s President Zelensky joins G-7 in Japan as democracies take aim at Russia and China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HIROSHIMA – Ukraine’s President Volodymyr Zelensky arrived in Japan on Saturday to attend the Group of Seven (G-7) summit, giving him a rare chance to both drum up support from the world’s rich democracies and sound out “Global South” leaders with long ties to Russia.\nMr Zelensky’s presence at the G-7 summit, in a city that was the first to suffer a nuclear attack, cast into sharp relief Western governments’ concerns over the nuclear threat posed by Moscow.\nG-7 members – the United States, Japan, Germany, France, Britain, Italy and Canada – are grappling with the immense challenges posed by Russia’s invasion of Ukraine and tensions with China, notably over Taiwan and economic security.\nWorried by the outsized role China now plays in supply chains in everything from semiconductors to critical minerals, the G-7 issued a communique that set out a common strategy towards future dealings with the world’s second-largest economy.\n“We are not decoupling or turning inwards. At the same time, we recognise that economic resilience requires derisking and diversifying,” the communique said.\n“A growing China that plays by international rules would be of global interest.”\nIn a separate statement on economic security, G-7 members warned that countries attempting to use trade as a weapon would face “consequences”, sending a strong signal to Beijing over practices Washington has long said amount to economic bullying.\nThe communique was issued shortly after the French government aircraft that brought Mr Zelensky to Hiroshima touched down.\nFootage from Japanese broadcasters showed the Ukrainian president, wearing his customary olive green fatigues, stepping down to the tarmac moving quickly to a waiting car.\nMoments later he tweeted: “Japan. G-7. Important meetings with partners and friends of Ukraine.”\nFrench and European officials said it was crucial that Mr Zelensky came in person first to the Arab League, which he addressed on Friday, and now to the G-7, where members of the Global South are attending, in order to outline Ukraine’s view as the victim of an attack by Russia and how he saw a peace settlement in the future.\n“We have to use all the means to bind non-aligned states to the cause of the defence of the sovereignty and territorial integrity of Ukraine,” a French presidential official told reporters.\nMr Zelensky will hold bilateral meetings with G-7 leaders, but significantly also the leaders of India and Brazil, two countries that have not distanced themselves from Moscow.\nBoth Brazil and India are members of the Bric grouping that also includes Russia and China. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/ukraine-president-zelensky-arrives-in-japans-hiroshima-for-talks-with-friends"}