{"authors": ["Tan Dawn Wei", "Elizabeth Law"], "date_download": "2024-10-12 13:48:22", "date_modify": "2024-10-12 13:48:22", "date_publish": "2023-06-19 09:57:23", "description": "Chinese President Xi told US Secretary of State Blinken that the world needed a stable US-China relationship. Read more at straitstimes.com.", "filename": "asia_east-asia_blinken-meets-xi-during-china-trip-to-salvage-ties_1728740902.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/20/yublinkenxi1906a_5.jpg?VersionId=Pcewdv.Yd28rnQdd2orHrMSodTT5hgcd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_blinken-meets-xi-during-china-trip-to-salvage-ties_1728740902.html", "title": "‘Disastrous’ for US to decouple from China, Blinken says after meeting Xi during Beijing trip to salvage ties", "title_page": "‘Disastrous’ for US to decouple from China, Blinken says after meeting Xi during Beijing trip to salvage ties | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – United States Secretary of State Antony Blinken met Chinese President Xi Jinping on Monday afternoon, wrapping up his two-day trip to Beijing that both sides acknowledged to be a good first step to mending frayed ties between the two major powers.\nMr Xi, sitting at the head of a large meeting table in the Great Hall of the People, told the American top envoy and his delegation seated to his right that the world needed a stable US-China relationship and that other countries are unwilling to choose sides.\nBoth the US and China have a responsibility to “inject stability, certainty and constructiveness into a turbulent world”, Mr Xi was quoted as saying by the Foreign Ministry.\nThe meeting was the first time a US secretary of state had met the Chinese leader since 2018, and it could pave the way for a summit between Mr Xi and US President Joe Biden later in the year.\nDuring the talks, Mr Xi emphasised that China respects the interests of the US and will not challenge or displace it. But the US must also respect China and not harm its legitimate rights and interests, he added.\n“Neither party should try to shape the other by its own will, still less deprive the other of its legitimate right to development,” he was quoted as saying.\nIn a press conference held after his meeting with Mr Xi, Mr Blinken gave the assurance that the US does not seek to decouple from China, but is looking to “de-risk and diversify”. With nearly US$700 billion (S$938 billion) in trade last year, it would be “disastrous for us to decouple and stop all trade investment”, he said.\nBut the US needs to protect its own critical technologies, “so they aren’t used against us”. “I made clear that we will continue to take targeted actions that are necessary to protect US national security,” said Mr Blinken about his meetings with Chinese leaders.\nHe told reporters he had raised with them issues such as human rights, more people-to-people exchanges, and anti-narcotics cooperation, among others.\nHe stressed the importance of maintaining open lines of communication, but said military-to-military talks have not resumed. Chinese Defence Minister Li Shangfu had refused a meeting with his US counterpart Lloyd Austin on the sidelines of the Shangri-La Dialogue security conference in Singapore recently, citing US sanctions against him.\nIn a briefing on Monday night, Mr Yang Tao, director-general of the North American and Oceanian Affairs Department at the Chinese Foreign Ministry, said defence talks cannot be reinstated until sanctions are removed on senior Chinese officials, including General Li.\nHe also dismissed the US’ framing of “de-risking” as a defensive move. “Our question is whether de-risking is just a repackaging of decoupling,” said the official, who had been part of the various meetings in the past two days. “If, fundamentally, de-risking is about shutting China out, then it is turning away from cooperation, stability and development. It won’t solve the US’ problem and will boomerang, putting a drag on the whole world.”", "url": "https://www.straitstimes.com/asia/east-asia/blinken-meets-xi-during-china-trip-to-salvage-ties"}