{"authors": [], "date_download": "2024-10-12 14:13:37", "date_modify": "2024-10-12 14:13:37", "date_publish": "2022-11-07 11:00:31", "description": "Health officials have declared China will stick to strict virus controls, dampening hopes of a reopening. Read more at straitstimes.com.", "filename": "asia_east-asia_china-s-covid-19-cases-jump-to-six-month-high-as-outbreaks-flare_1728742417.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/07/Lanzhou20Death_9.JPG?VersionId=rT5IaNDoi5ePe_DcJXSklYgCqhbQwuHX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-s-covid-19-cases-jump-to-six-month-high-as-outbreaks-flare_1728742417.html", "title": "China’s Covid-19 resurgence spurs new curbs; iPhone maker imposes restrictions", "title_page": "China’s Covid-19 resurgence spurs new curbs; iPhone maker imposes restrictions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – An escalating Covid-19 resurgence has spurred health officials and companies in China, including key iPhone manufacturer Foxconn, to ramp up measures to contain outbreaks, disrupting production and throwing business events into confusion.\nChina’s daily Covid-19 cases jumped to the highest number in more than six months, as outbreaks flared across the nation, and health officials declared they would stick to strict virus controls.\nChina reported on Monday 5,496 new locally transmitted Covid-19 cases for Sunday, the highest since May 2, when the country’s commercial capital of Shanghai was put under a crushing lockdown amid its worst outbreak.\nBeijing has shut schools in its most populous district, ordering students to study from home as an outbreak in the capital persists. Multiple schools in the Chaoyang district, home to corporate headquarters and embassies, halted in-person schooling from Monday, according to social media posts, although there has been no official government statement. Beijing reported 55 new infections for Sunday.\nHopes that China would start to wind back its zero-tolerance approach to the virus – fanned by unverified social media posts last week – were damped by comments from health officials over the weekend.\nChina will “unswervingly” adhere to its current virus controls given increasingly serious outbreaks, cadres from the National Health Commission (NHC) said at a highly anticipated briefing on Saturday.\n“Previous practices have proved that our prevention and control plans and a series of strategic measures are completely correct,” Dr Hu Xiang, an official at the NHC’s disease prevention and control bureau, told reporters. “The policies are also the most economical and effective.”\nThe southern manufacturing hub of Guangzhou found 1,935 cases. Haizhu, the downtown district where most of the cases were detected, is currently under a three-day lockdown announced on Saturday, as the local authorities struggle to reach zero transmission of the virus.\nZhengzhou, the capital of Henan province and home to the world’s largest iPhone factory, reported 297 cases for Sunday, after a lockdown since last week. The city’s authorities have pledged to take targeted Covid-19 restrictions, as the NHC named it as one of the places to have implemented overly excessive virus curbs.\nSince October, disruptions to the world’s second-largest economy have intensified – from central Henan province to Guangdong in the south – as infections caused by the Omicron variant spread.\nTaiwan-based Foxconn said late on Sunday it would implement new Covid-19 measures at its plant in Zhengzhou, including a system that would involve moving all working employees into three dormitories.\nFoxconn, whose production of Apple’s iPhone 14 models in Zhengzhou has been affected by the curbs, said in a statement on the WeChat account of its Zhengzhou plant that employees would be required to follow a “point-to-point” system, where they can only move between their dormitories and factory areas. Eight other dormitories will only allow workers to enter, and not exit.\nThe curbs were being implemented at the request of the government, it said.\nFoxconn has been working to retain staff and smooth over tensions in the factory, after workers complained about their treatment and provisions under Covid-19 prevention measures. Many employees have fled the factory, prompting Foxconn to offer generous bonuses to retain staff.\nWhile several events in China have been cancelled or postponed amid the rising cases, some organisers have continued to press ahead.\nSome visitors to the China International Import Expo, currently under way in Shanghai, were barred from entering the event venue despite having not left the city in the past two weeks and complying with all health requirements.\nOne found out that she could not attend only at the entrance when lights flashed red and security guards said their records showed travel history issues. A senior bank executive planning to attend the trade fair on Sunday discovered he was unable to do so, as he worked in his office one day in the preceding week where there was a close-contact case.\nAt the biannual Zhuhai Airshow in Guangdong, due to kick off on Tuesday, an aviation executive told Reuters he was barred from entering despite having arrived three days earlier to comply with requirements, as he had been in a district in Beijing that has reported cases in the past seven days.\nChinese stocks rallied last week in their biggest weekly gain in more than two years, as investors pumped US$1 trillion (S$1.4 trillion) into the market on hopes of a reopening in the world’s second-biggest economy. But China’s health authorities doused that speculation on Saturday by reiterating that they would persevere with their approach of clearing Covid-19 cases as soon as they surface. The authorities, however, have been making ongoing if modest tweaks to managing the virus. REUTERS, BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/china-s-covid-19-cases-jump-to-six-month-high-as-outbreaks-flare"}