{"authors": [], "date_download": "2024-10-12 14:11:52", "date_modify": "2024-10-12 14:11:52", "date_publish": "2022-11-03 11:35:51", "description": "The mansion, with sweeping views of the city’s skyline, has been pledged to repay an overdue bond. Read more at straitstimes.com.", "filename": "asia_east-asia_bank-seizes-evergrande-chairman-s-126m-hong-kong-mansion-says-online-news-firm_1728742312.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/03/FILES-CHINA-ECONOMY-PROPERTY-MORTGAGE-010231_4.jpg?VersionId=nJ8zpRntNc_KfcVkByxxOYtIoMQtZx78", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_bank-seizes-evergrande-chairman-s-126m-hong-kong-mansion-says-online-news-firm_1728742312.html", "title": "Bank seizes Evergrande chairman’s $126m Hong Kong mansion, says online news firm", "title_page": "Bank seizes Evergrande chairman’s $126m Hong Kong mansion, says online news firm | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – A mansion belonging to the chairman of embattled China Evergrande Group, Mr Hui Ka Yan, has been seized by lender China Construction Bank (Asia), local online news outlet HK01 reported on Thursday.\nThe report did not say when the 465 sq m mansion in Hong Kong’s prestigious The Peak residential enclave was taken over by the bank. HK01 said the property was valued at HK$700 million (S$126 million).\nEvergrande declined to comment on the report, and Mr Hui could not immediately be reached. China Construction Bank (Asia) had no immediate comment.\nThe mansion, with sweeping views of the city’s gleaming skyscrapers, had been pledged to raise about HK$300 million to repay an overdue Evergrande bond, HK01 reported last year.\nA filing with Hong Kong’s Land Registry confirmed in October 2021 that the property was pledged for a loan from China Construction Bank (Asia), although it gave no monetary figure.\nMr Hui owns two other luxury homes in the same development in The Peak. They were pledged to Orix Asia Capital in November 2021 for undisclosed amounts, according to the Land Registry.\nEvergrande’s main assets in Hong Kong – its headquarters and a vast plot of rural land – were seized by creditors in 2022.\nChinese state-owned China Citic Bank, lender to the office tower, took over the asset in September and put it on a tender sale in October, while United States asset manager Oaktree Capital Management seized the land in Yuen Long district early in 2022.", "url": "https://www.straitstimes.com/asia/east-asia/bank-seizes-evergrande-chairman-s-126m-hong-kong-mansion-says-online-news-firm"}