{"authors": [], "date_download": "2024-10-12 14:11:26", "date_modify": "2024-10-12 14:11:26", "date_publish": "2024-05-18 16:53:45", "description": "\"Serious violations of discipline and law\" is the commission's typical euphemism for corruption. Read more at straitstimes.com.", "filename": "asia_china-probes-agriculture-minister-for-suspected-disciplinary-violations_1728742286.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/18/tangrenjian1805.jpg?VersionId=QGinB4_ozmQpQX1.JhQm7iYUuKoKmkiV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-probes-agriculture-minister-for-suspected-disciplinary-violations_1728742286.html", "title": "China probes agriculture minister for suspected disciplinary violations", "title_page": "China probes agriculture minister for suspected disciplinary violations | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China’s Agriculture Minister is being investigated for suspected violations of law and discipline, the country’s anti-graft watchdog said on May 18.\nMr Tang Renjian, 61, is under investigation for “serious violations of discipline and law” by the Central Commission for Discipline Inspection (CCDI) and National Supervisory Commission, CCDI said on its website.\nThe term is CCDI’s typical euphemism for corruption.\nThe notice gave no further details.\nIt is uncommon for an official of Mr Tang’s rank to be placed under investigation without first being removed from the post.\nHe most recently appeared in public on May 15 at a conference on rural talent, where he gave a speech, according to a post on the Agriculture Ministry’s website.\nMr Tang formerly served as governor of China’s western Gansu province from 2017 to 2020 before being named Minister of Agriculture and Rural Affairs, according to official biographies. REUTERS", "url": "https://www.straitstimes.com/asia/china-probes-agriculture-minister-for-suspected-disciplinary-violations"}