{"authors": [], "date_download": "2024-10-12 13:54:18", "date_modify": "2024-10-12 13:54:18", "date_publish": "2023-01-14 13:24:58", "description": "The fireman was seen trying to cajole the dog with some food. Read more at straitstimes.com.", "filename": "asia_se-asia_puppy-love-video-of-dog-ignoring-a-malaysian-fireman-trying-to-rescue-it-goes-viral_1728741258.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/14/dog_0.jpg?VersionId=ooaPT5VrI1AASqrAtSqixqanxur2Zrax", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_puppy-love-video-of-dog-ignoring-a-malaysian-fireman-trying-to-rescue-it-goes-viral_1728741258.html", "title": "Puppy love? Video of dog ‘ignoring’ Malaysian fireman trying to rescue it goes viral", "title_page": "Puppy love? Video of dog ‘ignoring’ Malaysian fireman trying to rescue it goes viral | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA - A video of a Malaysian fireman attempting to “sweet talk” a dog that had got stuck in a corner on a ledge of an apartment, has gone viral, with online commentators praising the official for his patience.\nThe unnamed fireman, after ensuring his own safety by attaching a safety harness to himself before climbing out of a window onto the ledge, can be seen trying to persuade the pooch, which appears to be sulking by refusing to move.\nIn the 37-second video shared by Fire and Rescue Services Department Malaysia on its Facebook page, the fireman was seen trying to cajole the dog with some food.\nHowever, the dog ignored the fireman by looking away, leaving netizens tickled.\nWhile the fireman was attempting to rescue the pooch, four of his colleagues were watching nearby.\nIn a cheeky caption, the department wrote: “It’s not easy persuading this one, got to offer some sweet talk...”\nTo date, the post has been shared 20,000 times and has garnered over 7,000 comments.\nSome likened the dog to being an “upset girlfriend” giving her significant other the cold shoulder.\nCommentator Sazarina Hamzah said: “This dog must be a female... if you give her a bouquet of roses, she might be ‘moved’ by the fireman.”\nThe Penang Fire and Rescue Department director Saadon Mokhtar said the incident took place at about 3pm on Wednesday.\n“We received a call that a stray dog was stuck on the seventh floor of an apartment along Jalan Teluk Kumbar.\n“We manage to rescue the dog and bring it down safely. It was then released at a different area as a precautionary measure,” he said, adding that they were perplexed as to how the dog managed to go over a high wall and end up being stuck there.\nMany netizens also took the opportunity to express their respect and gratitude to the firemen, whose latest “high-profile” job included recovering bodies with their four-legged compatriots from a landslide near Genting Highlands. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/puppy-love-video-of-dog-ignoring-a-malaysian-fireman-trying-to-rescue-it-goes-viral"}