{"authors": [], "date_download": "2024-10-12 14:06:20", "date_modify": "2024-10-12 14:06:20", "date_publish": "2018-11-03 10:39:29", "description": "KUALA LUMPUR (THE STAR/ASIA NEWS NETWORK) - Former Goldman Sachs banker Roger Ng has been arrested and will be extradited in connection with the 1MDB investigation, the Malaysian police revealed. Read more at straitstimes.com.", "filename": "asia_se-asia_ex-goldman-sachs-banker-roger-ng-facing-1mdb-related-charges-to-be-extradited-to-us_1728741980.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/0ZoNJkRuuWa_6rzFFwSvsFYJcl198J9njiWw9v3dsAQ.jpg?VersionId=qtXBdC5TbMCt.4c3KL44ZNeekBzvLH8R", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_ex-goldman-sachs-banker-roger-ng-facing-1mdb-related-charges-to-be-extradited-to-us_1728741980.html", "title": "Ex-Goldman Sachs banker Roger Ng facing 1MDB-related charges to be extradited to US: Malaysian police", "title_page": "Ex-Goldman Sachs banker Roger Ng facing 1MDB-related charges to be extradited to US: Malaysian police | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR (THE STAR/ASIA NEWS NETWORK) - Former Goldman Sachs banker Roger Ng has been arrested and will be extradited in connection with the 1MDB investigation, the Malaysian police revealed.\nCommercial Crime Investigation Department (CCID) director Amar Singh said Ng was detained in Malaysia on Thursday (Nov 1) to assist in the probe by the US Department of Justice (DOJ).\n\"We served the warrant of arrest put out on him. The extradition process is ongoing and he will be extradited once everything is settled,\" Amar said on Friday.\nFugitive businessman Low Taek Jho and bankers Ng and Tim Leissner were indicted by the US DOJ on Thursday for conspiring to launder money and violating the Foreign Corrupt Practices Act in relation to 1Malaysia Development Berhad (1MDB).\nDOJ published the following statement regarding the criminal indictments: \"A three-count criminal indictment was unsealed today (Thursday) in the federal court in the Eastern District of New York charging Low Taek Jho, also known as Jho Low, and Ng Chong Hwa, also known as Roger Ng, with conspiring to launder billions of dollars embezzled from 1MDB, Malaysia's investment development fund, and conspiring to violate the Foreign Corrupt Practices Act (FCPA) by paying bribes to various Malaysian and Abu Dhabi officials.\"\nLeissner pleaded guilty to conspiring to launder money and to violating anti-bribery laws. He has been ordered to forfeit US$43.7 million (S$60 million) as a result of his crimes. The charges relating to 1MDB are the first by DOJ.\nIn 2016, the DOJ reportedly recovered over US$1 billion that was allegedly stolen, and sought the forfeiture of property including a Bombardier private jet, Manhattan penthouse, Beverly Hills mansion and paintings by Vincent Van Gogh and Claude Monet.", "url": "https://www.straitstimes.com/asia/se-asia/ex-goldman-sachs-banker-roger-ng-facing-1mdb-related-charges-to-be-extradited-to-us"}