{"authors": [], "date_download": "2024-10-12 14:07:47", "date_modify": "2024-10-12 14:07:47", "date_publish": "2024-02-07 14:09:37", "description": "Najib's lawyer said a new request was being considered as his client had not received a fair trial. Read more at straitstimes.com.", "filename": "asia_jailed-malaysian-ex-pm-najib-considering-new-request-for-a-full-pardon-lawyer_1728742067.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/07/LYNXMPEK16057-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_jailed-malaysian-ex-pm-najib-considering-new-request-for-a-full-pardon-lawyer_1728742067.html", "title": "Jailed Malaysian ex-PM Najib considering new request for full pardon: Lawyer", "title_page": "Jailed Malaysian ex-PM Najib considering new request for full pardon: Lawyer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Jailed former Malaysia prime minister Najib Razak is considering filing a new petition for a full pardon, his lawyer said on Feb 7, less than a week after a special panel agreed to halve his jail sentence.\nNajib, who was sentenced to 12 years in prison after being convicted in a case linked to the 1Malaysia Development Berhad (1MDB) scandal, had applied for clemency previously, but the Pardons Board, which is chaired by Malaysia’s king, opted last week to reduce his sentence.\nNajib's lawyer Shafee Abdullah said a new request was being considered as his client had not received a fair trial. Najib has consistently denied wrongdoing.\nThe lawyer also raised questions over the pardon process led by Sultan Abdullah Ahmad Shah, who ended his five-year reign as king on Jan 30, shortly after issuing the sentence reduction for Najib.\n“I don’t think the Pardons Board operated the way the Constitution expects them to operate,” Tan Sri Shafee said.\nThe board said in a statement last week that Najib is expected to be released in August 2028, six years after he began serving his sentence. It also reduced the fines imposed on the former premier.\nThe sentence reduction sparked uproar in Malaysia, with critics of Prime Minister Anwar Ibrahim saying the decision risked undermining anti-corruption efforts.\nNajib was found guilty in 2020 of criminal breach of trust and abuse of power for illegally receiving funds misappropriated from a unit of state fund 1MDB. The verdict was upheld by Malaysia's top court in 2022.\nAbout US$4.5 billion (S$6.04 billion) was allegedly stolen from 1MDB, with around US$1 billion flowing into the accounts of Najib, said Malaysian and US investigators. REUTERS", "url": "https://www.straitstimes.com/asia/jailed-malaysian-ex-pm-najib-considering-new-request-for-a-full-pardon-lawyer"}