{"authors": [], "date_download": "2024-10-12 14:03:24", "date_modify": "2024-10-12 14:03:24", "date_publish": "2023-03-17 17:02:58", "description": "SEOUL - South Koreans remain cautious over the dramatic progress made in less than two weeks of Japan turning from “frenemy” to “bestie”. Read more at straitstimes.com.", "filename": "asia_east-asia_south-koreans-remain-cautious-over-new-era-of-ties-with-japan_1728741804.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/17/dw-skorea-japan-230317_0.JPG?VersionId=Nz8kOXfN9pDwBWkE_vYfmL8Ye7MH0eHi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_south-koreans-remain-cautious-over-new-era-of-ties-with-japan_1728741804.html", "title": "South Koreans remain cautious over ‘new era’ of ties with Japan", "title_page": "South Koreans remain cautious over ‘new era’ of ties with Japan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - South Koreans remain cautious over the dramatic progress made in less than two weeks of Japan turning from “frenemy” to “bestie”.\nThe leaders of the two countries on Thursday hailed a new era of bilateral ties, which had been strained for years over historic disputes.\nThey agreed to bolster cooperation in the fields of security, economy and culture between the two countries.\nThe agreements were forged during a summit between South Korean President Yoon Suk-yeol and Japanese Prime Minister Fumio Kishida.\nThe summit came just 10 days after South Korea unveiled a deal with Japan.\nOn March 6, the Korean government said it would have a Seoul-backed foundation to compensate victims of wartime forced labour, turning away from the supreme court’s ruling that ordered two Japanese companies to pay.\nThe deal and the summit that followed shortly appear to have provided a watershed moment for the two countries.\nBut some say Mr Yoon should have considered national sentiments towards Japan, as many still demand a proper apology for the country’s wartime atrocities.\nOthers, however, view the summit as a breakthrough in mending frayed ties and moving towards the future.\n“I don’t understand why the Korean government is taking such a low profile in this process with Japan,” said a 40-year-old restaurant owner in Seoul. “The government should not ignore the victims and the nation’s feelings,” she said.\nMs Kim Ga-hui, 19, also said the Korean government seems to be sweeping unresolved historic disputes under the rug.\nShe said she believes such agreements made without apologies from Japan would only lead to further conflict in the future.\n“Even if the Korea-Japan talks were successful, it can only be viewed critically because it is considered a wrong meeting from the start,” she said.\n“Criticism of (South Korea’s offer of establishing a Seoul-backed foundation to compensate victims) is continuing in Korea. The president should try to understand the people’s thoughts before making a move.”\nA retired banker in his 60s said the Seoul foundation scheme is wrong because money was not what Koreans have been asking for.\n“Koreans rather kept seeking it to receive a proper apology. However, the president screwed it up. Yoon made an extreme choice to establish his achievements during his term in office.”\nOthers said the Korea-Japan summit should be evaluated from a practical point of view and that it is the time to move on from the past wrongdoings.\n“I want Korea and Japan to make peace about the historical issue. It has been too long and tedious for decades,” a 34-year-old businessman surnamed Kwon.\n“However, it seems that they are taking a step forward, both diplomatically and economically, by lifting regulations on exports of chip materials in the wake of the summit. So it is good if there are practical benefits.”\nMr Kang, a 34-year-old office worker, said he thinks it was right to hold the summit, considering security issues over North Korea’s growing nuclear threat.\n“I know there are criticisms that there was not enough discussion with the public, but the government got the advantage of making a quick decision by increasing efficiency,” he said.\nA recent survey in the wake of the new compensation plan, however, indicated Koreans’ negative moods towards Seoul’s efforts to mend fences with Tokyo.\nAccording to a survey by Gallup Korea of 1,002 respondents from March 8-9, only 35 per cent were in favour of the Seoul’s third-party compensation to forced labour victims for the national interest of South Korea.\nFifty-nine per cent opposed Seoul’s proposal, given it missed out on Japan’s sincere apology and direct compensation to the victims.\nThe younger generation tended to be against the decision. By ages of the respondents, 75 per cent of those in their 30s and 78 per cent of those in their 40s opposed the proposal.\nOn the other hand, the proportion of those against the proposal among people aged between 50 and 59 came to 59 per cent. The proportion of such respondents in their 60s stood at 41 per cent, and that of people in their 70s or older only amounted to 39 per cent.\nThe poll also showed that 3 in 10 prioritised Seoul’s step backwards regarding the forced labour dispute over Tokyo’s sincere apology to seek improved bilateral ties.\nSixty-four per cent, however, answered that Tokyo’s U-turn over the approach to the forced labour issues must precede the improvement of the Seoul-Tokyo relationship.\nA majority of those in their 60s, 70s and older answered that a swift improvement in the bilateral relationship should be in place whatever the circumstances.\nThis also showed contrast with that of the younger generation, as less than 20 per cent of people in their 30s and 40s responded that improved ties are more important than Japan’s apology. THE KOREA HERALD/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/south-koreans-remain-cautious-over-new-era-of-ties-with-japan"}