{"authors": [], "date_download": "2024-10-12 13:33:48", "date_modify": "2024-10-12 13:33:48", "date_publish": "2024-01-19 20:31:54", "description": "The escalator will help the disabled and elderly visitors get to the main cave temple at the top. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-s-batu-caves-to-have-escalator-built-after-thaipusam_1728740028.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/19/Temple.PNG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-s-batu-caves-to-have-escalator-built-after-thaipusam_1728740028.html", "title": "Malaysia’s Batu Caves to have escalator built after Thaipusam", "title_page": "Malaysia’s Batu Caves to have escalator built after Thaipusam | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Instead of climbing up a long flight of 272 steps, visitors to Batu Caves in Selangor can look forward to an easier way to reach the main cave temple at the top.\nAn escalator will be built at the popular tourist attraction just north of Kuala Lumpur in 2024.\nIt is intended to make the Sri Subramaniar cave temple more accessible to the disabled and elderly visitors, said temple committee chairman R. Nadarajah at a press conference on Jan 19, Bernama reported.\nConstruction of the escalator and a new multipurpose hall will begin after Thaipusam, which falls on Jan 25.\nWhile the hall is estimated to cost around RM35 million (S$9.9 million), Mr Nadarajah did not say how much the escalator will cost.\n“We hope the government would assist us since this will allow the disabled and elderly who are unable to climb the steps to reach the main temple,” he said.\nBatu Caves in Gombak is home to one of the more popular shrines outside India and is dedicated to the Hindu god of war Murugan. A 42.7m-tall statue of the deity greets visitors at the entrance of the attraction.\nThousands of tourists and Hindu devotees visit the cave and temple every day, with numbers rising to an estimated 1.6 million over the four-day Thaipusam period in 2023.\nThe 272 steps leading to the limestone caves were the subject of viral photos on social media after they were painted in bright shades of blue, red and orange in 2018.", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-s-batu-caves-to-have-escalator-built-after-thaipusam"}