{"authors": [], "date_download": "2024-10-12 13:50:16", "date_modify": "2024-10-12 13:50:16", "date_publish": "2024-09-22 18:43:00", "description": "The teachings were declared illegal in Negri Sembilan in 2016. Read more at straitstimes.com.", "filename": "asia_se-asia_heads-of-school-linked-to-group-in-malaysia-child-sexual-abuse-probe-arrested-for-deviant-teachings_1728741016.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/22/2024-09-19T082956Z409854783RC2J3AAKHG9WRTRMADP3MALAYSIA-ABUSE-CHILDREN.JPG?VersionId=2F1SFPd.YpfPDeJYOCLqyukRvDrzw7bW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_heads-of-school-linked-to-group-in-malaysia-child-sexual-abuse-probe-arrested-for-deviant-teachings_1728741016.html", "title": "Heads of school linked to group in Malaysia child sexual abuse probe arrested for deviant teachings", "title_page": "Heads of school linked to group in Malaysia child sexual abuse probe arrested for deviant teachings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA - The chairman and the principal of a school in Kuala Pilah, linked to GISB Holdings, a conglomerate embroiled in an alleged child abuse case in Malaysia, have been arrested on suspicion of reviving deviant Islamic teachings.\nAccording to a Sinar Harian report, the two men – aged 58 and 51 – were arrested on suspicion of trying to revive the teachings of Aurad Muhammadiyah, which was declared illegal in Negeri Sembilan in 2016.\nNegeri Sembilan Islamic Religious Affairs Department enforcement division head Ahmad Zaki Hamzah said they were arrested at the Kuala Pilah police headquarters at about 9pm on Sept 21.\nHe said they were arrested following a raid carried out at the school on Sept 6.\n“We initially investigated them for managing an unregistered school, but it was later found that they also tried to revive the teachings of Aurad Muhammadiyah, which had been declared illegal by the Negeri mufti in 2016,” he told Sinar Harian on Sept 22.\nAccording to Mr Ahmad Zaki, the court allowed the men RM2,000 (S$613) bail each with two sureties.\n“The re-mention of the charges is set for Nov 12,” he said.\nFour teaching assistants from the school were also charged with sexual misconduct at the Sessions Court.\nThe accused are Muhammad Habib Noh Mohd Zairi, 21; Muhammad Khunnais Fathie Khabil, 20; Ahmad Nadzful Izham Azizan, 22; and Muhammad Fawzun Azim Ismail, 20. They face five, six, three and six charges, respectively.\nThey pleaded not guilty to all charges. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/heads-of-school-linked-to-group-in-malaysia-child-sexual-abuse-probe-arrested-for-deviant-teachings"}