{"authors": [], "date_download": "2024-10-12 13:49:31", "date_modify": "2024-10-12 13:49:31", "date_publish": "2024-08-21 16:36:21", "description": "The decision could prevent his youngest son from running for deputy governor of Central Java in 2024. Read more at straitstimes.com.", "filename": "asia_se-asia_court-ruling-deals-blow-to-jokowi-s-dynastic-legacy-in-indonesia_1728740971.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/21/dw-kaesang-240821.jpg?VersionId=AL.s.3Q2u54Zl.yXeZG8.xe6YKZamPW4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_court-ruling-deals-blow-to-jokowi-s-dynastic-legacy-in-indonesia_1728740971.html", "title": "Court ruling deals blow to Jokowi’s dynastic legacy in Indonesia", "title_page": "Court ruling deals blow to Jokowi’s dynastic legacy in Indonesia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Indonesia’s Constitutional Court rejected a petition to change the minimum age limit for candidates in regional elections, putting itself at odds with the Supreme Court and potentially stopping President Joko Widodo’s younger son from running for deputy governor of Central Java in 2024.\nUnder current conditions, candidates who are less than 30 years old cannot run for governor or deputy governor, the ruling said. Mr Kaesang Pangarep, the President’s son, will turn 30 in December, while registration for November’s regional elections will open in late August.\nThe decision appears to be a setback for the dynastic legacy of Jokowi, as the President is known, as he prepares to hand over power in October due to term limits. Accusations of nepotism flared in 2023 after the Constitutional Court, in a decision chaired by Mr Widodo’s brother-in-law, lowered minimum age limits for presidential and vice-presidential candidates.\nThat ruling paved the way for Mr Widodo’s 36-year-old older son to make a successful run that will see him become vice-president in October.\nThe 29-year-old Kaesang had appeared on course for a regional role after the Supreme Court in May eased the minimum age limit for candidates in gubernatorial elections, saying a governor needs to be only at least 30 years old at the time of inauguration. Mr Widodo himself had used his role as Jakarta’s governor as a successful launchpad to the presidency.\n“The Constitutional Court’s decision interpreted a law, while the Supreme Court interpreted an implementing regulation,” said legal expert and political commentator Bivitri Susanti from the Indonesia Jentera School of Law, who has conducted research on legislative, civil society and corruption issues for more than a decade. “It is clear, it should follow the new rules. There is no choice but to implement the (constitutional) court’s decision.”\nBut the wild card is the election commission, she added.\nIf the election commission does not follow the ruling, any candidate who does not meet the requirements will be declared invalid, constitutional judge Saldi Isra said in the court ruling. Candidates must fulfil all requirements before being named as official candidates, he added.\nThe question now becomes whether there is any avenue for Mr Kaesang or his allies to help him run for office in any case, or to otherwise circumvent the court’s decision. He was backed by two political parties, including that of President-elect Prabowo Subianto, to run in the Central Java gubernatorial and vice-gubernatorial race.\n“With this decision, the age requirement for candidates must be met,” said Ms Titi Anggraini, an advisory board member of the Association for Elections and Democracy or Perludem, an independent, non-profit advocacy group. “It is too risky to circumvent the court’s decision as the nomination is inconsistent and invalid. If that happens, it will be very bad for legal certainty.” BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/court-ruling-deals-blow-to-jokowi-s-dynastic-legacy-in-indonesia"}