{"authors": [], "date_download": "2024-10-12 13:45:34", "date_modify": "2024-10-12 13:45:34", "date_publish": "2022-02-11 11:54:05", "description": "MELBOURNE (AFP) - Foreign ministers of the \"Quad\" - the United States, India, Australia and Japan - meet in Melbourne on Friday (Feb 11), cementing an alliance designed to counter China's forceful push across the Asia-Pacific region. Read more at straitstimes.com.", "filename": "asia_australianz_checking-china-what-is-the-quad-alliance__gl=1_1yb3m4q__gcl_au_NDU5MzQ4NDI0LjE3MDAzNDQ1Njg_1728740734.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/02/11/md_ministers1_11022022.jpg?VersionId=5cprLfPZelMdQ6ETqrBGqUHCwtf4O6UT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_checking-china-what-is-the-quad-alliance__gl=1_1yb3m4q__gcl_au_NDU5MzQ4NDI0LjE3MDAzNDQ1Njg_1728740734.html", "title": "Checking China: What is the Quad alliance?", "title_page": "Checking China: What is the Quad alliance? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MELBOURNE (AFP) - Foreign ministers of the \"Quad\" - the United States, India, Australia and Japan - meet in Melbourne on Friday (Feb 11), cementing an alliance designed to counter China's forceful push across the Asia-Pacific region.\nThe grouping has emerged and receded from prominence over the years but gained new traction following deadly border clashes between India and China in 2020, and a recent surge in Australian diplomatic and commercial confrontations with Beijing.\nMembers stress it is not an \"Asian Nato\" and portray it as a group that can offer others in the region an alternative to China in areas including Covid-19 resources, disaster relief and cyber security.\nRoots in 2004 tsunami relief\nThe four first came together for relief operations after the Indonesia earthquake of Dec 26, 2004, sent devastating tsunami waves along India's eastern coastline, killing about 230,000 people.\nThree years later, the four countries formed the Quadrilateral Security Dialogue. Japan's then prime minister Shinzo Abe was said to be a driving force in the effort.\nThe Quad's first main act was to conduct joint naval exercises under the existing US-India bilateral Malabar exercise format.\nBut a year later, then Australian prime minister Kevin Rudd backed away from the nascent alliance, not wanting to be part of a group seen as openly challenging China, which had become a powerful economic partner of Australia.\nAustralia returns to fold\nA decade later, China's increasingly aggressive push to build regional networks and project its military power, especially in the South China Sea, and violent border clashes with India, prodded the four back together, with Canberra now a more committed partner.\nThey all participated in the 2020 Malabar exercises, making the group appear increasingly like a military alliance.\nBeijing lashed out in response, branding it a Cold War-type organisation dedicated to containing China.\nBiden's stamp\nWhile the Trump administration put some effort into sustaining the Quad, President Joe Biden went further, convening, virtually, the first summit of Quad leaders in March 2021 just weeks after becoming president.\nIn September 2021, the four met in person in Washington, elevating the grouping further - still without creating a formal institution.\nIt was an example of Washington's new approach of building coalitions of countries and institutions around specific mutual needs, regionally and globally, rather than traditional security alliances.\nThat means, Washington says, the Quad can work with other groupings, such as Asean, when interests overlap.\nWooing India\nFor the US, Australia and Japan, the Quad is very much a long-term courtship of India. New Delhi is traditionally insistent on its non-aligned status when it comes to contests between superpowers.\nBut the deadly fighting that broke out in 2019 between Chinese and Indian troops in a disputed Himalayan border region may have moved India off that stance.\nIn the past two years, all three of their fellow Quad members have intensified their diplomatic and military outreach to New Delhi.\nIndia is \"the critical, crucial member in the Quad\", Mr Kurt Campbell, the White House's national security coordinator for the Asia-Pacific region, said in November.\nIn its strategic planning for the region, the US has stopped saying \"Asia-Pacific\" and now studiously refers to it as the \"Indo-Pacific\".\nVaccines and climate change\nBut officials from all four countries say the Quad has to offer more than defence. None are pushing for a formal alliance - India, analysts say, remains deeply wary of that - and there are doubts it could effectively challenge Beijing's military might anyway.\nInstead, the four democratic countries are looking to other \"soft power\" activities that offer the rest of the region a contrast to authoritarian China.\nThe Covid-19 pandemic has been central to giving the grouping greater meaning. The four countries used the Quad framework to commit to distributing 1.3 billion vaccine doses, with more than 485 million already delivered.\nOther issues they are working on within the Quad format: \"clean\" shipping, fighting global warming and building more secure IT and internet infrastructure.\nWhat next?\nThe meeting in Melbourne this week is in part to set the agenda for the next summit of Quad leaders, which is set for Japan, possibly in May.", "url": "https://www.straitstimes.com/asia/australianz/checking-china-what-is-the-quad-alliance?_gl=1*1yb3m4q*_gcl_au*NDU5MzQ4NDI0LjE3MDAzNDQ1Njg."}