{"authors": [], "date_download": "2024-10-12 13:50:20", "date_modify": "2024-10-12 13:50:20", "date_publish": "2022-10-17 12:19:09", "description": "Daizenji, which is famous as the home of Mount Fuji, is also Japan’s top wine-making destination. Read more at straitstimes.com.", "filename": "asia_east-asia_unique-in-japan-a-temple-dedicated-to-grapes-and-wine_1728741020.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/17/JAPAN-AGRICULTURE-WINE-TEMPLE-020356_1.jpg?VersionId=jWuf7cLlJn_vNojXDGtiT.O9A8qHqbxM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_unique-in-japan-a-temple-dedicated-to-grapes-and-wine_1728741020.html", "title": "'Unique in Japan': A temple dedicated to grapes and wine", "title_page": "'Unique in Japan': A temple dedicated to grapes and wine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KOSHU, Japan - At a Buddhist temple on a wooded hillside in Japan, grapes and wine bottles are given as offerings, and the head monk is also the honorary president of a vineyard cooperative.\nOfficially, it is known as Daizenji, but it has been nicknamed the “grape temple” because of its deep-rooted links to the history of grape production in the country.\nDaizenji is in the Yamanashi region, around 100km west of Tokyo, which is famous as the home of Mount Fuji, and more recently as Japan’s top wine-making destination.\n“At other temples, they offer sake, but here, we offer wine. That’s unique in Japan,” said Tesshu Inoue, 75, the head monk, recounting the mythic origins of his temple.\nIn 718 AD, a famous Japanese Buddhist monk and traveller called Gyoki is said to have met the Buddha of medicine, known in Japanese as Yakushi Nyorai, in a dream at the spot where the temple stands today.\nIn his hand, Nyorai held a bunch of grapes – inspiring Gyoki to found Daizenji and establish the local vineyard culture, teaching Yamanashi residents how to make wine for medicinal purposes.\nA different legend claims farmer Kageyu Amemiya was the first to begin the cultivation of grapes in Japan, in the same area but more than 450 years later, in 1186.\nDNA analysis has found that koshu – the oldest grape variety grown in the mountainous region – is a hybrid of a vine species originally cultivated in Europe and a wild Chinese vine.\nThat suggests it may have followed the Silk Road on its way to Japan, the same way Buddhism established itself in Asia.\nThe website for Yamanashi’s “koshu valley”, supported by the local chamber of commerce, suggests seeds or vines from China may have been planted in the grounds of temples and rediscovered by chance much later.\nHowever, it was only in the Meiji era from 1868 to 1912 – a period that saw an explosion in interest in the Western world – that wine production started in Japan.\nWith its fertile soil and long history of grape growing, Yamanashi was the obvious choice for the first vineyards, and even today, Daizenji is surrounded by grapes being grown on pergola structures.\nAt the altar, grapes and bottles sit as offerings, while a small shrine conceals an antique cherry-wood statue of Yakushi Nyorai with his famous bunch of grapes.", "url": "https://www.straitstimes.com/asia/east-asia/unique-in-japan-a-temple-dedicated-to-grapes-and-wine"}