{"authors": [], "date_download": "2024-10-12 14:00:59", "date_modify": "2024-10-12 14:00:59", "date_publish": "2023-08-09 22:48:00", "description": "Publishing marriage banns in newspapers was a practice that dates back to the early 20th century Read more at straitstimes.com.", "filename": "asia_east-asia_more-young-chinese-couples-say-till-death-do-us-part-in-newspaper-marriage-ads_1728741659.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/09/aichina0908.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_more-young-chinese-couples-say-till-death-do-us-part-in-newspaper-marriage-ads_1728741659.html", "title": "More young Chinese couples say ‘till death do us part’ in newspaper marriage ads", "title_page": "More young Chinese couples say ‘till death do us part’ in newspaper marriage ads | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "YINCHUAN – Mr Sun Guotai, 29, and his wife, surnamed Yang, tied the knot on July 25, and on their big day, their marriage announcement appeared in the Shenzhen Evening News, a local newspaper from their home town in south China’s Guangdong province.\nIn a delightful twist from modern norms, young couples across China are embracing a retro trend by announcing their marriages in newspapers rather than on social media.\n“We are officially married today and will love and cherish each other till death do us part,” the newly wed couple’s newspaper ad read.\nSpeaking about the unique approach, Mr Sun said: “It is a memorable way to share our romance in the newspaper.”\nHe added that he booked the ad space two weeks in advance as a surprise for his wife.\nPublishing marriage banns in newspapers was a traditional marital ritual that dates back to the 1912-1949 period.\nDue to the flawed marriage registration system at that time, announcing marriages in newspapers, which holds legal significance, became a common practice for couples to inform their relatives and friends.\n“Newspapers were a major source of information when we were kids,” Ms Yang said. “I was really excited to see our wedding announcement in print.”\nYoung people believe that publishing their good news in newspapers, which require meticulous editorial review prior to publication, is more formal than posting on social media platforms such as WeChat and Sina Weibo.\n“The announcement is more than just a display of affection, but a solemn commitment to spend the rest of our lives together,” said Ms Chen Xiaoyu, 28, who had also published her wedding announcement in the newspaper.\nAfter receiving a copy of the newspaper, Ms Chen and her husband decided to frame the page and hang it on the wall of their home.\n“Newspaper is time-tested,” she said. “Decades later, people will still be able to see our commitment.”\nWith the surging demand among youngsters to publish such announcements, an increasing number of newspapers in China now provide marriage announcement ad services.\nThe expenses vary based on word count and page dimensions, spanning from several hundred yuan to more than 1,000 yuan (S$1,300).\nAccording to Ms Meng Si, who works with a third-party online platform that specialises in this service, there has been a recent surge in orders.\n“The clients are mainly young people in their twenties. Some even make reservations one to two months in advance,” she said.\nUpon the launch of this service on July 6, the Shenzhen Evening News saw more than 800 inquiries. So far, hundreds of people have used it.\nAt the end of July, a metropolitan newspaper in north-west China’s Ningxia Hui Autonomous Region also launched a tailored section for readers to publish their wedding announcements.\n“Amid a digital transformation in media, the marriage announcement services have once again drawn public attention to print media, and offered new perspectives for future development,” said Mr Ye Xiaobin, editor-in-chief of the Shenzhen Evening News. XINHUA", "url": "https://www.straitstimes.com/asia/east-asia/more-young-chinese-couples-say-till-death-do-us-part-in-newspaper-marriage-ads"}