{"authors": ["Lok Jian Wen"], "date_download": "2024-10-12 14:21:18", "date_modify": "2024-10-12 14:21:18", "date_publish": "2023-10-31 17:00:00", "description": "He said Singapore’s Government is operating at a level that his state aspires to reach. Read more at straitstimes.com.", "filename": "asia_se-asia_johor-crown-prince-expresses-admiration-for-singapore-s-political-leaders_1728742878.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/31/hzprince231023.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_johor-crown-prince-expresses-admiration-for-singapore-s-political-leaders_1728742878.html", "title": "Johor Crown Prince expresses admiration for Singapore’s political leaders", "title_page": "Johor Crown Prince expresses admiration for Singapore’s political leaders | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Johor’s Crown Prince Tunku Ismail Sultan Ibrahim said he admired Singapore’s politicians for their knowledge and professionalism, adding that relations between the Malaysian state and the Republic will continue to be very close.\nDuring a podcast on Sunday, Tunku Ismail said Singapore’s Government is operating at a level that his state aspires to reach.\n“When I have engagements with ministers or any government officials from Singapore, to see that qualification, that knowledge and that professionalism in every agency, I envy that,” Tunku Ismail said. “I want to see that (in Johor). I don’t see them as competitors, I see them as a platform I want to reach.”\nHe cited the multilingualism of Singapore’s leaders as an example.\n“It all goes back to education,” said the alumnus of the Australian International School in Singapore, adding that the education system in Johor is an area he seeks to improve.\nHe was speaking to Malaysia’s former health minister Khairy Jamaluddin and former Umno information chief Shahril Hamdan on their podcast Keluar Sekejap (“out for a while” in Malay).\nThe episode was on the Crown Prince and his thoughts on politics at the federal and state levels, as well as his military training experiences in India.\nThe podcast was aired two days after the Crown Prince’s father, Sultan Ibrahim Iskandar, was elected as Malaysia’s next king.\nSultan Ibrahim will become the 17th king on Jan 31, 2024.\nThe Crown Prince said the friendly ties between Johor and Singapore – which date back decades to when his late grandfather was Sultan of Johor – are set to continue, with upcoming infrastructure projects including the “game changer” Rapid Transit System (RTS) Link.\nThe RTS Link, set to be completed by end-2026, connects Bukit Chagar station in Johor Bahru and Woodlands North MRT station.\nIt will take passengers about five minutes to travel from one station to another and reduce congestion on the Causeway.\nHe added that he hoped the project, together with a special economic zone between Singapore and Johor that is in the works, will facilitate the flow of people travelling between the Republic and Malaysia.\nEarlier in October, Tunku Ismail thanked Singapore when he and his family took shelter at the Singapore Embassy in Bangkok after a shooting incident at the Siam Paragon mall.\nHe also made a three-day official visit to Singapore in July, meeting Prime Minister Lee Hsien Loong and visiting the Singapore Armed Forces’ commando unit in his capacity as the Johor Military Force’s commanding officer.\nCorrection note: This article has been edited for accuracy.", "url": "https://www.straitstimes.com/asia/se-asia/johor-crown-prince-expresses-admiration-for-singapore-s-political-leaders"}