{"authors": [], "date_download": "2024-10-12 13:52:33", "date_modify": "2024-10-12 13:52:33", "date_publish": "2023-05-24 16:00:00", "description": "The two sides also signed a migration deal to boost Indian student and business travel to Australia. Read more at straitstimes.com.", "filename": "asia_australianz_australia-india-to-seek-closer-economic-ties-critical-minerals-cooperation_1728741153.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/24/AUSTRALIA-INDIA-DIPLOMACY-051542_6.jpg?VersionId=s30pQhkNF82m3v4MA7Yj1mRO9o8tEhG4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australia-india-to-seek-closer-economic-ties-critical-minerals-cooperation_1728741153.html", "title": "Australia, India to seek closer economic ties, critical minerals cooperation", "title_page": "Australia, India to seek closer economic ties, critical minerals cooperation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Australian Prime Minister Anthony Albanese met his Indian counterpart Narendra Modi in Sydney on Wednesday to discuss regional security and economic ties.\nThe two leaders also signed a migration deal to boost Indian student and business travel to Australia. In addition, they discussed the impact of Russia’s conflict with Ukraine on developing countries, particularly food and fuel security, Indian officials said.\nMr Modi is visiting Australia for the first time since 2014, and two months after Mr Albanese travelled to India.\nIndia and Australia are members of the Quad group of nations, which also includes Japan and the United States, and Mr Modi had been due to attend a Quad leaders’ meeting in Sydney.\nBut that meeting was held on the sidelines of a Group of Seven summit in Tokyo instead, as US President Joe Biden had to return directly to Washington to deal with a domestic debt ceiling crisis.\n“Quad leaders stand together for an open, stable, secure and prosperous Indo-Pacific region... where all countries large and small benefit from a regional balance that keeps the peace,” Mr Albanese told reporters after a bilateral meeting with Mr Modi.\nMr Albanese said he and Mr Modi had also discussed trade, migration and renewable energy, and the two nations had established a hydrogen task force to expand cooperation on clean energy.\nAustralia, whose largest trading partner is China, is seeking to diversify its export markets, including forging closer trade ties with India.\nIndia is Australia’s sixth-largest trading partner, while around 750,000 people in Australia claim Indian ancestry.\nMr Modi said they had discussed increasing cooperation on mining and critical minerals, and would work towards a comprehensive economic cooperation agreement.\n“We talked about taking the Australia-India comprehensive strategic partnership to greater heights in the next decade,” he told reporters.\nIndian officials later said the next round of trade negotiations will be in June and July.\nA migration agreement “will further strengthen our living bridge”, Mr Modi said, referring to the Indian diaspora in Australia, which is the second-largest and fastest-growing diaspora group in the country.", "url": "https://www.straitstimes.com/asia/australianz/australia-india-to-seek-closer-economic-ties-critical-minerals-cooperation"}