{"authors": [], "date_download": "2024-10-12 13:39:59", "date_modify": "2024-10-12 13:39:59", "date_publish": "2024-08-08 20:26:46", "description": "GORNJE NEDELJICE, Serbia - Zlatko Kokanovic, a 48-year-old Serbian farmer, and fellow villagers have sparked nationwide protests to stop the building of Rio Tinto's first European lithium mine, warning it would pollute their land and endanger public health. Read more at straitstimes.com.", "filename": "asia_serbian-villagers-spark-protest-movement-against-planned-lithium-mine_1728740399.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/LYNXMPEK770JZ-1.jpg?VersionId=woHw.vFvxR3pra8Q6_ImGh5mtbdO3fel", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_serbian-villagers-spark-protest-movement-against-planned-lithium-mine_1728740399.html", "title": "Serbian villagers spark protest movement against planned lithium mine", "title_page": "Serbian villagers spark protest movement against planned lithium mine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GORNJE NEDELJICE, Serbia - Zlatko Kokanovic, a 48-year-old Serbian farmer, and fellow villagers have sparked nationwide protests to stop the building of Rio Tinto's first European lithium mine, warning it would pollute their land and endanger public health.\nLast month, Serbia reinstated Rio Tinto'a license to develop what would be Europe's biggest lithium mine in the Jadar region of western Serbia, two years after it was annulled due to protests by environmental groups.\nWarnings about the damaging effect of mining by Kokanovic and his neighbours in the village of Gornje Nedeljice motivated thousands of people to protest against the Rio Tinto project in dozens of cities around Serbia over the past month.\nThe protesters gave the government until Aug. 10 to pass legislation banning lithium exploration. The government regards the project as a key way to bolster Serbia's troubled economy and has not so far considered that demand.\nKokanovic, a father of five who farms 30 hectares of land and produces up to 100,000 litres of milk a year, warns that substances including arsenic and sulphuric acid used in processing lithium, as well as dust, will cause grave pollution.\n\"(The mine) would be the destruction of Serbia at the expense of our health to free the European Union from reliance on China (for lithium), so (the EU) can have healthy lives and their children can breathe healthy air,\" Kokanovic said.\n\"Now I can say: There will be no mine here.\"\nSerbia is not a member of the EU, where environmental regulations are stricter.\nKokanovic said the protests would escalate if the government did not back down, with further moves to be announced at a rally scheduled in the capital Belgrade for Saturday.\nIf implemented, the $2.4 billion Jadar lithium project in western Serbia could cover 90% of Europe's current lithium needs and make Rio Tinto one of the world's leading lithium producers.\nLithium is a key component in batteries for electric vehicles and mobile devices.\nKokanovic's neighbour, Marijana Petkovic, said her community is so alarmed by the Rio Tinto project that it is prepared to physically stop machinery from constructing the mine.\n\"We will defend our homes, our land, our church and our cemetery. Further radicalisation will be the next step (if necessary),\" she said.\nIn June, Rio Tinto said newly published environmental studies showed the project would be safe for local communities.\nIn an effort to allay fears of deadly pollution, the Serbian health ministry on Tuesday formed a commission tasked with studying the impact of lithium mining on human health.\n\"There will no digging for two years, so...stirring up panic makes no sense,\" President Aleksandar Vucic told reporters on Wednesday evening.\nOn July 19, Vucic, German Chancellor Olaf Scholz and EU energy Commissioner Maros Sefcovic signed a deal that would grant producers from EU member state access to raw materials mined in Serbia, which would include lithium.\nThe deal is meant to reduce the EU's dependency on imports from America and Asia.\nIn the central Serbian town of Kragujevac, protesters signalled they would not relent in the dispute over the lithium mine as they packed its main square on Wednesday evening.\n\"We do not want lithium in Serbia. If the damage to the environment is higher than the economic benefit, then it is clear (why the project is not good),\" demonstrator Aleksandar Jankovic said. REUTERS", "url": "https://www.straitstimes.com/asia/serbian-villagers-spark-protest-movement-against-planned-lithium-mine"}