{"authors": [], "date_download": "2024-10-12 14:00:59", "date_modify": "2024-10-12 14:00:59", "date_publish": "2022-09-01 14:20:41", "description": "The number of marriages per 1,000 people dropped to 5.4, also a fresh low and nearly halving the rate from a decade ago. Read more at straitstimes.com.", "filename": "asia_east-asia_china-marriages-dive-to-record-low-as-population-pressures-mount_1728741659.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/01/rrchinamarriage0109.jpg?VersionId=G9gYQgwCuIc1TdBfyUmkpRrPtZ2WBtnK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-marriages-dive-to-record-low-as-population-pressures-mount_1728741659.html", "title": "China marriages dive to record low as population pressures mount", "title_page": "China marriages dive to record low as population pressures mount | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING- China's new marriages plunged to the lowest level on record last year, a sign of shifting demographic trends as people age and delay their plans to start a family.\nSome 7.6 million marriages were registered in 2021, according to figures recently released by the Ministry of Civil Affairs. That is the lowest dating back to 1985, the earliest year for which the National Bureau of Statistics has published records.\nThe crude marriage rate - or the number of marriages per 1,000 people - dropped to 5.4, also a fresh low and nearly halving the rate from a decade ago.\nChina's economy faces pressure as people grow older and births fall, with a central bank adviser warning in March that the population will likely peak this year.\nThe working-age population of nearly 1 billion, which has been critical to the country's economic rise over the past four decades, will start declining rapidly in the 2030s and shrink by almost two-thirds by the end of the century, according to projections by the United Nations.\nThe drop in marriages - along with a plummeting birth rate - is likely attributable to a decline in the population of young people. That's partially a result of China's one-child policy, which lasted from the 1980s to 2016.\nThe number of residents between 20 and 50 years old declined to 597 million in 2020 from 674 million a decade ago, according to census data.\nMany people are also delaying their plans for marriage and children, in line with trends elsewhere around the world, as the cost of raising a child rises and as the pandemic presents continued uncertainty, among other reasons.\nThe average age of women getting married for the first time in Jiangsu province, for example, jumped to nearly 30 in 2020, up from 23.8 in 2010. BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/china-marriages-dive-to-record-low-as-population-pressures-mount"}