{"authors": [], "date_download": "2024-10-12 13:45:45", "date_modify": "2024-10-12 13:45:45", "date_publish": "2023-09-29 19:32:47", "description": "India has denied any role in the killing of Mr Hardeep Singh Nijjar. Read more at straitstimes.com.", "filename": "asia_sikh-group-protests-outside-golden-temple-over-killing-in-canada_1728740745.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/29/2023-09-29T113744Z885139744RC2BI3ADE2GMRTRMADP3CANADA-INDIA-PROTESTS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_sikh-group-protests-outside-golden-temple-over-killing-in-canada_1728740745.html", "title": "Sikh group protests outside Amritsar’s Golden Temple over killing in Canada", "title_page": "Sikh group protests outside Amritsar’s Golden Temple over killing in Canada | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI - Hundreds of Sikh activists on Friday staged a demonstration outside the Golden Temple in Amritsar, in the northern Indian state of Punjab, demanding punishment for the killers of a Sikh separatist in Canada.\nEarlier this month, Canadian Prime Minister Justin Trudeau told parliament that there may be a link between New Delhi and the murder of Mr Hardeep Singh Nijjar in June in British Columbia.\nIndia has denied any role in the killing and described the allegations as \"absurd\". The accusations have sparked tensions between the two countries, with each nation expelling diplomats, and New Delhi suspending visas for Canadians.\nHolding posters of Mr Nijjar, the protesters outside the holiest of Sikh shrines shouted slogans asking New Delhi to stop extrajudicial operations against separatists seeking Punjab as an independent state.\nMr Nijjar, who worked as a plumber, left the north Indian state of Punjab a quarter-century ago and became a Canadian citizen. He has supported the formation of a Sikh homeland. India designated him a \"terrorist\" in July 2020.\n\"It is time and opportunity for New Delhi to talk with Sikh leadership,\" said Mr Paramjit Singh Mand, a leader of Dal Khalsa, the group, which is advocating for a separate Sikh homeland and organised the protest.\nSikhs make up just 2 per cent of India's 1.4 billion people but they are a majority in Punjab, a state of 30 million where their religion was born 500 years ago.\nNearly 400 activists participated in the protest and later held prayers at the temple for the release of political prisoners and for the well-being of exiled separatists, said Mr Kanwar Pal, political affairs secretary of the group.\n\"We thank the Canadian government for exposing the Indian design, how India is operating on foreign soil, intervening in Canadian affairs,\" he said.\nCanadian Sikhs staged small protests outside India's diplomatic missions on Monday, burning an Indian flag, while waiving yellow flags marked with the word \"Khalistan\", referring to their support for making Punjab an independent state.\nSeparately, some farmer unions stopped trains and road traffic as part of a three-day protest in some parts of Punjab, demanding a high procurement price for crops, and compensation for those whose crops were damaged in recent rains and floods. REUTERS", "url": "https://www.straitstimes.com/asia/sikh-group-protests-outside-golden-temple-over-killing-in-canada"}