{"authors": [], "date_download": "2024-10-12 13:39:22", "date_modify": "2024-10-12 13:39:22", "date_publish": "2023-10-06 15:29:38", "description": "Pakistan's foreign minister defended on Thursday an order that all illegal immigrants, including 1.73 million Afghans, must leave, saying no other country allows illegal immigrants and the decision is in line with international practice. Read more at straitstimes.com.", "filename": "asia_pakistani-minister-defends-decision-to-expel-afghans_1728740362.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/06/LYNXMPEJ9507J-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_pakistani-minister-defends-decision-to-expel-afghans_1728740362.html", "title": "Pakistani minister defends decision to expel Afghans", "title_page": "Pakistani minister defends decision to expel Afghans | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Pakistan's foreign minister defended on Thursday an order that all illegal immigrants, including 1.73 million Afghans, must leave, saying no other country allows illegal immigrants and the decision is in line with international practice.\nThe order, announced on Tuesday and with a Nov. 1 deadline for people to go, has frayed relations with Afghanistan's Taliban rulers, who said the threat to force out Afghan migrants was \"unacceptable\".\n\"No country allows illegal people to live in their country， whether it is Europe，whether it is countries in Asia, in our neighbourhood,\" the minister in a caretaker Pakistani government, Jalil Abbas Jilani, told Hong Kong's Phoenix TV in an interview on the sidelines of a forum in Tibet.\n\"So, accordingly，this is in line with the international practice that we have taken this decision.\"\nPakistan has been a refuge for people fleeing from war in Afghanistan since the 1970s.\nPakistan's interior minister said on Tuesday some 1.73 million Afghans in Pakistan had no legal documents and the number of Afghan refugees in Pakistan totalled 4.4 million.\nIn defending the decision to expel Afghans, Pakistani authorities said 14 of 24 suicide bombings this year had been carried out by Afghan nationals. A Taliban spokesman rejected that assertion.\n\"Whenever there was any problem, people would immigrate to Pakistan, take refuge in Pakistan,\" Jilani said.\n\"But now I think it has been more than 40 years, so the government of Pakistan has taken a decision,\" Jilani said, noting that the situation in Afghanistan had stabilised.\nDecades of war in Afghanistan largely ended in mid-2021 when the Taliban re-took control as U.S.-led foreign forces were withdrawing and a U.S.-backed government collapsed.\nWhile Pakistan has for years favoured the Taliban as Pakistan's best option in its neighbour, relations have deteriorated over the past couple of years, largely over Pakistani accusations that Islamists fighting the Pakistani state operate from Afghan territory.\nThe Taliban deny that.\nJilani said Pakistan had been discussing the migrant issue with Afghanistan \"for a very long time\" and he called on international humanitarian agencies to help with the process.\nAid officials say Afghanistan is already facing a humanitarian crisis and the forced repatriation of large numbers of people would compound dire problems. REUTERS", "url": "https://www.straitstimes.com/asia/pakistani-minister-defends-decision-to-expel-afghans"}