{"authors": [], "date_download": "2024-10-12 13:47:47", "date_modify": "2024-10-12 13:47:47", "date_publish": "2022-07-11 10:29:07", "description": "The authorities are struggling to contain the worst coronavirus outbreak yet in the world's biggest gambling hub. Read more at straitstimes.com.", "filename": "asia_east-asia_macau-shuts-all-its-casinos-in-race-to-curb-covid-19-spread_1728740867.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/11/ac_casinomacaux2_110722.jpg?VersionId=lCPgNhLjBybQuVpcVE8aWVWhIdCyzkQZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_macau-shuts-all-its-casinos-in-race-to-curb-covid-19-spread_1728740867.html", "title": "Macau shuts all its casinos to curb Covid-19, gaming shares plunge", "title_page": "Macau shuts all its casinos to curb Covid-19, gaming shares plunge | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (REUTERS) - Macau shut all its casinos for the first time in more than two years on Monday (July 11), sending shares in gaming firms tumbling as the authorities struggle to contain the worst coronavirus outbreak yet in the world’s biggest gambling hub.\nThe city’s 30-plus casinos and other businesses will shut for one week and people were ordered to stay at home, though short trips for essential services were allowed.\nPolice will monitor flows of people outside and stringent punishments will be imposed for those who disobey, the government said.\nAlthough many casinos have been effectively closed for the past three weeks with only minimal staffing allowed, the more drastic measures hit investor confidence hard.\nSome analysts predicted that any recovery in gaming revenue might not happen until the end of the third quarter or during the fourth quarter.\n“We would probably need to write off July and likely August as well from the models,” said JP Morgan analyst D.S. Kim.\nShares in Sands China plunged 9 per cent, while shares in Melco International, Wynn Macau, SJM , Galaxy, MGM China dropped between 6 per cent and 7 per cent.\nMacau has recorded around 1,500 Covid-19 infections since mid-June. Around 19,000 people are in mandatory quarantine as the government adheres to China’s zero-Covid-19 policy, which aims to stamp out all outbreaks, running counter to a global trend of trying to coexist with the virus.\nMore than 30 zones in the city that have been deemed high risk are now under lockdown, meaning that no one is allowed to enter or exit for at least five days. While the government said it was not imposing a citywide lockdown, the stringent measures mean Macau is effectively closed.\nCasinos were last shut in Macau in February 2020 for 15 days.\nThe government has previously been hesitant to close casinos due to its mandate to protect jobs. The industry employs most of the population directly and indirectly, and accounts for more than 80 per cent of government revenues.\nFrustration is mounting over the government’s handling of the outbreak. Fights have broken out at testing centres, while some residents have had to queue for more than 20 hours to access healthcare facilities.", "url": "https://www.straitstimes.com/asia/east-asia/macau-shuts-all-its-casinos-in-race-to-curb-covid-19-spread"}