{"authors": ["Lok Jian Wen"], "date_download": "2024-10-12 14:03:47", "date_modify": "2024-10-12 14:03:47", "date_publish": "2023-04-04 15:30:53", "description": "The incident marks the latest episode of unsavoury food terrorism acts in Japan. Read more at straitstimes.com.", "filename": "asia_east-asia_2-arrested-in-osaka-after-diner-used-chopsticks-to-eat-ginger-from-sharing-pot-at-yoshinoya-outlet_1728741827.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/04/sv-yoshinoya-040423_2.jpg?VersionId=d.D7_TG65p6P1sNCNxFo8Fyw_Jxf7AVr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_2-arrested-in-osaka-after-diner-used-chopsticks-to-eat-ginger-from-sharing-pot-at-yoshinoya-outlet_1728741827.html", "title": "2 arrested in Osaka after diner used chopsticks to eat ginger from sharing pot at Yoshinoya outlet", "title_page": "2 arrested in Osaka after diner used chopsticks to eat ginger from sharing pot at Yoshinoya outlet | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The latest “food terrorists” in Japan have been arrested in Osaka after a video showing one of them eating pickled ginger directly from a communal container at beef bowl chain Yoshinoya was posted on social media.\nIn the video, a man is seen using a pair of chopsticks to shove copious amounts of the red shredded ginger, commonly added as a topping for beef rice, from a black container into his mouth.\nConstruction worker Ryu Shimazu, 35, and Toshihide Oka, 34, were charged by local police with forcibly obstructing a business and damage to property, charges both men have admitted to, Japanese media reported.\nShimazu was arrested for conspiring to interfere with the popular eatery’s business by using his chopsticks to eat the ginger meant for all diners directly from a communal container.\nOka, a restaurant owner himself, was arrested as an accomplice after filming the offending act on his smartphone camera.\n“When I asked him to do something interesting, he suddenly (ate the ginger) with his chopsticks,” he told the police during an interview, the authorities said on Tuesday.\n“I wanted to make everyone laugh,” Shimazu admitted in a separate police interview.\nThe video was recorded at a Yoshinoya branch in Osaka’s Suminoe ward around 3am on Sept 29, 2022.\nThe police began investigations only in 2023, after the offending clip was uploaded and circulated later on an undisclosed date. The eatery made a police report in February, more than four months after the incident.\nFounded in 1899, Yoshinoya has outlets in major cities in Japan, and more than 2,700 outlets in other Asian countries and the United States.\n“It was big news that made customers feel uncomfortable and uneasy, with the safety and security of not only our company but also the restaurant as a whole questioned,” a Yoshinoya spokesman told Japanese newspaper Nikkan Sports. “It was very regrettable and I sincerely hope that this kind of thing will not happen again in the future.”\nSeveral incidents dubbed sushi terrorism – unhygienic acts involving food in Japanese restaurants – have led to unrest in Japan, a country with famously high standards of cleanliness, after the acts were filmed and circulated on social media platforms.\nIn March, three people were arrested for pranks, including grabbing sushi with their bare hands and chugging down soya sauce, at a conveyor-belt sushi restaurant in Nagoya, a city 340km west of capital Tokyo.", "url": "https://www.straitstimes.com/asia/east-asia/2-arrested-in-osaka-after-diner-used-chopsticks-to-eat-ginger-from-sharing-pot-at-yoshinoya-outlet"}