{"authors": [], "date_download": "2024-10-12 13:39:44", "date_modify": "2024-10-12 13:39:44", "date_publish": "2024-08-24 07:03:14", "description": "The US said the classified nuclear strategic plan is not a response to a single country or threat. Read more at straitstimes.com.", "filename": "asia_north-korea-says-it-strongly-condemns-us-nuclear-strategic-plan_1728740384.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/24/LYNXMPEK7M0T3-2.jpg?VersionId=v1mwFrxHA8wXGTawJ0O1vkJD1eArBwXX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_north-korea-says-it-strongly-condemns-us-nuclear-strategic-plan_1728740384.html", "title": "North Korea says it strongly condemns US nuclear strategic plan", "title_page": "North Korea says it strongly condemns US nuclear strategic plan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – North Korea expressed serious concern and strongly condemned on Aug 24 a revised nuclear strategic plan approved by US President Joe Biden in 2024.\n“The DPRK will as ever bolster up its strategic strength in every way to control and eliminate all sorts of security challenges that may result from the US dangerous nuclear posture readjustment, and resolutely counter any type of nuclear threat,” its Foreign Ministry said, using North Korea’s official name.\n“Other sovereign states’ efforts for bolstering up their defence capabilities to cope with the ever-increasing nuclear threat from the US can never be a pretext for its nuclear arms build-up for aggression and provocative coordination of nuclear posture,” the ministry added in a statement carried by state media outlet KCNA.\n“No matter how desperately the US may exaggerate the ‘nuclear threat’ from other countries, the DPRK will push forward the building of nuclear force sufficient and reliable enough to firmly defend the sovereignty and security interests of the country on its fixed timetable,” it added.\nThe White House said on Aug 20 that the classified nuclear strategic plan is not a response to a single country or threat, after the New York Times reported that it reoriented the deterrence strategy to focus on China’s expansion of its nuclear arsenal for the first time.\nChina’s Foreign Ministry said on Aug 21 that it was seriously concerned about the report, which said the plan also seeks to prepare the US for possible coordinated nuclear challenges from China, Russia and North Korea. REUTERS", "url": "https://www.straitstimes.com/asia/north-korea-says-it-strongly-condemns-us-nuclear-strategic-plan"}