{"authors": [], "date_download": "2024-10-12 13:37:56", "date_modify": "2024-10-12 13:37:56", "date_publish": "2024-04-04 22:53:00", "description": "LONDON - A 75-year-old man was found guilty on Thursday of the murder of British police officer Sharon Beshenivsky during a bungled armed robbery in 2005. Read more at straitstimes.com.", "filename": "asia_man-found-guilty-of-2005-murder-of-female-british-police-officer-beshenivsky_1728740276.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/04/LYNXNPEK330JG-1.jpg?VersionId=GmC7tbz_SBZh_xrxS75LVEjwpm9SnHn4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_man-found-guilty-of-2005-murder-of-female-british-police-officer-beshenivsky_1728740276.html", "title": "Man found guilty of 2005 murder of female British police officer Beshenivsky", "title_page": "Man found guilty of 2005 murder of female British police officer Beshenivsky | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - A 75-year-old man was found guilty on Thursday of the murder of British police officer Sharon Beshenivsky during a bungled armed robbery in 2005.\nFollowing his extradition to Britain from Pakistan last year, a jury at Leeds Crown Court found Piran Ditta Khan guilty of murder and firearms offences, Britain's Crown Prosecution Service (CPS) said. He had pleaded guilty to robbery at an earlier hearing.\nKhan was mastermind of the gang involved in the botched robbery and the final member to be convicted.\nBeshenivsky, a constable with West Yorkshire Police, died after being shot when trying to stop a gang robbing a travel agent in Bradford, northern England.\nShe was killed aged 38 on the day of her youngest daughter's fourth birthday, becoming the seventh female police officer in Britain to be killed while on duty.\nHer colleague, Teresa Milburn, was shot in the chest and later recovered from her injuries.\nKhan fled to Pakistan after the incident, remaining at large until he was tracked down by Pakistani and British authorities and arrested in 2020. He was brought to Britain in April last year and formally charged with murder, firearms offences and robbery. REUTERS", "url": "https://www.straitstimes.com/asia/man-found-guilty-of-2005-murder-of-female-british-police-officer-beshenivsky"}