{"authors": [], "date_download": "2024-10-12 13:41:00", "date_modify": "2024-10-12 13:41:00", "date_publish": "2024-08-02 13:19:49", "description": "There was no immediate comment from Instagram parent Meta Platforms. Read more at straitstimes.com.", "filename": "asia_turkey-blocks-access-to-instagram-platform-but-gives-no-reasonmost-recent_1728740460.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/FILES-ITALY-US-INTERNET-META-TECHNOLOGY-091246.jpg?VersionId=lyzmu7c.dQLv5.Gf4.SjwVj_DAAdiGg7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_turkey-blocks-access-to-instagram-platform-but-gives-no-reasonmost-recent_1728740460.html", "title": "Turkey blocks access to Instagram platform but gives no reason", "title_page": "Turkey blocks access to Instagram platform but gives no reason | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANKARA - Turkey has blocked access to social media platform Instagram, the infotech regulator said on Aug 2, without stating a reason or duration for the ban, which also left the platform’s mobile app inaccessible.\nThe move follows comments on July 31 by Turkish communications official Fahrettin Altun, criticising the platform for what he called its decision to block condolence posts on the killing of Ismail Haniyeh, a key official of Palestinian militant group Hamas.\n“This is censorship, pure and simple,” Mr Altun, the communications director of the Turkish presidency, said on X, adding that Instagram had not cited any policy violations for its action.\nThere was no immediate comment from Instagram parent Meta Platforms on either the ban or Mr Altun’s comments.\nTurkey’s Information Technologies and Communication Authority published the Aug 2 decision on its website. REUTERS", "url": "https://www.straitstimes.com/asia/turkey-blocks-access-to-instagram-platform-but-gives-no-reasonmost-recent"}