{"authors": [], "date_download": "2024-10-12 13:27:38", "date_modify": "2024-10-12 13:27:38", "date_publish": "2024-08-19 18:28:00", "description": "Healthcare experts and the authorities said an increase in virus cases should not be a cause for fear. Read more at straitstimes.com.", "filename": "asia_east-asia_experts-downplay-south-korea-covid-19-threat-despite-resurgence_1728739658.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/19/IMGSKOREA-LIFESTYLE-16411S0BSBP6.jpg?VersionId=GgTGNWll3J7h1jAhZpwD3MsI1_.gX2AH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_experts-downplay-south-korea-covid-19-threat-despite-resurgence_1728739658.html", "title": "Experts downplay South Korea Covid-19 threat despite resurgence", "title_page": "Experts downplay South Korea Covid-19 threat despite resurgence | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - Covid-19 cases have been trending upwards since the summer wave arrived in South Korea, with more people admitted to hospitals for treatment compared with previous weeks, and the health authorities seeing an increase in Covid-19 levels in wastewater.\nDespite growing concerns about Covid-19’s summer spread, healthcare experts and the authorities said on Aug 19 that an increase in virus cases should not be a cause for fear. Instead, they noted that taking precautions could minimise the potential spread of the virus and protect others from becoming sick.\nProfessor Chun Eun-mi, a lung specialist at Ewha Womans University Medical Centre, noted that the Covid-19 variant KP.3, the dominant strain amid the summer resurgence, has lower toxicity than previous variants.\n“The level of toxicity for KP.3 is much lower than the delta variant of Covid-19. Also, most people now have natural immunity after being infected with the virus, so the virus does not make you critically ill as it did because our bodies have learnt how to manage the virus over the years,” the professor told The Korea Herald.\n“Even if older adults get it, they’re likely to get hospitalised for pneumonia, not more life-threatening conditions,” she explained.\nThe professor noted that the resurgence occurred after people let their guard down against infection.\n“For example, it’s summer season, so it’s natural for people to want to keep their windows closed and turn on the air conditioner, but this means poor ventilation. To tame the spread, people should adhere to preventive measures, such as properly ventilating and wearing masks in public transportation, workplaces and schools,” she added.\n“It sounds corny, but sticking to the most basic things such as maintaining personal hygiene by washing hands, proper coughing etiquette and staying away from family when you have the virus can halt the spread because the virus is not that dangerous,” infectious disease professor Shi Hye-Jin at Gachon University Gil Medical Centre told The Korea Herald.\nIn a radio interview with YTN on Aug 19, Mr Hong Jeong-ik, the head of the Korea Disease Control and Prevention Agency’s infectious disease policy, noted that the number of current Covid-19 patients is only half the figure of August last year.\n“The severity and fatality rates for KP.3 variant is not more dangerous than omicron, so the authorities judged that the summer wave could be handled without escalating measures beyond the current phase,” he said.\nHowever, he warned that the figure could sharply rise in late August, peaking at 350,000 new cases per week, which was the highest level of last year. The number of newly admitted patients for the second week of August came to 1,359 – the highest this year and a twofold increase from 477 in the fourth week of July.\nLater in the day, he told reporters during a regular briefing that the KDCA would closely monitor the resurgence until next month so that it could prepare a response plan for the upcoming Chuseok holiday in September, when families will gather.\nHe also highlighted the importance of following prevention and containment measures to reduce transmission.\n“I would like to advise the public to limit meetings and gatherings that aren’t essential, recover at home when infected and companies should ensure that their employees can take sick leave when needed,” he said. THE KOREA HERALD/ ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/experts-downplay-south-korea-covid-19-threat-despite-resurgence"}