{"authors": [], "date_download": "2024-10-12 13:50:54", "date_modify": "2024-10-12 13:50:54", "date_publish": "2022-10-01 10:21:33", "description": "Japan’s ancient capital is switching from meticulous hospitality to self-care. Read more at straitstimes.com.", "filename": "asia_east-asia_kyoto-wants-you-back-but-it-has-some-polite-suggestions_1728741054.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/01/md_tokyo1_01102022.jpg?VersionId=4pHgvL03Hfrr3OzVJqNmLqKZge69PCO9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_kyoto-wants-you-back-but-it-has-some-polite-suggestions_1728741054.html", "title": "Kyoto wants you back, but it has some polite suggestions", "title_page": "Kyoto wants you back, but it has some polite suggestions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYOTO - In the months before March 2020, the food sellers in Kyoto's Nishiki market often wished for an end to the seemingly endless stream of photo-hungry visitors from abroad who always seemed to be underfoot.\n\"We weren't used to foreign tourists,\" said Mr Nobuyuki Hatsuda, who leads a business alliance promoting the shopping street in the city centre, where vendors sell a dizzying array of traditional Japanese foods, carefully displayed and attractively packaged.\nNishiki has long been a working market, and the parade of visitors - rifling through the meticulously arranged merchandise, haggling with frazzled shopkeepers and blocking storefronts with their luggage - interfered with the flow of daily business, driving away locals who had long done their shopping on the street.\nBut then the pandemic hit. The tourists - along with their money - evaporated, and sellers had a change of heart, said Mr Hatsuda, who sells kamaboko, a fish cake often formed into delicate pink and white loaves.\n\"We realised that we can't choose our customers,\" he said.\nOther than China, Japan had maintained the strictest border controls of any major economy. Since the start of 2021, fewer than 800,000 foreign visitors have set foot in the country.\nAs other countries began welcoming tourists back in numbers close to their pre-pandemic highs, Japan let only a trickle of travellers in. The country eased restrictions on trips for business and study in the spring, but as of September, it was still limiting tourism to travellers on package tours who were willing to negotiate a labyrinth of red tape.\nThat will soon change, however.\nPrime Minister Fumio Kishida said last week that the country would further ease border controls in October, eliminating a cap on daily entries and allowing tourists to travel independently. (Even after normal travel resumes, however, Chinese visitors, who accounted for more than 30 per cent of inbound traffic in 2019, are unlikely to return in large numbers until Beijing relaxes its strict \"zero Covid\" policy.)\nAs tourism slowly returns, Kyoto, like other famous tourist destinations worldwide, is grappling with how to accommodate the crowds without sacrificing quality of life for those who call the ancient capital home.\nIn the absence of a clear solution, Kyoto's government is betting on a change of perspective: After years of promoting \"omotenashi\" - a Japanese word for meticulous hospitality - it's trying to take more time for self-care.\n\"Kyoto isn't a tourist city, it's a city that values tourism,\" Mr Daisaku Kadokawa, the city's mayor, said during a recent interview at its city hall, where he wore the formal kimono that has become a trademark during his almost 15 years in office.\nGrowing popularity\nKyoto is home to several globally known companies such as Nintendo and Kyocera, and has produced more Nobel Prize winners in the sciences than any other city in Japan. But in the years leading up to the pandemic, it had become dependent on the flood of tourists that bumped, clattered and pushed through its streets.\nStarting from a base of around 10 million in 2013, the number of foreign visitors had more than tripled by the pandemic's start, according to government data. Nearly a third of them travelled to Kyoto, where the tourism industry employed one of every five workers.\nTaxes from the sector comprised nearly 13 per cent of the city's revenue. But locals quickly became fed up with what they called \"tourism pollution\". Suitcases jammed the aisles of city buses. Eager visitors harassed geisha's apprentices, maiko, for photographs on their way to work. And lost tourists stumbled into people's homes while searching for their Airbnbs.\nSocial media, especially, shaped tourism in the city. And not for the better.\nMr Masutami Kawaguchi, who offers private English tours of the city, said that - before the pandemic - his clients' itineraries were almost entirely determined by Instagram. Tourism became laser-focused on the city's famously picturesque areas, with people getting off the train at Kyoto Station and then rushing to the two or three best photo spots - the bamboo groves of Arashiyama, the orange gates winding up the mountain behind Fushimi Inari shrine and the golden pavilion at Kinkakuji temple - creating traffic jams and massive crowding in the surrounding areas.\nKyoto's famously polite residents began to express their displeasure with uncharacteristic bluntness.\nIn Nishiki, signs popped up among the stalls admonishing tourists not to eat while walking, a pet peeve in Japan. Neighbourhood shoppers, tired of the crowding and commotion, began going to supermarkets, and some long-established sellers closed. Even Buddhist monks lost their cool.\n\"Before we knew it, the economy was nothing but tourism,\" said Mr Kojo Nagasawa, the secretary-general of the Kyoto Buddhist Federation, which includes three of the city's most famous temples. \"The city didn't know when enough was enough.\"\nLooking to curb some of the worst problems, in 2018 the city cracked down on investors who were snatching up traditional houses in residential neighbourhoods and converting them into Airbnb rentals.\nThe pandemic's damage\nIn spring 2020, Japan slammed its borders shut. The fire hose of foreign money turned off, and Kyoto, which has long struggled with financial problems, found itself on the verge of bankruptcy.\nThe city got a taste of life without tourists, and the combination of the coronavirus and red ink was \"a double punch\", Mr Kadokawa, the mayor, said.\nAt the beginning of the pandemic, \"people in the city were saying, 'We've returned to the old Kyoto, isn't that great?'\" said Mr Toshinori Tsuchihashi, the director of the city's tourism department.\nBut, as the economic damage mounted, residents \"have come to recognise tourism's importance.\"\nMany businesses have yet to recover. Before the pandemic, it was nearly impossible to get a reservation at one of the many restaurants lining Pontocho, an atmospheric alleyway running parallel to the Kamo River in Kyoto's city centre. But on a recent weekend night, \"for lease\" signs hung in darkened shop windows, and many of the terraces looking out on the water sat unused.", "url": "https://www.straitstimes.com/asia/east-asia/kyoto-wants-you-back-but-it-has-some-polite-suggestions"}