{"authors": [], "date_download": "2024-10-12 13:50:04", "date_modify": "2024-10-12 13:50:04", "date_publish": "2024-08-30 03:33:54", "description": "Pavel Durov is under formal investigation in France. Read more at straitstimes.com.", "filename": "asia_french-president-macron-says-he-was-not-aware-of-telegrams-durovs-arrival-in-france_1728741004.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/30/11572013.jpg?VersionId=R7PltB0s90Vi.SgvwgGktZFF2q5WLdxT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_french-president-macron-says-he-was-not-aware-of-telegrams-durovs-arrival-in-france_1728741004.html", "title": "Macron says he was not aware of Telegram founder’s arrival in France", "title_page": "Macron says he was not aware of Telegram founder’s arrival in France | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BELGRADE – French President Emmanuel Macron was not aware of Telegram owner Pavel Durov’s arrival in France on Aug 24 and had not been scheduled to meet him, he told a news conference on Aug 29 during a two-day visit to Serbia.\n“I was absolutely unaware of Mr Durov’s arrival in France and that is quite normal because I’m not aware of the comings and goings of citizens from all over the world, whether they have French citizenship or not,” Mr Macron said.\nDurov was arrested by the French police after his jet landed at an airport near Paris.\nOn Aug 28, a French judge put Durov, who has French and United Arab Emirates citizenship, under formal investigation for suspected complicity in running an online platform that allows illicit transactions, child sex abuse images, drug trafficking and fraud.\nMr Macron also defended France’s decision in 2021 to give Durov French citizenship under a rare procedure for high-profile individuals.\n“It’s part of a strategy to allow women and men, whether artists, athletes or entrepreneurs, when they make the effort to learn the French language and that they develop wealth, innovation... to be given French nationality,” he said. REUTERS", "url": "https://www.straitstimes.com/asia/french-president-macron-says-he-was-not-aware-of-telegrams-durovs-arrival-in-france"}