{"authors": [], "date_download": "2024-10-12 13:46:58", "date_modify": "2024-10-12 13:46:58", "date_publish": "2020-01-23 10:49:58", "description": "Within hours of the travel restrictions being announced, hundreds of cars queued at a toll booth for a highway out of the city. Read more at straitstimes.com.", "filename": "asia_east-asia_wuhan-virus-inside-chinas-ground-zero-unease-grips-a-city-in-lockdown_1728740818.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/FDvh-gDNF-nHh32aT7yRkMGOkyU6LVfd1ONe-2YivxM.jpg?VersionId=Ov5yEPf62Vg9s6Xkgjj2Hx5wTcDZX_j2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_wuhan-virus-inside-chinas-ground-zero-unease-grips-a-city-in-lockdown_1728740818.html", "title": "Coronavirus: Inside China's ground zero, unease grips a city of 11 million in lockdown", "title_page": "Coronavirus: Inside China's ground zero, unease grips a city of 11 million in lockdown | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WUHAN (BLOOMBERG) - In Wuhan, the central Chinese city that's ground zero of the deadly new virus spreading through the country, a sense of fear is rapidly taking hold.\nOn Thursday (Jan 23) morning, the city's some 11 million residents woke to learn they were now in lockdown, with public transport halted, flights out cancelled and trains not running right on the eve of the Chinese New Year holiday that traditionally unites families for days of feasting.\nIt is a dramatic escalation for Wuhan, which has found itself at the epicentre of a potentially global health crisis after a market selling freshly slaughtered meat and live animals was identified as the source of an outbreak that has killed 18 people and sickened hundreds.\nThe outbreak has residents questioning their every move.\nStudent Yi Zixuan is terrified that a meal on Sunday with friends near a hospital may have exposed her to the new coronavirus, which causes pneumonia in those infected.\n\"I didn't wear a mask,\" said Ms Yi, 21. \"I've cancelled a trip to Changsha during the Lunar New Year holiday and I'm even cancelling my plans to watch movies at the cinema. I'll try to stay home as much as I can.\"\nWith the death toll from the virus rising markedly last weekend, and more cases identified, life in Wuhan has gone from normal to fraught in a matter of days. Within hours of the travel restrictions being announced, hundreds of cars queued in barely moving traffic at a toll booth for a highway out of the city.\nHome to a bustling port on the Yangtze River, Wuhan is a transport hub for central China, with a number of high-speed rail lines converging there. A former British settlement, it still retains architecture from that period, with steel and car manufacturing among the main employers.\nMs Yi said that when she left home on Monday morning, about 20 per cent of people wore protective face masks; by evening, she estimated the number had soared to about 80 per cent.\nFor Wuhan native Guo Zirui, that means an unusual separation. One of the 21-year-old student's parents works at a local hospital so he says his family decided to send him back to his dormitory in Beijing, where he is studying at Tsinghua University.\n\"The hospital is not a hotel so medical staff have to go back home after work,\" he said, speaking by mobile phone from Wuhan railway station on his way back to the capital on Wednesday afternoon. \"The situation is still unclear and we don't know if it's safe for me to keep staying in Wuhan.\"\nThe Chinese New Year holiday - when hundreds of millions of people are set to travel in the biggest annual migration of humans on the planet - is providing a significant challenge for Chinese authorities striving to contain the outbreak that has also infected people from Thailand to the United States.\nOn Wednesday, China announced a stepping up of controls at transport points across the country and increased screening of travellers. But officials admitted there is much they don't know about the new virus, which belongs to the same family of bugs as Sars, a respiratory outbreak that killed about 800 people 17 years ago.", "url": "https://www.straitstimes.com/asia/east-asia/wuhan-virus-inside-chinas-ground-zero-unease-grips-a-city-in-lockdown"}