{"authors": [], "date_download": "2024-10-12 14:21:28", "date_modify": "2024-10-12 14:21:28", "date_publish": "2023-03-28 16:03:32", "description": "The operation will aim to safeguard the legitimate rights and interests of enterprises and entrepreneurs online. Read more at straitstimes.com.", "filename": "asia_east-asia_china-to-crackdown-on-malicious-online-comments-damaging-reputation-of-businesses_1728742888.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/28/2023-03-01T053337Z471809958RC2SKZ9BHHERRTRMADP3CHINA-DATA_0.JPG?VersionId=oC6JWmBogLcWZMJutKXMiNzJWpE4PPkr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-to-crackdown-on-malicious-online-comments-damaging-reputation-of-businesses_1728742888.html", "title": "China to crackdown on malicious online comments damaging reputation of businesses", "title_page": "China to crackdown on malicious online comments damaging reputation of businesses | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China’s cyberspace regulator vowed on Tuesday to clamp down on malicious online comments that damage the reputation of businesses and entrepreneurs, amid an official drive to shore up the private sector and spur economic growth.\n“False information against enterprises and entrepreneurs, especially private enterprises and private entrepreneurs, appear from time to time, damaging the brand image of enterprises,” said official Shen Yue, with the Cyberspace Administration of China, when answering a question at a news briefing.\nThe official said it also affects normal production and operation of enterprises, resulting in economic losses.\nThe regulator will “severely crackdown on illegal online activities that maliciously damage the image and reputation of enterprises and entrepreneurs, and even seek illegal benefits from them”, said the official.\nThe operation will aim to safeguard the legitimate rights and interests of enterprises and entrepreneurs online, and control “the online chaos of fabricating and spreading false information”.\nThe authorities will deal with false online information related to enterprises in a timely manner in accordance with laws and regulations, and deal with online infringements involving entrepreneurs, said the official.\nChinese leaders have in recent weeks repeatedly offered assurances to private firms in a bid to shore up their confidence after a bruising two-year regulatory crackdown.\nAlibaba founder Jack Ma has returned to China, ending a stay overseas of more than a year that industry viewed as reflecting the sombre mood of its private businesses and which sources said eventually spurred the new premier to reach out.\nNew Chinese Premier Li Qiang, in his first media conference earlier in March, sought to reassure the private sector, saying the environment for entrepreneurial businesses would improve and that equal treatment would be given to all types of companies.\nMr Li said some “incorrect” comments in society about private firms had made entrepreneurs feel nervous. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/china-to-crackdown-on-malicious-online-comments-damaging-reputation-of-businesses"}