{"authors": [], "date_download": "2024-10-12 13:59:44", "date_modify": "2024-10-12 13:59:44", "date_publish": "2022-11-09 07:48:35", "description": "The review will look into the obligations that former Defence Force personnel have to protect state secrets. Read more at straitstimes.com.", "filename": "asia_australianz_australia-launches-review-into-former-pilots-training-chinese-military_1728741584.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/09/10149765_2.jpg?VersionId=1lut3lO6tNynwscU1jpWOAghSDFwLL3E", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australia-launches-review-into-former-pilots-training-chinese-military_1728741584.html", "title": "Australia launches review into former pilots training Chinese military", "title_page": "Australia launches review into former pilots training Chinese military | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Australia will launch a review into the obligations former Defence Force personnel have to protect state secrets, following reports that Australians were among the Western military pilots who had been approached to help train the Chinese military.\nDefence Minister Richard Marles said on Wednesday the intelligence agencies and Australian Federal Police were “investigating a number of cases” in Australia, and announced a review into the policies and procedures governing Australian Defence Force personnel.\n“For those who do come into possession of our nation’s secrets either through service in the Australian Defence Force or service in any other part of the Commonwealth, there is an enduring obligation to maintain those secrets,” he told a media conference.\n“It’s important that we have the most robust framework possible that is in place to protect Australia’s information and protect our secrets.”\nBritain has said it would change its national security laws to stop former military pilots being recruited by third-party agencies to work in China, after reports up to 30 pilots had trained the Chinese military.\nBritish media reports have focused on the Test Flying Academy of South Africa, which responded in a statement on its website saying it “strongly believes that its actions, and those of its employees, do not contravene any UK laws”.\nNew Zealand’s defence minister has also requested advice from the NZ Defence Force on whether it needs to implement laws to stop former New Zealand military pilots travelling overseas to train pilots of foreign militaries, a spokeswoman from the prime minister’s office said.\nFour former New Zealand defence personnel worked for the South African flight training school.\nAn Australian citizen, Daniel Edmund Duggan, was arrested in New South Wales state in the same week that Britain announced the crackdown on former military pilots. Duggan, a former US Marines Corp pilot, is facing likely extradition to the United States on undisclosed charges.\nHis lawyer says Duggan denies breaching any US or Australian law. Details of the US arrest warrant and the charges he faces are sealed.\nReuters reported Duggan worked in Beijing from 2014, listing the same Beijing address as a Chinese businessman jailed in the United States for conspiring to hack US defence contractors’ computers.\nAn Australian parliament hearing was told by defence officials on Wednesday it cost more than A$15 million (S$13.6 million) to train a jet fighter pilot, and any disclosure of official information by a pilot to an unauthorised person after they had left the defence force was an offence.\n“Foreign actors will target our people for the unique skills they have,” said Ms Celia Perkins, the defence department’s deputy secretary for security. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/australia-launches-review-into-former-pilots-training-chinese-military"}