{"authors": [], "date_download": "2024-10-12 14:04:58", "date_modify": "2024-10-12 14:04:58", "date_publish": "2023-01-31 07:20:51", "description": "Anwar said the Wall Street firm should not use its financial strength to dictate terms.   Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-pm-anwar-tells-goldman-sachs-to-pay-up-on-1mdb-settlement_1728741898.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/31/2023-01-22T172206Z1442403330RC2SVY9BSAUBRTRMADP3GOLDMAN-SACHS-FUND_3.JPG?VersionId=aJFXVAvoUI0c.tdxQu7lj7iJVjM3llb6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-pm-anwar-tells-goldman-sachs-to-pay-up-on-1mdb-settlement_1728741898.html", "title": "Malaysian PM Anwar tells Goldman Sachs to pay up on 1MDB settlement", "title_page": "Malaysian PM Anwar tells Goldman Sachs to pay up on 1MDB settlement | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Malaysian Prime Minister Anwar Ibrahim demanded that Goldman Sachs Group honour its settlement with the government for its role in the 1Malaysia Development Berhad (1MDB) scandal, saying the Wall Street firm should not use its financial strength to dictate terms.\nThe abuse of the sovereign state fund was made possible because of “complicity” from institutions such as Goldman Sachs, Datuk Seri Anwar told Bloomberg Television’s Haslinda Amin in his first interview with international media since becoming Prime Minister.\n“My only appeal is for them to settle this deal with Malaysia because 1MDB is known throughout the world,” Mr Anwar said on Monday in Singapore. “It is there in the books, and I think that Goldman Sachs should come out clean and deal with Malaysia.”\nState development fund 1MDB became the centre of a multibillion-dollar scandal that spawned probes in Asia, the United States and Europe.\nGoldman Sachs in 2020 admitted its role in the biggest foreign bribery case in US enforcement history, reaching multiple international settlements in the billions of dollars to end probes into its fund-raising for 1MDB.\nThe Malaysian government in 2018 turned its attention to Goldman Sachs for its work raising US$6.5 billion (S$8.54 billion) in 2012 and 2013 for 1MDB.\nThe bonds were earmarked for redevelopment, but all but US$2 billion of the money was diverted to pay bribes to government officials, US federal prosecutors said.\nThe authorities spent years tracking funds that allegedly flowed from 1MDB into high-end art and real estate, a super-yacht and, ironically, the hit Hollywood movie The Wolf Of Wall Street (2013), chronicling an earlier era of financial crimes.\nThe settlement announced in July 2020 called for Goldman Sachs to pay US$2.5 billion while guaranteeing the return of US$1.4 billion of 1MDB assets seized by the authorities around the world, in exchange for Malaysia dropping charges against the bank.\nGoldman must also make a one-time interim payment of US$250 million if Malaysia has not received at least US$500 million in assets and proceeds by August 2022, according to the bank.\nHowever, the two disagree over whether the government had received the US$500 million in proceeds by the August deadline, Goldman Sachs said in a filing in 2022.\nThe bank in the filing had also accused Malaysia of having “unilaterally reduced” the value of one asset by US$80 million, while declining to include substantial additional assets in accounting of assets and proceeds recovered.\n“Given a fair deal, we are supposed to be paid much more than that,” said Mr Anwar in response to Goldman’s claims. “I’m new in the game. I just want to settle old scores, in the sense of old commitments that we have made. We have to move on.”", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-pm-anwar-tells-goldman-sachs-to-pay-up-on-1mdb-settlement"}