{"authors": [], "date_download": "2024-10-12 14:15:17", "date_modify": "2024-10-12 14:15:17", "date_publish": "2022-04-08 14:30:43", "description": "The financial hub on Friday announced a record 21,000 new cases and a third consecutive day of Covid-19 testing. Read more at straitstimes.com.", "filename": "asia_east-asia_containers-pile-up-at-shanghai-port-as-covid-19-lockdown-blocks-trucks_1728742517.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/08/AK_chcon_080422.jpg?VersionId=1MLgK2ovMiQJxdLb3DpHFhCBp2I1miYh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_containers-pile-up-at-shanghai-port-as-covid-19-lockdown-blocks-trucks_1728742517.html", "title": "Shanghai lockdown snarls world’s busiest port and China supply chains", "title_page": "Shanghai lockdown snarls world’s busiest port and China supply chains | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (AFP, REUTERS) – Shanghai’s grinding coronavirus lockdown is slowly clogging China’s supply chains, as delays hit the world’s busiest container port where staff are tangled in a morass of Covid-19 controls.\nBeijing has refused to tack away from its strict zero-Covid strategy that has protected its public health system through the pandemic but at a mounting economic cost.\nChina’s financial hub Shanghai – home to multinational firms and its busiest port – has been sealed off almost entirely for a week following an outbreak fuelled by the Omicron virus variant.\nThat has forced many companies to halt production and slow new projects, factories told AFP, while those still operating are struggling with a shortage of truck drivers on top of onerous permit and Covid-19 testing requirements.\nAt Shanghai’s port, the lack of drivers and other workers means getting goods in and out is increasingly hard.\nThe docks are working normally with a “single-digit” number of vessels waiting to berth, Shanghai International Port Group said this week.\n“But the fact is... due to restrictions caused for truck drivers, it is not really operating,” Ms Bettina Schoen-Behanzin, vice president of the EU Chamber of Commerce’s Shanghai Chapter, told AFP.\n“The figure I heard is that... week-on-week volumes at the Shanghai port are down by 40 per cent. So that’s really enormous.”\nShortages are starting to bite across China’s vast consumer economy, where online shopping platforms such as Taobao face delivery delays, especially of imported goods.\nCovid-19 curbs in a number of cities have forced factories to find new suppliers.\nBut the impact may soon also be felt outside China if lockdowns persist.\nShanghai is the world’s number one container port, a spinal point in the global supply chain and a key gateway for foreign trade.\nIt handles around 17 per cent of China’s total port volume and shipped 47 million TEU – the standard measurement for cargo, meaning Twenty-foot Equivalent Unit – in 2021.\nFactories can’t work from home\nChinese manufacturers say lockdowns, no matter how flexible or targeted, pile pressure on their business.\n“Not many roles allow working from home,” said Mr Jason Lee, founder of wheelchair producer Megalicht Tech, whose factory in Shanghai’s Puxi area has suspended production.\n“People can’t enter the factory... and because our raw materials come from other provinces or cities, these can’t enter Shanghai either,” he said.", "url": "https://www.straitstimes.com/asia/east-asia/containers-pile-up-at-shanghai-port-as-covid-19-lockdown-blocks-trucks"}