{"authors": [], "date_download": "2024-10-12 13:47:04", "date_modify": "2024-10-12 13:47:04", "date_publish": "2024-05-27 15:32:15", "description": "They are caught between the junta and a powerful ethnic army. Read more at straitstimes.com.", "filename": "asia_myanmars-rohingya-in-the-crosshairs-as-fighting-escalates-in-rakhine_1728740824.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/27/2024-04-13T035919Z328883457RC2D57A6HYV1RTRMADP3THAILAND-MYANMAR-BORDER.JPG?VersionId=j4VpBcGiK5YZhjQa1HV8wCGo3iYB8RCb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_myanmars-rohingya-in-the-crosshairs-as-fighting-escalates-in-rakhine_1728740824.html", "title": "Myanmar’s Rohingya in the cross hairs as fighting escalates in Rakhine", "title_page": "Myanmar’s Rohingya in the cross hairs as fighting escalates in Rakhine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NAYPYITAW – Myanmar’s Muslim-minority Rohingya community is once again under the threat of attacks and displacement as fighting between a powerful ethnic army and the country’s ruling junta escalates in the western state of Rakhine, according to the United Nations and aid agencies.\nTens of thousands of Rohingya are estimated to have fled for safety towards neighbouring Bangladesh since mid-May, which is reluctant to accept more refugees, and many of those remaining in Rakhine are in dire need of humanitarian aid.\nThe Arakan Army (AA) claimed control of Buthidaung town earlier in May, following fighting during which the ethnic army was accused of singling out Rohingya community members. AA denies the charges.\nAA is now bearing down on the border town of Maungdaw, also home to a large Rohingya population, that the Myanmar junta will likely attempt to hold, raising the spectre of more serious violence.\n“We see clear and present risks of a serious expansion of violence as the battle for neighbouring Maungdaw town has begun, where the military maintains outposts and where a large Rohingya community lives,” said a spokesman for the UN High Commissioner for Human Rights.\nThe Rohingya have faced decades of persecution and, after a 2017 crackdown by the military, nearly one million fled to Bangladesh, where many now live in crowded refugee camps.\nMr Mohammed Taher, a Rohingya refugee in Bangladesh, said he recently spoke to a friend in Maungdaw, who said the community was living in fear.\n“Many want to flee from Rakhine, but Bangladesh is not opening its door for Rohingya,” Mr Taher said.\nRecent fighting has forced some 45,000 Rohingya to flee to an area along the Naf River on the border, according to a UN estimate.\nA senior Bangladesh border guard official told Reuters last week: “No Rohingya will be allowed to enter Bangladesh.”\nMyanmar has been in turmoil since a 2021 military coup, which spurred a grassroots armed resistance that is fighting the junta alongside long-established ethnic minority rebel groups.\n‘Caught in the middle’\nThe fighting in Rakhine broke out last November when a ceasefire between the AA and the junta collapsed, leading to a string of battlefield successes for the rebels.\nMr Morgan Michaels from the International Institute for Strategic Studies said in a May report: “Faced with mounting losses in Rakhine, the regime has resorted to arming members of the Rohingya ethnic minority to counter the Arakan Army’s advance.\n“The AA has reacted with inflammatory rhetoric and violence directed at the Rohingya.”\nAmid the renewed conflict, Rohingya civilians are “increasingly being caught in the middle”, said the UN Office for the Coordination of Humanitarian Affairs in its latest report last week.\nThe agency estimates that over 350,000 people are displaced across Rakhine after years of conflict, many of whom do not have access to basic services.\nMedical charity Medecins Sans Frontieres said: “We are witnessing a near-total absence of humanitarian assistance for communities who rely on it.” It added that hospitals in Buthidaung and Maungdaw were closed.\nAA, which has a goal to form an autonomous state, has warned that more battles are coming, asking civilians in Buthidaung, Maungdaw and Thandwe to dig bomb shelters or evacuate to safer areas.\nThe group, which has denied it targeted the Rohingya, has also asked for international aid for some 200,000 internally displaced people that it says are sheltering in areas under its control in Buthidaung and Maungdaw.\nMr Scot Marciel, a former US ambassador to Myanmar, said: “The situation is incredibly fraught and dangerous.\n“In some ways, this is an early test of whether a post-military rule Rakhine state with significant autonomy can work.” REUTERS", "url": "https://www.straitstimes.com/asia/myanmars-rohingya-in-the-crosshairs-as-fighting-escalates-in-rakhine"}