{"authors": [], "date_download": "2024-10-12 13:38:14", "date_modify": "2024-10-12 13:38:14", "date_publish": "2024-05-14 21:17:37", "description": "A trade war is under way, and Europe needs to adapt, says Italy’s economy minister. Read more at straitstimes.com.", "filename": "asia_g7-to-discuss-global-trade-risks-after-us-tariffs-on-china_1728740294.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/14/LYNXMPEK4D0IR-1.jpg?VersionId=kTEIiSjbXF1Fd_oFReL159Uue07c7NoH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_g7-to-discuss-global-trade-risks-after-us-tariffs-on-china_1728740294.html", "title": "G-7 to discuss global trade risks after US tariffs on China", "title_page": "G-7 to discuss global trade risks after US tariffs on China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME – The Group of Seven (G-7) major democracies meeting in Italy next week will discuss the risk of fragmentation in global trade after the United States imposed “very tough” tariffs against China.\nUS President Joe Biden unveiled this week a bundle of steep tariff increases on an array of Chinese imports, including electric vehicle (EV) batteries, computer chips and medical products, risking an election-year standoff with Beijing in a bid to woo voters who give his economic policies low marks.\nThe meeting on May 24 to 25 among the G-7 finance ministers in the northern Italian town of Stresa will reflect on the “fragmentation of global trade, with the latest moves by the American government which has shown its cards with very tough measures against China”, Italian Economy Minister Giancarlo Giorgetti said on May 14.\n“The world, as we have known it, is finishing,” Mr Giorgetti said, adding that “a trade war is under way which reflects geopolitical tensions”, and Europe still needs to carve out its own role in the evolving scenario.\nAnother item on the agenda for the meeting will be how to use frozen Russian assets seized after Moscow’s invasion of Ukraine.\nThe G-7 froze around US$300 billion (S$406 billion) worth of financial assets soon after Moscow’s attack in February 2022. Since then, the European Union and other G-7 countries have debated how and whether to use the funds to help Ukraine.\nUS proposals to use them to directly fund Ukraine in the war would have “quite serious legal implications”, which still need clarifying, said Mr Giorgetti, who will host the Stresa meeting as Italy holds the rotating presidency of the G-7.\nThe US has proposed seizing the assets in their entirety, but Europe has baulked, citing risks to the euro and massive legal repercussions.\nMore recently, Washington has pushed for using the assets as collateral to provide loans for Ukraine. REUTERS", "url": "https://www.straitstimes.com/asia/g7-to-discuss-global-trade-risks-after-us-tariffs-on-china"}