{"authors": [], "date_download": "2024-10-12 14:06:47", "date_modify": "2024-10-12 14:06:47", "date_publish": "2018-05-14 11:33:31", "description": "PUTRAJAYA (THE STAR/ ASIA NEWS NETWORK) - Prime Minister Mahathir Mohamad has arrived to chair a meeting with ministry secretaries-general to explain the functions and roles of the new government on Monday (May 14). Read more at straitstimes.com.", "filename": "asia_se-asia_mahathir-kicks-off-official-duty-as-new-malaysian-pm-with-govt-top-brass-meeting_1728742007.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/05/14/as-drm1-1405.jpg?VersionId=Patehjcda2gd8ba0C488ZsD5Bqc2Qn3Y", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_mahathir-kicks-off-official-duty-as-new-malaysian-pm-with-govt-top-brass-meeting_1728742007.html", "title": "Mahathir kicks off official duty as new Malaysian PM with govt top brass meeting", "title_page": "Mahathir kicks off official duty as new Malaysian PM with govt top brass meeting | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PUTRAJAYA (THE STAR/ASIA NEWS NETWORK) - Prime Minister Mahathir Mohamad arrived on Monday (May 14) to chair a meeting with ministry secretaries-general to explain the functions and roles of the new government.\nHe was seen arriving in a black Proton Perdana at 9.10am at the Yayasan Perdana Leadership Foundation in Malaysia.\nEarlier, the Chief Secretary to the Government Ali Hamsa's official car was also seen arriving at the foundation at about 8.30am.\nThree ministerial positions have already been announced - Parti Pribumi Bersatu Malaysia president Muhyiddin Yassin as the Home Minister, Democratic Action Party secretary-general Lim Guan Eng as Finance Minister and Parti Amanah Negara president Mohamad Sabu as Defence Minister.\nParti Keadilan Rakyat president Wan Azizah Wan Ismail has also been named Deputy Prime Minister.\nTun Dr Mahathir is also scheduled to meet the Sultan of Brunei, Sultan Hassanal Bolkiah, in the same location at noon.", "url": "https://www.straitstimes.com/asia/se-asia/mahathir-kicks-off-official-duty-as-new-malaysian-pm-with-govt-top-brass-meeting"}