{"authors": [], "date_download": "2024-10-12 14:13:28", "date_modify": "2024-10-12 14:13:28", "date_publish": "2022-10-20 12:44:48", "description": "The city of Ningbo will give hukou to home buyers to address housing slump and slowing population growth. Read more at straitstimes.com.", "filename": "asia_east-asia_china-city-eases-rules-to-address-population-property-slowdown_1728742408.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/20/2022-10-14T060417Z600529227RC2EFV94VQ79RTRMADP3CHINA-CONGRESS-PROPERTY_1.JPG?VersionId=2m09h2u4LyY3AdnPE.reQXXeeatRfmMt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-city-eases-rules-to-address-population-property-slowdown_1728742408.html", "title": "China city eases rules to address population, property slowdown", "title_page": "China city eases rules to address population, property slowdown | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – A Chinese city near Shanghai has relaxed rules to allow property owners to become permanent residents, a move that may help to address a housing slump and slowing population growth.\nThe eastern city of Ningbo will give so-called hukou, a passport-style regional permit allowing access to better medical and education resources, to anyone who purchased properties there, according to a rule posted on the local government’s website last week. The previous rule required applicants to work in the city.\nThe move may add to incentives to purchase a home in the city, where property sales are plunging in tandem with a nationwide rout. It could also help Ningbo maintain residents as China’s population is poised to peak this year, weighing on demand and economic growth prospects.\nHome sales in Ningbo plunged 58 per cent by area in the first three quarters, steeper than a 46 per cent average seen in similar cities, according to China Real Estate Information Corp. data. Second-hand home prices fell the most in more than seven years in the city in August, government figures show.\nNingbo’s population is also under strain. Births in the city plunged 12 per cent in the first half from a year earlier, authorities said in August, forecasting a 10 per cent drop for the full year.\nSince 2019, China has promoted freer movement of labour to cushion slowing growth, including by easing the hukou system. For cities with more than 5 million people, such as Ningbo, the system will be simplified, the State Council has said.\nNingbo, home to the world’s third-largest container port, also plans to grant hukou to tenants who have rented apartments for a year, shortening the prerequisite from two years previously, according to the new rules.\nChina’s home sales have been falling for more than a year, hurt by a crackdown on leverage and the nation’s Covid Zero policy. Sales of new homes by the 100 biggest real estate developers dropped 25.4 per cent in September from a year earlier, CRIC figures show. BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/china-city-eases-rules-to-address-population-property-slowdown"}