{"authors": ["Walter Sim"], "date_download": "2024-10-12 13:47:33", "date_modify": "2024-10-12 13:47:33", "date_publish": "2022-06-22 18:23:36", "description": "Japan's inflation stood at 2.1 per cent in April, rising above 2 per cent for the first time since 2015. Read more at straitstimes.com.", "filename": "asia_east-asia_inflation-weakening-yen-set-to-be-top-issues-in-japan-upper-house-election_1728740853.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/22/nf-jap-220622.jpg?VersionId=6hlt4bXcmrynR8Z9nn4ItLNitjC7weaU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_inflation-weakening-yen-set-to-be-top-issues-in-japan-upper-house-election_1728740853.html", "title": "Inflation, weakening yen set to be top issues in Japan Upper House election", "title_page": "Inflation, weakening yen set to be top issues in Japan Upper House election | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - Rising inflation and a fast-depreciating yen are likely to be the key issues as Japan goes to the polls on July 10 in an Upper House election.\nInflation stood at 2.1 per cent in April, rising above 2 per cent for the first time since 2015.\nWhile tepid by the standards of many countries, this is acutely felt in Japan, where wages have remained stagnant and government policies to encourage companies to raise salaries have been largely ineffective.\nThe average price of cooking oil jumped 1.5 times in May from a year earlier, while a survey this month showed that the price of more than 10,000 food items have either risen or will go up this year by an average of 13 per cent.\nThe rapid depreciation of the yen, which fell to a 24-year low of 136.74 against the greenback in New York trading on Tuesday (June 21), has also increased the cost of imported products.\nA survey by the Nikkei newspaper published on Tuesday also showed that three in four restaurant operators in Japan plan to raise prices.\nSeven in 10 respondents in a public opinion poll by the Nikkei last weekend said they did not approve of how Prime Minister Fumio Kishida is handling inflation.\nAnother survey by the Mainichi newspaper last weekend also found that two in three respondents were \"having trouble making ends meet\".\nDr Sota Kato, a former economy ministry bureaucrat turned research director at the Tokyo Foundation for Policy Research think tank, told The Straits Times: \"The biggest issue tends to be linked to the wallets of voters.\n\"But political parties tend to campaign on pork-barrel politics and hence, rather than big-picture fiscal and monetary policy debates, will try to score votes by pledging hefty subsidies or even a reduction of the consumption tax.\"", "url": "https://www.straitstimes.com/asia/east-asia/inflation-weakening-yen-set-to-be-top-issues-in-japan-upper-house-election"}