{"authors": [], "date_download": "2024-10-12 14:07:31", "date_modify": "2024-10-12 14:07:31", "date_publish": "2024-07-06 13:41:00", "description": "The US DOJ signed a confidential pact with Jho Low to reach a global settlement for asset forfeiture. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-to-focus-on-repatriating-assets-bought-using-1mdb-funds_1728742051.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/06/FW1388772PTJ0223052024KDN.JPG?VersionId=WpXW.JIqTyfprZH.wd3KsQ68U6j6ZyvK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-to-focus-on-repatriating-assets-bought-using-1mdb-funds_1728742051.html", "title": "Malaysia to focus on repatriating assets bought using 1MDB funds", "title_page": "Malaysia to focus on repatriating assets bought using 1MDB funds | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PUTRAJAYA – The Malaysian federal government is focusing on repatriating assets wrongfully bought using 1Malaysia Development Berhad (1MDB) funds, said Home Minister Saifuddin Nasution Ismail.\nHe said his ministry was aware of a recent deal between the US Department of Justice (DOJ) and fugitive financier Low Taek Jho, better known as Jho Low.\n“The deal is a matter dealt with by the US DOJ, and it involves returning 1MDB assets to the DOJ,” Datuk Seri Saifuddin said at a press conference after attending the police’s community safety run at Dataran Putrajaya on July 6.\n“If it involves our country’s assets, our focus will be on asset repatriation.”\nHe was asked to comment on the deal between the DOJ and Low, which involved the latter returning assets and items bought using 1MDB funds.\nWhen asked whether the deal would affect the hunt for and investigation into Low, Mr Saifuddin said the government’s focus would be on asset repatriation.\n“That is our priority at the moment,” he said.\nHe added that the repatriation of 1MDB assets and funds has been conducted since the time of previous administrations.\nAccording to CNA, the DOJ signed a confidential agreement with Low to reach a global settlement for the years-long asset forfeiture campaign.\nCiting records it had viewed, CNA said the global settlement agreement would “forever (resolve) the United States’ civil, criminal and administrative asset forfeiture actions or proceedings relating to the disposition” of assets tied to state fund 1MDB.\nIt was reported that the DOJ signed a confidential agreement in early June with Low’s family lawyers and their financial trustees, which involved surrendering assets previously identified by the authorities.\nThe agreement to try to reach a global settlement was signed by the DOJ’s acting chief of money laundering and asset recovery section, Ms Margaret Moeser, lawyers for the Lows’ financial trustee, as well as his family lawyer Robin Rathmell of law firm Kasowitz Benson Torres.\nThe confidential agreement, which has yet to be publicly disclosed, is related to the DOJ’s announcement last week that it would recover an additional US$100 million (S$135 million) in resolving two civil forfeiture cases.\nIt added that the assets involved include artworks by Andy Warhol and Claude Monet, financial deposits, and properties in Singapore and other international locations. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-to-focus-on-repatriating-assets-bought-using-1mdb-funds"}