{"authors": [], "date_download": "2024-10-12 13:44:56", "date_modify": "2024-10-12 13:44:56", "date_publish": "2023-02-28 09:55:46", "description": "Masks will still need to be worn at high-risk places including hospitals. Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-to-scrap-covid-19-mask-mandate_1728740696.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/28/2023-02-28T014340Z873108695RC20KZ9L495CRTRMADP3HEALTH-CORONAVIRUS-HONGKONG_11.JPG?VersionId=VVzNwYK9aTHQ4iQW_8SOkEedQSnIb5Rf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-to-scrap-covid-19-mask-mandate_1728740696.html", "title": "Hong Kong to scrap one of the world’s longest Covid-19 mask mandates on March 1", "title_page": "Hong Kong to scrap one of the world’s longest Covid-19 mask mandates on March 1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Hong Kong will drop its Covid-19 mask mandate from Wednesday, Chief Executive John Lee said on Tuesday, in a move to lure back visitors and restore normal life more than three years after stringent rules were first imposed in the financial hub.\nThe measure will take effect from Wednesday, Mr Lee told a media briefing.\nThe special administrative region of Hong Kong is one of the last places globally that still imposes a mask mandate.\nHong Kong and Macau both followed China’s zero-Covid policy for much of the past three years.\nHong Kong started unwinding its stringent Covid-19 rules last year, but mask-wearing had remained constant since 2020.\n“We think this is the best timing to make this decision. It is a clear message to show Hong Kong is resuming normalcy,” Mr Lee said.\nIn high-risk places such as hospitals, administrators can decide whether to require staff and visitors to wear masks, he added.\nNeighbouring special administrative region Macau said on Sunday that it would drop pandemic-related mask requirements for most locations, except when using public transportation, and visiting hospitals and a handful of other areas.\nIn mainland China, residents are not required to wear masks outdoors, although the authorities encourage them to do so in public indoor areas such as airports and train stations.\nHong Kong’s move to scrap masks comes after its government in February launched a promotional campaign called “Hello Hong Kong” to bring back tourists and businesses that have steered clear of the former British colony since 2020.\nThe city had stuck rigidly to its mask rule, even in schools where children as young as two years old were mandated to wear them outside their homes.\nMany students and teachers have been concerned about the impact on learning and child development.", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-to-scrap-covid-19-mask-mandate"}