{"authors": [], "date_download": "2024-10-12 13:52:32", "date_modify": "2024-10-12 13:52:32", "date_publish": "2023-02-01 07:28:59", "description": "The country has set a target to zero out emissions by 2070. Read more at straitstimes.com.", "filename": "asia_south-asia_india-says-its-path-to-net-zero-must-pass-through-fossil-fuels_1728741152.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/01/2022-11-14T143042Z931543433RC2PLX9WAGEKRTRMADP3CLIMATE-UN-INDIA_1.JPG?VersionId=YvxtOG6_Zz0xMSp3F0iIqXqD.o45tfwB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_india-says-its-path-to-net-zero-must-pass-through-fossil-fuels_1728741152.html", "title": "India says its path to net zero must pass through fossil fuels", "title_page": "India says its path to net zero must pass through fossil fuels | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI – India has defended its use of fossil fuels, citing energy security priorities, even as it vowed to remain committed to decarbonisation.\nThe country, one of the world’s largest producers of coal, has often countered demands to curb its use of the dirtiest fossil fuel.\nNew Delhi has argued it is key to its energy security and economic development.\nThe war in Ukraine saw energy rise to the fore of the agenda for developed nations, many of which revived use of coal after supplies of Russian oil and natural gas shrank.\n“The behaviour of European nations in 2022, eminently understandable, demonstrates the return of energy security as a prime requirement for countries,” according to India’s Economic Survey, tabled in Parliament on Tuesday. “Therefore, it stands to reason that it would be no different for developing economies too.”\nDeveloping economies are being asked to shoulder the burden of a global transition to green fuels.\nThis is despite their lower contribution to accumulated emissions compared with developed nations that prospered on the back of “unrestricted use of fossil fuels”, the Economic Survey said.\nThe document, presented a day before the annual budget, is an account of the government’s performance and ambitions for various sectors of the economy.\nThe arguments reflect the country’s stance at the COP27 summit last November of pushing for a discussion on fossil fuels instead of coal alone, and holding rich nations to account for their use of natural gas and oil.\nBesides energy security, potential job losses in the fossil fuel supply chain – from coal mines to refineries – is another issue India is concerned with.\nState-run miner Coal India, the country’s biggest producer of the fuel, is among the nation’s largest corporate employers.\nIt has a headcount of almost 242,000 employees.\nHundreds of thousands more work at other mines, oil wells and processing facilities.\nWhile experts have said clean energy can generate more jobs, the Economic Survey said it “seldom works out so smoothly in practice”.", "url": "https://www.straitstimes.com/asia/south-asia/india-says-its-path-to-net-zero-must-pass-through-fossil-fuels"}