{"authors": [], "date_download": "2024-10-12 13:59:45", "date_modify": "2024-10-12 13:59:45", "date_publish": "2023-03-17 11:54:23", "description": "Keith Harley is taking court action seeking the return of materials seized from his home. Read more at straitstimes.com.", "filename": "asia_australianz_australian-police-investigate-south-african-flying-school-executive-over-chinese-military-training_1728741585.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/17/2022-12-29T192624Z1753055940RC2QFY9DZDS2RTRMADP3USA-CHINA-MILITARY_1.JPG?VersionId=FkzOmg4soa4_9G71dHz4RvdVjfSpKHiO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australian-police-investigate-south-african-flying-school-executive-over-chinese-military-training_1728741585.html", "title": "Australian police investigate South African flying school executive over Chinese military training", "title_page": "Australian police investigate South African flying school executive over Chinese military training | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - The Australian police are investigating a former British military pilot suspected of involvement in the training of Chinese People’s Liberation Army pilots at a flying school in South Africa, a Sydney court was told on Friday.\nThe federal police searched the Australian home of Mr Keith Hartley, chief operating officer of the Test Flying Academy of South Africa (Tfasa), in November, the Federal Court heard.\nBritain and Australia have announced crackdowns on former military pilots working to train Chinese fliers, and Britain vowed to change its national security law to stop them working for intermediaries such as the South African flying school.\nMr Hartley has not been charged, and is taking court action seeking the return of materials seized from his home by the Australian police, and challenging the validity of the search warrant.\nThe police warrant said Mr Hartley’s home was searched because he was suspected of the offence of providing military-style training of Chinese military pilots.\nThe training was delivered by Tfasa, and Mr Hartley is alleged to have organised and facilitated the training, the court heard.\nMr Hartley’s lawyer, Mr Dennis Miralis, previously told Reuters in a statement that Mr Hartley and Tfasa firmly deny any criminal wrongdoing.\nMr Hartley’s barrister, Mr Craig Lenehan, told the Federal Court that the warrant was not clear enough, did not specify how Mr Hartley was involved in the training, and questioned whether the term “military hardware platform” was a plane or a flight simulator or software.\nActing for the Commissioner of Police, barrister Perry Herzfeld, argued that the complaint should be rejected because it would be clear to Mr Hartley, given his long aviation experience, including as a test pilot.\n“The meaning must have been immediately apparent to him when he read the warrant,” he said.\n“The training is said to be provided to pilots of the Chinese People’s Liberation Army.”\nThe search warrant was not required to explain how the Chinese military had funded the training of its pilots at this stage of the investigation, he added.\nAnother former military pilot who previously worked for the flying school was arrested in Australia in October, and is fighting extradition to the United States, where he faces charges of training Chinese military pilots to land on aircraft carriers.\nBritain’s air force chief said in March that intelligence agencies in Australia and Britain had shared information to warn pilots against working for Beijing. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/australian-police-investigate-south-african-flying-school-executive-over-chinese-military-training"}