{"authors": [], "date_download": "2024-10-12 13:53:16", "date_modify": "2024-10-12 13:53:16", "date_publish": "2023-12-30 09:40:00", "description": "Visitors with annual income of over $86,700 can stay up to 2 years with a job back home. Read more at straitstimes.com.", "filename": "asia_east-asia_korea-to-launch-new-digital-nomad-visa-on-jan-1_1728741196.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/30/aikorea301223.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_korea-to-launch-new-digital-nomad-visa-on-jan-1_1728741196.html", "title": "South Korea to launch ‘digital nomad’ visa on Jan 1", "title_page": "South Korea to launch ‘digital nomad’ visa on Jan 1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – South Korea will start issuing “digital nomad” visas from Jan 1, which will allow some foreign residents to stay for up to two years while maintaining a job back home, officials said on Dec 29.\n“To make remote work and vacation of foreigners in Korea smoother, we have decided to launch a new digital nomad visa,” the Justice Ministry said, highlighting the rise of the “workcation” trend, where employees work remotely from a different location.\n“So far, foreigners were required to apply for tourist visas or just stay for less than 90 days without a visa for ‘workcation’ in Korea. The new system will allow employees and employers in overseas firms to tour and work remotely in Korea for a longer period of time,” it added.\nThose who want to apply must submit documents to the South Korean embassy in their respective country proving that they earn an annual income of over 84.96 million won (S$86,400). The figure is double the amount of South Korea’s gross national income per capita as at 2022, which stood at 42.48 million won.\nApplicants must submit additional documents including verification of employment and details of any criminal record.\nThey are required to hold private health insurance with coverage of at least 100 million won to ensure the ability to travel back home in an emergency.\nApplicants must also be 18 or older and have worked in their current field for at least a year.\nAfter receiving the visa, digital nomads will be allowed to bring along a spouse and children younger than 18.\nThe visa will allow holders to initially stay in South Korea for one year, with an opportunity to extend their stay for another year.\nForeigners who are already in South Korea on a short-term tourist visa, such as the B-1, B-2 and C-3, can apply for the new visa.\nBut the visa will not allow digital nomads to apply for a job within South Korea.\nSouth Korean embassies abroad will begin accepting applications, and the government will assess later whether to adopt the visa permanently. THE KOREA HERALD/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/korea-to-launch-new-digital-nomad-visa-on-jan-1"}