{"authors": ["Tan Dawn Wei"], "date_download": "2024-10-12 13:48:44", "date_modify": "2024-10-12 13:48:44", "date_publish": "2024-02-12 12:00:00", "description": "The push comes as China increasingly faces criticism for its treatment of Uighur ethnic minority. Read more at straitstimes.com.", "filename": "asia_xinjiang-doubles-down-on-telling-its-story-countering-narratives-and-courting-trade-tourism_1728740924.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/12/IMG3922.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_xinjiang-doubles-down-on-telling-its-story-countering-narratives-and-courting-trade-tourism_1728740924.html", "title": "Xinjiang doubles down on telling its story, countering narratives and courting trade, tourism", "title_page": "Xinjiang doubles down on telling its story, countering narratives and courting trade, tourism | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "URUMQI – Xinjiang has doubled down on a campaign to shed its blemished international image as well as entice domestic tourists to visit, as the vast autonomous region attempts to spur its economy amid a widespread slowdown.\nFor the first time, it invited a group of foreign journalists, including from The Straits Times, and journalists from Hong Kong and Macau, to cover the opening ceremonies of its annual twin advisory and legislative session – its most important political event of the year – which recently concluded.\nIt also welcomed China-based diplomats from Iran, Kazakhstan, Kyrgyzstan, Tajikistan, Uzbekistan, Pakistan, Mongolia and Belarus. All are members or observers of the Shanghai Cooperation Organisation, a regional defence grouping spearheaded by China and Russia.\nThe move to open its doors – at least partially, since the foreign journalists had no access to meetings – was apparently well-supported by Xinjiang party chief Ma Xingrui, a former governor of Guangdong province whom political pundits believe was moved to the far-flung north-western region to steer its economic development.\nHe had replaced Mr Chen Quanguo, who was widely blamed for a crackdown targeted at extremism among the region’s Uighur ethnic minority. Xinjiang came into international focus during his tenure from 2017 to 2021 for its re-education camps and other anti-terror measures that have branded China as a human rights abuser.\nThat portrayal is one that Mr Ma and the Xinjiang government have been eager to change, as officials up and down the chain of command persist in “telling the Xinjiang story well”.\nXinjiang’s political advisory body chairman Nuerlan Abudumanjin told delegates – made up of representatives from across sectors – that they should “stick to positive publicity” and “resolutely oppose the smear and sanctions involving Xinjiang by the United States and other Western countries”.\nThe body had sent delegations to countries in Africa and South-east, West and Central Asia in 2023 to promote Xinjiang and to “enhance the international community’s correct understanding of the real Xinjiang”, he said while delivering his annual report.\nOfficials hosting the visiting diplomatic and media groups also arranged for visits to grassroots organisations, with the view to showcase how Urumqi residents are taken care of. In one local community, a bakery sits next to a cut-and-sew workshop that is beside a flower shop, all providing employment for residents on flexible working hours.\n“We have Uighurs, Kazakhs, Hui, Han all living here together. There’s no talk of religion. We sometimes visit each other’s homes or eat and play together,” said 30-year-old Ayshemgul Yasin, putting together a bouquet of red roses in the flower shop. She works up to eight hours a day for between 3,500 yuan (S$660) and 6,000 yuan a month.\nAsked if she felt satisfied with her life in Urumqi, she said: “I’m very happy here… I’m getting a good income.”\nMr Li Xuan, party secretary and deputy director at Xinjiang’s commerce department, said the region’s exports have been hampered by a global trade contraction, but it will roll out policies to help boost its foreign trade.\nThis year, Xinjiang has set a more modest gross domestic product (GDP) target of around 6.5 per cent, although this figure is still higher than the GDP targets of nearly all the other 31 provinces, municipalities and autonomous regions except for Tibet and Hainan, which are both gunning for 8 per cent.\nEconomists expect China’s growth to slow in 2024, with projections averaging 4.6 per cent. In 2023, it expanded by 5.2 per cent. It will announce its GDP target in March, when it convenes its annual parliamentary session.\nMeanwhile, Xinjiang officials are hoping that its “Xinjiang is a nice place” campaign will also bring a targeted 300 million tourists in 2024, as it banks on tourism to contribute to its growth. The number of tourists in 2023 reached 267 million.\nXinjiang governor Erkin Tuniyaz told delegates at the recent legislative meeting that the government will aggressively develop its tourism industry by building infrastructure and drawing investors to build new tourist attractions.\nBut even as the autonomous region of 25 million trains its focus on bolstering its economy and cleaning up its sullied image, it is at the same time still on guard, pledging to “curb extremism, resist infiltration” and “actively guide religions to be compatible with socialist society”, said Mr Tuniyaz.\nMadam Li Juan, who heads the legal affairs commission of Xinjiang’s legislature, said Xinjiang’s social stability after combating terrorism has “come at a high price to everyone”.\n“But the situation is dynamic, and we need to adjust it at any time according to the different circumstances, to solve the contradictions and problems at any time,” she told ST.", "url": "https://www.straitstimes.com/asia/xinjiang-doubles-down-on-telling-its-story-countering-narratives-and-courting-trade-tourism"}