{"authors": ["Raul Dancel"], "date_download": "2024-10-12 13:27:57", "date_modify": "2024-10-12 13:27:57", "date_publish": "2024-10-09 21:33:45", "description": "The AI trailblazer’s mother is Singaporean, and he spent his summers in Singapore until he turned 10. Read more at straitstimes.com.", "filename": "asia_australianz_nobel-chemistry-laureate-demis-hassabis-has-singapore-in-his-blood_1728739677.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/09/2024-10-09T100326Z1953630531RC2XGAAIUSEERTRMADP3NOBEL-PRIZE-CHEMISTRY.JPG?VersionId=Pas7ltoyE1rqmHQVjAvPVhQtPE4A_7sV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_nobel-chemistry-laureate-demis-hassabis-has-singapore-in-his-blood_1728739677.html", "title": "Nobel Chemistry laureate Demis Hassabis has Singapore in his blood", "title_page": "Nobel Chemistry laureate Demis Hassabis has Singapore in his blood | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Dr Demis Hassabis, one of the three winners of the 2024 Nobel Prize in Chemistry, has Singapore in his blood: His mother is Singaporean, and he credits Singapore – a place he calls “this magical futuristic world” – for kindling his interest in tech.\nHe was awarded the Nobel prize on Oct 9, along with Dr John Jumper and Dr David Baker.\nThey were recognised for their work on advanced technology, including artificial intelligence, to predict the complex structures of proteins.\nDr Hassabis and his collaborator at Google DeepMind, Dr Jumper, were credited specifically for creating a technology that can rapidly and reliably predict the physical shape of proteins and enzymes.\nThat technology has sped up the discovery of medicines and creation of new biological tools.\nHis family\nDr Hassabis, 48, was born in North London to a Greek Cypriot father and Chinese Singaporean mother. Both were reported to have worked as teachers.\nHe described his parents in a 2014 interview with The Standard of London as “quite bohemian”. At the time, his mother was working for the department store chain John Lewis, while his father “did lots of different things”, including being a singer-songwriter.\n“Neither of them are technical at all, which is quite bizarre,” Dr Hassabis told The Standard.\n“My parents are technophobes. They don’t really like computers... So, yeah, it’s weird. I’m not quite sure where all this came from,” he told the Guardian in 2016.\nHe said, like his parents, his younger brother and sister “went the artistic route”. His sister is a composer and pianist, while his brother studied creative writing.\n“I’m definitely the alien black sheep in my family,” he said in jest, recalling how as a boy he spent his chess prize winnings on a ZX Spectrum 48K, and then a Commodore Amiga, which he promptly took apart and figured out how to program.\nHe stood out\nGrowing up, Dr Hassabis was often described as a polymath. He taught himself to write computer programs when he was just eight.\nHe was the second-highest ranked under-14 chess player in the world and began designing video games professionally before attending college.\nAfter completing a computer science degree at the University of Cambridge, he founded his own video game company and then returned to academia for a doctorate in neuroscience.\nDr Hassabis, along with a fellow academic and a childhood friend, founded an AI start-up that they called DeepMind in 2010. About four years later, Google acquired it for US$650 million (S$848 million).\nHis Singapore years\nDr Hassabis credits his years in Singapore – where he spent his summers until he turned 10 – for sparking in him a keen interest in tech, particularly in video games.\n“Back in the early 80s, there were so many cool gadgets that were coming from Japan that you could buy in Singapore that you couldn’t buy in Britain. I remember getting Nintendo Game and Watch’s Donkey Kong. That was my favourite,” he told The Straits Times in a 2016 interview.\nHe said he has always seen Singapore “as this magical futuristic world”.\nAsked what it would take for the city state to woo a trailblazer like him, he replied: “You need to create enough of a critical mass of people that you can build a company like DeepMind out of”.\n“You probably got enough of the ingredients,” he said.\n“You got money, government will, and very smart people and top universities and it’s a highly technological society. You may just need the right entrepreneur or leader to pull it all together,” he added.\nOn receiving the Nobel prize, Dr Hassabis told Reuters “it’s totally surreal, to be honest, quite overwhelming”.\nWeighing in on the simmering debate over AI, he said: “It’s like any powerful, general-purpose technology. It can be used for harm as well if put in the wrong hands and used for the wrong ends”.", "url": "https://www.straitstimes.com/asia/australianz/nobel-chemistry-laureate-demis-hassabis-has-singapore-in-his-blood"}