{"authors": [], "date_download": "2024-10-12 13:27:52", "date_modify": "2024-10-12 13:27:52", "date_publish": "2024-05-08 15:45:00", "description": "Likening it to China’s “panda diplomacy”, it said the move would prove its commitment to biodiversity conservation. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-eyes-orangutan-diplomacy-with-nations-that-import-palm-oil_1728739672.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/08/IMG9655.jpg?VersionId=zW9bYVF6Ckkvx1xlXEmuhNXrAbCOEr1a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-eyes-orangutan-diplomacy-with-nations-that-import-palm-oil_1728739672.html", "title": "Malaysia eyes ‘orang utan diplomacy’ with nations that import palm oil", "title_page": "Malaysia eyes ‘orang utan diplomacy’ with nations that import palm oil | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Malaysia plans to introduce “orang utan diplomacy” in its relations with major palm oil-importing countries, offering the animals as trading gifts in an effort to allay concerns about the environmental effects of growing the commodity.\nBut the plan, likened to China’s “panda diplomacy” by the commodities minister, has prompted concerns among wildlife advocacy groups.\nThey called on the government to consider alternative measures to protect the orang utans’ habitat and improve the sustainable production of palm oil, which is used in everything from lipstick to pizza.\nMalaysia’s proposal comes after the European Union (EU) approved a ban in 2023 on imports of commodities linked to deforestation, which could hurt palm oil. The law has been described as discriminatory by Malaysia, the world’s second-largest producer of palm oil after Indonesia.\nPlantations and Commodities Minister Johari Abdul Ghani said Malaysia would offer gifts of orang utans to trading partners, particularly major importers such as the EU, India and China, as part of a diplomatic strategy.\n“This will prove to the global community that Malaysia is committed to biodiversity conservation,” Mr Johari said on social media platform X late on May 7.\n“Malaysia cannot take a defensive approach to the issue of palm oil. Instead we need to show the countries of the world that Malaysia is a sustainable oil palm producer and is committed to protecting forests and environmental sustainability.”\nNo further details of the plan were immediately available.\nThe orang utan, whose name means “man of the forest” in Malay, is critically endangered, with a population of less than 105,000 on the island of Borneo, conservation group WWF says.\nWWF Malaysia said palm oil estates should set aside wildlife corridors that are safe for orang utans, and it called on the government to stop the further conversion of forests into plantations.\nIt also raised concerns over how the orang utan plan could affect efforts to protect and conserve existing ape populations.\n“WWF supports in-situ conservation of wildlife, and would urge that trading partners are brought to Malaysia to support this initiative, as opposed to sending orang utans out of the country,” it said in a statement to Reuters.\nAdvocacy group Justice for Wildlife Malaysia said the government should consider alternative diplomatic measures, citing the need for more research on the plan’s potential impact and feasibility against other conservation efforts. REUTERS", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-eyes-orangutan-diplomacy-with-nations-that-import-palm-oil"}