{"authors": [], "date_download": "2024-10-12 13:32:14", "date_modify": "2024-10-12 13:32:14", "date_publish": "2023-12-18 13:58:37", "description": "Farmers in Chiang Rai province planted seedlings in a rice field to lure tourists and cat lovers. Read more at straitstimes.com.", "filename": "asia_thai-rice-farmer-makes-art-with-plantings-that-depict-cats_1728739934.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/18/LYNXMPEJBH04O-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_thai-rice-farmer-makes-art-with-plantings-that-depict-cats_1728739934.html", "title": "Thai rice farmer makes art by planting seedlings in arrangements that depict cats", "title_page": "Thai rice farmer makes art by planting seedlings in arrangements that depict cats | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BAN KHON SUNG, Thailand – A sleeping cat hugs a fish in a picture seen from the air, picked out in sprouting rainbow seedlings in a rice field in Thailand to illustrate a traditional proverb about abundance.\nFarmer Tanyapong Jaikham and a team of workers planted the seedlings at various spots in the field in the northern province of Chiang Rai to depict cats, hoping to lure tourists and cat lovers.\n“We’re expecting tens of thousands to come and see the art in the rice fields,” he said.\nThe process relies on Global Positioning System coordinates to position the seedlings as designated in an initial artist’s sketch, the farmer said, with the plants changing tint as they grow.\n“It’s crucial to position them accurately, and the rice will gradually change shades over time,” he said. By the time of the final harvest, the rice straw yields the portrait of Cooper, the cat on which it was modelled.\nViewing towers are being built in the surrounding area to give visitors a glimpse of the artwork, which is based on a Thai saying, “There is fish in the water and rice in the fields”.\nThe world’s second-largest exporter of the grain after India, Thailand aims to ship 8.5 million metric tonnes in 2023.\nYoung people wanting to learn more about the interaction of art and technology could also benefit from visiting the site, Mr Tanyapong said.\n“Previously, rice was considered mainly for consumption,” he said.\n“This approach allows us to develop tourism and agriculture simultaneously.” REUTERS", "url": "https://www.straitstimes.com/asia/thai-rice-farmer-makes-art-with-plantings-that-depict-cats"}