{"authors": [], "date_download": "2024-10-12 14:14:30", "date_modify": "2024-10-12 14:14:30", "date_publish": "2022-10-28 16:20:28", "description": "Lhasa has been locked down for nearly three months in accordance with China’s zero-Covid-19 strategy. Read more at straitstimes.com.", "filename": "asia_east-asia_hundreds-in-tibetan-capital-stage-rare-protest-against-covid-19-lockdowns_1728742470.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/28/Tibet20Protest_2.JPG?VersionId=F7d.c4LmdOrClH6nJiAPyyeWrLZVG8sb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hundreds-in-tibetan-capital-stage-rare-protest-against-covid-19-lockdowns_1728742470.html", "title": "Hundreds in Tibetan capital stage rare protest against Covid-19 lockdowns", "title_page": "Hundreds in Tibetan capital stage rare protest against Covid-19 lockdowns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Hundreds of people in the Tibetan capital Lhasa have taken to the streets to protest harsh Covid-19 measures, video footage showed, a rare demonstration in the tightly controlled region.\nLhasa has been locked down for nearly three months in accordance with China’s zero-Covid-19 strategy, which sees millions of residents across the country repeatedly restricted to their homes whenever cases rise.\nThe measures have prompted rare protests in cities such as Shenzhen and Shanghai and many, including in Lhasa, have complained of food shortages and poor conditions in mass quarantine facilities.\nVideos shared on Douyin, the Chinese version of TikTok, showed hundreds of what appeared to be mostly migrant workers of Han Chinese ethnicity marching through the streets of Lhasa on Wednesday, demanding to be allowed to return home.\nThose videos and related content were quickly scrubbed from Douyin and the Twitter-like Weibo platform, though some text posts referencing an “incident” in Lhasa remained on Thursday.\nIn one of Wednesday’s videos, hundreds of people are seen in a street blocked at one end by police and hazmat-suited health workers, while an official shouts through a megaphone: “Everybody please understand our work, go home and do not crowd this area.”\nA video shot from another angle showed police vans and officers carrying riot shields stationed nearby.\nAFP has geolocated the two videos next to an agricultural market not far from Lhasa’s Potala Palace, the traditional residence of the Dalai Lama and the site of a self-immolation protest by a Tibetan pop star earlier this year.\nThere is already a heavy security presence in Tibet, with access to journalists mostly restricted.\nWednesday’s demonstrations are believed to be the largest since 2008, when large-scale protests against Chinese authorities’ increased repression towards the majority ethnic Tibetan population were violently subdued.\nSome social media users suggested police would have cracked down more harshly on the anti-lockdown march had the protestors been Tibetan rather than Han Chinese.\n‘I want to go home’\nOther videos showed a night-time confrontation between a large crowd of residents and police in what appeared to be a housing community in Lhasa.\n“People have been locked down for too long, the psychological pressure is too much to bear with no income. Many people in our community are also migrants who came here to work and earn money,” one man was heard saying in Mandarin over a loudspeaker.\nIn one of the videos, a woman among the crowd is heard screaming, “I want to go home,” at a police officer.", "url": "https://www.straitstimes.com/asia/east-asia/hundreds-in-tibetan-capital-stage-rare-protest-against-covid-19-lockdowns"}