{"authors": [], "date_download": "2024-10-12 14:20:27", "date_modify": "2024-10-12 14:20:27", "date_publish": "2024-06-09 11:34:00", "description": "Vulnerable, low-paid Filipinos have been exploited under a scheme to plug a severe labour shortage. Read more at straitstimes.com.", "filename": "asia_east-asia_south-korea-accused-of-modern-slavery-with-seasonal-worker-scheme_1728742827.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/09/SKOREA-LIFESTYLE-153916.jpg?VersionId=Sn_kLRXpPiFOor4PRZg6_LNDcxzUZgwI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_south-korea-accused-of-modern-slavery-with-seasonal-worker-scheme_1728742827.html", "title": "South Korea accused of modern slavery with seasonal worker scheme", "title_page": "South Korea accused of modern slavery with seasonal worker scheme | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Vulnerable, low-paid Filipinos have been exploited, tricked and abused under a migrant worker scheme launched by South Korea to plug its severe labour shortage, an investigation by the Thomson Reuters Foundation has found.\nUnder the scheme – which also recruits workers from Nepal, Vietnam, Mongolia, Laos, Cambodia, Uzbekistan and Thailand – farmers and fishermen relocate to South Korea for five to eight months of work with the promise of big wages to take home.\nBut the Thomson Reuters Foundation has talked to a dozen former workers who say the scheme falls short – many say they returned empty-handed and some risked losing land to the brokers who sealed their temporary contracts.\nWorkers said brokers had charged excessive fees for securing them back-breaking work, controlled their movements by confiscating their passports and documents, and cheated them out of promised wages.\n“This clearly demonstrates the vulnerability of seasonal workers to human trafficking and forced labour,” said Mr Ko Gibok of the Joint Committee with Migrants in Korea (JCMK), a coalition of groups working to improve migrant rights.\nMr Ko called the programme a new form of modern slavery.\n“It is like human trafficking in modern day. The brokers treated seasonal workers like slaves,” he said.\nThe South Korean government refused requests for comment.\nThe Philippine government said the scheme was run on a state-by-state basis – at least 45 local governments took part – and that it had no jurisdiction over the local level.\nThe country has a total of 1,600 local government units that can enter into deals with their counterparts in South Korea.\nThis hands-off stance means it is hard to tally the numbers of workers affected or track the extent of abuses.\nSeeking better oversight, Manila announced plans in March to channel all future migrant workers through a bilateral deal.\nNo bilateral agreement on the seasonal farm workers programme has yet been reached.\nThe Thomson Reuters Foundation contacted several local governments for comment – none replied.\nEmpty promises\nMore than 3,500 Filipinos have been recruited since 2022, when South Korea launched sister-city agreements that twin local Filipino states with richer ones in the East Asian country.\nThe workers were drawn to the scheme by the promise of earning up to five times what they can make at home.\nFor South Korea, the migrants plug a chronic labour shortfall exacerbated by an ageing and shrinking population, with foreign workers taking on low-paid jobs that many locals shun.\nThe Thomson Reuters Foundation analysed the documents of 12 former seasonal workers – papers that revealed systemic contract violations, the deals often struck by independent brokers.\nAmong complaints: welfare violations, exorbitant broker fees, harsh conditions, diluted pay and a lack of any redress.\nMany Filipinos also said they were too afraid to speak out for fear of being shut out of future job prospects.\nHere are the stories of three former migrant workers, all of whose names have been changed to protect their identities.\nJuan\nRice farmer Juan is typical of the victims interviewed over a four-month investigation.\nEnticed by the prospect of a hefty salary, Juan staked his family’s 2ha farm for a chance to work a season in South Korea, only to face hard labour when he moved abroad, then a legal battle for his assets once back home.\nThe work was brokered in July 2023 by his town – General Mamerto Natividad, 120km north of Manila – which contracted the 42-year-old for a five-month stint abroad.\nHe was promised a monthly salary of 43,000 Philippine pesos (S$990), more than double his usual takings.\nBut when he arrived in Hwasun, at the foot of South Korea, Juan was forced to work as a mountain grass cutter, a gruelling job doable only after hiking two hours through peak summer heat.\nJuan said the entire employment process – from his hiring at home to drop-off at his post – was handled by three people whom he called brokers, a married Filipino couple and a lone Korean man.\nJuan had complained to the brokers, expecting to be redeployed.\n“We thought they would hear our complaints and help us find a new employer,” Juan said.\nInstead, he was told to go to the airport the following day.\n“The brokers forced us to go back to the Philippines and told the local government that we wanted to go home. But that’s not true,” he said. “They also refused to return our collateral.”\nThe family had signed over land as collateral to secure the overseas work contract and said the brokers tried to keep that land when Juan returned early. Juan said it took a four-month fight and 180,000 pesos in legal fees to win back the plot.\nBianca\nBianca – who spent five months picking strawberries in South Korea – said she had to work 14-hour days and that brokers kept her bank book and passport for her entire stay.\n“The brokers sent our families in the Philippines only 15,000 pesos a month,” said the former seasonal farm worker.\nShe left for South Korea in 2022 on a promise of 35,000 pesos a month, but said she was then charged 20,000 pesos a month for housing, food and “handling”.\nShe said no charges were mentioned in her contract, but she felt too scared to complain.\n“It was my dream to go to South Korea. I didn’t know that the job there would be hard – 14 hours. It was hard to endure.”\nIn 2023, the Department of Migrant Workers (DMW), the government arm set up to protect Filipinos working overseas, received 150 complaints related to illegal recruitment, labour practices and welfare under the seasonal farm workers programme.\nThe DMW said it was looking into all of them, as well as investigating 66 brokers for wrongdoing.\nSince 2022, the department said it had identified five workers who had suffered physical abuse, another five who needed medical attention, and four Filipino seasonal workers who had died.\nThere is no data on the total number of complaints filed.\nMark\nWhile the government knows who signed up to state schemes, it has no data on workers contracted by unregulated brokers.\n“And the brokers, of course, they are in it for business,” said Ms Tatcee Macabuag of the Migrant Forum in Asia, a regional non-governmental organisation for the protection of migrant workers.\nThis informal set-up led to contracts that “were not rights-based” and opened up “opportunities for abuse”, she said.\nIn Laguna, an agricultural province about 90km from Manila, former farmworkers recruited in the towns of Paete and Pangil said they were asked to pay 60,000 pesos as a “processing” fee to land a job.\nYet there was no mention of any fee in the contract that Mark signed in April 2023.\nThe 42-year-old statistical researcher should have earned about 60,000 pesos per month – five times his usual salary – but was charged for flights, insurance and other fees.\nSo he earned only half that, working on a 20ha potato farm in the north-eastern province of Gangwon.\n“I never expected that we had to work harder than a carabao,” said Mark, referring to a type of water buffalo. “I vowed to never work in farms in South Korea again.”\nChange afoot\nIn January, the DMW told local governments to stop sending farm workers to South Korea until rules were rewritten to ensure decent wages, fair conditions and ready access to medical care.\nBut Mr Ko – of the Joint Committee with Migrants – said there had been “no policy change” nor had the rules been reworked.\nSo the old scheme persists – along with all the complaints.\n“We cannot provide jobs for our people... but we should at least protect their rights,” said Ms Macabuag of the Migrant Forum in Asia.\n“The ideal would be for us to have a really good economy where people don’t have to leave.” REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/south-korea-accused-of-modern-slavery-with-seasonal-worker-scheme"}