{"authors": [], "date_download": "2024-10-12 13:37:36", "date_modify": "2024-10-12 13:37:36", "date_publish": "2024-06-20 16:15:00", "description": "The confrontation disrupted a Philippine resupply mission for marines at the disputed Second Thomas Shoal. Read more at straitstimes.com.", "filename": "asia_chinese-sailors-wield-knives-axe-in-disputed-sea-clash-with-philippines_1728740256.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/20/2024-06-19T063618Z12832128RC23QZ9SXAZ4RTRMADP3SOUTHCHINASEA-PHILIPPINES-CHINA.JPG?VersionId=CddDS6ueRQmnJO9Nz6JCd67B0kV2vOLb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_chinese-sailors-wield-knives-axe-in-disputed-sea-clash-with-philippines_1728740256.html", "title": "Chinese sailors seen in clips wielding knives, axe in South China Sea clash with Philippines", "title_page": "Chinese sailors seen in clips wielding knives, axe in South China Sea clash with Philippines | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA – Chinese coast guard sailors brandished knives, an axe and other weapons in a clash with Philippine naval vessels near a strategic reef in the South China Sea, dramatic new footage released by Manila showed.\nThe clash took place on June 17 as Philippine forces attempted to resupply marines stationed on a derelict warship that was deliberately grounded atop the disputed Second Thomas Shoal in 1999 to assert Manila’s territorial claims.\nIt was the latest in a series of escalating confrontations between Chinese and Philippine ships in recent months as Beijing steps up efforts to push its claims to the disputed area.\nThe Philippine military chief, General Romeo Brawner, said the “outnumbered” Filipino crew had been unarmed and had fought with their “bare hands”.\nA Filipino sailor lost a thumb in the clash, in which the Chinese coast guard confiscated or destroyed Philippine equipment including guns, according to the Philippine military.\nFresh footage released by the Philippine military late on June 19 shows small boats crewed by Chinese sailors shouting, waving knives and using sticks to hit an inflatable boat as a siren blares.\nA voice speaking Tagalog can be heard in one clip saying someone had “lost a finger”.\nManila’s footage of the clash stands in stark contrast to photos released by Beijing’s state media on June 19, which did not show Chinese forces wielding weapons.\n‘Violent confrontation’\nAsked about the videos on June 20, Chinese foreign ministry spokesman Lin Jian said Manila’s comments on the clash were “totally bogus accusations that confuse black with white”.\nHe blamed the Philippines for the confrontation, saying it had “escalated tensions” and accused the Philippine boats of ramming Chinese vessels.\nMr Lin said the Philippine boats had been trying “to sneak in building materials, but also tried to smuggle in military equipment”.\nBeijing has insisted that its coast guard behaved in a “professional and restrained” way during the confrontation, and claimed “no direct measures” were taken against Filipino personnel.\nBut in a clip shared by Manila, a Chinese sailor standing on the deck of one of the boats can clearly be seen waving an axe.\nAnother shows a Chinese coast guard sailor striking the inflatable boat with a stick. A second man can also be seen stabbing the boat with a knife.\nThe Philippine military claimed an axe-wielding sailor had “threatened to injure” a Filipino soldier, while others were “explicitly threatening to harm” Filipino troops.\n“The (Chinese coast guard) personnel then began hurling rocks and other objects at our personnel,” Manila said. “They also slashed the (inflatable boats), rendering them inoperable.”\nThe Filipino sailors, wearing brown camouflage with helmets and vests, are not carrying weapons in the clips.\n“Amidst this violent confrontation, the CCG (Chinese coast guard) also deployed tear gas, intensifying the chaos and confusion, while continuously blaring sirens to further disrupt communication,” the caption says.\nManila has accused Beijing of an “act of piracy” against its forces.\nIt has also demanded the return of items “looted” by the Chinese side, including seven guns, and reparations for damaged equipment.\n‘Perilous’ situation\nAnalysts say Beijing is escalating confrontations with the Philippines in a bid to push it out of the South China Sea.\nMr Jay Batongbacal, director for the Institute for Maritime Affairs and Law of the Sea in Manila, told AFP that China’s forces could be poised to seize the grounded Philippine warship, the Sierra Madre.\n“The deployment of their forces at present around the Sierra Madre and then the many reefs around the Kalayaan island group is indicative that they’re ready to do it,” he said, referring to Manila-claimed areas in the Spratly Islands.\nThe US has said that “an armed attack” against Philippine public vessels, aircraft, armed forces and coast guard anywhere in the South China Sea would require it to come to Manila’s defence under a treaty between the two countries.\nUS Secretary of State Antony Blinken “emphasised that (China’s) actions undermine regional peace and stability” in a call with his Philippine counterpart Enrique Manalo on June 19, according to the US State Department.\nThey also “underscored the United States’ ironclad commitments to the Philippines under our Mutual Defence Treaty”, Mr Blinken said.\nAnother analyst told AFP this week’s clashes “brought us perilously close” to a situation in which the US would be required to intervene militarily.\n“The Philippines will likely need to continue resupply missions to the Sierra Madre, one way or another,” said Mr Duan Dang, a Vietnam-based maritime security analyst.\n“Backing down and accepting Beijing’s terms regarding these operations would mean relinquishing sovereign rights within its exclusive economic zone,” he said. AFP", "url": "https://www.straitstimes.com/asia/chinese-sailors-wield-knives-axe-in-disputed-sea-clash-with-philippines"}