{"authors": [], "date_download": "2024-10-12 14:14:36", "date_modify": "2024-10-12 14:14:36", "date_publish": "2022-04-08 09:20:23", "description": "A newspaper said the policy is the best choice given that medical resources in some parts of China are lacking. Read more at straitstimes.com.", "filename": "asia_east-asia_chinas-covid-19-zero-policy-defended-as-shanghai-cases-top-21000_1728742476.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/08/AK_chcov_080422.jpg?VersionId=r3mFxt2i8XFAxZqkw8NnRS4gOML_3l_Z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinas-covid-19-zero-policy-defended-as-shanghai-cases-top-21000_1728742476.html", "title": "China's Covid-19-zero policy defended as Shanghai cases top 21,000", "title_page": "China's Covid-19-zero policy defended as Shanghai cases top 21,000 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (BLOOMBERG) - The Communist Party of China's flagship newspaper has defended President Xi Jinping's stringent virus strategy, saying the Covid-19-zero policy is essential to saving lives and keeping the economy going, as doubts grow with more than 21,000 new cases recorded in Shanghai.\nIn a front-page commentary, the People's Daily said that the more transmissible Omicron variant \"has made it more difficult to find the virus and prevent the epidemic\".\nIt then went on to say that \"the more this is the case, the more we should adhere to the general policy of 'dynamic zero' without hesitation or wavering\", using Beijing's wording for the country's virus approach.\nThe commentary comes as China faces its worst Covid-19 crisis since the start of the pandemic, when the pathogen first emerged in Wuhan.\nNew infections are exceeding the caseloads seen back then, with Shanghai - the country's most global city and one of its most populous - now a key epicentre.\nThe financial and economic hub has been locked down for more than a week, as officials roll out repeated rounds of mass testing, deploying a Covid-19-zero playbook that is proving less effective against new variants.\nShanghai reported 21,222 new Covid-19 infections for Thursday (April 7), up from just over 9,000 cases on Sunday in a concerning surge. The ongoing restrictions have led to food and medicine shortages, with some apartment blocks in hard lockdowns for weeks.\nIt is fuelling growing discontent among residents over the policy, which is leaving China isolated as the rest of the world opens up and lives alongside the virus.\nLast month, Mr Xi reaffirmed China's adherence to the strategy, but said it needed to be adjusted so that curbs are not damaging business and the economy.\nWhile it is getting increasingly hard to suppress Omicron's spread, Covid-19-zero \"can not only reduce the harm of the epidemic to people's health and life safety, but also balance the relationship between social and economic development and epidemic prevention and control to the greatest extent\", the People's Daily said.\nThe policy is designed to \"achieve the maximum prevention and control effect at the least cost\", the newspaper said, adding that Covid-19-zero is the best choice for China given that medical resources in some parts of the country are lacking, the vaccination rate is unbalanced and there is a large elderly population.\nChina watchers expect Beijing to stick with Covid-19-zero this year, as there is little appetite for the instability that would likely be unleashed if the virus were allowed to spread freely.\nThe nation is vaccinated with less effective domestic shots and the rate for those over 80 is lower than in many other countries, at about 51 per cent, officials said on March 18.", "url": "https://www.straitstimes.com/asia/east-asia/chinas-covid-19-zero-policy-defended-as-shanghai-cases-top-21000"}