{"authors": ["Nadirah H. Rodzi"], "date_download": "2024-10-12 14:22:11", "date_modify": "2024-10-12 14:22:11", "date_publish": "2022-09-06 20:16:28", "description": "As Singapore embarks on its leadership transition, it will continue to find ways to strengthen this relationship, he added. Read more at straitstimes.com.", "filename": "asia_se-asia_vital-for-spore-malaysia-to-strengthen-cooperation-in-the-face-of-global-headwinds-lawrence-wong_1728742931.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/06/sv_minister_060922.jpg?VersionId=497crRYuEvwzRoLCP2AuBJ9KseEDtlZg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_vital-for-spore-malaysia-to-strengthen-cooperation-in-the-face-of-global-headwinds-lawrence-wong_1728742931.html", "title": "Vital for S'pore, Malaysia to strengthen cooperation in the face of global headwinds: Lawrence Wong", "title_page": "Vital for S'pore, Malaysia to strengthen cooperation in the face of global headwinds: Lawrence Wong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Singapore and Malaysia have to continue working closely together amid a more uncertain global landscape, Deputy Prime Minister Lawrence Wong said on Tuesday.\nBoth countries have a high level of interdependency across many areas, and their relationship is underpinned by close people-to-people and family ties, he noted.\nSpeaking to Singapore reporters near the end of a four-day visit, Mr Wong - who shared that his father grew up in Ipoh, Perak - said the visit was a chance to strengthen his ties with Malaysian ministers.\nAnd as Singapore embarks on its leadership transition, it will continue to find ways to strengthen this relationship, he added.\nThe bilateral relationship will be more important as both countries enter a new global environment, with energy, food, an economic slowdown and inflation set to be issues in the months ahead, he said.\n\"The golden age of globalisation that we all enjoyed in the past 30 years is probably over, and we are entering a new order, which will be characterised by greater geopolitical contestation and potentially more fragmentation in the global economy,\" said Mr Wong.\n\"That means countries like Malaysia and Singapore will continue to be pulled in different directions and there will be pressure... for us to take sides, which is why it is vital for us to stand united and to stand together, and to continue to strengthen our cooperation with one another.\"\nMr Wong, who is also Finance Minister, is on his first official visit to Malaysia since he became Deputy Prime Minister in June.\nHe said he would encourage Singapore's younger ministers to visit, and for Malaysian ministers to visit Singapore, to continue to build these personal relationships.\nHe noted that as closest neighbours, it is inevitable that there will be issues from time to time.\n\"But because of the friendships, the close relationships we have at a personal level and between our two countries, we are able to discuss the differences candidly,\" he said.\n\"We are able to work out these differences in the context of our broader relationship, always taking the overall approach of advancing and strengthening our bilateral ties. That's how we have done it over so many decades, and that's what we will continue to do.\"\nOn Tuesday, he had an audience with Malaysia's King, Sultan Abdullah Ahmad Shah, and reaffirmed the warm, long-standing, and multi-faceted relationship between the two countries, built upon a unique shared history and strong people-to-people ties.\nThe King said that it was important for Malaysia and Singapore to complement each other and strengthen social relations, trade and investment to the highest level for mutual benefit.\nAsked about their discussions on the discontinued Singapore-KL High-Speed Rail project, Mr Wong said it was a short meeting, and they did not get into great details on the project.\nHe added that Singapore is open to new proposals, and is awaiting more details.\n\"When we see specifics, we will look at the proposal in detail and we will consider it, and we can then proceed to have further discussions thereafter,\" he said.\nAsked about chicken exports, which Malaysia has banned since June, Mr Wong said he has been told that Malaysia is looking at resuming exports at some stage but no specific date was given.\n\"If Malaysia would like to resume exports, we welcome that. But at the same time, we have... taken steps to make sure that our supply of chicken, or for that matter, food supplies, are resilient and well diversified,\" he said.", "url": "https://www.straitstimes.com/asia/se-asia/vital-for-spore-malaysia-to-strengthen-cooperation-in-the-face-of-global-headwinds-lawrence-wong"}