{"authors": ["Linda Yulisman"], "date_download": "2024-10-12 13:46:54", "date_modify": "2024-10-12 13:46:54", "date_publish": "2024-06-02 12:30:00", "description": "They exert immense influence due to their numbers, social media reach and purchasing power. Read more at straitstimes.com.", "filename": "asia_se-asia_indonesia-s-k-pop-fans-get-real-wielding-their-clout-for-social-and-green-causes_utm_campaign=ST_Newsletter_ASIANINSIDER_1728740814.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/02/4HyundaiDropCoal6.jpg?VersionId=IyutmutJsHPizt2IzPOyl87YVRXbDxHf&h=93423ff5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_indonesia-s-k-pop-fans-get-real-wielding-their-clout-for-social-and-green-causes_utm_campaign=ST_Newsletter_ASIANINSIDER_1728740814.html", "title": "Indonesia’s K-pop fans get real, wielding their clout for social and green causes", "title_page": "Indonesia’s K-pop fans get real, wielding their clout for social and green causes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA - Indonesian fans of Korean pop bands are making headlines for all the right reasons, wielding their influence to promote social and green causes in the archipelago and getting businesses to adopt more eco-friendly practices.\nNumbering in the millions worldwide and in the hundreds of thousands in Indonesia, their ability to quickly mobilise en masse has made K-pop fans increasingly influential online and offline as they rally to support their chosen causes and petition their cases, experts say.\nAnd businesses are starting to take note of these fans as a force to be reckoned with.\nAmong them is South Korean automaker Hyundai Motor, which recently dropped a deal linked to coal power in Indonesia after concerted efforts and a petition kick-started by Kpop4Planet – an environmental group founded in 2021 by two K-pop fans, Indonesian Nurul Sarifah and South Korean Lee Da-yeon – which garnered about 11,000 signatures in two months.\nHyundai’s decision to end the deal was welcomed by Kpop4Planet, which said: “It is the victory of thousands of K-pop fans who genuinely care about the climate crisis, especially those in Indonesia who have felt the real impact.”\nMs Nurul, 24, told The Straits Times she hopes that going forward, Hyundai’s green investment will support “just and clean” energy transition in Indonesia.\nIn April, Hyundai announced it had scrapped plans to purchase aluminium for its electric vehicles (EVs) from Adaro Minerals, a unit of Indonesia’s second-largest coal miner Adaro Energy. The deal drew flak from environmental groups as Adaro Minerals’ aluminium smelter would be powered by a new 2.2-gigawatt coal-fired power plant.\nThe memorandum of understanding signed in 2022 with Adaro Minerals gave Hyundai the right to purchase low-carbon or “greener” aluminium from a hydroelectric-powered plant. However, the hydro-powered plant is expected to be up and running only in 2030, so in the meantime, the aluminium would be produced at a coal-fired smelter.\nIn 2021, co-petitioner Korea Beyond Coal – a coalition of civic groups calling for South Korea to stop using coal power – teamed up with Kpop4Planet to raise awareness about the plans for a coal-burning power plant.\nThe plant was to be sited near Maengbang Beach, the photo shoot location of one of the album artworks for K-pop band BTS’ hit songs. Hence, it is a popular destination for the band’s fans.\nAlthough plans for the power plant itself are still going ahead, green groups said they managed to raise considerable awareness about the environmental issues caused by coal power, while teaming up with K-pop fans.\nThe global legion of K-pop fans exerts immense influence due to their numbers, social media reach and purchasing power. As at 2022, South Korean content exports including K-pop and other pop culture forms such as television serials and movies had an estimated worldwide value of US$12.45 billion (S$16.8 billion), according to South Korea’s Ministry of Culture and Sports. South Korean pop culture fans totalled more than 225 million across 119 countries in 2023, according to the Korea Foundation.\nAround the world, K-pop fans have taken part in protests and promoted social and political causes, even emerging as an important ally for the Black Lives Matter movement in the US.\n“Indonesian K-pop fans, who are usually part of the upper-middle class, have strong purchasing power, and companies that want to maintain a good relationship with them can be influenced by their economic power,” Mr Yohanes Widodo, a communication studies lecturer at the University of Atma Jaya Yogyakarta, told ST.\nThese K-pop fans can also influence public opinion with their massive social media power, making it possible for them to affect the reputation of certain companies or brands, he said, adding that companies “may take into account the reaction of K-pop fans in their business decisions”.\nWhile it is difficult to pin down an exact number, Indonesia’s K-pop fans number in the hundreds of thousands, experts say. The local Instagram accounts of two of the most popular K-pop bands in Indonesia, BTS and Blackpink, have more than 177,000 and 261,000 followers, respectively.\nIn 2023, entertainment industry data from US company Luminate, which tracks the top 100 K-pop artistes’ releases globally, showed that Indonesia accounted for 7.4 billion, or 8.2 per cent, of the 90.4 billion songs (audio and video) streamed from January to September 2023. This makes Indonesia the world’s No. 3 consumer of K-pop streams after Japan and the US, which accounted for 10.8 per cent and 10.2 per cent, respectively.\nSocial media platform X said in a survey released in 2020 that Indonesia was among the top three countries with the highest number of K-pop tweets between July 1, 2019 and June 30, 2020, behind Thailand and South Korea.\nKorean entertainment became popular in Indonesia in the late 2000s, and even more so in the 2010s, as K-dramas and music became mainstream. Today, K-pop groups such as BTS and Blackpink are household names, embraced by big businesses through commercial tie-ups. BTS is currently the brand ambassador for Hyundai’s EV Ioniq while Blackpink was the brand ambassador for Tokopedia, a major Indonesian e-commerce platform.\nUntil fairly recently, however, Indonesian fans have been better known for buy-boost-brag antics such as spending lavishly on K-pop albums and merchandise, and engaging in bullying behaviour online and fandom wars on social media, or being embroiled in scandal over bad behaviour.\nIn January, some K-pop fans, identified as Korean “fansites” – or professional photographers who take high-definition photographs and videos of Korean idols for profit – made the news for their rowdy conduct at the 38th Golden Disc Awards held in Jakarta. Viral videos circulated showing them taunting other fans, making rude gestures, and even throwing workers on the ground, at the annual awards ceremony that honours the best in South Korean music.\nIt is refreshing to see Indonesia’s K-pop power harnessed positively to champion social and green causes, activists say. These range from reducing plastic waste and tree planting to supporting animal conservation and fund-raising for victims of disasters.\nK-pop fans in Indonesia, including BTS’ fandom Army, have joined hands with green groups such as the World Wildlife Fund and Hutan Itu Indonesia (HII) to help fund the conservation of older trees and plant trees across the country since 2022, said Ms Banon Pramesty Wulandari, an activist at local environmental organisation HII.\n“They serve as a good role model for other clubs of enthusiasts to contribute to nature conservation,” she said.\nMembers of ELF Indonesia, K-pop boy band Super Junior’s fan base with about 12,000 followers on social media, have raised funds for victims of natural disasters such as floods and earthquakes. Each time, the group is able to collect around 10 million rupiah (S$831) on average in just a few days, said its coordinator, Ms Dea, who goes by only one name.\nMeanwhile, Kpop4Planet has been urging entertainment companies to cut back on plastic waste related to the fan culture of collecting numerous photo cards of band members, which are included in albums and sold as merchandise to adoring K-poppers.\nUniversity lecturer Yohanes said these modest initiatives, ranging from tree planting to beach cleanups, could develop into a “sustainable movement” spearheaded by Indonesia’s K-pop fans.\nThe fans are mostly young, comfortably middle class and environmentally aware, he noted, adding: “With their social media power, they can communicate and coordinate their actions wherever and whenever they can, and this ensures their high participation and the achievement of their goals.”\nKpop4Planet’s Ms Nurul said: “Our campaigns have shown that K-pop fans can bring a real impact. As the young generation, we care a lot about the environment because this is about our future.”\nCorrection note: In an earlier version of the story, we said that Kpop4Planet has been urging entertainment companies to cut back on paper waste, when it should have been plastic waste. We also said Blackpink is, instead of was, a brand ambassador for Tokopedia. We are sorry for the errors.", "url": "https://www.straitstimes.com/asia/se-asia/indonesia-s-k-pop-fans-get-real-wielding-their-clout-for-social-and-green-causes?utm_campaign=ST_Newsletter_ASIANINSIDER"}