{"authors": [], "date_download": "2024-10-12 13:59:27", "date_modify": "2024-10-12 13:59:27", "date_publish": "2023-09-14 13:15:00", "description": "It aims to stop Australians from giving military training to nations seen as national security risk. Read more at straitstimes.com.", "filename": "asia_australianz_australia-toughens-ban-on-training-certain-foreign-militaries-after-pilot-case_1728741567.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/14/LYNXMPEJ8D01Q-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australia-toughens-ban-on-training-certain-foreign-militaries-after-pilot-case_1728741567.html", "title": "Australia toughens ban on training ‘certain foreign militaries’ after pilot case", "title_page": "Australia toughens ban on training ‘certain foreign militaries’ after pilot case | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY – Australia will toughen laws stopping former defence staff from training “certain foreign militaries”, introducing a penalty of 20 years’ prison and widening the ban to stop any Australians from offering military training to countries seen as a national security risk.\nThe crackdown was prompted by a series of cases in which former military pilots living in Australia had worked for a South African flight school training Chinese pilots, who the United States alleges are Chinese military pilots.\nAustralia’s “Five Eyes” intelligence partners – Britain, the United States, New Zealand and Canada – will be exempt from the new law, the officials said.\nExemptions will also be provided if Australia’s defence minister authorises the training, or if it relates to humanitarian relief or United Nations duties.\nPenalties of up to 20 years’ prison will be imposed on those providing military training or tactics to a foreign military or government body, including hybrid civilian and military organisations or state-owned companies, without authorisation from the defence minister.\nDefence Minister Richard Marles introduced the amendment to Australia’s Parliament on Thursday, saying that the Bill was partially modelled on US laws, and that it would strengthen existing criminal laws in Australia that ban the provision of military training to a foreign government by former Australian defence staff.\nThe new law goes further, stopping any Australian citizen or permanent resident from providing such training without the defence minister’s authorisation.\nThis is meant to “prevent individuals with knowledge of sensitive defence information from training or working for certain foreign militaries or governments where that activity would put Australia’s national security at risk”, Mr Marles said.\nA former US Marine Corps pilot who had recently returned from working in China was arrested in Australia in 2022. He faces extradition to the US on charges of training Chinese military pilots at a South African flying school.\nThe pilot, Australian citizen Daniel Duggan, remains in custody and denies any wrongdoing.\nThe Test Flying Academy of South Africa (TFASA) was placed on a US trade blacklist on the grounds of national security in June for “providing training to Chinese military pilots using Western and Nato sources”.\nThe flight training division of the Aviation Industry Corporation of China, a Chinese state-owned aviation and defence company that was in partnership with TFASA, is also on the blacklist.\nThe Australian home of TFASA chief operating officer Keith Hartley was raided by the Australian Federal Police in November 2022. A court was told that Mr Hartley, a former British military pilot, was suspected of organising the training of Chinese military pilots delivered by the flight school. Mr Hartley has not been charged, and denies any wrongdoing.\nThe new law also forbids working for companies in which a foreign government holds 50 per cent of shares, or where directors are expected to act in accordance with the wishes of a foreign government. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/australia-toughens-ban-on-training-certain-foreign-militaries-after-pilot-case"}