{"authors": [], "date_download": "2024-10-12 13:47:22", "date_modify": "2024-10-12 13:47:22", "date_publish": "2022-07-16 11:56:54", "description": "The leave payments entitle workers to get up to A$750 (S$713) for each seven-day quarantine period. Read more at straitstimes.com.", "filename": "asia_australianz_australia-reinstates-covid-19-quarantine-pay-amid-fresh-omicron-wave_1728740842.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/16/md_cbd_16072022.jpg?VersionId=wYH2z2m4HvFf_5M4L2Xc5W_Nq240c7nO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australia-reinstates-covid-19-quarantine-pay-amid-fresh-omicron-wave_1728740842.html", "title": "Australia reinstates Covid-19 quarantine pay amid fresh Omicron wave", "title_page": "Australia reinstates Covid-19 quarantine pay amid fresh Omicron wave | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY (REUTERS) - Australia will reinstate support payments for casual workers who have to quarantine due to Covid-19, Prime Minister Anthony Albanese said on Saturday (July 16), as a fresh wave of Omicron-driven infections sweeps the country.\nAustralia is battling a major virus outbreak driven by the highly transmissible new Omicron subvariants, BA.4 and BA.5, with authorities warning it could lead to more people ending up in hospitals and further straining the health system.\n\"I want to make sure that people aren't left behind, that vulnerable people are looked after,\" Mr Albanese told reporters after a snap meeting with state leaders.\n\"No one (should be) faced with the unenviable choice of not being able to isolate properly without losing an income and without being put in a situation that is very difficult.\"\nMr Albanese said the leave payments, that ended on June 30 and entitled workers to get up to A$750 (S$713) for each seven-day quarantine period, will be restored and extended until Sept. 30.\nThe extension will cost taxpayers just under A$800 million, to be shared equally between the federal and state governments, Albanese said. People can apply from July 20.\nAs of the end of last year, the government had spent almost A$13 billion on 2.4 million employees in pandemic payments, according to official data, while total federal support since the pandemic began is estimated to be over A$300 billion.\nAuthorities urged people to wear masks indoors and get their booster shots soon as they brace for \"millions\" of new cases over the coming weeks with Australia confronting a tough winter amid the co-circulation of both Covid-19 and the flu virus.\nThe current wave is likely to peak in August, Mr Albanese said, adding health officials have likened the infection rate of the new variants to that of measles.\nHospital admissions in several states have already surpassed record levels, with over 4,600 people in hospitals in Australia.\nSince the pandemic began, Australia has reported about 8.7 million Covid-19 cases and 10,549 deaths, far lower than many countries.", "url": "https://www.straitstimes.com/asia/australianz/australia-reinstates-covid-19-quarantine-pay-amid-fresh-omicron-wave"}