{"authors": [], "date_download": "2024-10-12 13:46:55", "date_modify": "2024-10-12 13:46:55", "date_publish": "2024-05-30 11:04:52", "description": "Ethnic armed groups are expanding and consolidating regions under their control. Read more at straitstimes.com.", "filename": "asia_myanmars-ethnic-armies-consolidate-strongholds-as-junta-weakens-reports-say_1728740815.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/30/LYNXMPEK4T02H-1.jpg?VersionId=UOrOMcGzHf6Ck0gEY54pUSR5mFR6uJLQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_myanmars-ethnic-armies-consolidate-strongholds-as-junta-weakens-reports-say_1728740815.html", "title": "Myanmar’s ethnic armies consolidate strongholds as junta weakens", "title_page": "Myanmar’s ethnic armies consolidate strongholds as junta weakens | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NAY PYI TAW – Myanmar's ruling junta has lost control over vast tracts of territory, including access to much of its international borders, allowing ethnic armed groups to expand and consolidate regions under their control, two reports assessing the conflict said on May 30.\nThe country of 55 million people has been in turmoil since February 2021, when the military ousted an elected government led by Nobel laureate Aung San Suu Kyi, sparking widespread protests.\nThe street demonstrations, which were met with a brutal crackdown, morphed into an armed resistance movement that has combined with many of Myanmar's ethnic rebel armies to pose the most significant challenge to the military in decades.\nThe junta does not have effective control of Myanmar, having lost complete authority over townships covering 86 per cent of the country's territory that are home to 67 per cent of the population, according to the Special Advisory Council for Myanmar (SAC-M).\nA junta spokesman did not respond to a call from Reuters seeking comment.\n“The military junta does not control enough of the territory of Myanmar to uphold the core duties of the state”, the SAC-M, an independent group of international experts set up after the coup to support the return of democracy, said in a briefing paper.\n“The junta has abandoned significant territory and has been forced into a defensive posture in most parts of the country where it remains present.”\nOperation 1027, a coordinated offensive last October led by three ethnic armies, marked a key moment that exposed a weakened military, which ceded swathes of borderlands in Myanmar’s north.\nA series of offensives by ethnic armies since have pushed the junta out of peripheral areas all the way from the country's border with Thailand to coastal tracts along the Bay of Bengal.\n“The ethnic armed groups that have achieved many of these military victories are consolidating control of their expanded homeland areas, with many well on the way to establishing autonomous statelets,” the non-profit Crisis Group said in a report.\nThe military’s mounting losses and growing dismay among the elite in the capital Naypyitaw has left junta chief Min Aung Hlaing’s future in serious doubt, although he has packed senior ranks with officers loyal to him, according to Crisis Group.\n“He might thus be able to keep his job, but given the level of discontent, he could nevertheless face a plot to remove him,” it said.\nWith the junta losing control of almost all the country’s borders and non-state administrations likely to expand, neighbouring states, regional blocs and the international community should widen their engagement with resistance groups, both reports said.\nInternal displacement in Myanmar has reached a record high, with over three million people forced out of their homes because of the escalating conflict, according to UN agencies.\n“The international community must understand this reality and work directly with resistance authorities and civil society to deliver urgent aid and assistance to the Myanmar people,” said Dr Yanghee Lee, one of SAC-M’s founding members. REUTERS", "url": "https://www.straitstimes.com/asia/myanmars-ethnic-armies-consolidate-strongholds-as-junta-weakens-reports-say"}