{"authors": [], "date_download": "2024-10-12 13:37:11", "date_modify": "2024-10-12 13:37:11", "date_publish": "2024-07-28 17:13:31", "description": "The Russian President said that Washington was stoking tensions. Read more at straitstimes.com.", "filename": "asia_putin-warns-the-united-states-of-cold-war-style-missile-crisis_1728740231.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/28/LYNXMPEK6R02U-1.jpg?VersionId=MPYcTXqdHmEX_UPyRCiXxG2..NBLNyky", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_putin-warns-the-united-states-of-cold-war-style-missile-crisis_1728740231.html", "title": "Putin warns the US of Cold War-style missile crisis", "title_page": "Putin warns the US of Cold War-style missile crisis | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW – Russian President Vladimir Putin on July 28 warned the United States that if Washington deployed long-range missiles in Germany starting from 2026, then Russia would station similar missiles in striking distance of the West.\nThe US will start deploying long-range fire capabilities in Germany in 2026 in an effort to demonstrate its commitment to Nato and European defence, the United States and Germany said earlier in July.\nThe United States’ “episodic deployments” are in preparation for longer-term stationing of such capabilities that will include SM-6, Tomahawk cruise missiles and developmental hypersonic weapons that have a longer range than current capabilities in Europe, Washington and Berlin said.\nIn a speech to sailors from Russia, China, Algeria and India to mark Russian navy day in the former imperial capital of St Petersburg, Mr Putin warned the United States that it risked triggering a Cold War-style missile crisis with the move.\n“The flight time to targets on our territory of such missiles, which in the future may be equipped with nuclear warheads, will be about 10 minutes,” Mr Putin said.\n“We will take mirror measures to deploy, taking into account the actions of the United States, its satellites in Europe and in other regions of the world.”\nMr Putin said Washington was stoking tensions and had transferred Typhon missile systems to Denmark and the Philippines, and compared the US plans to the Nato decision to deploy Pershing II launchers in Western Europe in 1979.\nThe Soviet leadership, including then General Secretary Yuri Andropov, feared that Pershing II deployments were part of an elaborate US-led plan to decapitate the Soviet Union by taking out its political and military leadership.\n“This situation is reminiscent of the events of the Cold War related to the deployment of American medium–range Pershing missiles in Europe,” Mr Putin said.\nMr Putin repeated an earlier warning that Russia could resume production of intermediate- and shorter-range nuclear-capable missiles and then consider where to deploy them after the US brought similar missiles to Europe and Asia. REUTERS", "url": "https://www.straitstimes.com/asia/putin-warns-the-united-states-of-cold-war-style-missile-crisis"}