{"authors": ["Debarshi Dasgupta"], "date_download": "2024-10-12 13:51:34", "date_modify": "2024-10-12 13:51:34", "date_publish": "2024-09-10 11:41:23", "description": "Non-profit organisations are training the women for blue-collar professions, where they can earn more. Read more at straitstimes.com.", "filename": "asia_south-asia_electricians-e-rickshaw-drivers-indian-women-challenge-patriarchy-as-they-take-on-non-traditional-jobs_1728741094.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/IMG-20240829-WA0101.jpg?VersionId=EqcCqRQMgdM223fh6KoPxccLbipn3tRJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_electricians-e-rickshaw-drivers-indian-women-challenge-patriarchy-as-they-take-on-non-traditional-jobs_1728741094.html", "title": "Electricians, e-rickshaw drivers: Indian women challenge patriarchy with non-traditional jobs", "title_page": "Electricians, e-rickshaw drivers: Indian women challenge patriarchy with non-traditional jobs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI – As a nurse in a small hospital in Jabalpur, a city in central India, Ms Manjulata Patel earned about 3,000 rupees ($46.50) every month.\nThis meagre salary meant she could only afford to rent a rundown one-room apartment, with electrical appliances that did not function reliably.\nThe only electrician she could afford turned out to be a drunkard who made her feel uncomfortable, forcing her to summon a few children from the neighbourhood for protection whenever he came to her flat for repairs. He even tried to touch her “inappropriately” at times, Ms Patel, 40, told The Straits Times.\nThis unpleasant experience triggered a brainwave that made her reinvent herself: What if she became an electrician?\n“Had there been a woman electrician, I could have called her and not faced all these problems,” she said, recollecting her experiences.\nToday, having finished her four-month course in August, Ms Patel repairs electrical components for motor vehicles for a company in Indore, a city in the state of Madhya Pradesh, earning 8,500 rupees (S$132) each month.\nThis career breakthrough came after Ms Patel found out about Indore-based Samaan Society, one of several Indian non-profit organisations training women in non-traditional livelihoods (NTLs).\nThousands of women across the country have already been trained by these organisations to work as taxi drivers, bike mechanics, electricians, masons, plumbers and in other blue-collar jobs.\nAs more Indian women seek work, NTLs have become an important way to expand the range of career options available to them while addressing their growing aspirations in a country where job creation has lagged behind the several millions joining the workforce each year.\nIn so doing, these non-profit organisations have also helped break down gender stereotypes and financially empower women from low-income groups.\nThe opportunity to move away from conventional low-skill, low-paying roles such as domestic helpers and home-based businesses like tailoring and pickle-making has made these women more confident and outspoken.\nIn India, just 37 per cent of women in the working-age group (between 15 and 64) are employed. This trails far behind the global female labour force participation rate average of 53.8 per cent, creating a workforce with a heavy gender imbalance.\nAccording to the Centre for Monitoring Indian Economy, a business information company, only 38.2 million of the 405.8 million employed people in 2022-23 were female.\nYet, there are about 450 million working-age women in India, posing a challenge for the country as it strives to create jobs for its youth, especially women, and works towards becoming a US$30 trillion (S$39 trillion) economy by 2047.\nMr Rajendra Bandhu, Samaan Society’s founder, said men from low-income families usually have similar education levels as the women but are able to secure skilled jobs and earn more because they have the technical skills.\n“And it is because women do not have access to these skills that they are stuck with jobs with no dignity and poor money,” he added.\nMore than 450 women trained by his organisation are working, mostly as taxi drivers and bike mechanics, and have become more confident in expressing themselves. “They have also become decision-makers in their families,” he told ST.\nChallenges remain, such as changing the mindsets of families and trainers who still think such roles are not meant for women.\nBefore she learnt about Samaan online, Ms Patel had approached several electrical appliance stores for an apprenticeship but was told that women are not suited to become electricians.\n“What will they do in this profession? We don’t teach this to women,” Ms Patel claims to have been told.\nStill, the rate of women quitting Samaan’s training programmes is up to 25 per cent, with some withdrawn by their families to do domestic work like childcare or household chores.\nWhile learning how to drive was no challenge for her, it took a while to get used to the derisive stares and comments from locals in this largely rural area.\n“People would say, ‘Look, a woman is driving a rickshaw... God knows what will happen next’,” she recollected.\n“I felt a bit odd, but then I thought, what does it matter what people say or think? We need to be concerned with ourselves, we should run our rickshaw and focus on our work,” said Ms Bharti.\nTackling such regressive attitudes head on has made her feel like Lakshmibai Newalkar, the legendary 19th-century queen of Jhansi in Uttar Pradesh, who confronted British colonial forces on the battlefield, she said.\n“It has really increased my courage... I can talk to people, meet them, and go wherever I want.\n“My biggest happiness is that I have learnt how to drive an e-rickshaw and I am keeping my children happy. I am earning money and getting them educated. I have become competent.”\nAnother advantage is that she gets paid on the spot by passengers, unlike when working in home-based businesses where clients often insist on paying later.\nAround 110 women from low-income groups in Mirzapur district today drive their own e-rickshaws, which they bought with low-interest loans.\n“As proud pioneers, these women provide a safety net for women entrepreneurs, and school and college-going girls,” said Ms Kanika Verma, vice-president at Development Alternatives.\nThe goal is to scale this up to 1,000 “e-rickshaw entrepreneurs” across four districts of Uttar Pradesh by June 2025.\nThese women have formed a support group and are training others to become e-rickshaw drivers and, if needed, convince their families to allow them to step out and work.\nA key reason for choosing e-rickshaws is to break away from the traditional enterprises women usually set up and run in India, and address their desire to do more.\n“The narrative that this is all women can do – because they need to be in the house as they don’t have access to safe transport – must be challenged,” Ms Verma told ST.\n“So we wanted to flip the question... What if women are at the forefront of safe mobility? What if they are the ones who enable all these other women entrepreneurs to come out of the house and set up their own businesses?” she added.\nMr Shrinivas Rao, national lead of Azad Foundation, a non-profit organisation based in Delhi, said the biggest restriction patriarchy imposes on a woman is mobility, limiting her freedom to exercise her choices.\nNTLs undo this by taking women out of “the comfort zone of their homes and exposing them to a challenging territory”.\n“And because you are swimming against the tide, it makes you stronger. And this strength gives you the confidence and ability to exercise different choices that you want to make,” he said.\nAlong with its partners, the foundation has trained around 5,000 women to become taxi, truck and bus drivers since 2008, and helped them secure jobs.\nBut several challenges still need to be tackled to promote female employment, including something as basic as access to toilets for women.\n“Unless and until there are more facilities like childcare facilities, working women hostels, safe and hygienic washrooms, it will be very difficult for women to come into the workforce,” added Mr Rao.", "url": "https://www.straitstimes.com/asia/south-asia/electricians-e-rickshaw-drivers-indian-women-challenge-patriarchy-as-they-take-on-non-traditional-jobs"}