{"authors": [], "date_download": "2024-10-12 13:36:05", "date_modify": "2024-10-12 13:36:05", "date_publish": "2023-10-15 11:40:00", "description": "Wang Yi also urged the US to “play a constructive and responsible role” in the conflict. Read more at straitstimes.com.", "filename": "asia_east-asia_chinese-envoy-to-visit-middle-east-next-week-to-push-peace-talks-state-media_1728740165.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/15/TOPSHOTS-TOPSHOT-PALESTINIAN-ISRAEL-CONFLICT-162744.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinese-envoy-to-visit-middle-east-next-week-to-push-peace-talks-state-media_1728740165.html", "title": "China says Israel acting ‘beyond scope of self-defence’", "title_page": "China says Israel acting ‘beyond scope of self-defence’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – Israel’s actions in Gaza have gone “beyond the scope of self-defence” and the Israeli government must “cease its collective punishment of the people of Gaza”, Chinese Foreign Minister Wang Yi said in remarks published on Sunday.\nHe said this on a call to his Saudi Arabian counterpart, Prince Faisal bin Farhan, on Saturday, as Israel appeared poised for a ground offensive against Hamas militants in Gaza.\n“Israel’s actions have gone beyond the scope of self-defence,” Mr Wang said, according to a Foreign Ministry readout.\n“It should listen earnestly to the calls of the international community and the United Nations Secretary-General, and cease its collective punishment of the people of Gaza,” he added, in the strongest stance China has expressed so far on the conflict.\nMore than one million people in the northern part of Gaza have been ordered to evacuate ahead of Israel’s expected assault, an exodus that aid groups said would set off a humanitarian disaster.\nThe cramped and impoverished territory, where 2.3 million residents live on top of one another, has been under a land, air and sea blockade since 2006.\nAfter Hamas fighters broke through the heavily fortified border between the Gaza Strip and Israel to gun down, stab and burn to death more than 1,400 people, Israel launched a massive retaliatory bombing campaign targeting the Islamist group, killing over 2,450 in Gaza.\nMost of those killed on both sides are civilians.\nMr Wang told Prince Faisal that “all parties should not take any action to escalate the situation and should return to the negotiating table as soon as possible”.\nIn another call with his Iranian counterpart on Sunday, Mr Wang said China supports the “just cause of the Palestinian people in safeguarding their national rights”.\n“The root cause... of the Palestine-Israel situation is that the Palestinian people’s right to statehood has been set aside for a long time,” Mr Wang said in a call with Iran’s Foreign Minister Hossein Amir-Abdollahian on Sunday, according to an official Chinese readout.\n“This historical injustice should end as soon as possible,” Wang said, adding that “China will continue to stand on the side of peace and support the just cause of the Palestinian people in safeguarding their national rights.”\nHe also said in a separate call with United States Secretary of State Antony Blinken on Saturday that Washington should “play a constructive and responsible role” in the conflict, and urged “the convening of an international peace meeting as soon as possible to promote the reaching of broad consensus”.\nSpillover fears\nChina’s official statements on the conflict have not specifically named Hamas in their condemnations of violence, leading to criticism from some Western officials who said they were too weak.\nThe country’s state broadcaster CCTV said on Sunday that China’s special envoy Zhai Jun “will visit the Middle East next week to coordinate with various parties for a ceasefire, to protect civilians, ease the situation, and promote peace talks”.\nMr Zhai reportedly said in an interview with CCTV that “the prospect of further broadening and outward spillover (of the conflict) is deeply worrying”.\nHe met the Arab League’s representatives in China on Friday, and said Beijing supported the regional group “in playing an important role on the Palestine issue”, according to a Foreign Ministry statement.\nHe told the bloc that Beijing would “make unremitting efforts to get the Middle East peace process back on track”, the statement added. AFP", "url": "https://www.straitstimes.com/asia/east-asia/chinese-envoy-to-visit-middle-east-next-week-to-push-peace-talks-state-media"}