{"authors": ["Ram Anand"], "date_download": "2024-10-12 14:05:03", "date_modify": "2024-10-12 14:05:03", "date_publish": "2023-03-03 11:21:06", "description": "His co-accused, former 1MDB chief Arul Kanda Kandasamy, was also acquitted. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysian-jailed-ex-leader-najib-acquitted-of-audit-tampering-charge-linked-to-1mdb-scandal_1728741903.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/03/1962175_8.jpg?VersionId=PeeZrBTmJTELXi.yRVfexQQHjFiozQFJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysian-jailed-ex-leader-najib-acquitted-of-audit-tampering-charge-linked-to-1mdb-scandal_1728741903.html", "title": "Ex-Malaysia PM Najib acquitted in second 1MDB-linked trial", "title_page": "Ex-Malaysia PM Najib acquitted in second 1MDB-linked trial | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Malaysia’s imprisoned former premier Najib Razak scored his first legal victory in relation to dozens of court charges he has faced over the 1Malaysia Development Berhad (1MDB) scandal since 2019, after he was acquitted without being called to defend himself in an audit tampering trial on Friday.\nNajib, who is serving a 12-year prison sentence for his graft conviction in 2022, was acquitted by the Kuala Lumpur High Court on charges of abusing his power by tampering with an audit on the scandal-ridden sovereign wealth fund in 2016.\nHis co-accused in the case, former 1MDB chief executive Arul Kanda Kandasamy, was also acquitted of the charges.\nNajib, 70, is currently also seeking a judicial review of the graft conviction, which is set to be decided before the end of March. Until Friday, he had not won any legal battles over the 42 1MDB charges that have been levelled against him.\nJustice Mohamed Zaini Mazlan, who has been elevated to the Court of Appeal since the audit tampering trial started, said on Friday that the prosecution failed to establish a prima facie case against Najib and Mr Arul Kanda.\nThe trial on audit tampering is one of three that Najib is currently facing in Malaysian courts in relation to the scandal surrounding 1MDB – a sovereign wealth fund he founded, which later went on to lose billions in taxpayers’ money.\nIn 2022, he was convicted and imprisoned by Malaysia’s highest court, the Federal Court, in the first of the trials – on graft charges involving RM42 million (S$12.6 million) from former 1MDB subsidiary SRC International.\nA third trial, involving RM2.28 billion in 1MDB monies, is being heard in the High Court, and is at the prosecution stage, while another criminal breach of trust charge involving RM6.6 billion has yet to go to a full trial.\nThe audit tampering charges carry a maximum prison term of 20 years, and it remains unclear if the prosecution will be appealing against the acquittal.\nNajib’s wife Rosmah Mansor, who has also been convicted of corruption and is out on bail pending appeal, told reporters outside the High Court that the verdict is a “win” for the family.\nNajib is one of several high-profile leaders from Umno – the country’s longest-ruling party – who have faced graft charges in the courts since the party lost federal power for the first time in its history in 2018.\nDeputy Prime Minister Zahid Hamidi – a Najib ally – is also facing multiple graft charges, although he was similarly acquitted without being called to defend himself in the first of the trials in 2022.\nThe High Court on Friday also issued a certificate of indemnity for Mr Arul Kanda following his acquittal.\nHe turned into a prosecution witness over the course of the trial, and Justice Zaini said no further civil or criminal case can be brought against Mr Arul Kanda in relation to the audit tampering case in the future, as he had been “truthful” throughout the proceedings in the case.\nThe certificate of indemnity likely means that Mr Arul Kanda will not be standing in the dock alongside Najib should prosecutors decide to appeal against Friday’s acquittal.", "url": "https://www.straitstimes.com/asia/se-asia/malaysian-jailed-ex-leader-najib-acquitted-of-audit-tampering-charge-linked-to-1mdb-scandal"}