{"authors": [], "date_download": "2024-10-12 13:31:30", "date_modify": "2024-10-12 13:31:30", "date_publish": "2022-10-22 23:36:18", "description": "Congestion was caused by many people travelling by bus for the long weekend. Read more at straitstimes.com.", "filename": "asia_se-asia_johor-police-deploy-more-manpower-to-ease-congestion-at-malaysia-ciq_1728739890.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/22/jb20ciq_1.png?VersionId=Mw0HwFkScieiYbBmHaOYIP5A5oXKoN9F", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_johor-police-deploy-more-manpower-to-ease-congestion-at-malaysia-ciq_1728739890.html", "title": "Johor police deploy more manpower to ease congestion at Malaysia CIQ", "title_page": "Johor police deploy more manpower to ease congestion at Malaysia CIQ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JOHOR BARU - Malaysian police have deployed additional manpower to control the crowd travelling through the Malaysian side of the Customs, Immigration, and Quarantine Complex (CIQ) at the Causeway.\nJohor Bahru South district police chief Raub Selamat said the move was made after the authorities received reports on congestion caused by a huge number of people travelling by bus for the long weekend. Deepavali will be celebrated on Monday, a public holiday, in both Malaysia and Singapore.\n“Around 8pm on Friday, more than 5,000 travellers arrived at the complex, causing two hours of congestion from the passport clearance counter to the bus terminal.\n“There are a few incidents of pushing, but we have managed to control this incident from escalating further,” he said in a statement on Saturday.\nAuthorities at the Bangunan Sultan Iskandar CIQ have also tightened surveillance and control with the assistance of the auxiliary police and the Rela volunteer corps, he added.\n“The congestion had eased around 10.30pm,” he said.\nAssistant Commissioner of Police Raub said this following a viral video showing a police officer trying to control a huge crowd who were pushing and shouting to get onto an escalator at the CIQ. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/johor-police-deploy-more-manpower-to-ease-congestion-at-malaysia-ciq"}