{"authors": [], "date_download": "2024-10-12 13:27:59", "date_modify": "2024-10-12 13:27:59", "date_publish": "2024-01-24 16:40:00", "description": "The admission of new workers potentially means that an additional 5.2 million tons of fresh fruit bunches can be harvested. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-palm-oil-harvest-gets-boost-from-foreign-worker-move_1728739679.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/24/btpalm20240123.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-palm-oil-harvest-gets-boost-from-foreign-worker-move_1728739679.html", "title": "Malaysia palm oil harvest gets boost from foreign worker move", "title_page": "Malaysia palm oil harvest gets boost from foreign worker move | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Palm oil output in Malaysia, the No. 2 supplier, could rise 5 per cent in 2024 after the government allowed plantations to hire foreign workers, said Mr Joseph Tek, chief executive of the Malaysian Palm Oil Association.\nThe admission of new workers potentially means that an additional 5.2 million tonnes of fresh fruit bunches can be harvested, the top growers’ group said in a statement. That translates into one million tonnes of crude palm oil, Mr Tek said.\nThe extra tonnage would also generate revenue of close to RM4 billion (S$1.13 billion), bringing “significant relief” to the industry, which is grappling with a substantial shortage of 40,000 workers, the group said. The news pressured benchmark palm oil futures in Kuala Lumpur trading.\nThe government has been trying to reduce reliance on cheap foreign labour across many industries, including manufacturing, construction and plantations, and seeks to regulate admission processes to prevent any issues like forced labour, worker exploitation and human trafficking.\nIn March 2023, the country temporarily suspended the application and approval process for foreign workers under a quota system in order to speed up the entry of workers already approved.\nMalaysia’s palm oil industry is heavily reliant on foreign labour. A chronic shortage of workers resulted in revenue losses estimated at RM20 billion in 2022 and continued to curb growth in output in 2023.\nPalm oil production in Malaysia totalled 18.55 million tonnes in 2023 and earlier in January, the Palm Oil Board, which regulates the industry, predicted output of 18.75 million tonnes for 2024. This is less than half the supply from top producer Indonesia, where output has expanded steadily in recent years.\nThe association represents over 40 per cent of the oil palm area in Malaysia. Members include some of the top plantation companies such as Sime Darby Plantation, Kuala Lumpur Kepong, IOI Corp. and FGV Holdings.\nPalm oil futures in Kuala Lumpur climbed as much as 0.9 per cent to 3,985 ringgit a tonne on Jan 24, before paring gains to RM3,955 by midday. REUTERS", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-palm-oil-harvest-gets-boost-from-foreign-worker-move"}