{"authors": [], "date_download": "2024-10-12 13:45:24", "date_modify": "2024-10-12 13:45:24", "date_publish": "2024-10-02 15:55:35", "description": "MANILA - Global defence contractors put their advanced hardware on display as the Philippines embarks on the latest phase of a multi-billion-dollar effort to modernise its military at a time of rising tension in the South China Sea. Read more at straitstimes.com.", "filename": "asia_philippines-draws-defence-firms-as-military-modernises-amid-south-china-sea-tension_1728740724.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/ST-logo-placeholder_14.jpg?VersionId=wsoUo5t6nmHpzkrv7aet5KYhf6fO0VPW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_philippines-draws-defence-firms-as-military-modernises-amid-south-china-sea-tension_1728740724.html", "title": "Philippines draws defence firms as military modernises amid South China Sea tension", "title_page": "Philippines draws defence firms as military modernises amid South China Sea tension | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA - Global defence contractors put their advanced hardware on display as the Philippines embarks on the latest phase of a multi-billion-dollar effort to modernise its military at a time of rising tension in the South China Sea.\nFrom Lockheed Martin of the United States to Sweden's Saab, Israel's Rafael, and the India-Russia joint venture BrahMos, a total of 291 firms showcased military technology and weapons systems at an exhibition in Manila last week.\n\"The Philippines is an emerging market for the defence industry,\" said Chester Cabalza, president of a Manila-based think tank, International Development and Security Cooperation.\nManila has allocated $35 billion for the buildup, spread over the next decade, as it has faced off with China in sea and air confrontations over contested areas of the busy South China Sea waterway.\n\"Our strategic issues with China have caught the attention of defence firms, and the exhibit demonstrates support from like-minded nations, many of whom are our partners and allies,\"\nCabalza added.\nUnder President Ferdinand Marcos Jr, the Philippines has looked beyond traditional ally the United States to step up security partnerships with nations, such as Japan and Australia, also concerned at China's increasing regional influence.\n\"The goal of modernisation is to develop a credible defence force, whether there's the China issue or not,\" said Jesus Avilla, a former assistant defence secretary, while visiting the biennial Asia Defence and Security (ADAS) exhibition.\nIn the third phase of a decades-long effort to beef up territorial defence and maritime security, the Philippine military is looking to buy advanced assets such as fighter jets, submarines and missile systems.\nWhile long-standing military ties ensure the United States is a key supplier, the Philippines has widened defence procurement to nations such as India, Israel, Poland, South Korea and Turkey.\nReflecting Manila's expanding role in regional security, the exhibition featured new companies, and participating nations such as Britain, France and Japan.\nAvilla stressed the urgency of modernisation as strategic challenges now stretch to encompass economic and food security, as the South China Sea holds crucial resources.\nChina claims almost the entire waterway, a conduit for more than $3 trillion of annual ship-borne commerce, despite overlapping claims by Brunei, Indonesia, Malaysia, the Philippines and Vietnam.\nHowever, in 2016, the Permanent Court of Arbitration said its claims had no legal basis, a decision China rejects.\n\"Our enemy is not joking because they can see that our equipment is not enough,\" said Philippine navy officer Alandel Drilon, while inquiring about a multiple rocket launcher system.\n\"That's our weakness at the moment, our vessels, they are old, so this exhibit is a good chance for our officers to see how they can improve our equipment.\"\nIn 2022, the Philippines bought a $375-million BrahMos anti-ship missile system, and the firm is now offering a ship-mounted version.\n\"We hope for a positive outcome soon,\" added Praveen Pathak, its director for market promotion and export.\nState-run Israel Aerospace Industries (IAI), which has earlier supplied advanced surveillance capabilities, such as electro-optic systems, is also ready to provide items from reconnaissance aircraft to coastal radar, said Maxim Zemer, a senior marketing official for Asia and Africa.\nThe Philippines is also evaluating offers for 40 multirole fighter aircraft. Though it has not disclosed specific bidders, Saab, with its Gripen jets, is widely considered a contender.\n\"We want to deliver credible, sustainable, cost-efficient, offensive air power to the Philippines,\" said Jussi Halmetoja, air operations adviser and test pilot at Saab.\nSaab has had \"fruitful negotiation\" with the Philippine defence ministry, Halmetoja added, and was ready to meet the needs of its air force.\nA Gripen E fighter jet on display outside the exhibition drew throngs of visitors, some from the military, who sat in its cockpit, posing for photographs.\n\"Modernising our forces will take time due to the resources needed, but ADAS allows us to explore the capabilities available,\" said Lieutenant General Charlton Sean Gaerlan, the Philippine armed forces' deputy chief of staff.\n\"It also gives us the opportunity to engage with defence companies to ensure we select the best systems for our needs.\" REUTERS", "url": "https://www.straitstimes.com/asia/philippines-draws-defence-firms-as-military-modernises-amid-south-china-sea-tension"}