{"authors": [], "date_download": "2024-10-12 14:05:19", "date_modify": "2024-10-12 14:05:19", "date_publish": "2024-01-15 22:32:00", "description": "Najib Razak called for documentary to be removed, saying it is defamatory, sub judice, in contempt of court. Read more at straitstimes.com.", "filename": "asia_se-asia_no-reason-to-ban-netflix-s-man-on-the-run-say-m-sian-constitutional-experts_1728741919.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/15/file61mg41zvolc1bjzp3hrv.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_no-reason-to-ban-netflix-s-man-on-the-run-say-m-sian-constitutional-experts_1728741919.html", "title": "No reason to ban Netflix show Man On The Run, say Malaysia’s constitutional experts", "title_page": "No reason to ban Netflix show Man On The Run, say Malaysia’s constitutional experts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA – There is no reason to ban the Netflix documentary Man On The Run, say constitutional experts, despite claims that it is sub judice or tantamount to contempt of court.\nEmeritus Professor Shad Saleem Faruqi said while it can be argued that the documentary may be sub judice to the ongoing 1Malaysia Development Berhad (1MDB) trial, there is no evidence that it could amount to contempt of court.\nHe said the rules on sub judice and contempt of court were created during the days when Malaysia still practised jury trials, but these were abolished in 1995.\n“At the time, there was a real danger that members of the public who are on the jury may be influenced by comments they hear, but those days (of jury trials) are gone.\nHe said: “Judges who hear cases nowadays are trained, intellectually and emotionally mature, and impartial, and make decisions according to the law and based on admissible evidence, despite whichever direction the wind is blowing.\n“While I agree that the show could be sub judice, I don’t agree that it is in contempt of court and it should not be banned because our judges will not be influenced when making decisions.”\nThe jury trial system in Malaysia was abolished on Jan 1, 1995.\nAlthough the call for its repeal had been made several years earlier, it was expedited after the Mona Fandey case in 1993.\nThe sensational nature of that crime had heightened concerns that jury verdicts could be coloured by emotions and media bias.\nIn that case, a state assemblyman was murdered and dismembered by pop singer turned bomoh Mona Fandey, her husband and an assistant. They were sentenced to death.\nGiven that the 1MDB case has been widely reported worldwide for about 10 years, Prof Shad Saleem said banning such a documentary would not be sensible, adding that the country should put its trust in the judiciary.\n“It’s not like we don’t know about 1MDB and all the allegations. There have also been court trials in other countries, and this has been going around for many years,” he added.\nOn the arguments that the documentary could be deemed defamatory to former prime minister Najib Razak, he said there was a difference between “defamatory” and “denigratory”.\n“If you see someone short and you call him ‘hello shorty’, that is not defamation, it is an insult. It is not proper, but it is not a crime.\n“The difference is that if you paint someone in a bad light, but it is the truth, then it is denigratory.\n“So, if Najib’s lawyers believe it is defamatory, they should take it to court and see if it will issue an injunction (on the documentary).\n“However, can the injunction be enforced? Netflix is an international streaming platform and this will be a challenge because Section 3(3) of the Communications and Multimedia Act 1998 does not permit censorship of the Internet.\n“This is the age of information. How in the world do you stop information from reaching judges, lawyers, prosecutors and the public?”\nProfessor Nik Ahmad Kamal Nik Mahmood of International Islamic University Malaysia said instead of making the sub judice arguments publicly, the relevant parties should leave it to the courts to decide.\nSince the argument on sub judice could go both ways, a neutral party must make the decision, he said.\n“And that (neutral party) is the courts. The term ‘sub judice’ first and foremost means that the matter is already in court and whatever reported or shown is something that may affect the judgment of the judge.\n“Anyone can say something is sub judice or not. In this case, all of the information shared (in the documentary) is in the public domain and from the earlier trials, so these are the arguments that the defence can use to say it is not sub judice,” he said.\nThe 98-minute documentary Man On The Run was first screened in Malaysian cinemas on Oct 19, 2023, and appeared on Netflix on Jan 5.\nThe documentary highlights fugitive Malaysian financier Low Taek Jho, or Jho Low, and his dealings with the controversial 1MDB, and features interviews with Najib and Prime Minister Anwar Ibrahim.\nNajib’s lawyers have called for the removal of the documentary from Netflix, claiming that the show is defamatory, biased, sub judice, offensive and in contempt of court in light of the former premier’s ongoing 1MDB trial.\nWhile Datuk Seri Anwar said the government would look into the request, Lawyers For Liberty said it would be unlawful for Putrajaya to remove the documentary given that the issue is currently under the jurisdiction of the courts. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/no-reason-to-ban-netflix-s-man-on-the-run-say-m-sian-constitutional-experts"}