{"authors": [], "date_download": "2024-10-12 14:12:35", "date_modify": "2024-10-12 14:12:35", "date_publish": "2022-10-23 13:57:30", "description": "The men will set the path of China’s development and international relations for the next five years. Read more at straitstimes.com.", "filename": "asia_east-asia_china-unveils-top-leadership-who-s-who-in-the-line-up_1728742355.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/YsfuPVodKLa1rNuthL5IEH5ZQSwNT-Mw6jdFi29YPlQ.jpg?VersionId=yI2dgFQ3K.GMj7Oh7JLFQtEVKDnZ6m7L", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-unveils-top-leadership-who-s-who-in-the-line-up_1728742355.html", "title": "China unveils top leadership: Who’s who in the line-up", "title_page": "China unveils top leadership: Who’s who in the line-up | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "China’s President Xi Jinping on Sunday unveiled his new Politburo Standing Committee, the country’s top leadership circle, as he secured a third term as leader of the Communist Party.\nThe committee will set the path of China’s development and international relations for the next five years.\nHere are the seven men elected by the Central Committee – the biggest of the party’s top decision-making bodies – to the pinnacle of China’s political power.\nXi Jinping, 69\nSeen as a princeling because of his background as the son of revolutionary veteran Xi Zhongxun - one of the party’s founders - Mr Xi has spent time in the provinces of Shaanxi, Hebei, Fujian and Zhejiang, as well as the city of Shanghai. He is China’s most powerful leader since Chairman Mao Zedong. After he came to power in 2012, Mr Xi eliminated his rivals through his anti-graft campaign and placed allies in key positions.\nLi Qiang, 63\nThe party’s chief of ideology, Mr Wang was an academic in Shanghai’s prestigious Fudan University before he was summoned to Beijing by former president Jiang Zemin in 1995. He is widely seen as the brain behind the political ideologies of China’s three leaders - Mr Jiang, Mr Hu Jintao and Mr Xi. He has never run a province or city, but Chinese netizens call him “guoshi”, after wise and powerful state councillors in imperial China.\nCai Qi, 67\nThe current party boss of Beijing, Mr Cai had worked under Mr Xi in Fujian and Zhejiang provinces and is also seen as part of the New Zhijiang Army faction. In Fujian, Mr Cai worked with the top Chinese leader for 15 years in various positions, and then when Mr Xi was party secretary of Zhejiang from 2002 to 2007. He was appointed Beijing’s party secretary in 2017, a highly unusual move since unlike the city’s past party bosses, he had not previously served on the Central Committee, the top leadership body of the Communist party.\nDing Xuexiang, 59\nBefore the party congress, Mr Ding was the director of the Communist Party of China’s powerful General Office, which oversees a wide range of administrative affairs for top leaders. He is considered Mr Xi’s chief of staff and his top aide. His political fortunes grew after he earned Mr Xi’s trust when he served as his political secretary during the latter’s stint as party secretary of Shanghai in 2007.\nLi Xi, 66\nMr Li has been the party secretary of Guangdong province, one of China’s economic centres, since 2017. He is seen to have close ties with Mr Xi, with the connection dating back to the 1980s when Mr Li worked as a secretary to a veteran of the Communist revolution that had close ties to Mr Xi’s father Xi Zhongxun. He was also elected head of China’s anti-corruption body.", "url": "https://www.straitstimes.com/asia/east-asia/china-unveils-top-leadership-who-s-who-in-the-line-up"}