{"authors": [], "date_download": "2024-10-12 13:28:13", "date_modify": "2024-10-12 13:28:13", "date_publish": "2024-01-30 14:30:00", "description": "Scientists identified 182 hospitalisations and outbreaks in 2023, compared with 33 in 2022. Read more at straitstimes.com.", "filename": "asia_east-asia_china-s-rapid-rise-in-potentially-deadly-fungal-infections-sparks-calls-for-monitoring_1728739693.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/30/CHINA-HEALTH-WHO-053823.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-s-rapid-rise-in-potentially-deadly-fungal-infections-sparks-calls-for-monitoring_1728739693.html", "title": "China’s rapid rise in potentially deadly fungal infections sparks calls for monitoring", "title_page": "China’s rapid rise in potentially deadly fungal infections sparks calls for monitoring | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – A rapid rise in Candida auris infections in China has prompted calls for closer monitoring of the potentially fatal fungus amid growing drug-resistance concerns.\nScientists identified 182 Candida auris-associated hospitalisations and outbreaks across the country in 2023, compared with 33 in 2022. Annual reported numbers have varied from eight to 28 since 2016, according to a study led by researchers at Shanghai’s Fudan University and Tongji University.\nWhile the incidence is lower in China than what is reported in the United States, South Africa and India, the spread of Candida auris to at least 18 hospitals in 10 provinces has raised concerns because of the difficulties in diagnosing and treating infections.\nAlmost all of the strains tested in China were resistant to the drug fluconazole, and 2 per cent to 4 per cent could not be treated with caspofungin or amphotericin B, according to the study, published in the journal Emerging Microbes & Infections.\nMost cases in China were identified in the east, in provinces with comparatively developed economies, where hospital clinical microbiology laboratories have advanced instruments and skilled staff, the researchers said.\n“Given the known difficulties in accurately diagnosing C. auris infections, these infections could be significantly underestimated,” they said.\n“Due to its increased incidence worldwide and the fact that several outbreaks have occurred recently in healthcare settings, it is critical to increase awareness of the emerging threat of C. auris to public health.”\nIn the US, where Candida auris is considered an urgent threat, more than 5,650 cases in patients and 13,100 infections among people screened for the fungus have been reported since 2013. BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/china-s-rapid-rise-in-potentially-deadly-fungal-infections-sparks-calls-for-monitoring"}