{"authors": [], "date_download": "2024-10-12 13:37:37", "date_modify": "2024-10-12 13:37:37", "date_publish": "2024-08-09 03:11:41", "description": "WASHINGTON - The United States raises the cases of three detained U.S. citizens in every engagement with the Taliban, and securing their release will remain a top priority, State Department spokesperson Matthew Miller said on Thursday. Read more at straitstimes.com.", "filename": "asia_americans-detained-in-afghanistan-remain-a-priority-says-state-dept_1728740257.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/09/ST-logo-placeholder_23.jpg?VersionId=EARi7Jq4XletltD7eFy9dHRKxngniprQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_americans-detained-in-afghanistan-remain-a-priority-says-state-dept_1728740257.html", "title": "Americans detained in Afghanistan remain a priority, says State Dept", "title_page": "Americans detained in Afghanistan remain a priority, says State Dept | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The United States raises the cases of three detained U.S. citizens in every engagement with the Taliban, and securing their release will remain a top priority, State Department spokesperson Matthew Miller said on Thursday.\nAmericans Ryan Corbett and Mahmood Habibi were detained in separate incidents in August 2022 a year after the Taliban seized Kabul amid a chaotic U.S. withdrawal. A third American, George Glezmann, was detained later in 2022 while visiting as a tourist.\n\"We are deeply concerned about the well-being of Americans unjustly detained in Afghanistan - Mahmood, Ryan and George Glezmann - and raise their detentions at every engagement we have with the Taliban,\" Miller said at a press briefing, ahead of the two-year anniversary of Corbett and Habibi's detention on Aug. 10.\n\"Bringing them home will continue to be a top priority for the United States as we work to obtain their release,\" Miller said.\nThe U.N. Special Rapporteur on torture said in June that Corbett, who lived in Afghanistan for more than a decade and worked for nongovernmental organizations, needed immediate medical care to prevent irreparable harm to his health or even his death.\nSecretary of State Antony Blinken met with Corbett's wife, Anna, in Washington this week, Miller said.\nHabibi was one of 30 or so employees of a U.S.-based communications company who were arrested by the Taliban shortly after a U.S. strike killed al Qaeda leader Ayman Al-Zawahiri. The other employees have been released, but Habibi continues to be held without charge, according to the Foley Foundation, which monitors cases of Americans detained overseas.\nThe State Department has designated Corbett and Glezmann as \"wrongfully detained,\" a label that directs more U.S. government resources toward their cases. Habibi has not yet received such a designation, but that did not mean officials were not working to secure his release, Miller said.\n\"I can tell you we are working overtime to try to get him released as well,\" he said. REUTERS", "url": "https://www.straitstimes.com/asia/americans-detained-in-afghanistan-remain-a-priority-says-state-dept"}