{"authors": ["Lim Ai Leen"], "date_download": "2024-10-12 13:45:58", "date_modify": "2024-10-12 13:45:58", "date_publish": "2024-09-05 20:23:07", "description": "Read more at straitstimes.com.", "filename": "asia_asian-insider-xi-calls-for-deeper-ties-with-africa-how-to-design-a-school-for-monks_1728740758.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/kcai0509.jpg?VersionId=4MDuntQLy9TB_h9ZsAyIu491FO3.GkeP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_asian-insider-xi-calls-for-deeper-ties-with-africa-how-to-design-a-school-for-monks_1728740758.html", "title": "Asian Insider: Xi calls for deeper ties with Africa | How to design a school for monks", "title_page": "Asian Insider: Xi calls for deeper ties with Africa | How to design a school for monks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Dear ST reader,\nWe hope you’ve been keeping well.\nChinese President Xi Jinping stepped up overtures to African countries this week, pledging another 360 billion yuan (S$66 billion) for projects ranging from infrastructure to security cooperation. He was speaking at the opening ceremony of the Forum on China-Africa Cooperation in Beijing, China’s largest diplomatic event since the Covid-19 pandemic.\nStronger relations were also the order of the day in Singapore, with the island republic upgrading its ties with India to a comprehensive strategic partnership during Prime Minister Narendra Modi’s official visit.\nEarlier in the week, Poland’s foreign minister Radek Sikorski was also in town as part of his South-east Asian tour. Find out why he says Poland has a legitimate right to shoot down Russian missiles, in his interview with assistant foreign editor Clement Tan.\nEver wondered what it’s like to fly with the Pope? Our correspondent Wong Pei Ting gives a behind-the-scenes account as the head of the Catholic Church kicks off his gruelling 12-day tour that takes in Indonesia, Papua New Guinea, Timor-Leste and Singapore. Or watch the video here.", "url": "https://www.straitstimes.com/asia/asian-insider-xi-calls-for-deeper-ties-with-africa-how-to-design-a-school-for-monks"}