{"authors": [], "date_download": "2024-10-12 13:40:58", "date_modify": "2024-10-12 13:40:58", "date_publish": "2024-06-02 09:06:00", "description": "The landing elevates China’s space power status in a global rush to the moon. Read more at straitstimes.com.", "filename": "asia_china-makes-historic-landing-on-far-side-of-the-moon_1728740458.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/02/2024-06-02T002759Z421654531RC2WI7A23AZKRTRMADP3SPACE-EXPLORATION-CHINA-MOON.JPG?VersionId=GfpGwgVXAEcqTCHlGtPJGQQ_0aJ8acsb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-makes-historic-landing-on-far-side-of-the-moon_1728740458.html", "title": "China’s space power status gets lift from landing on far side of Moon", "title_page": "China’s space power status gets lift from landing on far side of Moon | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China landed an uncrewed spacecraft on the far side of the Moon on June 2, overcoming a key hurdle in its landmark mission to retrieve the world’s first rock and soil samples from the dark lunar hemisphere.\nThe landing elevates China’s space power status in a global rush to the Moon, where countries including the United States are hoping to exploit lunar minerals to sustain long-term astronaut missions and Moon bases within the next decade.\nThe Chang’e-6 craft, equipped with an array of tools and its own launcher, touched down in a gigantic impact crater called the South Pole-Aitken Basin on the Moon’s space-facing side at 6.23am Beijing time (6.23am Singapore time), the China National Space Administration said.\nThe mission “involves many engineering innovations, high risks and great difficulty”, the agency said in a statement on its website.\n“The payloads carried by the Chang’e-6 lander will work as planned and carry out scientific exploration missions,” it added.\nThe successful mission is China’s second on the far side of the Moon, a region no other country has reached.\nThe side of the Moon perpetually facing away from the Earth is dotted with deep and dark craters, making communications and robotic landing operations more challenging.\nGiven these challenges, lunar and space experts involved in the Chang’e-6 mission described the landing phase as a moment where the chance of failure is the highest.\n“Landing on the far side of the Moon is very difficult because you don’t have line-of-sight communications, you’re relying on a lot of links in the chain to control what is going on, or you have to automate what is going on,” said Mr Neil Melville-Kenney, a technical officer at the European Space Agency working with China on one of the Chang’e-6 payloads.\n“Automation is very difficult especially at high latitudes because you have long shadows which can be very confusing for landers,” Mr Melville-Kenney added.\nThe Chang’e-6 probe was launched on May 3 on China’s Long March 5 rocket from the Wenchang Satellite Launch Centre on the southern island of Hainan, and reached the lunar vicinity roughly a week later before tightening its orbit in preparation for a landing.\nChang’e-6 marks the world’s third lunar landing in 2024: Japan’s Slim lander touched down in January, followed the next month by a lander from US start-up Intuitive Machines.\nThe other countries that have sent spacecraft to Earth’s nearest neighbour are the then Soviet Union and India.\nThe United States is the only country to have landed humans on the Moon, starting in 1969.\nSampling the moon\nUsing a scoop and drill, the Chang’e-6 lander will aim to collect 2kg of lunar material over two days and bring it back to Earth.\nThe samples will be transferred to a rocket booster atop the lander, which will launch back into space and tag up with another spacecraft in lunar orbit before returning, with a landing in China’s Inner Mongolia region expected around June 25.\nIf all goes as planned, the mission will provide China with a pristine record of the Moon’s 4.5 billion-year history and yield new clues on the solar system’s formation.\nIt will also allow for an unprecedented comparison between the dark, unexplored region with the Moon’s better understood Earth-facing side.\nA simulation lab for the Chang’e-6 probe will develop and verify sampling strategies and equipment control procedures, China’s official Xinhua news agency said. It will use a full-scale replica of the sampling area based on exploration results on the environment, rock distribution and lunar soil conditions around the landing site.\nChina’s lunar strategy includes its first astronaut landing around 2030 in a programme that counts Russia as a partner.\nIn 2020, China conducted its first lunar sample return mission with Chang’e-5, retrieving samples from the Moon’s nearer side.\nThe US Artemis programme envisions a crewed Moon landing by late 2026 or later. Nasa has partnered with space agencies including those of Canada, Europe and Japan, whose astronauts will join US crews on an Artemis mission.\nArtemis relies heavily on private companies, including Mr Elon Musk’s SpaceX, whose Starship rocket aims this decade to attempt the first astronaut landing since Nasa’s final Apollo mission in 1972.\nOn June 1, Japanese billionaire Yusaku Maezawa cancelled a private mission around the Moon he had paid for, which was to have used SpaceX’s Starship, citing schedule uncertainties in the rocket’s development.\nBoeing and Nasa postponed the company’s first crewed launch of Starliner, a long-delayed capsule meant to become the second US space taxi to low-Earth orbit. REUTERS", "url": "https://www.straitstimes.com/asia/china-makes-historic-landing-on-far-side-of-the-moon"}