{"authors": [], "date_download": "2024-10-12 13:51:17", "date_modify": "2024-10-12 13:51:17", "date_publish": "2024-01-02 05:58:55", "description": "Each year, Japan experiences up to 2,000 quakes that can be felt by people. Read more at straitstimes.com.", "filename": "asia_major-earthquakes-in-japan-since-kobe-disaster-of-1995_1728741077.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/02/dw-japan-wajima4-240102.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_major-earthquakes-in-japan-since-kobe-disaster-of-1995_1728741077.html", "title": "Major earthquakes in Japan since Kobe disaster of 1995", "title_page": "Major earthquakes in Japan since Kobe disaster of 1995 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – A powerful earthquake struck central Japan on Jan 1, killing at least 48 people, destroying buildings and knocking out power to tens of thousands of homes.\nSituated on the \"Ring of Fire\" arc of volcanoes and oceanic trenches that partly encircles the Pacific Basin, Japan accounts for about 20 per cent of the world's earthquakes of magnitude 6 or greater.\nEach year, the country experiences up to 2,000 quakes that can be felt by people.\nThe following are some major Japanese quakes in the last 30 years:\n– On Jan 16, 1995, an earthquake with a magnitude of 7.3 hit central Japan, devastating the western port city of Kobe. The worst earthquake to hit the country in 50 years killed more than 6,400 and caused an estimated US$100 billion (S$132 billion) in damage.\n– On Oct 23, 2004, a 6.8 magnitude quake struck the Niigata region, about 250km north of Tokyo, killing 65 people and injuring 3,000.\n– On March 11, 2011, a 9-magnitude earthquake and tsunami struck north-east Japan, killing nearly 20,000 people and causing a meltdown in Fukushima, leading to the world's worst nuclear disaster since Chernobyl.\n– On April 16, 2016, a 7.3-magnitude earthquake struck Kumamoto on the southern island of Japan, killing more than 220 people.\n– On June 18, 2018, a magnitude 6.1 earthquake in Osaka, Japan's second-biggest metropolis, killed four people, injured hundreds more and halted factory lines in an industrial area.\n– On Sept 6, 2018, a 6.7-magnitude earthquake paralysed Japan's northern island of Hokkaido, killing at least seven people, triggering landslides and knocking out power to its 5.3 million residents.\n– On Feb 13, 2021, a 7.3-magnitude earthquake hit off the coast of Fukushima in eastern Japan, injuring dozens of people and triggering widespread power outages.", "url": "https://www.straitstimes.com/asia/major-earthquakes-in-japan-since-kobe-disaster-of-1995"}