{"authors": [], "date_download": "2024-10-12 14:02:30", "date_modify": "2024-10-12 14:02:30", "date_publish": "2023-02-17 07:39:14", "description": "Momsitter is an online platform that matches families with potential babysitters. Read more at straitstimes.com.", "filename": "asia_east-asia_korean-babysitter-app-seeks-to-ease-guilt-among-mothers-torn-between-child-and-career_1728741750.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/22/2022-12-08T080340Z1237039678RC2J1Y9IZHI4RTRMADP3SOUTHKOREA-AGE-SYSTEM.JPG?VersionId=j1bQdmv_.QvJ31V2hztzrnH.u.0vqsAq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_korean-babysitter-app-seeks-to-ease-guilt-among-mothers-torn-between-child-and-career_1728741750.html", "title": "South Korean babysitter app seeks to ease guilt among mothers torn between child and career", "title_page": "South Korean babysitter app seeks to ease guilt among mothers torn between child and career | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – Ms Chung Jee-yea overheard a colleague sobbing in a bathroom, unable to find someone on the phone to pick up her sick child from school. It was a moment she, too, would experience as a mother, and one that led her to quit her job and start a service to help parents faced with the same quandary.\nSix years later, Momsitter, an online platform that matches families with potential babysitters, has gained more than one million users. Ms Chung tapped into South Koreans’ technological savvy to respond to a culture that frowns upon working mothers.\n“The culture of guilt is still with us,” said Ms Chung. “We’re so used to having children raised only by mums.”\nMomsitter provides the tools to allow women to challenge the idea that they cannot have both children and a career, she said.\nSuch social pressures contribute to one of the gravest long-term threats to South Korea’s economy: a declining population. The country has the world’s lowest fertility rate.\nPart of the problem is that South Korea’s rapid economic development and urbanisation atomised families, cutting off support networks of relatives. The nation ranks at the bottom for social capital in the developed world, meaning the level of trust among people is exceptionally low. That has a direct impact on economic prosperity, according to the London-based Legatum Institute.\n“It takes an enormous amount of trust to leave your child with someone, but the supply of such people is limited,” said researcher Bae Yun-jin of the Korea Institute of Child Care and Education. “Accessibility of support facilities for mothers also varies for each region.”\nWhile the country has kindergartens, nurseries and public babysitter programmes, Momsitter aims to fill the remaining gaps, particularly for higher-income families.\nWomen’s difficulty in finding childcare support limits South Korea’s economic potential and is reflected in the nation’s struggle to bring its female labour market participation rate above 60 per cent. South Korea and Italy were the only Organisation for Economic Cooperation and Development (OECD) members in 2021 that had per capita gross domestic product above US$40,000 (S$53,600) and a participation rate below 60 per cent.\nAs women feel torn between children and a career, South Korea continues to struggle with a low birth rate. A typical South Korean woman is expected to have an average of 0.81 children over her lifetime, according to the latest data from 2021. The number of newborns is just 0.5 per cent of the population.\nThe declining birth rate threatens to erode prosperity as a shrinking workforce is forced to support a swelling aged population. With fewer babies born and workers to support the economy, growth is also poised to slow.\nAlarmed by the faster-than-expected rate of population ageing, the government is increasing its efforts to encourage people to have more children. President Yoon Suk-yeol has tripled payments for mothers of newborns.\nBut the problem is deeper than financial support.\nEconomists say gender inequality is central to the fertility crisis. On top of the struggle to hold down a job, South Korea has the biggest wage gap between men and women in the developed world. Mothers are considerably less likely to be hired than childless women, according to the OECD.\nThe government launched its own babysitter service in 2007. Some 27,000 sitters helped 78,000 families last year, with a focus on supporting lower-income parents, according to the Ministry of Gender Equality and Family.\nDemand continues to outstrip supply, especially among higher-income parents, often forcing them onto waiting lists. That is where Momsitter comes in – while also helping to boost the supply of babysitters.\nApps similar to Momsitter are also catching on in South Korea, including Tictocrroc and Jaranda. They specialise in providing tutors for specific subjects for children and playmates for young ones.\nMs Chung said her start-up looks to services like Care.com in the United States for pointers. She says local investors such as the Korea Development Bank and Daol Investment have so far embraced her vision, extending funding of 13.3 billion won (S$13.7 million).\nBut there are also lingering concerns about safety and the vetting of sitters. Cases of abuse and harm to children are occasionally reported internationally, often because of the difficulty of checking candidates thoroughly.\nMomsitter administers aptitude tests for babysitters and provides information such as health reports, reviews by other parents and any certificates the babysitters may have. It bans “troublemaking” babysitters and parents from the service for five years, said Ms Chung.\n“Information builds trust and our role is to help mothers make informed decisions,” she said. “We need to break the cycle of mothers having no choice but to be with their children around the clock regardless of whether they want it or not.”\n“We need to keep mothers happy.” BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/korean-babysitter-app-seeks-to-ease-guilt-among-mothers-torn-between-child-and-career"}