{"authors": [], "date_download": "2024-10-12 13:48:13", "date_modify": "2024-10-12 13:48:13", "date_publish": "2024-09-06 18:11:14", "description": "Both sides made progress on talks to draw up funding to help developing countries. Read more at straitstimes.com.", "filename": "asia_us-china-still-have-some-differences-on-climate-finance-us-envoy-says_1728740893.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/06/LYNXMPEK850BS-3.jpg?VersionId=g2YpaAlm_l2.cyhI99FEJ8xdaNi5Tv6y", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_us-china-still-have-some-differences-on-climate-finance-us-envoy-says_1728740893.html", "title": "US, China ‘narrowing’ rift on climate finance in this week’s talks, US envoy says", "title_page": "US, China ‘narrowing’ rift on climate finance in this week’s talks, US envoy says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China and the United States still have “some differences” on issues such as climate finance but have made progress in narrowing them during talks this week, US climate envoy John Podesta said on Sept 6.\n“Notwithstanding some friction in our bilateral relationship, we can find places to collaborate for the good of our people and of our climate,” Mr Podesta told reporters, after meetings with his Chinese counterpart and the Chinese foreign minister, Mr Wang Yi.\nClimate cooperation between the world’s top two emitters of greenhouse gases has helped build consensus for global pacts such as the 2015 Paris Agreement.\nBut experts said little was expected from this week’s round of talks, especially amid uncertainties about the outcome of the US presidential election.\nAs president, Donald Trump ended climate dialogue with China in 2017 and withdrew the United States from the Paris Agreement, and is expected to do so again if he is re-elected in November.\nDuring their meeting on Sept 6, Mr Wang told Mr Podesta that he “hoped that the US side would maintain policy stability”, according to a summary of the meeting issued by China late on Sept 6.\nMr Podesta said the two sides had “excellent discussions” on the upcoming COP29 climate talks in Baku, Azerbaijan in November, where an agreement on a major new fund to help developing countries will be a top priority.\nThe US is seeking to broaden the fund’s contributor base, but China and other large developing countries are concerned that such a move will “dilute” the obligations of rich nations.\nMr Podesta said the two countries also discussed their preparations to submit ambitious 2035 climate targets to the United Nations ahead of the deadline early in 2025. The US is pressing China to pledge substantial cuts in CO2 emissions.\nThe two sides are also planning to hold a bilateral summit on abating non-CO2 greenhouse gases such as methane, Mr Podesta said.\n“They get less attention but they’re fully half of what’s causing global warming,” he said. REUTERS", "url": "https://www.straitstimes.com/asia/us-china-still-have-some-differences-on-climate-finance-us-envoy-says"}