{"authors": [], "date_download": "2024-10-12 13:39:28", "date_modify": "2024-10-12 13:39:28", "date_publish": "2024-08-16 14:25:56", "description": "ANKARA - A forest fire in Turkey's western coastal province of Izmir, fanned by strong winds, is near residential areas, forcing some people to be evacuated, the local governor said on Friday, as firefighters also tried to contain other wildfires in the north. Read more at straitstimes.com.", "filename": "asia_firefighters-battle-to-contain-three-wildfires-in-western-turkey_1728740368.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/16/ST-logo-placeholder_36.jpg?VersionId=1vCexOUCc1Cm7v8..ELEgpa0de8Ey6yA", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_firefighters-battle-to-contain-three-wildfires-in-western-turkey_1728740368.html", "title": "Wildfires, fanned by strong winds, blaze in Turkey's west and north", "title_page": "Wildfires, fanned by strong winds, blaze in Turkey's west and north | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANKARA - A forest fire in Turkey's western coastal province of Izmir, fanned by strong winds, is near residential areas, forcing some people to be evacuated, the local governor said on Friday, as firefighters also tried to contain other wildfires in the north.\nThe fire in Izmir started late on Thursday in the Karsiyaka district for unknown reasons, as firefighters already worked to contain three separate fires in northwestern Turkey.\nIzmir Governor Suleyman Elban said the fire in Karsiyaka continued in between four and five different areas despite efforts to contain it using planes, helicopters, and other vehicles, adding that a village had been evacuated.\n\"The intervention is becoming difficult as it is very close to residential areas. There is no loss of life until now,\" Elban said. \"We have information that some houses burned. Since there are winds of up to 80 kilometers (49.71 miles) per hour now, we often have to stop the aerial intervention,\" he said, adding efforts would intensify if winds eased.\nFootage on local broadcasters showed flames engulfing tracts of land, approaching apartment buildings and roads in Karsiyaka, with black smoke billowing above forests and the city.\nThe fires in northwestern Turkey are in the Eceabat district of Canakkale province, the Goynuk district of Bolu province, and in Manisa province's Gordes district.\nEarlier on Friday, Agriculture and Forestry Minister Ibrahim Yumakli said the fire in Canakkale - sparked by a roadside electricity pole - had been contained and the Manisa blaze was partially contained. Efforts continued to douse the fire in Bolu.\nHe warned of a high risk of wildfires in the next three days due to high temperatures, low humidity, and strong winds.\nThe governors of Canakkale and Bolu provinces said several neighbourhoods or villages had been evacuated as a precaution, but that there was no immediate threat to residential areas.\nTurkey's coastal regions in particular have in recent years been ravaged by wildfires, as summers have become hotter and drier, which scientists relate to climate change. REUTERS", "url": "https://www.straitstimes.com/asia/firefighters-battle-to-contain-three-wildfires-in-western-turkey"}