{"authors": ["Tan Dawn Wei"], "date_download": "2024-10-12 13:49:11", "date_modify": "2024-10-12 13:49:11", "date_publish": "2023-01-14 18:48:21", "description": "Of the patients who died, 90.1 per cent were aged 65 and older. Read more at straitstimes.com.", "filename": "asia_east-asia_china-reports-almost-60000-covid-19-related-deaths-in-a-month-health-authorities_1728740951.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/16/CHINA-HEALTH-VIUS-140825.jpg?VersionId=GYW5eEuVCJl2k_YYa7siezfwqbRj6pqO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-reports-almost-60000-covid-19-related-deaths-in-a-month-health-authorities_1728740951.html", "title": "China’s Covid-19 death toll at 60,000 in a month, says health authority", "title_page": "China’s Covid-19 death toll at 60,000 in a month, says health authority | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - For the first time since China abandoned its zero-Covid policy in early December, it is making known the death toll from the virus: Nearly 60,000 people have died in the past month, the majority of them over the age of 65.\nAt a press conference by the National Health Commission on Saturday, its chief of medical policy Jiao Yahui said hospitals and medical institutions nationwide recorded 59,938 deaths between Dec 8, 2022, and Jan 12, 2023, caused by Covid-19. Among them, 5,503 died from respiratory failure and 54,435 died of complications from underlying diseases.\nIt is not known if Covid-19-related deaths that occurred outside hospitals were included in the tally. Crematoriums across the country have been overburdened, while grieving families have taken to social media to complain about long lines.\nThe health authority stopped publishing daily figures on Dec 25, after the statistics were said to be meaningless, as mass testing was scrapped and mandatory quarantine and treatment were no longer required for those who were infected.\nBut it had also come under criticism for not being transparent with its data and under-reporting the number of deaths. Up until it dismantled its zero-Covid policy on Dec 8, the country had reported just around 5,200 fatalities from the start of the pandemic.\nHealth officials also recently explained that they would count a Covid-19 death only if the virus had caused respiratory failure.\nThe World Health Organisation (WHO) on Wednesday appealed to China for more information about its Covid-19 outbreak, such as hospitalisation numbers, virus sequencing, as well as the comparative death rates between urban and rural areas.\n“WHO still believes that deaths are heavily under-reported from China, and this is in relation to the definitions that are used but also to the need for doctors and those reporting in the public health system to be encouraged to report these cases and not discouraged,” said Dr Mike Ryan, the head of health emergencies at the United Nations agency.\nThe average age of the nearly 60,000 people who died was 80.3 years old, and 90.1 per cent were over the age of 65, while 56.5 per cent were aged 80 and above.\nThe number of people seeking treatment at hospitals has also been trending downwards, including in rural areas, indicating that the infection peak is over, said Ms Jiao. For instance, as many as 2.867 million went to a fever clinic on Dec 23 but just 477,000 by Jan 12.\nThose who sought emergency treatment at hospitals reached a high of 1.526 million on Jan 2, before falling to 1.092 million by Jan 12.", "url": "https://www.straitstimes.com/asia/east-asia/china-reports-almost-60000-covid-19-related-deaths-in-a-month-health-authorities"}