{"authors": [], "date_download": "2024-10-12 14:04:18", "date_modify": "2024-10-12 14:04:18", "date_publish": "2023-09-07 16:00:10", "description": "The Belt and Road Forum for International Cooperation (BRF) will be held in Beijing in October. Read more at straitstimes.com.", "filename": "asia_china-says-90-countries-have-confirmed-attendance-for-belt-and-road-initiative_1728741858.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/07/PAKISTAN-CHINA-DIPLOMACY-ECONOMY-CPEC-131309.jpg?h=b5ebc84c", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-says-90-countries-have-confirmed-attendance-for-belt-and-road-initiative_1728741858.html", "title": "China says 90 countries have confirmed attendance for Belt and Road Initiative conference", "title_page": "China says 90 countries have confirmed attendance for Belt and Road Initiative conference | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China said on Thursday that 90 countries have confirmed attendance for its Belt and Road Initiative conference being held in October.\nThe third Belt and Road Forum for International Cooperation will be held in Beijing in October, the foreign ministry has previously said, with 2023 marking the 10th anniversary of the Belt and Road Initiative.\nSeveral foreign leaders are expected to attend, including Serbian President Aleksandar Vucic and Argentine President Alberto Fernandez, state media reported.\nRussian President Vladimir Putin also has a scheduled visit to China in October when the country hosts the One Belt One Road forum, Mr Putin’s aide Yuri Ushakov said recently, according to Russia’s state news agency Tass.\n“We have received an invitation and plan to go to China,” Mr Ushakov said, according to a report from the Global Times.\nChina’s foreign ministry said the country has signed Belt and Road cooperation documents with more than 150 countries and over 30 international organisations, according to Xinhua.\n“Over the past decade, Belt and Road cooperation has achieved fruitful outcomes,” Chinese foreign ministry spokesman Wang Wenbin recently said at a press conference, adding that it has established more than 3,000 cooperation projects and galvanised nearly US$1 trillion (S$1.4 trillion) of investment, state media reported.\nCritics see the ambitious Belt and Road initiative – billed as recreating the ancient Silk Road to boost global trade infrastructure – as a tool for President Xi Jinping's China to spread its geopolitical and economic influence.\nDebate in the West over economic dependence on China has cast a shadow over longer-term trade and investment relations with Beijing. Italy, the sole Group of Seven nation in Belt and Road, said the decision by a previous government to join had been “atrocious”. REUTERS", "url": "https://www.straitstimes.com/asia/china-says-90-countries-have-confirmed-attendance-for-belt-and-road-initiative"}