{"authors": [], "date_download": "2024-10-12 13:58:16", "date_modify": "2024-10-12 13:58:16", "date_publish": "2024-05-21 21:40:33", "description": "VATICAN CITY - The Vatican would like to establish a permanent office in China in what would be a major upgrade of diplomatic relations with Beijing, Cardinal Secretary of State Pietro Parolin said on Tuesday. Read more at straitstimes.com.", "filename": "asia_vatican-wants-to-upgrade-relations-with-china-top-cardinal-says_1728741496.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/21/LYNXMPEK4K0HY-1.jpg?VersionId=9Gm0DA7CRgyY9HCb.ZXGzKGnPDO4onhm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_vatican-wants-to-upgrade-relations-with-china-top-cardinal-says_1728741496.html", "title": "Vatican wants to upgrade relations with China, top cardinal says", "title_page": "Vatican wants to upgrade relations with China, top cardinal says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VATICAN CITY - The Vatican would like to establish a permanent office in China in what would be a major upgrade of diplomatic relations with Beijing, Cardinal Secretary of State Pietro Parolin said on Tuesday.\nRelations between the Vatican and communist China have historically been fraught, but Pope Francis has made it a priority to normalise them, building on a landmark 2018 pact on appointing bishops.\n\"We have been hoping for a long time to be able to have a stable presence in China,\" Parolin, who is Francis' deputy, said, adding the Vatican could consider new diplomatic formulas for it.\nThe Vatican obtained permission last year to have a Resident Papal Representative in Vietnam, another Communist-run country with which it does not have diplomatic relations. Parolin suggested a China envoy might take a different title.\n\"The form (of it) can be different, let's not fixate on only one way,\" he said.\nThe cardinal said the Vatican's recognition of the Council of Chinese Bishops - which is controlled by the Chinese Communist Party - was also on the agenda, and a \"work in progress.\"\nParolin spoke at a Vatican-hosted conference on the Catholic Church in China which offered a rare platform for high-level talks between the two sides.\n'TIMES OF PATIENCE AND TRIAL'\nOne of the attendees was Shanghai Bishop Joseph Shen Bin, who was appointed by Chinese authorities without Vatican consultation in apparent violation of the 2018 accord. Francis nevertheless approved the move last year, retroactively.\nConservative Catholics have criticised the bishops' deal as a sellout to communist China, but the Vatican has defended it as an imperfect means to have some form of dialogue with the authorities for the good of all Chinese Catholics.\nIn a video message for Tuesday's conference, Francis said the Catholic Church had progressed in China and elsewhere \"through unforeseen paths, even through times of patience and trial.\"\nBeijing has been following a policy of \"Sinicisation\" of religion, trying to root out foreign influences and enforce obedience to the Communist Party. There are an estimated 10 to 12 million Catholics in China.\nProf. Zheng Xiaojun, a top speaker at the Vatican event and director of the Institute of World Religions at the Chinese Academy of Social Sciences, praised Francis' outreach to China and said religious freedom was fully guaranteed in her country.\nThis is disputed by outside observers. In its latest Religious Freedom Report, the Catholic aid organisation Aid to the Church in Need ranks China as one of the worst offenders.\n\"The prospects for religious freedom continue to remain negative with repression and persecution set to continue, and, with ever-more sophisticated tools of surveillance technology, these will become increasingly intrusive and pervasive,\" it said. REUTERS", "url": "https://www.straitstimes.com/asia/vatican-wants-to-upgrade-relations-with-china-top-cardinal-says"}