{"authors": ["Yew Lun Tian"], "date_download": "2024-10-12 13:37:39", "date_modify": "2024-10-12 13:37:39", "date_publish": "2024-09-05 23:23:00", "description": "Professor Chen Dongxiao fears that should Trump win, both countries’ economies will further decouple. Read more at straitstimes.com.", "filename": "asia_can-china-handle-trump-20-worrying-if-trump-s-return-means-little-communication-says-scholar_1728740259.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/2L4A98322028129.jpg?VersionId=t1v8gUwpPSKIio.ivgNm5XKP5mWnrHiS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_can-china-handle-trump-20-worrying-if-trump-s-return-means-little-communication-says-scholar_1728740259.html", "title": "Can China handle Trump 2.0? Worrying if Trump’s return means little communication, says scholar", "title_page": "Can China handle Trump 2.0? Worrying if Trump’s return means little communication, says scholar | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Should former US president Donald Trump return to the White House, it could result in a “risky” lack of communication between the US and China, a visiting Chinese scholar warned on Sept 5.\nProfessor Chen Dongxiao, who heads the Shanghai Institutes for International Studies, an official think-tank, was speaking at a lecture titled “Can China Handle Trump 2.0?”, held by the S. Rajaratnam School of International Studies (RSIS).\nTrump, who served as US president from 2017 to 2021, is running against Democrat Kamala Harris in the US presidential election in November.\nDuring the Bill Clinton, George W. Bush and Barack Obama administrations, the US and China had almost 100 communication channels, but these were cut to zero by the end of Trump’s term in office, Prof Chen noted.\nHe said Trump’s advisers now have strict discipline about not communicating with Beijing – a lesson they learnt after seeing how detrimental it was when members of Trump’s previous team during his first term had unauthorised contact with foreign officials.\nGeneral Mike Flynn, whom Trump named as national security adviser after the 2016 election, had a discussion on sanctions with a Russian ambassador and then lied about having that discussion. He was fired in 2017.\nProf Chen argued that Trump’s team, which includes trade sceptic Robert Lighthizer, could become unrealistically confident, even complacent, and think that imposing prohibitive tariffs on China will benefit the US.\nDuring his campaign, Trump has talked about imposing a 60 per cent tariff on all Chinese imports should he win the election.\nProf Chen argued that Trump’s team may be counting on tariffs to hurt China’s economy more than America’s, and that China cannot do anything but “swallow the bitter pill”.\nBut this could be just wishful thinking, he told the audience of Singapore scholars and businessmen at the event held at InterContinental Singapore.\nHe thinks this is where Singapore can come in: “Even if they (Trump’s team) have no interest to talk to the Chinese, they may at least talk to you.\n“Singapore can convey to them that if their decisions are made in a vacuum without factoring all the possible reactions from Beijing, it will be quite risky.”\nProf Chen pointed out that as a financial hub, Singapore could suffer collateral damage if the world’s two largest economies were to decouple. He added that China had always appreciated the role played by Singapore’s leaders, including the late Mr Lee Kuan Yew, in helping to reduce the perception gap between China and the US.\nIn response, Ambassador Ong Keng Yong, executive deputy chairman of RSIS, who was the moderator of the event, said: “I don’t think Singapore, as a small country, can be persuasive in any way when the two big guys have already decided to fight.\n“Maybe the only thing we can do is to hold a mirror in front of China.”\nDuring his lecture, Prof Chen reiterated the importance for China and the US to communicate.\nUnder US President Joe Biden, the number of communication channels between the two sides has recovered to more than 20.\nBeijing has concluded that the US will continue to view China as its most serious challenge, as its strategic competitor, no matter who wins the November election, Prof Chen said.\nThat said, the two US presidential candidates have different leadership styles and priorities.\nHe thinks Beijing would prefer Ms Harris to Trump because a second Trump administration would be more unpredictable, unstable, destructive and more confrontational.\n“Predictability is the most important from Beijing’s perspective,” he said.\nHe thinks Beijing would not view Trump’s love for transactional deals as a plus because “we never know what may come next after one deal”.\nProf Chen worries that, should Trump win, both countries’ economies would further decouple.\nTrump’s threat of imposing prohibitive tariffs on Chinese goods should not be regarded as a “bluff” or “bargaining chips”, he said, adding that US manufacturing investment could be pressured to exit China.\nScientific exchanges would be further curtailed, and more Chinese companies will lose access to US capital markets, he added.\nAs to how China may respond to a second Trump term, Prof Chen quoted from Chinese President Xi Jinping’s 24-character prescription on what China must do to deal with external challenges: “Stay calm, remain determined, seek progress while maintaining stability.”\nThis means China needs to focus on developing peacefully instead of being drawn into competition with the US, he said.", "url": "https://www.straitstimes.com/asia/can-china-handle-trump-20-worrying-if-trump-s-return-means-little-communication-says-scholar"}