{"authors": [], "date_download": "2024-10-12 13:37:30", "date_modify": "2024-10-12 13:37:30", "date_publish": "2022-12-20 15:59:34", "description": "Japan has some 230,000 soldiers against China’s over 2 million, and fresh recruits are hard to find. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-s-manpower-light-defence-strategy-is-a-flawed-paper-plan-officers-say_1728740250.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/20/2022-12-20T073528Z1479791135RC2O2Y9ZR72BRTRMADP3JAPAN-DEFENCE-MANPOWER_3.JPG?VersionId=8L7uqpl5l4UpZ4kKmUqv8KtNahbM288h", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-s-manpower-light-defence-strategy-is-a-flawed-paper-plan-officers-say_1728740250.html", "title": "Japan’s manpower-light defence strategy a flawed ‘paper plan’, officers say", "title_page": "Japan’s manpower-light defence strategy a flawed ‘paper plan’, officers say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan’s plan to undertake its biggest military build-up since World War II without increasing headcount is flawed, former and serving officers have said, casting doubt over the country’s efforts to deter regional rivals China and North Korea.\nThe five-year plan unveiled last Friday will double Japan’s defence spending and add new capabilities, including long-range missiles and an expanded cyber warfare unit.\nIt will not, however, boost the size of its military, called the Self-Defence Forces (SDF), above a ceiling of 247,000 people set more than a decade ago.\nInstead, it will retire attack helicopters, old warships and search-and-rescue planes in favour of drones and vessels that require fewer sailors, while also relying on civilian contractors for training and some limited support operations.\n“It is just a paper plan, and that should be corrected,” said retired navy admiral Yoji Koda, who commanded the Japanese fleet in 2007-2008.\n“Manpower is the real issue for Japan to defend against China and North Korea,” he added.\nAdmiral Koda said the plan would limit Japan’s ability to fight in situations such as land invasions and sea battles, giving its foes an advantage.\nSome serving officers also doubt the practicalities of the plan.\nWhile pivoting to drones could avoid casualties in combat, such a move would take years and require more staff to maintain and operate them, one senior officer in Japan’s air force told Reuters, requesting anonymity because he is not authorised to talk to the media.\n“The problem is, we can’t make them fast enough to catch up with the threat level and compensate for the lack of manpower,” the officer said.\nAdm Koda and retired admiral Katsutoshi Kawano, who served as the country’s top military commander for five years until 2019, said Japan needs around 300,000 troops to execute its new plans.\nIn 2021, there were 230,754 people serving in the SDF, according to the Defence Ministry.\nChina, which Japan worries could launch an attack on neighbouring Taiwan following Russia’s example in Ukraine, has around two million soldiers.\nJapan’s hopes of relying on a manpower-light army are a response to the long-running problem of finding recruits in an ageing country that still wrestles with its wartime past, analysts say.\nIt has repeatedly failed to hit its current 247,000 target, with applications in 2021 at just 84,825, a drop of 26 per cent compared with a decade ago.\nEven those keen to join have a tough time convincing their parents. “My parents were against my pursuing a career at SDF. But I kept telling them that I wanted to join. Now, they are supporting me,” Mr Yoshito Yamaguchi, a 21-year-old student, told Reuters at a recruitment event in December at an airbase near Tokyo.\nHe was one of only 11 people who attended the event.\nBy 2028, when Japan is expected to have completed its military expansion, the number of 18- to 26-year-olds in the country will shrink by 800,000 to 10 million, according to the government.\nRetired major-general Nozomu Yoshitomi, now a professor at Tokyo’s Nihon University, said staffing issues may occur in new areas such as cyber warfare, where the government will have to match the high pay offered in private-sector jobs to find talent.\nMr Grant Newsham, a retired US Marine Corps colonel and research fellow at the Japan Forum for Strategic Studies who served as a USMC liaison officer to the SDF, said: “If the Japanese think automation… is going to make up for the personnel disaster they’ve got, they can forget about it.” REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/japan-s-manpower-light-defence-strategy-is-a-flawed-paper-plan-officers-say"}