{"authors": [], "date_download": "2024-10-12 14:07:30", "date_modify": "2024-10-12 14:07:30", "date_publish": "2024-07-03 10:12:59", "description": "He said a royal “addendum order” accompanied a pardons board’s decision to halve his sentence. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-court-dismisses-jailed-ex-pm-najibs-bid-to-serve-sentence-under-house-arrest_1728742050.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/03/2024-04-04T024942Z361372949RC2EZ6ASGZI3RTRMADP3MALAYSIA-POLITICS-NAJIB2028129.JPG?VersionId=y6IZB_8Bqdt6ceeGHc34tjgF.7Q5LgVV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-court-dismisses-jailed-ex-pm-najibs-bid-to-serve-sentence-under-house-arrest_1728742050.html", "title": "Malaysia’s Najib loses legal bid to serve sentence under house arrest", "title_page": "Malaysia’s Najib loses legal bid to serve sentence under house arrest | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – A Malaysian court dismissed jailed former prime minister Najib Razak’s legal bid to obtain a document that he said would allow him to serve his remaining prison sentence under house arrest.\nIn a judicial review application filed on April 1, Najib said an “addendum order” issued by the former king had accompanied a pardons board’s decision in February to halve his 12-year jail sentence for graft in the multibillion-dollar 1Malaysia Development Berhad (1MDB) scandal.\nNajib had sought for the court to compel the government to reply to or confirm the existence of the royal order, which he said would entitle him to serve the remainder of his term under house arrest, and to execute the order if it existed.\nIn a copy of the judgment released to the media on July 3, the Kuala Lumpur High Court found there was no arguable case warranting a full hearing of Najib’s application.\nJustice Amarjeet Singh described affidavits filed by Malaysia’s Deputy Prime Minister Zahid Hamidi and another high-ranking politician from Najib’s party saying they had seen a copy of the royal order as hearsay, and said the government had no legal duty to respond to the application.\nNajib planned to appeal against the decision, his lawyer Muhammad Shafee Abdullah told reporters. “In terms of ethics, the government should have answered,” he said.\nThe pardons board that halved Najib’s term was chaired by the former king, Sultan Abdullah Ahmad Shah, whose five-year reign as head of state ended in January.\nNajib was found guilty in 2020 of criminal breach of trust and abuse of power for illegally receiving funds misappropriated from a unit of state fund 1MDB. The verdict was upheld by Malaysia’s top court in 2022.\nMalaysian and US investigators estimate that US$4.5 billion (S$6.1 billion) was stolen from 1MDB and more than US$1 billion channelled to accounts linked to Najib.\nThe pardons board in February said Najib was expected to be released in August 2028, six years after he began serving his sentence. It also reduced fines imposed on the former premier, sparking an uproar in Malaysia. Najib, who is also considering filing a new petition for a full pardon, remains on trial for corruption in several other 1MDB-linked cases. REUTERS", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-court-dismisses-jailed-ex-pm-najibs-bid-to-serve-sentence-under-house-arrest"}