{"authors": [], "date_download": "2024-10-12 14:02:44", "date_modify": "2024-10-12 14:02:44", "date_publish": "2023-07-03 08:05:00", "description": "The couple allegedly strangled their son and abandoned his corpse at a nearby river in Geoje, South Gyeongsang province. Read more at straitstimes.com.", "filename": "asia_se-asia_parents-in-custody-for-murdering-5-day-old-son-in-south-korea_1728741764.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/03/afkorea030723_1.jpg?VersionId=n7bRJ99GLXJWTy0Qh7w8T6ziw8o2PEE9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_parents-in-custody-for-murdering-5-day-old-son-in-south-korea_1728741764.html", "title": "Parents detained for allegedly murdering 5-day-old son in South Korea", "title_page": "Parents detained for allegedly murdering 5-day-old son in South Korea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - A couple under police investigation for burying their five-day-old male infant in secret have been detained on suspicion of murder.\nThis is the latest in a series of shocking child abuse or infanticide cases after the government launched an investigation to check on the well-being of more than 2,000 undocumented babies born since 2015, following the discovery of two unregistered newborns in a home refrigerator in June.\nAn arrest warrant was issued for a man in his 20s and a woman in her 30s, said the Gyeongnam Provincial Police Agency on Sunday.\nThe Changwon District Court ordered the warrant, as there was a high possibility of the couple fleeing.\nThe couple allegedly strangled their son and abandoned his corpse at a nearby river in Geoje, South Gyeongsang province.\nAccording to the police, the baby was born in September 2022 and discharged from the hospital four days later.\nThe couple initially claimed that the baby was found dead the day after being discharged. They also claimed that they had buried the body themselves, as they were financially strapped and could not afford cremation.\nThe couple said they feared that their parents would separate them if they were aware of the pregnancy.\nThe Goseong county government found out the couple had not registered the birth of the infant and reported the child’s disappearance to the police last Thursday.\nThe police dispatched around 80 staff, including riot police, to search the area around the mountain the father had named, but were unable to find the corpse.\nDuring further investigation, the father confessed he had strangled the baby and that he had tried to bury the body in the wilderness, but had to change the location due to a number of passers-by.\nPolice are focusing their investigation on finding the infant’s corpse around the location the couple said they had dumped the body, with cooperation from the coast guard. THE KOREA HERALD/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/parents-in-custody-for-murdering-5-day-old-son-in-south-korea"}