{"authors": [], "date_download": "2024-10-12 13:49:48", "date_modify": "2024-10-12 13:49:48", "date_publish": "2024-03-23 21:03:45", "description": "Mr Ganjar received 16 per cent of the votes in the election in February. Read more at straitstimes.com.", "filename": "asia_losing-indonesian-presidential-candidate-ganjar-calls-for-new-election_1728740988.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/23/LYNXNPEK2M04D-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_losing-indonesian-presidential-candidate-ganjar-calls-for-new-election_1728740988.html", "title": "Losing Indonesian presidential candidate Ganjar calls for new election", "title_page": "Losing Indonesian presidential candidate Ganjar calls for new election | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – The legal team of losing Indonesian presidential candidate Ganjar Pranowo filed a complaint at the country’s Constitutional Court on March 23, calling for a fresh election and disqualification of the winning team of Defence Minister Prabowo Subianto.\nMr Ganjar, a former Central Java governor supported by the ruling Indonesian Democratic Party of Struggle (PDI-P), received 16 per cent of the votes in February’s election, behind Mr Prabowo, who won almost 60 per cent of the votes, and former Jakarta governor Anies Baswedan, who received 25 per cent, an official tally showed.\nMr Prabowo is slated to be inaugurated in October.\nIn a statement, Mr Todung Mulya Lubis, a lawyer with Mr Ganjar’s legal team, said Mr Prabowo’s disqualification was being called for on the grounds that his registration had violated legal and ethical provisions and that therefore the election should be re-run.\nMr Todung said the election was tainted with nepotism that resulted in “a coordinated abuse of power”, he told reporters after filing the case at the Constitutional Court.\nA decision in 2023 by the court to change eligibility rules allowed Mr Gibran Rakabuming Raka, son of outgoing President Joko Widodo (known locally as Jokowi), to become Mr Prabowo’s running mate. Mr Jokowi’s brother-in-law was chief justice at the time of the ruling.\nThe legal team of Mr Anies also filed a case, calling on March 21 for the court to order an election re-run that excludes Mr Gibran, alleging that his last-minute inclusion unfairly swayed the vote.\nMr Ganjar’s team also complained of a “politicisation of social aid”, without elaborating, and have alleged abuse of the Election Commission’s information technology system.\nMr Prabowo swept to victory with the help of young voters and his promise of continuity. Mr Yusril Mahendra, a lawyer for his campaign, said the team has more than 30 lawyers ready to face any legal challenges. REUTERS", "url": "https://www.straitstimes.com/asia/losing-indonesian-presidential-candidate-ganjar-calls-for-new-election"}