{"authors": [], "date_download": "2024-10-12 13:48:05", "date_modify": "2024-10-12 13:48:05", "date_publish": "2022-07-07 12:40:43", "description": "The government said the ban caused “unnecessary trouble” and inconvenience to residents. Read more at straitstimes.com.", "filename": "asia_east-asia_hong-kong-suspends-flight-bans-as-it-eases-covid-19-rules_1728740885.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/07/dw-hk-flights-220707.jpg?VersionId=ZXnfO2UNodTMQmNRLSPXpmrsxDVLxKMh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_hong-kong-suspends-flight-bans-as-it-eases-covid-19-rules_1728740885.html", "title": "Hong Kong suspends flight bans as it eases Covid-19 rules", "title_page": "Hong Kong suspends flight bans as it eases Covid-19 rules | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (REUTERS) - Hong Kong has suspended a rule that banned individual flights for bringing in passengers infected with the Covid-19 virus, as it caused “unnecessary trouble” and inconvenience to residents of the global financial hub, the government said on Thursday (July 7).\nAirlines welcomed the move that paves the way for the return of scores stranded overseas by the bans, which exceeded 100 this year and greatly frustrated people accustomed to easy and efficient travel links with the city.\n“The social cost caused by the ‘circuit breaker mechanism’ is quite large, and it also brings unnecessary trouble to... international students and their families,” the government said in a statement.\nAll arrivals must still spend at least a week in hotel quarantine and comply with frequent testing orders, providing stool samples for babies and filling out multiple forms.\nThe government aims to improve quarantine arrangements, so as to ease the movement of people “necessary for social and economic recovery,” it added.\nAirlines earlier faced a ban of five days if their flights brought in more than five infected people.\nThat was down from as much as two weeks before, making operations tougher as the city’s borders were effectively shut for more than two years.\nThe bans brought hundreds of flight cancellations, leading to family separations as people struggled to rebook trips and quarantine hotels at their own expense.\nHong Kong’s competitiveness had been hammered by the pandemic measures, said business executives who hope the city’s new leader, Mr John Lee, will scrap the quarantine rules.\nMr Lee, sworn in last week, needs to “reboot” the city, such executives have said, as Hong Kong’s border has effectively been sealed since 2020 and international arrivals face tough quarantine and testing protocols.\nShares of Hong Kong carrier Cathay Pacific rose more than 5 per cent after the news.\nThe airline has been battered by the strict quarantine rules, bringing a fall of 98 per cent in passenger numbers.\nCathay said it welcomed the move and was committed to keeping up the flow of people and goods between Hong Kong and the rest of the world, and upholding its status as an international aviation hub.\nMany airlines have suspended or slashed flights with the Chinese-ruled city, making it difficult to find flights.\nKorean Air said that while the move was positive, it was not considering adding flights.\n“We’ve already started to operate a daily flight to Hong Kong since July,” it said, explaining the reasons.\n“The Hong Kong government still requires the seven-day quarantine for all international travellers.”", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-suspends-flight-bans-as-it-eases-covid-19-rules"}