{"authors": [], "date_download": "2024-10-12 14:02:34", "date_modify": "2024-10-12 14:02:34", "date_publish": "2023-05-20 15:23:00", "description": "The comments did not specifically mention China, but refer to consequences and seem directed towards Beijing. Read more at straitstimes.com.", "filename": "asia_east-asia_g-7-takes-aim-at-economic-coercion-by-china_1728741754.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/20/JAPAN-G7-SUMMIT-031728_4.jpg?VersionId=xUC_YvZdmhrOF9X9HQ_qZGLtx2Lx5RwM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_g-7-takes-aim-at-economic-coercion-by-china_1728741754.html", "title": "G-7 takes aim at economic coercion, sending strong signal to China", "title_page": "G-7 takes aim at economic coercion, sending strong signal to China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HIROSHIMA – The United States and other rich democracies said on Saturday that countries attempting to use trade as a weapon would face consequences, sending a strong signal to China over practices Washington has long said amount to economic bullying.\nThe leaders of the Group of Seven (G-7) nations, meeting in the Japanese city of Hiroshima for a three-day summit, also pledged to bolster supply chains with partners, particularly for chips, batteries and minerals.\nThe comments from the G-7, in a joint statement on economic resilience and economic security, did not specifically mention China, although they appear to be some of the clearest yet to be directed towards Beijing over the use of trade as a political tool.\nThe US and its partners are increasingly worried about the outsized role China plays in supply chains in everything from semiconductors to critical minerals.\nThe Hiroshima summit comes as G-7 members are faced with the immense challenges posed by Russia’s invasion of Ukraine and tensions with China.\nUkrainian President Volodymyr Zelensky arrived in Hiroshima on Saturday, the second day of the summit, to drum up support for his country’s defence effort.\nHis arrival in the world’s first city to be attacked with an atomic bomb comes as nuclear threats from Russian President Vladimir Putin have unsettled the West.\n“We will work together to ensure that attempts to weaponise economic dependencies by forcing G-7 members and our partners, including small economies, to comply and conform will fail and face consequences,” the leaders said in a statement.\nChina put pressure on Japan more than a decade ago by restricting rare earth export quotas after a territorial dispute.\nIn recent years, it pressed multinationals to sever ties with Lithuania or face exclusion from the Chinese market.\nThat row happened after Lithuania allowed the opening of a de facto embassy by Taiwan, which China views as part of its territory.\nIn a final communique issued at the Hiroshima summit, the G-7 nations made clear their wide-ranging concerns about Beijing’s willingness to deploy trade measures in diplomatic disputes, although they sought to keep the door open to cooperation.\n“We stand prepared to build constructive and stable relations with China, recognising the importance of engaging candidly with and expressing our concerns directly to China.\n“Our policy approaches are not designed to harm China, nor do we seek to thwart China’s economic progress and development,” the statement continued, adding that the G-7 countries are not “decoupling or turning inwards”.\nBut the bloc also warned against China’s “militarisation” in the South China Sea and repeated that peace and stability in the Taiwan Strait are indispensable to global security.\nAnd it urged China to use its influence with Russia “to stop its military aggression, and immediately, completely and unconditionally withdraw its troops from Ukraine”.\nChina firmly opposed the G-7 joint statement on Saturday.\nThe Chinese foreign ministry said in a statement that the G-7 had attacked China and interfered in its internal affairs, including Taiwan, forcing it to express its strong dissatisfaction and complain to summit host Japan.\nThe G-7 is also taking fresh aim at Russia’s invasion of Ukraine, pledging to close loopholes that have allowed Russia to dodge sanctions by importing goods via non-G-7 countries.\nThe leaders said they ensured that Ukraine had budget support through early 2024.\nMr Zelensky met separately with Japan Prime Minister Fumio Kishida and Indian Prime Minister Narendra Modi – a leader who has maintained relations with Russia’s Mr Putin.\nUS President Joe Biden told G-7 leaders on Friday that Washington supports joint allied training programmes for Ukrainian pilots on F-16 fighter jets, in a significant endorsement for Kyiv.\nThe G-7 is composed of Britain, Canada, France, Germany, Italy, Japan and the US.\nREUTERS", "url": "https://www.straitstimes.com/asia/east-asia/g-7-takes-aim-at-economic-coercion-by-china"}