{"authors": [], "date_download": "2024-10-12 13:41:21", "date_modify": "2024-10-12 13:41:21", "date_publish": "2024-02-17 08:28:30", "description": "Launch is second straight win for Jaxa after Moon lander's “pinpoint” touchdown in January. Read more at straitstimes.com.", "filename": "asia_japan-launches-h3-rocket-a-year-after-failed-first-flight_1728740481.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/17/LYNXNPEK1G007-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_japan-launches-h3-rocket-a-year-after-failed-first-flight_1728740481.html", "title": "Japan launches H3 rocket a year after failed first flight", "title_page": "Japan launches H3 rocket a year after failed first flight | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan successfully launched its new H3 flagship rocket on Feb 17, putting its space programme back on track after multiple setbacks, including the failure of the rocket’s inaugural flight in 2023.\nThe launch also marks a second straight win for the Japan Aerospace Exploration Agency (Jaxa) after its Moon lander, Slim, achieved a “pinpoint” touchdown in January and made Japan only the fifth country to put a spacecraft on the Moon.\nA relatively small player in space by number of launches, Japan is seeking to revitalise its programme as it partners with ally the United States to counter China.\nThe H3 lifted off at 9.22am (8.22am Singapore time) and after it successfully released a small satellite, jubilant scientists at the Tanegashima Space Centre in southern Japan clapped, yelled and hugged one another.\nThe rocket also released a microsatellite and a dummy satellite during its flight of nearly two hours.\n“The newborn H3 has just made its first cry,” Jaxa project manager Masashi Okada, who has led the decade-long development of the new rocket, told a news conference.\n“And we need to start preparing for the third H3 launch as soon as tomorrow.”\nThe H3 is due to replace the two-decade-old H-IIA, which is retiring after two more launches. Another failed flight would have seen Japan face the prospect of losing independent access to space.\nThe H3‘s first flight in March 2023 ended with ground control destroying the rocket 14 minutes after lift-off because its second-stage engine failed to ignite. Jaxa listed three possible electrical faults in a review released in October 2023, but could not identify the direct cause.\nFive months earlier, Jaxa’s small rocket Epsilon had also failed to launch.\n“So happy to see this incredible accomplishment in the space sector that follows on from the success of the Slim Moon landing,” Japan’s Prime Minister Fumio Kishida said in a post on X.\nThe 63m H3 is designed to carry a 6.5-tonne payload into space. Over the long term, the agency wants to reduce per-launch cost to as low as five billion yen (S$45 million) – half of what an H-IIA launch costs – by adopting simpler structures and automotive-grade electronics.\nJaxa and primary contractor Mitsubishi Heavy Industries hope these features will help them win launch orders from global clients.\n“It’s taken some time for the programme to get to this point, but with this launch they will be fielding enquiries from around the world,” said Professor Ko Ogasawara of the Tokyo University of Science.\nThe Japanese government plans to launch about 20 satellites and probes with H3 rockets by 2030. The H3 is scheduled to deliver a lunar explorer for the joint Japan-India Lupex project in 2025 as well as cargo spacecraft for the US-led Artemis Moon exploration programme in the future.\nSatellite launch demands have skyrocketed thanks to the rise of affordable commercial vehicles such as SpaceX’s reusable Falcon 9, and a number of new rockets are being tested in 2024.\nJanuary 2024 marked the successful inaugural flight of the United Launch Alliance’s Vulcan rocket, a joint venture between Boeing and Lockheed Martin. The European Space Agency also plans to launch its lower-cost Ariane 6 for the first time in 2024.\nHead of Mitsubishi Heavy’s defence and space business Masayuki Eguchi said the company has a long-term target of launching eight to 10 rockets a year, which would boost its 50 billion yen space business sales by 20 per cent to 30 per cent.\nThat would require additional production capacity, he added, noting that the company’s factories can produce only five to six H3 rockets a year now. REUTERS", "url": "https://www.straitstimes.com/asia/japan-launches-h3-rocket-a-year-after-failed-first-flight"}