{"authors": [], "date_download": "2024-10-12 13:39:31", "date_modify": "2024-10-12 13:39:31", "date_publish": "2024-06-05 15:55:55", "description": "This was Japan's eighth consecutive yearly decline. Read more at straitstimes.com.", "filename": "asia_east-asia_japans-birth-rate-critical-as-it-hits-record-low_1728740371.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/05/JAPAN-LIFESTYLE-104624.jpg?VersionId=SgKy6YMZrehHT2JMusNSOPyMMyw.pbUn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japans-birth-rate-critical-as-it-hits-record-low_1728740371.html", "title": "Japan’s birth rate ‘critical’ as it hits record low", "title_page": "Japan’s birth rate ‘critical’ as it hits record low | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan’s Health Ministry described the nation’s birth rate as “critical” on June 5 as it hit a record low for the eighth straight year, with the government moving to improve support for parents.\nThe ministry released data showing that Japan’s birth rate – the average number of children a woman is expected to have in her life – stood at 1.2 in 2023, well below the 2.1 children needed to maintain the population.\nThe figure was down from 1.26 in 2022 and was the eighth consecutive yearly decline in the country of 124 million people.\n“The continuing decline in the birth rate is a critical situation,” a Health Ministry official in charge of the data told AFP.\n“Various factors, such as economic instability and difficulties in juggling work and child-rearing”, can be blamed for the falling figures, she said.\nDeclining birth rates are a common trend in developed countries and Japan’s rate is still above that of its neighbour South Korea, which has the world’s lowest at 0.72.\nHowever, with the world’s oldest population after Monaco, Japan is scrambling for ways to encourage a baby boom to avert a looming demographic crisis.\nParliament approved on June 5 revisions to laws to provide more financial support for parents, improved access to childcare services and expanded parental leave benefits.\nIt was the latest government push to boost birth rates, an issue that Prime Minister Fumio Kishida has highlighted as an urgent risk to Japanese society.\nAmong Japan’s initiatives to boost the birth rate is a dating app developed by the Tokyo city government that will be launched as soon as this summer.\nUsers will be required to submit documentation proving they are legally single and to sign a letter stating they are willing to get married.\nStating one’s income is common on Japanese dating apps, but Tokyo will require a tax certificate slip to prove an applicant’s annual salary.\nAn interview will also be required to confirm a user’s identity as part of the registration process for the app, which has been on a free test run since late 2023. AFP", "url": "https://www.straitstimes.com/asia/east-asia/japans-birth-rate-critical-as-it-hits-record-low"}