{"authors": [], "date_download": "2024-10-12 13:49:36", "date_modify": "2024-10-12 13:49:36", "date_publish": "2023-11-01 16:36:14", "description": "Mr Xie Zhenhua helped get the 2015 Paris Agreement over the line. Read more at straitstimes.com.", "filename": "asia_chinas-veteran-climate-envoy-xie-to-step-down-in-december-govt-source_1728740976.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/01/LYNXMPEJA013M-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_chinas-veteran-climate-envoy-xie-to-step-down-in-december-govt-source_1728740976.html", "title": "China’s veteran climate envoy Xie to step down in December: Govt source", "title_page": "China’s veteran climate envoy Xie to step down in December: Govt source | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China’s veteran climate change envoy Xie Zhenhua is set to retire in December at the end of the 2023 COP28 climate talks in Dubai, a government official familiar with the situation confirmed on Wednesday.\nMr Xie, who turns 74 in November, will be replaced by Mr Liu Zhenmin, a former Chinese vice-foreign minister and United Nations undersecretary-general, according to the official, who declined to be named because he was not authorised to speak to the media.\nBorn in Tianjin in 1949, Mr Xie served as China’s top environmental official from 1999 to 2005, when he was forced to step down after a catastrophic benzine explosion left 5 million people without water supplies.\nHe first represented China in global climate negotiations in 2007 after his appointment as vice-chairman of the National Development and Reform Commission, the country’s state planning agency. He led China’s delegation during ill-fated and sometimes ill-tempered climate negotiations in Copenhagen in December 2009.\nExperts say his friendly relationship with his United States counterpart Todd Stern was vital in achieving consensus between the world’s top two greenhouse gas emitters, and helped get the landmark 2015 Paris Agreement over the line.\n“The role of individuals matters a great deal in climate diplomacy,” said Mr Li Shuo, senior adviser at Greenpeace in Beijing.\n“Over his long tenure as China’s chief negotiator, Mr Xie has demonstrated that it is possible to bridge the differences between China and the West,” he added.\nClimate talks between Washington and Beijing broke down during the presidency of Donald Trump, and Mr Xie quit as envoy a year later. He remained involved in building climate ties with the United States, helping set up the California-China Climate Institute with then Governor of California Jerry Brown.\nHe returned as special envoy in 2021 after the election of President Joe Biden brought the United States back into the Paris Agreement, but his friendship with Mr Stern’s replacement John Kerry has not been enough to overcome rising geopolitical tensions between the countries.\nChina has repeatedly told the US that climate change is not a diplomatic “oasis” that could be separated from broader disputes between the two sides, including US tariffs and sanctions on Chinese-produced solar panels.", "url": "https://www.straitstimes.com/asia/chinas-veteran-climate-envoy-xie-to-step-down-in-december-govt-source"}