{"authors": [], "date_download": "2024-10-12 14:04:07", "date_modify": "2024-10-12 14:04:07", "date_publish": "2022-12-16 11:36:49", "description": "Tokyo is lining up purchases of long-range missiles like the Tomahawk and hypersonic weapons to upgrade its counter-strike capability. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-calls-china-an-unprecedented-challenge-in-security-shift_1728741847.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/16/FILES-JAPAN-DEFENCE-POLITICS-ARMAMENT-024314_2.jpg?VersionId=okMsFnlH2z2ngpTYVCXy5G6Rop3gDsjx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-calls-china-an-unprecedented-challenge-in-security-shift_1728741847.html", "title": "Japan to approve new security policy to deal with ‘unprecedented challenge’ from China", "title_page": "Japan to approve new security policy to deal with ‘unprecedented challenge’ from China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan will describe China as an “unprecedented strategic challenge” in a new national security policy set to be approved as early as this week, according to a draft seen by Bloomberg.\nThe new strategy, expected to get the green light from Prime Minister Fumio Kishida’s Cabinet on Friday, also lays out plans for Japan to obtain longer-range missiles, including developing its own hypersonic weapons, as part of a radical upgrade of its defence capabilities.\nThe shift was triggered by Russia’s invasion of Ukraine, tensions over Taiwan that included Chinese missiles lobbed into waters close to Japanese islands earlier in 2022, and North Korea stepping up its missile launches.\nJapan treads carefully when it comes to the language it uses in describing the security concerns posed by its biggest trading partner, China, though it has used the word “threat” in defence ministry documents in regard to the likes of North Korea.\nReferring to a “remarkable” build-up of missile capability in the region, the government says in the document it is becoming difficult to deal with the situation simply by strengthening Japan’s existing missile defence network.\nThe revisions to three documents governing Japan’s security and defence strategy call for acquiring “counter-strike capability” that would enable it to target an enemy’s military facilities, in a turning point for a country bound by a pacifist Constitution since 1947.\nJapan plans to buy Lockheed Martin’s Tomahawk missiles for that purpose, according to the documents. The missile has a range of more than 1,250km, meaning it could be used to hit naval bases on the east coasts of China and Russia.\nJapan also intends to obtain sufficient supplies of missiles, including those made on its own, over the coming decade with ranges long enough to strike military assets in its three nuclear-armed neighbours that have been a focus of Tokyo’s concerns.\nStill no to nukes\nWith its new strategy in place, the government is also considering revising the defence guidelines governing its military cooperation with its only formal treaty ally, the United States, according to Kyodo News, which cited government sources.\nMr Kishida may raise the issue during a visit to the US that the government is seeking to organise for January, the agency said.\nJapan will retain its “exclusively defensive” posture, as well as its ban on nuclear weapons, according to the documents.\nNevertheless, China has made clear to Japan its objections to the wording in the new documents, saying Beijing was committed to maintaining peace and stability.\n“The Japanese side ignores facts,” Chinese Foreign Ministry spokesperson Wang Wenbin told a Wednesday news conference. “Hyping up the ‘China threat’ to find an excuse for its military build-up is doomed to fail.”", "url": "https://www.straitstimes.com/asia/east-asia/japan-calls-china-an-unprecedented-challenge-in-security-shift"}