{"authors": [], "date_download": "2024-10-12 13:59:47", "date_modify": "2024-10-12 13:59:47", "date_publish": "2023-05-02 17:15:00", "description": "The search last November was part of an investigation into Western military pilots training China’s military. Read more at straitstimes.com.", "filename": "asia_australianz_australian-police-searched-pilots-home-for-china-fighter-jet-records_1728741587.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/02/2023-04-09T014136Z1756514635RC2PA0AEUXXJRTRMADP3CHINA-TAIWAN_1.JPG?VersionId=l_2gByx9UYQffsEVTuhjvF6tlunwZ56w", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australian-police-searched-pilots-home-for-china-fighter-jet-records_1728741587.html", "title": "Australian police searched pilot's home for China fighter jet records: Court judgment", "title_page": "Australian police searched pilot's home for China fighter jet records: Court judgment | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Australian police searched the home of a British former test pilot for documents related to China’s J-16 strike fighter, Australia’s intelligence partners and China’s biggest aviation company, a court judgment shows.\nThe search last November was part of an investigation into Western military pilots training China’s military at a time of growing tensions between China and the United States and its allies.\nBritain and Australia have announced crackdowns on former military pilots working to train Chinese fliers. Britain has vowed to change its national security law to stop them from working for intermediaries including a South African flying school, which was alleged to be helping China’s People’s Liberation Army (PLA) recruit pilots.\nMr Keith Hartley, chief operating officer of the Test Flying Academy of South Africa (TFASA), has not been charged. He challenged the validity of the search warrant in Australia’s Federal Court, questioning its wording and seeking the return of seized material.\nThe court rejected his application on April 28 and released its judgment, which sheds new light on the investigation into the flying school, which has a partnership with China’s state-owned Aviation Industry Corporation of China (Avic) to train Chinese pilots in South Africa, and had employed several Western pilots with military backgrounds.\nFederal police searched Mr Hartley’s home on suspicion that he had broken the law by providing military-style training directed or funded by China between 2018 and 2022, the Federal Court heard.\nThe search warrant sought evidence to support an Australian police investigation into Mr Hartley, who was suspected of organising or facilitating the training delivered by the flight school “to PLA pilots in regard to military aircraft platforms and military doctrine, tactics and strategy”.\nMr Hartley’s lawyer, Mr Dennis Miralis, said he was reviewing the court decision and seeking specialist legal advice on whether to appeal.\n“Keith Hartley and TFASA deny any criminal wrongdoing in this matter,” he said in a statement.\nThe judgment shows police had searched for documents and digital records, including e-mails and encrypted messages, relating to TFASA, the PLA, four models of PLA fighter jets and fighter training aircraft including the J-16 strike fighter and J-11 fighter, Avic and two individuals whose names were redacted.\nPolice also searched for references to Australia’s Five Eyes intelligence partners New Zealand, Canada, the United States and Britain, as well as the North Atlantic Treaty Organisation and Australia’s air force, the judgment shows.\nIn her judgment, Justice Wendy Abraham wrote that the nature of the alleged offence would have been clear to Mr Hartley when he read the warrant, and police did not need to provide details on how the PLA was alleged to have directed or funded the training.\n“The applicant has not established that the warrant is invalid. It states conduct capable of constituting an offence, and it does so with a reasonable degree of precision,” she wrote. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/australian-police-searched-pilots-home-for-china-fighter-jet-records"}