{"authors": [], "date_download": "2024-10-12 14:06:31", "date_modify": "2024-10-12 14:06:31", "date_publish": "2018-05-14 17:38:50", "description": "PM Mahathir Mohamad had previously said that Attorney-General Mohamed Apandi Ali had \"undermined his own credibility\" and indicated that several government servants would be investigated for their roles in the aborted 1MDB probe. Read more at straitstimes.com.", "filename": "asia_se-asia_mahathir-says-malaysias-attorney-general-will-take-leave-of-absence_1728741991.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/small30x18/public/articles/2018/09/12/ak_anwar_1209.jpg?VersionId=wQpRrtgpGp4DDtN4h6UMh9l90EV_5BXc&itok=tw5myMir", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_mahathir-says-malaysias-attorney-general-will-take-leave-of-absence_1728741991.html", "title": "Mahathir says Malaysia's Attorney-General will take leave of absence", "title_page": "Mahathir says Malaysia's Attorney-General will take leave of absence | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PUTRAJAYA (THE STAR/ASIA NEWS NETWORK, REUTERS) - Malaysia's Attorney-General (A-G) Mohamed Apandi Ali has been told to take a leave of absence and will be temporarily replaced by the Solicitor-General, said Prime Minister Mahathir Mohamad on Monday (May 14).\nTun Dr Mahathir, 92, said although the Attorney-General's contract had been recently renewed, the government would go through the proper process to initiate investigations against Tan Sri Apandi.\n\"While he is on leave, the Solicitor-General will take over his work and will carry on his job,\" he told a press conference.\nAsked whether Mohamed Apandi was being investigated, the Prime Minister said a police report must first be lodged before an investigation can be done.\n\"We need a basis for an investigation. At this moment, we have yet to lodge a formal report, although there are a lot of allegations made against Apandi,\" said Dr Mahathir.\n\"We need a report and based on that, we will carry out a full investigation,\" he said.\n\"When the investigation is carried out, action can be taken, including to suspend the A-G or other action, including barring him from travelling outside the country,\" he added.\nApandi had reported to work on Monday, the first working day since Dr Mahathir's Pakatan Harapan alliance won the May 9 polls.\nDr Mahathir had previously said that the A-G had \"undermined his own credibility\" and indicated that several government servants would be investigated for their roles in the aborted probe into the financial scandal surrounding the 1Malaysia Development Berhad (1MDB) state fund.\n1MDB is facing investigations in several countries over allegations of graft and financial mismanagement.\nApandi had cleared former Prime Minister Najib Razak of wrongdoing after it was revealed that some 2.6 billion ringgit (S$647.09 million) alleged to be 1MDB funds were transferred to his bank accounts.\nDr Mahathir told reporters Monday the government was generally aware of the whereabouts of 1MDB-linked financier Jho Low.\nHe said that he would also appoint a new chief of the country's anti-graft agency following the resignation of Dzulkifli Ahmad from his post as the chief of the Malaysian Anti-Corruption Commission.\nTan Sri Dzulkifli, who took over from Tan Sri Abu Kassim Mohamed two years ago, tendered his resignation letter on Monday morning.\nAll alleged crimes committed by the previous government would be investigated, he said, adding that government ministries had been instructed that no documents could be taken out or destroyed.", "url": "https://www.straitstimes.com/asia/se-asia/mahathir-says-malaysias-attorney-general-will-take-leave-of-absence"}