{"authors": [], "date_download": "2024-10-12 13:51:07", "date_modify": "2024-10-12 13:51:07", "date_publish": "2024-01-02 05:09:01", "description": "In the coastal town of Suzu, 90 per cent of houses may have been destroyed. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-races-to-find-new-year-s-day-quake-survivors_1728741067.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/02/dw-japan-wajima1-240102.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-races-to-find-new-year-s-day-quake-survivors_1728741067.html", "title": "Japan quake death toll climbs to 55, with many feared trapped in freezing cold", "title_page": "Japan quake death toll climbs to 55, with many feared trapped in freezing cold | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – A powerful earthquake that hit Japan on New Year’s Day killed at least 55 people, with rescue teams struggling in freezing temperatures on Jan 2 to reach isolated areas, where many people are feared trapped under toppled buildings.\nIn Suzu, a coastal town of just over 5,000 households near the quake’s epicentre, 90 per cent of houses may have been destroyed, according to its Mayor Masuhiro Izumiya. “The situation is catastrophic,” he said.\nThe quake with a preliminary magnitude of 7.6 struck in the afternoon of Jan 1, prompting people in some western coastal areas to flee to higher ground as tsunami waves swept cars and houses into the water.\nAround 200 tremors have been detected since the quake first hit, according to the Japan Meteorological Agency, which warned that more strong shocks could hit in the coming days.\nA coast guard aircraft en route to deliver aid to the quake-hit region collided with a commercial plane at Tokyo’s Haneda Airport on Jan 2, killing five coast guard crew, while all 379 on board the Japan Airlines flight miraculously escaped a fire.\nPrime Minister Fumio Kishida said the extent of the quake damage was becoming “increasingly clear” more than 24 hours after it struck on the Noto peninsula in Ishikawa prefecture.\n“The government has deployed emergency rescue teams from the Self-Defence Forces, police and fire departments to the area, and is doing its utmost to save lives and rescue victims and survivors. But we have received reports that there are still many people waiting to be rescued under collapsed buildings.”\nMr Kishida said some 3,000 rescuers were finding it difficult to reach the northern tip of the peninsula, where helicopter surveys had discovered many fires and widespread damage to buildings and infrastructure.\nThere are around 120 cases of people awaiting rescue, his government spokesperson said.\nSituated on the Ring of Fire arc of volcanoes and oceanic trenches that partly encircles the Pacific Basin, Japan accounts for about 20 per cent of the world’s earthquakes of magnitude 6 or greater, and each year experiences up to 2,000 quakes that can be felt.\nMany rail services and flights into the area have been suspended. More than 500 people were stranded at Noto’s airport, which closed owing to cracks in its runway and access road, and damage to its terminal building.\nThe authorities have confirmed 55 deaths, all in Ishikawa prefecture, making it Japan’s deadliest earthquake since 2016.\nMany of those killed were in Suzu and Wajima, another city on the remote northern tip of the Noto peninsula.\nScores more have been injured, and the authorities were battling blazes in several cities on Jan 2 and hauling people from collapsed buildings.", "url": "https://www.straitstimes.com/asia/east-asia/japan-races-to-find-new-year-s-day-quake-survivors"}