{"authors": [], "date_download": "2024-10-12 14:20:05", "date_modify": "2024-10-12 14:20:05", "date_publish": "2023-11-08 14:03:55", "description": "US President Joe Biden and Chinese President Xi Jinping are expected to hold summit talks next week. Read more at straitstimes.com.", "filename": "asia_biden-xi-set-to-steal-apec-spotlight-with-talks-to-steady-ties_1728742805.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/08/LYNXMPEJA7050-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_biden-xi-set-to-steal-apec-spotlight-with-talks-to-steady-ties_1728742805.html", "title": "Biden, Xi set to steal Apec spotlight with talks to steady ties", "title_page": "Biden, Xi set to steal Apec spotlight with talks to steady ties | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - United States President Joe Biden and Chinese President Xi Jinping are expected to hold summit talks in San Francisco next week as they seek to stabilise tense ties by meeting in person for just the second time in nearly three years, but little bonhomie and no grand bargains appear in the offing.\nThe summit on the sidelines of the Asia-Pacific Economic Cooperation (Apec) forum follows a six-month US push to engage its geopolitical rival, including through several unreciprocated Cabinet-level visits, and recover from a diplomatic crisis over the US downing of an alleged Chinese spy balloon in February.\n“This is going to overshadow anything that happens at Apec,” said Dr Oriana Skylar Mastro, a Stanford University China expert.\nWhile US officials said there was “agreement in principle” for Mr Xi and Mr Biden to meet in San Francisco – a year after they last saw each other on the sidelines of the Group of 20 summit in Bali – Beijing has yet to confirm that Mr Xi will attend the Nov 15 to Nov 17 Apec gathering.\nApec is a 21-member group of economies that accounts for about 62 per cent of global gross domestic product and almost half of global trade, but it has increasingly become a stage for strategic competition between the US and China.\nWhile no big breakthroughs are expected, and Biden administration officials say announcing a slate of meeting outcomes is an outdated way of measuring progress in relations with China, experts have pointed to possible signals of improvement – such as increasing commercial flights between the countries – or steps towards cooperation on thornier issues, like stemming the flow of fentanyl precursor chemicals from China.\nUS officials have expressed some optimism in the improvement in largely severed military communications, but also cautioned that restoring truly functional dialogue between the two militaries could take time.\nSome analysts believe China seeks ambiguity in defence relations to constrain what Beijing sees as US military provocations in the region.\n“It’s going to be very business-like, very hard-nosed – a lot on the agenda that they’re both going to be trying to work through,” said Dr Victor Cha, an Asia expert at Washington’s Centre for Strategic and International Studies (CSIS).\n“But, at the same time, I guess, talking is better than not talking.”\nHard to get\nChina has played hard to get in response to an eagerness by Washington to secure a summit, with Beijing suggesting that Mr Xi’s attendance hinged on the US showing “sufficient sincerity”.\nThe Biden administration has faced criticism from Republicans for playing to Beijing’s hand, but argues the stakes are so high that direct engagement, particularly at the leader level, is vital to managing tensions and preventing disputes between the superpowers over issues, like Taiwan and the South China Sea, from veering into open conflict.\nDespite difficulties nailing down the summit, China has been struggling with economic issues after years of strong growth and has signalled that it wants friendlier ties by agreeing to preparatory meetings, such as nuclear arms control discussions that Washington has sought for years.\nProtesters are expected in San Francisco next week – some to support Beijing and others to demonstrate against China’s human rights record.\nMr Biden will welcome other Apec leaders – including from Vietnam, the Philippines, Canada and Mexico – and both he and Mr Xi will be playing to the gallery.\nMr Matthew Goodman, a trade expert who was White House coordinator for the last US-hosted Apec summit in 2011, said the US will seek to sell itself as the most dynamic economic partner for Asia, in contrast with a slowing China.\n“There are a lot of concerns about China’s economic conditions and its policies in the region,” Mr Goodman said.\n“I don’t think they are going to explicitly try and twist the knife as it were, but I think they will try to show by comparison that the US is growing well.”\nTrade\nUS Treasury Secretary Janet Yellen – who will meet Chinese Vice-Premier He Lifeng in San Francisco this week – has said the US would not ask Apec members to choose between Beijing and Washington.\nShe also acknowledged that while the US was decreasing its dependence on China, full decoupling of the US and Chinese economies was “simply not practical”.\nBut Washington has made clear that it would help allies and partners confront what it describes as Beijing’s economic “coercion” – the use of economic pressure to get states to conform to China’s policies. China has accused the US of the same thing in the past.\n“Our door is open to any country or economy facing PRC (People’s Republic of China) economic coercive threats,” Ms Melanie Hart, a senior China policy adviser at the US State Department, said on Monday.\nMr Biden will be buoyed by a Pew Research Centre poll showing he is winning the battle for public opinion over Mr Xi, and by the US still being considered the world’s leading economic power by most people in 24 countries surveyed.\nThe US President will be eager to reinforce that image by showing progress in the US-led Indo-Pacific Economic Framework for Prosperity, an initiative aimed at stepping up engagement in Asia to compete with China.\nHowever, trade experts say Washington has so far failed to convince Asia it was more than a pale alternative to a fully fledged regional trade deal, when former president Donald Trump quit in 2017.", "url": "https://www.straitstimes.com/asia/biden-xi-set-to-steal-apec-spotlight-with-talks-to-steady-ties"}