{"authors": [], "date_download": "2024-10-12 13:38:51", "date_modify": "2024-10-12 13:38:51", "date_publish": "2024-03-31 14:05:00", "description": "Tokyo and Beijing have been at loggerheads over the discharge of the treated wastewater. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-china-experts-discuss-fukushima-water-release_1728740331.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/31/2023-03-09T230129Z341694656RC2HPZ915VASRTRMADP3JAPAN-FUKUSHIMA-WATER-FISH.JPG?VersionId=FS7BXmCXfEl9C.zDA2wKhwa_y5YNGpX5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-china-experts-discuss-fukushima-water-release_1728740331.html", "title": "Japan, China experts discuss Fukushima water release", "title_page": "Japan, China experts discuss Fukushima water release | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - Japanese and Chinese experts held talks on treated wastewater from the stricken Fukushima nuclear plant, said Japan’s Foreign Ministry late on March 30, the first such talks to be announced since Tokyo began releasing the water into the ocean in 2023.\nJapan and China have been at loggerheads over the discharge of the wastewater, which was used to cool the reactors after the 2011 meltdown.\nJapan insists it has been safely treated, but China has criticised the release and banned Japanese seafood imports.\n“A dialogue between Japanese and Chinese experts on the discharge of... treated water into the ocean (by the Fukushima plant) was held in Dalian, China, on March 30 to exchange views on technical matters,” said Tokyo’s Foreign Ministry in a statement.\nThe announcement comes after Japanese Prime Minister Fumio Kishida met Chinese President Xi Jinping in November and said science-based discussions would take place at the expert level.\nLast August, Japan began gradually discharging into the Pacific Ocean some of the 1.34 million tonnes of wastewater that have accumulated since the disaster, sparking a diplomatic row with China and Russia, both of which banned seafood imports.\nChina has accused Tokyo of treating the sea as a “sewer”, but Japan insists the discharge is safe, a view backed by the United Nations atomic agency.\nMr Kishida called on China at the November Asia-Pacific summit in San Francisco to make an “objective judgment” on the safety of Japan’s seafood, which is a major industry in the country.\nJapan began releasing the treated wastewater because the nuclear facility was running out of space to build more water tanks, and it needed to make room for the much more hazardous task of removing radioactive fuel and rubble from the three stricken reactors. AFP", "url": "https://www.straitstimes.com/asia/east-asia/japan-china-experts-discuss-fukushima-water-release"}