{"authors": [], "date_download": "2024-10-12 13:43:53", "date_modify": "2024-10-12 13:43:53", "date_publish": "2024-07-19 04:03:14", "description": "There was no sign of a fire or smoke onboard. Read more at straitstimes.com.", "filename": "asia_air-india-boeing-plane-bound-to-san-francisco-lands-in-russia_1728740633.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/19/LYNXMPEK6I00Q-2.jpg?VersionId=d3jjTuUzrxjZ3GncBNWn5FGVqfYKti02", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_air-india-boeing-plane-bound-to-san-francisco-lands-in-russia_1728740633.html", "title": "Air India sends ferry flight to Russia for stranded US-bound passengers", "title_page": "Air India sends ferry flight to Russia for stranded US-bound passengers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KRASNOYARSK, Russia – Air India said on July 19 that a plane with food and other essentials was on its way to pick up passengers stranded in Russia after the previous day’s San Francisco-bound flight made an emergency landing there.\nAn Air India airplane flying from Delhi to the West Coast city made an emergency landing in Russia after the crew detected a potential issue in the cargo hold area, its second such incident on the route in just over a year.\nIn a statement, Air India said a team, including crew and security personnel, were on board the ferry flight and that it had set up a dedicated hotline for anyone wanting to reach out to passengers.\nMany carriers, including US and European Union ones, do not fly over Russian airspace following the war in Ukraine, but Air India uses that route, giving it a flying time and cost advantage on US-bound flights.\nThe Indian embassy in Russia said on social media platform X that a team of three senior officials and an interpreter have reached Krasnoyarsk airport to assist the passengers.\nThe Boeing 777 aircraft, carrying 225 passengers and 19 flight crew, made a precautionary landing safely in the Russian region of Siberia at the Krasnoyarsk International Airport, the airline said in a statement.\nThe airport said the flight’s crew had been moved to hotels, and passengers were in the international departure area, which angered some of those stranded, according to social media posts.\nMr Mayank Gupta, whose mother was on the flight, wrote on X he was “sad and angry” that her medicines and luggage remained on the airplane.\nA passenger said on X that people were struggling to get food and water, posting a photo showing some passengers sleeping on the floor inside the airport area.\nThe airport said the plane landed due to an activated smoke detector.\nShortly after the incident, Russia’s civil aviation agency, Rosaviatsiya, said the aircraft had taxied to a parking spot after landing and there had been no signs of a fire or smoke onboard.\nBoeing and a spokesperson for the US State Department deferred to Air India for comment on the incident.\nRussia banned many foreign carriers from its airspace in retaliation for Western sanctions over the Ukraine war, and many countries and airlines also banned their planes from crossing over all or part of Russia.\nThe bans have redrawn air routes and upset business models for some airlines that now need to fly around the world’s largest country. United Airlines cancelled many of its non-stop US-India flights due to the issue.\nIn June 2023, an Air India Boeing plane on the same route was stranded for a day after reporting a technical issue. Air India sent an aircraft a day later to pick up the stranded passengers. REUTERS", "url": "https://www.straitstimes.com/asia/air-india-boeing-plane-bound-to-san-francisco-lands-in-russia"}