{"authors": [], "date_download": "2024-10-12 13:44:17", "date_modify": "2024-10-12 13:44:17", "date_publish": "2023-11-27 09:45:00", "description": "The latest move is aimed at boosting the tourism industry. Read more at straitstimes.com.", "filename": "asia_east-asia_south-korea-to-double-tax-refund-benefit-for-foreign-tourists-from-january_1728740657.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/27/aikorea271123.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_south-korea-to-double-tax-refund-benefit-for-foreign-tourists-from-january_1728740657.html", "title": "South Korea to double tax refund benefit for foreign tourists from January", "title_page": "South Korea to double tax refund benefit for foreign tourists from January | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - South Korea will double the limit on tax refunds for foreign tourists from January 2024, its finance minister said on Nov 27.\nThe limit will be raised to the maximum one million won (S$1,000) worth of a local purchase and five million won in total, Finance Minister Choo Kyung-ho said.\nCurrently, on-the-spot tax refunds are provided for an individual purchase of up to 500,000 won at designated stores. The maximum cap for total payments is now set at 2.5 million won.\nAt airport departure halls, there are no restrictions on purchases eligible for tax refunds, the Yonhap news agency reported.\nThe change is aimed at boosting the tourism industry, the report added.\n“Starting Jan 1, 2024, the maximum per-payment amount for tax refunds will be raised to one million won and the total to five million won,” Mr Choo said during a ministerial meeting.\n“The move aims to promote foreign tourists’ shopping here and to bolster the tourism industry,” he added. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/south-korea-to-double-tax-refund-benefit-for-foreign-tourists-from-january"}