{"authors": [], "date_download": "2024-10-12 13:39:02", "date_modify": "2024-10-12 13:39:02", "date_publish": "2023-08-29 14:53:00", "description": "Japan’s National Police Agency has received 225 reports of harassment calls to date, Jiji news reported. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-says-may-take-china-to-wto-over-fukushima-driven-seafood-import-ban_1728740342.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/29/2023-08-25T064538Z868296398RC2RU2AIHY08RTRMADP3JAPAN-FUKUSHIMA-CHINA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-says-may-take-china-to-wto-over-fukushima-driven-seafood-import-ban_1728740342.html", "title": "Japan may take China to WTO over Fukushima-driven seafood import ban", "title_page": "Japan may take China to WTO over Fukushima-driven seafood import ban | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - Japan threatened on Tuesday to take China to the World Trade Organisation (WTO) to seek a reversal of Beijing’s ban on all of its seafood imports after the release of treated water from the stricken Fukushima Daiichi nuclear power plant.\nJapan’s Foreign Minister Yoshimasa Hayashi told reporters that Japan will take “necessary action (on China’s aquatic product ban) under various routes, including the WTO framework”.\nFiling a WTO complaint might become an option if protesting to China through diplomatic routes is ineffective, Economic Security Minister Sanae Takaichi said separately.\nThe comments came as Japanese businesses and public facilities continued to receive harassment calls from phone numbers with the +86 Chinese country code, with many reporting callers complaining about the Fukushima water release.\nJapan’s National Police Agency has received 225 reports of harassment calls to date, Jiji news agency reported, and the government said it was seeking help from telecommunications firms to block the calls.\nAn increasing number of landline phone users are requesting to block foreign numbers, said a spokesman at NTT Communications, a Nippon Telegraph and Telephone unit.\nNTT East, which serves the eastern half of the country including Fukushima, said it had set up a customer service centre on Tuesday specifically for harassment calls from overseas, in response to the government’s plea.\n“It is extremely regrettable and concerning about the large number of harassment calls that have likely come from China,” Trade Minister Yasutoshi Nishimura said during a news conference.\nEven hospitals were receiving some calls, according to the people of Fukushima, he said. “Human life is at stake now. Please stop the calls immediately.”\nHe said the government is gathering information on the reports of movements to boycott Japanese products in China and would work with business leaders to address the situation. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/japan-says-may-take-china-to-wto-over-fukushima-driven-seafood-import-ban"}