{"authors": [], "date_download": "2024-10-12 14:03:54", "date_modify": "2024-10-12 14:03:54", "date_publish": "2023-01-09 13:21:41", "description": "Taiwan's semiconductor giant TSMC is building new facilities in Japan and the US, and is considering an additional site in Germany.  Read more at straitstimes.com.", "filename": "asia_east-asia_taiwan-passes-its-chips-act-offers-tax-credits-to-chipmakers_1728741834.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/09/aichip0901_0.JPG?VersionId=_7_BtHvA1eKBInMwHQwPGZ_WYDyBRdyX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_taiwan-passes-its-chips-act-offers-tax-credits-to-chipmakers_1728741834.html", "title": "Taiwan passes its Chips Act, offers tax credits to chipmakers", "title_page": "Taiwan passes its Chips Act, offers tax credits to chipmakers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TAIPEI – Taiwanese lawmakers have passed new rules that let local chip firms turn 25 per cent of their annual research and development expenses into tax credits, part of efforts to keep cutting-edge semiconductor technologies at home and maintain the island’s technology leadership.\nOfficials there have repeatedly said they will ensure the latest chip technologies remain in Taiwan, a point that has been reaffirmed by executives at Taiwan Semiconductor Manufacturing Co (TSMC) and other local chip giants. While Taiwan had assisted local chipmakers in the past with infrastructure construction and other measures, the island is now stepping up its efforts.\nShares of TSMC and United Microelectronics Corp were up more than 4 per cent in Taipei on Monday, the first trading day after the announcement of the new rules.\n“As the United States, Japan, South Korea and the European Union are all offering massive incentives to build domestic supply chains, Taiwan should bolster the global competitiveness of its key industries,” Taiwan’s Ministry of Economic Affairs said in a statement last Saturday. “The new rules will help encourage Taiwanese companies to keep their roots here.”\nGovernments from Washington to Seoul have been offering incentives for domestic chip production, in hopes of reducing a heavy reliance on Taiwan for advanced semiconductors and avoiding future supply disruptions.\nTo mitigate those concerns, TSMC is building new facilities in Japan and the US, and is considering an additional site in Germany.\nThe new incentives should take effect some time from 2023. Chip companies in Taiwan can also claim tax credits on 5 per cent of the annual costs of buying new equipment for advanced process technologies, the ministry said, in what has been dubbed the local version of America’s Chips Act. Any credits earned, however, cannot exceed 50 per cent of the total annual income taxes a firm owes.\nProcurement of equipment is the largest cost in setting up a new chip plant. For instance, ASML Holding NV’s essential extreme ultraviolet lithography machines now cost close to US$200 million (S$266 million) apiece. BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/taiwan-passes-its-chips-act-offers-tax-credits-to-chipmakers"}