{"authors": [], "date_download": "2024-10-12 13:51:30", "date_modify": "2024-10-12 13:51:30", "date_publish": "2021-02-13 22:29:02", "description": "The epicentre of the earthquake was off the coast of Fukushima prefecture at a depth of 60km. Read more at straitstimes.com.", "filename": "asia_east-asia_71-magnitude-earthquake-strikes-off-east-coast-of-japans-honshu-island_1728741090.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/02/14/2021-02-13t155350z_1534353854_rc2rrl9n7ag6_rtrmadp_3_japan-quake.jpg?VersionId=01j_qF_O8z_nNqyxFCn._uJEVXy77.NF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_71-magnitude-earthquake-strikes-off-east-coast-of-japans-honshu-island_1728741090.html", "title": "Strong quake hits off Japan's Fukushima, injuring dozens and triggering blackouts", "title_page": "Strong quake hits off Japan's Fukushima, injuring dozens and triggering blackouts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "IWAKI, JAPAN (REUTERS) - A strong earthquake hit off the coast of eastern Japan on Saturday (Feb 13), injuring dozens of people and triggering widespread power outages, but there appeared to be no major damage and no tsunami warning was issued.\nThe earthquake had a 7.3 magnitude and its epicentre was off the coast of Fukushima prefecture at a depth of 60km, the Japan Meteorological Agency said.\nIt shook buildings for some time after it hit, shortly after 11pm (10pm Singapore time).\nHouses and offices in the capital Tokyo, hundreds of kilometres away, also swayed and shook.\nNo tsunami warning had been issued, the meteorological agency said.\nAt least two dozen people were injured, according to reports from the Kyodo news agency.\nA Reuters cameraman on location in Fukushima said his 10th floor hotel room shook for some time. One man at the hotel was taken to hospital after falling and hitting his head on a door, the cameraman said.\nAlthough injured, the man was still able to walk, the cameraman said.\nTelevision footage also showed broken glass from shop fronts.\nKato said there were no irregularities at the Onagawa nuclear facility.\nThe quake hit off of Fukushima just weeks before the 10th anniversary of a quake on March 11, 2011 that devastated north-east Japan and triggered a massive tsunami leading to the world's worst nuclear crisis in a quarter of a century - one centred at the Daiichi facility.\nEarthquakes are common in Japan, one of the world's most seismically active areas. Japan accounts for about 20 per cent of the world's earthquakes of magnitude 6 or greater.", "url": "https://www.straitstimes.com/asia/east-asia/71-magnitude-earthquake-strikes-off-east-coast-of-japans-honshu-island"}