{"authors": [], "date_download": "2024-10-12 13:51:45", "date_modify": "2024-10-12 13:51:45", "date_publish": "2021-02-13 02:53:08", "description": "Cracks were reported in some northern Kashmir homes, and a wall was said to have collapsed in Amritsar. Read more at straitstimes.com.", "filename": "asia_south-asia_tajikistan-quake-shakes-north-india-pakistan-no-major-damage_1728741105.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/02/13/india-tajikistan-quake-182200.jpg?VersionId=fgAB4n06uq_DW9tpto3oonJOFymhjQOL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_tajikistan-quake-shakes-north-india-pakistan-no-major-damage_1728741105.html", "title": "Tajikistan quake shakes north India, Pakistan, no major damage", "title_page": "Tajikistan quake shakes north India, Pakistan, no major damage | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI (REUTERS) - A strong earthquake struck Tajikistan on Friday (Feb 12) and the tremors were felt as far away as north India and Pakistan, witnesses said.\nMany residents ran out of their homes, but no major damage was reported.\nThe US Geological Survey put the quake's magnitude at 5.9 and centred 35km west of Murghob in Tajikistan, central Asia.\nThe Tajikistan Emergency Situations Ministry said the epicentre was 420km east of the Tajik capital Dushanbe near the border with China.\nThe seismic service of the country's Academy of Sciences told Russia's RIA Novosti that the quake's intensity was measured at 6.1. The news agency said there were no casualties or damage, citing the Committee on Emergency Situations.\nMonitoring agencies in the region pegged the quake as being a bit more severe. India's National Centre for Seismology said its magnitude was 6.3, while the National Seismic Monitoring Centre in Pakistan measured it at 6.4.\nTremors were felt in Dushanbe but the epicentre was in a sparsely populated area.\nCracks were reported in some homes in northern Kashmir, the Indian Meteorological Department said. A witness also reported a wall collapse near the northern Indian city of Amritsar, but there were no reports of casualties.\nA resident in Indian Kashmir's Baramulla district said it felt like a strong wind had lashed his house.\n\"My whole house shook and cracks appeared in a corner of one of the rooms,\" Firdous Ahmad Khan said.\nTremors were felt across Pakistan including the capital, Islamabad, and northwestern Peshawar, and even as far as the eastern city of Lahore, which borders India.\nIn Muzaffarabad, the capital of Pakistani Kashmir, where a 2005 earthquake wreaked serious destruction, there was panic, according to witnesses, and many people rushed out of their homes in fear.", "url": "https://www.straitstimes.com/asia/south-asia/tajikistan-quake-shakes-north-india-pakistan-no-major-damage"}