{"authors": [], "date_download": "2024-10-12 13:46:30", "date_modify": "2024-10-12 13:46:30", "date_publish": "2020-03-12 09:31:14", "description": "BEIJING (AFP, REUTERS) - The number of fresh infections at the epicentre of China’s coronavirus epidemic dropped to a new low on Wednesday (March 11), but the country imported more cases from abroad. Read more at straitstimes.com.", "filename": "asia_east-asia_mainland-china-reports-15-new-coronavirus-cases-on-wed-down-from-prior-day_1728740790.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/03/12/nz_beijingmask_120320.jpg?VersionId=ZBZYdTJgu8I_6BmSeFmQwkXhpWqFDGyX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_mainland-china-reports-15-new-coronavirus-cases-on-wed-down-from-prior-day_1728740790.html", "title": "China’s coronavirus epicentre sees single-digit cases for first time", "title_page": "China’s coronavirus epicentre sees single-digit cases for first time | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (AFP, REUTERS) - The number of fresh infections at the epicentre of China's coronavirus epidemic dropped to a new low on Wednesday (March 11), but the country imported more cases from abroad.\nAnother 11 people died, the lowest daily increase since late January, bringing the toll in China to 3,169 deaths, according to the country's National Health Commission.\nThere were only eight new cases in Wuhan, the city where the virus first emerged in December before growing into a national crisis and a pandemic. In total, including Wuhan, mainland China saw 15 new cases.\nIt is the first time that the number of new cases in Wuhan, the capital of Hubei province, has fallen to single-digits since figures started to be reported in January.\nWith cases falling dramatically in recent weeks, the authorities this week began to loosen some restrictions on Hubei's 56 million people, who have been under quarantine since late January.\nHealthy people living in low risk areas of the province can now travel within Hubei. While Wuhan is not included, some of the city's companies were told they could resume work.\nOnly one other non-imported case was recorded elsewhere in the country.\nBut as global hot spots emerge elsewhere, China fears that cases arriving from abroad could undermine its progress.\nOn Thursday, there were six more imported cases reported, bringing the total number of infections from overseas to 85, health officials said.", "url": "https://www.straitstimes.com/asia/east-asia/mainland-china-reports-15-new-coronavirus-cases-on-wed-down-from-prior-day"}