{"authors": [], "date_download": "2024-10-12 14:06:31", "date_modify": "2024-10-12 14:06:31", "date_publish": "2018-05-15 21:03:38", "description": "According to a Malaysian government audit of the scandal-plagued state fund that was declassified, senior officials also took some decisions without the board's approval.  Read more at straitstimes.com.", "filename": "asia_se-asia_new-malaysia-govt-declassifies-1mdb-audit-report_1728741991.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/05/15/colin-1mbd-15.jpg?VersionId=6IeKntmdkK_8i1ETsqoMdUYNHxaekBfz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_new-malaysia-govt-declassifies-1mdb-audit-report_1728741991.html", "title": "Malaysia's 1MDB officials withheld information from board, says declassified report", "title_page": "Malaysia's 1MDB officials withheld information from board, says declassified report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR (REUTERS) - Senior officials at scandal-plagued state fund 1Malaysia Development Berhad (1MDB) withheld information from its board and took some decisions without the board's approval, according to a Malaysian government audit of the fund that was declassified on Tuesday (May 15) .\nMalaysia, under former Prime Minister Najib Razak, had classified the audit report in 2016 under the Officials Secrets Act when the fund's financial troubles were being investigated.\nReports had emerged by that time that about US$700 million (S$940.3 million) from 1MDB had gone to Najib's personal bank accounts. Najib denied any wrongdoing and the attorney general cleared him following local investigations.\nAfter Najib lost last week's election, new Prime Minister Mahathir Mohamad said he would reopen investigations into 1MDB and declassify the audit report. He barred Najib and his wife from leaving the country, and has replaced the attorney general who cleared Najib.\n\"In several instances, the 1MDB management had presented incomplete or inaccurate information to the 1MDB board before an important decision was made and had taken action without the approval of the 1MDB board,\" according to the audit report's executive summary seen by Reuters.\nAuditor General Madinah Mohamad verified the authenticity of the report seen by Reuters.\n1MDB did not immediately respond to a request for comment.\nBetween 2009 and 2015, several decisions involving high-value investments were made through 1MDB board resolutions without detailed discussion or evaluation, the report said.\nSeveral high-risk investments were made in a very short time, and the 1MDB management went against the board's and the shareholders' wishes in some instances, it said.\n\"There were also instances where the 1MDB management gave inaccurate or different information to interested parties,\" the report said.\nThe US Department of Justice has filed civil lawsuits alleging that over US$4.5 billion was misappropriated from 1MDB by high-level officials and their associates.\nThe lawsuits seek to seize about US$1.7 billion in assets, including a luxury yacht and paintings, that were bought with 1MDB funds.\nMeanwhile, in response to media queries on developments in Malaysia, the Commercial Affairs Department and the Monetary Authority of Singapore said: \"The Singapore authorities have cooperated extensively with their Malaysian counterparts on their past requests for information in relation to 1MDB-related transactions, and are fully prepared to extend further assistance.\n\"Singapore has also taken swift action against financial institutions and individuals who have broken laws within our jurisdiction in connection with 1MDB-related fund flows.\"", "url": "https://www.straitstimes.com/asia/se-asia/new-malaysia-govt-declassifies-1mdb-audit-report"}