{"authors": [], "date_download": "2024-10-12 13:58:17", "date_modify": "2024-10-12 13:58:17", "date_publish": "2024-04-09 13:29:25", "description": "Mr Gallagher will reportedly hold mass at cathedrals in the capital city Hanoi, and in Ho Chi Minh City. Read more at straitstimes.com.", "filename": "asia_vatican-foreign-minister-travels-to-vietnam-in-unprecedented-visit_1728741497.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/09/LYNXNPEK3807D-2.jpg?VersionId=JOYomxbe41jK8hI4zbT3mCYQRUr4joVR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_vatican-foreign-minister-travels-to-vietnam-in-unprecedented-visit_1728741497.html", "title": "Vatican foreign minister travels to Vietnam in unprecedented visit", "title_page": "Vatican foreign minister travels to Vietnam in unprecedented visit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANOI - The Vatican’s foreign minister Paul Gallagher began an unprecedented six-day visit to Communist-ruled Vietnam on April 9 as the two sides work on closer relations.\nMr Gallagher’s trip, the first to Vietnam for a Vatican foreign minister, could be followed by other top-level visits, including Pope Francis’, who the Vatican has said is planning a trip to Indonesia.\nAlthough no time frame for that trip has been announced, diplomats expect that could be combined with other countries in South-east Asia, including Vietnam, if Pope Francis’ health allows. Mr Gallagher said in January the pontiff was keen to visit Vietnam.\nVietnam’s foreign ministry said Mr Gallagher will meet his Vietnamese counterpart Bui Thanh Son late in the afternoon on April 9. Vietnam News Agency reported Mr Gallagher would also meet Prime Minister Pham Minh Chinh and will hold mass at cathedrals in the capital city Hanoi, in Hue, in the centre of the country, and in Ho Chi Minh City, Vietnam’s southern business hub.\nThe country of 100 million people is home to about seven million Catholics, government estimates showed, making it one of the largest communities in East Asia.\nThe Vatican and Vietnam broke off relations after the Communist Party took over the reunited country at the end of the Vietnam War in 1975. At the time, the authorities viewed the Catholic Church in Vietnam as having been too close historically to former colonial power France.\nVietnam’s government places certain restrictions on Catholic activities, such as the number of parishes, according to UCA, an independent Catholic news agency that specialises in Asia.\nIn July 2023, during a visit by Vietnam’s then President Vo Van Thuong to Pope Francis, the pair agreed to Archbishop Marek Zalewski becoming Resident Papal Representative in Hanoi, another unprecedented step that had been years in the making. REUTERS", "url": "https://www.straitstimes.com/asia/vatican-foreign-minister-travels-to-vietnam-in-unprecedented-visit"}