{"authors": [], "date_download": "2024-10-12 14:19:20", "date_modify": "2024-10-12 14:19:20", "date_publish": "2023-09-13 23:00:00", "description": "Topics discussing the new launch attracted 380 million views on social media platform Weibo. Read more at straitstimes.com.", "filename": "asia_east-asia_apple-v-huawei-a-new-smartphone-battle-divides-china_1728742760.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/13/10854031.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_apple-v-huawei-a-new-smartphone-battle-divides-china_1728742760.html", "title": "Apple v Huawei: A new smartphone battle divides China", "title_page": "Apple v Huawei: A new smartphone battle divides China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – Apple’s iPhone 15 drew mixed reactions in its third-largest market of China on Wednesday, with many online users liking its faster chip and improved gaming capabilities, while others preferred Huawei’s new smartphone.\nChina remains key for the US tech giant, which unveiled its new iPhone line-up on Tuesday. The company occupies a leading position in China’s premium smartphone market, in part due to the decimation of Huawei Technologies’ smartphone business by US export controls, but has also come under scrutiny in the run-up to the iPhone 15’s launch.\nShares in Apple and its suppliers were battered last week after reports that Chinese government agencies and state firms were banning staff from using the phone, and Huawei launched a new smartphone with an advanced chip, seen as an effort by the Chinese firm for a comeback.\nThe unveiling of Apple’s iPhone 15 attracted intense discussion online on Wednesday, as new models have done in the past. The new phone goes on sale online in China on Alibaba’s Tmall marketplace on Sept 15, and in-stores on Sept 22.\nTopics discussing the new launch attracted 380 million views on social media platform Weibo, with more than 800,000 discussions, including posts, comments and likes, on the iPhone 15.\nMany cheered the iPhone 15 Pro’s new 3-nanometre chip and Apple’s pitch that console-quality games, such as Resident Evil 4 Remake, could be played on the device, appealing to China’s army of mobile gamers.\nBut several social media users had misgivings about choosing an American brand over a domestically made rival, especially after state media applauded the roll-out of Huawei’s Mate 60 Pro earlier in September as a triumph by China over US sanctions.\nA survey by Chinese news portal Sina on the social media platform asking participants if they would buy the Mate 60 or iPhone 15 saw 61,000 votes for the Huawei device versus 24,000 for the iPhone 15.\nComparisons of how the Mate 60 Pro could make calls and send texts via satellite, while the iPhone 15 was only capable of satellite texts, also generated significant discussion.\n“The iPhone 15 can only send SOS messages via satellite, using last-generation technology already deployed in Huawei’s Mate 60, which supports full satellite calling,” one user wrote.\nChina’s smartphone market, like the sector globally, is in the midst of a slump and analysts cautioned that this, and the country’s slowing economy, could also weigh on sales of the iPhone 15.\nApple’s third-party retailers in February launched rare discounts on the iPhone 14 Pro by as much as 10 per cent that helped sales but could undermine demand for the latest series, analysts said.\n“This is not a good signal for the upcoming 15 series as some demand has been fulfilled before the launch,” said Mr Archie Zhang, a research analyst at Counterpoint. “Before Huawei’s surprise launch, we projected Apple’s sales in China in the third and fourth quarter to be flat or slightly weaker than last year.”\nMr Will Wong, an analyst with industry research group IDC, saw recent public sector developments and Huawei posing a challenge for Apple.\n“Sales (of the iPhone 15) are not going to be easy, especially since Chinese consumers are either being cautious in spending or have shifted their focus to leisure or travel,” he added.\nChina’s Foreign Ministry said on Wednesday that Beijing has not issued a ban on the purchase and use of foreign phone brands like Apple but noted that it has noticed media coverage of security incidents related to Apple’s phones.\nIDC expects Apple’s share in China’s premium phone market will gradually decline due to increased competition from Huawei.\nFor the first half of 2023, Apple held a 67 per cent market share for phones priced over US$600 (S$820), followed by Huawei with 15.6 per cent. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/apple-v-huawei-a-new-smartphone-battle-divides-china"}