{"authors": [], "date_download": "2024-10-12 14:07:17", "date_modify": "2024-10-12 14:07:17", "date_publish": "2024-08-29 19:37:16", "description": "The court's decision will now allow the case against BSI, which commenced in May, to proceed. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysias-1mdb-says-bid-to-strike-out-its-512m-claim-against-bsi-bank-dismissed-in-singapore_1728742037.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/LYNXMPEK7S0FO-2.jpg?VersionId=OEPlh9jfZbJlQMgIItpu2PdDm3hmYkEK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysias-1mdb-says-bid-to-strike-out-its-512m-claim-against-bsi-bank-dismissed-in-singapore_1728742037.html", "title": "Malaysia’s 1MDB says bid to strike out its $512m claim against BSI Bank dismissed in Singapore", "title_page": "Malaysia’s 1MDB says bid to strike out its $512m claim against BSI Bank dismissed in Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – A bid by now defunct BSI Bank to strike out a US$394 million (S$512.7 million) claim against it by scandal-hit Malaysian state fund 1Malaysia Development Berhad (1MDB) and its unit, Brazen Sky Limited, has been dismissed by Singapore’s High Court, 1MDB said on Aug 29.\nThree former BSI bankers have previously been convicted in Singapore in relation to the scandal at 1MDB, where at least US$4.5 billion is estimated to have been misappropriated in a complex globe-spanning scheme, according to the Malaysian and US authorities.\n“We are pleased this application has been denied and are committed to holding accountable the institutions and individuals involved in misappropriating money from Malaysia’s sovereign wealth fund, while ensuring the recovery and restitution of these assets back to the Malaysian people,” a spokesperson for 1MDB’s board said in a statement.\nThe Singapore High Court and Zurich-based banking group EFG International, which bought Swiss bank BSI in 2016, did not immediately respond to requests for comment on the case.\n1MDB and Brazen Sky are seeking redress for large-scale financial losses due to unauthorised fund transfers and money laundering schemes allegedly orchestrated through accounts at the Singapore branch of BSI.\nThe claim alleges that BSI and several of its former officers facilitated these transfers, assisting in the misappropriation of 1MDB’s assets.\nThe court’s decision will now allow the case against BSI, which commenced in May, to proceed, 1MDB said.\nEFG bought BSI from Brazil’s BTG Pactual, after the bank became tangled in legal problems related to the 1MDB scandal, which resulted in the closure of BSI’s Singapore branch in 2016.", "url": "https://www.straitstimes.com/asia/se-asia/malaysias-1mdb-says-bid-to-strike-out-its-512m-claim-against-bsi-bank-dismissed-in-singapore"}