{"authors": [], "date_download": "2024-10-12 13:27:20", "date_modify": "2024-10-12 13:27:20", "date_publish": "2024-08-29 08:35:00", "description": "The website operator was arrested on charges of copyright infringement. Read more at straitstimes.com.", "filename": "asia_east-asia_major-korean-webtoon-web-novel-pirate-site-shut-down_1728739640.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/rragitoon2908.jpg?VersionId=AKFWQbwAFF82UTSRoypHwPBBK1X35tqj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_major-korean-webtoon-web-novel-pirate-site-shut-down_1728739640.html", "title": "Major Korean webtoon, web novel pirate site shut down", "title_page": "Major Korean webtoon, web novel pirate site shut down | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – The South Korean authorities shut down Agitoon, a major piracy platform of Korean webtoons and web novels, and arrested its operator on charges of copyright infringement, officials announced on Aug 27.\nAccording to the Daejeon District Public Prosecutors’ Office, which led the crackdown with the Ministry of Culture, Sports and Tourism, Agitoon, at two different sites, shared unauthorised copies of over 2.5 million web fiction titles and 740,000 webtoon series.\nBased on the volume of pirated content and user visits, it appears to be the nation’s largest web content piracy case, the prosecution said.\nThe operator, identified as a 45-year-old with a history of copyright infringement, evaded local rules by hosting the servers overseas, making payments under borrowed names of Chinese nationals and frequently changing the websites’ domain.\nThe suspect had previously received a suspended sentence for operating a similar piracy site for Korean webtoons, but went on to launch Agitoon during the probation period.\nThe authorities have confiscated 120 million won (S$117,000) in illegal proceeds the operator earned through digital advertising, officials said.\nThe shutdown came after the Culture Ministry announced measures in July 2023 to eradicate piracy of Korean web content in order to protect the Korean content industry.\nAccording to its 2022 survey, the illegal webtoon distribution market stood at 842.7 billion won as at 2021. THE KOREA HERALD/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/major-korean-webtoon-web-novel-pirate-site-shut-down"}