{"authors": [], "date_download": "2024-10-12 13:33:09", "date_modify": "2024-10-12 13:33:09", "date_publish": "2024-08-30 15:55:00", "description": "Findings revealed that it was too risky to continue search and rescue activities at the sinkhole. Read more at straitstimes.com.", "filename": "asia_se-asia_kl-sinkhole-search-for-victim-halted-at-jalan-masjid-india-continues-at-sewage-plant_1728739989.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/30/11561541.jpg?VersionId=ry_9MjUZJUC_SESR3HwU_NCDtxfXbWFb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_kl-sinkhole-search-for-victim-halted-at-jalan-masjid-india-continues-at-sewage-plant_1728739989.html", "title": "KL sinkhole: Search for victim halted at Jalan Masjid India, continues at sewage plant", "title_page": "KL sinkhole: Search for victim halted at Jalan Masjid India, continues at sewage plant | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA – The search and rescue operation for a missing Indian tourist, Ms Vijayalaksmi, has been halted at the sinkhole site in Jalan Masjid India in Kuala Lumpur, but will continue at the Pantai Dalam IWK sewage plant, said Malaysia’s Fire and Rescue Department (JBPM).\nJBPM director-general Nor Hisham Mohamad said the decision was made after findings revealed that it was too risky to continue search and rescue activities using scuba-diving methods.\nRisk factors included strong underground water currents, limited space for rescuers and the presence of debris and hard blockages, Datuk Nor Hisham was quoted as saying by state news agency Bernama.\nHe added that while observing the search effort at 4am on Aug 30, he was concerned about the safety of divers who had to lie flat and crawl through a narrow area.\n“When we saw the entry point, which was about two feet (60cm) wide, we were really worried that they might get stuck.\n“There was a ‘piston effect’ from the water, making it impossible for them to retreat, which is very dangerous,” he said, as quoted by Bernama.\nMr Nor Hisham said the fire department would suggest alternative methods to Minister in the Prime Minister’s Department (Federal Territories) Zaliha Mustafa and the Kuala Lumpur City Hall at a meeting on the afternoon of Aug 30 to determine the direction of search efforts.\n“Besides posing a high risk to scuba divers, there are also obstructions difficult for divers to navigate,” he said.\nImmediately after arriving at the Pantai Dalam IWK sewage plant at 8.40am, members of the search and rescue team, consisting of the JBPM and workers from Indah Water Konsortium (IWK, the waste management company serving Kuala Lumpur), were seen discussing their plan.\nA Fire Rescue Tender and a JBPM van were also there, along with nearly 10 firefighters preparing to carry out their duties.\nSeparately, Prime Minister Anwar Ibrahim on Aug 30 gave the assurance that tourists visiting Kuala Lumpur need not worry, as “it is safe”. Datuk Seri Anwar, during a visit to Penang, told reporters that a geotechnical study had established the cause of the incident and found that it was safe.\nHe said that any areas considered at risk of turning into sinkholes should be dealt with right away, adding that Dr Zaliha should monitor those areas closely.", "url": "https://www.straitstimes.com/asia/se-asia/kl-sinkhole-search-for-victim-halted-at-jalan-masjid-india-continues-at-sewage-plant"}