{"authors": [], "date_download": "2024-10-12 13:34:19", "date_modify": "2024-10-12 13:34:19", "date_publish": "2024-09-12 10:48:27", "description": "Here are the leading contenders based on public opinion polls. Read more at straitstimes.com.", "filename": "asia_whos-vying-to-be-japans-next-prime-minister_1728740059.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/aijapan1209234.jpg?VersionId=.RcYsm1B_SXw6WlsGVpmsGSbwhSlBQtg&h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_whos-vying-to-be-japans-next-prime-minister_1728740059.html", "title": "Who’s vying to be Japan’s next prime minister?", "title_page": "Who’s vying to be Japan’s next prime minister? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan's ruling Liberal Democratic Party (LDP) on Sept 12 unveiled the nine candidates who will run in a Sept 27 leadership election to replace Prime Minister Fumio Kishida.\nHere are the leading contenders based on public opinion polls.\nShigeru Ishiba, 67\nThe former defence minister is making his fifth and, he says, final bid to lead a party that has governed Japan for most of the past seven decades.\nMr Ishiba leads in most opinion polls, with 28 per cent of respondents in an NHK survey on Sept 9 favouring him as Mr Kishida's successor.\nHe is alone among the candidates in calling for a shift from nuclear power to renewable energy such as geothermal, and supports legislation that would allow female emperors, a view opposed by many LDP lawmakers.\nHis economic strategy includes boosting wages to counter rising prices and possibly exempting some goods from Japan's 10 per cent sales tax to help lower income citizens.\nHe backs the Bank of Japan's policy to gradually raise interest rates but has said it is unclear whether the timing is right for any new hikes now.\nMr Ishiba has also proposed establishing a disaster management agency to build shelters, and wants to improve conditions for military personnel to ensure ageing Japan has enough troops for its defence.\nThe son of a former prefectural governor and Cabinet minister, Mr Ishiba is a rare Christian in a country dominated by Buddhism and Shinto. He is known for building model ships and planes.\nShinjiro Koizumi, 43\nThe youngest candidate, Mr Koizumi is the son of a former prime minister and heir to a political dynasty that has had a hand in governing Japan for over a century.\nHe has presented himself as a reformer able to restore public trust in a party mired in scandals. If elected, he would become Japan's youngest prime minister in eight decades.\nFavoured in media polls by younger voters and women, Mr Koizumi has promised to call a general election that could see Japanese voters go to the polls before the US presidential vote in November.\nMr Koizumi has promised to accelerate Mr Kishida's policies to foster dynamic economic growth that can adapt to technological change, including the rise of artificial intelligence.\nThe Columbia University-educated lawmaker has proposed opening up Japan's regulated taxi market to ride-sharing and is promising financial support for pensioners and low-income households.\nHe has said he will push for higher wages at small and medium-sized companies, while also making it easier for firms to lay off workers.\nMr Koizumi supports legislation to allow women to retain their maiden names and wants to allow female emperors, despite opposition from many LDP lawmakers.\nHe also backs a revision to Japan’s war-renouncing Constitution.\nA keen surfer, Mr Koizumi is married to a French-Japanese TV personality. One of his brothers, Mr Kotaro Koizumi, is also a well-known actor in Japan.\nSanae Takaichi, 63\nRepresenting the LDP's right wing, Ms Takaichi serves as Japan's economic security minister. She is the leading female candidate in the race and ran against Mr Kishida in 2021.\nShe is known for her conservative views, including revising the pacifist Constitution, and is a regular visitor to the Yasukuni war shrine, which is seen by some Asian countries as a symbol of past militarism.\nShe also opposes allowing women to retain their maiden names, arguing that doing so would undermine tradition.\nMs Takaichi courted controversy in 2016 when she suggested the government could revoke broadcasting licences of media companies deemed to be politically biased.\nShe said she would prioritise economic growth to strengthen Japan’s international standing, while using “strategic spending” to boost employment and consumer sentiment.\nTaro Kono, 61\nWith the support of rank-and-file LDP members, Mr Kono was a leading leadership candidate three years ago but lost in a run-off to Mr Kishida, who had backing from more LDP lawmakers.\nThis time, Mr Kono, who, as digital minister, is trying to phase out fax machines, has lagged in opinion polls.\nThe third generation LDP lawmaker, who was educated at Georgetown University and served as Japan's foreign minister and defence minister, says his connections would give him an advantage in dealing with Washington, regardless of the outcome of the US presidential election.\nMr Kono says he would reform labour markets to improve pay and conditions for millions of part-time workers and to help people retrain for higher-wage jobs.\nIn the campaign, he has drawn attention for suggesting that Japan deploy nuclear-powered submarines to guard maritime choke points in the waters around the country.\nOther candidates\nOther candidates include Mr Toshimitsu Motegi, 68, the secretary-general of the LDP, who has also served as foreign minister and trade and economy minister.\nMs Yoko Kamikawa, 71, Japan's current foreign minister, is also running, as well as former economic security minister Takayuki Kobayashi, who, at 49, is the second-youngest candidate after Mr Koizumi.\nJoining them in the race are Mr Katsunobu Kato, 68, who has served as health and labour minister and chief Cabinet secretary, and the current holder of that position, Mr Yoshimasa Hayashi, 63, who is also a former defence minister and foreign minister. REUTERS", "url": "https://www.straitstimes.com/asia/whos-vying-to-be-japans-next-prime-minister"}