{"authors": [], "date_download": "2024-10-12 13:36:08", "date_modify": "2024-10-12 13:36:08", "date_publish": "2024-09-08 19:41:51", "description": "He is wanted on charges of child and sexual abuse and related allegations of human trafficking. Read more at straitstimes.com.", "filename": "asia_philippines-arrests-celebrity-pastor-accused-of-sex-crimes_1728740168.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/09/btquiboloy20240909.jpg?VersionId=ZYIakls7eAoDCQawygFGCLET.yOpyMaJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_philippines-arrests-celebrity-pastor-accused-of-sex-crimes_1728740168.html", "title": "No special treatment for fugitive televangelist Apollo Quiboloy, says Philippine president", "title_page": "No special treatment for fugitive televangelist Apollo Quiboloy, says Philippine president | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA – Philippine President Ferdinand Marcos Jr said on Sept 9 that evangelist preacher Apollo Quiboloy will not be given special treatment following his arrest on Sept 8 after a weeks-long police search for the celebrity pastor.\nQuiboloy, self-proclaimed “owner of the universe” and “appointed son of God”, is wanted on charges of child and sexual abuse and related allegations of human trafficking in the Philippines.\nHe is also on the Federal Bureau of Investigation’s “most wanted” list in the US on separate charges of sex trafficking and bulk cash smuggling.\nQuiboloy is followed by millions of people in the Philippines, where church leaders hold heavy sway in politics.\nMr Marcos told reporters: “There is no special treatment.”\nHe added: “We will treat him like any other arrested person and respect his rights.\n“We will demonstrate once again that our judicial system in the Philippines is active, vibrant and working.”\nMore than 2,000 police officers were deployed since August to search a sprawling compound in the southern city of Davao owned by Quiboloy’s church, the Kingdom of Jesus Christ, on suspicion that he was hiding there in a bunker.\nThe police gave Quiboloy until Sept 8 to surrender or see his sprawling compound raided, the Davao regional police chief, Brigadier-General Nicolas Torre, said at a news briefing on Sept 9.\nMr Israelito Torreon, Quiboloy’s lawyer, said the pastor surrendered to the police and military because he did not want the situation to further escalate.\n“The innocence of Quiboloy will be affirmed by the court,” Mr Torreon told DZBB radio.\nBrig-Gen Torre said: “The surrender was a formality. At the end of the day, whether he likes it or not, the end result will ultimately be the same.”\nInterior Minister Benjamin Abalos Jr. told the same briefing that the government was looking to file charges against people who helped Quiboloy evade arrest.\nQuiboloy is also a long-time friend of former president Rodrigo Duterte, who has filed a criminal complaint against Mr Abalos and several police officers for damaging Quiboloy’s property.\nMr Marcos said Quiboloy’s camp had set conditions for his surrender, including a guarantee he would not be sent to the US to face charges.\n“Putting conditions is not an option for someone who is a fugitive,” Mr Marcos said, describing the law enforcement operation to capture Quiboloy as “police work at its best”.\nHe added: “It is with some relief that I can say that this phase of the operation is over. We will now leave Quiboloy to the judicial system.”\nThe Philippines’ Department of Justice acknowledged the country’s extradition treaty with the US but said in a statement on Sept 9 that Quiboloy will first face trial and serve any sentence in the Philippines before any extradition request is granted. REUTERS", "url": "https://www.straitstimes.com/asia/philippines-arrests-celebrity-pastor-accused-of-sex-crimes"}