{"authors": [], "date_download": "2024-10-12 14:00:16", "date_modify": "2024-10-12 14:00:16", "date_publish": "2024-08-24 14:08:25", "description": "Small gatherings are emerging in the country to challenge traditional matchmaking norms. Read more at straitstimes.com.", "filename": "asia_pakistani-singles-defy-tradition-search-for-spouses-in-person_1728741616.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/24/LYNXMPEK7N01O-1.jpg?VersionId=ZtXmY6pvlX8KW4cJhGqy6cAtx89JT9lG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_pakistani-singles-defy-tradition-search-for-spouses-in-person_1728741616.html", "title": "Pakistani singles defy tradition, search for spouses in person", "title_page": "Pakistani singles defy tradition, search for spouses in person | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LAHORE - Dozens of young singles gathered this week to meet potential marriage partners in Pakistan’s eastern city of Lahore, the first attempt by a UK-based matrimonial app to help people find spouses in person in the conservative Islamic country.\nTypically, marriages in Pakistan are arranged by parents who look for suitable matches for their children from within their communities or the extended family. Dating apps are generally stigmatised and gender segregation socially and at work remains common in the country of 240 million people.\nThe Lahore event was organised by Muzz, formerly Muzzmatch, which says its app is based on Islamic etiquette. The app is restricted to Muslim users, and, in a nod to traditional values, gives the option of blurring pictures except for specific matches and allows for chaperones to oversee meetings.\nOther smaller events are also emerging in the country to challenge traditional matchmaking norms.\nDespite criticism online in the past for the app, the Muzz event was attended by about 100 people.\nMs Aimen, a 31-year-old woman who did not want to be further identified, said she used the app on the recommendation of her US-based brother.\n“I used the app for two weeks, but then I saw an ad for this event and thought, why not meet people in person?” she told Reuters.\nShe said that her mother would have accompanied her as a chaperone but couldn’t attend because of ill-health.\nMuzz, launched in 2015 in the Britain, which also has a sizeable Muslim population, has over 1.5 million users in Pakistan, its second-largest market after Morocco.\nMr Moaz, a 27-year-old man, said he has been using Muzz for a year and that he was hopeful of finding a wife through the app.\n“I do get matches, but they have different priorities,” he said adding that girls on the app expect him to involve his parents from the beginning.\n“That is not (immediately) possible,” he said, stressing the need of getting to know someone before taking the next big step.\nAnnie’s Matchmaking Party, another Lahore event last week, used an algorithm to match 20 young professionals after a selection process and invited them to the meet.\nMs Noor ul Ain Choudhary, the 30-year-old organiser, faced criticism online that her event promoted a “hookup culture”. She countered that it aimed to provide a safe space for singles to meet and connect.\n“In Pakistan, we’ve had two options: biased arranged marriages or time-consuming dating apps with no guarantees. Safety during meetings is also a concern,” she said.\nMr Abdullah Ahmed, 22, was bullish about in person events and said he was convinced he may have found his perfect match at the Muzz gathering.\n“The highlight was meeting an amazing girl,” he said, beaming with excitement, adding that they instantly clicked and swapped social media handles.\n“We’re both Marvel fans! We’re already planning to catch the new Deadpool & Wolverine together,” he said. REUTERS", "url": "https://www.straitstimes.com/asia/pakistani-singles-defy-tradition-search-for-spouses-in-person"}