{"authors": [], "date_download": "2024-10-12 13:59:32", "date_modify": "2024-10-12 13:59:32", "date_publish": "2024-07-08 15:57:17", "description": "Moscow said its strikes were retaliation for attacks on Russia. Read more at straitstimes.com.", "filename": "asia_ukrainian-air-defence-engaged-in-repelling-russian-missile-attack-on-kyiv-officials__gl=1_vjphox__gcl_au_MjEwMDE3NDM4Ny4xNzIwNzk1NTk1_1728741572.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/08/2024-07-08T090041Z688656311RC2XQ8AHNTUDRTRMADP3UKRAINE-CRISIS-ATTACK-KYIV.JPG?VersionId=khKCaOE8r8yHvl_RtfFuxrm943.zgxis", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_ukrainian-air-defence-engaged-in-repelling-russian-missile-attack-on-kyiv-officials__gl=1_vjphox__gcl_au_MjEwMDE3NDM4Ny4xNzIwNzk1NTk1_1728741572.html", "title": "Russian missile attack across Ukraine kills at least 36, hits children’s hospital in Kyiv", "title_page": "Russian missile attack across Ukraine kills at least 36, hits children’s hospital in Kyiv | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Russia rained missiles down on cities across Ukraine in broad daylight on July 8, killing at least 36 civilians and badly damaging Kyiv’s main children’s hospital in the deadliest air strike in months, officials said.\nHundreds of people rushed to clear debris at the hospital, where windows had been smashed and panels ripped off. Parents holding babies walked in the street outside, dazed and sobbing after the rare daylight aerial attack.\n“It was scary. I couldn’t breathe, I was trying to cover (my baby). I was trying to cover him with this cloth so that he could breathe,” Ms Svitlana Kravchenko, 33, said.\nUkrainian President Volodymyr Zelensky said Russian forces fired more than 40 missiles, damaging residential and commercial buildings and infrastructure in Kyiv, his home city of Kryvyi Rih, the central city of Dnipro, and two eastern cities.\nTwenty-one people were killed in Kyiv and 65 more wounded in the main missile volley and another strike that came two hours later, emergency services said. Debris from the latter missile hit a different Kyiv hospital, killing seven people, they said.\nEleven were confirmed dead in Kryvyi Rih and 47 wounded, the emergency services said. Three people had been killed in the eastern town of Pokrovsk where missiles hit an industrial facility, the regional governor said. One person was also killed in the city of Dnipro, officials said.\n“The whole world must act as decisively as it can to put an end to Russian air strikes. Murder – this is what Putin brings. Only together we can achieve true peace and security,” Mr Zelensky wrote on messaging app Telegram.\nDuring a visit to Warsaw, where he signed a security pact with Poland, he called on Kyiv’s allies to give a firm response to the July 8 attack, in a press conference that started with a minute’s silence for the victims.\n“We will retaliate against these people; we will deliver a powerful response from our side to Russia, for sure. The question to our partners is: Can they respond?” he said.\nMr Zelensky said Kyiv wanted to be able to use weapons supplied by its partners to hit sites in Russia that attacks were being launched from.\nRussia’s Defence Ministry said its forces had carried out strikes on defence industry targets and aviation bases in Ukraine. Moscow said its strikes were retaliation for attacks on Russia.\nEarlier, the governor of the Russian Belgorod region which neighbours Ukraine said one civilian had been killed and three injured after Ukrainian shells hit a village.\nMoscow has repeatedly denied targeting civilians and civilian infrastructure, although its attacks have killed thousands of civilians since it launched its full-scale invasion in February 2022.\nThe attack came a day before leaders of Nato countries were due to begin a three-day summit of the military alliance in Washington that Mr Zelensky is expected to attend, with the war in Ukraine one of the focuses.\nUS Ambassador to Kyiv Bridget Brink posted on social media platform X: “This callous aggression – a total disregard for human life, jeopardising European and transatlantic security – is why leaders will make significant security commitments to Ukraine this week.”\nPlea for air defences\nDefence Minister Rustem Umerov said Ukraine still lacked enough air defences and urged Kyiv’s allies to supply more systems promptly to help protect its cities and infrastructure from regular Russian aerial attacks.\nThe power grid has already received so much damage from targeted Russian air strikes that began in March that electricity cuts have become widespread and the whirring sound of backup power generators in the streets have become ubiquitous.\nDTEK, Ukraine’s largest private power producer, said three electricity substations and electricity networks had been damaged in the capital.\nKyiv Mayor Vitali Klitschko said the attack on the capital was one of the largest of the war.\n“We heard an explosion, then we were showered with debris,” Ms Kravchenko said after she and her husband Viktor, emerged from a shelter at the hospital with their two-month-old baby.\nThe baby was unharmed, but Ms Kravchenko suffered cuts, and their car was completely buried under the rubble of a destroyed building across the courtyard from the hospital’s main ward.\nAnother explosion rang out over the city more than an hour after the strike, as the air force issued a warning to residents that air defences could engage Russian surveillance drones in the area. REUTERS", "url": "https://www.straitstimes.com/asia/ukrainian-air-defence-engaged-in-repelling-russian-missile-attack-on-kyiv-officials?_gl=1*vjphox*_gcl_au*MjEwMDE3NDM4Ny4xNzIwNzk1NTk1"}