{"authors": [], "date_download": "2024-10-12 13:33:21", "date_modify": "2024-10-12 13:33:21", "date_publish": "2024-07-04 17:15:31", "description": "All of those affected work for three companies operating at the facility. Read more at straitstimes.com.", "filename": "asia_chemical-leak-at-malaysias-kuala-lumpur-airport-affects-20-staff_1728740001.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/04/Sepang1.PNG?VersionId=Qqh79H6O003kZ.d72JRAhpGwi1aBC4w2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_chemical-leak-at-malaysias-kuala-lumpur-airport-affects-20-staff_1728740001.html", "title": "39 fall ill in gas leak at Malaysia airport facility", "title_page": "39 fall ill in gas leak at Malaysia airport facility | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - A gas leak on July 4 at an engineering section of Kuala Lumpur’s international airport saw 39 people fall ill, a Malaysian emergency services official said.\n“A total of 39 victims suffered from dizziness and nausea,” local rescue officer Muhammad Nur Khairi Samsumin said in a statement.\nHe added that 24 victims were discharged, 14 others were at the Air Disaster Unit receiving care and one was hospitalised.\nAll of those affected work for three companies operating at the facility.\nThe incident did not disrupt air travel at the country’s top airport.\nMr Muhammad Nur said the leaked gas was identified as methyl mercaptan, and the source was an “unused tank” at the facility.\n“Work to cover the leak was being done by the emergency crew,” he said, adding that the tank would be dismantled and disposed off.\nMr Muhammad Nur said methyl mercaptan is added to liquefied petroleum gas to give it a smell, alerting people to any leaks. The gas has a strong odour akin to rotten cabbages. AFP", "url": "https://www.straitstimes.com/asia/chemical-leak-at-malaysias-kuala-lumpur-airport-affects-20-staff"}