{"authors": [], "date_download": "2024-10-12 13:38:58", "date_modify": "2024-10-12 13:38:58", "date_publish": "2024-10-11 19:36:41", "description": "Mr Shigeaki Mori had been on a quest to find how many victims were cremated at his school playground. Read more at straitstimes.com.", "filename": "asia_for-hiroshima-survivor-hugged-by-obama-nobel-puts-focus-on-denuclearisation_1728740338.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/LYNXMPEK9A0F5-1.jpg?VersionId=_Mw3xr0RiXTav5k4jrJqcmM10ahos7g9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_for-hiroshima-survivor-hugged-by-obama-nobel-puts-focus-on-denuclearisation_1728740338.html", "title": "For Hiroshima survivor hugged by Obama, Nobel puts focus on denuclearisation", "title_page": "For Hiroshima survivor hugged by Obama, Nobel puts focus on denuclearisation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – A Japanese man who survived the nuclear bombing of Hiroshima and was decades later hugged by Mr Barack Obama during the then US President’s visit to the city, said he hoped the Nobel Peace Prize would help put a focus on nuclear disarmament.\nThe Norwegian Nobel Committee awarded the prize to the Nihon Hidankyo group of atomic bomb survivors for its work warning the world about the dangers of nuclear arms and bearing witness to the suffering unleashed upon Hiroshima and Nagasaki, the only two cities to have ever sustained such attacks.\nThe award comes a year ahead of the 80th anniversary of the dropping of the bombs by the United States in August 1945, which forced Japan’s surrender in World War II.\nMr Shigeaki Mori, who was eight years old when the bomb flattened Hiroshima, was embraced by Mr Obama during his visit to the atomic bomb memorial site in 2016, a moment that became a defining image of that visit.\nWhen contacted by Reuters and asked if he thought the Nobel Prize would bring greater awareness to the issue of denuclearisation, the octogenarian Mr Mori simply replied: “Yes”.\nHe said he was being inundated by calls for interview requests and did not comment further.\nIn an interview in 2023, Mr Mori told Reuters he was knocked unconscious by the blast. When he came to, he saw a woman holding her own entrails, asking for the nearest hospital.\nAs an adult, he began a multi-decade quest to find how many victims were cremated at his school playground. His work also unearthed the identities of 12 Americans who died in the bombing.\nMr Obama, who spoke of the “shared responsibility to look directly in the eye of history” when he visited Hiroshima, praised Mr Mori’s work in his speech.\nMr Obama avoided any direct expression of apology for the bombings, something many Japanese feel is overdue.\nMany nuclear bomb survivors – known as “hibakusha” in Japanese - although advanced in age, and their numbers dwindling, have tried to keep the legacies of Hiroshima and Nagasaki alive, seeing the events in the cities as more than just moments of history, but calls for change.\nThat call appears to have resonated.\nMr Joergen Watne Frydnes, chair of the Norwegian Nobel Committee, warned that nuclear nations should not contemplate using nuclear weapons.\n“I just don’t want all of this to end up being a dream,” Mr Mori told Reuters last year, referring to his hopes for disarmament. REUTERS", "url": "https://www.straitstimes.com/asia/for-hiroshima-survivor-hugged-by-obama-nobel-puts-focus-on-denuclearisation"}