{"authors": [], "date_download": "2024-10-12 14:00:15", "date_modify": "2024-10-12 14:00:15", "date_publish": "2022-09-26 14:27:04", "description": "A state government report earlier this year found sexual harassment and assault were rife in the sector. Read more at straitstimes.com.", "filename": "asia_australianz_mining-company-rio-tinto-says-employee-sexually-assaulted-in-western-australian-mine_1728741615.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/26/sv_riotinto_260922.jpg?VersionId=EnipPvAUTVt10q.f54HGac95VCbbeS4Y", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_mining-company-rio-tinto-says-employee-sexually-assaulted-in-western-australian-mine_1728741615.html", "title": "Mining company Rio Tinto says employee sexually assaulted at Western Australian site", "title_page": "Mining company Rio Tinto says employee sexually assaulted at Western Australian site | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Rio Tinto on Monday said an employee at one of its mines in Western Australia state was sexually assaulted and that police removed the alleged perpetrator from the site.\nThe incident comes three months after Australia's sex discrimination commissioner called for urgent changes in the country's mining industry after a state government report found that sexual harassment and assault were rife in the sector.\n\"Rio Tinto continues to work closely with Department of Mines, Industry Regulation and Safety in relation to its investigation,\" a spokesperson said in an emailed statement.\nAnglo-Australian mining firm Rio, which is headquartered in London, said the company will not provide more details due to the right to privacy and respect for any legal process but the incident has been shared with employees.\nA report released by Rio in February outlined a culture of bullying, harassment and racism at the global mining giant, including 21 complaints of actual or attempted rape or sexual assault over the past five years.\nWomen in mining sites across the industry have long complained of sexual harassment in so-called \"fly in, fly out\" mining camps, temporary accommodation set up at remote mines to house workers. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/mining-company-rio-tinto-says-employee-sexually-assaulted-in-western-australian-mine"}