{"authors": [], "date_download": "2024-10-12 14:07:33", "date_modify": "2024-10-12 14:07:33", "date_publish": "2024-06-11 19:05:00", "description": "It was claimed that a fashion designer had purchased or procured the luxury items. Read more at straitstimes.com.", "filename": "asia_se-asia_rosmah-amassed-468m-worth-of-jewellery-designer-goods-with-1mdb-funds-court-told_1728742053.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/11/dhrosmah.jpg?VersionId=TOB4fsO4mrbAt00VQ041eo2ylwWzVQVz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_rosmah-amassed-468m-worth-of-jewellery-designer-goods-with-1mdb-funds-court-told_1728742053.html", "title": "Rosmah amassed $468m worth of jewellery, designer goods with 1MDB funds, court told", "title_page": "Rosmah amassed $468m worth of jewellery, designer goods with 1MDB funds, court told | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - A massive amount of jewellery, handbags and other luxury goods was amassed from 48 vendors in at least 14 locations worldwide using monies totalling US$346 million (S$468 million) from 1Malaysia Development Bhd (1MDB) and SRC International, the High Court was told.\nThe locations of the vendors include the British Virgin Islands (one), Hong Kong (nine), India (four), Indonesia (two), Italy (three), Lebanon (three), Mauritius (one), Panama (one), Singapore (one), Thailand (two), the United Arab Emirates (seven), Turkey (two), Britain (two) and the United States (seven).\nThis was alleged in a statement of claim in a lawsuit by 1MDB, SRC and four subsidiaries against Rosmah Mansor and another individual filed last week.\nThe plaintiffs claimed that eight entities, registered offshore, had made 320 purchases of luxury goods with funds amounting to US$346,010,489 between 2010 and 2014.\nThe luxury items were received by Rosmah, they claimed.\n“These payments are traceable to and represent the monies misappropriated from 1MDB and its four subsidiaries and SRC International, that is, the funds misappropriated between 2010 and 2014,” the plaintiffs claimed.\nThe four 1MDB subsidiaries are 1MDB Energy Holdings, 1MDB Energy, 1MDB Energy (Langat) and Global Diversified Investment Company, formerly known as 1MDB Global Investments.\nThe companies claimed that monies to fund the purchases came from 1MDB and SRC, which were fraudulently transferred out to entities registered in offshore jurisdictions and had no connection with or served no legitimate purpose with regard to investment objectives by the companies.\n“These entities as well the transactions between them involving the fund, served no legitimate commercial purpose other than to act as a conduit for the onward movement and diversion of the funds to obscure final destinations,” the statement said.\nOn May 9, 1MDB, SRC and nine others, including the four 1MDB subsidiaries, filed the lawsuit against Rosmah seeking US$346 million belonging to them.\nThe plaintiffs claimed that Rosmah, the wife of jailed former prime minister Najib Razak, had used the funds from the companies to purchase luxury items such as jewellery, watches and handbags.\nApart from 1MDB, SRC and the four companies, other plaintiffs are Affinity Equity International Partners, Alsen Chance Holdings, Blackrock Commodities (Global), Blackstone Asia Real Estate Partners and Brightstone Jewellery.\nThe plaintiffs named Rosmah as the first defendant and Ms Shabnam Naraindas Daswani, who is also known as Natasha Mirpuri, as the second defendant.\nThey claim that Ms Shabnam, who is a fashion designer based in Singapore, had purchased or procured the luxury items on behalf of Rosmah.", "url": "https://www.straitstimes.com/asia/se-asia/rosmah-amassed-468m-worth-of-jewellery-designer-goods-with-1mdb-funds-court-told"}