{"authors": [], "date_download": "2024-10-12 14:04:20", "date_modify": "2024-10-12 14:04:20", "date_publish": "2023-09-05 09:28:39", "description": "In 2019, Italy became the first major Western nation to join China’s Belt and Road. Read more at straitstimes.com.", "filename": "asia_despite-romes-scepticism-china-says-belt-and-road-cooperation-with-italy-fruitful_1728741860.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/05/LYNXMPEJ84015-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_despite-romes-scepticism-china-says-belt-and-road-cooperation-with-italy-fruitful_1728741860.html", "title": "Despite Rome’s scepticism, China says Belt and Road cooperation with Italy ‘fruitful’", "title_page": "Despite Rome’s scepticism, China says Belt and Road cooperation with Italy ‘fruitful’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Despite Rome’s scepticism, cooperation with Italy under the Beijing-led Belt and Road initiative had been fruitful, with high-quality Italian products having entered “thousands of households” in China, said China Foreign Minister Wang Yi.\n“The thousand-year friendship inherited from the ancient Silk Road has endured,” he told visiting Italian Deputy Prime Minister Antonio Tajani at a meeting on Monday.\n“In the past five years, the trade volume between China and Italy has grown from US$50 billion (S$68 billion) to nearly US$80 billion, and Italy’s exports to China have increased by about 30 per cent,” Mr Wang said in a readout of the meeting from China’s Foreign Ministry, released on Tuesday.\nIn 2019, Italy became the first major Western nation to join China’s Belt and Road, a global trade and infrastructure initiative modelled on the idea of the old Silk Road that had linked imperial China and the West millennia ago.\nBut Italy, the only Group of Seven power to have signed up since the trade and infrastructure initiative was launched by Chinese President Xi Jinping a decade ago, has expressed doubts over its membership in recent months.\nMr Tajani said on Saturday before leaving for China that bilateral trade had not improved.\n“The Silk Road did not bring the results we expected,” Mr Tajani said. “We will have to evaluate, the Parliament will have to decide whether or not to renew our participation.”\nRome has until December to formally withdraw from the accord, which expires in March 2024. Otherwise, it will be extended for another five years.\nAny loss of the erstwhile terminus of the old Silk Road would be diplomatically embarrassing for China, which has expected to mark the achievements of the Belt and Road initiative at an international forum in Beijing in October.\nChina and Italy should adhere to the right way of getting along with each other through mutual respect, openness and cooperation, Mr Wang told Mr Tajani.\nHe stressed that in the face of “new situations and new opportunities”, China is willing to adhere to openness and a win-win for both sides. REUTERS", "url": "https://www.straitstimes.com/asia/despite-romes-scepticism-china-says-belt-and-road-cooperation-with-italy-fruitful"}