{"authors": [], "date_download": "2024-10-12 13:27:29", "date_modify": "2024-10-12 13:27:29", "date_publish": "2024-09-04 23:39:43", "description": "Some have the potential to spill over into humans, researchers say. Read more at straitstimes.com.", "filename": "asia_east-asia_dozens-of-viruses-detected-in-chinese-fur-farm-animals_1728739649.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/Mink.jpg?VersionId=yyYZbCp6FvcHMXmyvDU9KaPgyYbhtQYr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_dozens-of-viruses-detected-in-chinese-fur-farm-animals_1728739649.html", "title": "Dozens of viruses detected in Chinese fur farm animals", "title_page": "Dozens of viruses detected in Chinese fur farm animals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Dozens of viruses have been detected mixing in animals at fur farms in China, some of which are new and have the potential to spill over into humans, researchers said on Sept 4.\nSince the Covid-19 pandemic, scientists have been warning that farming mammals such as minks for their fur could make it easier for new viruses to cross over from the wild and spark fresh outbreaks.\nVirologist Edward Holmes, who has led research into Covid-19, told AFP he felt that the global fur farming industry “is one most likely ways by which a new pandemic will start”.\n“Personally, I think the fur farming industry globally should be closed down,” he added.\nProfessor Holmes is a co-author of a new study looking at the potential danger posed by viruses in fur farms in the country where the first Covid-19 cases emerged in late 2019.\nThe Chinese-led team of researchers sequenced the genetic material from lung and intestine samples of 461 animals such as minks, rabbits, foxes and raccoon dogs that died from disease across the nation between 2021 and 2024.\nMost were from fur farms, some were also farmed for food or traditional medicine, while around 50 were wild animals.\nThe team detected 125 viruses, including 36 new ones, according to the study in the journal Nature.\nThirty-nine of the viruses have a “high risk” of jumping across species, including to humans, the researchers evaluated.\nSome of those viruses – such as hepatitis E and Japanese encephalitis – have already spread to humans, but 13 were new, the study said.\nSeveral types of bird flu were also detected in guinea pigs, minks and muskrats.\nAnd seven types of coronaviruses were also spotted – though none were closely related to Sars-CoV-2, which causes Covid-19.\n‘Alarm bell’ virus\nThe virus that most concerned Prof Holmes was the “Pipistrellus bat HKU5-like virus”. It had previously been detected in bats but was found in the lungs of two farmed minks.\nIt is a relative of the Middle East respiratory syndrome coronavirus (Mers), which can be deadly to humans.\n“That we now see that it jumped from bats to farmed mink must serve as an alarm bell,” said Prof Holmes, who is a professor at the University of Sydney. “This virus needs to be monitored.”\nThousands of unknown viruses are believed to be circulating among wild mammals. Scientists fear that fur farms could allow farmed animals to catch such viruses, which could in turn expose humans.\nThe leading theory for the origin of Covid-19 is that it began in bats, then was transmitted to humans during the trade of wild animals.\n“I strongly believe that the wildlife trade was responsible for the emergence of Sars-CoV-2,” Prof Holmes said.\n“And I think that the related fur farming trade could easily result in another pandemic virus,” he added.\nIn the study, the researchers called for increased surveillance of fur farm animals – particularly for minks, raccoon dogs and guinea pigs, which recorded the most “high risk” viruses.\nDenmark culled its entire farmed mink population over Covid-19 fears in 2020, but has since reauthorised the practice. AFP", "url": "https://www.straitstimes.com/asia/east-asia/dozens-of-viruses-detected-in-chinese-fur-farm-animals"}