{"authors": ["Jonathan Pearlman"], "date_download": "2024-10-12 13:39:58", "date_modify": "2024-10-12 13:39:58", "date_publish": "2024-08-04 12:00:00", "description": "Government says it is committed to helping to build a green hydrogen sector for key industries like steel and cement. Read more at straitstimes.com.", "filename": "asia_australianz_australia-ponders-green-hydrogen-future-as-tycoon-scales-back-ambitions_1728740398.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/04/AUSTRALIA-CHINA-TRADE-DIPLOMACY-ECONOMY-094412.jpg?VersionId=msDdlHjy9jmwodqOe9ld9r_qD2YgQRMR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_australia-ponders-green-hydrogen-future-as-tycoon-scales-back-ambitions_1728740398.html", "title": "Australia ponders green hydrogen future as tycoon scales back ambitions", "title_page": "Australia ponders green hydrogen future as tycoon scales back ambitions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY – In recent years, colourful Australian mining tycoon Andrew Forrest – one of the country’s richest people – has made a surprising turn and become one of the world’s most prominent champions of replacing fossil fuels with green hydrogen.\nDubbed a “green prophet”, Dr Forrest, who runs one of the world’s biggest iron ore companies, Fortescue, has toured the globe, insisting that green hydrogen is the key to the planet’s clean energy future.\nHe even famously attacked billionaire Elon Musk, head of electric carmaker Tesla and a green hydrogen sceptic, dismissing Mr Musk as a “muppet” or fool.\nDr Forrest’s push has been backed by Australian Prime Minister Anthony Albanese whose government is investing more than A$4 billion (S$3.5 billion) in green hydrogen – part of the nation’s shift to net-zero carbon emissions by 2050.\nThe federal government said there are currently more than 100 green hydrogen projects worth A$225 billion being developed across the country.\nBut the viability of green hydrogen and its future in the country’s and the world’s energy mix recently came into question after the announcement by Dr Forrest on July 17 that he is winding back his green hydrogen plans.\nHe revealed that he will cut 700 jobs and will abandon plans to produce 15 million tonnes of green hydrogen by 2030.\nHe insisted he is not “walking away” from green hydrogen, but believes high power prices since the Russian invasion of Ukraine have lifted production costs and his immediate focus is to boost renewable energy output.\nAccording to a transcript of a call between Fortescue executives and investors and analysts on July 25 provided to The Straits Times, the head of Fortescue Energy, Mr Mark Hutchinson, said the firm needs to be “realistic about the pace of the current global energy transition”.\nThe change in plan by one of the world’s most high-profile proponents of green hydrogen generated anxious media headlines and raised concerns about whether Dr Forrest – and the country – has been overly optimistic about the fuel’s prospects.\nGreen hydrogen uses renewable energy to split water into its constituent parts, producing hydrogen that can then be used as a clean fuel.\nThe announcement by Dr Forrest appeared to dash some of the initial hopes for green hydrogen – that it could, for instance, become a major source of household energy or would be used to power cars and potentially challenge the rise of electric vehicles.\nBut most experts believe that green hydrogen still has a role in the global energy future and could be used as a power source for heavy industry or could cleanly process resources such as iron ore into green iron and green steel.\nDirector of independent think-tank Climate Energy Finance Tim Buckley told ST that Australia is set to be one of the world’s largest sources of renewable energy such as wind and solar power, and that these could eventually be used to produce vast quantities of green hydrogen.\n“Twiggy (Dr Forrest) was too far ahead of the curve – he has now pivoted to something that is more achievable this decade,” Mr Buckley said.\nThe federal government is investing heavily in green hydrogen. Apart from the A$4 billion to support new projects, it is also putting in more than A$500 million to support the construction of sites in regional areas where hydrogen can be produced, used and exported.\nMinister for Climate Change and Energy Chris Bowen insisted the government is still committed to helping to build a green hydrogen sector but believed the fuel would mainly be used for exports and production of cement, steel, plastics and fertilisers.\nAustralia is also set to partner with Singapore on a A$20 million maritime initiative that will look at developing lower-emissions shipping and port technology involving the use of fuels such as green hydrogen and green ammonia, according to Australia’s national science agency Csiro.\nGreen ammonia, which uses green hydrogen as a feedstock, is regarded as a low-emissions fuel for the maritime sector.\nSingapore also regards hydrogen as an important part of its strategy to reach net-zero emissions by 2050.\n“Green hydrogen will play a role in the electricity system but we have never said it would play the major role,” Mr Bowen told ABC News on July 31.\n“Of course, when you have a major industry under development, there are going to be things that happen more slowly than was originally envisaged.”\nAn energy expert, Emeritus Professor Kenneth Baldwin, from the Australian National University, said that green hydrogen could be used to produce fertilisers and steel. It could be a key source of clean energy exports for Australia as countries gradually reduce their reliance on the nation’s huge coal and gas resources.\nWhile electric vehicles were the “first movers” and so would probably not be replaced by hydrogen cars, green hydrogen could still be used for transport such as long-distance trucking, he said.\n“Australia should be doing everything it can to be an early provider of green hydrogen,” he added.\n“He (Dr Forrest) was certainly an early mover, but there are projects all around Australia looking to export green hydrogen and take advantage of our enormous renewable resources. While (his) project may have been put on hold, there are many others waiting to fill that space.”", "url": "https://www.straitstimes.com/asia/australianz/australia-ponders-green-hydrogen-future-as-tycoon-scales-back-ambitions"}