{"authors": [], "date_download": "2024-10-12 13:36:52", "date_modify": "2024-10-12 13:36:52", "date_publish": "2024-08-23 18:03:06", "description": "He will meet top Chinese diplomat Wang Yi in a visit aimed at keeping US-China tensions in check. Read more at straitstimes.com.", "filename": "asia_us-official-sullivan-to-visit-china-next-week-axios-reports_1728740212.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/23/LYNXMPEK7M0DQ-1.jpg?VersionId=B3qMmaqK9Syf5PZAqgdgCqNFcmmdmz_Q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_us-official-sullivan-to-visit-china-next-week-axios-reports_1728740212.html", "title": "US national security chief to visit China as election looms", "title_page": "US national security chief to visit China as election looms | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – White House National Security Adviser Jake Sullivan will travel to China next week for talks with top Chinese diplomat Wang Yi, a visit aimed at keeping US-China tensions in check with the November US election fast approaching.\nIn the Aug 27 to 29 talks in Beijing, Mr Sullivan will discuss issues ranging from Taiwan to bilateral military talks and the US fentanyl crisis, as well as China’s support for Russia’s defence industry and tensions in the South China Sea, North Korea, the Middle East and Myanmar, a senior US administration official told reporters.\nMr Sullivan has held regular talks with Mr Wang, with an eye to managing competition between the superpowers, and they last met in January in Bangkok. This will be the first visit to China by a US national security adviser since one by Ms Susan Rice under former president Barack Obama before the 2016 US election.\nMr Sullivan’s trip comes ahead of the Nov 5 US presidential election that pits current Democratic Vice-President Kamala Harris against former Republican president Donald Trump, in which US competition with China is a key foreign policy issue.\nThe US and China have sought to stabilise rocky ties in the past year since they sank to a historic low point after the US downed a suspected Chinese surveillance balloon in 2023.\nUS news website Axios reported earlier that Mr Sullivan and Mr Wang are expected to lay the groundwork for a potential meeting with US President Joe Biden and his Chinese counterpart Xi Jinping later in 2024, to follow up on their California summit in November 2023.\nWhite House national security spokesman John Kirby said he had no specific information on this but called US-China “the most important bilateral relationship in the world right now”.\n“We’re going to keep trying to manage this relationship in a way that’s consistent with our national security priorities,” he told a regular briefing.\nShortly after the trip announcement, Washington said it was imposing sanctions on more than 400 entities and individuals for supporting Russia’s war effort in Ukraine, including Chinese companies US officials believe are helping Moscow to skirt Western sanctions and build up its military.\nTough points\nThe senior administration official said Mr Sullivan’s visit should not be associated too closely with the election.\n“That’s not the point. We’ve tried to do these Wang Yi-Jake Sullivan touchpoints about once a quarter,” the official said.\n“(The election) is always in the background in any engagement we have with foreign officials concerned about what comes next or what the transition will be like, but this meeting will be focused on the topics and the issues that we are dealing with,” he added.\n“There’s a lot we can get done before the end of the year in terms of just managing the relationship. I think that will be the focus.”\nThe official added that Mr Sullivan would push for a resumption of theatre-level military-to-military talks with China, and was also likely to raise US concerns about China’s “increased military, diplomatic and economic pressure against Taiwan”.\nHe would also be looking to hear China’s assessment of the situation in the Middle East, where the two sides have different approaches but some shared concerns about instability.\n“It really is about clearing up misperceptions and avoiding this competition from veering into conflict more than anything else,” the official said.\n“The fight against illicit precursor chemicals and fentanyl is... a constantly evolving trade, and so there are always things we need to push forward.”\nCritics in Washington argue that the Biden administration has not put enough pressure on Beijing over fentanyl-related substances, which are the leading cause of US drug of overdoses.\nChina says it is cracking down on fentanyl and precursor chemicals and that the US crisis is a problem of demand, not supply.\nUS Secretary of State Antony Blinken met Mr Wang and Mr Xi in Beijing in April. That visit brought little progress on contentious issues, although there was some effort to ease the mood by emphasising educational and other cultural exchanges.\nMr Blinken reiterated Washington’s concerns over Beijing’s actions towards Taiwan and its support for Russia’s war in Ukraine when he met Mr Wang in Laos in July. REUTERS", "url": "https://www.straitstimes.com/asia/us-official-sullivan-to-visit-china-next-week-axios-reports"}