{"authors": [], "date_download": "2024-10-12 14:03:22", "date_modify": "2024-10-12 14:03:22", "date_publish": "2023-03-29 07:50:47", "description": "The shortage has been made worse by US efforts to limit Beijing’s access to advanced chip technology. Read more at straitstimes.com.", "filename": "asia_east-asia_china-tackles-chip-talent-shortage-with-new-courses-higher-pay_1728741802.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/29/CHINA-ECONOMY-032803_1.jpg?VersionId=t94QQMDinQbGQGj7wHIXIxusvI7L6z6u", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-tackles-chip-talent-shortage-with-new-courses-higher-pay_1728741802.html", "title": "China tackles chip talent shortage with new courses, higher pay", "title_page": "China tackles chip talent shortage with new courses, higher pay | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – China is ramping up efforts to develop home-grown semiconductor talent as it seeks to rapidly fill a shortage of expertise that has been made worse by United States’ efforts to limit Beijing’s access to advanced chip technology.\nEnrolments for undergraduate and post-graduate courses have surged over the past five years thanks to new funds for top universities as well as a boom in smaller private schools focused on shorter-term instruction.\nSome graduates with degrees in other subjects are being lured into the growth industry at a time when entry-level salaries have doubled.\n“The prospect of the chip industry is promising, while the employment for software engineers from ordinary schools is not as good as before,” said Ms Clara Zhao, who studied materials science at university before securing a job in the chips sector.\nChina faces a shortage of an estimated 200,000 industry workers in 2023, according to a white paper jointly published by the China Centre for Information Industry Development, a government think-tank, and the China Semiconductor Industry Association (CSIA), a trade group.\nClosing that gap is growing even more critical as the US looks to cut China off from global supply chains, citing fears that any advanced chips it makes will be ultimately used by China’s military.\nChina needs to prioritise training talent even over seeking immediate solutions to its supply-chain issues, Mr Liu Zhongfan, a member of the Chinese Academy of Sciences, told local reporters in March on the sidelines of a parliament meeting.\nHowever, students and experts told Reuters that China’s emerging chips curriculums do not provide the kinds of hands-on industry experience offered by more advanced schools in Taiwan and the US.\nA 2022 survey from Chinese research firm ICWise found more than 60 per cent of students studying chip engineering in China graduated with no internship experience in the field.\nChinese universities tend to reward professors across all fields for publishing papers rather than teaching up-to-date methodology that is useful in a company laboratory or chip manufacturing plant, according to recent graduates and academics.\nIn Taiwan, top chipmaker Taiwan Semiconductor Manufacturing Company (TSMC) has established research centres at four universities.\n“Taiwan’s school-enterprise collaboration is very good. A student might have three years of postgraduate study but will only be in class for a half a year,” said Mr Wang Ziyang, a recent graduate who blogs about chip hiring trends on LinkedIn-esque social network Maimai, where he has over 90,000 followers.\nThere are some steps in this direction in China. Its largest chip foundry, Semiconductor Manufacturing International Corp (SMIC), in 2021 announced a jointly-established School of Integrated Circuits at Shenzhen Technology University.\nEngineering bootcamps\nMaster’s enrolments to study chip engineering at 10 top universities nearly doubled between 2018 and 2022 to a total of 2,893 students, according to university data.\nThe jump in students is being mirrored at the undergraduate level, fresh graduates told Reuters, but solving the shortage will be a long-term campaign.\nUnderlining the supply-demand imbalance, the average annual salary for an entry-level engineer in the sector has doubled since 2018, from roughly 200,000 yuan (S$38,600) to 400,000 yuan, according to Mr Hu Yunwang, founder of a Shanghai-based recruitment agency for chips.\nA number of private schools have sprung up to offer a short-term solution, with chip engineering bootcamps that purport to provide a fast track and mainly target graduates who majored in a subject tangentially related to chip engineering.\nEeeKnow, founded by a former engineer from Arm Ltd in Shanghai in 2015, offers in-person classes on subjects such as “Cortex-M3 MCU front-end design and verification in 60 days”, priced at between 2,000 and 4,000 yuan.\nMr Abner Zheng, who graduated in 2019 from a university in Chengdu with a materials science degree, said he signed up for courses at EeeKnow after reading a blog post suggesting students with his major pursue opportunities in chips. He now works at a Chinese company making image-processing chips.\n“If I didn’t switch to chip engineering, I would probably have to find a job in a traditional manufacturing industry like cars or machinery,” he said.\n“I feel like these are sunset industries, so I’ve decided I should take advantage this big wave that’s coming for chips.” REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/china-tackles-chip-talent-shortage-with-new-courses-higher-pay"}