{"authors": [], "date_download": "2024-10-12 13:47:49", "date_modify": "2024-10-12 13:47:49", "date_publish": "2022-07-11 10:25:16", "description": "New sub-variants are providing a constant challenge to the country's zero-tolerance approach to the virus. Read more at straitstimes.com.", "filename": "asia_east-asia_shanghais-covid-19-outbreak-grows-as-first-sub-variant-case-detected_1728740869.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/11/AK_chcov_110722.jpg?VersionId=e7aNtnd_AyJy7csFJraBPgPxNazFb5nb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_shanghais-covid-19-outbreak-grows-as-first-sub-variant-case-detected_1728740869.html", "title": "Shanghai plans more Covid-19 testing amid fresh curbs across China", "title_page": "Shanghai plans more Covid-19 testing amid fresh curbs across China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (REUTERS) - Multiple Chinese cities are adopting fresh Covid-19 curbs, from business halts to lockdowns, to rein in new infections, with the commercial hub of Shanghai bracing for another mass testing effort after finding a highly-transmissible Omicron subvariant.\nThe tough curbs by local governments follow China's “dynamic zero-Covid” policy of promptly stamping out all outbreaks at a time when much of the world co-exists with the virus.\nChina has said curbs must be as targeted as possible to reduce damage to the world’s No. 2 economy, after this year’s major disruptions clogged global supply chains and hit international trade.\nThe discovery of a local infection with the BA.5.2.1 subvariant raises the stakes of quickly limiting a small outbreak to avert more disruptive steps similar to the lockdown in April and May that roiled the global economy and markets.\nThe BA.5 lineage, spreading fast in many other countries, has been detected in cities such as Xi'an in the province of Shaanxi and Dalian in Liaoning province, hundreds of kilometres on either side of Beijing.\nIt was first found in China on May 13 in a patient who had flown to Shanghai from Uganda, the China Center for Disease Prevention and Control said, with no local infections linked to the case that month.\nChina’s yuan currency eased against the dollar, with stocks weaker as well.\nData from China, including June trade figures on Wednesday and last month’s retail sales, industrial output and the April-June gross domestic product numbers on Friday (July 8), are likely to confirm the economy slowed down sharply in the second quarter amid coronavirus lockdowns in Shanghai and elsewhere.\nShanghai, China’s most populous city of 25 million, has told people in several districts to get tested twice in another round of mass screening from Tuesday to Thursday, similar to last week’s.\nIts residents are already testing every few days to secure access to various locations and public transport.\nAuthorities, and some investors, hope such relentless testing will uncover infections early enough to keep them in check.\nThe risk of a prolonged major city lockdown had been reduced with early controls, UBS Global Wealth Management said.\n“We expect Covid restrictions, mainly in the form of rolling mini-lockdowns for the rest of the year, which would be less disruptive to production or supply chains, along with the gradual rollout of more supportive policies,” it said in a note.\nDaily counts of locally transmitted infections in Shanghai increased to several dozens since July 5, up from single digits earlier this month, but are still tiny by global standards.\nMost of its recent cases have been among those already in quarantine.\nMainland China reported 352 new domestically transmitted Covid-19 infections on July 10, 46 of these symptomatic and 306 asymptomatic, the National Health Commission said on Monday.\nIn the central province of Henan, the town of Qinyang has almost completely locked down its nearly 700,000 residents from Sunday, with one person from each household allowed out every two days to get groceries.\nAuthorities in Wugang, another town in Henan, have told its 290,000 residents not to leave home in the next three days, except for COVID tests.\nFour major districts in the northwestern city of Lanzhou, in the province of Gansu, and the southern cities of Danzhou and Haikou in Hainan province, are under temporary curbs for several days, with a total of 6 million people affected.\nThe city of Nanchang in southern Jiangxi province, with 6.3 million residents, shut some entertainment venues on Saturday, although the duration of the curbs was not specified.\nIn the north-western province of Qinghai, the city of Xining kicked off a mass testing campaign on Monday after one person tested positive on Sunday.\nSeveral major districts in the southern metropolis of Guangzhou also began mass tests on Monday.", "url": "https://www.straitstimes.com/asia/east-asia/shanghais-covid-19-outbreak-grows-as-first-sub-variant-case-detected"}