{"authors": ["Danson Cheong"], "date_download": "2024-10-12 13:48:08", "date_modify": "2024-10-12 13:48:08", "date_publish": "2021-11-15 22:17:51", "description": "Covid-19 control has morphed into a giant whack-a-mole game, as the authorities try to get ahead of a far more infectious virus.  Read more at straitstimes.com.", "filename": "asia_east-asia_living-with-uncertainty-the-price-of-zero-covid-in-china_1728740888.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/11/16/ac_peoplelineupbeijing_161121.jpg?VersionId=erLd8c0uJXCgGvhY1m2AEnsTX82x8QGZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_living-with-uncertainty-the-price-of-zero-covid-in-china_1728740888.html", "title": "Living with uncertainty: The price of zero-Covid in China", "title_page": "Living with uncertainty: The price of zero-Covid in China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Two weeks ago, staff working at a state-owned enterprise in Beijing received news that a person infected with Covid-19 had visited the premises, and everyone would have to be quarantined immediately.\nMore than 4,000 people were tested overnight while environmental samples were taken. Work came to a screeching halt, but keeping the virus at bay was the top priority.\nYou can imagine the chaos as people scrambled to phone their families and resigned themselves to being locked in.\nA friend of mine who works there has spent the last 14 days quarantined in that office compound - sleeping first on a sofa, then a foldable camp bed before being sent to the company's on-site hotel. He will be allowed to leave on Tuesday (Nov 16).\nAnywhere else in the world, these measures will seem draconian and excessive, but here in China, where people look on with horror at the high case counts overseas, this has long been the accepted order of things.\nUntil recently, this tough approach of tight border controls, swift lockdowns, mass testing and vaccinations has kept the country largely free from the virus.\nBut in the last few months, as the more contagious Delta variant began spreading around the world, China has found its zero-Covid strategy being challenged.\nThe current outbreak has seen domestically transmitted cases in 21 provinces, with dozens of cases reported daily. Yesterday, China logged 34 local cases.\nNow Covid-19 control has morphed into a giant whack-a-mole game, as the authorities try to get ahead of a far more infectious virus - sealing off malls, office buildings and residential communities at the mere drop of a hat.\nThe price of living in China during the pandemic has always meant trade-offs of personal freedoms for safety.\nIt has been a bargain that most people accept, but this personal cost is rising as China battles more infectious variants of the virus.\nEspecially so in Beijing, since the Chinese capital is under pressure to be Covid-19-free as the Winter Olympics in February approaches.\nOver the weekend, it announced that travellers would need a negative Covid-19 test in order to enter the city from Wednesday (Nov 17).", "url": "https://www.straitstimes.com/asia/east-asia/living-with-uncertainty-the-price-of-zero-covid-in-china"}