{"authors": [], "date_download": "2024-10-12 13:52:48", "date_modify": "2024-10-12 13:52:48", "date_publish": "2023-02-25 15:29:11", "description": "Temperatures have been as much as 11 deg C above normal in some regions in the past week. Read more at straitstimes.com.", "filename": "asia_south-asia_rising-heat-in-india-raises-alarm-on-another-energy-crunch_1728741168.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/25/TOPSHOTS-TOPSHOT-INDIA-WEATHER-TAJ-101255_3.jpg?VersionId=Fg0L9weV8owZ9bIYOhx4z3PmyYB5Q8Cm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_rising-heat-in-india-raises-alarm-on-another-energy-crunch_1728741168.html", "title": "Rising heat in India raises alarm on another energy crunch", "title_page": "Rising heat in India raises alarm on another energy crunch | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI – High temperatures across parts of India have pushed electricity demand to near-record levels in recent weeks, triggering worries about yet another summer squeeze on power supply.\nPeak demand for electricity touched 211 gigawatts (GW) in January, close to an all-time high last summer, when heavy industry roared back from pandemic curbs and the population contended with sweltering conditions that saw a 122-year-old heat record breached.\nTemperatures have been as high as 11 deg C above normal levels in some regions in the past week, prompting the India Meteorological Department (IMD) to advise farmers to check wheat and other crops for signs of heat stress.\nThe unusually early onset of hotter weather – and forecasts that power consumption will rise as irrigation pumps and air conditioners are cranked up – is fuelling concern that India’s energy network will come under new strain after two successive years of disruptions.\nPower stations that use imported coal have already been ordered to operate at full capacity for three months during the summer season to help avoid blackouts, and to ease the pressure on domestic coal supplies.\nElectricity demand could set a new high of 229GW in April, according to the Ministry of Power.\n“The way temperature is rising – it is quite unusual in February. The situation is becoming a matter of concern for us,” said Mr Bhanwar Singh Bhati, the Minister of State for Power in the northern state of Rajasthan, where power supplies are already being rationed to homes and farmers.\n“The electricity demand may rise 20 per cent to 30 per cent compared with last summer. There is no other option than to cut power supply,” he said.\nRajasthan is among India’s hottest states and a hub of solar energy, yet it can struggle to ensure adequate power supply during summer months if there are delays receiving coal from mines in other regions.\nCoal accounts for more than 70 per cent of electricity generation in India, and stockpiles at power stations are currently well below the target of 45 million tonnes that the government asked to be met by the end of March.\nTo be sure, current elevated temperatures are not necessarily a signal of extreme weather in the period from March to May, according to Dr Mrutyunjay Mohapatra, director-general of meteorology at IMD.\n“It is natural to be excited if you get temperatures like this in the month of February,” he said.\nIndia’s ability to meet its summer power needs will also be largely determined by efforts to ensure that sufficient coal is being mined and transported, said Mr Pratap Keshari Deb, Energy Minister of Odisha, one of the nation’s top producers of the fuel.\nIf coal supplies are ensured, “everything falls in place”, he said. BLOOMBERG", "url": "https://www.straitstimes.com/asia/south-asia/rising-heat-in-india-raises-alarm-on-another-energy-crunch"}