{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:53:59", "date_modify": "2024-10-12 13:53:59", "date_publish": "2024-02-23 14:05:00", "description": "The Proton X70 premium SUV retails at between $34,000 and $36,000. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysian-man-gets-up-to-140-a-day-by-begging-owns-a-premium-suv_1728741239.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/23/btbeggar20240223.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysian-man-gets-up-to-140-a-day-by-begging-owns-a-premium-suv_1728741239.html", "title": "Malaysian man gets up to $140 a day by begging, owns a premium SUV", "title_page": "Malaysian man gets up to $140 a day by begging, owns a premium SUV | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A Malaysian man said he receives up to RM500 (S$140) a day by begging for just a few hours, and that he owns a sport utility vehicle (SUV).\nThis came to light when officers from the Social Welfare Department in the Maran district of Pahang were conducting checks to eradicate begging at the Sri Jaya night market on Feb 21.\nThe department did not say why that particular night market was targeted, saying only that its officers had spotted the man, dressed in a grey robe and a Muslim skull cap, begging for money.\n“He was holding a paper bag, soliciting sympathy from passers-by. Both of the man’s hands appeared small unlike those of a normal human,” the department said in a Facebook post, adding that there was money in the bag.\nThe officers questioned the man, but he did not answer, leading them to assume that he may be deaf and mute.\nBut they persisted in questioning him, and asked him for his identity card. His response surprised them – he said he had left the document in his car.\nA further surprise awaited them – the car turned out to be a Proton X70 premium sport utility vehicle, which retails at between RM123,800 and RM128,800.\nThe unnamed man told the welfare officers that he could get up to RM500 from just four to five hours of begging at night markets.\nThe man, who lives in the neighbouring east coast state of Kelantan, has also been receiving RM450 monthly allowance from the welfare department for his disability since 2001.\nThe welfare officers did not take stern action against the man, letting him go with a verbal warning as “this is his first offence” in the Maran district.", "url": "https://www.straitstimes.com/asia/se-asia/malaysian-man-gets-up-to-140-a-day-by-begging-owns-a-premium-suv"}