{"authors": [], "date_download": "2024-10-12 13:52:47", "date_modify": "2024-10-12 13:52:47", "date_publish": "2023-05-08 16:15:00", "description": "An emerging El Nino weather pattern is pushing the mercury to unprecedented levels in southern parts of the continent. Read more at straitstimes.com.", "filename": "asia_se-asia_brutal-heat-continues-to-grip-asia-in-warning-for-the-world_1728741167.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/08/10596103_1.jpg?VersionId=6Mp.vh4Up3jRsGUhN3dp5ZGp_Bc0ayWO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_brutal-heat-continues-to-grip-asia-in-warning-for-the-world_1728741167.html", "title": "Brutal heat continues to grip Asia in warning for the world", "title_page": "Brutal heat continues to grip Asia in warning for the world | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BANGKOK - Asia remains in the grip of a blistering heatwave, chiming with predictions from climate scientists that 2023 could be the world’s hottest year.\nIn an ominous sign ahead of the Northern Hemisphere summer, an emerging El Nino weather pattern is pushing the mercury to unprecedented levels in southern parts of the continent.\nVietnam reported its highest-ever temperature of 44.2 deg C over the weekend, triggering power shortage warnings, while Laos also likely broke records.\nThe Philippines cut classroom hours after the heat index reached the “danger” zone, reflecting the potentially deadly combination of heat and humidity.\nThe scorching temperatures follow a pattern of increasing extreme weather in recent years that is sending the world into uncharted territory.\nThe sweltering conditions are testing the ability of governments to protect public health and also to prevent major disruptions to agriculture and power generation in economies that are still recovering from the ravages of Covid-19.\nEl Nino – characterised by warmer ocean temperatures across the Pacific – has far-reaching impact on weather patterns around the world.\nIt could bring relief to drought-parched areas of Argentina and the southern United States, while blanketing parts of Asia and Australia with hotter, drier conditions. Coffee, sugar, oil palm and cocoa crops would be especially vulnerable.\nTemperatures in Thailand remained above 40 deg C in many northern and central regions over much of last week, pushing power demand to a fresh peak.\nA group of businesses and banks have asked the government to prepare an action plan to deal with a potential drought that they say might last for three years.\nRainfall in Malaysia may be as much as 40 per cent lower in some areas, which could put palm oil production at risk in one of the world’s biggest producers of the commodity.\nThe authorities are closely monitoring the return of forest fires and air pollution. An El Nino event in 2015 caused a particularly bad episode of haze that was one of the worst environmental disasters in South-east Asia.\nElsewhere in Asia, scorching temperatures have roasted parts of China, India and Bangladesh over the past few weeks.\nYunnan province, a major aluminium hub in south-west China, suffered its worst drought in a decade in April.\nIndia is on alert for more heatwaves, following soaring temperatures in April that prompted school closures in some states and caused at least 11 people to die of heat stroke after attending an event. BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/brutal-heat-continues-to-grip-asia-in-warning-for-the-world"}