{"authors": ["Tan Tam Mei"], "date_download": "2024-10-12 13:32:29", "date_modify": "2024-10-12 13:32:29", "date_publish": "2023-12-04 12:30:00", "description": "Climate change, urbanisation and tech advances are behind the growing interest in vertical farming. Read more at straitstimes.com.", "filename": "asia_se-asia_farmers-in-thailand-look-indoors-to-plant-strawberries-veggies-and-cannabis_1728739949.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/04/aapink041223.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_farmers-in-thailand-look-indoors-to-plant-strawberries-veggies-and-cannabis_1728739949.html", "title": "Farmers in Thailand look indoors to plant strawberries, veggies and cannabis", "title_page": "Farmers in Thailand look indoors to plant strawberries, veggies and cannabis | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BANGKOK – In the past year, pedestrians in Bangkok’s Sukhumvit Road have been drawn to a pinkish hue from a large window on the busy street.\nMany of them peer through the window and are surprised to see dozens of layers of strawberry plants stacked high behind the glass.\n“People are attracted by the window, and they are more than welcome to come in and find out more about Varmers,” said Mr Geert Liezenga, founder and chief executive of the company that grows strawberries through vertical farming.\nThe 35-year-old serial entrepreneur moved to Thailand from the Netherlands about five years ago, and planted the first strawberries in the vertical farm in January 2023.\nThe farm adopts a direct-to-consumer model and delivers its strawberries to consumers, supermarkets and restaurants.\nThe vertical farm, which is a little over 100 sq m in land area and stretches 11m vertically, is equivalent to a 4,800 sq m outdoor farm, and can produce more than 800,000 strawberries annually.\nDespite being in production for less than a year, Varmers is already working on opening another similar facility and experimenting with other crops, said Mr Liezenga.\nIndoor farming is the cultivation of crops in buildings or rooms with a controlled environment, and includes hydroponics. While it is still in its nascent days in Thailand, unlike in other countries such as Japan and Singapore, interest is growing.\nThe pressures of climate change and urbanisation, as well as technological advances and innovations, have pushed a new generation of local and foreign farmers in Thailand to experiment in this sector.\nThere are now about 50 start-ups in agricultural technology in Thailand, with a handful focused on novel farming systems like indoor farming, which is also termed “controlled environment agriculture”, or plant factories.\nThe market value of smart farming in Thailand has displayed potential, with global consultancy firm Frost & Sullivan estimating an increase of market value from US$106.9 million in 2017 to US$269.9 million (S$360.8 million) in 2022.\nOver the years, indoor farms similar to the likes of Varmers have been taking root in Thailand – utilising Bangkok’s urban metropolitan area to grow crops, ranging from strawberries to cannabis.\nThe concept of farming in covered spaces like greenhouses is not new, but, in recent years, growers have brought crops even closer to the consumers by using insulated spaces like warehouses, buildings and even shipping containers located smack in the middle of urban landscapes like Bangkok.\nThe more novel methods of indoor farming are bringing new meaning to the concept of farm to table. Varmers can go from receiving an order, harvesting the fruit, and delivering anywhere within Bangkok, in just 30 minutes.\n“It doesn’t get any fresher than that,” said Mr Liezenga.\nAnother urban farmer is Dr Wilas Chamlertwat, 46, who is a software developer.\nWith no background in agriculture, he dabbled in indoor farming as a hobby about five years ago.\nToday, he is one of the founders of noBitter, an indoor vertical kale farm that has a customer base of about 5,000 people.\nThere are now three noBitter farms in Bangkok and its surrounding provinces of Nakhon Pathom and Samut Prakan, and each can produce up to 20kg of leafy green kale a day.\nThrough the use of hydroponics, noBitter’s kale plants are not subject to pesticides and herbicides, or the unpredictable weather elements that plague outdoor-grown plants, said Dr Wilas.\n“When you consume kale from our indoor farm, you can be confident that you are receiving the full nutritional benefits of this superfood,” said Dr Wilas, as he munched on a freshly harvested leaf. “You don’t even need to wash it.”\nIn the confines of an indoor farm like noBitter’s, temperatures, humidity, nutrients and the amount of sunlight can be controlled – same for the yield, appearance and even taste. “We are able to eliminate the bitter taste associated with kale so we can enjoy its sweetness,” Dr Wilas said.\nThis is a promising solution for farmers, as it addresses the threat of climate change, where drought, flooding or climate shock can damage crops on outdoor farms and result in lower yields and incomes.\nThe unparalleled control of indoor farming not only results in better quality and quantities produced, but also makes it possible to grow fruit all year round. This gives Varmers an edge over traditional outdoor strawberry farms in Thailand’s north that typically produce fruit for only five months – from November to March.\nThis precise control is also what allows Varmers to perfectly time seeding and harvesting periods based on customers’ orders, thereby providing more efficient supplies with lower chances of wastage, said Mr Liezenga. “It takes 10 weeks for a strawberry to grow, and based on these timelines, we can grow on demand,” he said.\nHowever, indoor farming has its challenges and trade-offs, such as high capital investment, time spent while experimenting and building the initial set-up, as well as higher consumption of water and energy. This means the resultant produce is more expensive.\nWith outdoor-grown kale of varying quality available for just 100 baht (S$3.80) per kg, it has been hard for noBitter to compete in the mass market with its indoor-grown greens going for 700 baht per kg.\nAs a result, it is expanding its offerings to include a nutritional supplement made from kale and will soon be launching it, said Dr Wilas.\nDespite the limited market and high investment costs of indoor farming, the owner of Elm Farm, Mr Ravin Seesod, 35, counts the 3 million baht that he invested in his hydroponic cannabis farm well worth it, especially after one of his strains won first prize in a local competition in October.\n“It proves that my experiment was successful,” he said.\n“Competition judges said my weed had a fresher aroma and a cleaner taste. I also did not need to use pesticides on it,” said Mr Ravin, who grows about 140 cannabis plants in a building in Bangkok’s residential suburbs.\nIt took him several failed attempts and almost a year of research and experimentation before he settled on the right parameters for growing cannabis in a hydroponic set-up. Now, his focus is on increasing his yield levels.\nHowever, despite the growing numbers in Thailand looking to indoor farming, the bulk of agricultural activities will still use traditional farming methods, at least in the near future, said Assistant Professor Fa Likitswat from Thammasat University’s architecture and planning faculty.\nTraditional farming now takes up nearly 25 per cent of the country’s total land area (11.9 million ha). The sector also remains one of the main sources of income for the Thai population, hiring about 12 million workers, or one-third of the total number of labourers.\nHowever, the agricultural sector, which has long been a pillar of the Thai economy, has shrunk in the last decade, going from 11.5 per cent of gross domestic product in 2012 to less than 9 per cent in 2022.\nStill, with a large amount of resources dedicated to traditional farming, perhaps the best way to improve the agricultural sector will be to adopt a hybrid approach where certain parameters can be controlled while others are left to nature, such as using a greenhouse or labour-saving devices, or tapping big data, said Prof Fa.\nBig data, in particular, can provide farmers with granular data on factors like rainfall patterns, field conditions and yield, which can help farmers make better decisions on farming activities.\nBoth public and private entities in Thailand have tried to improve the traditional farming sector in the hope of modernising certain elements. Efforts include introducing mobile apps that can help conventional farmers conduct weather analysis, and offering soft loans for the purchase of smart machinery like drones or monitoring systems.\nBut realistically, the industry is also battling more structural issues such as an ageing population, with younger generations turning away from farm work in favour of careers in cities, said Prof Fa, noting that she also expects to see farmland being developed as new opportunities emerge.\n“Not all forms of farming need to go the route of high-tech indoor farming. Thailand will always have outdoor farming, so the problems have to be solved in that space,” she said.", "url": "https://www.straitstimes.com/asia/se-asia/farmers-in-thailand-look-indoors-to-plant-strawberries-veggies-and-cannabis"}