{"authors": ["Chang May Choon"], "date_download": "2024-10-12 13:27:57", "date_modify": "2024-10-12 13:27:57", "date_publish": "2024-10-09 19:42:00", "description": "South Korean President delivers message during the 47th Singapore lecture, as part of his state visit. Read more at straitstimes.com.", "filename": "asia_east-asia_yoon-s-message-of-hope-free-unified-korea-will-benefit-the-region_1728739677.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/09/SINGAPORE-SKOREA-DIPLOMACY-061516.jpg?VersionId=XGbYbwtoxrgRP5dWPoFYswp7qflUcRok", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_yoon-s-message-of-hope-free-unified-korea-will-benefit-the-region_1728739677.html", "title": "Yoon’s message of hope: Free, unified Korea will benefit the region", "title_page": "Yoon’s message of hope: Free, unified Korea will benefit the region | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - On the day the North Korean military announced it will completely cut off roads and railways connected to South Korea, President Yoon Suk Yeol opted to deliver a message of hope instead, focusing on how a unified Korean peninsula will benefit the region.\nWhile in Singapore for a state visit, the South Korean leader on Oct 9 delivered the 47th Singapore Lecture titled “A Vision for Korean Unification Towards a Free, Peaceful, and Prosperous Indo-Pacific Region” at Orchard Hotel. The session was chaired by Singapore’s Senior Minister Teo Chee Hean.\nCiting the recently announced “August 15 Unification Doctrine”, Mr Yoon said: “This doctrine reflects my commitment to strengthening Korea’s value system with freedom at its core, my commitment to broadly communicating a message of hope to North Korea on what unification based on freedom can bring, and my commitment to increasing solidarity with the global community in realising this vision.”\nThis marks the first time Mr Yoon has addressed an international audience regarding his vision for a unified Korea.\nThe doctrine includes programmes to inform North Koreans about the value of freedom and create a desire for change, efforts to provide humanitarian aid and improve the human rights situation in the North, as well as establishing dialogue with North Korea and strengthening solidarity with the global community.\nThe two Koreas have been divided since the end of the 1950-53 Korean War, after which the North remained communist under dynastic leadership while the South started embracing democracy.\nSouth Koreans, he said, have strong belief in and commitment to a free and democratic system that safeguards individual freedom.\nThe country is also actively doing its part to uphold freedom and safeguard maritime peace in the Indo-Pacific, such as participating in joint exercises held in Asean member states and transferring decommissioned navy vessels to countries in the region to support capacity-building efforts.\nHis government is also committed to providing US$100 million (S$130.4 million) in funding over the next three years for development cooperation projects that promote democracy in Indo-Pacific countries, said Mr Yoon.\n“A free and unified Korean peninsula, if realised, would dramatically advance peace not only on the peninsula but also throughout the Indo-Pacific and beyond,” he said.\n“The absence of North Korea’s nuclear threats... would tremendously boost efforts aimed at building peace and trust among countries both within and across regions.\n“The realisation of a free and unified Korean peninsula would also help substantially reduce the demand for illicit trafficking in the region’s waters, and ensure a more secure and freer order of navigation.”\nHe hopes the beliefs in freedom can be embraced in authoritarian North Korea, which has been increasingly isolated from the international community after the last round of talks with South Korea and the US in 2018 and 2019 failed to end its nuclear programme.\nNorth Korea has since strengthened ties with Russia and is supplying missiles and ammunition to fuel Moscow’s invasion of Ukraine. Pyongyang has also hardened its stance towards Seoul, calling it the regime’s “principal enemy”.\nAsked during the question-and-answer session if his freedom doctrine could be perceived as a significant threat by North Korea, Mr Yoon said that South Korea’s Constitution does not allow the use of force or coercion to achieve unification.\n“This is about spreading freedom... letting people living in North Korea understand the true value of freedom, human rights and how a beautiful culture can flourish under a free society.\n“We need to make North Koreans themselves yearn for peaceful unification based on freedom,” he said.\nInternational solidarity is also important to help drive the message home to Pyongyang, he added.\nHowever, Mr Yoon acknowledged it would not be easy to seek unification when the two Koreas have such different ideologies and priorities.\nIn January 2024, North Korean leader Kim Jong Un said unification with the South is no longer possible. Pyongyang has also rejected all proposals for dialogue by the Yoon administration.\n“Unification is a difficult task that cannot be achieved tomorrow. However, we should always be prepared so that we can seize the opportunity when the time comes and persuade the international community that this unification will benefit the whole world,” said Mr Yoon.\nHe urged Singapore and other Asean member states to continue supporting his unification doctrine.\n“A unified Korean peninsula that is free and open will also create a strong impetus for economic development and prosperity in the Indo-Pacific,” he said.\nMr Yoon was in Singapore for a three-day state visit. He departed on Oct 9 for Laos, where he will attend Asean meetings.", "url": "https://www.straitstimes.com/asia/east-asia/yoon-s-message-of-hope-free-unified-korea-will-benefit-the-region"}