{"authors": [], "date_download": "2024-10-12 14:14:01", "date_modify": "2024-10-12 14:14:01", "date_publish": "2022-09-14 14:00:49", "description": "These include encouraging parents to draw from their provident funds to help their children buy homes. Read more at straitstimes.com.", "filename": "asia_east-asia_chinese-cities-roll-out-property-policies-to-fix-slump_1728742441.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/14/ac_chproperty_140922.jpg?VersionId=eolCcG9I4aSQkl3XldhdEXhfo1Pg7SyH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinese-cities-roll-out-property-policies-to-fix-slump_1728742441.html", "title": "Chinese cities roll out property policies to fix slump", "title_page": "Chinese cities roll out property policies to fix slump | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - A flurry of Chinese cities are rolling out measures to boost housing demand, signalling the government's intention to arrest a property crisis.\nVarious local governments have issued at least 70 property-easing measures since President Xi Jinping's Politburo called for efforts from local governments to defuse the property crisis.\nThese include a cut to the minimum down payment ratio, and asking parents to help children with home purchases by drawing on their own housing provident funds.\nChina's US$2.4 trillion (S$3.4 trillion) new-home market has shown little sign of recovery, adding to the woes of an economy that barely expanded in the second quarter.\nMortgage boycotts by home buyers waiting for apartments to be completed have dampened consumer confidence, putting further pressure on home prices, which have fallen for 11 straight months.\nWhile the central government has avoided outright stimulus, it has been giving tacit approval to local authorities to unwind property austerity measures.\nIn late August, the state council led by Premier Li Keqiang said local governments should use city-specific credit policies to support necessary housing demand.\nSimilar signals were issued in April, after the Communist Party's Politburo led by Mr Xi said local governments could \"refine\" housing measures to ensure stability in the property market.\nChinese cities are likely to continue optimising property policies based on their own situation, adopting measures such as improving financing conditions for local developers, Golden Credit Rating analyst Wang Qing was cited as saying.\nA few so-called Tier 2 cities, or regional hubs, lowered down payment thresholds for a second residence by as much as 20 percentage points. Those include Nanjing, Suzhou and Wuxi.\nAt least 24 Chinese cities have allowed parents to fund their children's home purchases by drawing on their own housing provident funds and helping repay their mortgages.\nLangfang city, which is about a one-hour drive from Beijing, said on Aug 9 that it would unwind austerity measures, including a ban that restricted non-locals from buying property.\nShanghai said on Aug 20 that it would ease buying curbs in the suburban Lingang area, home to advanced manufacturers including Tesla. Non-locals working for companies there are now allowed to buy one residence after a year.\nSome cities, including Taizhou in eastern Jiangsu province, adjusted down payment requirements for home buyers backed by the provident fund.", "url": "https://www.straitstimes.com/asia/east-asia/chinese-cities-roll-out-property-policies-to-fix-slump"}