{"authors": [], "date_download": "2024-10-12 14:00:44", "date_modify": "2024-10-12 14:00:44", "date_publish": "2023-10-03 11:27:00", "description": "Experts say the need for expensive, elaborate events is discouraging many members of the younger generation. Read more at straitstimes.com.", "filename": "asia_east-asia_appeal-of-wedding-ceremonies-declining-in-china_1728741644.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/03/2023-09-19T013222Z982431962RC2W23A6W4SCRTRMADP3ASIA-POPULATION-CHINA-WEDDINGS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_appeal-of-wedding-ceremonies-declining-in-china_1728741644.html", "title": "Appeal of wedding ceremonies declining in China", "title_page": "Appeal of wedding ceremonies declining in China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China’s marriage rate has plunged to record lows in recent decades. Among those who still bother to tie the knot, a small but growing number are skipping the exhausting - and sometimes embarrassing - extravaganza that marks a typical Chinese wedding day.\nHowever, doing away with the overly commercialised rituals - such as hiring fleets of luxury cars, throwing expensive banquets and making gushing speeches in front of strangers - usually provokes headwinds from family elders.\n“The conventional wedding ceremony seems to me more like a show, and I didn’t think I could do it,” said Mr Xu Haoqi, a tech worker in Hangzhou, Zhejiang province, who had a plain ceremony in Luoyang in his home province of Henan in April.\n“Newlyweds are like performers. They don’t know most of the people seated in the audience, and those watching don’t really care about the couple on the stage.”\nMr Xu tried to talk to his parents about omitting all the wedding formalities, but their exchanges usually ended in arguments.\nMr Xu even threatened that he would not show up if his parents insisted on a conventional ceremony, and even offered to hire an actor and actress to replace him and his bride at the wedding.\nEventually, his family settled for a 10-table reception at a local hotel as a substitute for a “proper ceremony”, which is usually twice the scale and is the central plank of a fast-expanding marriage celebration industry worth 200 billion yuan (S$37.65 billion) a year.\nIt was a last-ditch attempt to ease the anger of his parents over his reluctance to invest in the event.\nLike the average Chinese family, Mr Xu’s parents wanted to have a more lavish event to impress the neighbours, make new connections and repair damaged relations - and also to demonstrate goodwill to their in-laws.\nThe attendees were mostly friends of Mr Xu’s parents and relatives, who Mr Xu only vaguely remembered from childhood interactions.\n“My mom and dad were the actual main characters on the day, not us,” he said.\nAfter attending schools in Shaanxi province - where his parents lived for years as migrant workers - Mr Xu in 2011 enrolled at a prestigious university in Beijing, and then landed a well-paid job in Hangzhou.\nHe said he felt like a stranger in his hometown. His friends are scattered across China, but he said he preferred to save them the trouble of crisscrossing the country to simply witness the moment, even though Covid-19-related travel restrictions had been scrapped.\nThe 30-year-old met his wife, Ms Gan Ye, four years ago at work. Unlike previous romantic encounters, Mr Xu quickly sensed a rare chemistry with the women from Hubei province.\nLike her husband, Ms Gan has friends scattered across the country and beyond. She attended college in Hubei, and upon graduation, secured a job in the island province of Hainan, which she later quit for her current position in Hangzhou.\n“Always on the move from city to city, it was difficult to cobble together a gathering of guests who we really cared about,” she said.\nIn 2000, only 40 million people lived and worked outside their home province, according to the National Bureau of Statistics. However, that number more than doubled in the following decade, and reached over 124 million in 2020.\nMs Zhang Jing, a researcher on marriage and family issues in Beijing, said greater migration is part of the reason behind the waning appeal of wedding ceremonies among the younger generation.\nThe cross-regional population flow, which accelerated as a result of urbanisation, has broken down the “all-acquaintances” society.\nAs a result, younger people, who usually have a separate circle of friends from their parents, find wedding banquets in their hometown filled with strangers, and they have become reluctant to invest money and effort in such events.\n“They have started to ask themselves who the wedding is being held for,” Ms Zhang said.\nCovid-19 pandemic hangover\nLast year, after being delayed by the Covid-19 pandemic, Mr Xu and Ms Gan registered for a marriage certificate in Hangzhou - where they bought a home and raised a ginger cat.\nThen, they started a tug-of-war, negotiating with their parents to cut the wedding formalities, which Mr Xu argued were costly, insincere and meaningless.\n“The epidemic limited many gatherings and social events, and nothing went awry. That taught me about what really matters to me,” Mr Xu said.\nThen there was the modest banquet, which he said was his parents’ last defence: no emcee; no wedding gown; no photographer; no exchange of rings.\nMr Xu showed up in a sweatshirt and shorts. Shepherded by his mother, Mr Xu and his bride snaked through the tables to greet the guests and express their gratitude.\nThe roots of the growing zeal for simpler weddings can be found in the disruption caused by the pandemic.\nFive years after meeting his girlfriend as a college student, Mr Liu Yiyi proposed in 2020, when much remained unknown about the coronavirus.\nThe couple registered for marriage in Shanghai, Mr Liu’s hometown, where he now works in advertising.\nTo celebrate their union, the 27-year-old reserved just four tables of food at a local restaurant to entertain his in-laws during the National Day holiday in October that year as mass gatherings were discouraged for fear of cluster infections. “It was largely a family event, and no friends were invited,” he said.\n“The family elders agreed to the plan, because they would be among the most vulnerable if an outbreak hit.”\nIn the summer of 2019, a month before graduation, Ms Gu Ran registered for marriage with her boyfriend, who was at the same college in Beijing. The couple hoped to host a wedding banquet when they had become more financially secure.\nUpon graduation, Ms Gu landed a job in Beijing, while her boyfriend became a diplomat and was sent to Europe. Then Covid-19 broke out, making international travel almost impossible, so Ms Gu only managed to visit her boyfriend earlier this year, after China had lifted all pandemic-related travel restrictions. As a result, they have postponed the wedding indefinitely.\n“The longer the delay, the less essential the ceremony becomes. Now, it seems that I don’t want it anymore,” she said.\nMs Gan said that she loves tailor-designed ceremonies, but they are always ultraexpensive and time-consuming.\n“A friend of mine departed for trips to new cities every Friday for six months to shoot video clips that would be shown at her wedding,” she said.\nMs Gan said she could only dream of emulating such dedication, but she did not want to hire a budget wedding organiser and have a standardised, template-based ceremony, which could still easily cost up to 100,000 yuan.\nA report released last year by wedding service provider Hunliji said couples who tied the knot in 2021 spent an average of 253,000 yuan on their wedding, which was 3.8 times the amount in 2016.\nHowever, official data show that in 2021, the average per capita disposable income in China was just 1.5 times higher than in 2016.\nHunliji’s report said that last year Shanghai was the most expensive city in which to hold a wedding ceremony, followed by Beijing, Hangzhou and Shenzhen in Guangdong province.\nAuthorities have launched campaigns to fight the “ugly custom” of paying sky-high “bride prices” as part of wider efforts to curb wedding costs. The rationale, officials have argued, is that affordability issues are holding young people back from marrying.\nData from the NBS show that the marriage rate almost has halved over the past decade.\nIn 2013, there were 9.9 newlyweds for every 1,000 people, and the number slid to 5.2 last year. The Ministry of Civil Affairs said it registered about 6.8 million new marriages last year, a 10 per cent drop from 2021.\nA survey conducted last year by the consulting agency iiMedia Research suggested that among couples with marriage plans, 56 per cent wanted to cap their wedding ceremony expenditure at 100,000 yuan, while less than 10 per cent were willing to spend 200,000 yuan-plus to throw a banquet and entertain guests they barely knew.\nNo regrets\nWhen asked if he regretted the absence of a ceremony to mark his wedding, Mr Xu, the tech worker in Hangzhou, shook his head.\nAfter the modest reception dinner had ended, he and his wife went to Yunnan province, where the snow-capped mountains and diverse ethnicity of the plateau region made for a perfect vacation destination.\nAgainst the backdrop of the Yulong Snow Mountain, which soars to more than 5,000m, the couple posed for a photo with their hands locked.\n“Marriage is a lifelong commitment, and I want to celebrate it every day of my life,” Mr Xu said, adding that the Yunnan trip was just the beginning.\nIn the case of Mr Liu, in Shanghai, he and his wife travelled to Beijing for an old-fashioned photo session, which he said was ceremonial.\nSome wedding photo services usually apply heavy makeup to the subjects and after a volley of rapid-fire shutter clicks, the couple is asked to select a few photos from hundreds to be edited, Mr Liu said, adding that many people seem to be altered beyond recognition by the editing process.\nHowever, the photographer Mr Liu employed, who used a traditional film camera, only allowed the couple to pose for five photos in the studio, illuminated by bulb flashguns.\nIt was more expensive than many wedding photo services that use modern techniques.\n“Therefore, we needed to be fully prepared before the photographer pressed the button,” Mr Liu said. “No heavy makeup, and no photo editing. We were what we were at that very moment.” CHINA DAILY/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/appeal-of-wedding-ceremonies-declining-in-china"}