{"authors": [], "date_download": "2024-10-12 14:05:51", "date_modify": "2024-10-12 14:05:51", "date_publish": "2023-03-29 16:32:28", "description": "The suspected 1MDB corruption mastermind was sentenced in absentia on money laundering charges. Read more at straitstimes.com.", "filename": "asia_se-asia_kuwaiti-court-sentences-malaysian-fugitive-businessman-jho-low-to-10-years-jail_1728741951.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/29/ailawyer2903_1.jpg?VersionId=w97ZiuMT8P3jsYMSF2aiMyDzwmr.jT19", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_kuwaiti-court-sentences-malaysian-fugitive-businessman-jho-low-to-10-years-jail_1728741951.html", "title": "Kuwaiti court sentences Malaysian fugitive businessman Jho Low to 10 years’ jail", "title_page": "Kuwaiti court sentences Malaysian fugitive businessman Jho Low to 10 years’ jail | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA - Malaysian fugitive businessman Low Taek Jho, better known as Jho Low, has been sentenced to 10 years’ imprisonment in absentia by a Kuwaiti court on money laundering charges.\nAccording to a report in Kuwaiti newspaper Al-Qabas, the criminal court had also sentenced a sheikh and two others to 10-year jail terms.\nA lawyer was sentenced to seven years in jail on money laundering charges in relation to a “Malaysian fund”.\nWhile the newspaper did not name the Malaysian fund, The Sarawak Report stated that it was 1Malaysia Development Berhad (1MDB), the insolvent sovereign wealth fund.\nAl-Qabas said the court ordered those convicted to return US$1 billion (S$1.3 billion) and they will be fined a total of 183 million Kuwaiti dinars (S$794 million).\nKuwait’s public prosecution office had reopened the case following a two-year hiatus due to the lack of information from international parties.\n“Investigations showed that about US$1 billion entered the account of an influential Kuwaiti person, and then it was transferred abroad,” the report said.\nKuwaiti public prosecutors had charged the defendants – “as an organised criminal group” – with having committed the crime of money laundering in Chinese currency, knowing that these funds were proceeds from crimes, theft of funds and investments of 1MDB.\nLow is accused of orchestrating the looting of billions of dollars from 1MDB, the brainchild of former Malaysian prime minister Najib Razak, in a scandal that first made global headlines in 2015.\nThe United States Justice Department said more than US$4.5 billion was siphoned off from 1MDB between 2009 and 2014, in a globe-spanning theft that has implicated high-ranking officials and financial institutions in multiple countries, including Switzerland, Singapore and Luxembourg.\nNajib, who has consistently denied wrongdoing, is serving a 12-year prison sentence after being convicted in a Malaysian court of receiving US$10 million from a former 1MDB unit called SRC International.\nFormer Goldman Sachs Group Inc banker Roger Ng was sentenced in March to 10 years in prison and ordered to forfeit US$35.1 million by a US judge for helping to loot billions of dollars from 1MDB.\nHis former Goldman boss and 1MDB co-conspirator, Tim Leissner, previously pleaded guilty and was the government’s star witness against Ng.\nHe is scheduled to be sentenced in September. THE STAR/ASIA NEWS NETWORK, REUTERS, BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/kuwaiti-court-sentences-malaysian-fugitive-businessman-jho-low-to-10-years-jail"}