{"authors": [], "date_download": "2024-10-12 13:28:12", "date_modify": "2024-10-12 13:28:12", "date_publish": "2024-04-18 08:30:39", "description": "The Assyrian bishop also says he is recovering quickly. Read more at straitstimes.com.", "filename": "asia_stabbed-sydney-assyrian-bishop-says-recovering-quickly-forgives-attacker_1728739692.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/18/2024-04-15T132341Z1216714350RC2077A18VQRRTRMADP3AUSTRALIA-CRIME-CHURCH.JPG?VersionId=CPDqHiUkvUD8xGRcT.YFtm8pTEfiSQXW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_stabbed-sydney-assyrian-bishop-says-recovering-quickly-forgives-attacker_1728739692.html", "title": "‘You are my son’: Stabbed Sydney bishop forgives teenage attacker", "title_page": "‘You are my son’: Stabbed Sydney bishop forgives teenage attacker | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - A Sydney bishop brutally stabbed during a live-streamed sermon said on April 18 that he is recovering and forgives his attacker, declaring: “You are my son.”\nBishop Mar Mari Emmanuel was slashed in the head and chest by a 16-year-old suspect on April 15, sparking a riot by followers of the Assyrian Christian church in western Sydney. Australian police have deemed the attack a terrorist act motivated by suspected religious extremism.\n“I am doing fine, recovering very quickly,” said the bishop of Christ the Good Shepherd Church in Wakeley.\nThe area is a hub for Sydney’s small Christian Assyrian community, many of whom fled persecution and war in Iraq and Syria.\n“There is no need to be worried or concerned,” the bishop said in a YouTube video released, with audio of his voice accompanied by a photo of him in vestments.\n“I forgive whoever has done this act and I say to him: You are my son, I love you and I will always pray for you. And whoever sent you to do this, I forgive them as well.”\nBishop Emmanuel has an online following of almost 200,000, galvanising many with his criticism of homosexuality, Covid-19 vaccines and lockdowns as well as Islam.\nThe teenage suspect was taken to a Sydney hospital after the attack.\nSenior police said in mid-week that his treatment was expected to last several days.\nThe bishop called for calm after the stabbing sparked angry scenes outside the church. Hundreds of congregants and members of the community rushed to the site on the night of the attack, demanding that the suspected attacker be handed over to them. Some hurled rocks and other projectiles that allegedly wounded police and damaged 50 police cars.\nBishop Emmanuel, in his message, urged his congregation to remain calm and respect the law.\n“I want you to always be calm,” he said. “We need to be always law-abiding citizens as well. We need to cooperate with the police directives whether it be at a state level or a federal level.\n“We should never forget that we are very blessed to be Aussies, but above all we are Christians and we need to act like it.”\nA western Sydney doctor who is in contact with the teenager’s family told AFP they were in “shock” and “disbelief about the horrible action their son has done”.\nJamal Rifi said the family had also been unnerved at how quickly the event had been labelled a “terrorist” act, without speaking to the boy or his family first.\nThe boy’s mother told Rifi her son had anger and mental health issues.\n‘Terrible’ untruths\nMr Rifi said Australia was a diverse community and despite the differences in culture and faith, he had been reassured that so many had called for calm and denounced any retaliation attempts.\n“Reciprocal respect is the core that preserves social cohesion,” he said.\nNew South Wales police commissioner Karen Webb said on April 18 that the teenager remained in hospital and authorities had yet to question him.\nNew South Wales Premier Chris Minns meanwhile railed at misinformation and graphic content of online posts relating to the attack still circulating.\n“It proves to be very difficult to foster community cohesion and harmony, to calm down the community, to send messages of unity in a difficult period, when social media firms continue to disseminate terrible pieces of information, untruths, rumours that circulate like wildfire through a febrile and anxious community,” he said on April 18.\nPolice charged a 19-year-old man on April 17 in connection with the violence outside the church and have warned more will be arrested in the coming days.\nMs Webb said the man was not a member of the church.\n“People just came along to participate in a riot. That is disgraceful and disgusting,” she said during a news briefing.\nMore detectives have been assigned to investigate the riot, which injured about 50 officers and damaged 20 police cars.\nTwo knife attacks within three days – at a busy shopping centre near Bondi Beach that killed six people on April 13 and at the Assyrian church two days later – has shocked residents of Australia’s most populous city.\nAs police investigate, the authorities said the Bondi Junction mall would reopen on April 18 to allow people inside to pay respects to the victims. Businesses are expected to resume trade starting on April 19.\n“We’ve gone from shock to disbelief to now grief, and it’s going to take quite a time for people to be able to process,” Ms Paula Masselos, mayor of the local council, told ABC television.\nA candlelight vigil will be held on April 21, she said, as flowers and bouquets pile up at a makeshift memorial. AFP, REUTERS", "url": "https://www.straitstimes.com/asia/stabbed-sydney-assyrian-bishop-says-recovering-quickly-forgives-attacker"}