{"authors": [], "date_download": "2024-10-12 13:27:31", "date_modify": "2024-10-12 13:27:31", "date_publish": "2024-10-12 13:25:00", "description": "The gate, which has been closed since February 2021, is almost 200 years old. Read more at straitstimes.com.", "filename": "asia_east-asia_university-of-tokyo-s-famous-red-gate-may-collapse-if-earthquake-or-strong-winds-hit_1728739651.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/12/red20gate.jpg?VersionId=E_88mclYlvMQYYT1YHd56Ex8Qn6Nf2r1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_university-of-tokyo-s-famous-red-gate-may-collapse-if-earthquake-or-strong-winds-hit_1728739651.html", "title": "University of Tokyo’s famous red gate may collapse if earthquake or strong winds hit", "title_page": "University of Tokyo’s famous red gate may collapse if earthquake or strong winds hit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - Generations of Japan’s top scholars and leaders have passed through it on their way to building an advanced society.\nNow the Akamon Gate, the distinctive red gate on The University of Tokyo’s campus in central Tokyo, is in danger of collapse.\nSeismic experts have deemed that the gate, which dates back nearly 200 years, has weakened to the point where it could collapse in a major earthquake or typhoon-strength winds.\nThe gate on the Hongo campus in Bunkyo ward has been closed since February 2021 as a structural inspection is carried out. The university is looking into starting reinforcement work from the next fiscal year at the earliest, with the hope of opening it back up as soon as possible.\nThe Akamon Gate, officially known as a “goshudenmon”, is the oldest remaining structure on the campus and has been designated as an important cultural property.\nIt was constructed in 1827 by Lord Nariyasu Maeda of the Kaga domain to welcome his new bride, a daughter of the 11th shogun of the Tokugawa Shogunate.\nOriginally part of the Edo residence of the Maeda clan, it remained intact when the site became part of The University of Tokyo during the Meiji era (1868-1912).\nIt also survived the Great Kanto Earthquake and the Tokyo air raids during World War II.\nIn 2018, the Cultural Affairs Agency requested that owners or administrators of important cultural properties implement reinforcement.\nIn response, the university commissioned an expert to conduct a visual check of the structure.\nThe expert found possible deterioration at the base of the columns and in the roof joints, leading to the closure of the gate as a precaution.\nThe gate escaped demolition when a more detailed inspection by university researchers revealed there was no extensive damage at the bases of the columns and the joints were tight enough.\nEven so, it was determined that a strong force from an earthquake or powerful wind exerted on the gate could cause it to collapse outward from the campus, endangering pedestrians on the sidewalk.\nOne factor is that the construction method for the tiled roof made it extremely heavy.\nIt weighs about 200kg to 220kg per sq m, accounting for 80 per cent of the estimated 40 tonnes of the entire gate. The inspection also found that the centre of gravity sits slightly on the street side of the gate.\nThe university plans to improve the gate’s earthquake resistance by reinforcing the column bases and making the roof lighter by reducing the amount of dirt used to attach the tiles.\nAs it is important to first come up with a method that does not impair the aesthetic value of the gate, there is no timetable for the restoration and reopening.\n“It is painful that the gate remains closed, but we want to proceed with repairs carefully so that it can be preserved for generations to come,” said Professor Kaori Fujita, who was involved in the inspection. THE JAPAN NEWS/ ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/university-of-tokyo-s-famous-red-gate-may-collapse-if-earthquake-or-strong-winds-hit"}