{"authors": ["Keval Singh"], "date_download": "2024-10-12 13:33:00", "date_modify": "2024-10-12 13:33:00", "date_publish": "2023-05-17 11:09:16", "description": "Netizens posted photos and videos of the incident on social media on Wednesday morning. Read more at straitstimes.com.", "filename": "asia_se-asia_fire-breaks-out-at-kuala-lumpur-s-mid-valley-megamall_1728739980.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/18/Screenshot202023-05-1720at202.38.5020PM20copy.jpg?VersionId=yckTiyxWMGwlf77J6D3ElRw5p6gx.yAg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_fire-breaks-out-at-kuala-lumpur-s-mid-valley-megamall_1728739980.html", "title": "Fire at KL’s Mid Valley Megamall likely caused by overheated oil, mall to reopen on Thursday", "title_page": "Fire at KL’s Mid Valley Megamall likely caused by overheated oil, mall to reopen on Thursday | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The fire was believed to have been caused by overheating of oil that was meant to cool an electrical transformer at the mall’s main power substation, a fire department official told reporters on Wednesday.\nKuala Lumpur Fire and Rescue Department operations assistant director Fatta Amin said the oil can withstand temperatures of 137 deg C, news agency Bernama reported.\n“However, it is believed that the substation was excessively hot and suddenly started burning,” he told reporters at the mall, adding that only one of four substations belonging to the building was on fire.\nAll the substations were capable of supplying power within a 10km radius of Mid Valley, Mr Fatta said.\nPower was disrupted at the mall due to the fire, Mid Valley said in a statement. As a precautionary measure, the management evacuated all shoppers and tenants from both Mid Valley Megamall and The Gardens Mall, it said.\n“We sincerely apologise for any inconvenience caused and would like to reiterate that the safety of our shoppers and guests remains our top priority,” the mall said.\nThe mall said its fire control centre received a report at 10.30am of a fire breaking out at an external substation, adjacent to the east facade of the shopping centre.\nThe Kuala Lumpur Fire and Rescue Department said in a statement that firefighters were dispatched to the scene after it received an emergency call at 10.32am.\n“As of 11.38am, we can confirm that there have been no injuries or casualties reported,” the mall said on Facebook, adding that investigations into the incident are ongoing.\nPower was fully restored to Mid Valley and its surrounding areas at around 12.30pm, said electricity provider Tenaga Nasional Berhad (TNB).\nAll offices, hotels and retail outlets located within Mid Valley City, the mixed development that includes Mid Valley Megamall, will resume operations on Thursday, the mall’s operators said after receiving clearance from TNB and the fire department.\nNu Sentral, a mall linked to transport hub KL Sentral and located around 4km away from Mid Valley, was also closed, due to what it said was an unscheduled power shutdown.\nThe power cut at KL Sentral was due to a different power-supply issue, TNB said, adding that the transportation system at the city’s main train station was not affected.\nResidents of condominiums near the station, including The Sentral Residences, had earlier reported unexpected power cuts to their buildings.\nNews of the Mid Valley Megamall fire emerged on social media after users began sharing photos and videos of the incident.", "url": "https://www.straitstimes.com/asia/se-asia/fire-breaks-out-at-kuala-lumpur-s-mid-valley-megamall"}