{"authors": [], "date_download": "2024-10-12 13:36:25", "date_modify": "2024-10-12 13:36:25", "date_publish": "2024-06-26 14:25:00", "description": "A litany of US base-related woes has long grieved Okinawans, from pollution to helicopter crashes. Read more at straitstimes.com.", "filename": "asia_east-asia_us-soldier-in-japans-okinawa-charged-with-sexual-assault-of-minor_1728740185.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/IMG9864.jpg?VersionId=H0Wo5QvD_MLB2ANCqNGyMBS_oDP4KrUs", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_us-soldier-in-japans-okinawa-charged-with-sexual-assault-of-minor_1728740185.html", "title": "US soldier in Japan’s Okinawa charged with sexual assault of minor", "title_page": "US soldier in Japan’s Okinawa charged with sexual assault of minor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - Japan’s government is calling for stricter oversight of US troops stationed in the country after a soldier was charged over the alleged sexual assault of a Japanese teenager in Okinawa.\nProsecutors in the southern island region charged the US soldier in March, top government spokesman Yoshimasa Hayashi told reporters on June 25.\nLocal media said the 25-year-old man had been accused of assault, adding that he knew the girl was under 16, the age of consent in Japan.\nThe government expressed “regret” to US Ambassador Rahm Emanuel over the incident and called for stronger oversight of behaviour by military personnel, Mr Hayashi said.\nOkinawa accounts for just 0.6 per cent of Japan’s land mass but hosts about 70 per cent of all the US military bases and facilities in the country.\nA litany of base-related woes has long grieved Okinawans, from pollution to noise and helicopter crashes, leading to complaints that they bear the brunt of hosting troops.\nThe 1995 gang rape of a 12-year-old girl by three US soldiers in Okinawa prompted widespread calls for a rethink of a 1960 pact that outlined the legal status of Japan-based US military personnel.\nOkinawa Governor Denny Tamaki voiced his “strong indignation” at the latest case. “That something like this was done to a minor not only causes great fear to local residents living side-by-side with US bases but also tramples on the dignity of women,” he told reporters.\n“The excessive burden of hosting military bases is an everyday matter for us, and is intolerable.”\nAnti-base sentiment in Okinawa has been displayed in particular over a plan to relocate the US Marine Corps Air Station Futenma.\nWhile the central government wants to move the base to a less-populated part of Okinawa’s main island, many locals would prefer it be transferred elsewhere in the country.\nA nationwide poll by broadcaster NHK in 2022 found 80 per cent of Japanese consider the current disproportionate distribution of US forces “wrong” or “somewhat wrong”. AFP", "url": "https://www.straitstimes.com/asia/east-asia/us-soldier-in-japans-okinawa-charged-with-sexual-assault-of-minor"}