{"authors": ["Rhea Yasmine"], "date_download": "2024-10-12 13:54:52", "date_modify": "2024-10-12 13:54:52", "date_publish": "2024-07-07 13:15:00", "description": "The crocodile's short legs struggled to push it over the fence separating it from its feeder. Read more at straitstimes.com.", "filename": "asia_australianz_crocodile-attempts-to-scale-fence-shocks-australian-wildlife-park-visitors_1728741292.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/07/australia20crocodile20malcom20douglas.png?VersionId=kUOX_KeV5oO8YDPAWHbgzLZrf7nhvAAS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_crocodile-attempts-to-scale-fence-shocks-australian-wildlife-park-visitors_1728741292.html", "title": "Crocodile attempts to scale fence, shocks Australian wildlife park visitors", "title_page": "Crocodile attempts to scale fence, shocks Australian wildlife park visitors | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A crocodile at a Western Australian wildlife park shocked visitors when it attempted to scale a wire fence that separated it from its feeder, its large frame making the fence squeak and creak.\nIn a TikTok video posted on July 1, the crocodile – at the Malcolm Douglas Crocodile Park near Broome – manages to get the top third of its body over the fence, but its short legs struggle to push it all the way over.\n“Nah, nope,” exclaimed visitor Sophia Armstrong, who recorded the video, as she watched the scene from behind a taller fence.\nSeveral seconds into the video, the crocodile appears to give up and the top portion of its body retreats slightly, although it still stands on two legs with its head and long snout peering over the fence at its feeder.\nAs the feeder approaches it with giant tongs and a bucket of what appears to be food, the beast slowly opens its mouth, eager to feast on the prepared meal.\nIn the video, the feeder tells the crowd in jest: “Just be warned: If he climbs into the feed bay and the door’s open, you guys have to run – because that’s what I’ll be doing.”\nThe feeder then pokes the crocodile under its chin with the tong, and the reptile releases its grip on the fence before falling back to the ground.\nThis is not the first time that a crocodile has been sighted attempting to climb up or over something.\nIn 2018, a 2.5m saltwater crocodile was seen trying – and failing – to a climb a waterfall on the Roper River, in Australia’s Northern Territory.\nAccording to a Reuters report, crocodiles are able to climb up to the tops of trees even though they do not have the typical toe and foot structure of climbers.\nSmaller crocodiles have been observed climbing vertically, while larger crocodiles mainly climb trunks and branches that are angled, said University of Tennessee researcher Vladimir Dinets.\n“They just go slowly,” Assistant Professor Dinets was quoted as saying. “Eventually they get there.”\nProf Dinets and other researchers – who carried out a study in which they observed crocodiles in Australia, Africa and North America – believe crocodiles climb to keep themselves warm in the sun, particularly in areas with few places to bask on the ground, and to keep a lookout for potential threats and prey.\nFinding from the study were reported in January 2014 in the journal Herpetology Notes.", "url": "https://www.straitstimes.com/asia/australianz/crocodile-attempts-to-scale-fence-shocks-australian-wildlife-park-visitors"}