{"authors": [], "date_download": "2024-10-12 13:50:41", "date_modify": "2024-10-12 13:50:41", "date_publish": "2024-02-29 10:25:22", "description": "Sources say he won’t involve that role in any political bargaining as he sees it as above politics. Read more at straitstimes.com.", "filename": "asia_se-asia_prabowo-eyes-former-bankers-for-indonesia-finance-minister-role_1728741041.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/29/INDONESIA-AUSTRALIA-DIPLOMACY-160925.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_prabowo-eyes-former-bankers-for-indonesia-finance-minister-role_1728741041.html", "title": "Prabowo eyes former bankers for Indonesia finance minister role", "title_page": "Prabowo eyes former bankers for Indonesia finance minister role | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Indonesia’s Mr Prabowo Subianto is setting his sights on former bankers for the role of finance minister, as he seeks technocrats who can secure funding for his campaign promises while upholding fiscal prudence.\nMr Prabowo, who declared victory in the recent presidential election, is considering Health Minister Budi Gunadi Sadikin, Deputy Minister of State-owned Enterprises Kartika Wirjoatmodjo, financial regulator chairman Mahendra Siregar and Bank Negara Indonesia president director Royke Tumilaar as potential contenders, according to people familiar with the matter.\nThey are seen as most suitable for the role because of their financial expertise and effective leadership, said the people, who asked not to be named because the discussions are private.\nMr Prabowo will not involve the finance minister position in any political bargaining as he sees the post as above politics and requiring acumen in managing the budget, they added.\nThe new finance minister would take over from Dr Sri Mulyani Indrawati, the only woman to be appointed to the role since Indonesia’s independence in 1945.\nShe steered the economy through the turmoil caused by the Covid-19 pandemic, embarking on an unprecedented debt monetisation programme to fund stimulus spending and then reining the budget deficit back within the legal limit a year earlier than promised.\nWhoever ends up in the role would have a massive responsibility in helping Mr Prabowo steer South-east Asia’s largest economy amid geopolitical risks and supply chain disruptions arising from the United States-China rivalry.\nThe person would have to maintain fiscal discipline, which has been essential in stabilising the rupiah and assuring foreign investors, while securing enough funding for Mr Prabowo’s big-ticket spending plans.\nHis spending spree could amount to 460 trillion rupiah (S$39.4 billion), more than the entire 2023 budget deficit. He has signalled his focus on improving health and education outcomes with a plan to give out free school lunches and milk to more than 80 million children. He also expects to create employment for women and small businesses.\nHis campaign also called for “youth downstreaming” as a way to urge young people to take up higher-paying tech-related jobs.\nA spokesperson for Mr Prabowo did not immediately respond to requests for comment.\nMr Prabowo’s current line-up may be all men, but plans might change, the people said.\nDiscussions to shape Mr Prabowo’s new Cabinet are under way, but they are still at an early stage and will intensify only after he is officially declared the winner and president-elect by the General Elections Commission, they said.\nOfficial results are due by March 20.\nHere’s more on the potential contenders:\nBudi Gunadi Sadikin\nAppointed as health minister in December 2020, Mr Budi was largely credited for curbing the spread of Covid-19 in Indonesia by tapping international networks and domestic resources to procure tests and vaccines. He was previously deputy minister of state-owned enterprises.\nA nuclear physics graduate from one of Indonesia’s top universities, Bandung Institute of Technology, Mr Budi’s private-sector career took off at IBM Asia-Pacific. He was an information technology officer before embarking on a banking career that started at Bank Bali and took him to become president director at Bank Mandiri, the nation’s largest bank by assets. He was president of Indonesia Asahan Aluminium before leaving the private sector for the government.\nRoyke Tumilaar\nMr Royke also helmed Bank Mandiri from 2019 to 2020 after holding various positions in departments ranging from wholesale and corporate banking to asset management.\nHe had first joined the bank in 1998 following the Asian financial crisis, after starting his banking career as a credit analyst at Bank Dagang Negara. After leaving Mandiri, he joined Bank Negara Indonesia as president director.\nMr Royke holds an economics degree from the University of Trisakti and a master’s degree in business finance from the University of Technology Sydney.\nKartika Wirjoatmodjo\nMr Kartika took over as president director of Bank Mandiri from Mr Budi. Prior to that, he was the chief executive of Deposit Insurance Corp and also led Indonesia Infrastructure Finance. In 2019, he was brought in to become deputy minister of state-owned enterprises.\nMr Kartika holds an accounting degree from the country’s top institution, University of Indonesia, and received his MBA from Erasmus University Rotterdam in 2001.\nMahendra Siregar\nMr Mahendra is an economist by training, and no stranger to the Finance Ministry. He was deputy finance minister under former president Susilo Bambang Yudhoyono between 2011 and 2013, and was formerly deputy minister for foreign affairs and trade.\nHe had also been Indonesia’s ambassador to the US. Since 2022, Mr Mahendra has helmed the Financial Services Authority, which oversees regulations in the banking and capital markets sectors.\nHe has an economics degree from the University of Indonesia and a master’s degree in the same subject from Monash University. BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/prabowo-eyes-former-bankers-for-indonesia-finance-minister-role"}