{"authors": [], "date_download": "2024-10-12 13:48:06", "date_modify": "2024-10-12 13:48:06", "date_publish": "2022-01-05 11:39:03", "description": "A strict lockdown and rounds of mass testing for Xi’an’s 13m people seemed to have worked.   Read more at straitstimes.com.", "filename": "asia_east-asia_china-says-xian-outbreak-controlled-but-other-cities-face-restrictions_1728740886.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/01/05/mdxiancovid05012022.jpg?VersionId=EkhrewZg6_4yeEx6mbzyPKbzE.eyGtka", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-says-xian-outbreak-controlled-but-other-cities-face-restrictions_1728740886.html", "title": "China to test 12 million in Zhengzhou as Xi’an outbreak eases", "title_page": "China to test 12 million in Zhengzhou as Xi’an outbreak eases | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (AFP) - The city of Zhengzhou ordered its 12 million residents to take Covid-19 tests on Wednesday (Jan 5) after a handful of cases were detected, as China fights to stamp out virus clusters ahead of the Winter Olympics.\nEveryone in Zhengzhou, which has been placed under a partial lockdown, must be tested to “thoroughly uncover infections hidden among the public”, the city’s government said in a statement on Wednesday.\nZhengzhou has detected 11 cases in recent days.\nThe mass-testing order came as case numbers in the locked-down city of Xi’an fell to their lowest in weeks, with officials saying that the outbreak had been “brought under control”.\nXi’an’s 13 million residents have been under stay-at-home orders for the last fortnight.\n“Although the case number has been high for many days, the rapid rise in Covid spread at the community level has been brought under control compared with the early stages of the outbreak,” said Dr Ma Guanghui, the deputy director of Shaanxi province’s health commission, at a press conference.\n“The epidemic is showing a downward trend.”\nChina has stuck to a rigid approach of stamping out Covid cases when they appear, with tight border restrictions and targeted lockdowns since the virus first emerged in the country in 2019.\nBut, with less than a month to go until the Olympics, a series of small outbreaks across the country has put the strategy under pressure.\nAlthough the number of reported cases in China is very low compared with other nations, infections in recent weeks have reached a high not seen in the country since March 2020.\nChina recorded 91 cases on Wednesday, including 35 in Xi’an, the city’s lowest tally since mid-December.\nThe Zhengzhou outbreak is tiny by comparison, but officials are taking no chances.\nState media said about 500 close contacts had been traced from the outbreak’s two symptomatic cases, linked through mahjong rooms and family gatherings.\nEight residential communities were locked down.\nOn Monday, one million people in Yuzhou city - in the same province as Zhengzhou - were put under stay-at-home orders after three asymptomatic cases.", "url": "https://www.straitstimes.com/asia/east-asia/china-says-xian-outbreak-controlled-but-other-cities-face-restrictions"}