{"authors": [], "date_download": "2024-10-12 14:07:48", "date_modify": "2024-10-12 14:07:48", "date_publish": "2024-02-08 16:48:00", "description": "Malaysian and US investigators estimate US$4.5 billion (S$6 billion) was stolen from 1MDB. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-has-recovered-65m-in-1mdb-assets-since-jan-2023_1728742068.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/08/FILES-MALAYSIA-NAJIB-CRIME-ROYALS-090409.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-has-recovered-65m-in-1mdb-assets-since-jan-2023_1728742068.html", "title": "Malaysia has recovered $6.5m in 1MDB assets since January 2023", "title_page": "Malaysia has recovered $6.5m in 1MDB assets since January 2023 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Malaysia recovered more than RM23 million (S$6.5 million) in assets related to scandal-hit state fund 1Malaysia Development Berhad (1MDB) between January 2023 and February 2024, its anti-graft agency said on Feb 8.\nThe Malaysian Anti-Corruption Commission (MACC) said it recovered 1MDB assets both domestically and internationally through cooperation with the 1MDB asset recovery task force and foreign agencies, among other means.\n“These funds and assets were successfully recovered through various means, including court orders, as well as voluntary surrender involving five individuals, and subsequently returned to the government of Malaysia,” it said in a statement.\nBetween 2019 and February 2024, a total of RM29.03 billion in 1MDB assets have been recovered, the agency added.\nMalaysian and United States investigators estimate US$4.5 billion (S$6 billion) was stolen from 1MDB, implicating former Malaysian prime minister Najib Razak, Goldman Sachs staff and high-level officials elsewhere.\nNajib’s special officer, Datuk Amhari Efendi, surrendered about RM4.6 million to the government through BSI Bank Switzerland, according to the anti-corruption body.\nThe authorities also confiscated three condominiums worth almost RM7.1 million from another special officer, Mr Kamal Yan Yahaya, the agency said.\nThe anti-corruption body said it had also obtained court orders to forfeit properties belonging to fugitive financier Low Taek Jho’s associates – Mr Jerome Lee and his wife Koay Ying Ying – in Malaysia and Singapore that are worth RM11.8 million.\nNajib was sentenced to 12 years’ prison after being convicted in a case linked to the 1MDB scandal but had his sentence halved last week by a Malaysian pardons board.\nMalaysia in January said it was considering initiating legal proceedings against foreign banks linked to the 1MDB scandal.\nDatuk Seri Johari Abdul Ghani, the chairman of the 1MDB asset recovery task force, did not identify the foreign banks but said they did not conduct proper due diligence before facilitating fund transfers related to the sovereign fund. REUTERS, BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-has-recovered-65m-in-1mdb-assets-since-jan-2023"}