{"authors": ["Hazlin Hassan"], "date_download": "2024-10-12 14:06:50", "date_modify": "2024-10-12 14:06:50", "date_publish": "2022-11-27 12:22:24", "description": "The fundamentalist party has snatched 43 seats in Parliament, the largest number by any single party. Read more at straitstimes.com.", "filename": "asia_se-asia_pas-gains-prominence-as-malaysian-malays-reject-corruption_1728742010.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/27/2022111128829072b48634b2-8e20-4ddd-b935-f8ffcac2dd46_5.jpg?VersionId=nIaAq77gEUNt4m7V1WnYDCXpVNVzAy8P", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_pas-gains-prominence-as-malaysian-malays-reject-corruption_1728742010.html", "title": "PAS gains prominence as Malaysian Malays reject corruption", "title_page": "PAS gains prominence as Malaysian Malays reject corruption | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – The fundamentalist Parti Islam SeMalaysia (PAS) emerged as one of the big winners in Malaysia’s general election, helped by a wave of Malay Muslim voters rejecting corruption and worried that their rights would be eroded under a non-Malay-dominated government.\nA component of Perikatan Nasional (PN), PAS snatched 43 seats in Parliament, making it the largest single bloc of lawmakers. Previous reports said PAS won 44 or 49 seats, but that would include wins by Parti Pribumi Bersatu Malaysia (Bersatu) candidates who contested in Kelantan and Terengganu under the banner of PAS.\nBersatu, which is headed by Tan Sri Muhyiddin Yassin, who is also PN leader, won a total of 30 seats.\nA 50-year-old university lecturer, who declined to be named, said she voted for PN – a coalition that is barely three years old. She told The Straits Times that she was disgusted by Umno’s graft-tainted president Zahid Hamidi and wary that the Chinese-dominated Democratic Action Party (DAP) would take away Malay rights.\n“Zahid should have stepped down before the election,” she said.\nPrior to the general election on Nov 19, PAS’ influence was mainly focused on the northern rural Malay heartland states of Terengganu, Kelantan, Perlis and Kedah.\nAt the election, PN won the majority of support of the Malay electorate in Peninsular Malaysia, at an estimated 54 per cent of votes, according to Dr Bridget Welsh, honorary research associate of the University of Nottingham Asia Research Institute Malaysia.\nThis was an increase from the 32 per cent support garnered by PAS in 2018, when it won 18 seats in Parliament. However, PN did not secure any meaningful share of support from non-Malays.\n“In effect, PN was a coalition only supported by Malays, with the exception of an estimated 5 per cent of support from other communities, mostly (indigenous) Orang Asli,” she wrote in an article on the Malaysiakini news website.\nBoth Pakatan Harapan (PH), which DAP is a part of, and the Umno-led Barisan Nasional (BN) lost a portion of their Malay votes in the election.\nPH’s share of the Malay votes dropped from an estimated 25 per cent in 2018 to around 11 per cent in 2022.\nBN saw a significant reduction of support among Malays, accounting for its major loss in seats, said Dr Welsh. BN won an estimated 33 per cent of Malay support last week, down from 43 per cent in 2018.\nBN also lost an estimated 3 percentage points among Chinese (to 5 per cent) and about 2 percentage points of Indian voters (to 16 per cent).\nSingapore Institute of International Affairs senior fellow Oh Ei Sun outlined two factors that contributed to the rise of PAS.\n“First is that there is indeed a sizeable number of Malays who rejected Umno, thanks to relentless portrayals by both PH and PN of Umno as being corrupt and scandalous,” he told ST.\n“But this same cohort of Malays are equally uncomfortable with PH, which they perceive as liberal and multicultural. So they opted mainly for PAS and, to a lesser extent, Bersatu,” he said.\n“Another factor is the sooner-than-expected culmination of a long process of Islamic radicalisation effort by PAS, which has been running many tahfiz (religious) schools around the country, promoting its brand of Islamic supremacy in line with a trend of worldwide Islamic revivalism that has emerged since at least the 1979 Islamic Revolution in Iran.”\nAccording to an insider from PAS splinter party Amanah, religion is one of the factors that pushed Malay voters, particularly highly impressionable first-time voters aged 18 to 20, to vote for PN.\n“PAS used TikTok videos to warn voters that if you don’t vote for PAS, you will go to hell,” he told ST.\nA video of Mr Muhyiddin, which went viral in the final days before polling, showed him claiming that PH was an agent of Jews and Christians plotting to colonise Malaysia.\n“Do not choose Barisan Nasional and never ever touch Pakatan Harapan. It is dangerous,” Mr Muhyiddin said in the video, reportedly taken during a rally in Johor on Nov 16.\nThis resulted in a wave of support for PAS that swept the northern and eastern states of Peninsular Malaysia, Putrajaya and even swathes of Perak, Pahang, Selangor and Kuala Lumpur.\nPN also promised a clean, stable and caring government, which appealed to its voters.", "url": "https://www.straitstimes.com/asia/se-asia/pas-gains-prominence-as-malaysian-malays-reject-corruption"}