{"authors": [], "date_download": "2024-10-12 13:38:25", "date_modify": "2024-10-12 13:38:25", "date_publish": "2024-08-01 11:21:58", "description": "Mr Prabowo, who went to Moscow, added that he hoped for stronger cooperation on defence, energy and education. Read more at straitstimes.com.", "filename": "asia_se-asia_indonesia-president-elect-prabowo-says-seeks-stronger-ties-with-great-friend-russia_1728740305.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/LYNXMPEK7019Q-1.jpg?VersionId=YT2dwlhvZrQ6S_5bvZs303plhUtchiq2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_indonesia-president-elect-prabowo-says-seeks-stronger-ties-with-great-friend-russia_1728740305.html", "title": "Indonesia president-elect Prabowo says his government seeks stronger ties with ‘great friend’ Russia", "title_page": "Indonesia president-elect Prabowo says his government seeks stronger ties with ‘great friend’ Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA - Indonesia’s President-elect Prabowo Subianto said his upcoming administration would maintain ties with “great friend” Russia, after he met President Vladimir Putin on July 31 during a trip to Moscow.\nMr Prabowo, who is currently Defence Minister, added that he hoped for stronger cooperation on defence, energy and education. He is set to take over the presidency from Mr Joko Widodo in October.\n“We consider Russia as a great friend,” he said in a statement from the Defence Ministry. “I would like to continue to maintain and enhance this relationship. In our history, we remember Russia has always helped us in many aspects when we were in difficulties.”\nMr Prabowo also expressed his intent to continue a partnership in defence and nuclear energy, and to send Indonesian students to Russia to study medicine.\nHis trip to Moscow comes months after Mr Prabowo went to Beijing to meet Chinese President Xi Jinping to affirm Indonesia’s “policy of friendship” with China.\nMr Prabowo has said he will forge ties with any country, be it China or the United States, in his non-alignment foreign policy.\nMr Putin was quoted by Russian state news agency Tass Russia as saying Russia was ready to “scale up supplies of agricultural products, implement investment projects in the fields of energy, transport and infrastructure”.\nKremlin spokesman Dmitry Peskov was quoted by Tass as saying that Indonesia’s role in the war in Ukraine, which Mr Putin calls a special operation, is “growing significantly nowadays”.", "url": "https://www.straitstimes.com/asia/se-asia/indonesia-president-elect-prabowo-says-seeks-stronger-ties-with-great-friend-russia"}