{"authors": [], "date_download": "2024-10-12 14:04:53", "date_modify": "2024-10-12 14:04:53", "date_publish": "2023-06-30 13:32:00", "description": "Beijing is trying to persuade Europe to take a less hawkish stance than the US. Read more at straitstimes.com.", "filename": "asia_east-asia_senior-china-diplomat-dispatched-to-italy-to-keep-nation-in-belt-and-road-initiative_1728741893.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/30/FILES-CHINA-ITALY-POLITICS-DIPLOMACY-TRADE-G7-230114_0.jpg?VersionId=henIFYmsvbeuQQS3CTwFL8hqrP.XatEF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_senior-china-diplomat-dispatched-to-italy-to-keep-nation-in-belt-and-road-initiative_1728741893.html", "title": "Senior China diplomat dispatched to Italy to keep nation in Belt and Road Initiative", "title_page": "Senior China diplomat dispatched to Italy to keep nation in Belt and Road Initiative | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China dispatched a senior diplomat to Italy this week, as Beijing seeks to persuade the European nation not to leave President Xi Jinping’s flagship global investment pact.\nMr Liu Jianchao, director of the Communist Party’s International Department, held meetings with Italian Foreign Minister Antonio Tajani, Senate Speaker Ignazio La Russa and former prime minister Massimo D’Alema, according to the department’s readouts.\nHe also met with a group known as “Friends of China” in Italy’s Parliament, during his three-day visit that began on Sunday.\n“It was the correct decision for China and Italy to sign the Belt and Road,” Mr Liu said during a session with business people in Milan this week, according to the official statement.\nItaly signed onto China’s massive Belt and Road Initiative (BRI) in 2019 when Mr Giuseppe Conte was prime minister, becoming the only Group of Seven nation to join the pact.\nThe country’s current leader, Ms Giorgia Meloni, favours leaving the infrastructure initiative, Bloomberg reported in May.\nParticipation will automatically renew in 2024 unless Rome exits the agreement.\nMs Meloni told lawmakers on Wednesday that Italy can have excellent relations with China even without being part of the initiative.\n“There are ongoing evaluations,” she said. “The issue must be handled carefully and respectfully, also involving the Parliament.”\nMr Jia Guide, Chinese ambassador to Italy, warned in an interview with Italian news outlet Fanpage last week that there would “negative consequences” if Rome “recklessly decides” to withdraw.\nEuropean struggle\nMr Liu’s appeal to the Italians comes after Chinese Premier Li Qiang earlier this month travelled to Europe in his first overseas trip as China’s No. 2 official.\nHis meetings with business and political leaders in Germany and France came as the European Union hammers out its position on how to manage economic rivalry with China.\nBeijing is trying to persuade Europe to take a less hawkish stance than the United States, which has imposed a sweeping raft of export controls on China to curb its access to advanced technology.\nItaly has been caught in the middle of those escalating tensions between Washington and Beijing, especially in the wake of China’s support for Russian President Vladimir Putin after his invasion of Ukraine.\nThe US has pressured Rome to take a public stance and ditch the BRI pact, according to people familiar with the matter.\nProfessor Wang Yiwei of Renmin University, who specialises in European studies, said that given 152 countries had signed onto the BRI, China should have an “open mind” on Italy’s decision – noting that it was likely Italian companies that would suffer the most from an exit.\n“The business community really wants to stay,” he added.\n“Otherwise, they’ll lose some of the preferential treatment they’ve been enjoying as a member country to the initiative.” BLOOMBERG", "url": "https://www.straitstimes.com/asia/east-asia/senior-china-diplomat-dispatched-to-italy-to-keep-nation-in-belt-and-road-initiative"}