{"authors": [], "date_download": "2024-10-12 13:38:43", "date_modify": "2024-10-12 13:38:43", "date_publish": "2024-05-16 00:08:00", "description": "Stance of Israel's defence minister sets him at odds with Israeli Prime Minister Benjamin Netanyahu. Read more at straitstimes.com.", "filename": "asia_israels-gallant-demands-clarity-on-post-war-gaza-governance-opposes-military-rule_1728740323.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/16/israelileaders16.jpg?VersionId=qd6hK6d2XqsenVIjUefn1HF8v.ZULoxS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_israels-gallant-demands-clarity-on-post-war-gaza-governance-opposes-military-rule_1728740323.html", "title": "Israeli defence chief challenges Netanyahu over post-war Gaza plans", "title_page": "Israeli defence chief challenges Netanyahu over post-war Gaza plans | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - Israeli Prime Minister Benjamin Netanyahu was publicly challenged about post-war plans for the Gaza Strip on May 15 by his own defence chief, who vowed to oppose any long-term military rule by Israel over the ravaged Palestinian enclave.\nThe televised statement by Defence Minister Yoav Gallant marked the most vocal dissent from within Israel’s top echelon against Mr Netanyahu during a seven-month-old and multi-front conflict that has set off political fissures at home and abroad.\nMr Netanyahu hinted, in a riposte which did not explicitly name Mr Gallant, that the retired admiral was making “excuses” for not yet having destroyed Hamas in a conflict now in its eight month.\nBut the veteran conservative premier soon appeared to be outflanked within his own war Cabinet: Centrist ex-general Benny Gantz, the only voting member of the forum other than Mr Netanyahu and Mr Gallant, said the defence minister had “spoke(n) the truth”.\nWhile reiterating the Netanyahu government’s goals of defeating Hamas and recovering remaining hostages from the Oct 7 cross-border rampage by the Islamist faction, Mr Gallant said these must be complemented by laying the groundwork for alternative Palestinian rule.\n“We must dismantle Hamas’ governing capabilities in Gaza. The key to this goal is military action, and the establishment of a governing alternative in Gaza,” Mr Gallant said.\n“In the absence of such an alternative, only two negative options remain: Hamas’ rule in Gaza or Israeli military rule in Gaza,” he added, saying he would oppose the latter scenario and urging Mr Netanyahu to formally forswear it.\nMr Gallant said that, since October, he had tried to promote a plan to set up a “non-hostile Palestinian governing alternative” to Hamas - but got no response from the Israeli Cabinet.\nThe format of his broadside, a pre-announced news conference carried live by Israeli TV and radio, recalled Mr Gallant’s bombshell warning in March 2023 that foment over a judicial overhaul pursued by Mr Netanyahu was threatening military cohesion.\nAt the time, Mr Netanyahu announced that Mr Gallant would be fired - but backed down amid a deluge of street demonstrations.\nSome defence analysts believe Mr Gallant’s prediction was borne out by Hamas’ ability to blindside Israeli forces a few months later.\nAsked on May 15 whether he was worried he may again face being ousted, Mr Gallant said: “I’m not blaming anyone. In a democratic country, I believe, it’s appropriate for a person, especially the defence minister who holds a position, to make it public.”\nMr Gallant’s Gaza criticism recalled that of Israel’s chief ally, the US, which has sought to parlay the war into a role for the internationally backed Palestinian Authority (PA), which wields limited governance in the occupied West Bank.\nMr Netanyahu has refused this, describing the PA as a hostile entity - and repeated this position in a video statement he issued on social media within an hour of Mr Gallant’s remarks.\nAny move to create an alternative Gaza government requires that Hamas first be eliminated, Mr Netanyahu said, finishing with the demand that this objective be pursued “without excuses”.", "url": "https://www.straitstimes.com/asia/israels-gallant-demands-clarity-on-post-war-gaza-governance-opposes-military-rule"}