{"authors": [], "date_download": "2024-10-12 14:00:52", "date_modify": "2024-10-12 14:00:52", "date_publish": "2023-11-17 19:26:39", "description": "Some 151 ships have used Ukraine's new Black Sea shipping corridor since it was set up in August, the Interfax-Ukraine news agency reported on Friday, citing a senior government official. Read more at straitstimes.com.", "filename": "asia_ukraine-says-151-ships-have-used-black-sea-corridor_1728741652.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/17/LYNXMPEJAG0CB-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_ukraine-says-151-ships-have-used-black-sea-corridor_1728741652.html", "title": "Ukraine says 151 ships have used Black Sea corridor", "title_page": "Ukraine says 151 ships have used Black Sea corridor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Some 151 ships have used Ukraine's new Black Sea shipping corridor since it was set up in August, the Interfax-Ukraine news agency reported on Friday, citing a senior government official.\nA total of 4.4 million metric tons of cargo, including 3.2 million tons of grain, has been shipped via the corridor, Yuriy Vaskov, deputy minister for renovation and infrastructure, was quoted as saying.\nA U.N.-backed deal that had allowed safe passage for Ukrainian grain exports via the Black Sea collapsed in July after Russia withdrew.\nIn response, Ukraine announced a \"humanitarian corridor\" hugging the western Black Sea coast near Romania and Bulgaria.\nVaskov said that 30 ships were currently loading at Ukrainian ports. They included 22 ships that would carry 700,000 tons of grain and eight ships readying 500,000 tons of other cargo.\nUkraine is one of the world's leading grain producers and exporters. Keeping grain exports flowing is key for its economy, which shrank by about a third last year. It is expected to grow by about 5% this year. REUTERS", "url": "https://www.straitstimes.com/asia/ukraine-says-151-ships-have-used-black-sea-corridor"}