{"authors": [], "date_download": "2024-10-12 13:40:30", "date_modify": "2024-10-12 13:40:30", "date_publish": "2024-08-25 16:50:00", "description": "Rescue team are helping those forced from their homes and bringing aid to people. Read more at straitstimes.com.", "filename": "asia_south-asia_floods-ease-in-bangladesh-but-300000-still-in-shelters_1728740430.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/25/2024-08-25T064411Z1928573279RC2SM9AQY6S5RTRMADP3ASIA-WEATHER-INDIA-BANGLADESH.JPG?VersionId=nADyM5RpKG1AusmOfMhcnWd5gCJULg40", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_floods-ease-in-bangladesh-but-300000-still-in-shelters_1728740430.html", "title": "Floods ease in Bangladesh but 300,000 still in shelters", "title_page": "Floods ease in Bangladesh but 300,000 still in shelters | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "FENI, Bangladesh - River waters in low-lying Bangladesh are receding after days of deadly floods but 300,000 people are still in emergency shelters requiring aid, disaster officials said on Aug 25.\nThe heavy floods, which killed at least 18 people in Bangladesh, have added to the challenges of a new government that took charge in August after a student-led revolution.\nRescue teams, including joint forces of the army, air force and navy, are helping those forced from their homes and bringing aid to those who have lost everything, disaster management minister Faruk-e-Azam said.\n“The flood situation is improving as the flood water started to recede,” Mr Azam told AFP.\nMore than 307,000 people are in shelters and more than 5.2 million have been affected by the floods, the ministry said.\n“Now we are working to restore communication in the affected areas so that we can distribute relief food,” Mr Azam said.\n“We are also taking steps so that contagious diseases don’t spread.”\nOrdinary Bangladeshis have been crowdfunding relief efforts.\nPolitical turmoil\nThe floods add to the woes of a nation still reeling from weeks of political turmoil that culminated in the toppling of autocratic leader Sheikh Hasina, who fled to India by helicopter.\nShe was replaced by Nobel Peace Prize laureate Muhammad Yunus, who is heading an interim government that faces the monumental task of charting democratic reforms ahead of expected new elections.\nHighways and rail lines were damaged between the capital Dhaka and the main port city of Chittagong, making access to badly flooded districts difficult and disrupting business activity.\nMonsoon rains cause widespread destruction yearly but climate change is shifting weather patterns and increasing the number of extreme weather events.\nThe South Asian nation of 170 million people is criss-crossed by hundreds of rivers and has seen frequent floods in recent decades.\nMuch of the country is made up of deltas where the Himalayan rivers the Ganges and the Brahmaputra wind towards the sea after coursing through India.\nIt is among the countries most vulnerable to disasters and climate change, according to the Global Climate Risk Index.\nHard-hit areas include the south-eastern regions around Chittagong and Cox’s Bazar, home to around a million Rohingya refugees from neighbouring Myanmar.\nFloods across the border in upstream India have also left a trail of destruction, with at least 24 people killed in eastern Tripura state since Aug 19.\nIndia’s Tripura disaster management authority said the waters were also receding but that more than 100,000 people were still sheltering in some 500 relief camps.\nMany of their homes were swamped by the floods, with a total of 1.7 million people affected, it said.\nThe floods have also fuelled anger between Dhaka and New Delhi, with India’s Foreign Ministry rejecting accusations that it was to blame for the floods and denying it had deliberately released water from an upstream dam.\nIndia was a key supporter of Ms Hasina and many Bangladeshis have since been openly critical of their bigger and more powerful neighbour for backing her 15-year rule.\nIndia said its own catchment area had experienced the “heaviest rains of this year” this week, and that the flow of water downstream was due to “automatic releases”. AFP", "url": "https://www.straitstimes.com/asia/south-asia/floods-ease-in-bangladesh-but-300000-still-in-shelters"}