{"authors": [], "date_download": "2024-10-12 13:50:50", "date_modify": "2024-10-12 13:50:50", "date_publish": "2022-03-30 08:54:01", "description": "Some western parts of the city are being locked down ahead of schedule. Read more at straitstimes.com.", "filename": "asia_east-asia_shanghai-expands-lockdown-to-more-areas-as-new-local-covid-19-cases-hit-5982_1728741050.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/30/ac_shanghailockdown_300322.jpg?VersionId=nG6glLzlqH5AKyBFsatx3Lx7qLS0IoK7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_shanghai-expands-lockdown-to-more-areas-as-new-local-covid-19-cases-hit-5982_1728741050.html", "title": "Shanghai expands lockdown to more areas as new local Covid-19 cases hit 5,982", "title_page": "Shanghai expands lockdown to more areas as new local Covid-19 cases hit 5,982 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (REUTERS) - Shanghai on Wednesday (March 30) extended its shutdowns to some western parts of the city earlier than scheduled, as it reported a total of 5,982 new local cases.\nThe financial hub of Shanghai, home to 26 million people, is in its third day of a lockdown the authorities are imposing by dividing the city roughly along the Huangpu River, splitting the historic centre from the eastern financial and industrial district of Pudong to allow for staggered testing.\nWhile residents in the east have been locked down since Monday, those in the west were officially scheduled to start their four-day lockdown on Friday.\nHowever, the city's south-western district of Minhang, home to more than 2.5 million people, announced late on Tuesday it would suspend public bus services until April 5.\nSeveral residents living in western districts also on Tuesday received notice from their housing committees that they would be stopped from leaving their compounds for the next seven days, for reasons such as pandemic control or because a neighbour had been a close contact of a positive case.\n\"We express our deepest thanks to all residents! We will resume normal life soon, but in the next period of time, we ask everyone to adhere closely to pandemic control measures, do not gather and reduce movements,\" said one notice seen by Reuters.\nThe city reported a record 5,656 asymptomatic Covid-19 cases and 326 symptomatic cases for March 29, up from 4,381 new asymptomatic cases and 96 new cases with symptoms for Monday.\nThe lockdown has roiled auto production in the city too, as two major suppliers, Aptiv and Thyssenkrupp joined Tesla in shutting plants due to Covid-19 control measures.\nThe Shanghai government said on its official WeChat account late on Tuesday that those who refused to comply with nucleic acid testing could be found legally liable and that it would punish any price gouging found, after people rushed to stock up on food and medical items in anticipation of the lockdowns.\nThe topic \"Pudong pandemic\" was one of the top trending items on the Chinese Weibo social media platform.\nA widely shared video showed a robotic dog with a loudhailer strapped on to its back walking around the empty streets of a housing compound, reminding residents to take necessary precautions.", "url": "https://www.straitstimes.com/asia/east-asia/shanghai-expands-lockdown-to-more-areas-as-new-local-covid-19-cases-hit-5982"}