{"authors": [], "date_download": "2024-10-12 14:11:27", "date_modify": "2024-10-12 14:11:27", "date_publish": "2024-06-09 19:59:00", "description": "Mr Xu Zuo is the latest to fall in President Xi Jinping’s near-constant crackdown on corruption. Read more at straitstimes.com.", "filename": "asia_east-asia_china-probes-top-exec-at-2-trillion-state-backed-investment-firm-for-corruption_1728742287.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/09/yaohui-pixchina-6651.jpg?VersionId=4_.n36LCGBQYc2ToU4bSXJEhOE7N9uSk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-probes-top-exec-at-2-trillion-state-backed-investment-firm-for-corruption_1728742287.html", "title": "China probes top exec at $2 trillion state-backed investment firm for graft", "title_page": "China probes top exec at $2 trillion state-backed investment firm for graft | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – A top executive at a major Chinese state-backed investment company is under investigation for corruption, the government’s anti-corruption body said on June 9, as an unrelenting crackdown on graft sweeps through the finance sector.\nMr Xu Zuo, vice-president at China Citic Group, is “suspected of serious disciplinary and legal violations”, the Communist Party’s Central Commission for Discipline Inspection said in an online statement, without giving further details.\nCitic Group is a vast state-run investment conglomerate with the equivalent of over US$1.5 trillion (S$2 trillion) in total assets as of 2023, according to its official website.\nMr Xu, a senior economist with a background in overseas acquisitions and restructuring, has been on the firm’s executive committee since 2019.\nChinese President Xi Jinping has waged a near-constant crackdown on official corruption since coming to power over a decade ago.\nProponents say the campaign encourages clean governance, while critics argue it also serves as a vehicle for Mr Xi to purge political rivals.\nAnti-graft bodies have trained their sights on the financial sector in recent months, including banking, insurance and state-owned enterprises.\nIn May, Bai Tianhui, the former general manager at another huge state-backed asset management firm, Huarong, was sentenced to death after being found guilty of taking over 1.1 billion yuan (S$204 million) in bribes. AFP", "url": "https://www.straitstimes.com/asia/east-asia/china-probes-top-exec-at-2-trillion-state-backed-investment-firm-for-corruption"}