{"authors": [], "date_download": "2024-10-12 14:07:01", "date_modify": "2024-10-12 14:07:01", "date_publish": "2015-08-23 15:24:32", "description": "BATU PAHAT (THE STAR/ASIA NEWS NETWORK) - Malaysian Deputy Prime Minister Ahmad Zahid Hamidi said he has met the wealthy Arab family who had donated the US$700 million (S$986 million) that was channelled into Prime Minister Najib Razak's personal account. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysias-dpm-says-he-has-met-arab-family-who-donated-cash-into-pm-najibs-bank-account_1728742021.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2015/08/23/mh1mdb23815.jpg?VersionId=ZmgUS4hvLhOXdZSuTfmnaHQJvSN1Opn3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysias-dpm-says-he-has-met-arab-family-who-donated-cash-into-pm-najibs-bank-account_1728742021.html", "title": "Malaysia's DPM says he has met Arab family who donated cash into PM Najib's bank account", "title_page": "Malaysia's DPM says he has met Arab family who donated cash into PM Najib's bank account | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BATU PAHAT (THE STAR/ASIA NEWS NETWORK) - Malaysian Deputy Prime Minister Ahmad Zahid Hamidi said he has met the wealthy Arab family who had donated the US$700 million (S$986 million) that was channelled into Prime Minister Najib Razak's personal account.\nHe said the \"king and prince\", whom he did not name, had donated the money because of Malaysia's commitment in fighting terrorism, and being a moderate Muslim country with a plural society.\nThe family, he said, was impressed by how Malaysia, with its plural society, still managed to remain moderate without sidelining any other religions.\n\"Those were the answers given to me when I asked them the reason for their donation. They also told me that Malaysia was not the only country they have donated money to.\n\"They have also helped other Islamic countries,\" he said when opening the Sri Gading Umno division meeting on Saturday.\nThe Umno vice-president, elaborating during the Kepong Umno division meeting on Sunday, said the donors were an \"Arab king and prince\" and the family decided to make the huge donation also because of Datuk Seri Najib's anti-Jewish stance, reported the Malay Mail Online.\n\"Because of that, the Arab king, Arab prince generously made the political donation for use during the 13th General Election,\" MMO quoted him as saying.\nDatuk Seri Ahmad Zahid also said the donor wanted to keep Umno and the ruling Barisan Nasional coalition in power.\nHe said he had also met the investment officer of the wealthy Arab family, who explained how the first US$100 millon was given via a cheque under Datuk Seri Najib's name and the rest through other channels.\n\"I saw the documents myself - the original documents, not photostated ones, and I also saw the money trail,\" he added.\nHe assured the people that the donation was 100 per cent from the Arab family and not from the Retirement Fund Inc. or 1Malaysia Development Berhad.\nHe urged Umno leaders to meet the people to explain the real situation regarding the donation so that they would not be influenced by the lies spread by the opposition through social media.\nOpening the Sekijang Umno division meeting in Segamat later on Saturday, Dr Ahmad Zahid said his encounter with the existence of a conspiracy to topple the government via the \"back door\" was not theatrics.\nHe said as Deputy Prime Minister and Home Minister, he was privy to all information around the country verified by not one but several intelligence agencies.\n\"I obtained the information accurately and did not add or minus the facts. The conspiracy to topple the government would take place if not stopped.\n\"This is the truth. Not an attempt,\" he said, adding that his statement regarding the leader of the plotter planning to meet the Prime Minister was also correct.\n\"The person didn't show up on that day as he did not want to have his photograph taken by the media people who were camped outside the Prime Minister's house,\" he added.\nDr Ahmad Zahid said those involved had intended to form a unity government where they would have two deputy prime ministers, one each from the Democratic Action Party and Parti Keadilan Rakyat.\n\"Their prime minister will be someone who used to be in Umno,\" he added.", "url": "https://www.straitstimes.com/asia/se-asia/malaysias-dpm-says-he-has-met-arab-family-who-donated-cash-into-pm-najibs-bank-account"}