{"authors": [], "date_download": "2024-10-12 13:42:55", "date_modify": "2024-10-12 13:42:55", "date_publish": "2024-10-06 01:26:33", "description": "WELLINGTON - A magnitude 5.7 earthquake struck near New Zealand's capital city of Wellington, government seismic monitor GeoNet said on Sunday, but initial reports indicated there were no injuries or significant damage. Read more at straitstimes.com.", "filename": "asia_magnitude-57-earthquake-strikes-cook-strait-new-zealand-region-geonet_1728740575.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/06/ST-logo-placeholder.jpg?VersionId=goOg.pIE.dXq1Lw2IQ7weZE5zqvb7Tet", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_magnitude-57-earthquake-strikes-cook-strait-new-zealand-region-geonet_1728740575.html", "title": "Magnitude 5.7 earthquake strikes Cook Strait, New Zealand region, GeoNet", "title_page": "Magnitude 5.7 earthquake strikes Cook Strait, New Zealand region, GeoNet | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WELLINGTON - A magnitude 5.7 earthquake struck near New Zealand's capital city of Wellington, government seismic monitor GeoNet said on Sunday, but initial reports indicated there were no injuries or significant damage.\nThe quake hit at 5:08 a.m. on Sunday (1608 GMT on Saturday) striking 25 kilometres (15.5 miles) west of Wellington at a focal depth of 30 km (19 miles).\nGeoNet said more than 37,000 people had reported feeling the shake, some as far north as Auckland in the North Island.\nGeoNet said there was no tsunami warning as a result of the quake.\nA spokesperson for Fire and Emergency New Zealand said the service had not received any calls for assistance.\nGovernment-owned Radio New Zealand said there were no reports of significant damage or reports of injury. REUTERS", "url": "https://www.straitstimes.com/asia/magnitude-57-earthquake-strikes-cook-strait-new-zealand-region-geonet"}