{"authors": [], "date_download": "2024-10-12 13:39:39", "date_modify": "2024-10-12 13:39:39", "date_publish": "2024-08-07 23:35:00", "description": "Since 2016, the reef has experienced five summers of mass coral bleaching. Read more at straitstimes.com.", "filename": "asia_hottest-oceans-in-400-years-endanger-great-barrier-reef-scientists-say_1728740379.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/07/AdobeStockBleaching20and20dead20coral20on20the20Great20Barrier20ReefAustralia2.jpg?VersionId=0_00WFyWsv1i8uE7E1lGb8kYJpbJtqz5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_hottest-oceans-in-400-years-endanger-great-barrier-reef-scientists-say_1728740379.html", "title": "Hottest oceans in 400 years endanger Great Barrier Reef, scientists say", "title_page": "Hottest oceans in 400 years endanger Great Barrier Reef, scientists say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Water temperatures in and around Australia’s Great Barrier Reef have risen to their warmest in 400 years over the past decade, placing the world’s largest reef under threat, according to research published on Aug 1.\nThe reef, the world’s largest living ecosystem, stretches for some 2,400km off the coast of the northern state of Queensland.\nA group of scientists at universities across Australia drilled cores into the coral and, much like counting the rings on a tree, analysed the samples to measure summer ocean temperatures going back to the year 1618.\nCombined with ship and satellite data going back around a hundred years, the results show ocean temperatures that were stable for hundreds of years begin to rise from 1900 onwards as a result of human influence, the research concluded.\nFrom 1960 to 2024, the study’s authors observed an average annual warming for January to March of 0.12 deg C per decade.\nSince 2016, the reef has experienced five summers of mass coral bleaching, when large sections of the reef turned white due to heat stress, putting the coral at greater risk of death.\nThese summers were during five of the six warmest years in the last four centuries, the study showed.\n“The world is losing one of its icons,” said Dr Benjamin Henley, an academic at the University of Melbourne and one of the study’s co-authors.\n“I find that to be an absolute tragedy. It’s hard to understand how that can happen on our watch in our lifetime. So it’s very, very sad.”\nThe last temperature data point, from January to March 2024, was the highest on record and “head and shoulders” above any other year, Dr Henley said.\nCoral reefs protect shorelines from erosion, are home to thousands of species of fish, and are an important source of tourism revenue in many countries.\nAt least 54 countries and regions have experienced mass bleaching of their reefs since February 2023 as climate change warms the ocean’s surface waters, the US National Oceanic and Atmospheric Administration has said.\nThe Great Barrier Reef is not currently on Unesco’s list of world heritage sites that are in danger, though the UN recommends it should be added.\nAustralia has lobbied for years to keep the reef – which contributes A$6.4 billion (S$5.6 billion) to the economy annually – off the endangered list, as it could damage tourism. REUTERS", "url": "https://www.straitstimes.com/asia/hottest-oceans-in-400-years-endanger-great-barrier-reef-scientists-say"}