{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:53:56", "date_modify": "2024-10-12 13:53:56", "date_publish": "2024-02-27 13:05:00", "description": "The police said the couple were high on drugs during the incident in their flat in Selangor. Read more at straitstimes.com.", "filename": "asia_se-asia_parents-arrested-by-malaysian-police-for-feeding-son-drug-laced-milk_1728741236.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/27/jaye-haych-vaozLvtSHok-unsplash.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_parents-arrested-by-malaysian-police-for-feeding-son-drug-laced-milk_1728741236.html", "title": "Malaysian couple arrested after accidentally feeding son milk mixed with meth", "title_page": "Malaysian couple arrested after accidentally feeding son milk mixed with meth | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Malaysian police are investigating the parents of a toddler for allegedly feeding their child milk mixed with drugs.\nPetaling Jaya district police chief Shahrulnizam Jaa’far @ Ismail told Malaysian media that the couple were high on drugs during the incident, which took place on Feb 19 in their flat in the state of Selangor.\nThe 34-year-old mother and her 40-year-old husband then took their 16-month-old son to the grandmother, who lives 15km away.\nThe 55-year-old grandmother was perplexed why the child was crying non-stop, on top of being “hyperactive” and “uncontrollable”, said Assistant Commissioner Shahrulnizam.\n“The baby’s mother admitted that she had accidentally mixed her son’s milk with her husband’s liquid methamphetamine,” he told Malay daily Berita Harian.\nThe toddler was immediately rushed to a hospital.\nHe is fine and not suffering from any drug-related effects, said AC Shahrulnizam. The boy is now under the care of his grandmother after leaving the hospital.\nHis parents were arrested on Feb 20.\n“Preliminary urine tests conducted on the two suspects showed that they had tested positive for drugs. Checks also showed that the male suspect, who worked as a drink seller, has a record for drug-related cases,” said AC Shahrulnizam.\nThe two suspects are currently detained as the police probe the matter under Section 31(1)(a) of the Child Act 2001 for ill-treatment, neglect or abandonment of children.\nThose found guilty can be fined a maximum of RM20,000 (S$5,600), jailed for up to 10 years, or both.\nThere have been reports in Malaysia of child neglect due to drug abuse by parents over the years.\nIn December 2023, a 16-month-old child in Johor was allegedly given methamphetamine by his mother and her boyfriend, causing the toddler to suffer seizures and convulsions.\nIn April the same year, police found that a seven-year-old boy in Kuala Lumpur was addicted to methamphetamine and lived in the same house as his parents, who are drug addicts.\nNational Anti-Drugs Agency director-general Sutekno Ahmad Belon said that from 2019 to 2022, nine children ranging from infants to 12-year-olds were found to be addicted to drugs.\nMost of them were influenced by their parents and surroundings, he told English daily New Straits Times.", "url": "https://www.straitstimes.com/asia/se-asia/parents-arrested-by-malaysian-police-for-feeding-son-drug-laced-milk"}