{"authors": [], "date_download": "2024-10-12 14:17:57", "date_modify": "2024-10-12 14:17:57", "date_publish": "2024-01-05 19:55:17", "description": "Officials say it was visually and technically different from Russian models. Read more at straitstimes.com.", "filename": "asia_russia-hit-ukraine-with-missiles-from-north-korea-kyiv_1728742677.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/05/LYNXMPEK040BX-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_russia-hit-ukraine-with-missiles-from-north-korea-kyiv_1728742677.html", "title": "Ukraine shows evidence Russia attacked Kharkiv with missiles supplied by North Korea", "title_page": "Ukraine shows evidence Russia attacked Kharkiv with missiles supplied by North Korea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KHARKIV, Ukraine – The Kharkiv region prosecutor’s office provided further evidence on Jan 7 that Russia attacked Ukraine with missiles supplied by North Korea, showcasing the fragments.\nA senior adviser to President Volodymyr Zelensky said on Jan 6 that Russia hit Ukraine last week with missiles supplied by North Korea for the first time during its invasion.\nMr Dmytro Chubenko, a spokesman for the prosecutor’s office, said the missile, one of several that hit the city of Kharkiv on Jan 2, was visually and technically different from Russian models.\n“The production method is not very modern. There are deviations from standard Iskander missiles, which we previously saw during strikes on Kharkiv. This missile is similar to one of the North Korean missiles,” Mr Chubenko told media, as he displayed the remnants.\nHe said the missile was slightly bigger in diameter than the Russian Iskander missile, while its nozzle, internal electrical windings and rear parts were also different.\n“That is why we are leaning towards the version that this may be a missile which was supplied by North Korea.”\nMr Chubenko declined to give the missile’s exact model name.\nRussia attacked Kharkiv with several missiles last week, killing two people and injuring more than 60 in one of its biggest missile and drone strikes since the start of the large-scale war in February 2022.\nNorth Korea has been under a United Nations arms embargo since it first tested a nuclear bomb in 2006.\nUN Security Council resolutions – approved with Russian support – ban countries from trading weapons or other military equipment with North Korea. REUTERS", "url": "https://www.straitstimes.com/asia/russia-hit-ukraine-with-missiles-from-north-korea-kyiv"}