{"authors": ["Lim Ai Leen"], "date_download": "2024-10-12 13:46:37", "date_modify": "2024-10-12 13:46:37", "date_publish": "2024-05-30 16:00:20", "description": "Asian Insider brings you insights into a fast-changing region from our network of correspondents and commentators. Read more at straitstimes.com.", "filename": "asia_asian-insider-escalation-risks-in-taiwan-strait-a-top-worry-how-south-korea-s-oldest-beauty-pageant-could-revive-an-ancient-city_1728740797.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/30/hzainl00524_0.jpg?VersionId=EfGV_xEu1kWBs1HfQCLdRbt81buk_X3Y", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_asian-insider-escalation-risks-in-taiwan-strait-a-top-worry-how-south-korea-s-oldest-beauty-pageant-could-revive-an-ancient-city_1728740797.html", "title": "Asian Insider: Escalation risks in Taiwan Strait a top worry | How South Korea’s oldest beauty pageant could revive an ancient city", "title_page": "Asian Insider: Escalation risks in Taiwan Strait a top worry | How South Korea’s oldest beauty pageant could revive an ancient city | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Dear ST reader,\nRegional security will be front and centre this weekend, as the world’s defence chiefs descend on Singapore for the annual Shangri-La Dialogue, organised by the International Institute for Strategic Studies.\nAs usual, all eyes and ears will be trained on US-China interactions at the summit, where China’s Defence Minister Dong Jun is slated to meet his US counterpart Lloyd Austin.South-east Asia’s leaders will also be keenly watched for their views on potential conflict in the South China Sea, as Philippines President Ferdinand Marcos Jr and Indonesia’s President-elect Prabowo Subianto take the podium for key speeches.\nOur exclusive interview with Australia’s Foreign Minister Penny Wong also sheds some light on the issue, as she tells assistant foreign editor Clement Tan that her biggest concern is the risk of escalation and miscalculation in the Taiwan Strait.\nMeanwhile, India’s mammoth elections will draw to a close on Saturday and we will be tracking the vote-counting as it gets underway on June 4. Prime Minister Narendra Modi may not win as big as he had hoped for, bureau chief Nirmala Ganapathy reports from New Delhi.\nElsewhere, the Indian diaspora is making its mark on politics in Canberra, writes correspondent Jonathan Pearlman, and could well produce an Australian Rishi Sunak in years to come.", "url": "https://www.straitstimes.com/asia/asian-insider-escalation-risks-in-taiwan-strait-a-top-worry-how-south-korea-s-oldest-beauty-pageant-could-revive-an-ancient-city"}