{"authors": [], "date_download": "2024-10-12 13:38:45", "date_modify": "2024-10-12 13:38:45", "date_publish": "2023-12-12 08:11:42", "description": "The trip, the Chinese President's first in six years, had been months in the planning. Read more at straitstimes.com.", "filename": "asia_chinas-xi-visits-vietnam-after-biden-seeks-to-boost-ties_1728740325.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/12/VIETNAM-CHINA-DIPLOMACY-060425.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_chinas-xi-visits-vietnam-after-biden-seeks-to-boost-ties_1728740325.html", "title": "Old foes China and Vietnam agree to build ‘shared future’", "title_page": "Old foes China and Vietnam agree to build ‘shared future’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANOI – Old foes China and Vietnam, at odds over claims in the South China Sea, declared on Dec 12 that they want to boost ties and build a community with a “shared future”, just three months after Hanoi upgraded its formal relations with the United States.\nChinese President Xi Jinping’s visit to Hanoi marks his first trip as China’s leader to Vietnam in six years. During the visit, the two countries signed 37 cooperation deals, in what can be seen as a triumph of Vietnam’s “bamboo diplomacy”, as both China and the US vie for influence.\nAfter China’s push, Vietnam agreed to “support the initiative of building a shared future community for humankind”, according to a joint statement shown to reporters.\nThe countries’ diplomats have debated the term for months, following Hanoi’s initial reluctance to use it, say officials and diplomats.\nThe Chinese phrase literally means “common destiny”, but its translation in English and Vietnamese is “common future”, which may be seen as less demanding.\n“One declaration, many translations,” said a diplomat based in the Vietnamese capital, commenting on the interpretation of the term.\nHowever, the upgrade in ties would just be symbolic, said Dr Le Hong Hiep, a specialist in Vietnamese strategic and political issues at ISEAS - Yusof Ishak Institute.\n“Vietnam’s mistrust of China runs deep, and from the Vietnamese people’s viewpoint, there is little to no ‘shared destiny’ between the two countries as long as China continues to claim most of the South China Sea,” he said.\nDespite their existing close ties on the economic front, the neighbours have been at odds over boundaries in the South China Sea and have a millennia-long history of conflict.\nIn a sign of possible de-escalation, the two countries signed a memorandum of understanding (MOU) for joint patrols in the Tonkin Gulf in the South China Sea, according to one of the agreements.\nBeyond taking ties to a level Beijing may see as being above those with the US, upgraded status came with the signing of 37 cooperation deals, according to reporters who saw the signed documents.\nHowever, it was short of the 45 deals initially proposed, according to one Vietnamese official.\nThe deals included an MOU on cross-border rail development.\nTop officials in both countries had urged a boost to a rail link between the southern Chinese city of Kunming and the northern Vietnamese port of Haiphong, which crosses regions in Vietnam rich in rare earths.\nChina’s Ambassador to Vietnam Xiong Bo said earlier this week that Beijing was ready to offer grants to develop rail connections, though the volume and terms of possible loans are not clear.\nBoosting transport links would allow Vietnam to export more to China, especially farm products, while Beijing wants to further integrate the country’s north with its southern supply chain networks.\nChinese firms have moved some operations to Vietnam quicker in 2023 than before the Covid-19 pandemic, looking to be closer to Western clients there, lower risks from US-China trade tension and cut exposure to China’s weakened economy.\nStronger rail networks would speed up the import of components from China for assembly in Vietnam, effectively expanding China’s Belt and Road Initiative (BRI) – which seeks to connect Asia with Europe and Africa through land and maritime routes.\nThe Hanoi Metro is Vietnam’s only project so far to have received BRI loans, but it has not been labelled as such in a country where anti-Chinese sentiment is still widespread enough that such moves could be viewed as getting too close to Beijing.\nThe two countries agreed to jointly promote the “two corridors, one belt” initiative, which is the Vietnamese term for infrastructure projects supported by China.\nMr Xi has also urged wider cooperation on security, connectivity, green energy and critical minerals, in a reference to rare earths, of which China is the world’s leading refiner.\nVietnam is estimated to have the world’s second-largest reserves of rare earths after its neighbour.\nNot all deals have yet been made public. REUTERS", "url": "https://www.straitstimes.com/asia/chinas-xi-visits-vietnam-after-biden-seeks-to-boost-ties"}