{"authors": [], "date_download": "2024-10-12 13:39:03", "date_modify": "2024-10-12 13:39:03", "date_publish": "2024-03-15 10:10:00", "description": "No abnormalities were detected at the Fukushima Daiichi plant or its sister plant Fukushima Daini. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-suspends-fukushima-water-release-after-quake-as-precaution_1728740343.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/15/2023-03-09T230128Z316251936RC2FPZ9668JHRTRMADP3JAPAN-FUKUSHIMA-WATER-FISH.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-suspends-fukushima-water-release-after-quake-as-precaution_1728740343.html", "title": "Japan suspends Fukushima water release after quake as precaution", "title_page": "Japan suspends Fukushima water release after quake as precaution | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - The release of wastewater from Japan’s stricken Fukushima Daiichi nuclear plant was suspended on March 15 following an earthquake, its operator said while stressing that the move was precautionary.\nA 5.8-magnitude jolt struck off the coast of the north-eastern Fukushima region – home to the plant wrecked by a tsunami in 2011 – at 12.14am on March 15, the Japan Meteorological Agency said.\nReferring to the water release process, Tokyo Electric Power Company (Tepco) said in a post on social media platform X that there were no abnormalities in the Advanced Liquid Processing System (Alps) treated water dilution and discharge facility. Alps removes all radioactive elements from contaminated water except the naturally occurring tritium.\n“(But) to be on the safe side, we have suspended the operations of the facilities in accordance with the predefined operational procedures,” it added.\nJapan’s nuclear regulatory authority also said shortly after the quake that no abnormalities were detected at either the crippled Fukushima Daiichi plant or its sister plant Fukushima Daini.\nIn August 2023, Tepco began releasing into the Pacific Ocean around 540 Olympic swimming pools’ worth of wastewater that had collected at Fukushima Daiichi since the 2011 accident, one of the world’s worst nuclear disasters.\nThe operation has been endorsed by the United Nations atomic agency.\nBut China and Russia have criticised the release into the Pacific Ocean and banned Japanese seafood imports, saying that Japan is polluting the environment.\nJapan experiences hundreds of earthquakes every year, and the vast majority cause no damage.\nThere were no immediate reports of injuries from the latest jolt, and there was no tsunami warning. AFP", "url": "https://www.straitstimes.com/asia/east-asia/japan-suspends-fukushima-water-release-after-quake-as-precaution"}