{"authors": [], "date_download": "2024-10-12 14:07:48", "date_modify": "2024-10-12 14:07:48", "date_publish": "2024-02-28 19:23:00", "description": "She was 1MDB’s former general counsel. Read more at straitstimes.com.", "filename": "asia_se-asia_nothing-moved-in-1mdb-without-najib-s-approval-company-s-former-lawyer-tells-court_1728742068.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/28/00032GX7VG.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_nothing-moved-in-1mdb-without-najib-s-approval-company-s-former-lawyer-tells-court_1728742068.html", "title": "Nothing moved in 1MDB without Najib’s approval, company’s former lawyer tells court", "title_page": "Nothing moved in 1MDB without Najib’s approval, company’s former lawyer tells court | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR - Former Malaysian premier Najib Razak’s approval was required before any move could be made in the operations of 1Malaysia Development Bhd (1MDB) due to his positions in the government and the company, the High Court in Malaysia heard.\n1MDB’s former general counsel Jasmine Loo, 50, testified that the approval was a practice even before her time in the company where everything must be floated up to Najib before the company could undertake any projects.\nNajib was then the prime minister, finance minister and chairman of the board of advisors at 1MDB.\n“It was a practice in 1MDB for everything to be referred to Najib first. In substance, it was... one individual (behind) all these decisions,” Loo said on Feb 28.\nNajib’s lead counsel Tan Sri Muhammad Shafee Abdullah, however, said there was a distinction among Najib’s three roles.\nHe said Loo, as general counsel, should have known that Najib could not come to a decision regarding the company without referring it to the board of directors first.\n“Instead, you purposely ignored these because you were a part of a conspiracy to hoodwink 1MDB,” Mr Muhammad Shafee said.\nLoo, the 50th prosecution witness, disagreed with Mr Muhammad Shafee’s suggestion and maintained that Najib’s approval from one role was akin to the approval of all three roles.\n“By the time I joined 1MDB, that was already the practice and we had been relying on professional company secretarial advisors. If they had different opinions they would have done it that way,” she said.\nLoo also disagreed with the testimony of former Goldman Sachs banker Tim Leissner during Malaysian Roger Ng’s 1MDB trial in New York where Leissner said she was the “key component” connecting fugitive businessman Low Taek Jho to the company.\nNg was a former Goldman Sachs banker who was sentenced to 10 years in jail after a jury in Brooklyn, New York found him guilty of violating US anti-bribery laws, money laundering and illegally skirting Goldman’s accounting controls.\nLoo said she was unaware that Najib had mentioned that she was appointed to legalise illegal documents.\nMr Muhammad Shafee then read an excerpt of Leissner’s testimony that Loo was unhappy with the amount of money she was about to receive from the 1MDB scheme, as it was inadequate.\nLoo replied that she did not agree with any statement made by Leissner.\nNajib, 70, is on trial for 25 charges in total: four for abuse of power that allegedly brought him the financial benefit to the tune of RM2.28 billion (S$643 million); and 21 for money laundering involving the same amount of money.\nThe trial continues before Justice Collin Lawrence Sequerah. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/nothing-moved-in-1mdb-without-najib-s-approval-company-s-former-lawyer-tells-court"}