{"authors": [], "date_download": "2024-10-12 13:52:44", "date_modify": "2024-10-12 13:52:44", "date_publish": "2024-03-23 15:43:31", "description": "Though ISIS has claimed responsibility, there were signs that Russia was pursuing a Ukrainian link. Read more at straitstimes.com.", "filename": "asia_two-suspects-in-moscow-attack-detained-after-car-chase-lawmaker_1728741164.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/23/LYNXNPEK2M024-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_two-suspects-in-moscow-attack-detained-after-car-chase-lawmaker_1728741164.html", "title": "Moscow concert attack: Russia arrests 4 suspected attackers", "title_page": "Moscow concert attack: Russia arrests 4 suspected attackers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russia has arrested 11 people, including four suspected gunmen, in connection with a deadly attack at a concert hall near Moscow that killed at least 115 people, the Kremlin said on March 23.\nThe Islamic State in Iraq and Syria group has claimed responsibility for the March 22 attack, the deadliest in Russia for 20 years. But there were indications that Russia was pursuing a Ukrainian link, despite a statement from Ukrainian presidential adviser Mykhailo Podolyak that Kyiv had nothing to do with it.\nThe FSB security service said “all four terrorists” had been arrested while heading to the Ukrainian border, and that they had contacts in Ukraine. It said they were being transferred to Moscow.\n“Now we know in which country these bloody bastards planned to hide from pursuit – Ukraine,” Foreign Ministry spokeswoman Maria Zakharova said on Telegram.\nA senior Russian lawmaker Andrei Kartapolov said that if Ukraine was involved, then Russia must deliver a “worthy, clear and concrete” reply on the battlefield.\nRussia’s Investigative Committee said the death toll had leapt to at least 115 from the attack, in which camouflage-clad gunmen opened fire with automatic weapons at concertgoers in the Crocus City Hall near the capital.\nIt said some died from gunshot wounds and others in a huge fire that broke out in the complex. Reports said the gunmen had lit the blaze using petrol from canisters they carried in rucksacks.\nPeople fled in panic. Baza, a news outlet with contacts in Russian security and law enforcement, said 28 bodies were found in a restroom and 14 on a staircase. “Many mothers were found embracing their children,” it said.\nThe Kremlin said FSB chief Alexander Bortnikov had reported to President Vladimir Putin that those detained included “four terrorists” and that the service was working to identify their accomplices.\nRussian lawmaker Alexander Khinshtein said the attackers had fled in a Renault vehicle that was spotted by police in Bryansk region, about 340km south-west of Moscow, on March 22 and disobeyed instructions to stop.\nHe said two were arrested after a car chase and two others fled into a forest. From the Kremlin account, it appeared they too were later detained.\nMr Khinshtein said a pistol, a magazine for an assault rifle and passports from Tajikistan were found in the car. Tajikistan is a mainly Muslim Central Asian state that used to be part of the Soviet Union.\nGunfire and screams\nVerified video showed people taking their seats in the concert hall, then rushing for the exits as repeated gunfire echoed above screams. Other video showed men shooting at groups of people. Some victims lay motionless in pools of blood.\n“Suddenly there were bangs behind us – shots. A burst of firing – I do not know what,” one witness, who asked not to be identified by name, told Reuters.\nLong lines formed in Moscow on March 23 for people to donate blood. Health officials said more than 120 people were wounded.\n“The death toll is expected to rise,” the Investigative Committee, which handles major crimes in Russia, said on Telegram.\nThe Moscow city and regional governments said they would provide financial support for families of the victims and those injured, as well as paying for funerals.\nISIS, the militant group that once sought control over swathes of Iraq and Syria, claimed responsibility for the attack, the group’s Amaq agency said on Telegram.\nIt said its fighters attacked on the outskirts of Moscow, “killing and wounding hundreds and causing great destruction to the place before they withdrew to their bases safely”. The statement gave no further detail.\nUS intelligence\nThe United States has intelligence confirming ISIS’ claim of responsibility for the shooting, a US official said on March 22. The official said Washington had warned Moscow in recent weeks of the possibility of an attack.\n“We did warn the Russians appropriately,” said the official, speaking on condition of anonymity, without providing any additional details.\nThe attack on Crocus City Hall, about 20km from the Kremlin, happened two weeks after the US embassy in Russia warned that “extremists” had imminent plans for an attack in Moscow.\nHours before the embassy warning, the FSB said it had foiled an attack on a Moscow synagogue by ISIS’ affiliate in Afghanistan, known as ISIS-Khorasan or ISIS-K, which seeks a caliphate across Afghanistan, Pakistan, Turkmenistan, Tajikistan, Uzbekistan and Iran.\nMr Putin changed the course of the Syrian civil war by intervening in 2015, supporting President Bashar al-Assad against the opposition and ISIS.\nDr Colin Clarke of The Soufan Centre said: “ISIS-K has been fixated on Russia for the past two years, frequently criticising Putin in its propaganda.”\nThe broader ISIS group has claimed deadly attacks across the Middle East, Afghanistan, Pakistan, Iran, Europe, the Philippines and Sri Lanka.\nWorld reaction\nRussian Foreign Ministry’s Ms Zakharova said it was a “bloody terrorist attack” that the world should condemn.\nThe US, European and Arab powers and many former Soviet republics expressed shock and sent their condolences. The United Nations Security Council condemned what it called a “heinous and cowardly terrorist attack”.\nRussia tightened security at airports, transport hubs and across the capital – a vast urban area of over 21 million people. All large-scale public events were cancelled across the country.\nMr Putin, who was re-elected on March 17 for a new six-year term, sent thousands of troops into Ukraine in 2022 and has repeatedly warned that various powers – including countries in the West – are seeking to sow chaos inside Russia. REUTERS", "url": "https://www.straitstimes.com/asia/two-suspects-in-moscow-attack-detained-after-car-chase-lawmaker"}