{"authors": [], "date_download": "2024-10-12 13:36:17", "date_modify": "2024-10-12 13:36:17", "date_publish": "2023-10-14 07:34:00", "description": "More than 2,200 Palestinians and 1,300 Israelis have been killed in the conflict so far. Read more at straitstimes.com.", "filename": "asia_palestinians-face-israeli-deadline-to-leave-northern-gaza_1728740177.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/14/10917056.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_palestinians-face-israeli-deadline-to-leave-northern-gaza_1728740177.html", "title": "Palestinians flee northern Gaza as Israel masses troops for assault", "title_page": "Palestinians flee northern Gaza as Israel masses troops for assault | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM – Thousands of Palestinians fled the north of the Gaza Strip on Saturday from the path of an expected Israeli ground assault, while Israel pounded the area with more air strikes and said it would keep two roads open to let people escape.\nIsrael has vowed to annihilate the Hamas militant group that controls Gaza, in retaliation for a rampage by fighters, who stormed through Israeli towns a week ago, gunning civilians down and making off with scores of hostages.\nAbout 1,300 people were killed in the worst attack on civilians in Israel’s history.\nIsraeli forces have since put the Hamas-run Gaza Strip, home to 2.3 million Palestinians, under a total siege and bombarded it with unprecedented air strikes.\nThe Gaza authorities say more than 2,200 people have been killed, a quarter of them children, and nearly 10,000 wounded.\n“We are striking our enemies with unprecedented might,” Israeli Prime Minister Benjamin Netanyahu said in a rare statement televised after the Jewish Sabbath began on Friday.\n“I emphasise that this is only the beginning.”\nIsrael had given the entire population of the northern half of the Gaza Strip, which includes the enclave’s biggest settlement, Gaza City, until Saturday morning to move south.\nAs that deadline approached, it said it would guarantee the safety of Palestinians fleeing on two main roads until 4pm (9pm Singapore time).\nThat new deadline expired with no immediate announcement from either side of any change in the situation.\nTroops were massing around the Gaza Strip, “getting ready for the next stage of operations”, a military spokesman, Lieutenant-Colonel Jonathan Conricus, said.\nHamas has told people not to leave and says the roads out are unsafe. It said dozens of people were killed in strikes on cars and trucks carrying refugees on Friday, which Reuters could not independently verify.\nIsrael said Hamas is preventing people from leaving to use them as human shields, which Hamas denies.\nIn Gaza City’s Tel Al-Hawa neighbourhood, in the area Israel ordered evacuated, warplanes bombed a residential area during the night, hitting several houses, according to residents who took refuge at the nearby Al Quds hospital and planned to flee south in the morning.\n“We lived a night of horror. Israel punished us for not wanting to leave our home. Is there brutality worse than this?” a father of three told Reuters by telephone from the hospital, declining to give his name for fear of reprisals.\n“I was never going to leave. I prefer to die and not leave, but I can’t see my wife, children die before my eyes. We are helpless.”\nThe attacks on Israel have plunged the nation into deep grief and galvanised it for war, with hundreds of thousands of reservists mobilised within days.\nFamilies of the kidnapped Israelis are terrified for their safety.\nMr Avichai Brodetz, a farmer from the Kfar Aza kibbutz (communal settlement) whose wife and three children were taken captive to Gaza, set up a camp outside the Israeli army headquarters to focus attention on their plight.\n“The first thing that needs to happen is the release of the women and children,” he told reporters.\n“I don’t want to be political. I don’t want to stand here with you. I love my friends and my home and my kibbutz. I hope we can return there, and you’ll never see me again.”\nHamas’ armed wing said nine captives, including four foreigners, were killed overnight due to Israeli air strikes. It previously threatened to kill one hostage for every building Israel strikes without warning.\nIsrael’s attacks on Gaza failed to halt Hamas missile strikes deep into Israeli cities.\nAir raid sirens wailed in central Israel on Saturday, and rockets smashed into a greenhouse in Ashkelon and wounded four people at a kibbutz.\nThe Gaza Strip is one of the most crowded areas in the world, and Israel’s evacuation order for the northern half meant those fleeing south were forced to shelter with relatives and friends, in schools or in hastily rented apartments.\nIsrael said the order is a humanitarian gesture to protect residents from harm while it roots out Hamas fighters entrenched in Gaza City.\nThe United Nations said so many people cannot be safely moved inside the besieged enclave without causing a humanitarian disaster.\nHamas has vowed to fight until the last drop of blood, and said the order to leave the north of the enclave is a trick to force residents to give up their homes. Gaza City mosques have blared calls telling people to stay.\nEven wars have rules\nThe Israeli military said on Friday tank-backed troops had mounted raids to hit Palestinian rocket crews and gather information on the location of hostages, the first official account of ground troops in Gaza since the crisis began.\nThe UN estimated that tens of thousands of Palestinians headed south from northern Gaza after the Israeli order on Friday, adding to 400,000 Gazans already displaced earlier in the week.\n“We need immediate humanitarian access throughout Gaza, so that we can get fuel, food and water to everyone in need,” UN Secretary-General Antonio Guterres said on Friday.\n“Even wars have rules.”\nThe United States has firmly backed its ally Israel, but has called on it to protect civilians.\n“The overwhelming majority of Palestinians had nothing to do with Hamas and Hamas’ appalling attacks,” President Joe Biden said on Friday. “And they’re suffering as a result as well.” US Secretary of State Antony Blinken, on a lightning tour of the Middle East, met Saudi Arabia’s foreign minister in Riyadh and was due to travel to the United Arab Emirates. REUTERS", "url": "https://www.straitstimes.com/asia/palestinians-face-israeli-deadline-to-leave-northern-gaza"}