{"authors": [], "date_download": "2024-10-12 14:03:19", "date_modify": "2024-10-12 14:03:19", "date_publish": "2024-08-11 15:45:00", "description": "“Inclusive food” dishes are intended for everyone who wants to enjoy good-tasting food. Read more at straitstimes.com.", "filename": "asia_inclusive-food-for-people-with-swallowing-chewing-difficulties-gain-popularity-in-japan_1728741799.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/11/photo2024-08-1114-55-20.jpg?VersionId=nemUaCXbXo6QmhXor7dtbb5SlPoejBaN&h=a490f381", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_inclusive-food-for-people-with-swallowing-chewing-difficulties-gain-popularity-in-japan_1728741799.html", "title": "‘Inclusive food’ for people with swallowing, chewing difficulties gain popularity in Japan", "title_page": "‘Inclusive food’ for people with swallowing, chewing difficulties gain popularity in Japan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - Dishes intended to bring the pleasure of tasty food to people who have problems chewing and swallowing are gaining popularity.\n“Inclusive food” dishes are intended for everyone who wants to enjoy good-tasting food, even if you can eat without problems.\nSome dishes are designed to look and taste like regular foods. One dish that on first glance looks like a whole apple is actually an apple-flavoured jelly covered in a cheese-based mousse and coated with a berry sauce. The dessert is so soft that it can be swallowed without biting.\nPastry chef Kayo Shimizu, 45, created the dish in autumn 2023 after speaking with parents of children who have difficulty chewing and swallowing. She decided to develop a dessert that would have a pleasant texture when eaten. Ms Shimizu has developed inclusive food before as part of a project in collaboration with the Tokyo metropolitan government.\nMs Shimizu plans to open a cafe in the future and offer the dessert as a menu item. “I want to create food that smells, feels and looks good for people who have difficulty eating,” she said.\nInclusive food is based on the idea that sharing the joy of eating regardless of disability is an important experience. Safe eating is typically considered essential for people who have disabilities, but sharing the pleasure of eating is considered equally important. Inclusive food is prepared so that everyone can start eating at the same time. Extra preparation, such as crushing the food with a blender, is not required.\nSakura Kato, 43, a representative of “mogmog engine”, a general incorporated association formed by parents of children who need help when eating, is grateful for the move. Her second daughter, Mako, 14, has muscular dystrophy, an intractable disease that causes muscle weakness throughout the body.\nMs Kato says that her daughter loves eating. “Even though she cannot communicate well with words, I can tell when she is enjoying the taste of food as she eats faster than usual,” she said.\nMeals prepared for people with chewing and swallowing problems are not always appetising to people, and are often unknown to people who have no problems with eating.\n“I hope that everyone in the same room will be able to start eating the same meal after saying ‘Itadakimasu’ (a phrase used to express thanks for the food) together,” Ms Kato said.\nCooperative restaurants\nSome restaurants have started to offer menu items that are edible to everyone, including people who find it difficult to chew and swallow.\nChocolaBit Lab, a chocolate shop in Shinjuku Ward, Tokyo, offers thick drinks that are easier to swallow. Saori Okamoto, 40, a medical doctor who heads the store, said: “Chocolate melts naturally in the mouth and has a pleasant aroma and taste, so it can be eaten by children, elderly people and those with oral dysfunctions among other problems.”\nSoup Stock Tokyo’s Lumine Tachikawa outlet in Tachikawa, Tokyo, has eight items on its soup menu that take into account people who have difficulty chewing. The soups are explained in a chart that shows the texture of the ingredients. A masher and other tools are available for customers so they can make adjustments before eating.\nHaruka Tohara, a professor at Tokyo Medical and Dental University, has posted information on the internet, including restaurants that offer meals that take into consideration anyone who has problems eating normally.\n“With a wider choice of meals, people with swallowing and chewing problems will enjoy eating more and these people and their families will be motivated to live more positively,” Professor Tohara said. “If more restaurants are cooperative, such as providing utensils to make their meals easier to eat, it will make it easier for these people to go out despite their disabilities, and it will contribute to a more inclusive society.” THE JAPAN NEWS/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/inclusive-food-for-people-with-swallowing-chewing-difficulties-gain-popularity-in-japan"}