{"authors": ["Hazlin Hassan"], "date_download": "2024-10-12 14:06:18", "date_modify": "2024-10-12 14:06:18", "date_publish": "2023-12-03 19:20:00", "description": "A non-cleric, Ahmad Samsuri Mokhtar is seen as more palatable to non-Malay and urban Malay voters. Read more at straitstimes.com.", "filename": "asia_se-asia_terengganu-menteri-besar-seen-as-pm-contender-for-malaysian-opposition-after-poll-win_1728741978.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/03/FW1344438PRKTR3402122023UNDIKEMAMAN.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_terengganu-menteri-besar-seen-as-pm-contender-for-malaysian-opposition-after-poll-win_1728741978.html", "title": "Terengganu Menteri Besar seen as PM contender for Malaysian opposition after poll win", "title_page": "Terengganu Menteri Besar seen as PM contender for Malaysian opposition after poll win | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – A by-election in Malaysia’s east coast state Terengganu has cast the spotlight on fast-rising opposition star Ahmad Samsuri Mokhtar, 53, who won by a landslide margin on Dec 2.\nHaving successfully defended the Kemaman federal parliamentary seat for Parti Islam SeMalaysia (PAS), Datuk Seri Samsuri is now eligible to become a candidate for prime minister – should his party and its Perikatan Nasional (PN) coalition come to federal power.\nDr Samsuri is currently the Terengganu Menteri Besar, after leading PN to a thumping victory in the August state election, where it swept all 32 seats in the state government.\nHe won by a landslide majority of 37,220 votes in a straight fight against Barisan Nasional (BN) candidate and former army chief Raja Mohamed Affandi, who received 27,778 votes.\nThe by-election was called after a court annulled the victory of PAS candidate Che Alias Hamid, ruling that the distribution of aid to voters by the PAS-led state government during the campaign period before the November 2022 General Election constituted election bribery.\nAhead of the polls, opposition leaders such as former premier Mahathir Mohamad and PN chairman Muhyiddin Yassin had indicated that Dr Samsuri has the potential to lead the country.\nOn Dec 2, Dr Samsuri told reporters: “When I joined politics, it was never my objective to hold such a high position (prime minister), but maybe in the future, if given the mandate by the party and people… I will consider the matter.”\nA non-cleric in an Islamist party, Dr Sam, as he is popularly known, is one of the party’s three vice-presidents. He holds a PhD in aeroengine ignition and combustion from Leeds University in Britain and was a lecturer at Universiti Putra Malaysia before becoming political secretary to PAS president Hadi Awang in 2008.\nThe calm and soft-spoken technocrat is seen as being able to attract support from the broader public compared with other leaders from the religiously conservative PAS.\nTan Sri Muhyiddin said that by fielding Dr Samsuri in the by-election on Dec 2, “the public will see that we have many wise, capable, tested and moderate leaders”.\n“There will be a time when PN will form the government,” Mr Muhyiddin was quoted as saying by the Malay-language Sinar Daily news site.\nTun Dr Mahathir, who began backing the opposition front ahead of the August 2023 state elections, said on Dec 1 that Dr Samsuri has proven his capabilities in governing Terengganu effectively.\n“In Kemaman, we have a candidate who is truly qualified to be the prime minister,” Dr Mahathir was quoted as saying by the Malaysiakini online news site.\nFormer health minister Khairy Jamaluddin turned political commentator said on his podcast: “We can see in Kemaman the chess move by PAS to put up Dr Samsuri in Parliament. That move is not to win the parliamentary seat of Kemaman – that is a chess move to place a prime minister from PAS.”\nPAS has over the years pivoted to attract more professionals, including doctors, lawyers and lecturers, to shed its rural religious state government image and rebrand itself as a capable party that can administer at the federal level.\nIn the interview posted on social media, Dr Samsuri said PAS wants to be “an extremely dominant party” in the next 10 years.\n“We’re not talking about just Kelantan, Terengganu, Kedah and Perlis anymore, but we’re talking about our country, where the people are diverse and there are various ethnicities and religions,” he said, referring to the four state legislative assemblies controlled by PN.\n“PAS is not just for Malays and Muslims but it must be for every citizen regardless of race or religion. This requires effort and planning.”\nHe added: “If we want PAS to progress in the next 10 years, we can’t just appeal to the Malays but also many groups in Malaysia. Only then can PAS become strong and relevant in Malaysia.”", "url": "https://www.straitstimes.com/asia/se-asia/terengganu-menteri-besar-seen-as-pm-contender-for-malaysian-opposition-after-poll-win"}