{"authors": ["Elaine Lee"], "date_download": "2024-10-12 14:00:27", "date_modify": "2024-10-12 14:00:27", "date_publish": "2024-08-01 18:28:49", "description": "The programme is offered by the Vocational University of Civil Affairs, which comes under the Ministry of Civil Affairs. Read more at straitstimes.com.", "filename": "asia_netizens-baffled-by-china-s-first-marriage-related-degree-programme_1728741627.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/CHINA-LIFESTYLE-100656.jpg?VersionId=z3fdZDa9I9I8d_WTT4vDr3viqnX6uL1n", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_netizens-baffled-by-china-s-first-marriage-related-degree-programme_1728741627.html", "title": "Netizens baffled by China’s first marriage-related university degree", "title_page": "Netizens baffled by China’s first marriage-related university degree | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A university in Beijing will launch China’s first marriage-related degree programme in September to train professionals for the wedding and matchmaking industry.\nBut many netizens are questioning the need for such a course given China’s declining marriage rate.\nThe new programme is offered by the Vocational University of Civil Affairs, which comes under the Ministry of Civil Affairs in China.\nIt aims to train students to provide services that cater to all aspects of a marriage cycle, and is set to enrol 70 undergraduates from 12 provinces, reported state broadcaster CCTV.\nAccording to online publication Sixth Tone, the curriculum includes sociology, family culture, ethics and economics, alongside training in family counselling, wedding planning and matchmaking.\nGraduates can seek jobs in industry associations, matchmaking agencies, wedding service companies and various family counselling organisations, the university’s vice-president Zhao Honggang told CCTV.\nHowever, many netizens on Weibo were baffled by the formation of the programme.\n“People do not want to get married these days,” a netizen said.\nAnother commented: “This profession is not only a sunset industry, it is doomed.”\nOne user quipped: “Why not create more funeral-related professions instead?”\nThere were some who found the course a “very novel” idea.\nThe number of marriages in China has been declining for almost a decade until a post-pandemic rise in 2023, according to data released by the Ministry of Civil Affairs in March.\nThere was a 12.4 per cent jump to 7.68 million newlyweds in 2023 from a year earlier, but the number was still far below the peak of 13.47 million couples in 2013.\nMany young people in China are opting to stay single or put off getting married for reasons related to job prospects and unemployment.", "url": "https://www.straitstimes.com/asia/netizens-baffled-by-china-s-first-marriage-related-degree-programme"}