{"authors": [], "date_download": "2024-10-12 14:00:19", "date_modify": "2024-10-12 14:00:19", "date_publish": "2024-06-24 20:07:05", "description": "Six cars and 16 private houses were damaged, and one house was destroyed. Read more at straitstimes.com.", "filename": "asia_russian-missiles-kill-four-wound-34-in-eastern-town-pokrovsk-ukraine-says_1728741619.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/25/LYNXMPEK5N0M0-1.jpg?VersionId=jwjuNgTP2jY0Jj3NhK8Pj4UqquSX8cEU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_russian-missiles-kill-four-wound-34-in-eastern-town-pokrovsk-ukraine-says_1728741619.html", "title": "Russian missiles kill five, wound 41 in Ukraine's Pokrovsk", "title_page": "Russian missiles kill five, wound 41 in Ukraine's Pokrovsk | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "POKROVSK, Donetsk region, Ukraine - A Russian double-tap missile attack killed at least five people and wounded 41 others, including four children, in the eastern Ukrainian town of Pokrovsk on June 24, regional officials said.\n\"This is one of the largest enemy attacks on civilians recently,\" regional governor Vadym Filashkin said on Telegram.\nGirls aged 9, 11, and 13, and a 12-year-old boy were injured, he added.\nPetro, a local resident, was circling a smashed blue car, the driver's seat soaked with blood, flowing into a vibrant red puddle. His son was killed while driving, and his grandson was hospitalised. \"My son, he is dead already, it's done,\" he said, weeping.\nSix cars and 16 private houses were damaged, and one house was destroyed, Filashkin said.\nRussian troops launched two Iskander-M ballistic missiles at the town which is about 24 km from the frontline, he added. The strikes were half an hour apart, the Ukrainian Prosecutor General's office said.\nThe attack left a huge crater in front of houses with shattered windows and smashed rooftops.\nOlha, 58, was inside her house when the second missile landed.\n\"I already started running around here, confused, and I get out - there was such screaming after the second strike... a boy, passer-by likely, was lying covered in blood,\" she told Reuters. REUTERS", "url": "https://www.straitstimes.com/asia/russian-missiles-kill-four-wound-34-in-eastern-town-pokrovsk-ukraine-says"}