{"authors": [], "date_download": "2024-10-12 14:00:20", "date_modify": "2024-10-12 14:00:20", "date_publish": "2024-06-29 00:33:36", "description": "Four floors of a residential building are destroyed in the attack. Read more at straitstimes.com.", "filename": "asia_russian-missile-strike-damages-residential-building-in-ukraines-dnipro_1728741620.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/29/flatsindnipro29.jpg?VersionId=ed3zeQRMqapogXKsKk4Z6NOQle8k5gkk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_russian-missile-strike-damages-residential-building-in-ukraines-dnipro_1728741620.html", "title": "One killed, six injured in Russian missile attack on Ukraine’s Dnipro", "title_page": "One killed, six injured in Russian missile attack on Ukraine’s Dnipro | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - A Russian missile strike hit a nine-storey residential building in the central Ukrainian city of Dnipro on June 28, killing at least one person and injuring six others, officials said.\nInterior Minister Ihor Klymenko warned the death toll would likely rise as more people remained trapped in the building where four upper storeys collapsed as a result of the attack.\nA photograph published by Governor Serhiy Lysak on the Telegram messaging app and other images circulated on social media showed a badly damaged building that had smoke rising from a gaping hole in its upper storeys.\nA seven-month-old infant was among the injured, Mr Lysak added. Three people were in severe condition.\nPresident Volodymyr Zelensky called on Ukraine’s allies to step up supplies of air defences to help the military intercept Russia’s regular aerial attacks.\nDnipro, which had a pre-war population of almost one million people, is a major Ukrainian city that lies on the road to the east of the country where the most intense fighting with Russian forces is raging.\nIt has been regularly targeted by missile and drone strikes since Russia launched its February 2022 invasion. Russia denies targeting civilians and civilian infrastructure, but thousands of people have been killed. REUTERS", "url": "https://www.straitstimes.com/asia/russian-missile-strike-damages-residential-building-in-ukraines-dnipro"}