{"authors": [], "date_download": "2024-10-12 13:59:15", "date_modify": "2024-10-12 13:59:15", "date_publish": "2024-05-12 18:36:55", "description": "He has been in an Australian maximum security prison since his 2022 arrest. Read more at straitstimes.com.", "filename": "asia_australianz_ex-us-marine-pilot-arrested-in-australia-worked-with-chinese-hacker-unknowingly-lawyer-says_1728741555.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/12/LYNXMPEK4B03B-2.jpg?VersionId=xcO6S7tSxySQ7WgaJqVcxZdbiWflA8Bw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_australianz_ex-us-marine-pilot-arrested-in-australia-worked-with-chinese-hacker-unknowingly-lawyer-says_1728741555.html", "title": "Ex-US Marine pilot arrested in Australia worked with Chinese hacker unknowingly, lawyer says", "title_page": "Ex-US Marine pilot arrested in Australia worked with Chinese hacker unknowingly, lawyer says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - A former US Marine pilot, who is fighting extradition from Australia on US charges of training Chinese military pilots to land on aircraft carriers, unknowingly worked with a Chinese hacker, his lawyer said.\nDaniel Duggan, 55, a naturalised Australian citizen, feared requests by Western intelligence agencies for sensitive information were putting his family at risk, the lawyer said in a legal filing seen by Reuters.\nThe lawyer’s filing supports Reuters reporting linking Duggan to convicted Chinese defence hacker Su Bin.\nDuggan denies the allegations that he broke US arms control laws. He has been in an Australian maximum security prison since his arrest in 2022, after returning from working in Beijing.\nThe US authorities found correspondence with Duggan on electronic devices seized from Su Bin, Duggan’s lawyer Bernard Collaery said in the March submission to Australian Attorney-General Mark Dreyfus, who will decide whether to surrender Duggan to the US after a magistrate hears Duggan’s extradition case.\nThe case will be heard in a Sydney court in May, two years after his arrest in rural Australia at a time when Britain was warning its former military pilots not to work for China.\nSu Bin, arrested in Canada in 2014, pleaded guilty in 2016 to theft of US military aircraft designs by hacking major US defence contractors. He is listed among seven co-conspirators with Duggan in the extradition request.\nDuggan knew Su Bin as an employment broker for Chinese state aviation company AVIC, Mr Collaery wrote, and the hacking case was “totally unrelated to our client”.\nAlthough Su Bin “may have had improper connection to (Chinese) agents, this was unknown to our client”, Duggan’s lawyer wrote.\n'Overt intelligence contact'\nAVIC was blacklisted by the US in 2023 as a Chinese military-linked company.\nMessages retrieved from Su Bin’s electronic devices show he paid for Duggan’s travel from Australia to Beijing in May 2012, according to extradition documents lodged by the US with the Australian court.\nDuggan asked Su Bin to help source Chinese aircraft parts for his Top Gun tourist flight business in Australia, Mr Collaery wrote.\nThe Australian Security Intelligence Organisation (ASIO) and US Navy criminal investigators knew Duggan was training pilots for AVIC and met him in Australia’s Tasmania state in December 2012 and February 2013, his lawyer wrote.\nASIO and the US Naval Criminal Investigative Service did not respond to Reuters requests for comment on the meetings.\nASIO has previously said it would not comment as the matter was before the court.\n“An ASIO officer suggested that while carrying on his legitimate business operations in China, Mr Duggan may be able to gather sensitive information,” his lawyer wrote.\nDuggan moved to China in 2013, his lawyer said. His passport was at one point confiscated by the Chinese government. Duggan’s LinkedIn profile and aviation sources who knew him said he was working in China as an aviation consultant in 2013 and 2014.\nHe renounced his US citizenship in 2016 at the US Embassy in Beijing, backdated to 2012 on a certificate, after “overt intelligence contact by US authorities that may have compromised his family safety”, his lawyer wrote.\nHis lawyers oppose extradition, arguing there is no evidence the Chinese pilots he trained were military and that he became an Australian citizen in January 2012, before the alleged offences.\nThe US government has argued Duggan did not lose his US citizenship until 2016. REUTERS", "url": "https://www.straitstimes.com/asia/australianz/ex-us-marine-pilot-arrested-in-australia-worked-with-chinese-hacker-unknowingly-lawyer-says"}