{"authors": [], "date_download": "2024-10-12 13:33:47", "date_modify": "2024-10-12 13:33:47", "date_publish": "2024-07-02 13:09:49", "description": "The campaigners from Mother Nature denied the charges, which they said were politically motivated. Read more at straitstimes.com.", "filename": "asia_cambodian-court-jails-environmental-activists-for-plotting-against-government_1728740027.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/02/CAMBODIA-ENVIRONMENT-RIGHTS-TRIAL-051532.jpg?VersionId=7LBgVjSuimXIQtHOaAeZRGYJz6Z790hf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_cambodian-court-jails-environmental-activists-for-plotting-against-government_1728740027.html", "title": "Cambodia sentences green campaigners for ‘plotting’ over activism", "title_page": "Cambodia sentences green campaigners for ‘plotting’ over activism | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PHNOM PENH - A Cambodian court on July 2 sentenced 10 environmentalists to between six and eight years in jail for plotting to commit crimes in their activism – the latest legal crackdown on the country’s green campaigners.\nThe campaigners from Mother Nature, one of Cambodia’s few environmental activism groups, denied the charges, which they said were politically motivated.\nMr Am Sam Ath, operations director of rights group Licadho, told AFP the court sentenced the activists to jail terms ranging from six to eight years.\nHe said three of them – including Mother Nature co-founder Alejandro Gonzalez-Davidson, a Spaniard deported from Cambodia in 2015 – were sentenced to eight years for plotting against the government and insulting the King.\nSeven others were sentenced to six years in prison on unspecified plotting charges.\nSix of the defendants were sentenced in absentia, while the four who were present were seized by the police outside the court and taken away, according to an AFP journalist. Ahead of the verdict, the four activists and a few dozen supporters had marched to the court in a mock funeral procession wearing white, a colour of mourning.\n“We cannot see the justice anywhere because we did not do anything wrong,” Mother Nature member Phuon Keoraksmey, 23, told reporters outside the Phnom Penh court.\nThe group comprised just young people working for social justice and to “protect natural resources”, she added.\nMr Am Sam Ath said the verdict was “very disappointing”.\nHe told AFP: “Today, the court has ruled that youth activists fighting for environmental protections and democratic principles are in effect acting against the state.”\nHuman Rights Watch (HRW) in June condemned the trial as an attempt to “muzzle criticism of governmental policies”.\nHRW said Mother Nature had campaigned for more than a decade against damaging infrastructure projects and “exposed corruption in the management of Cambodia’s natural resources”.\nThe charges against the 10 activists related to Mother Nature’s activism between 2012 and 2021.\nThe group raised issues around the filling in of lakes in Phnom Penh, illegal logging, and the destruction of natural resources across the country.\nThe tussle over protecting or exploiting Cambodia’s natural resources has long been a contentious issue in the kingdom, with environmentalists threatened, arrested and even killed in the past decade.\nThree of the activists sentenced on July 2 had previously been jailed for organising a peaceful march protesting against the filling in of a lake in the capital to create land for real estate developments.\nFrom 2001 to 2015, a third of Cambodia’s primary forests – some of the world’s most biodiverse and a key carbon sink – were cleared, and tree cover loss accelerated faster than anywhere else in the world, according to the World Resources Institute.\nMuch of the cleared land has been granted to businesses in concessions that experts say have driven deforestation and dispossession in the country. AFP", "url": "https://www.straitstimes.com/asia/cambodian-court-jails-environmental-activists-for-plotting-against-government"}