{"authors": [], "date_download": "2024-10-12 14:17:39", "date_modify": "2024-10-12 14:17:39", "date_publish": "2024-05-16 22:38:13", "description": "WASHINGTON - The United States announced sanctions on Thursday on two Russian individuals and three Russian companies for facilitating arms transfers between Russia and North Korea, including ballistic missiles for use in Ukraine. Read more at straitstimes.com.", "filename": "asia_us-targets-illegal-arms-transfers-between-russia-north-korea-treasury-says_1728742659.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/17/LYNXMPEK4F0QA-1.jpg?VersionId=AbNqTIo.Ll1kEa9_AG2oqtYTn4IHYEjO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_us-targets-illegal-arms-transfers-between-russia-north-korea-treasury-says_1728742659.html", "title": "US announces new sanctions over North Korea-Russia arms transfers", "title_page": "US announces new sanctions over North Korea-Russia arms transfers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The US announced sanctions on May 16 on two Russian individuals and three Russian companies for facilitating arms transfers between Russia and North Korea, including ballistic missiles for use in Ukraine.\nIt is the latest round of sanctions imposed by the Treasury and State departments to disrupt and expose arms transfers between the two countries, a Treasury Department statement said.\n\"Today's action reflects our commitment to disrupt the DPRK’s (Democratic People's Republic of North Korea) deepening military cooperation with Russia,\" Mr Brian Nelson, the under secretary of the Treasury for terrorism and financial intelligence, said in the statement.\n\"The United States will continue to take action to hold accountable those who seek to facilitate the shipment of weapons and other materiel to enable Russia's war,\" Mr Nelson added.\nThe statement said Russia and North Korea had strengthened military cooperation over the past year, with Pyongyang providing ballistic missiles and munitions to Russia and seeking military assistance in return.\nThe new sanctions were announced as Russian President Vladimir Putin and Chinese President Xi Jinping agreed on May 16 to deepen their \"strategic partnership\" while scolding the US, including over North Korea.\nThey also coincided with a US announcement that it was seeking information about three North Korean workers linked to the Communist country's Munitions Industry Department and an American accomplice involved in a scheme to secure illicit IT work with US firms and government agencies.\nUS State Department spokesperson Matthew Miller said Russia had already used upwards of 40 North Korean-produced ballistic missiles against Ukraine, as well as munitions, importing them in contravention of United Nations resolutions.\nHe called the deepening North Korea-Russia relationship \"a wide-ranging threat to global security and the international non-proliferation regime.\" He called on others in the international community to join the effort to counter it.\nThe Treasury statement said the individuals and firms targeted had attempted to evade sanctions by using front companies to move military equipment to support Russia's war in Ukraine.\nIt named the individuals as Rafael Anatolyevich Gazaryan and Aleksey Budnev, and the firms as Trans Kapital Limited Liability Company, the Rafort Limited Liability Company and Tekhnologiya, OOO.\nIt said Rafort is owned by Gazaryan while Budnev is the sole owner of Tekhnologiya.\nThe sanctions block all US property and interests in property of those designated.\nThey follow on from similar actions in 2023 that targeted an already sanctioned Slovakian national, Ashot Mkrtychev. The statement said Gazaryan likely acted as an intermediary between the Russian government and Mkrtychev.\nRussia's embassy in Washington did not immediately respond to a request for comment and the firms and individuals could not immediately be reached. REUTERS", "url": "https://www.straitstimes.com/asia/us-targets-illegal-arms-transfers-between-russia-north-korea-treasury-says"}