{"authors": [], "date_download": "2024-10-12 14:08:02", "date_modify": "2024-10-12 14:08:02", "date_publish": "2024-01-31 19:17:28", "description": "It will be at the discretion of the Pardons Board to announce its decision, the minister said. Read more at straitstimes.com.", "filename": "asia_malaysia-cabinet-discusses-najib-pardon-bid-but-wont-announce-outcome-minister_1728742082.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/31/2023-11-02T025731Z1822259358RC2F2W9K5JTFRTRMADP3MALAYSIA-POLITICS-NAJIB.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_malaysia-cabinet-discusses-najib-pardon-bid-but-wont-announce-outcome-minister_1728742082.html", "title": "Malaysian Cabinet discussed Najib pardon bid but has no say in outcome: Home Minister", "title_page": "Malaysian Cabinet discussed Najib pardon bid but has no say in outcome: Home Minister | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Malaysia's Cabinet has discussed a request by jailed former premier Najib Razak for a royal pardon but has no authority to make any announcement, the Home Minister said on Jan 31, amid frenzied speculation about the outcome.\nIt will be at the discretion of the Pardons Board to announce its decision, Datuk Seri Saifuddin Nasution Ismail said at a press conference on immigration and labour issues, which was packed with media seeking news on Najib's clemency bid.\nThe disgraced former leader Najib is serving a 12-year jail term for graft linked to state fund 1Malaysia Development Berhad (1MDB), from which US and Malaysian investigators estimate US$4.5 billion (S$6 billion) was stolen and more than US$1 billion channeled to accounts linked to the former premier.\nNajib requested a royal pardon shortly after beginning his sentence in 2022 and after exhausting all other appeals. He consistently denied wrongdoing.\nMalaysian Minister in the Prime Minister's Department Zaliha Mustafa on Jan 30 said the Pardons Board had met a few days ago and an official statement will be issued, though she did not say if Najib's request was discussed.\nThe remarks prompted a blitz of media speculation, with one prominent Malay-language newspaper forced to withdraw a report citing sources saying that Najib had been granted a full pardon.\nNajib's lawyer and representatives, as well as Malaysia's Attorney-General, a member of the pardons board, did not respond to Reuters' requests for comment.\nOfficials on Jan 31 declined to comment on further reports.\n\"Let us not jump the gun; let us wait for an official statement to be made,\" Communications Minister Fahmi Fadzil said at a separate press briefing. \"We must show professionalism in reporting.\"\nNajib says he was misled by fugitive financier Jho Low and other 1MDB officials over the source of the funds and that he believed they were donations from the Saudi royal family. He remains on trial in several other cases linked to corruption at 1MDB.\nNajib's daughter, Ms Nooryana Najwa Najib, on Jan 30 posted on Instagram a picture of the former leader sitting pensively, accompanied by the message: \"Always waiting for your return, however long it takes.\" REUTERS", "url": "https://www.straitstimes.com/asia/malaysia-cabinet-discusses-najib-pardon-bid-but-wont-announce-outcome-minister"}