{"authors": [], "date_download": "2024-10-12 13:33:45", "date_modify": "2024-10-12 13:33:45", "date_publish": "2023-11-14 16:45:00", "description": "Cambodia said report was “not right”, and relocation of villagers was done on a “voluntary” basis. Read more at straitstimes.com.", "filename": "asia_se-asia_amnesty-accuses-cambodia-over-forced-evictions-at-angkor-wat_1728740025.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/14/CAMBODIA-HERITAGE-AMNESTY-UNESCO-072428.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_amnesty-accuses-cambodia-over-forced-evictions-at-angkor-wat_1728740025.html", "title": "Amnesty accuses Cambodia over ‘forced evictions’ at Angkor Wat", "title_page": "Amnesty accuses Cambodia over ‘forced evictions’ at Angkor Wat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PHNOM PENH – Rights group Amnesty International on Tuesday accused Cambodia of breaking international law in evicting 10,000 families from around the Angkor Wat temple complex.\nPhnom Penh has over the past year increased the relocation of families living within the sprawling Unesco World Heritage Site to a new community being built on former rice paddies 25km away since 2022.\nOfficials have long maintained that families are moving voluntarily, but in a report released on Tuesday Amnesty says many are receiving “direct and subtle threats” to move.\n“They must immediately cease forcibly evicting people and violating international human rights law,” said Ms Montse Ferrer of Amnesty.\nCambodian government spokesman Pen Bona said the report was “not right”, insisting that the relocation of villagers was done on a “voluntary” basis and in line with Unesco rules.\nUnesco said it is “deeply concerned” by the report, which comes on the eve of a regular intergovernmental conference on Angkor at the culture body’s headquarters in Paris.\nThe temple complex, dating back to the 9th century, is Cambodia’s top tourist attraction, and pre-pandemic drew more than two million tourists every year.\nThe tourists spawned a micro-economy of stallholders, food and souvenir sellers, and beggars, and the local population exploded from an estimated 20,000 in the early 1990s to about 120,000 by 2013.\nThe Cambodian authorities say they are acting to protect the ruins by moving squatters whose informal settlements are damaging the local environment by producing rubbish and overusing water resources.\nOfficials say only unauthorised settlements – often ramshackle huts without proper sewage, running water or in some cases electricity – have been targeted.\nUnesco concern\nThe Amnesty report calls on Unesco to condemn Phnom Penh’s actions and warns of further escalation if it should fail to do so.\n“Unless there is serious pushback from Unesco, conservation efforts may increasingly be weaponised by states to their own ends, at the expense of human rights,” Ms Ferrer said.\nThe rights group alleges that officials from Apsara National Authority – the body which manages the archaeological park – and the Land Ministry are using Unesco to justify the relocations.\nOne resident said the Cambodian authorities told her explicitly that “Unesco wants you to leave” or lose the site’s world heritage status.\nAt least seven villagers who live around Angkor Wat have been sued by Apsara for allegedly inciting and obstructing public work, according to court summons.\nThe lawsuits were filed after hundreds of villagers protested against an attempt by Apsara officials in August to demolish allegedly illegal structures inside the archaeological park.\n“Unesco is deeply concerned about the population relocation programme in Angkor carried out by the Cambodian authorities,” the Untied Nations body said in a statement, adding that it has “never requested, nor supported, nor was a party to this programme”.\nUnesco called on Cambodia to take “corrective measures” and to respond to Amnesty’s allegations in its next report on Angkor.\nGovernment spokesman Pen Bona said the government was acting in line with Unesco rules.\n“Cambodia must respect conditions imposed by Unesco,” he said, adding that the conditions required that there were no structures, constructions, or people living at the site.\n“There could be a few villagers who may not be happy and they (Amnesty) interviewed them and said that the government conducted forced evictions,” he said. AFP", "url": "https://www.straitstimes.com/asia/se-asia/amnesty-accuses-cambodia-over-forced-evictions-at-angkor-wat"}