{"authors": [], "date_download": "2024-10-12 13:47:54", "date_modify": "2024-10-12 13:47:54", "date_publish": "2022-07-05 09:06:50", "description": "The eastern province has now recorded more than 1,000 infections since late last week. Read more at straitstimes.com.", "filename": "asia_east-asia_chinas-anhui-province-reports-231-new-covid-19-cases_1728740874.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/05/AK_chcov_050722.jpg?VersionId=PAUv1Sf3MxeTINESY4dBJTO.v.YdLXtw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_chinas-anhui-province-reports-231-new-covid-19-cases_1728740874.html", "title": "China's Anhui province reports 231 new Covid-19 cases", "title_page": "China's Anhui province reports 231 new Covid-19 cases | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (BLOOMBERG) - China's Anhui province reported 231 Covid-19 cases for Monday (July 4) as authorities race to quash any risk of infections spilling over into one of the nation's most economically significant regions.\nThe eastern province has now recorded more than 1,000 infections since late last week. Authorities locked down Si County and a neighbouring county late last week to try and stop the virus from spreading to nearby Jiangsu province, the second biggest contributor to China's economic output and a globally important manufacturing hub for the solar sector.\nStill, Jiangsu reported 66 local cases for Monday. That includes 34 in the biotech hub of Wuxi city, which has already suspended dine-in services at restaurants and closed entertainment venues.\nShanghai, which neighbours Jiangsu, reported eight local cases on Monday, though just one infection was found outside government quarantine. Zhao Dandan, a vice director at Shanghai's municipal health commission, cautioned in a briefing on Sunday that the city still faces risks of a rebound in Covid-19 cases.\nChinese President Xi Jinping last week reaffirmed the country would stick to \"Covid Zero\" and said China would rather endure some temporary impact on economic development than let the virus hurt people's safety and health.\nChina's manufacturing activity has only just started to rebound as the country rolled back Covid-19 restrictions. While authorities have not yet locked down the biggest regional hubs to curtail the current outbreak, any tightening in restrictions threatens to have a global impact.\nNationwide, China reported 335 new cases, with Beijing detecting three and Fujian province reporting seven.\nElsewhere, Macau added 89 new infections, taking the total number of cases in the current outbreak to 941.", "url": "https://www.straitstimes.com/asia/east-asia/chinas-anhui-province-reports-231-new-covid-19-cases"}