{"authors": [], "date_download": "2024-10-12 14:04:36", "date_modify": "2024-10-12 14:04:36", "date_publish": "2023-08-11 22:38:00", "description": "The project has been beset by delays due to land procurement issues, the Covid-19 pandemic and cost overrun. Read more at straitstimes.com.", "filename": "asia_se-asia_indonesia-says-it-must-prioritise-safety-of-delayed-china-funded-bullet-train_1728741876.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/11/2023-08-11T132722Z1250411576RC230X94OCURRTRMADP3INDONESIA-TRANSPORTATION-RAILWAYS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_indonesia-says-it-must-prioritise-safety-of-delayed-china-funded-bullet-train_1728741876.html", "title": "Indonesia says it must prioritise safety of delayed China-funded bullet train", "title_page": "Indonesia says it must prioritise safety of delayed China-funded bullet train | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Indonesia is prioritising safety ahead of the planned commercial launch of its China-funded US$7.3 billion (S$9.9 billion) high-speed railway, its transport minister said on Friday, addressing concerns about a project already years behind schedule.\nA flagship project of President Joko Widodo and part of China’s Belt and Road Initiative, the 142km railway connecting Jakarta to the city of Bandung was originally set to be completed by 2019.\nBut it has been beset by problems, including delays due to land procurement issues, the Covid-19 pandemic and a US$1.2 billion cost overrun.\nThe consortium of Indonesian and Chinese state companies building the railway, KCIC, earlier this week postponed a planned free trial run by about two weeks to Sept 1 to ensure safety.\nIt continues to aim for a commercial launch on Oct 1, but Transport Minister Budi Karya Sumadi told Reuters in an interview that these dates are not set in stone.\n“The President told me not to rush it. He knows that the No. 1 priority is safety... This is the first (high-speed train) in Indonesia and Asean, and it has an advanced technology, so we have to be careful,” Mr Budi said.\nHis ministry is currently doing safety tests, he said, while underscoring the complexity of the project.\nIn July, Chinese President Xi Jinping told Mr Widodo during the Indonesian leader’s trip to China that both countries must ensure the project adheres to high standards as it nears completion.\n“Any delay will mean delayed income (for the project operator), and there will be consequences on financial ratios. But we as technical people think safety is paramount, and the President has considered all consequences,” Mr Budi said.\nKCIC is already struggling to deal with the project’s cost overrun, especially as one of the consortium members, Indonesia’s construction firm Wijaya Karya, is facing its own debt troubles.\nNegotiations for an additional US$560 million loan from the Chinese Development Bank are under way to complete the remaining construction.\nGiven the rising cost, there have been concerns that ticket prices will have to be set high to ensure investment returns.\nMr Budi said the train fare would be set at 250,000 rupiah to 300,000 rupiah (S$22 to S$27) – below the 350,000 rupiah estimate without government intervention – with the leader of the consortium, Indonesian railway firm Kereta Api Indonesia, expected to subsidise prices.\nStill, that would be twice the price travellers now pay for a trip between the two cities aboard a regular train.\n“We hope with the subsidy, the economical price will be near the price that the passengers are willing to pay,” Mr Budi said. REUTERS", "url": "https://www.straitstimes.com/asia/se-asia/indonesia-says-it-must-prioritise-safety-of-delayed-china-funded-bullet-train"}