{"authors": [], "date_download": "2024-10-12 13:37:36", "date_modify": "2024-10-12 13:37:36", "date_publish": "2024-08-25 18:37:35", "description": "The latest incident occurred over what Manila said was a resupply mission for fishermen. Read more at straitstimes.com.", "filename": "asia_china-philippines-clash-in-south-china-sea-despite-efforts-to-rebuild-trust_1728740256.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/25/PHILIPPINES-CHINA-MARITIME-100457.jpg?VersionId=gG26473tXPeW84imzqeibYAR.65UKQT3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-philippines-clash-in-south-china-sea-despite-efforts-to-rebuild-trust_1728740256.html", "title": "China, Philippines clash in South China Sea despite efforts to rebuild trust", "title_page": "China, Philippines clash in South China Sea despite efforts to rebuild trust | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA/BEIJING - The Philippines and China clashed in disputed waters of the South China Sea on Aug 25 over what Manila said was a resupply mission for fishermen, the latest in a series of sea and air confrontations in the strategic waterway.\nThe incident overshadows efforts by both nations to rebuild trust and better manage disputes after months of confrontations, including a violent clash in June, in which a Filipino sailor lost a finger.\nThe Philippines on Aug 25 accused China of “aggressive and dangerous manoeuvres” to block the resupply mission.\nChina’s coast guard, meanwhile, said it had taken “control measures” against a vessel that had “illegally” entered the waters and repeatedly approached Chinese ships in a dangerous manner.\nIn the incident near the Sabina Shoal, the Philippine South China Sea task force said Chinese vessels rammed and used water cannon against a Philippine Bureau of Fisheries ship transporting food, fuel and medical supplies for Filipino fishermen.\nFor its part, the Chinese coast guard said the Philippine ship “ignored repeated serious warnings and deliberately approached and rammed” China’s law enforcement boat. It added that responsibility for the collision lies entirely on the Philippine side.\nChina asserts sovereignty over nearly all of the South China Sea, including areas claimed by the Philippines, Taiwan, Malaysia, Indonesia, Vietnam and Brunei. Beijing has deployed an armada of vessels to protect its claims.\nAn international arbitral tribunal in 2016 ruled that Beijing’s claim had no basis under international law, a landmark victory for the Philippines, which filed the case. Beijing rejects that decision.\nThe Philippines and China agreed to restore trust and rebuild confidence to manage maritime disputes at a high-level meeting in July.\nThat was followed by a provisional arrangement on Manila’s resupply missions to a beached Filipino naval ship in the South China Sea.\nThe Philippine task force said of the Aug 25 confrontation: “These unprofessional, aggressive and illegal actions posed serious risks to the safety of the Filipino crew and the fishermen they were meant to serve.”\nIt said the Bureau of Fisheries vessel, operating from Half-Moon Shoal to Sabina Shoal, encountered multiple Chinese vessels that deployed “perilous manoeuvres”, causing its engine to fail and forcing it to end the resupply mission.\nManila repeated its call for Beijing to halt “provocative actions that destabilise regional peace and security”.\nOn Aug 24, Manila accused Beijing of “unjustifiably” deploying flares from the China-occupied Subi Reef on Aug 22 while a Philippine aircraft was conducting patrols.\nThe same aircraft had faced harassment from a Chinese jet fighter while it was conducting a surveillance flight near the Scarborough Shoal on Aug 19, the Philippines said.\nThe US – the Philippines’ treaty ally – condemned China for launching the flares. REUTERS", "url": "https://www.straitstimes.com/asia/china-philippines-clash-in-south-china-sea-despite-efforts-to-rebuild-trust"}