{"authors": [], "date_download": "2024-10-12 14:04:04", "date_modify": "2024-10-12 14:04:04", "date_publish": "2022-12-23 17:40:23", "description": "The Taiwanese company is building a chip plant in southern Japan. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-lawmaker-says-taiwanese-chipmaker-tsmc-is-considering-second-plant-in-japan_1728741844.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/23/2022-12-23T054351Z1885761709RC2GBY9QO1A4RTRMADP3TSMC-GERMANY-PLANT_0.JPG?VersionId=UfSpeZQbDO10XJnAW2WIFBFGxGioV7A5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-lawmaker-says-taiwanese-chipmaker-tsmc-is-considering-second-plant-in-japan_1728741844.html", "title": "Japan lawmaker says Taiwanese chipmaker TSMC is considering second plant in Japan", "title_page": "Japan lawmaker says Taiwanese chipmaker TSMC is considering second plant in Japan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - A senior Japanese lawmaker said on Friday that Taiwan Semiconductor Manufacturing Co , the world’s largest contract chip maker, is considering building a second plant in Japan in addition to an US$8.6 billion dollar facility now under construction.\nYoshihiro Seki, secretary general of a ruling party lawmakers’ group on chip industry strategy, also urged that Japan’s government, which has pledged to provide up to US$3.6 billion in subsidies for the first TSMC plant, provide a favourable environment for investment.\n“I believe TSMC is looking into further investments in Japan. We need to create an environment that would make them think they want to do advanced projects with us,” Mr Seki told Reuters in an interview.\nTSMC said in an emailed statement that it did not rule out any possibility for Japan but there were no concrete plans at the moment.\nThe Taiwanese company is building a chip plant in southern Japan, with Sony Group Corp and auto parts maker Denso Corp each taking a minority stake. Production is due to start in late 2024.\nTSMC is also investing US40 billion in a US chipmaking plant in Arizona, and according to the Financial Times is in advanced talks with suppliers about possibly setting up its first European plant, as it diversifies its production base and addresses global demand for semiconductors.\nMr Seki’s group within Japan’s Liberal Democratic Party is advocating for Japan to strengthen its semiconductor industry, which has fallen to less than a 10 per cent share of the global market by revenue from more than half in the late 1980s.\n“Technological innovation is fierce in the semiconductor industry,” Mr Seki said.\n“We cannot be successful unless the public and private sectors act as one unified body.”\nIn a policy speech in October, Prime Minister Fumio Kishida positioned semiconductors as pivotal to Japan’s economic security and pledged to funnel public and private investments into the industry. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/japan-lawmaker-says-taiwanese-chipmaker-tsmc-is-considering-second-plant-in-japan"}