{"authors": [], "date_download": "2024-10-12 13:35:26", "date_modify": "2024-10-12 13:35:26", "date_publish": "2024-10-03 10:05:57", "description": "Israel's latest strikes in Lebanon come after Iran fired over 180 missiles into Israel on Oct 1. Read more at straitstimes.com.", "filename": "asia_china-urges-un-security-council-to-de-escalate-middle-east-crisis_1728740126.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/LYNXMPEK9201Q-1.jpg?VersionId=wkfnP_P.YpruY6kq_HBMPbKOCDQqfqmk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-urges-un-security-council-to-de-escalate-middle-east-crisis_1728740126.html", "title": "China urges UN Security Council to de-escalate Middle East crisis", "title_page": "China urges UN Security Council to de-escalate Middle East crisis | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - China called on the United Nations Security Council to take “urgent actions” to de-escalate the situation in the Middle East as Israel launched fresh air strikes in Lebanon.\nChina's permanent representative to the UN, Mr Fu Cong, said during a Security Council briefing on Oct 2, that it needed to make clear and unequivocal demands to stop the cycle of violence over the Israeli-Lebanon conflict.\n“The Security Council bears the primary responsibility for the maintenance of international peace and security,” the official Xinhua news agency reported Mr Fu as saying, noting that all parties concerned “must return to the track of political and diplomatic solutions”.\nIsrael's latest missile strikes in central Beirut come after Iran fired more than 180 missiles into Israel on Oct 1. Israel has also sent infantry and armoured units into Lebanon, with reports of fighting with the Iran-backed armed group Hezbollah.\nIran said on Oct 2 its missile volley – its biggest ever assault on Israel – was over, barring further provocation, but Israel and the United States promised to hit back hard.\nIran's missile attack and Israel's pledge of retaliation have raised concerns that the oil-producing Middle East could be caught up in a wider conflict.\nWarning that the current situation is “hanging by a thread”, Xinhua cited Mr Fu as saying that any “passive procrastination would be irresponsible, and any rhetoric of condoning further military adventurism would send a wrong message”.\nMr Fu said the spreading Middle East conflict had already caused an unprecedented humanitarian disaster, with Gaza having become a “hell on earth”, and over 1.2 million people displaced in Lebanon.\nChina's Foreign Ministry has urged all parties and especially Israel to immediately cool things down to prevent the situation getting out of control. Beijing has also said it opposes any violation of Lebanon's sovereignty. REUTERS", "url": "https://www.straitstimes.com/asia/china-urges-un-security-council-to-de-escalate-middle-east-crisis"}