{"authors": ["Linda Yulisman"], "date_download": "2024-10-12 13:27:33", "date_modify": "2024-10-12 13:27:33", "date_publish": "2024-10-04 22:00:00", "description": "Green activists see the delay as a blow to slow climate change and biodiversity loss as forests are cleared for planting. Read more at straitstimes.com.", "filename": "asia_se-asia_indonesia-malaysia-applaud-eu-s-move-to-delay-anti-deforestation-law-by-a-year_1728739653.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/04/BUM1083.JPG?VersionId=AnnvmlHNVMBwaVgmoVwc1ScR4zWM5Qbk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_indonesia-malaysia-applaud-eu-s-move-to-delay-anti-deforestation-law-by-a-year_1728739653.html", "title": "Indonesia, Malaysia applaud EU’s proposal to delay anti-deforestation law by a year", "title_page": "Indonesia, Malaysia applaud EU’s proposal to delay anti-deforestation law by a year | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Indonesia and Malaysia, the world’s top palm oil producers, have welcomed the move by the European Union to delay the implementation of its anti-deforestation regulation by a year, even as climate activists deemed it a setback in environmental protection.\nAdopted in 2023, the EU Deforestation Regulation (EUDR) has been lauded as a key milestone to address climate change by requiring exporters of agricultural commodities, including palm oil, and their derivative items to prove they are not produced on deforested land. The regulation was to start on Dec 30, 2024.\nThe proposed one-year extension will give producers and other industry players more time to comply with the bloc’s complex requirements. The proposal would need the approval of the European Parliament and member states, the European Commission said on Oct 2.\nThe new EU policy covers seven key commodities: palm oil, soya, beef, wood, cocoa, coffee and rubber, along with products made from them if derived from recently deforested land anywhere in the world.\nThe issues affecting palm oil will be closely watched globally as the product is, by far, the most consumed and traded edible oil in the world. It is used as cooking oil in many South-east Asian households, and can be found in nearly everything from biscuits and ice cream to lipstick and shampoo. The EU itself uses palm oil primarily for biodiesel production.\nIndonesia is the biggest producer of palm oil in the world, followed by Malaysia, with the two countries accounting for about 85 per cent of the world’s exports. The global palm oil trade is valued at US$63 billion (S$82 billion) to US$70 billion annually, according to data from market research firms.\nThere are around 2.7 million small-scale farmers in Indonesia and 450,000 in Malaysia, who depend on the palm oil industry for their modest livelihoods. At the other end of the scale, top tycoons in the two countries control huge tracts of oil palm plantations.\nIndonesia produced 47 million tonnes of palm oil between 2023 and 2024, while Malaysia had 20 million tonnes, according to the US Department of Agriculture. The third-largest palm oil producer in the world, Thailand, produced just 3.3 million tonnes in the same period.\nEnvironmentalists are up in arms over the possible delay in implementing the new EU rule, seeing it as a blow to efforts to slow down climate change and biodiversity loss from deforestation.\nOn the flipside, the Indonesian Palm Oil Association (Gapki) said that the one-year extension was “reasonable” and would prevent disruption of exports as both producing nations and the EU systems are not ready.\n“If the regulation were to be implemented in December (2024), there will be disruption in exports to the EU. Not only exporters, but importers are also not ready,” Gapki’s board member, Dr Fadhil Hasan, told The Straits Times.\nHe added: “The requirements are too complex, especially for smallholders, and it takes a long time to get prepared.”\nThe Malaysian Palm Oil Council (MPOC), meanwhile, called the delay the “right decision” and echoed Gapki’s view on the lack of readiness on both sides to carry out the new rule.\n“This is a victory for common sense, and a welcome relief for all of those businesses which highlighted the need for a delay,” MPOC chief Belvinder Kaur Sron said in a statement.\n“Malaysia has over the past two years consistently provided evidence to the EU authorities that the implementation date of Dec 30, 2024, was unworkable, and the EU systems were not ready,” she added.\nDr Fadhil expects the EU and palm oil-producing nations to tackle several pending issues during the extension period, such as data protection regarding the required geolocation data.\nThe Indonesian and Malaysian authorities also welcomed the delay.\n“With the one-year delay, they show their goodwill by listening to aspirations from producing countries,” the Deputy Minister for Food and Agribusiness at Indonesia’s Coordinating Ministry for Economic Affairs, Mr Dida Gardera, was quoted as saying by Antara news agency, referring to the 27-member EU bloc.\nMalaysia’s Deputy Minister of Plantation and Commodities, Datuk Chan Foong Hin, said that his government is working on initiatives to build the capacity of its smallholders to comply with the new rule.\n“Malaysia strongly advocates for the EU to recognise our Malaysian Sustainable Palm Oil as one of the standards validating sustainable agricultural requirements under the EUDR regulation,” he added.\nDespite the delay, small-scale farmers still have concerns.", "url": "https://www.straitstimes.com/asia/se-asia/indonesia-malaysia-applaud-eu-s-move-to-delay-anti-deforestation-law-by-a-year"}