{"authors": [], "date_download": "2024-10-12 14:08:03", "date_modify": "2024-10-12 14:08:03", "date_publish": "2024-02-04 16:10:00", "description": "Najib could be released on Aug 23, 2028, if he pays his RM50 million (S$14 million) fine. Read more at straitstimes.com.", "filename": "asia_se-asia_najib-very-very-disappointed-at-not-getting-full-pardon-says-daughter-nooryana_1728742083.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/04/hznajib040224.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_najib-very-very-disappointed-at-not-getting-full-pardon-says-daughter-nooryana_1728742083.html", "title": "Najib ‘very, very disappointed’ at not getting full pardon, says daughter Nooryana", "title_page": "Najib ‘very, very disappointed’ at not getting full pardon, says daughter Nooryana | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA - Malaysia’s former prime minister Najib Razak is “very, very disappointed” at not getting a full pardon, said his daughter Nooryana Najib.\nMs Nooryana – better known as Yana – said this was what her father had told her when she visited him in Sungai Buloh Prison following the Pardons Board’s decision to commute his sentence rather than grant him a full pardon.\nIn an Instagram reel late on Feb 3, Ms Nooryana recounted Najib as saying: “Disappointed, very, very disappointed. You know, Yana, the worst feeling is when you are in shock and there is no one to speak to. You are lost in your thoughts all alone.”\nShe added that he said this while holding a piece of paper that recorded the board’s decision on Feb 2 to halve his corruption jail term from 12 years to six.\nNajib is set to be released on Aug 23, 2028, if he pays his fine, also reduced to RM50 million (S$14 million) from RM210 million.\nHis party Umno said on Feb 3 that it respects the Pardons Board’s decision but will continue to fight until Najib is released from prison.\nMs Nooryana, who is also a committee member of Umno’s women’s wing, said her father had been very hopeful about the outcome of the Pardons Board’s decision five days before the announcement of its conclusion.\nShe said that before the decision was announced, those around Najib had encouraged him to be patient as “it won’t be long”. She added that the disappointment felt by Najib may have been because he did not get a full pardon, and because he may have to spend the next four to five years in jail.\n“His eyes looked tired. Maybe Daddy lacks sleep, pondering the decision which was made yesterday,” she added in her Instagram post. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/najib-very-very-disappointed-at-not-getting-full-pardon-says-daughter-nooryana"}