{"authors": [], "date_download": "2024-10-12 13:34:20", "date_modify": "2024-10-12 13:34:20", "date_publish": "2024-09-12 18:11:00", "description": "Former governor Joel Reyes surrendered after more than a year in hiding. Read more at straitstimes.com.", "filename": "asia_se-asia_philippine-ex-governor-accused-of-activist-s-killing-surrenders_1728740060.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/x_0.jpg?VersionId=ThFqToyTMJM8SsBKvmvM1ynQAWcVvpH0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_philippine-ex-governor-accused-of-activist-s-killing-surrenders_1728740060.html", "title": "Philippine ex-governor accused of masterminding activist’s murder surrenders", "title_page": "Philippine ex-governor accused of masterminding activist’s murder surrenders | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA - A former Philippine provincial governor accused of masterminding the 2011 murder of an environmental activist and radio show host has surrendered after more than a year in hiding, a government official said on Sept 12.\nIn the 13 years since Dr Gerry Ortega was shot dead on the tropical island of Palawan, the region’s former governor Joel Reyes, accused of ordering the hit, has remained mostly free due to legal twists and a three-year escape to Thailand.\nState prosecutors allege that the 72-year-old Reyes ordered Dr Ortega’s shooting, which stands out for its brazenness in a country where hundreds of Filipino journalists and environmental defenders have been murdered.\nAfter a court ordered his arrest in 2023, Reyes again went into hiding but resurfaced, unknown to the authorities, after checking into a Manila hospital, the head of the president’s media security task force told AFP.\nReyes later had his lawyers write to the National Bureau of Investigation “that he really wants to surrender”, task force chief Paul Gutierrez said.\n“Based on his medical certificate, it appears that he is suffering from many... health complications,” he said without giving details.\nDr Ortega had just finished his morning radio show where he frequently criticised politicians, including Reyes, when he was shot in the back of the head at a second-hand clothes shop in the provincial capital Puerto Princesa.\nPolice arrested Dr Ortega’s killer and the gun used was traced to a close aide of Reyes, while a bodyguard who hired the assassin later implicated his boss.\nReyes, who has always denied involvement in the murder, was charged in 2012 along with a younger brother.\nThe siblings soon fled to Thailand, but were deported back to the Philippines in 2015.\nThe brothers were freed in 2018 after a court voided the case against them, but the charges were reinstated nearly two years later.\nIn March 2023, the Supreme Court told a Lower Court in Palawan to order the former governor’s arrest.\nThe younger brother is out on bail, according to Mr Gutierrez.\n“This certainly boosts the government’s campaign to create a safe environment for the media,” Mr Gutierrez said.\n“At the same time, this gives hope to the family of Ortega that the wheels of justice are turning”.\nMrs Patty Ortega, the journalist’s widow, welcomed the defendant’s surrender but expects a long courtroom battle ahead.\n“I am expecting that the hearing will proceed because I think this is going to be a long process, maybe another 10 years,” she told AFP.\n“But we will keep on fighting until the end. I’ll just keep praying to God. There is only so much you can do.” AFP", "url": "https://www.straitstimes.com/asia/se-asia/philippine-ex-governor-accused-of-activist-s-killing-surrenders"}