{"authors": [], "date_download": "2024-10-12 13:33:36", "date_modify": "2024-10-12 13:33:36", "date_publish": "2024-04-14 10:00:00", "description": "The man had allegedly intended to shoot his wife, but shot her bodyguard instead. Read more at straitstimes.com.", "filename": "asia_se-asia_shots-fired-at-kuala-lumpur-airport-one-injured_1728740016.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/14/tc-fdklia14.jpg?VersionId=LijgpqZtVbBmSmKJJFDerTPN2FQgSF6V", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_shots-fired-at-kuala-lumpur-airport-one-injured_1728740016.html", "title": "Malaysia beefs up security at border with Thailand as KL airport shooting suspect may have fled north", "title_page": "Malaysia beefs up security at border with Thailand as KL airport shooting suspect may have fled north | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEPANG - The suspect in a murder attempt at Kuala Lumpur International Airport Terminal 1 (KLIA 1) on April 14 that left a bodyguard severely injured is now on the loose, armed and dangerous, Malaysian police have said.\nEarlier, Selangor police chief Commissioner Hussein Omar Khan said in a statement that a shooting occurred on April 14 at around 1.30am in the KLIA 1 arrival hall.\n“During the incident, a man fired two shots. One of them hit the victim, who works as a personal bodyguard,” he said.\nThe suspect fled the scene. Follow-up investigations showed that he had intended to shoot his wife, who runs a travel agency.\nShe was at the airport to receive Muslim pilgrims returning from Mecca.\nHer bodyguard was shot in the stomach and severely injured.\n“This incident is unrelated to terrorist activities or groups and originated from a personal issue. The situation at KLIA is secure and under control,” Datuk Hussein added.\nBukit Aman Criminal Investigation Department director Commissioner Mohd Shuhaily Mohd Zain told a press conference at KLIA on April 14 that the police were seeking a suspect named Hafizul Harawi, 38.\nMr Hafizul has also been identified as the husband and business partner of the intended victim. The suspect and his wife were in the midst of a divorce, the police added.\n“The police have classified the suspect as armed and dangerous. Anyone who spots him is urged to share the information with the police but not to act alone,” Datuk Seri Shuhaily said.\nHe advised the public to keep their distance and call the police immediately if they see the suspect.\nMr Shuhaily said that according to records, the suspect has had reports lodged against him since 2016.\nHe added that the wife had made two reports for criminal intimidation, the latest in December 2023.\n“Based on that report, the suspect was arrested and we had submitted the investigation paper (to the deputy public prosecutor), but we were then given additional instructions.\n“Because of that incident, the (target of April 14’s shooting) hired bodyguards,” he told reporters.\nMr Shuhaily said the police had also previously investigated the suspect for theft and impersonating a public officer.\nThe suspect’s wife, who goes by the username Farah Cie, confirmed in a Facebook post that her bodyguard had been shot. She added that she had filed a police report.\nThe victim’s wife said she was shocked to learn of the news, reported Malaysian newspaper New Straits Times.\n“I am shocked and didn’t expect something like this to happen in the month of Syawal,” said the wife who wanted to be identified only as Siti Noraida, 28. Syawal is the 10th month of the Islamic calendar and a symbolic time of renewal for Muslims.\nAfter being informed of the incident at about 2am, she went to Cyberjaya Hospital to see her husband who was undergoing treatment, she added.\n“The hospital informed me that my husband’s condition is critical and he needs to be put into a medically induced coma.\n“I was also told that there was severe bleeding, and when I arrived at the hospital, he was having difficulty breathing but no vital organs were affected by the gunshot,” she told news agency Bernama.\nThe mother of three hopes the authorities will succeed in locating the suspect so he can be brought to justice.\nWhen asked if the incident would cause fear among travellers, Mr Shuhaily said: “It is a clear-cut incident with a specific target or personal vendetta.\n“Other than that, travellers should not be worried about safety at the airport.\n“Nonetheless, we will sit down and review the safety measures arrangement at the airport.”\nHe added that the intended victim, who is pregnant, is currently having her statement taken by the police.\nWhen asked if there was a need for police escorts following the incident, Mr Shuhaily said: “We will scrutinise it and just like any other case, she is free to move (about).”\nThe case is being investigated as an attempted murder.\nPolice in the northern state of Perlis have tightened surveillance along the border with Thailand as the suspect is believed to have fled north after the shooting. THE STAR/ASIA NEWS NETWORK, AFP", "url": "https://www.straitstimes.com/asia/se-asia/shots-fired-at-kuala-lumpur-airport-one-injured"}