{"authors": [], "date_download": "2024-10-12 13:54:34", "date_modify": "2024-10-12 13:54:34", "date_publish": "2024-02-05 07:03:50", "description": "Leqembi works by removing a toxic protein called beta amyloid from the brain. Read more at straitstimes.com.", "filename": "asia_eisai-expects-1500-alzheimers-patients-in-china-launch-sees-huge-growth_1728741274.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/05/LYNXMPEK130AE-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_eisai-expects-1500-alzheimers-patients-in-china-launch-sees-huge-growth_1728741274.html", "title": "Ground-breaking drug to be given to 1,500 Alzheimer’s patients in China", "title_page": "Ground-breaking drug to be given to 1,500 Alzheimer’s patients in China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CHICAGO/SHANGHAI - Japan’s Eisai aims to roll out its ground-breaking Alzheimer’s drug Leqembi to 1,500 people in China later in 2024, but expects growth to accelerate significantly in 2025 as diagnosis methods change, a company spokesperson told Reuters.\nMore convenient Alzheimer’s blood tests expected to be ready then could help Eisai reach a bigger share of the estimated 17 million people who have the early stages of the disease in China, the spokesperson said.\n“China is one of the fastest-ageing countries in the world and is one of the most important countries in the area of Alzheimer’s disease for Eisai,” a company spokesperson said. “The potential growth for Leqembi in China is huge.”\nEli Lilly, which is developing a similar treatment called donanemab, told Reuters it has filed for approval in China. The Indianapolis-based company is now testing its drug in a 1,500-person trial with volunteers in China, Taiwan, South Korea and the European Union, a spokesperson said.\nThe size of Eisai’s planned China roll-out and the filing of Eli Lilly’s approval application have not previously been reported.\nLeqembi, which works by removing a toxic protein called beta amyloid from the brain, is the first Alzheimer’s treatment proven to alter the course of the fatal, brain-wasting disease. China approved Leqembi in January.\nEisai and US partner Biogen have already rolled out Leqembi in the United States and Japan, and it is under review in Europe.\nThe treatment, given by infusion twice a month, slowed progression of the disease by 27 per cent for patients in the earliest stages of Alzheimer’s in a clinical trial.\nCurrent treatments available in China have limited effect, and Eisai’s trial results give patients “a lot of hope”, said Alzheimer’s expert Dr Liu Zhou of Guangdong Medical University.\nEisai said it expects to start using the drug in China by September, and forecast a total of 1,500 patients there by March 2025, a number limited by the country’s diagnostic capabilities.\nLeqembi’s sales could “increase significantly” in 2025, the company said, with the expected introduction of blood tests to assess a patient’s amyloid burden rather than PET scans or invasive lumbar punctures, which require access to specialists.\n“If treatment were to become possible based solely on blood tests, we think it would generate significant interest,” Citi analyst Hidemaru Yamaguchi said in a research note. He did not have an estimate for China but expects Leqembi sales outside of Japan and the US to peak in 2030 at 126 billion yen (S$1.1 billion).\nRates of Alzheimer’s diagnosis and treatment in Asia’s biggest economy remain low, and medical specialists and public awareness of the disease is limited, according to The China Alzheimer Report 2022, published in the BMJ General Psychiatry journal.\nChina’s Health Ministry did not respond to a request for comment by the time of publication.\nExperts said the country has been ramping up imaging capacity.\nSiemens Healthineers, which sells imaging equipment in China, said the market in China for molecular imaging has grown more than 45 per cent over the past four years.\n‘Ill prepared’\nEisai plans to launch Leqembi on China’s private market, where it is priced at about 200,000 yuan (S$37,000) a year, about US$2,000 more than in the US.\nEisai said it will decide whether to seek government coverage after it assesses private market demand.\nInclusion on China’s National Reimbursement Drug List typically means a steep price cut. A 2023 analysis estimated the average negotiated price cut ranged from 44 per cent to 61 per cent.\nTo be eligible for treatment, patients undergo cognitive testing, genetic testing to assess whether they carry a gene that increases the drug’s adverse side effects, and testing to confirm abnormal levels of amyloid, the sticky substance in the brain targeted by Leqembi.\nOnce on treatment, suitable patients undergo a series of MRI scans to monitor for potentially fatal swelling and bleeding in the brain.\nEconomist Soeren Mattke, director of the University of Southern California Brain Health Observatory who has consulted for both Eisai and Biogen, said China lacks a system of primary care physicians to do preliminary testing and refer appropriate candidates to specialists.\nDr Mattke and colleagues published an assessment of China’s readiness for disease-modifying treatments in July in the Journal Alzheimer’s Dementia that concluded that China is “ill-prepared to provide timely access to an Alzheimer’s treatment”.\n“In China,” he said, “speciality care is almost absent in the rural areas.” REUTERS", "url": "https://www.straitstimes.com/asia/eisai-expects-1500-alzheimers-patients-in-china-launch-sees-huge-growth"}