{"authors": [], "date_download": "2024-10-12 14:11:47", "date_modify": "2024-10-12 14:11:47", "date_publish": "2023-11-04 17:30:00", "description": "Mr Zhang Hongli is the latest in a string of finance officials to come under scrutiny over corruption allegations. Read more at straitstimes.com.", "filename": "asia_east-asia_china-investigates-former-top-bank-official-for-suspected-corruption_1728742307.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/04/2023-09-26T081120Z1777209249RC27G3AFT4JCRTRMADP3UBS-ICBC-MOU-CHINA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_china-investigates-former-top-bank-official-for-suspected-corruption_1728742307.html", "title": "China investigates former top bank official for suspected corruption", "title_page": "China investigates former top bank official for suspected corruption | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – A top official at one of China’s biggest state-owned banks is under investigation for suspected corruption, the ruling Communist Party announced on Saturday.\nThe party’s top anti-corruption watchdog said Mr Zhang Hongli was “suspected of serious disciplinary and legal violations”, an official byword for alleged graft.\nMr Zhang previously served as the vice-chief of the Industrial and Commercial Bank of China (ICBC), one of the world’s largest banks.\nChina’s President Xi Jinping has waged a sweeping campaign on deep-seated official corruption since coming to power a decade ago.\nProponents say the policy promotes clean governance, while critics say it helps Mr Xi purge political rivals.\nMr Zhang is the latest in a string of finance officials to come under official scrutiny recently over corruption allegations.\nChina’s top prosecutor in October formally arrested former Bank of China chairman Liu Lian’ge following a months-long graft probe.\nLi Xiaopeng, the one-time boss of state-owned banking giant Everbright Group, was also arrested on charges of taking bribes.\nMr Xi chaired a rare financial meeting this week aimed at “guarding against and resolving risks” in the sector, state media reported.\nThe National Financial Work Conference also stressed the need to “strengthen financial supervision... (and) promote finance with Chinese characteristics”.\nChina has charted an uncertain recovery from the Covid-19 pandemic as weak consumption and a slow-motion housing crisis weigh on growth. AFP", "url": "https://www.straitstimes.com/asia/east-asia/china-investigates-former-top-bank-official-for-suspected-corruption"}