{"authors": [], "date_download": "2024-10-12 13:36:46", "date_modify": "2024-10-12 13:36:46", "date_publish": "2024-08-07 23:02:21", "description": "The mastermind is a man living in the US whom she met through a dating app. Read more at straitstimes.com.", "filename": "asia_se-asia_vietnamese-woman-sentenced-to-9-years-for-kidnapping-two-underaged-girls-to-film-pornography_1728740206.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/07/366841Pham20Huynh20Nhat20Vi.jpeg?VersionId=8vB9cN0_eppHqPseDNl9CO8e2lR9poED", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_vietnamese-woman-sentenced-to-9-years-for-kidnapping-two-underaged-girls-to-film-pornography_1728740206.html", "title": "Vietnamese woman sentenced to 9 years for kidnapping 2 underage girls to film pornography", "title_page": "Vietnamese woman sentenced to 9 years for kidnapping 2 underage girls to film pornography | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HO CHI MINH CITY — A 21-year-old Vietnamese woman has been sentenced to nine years in prison for kidnapping two young girls, aged three and seven, for pornographic filming for money.\nThe Family and Juvenile Court of Ho Chi Minh City People’s Court on Aug 7 sentenced Phạm Huynh Nhat Vi to three years and six months for abusing individuals under 16 for pornographic purposes, and five years and six months for their abduction.\nIn addition, the woman from the Cuu Long (Mekong) Delta province of Tien Giang was ordered to pay 80 million dong (S$4,200) in compensation to the victims.\nThe trial was held privately to protect the victims’ identities.\nThe court found that Vi, who met a foreign man named Richard through a dating app back in October 2023, was persuaded by him to lure girls aged six to 12 for pornographic filming for money.\nAfter receiving US$500 (S$660) from the man in early April, Vi enticed the minors with money and food, right at the popular pedestrian street of Nguyen Hue in Ho Chi Minh City, ultimately leading them to an apartment rented by Richard where she recorded 12 pornographic videos for him over several days.\nThe police rescued the girls on April 9.\nRichard, who remains unidentified and resides in the US, has been identified as the mastermind of the operation.\nThe Ho Chi Minh City Police have requested judicial assistance from the US Department of Justice for further investigation.\nThe two girls are currently in safe and stable condition, according to the local authorities. VIET NAM NEWS/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/se-asia/vietnamese-woman-sentenced-to-9-years-for-kidnapping-two-underaged-girls-to-film-pornography"}