{"authors": ["Chin Hui Shan"], "date_download": "2024-10-12 14:22:04", "date_modify": "2024-10-12 14:22:04", "date_publish": "2024-05-18 08:35:00", "description": "This is to facilitate Johor Bahru-Singapore Rapid Transit System Link works. Read more at straitstimes.com.", "filename": "asia_se-asia_intermittent-motorcycle-lane-closure-on-johor-causeway-from-may-19-to-june-5_1728742924.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/18/202403281056270661000083609.jpg?VersionId=sNdWU0bSiWt9gbsntWvtoT0sTUY7tXw7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_intermittent-motorcycle-lane-closure-on-johor-causeway-from-may-19-to-june-5_1728742924.html", "title": "Johor Causeway’s motorcycle lane to close intermittently from May 19 to June 5", "title_page": "Johor Causeway’s motorcycle lane to close intermittently from May 19 to June 5 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The motorcycle lane on the Johor Causeway will undergo intermittent closures from May 19 to June 5.\nThis is to facilitate Johor Bahru-Singapore Rapid Transit System (RTS) Link works, according to Malaysia’s Mass Rapid Transit Corporation (MRT Corp).\nThe lane closure will take place from May 19 to 20, as well as May 24 to June 5 excluding the weekends.\nThe works will be carried out from 8pm to 3am in Woodlands on the Singapore-bound lane, and from 10pm to 5am in Johor Bahru on the Malaysia-bound lane.\nIn a Facebook post on May 17, MRT Corp said this is to facilitate bracket installation, bracket dismantling and other RTS Link project-related works.\nFor the bracket installation works in Johor Bahru on the Malaysia-bound lane, the motorcycle lane will be closed for about 200m and motorists will be diverted to the right. Vehicles on other lanes will also be diverted to the middle and right lanes to continue their journey towards Johor Bahru.\nFor the bracket dismantling works in Woodlands on the Singapore-bound lane, the motorcycle lane will be closed for about 200m and motorists will be diverted to the right. Vehicles on other lanes will also be diverted to the middle and right lanes to continue going towards Woodlands.\nRoad users are advised to follow traffic signs and the direction of the traffic controller during these lane closures.\nIt was reported in January that about two-thirds of civil infrastructure works on the Singapore side of the RTS Link have been completed, with passenger service slated to start by December 2026. On the Malaysian side, the project has reached 65 per cent completion as at Dec 31, 2023.", "url": "https://www.straitstimes.com/asia/se-asia/intermittent-motorcycle-lane-closure-on-johor-causeway-from-may-19-to-june-5"}