{"authors": [], "date_download": "2024-10-12 13:39:00", "date_modify": "2024-10-12 13:39:00", "date_publish": "2023-12-06 04:08:52", "description": "Nobel Peace Prize winner Malala Yousafzai on Tuesday likened restrictions the Taliban has placed on women in Afghanistan to the treatment of Black people under apartheid in a lecture in South Africa organised by Nelson Mandela's foundation. Read more at straitstimes.com.", "filename": "asia_malala-yousafzai-likens-talibans-treatment-of-women-to-apartheid-in-mandela-lecture_1728740340.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/06/LYNXMPEJB40SK-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_malala-yousafzai-likens-talibans-treatment-of-women-to-apartheid-in-mandela-lecture_1728740340.html", "title": "Malala Yousafzai likens Taliban's treatment of women to apartheid in Mandela lecture", "title_page": "Malala Yousafzai likens Taliban's treatment of women to apartheid in Mandela lecture | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JOHANNESBURG - Nobel Peace Prize winner Malala Yousafzai on Tuesday likened restrictions the Taliban has placed on women in Afghanistan to the treatment of Black people under apartheid in a lecture in South Africa organised by Nelson Mandela's foundation.\nYousafzai survived being shot in the head when she was 15 in her native Pakistan by a gunman after campaigning against the Pakistani Taliban's moves to deny girls education.\nSince winning the Nobel Peace Prize in 2014, Yousafzai, now 26, has become a global symbol of the resilience of women in the face of repression.\n\"If you are a girl in Afghanistan, the Taliban has decided your future for you. You cannot attend a secondary school or university. You cannot find an open library where you can read. You see your mothers and your older sisters confined and constrained,\" Yousafzai said during the 21st Nelson Mandela Annual Lecture in Johannesburg.\nYousafzai said the Taliban's actions should be considered \"gender apartheid\" and that it had \"in effect ... made girlhood illegal\".\nShe said international actors should not normalise relations with the Taliban, which returned to power in Afghanistan in 2021 as U.S.-led forces withdrew after 20 years of war.\nA Taliban spokesperson did not immediately respond to a request for comment on Yousafzai's remarks.\nSince returning to power, the Taliban has also stopped most Afghan female staff from working at aid agencies, closed beauty salons, barred women from parks and curtailed travel for women in the absence of a male guardian.\nThe Taliban say they respect women's rights in line with their interpretation of Islamic law and Afghan custom and that officials are working on plans to open girls' high schools, but after over 18 months they have not provided a timeframe.\nIn an interview after her lecture, Yousafzai said she was concerned the Taliban would take away sciences and critical thinking even from boys.\n\"It's so important for the international community to not only step up to protect access to education for girls but also ensure that it is quality education, it is not indoctrination,\" she said.\nReferring to the war in Gaza, she said she wanted to see an immediate ceasefire and for children to be able return to school and their normal lives.\nShe added: \"We look at wars, ... especially the bombardment that has happened in Gaza, ... that has just taken that normal life away from children.\" REUTERS", "url": "https://www.straitstimes.com/asia/malala-yousafzai-likens-talibans-treatment-of-women-to-apartheid-in-mandela-lecture"}