{"authors": [], "date_download": "2024-10-12 14:01:43", "date_modify": "2024-10-12 14:01:43", "date_publish": "2024-04-20 00:46:04", "description": "A procedural vote passed 316-94, with more support from Democrats than Republicans. Read more at straitstimes.com.", "filename": "asia_us-house-advances-95-billion-ukraine-israel-package-toward-saturday-vote_1728741703.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/20/US-HOUSE-SPEAKER-MIKE-JOHNSON-CONTINUES-PLAN-TO-VOTE-ON-FOREIGN-150948.jpg?VersionId=1sxlYJ_jPLnJLXmNLBAmGZIw28RvONWa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_us-house-advances-95-billion-ukraine-israel-package-toward-saturday-vote_1728741703.html", "title": "US House advances $129b Ukraine-Israel package towards vote", "title_page": "US House advances $129b Ukraine-Israel package towards vote | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – The US House of Representatives advanced a US$95 billion (S$129 billion) legislative package on April 19 providing aid to Ukraine, Israel and the Indo-Pacific in a broad bipartisan vote, overcoming hardline Republican opposition that had held it up for months.\nA procedural vote on April 19 – which passed 316-94, with more support from Democrats than the Republicans, who hold a narrow majority – advanced a package similar to a measure that passed the Democratic-majority Senate in February.\nDemocratic President Joe Biden, Democratic Senate Majority Leader Chuck Schumer, top Senate Republican Mitch McConnell and top House Democrat Hakeem Jeffries had been pushing for a House vote since then. Republican House Speaker Mike Johnson had held off in the face of opposition from a small but vocal segment of his party.\nIn addition to the aid for allies, the package includes a provision to transfer frozen Russian assets to Ukraine, and sanctions targeting Hamas and Iran, and to force China’s ByteDance to sell social media platform TikTok or face a ban in the US.\nThe legislation provides more than US$95 billion in security assistance, including US$9.1 billion for humanitarian aid, which Democrats had demanded.\nIf the House passes the measure, as expected, the Senate will need to follow suit to send it to Mr Biden to sign into law.\nMr Schumer on April 19 told senators to be prepared to come back at the weekend if needed.\nSome conservative lawmakers oppose aid to Ukraine, and Republican presidential candidate Donald Trump has sent mixed messages about it.\nSome Democrats also oppose certain provisions in the Bill, notably on Israel aid, and had pushed for more conditions on that assistance. REUTERS", "url": "https://www.straitstimes.com/asia/us-house-advances-95-billion-ukraine-israel-package-toward-saturday-vote"}