{"authors": [], "date_download": "2024-10-12 13:36:50", "date_modify": "2024-10-12 13:36:50", "date_publish": "2023-10-11 12:55:00", "description": "In 2022 fewer than 4,000 people joined up, undershooting the target by more than half. Read more at straitstimes.com.", "filename": "asia_east-asia_not-proud-at-all-japans-army-struggles-to-recruit_1728740210.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/11/FILES-JAPAN-ARMY-RECRUITMENT-020211.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_not-proud-at-all-japans-army-struggles-to-recruit_1728740210.html", "title": "‘Not proud at all’: Japan’s army struggles to recruit", "title_page": "‘Not proud at all’: Japan’s army struggles to recruit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - A recent open day at a Japanese military base near Tokyo was a fun family outing but, despite the games and snacks, the army recruitment stand was bereft of visitors.\n“This is the reality. The festival is always packed but no one comes,” confessed one of the two soldiers on duty.\nUnwanted leaflets were lying on a table next to a green armoured vehicle.\nJapan has massively upped its defence spending in recent years, alarmed by China’s growing assertiveness in the region and the frequency of North Korea’s missile tests.\nBut a report by a panel of experts in July highlighted an “extremely high” risk that the armed forces would be weakened because of a lack of personnel.\nAlthough numbers fluctuate from year to year, since 1990 the strength of the Self-Defence Forces, as Japan’s military is known, has fallen by more than 7 per cent to under 230,000.\nIn 2022, fewer than 4,000 people joined up, undershooting the target by more than half. The last time its objective was met was in 2013.\n‘Ashamed’\nMany advanced economies are having problems recruiting enough people, with the situation particularly acute in Japan, where one in 10 people is 80 or over.\nBut according to current and former soldiers, it is not just demographics that is to blame.\n“I was ashamed to say that I was in the Self-Defence Forces. It didn’t make me proud at all,” said Mr Yuichi Kimura, 45, a former parachutist who now runs a firm helping former soldiers get civilian jobs.\nMorale is low, he said, due to poor pay and a lack of ambition on the part of the armed forces, whose role since World War II has been exclusively defensive, in line with Japan’s pacifist Constitution.\nMany join up hoping to help during natural disasters, but are dismayed to find themselves doing military tasks.\n“Most soldiers weren’t thinking at all about national defence (when they joined),” said Mr Kohei Kondo, 25, a former sergeant.\nJapan’s Defence Ministry insists it recruits only suitable candidates but, according to media reports, standards have fallen, including when it comes to psychological tests.\nIn June, two people were killed by a new recruit in a shooting incident at a military firing range.\nJapan “recruits just about anybody because no one expects an actual armed conflict”, said Mr Kimura, the former paratrooper.\nSexual harassment\nIn an effort to halt the decline, in 2018 Japan increased the maximum age for new soldiers to 32 from 26.\nAnother solution, the July report said, is to use more unmanned vehicles in the air, on sea and on land.\nThe army is even reportedly considering allowing recruits with tattoos – markings traditionally associated with yakuza gangsters.\nJapan also aims to increase the proportion of women by 2030 to 13 per cent, from 9 per cent at present.\nFeaturing photos of smiling servicewomen, the Defence Ministry website promises “an environment adapted to women”.\nBut according to professor of military sociology and gender sociology Fumika Sato from Hitotsubashi University, there is a considerable gap with the “reality on the ground”.\nThe army is “an environment conducive to harassment and sexual violence”, she said.\nThe army has been roiled for the past year by a series of damaging revelations of sexual assault within its ranks.\nIt started when former soldier Rina Gonoi went public with explosive allegations of abuse that drew major attention.", "url": "https://www.straitstimes.com/asia/east-asia/not-proud-at-all-japans-army-struggles-to-recruit"}