{"authors": [], "date_download": "2024-10-12 13:36:52", "date_modify": "2024-10-12 13:36:52", "date_publish": "2024-09-24 11:03:21", "description": "HONG KONG - China's Foreign Minister Wang Yi told Lebanese Foreign Minister Abdallah Bou Habib on Monday that China firmly supported Lebanon in safeguarding its sovereignty and security and strongly condemned violations after Israel's large scale airstrike. Read more at straitstimes.com.", "filename": "asia_china-firmly-supports-lebanon-in-safeguarding-its-security_1728740212.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/LYNXMPEK8N02I-1.jpg?VersionId=jMMYudwlUgTRw8l.MR.CglWTM6ckRDkp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-firmly-supports-lebanon-in-safeguarding-its-security_1728740212.html", "title": "China 'firmly supports' Lebanon in safeguarding its security", "title_page": "China 'firmly supports' Lebanon in safeguarding its security | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - China's Foreign Minister Wang Yi told Lebanese Foreign Minister Abdallah Bou Habib on Monday that China firmly supported Lebanon in safeguarding its sovereignty and security and strongly condemned violations after Israel's large scale airstrike.\nWang and Habib met in New York where they exchanged views on the situation in the Middle East, according to a statement from China's Foreign Ministry.\nIsrael's military said it launched airstrikes against Hezbollah sites in Lebanon on Monday, which Lebanese authorities said had killed 492 people and sent tens of thousands fleeing for safety in the country's deadliest day in decades.\nWang said no matter how the situation changes, China would continue to stand on the \"side of justice and on the side of Arab brothers, including Lebanon\".\n\"We pay close attention to the development of the regional situation, especially the recent explosion of communication equipment in Lebanon, and firmly oppose indiscriminate attacks on civilians,\" Wang said, according to the statement.\nChina has been working for peace in the Middle East and will continue to work with Arab countries and the international community, he said.\nFighting violence with violence will not solve problems in the Middle East but will cause greater humanitarian disasters, Wang said, according to the statement.\nThe international community should form a clearer position, and regional countries should unite, \"with the current situation a manifestation of the spillover of the Gaza conflict\".\nChina's position is for a permanent ceasefire and the full withdrawal of troops to effectively implement a two-state solution, Wang said. REUTERS", "url": "https://www.straitstimes.com/asia/china-firmly-supports-lebanon-in-safeguarding-its-security"}