{"authors": [], "date_download": "2024-10-12 13:27:12", "date_modify": "2024-10-12 13:27:12", "date_publish": "2024-04-17 19:29:00", "description": "He claims to have seen the order on the phone of another minister. Read more at straitstimes.com.", "filename": "asia_se-asia_malaysia-s-deputy-pm-zahid-claims-seeing-royal-order-to-move-najib-to-house-arrest_1728739632.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/17/FW1350341PTJ0802012024TPMBENCANA.JPG?VersionId=Jn0qZX8opFPxedZt6asyqV4BHq8QJ6dh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_malaysia-s-deputy-pm-zahid-claims-seeing-royal-order-to-move-najib-to-house-arrest_1728739632.html", "title": "Malaysia’s DPM Zahid claims seeing royal order to move Najib to house arrest", "title_page": "Malaysia’s DPM Zahid claims seeing royal order to move Najib to house arrest | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Malaysia’s Deputy Prime Minister Zahid Hamidi said he saw an order for former prime minister Najib Razak to serve the remainder of his 1MDB-linked jail sentence under house arrest, backing the latter’s claims in a judicial review.\nDatuk Seri Zahid, president of the United Malays National Organisation (Umno) that Najib once led, said in an affidavit that he saw a copy of a royal order from Malaysia’s previous king on Jan 30, allowing the former leader to go under house arrest, according to a court filing.\nMr Zahid said he saw the copy on the phone of former Selangor Umno treasurer Tengku Zafrul Tengku Abdul Aziz.\n“The contents of the addendum order expressly stated that the applicant (Najib) be allowed to serve the reduced sentence of his imprisonment under condition of house arrest, instead of the current prison confinement in the Kajang Prison,” said Mr Zahid.\nHe added that Pahang Menteri Besar Wan Rosdy Wan Ismail also saw the copy from Datuk Seri Zafrul’s phone.\nIn response, Mr Zafrul, the current investment, trade and industry minister, said he was consulting his lawyers and considering filing an affidavit to correct purported factual errors in Mr Zahid’s affidavit.\n“I take no position in so far as the merits of the ongoing dispute are concerned, but I merely wish to ensure that the factual record is properly reflected and recorded so that all parties and, in particular the High Court, is properly appraised of all material facts,” he said in a statement on April 17.\n“This will ultimately allow for a just and fair decision to be made in the interest of all parties concerned,” he said.\nCommunications Minister Fahmi Fadzil, the unity government’s spokesman, said the Cabinet did not discuss Mr Zahid’s affidavit.\nNajib filed a judicial review earlier in April on the matter, saying the order had not been made public. The former premier was imprisoned in 2022 on abuse of power and money-laundering charges in relation to 1MDB, a troubled state fund.\nThe court will decide whether to hear Najib’s request on June 5, his lawyer Muhammad Shafee Abdullah told reporters on April 17. Its decision is set to draw more scrutiny to Prime Minister Anwar Ibrahim’s commitment to fight graft.\nThe royal leniency granted to Najib earlier in 2024 sparked a backlash against Datuk Seri Anwar, who rose to power in November 2022 on an anti-corruption platform. His government, which counts Umno as a key ally, has already withdrawn 47 criminal charges against Mr Zahid.\nReducing sentence\nAt a Pardons Board meeting on Jan 29, Sultan Abdullah Ahmad Shah decided to halve Najib’s jail term to six years and reduced his 1MDB-related fines to RM50 million (S$14 million). It was one of the last acts by the royal ruler, who ended his five-year reign under Malaysia’s rotational monarchy on Jan 30.\nPardons are granted at the sole discretion of the king, with advice from a board of government officials and appointees.\nNajib, in his latest application, requested that the court compel the government to verify the existence of the king’s supplementary order and, upon confirmation, execute it so that he may be moved to his residence in Kuala Lumpur.\nMr Shafee told reporters outside the courtroom on April 17 that they also received affidavits from other witnesses in their favour, but were unable to file them in time.\nNajib, who lost power about six years ago, was accused of transferring RM42 million from 1MDB subsidiary SRC International to his personal account between 2014 and 2015.\nHe remains widely popular in Malaysia but still faces trials for dozens of other criminal charges related to the wealth fund, which became the centre of a multibillion dollar scandal that spawned probes across the world. BLOOMBERG", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-s-deputy-pm-zahid-claims-seeing-royal-order-to-move-najib-to-house-arrest"}