{"authors": [], "date_download": "2024-10-12 13:28:07", "date_modify": "2024-10-12 13:28:07", "date_publish": "2023-10-01 12:00:00", "description": "Malaysia’s top growers’ group is already seeking tax breaks and grants to accelerate replanting. Read more at straitstimes.com.", "filename": "asia_se-asia_aging-trees-show-a-crisis-looms-for-the-world-s-everything-oil_1728739687.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/01/2023-09-28T065827Z761385705RC2RUT98KX8TRTRMADP3PALMOIL-MALAYSIA-OUTPUT.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_aging-trees-show-a-crisis-looms-for-the-world-s-everything-oil_1728739687.html", "title": "Ageing trees show a crisis looms for the world’s everything oil", "title_page": "Ageing trees show a crisis looms for the world’s everything oil | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Across swathes of South-east Asia, maturing oil palm trees, some as tall as a 12-storey building, are turning into a multibillion-dollar headache for local farmers, regional governments and consumers everywhere.\nAs oil palms approach their commercial lifespan of a quarter-century, they provide less of the versatile edible oil, used in everything from ice cream to cosmetics and fuel.\nSome plants become too ungainly to tackle for labourers, who rely on hand-held sickles attached to long poles. New palms, however, take several years to yield fruit in commercial quantities.\nIn palm-producing regions of Malaysia and Indonesia, where the Covid-19 pandemic led to a critical shortage of the manual labour on which the industry depends, an army of farmers has been postponing the inevitable.\nSqueezed by high costs and falling yields, many smallholders argue they cannot replant – and have no choice but to keep going.\nThe result is a significant delay to plantation renewal that will dent harvests in coming years, constraining exports from two countries that account for 85 per cent of global production, which in turn may reduce profits for cultivators while pushing up global prices.\nOil World, a market researcher, warned in September of the consequences of an “alarming decline” in average yields due to slow replanting. Annual output growth may fall to 1.8 million tonnes or less in the 10 years to 2030, from an average of 2.9 million tonnes in the decade to 2020, the Hamburg-based outfit estimated.\nThe El Nino weather phenomenon would not help, and in the year ending September 2024, the annual output increase could be the smallest amount in four years.\n“The concern is that the cost of production will become uncompetitive,” said Ms Ivy Ng, head of plantations research at CIMB Investment Bank in Kuala Lumpur. “The cost is going up, labour cost is going up, everything is going up – and yet your yield is falling because you didn’t replant.”\nHigher prices could also mean demand destruction, nudging large commercial buyers and households towards what are normally more expensive alternatives, like soya beans and rapeseed, especially in price-sensitive markets like India.\n“In the past, palm was growing very fast and the advantage was the low cost,” Ms Ng said. “But now you’re no longer low cost and then you’re still selling to the same market. So the question here is will the buyers be able to afford it? Can you pass on the cost?”\nFor governments, it may well add up to a multi-billion financial aid bill. Small farmers underpin the industry, accounting for roughly two-fifths of the planted area in Malaysia and Indonesia, and they form an important voting bloc.\nMalaysia’s top growers’ group is already seeking tax breaks and grants in the nation’s budget in October in order to accelerate replanting – going well beyond an existing loan scheme.\nOil palms start bearing fruit at three years old, with yields increasing annually and peaking between nine and 18 years. After that, the volume of fruit starts to decline, and by around 25 years, trees are typically uprooted and replaced.\nBut the pandemic’s labour upheaval and temptingly high palm prices in 2022 – touching a record – have thrown off that schedule.\nThe Malaysian Palm Oil Association estimates 664,000ha, or about 12 per cent of the nation’s planted area, consists of trees aged 25 years and above. It has warned that over a third of the planted area could be classified as old by 2027. The average cost to replace them is about RM20,000 (S$5,800) per hectare, or almost US$3 billion (S$4.1 billion), according to chief executive Joseph Tek.\nIndonesia’s smaller farmers, meanwhile, can get 30 million rupiah (S$2,645) per hectare for replanting, but the nation’s palm oil association says the actual cost can be as high as 70 million rupiah. Based on the current level of assistance, Jakarta may need to provide at least US$5 billion to help with the replanting costs.\nAmong those caught in the dilemma is Mr Jamari, who like many in Indonesia uses only one name. Having switched from rice to palm oil two decades ago, the planter owns 2ha in the Riau Islands. But some of his trees are now 19m and 18m high, and the harvest is shrinking.\n“There are fewer trees that still produce palm fruit,” he said, adding that where farmers once had 132 to 143 producing trees in 1ha, some now have only 20. He estimated his crop at only 400kg a month of fresh fruit bunches, a sharp drop from the estate’s prime.\nThe issue is not just financial, but raises structural questions. Environmental pressure on an industry that has often expanded at the expense of virgin jungle and forest has increased dramatically.\nEven if replanting does not involve fresh clearing, that means quicker – and ecologically devastating – options leaned on in the past, like clearing more land to boost production, are no longer available.\nThen there is the reality of plantation work. Sunflowers or rapeseed are waist-high row crops grown on flat fields that are suitable for tractors. In palm oil, by contrast, it takes teams of workers to cut down tightly packed bunches of fruit wedged between thorny fronds, each weighing between 16kg and 35kg. Even clearing planted land is more meticulous than long-used methods of slashing and burning, with cutting and chipping needed to avoid attracting pests.\n“When prices are good, replanting is deferred. When prices suddenly fall, the pockets are empty and replanting is deferred,” said Mr Carl Bek-Nielsen, the chief executive director of United Plantations. “It’s a vicious spiral.”\nFounded in 1906, United Plantations is a top 10 producer in Malaysia with the highest yields among its peers. Mr Bek-Nielsen says it replants about 5 per cent of its trees each year to maintain a “healthy age profile”. He said projections that put around 35 per cent of Malaysia’s oil palm at 19 years or above by 2027 are worrisome, pointing out labour costs have climbed by at least 25 per cent to 30 per cent, along with spare parts and fuel.\nLarge producers are taking action. At Astra Agro Lestari Tbk’s unit in Central Kalimantan in Indonesia, in a vast plantation of neat rows of palms, the company works with seeds that can yield harvests by the age of 25 months after planting, much earlier than the average variety, which takes three to four years. They are also researching varieties that could keep trunks to 10m to 15m, even as trees age.", "url": "https://www.straitstimes.com/asia/se-asia/aging-trees-show-a-crisis-looms-for-the-world-s-everything-oil"}