{"authors": [], "date_download": "2024-10-12 13:36:24", "date_modify": "2024-10-12 13:36:24", "date_publish": "2024-07-13 17:47:00", "description": "There will be more patrols in districts outside US bases to strengthen surveillance. Read more at straitstimes.com.", "filename": "asia_east-asia_us-forces-in-japan-to-strengthen-measures-to-prevent-sex-crimes_1728740184.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/13/IMG9864.jpg?VersionId=FOt1v6YWdefn2EFk8y9tgAUREy4J3unY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_us-forces-in-japan-to-strengthen-measures-to-prevent-sex-crimes_1728740184.html", "title": "US forces in Japan to strengthen measures to prevent sex crimes", "title_page": "US forces in Japan to strengthen measures to prevent sex crimes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "OKINAWA - The US forces will strengthen measures to prevent a recurrence of sexual assaults by US military personnel serving in Japan, in response to a series of recent incidents in Okinawa prefecture.\nUS Ambassador to Japan Rahm Emanuel and Lieutenant-General Roger Turner, the Okinawa area coordinator and head of US forces in the prefecture, issued a joint statement on July 12 to announce the reinforcing of relevant measures.\nThe statement expressed deep regret over the recent alleged cases, saying: “It’s clear that our current protections and procedures are not meeting the standards we set for ourselves.”\nAs part of new measures to be taken, there will be more patrols in districts outside US bases to strengthen surveillance.\nRegarding the liberty policy that regulates off-base activities of US military members serving in Japan and requires them to attend sexual violence prevention sessions, the statement said the system has been revised to have a superior officer directly instruct each service member.\nIn June, Japan’s government called for stricter oversight of US troops stationed in the country after a soldier was charged over the alleged sexual assault of a Japanese teenager in Okinawa.\nLocal media said the 25-year-old man had been accused of assault, adding that he knew the girl was under 16, the age of consent in Japan.\nOkinawa accounts for just 0.6 per cent of Japan’s land mass but hosts about 70 per cent of all the US military bases and facilities in the country. THE JAPAN NEWS/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/asia/east-asia/us-forces-in-japan-to-strengthen-measures-to-prevent-sex-crimes"}