{"authors": [], "date_download": "2024-10-12 13:39:23", "date_modify": "2024-10-12 13:39:23", "date_publish": "2023-08-15 15:50:00", "description": "World leaders continues to grapple with how, and if, to engage with the Taliban authorities. Read more at straitstimes.com.", "filename": "asia_south-asia_afghanistans-taliban-government-marks-two-years-since-return-to-power_1728740363.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/15/2023-08-15T070138Z1694077649RC27O2ABH92FRTRMADP3AFGHANISTAN-ANNIVERSARY.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_south-asia_afghanistans-taliban-government-marks-two-years-since-return-to-power_1728740363.html", "title": "Afghanistan’s Taliban government marks two years since return to power", "title_page": "Afghanistan’s Taliban government marks two years since return to power | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KABUL - Afghanistan’s Taliban government marked on Tuesday the second anniversary of their takeover of the country with celebrations and a public holiday, issuing a defiant statement commemorating their surge back to power.\nFlags of the Islamic Emirate of Afghanistan – the name given to the country by its new rulers – fluttered at security checkpoints across the capital, which fell on Aug 15, 2021, when the United States-backed government collapsed and its leaders fled into exile.\nIn the two years since, the Taliban authorities have imposed their strict interpretation of Islam, with women bearing the brunt of laws the United Nations has termed “gender apartheid”.\nA statement from the authorities early on Tuesday hailed a victory that was able to “pave the way for the establishment of the Islamic system in Afghanistan”.\n“The conquest of Kabul proved once again that no one can control the proud nation of Afghanistan” and that “no invader will be allowed to threaten the independence and freedom” of the country, it said.\nQuiet Kabul streets early on Tuesday began to give way to convoys of Taliban members and a gathering at Massoud Square near the abandoned US embassy building.\nSome of the men carried their weapons, while others snapped smiling selfies as anthems blared and young boys sold the movement’s white flag inscribed with the Islamic declaration of faith.\nIn Herat in the west, a crowd of Taliban supporters chanted: “Death to the Europeans, death to the Westerners, long live the Islamic Emirate of Afghanistan, death to the Americans.”\n‘Need to celebrate’\nAs events kicked off in various cities, a military parade was cancelled in Kandahar, the cradle of the Taliban movement and from where the reclusive Supreme Leader Hibatullah Akhundzada rules by decree.\nExpected to include scores of military vehicles and weapons left behind by international forces after a weeks-long chaotic withdrawal, he called off the parade himself so as not to disturb the public, provincial officials told journalists.\nIn Kabul, the education ministry hosted a celebration at a school in a part of the city once stacked with diplomats who are now thin on the ground – the Taliban government is still not formally recognised by any other country.\nA medical student at an event at Kabul University told AFP it was important to mark the anniversary.\n“We need to celebrate today. Today marks the end of the occupation in our country, and that is a good thing,” 21-year-old Mortaza Khairi said.\n‘Want their freedom back’\nAfghan women ahead of the anniversary have expressed fear and despair over the loss of rights – a handful holding small demonstrations, many of their faces covered with masks.\nBut Afghans also pointed to worry over an economic and humanitarian crisis in motion since the Taliban takeover, as aid dried up and sanctions were imposed.\nFarmer Rahatullah Azizi told AFP he used to earn a living off his crops but now has “just enough to eat”.\nHe expressed relief, however, that the security situation was better, noting he could now travel freely at night without fear of being mugged.\nBut while violence has fallen across Afghanistan in the past two years, the Islamic State group remains a threat and tensions have risen with Pakistan over an increase of attacks in the countries’ shared border areas.\nThe Taliban authorities have pledged that Afghan territory won’t be used by foreign militants to stage attacks abroad but it remains a sticking point.\nWhile some Afghans celebrate the end of fighting and Taliban rule, others see Aug 15 as a grim reminder.\n“All the girls and women of Afghanistan want their freedom back,” said former student Hamasah Bawar ahead of the anniversary. AFP", "url": "https://www.straitstimes.com/asia/south-asia/afghanistans-taliban-government-marks-two-years-since-return-to-power"}