{"authors": [], "date_download": "2024-10-12 13:39:32", "date_modify": "2024-10-12 13:39:32", "date_publish": "2022-11-28 20:16:08", "description": "Tokyo is looking to curb the growing security threat it deems posed by China. Read more at straitstimes.com.", "filename": "asia_east-asia_japan-pm-kishida-wants-to-double-defence-spending-to-2-of-gdp-to-counter-china_1728740372.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/29/aijapanpm2811.jpg?VersionId=u96Qo2xvo.sl6iRr3frpBkBX6KUPXqdf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_japan-pm-kishida-wants-to-double-defence-spending-to-2-of-gdp-to-counter-china_1728740372.html", "title": "Japan PM Kishida wants to double defence spending to 2% of GDP to counter China", "title_page": "Japan PM Kishida wants to double defence spending to 2% of GDP to counter China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - Japanese Prime Minister Fumio Kishida instructed ministers to double defence spending to about 2 per cent of gross domestic product in five years, the defence minister said on Monday, to counter China’s growing assertiveness in the region.\nA panel of experts advising Mr Kishida this month recommended broad tax measures to pay for the hike and cautioned against raising debt that could expose US ally Japan to international market changes.\nMr Kishida’s administration has pledged to “substantially” increase defence spending to counter what Tokyo sees as a growing security threat posed by China.\n“Given the present security situation, we need to strengthen defence spending urgently in five years,” Defence Minister Yasukazu Hamada told reporters after a meeting with the Premier and Finance Minister Shunichi Suzuki.\n“He told us to make every effort in securing necessary (funding) quickly and firmly,” he said.\nTo meet the size of Japan’s midterm defence plan, to be drawn up by the year’s end, the government will decide on securing funding from both revenue and spending reforms.\n“As a responsible nation, we must make the utmost effort in spending reform, but at the same time steady funding sources are indispensable in order to stably support them,” Mr Hamada quoted Mr Kishida as saying. REUTERS", "url": "https://www.straitstimes.com/asia/east-asia/japan-pm-kishida-wants-to-double-defence-spending-to-2-of-gdp-to-counter-china"}