{"authors": [], "date_download": "2024-10-12 14:15:36", "date_modify": "2024-10-12 14:15:36", "date_publish": "2024-06-24 02:17:13", "description": "He was greeted by hundreds of dancing, cheering supporters. Read more at straitstimes.com.", "filename": "asia_dalai-lama-arrives-in-new-york-on-trip-for-medical-treatment_1728742536.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/24/LYNXMPEK5M05Q-1.jpg?VersionId=mW8iiKjvJGfpMXV4qaGo73orn9D9lEhI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_dalai-lama-arrives-in-new-york-on-trip-for-medical-treatment_1728742536.html", "title": "Dalai Lama greeted by cheering crowds in New York as he arrives for medical treatment", "title_page": "Dalai Lama greeted by cheering crowds in New York as he arrives for medical treatment | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - The Dalai Lama, the exiled spiritual leader of Tibetan Buddhism, arrived in New York on June 23 to receive medical treatment for his knees and was greeted by hundreds of cheering and chanting supporters.\nThe 88-year-old waved from the open window of a limousine as it approached his Manhattan hotel. He walked slowly to the entrance, supported by aides.\nThe Dalai Lama fled to India in 1959 after a failed uprising against Chinese rule in Tibet. The Nobel Peace laureate has battled health problems for years.\nSome supporters arrived hours ahead of time to make sure they could catch a sight of a man making his first trip to the United States since 2017.\n“I knew I had to come here for this once-in-a-lifetime opportunity. And I think waiting outside for the past four or five hours is definitely worth it,” said supporter Tenzin Kunkyi. “There is a strong sense of community when you’re here, everyone’s passing around bread... along with getting a blessing from seeing His Holiness, we also strengthen our Tibetan bond here outside.”\nFollowers, many wearing traditional Tibetan outfits, danced in the streets outside the hotel.\n“We wish Dalai Lama long life. And we really wish Dalai Lama (would) visit China to say to the Tibetan community, ‘Hi, hello’,” said supporter Byamba Suren, who left Virginia at 3am to drive to New York.\n“Once we saw him, it felt really powerful. And everyone was, like, emotional because he’s, like, our leader,” added 18-year-old, US-born Tenzin Pasang, who has now seen the Dalai Lama three times. “So it’s very nice to see him in New York.”\nShe welcomed the spiritual leader by joining in a performance of a traditional Tibetan dance.\nIt is unclear whether the Dalai Lama, whom Beijing sees as a dangerous separatist, will meet any US officials during his trip. He says he is not seeking independence for Tibet.", "url": "https://www.straitstimes.com/asia/dalai-lama-arrives-in-new-york-on-trip-for-medical-treatment"}