{"authors": [], "date_download": "2024-10-12 13:37:46", "date_modify": "2024-10-12 13:37:46", "date_publish": "2024-09-09 09:27:04", "description": "The countries have exchanged accusations of intentional attacks in the disputed waterway. Read more at straitstimes.com.", "filename": "asia_china-says-ties-with-philippines-at-a-crossroads-over-south-china-sea_1728740266.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/09/LYNXMPEK88018-1.jpg?VersionId=l2uMRc8rTOjevIHwb.Pp.0ebUwClCUQm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_china-says-ties-with-philippines-at-a-crossroads-over-south-china-sea_1728740266.html", "title": "China says ties with Philippines at crossroads over South China Sea", "title_page": "China says ties with Philippines at crossroads over South China Sea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China called on the Philippines to seriously consider the future of a relationship at a crossroads, in a Sept 9 commentary published by the People’s Daily, the newspaper of the governing Communist Party, amid tensions in the South China Sea.\nThe Philippines and China have exchanged accusations of intentionally ramming coast guard vessels in the disputed waterway in recent months, including a violent clash in June in which a Filipino sailor lost a finger.\nThe incidents have overshadowed efforts by both nations to rebuild trust and better manage confrontations, including setting up new lines of communication to improve the handling of maritime disputes.\n“China-Philippines relations stand at a crossroads, facing a choice of which way to go,” the commentary said. “Dialogue and consultation is the right path, as there is no way out of the conflict through confrontation.”\nManila “should seriously consider the future of China-Philippines relations and work with China to push bilateral relations back on track”, it added.\nThe commentary was published under the pen name “Zhong Sheng”, meaning “Voice of China”, which is often used to give the paper’s view on foreign policy issues.\nBeijing claims almost the entire South China Sea, including parts claimed by the Philippines, Brunei, Malaysia, Taiwan and Vietnam. Portions of the waterway, where US$3 trillion (S$3.9 trillion) worth of trade passes annually, are believed to be rich in oil and natural gas deposits, as well as fish stocks.\nThe Permanent Court of Arbitration in 2016 found China’s sweeping claims had no legal basis, a ruling Beijing rejects.\nIn June, the United States reaffirmed its commitment to the Philippines’ security, after Manila accused China of a “deliberate action” to stop the resupply of Philippine troops stationed at the disputed Second Thomas Shoal.", "url": "https://www.straitstimes.com/asia/china-says-ties-with-philippines-at-a-crossroads-over-south-china-sea"}