{"authors": [], "date_download": "2024-10-12 13:31:32", "date_modify": "2024-10-12 13:31:32", "date_publish": "2022-08-03 08:53:59", "description": "Many are now asking for a universal mode of payment at the two border crossings into Johor. Read more at straitstimes.com.", "filename": "asia_se-asia_shortage-of-touch-n-go-cards-irks-travellers-going-into-johor_1728739892.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/03/AK_mysl_030822.jpg?VersionId=E5WRGsHYs7OGF_MKb2rAO59Ml8ng2dRs", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_shortage-of-touch-n-go-cards-irks-travellers-going-into-johor_1728739892.html", "title": "Shortage of Touch 'n Go cards irks travellers driving into Johor", "title_page": "Shortage of Touch 'n Go cards irks travellers driving into Johor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JOHOR BARU (THE STAR/ASIA NEWS NETWORK) - Crossing the borders into Malaysia is getting to be a touch-and-go affair for Singaporeans - they do not know how much extra they will have to pay.\nSince the borders reopened, Touch 'n Go stored-value cards are becoming hard to find and touts are now at the cashless toll plaza at Johor's Bangunan Sultan Iskandar (BSI) Customs Immigration and Quarantine (CIQ) complex.\nThe drivers have had to pay up to RM50 (S$15.40) to \"certain people\" to tap and pay for them when they enter Malaysia.\nMany are now asking for a universal mode of payment at the two border crossings with Singapore, including via debit and credit cards.\nAt the moment, besides using a Touch 'n Go card, Singaporeans can use their EZ-Link x Touch 'n Go motoring card at the BSI CIQ complex and the Sultan Abu Bakar CIQ at the Tuas Second Link.\nThis a cashless card which can be used in Singapore and Malaysia.\nHowever, this card is sold at selected 7-Eleven stores or petrol stations in Singapore.\nSingaporean businessman L. Manan, 64, was among those who had trouble paying for his toll charges when he recently drove into Johor as his Touch 'n Go card had expired.\n\"The immigration officer directed me to a person near the toll area. When I approached the person to buy a new card, the person said they do not sell cards at the CIQ. But he was willing to 'help' with the toll for a fee,\" he said.\nThe toll amount was about RM23 but he had to pay RM50 for the service. After leaving the CIQ, he drove around looking to buy a card but none were available.\nMr Manan said he then had to get a card from his brother and has been using it to enter Johor weekly.\nHe said the problem could be avoided if people can buy the cards or make reloads at the CIQs.\nAnother Singaporean, who wanted to be identified as only Tan, said a family in a car ahead of him had asked to use his Touch 'n Go card as theirs had expired.\n\"With the borders being reopened since April, there should be an adequate supply of such cards, especially around the CIQs.\n\"I also hope Touch 'n Go will allow for online top-ups, which are more convenient,\" he said. \"The company should also have an office at both border crossings to sell cards and allow top-ups.\"\nMalaysian R. Mohana, a 43-year-old factory worker, said the shortage of cards had been a problem for weeks now.\n\"I found that my card had expired and asked my sister living in Johor Baru to help get a new one but she was unable to find a card,\" said Ms Mohana.\nMalaysian engineer Nur Atiqah Muhd Fauzi, 27, who works in Singapore, also said she has been unable to buy a new Touch 'n Go card and was forced to use her identity card instead.\n\"I have been trying to get a card since May,\" she said.\nChecks by The Star at petrol stations and convenience stores around the Johor Baru CIQ and the Second Link showed that they had run out of Touch 'n Go cards for some time.\nStulang assemblyman Andrew Chen Kah Eng said he had received many complaints on the issue.\n\"As all our CIQs are cashless, we should allow people to use their debit cards or even credit cards to pay.\n\"This type of cashless payment has already been implemented at shopping malls around the city,\" he said, adding that this issue had been raised several years ago, when he headed a task force to look into traffic congestion at the Johor CIQ.\n\"We should have a universal payment system,\" he said.\nHe also said the authorities should work towards integrating Singapore's EZ-Link smartcard system to allow for seamless travel between both countries.\nA Touch 'n Go customer careline staff, when contacted, said those wanting to purchase a card can do so via its website.", "url": "https://www.straitstimes.com/asia/se-asia/shortage-of-touch-n-go-cards-irks-travellers-going-into-johor"}