{"authors": [], "date_download": "2024-10-12 13:34:01", "date_modify": "2024-10-12 13:34:01", "date_publish": "2024-04-21 19:27:00", "description": "The bodyguard had undergone intestinal surgery after being shot while saving the life of his client. Read more at straitstimes.com.", "filename": "asia_se-asia_kuala-lumpur-airport-shooting-injured-bodyguard-awake-says-wife_1728740041.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/21/hzkl210424.jpg?VersionId=mUJYA5pOF3Qels6cZunQbG.ki1nFtgFK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_se-asia_kuala-lumpur-airport-shooting-injured-bodyguard-awake-says-wife_1728740041.html", "title": "Kuala Lumpur airport shooting: Injured bodyguard awake, taken off ventilator, says wife", "title_page": "Kuala Lumpur airport shooting: Injured bodyguard awake, taken off ventilator, says wife | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA – A bodyguard who was shot at Kuala Lumpur International Airport Terminal 1 on April 14 has regained consciousness.\nMr Mohd Nur Hadith, better known as Along, had previously undergone intestinal surgery after being injured while saving the life of his client, Ms Farah Md Isa, who runs a travel agency.\nHis wife confirmed that Along had woken up on April 20.\nHe had been put in a medically induced coma due to his injuries.\n“This morning (on April 21), he was taken off the (ventilator).\n“He can speak a little,” his wife Siti Noraida Hassan said when contacted.\nNo timeframe has been given for his discharge, however.\n“It could take some time,” she added.\nJust after 1am on April 14, the Kuala Lumpur airport was rocked by the suspected murder attempt when a man allegedly tried to shoot his wife in the arrival hall.\nMs Farah, better known as Farah Cie, was waiting for clients to return from the umrah – an Islamic religious pilgrimage – at the time.\nThe suspect reportedly threw a firecracker in her direction, causing injuries to bystanders, before opening fire at close range.\nOne bullet missed her, and Along stepped into the path of the second bullet. The injured bodyguard was rushed to Hospital Cyberjaya for treatment.", "url": "https://www.straitstimes.com/asia/se-asia/kuala-lumpur-airport-shooting-injured-bodyguard-awake-says-wife"}