{"authors": [], "date_download": "2024-10-12 13:40:16", "date_modify": "2024-10-12 13:40:16", "date_publish": "2024-09-20 17:12:19", "description": "WARSAW - A Russian citizen suspected of directing the beating of Leonid Volkov - an exiled top aide to late Russian opposition leader Alexei Navalny - was arrested in Poland, the National Prosecutors' Office said in a statement on Friday. Read more at straitstimes.com.", "filename": "asia_poland-arrests-former-lawyer-of-late-russian-oligarch-berezovsky-radio-reports_1728740416.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/LYNXMPEK8J0HI-1.jpg?VersionId=CVxEeXSyCrB_BTTa7xllLIIe1BEtw4Ei", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_poland-arrests-former-lawyer-of-late-russian-oligarch-berezovsky-radio-reports_1728740416.html", "title": "Poland arrests Russian accused of directing attack on Navalny aide", "title_page": "Poland arrests Russian accused of directing attack on Navalny aide | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WARSAW - A Russian citizen suspected of directing the beating of Leonid Volkov - an exiled top aide to late Russian opposition leader Alexei Navalny - was arrested in Poland, the National Prosecutors' Office said in a statement on Friday.\nVolkov suffered injuries from hammer blows in the attack on March 12 outside his home in Vilnius, the Lithuanian capital. Two men suspected of attacking him were arrested in Poland in April on a European Arrest Warrant issued by Lithuania.\n\"In the following months, more people were arrested. Currently, there are eight suspects in the investigation, of which four are subject to a preventive measure in the form of temporary arrest\", the office said in a statement.\n\"The investigation is multi-threaded and concerns, among others: attacks on Russian opposition figures associated with the Anti-Corruption Foundation, founded by Alexei Navalny. The proceedings cover events that occurred both in Europe... and in South and North America,\" it added.\nPolish private radio station RMF FM reported that Polish authorities had arrested a former lawyer of late Russian oligarch Boris Berezovsky in an investigation related to attacks on Russian opposition figures.\nThe arrest of the lawyer, identified by prosecutors only as Anatoly B, had earlier been reported by independent Russian media.\nBerezovsky, one of Russia's most powerful figures in the 1990s, fell out with President Vladimir Putin and fled to London in 2000, where he was later granted political asylum.\nThe 67-year-old tycoon was found dead in March 2013 with a scarf tied around his neck in the bathroom of a luxury mansion near London. His family feared he might have been murdered by enemies in Russia but British police and forensic experts concluded that Berezovsky had committed suicide. REUTERS", "url": "https://www.straitstimes.com/asia/poland-arrests-former-lawyer-of-late-russian-oligarch-berezovsky-radio-reports"}