{"authors": [], "date_download": "2024-10-12 13:37:02", "date_modify": "2024-10-12 13:37:02", "date_publish": "2024-08-15 00:33:17", "description": "Mr Wang Yi and General Min Aung Hlaing discussed “stability of the border regions,” according to a junta readout of the meeting. Read more at straitstimes.com.", "filename": "asia_east-asia_myanmar-junta-chief-china-fm-discuss-stability-as-clashes-rage_1728740222.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/15/chinamyanmar15.jpg?VersionId=_3kev6VT9A8J48roUy4yHwvYXw3BZeUD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_myanmar-junta-chief-china-fm-discuss-stability-as-clashes-rage_1728740222.html", "title": "Myanmar junta chief, China FM discuss ‘stability’ as clashes rage", "title_page": "Myanmar junta chief, China FM discuss ‘stability’ as clashes rage | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "YANGON - Myanmar’s embattled junta chief and China’s foreign minister on Aug 14 discussed security along their shared border, where ethnic minority armed groups have captured territory from the Myanmar military in recent weeks, junta media said.\nChina is a major ally and arms supplier to the junta but analysts say it also maintains ties with ethnic armed groups fighting the military in Myanmar’s northern Shan state.\nThe meeting in the capital Naypyitaw was the first between Mr Wang Yi and General Min Aung Hlaing, chief of the junta that seized power in 2021 when it deposed the government of Ms Aung San Suu Kyi.\nThe two discussed “stability of the border regions”, according to a junta readout of the meeting.\nMyanmar’s northern Shan state has been the site of repeated clashes since late June after an alliance of ethnic rebel groups renewed an offensive against the military along a vital trade highway to China.\nShan state borders China’s Yunnan province and is a vital piece of Beijing’s Belt and Road infrastructure initiative.\nGen Min Aung Hlaing and Mr Wang also “discussed and exchanged views openly regarding... free and fair multi-party general elections”, according to the junta.\nThe junta has promised to hold fresh polls but critics say they will be a sham.\nThe junta has pushed back a timetable for elections multiple times and in 2023 banned the widely popular National League for Democracy (NLD) of Ms Suu Kyi.\nClashes\nClashes between the military and ethnic armed groups in Shan state continued on Aug 14.\nTa’ang National Liberation Army fighters were battling junta troops in the Shan state towns of Hsipaw and Naungcho, its Major-General Tar Bhone Kyaw told AFP.\nAFP has contacted the Myanmar National Democratic Alliance Army (MNDAA), another group fighting in northern Shan for comment.\nEarlier in August, MDNAA fighters captured the military’s north-eastern command in the town of Lashio, home to about 150,000 people.\nThe capture of the regional command – the first by opponents of the junta since the military’s 2021 coup – sparked rare public criticism of the top generals by its supporters.\nGen Min Aung Hlaing later said the alliance was receiving weapons, including drones and short-range missiles, from “foreign” sources that he did not identify.\nDozens of civilians have been killed or wounded in the recent fighting, according to the junta and local rescue groups.\nThe junta and the ethnic armed groups have not released casualty figures.\nEarlier on Aug 14, the junta said rumours top generals had detained Gen Min Aung Hlaing in a new coup were “propaganda” spread by “traitors”.\nOn Aug 13, several social media posts claimed that top generals had detained Gen Min Aung Hlaing Naypyitaw in a bid to change the junta’s top leadership.", "url": "https://www.straitstimes.com/asia/east-asia/myanmar-junta-chief-china-fm-discuss-stability-as-clashes-rage"}