{"authors": ["Wong Shiying"], "date_download": "2024-10-12 13:55:27", "date_modify": "2024-10-12 13:55:27", "date_publish": "2023-03-23 08:13:53", "description": "The dim sum is served in tiny bamboo steamers. Read more at straitstimes.com.", "filename": "asia_east-asia_doggy-yum-cha-hong-kong-hotel-rolls-out-dim-sum-for-dogs_1728741327.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/23/dim20sum20for20dogs_1.jpg?VersionId=tBLcVKrEigt.Vbt3xWPWcue9HnowlF6a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_east-asia_doggy-yum-cha-hong-kong-hotel-rolls-out-dim-sum-for-dogs_1728741327.html", "title": "‘Doggy yum cha’: Hong Kong hotel rolls out dim sum for dogs", "title_page": "‘Doggy yum cha’: Hong Kong hotel rolls out dim sum for dogs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "One hotel in Hong Kong is taking pet pampering to the next level with its new dim sum menu for dogs.\nFrom braised cod with fish maw to duck with capelin, Hyatt Centric Victoria Harbour Hong Kong in the North Point district of Hong Kong is catering to those who wish to treat their beloved pet.\nPresented in tiny bamboo steamers, the dim sum is served on the outdoor garden terrace of the hotel’s Farmhouse restaurant.\nOther items on the menu include braised chicken fillet with goat milk, braised quail eggs and steamed meatballs.\nThe hotel’s general manager Patrick Sin told the South China Morning Post: “Yum cha (dim sum paired with Chinese tea) is such an iconic Hong Kong experience, and is traditionally one of the ways in which families gather to spend quality time with each other.”\n“A ‘doggy yum cha’ was therefore the perfect way to celebrate dog-families and enable them to create new memories together.”\nThe five-star hotel, popular in Hong Kong for “dogcations”, also offers a range of steamed treats and even birthday cakes for dogs.\nThose who wish to work off the calories with their pooch can visit nearby dog-friendly shopping mall Harbour North, a dog park or nearby waterfront promenade.\nA night at the hotel with your dog will cost about HK$3,240 (S$550). An additional dog from the same family is allowed to share the room at an extra fee of HK$299 and 10 per cent service charge.\nSingapore is no stranger to pet getaways, with many pet-friendly hotels here offering staycation packages curated for families with dogs or cats.\nAmara Sanctuary Resort Sentosa and Intercontinental Singapore, for example, offer gourmet treats and meals, with amenities such as dog beds and toys.\nThose who fancy a sunset dinner with their pet can board the Royal Albatross dog cruise, which offers a three- or six-course meal while the ship sails along the coastline of Sentosa.", "url": "https://www.straitstimes.com/asia/east-asia/doggy-yum-cha-hong-kong-hotel-rolls-out-dim-sum-for-dogs"}