{"authors": ["Zaihan Mohamed Yusof", "Wahyudi Soeriaatmadja"], "date_download": "2024-10-12 13:30:40", "date_modify": "2024-10-12 13:30:40", "date_publish": "2024-01-09 20:59:00", "description": "Of these, 63 happened in the straits of Malacca and Singapore. Read more at straitstimes.com.", "filename": "asia_100-incidents-of-armed-robbery-against-ships-in-asia-recorded-in-2023_1728739840.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/09/DSC9871.jpg.JPEG?h=1d0f5ddd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_100-incidents-of-armed-robbery-against-ships-in-asia-recorded-in-2023_1728739840.html", "title": "100 incidents of armed robbery against ships in Asia recorded in 2023", "title_page": "100 incidents of armed robbery against ships in Asia recorded in 2023 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A total of 100 incidents of armed robbery against ships in Asia took place in 2023, a marked increase from the 84 such incidents in 2022.\nThis is according to the ReCAAP Information Sharing Centre (ISC), which held a media briefing at M Hotel on Jan 9.\nReCAAP stands for Regional Cooperation Agreement on Combating Piracy and Armed Robbery against Ships in Asia. The agreement entered into force in 2006, and 21 states – with 14 in Asia among them – are contracting parties.\nHowever, 2023 was the third consecutive year in which no incidents of piracy on the high seas or outside coastal states’ jurisdiction were reported.\nMr Krishnaswamy Natarajan, executive director of ReCAAP ISC, said most of the incidents were opportunistic, targeting vessels that were travelling slow or were easily boarded.\nWhile the number of armed robberies against ships in Asia rose in 2023, Mr Natarajan said he was heartened that several arrests were made, as these serve as “a deterrence, and send a strong signal to the organised criminal groups that their acts will be severely dealt with”.\nHe added that the rising number of such armed robberies against ships was understandable and “not that alarming”, as many countries were recovering from Covid-19.\nIn 2021, there were 82 reported cases.\nMr Natarajan told The Straits Times: “We have to understand that Covid-19 brought an economic meltdown across the globe... Some of the countries in this region are economically poor, and that’s why these petty crimes are taking place. What they take are scrap metal and ropes, nothing of high value.”\nCloser to Singapore waters, 63 out of the 100 incidents happened in the straits of Malacca and Singapore.\nOf these, 58 incidents occurred in the roughly 114km-long Singapore Strait.\nIn most of the nocturnal incidents in the Singapore Strait, the perpetrators did not harm the crew. In eight incidents, the criminals were violent to the crew, while a ship master was injured in the chest in a separate case.\nMs Lee Yin Mui, deputy director of ReCAAP ISC, said: “Of the 63 incidents (that took place in the straits of Malacca and Singapore), the majority have occurred on bulk carriers, followed by barges towed by tug boats, and the rest on tankers and supply vessels.”\nShe added that 71 per cent of the incidents – or 45 of them – occurred in the eastbound lane of the Singapore Strait.\nMs Lee shared case studies where successful arrests were made in jurisdictions in Bangladesh, India, the Philippines and the straits of Malacca and Singapore.\nWhile attacks in the Red Sea threaten to slow shipments to the region, analysts and government officials in Indonesia say the Strait of Malacca, an important maritime trade road, is not likely to experience similar episodes.\nMr Septian Hario Seto, a deputy coordinating maritime affairs and investment minister, told ST on Jan 8: “It will not happen in the Strait of Malacca. There are no militants in the Strait of Malacca. None of the (the pirates) there have Houthis’ capability.”\nSecurity analyst Taufik Andrie, executive director with the Jakarta-based Yayasan Prasasti Perdamaian, told ST: “The capacity of terrorists in the Riau Islands and Batam is not up to that. Besides, the separate patrolling by sea authorities from Singapore, Malaysia and Indonesia, as well as the joint patrol, is quite regular and frequent... Piracy by terrorists there is fuelled by an economic motive.”\nYayasan Prasasti Perdamaian is a non-profit, non-governmental organisation that deals with peace-building and conflict resolution issues.\nA senior official with Indonesia’s coast guard said coastal nations of the Strait of Malacca are friendly countries that do not wish to engage in any conflict, further lowering the chances of attacks similar to the ones in the Red Sea happening.\nIt also introduced a poster – which can be downloaded from its website – containing updated contact details of the law enforcement agencies in the Singapore and Malacca straits.\nReCAAP ISC is currently in the process of launching an enhanced mobile application to facilitate seamless sharing of information and provide a user-friendly incident reporting format for direct reporting to the Maritime Rescue Coordination Center.\nMr Natarajan urged the law enforcement agencies of the littoral states of the straits of Singapore and Malacca to “continue to collaborate and share information and step up enforcement measures” in order to eradicate the organised criminal groups in these states both on land and in the seas.\n“No incident at sea can take place without the conduct of those individuals on land,” he said.\nCorrection note: In an earlier version of this story, it was reported that 20 states are contracting parties of ReCAAP. This is incorrect. It should be 21 states. We are sorry for the error.", "url": "https://www.straitstimes.com/asia/100-incidents-of-armed-robbery-against-ships-in-asia-recorded-in-2023"}