{"authors": [], "date_download": "2024-10-12 13:38:41", "date_modify": "2024-10-12 13:38:41", "date_publish": "2024-07-12 00:41:16", "description": "Israeli Defence Minister Yoav Gallant said he himself should also be probed over failings around the Oct 7 Hamas attack. Read more at straitstimes.com.", "filename": "asia_netanyahu-should-be-investigated-for-oct-7-failure-his-defence-minister-says_1728740321.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/LYNXMPEK6A0NV-1.jpg?VersionId=e_jByPGxg6aOYMLHxf4GIsm_O5KA8TM6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/asia_netanyahu-should-be-investigated-for-oct-7-failure-his-defence-minister-says_1728740321.html", "title": "Israeli PM Netanyahu should be investigated for Oct 7 failure, defence minister says", "title_page": "Israeli PM Netanyahu should be investigated for Oct 7 failure, defence minister says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - Israeli Defence Minister Yoav Gallant on July 11 called for a state inquiry into failings around the Oct 7 Hamas attack, saying it should investigate Mr Gallant himself and his boss, Prime Minister Benjamin Netanyahu.\nMr Gallant made the comments at a graduation ceremony for new military officers, also attended by Mr Netanyahu, whose coalition government is already strained by infighting.\nThe state inquiry, he said, \"must be objective, it needs to investigate all of us, those who make decisions and those who carry them out, the government, the military, and the security agencies.\"\n\"It must investigate me, the defence minister, it must investigate the prime minister,\" Mr Gallant said, to cheers from the crowd.\nMr Netanyahu has dismissed past calls to form a state inquiry into the Oct 7 attack, which caught Israel off guard and sparked the war in Gaza, saying that examinations into what happened should be carried out once the war ends.\nOnly the government can decide to form a state commission of inquiry, which has a broad mandate and its findings carry weight. The chief justice of the Supreme Court chooses its members.\nMr Gallant has broken ranks with Mr Netanyahu before.\nIn 2023, after months of nationwide protests against government plans to curb supreme court powers, Mr Gallant said proposed legislation should be dropped, warning the public dispute could hurt national security.\nMr Netanyahu immediately sacked him, spurring tens of thousands of Israelis to take to the streets in support of Mr Gallant. The veteran prime minister eventually relented and Mr Gallant kept his job.", "url": "https://www.straitstimes.com/asia/netanyahu-should-be-investigated-for-oct-7-failure-his-defence-minister-says"}