{"authors": ["Elisha Tushara"], "date_download": "2024-10-12 13:44:33", "date_modify": "2024-10-12 13:44:33", "date_publish": "2023-10-21 22:03:01", "description": "With full SBB, students in one class will attempt subjects like English, maths and science at three different levels. Read more at straitstimes.com.", "filename": "askst_askst-what-to-expect-with-full-subject-based-banding-in-secondary-schools-in-2024_1728740673.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/21/IMG2364.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/askst_askst-what-to-expect-with-full-subject-based-banding-in-secondary-schools-in-2024_1728740673.html", "title": "askST: What to expect with full subject-based banding in secondary schools in 2024", "title_page": "askST: What to expect with full subject-based banding in secondary schools in 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Parents and pupils who wanted to know more about how full subject-based banding (SBB) works in secondary schools heard from five principals at The Straits Times Smart Parenting Post-PSLE Forum on Saturday.\nThe forum covered topics such as timetabling and progression to junior colleges and polytechnics. Here are some key questions and answers:\nQ: What are some timetabling constraints that may arise with full SBB, and how will schools overcome them?\nA: With full SBB, students in one class will attempt subjects like English, mathematics and science at three different levels. The school will deploy sufficient teachers and venues to facilitate these lessons.\nMr Lee Han Hwa, principal of St Andrew’s Secondary School, said that the school adopts “white spaces” in the timetable, where some students may not have lessons during certain periods. Schools have the autonomy to decide what students can do during these white spaces. This could also mean longer school days for some days of the week.\nQ: If a student does not meet the prerequisites to take a subject at a more demanding level, will he still be able to do so?\nA: Apart from academic results, there are other determining factors that schools consider before allowing a student to take a subject at a more demanding level. Ms Tan Po Chin, principal of Anderson Secondary School, said these could include teachers’ observations about the student’s ability to cope with the rigour of taking the subject at a more demanding level, as well as the student’s demonstration of interest in that subject.\nSchools usually consider such requests on a case-by-case basis, and will engage parents to consider the best interests of the child.\nQ: If a student is unable to cope with taking a subject at a more demanding level and chooses to switch to a less demanding level – from G3 to G2 – will the student have to move to a different form class?\nA: After the first year of attempting a subject at a more demanding level, the student will move to a new subject class in the second year if he decides to take the subject at a less demanding level. The student could remain in the same form class.\nMr Loh Chih Hui, principal of Bowen Secondary School, said it will depend on how schools organise their form classes and subject classes.\nQ: Is there an option for students to return to study in secondary schools for a fifth year?", "url": "https://www.straitstimes.com/askst/askst-what-to-expect-with-full-subject-based-banding-in-secondary-schools-in-2024"}