{"authors": [], "date_download": "2024-10-12 13:31:13", "date_modify": "2024-10-12 13:31:13", "date_publish": "2024-09-09 10:22:00", "description": "Singapore payments company will be ready to go public by the end of 2026. Read more at straitstimes.com.", "filename": "business_gic-backed-nium-pushes-back-us-ipo-plans-to-refocus-on-growth_1728739873.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/09/a15563286799n.jpg?VersionId=R.acoC7dXxdFUl0Jlv3jNY3vcE5PkzyO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_gic-backed-nium-pushes-back-us-ipo-plans-to-refocus-on-growth_1728739873.html", "title": "GIC-backed Nium pushes back US IPO plans to focus on growth", "title_page": "GIC-backed Nium pushes back US IPO plans to focus on growth | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore payments company Nium is pushing back its plans for an initial public offering (IPO) in the United States by more than a year, focusing on shoring up its team and growing revenue.\nNium, now valued at US$1.4 billion (S$1.8 billion), will be ready to go public by the end of 2026, co-founder and chief executive officer Prajit Nanu said in an interview. It had previously targeted the second quarter of 2025. Mr Nanu attributed the delay to a long search for a finance chief, saying a new leadership now in place will allow it to focus on IPO preparation.\nLike its larger US peer Stripe, Nium helps companies handle cross-border payments. The company, whose backers include Singapore sovereign wealth fund GIC, increased revenue by about 50 per cent in 2023 to US$120 million and is now focusing on expanding in regions including Britain and Latin America, Mr Nanu said.\nThe firm announced on Sept 9 that it hired Mr Andre Mancl as chief financial officer, tapping the former CFO of online food booking platform ChowNow to lead functions including corporate development, planning and investor relations. The former Credit Suisse internet investment banker has advised and executed transactions for companies including Lyft, Meta Platforms and GoDaddy, the company said.\n“We started looking for a CFO a year back – it’s just been a really painful process,” Mr Nanu said.\nNium’s valuation, a 30 per cent discount to its previous market value, came on the back of a US$50 million fund-raising round in June that was led by Brunei’s sovereign wealth fund, Mr Nanu said. The funds will be used for acquisitions in the real-time payments space, he said. The company, which expanded rapidly by buying London-based Ixaris, Singapore’s SoCash as well as Wirecard Forex India over the past few years, expects to increase net revenue to US$200 million in 2025, Mr Nanu said.\n“We raised at US$2 billion when the public market was crazy,” he said. “Now the public markets are not crazy anymore.”\nNium, whose backers also include GIC’s sister firm Temasek Holdings and US-based Riverwood Capital, is looking to snap up one to two payments start-ups worth about US$40 million to US$50 million by the end of the year and has about US$100 million in cash to fund the purchases, Mr Nanu said.\nMr Nanu co-founded Nium, which means “rules” in Sanskrit, as a cross-border remittance service in 2014. After growing up in Mumbai, he got a taste of what it was like to build businesses during his dozen years at companies such as Adventity and WNS Global Services.\nHe came up with the idea after trying to send money from India to Thailand to organise a bachelor’s party for a friend in 2013. He ran into a problem because a Thai resort refused to take his credit card and insisted on a bank transfer, while his bank in India requested an extensive list of documents for transferring US$640.\nToday, Nium has about 950 employees across more than 25 offices worldwide. Its software helps businesses accept online payments, and allows them to send money and issue physical and virtual credit cards. BLOOMBERG", "url": "https://www.straitstimes.com/business/gic-backed-nium-pushes-back-us-ipo-plans-to-refocus-on-growth"}