{"authors": [], "date_download": "2024-10-12 14:13:07", "date_modify": "2024-10-12 14:13:07", "date_publish": "2023-07-12 07:51:43", "description": "The move applies to ByteDance’s US employees, which include about 7,000 TikTok employees. Read more at straitstimes.com.", "filename": "business_tiktok-parent-bytedance-to-allow-us-staff-to-cash-out-on-shares-sources_1728742387.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/12/2023-07-04T111502Z1431607779RC28W1ACUHE0RTRMADP3BYTEDANCE-CHINA_1.JPG?VersionId=qb9D5mKUuJSnR9lXV6rSAbNrMKzmt__0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_tiktok-parent-bytedance-to-allow-us-staff-to-cash-out-on-shares-sources_1728742387.html", "title": "TikTok parent ByteDance to allow US staff to cash out on shares: Sources", "title_page": "TikTok parent ByteDance to allow US staff to cash out on shares: Sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - ByteDance, the Chinese owner of short video app TikTok, will allow shares owned by US employees to vest without waiting for the company to list in the stock market, thereby letting them cash out, according to people familiar with the matter.\nThe move is aimed at appeasing restless employees who have been waiting for an initial public offering (IPO) to profit from the shares they have been awarded as part of their compensation.\nIt is also an indication that ByteDance, whose worth in excess of US$200 billion (S$268 billion) makes it the world’s most valuable start-up, is in no rush to go public amid Beijing’s heightened scrutiny of China’s technology giants.\nByteDance will now allow restricted shares held by US employees to vest as long as sufficient time has passed, the sources said.\nThe company previously set a “liquidity event”, such as an IPO or company sale, as a condition for the vesting to occur, the sources added.\nOnce vested, the shares can be exchanged by the employees for cash in one of ByteDance’s stock buyback programmes.\nA ByteDance spokesman confirmed that the company has changed its share vesting rules but declined to comment on the details.\n“Our goal is to provide competitive rewards for our employees. We announced an internal solution that will make our US-based employees eligible to participate in future share buyback programmes,” the spokesman said.\nThe move applies to ByteDance’s US employees, which include about 7,000 TikTok employees.\nEmployees own 20 per cent of ByteDance, while 60 per cent is owned by global investors, and 20 per cent by its founders.\nThe US employees have faced heightened political and regulatory scrutiny because of US concerns that ByteDance may be sharing TikTok user data with the Chinese authorities.\nTikTok, which is used by more than 150 million Americans, insists it “has not shared, and would not share, US user data with the Chinese government, and has taken substantial measures to protect the privacy and security of TikTok users”.\nWhile it has so far been spared a contemplated federal ban in the United States, TikTok faces a block in the state of Montana, which it is challenging.\nThe White House has banned TikTok on government-issued devices.\nByteDance initiated stock buyback programmes for employees globally in 2017, and had most recently launched one in April, according to the sources.\nThese programmes were not previously accessible to US employees that did not own fully vested stock.\nThe company is planning to launch another buyback programme in the fourth quarter of 2023, the sources said. REUTERS", "url": "https://www.straitstimes.com/business/tiktok-parent-bytedance-to-allow-us-staff-to-cash-out-on-shares-sources"}