{"authors": [], "date_download": "2024-10-12 14:18:56", "date_modify": "2024-10-12 14:18:56", "date_publish": "2024-03-14 13:45:00", "description": "Net profits rose 13.1 per cent from 2022 to $26.1 billion in 2023. Read more at straitstimes.com.", "filename": "business_companies-markets_volkswagen-2023-profits-rise-but-warns-on-slow-sales-growth_1728742736.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/14/GERMANY-AUTOMOBILE-EARNINGS-VOLKSWAGEN-085824.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_volkswagen-2023-profits-rise-but-warns-on-slow-sales-growth_1728742736.html", "title": "Volkswagen 2023 profits rise, but warns on slow sales growth", "title_page": "Volkswagen 2023 profits rise, but warns on slow sales growth | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "FRANKFURT – German auto giant Volkswagen on March 13 reported a forecast-beating rise in profits for 2023 as vehicle deliveries rebounded but warned of slower sales growth in 2024, sending its shares down.\nThe 12 per cent increase in deliveries marked a turnaround following three straight years in decline linked to production disruptions caused by shortages of key components.\nNet profits rose 13.1 per cent from 2022 to €17.9 billion (S$26.1 billion) in 2023. Sales meanwhile grew more than 15 per cent to €322.3 billion.\nThe 10-brand group – which includes Audi, Porsche and Skoda – saw particularly strong sales in Europe and North America.\nIn China, sales grew modestly but at a slower than in 2023, offering the latest evidence that Volkswagen is losing ground in its most important market.\nVolkswagen has fallen behind domestic competitors in China, losing its title as the best-selling auto brand to BYD.\nThe auto giant’s outlook for 2024 was also very subdued. It expects vehicle deliveries to advance in 2024, forecasting a modest increase of up to 3 per cent due to tougher international competition and potential supply chain problems.\nSales growth is similarly expected to come in at 5 per cent, well down on 2023.\n“The persistently high inflation in major economic regions and the resulting restrictive monetary policy measures taken by central banks are expected to dampen consumer demand,” it warned.\n“Continuing geopolitical tensions and conflicts are weighing on growth prospects; risks are associated in particular with the Russia-Ukraine conflict and the confrontations in the Middle East.”\nStalling electric shift\nVolkswagen also warned there could be decreases in demand, “possibly exacerbated by media reports or insufficient communication”.\nThe carmaker came under fresh pressure in February over its operations in China’s troubled Xinjiang region, after the Handelsblatt financial daily reported that forced labour may have been used to build a test track there in 2019.\nFollowing the report, Volkswagen said it was in talks with its Chinese joint-venture partner SAIC “about the future direction of business activities in Xinjiang”.\nVolkswagen chief executive Oliver Blume said on March 13 that the company takes such allegations “very seriously” but “so far, we have not been able to confirm the information” provided.\nIn terms of the operation’s future, Mr Blume insisted Volkswagen had a “responsibility” towards the employees in the joint venture in Xinjiang.\nVolkswagen in 2023 singled out China and the United States as key markets for its future growth, and it is also looking to increase profit margins.", "url": "https://www.straitstimes.com/business/companies-markets/volkswagen-2023-profits-rise-but-warns-on-slow-sales-growth"}