{"authors": [], "date_download": "2024-10-12 14:19:07", "date_modify": "2024-10-12 14:19:07", "date_publish": "2023-10-26 12:13:24", "description": "As the economy slows, cost-conscious consumers are delaying phone upgrades. Read more at straitstimes.com.", "filename": "business_china-q3-smartphone-sales-down-5-but-huawei-boosts-share_1728742747.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/26/2023-09-08T114134Z776559166RC2643AWOH4ERTRMADP3HUAWEI-TECH-SMARTPHONE-SUPPLIERS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-q3-smartphone-sales-down-5-but-huawei-boosts-share_1728742747.html", "title": "China Q3 smartphone sales down 5%, but Huawei boosts share", "title_page": "China Q3 smartphone sales down 5%, but Huawei boosts share | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – Smartphone sales in China fell 5 per cent in the third quarter compared with the same period in 2022, extending a declining trend as the economy slows and cost-conscious consumers delay phone upgrades, according to a research firm.\nSmartphone shipments dropped year on year in the quarter to 66.7 million handsets, Canalys reported on Thursday.\nThe top five smartphone brands in China all saw declining or flat sales compared with 2022.\nVivo experienced the steepest drop at 26 per cent, followed by Oppo with a 10 per cent decrease, Apple with a 6 per cent decline, Honor with a 1 per cent dip, and Xiaomi, which was flat year on year.\nHonor, formerly Huawei’s smartphone brand, which the Chinese tech giant sold off in 2020, took first place in China with shipments of 11.8 million units and an 18 per cent market share.\nOppo and Apple tied for second place, both with 16 per cent share.\nApple maintained its high ranking, partly due to the launch of its iPhone 15 series in China on Sept 22, according to Canalys.\nHuawei was the sixth-largest smartphone brand in China during the quarter.\nWhile Canalys did not provide Huawei’s specific market share, it noted that Huawei’s share increased to reach levels comparable with leading manufacturers in China, thanks to strong demand for its new Mate 60 products.\nHuawei made a surprise launch of its premium Mate 60 Pro phone in late August, which many analysts said uses a domestically made chip and marks a breakthrough in the face of years of US technology sanctions against the company.\n“If Huawei’s new Kirin chips are expanded to mid-range and low-end product lines in the future, it will have the potential to further disrupt the competition among top brands in the market,” said Canalys analyst Lucas Zhong.\nAccording to Counterpoint Research, Huawei sold an estimated 1.6 million units of its Mate 60 series handsets within the first six weeks of its launch.\nAnalyst Ivan Lam stated that the Mate 60 has seen high demand since its launch.\nSales of Apple’s iPhone 15, however, underperformed early sales of the iPhone 14, Counterpoint said. REUTERS", "url": "https://www.straitstimes.com/business/china-q3-smartphone-sales-down-5-but-huawei-boosts-share"}