{"authors": ["Timothy Goh"], "date_download": "2024-10-12 14:19:43", "date_modify": "2024-10-12 14:19:43", "date_publish": "2024-01-30 12:45:00", "description": "The chemicals sector took the lead in such investment commitments, accounting for about 35 per cent. Read more at straitstimes.com.", "filename": "business_economy_singapore-draws-127b-in-fixed-assets-investments-in-2023-set-to-create-over-20000-jobs_1728742783.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/30/IMG3948.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_singapore-draws-127b-in-fixed-assets-investments-in-2023-set-to-create-over-20000-jobs_1728742783.html", "title": "Singapore draws $12.7b in fixed asset investments in 2023, set to create over 20,000 jobs", "title_page": "Singapore draws $12.7b in fixed asset investments in 2023, set to create over 20,000 jobs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Republic attracted $12.7 billion in fixed asset investments in 2023 amid a challenging global environment that impacted business and investor sentiment, the Economic Development Board (EDB) said on Jan 30.\nThis marked a 44 per cent decrease from the $22.5 billion in 2022, which can be attributed to the slowdown in demand for semiconductors.\nIn 2023, the chemicals sector took the lead in fixed asset investment commitments, accounting for about 35 per cent of the total, followed by electronics at 24.2 per cent, and research and development at 16.6 per cent.\nIn all, the projects secured in 2023 are expected to create 20,045 new jobs when they are fully implemented in the next few years. Of the jobs to be created, 58 per cent are in services, 26 per cent in research and development (R&D) and innovation, and the remaining 16 per cent in manufacturing.\nEDB managing director Jacqueline Poh said the return of industrial policy in other countries led to increased competition for investment, while elevated interest rates also raised the barriers for investment and affected the fund-raising environment for start-ups.\n“These factors weigh on our investment commitments, but Singapore’s position as a trusted hub for business, innovation and talent remains a key factor of our attractiveness,” she said at a briefing held at EDB’s office in Raffles City Tower on Jan 30.\nTotal business expenditure came to $8.9 billion in 2023, in line with EDB’s medium- to long-term goals, with the headquarters and professional services sector accounting for nearly 70 per cent of such commitments as more global businesses used Singapore as a hub for their operations and to access other markets.\nTotal business expenditure refers to a company’s incremental annual operating expenditure in Singapore, excluding depreciation. Major components include wages and rental.\nSingapore captured quality investments from various regions, including the United States, Europe and Asia, said EDB. While investments from China and India declined compared with 2022, the Republic saw increased interest from Japanese businesses.\nEDB noted that investment commitments related to R&D and innovation activities in 2023 also increased over the previous year, as multinational companies continue to deepen their presence in Singapore and more foreign start-ups base themselves here.\nIt added that multinational companies have been expanding their partnerships with the local research, innovation and enterprise ecosystem to develop products from Singapore.\nEDB has been promoting innovation through corporate venture-building, with a $10 million Corporate Venture Launchpad programme rolled out in 2021. It enables companies to create new, globally competitive products, services and business ventures.\nSince its introduction, the programme has helped 25 large companies nurture new venture concepts here. Out of these companies, 15 have plans to launch or have launched new ventures in areas like artificial intelligence (AI), data services, climate technology and agricultural technology.\nEDB said the business and investment outlook for 2024 remains challenging due to ongoing geopolitical tensions, policy uncertainty created by electoral contests in many jurisdictions, increased competition for investments, and macroeconomic uncertainty.\nIts chairman Png Cheong Boon noted the heightened competition for investments, as an increasing number of countries intensify their efforts to attract foreign direct investments. These countries include those with abundant resources and significantly larger domestic markets compared with Singapore.\n“Rising business costs and resource constraints in Singapore have impacted our competitiveness for investments,” he said.\n“While we have built a good pipeline of projects for the future, we are cognisant of needing to stay ahead of the competition so that Singapore remains attractive to both global and Asian corporates and start-ups.”\nLooking ahead, EDB said it will focus on a number of key areas, including facilitating collaboration between multinational companies and local businesses.\nIt will also double down on areas such as healthcare, environmental sustainability and aerospace, and work with large corporates to take advantage of opportunities in areas such as AI and digitalisation to increase productivity.\nIn terms of manpower, EDB will work with companies to train or reskill Singaporeans for opportunities in growing sectors. It will also focus on developing Singaporeans to assume leadership positions, both locally and internationally.\nHelping firms tap AI\nOne industry professional working in the growing technology sector is Ms Ang Wan Qi, 26, a customer engineer at Google Cloud. She believes AI is not just another technological fad, as there are many uses for it that show it can rapidly transform industries and society for the long term, in areas like healthcare and climate change.\nFor her, Singapore’s AI market holds huge potential, and the rise of generative AI, a subset of AI that focuses on content creation, adds momentum to an already thriving ecosystem.\n“We’ve cultivated a remarkable environment here, with top-tier AI research labs being set up here, and start-ups and established tech companies offering AI solutions. This also leads to opportunities for individuals like myself to develop skills and talent in this space,” said Ms Ang, who developed an interest in technology from a young age.\nHer day-to-day responsibilities include managing technical relationships with Google Cloud’s customers by identifying technical challenges and developing strategies to resolve them.\nShe has also conducted generative AI workshops for more than 250 participants from 50 companies and agencies, guiding them on utilising Google Workspace tool Duet AI and other Google Cloud products. This was part of the AI Trailblazers initiative, announced in July 2023, to identify and develop generative AI uses for 19 industry and 35 government agencies.\nMs Ang added: “With the Government’s strong support, through initiatives like the National AI Strategy 2.0, I see Singapore being poised to not only address societal challenges, which can benefit us when we fully adopt technologies like AI, but also become a global leader in developing AI solutions for the region and beyond.”\nLaunched in December, the strategy focuses on nurturing talent, promoting a thriving AI industry and sustaining it with infrastructure and research that ensure AI serves the public good.\nLearning the ropes at 50\nIn an unexpected career change, Ms Ann Wong, 55, went from being part of the service staff at DB Schenker Singapore’s canteen to becoming a store keeper in the logistics industry – another growth sector.\nIn 2021, after she had worked in the canteen for about 15 years, it ceased operations during an office renovation.\nHer colleagues and former boss then encouraged her to become a full-time logistics employee at the logistics and supply chain company, despite her lack of experience.", "url": "https://www.straitstimes.com/business/economy/singapore-draws-127b-in-fixed-assets-investments-in-2023-set-to-create-over-20000-jobs"}