{"authors": [], "date_download": "2024-10-12 14:19:10", "date_modify": "2024-10-12 14:19:10", "date_publish": "2022-03-07 15:16:13", "description": "TOKYO (BLOOMBERG, REUTERS) - Fast Retailing, Asia's largest retailer and parent of Uniqlo, will continue to operate in Russia even as international pressure to isolate the country for its invasion of Ukraine sees waves of companies pull out. Read more at straitstimes.com.", "filename": "business_economy_uniqlo-owner-pledges-to-stay-in-russia-as-wave-of-companies-exit_1728742750.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/07/AK_uq_070322.jpg?VersionId=nP66Aq9vCVJOz9.Fr1JqKboqVVxfjKkX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_uniqlo-owner-pledges-to-stay-in-russia-as-wave-of-companies-exit_1728742750.html", "title": "Uniqlo owner pledges to stay in Russia as wave of companies exit", "title_page": "Uniqlo owner pledges to stay in Russia as wave of companies exit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO (BLOOMBERG, REUTERS) - Fast Retailing, Asia's largest retailer and parent of Uniqlo, will continue to operate in Russia even as international pressure to isolate the country for its invasion of Ukraine sees waves of companies pull out.\n\"Clothing is a necessity of life. The people of Russia have the same right to live as we do,\" chief executive Tadashi Yanai said, according to e-mailed remarks that were first published by Nikkei. While he is against the war and urged every country to oppose it, all 50 Uniqlo stores will continue to operate in Russia.\nHis remarks run counter to moves by some of the world's biggest brands to exit or suspend operations in Russia, a dramatic reversal of three decades of investment by Western and other foreign businesses following the collapse of the Soviet Union in 1991.\nMr Yanai has said he questions a trend that pressures companies to make political choices.\nIn April last year, he declined to comment on issues around sourcing cotton from China's Xinjiang region, a month before it was revealed the US had earlier blocked a shipment of Uniqlo shirts on concerns about forced labour. The company also faces a French probe alongside a number of fashion brands.\nNike and others have pledged not to use any cotton from Xinjiang at all, a step Fast Retailing has not taken yet, though the company insists there is no forced labour in its supply chain.\nRussia's invasion of Ukraine has drawn international condemnation, sparked trade restrictions and financial penalties, and spurred an exodus of global companies.\nFast Retailing's bigger rival Inditex is temporarily closing its 502 stores in Russia and suspending online sales. Apple and Nike have also closed stores, while carmakers including BMW and General Motors have suspended vehicle deliveries.\nThe Japanese government has followed the line of the US and much of Europe in imposing a raft of sanctions, including freezing the assets of a number of Russian officials and oligarchs, as well as those of financial institutions including Russia's central bank.\nSo far, Japanese companies are split on exiting Russia. Those that have halted activity have tended to cite supply chain disruption rather than human rights.\nThe country's biggest carmakers, Toyota Motor and Honda Motor, said they are halting vehicle shipments to Russia, while a business lobby warned trading giants Mitsubishi and Mitsui & Co not to rush into exiting from a Russian oil and gas project.\nJapan Tobacco, which has a 37 per cent stake of the Russian market, continues to operate in Russia and says it is \"fully committed\" to complying with national and international sanctions.\nJapan's trading houses, commodity giants long seen as quasi-governmental arms integral to Japan's energy supply, have big ties to Russia. Last year, Russia was Japan's second-biggest supplier of thermal coal and its fifth-largest of both crude oil and liquefied natural gas.", "url": "https://www.straitstimes.com/business/economy/uniqlo-owner-pledges-to-stay-in-russia-as-wave-of-companies-exit"}