{"authors": [], "date_download": "2024-10-12 13:28:38", "date_modify": "2024-10-12 13:28:38", "date_publish": "2024-10-03 08:45:00", "description": "The currency saw its sharpest daily drop in more than two years. Read more at straitstimes.com.", "filename": "business_companies-markets_yen-plunges-as-new-pm-bank-of-japan-dim-rate-hike-hopes_1728739718.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/wgt-japanyen-031024.jpg?VersionId=MuNtn72g_kFlw2JvVChaDkRuM4GPmZXY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_yen-plunges-as-new-pm-bank-of-japan-dim-rate-hike-hopes_1728739718.html", "title": "Yen plunges as new prime minister and Bank of Japan dim rate hike hopes", "title_page": "Yen plunges as new prime minister and Bank of Japan dim rate hike hopes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - The yen plunged after Japan’s new prime minister, Mr Shigeru Ishiba, jolted currency markets by saying the economy is not ready for another interest rate hike from the central bank.\nThe Japanese currency dropped 0.25 per cent to 146.725 per US dollar on Oct 3, after falling more fell more than 2 per cent overnight after Mr Ishiba’s comment, which was followed by similarly cautious remarks from Bank of Japan (BOJ) governor Kazuo Ueda.\nIf the move holds, it would mark the yen’s sharpest daily drop in more than two years, far surpassing the swings seen during the intense market volatility of early August.\nAgainst the Singapore currency, the yen was trading little changed at 113.2490 as at 4.45pm Singapore.\nThe yen’s volatility this week “highlights a very jittery market suggestive of deep-seated uncertainties about BOJ policy and the potential impact or interference of the Prime Minister,” said Ms Jane Foley, head of foreign exchange strategy at Rabobank. “Going forward, I would expect less commentary from the Prime Minister about BOJ policy in view of the market’s sensitivity.”\nIn early August, traders painfully pulled back on currency bets funded by borrowing in yen, which offers a lower interest rate than Group of 10 peers, as the BOJ moved to raise interest rates. Volatility spiked and the yen initially rallied amid the global sell-off in so-called carry trades.\nNow, with the BOJ likely to hold off on rate hikes that might undercut the new administration, the outlook for the Japanese currency is souring.\n“If the BOJ hikes the policy rate and shocks the market like on August 5, the impact to the Ishiba administration will be significant,” said Mitsubishi UFJ Trust and Banking in New York foreign exchange trader Yuya Yokota. “So, the BOJ will not hike their policy rate again this year, and the depreciation of the yen will continue to the end of this year.”\nThe yen’s decline was matched by a sell-off in Treasuries in the wake of a stronger-than-expected reading of the US jobs market, with the yield on benchmark 10-year debt rising some 5 basis points to 3.78 per cent. After Federal Reserve chairman Jerome Powell said on Sept 30 that the US economy remains on solid footing, traders have tempered expectations of outsized Fed rate cuts.\n“Powell reiterated that the Fed is more hawkish than the market on this year’s pace, and now the BOJ is saying that hikes are not on the table any more for now – a double whammy for the yen,” said Dr Leah Traub, a portfolio manager and head of the currency team at Lord Abbett. “The market got too bearish on the dollar a couple of weeks ago and now has to reposition.”\nYen option traders remain optimistic on the currency over the next week, month and quarter, although bullish sentiment has eased since early September. Hedge funds, meanwhile, remain short the currency but have trimmed bearish wagers in recent weeks. The yen’s plunge follows another 1 per cent dive two days earlier, which came after Powell’s comments pushed the dollar broadly higher against its Group of 10 peers. BLOOMBERG", "url": "https://www.straitstimes.com/business/companies-markets/yen-plunges-as-new-pm-bank-of-japan-dim-rate-hike-hopes"}