{"authors": [], "date_download": "2024-10-12 14:20:44", "date_modify": "2024-10-12 14:20:44", "date_publish": "2023-10-05 11:40:00", "description": "The cuts are part of a plan to trim headcount by about 300 people across Barclays, sources said. Read more at straitstimes.com.", "filename": "business_barclays-cuts-50-senior-dealmakers-as-firmwide-job-cuts-begin_1728742844.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/05/2023-10-02T050155Z1503727609RC2OVZ951KMTRTRMADP3BARCLAYS-WHISTLEBLOWER.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_barclays-cuts-50-senior-dealmakers-as-firmwide-job-cuts-begin_1728742844.html", "title": "Barclays cuts 50 senior dealmakers as firm-wide job cuts begin", "title_page": "Barclays cuts 50 senior dealmakers as firm-wide job cuts begin | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Barclays is dismissing roughly 50 senior dealmakers as part of the banking giant’s annual culling of employees in its investment bank.\nThe cuts are part of a plan to trim headcount by about 300 people across the corporate and investment bank, according to sources familiar with the matter. This amounts to about 3 per cent of total headcount in the unit, which also includes Barclays’ trading operations.\nA spokesperson for Barclays declined to comment.\nBarclays and its rivals have been contending with a prolonged slump in dealmaking and capital markets activity as corporate chiefs remain on the sidelines amid higher interest rates around the world. For its part, Barclays’ investment banking fees dropped 15 per cent in the second quarter.\nWall Street firms routinely conduct annual cuts based on performance to maintain their competitiveness and adjust businesses to shifting markets.\nGoldman Sachs Group has been planning to begin its annual cut of underperforming workers. Citigroup has also dismissed hundreds of people across both its investment banking and trading divisions in 2023, including dozens of workers in September.\n“We always continually modulate and modify that workforce,” Barclays chief executive officer C.S. Venkatakrishnan said. “What you see at Barclays is no different from what you see anywhere else.”\nThe company has been investing in the banking division after naming two new global co-heads of the business earlier in 2023. As part of that, Barclays has also hired more than 30 managing directors and directors for the unit. BLOOMBERG", "url": "https://www.straitstimes.com/business/barclays-cuts-50-senior-dealmakers-as-firmwide-job-cuts-begin"}