{"authors": ["Vivienne Tay"], "date_download": "2024-10-12 13:28:48", "date_modify": "2024-10-12 13:28:48", "date_publish": "2023-10-20 13:12:00", "description": "Understating or omitting income due to incomplete recording of revenue was a common tax filing mistake. Read more at straitstimes.com.", "filename": "business_iras-recovers-79-million-in-taxes-penalties-following-audits-on-companies_1728739728.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/20/202002041580814347754243600127118521483rdzuann.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_iras-recovers-79-million-in-taxes-penalties-following-audits-on-companies_1728739728.html", "title": "Iras recovers $79 million in taxes, penalties following audits on companies", "title_page": "Iras recovers $79 million in taxes, penalties following audits on companies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Inland Revenue Authority of Singapore (Iras) recovered $79 million in taxes and penalties between July 2020 and June 2023 after audits on companies.\nThis was from companies that filed erroneous corporate income tax returns for the 2019 to 2021 assessment years, Iras said on Friday.\nThe recovery came after the tax regulator conducted audits on companies.\nOf the cases examined, two-thirds were picked up through Iras’ compliance audit programmes with the aid of data analytics tools. The remaining were identified through random sampling and qualitative analysis, such as environmental scanning and tip-offs.\nUnderstating or omitting income due to incomplete recording of revenue was among the four common tax filing mistakes made by companies.\nExamples include food and beverage companies omitting sales earnings from orders placed through food delivery platforms and websites, and construction companies failing to declare income from the sale of scrap materials.\nIras also highlighted poor record-keeping practices at family-owned or managed companies.\nSome of these companies failed to retain enough support documents to substantiate their claims for purchases and expenses, while others did not draw clear distinctions between business and private expenses.\nSome claimed tax deductions on remuneration paid to company directors or family members that did not match the services rendered.\nOther common tax filing mistakes include wrong claims of capital allowances on assets that did not qualify as “plant and machinery” and failure to apply the arm’s length principle for related-party services.", "url": "https://www.straitstimes.com/business/iras-recovers-79-million-in-taxes-penalties-following-audits-on-companies"}