{"authors": [], "date_download": "2024-10-12 14:18:39", "date_modify": "2024-10-12 14:18:39", "date_publish": "2023-01-13 15:49:53", "description": "Tesla's move follows price cuts announced last week in China and other Asian markets. Read more at straitstimes.com.", "filename": "business_tesla-cuts-prices-in-us-europe-in-pivot-to-drive-sales_1728742719.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/13/aitesla1301_0.JPG?VersionId=YMgG5B3ZdyF0xzLmNYreuUHTy_Pnz3Qc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_tesla-cuts-prices-in-us-europe-in-pivot-to-drive-sales_1728742719.html", "title": "Tesla cuts prices in US, Europe in pivot to drive sales", "title_page": "Tesla cuts prices in US, Europe in pivot to drive sales | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN – Tesla has slashed prices on its electric vehicles in the United States and Europe, the automaker’s website showed, extending a new strategy of aggressive discounting after missing Wall Street estimates for deliveries.\nThe US price cuts, announced late on Thursday in US time on the Model 3 sedan and Model Y crossover sport utility vehicle, ranged between 6 per cent and 20 per cent compared with prices before the discount, according to Reuters calculations. This is before accounting for an up to US$7,500 (S$9,900) US tax credit that took effect for many electric vehicle models at the start of January.\nIt also cut prices for its Model X luxury crossover SUV and Model S sedan in the US.\nIn Germany, Tesla cut prices on the Model 3 and the Model Y – its global top-sellers – by between about 1 per cent and almost 17 per cent depending on the configuration. It also cut prices in Austria, Switzerland and France.\nFor a US buyer of the long-range Model Y, the new Tesla price combined with the US subsidy that took effect this month amounts to a discount of 31 per cent. In addition, the Tesla move broadened the vehicles in its line-up eligible for the Biden administration tax credit.\nBefore the price cut, the five-seat version of the Model Y had been ineligible for that credit, a designation that Tesla chief executive Elon Musk had called “messed up”. After the price cut, the long-range version of the Model Y will qualify for the US$7,500 federal credit.\nTaken together with price cuts announced last week in China and other Asian markets, the move marked a reversal in Tesla’s largest markets from the strategy that it had pursued through much of 2022 when demand was strong and average sale prices for its electric vehicles had been trending higher.\n“This should really boost 2023 (Tesla) volumes,” Mr Gary Black, a Tesla investor who has remained bullish on the company and its prospects through the recent, sharp share price decline, said in a tweet. “It’s the right move.”\nBefore the price cut, Tesla inventory in the US, as tracked by the models that its website shows as immediately available, had been trending higher. Prices on used Tesla models had also been declining, increasing the pressure on it to adjust new-car sticker prices.\nNew sales leadership\nThe shift is the first major move by Tesla since appointing its lead executive for China and Asia, Mr Tom Zhu, to oversee US output and sales.\nTesla cut prices in China and other Asian markets last week. Along with a previous price cut announced in October and recent incentives, the China price for a Model 3 or Model Y was down 13 per cent to 24 per cent from September after the recent move, Reuters calculations showed.\nTesla has also cut prices in South Korea, Japan, Australia and Singapore.\nAnalysts had said the China price cuts would boost demand and deepen the pressure for its rivals there, including BYD, to follow suit in what could become a price war in the largest single market for electric vehicles.", "url": "https://www.straitstimes.com/business/tesla-cuts-prices-in-us-europe-in-pivot-to-drive-sales"}