{"authors": [], "date_download": "2024-10-12 14:19:29", "date_modify": "2024-10-12 14:19:29", "date_publish": "2023-03-14 16:35:22", "description": "BERLIN – Volkswagen (VW) raised its five-year investment plan to €180 billion (S$260 billion) as Europe’s biggest carmaker intensifies a push to challenge Tesla’s leadership on electric vehicles (EV).  Read more at straitstimes.com.", "filename": "business_volkswagen-sets-almost-260-billion-spending-plan-to-further-new-technology_1728742769.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/14/2023-03-08T083946Z1932235242RC2JPZ9SXTNHRTRMADP3VOLKSWAGEN-BATTERIES_1.JPG?VersionId=qdsOAnTM4hQqi4m7Fsax1_.vyI_BcVZj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_volkswagen-sets-almost-260-billion-spending-plan-to-further-new-technology_1728742769.html", "title": "Volkswagen sets almost $260 billion spending plan to further new technology", "title_page": "Volkswagen sets almost $260 billion spending plan to further new technology | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN – Volkswagen (VW) raised its five-year investment plan to €180 billion (S$260 billion) as Europe’s biggest carmaker intensifies a push to challenge Tesla’s leadership on electric vehicles (EV).\nNearly 70 per cent of the spending in the next half decade will go to EVs and software, up from 56 per cent during the previous rolling plan, VW said on Tuesday.\nEurope’s largest carmaker is increasing overall spending by 13 per cent compared with its last annual update.\n“We have set clear and ambitious targets and took necessary decisions to streamline processes,” chief executive officer Oliver Blume said in a statement.\nThis year “will be a decisive year for executing strategic goals and accelerating progress across the group”.\nIn late 2022, the carmaker delayed setting new goals on investments, citing a lack of visibility amid the war in Ukraine and significant supply bottlenecks.\nMr Blume, in office since September, has come under pressure to reveal more about his strategic priorities after focusing on fixing the company’s chaotic software push and scrutinising costly projects.\nOn Monday, Volkswagen announced plans to build a battery plant in Canada, its first outside Europe, as the company seeks to fast-track an expansion in the key United States market, which also includes a new US$2 billion (S$2.7 billion) EV plant in South Carolina.\nVW attributed the rise in spending to its battery efforts, which include as many as six factories in Europe alone, as well as securing raw materials to power EVs.\nThe company’s PowerCo battery business is expected to generate sales of more than €20 billion by the end of the decade, VW said.\nThe carmaker is also investing in China, its biggest market, to improve competitiveness with local models to help stop a slide in market share, particularly among EVs.\nWhile VW’s focus is on future technology, its combustion-engine investment will continue to rise before reaching a peak in 2025, when tough new Euro-7 emissions regulation in the European Union come into force.\nVW earlier in March projected revenue to climb as much as 15 per cent in 2023, with operating returns reaching as high as 8.5 per cent on full order books and better access to semiconductors. BLOOMBERG", "url": "https://www.straitstimes.com/business/volkswagen-sets-almost-260-billion-spending-plan-to-further-new-technology"}