{"authors": [], "date_download": "2024-10-12 14:12:42", "date_modify": "2024-10-12 14:12:42", "date_publish": "2023-09-19 10:42:00", "description": "The developments come as Beijing steps up efforts to revive the property sector. Read more at straitstimes.com.", "filename": "business_country-garden-wins-approval-to-extend-yuan-bond-with-sweetener_1728742362.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/19/2023-09-18T031101Z1294110869RC22Q2ABVNKORTRMADP3CHINA-PROPERTY-DEBT-COUNTRYGARDEN.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_country-garden-wins-approval-to-extend-yuan-bond-with-sweetener_1728742362.html", "title": "Sunac, Country Garden debt deals bring respite for China’s property sector", "title_page": "Sunac, Country Garden debt deals bring respite for China’s property sector | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Chinese developers Sunac and Country Garden brought some relief to the crisis-hit property sector by forging debt deals with creditors, but the outlook remained clouded by uncertainty about a recovery in home sales.\nShares in Sunac China Holdings surged as much as 14 per cent on Tuesday after creditors approved its US$9 billion (S$12 billion) offshore debt restructuring plan, the first green light of such a debt overhaul by a major Chinese developer.\nSeparately, cash-starved Country Garden won approval from creditors to extend repayment on another onshore bond, the last in the batch of eight bonds it has been seeking extensions for, two sources familiar with the matter said on Tuesday.\nThe developments come as Beijing steps up efforts to revive the property sector, which accounts for roughly a quarter of the world’s second-largest economy, with a raft of support measures unveiled over the past few weeks.\nSunac said late on Monday that creditors holding 98.3 per cent of the total value of the bonds who attended the vote had approved the restructuring plan proposed and agreed to by some creditors in March.\nThe developer will seek approval of the plan by a Hong Kong court at a hearing scheduled for Oct 5.\nAs part of the restructuring terms, a portion of its debt would be exchanged into convertible bonds backed by its Hong Kong-listed shares along with new notes with maturities of between two and nine years.\n“I will treat it as a positive… We haven’t seen much progress on the offshore market, so this shows at least some Chinese developers are trying to reach an agreement,” said Natixis Corporate and Investment Bank senior economist Gary Ng.\nIf the plan could be implemented well, and depending on whether the recovery of China’s property market could generate sufficient cash flows, investors would be able to get something back, he added.\nWhile Sunac is among a string of Chinese developers that have defaulted on their offshore debt obligations since an unprecedented liquidity crisis hit the property sector in 2021, Country Garden has not missed any offshore payments yet.\nProperty sector outlook\nMajor developers in the process of restructuring their debt include China Evergrande Group, whose liquidity crunch was a turning point in the country’s real estate crisis.\nThe latest debt deals with creditors will give some breathing room to Chinese developers and help them avoid a default or a messy liquidation process, but the success of the agreements will depend on a recovery in the property sector.\nEven as Beijing implements measures to prop up the sector, house prices have continued to decline – latest data shows new home prices fell at their fastest pace in 10 months in August, while falls in real estate investment and sales deepened.\nANZ senior China economist Betty Wang said the support measures could spur some “genuine demand”, especially ahead of the traditional sale season during late September and early October in top-tier cities.\n“However, the pace and the extent of such a turnaround will be much smaller than in previous cycles,” she said in a report published on Tuesday.\n“It’s also questionable whether it will kick off a sustainable rebound, especially considering the uncertain job outlook, deteriorating income inflows, a shift in expectations, and potential increase in housing supply in the long term.” REUTERS", "url": "https://www.straitstimes.com/business/country-garden-wins-approval-to-extend-yuan-bond-with-sweetener"}