{"authors": ["Navene Elangovan"], "date_download": "2024-10-12 13:30:48", "date_modify": "2024-10-12 13:30:48", "date_publish": "2024-09-13 21:15:00", "description": "IBF, MAS will help workers build new skills in areas such as sustainability and digital economy. Read more at straitstimes.com.", "filename": "business_sustainable-finance-genai-included-in-set-of-skills-recommended-for-finance-sector-professionals_1728739848.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/13/yaohui-pixgeneric-3833.jpg?VersionId=l.TVfegzk43dWsV9PKEHBYGAI65OM1qY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_sustainable-finance-genai-included-in-set-of-skills-recommended-for-finance-sector-professionals_1728739848.html", "title": "Sustainable finance, GenAI included in set of skills recommended for finance sector professionals", "title_page": "Sustainable finance, GenAI included in set of skills recommended for finance sector professionals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Sustainable finance and generative artificial intelligence (GenAI) have been added to a list of skills that the Institute of Banking and Finance (IBF) recommends financial-sector professionals pick up to complement their existing functional and technical skills.\nIBF and SkillsFuture Singapore (SSG) are also working together to build sustainable-finance capabilities among real-economy companies, particularly small and medium-sized enterprises, by leveraging IBF’s accredited foundation courses on sustainable finance.\n“Such a joint approach by IBF and SSG will enable a systematic adoption of sustainable-finance practices across the board,” said Deputy Prime Minister Gan Kim Yong on Sept 13.\nSpeaking at an event at The Ritz Carlton Millennia Hotel to commemorate IBF’s 50th anniversary, Mr Gan – who is also chairman of the Monetary Authority of Singapore (MAS) and Minister for Trade and Industry – said the IBF and MAS must help financial-sector workers build new skills in areas such as sustainability and the digital economy to help them ride the next wave of growth.\nTo this end, both parties launched a Jobs Transformation Map (JTM) detailing the impact of sustainability trends on jobs in Singapore’s financial sector in April this year, and key findings of a JTM on GenAI are expected to be released early in 2025. “To complement these JTMs, the IBF, supported by its industry workgroups, has launched a refreshed suite of Future Enabled Skills,” said Mr Gan.\nFuture Enabled Skills are a list of skills identified by IBF as industrywide capabilities required by finance practitioners. IBF offers accredited courses that support upskilling in the listed areas.\nMr Gan said Singapore’s financial sector has to navigate an “increasingly complex and tumultuous” environment. Some challenges that the local financial market will have to face include intensifying geopolitical contestation, climate change and disruptive technologies.\nDomestically, tighter manpower and resource constraints will also make it harder for Singapore to achieve the next bound of growth, said Mr Gan.\nNevertheless, there remain opportunities for Singapore’s financial sector to grow.\nSingapore can serve as a financing hub for global businesses looking to expand into Asean and support the region’s transition to net zero. The Republic can also support the growth of Asean’s digital economy.\n“Singapore’s digital-enabled firms and highly digitalised financial services sector will be in a good position to participate in the fast-growing digital economy,” Mr Gan added.\nTo that end, Singapore must continue to build a strong pipeline of local talent for the financial sector, he said.\nSpeaking at the same event, Mr Chia Der Jiun, chairman of IBF Council, said that as financial institutions navigate “winds of change”, the tripartite partnership between IBF, trade unions and financial institutions will remain important in supporting workforce transformation.\n“The concerted and proactive approach to skills, talent and workforce development has supported the growth and success of Singapore’s financial sector, which in turn creates more job opportunities for the local workforce,” said Mr Chia, who is also a managing director at MAS.\nTen financial institutions were presented with special-edition IBF Golden Jubilee awards by Mr Gan to commemorate IBF’s 50th anniversary and to honour their commitment to skills and workforce development.\nAmong those that were conferred the award were insurance company AIA, which received the IBF Golden Jubilee Advance (Skills Development) Award, and DBS, which received the IBF Golden Jubilee Inspire Award.", "url": "https://www.straitstimes.com/business/sustainable-finance-genai-included-in-set-of-skills-recommended-for-finance-sector-professionals"}