{"authors": [], "date_download": "2024-10-12 14:20:43", "date_modify": "2024-10-12 14:20:43", "date_publish": "2023-08-01 10:58:00", "description": "In July, mainland investors offloaded HK$2.9 billion (S$495 million). Read more at straitstimes.com.", "filename": "business_tencent-becomes-market-laggard-as-china-traders-sell_1728742843.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/01/2023-05-17T090033Z1525846806RC2W8W93L7NNRTRMADP3TENCENT-RESULTS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_tencent-becomes-market-laggard-as-china-traders-sell_1728742843.html", "title": "Tencent becomes market laggard as China traders sell", "title_page": "Tencent becomes market laggard as China traders sell | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Tencent Holdings has fallen out of favour with mainland Chinese investors, burned by volatility and sentiment-driven trading. Getting these investors back on Tencent’s side may prove elusive.\nFor the first time since 2021, onshore investors have sold Tencent shares on a net basis for two months in a row, according to Bloomberg’s calculations of exchange data.\nIn July, mainland investors offloaded HK$2.9 billion (S$495 million) through trading links between Hong Kong, Shenzhen and Shanghai exchanges.\nA former retail trader favourite and China’s most valuable company, Tencent has seen its fortunes wane as concerns over the company’s outlook and selling by its largest shareholder rattle investors.\nOnshore investors are a pillar of support for the stock, and their withdrawal is likely to add to the pressure when shares are struggling to recover from a five-year low in October.\n“Mainland investors all agree it’s cheap, but the price moves of 2022 have just proven that things can go quite extreme in the Hong Kong market,” said Mr Cai Dian, a fund manager at Beijing Eastern Smart Rock Asset Management. He was bullish on the stock as well as other Chinese tech shares over the last two years.\nThe company is still making money, but it is not a good time to buy given that selling by its largest shareholder is weighing on the stock, he added.\nChina investors have been known for their long-standing support for Tencent since the stock was listed in Hong Kong nearly two decades ago. They helped cushion the blow when foreign investors fretted about Beijing’s crackdown on the private sector back in 2021 and also when the company’s biggest shareholder Prosus announced plans to offload its stake in June.\nBut they have had enough. The stock remains too volatile, and the price does not trade according to fundamentals, they say.\nSince pulling out of the market in June, Tencent’s shares have gained about 15 per cent to underperform a 28 per cent jump in the Hang Seng Tech Index.\nThis means that Tencent is missing out on a rally fuelled by recent policy pledges for the sector that sent China tech into a bull market just last week.\n“Southbound selling will, to some extent, hinder the rebound of Tencent. The stock has underperformed in the rebound,” said Mr Willer Chen, senior research analyst at Forsyth Barr Asia.\nInvestors may have moved out of Tencent to buy some higher beta names amid the risk-on sentiment in the China market recently, he added.\nAnd it is not just domestic traders who want out. Tencent’s put-to-call ratio, which underscores bearishness of a stock, has picked up since June after a sharp pullback earlier in 2023.\nThe next test will be Tencent’s second-quarter earnings, due in mid-August, and there are signs that the outlook may improve.\nThe Internet firm is expected to report a 14 per cent year-over-year rise in revenue, accelerating from a quarter earlier, thanks in part to solid gaming revenue growth.\nAnalysts also remain optimistic about its prospects, given the stock has 70 buys and just one sell rating, according to data compiled by Bloomberg.", "url": "https://www.straitstimes.com/business/tencent-becomes-market-laggard-as-china-traders-sell"}