{"authors": [], "date_download": "2024-10-12 14:21:24", "date_modify": "2024-10-12 14:21:24", "date_publish": "2024-09-03 10:14:00", "description": "The tech tycoon and his 18-year-old daughter died in a yacht tragedy off Sicily coast. Read more at straitstimes.com.", "filename": "business_hewlett-packard-enterprise-to-pursue-52-billion-damages-claim-after-mike-lynch-yacht-death_1728742884.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/415391823.jpg?VersionId=j48a9ZVpPRMwV_wdQ62uqQRSnPZegHiE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_hewlett-packard-enterprise-to-pursue-52-billion-damages-claim-after-mike-lynch-yacht-death_1728742884.html", "title": "Hewlett Packard Enterprise to pursue $5.2 billion damages claim after Mike Lynch yacht death", "title_page": "Hewlett Packard Enterprise to pursue $5.2 billion damages claim after Mike Lynch yacht death | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Hewlett Packard Enterprise (HPE) said it intends to pursue the US$4 billion (S$5.2 billion) damages claim in London against the estate of the recently deceased British tech tycoon Mike Lynch.\nJust over a week after the bodies of Mr Lynch and his 18-year-old daughter Hannah were recovered from the wreck of his sunken yacht, the US company said it planned to collect any damages that are awarded by a London court. HPE won the British civil case over the collapse of Mr Lynch’s Autonomy Corporation and is waiting for a judge to decide how much it is owed.\n“It is HPE’s intention to follow the proceedings through to their conclusion,” the company said in a statement on Sept 2.\nThe decision to move forward puts HPE on a reputational tightrope. While a British civil claim automatically ensures that the case passes to the estate of a defendant in the event of a death, the prospect of pursuing the money from Mr Lynch’s family is likely to be deeply unpopular after the tragedy.\n“It was likely that they were going to face criticism going ahead with a claim against his grieving widow,” said Mr Robin Henry, a partner at law firm Collyer Bristow, which is not involved in the case. “I think they are trying to mitigate the reputational damage by saying they are under an obligation to protect the interests of HPE’s shareholders.”\nA spokesperson for Mr Lynch’s family declined to comment.\nAfter one of the longest and most expensive trials in British history, Judge Robert Hildyard ruled in 2022 that Mr Lynch had fraudulently boosted the value of the company. “One of the tragedies of the case is clear: an innovative and ground-breaking product, its architect and the company will probably always be associated with fraud,” the judge said in the ruling.\nIn total, HPE was seeking US$4 billion from Mr Lynch and his finance chief, but the judge had cautioned that it was likely to get substantially less than that.\nMr Lynch died after his luxury yacht foundered in severe weather off the coast of Sicily. He was celebrating his acquittal from US criminal charges with a small group of advisers when the storm struck. His wife, Angela Bacares, managed to escape with her life, while Mr Lynch’s other daughter wasn’t on board at the time.\nCoincidentally, Mr Stephen Chamberlain, 52, Mr Lynch’s former co-defendant in the US fraud trial, died in hospital after being hit by a car on Aug 17 while jogging in Cambridgeshire, Britain. News of his death came on Aug 19, just hours after Mr Lynch’s yacht sank. BLOOMBERG", "url": "https://www.straitstimes.com/business/hewlett-packard-enterprise-to-pursue-52-billion-damages-claim-after-mike-lynch-yacht-death"}