{"authors": [], "date_download": "2024-10-12 13:51:16", "date_modify": "2024-10-12 13:51:16", "date_publish": "2022-09-14 09:47:43", "description": "The Sing dollar held relatively steady against the dollar at about S$1.41 to a dollar. Read more at straitstimes.com.", "filename": "business_banking_us-dollar-pushes-towards-fresh-24-year-peak-versus-yen-after-inflation-shock_1728741076.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/14/ac_us-yen_140922.jpg?VersionId=H7xug0F7JJUB_An_ctayTViuliUAAIjI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking_us-dollar-pushes-towards-fresh-24-year-peak-versus-yen-after-inflation-shock_1728741076.html", "title": "US dollar pushes towards fresh 24-year peak versus yen after inflation shock", "title_page": "US dollar pushes towards fresh 24-year peak versus yen after inflation shock | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - The US dollar climbed close to a 24-year peak against the yen on Wednesday amid a jump in US yields after hotter-than-expected inflation boosted bets for even more aggressive monetary tightening by the Federal Reserve next week.\nThe dollar rose as high as 144.965 yen in the Asian session, taking it close to last Wednesday's high of 144.99, a level not seen since August 1998, before last trading little changed at 144.56.\nOvernight, the currency pair, which is extremely sensitive to rate differentials, surged 1.26 per cent as 10-year Treasury yields climbed to a three-month high following an unexpected rise in the US consumer price index for August.\n\"This has really shattered the illusion... that inflation had peaked and was coming down,\" Mr Ray Attrill, head of currency strategy at National Australia Bank, said in a podcast. \"Hence, markets have decided that next week's Fed decision is not between 50 and 75 (basis point increase), it is now between 75 and 100.\"\nNomura's economists also said they now believe a 100 basis point rate hike is the most likely outcome.\n\"Markets underappreciate just how entrenched US inflation has become and the magnitude of response that will likely be required from the Fed to dislodge it,\" they wrote in a note.\nThe dollar index, which measures the currency against six major peers including the yen, euro and sterling, was little changed at 109.750, after surging 1.44 per cent overnight, its biggest one-day percentage gain since March 2020.\nThe euro edged up 0.11 per cent to US$0.9981, clawing back a little of Tuesday's 1.52 per cent tumble. Sterling rose 0.17 per cent to US$1.151, but after a 1.61 per cent plunge overnight.\nThe Singapore dollar held relatively steady against the dollar at about S$1.41 to a dollar.\n\"The dollar is screaming overvaluation, but in order to see that as correct, you are going to need some sort of catalyst for a cyclical downturn in the dollar, and these latest developments have challenged that,\" Mr Attrill said.\nThe risk-sensitive Aussie dollar rose 0.25 per cent to US$0.675, although that jump paled in comparison with its precipitous 2.26 per cent slide overnight.\nLeading cryptocurrency Bitcoin lost another 0.21 per cent to US$20,191, following a 9.93 per cent decline on Tuesday. REUTERS", "url": "https://www.straitstimes.com/business/banking/us-dollar-pushes-towards-fresh-24-year-peak-versus-yen-after-inflation-shock"}