{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 14:16:58", "date_modify": "2024-10-12 14:16:58", "date_publish": "2023-10-30 12:02:00", "description": "The local financial sector could also soon see a turnaround. Read more at straitstimes.com.", "filename": "business_mas-sees-budding-recovery-in-singapore-s-electronics-financial-sectors-as-global-environment-turns_1728742618.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/30/2022082549570006d6f19110-67b9-4ba6-b20f-bef50f81934d.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_mas-sees-budding-recovery-in-singapore-s-electronics-financial-sectors-as-global-environment-turns_1728742618.html", "title": "MAS sees budding recovery in Singapore’s electronics, financial sectors as global environment turns", "title_page": "MAS sees budding recovery in Singapore’s electronics, financial sectors as global environment turns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Republic’s 2024 economic outlook is contingent on global demand for goods made here, in particular electronic devices and components, the central bank said on Monday.\nWhile the global electronics industry is showing signs of improvement, it could still experience challenging conditions, the Monetary Authority of Singapore (MAS) said in its biannual macroeconomic review report.\nAfter two years of strong growth in 2021 and 2022, the global electronics industry has faced an extended slump in demand for goods ranging from mobile phones to PCs amid several rounds of interest rate hikes triggered by persistently high inflation.\nGlobal semiconductor sales recorded its 14th consecutive month of year-on-year contraction in August, although the pace of decline slowed to 7.1 per cent in the July-August period, from 19 per cent in the first half of 2023.\nThe nascent pickup was led mainly by fabless semiconductor companies, which design and develop semiconductor chips and integrated circuits but do not own or operate their own semiconductor fabrication facilities. These include the designers of graphic processing units used in servers for generative artificial intelligence (AI) applications, said MAS, referring to chipmakers such as Nvidia, Qualcomm and Broadcom, which contract foundries such as Taiwan Semiconductor Manufacturing Company and GlobalFoundries to make their chips.\nIn contrast, most memory and logic chipmakers remained in the doldrums, as producers of information technology (IT) products such as smartphones and PCs opted to use chips and other parts stored in inventory in favour of new orders.\nOn the whole, demand for IT products has been tepid in Singapore’s top two final demand markets – China and the United States, MAS said. Hence, while there are signs of sustained demand from expansions in generative AI, electric vehicles (EVs), the Internet of Things and 5G networks, a recovery in the wider sector may take longer than expected.\nMAS noted that major chip companies are forecasting a cautiously optimistic revenue outlook for the coming quarters.\nIt said research houses such as Nomura, Semiconductor Intelligence and Gartner are anticipating a modest pickup in global chip sales for the rest of 2023, bringing their median full-year forecast to minus 10.3 per cent, compared with minus 15.9 per cent in the first eight months of 2023, implying slower growth declines than previously expected.\nBy 2024, the decline in sales is projected to reverse and show growth of 11.8 per cent.\nMAS warned, though, that there could be continued headwinds to the near-term prospects of the global tech sector. “First, a broader slowdown in the major economies could restrain end-demand for consumer and enterprise IT products and therefore chip orders.”\nIn particular, China – the world’s largest chip market – has posed a significant drag on global chip sales since the third quarter of 2022.\nMAS added that the tech war between the US and China remains a risk. “From the initial focus on leading-edge chips for advanced technologies such as AI and supercomputing in October 2022, restrictions imposed by both sides have since broadened to the equipment and materials to manufacture chips for a wider range of strategic applications such as 5G network infrastructure, smartphones and EVs.”\nConsequently, “some domestic players could be adversely affected by disruptions to the supply of materials or export markets if the current restrictions were to broaden and become more stringent and prolonged than anticipated”, MAS said.\nThe other industry that could benefit from an improvement in the overall global macro environment would be the financial sector, MAS said.\nWith inflation coming off its peak in Singapore and elsewhere, the local financial sector is showing early signs of a pickup and may post a modest recovery through 2024, MAS said.\nThe central bank said that the actual, inflation-adjusted value added by the financial sector has been lacklustre so far in 2023.\n“Amid the high interest rate environment, loans to both residents and non-residents have continued to decline. Likewise, fees and commission income among the banks, insurers and fund managers has been tepid.”\nThe central bank added that demand for relatively riskier investments such as unit trusts and insurance savings products has fallen as investor preferences have shifted towards lower risk and lower duration – almost cash equivalent – products, such as fixed deposits and treasury bills, MAS said.\nWhile sluggish external demand and restrictive financial conditions will continue to weigh on the financial sector, fee incomes could see an uptick in 2024 with interest rates set to peak by the end of 2023.\nGiven that Singapore uses its currency as its main monetary policy tool, interest rates here follow the lead of US rates, which are predicted to ease through the next two years.\nBased on the US Federal Reserve’s median projections as at September 2023, the federal funds rate is projected to peak at 5.6 per cent at the end of 2023, before moderating to 5.1 per cent in 2024 and 3.9 per cent in 2025.\n“The moderation in interest rates could induce shifts in asset allocation behaviour, with increased rotations into bond and equity funds from short-term cash equivalent assets. This will support fee incomes in the banks and fund management segments,” MAS said.", "url": "https://www.straitstimes.com/business/mas-sees-budding-recovery-in-singapore-s-electronics-financial-sectors-as-global-environment-turns"}