{"authors": ["Angela Tan"], "date_download": "2024-10-12 14:17:03", "date_modify": "2024-10-12 14:17:03", "date_publish": "2023-10-13 08:14:09", "description": "Boosted by tourism and construction, the economy expanded 1 per cent over the previous quarter. Read more at straitstimes.com.", "filename": "business_economy_singapore-economy-grows-07-in-q3-faster-than-expected-flash-data_1728742623.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/13/yaohui-pixgeneric-3180.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_singapore-economy-grows-07-in-q3-faster-than-expected-flash-data_1728742623.html", "title": "Singapore economy grows 0.7% in Q3, beating forecasts", "title_page": "Singapore economy grows 0.7% in Q3, beating forecasts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore’s economy grew at a faster than expected pace in the third quarter of 2023, boosted by tourism, and with manufacturing returning to a small quarter-on-quarter growth.\nGross domestic product (GDP) for the July to September period grew 0.7 per cent year on year, according to advance estimates from the Ministry of Trade and Industry (MTI) on Friday.\nThis was better than the second quarter, when the economy grew 0.5 per cent year on year.\nOn a quarter-on-quarter seasonally adjusted basis, the economy expanded 1 per cent, faster than the 0.1 per cent growth in the preceding quarter.\nThe figures beat analysts’ estimates, with the median forecast in a Bloomberg survey of economists that the economy would expand 0.4 per cent in the third quarter from a year ago and grow 0.6 per cent from the previous three months.\nOn Friday, the Monetary Authority of Singapore (MAS) said GDP growth in 2023 is expected to come in at the lower half of the 0.5 per cent to 1.5 per cent forecast range.\n“Against the external outlook, prospects for the Singapore economy are muted in the near term, but should improve gradually in the second half of 2024,” the central bank said.\nGrowth in Singapore’s major trading partners should gradually pick up later in 2024 as inflation continues to ease and the electronics cycle turns up modestly, although the timing and extent of the recovery is subject to significant uncertainty, it added.\nAs at September, MAS expects 2023 headline inflation to average 4.5 per cent to 5.5 per cent, and core inflation to average 3.5 per cent to 4.5 per cent.\nThe advance estimates, computed largely from data in July and August, showed that the manufacturing sector contracted by 5 per cent year on year in the third quarter, following a 7.7 per cent contraction in the second quarter.\nMs Selina Ling, chief economist and head of global markets research and strategy at OCBC Bank, said the year-on-year contraction in the manufacturing sector was milder than expected.\nOn a quarter-on-quarter seasonally adjusted basis, the sector expanded by 0.2 per cent, a turnaround from the 1.5 per cent contraction in the second quarter.\nGrowth in the construction and services sectors moderated but remained relatively resilient and helped offset the continued drag from manufacturing. The latter saw broad-based weaknesses, with the exception of the transport engineering cluster.\nThe construction sector grew by 6 per cent year on year in the third quarter, extending the 7.7 per cent growth in the preceding quarter. Growth was buoyed by construction activities in the public and private sectors, though the momentum was beginning to wane.\nOn a quarter-on-quarter seasonally adjusted basis, the construction sector posted growth of 0.6 per cent, moderating from the 2.7 per cent growth in the second quarter.\nWithin the services sector – which accounts for around two-thirds of the economy – the outperformers were accommodation and food services, real estate, administrative and support services and other services.\nThese grew 4.7 per cent year on year in the third quarter, albeit slower than the 6.1 per cent growth in the second quarter.\nThe accommodation sector saw robust growth on the back of the continued recovery in international visitor arrivals.\nThe information and communications, finance and insurance and professional services sectors expanded by 1.5 per cent year on year in the third quarter, following a 1.2 per cent growth in the previous quarter.\nGrowth in the information and communications sector was supported by the information technology and information services segment. Growth in the professional services sector was driven by the architectural and engineering, technical testing and analysis and other professional, scientific and technical services segments.\nThe wholesale and retail trade and transportation and storage sectors slowed to grow 0.6 per cent year on year in the third quarter, compared with a 2.2 per cent expansion in the second quarter.\nOn a quarterly basis, the sectors actually shrank by 0.1 per cent in the third quarter, a reversal from the 3 per cent expansion in the preceding quarter.\nThe finance and insurance sector contracted, largely due to the weak performance of the banking and insurance segments.\nDr Chua said the cooler services growth was within expectations, reflecting fading reopening tailwinds and slowing trade-related wholesale and transport services growth.\nMaybank kept its GDP growth forecast at 0.8 per cent for 2023 and 2.2 per cent in 2024.\nMeanwhile, Goldman Sachs raised its 2023 GDP growth forecast for Singapore to 0.8 per cent from 0.5 per cent following the higher-than-expected flash GDP figure.\nThe Wall Street investment bank is not expecting additional MAS tightening as core inflation pressures are expected to ease over the coming year.\nMr Ryota Abe, an economist at Sumitomo Mitsui Banking Corporation, warned that the recovery might be short-lived, given that Singapore’s manufacturing sector is driven by trends in global demand for goods.\n“MAS’ prediction that Singapore’s economy will gradually recover in the second half of 2024, when rate cuts begin to take effect globally, is persuasive to some extent,” he said.\nHis GDP growth rate forecasts are 1 per cent for 2023 and 2.2 per cent for 2024.\nHe said MAS will need to maintain the tight monetary policy for some time amid inflationary pressures.\nApart from uncertainties over the US and China’s growth, economists also cited the conflict in the Middle East as among the potential downside risks to Singapore’s economy.\nThe Israel-Hamas war is threatening to push up energy costs, even as Singapore gas, electricity and water tariffs are set to rise.", "url": "https://www.straitstimes.com/business/economy/singapore-economy-grows-07-in-q3-faster-than-expected-flash-data"}