{"authors": [], "date_download": "2024-10-12 14:12:29", "date_modify": "2024-10-12 14:12:29", "date_publish": "2023-09-26 07:40:00", "description": "The developer at the centre of China’s property crisis said its unit defaulted on 4 billion yuan in principal plus interest. Read more at straitstimes.com.", "filename": "business_evergrande-crisis-worsens-as-defaults-pile-up-former-ceo-and-cfo-detained_1728742349.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/26/2023-08-28T014438Z1652983001RC2OW2A5Z5W3RTRMADP3CHINA-PROPERTY-DEBT-EVERGRANDE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_evergrande-crisis-worsens-as-defaults-pile-up-former-ceo-and-cfo-detained_1728742349.html", "title": "Evergrande crisis worsens as defaults pile up, former CEO and CFO detained", "title_page": "Evergrande crisis worsens as defaults pile up, former CEO and CFO detained | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – China Evergrande Group’s crisis has deepened after its mainland unit failed to repay an onshore bond, adding a new layer of uncertainty to the developer’s future as a restructuring plan with its offshore creditors teeters.\nMeanwhile, Caixin reported on Monday that Mr Xia Haijun, a former chief executive of Evergrande, and Mr Pan Darong, a former chief financial officer, have been detained by the Chinese authorities.\nThe developer at the centre of China’s property crisis said late on Monday that its Hengda Real Estate Group subsidiary defaulted on 4 billion yuan (S$748 million) in principal plus interest due that day.\nIn March, Hengda missed an interest payment on the 5.8 per cent yuan bond issued in 2020, and said it would “actively” negotiate with bond holders to find a solution, a promise it reiterated on Monday.\nEvergrande is running out of time to get what would be one of the nation’s biggest restructurings back on track after setbacks in recent days raised the risk of a potential liquidation.\nThe firm has scrapped key creditor meetings at the last minute, saying it must revisit its restructuring plan as it faced the detention of money management unit staff, and had been unable to meet regulator qualifications to issue new bonds.\nThat last item is a major blow to its planned restructuring of at least US$30 billion (S$41 billion) of offshore debt that would have creditors swap defaulted notes for new securities.\nEvergrande’s shares plunged as much as 25 per cent on Monday.\nAs the poster child for China’s property crisis, Evergrande faces pressure to finalise a blueprint for its offshore debt restructuring as it grapples with an even bigger pile of total liabilities that amount to 2.39 trillion yuan – among the biggest of any property firm in the world.\nWith the company facing a hearing on Oct 30 at a Hong Kong court on a winding-up petition, which could potentially force it into liquidation, the clock is ticking.\nThe distressed real estate giant said late on Sunday that it could not satisfy requirements of the China Securities Regulatory Commission (CSRC) and the National Development and Reform Commission to issue new notes.\nIt cited a probe into Hengda, without elaborating.\nThe unit said in August that the CSRC had built a case against it relating to suspected information disclosure violations.\nThe latest signs of trouble at Evergrande caused simmering worries about China’s deepening property crisis to erupt. A gauge of Chinese property stocks tumbled the most in nine months on Monday, taking its loss in valuation in 2023 to US$55 billion.\nChina Aoyuan Group slumped by a record after its shares resumed trading, and property investing firm China Oceanwide Holdings faced court-ordered liquidation after a Bermuda court issued a winding-up order.\nEvergrande, whose default in late 2021 opened the door to record debt failures by developers, late last Friday cancelled key creditor meetings that had been set for early this week, and said it must reassess its proposed restructuring.\nIt cited sales that have “not been as expected”.\n“A huge amount of work has gone into the planning and formulation of Evergrande’s restructuring plans, but if the sales forecasts underpinning the turnaround now appear unachievable, it is better to revisit the deal terms before scheme meetings are held,” said Mr Jonathan Leitch, a partner specialised in debt restructuring at law firm Hogan Lovells in Hong Kong.\nCreditors could expect a “downward revision” in terms and the repayment periods may be further stretched out, according to Mr Leitch. The delay “creates more uncertainty and will further test the patience of bond holders”.\nThe developments follow news just about a week ago that the authorities had detained some staff of Evergrande’s money management business.\nThe setbacks also come as strains mount among other major developers including Country Garden Holdings, which shocked China’s financial markets in August by missing initial deadlines to pay dollar bond interest.\nThe worsening industry crisis has fuelled concerns among some global money managers that Chinese assets are becoming “uninvestable” amid weak governance and disclosure practices.\nChina’s offshore junk bonds, most of which were issued by builders and which were once of the world’s most lucrative fixed-income trades, have lost more than US$127 billion in value since peaking just 2½ years ago.\nEvergrande did not explain what reassessing debt terms would mean for creditors who have already endorsed the existing restructuring plan, nor did it detail the level of support for its current plan.\nThe difficulty in issuing new notes for the developer could drastically change the design of the firm’s restructuring, and what creditors’ recovery may look like.\nIn an early proposal published in March, Evergrande provided an option for creditors to receive new notes maturing in 10 to 12 years. Or, they could choose a combination of equity-linked securities.\nBut after the latest news, converting all debt to shares of Evergrande or of its arms remains “the only option for debt restructuring”, wrote UOB Kay Hian analysts, including Ms Liu Jieqi, in a note.\nEven this solution “faces great uncertainties”, they said. BLOOMBERG", "url": "https://www.straitstimes.com/business/evergrande-crisis-worsens-as-defaults-pile-up-former-ceo-and-cfo-detained"}