{"authors": [], "date_download": "2024-10-12 14:18:06", "date_modify": "2024-10-12 14:18:06", "date_publish": "2023-05-30 11:23:23", "description": "Tesla has had to cut prices to stoke demand in Asia, even after earlier markdowns took a toll on profitability. Read more at straitstimes.com.", "filename": "business_china-s-byd-outbids-tesla-to-supply-evs-for-indonesian-biggest-taxi-operator_1728742686.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/30/2023-05-08T011001Z1158909605RC2IN0AY4ZQMRTRMADP3CHINA-SUVS-PRICING_1.JPG?VersionId=MKgc3RxyXiVn0zRQ3UfM9g3ZMJgpvDMs", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-byd-outbids-tesla-to-supply-evs-for-indonesian-biggest-taxi-operator_1728742686.html", "title": "China’s BYD outbids Tesla to supply EVs to Indonesia’s biggest taxi operator", "title_page": "China’s BYD outbids Tesla to supply EVs to Indonesia’s biggest taxi operator | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA - Indonesia’s largest taxi operator will turn to BYD for 80 per cent of its electric vehicle (EV) fleet while reviewing its Tesla orders as lower-cost models win out in the country.\nMost of the 500 EVs to be delivered to Blue Bird in 2023 will be filled by BYD, especially the e6 and T3 models, as the vehicles are a better fit for the Indonesian market, said president director Sigit Priawan Djokosoetono in an interview.\n“If the price is too expensive, it would be unreasonable for us to then charge it to customers, so we need to consider this,” he said. “We use a lot of imported BYD models, as the price is supportive for us to operate in Indonesia.”\nBYD, the world’s second-largest EV producer, is gaining ground in South-east Asia’s largest economy. It recently signed a deal to explore potential investments in Indonesia while also considering building EV plants in neighbouring Philippines or Vietnam.\nMeanwhile, Tesla has had to cut prices to stoke demand in Asia, even after earlier markdowns took a toll on profitability. Blue Bird is still reviewing its orders for Tesla based on the return on investment.\nBlue Bird will also buy 50 Hyundai EV units in 2023 while considering BMW EV models to meet rental demand.\nCombustion engines will still make up the bulk of Blue Bird’s fleet, with plans to reach around 23,000 cars overall by year end.\nBlue Bird will also triple its fleet of cars that run on compressed natural gas to as many as 6,000 in 2023, as EVs and CNG vehicles lower its operational cost. BLOOMBERG", "url": "https://www.straitstimes.com/business/china-s-byd-outbids-tesla-to-supply-evs-for-indonesian-biggest-taxi-operator"}