{"authors": [], "date_download": "2024-10-12 14:09:29", "date_modify": "2024-10-12 14:09:29", "date_publish": "2022-06-07 13:18:09", "description": "Economists bump up 2022 forecast by 1.6 percentage points, amid potential threat to food supply chains. Read more at straitstimes.com.", "filename": "business_economy_singapore-inflation-seen-quickening-growth-slowing-survey_1728742169.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/07/AK_sgcov_070622.jpg?VersionId=HMal5majTH41KMbpWQ4.hIzY0FlUonHg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_singapore-inflation-seen-quickening-growth-slowing-survey_1728742169.html", "title": "Singapore inflation seen quickening, growth slowing: Survey", "title_page": "Singapore inflation seen quickening, growth slowing: Survey | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE (BLOOMBERG) - Economists bumped up their 2022 inflation forecast for Singapore by 1.6 percentage points, amid a potential threat to food supply chains.\nHeadline inflation rate is seen rising 5.5 per cent on average in the current quarter and the next, up from less than 4 per cent seen previously, according to the median of a Bloomberg survey this month.\nThat led to revision of the 2022 forecast to 4.9 per cent, up 1.6 percentage points, while core inflation is seen coming in at 3.4 per cent, from 2.7 per cent in the February survey.\nExpectations of price gains in 2023 and 2024 were also revised upwards to 2.8 per cent and 2.1 per cent, respectively, the same poll showed.\n\"Lingering supply chain issues and export bans have increased uncertainty on food security,\" said senior economist Jeff Ng at MUFG Bank in Singapore, referring to the city-state's reliance on food imports.\nHe sees annual headline inflation surpassing the 2011 rate of 5.2 per cent, but short of 2008's 6.6 per cent peak.\nEconomists also cut their growth forecasts through the first quarter of next year, before seeing improvement in the second and third quarters of 2023, the same poll showed.\nGross domestic product will probably expand 4.6 per cent in the current quarter, down from 5.6 per cent predicted previously. The full-year forecast was lowered by 0.2 percentage point to 3.8 per cent, a pace that matches the Ministry of Trade and Industry's forecast of 3 per cent to 5 per cent.\nThe growth outlook for 2023 and 2024 remain unchanged at 3 per cent and 2.7 per cent, respectively.\n\"We think global headwinds will overwhelm and dampen the reopening tailwind,\" Maybank Kim Eng economists Chua Hak Bin and Lee Ju Ye said in a report to clients dated May 25. They maintain their below-consensus growth forecast of 2.8 per cent for this year.", "url": "https://www.straitstimes.com/business/economy/singapore-inflation-seen-quickening-growth-slowing-survey"}