{"authors": [], "date_download": "2024-10-12 13:35:25", "date_modify": "2024-10-12 13:35:25", "date_publish": "2024-10-03 09:52:00", "description": "The region accounts for about a third of global crude oil supply. Read more at straitstimes.com.", "filename": "business_companies-markets_oil-climbs-for-third-day-as-middle-east-supply-risks-offset-ample-supply_1728740125.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/2024-10-02T213243Z609304708RC2KCAABLAMTRTRMADP3OIL-OPEC-IRAN.JPG?VersionId=Z26SMY6uo5zbD0_ZODk4x75qd36Cjhtz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_oil-climbs-for-third-day-as-middle-east-supply-risks-offset-ample-supply_1728740125.html", "title": "Oil climbs for third day as escalating Middle East conflict offsets ample supply", "title_page": "Oil climbs for third day as escalating Middle East conflict offsets ample supply | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Oil rose for a third day as traders assessed supply risks in the Middle East, with Israel expected to make a retaliatory strike against Iran following Tehran’s missile barrage earlier this week.\nGlobal oil benchmark Brent crude climbed 1.2 per cent to US$74.80 barrel after advancing almost 3 per cent over the prior two sessions, while its US peer West Texas Intermediate was up 1.4 per cent to US$71.05.\nIsrael has threatened reprisals against Iran, although US President Joe Biden has said the country should hold off from attacking its nuclear facilities.\nThe oil market has been transfixed by the latest crisis in the Middle East, which comes after a year of turmoil as Israel faces off against Iran and its proxies in Gaza, Lebanon, Yemen and elsewhere. The region accounts for about a third of global supply, and traders are concerned the latest escalation could hit flows if energy facilities are attacked or supply routes blocked.\nA major strike by Israel on Iran’s oil-exporting capacity could take 1.5 million barrels of daily supplies off the market, according to Citigroup. If Israel struck minor infrastructure, such as downstream assets and storage facilities, between 300,000 and 450,000 barrels of output could be lost, analysts including Mr Francesco Martoccia said in a note.\n“Traders unwinding short bets could push crude prices higher on a wider war-risk premium,” Bloomberg Intelligence analyst Henik Fung said in a note, referring to investors ditching wagers that prices would fall.\n“WTI could retest US$80 in the short term.”\nBeyond the crisis, there are signs of ample supplies. Opec+ – the oil cartel and its allies – plans to restore some of its shuttered capacity, with increases set to start from December after a two-month delay. In the United States, official data showed crude inventories unexpectedly rose by 3.9 million barrels last week, their biggest increase in about five months. BLOOMBERG", "url": "https://www.straitstimes.com/business/companies-markets/oil-climbs-for-third-day-as-middle-east-supply-risks-offset-ample-supply"}