{"authors": [], "date_download": "2024-10-12 14:11:28", "date_modify": "2024-10-12 14:11:28", "date_publish": "2023-10-29 17:01:00", "description": "Evergrande could become the biggest-ever developer to face such a fate under Hong Kong law. Read more at straitstimes.com.", "filename": "business_evergrande-faces-make-or-break-moment-in-winding-up-hearing_1728742288.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/29/2023-09-27T070827Z1807528929RC28Q2A1UVHCRTRMADP3CHINA-PROPERTY-DEBT.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_evergrande-faces-make-or-break-moment-in-winding-up-hearing_1728742288.html", "title": "Evergrande faces make-or-break moment in winding-up hearing", "title_page": "Evergrande faces make-or-break moment in winding-up hearing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "China Evergrande Group faces a make-or-break moment on Monday at a court hearing, where the troubled developer must defend itself against creditor requests for liquidation.\nThe much-awaited case in Hong Kong’s High Court follows a years-long saga that has epitomised the rise and fall of China’s real estate industry.\nIf a wind-up order is delivered, Evergrande, with about US$327 billion (S$448 billion) of liabilities, could become the biggest-ever developer to face such a fate under Hong Kong law.\nThat is no longer just a hypothetical risk.\nA group of creditors that had previously supported the firm’s restructuring plan is now wavering.\nThe so-called ad-hoc bloc has yet to decide whether it will speak out against the winding-up request, despite having done so previously.\nThe shift came after a shock in late September when Evergrande scrapped creditor meetings at the last minute and went on to revise the terms of its restructuring.\nThe ad-hoc creditors – who hold more than US$6 billion of the builder’s about US$19 billion of offshore notes–responded that they were “left in the dark”.\nShould Evergrande be ordered to liquidate, that would inject more uncertainty just as it struggles to formulate a new restructuring plan.\nAny such ruling would also send shock waves across an industry reeling from slumping sales, lack of home buyer confidence and liquidity woes.\nThe company and its advisers are “likely to have a real rough time in the hearing”, said Mr Daniel Margulies, a partner at Dechert LLP who specialises in restructuring matters in Asia.\nEvergrande previously managed to avoid being wound up by getting adjournments in part because its restructuring proposal process was moving along and as it had support from the ad-hoc group, but “both seem to be in question now”, Mr Margulies said.\nA liquidation would likely “lead to the uncontrolled collapse” of Evergrande, and a failure to obtain regulatory approval to proceed with restructuring would be “the end of the road for restructuring of Chinese companies”, according to a press release from the bond holder group earlier in October.\nWith pressure mounting for the builder to show progress in negotiations, Evergrande also held talks in recent days with some creditors who had previously opposed its plan.\nThe lawsuit has been lingering in the court for almost 17 months after multiple delays requested by the company.\nThe case on Monday is set to be heard before Justice Linda Chan, an experienced judge known for handling insolvency cases.\nThe Hong Kong court has issued at least three wind-up orders for Chinese property developers since the debt crisis began in 2021, despite thorny jurisdictional issues and China’s interest in keeping developers afloat to ensure home buyers are made whole. BLOOMBERG", "url": "https://www.straitstimes.com/business/evergrande-faces-make-or-break-moment-in-winding-up-hearing"}