{"authors": [], "date_download": "2024-10-12 14:12:45", "date_modify": "2024-10-12 14:12:45", "date_publish": "2023-09-12 10:41:32", "description": "Any default by Country Garden would exacerbate China's deep real estate crisis. Read more at straitstimes.com.", "filename": "business_country-garden-wins-approval-to-extend-6-onshore-bond-repayments-by-3-years-sources_1728742365.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/12/2023-09-11T025038Z935665618RC22Q2AD8M24RTRMADP3CHINA-PROPERTY-DEBT-COUNTRYGARDEN.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_country-garden-wins-approval-to-extend-6-onshore-bond-repayments-by-3-years-sources_1728742365.html", "title": "Country Garden secures bond holder reprieve, sources say; shares soar", "title_page": "Country Garden secures bond holder reprieve, sources say; shares soar | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – China’s largest private property developer, Country Garden Holdings, has won approval from its creditors to extend repayments on six onshore bonds by three years, two sources familiar with the matter said on Tuesday, sending its shares up by as much as 10 per cent.\nThe bond holder reprieve came as investors are closely monitoring whether China’s latest government stimulus measures, including lowering existing mortgage rates and offering preferential loans for first home purchases in big cities, might be enough to restore consumer confidence and sow the seeds for an eventual property market recovery.\nCountry Garden’s onshore creditors voted on Monday for proposals by the distressed developer to extend repayments on eight onshore bonds worth 10.8 billion yuan (S$2 billion) by three years, sources said, marking the latest relief to China’s crisis-hit property sector.\nIn the voting, which concluded on Monday night, creditors approved extending six out of the eight bonds, the two sources said.\nThe other two bonds will see voting delayed, the sources added. Country Garden did not immediately reply to a request for comment.\nThe company’s Hong Kong-listed shares surged after the news but are down nearly 60 per cent since the start of 2023. The broader Hang Seng Mainland Properties Index also reversed earlier losses and was up by 0.75 per cent.\nThe latest voting came after Country Garden on Sept 1 gained approval from creditors to extend payments by three years for a 3.9 billion yuan onshore private bond.\nIt also made a last-minute United States dollar coupon payment offshore last week to avoid an immediate default.\nCountry Garden, one of the few large Chinese developers that has not defaulted on debt obligations, has faced liquidity pressure, with reduced available funds as sales plunged, its interim financial statements showed.\nIt has 108.7 billion yuan of debts due within 12 months, while its cash level was around 101.1 billion yuan as at end-June, according to the company’s interim financial statement.\nIn the offshore bond market, Country Garden has at least five coupon payments due in September, including relatively sizeable dollar bond coupons worth US$15 million due on Sept 17 and US$40 million on Sept 27, each with a 30-day grace period.\nAny default by Country Garden would exacerbate the country’s deep real estate crisis, put more strain on its struggling banks and could delay the recovery of not only the property market, but also the overall Chinese economy.\nCountry Garden shares closed 3.9 per cent higher at HK$1.07 on Tuesday. REUTERS", "url": "https://www.straitstimes.com/business/country-garden-wins-approval-to-extend-6-onshore-bond-repayments-by-3-years-sources"}