{"authors": [], "date_download": "2024-10-12 14:08:27", "date_modify": "2024-10-12 14:08:27", "date_publish": "2024-06-19 09:24:00", "description": "The trust’s decision to issue the notes has drawn flak from activist investor Quarz Capital. Read more at straitstimes.com.", "filename": "business_sabana-reit-prices-100-million-in-sustainability-linked-bonds-due-2029-at-415_1728742107.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/19/IMGIMG739311IK3JMF1.jpg?VersionId=UnglaNJRRN8BR5KhA2xAxEDFxHR4fHgD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_sabana-reit-prices-100-million-in-sustainability-linked-bonds-due-2029-at-415_1728742107.html", "title": "Sabana Industrial Reit prices $100m of sustainability-linked bonds due in 2029 at 4.15%", "title_page": "Sabana Industrial Reit prices $100m of sustainability-linked bonds due in 2029 at 4.15% | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Sabana Industrial Real Estate Investment Trust (Reit) has priced $100 million of sustainability-linked bonds due in 2029, said the manager in a bourse filing on June 18.\nThe bonds will be issued in the denomination of $250,000 and will bear a coupon rate of 4.15 per cent per annum. If the Reit fails to meet its sustainability performance target, there will be a coupon step-up for the bonds.\nThe trust’s decision to issue the notes has drawn flak from activist investor Quarz Capital which, in a letter dated June 14, called the bond issuance “highly abnormal and extraordinary” since the trust currently has “zero refinancing needs”.\nQuarz also believes the issuance could impede the Reit’s internalisation, as the bond terms contain clauses related to the change of control of the manager, which could entrench the current Reit manager and sponsor from being removed.\nDefending the bond issuance in a statement on June 18, the Reit manager said it has been working on the bond issuance since June 2022, before Quarz requested to convene an extraordinary general meeting to discuss its internalisation.\nSeparately, the trustee said the terms of the bond issuance do not place more restrictions on the internalisation than already existing under the terms of the Reit’s current financing agreement.\n“It is unclear how Quarz arrived at its conclusion, taking into account the reasons set out in the manager’s June 17 announcement and the matters stated above,” the trustee said.\nThe net proceeds from the bond issue will be used for capital expenditures, such as acquiring new properties and asset enhancement initiatives, as well as refinancing existing term loans, including loans made by the joint lead managers.\nHSBC’s Singapore branch and CIMB Bank’s Singapore branch have been appointed joint lead managers, joint bookrunners and joint sustainability-linked framework structuring advisers for the issue of the bonds.\nThe payment obligations of the issue will be unconditionally and irrevocably guaranteed by Credit Guarantee and Investment Facility, a trust fund of the Asian Development Bank. The manager expects the bonds to be rated AA by S&P Global Ratings. The trustee will also enter into a standby letter of credit facility agreement with HSBC and CIMB bank.\nBased on pro forma estimates, the Reit’s weighted average tenor of borrowings will lengthen to 3.5 years compared with 2.7 years as at March 31.\nThe hedge ratio will rise to 80.1 per cent post-bond issuance, compared with 51.8 per cent as at March 31. There are no refinancing requirements until 2026, the manager added. It expects the bonds to be issued on June 25.", "url": "https://www.straitstimes.com/business/sabana-reit-prices-100-million-in-sustainability-linked-bonds-due-2029-at-415"}