{"authors": [], "date_download": "2024-10-12 14:10:56", "date_modify": "2024-10-12 14:10:56", "date_publish": "2024-01-05 22:10:00", "description": "The economy added 2.7 million jobs in 2023, a sharp step-down from the 4.8 million positions created in 2022. Read more at straitstimes.com.", "filename": "business_us-job-growth-beats-expectations-in-december-wages-rise-solidly_1728742256.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/05/US-US-ECONOMY-ADDED-ROUGHLY-200000-JOBS-IN-NOVEMBER-BRINGING-212041.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_us-job-growth-beats-expectations-in-december-wages-rise-solidly_1728742256.html", "title": "US job growth beats expectations in December; wages rise solidly", "title_page": "US job growth beats expectations in December; wages rise solidly | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Employers in the United States hired more workers than expected in December while raising wages at a solid clip, casting some doubt on financial market expectations that the Federal Reserve would start cutting interest rates in March.\nNon-farm payrolls increased by 216,000 jobs in December, the Labour Department’s Bureau of Labour Statistics said in its closely watched employment report on Jan 5. Data for November was revised lower to show payrolls rising by 173,000 instead of 199,000 as previously reported.\nEconomists polled by Reuters had forecast payrolls increasing by 170,000 jobs.\nThe economy added 2.7 million jobs in 2023, a sharp step-down from the 4.8 million positions created in 2022. That reflects cooling demand for both labour and in the broader economy, following 525 basis points’ worth of rate hikes from the US central bank since March 2022.\nThe data indicated that the economy avoided a recession in 2023 and would likely continue to grow through 2024 as labour market resilience supports consumer spending. About 100,000 jobs per month are needed to keep up with growth in the working-age population.\nThe unemployment rate was unchanged at 3.7 per cent. There has been an influx of people into the labour force, some of it tied to a rise in immigration. The unemployment rate has risen from a five-decade low of 3.4 per cent in April.\nDespite the expanding labour pool, wage inflation remains firm.\nAverage hourly earnings rose 0.4 per cent in December after gaining 0.4 per cent in the prior month. That raised the year-on-year increase in wages to 4.1 per cent, from 4 per cent in November.\nBut danger could be lurking beneath the seemingly resilient labour market. Job growth in recent months has been largely concentrated in less than a handful of sectors, including leisure and hospitality, as well as healthcare.\nGovernment hiring, as state and local governments try to bring education staffing back to pre-pandemic levels, has also been driving employment gains. Some economists said this indicated that the labour market was not as strong as the numbers suggested. Nonetheless, most do not expect a recession in 2024, but lacklustre growth.\nGoldman Sachs economist Manuel Abecasis was less concerned, noting that the three industries that have dominated hiring accounted for 40 per cent of employment.\n“The industries accounting for 70 per cent of total employment have continued to add jobs on net,” he said. “Looking ahead, we expect total labour demand to continue to ease gradually but the breadth of hiring to widen somewhat.”\nThe Fed held its policy rate steady in the current 5.25 per cent to 5.5 per cent range in December, and policymakers signalled in new economic projections that the historic monetary policy tightening engineered over the last two years is at an end and lower borrowing costs are coming in 2024.\nWith December’s employment report, the government incorporated annual revisions to the seasonally adjusted household survey data, from which the unemployment rate is derived, for the past five years.\nThe revisions had little impact on the jobless rate or the labour force participation rate. REUTERS", "url": "https://www.straitstimes.com/business/us-job-growth-beats-expectations-in-december-wages-rise-solidly"}