{"authors": [], "date_download": "2024-10-12 14:10:47", "date_modify": "2024-10-12 14:10:47", "date_publish": "2024-08-20 13:02:00", "description": "PwC has seen an exodus of clientele amid a probe into its work on China Evergrande. Read more at straitstimes.com.", "filename": "business_pwc-loses-major-client-bank-of-china-amid-regulatory-probe_1728742247.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/2024-08-07T024147Z1053592580RC21O1A5MMFFRTRMADP3CHINA-PROPERTY-DEBT-EVERGRANDE.JPG?VersionId=PtQs1AhvSDKNFZJ3Zuh_NHOQ6t2ynNR0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_pwc-loses-major-client-bank-of-china-amid-regulatory-probe_1728742247.html", "title": "PwC loses major client Bank of China amid regulatory probe", "title_page": "PwC loses major client Bank of China amid regulatory probe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Auditor PwC has lost its largest mainland China-listed client, Bank of China (BOC), to rival EY, adding to an exodus of clientele amid a regulatory investigation into its work on troubled property developer China Evergrande Group.\nState-owned BOC had as recently as March stated plans to reappoint PwC as its auditor for 2024, but in a filing late on Aug 19 said it plans to appoint EY. The decision will be submitted for shareholder approval, it added.\nPwC, once the leading auditing firm in China, declined to comment.\nBOC paid PwC 193 million yuan (S$35 million) in auditing fees in 2023, filings show. That is more than the combined auditing fees from its three next biggest domestically listed clients for 2023: China Life Insurance, China Telecom and insurance giant PICC. The trio have also dropped PwC as a client, according to filings.\nAt least 50 Chinese firms, many of which are state-owned enterprises or financial institutions, have either dropped PwC as their auditor or cancelled plans to hire the firm in recent months, a Reuters examination of filings shows.\nAs at March, PwC was the auditor for about 110 companies listed in mainland China, according to the company’s website.\nThe Chinese authorities have been looking at PwC’s audits of Evergrande, which has been accused by the securities regulator of a US$78 billion (S$102 billion) fraud – an investigation that is expected to result in heavy fines. PwC audited Evergrande for almost 14 years until early 2023.\nSince at least April, regulators have asked several large state-owned clients of PwC to drop the auditor, sources have said.\nThey have also advised that state-owned firms and listed companies should be “extremely cautious” about hiring auditors that have received regulatory fines or other penalties in the past three years.\nAbout half of the corporate clients that have dropped PwC have been snapped up by EY and KPMG, the Reuters examination of filings shows.\nPwC has been BOC’s auditor since 2021. Prior to that, EY audited BOC for eight years. Chinese rules stipulate that state-owned firms should not employ the same auditor for more than eight consecutive years. REUTERS", "url": "https://www.straitstimes.com/business/pwc-loses-major-client-bank-of-china-amid-regulatory-probe"}