{"authors": [], "date_download": "2024-10-12 14:15:03", "date_modify": "2024-10-12 14:15:03", "date_publish": "2024-09-03 22:40:00", "description": "US manufacturing PMI rose from 46.8 in July to 47.2 in August - the lowest reading since November. Read more at straitstimes.com.", "filename": "business_economy_us-manufacturing-edges-up-in-august-from-8-month-low-but-trend-remains-weak_1728742503.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/2024-06-25T201154Z1379542860RC2NF8AGWCWERTRMADP3RIVIAN-VOLKSWAGEN-JV.JPG?VersionId=IOoBKOupEhxh6vuOoSLn6htDhr05fMr0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_us-manufacturing-edges-up-in-august-from-8-month-low-but-trend-remains-weak_1728742503.html", "title": "US manufacturing edges up in August from 8-month low, but trend remains weak", "title_page": "US manufacturing edges up in August from 8-month low, but trend remains weak | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - A gauge of US manufacturing edged up in August from an eight-month low in July amid some improvement in employment, but the overall trend continued to point to subdued factory activity.\nThe Institute for Supply Management (ISM) said on Sept 3 its manufacturing purchasing managers’ index (PMI) rose to 47.2 in August from 46.8 in July, the lowest since November. A reading below 50 indicates contraction in the manufacturing sector, which accounts for 10.3 per cent of the economy.\nThe PMI remained below the 50-point threshold for the fifth straight month, but was above the 42.5 level that the ISM said over time generally indicates an expansion of the overall economy. The PMI and regional factory surveys have, however, consistently overstated manufacturing weakness.\nSo-called hard data on manufacturing production and business spending on equipment suggests the sector has been largely treading water, as demand for goods has not collapsed despite hefty Federal Reserve interest rate increases.\nThe US central bank is expected to start cutting rates at its Sept 17-18 policy meeting.\nThe ISM survey’s forward-looking new orders sub-index fell to 44.6 in August from 47.4 in July. Output declined further, with the production sub-index slipping to 44.8 from 45.9 in July. Despite subdued orders, manufacturers faced higher prices for inputs, likely reflecting soaring freight rates.\nThe survey’s measure of prices paid by manufacturers increased to 54 from 52.9 in July. That suggests goods deflation has probably run its course for now, but will probably not have a material impact on inflation, which is slowing. Goods prices were unchanged in July after falling for two straight months.\nThe measure of supplier deliveries fell to 50.5 from 52.6 in the prior month. A reading above 50 indicates slower deliveries.\nFactory employment continued to contract, though the pace slowed. The survey’s manufacturing employment measure rose to 46 from 43.4 in July. REUTERS", "url": "https://www.straitstimes.com/business/economy/us-manufacturing-edges-up-in-august-from-8-month-low-but-trend-remains-weak"}