{"authors": [], "date_download": "2024-10-12 14:10:50", "date_modify": "2024-10-12 14:10:50", "date_publish": "2024-05-29 11:38:00", "description": "The Chinese authorities are probing PwC’s involvement as a former auditor for Evergrande. Read more at straitstimes.com.", "filename": "business_pwc-lost-five-china-clients-in-may-after-evergrande-linked-probe_1728742250.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/29/2024-03-13T025706Z1439738112RC21O1A4LMRJRTRMADP3AUSTRALIA-PWC-JOB-CUTS.JPG?VersionId=XErECP_441AaKzKQxG4flJUJYgercZGq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_pwc-lost-five-china-clients-in-may-after-evergrande-linked-probe_1728742250.html", "title": "PwC loses five China clients in May after Evergrande-linked probe", "title_page": "PwC loses five China clients in May after Evergrande-linked probe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - PricewaterhouseCoopers (PwC) lost five Chinese clients in May alone, adding to a list of more than a dozen companies it has stopped auditing in the country in the last two years.\nChina Taiping Insurance Holdings said on May 27 that it appointed KPMG as its auditor for 2024 after PwC retired, just as China Merchants Bank replaced it with Ernst and Young.\nChina Railway Group, China Electronics Huada Technology and Eastroc Beverage Group are among the others that changed auditors.\nThe latest business losses underscore the challenges for PwC as regulators examine its auditing role for China Evergrande Group.\nThe company has come under intense scrutiny after China launched one of the biggest investigations into financial fraud in history.\nThe five companies contributed to about 107 million yuan (S$20.3 million) in fees, based on their annual filings.\nThe authorities said that Evergrande’s main onshore unit, Hengda, overstated its revenue by 564 billion yuan in the two years through 2020.\nThe Chinese government authorities are probing PwC’s involvement as a former auditor for the real estate giant, people familiar with the mater said in March. A representative for PwC declined to comment on May 29.\nIn recent years, PwC resigned as an auditor from at least 10 Chinese property companies, including Sunac China Holdings, Shimao Group Holdings, Sino-Ocean Group Holding and Agile Group Holdings. BLOOMBERG", "url": "https://www.straitstimes.com/business/pwc-lost-five-china-clients-in-may-after-evergrande-linked-probe"}