{"authors": [], "date_download": "2024-10-12 14:08:41", "date_modify": "2024-10-12 14:08:41", "date_publish": "2024-05-14 08:57:00", "description": "Its default marks the downfall of one of the few survivors among China’s private-sector builders. Read more at straitstimes.com.", "filename": "business_chinese-developer-agile-defaults-for-first-time-on-dollar-bonds_1728742121.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/14/CHINA-ECONOMY-PROPERTY-100857.jpg?VersionId=NfIHNpHrgzq07ke6rSxlmf5sTAyHflba", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_chinese-developer-agile-defaults-for-first-time-on-dollar-bonds_1728742121.html", "title": "Chinese developer Agile defaults for first time on dollar bonds", "title_page": "Chinese developer Agile defaults for first time on dollar bonds | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Agile Group Holdings, a Chinese developer of villa apartments and high-rise homes, has defaulted for the first time on publicly issued US dollar bonds, underscoring lingering distress amid the nation’s unprecedented property crisis.\nThe company, based in the southern province of Guangdong, has not paid interest within a grace period ending May 13 on dollar bonds due in 2025, it said in a filing.\nThe builder will engage an external financial adviser and legal adviser to assist in evaluating the capital structure and liquidity.\nInvestors had been bracing themselves for such an outcome, with the notes trading at deeply distressed levels, around nine cents on the dollar.\nThe stumble adds to record defaults among Chinese property developers, flagging the long road to recovery, even as recent policy steps to support the housing industry have sparked rallies in builder shares and bonds.\nSome analysts have voiced scepticism over whether the wave of stimulus measures could lift sales.\nAgile’s default also marks the downfall of one of the few survivors among China’s private-sector builders.\nThe list of major private developers that have yet to default on public bonds has dwindled since 2023, after the delinquency of Country Garden Holdings.\nThe real estate industry “continues to experience a downward trend”, Agile said in its filing.\nLike many builders in China, Agile often sells homes before they are completed.\nPre-sales of homes for the four months ended April 30 fell 68 per cent to 6.55 billion yuan (S$1.25 billion) compared with the year-earlier period, it said. The firm is considering all possible actions to address its debt issue, it added.\nWith total assets of more than 240 billion yuan as at the end of 2023, Agile has established a presence in over 200 cities in China and abroad and has more than 100,000 employees, according to its website.\nSome holders of the 6.05 per cent dollar notes due in 2025 said on May 13 that they had not received the interest payments, as the 30-day grace period neared its end.\nThe bond’s offering circular defines an “event of default” when non-payment of interest continues for a period of 30 consecutive days. BLOOMBERG", "url": "https://www.straitstimes.com/business/chinese-developer-agile-defaults-for-first-time-on-dollar-bonds"}