{"authors": ["Yong Jun Yuan"], "date_download": "2024-10-12 14:09:52", "date_modify": "2024-10-12 14:09:52", "date_publish": "2024-01-21 18:30:00", "description": "Its Bondsupermart Malaysia is expected to launch bond trading services in the second half of 2024 Read more at straitstimes.com.", "filename": "business_companies-markets_ifast-gets-in-principle-approval-to-operate-bond-marketplace-in-malaysia_1728742192.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/21/nzifast030152.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_ifast-gets-in-principle-approval-to-operate-bond-marketplace-in-malaysia_1728742192.html", "title": "iFast gets in-principle approval to operate bond marketplace in Malaysia", "title_page": "iFast gets in-principle approval to operate bond marketplace in Malaysia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - iFast Corporation has secured in-principle approval from the Securities Commission Malaysia to operate a bond marketplace through its subsidiary Bondsupermart Malaysia.\nIn a bourse filing on Jan 20, the company said that Bondsupermart aims to be a “centralised and easily accessible” marketplace to buy and sell bonds.\niFast Corp chairman and chief executive Lim Chung Chun noted that bond trading, which predominantly operates over the counter, has suffered from a lack of price transparency and trading efficiency.\n“The bond market has not seen much innovation over the past decade when other segments of the securities markets have undergone improvements propelled by technology,” he said.\n“By tapping the group’s existing bond trading volume of approximately RM800 million (S$227 million) equivalent per month in both ringgit and foreign currency denominated bonds, it will give Bondsupermart Malaysia a solid footing to attract, grow and expand further when more participants are onboarded in future,” he added.\nThe company said that individual investors will directly contribute to real-time price discovery and transparency to help establish “market-driven and fair market values for bonds based on supply and demand dynamics”.\nIt added that Bondsupermart Malaysia is expected to launch bond trading services in the second half of 2024.", "url": "https://www.straitstimes.com/business/companies-markets/ifast-gets-in-principle-approval-to-operate-bond-marketplace-in-malaysia"}