{"authors": [], "date_download": "2024-10-12 14:08:48", "date_modify": "2024-10-12 14:08:48", "date_publish": "2022-06-22 22:19:06", "description": "Federal Reserve Chair Jerome Powell said the central bank will keep raising interest rates to tame inflation, but added that policy makers must also be \"nimble\". Read more at straitstimes.com.", "filename": "business_economy_powell-sees-ongoing-fed-rate-hikes-needed-to-tame-hot-inflation_1728742128.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/22/ads-powell-220622.jpg?VersionId=waClenmR2z6NqbWNITtXnN5dSlEv7UVY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_powell-sees-ongoing-fed-rate-hikes-needed-to-tame-hot-inflation_1728742128.html", "title": "US Fed’s Powell: Committed to inflation fight, not trying to trigger recession", "title_page": "US Fed’s Powell: Committed to inflation fight, not trying to trigger recession | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VIRGINIA (REUTERS) - The Federal Reserve is not trying to engineer a recession to stop inflation but is fully committed to bringing prices under control even if doing so risks an economic downturn, US central bank chief Jerome Powell said on Wednesday (June 22).\n“We are not trying to provoke, and I don’t think we will need to provoke, a recession,” Powell said at a hearing before the US Senate Banking Committee, although he acknowledged that a recession was “certainly a possibility” and events in the last few months around the world had made it more difficult to reduce inflation without causing one.\n“It is essential that we bring inflation down if we are to have a sustained period of strong labour market conditions that benefit all,” Powell said.\nThe Fed in coming months will be looking for “compelling evidence” of slowing price pressures before it eases up on the interest rate increases it kicked off three months ago.\nInflation continues to run at least three times higher than the Fed’s targeted level of 2 per cent.\nA gauge of price increases that excludes volatile food and energy costs may have eased somewhat last month, Powell testified, but Russia’s invasion of Ukraine and Covid-19 lockdowns in China are putting continued upward pressure on inflation.\nOne week ago, the Fed raised its benchmark overnight interest rate by three-quarters of a percentage point – its biggest hike since 1994 – to a range of 1.5 per cent to 1.75 per cent, and signalled rates would rise to 3.4 per cent by the end of this year.\nThat steep rate hike path, designed to slow the economy, has sparked widespread concern about a recession and a weakening of labour markets, which Powell on Wednesday said were unsustainably hot.\nOn Wednesday, Powell reiterated that ongoing increases in the Fed’s policy rate would be appropriate, with the exact pace dependent on the economic outlook. He declined to rule out a 100-basis-point move if it proved warranted.\n“Inflation has obviously surprised to the upside over the past year, and further surprises could be in store,” he said, repeating that policymakers would need to be nimble in response to the incoming data.\n‘Coughing up bones’\nSince the June 14-15 policy meeting, a number of Powell’s fellow policymakers have lined up behind his comments last week that the central bank will very likely need to raise rates by either 50 or 75 basis points at its next meeting in July.\nEarlier on Wednesday, Philadelphia Fed president Patrick Harker said incoming data would govern which of the two options to deliver. Chicago Fed president Charles Evans signaled later on Wednesday that he also is comfortable for now with continued rapid rate hikes, even as he nodded to the rising recession risk.\n“To think that we can fine tune something like this with tremendous precision – I mean, we just don’t have that ability,” Evans said. Even so, he added, there’s “tremendous” consensus at the Fed for getting rates into modestly restrictive territory.\n“The first thing that we’re looking at is to make sure we take the steam out of the inflation pressures,” he said.\nBut in an indication of how inflation has emerged as a thorny political issue that threatens to tip the balance of power in Congress to Republicans in elections this November, Powell found himself under fire from both the left and right.\nSenator Elizabeth Warren, a Democrat representing Massachusetts, took the Fed to task for pushing through rate hikes that raised the risk of a recession that could put millions out of work.\nRepublican Senator John Kennedy of Louisiana, in one of the more heated criticisms of the Fed’s response to inflation, said inflation was hitting his constituents “so hard they are coughing up bones.”\nOverall, Powell did not stray far from his remarks in his news conference that followed the Fed’s latest policy meeting, but his assertion that financial conditions had “tightened significantly” seems significant and may herald a slower pace of rate hikes, Karim Basta, chief economist at III Capital Management, wrote in a note.\nInterest rate futures ticked higher through the course of Powell’s appearance, as traders moderated expectations for additional big rate increases at the Fed’s remaining four policy meetings of the year.\nEconomists polled by Reuters before the appearance see the Fed delivering another 75-basis-point interest rate hike in July, followed by a half-percentage-point rise in September, with no scaling back to quarter-percentage-point moves until November at the earliest.\nFed officials’ latest projections see economic growth slowing to below trend this year while the US unemployment rate – currently 3.6 per cent – starts to tick higher. Meanwhile, they now expect inflation by year-end to drop only to 5.2 per cent by their preferred measure, which registered 6.3 per cent as of April.", "url": "https://www.straitstimes.com/business/economy/powell-sees-ongoing-fed-rate-hikes-needed-to-tame-hot-inflation"}