{"authors": ["Michelle Zhu"], "date_download": "2024-10-12 14:10:20", "date_modify": "2024-10-12 14:10:20", "date_publish": "2023-12-18 10:04:00", "description": "Recent divestment proceeds were used to fund the bond buyback. Read more at straitstimes.com.", "filename": "business_cromwell-e-reit-buys-back-50-million-euros-in-bonds-due-2025_1728742220.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/18/20220819450751500ed7cd8e-d3f8-41ba-af54-94586452376f.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_cromwell-e-reit-buys-back-50-million-euros-in-bonds-due-2025_1728742220.html", "title": "Cromwell E-Reit buys back €50m in bonds due 2025", "title_page": "Cromwell E-Reit buys back €50m in bonds due 2025 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Cromwell European Real Estate Investment Trust (Cromwell E-Reit) has repurchased €50 million (S$72.6 million), or 10 per cent, of its €500 million 2.125 per cent bonds due Nov 19, 2025.\nFollowing the repurchase, the aggregate principal amount of the bonds outstanding will be €450 million, Cromwell E-Reit’s manager said on Dec 18.\nThe Reit manager said it expects to book €3 million in profit from the discounted purchase price of the bonds.\nRecent divestment proceeds were used to fund the bond buyback.\nMr Simon Garing, the manager’s chief executive, said: “This aligns with our strategy to reduce the refinancing risk of Cromwell E-Reit’s November 2025 bonds ahead of time, to minimise the distribution per unit (DPU) impact of rising interest rates as all Reits transition from the zero interest rate policies of the recent years, and to protect unit holders equity.”\nHe added: “The alternate use of excess cash would have been to buy back equity, which wouldn’t have diminished the bond refinance risk or helped investors price in the DPU impact of the transition from the low-interest 2.125 per cent coupon of the notes as they matured.”\nThe Reit manager expects Cromwell E-Reit to finish financial year 2023 with an aggregate leverage of about 40 per cent, after accounting for a “minor move” expected from its December investment property valuations.\nMr Garing said further planned asset sales in 2024 will also assist the Reit’s liquidity management, which aims to keep the gearing ratio within the 35 to 40 per cent range.\n“Once we progress further on the bond refinance strategy and see the asset valuation cycle turn more favourable, we could potentially use further asset sale proceeds for equity buybacks – noting we are not inclined to use expensive debt to fund equity buybacks.”\nThe Reit’s latest third-quarter financials indicate that its net gearing as at end-September 2023 stood at 39.7 per cent.\nUnits of Cromwell E-Reit closed on Dec 15 at five euro cents, or 3.7 per cent, higher at €1.40. Based on this, and a 12-month trailing DPU of 16.042 euro cents, the counter trades at an estimated 38 per cent discount to its net asset value with an 11.5 per cent trailing distribution yield.\nMr Garing acknowledged that such levels create “an impression of substantial valuation declines and significant reductions in distributions from the impact of transitioning to higher interest rates”.\n“In addition to being 91 per cent-hedged for the next two years, the bond buyback should provide investors additional confidence in our capital management strategies and allow Cromwell E-Reit to be well-placed for when the interest rate and real estate cycles turn.”\nCromwell E-Reit’s move comes ahead of an expected 100 basis point rate cut by the European Central Bank in 2024, as currently implied by European credit markets.\nConsidering this, Mr Garing said he believes listed Reits are close to an inflection point as Europe’s property market occupancy fundamentals remained “very healthy”.", "url": "https://www.straitstimes.com/business/cromwell-e-reit-buys-back-50-million-euros-in-bonds-due-2025"}