{"authors": ["Chor Khieng Yuit"], "date_download": "2024-10-12 13:34:38", "date_modify": "2024-10-12 13:34:38", "date_publish": "2024-03-11 17:00:00", "description": "With cost of living eating into earnings, such workers find it hard to plan for retirement. Read more at straitstimes.com.", "filename": "business_stagnating-incomes-mean-gig-workers-must-get-head-start-on-financial-planning-experts_1728740078.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/11/IMGL7562a.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_stagnating-incomes-mean-gig-workers-must-get-head-start-on-financial-planning-experts_1728740078.html", "title": "Stagnating incomes mean gig workers must get head start on financial planning: Experts", "title_page": "Stagnating incomes mean gig workers must get head start on financial planning: Experts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Platform workers, those in jobs like ride hailing or food delivery, need to focus more on their long-term finances in the light of stagnating incomes over the past year.\nThe median pay for a full-time platform worker stayed unchanged in 2023 compared with 2022, despite inflation sending living costs higher.\nThe volatile nature of the gig economy means it is difficult for such workers to know how to plan for their midterm to long-term needs, but financial experts say they must start doing so.\nThey suggest that the core of any plan for a stable future revolves around the three key elements of savings, emergency funds and insurance.\nAs Mr Elijah Lee, a senior financial services manager at independent financial advisory firm Phillip Securities, said: “We will all stop working one day. When that happens, where will our income come from?\n“You do not stop working and then start to figure out where the income comes from. You have to start planning this from the very beginning.”\nThis is not easy, though, as 29-year-old foodpanda delivery rider Woon Ern Chong knows all too well.\nMr Woon, who is a part-time student, acknowledges that one cannot save and plan for the future if one does not even have money for basic living expenses. That is what led him to take on delivery work to earn extra cash.\nHe also reviewed his monthly expenses and found some areas where he could cut back.\n“You may find that you often spend more than you think you do,” he said.\nMr Woon saves money by resisting the temptation to buy the latest mobile phones or gadgets, instead going for more budget-friendly brands and models.\nHe also custom-builds his own computers.\nHe hopes that being frugal will allow him to bolster his savings to pay for the renovations and mortgage payments on his Build-to-Order flat in 2025.\nIt has certainly become more important for platform workers to be prudent.\nA Ministry of Manpower report showed that the median gross monthly income of full-time platform-related occupations was $2,000 in 2023, unchanged from 2022.\nSuch workers are self-employed, and include delivery workers, private-hire car drivers and taxi drivers. They use online platforms such as Grab to search for customers.\nPrivate-hire car drivers earned around $2,500 a month in 2023, while delivery workers like Mr Woon picked up $2,000 and taxi drivers $1,500 – all unchanged from 2022.\nWhile earnings did not go up in 2023, inflation remained a challenge, with the cost of living rising 4.8 per cent from 2022.\nCore inflation, which excludes accommodation and private transport costs, rose 4.2 per cent over the same period.\nDeveloping good saving habits is essential, said experts.\nA good rule of thumb is to save at least 20 per cent of income, spend 50 per cent on financial needs and the remaining 30 per cent on wants and discretionary spending, said Mr Samuel Rhee, co-founder and chairman of digital wealth platform Endowus.\nMr Rhee urges platform workers to build up an emergency fund of around six months of expenses that they can draw on for unexpected situations, like a job loss or a medical crisis.\nPhillip Securities’ Mr Lee believes platform workers should set aside even more for emergencies – a fund of as much as 12 to 18 months of expenses.\n“You cannot adopt the mindset of ‘I earned more this month and I should treat myself’.\n“Set aside at least a part of that extra income for a rainy day,” he said.\nMr Rhee said platform workers should not neglect longer-term goals, such as planning for retirement.\nInflation has pushed up the cost of living and people are living longer, he added, so they should plan for the long term to “maintain sustainable standards of living during retirement”.\n“It will be deeply unfortunate for someone to work hard for many years, only to realise... that they do not have enough of a retirement nest egg to sustain a decent quality of life. This is what we call old-age poverty,” Mr Rhee said.\nThe Central Provident Fund (CPF) should form the basic foundation of anyone’s retirement plan, said Ms Daphne Lye, solutions lead at MoneyOwl, which is now under Temasek Trust.\nPlatform workers aged below 30 in 2024, meaning those born in or after 1995, will have to contribute more to their CPF from the second half of 2024. Older platform workers can also opt in and contribute more.\nWhile there are concerns about a drop in take-home pay, Ms Lye said the workers will benefit in the longer term from the risk-free interest rates.\nSavings in the CPF Ordinary Account earn at least 2.5 per cent, while the Special Account pays at least 4 per cent interest annually.\nFurthermore, platform companies have to contribute to their workers’ CPF, she said, adding that “it is additional monies that you will get”.\n“You have to take a longer view,” she said.\nAll this planning will go awry if a major illness or accident hits, which is why platform workers should consider insurance coverage for hospitalisation and critical illnesses.\nThey may also want to get their own insurance for personal accidents, even though they will be entitled to compensation under the Work Injury Compensation Act from the second half of 2024.\nMr Lee noted that there are low-cost insurance plans that platform workers can consider.\n“Just get a five-year renewable term plan. When you are in your 20s, it is really cheap. Just a couple of tens of dollars a month,” he said.\nWith the basic building blocks in place – savings, emergency funds and insurance – platform workers can consider investing if they have extra cash.\nMr Lee said they should look at creating side income streams so that they can transition from being fully reliant on their platform income to being partially reliant.\nFor example, as age catches up with them and they are no longer able to do deliveries, they will still have external sources of income from their investments, which can include dividend-paying stocks, unit trusts or Singapore Savings Bonds.\nMs Lye suggested that platform workers look at investing into low-cost, globally diversified portfolios.\nHowever they decide to invest, their investment plan or portfolio should fit their risk tolerance and wealth goals, Mr Rhee said, adding that they should not change their plans unless something has altered fundamentally in their life.\nHe also said that investors should not have to stress over rebalancing their portfolios whenever markets are volatile.\n“They should have peace of mind, and be confident that they can ride out the storm,” he added.", "url": "https://www.straitstimes.com/business/stagnating-incomes-mean-gig-workers-must-get-head-start-on-financial-planning-experts"}