{"authors": [], "date_download": "2024-10-12 14:19:17", "date_modify": "2024-10-12 14:19:17", "date_publish": "2023-01-26 14:01:04", "description": "China’s leading EV maker is BYD, which outsold Tesla in 2022 when its plug-in hybrid vehicles and pure EVs were included. Read more at straitstimes.com.", "filename": "business_elon-musk-expects-tesla-s-main-rival-will-be-a-chinese-ev-maker_1728742757.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/26/2023-01-26T060045Z1708384580RC25YY9NMZCBRTRMADP3TESLA-RESULTS-MUSK-CHINA_0.JPG?VersionId=XFViwfjKq0PQ8VmX9D_Ekd50d0rcYmE1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_elon-musk-expects-tesla-s-main-rival-will-be-a-chinese-ev-maker_1728742757.html", "title": "Elon Musk expects Tesla’s main rival to be a Chinese EV maker", "title_page": "Elon Musk expects Tesla’s main rival to be a Chinese EV maker | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - Tesla’s biggest competitor is likely to be a Chinese company, chief executive officer Elon Musk said on a call with analysts following the electric-vehicle (EV) maker’s quarterly earnings.\nAsked about Chinese car companies, Mr Musk said they “work the hardest, and they work the smartest”, describing them as the most competitive in the world. “If I were to guess,” he said, “probably some company out of China is the most likely to be second to Tesla.”\nTesla slashed prices on its models in China, where it has a factory in Shanghai, on Jan 6 following an earlier round of cuts on Chinese-made Model Y and Model 3 EVs in October. Other automakers have also announced cuts to get a better hold in the world’s biggest EV market, including local players such as Xpeng and Aito, which is backed by Huawei Technologies.\nChina’s leading EV maker is BYD, which outsold Tesla in 2022 when its plug-in hybrid vehicles as well as pure EVs were included.\nMr Musk said on Wednesday’s call that China is the most competitive market. He has made similar comments before, including during an online forum in September 2021, when he said he had “a great deal of respect for the many Chinese automakers”.\nTesla made more than 710,000 EVs in China last year, about 52 per cent of its global output, even with production being disrupted by the country’s now-abandoned zero-Covid policy. Mr Musk said 2022 was difficult due to shutdowns at Tesla’s China factory, along with higher borrowing costs and logistical issues.\nWithout unexpected disruptions, worldwide output could approach two million vehicles this year, he said.\nBloombergNEF expects Tesla’s sales to grow by up to 40 per cent in 2023 and its Model Y to be the best-selling EV in the world, likely making it into the top three models of any type.\nTesla’s revenue in the fourth quarter was US$24.3 billion (S$31.9 billion), ahead of market expectations, while it reported adjusted earnings of US$1.19 a share, topping the US$1.12 average forecast from analysts. BLOOMBERG", "url": "https://www.straitstimes.com/business/elon-musk-expects-tesla-s-main-rival-will-be-a-chinese-ev-maker"}