{"authors": ["Chor Khieng Yuit"], "date_download": "2024-10-12 13:54:56", "date_modify": "2024-10-12 13:54:56", "date_publish": "2023-08-20 05:00:00", "description": "It's important to make a lasting power of attorney or it will be difficult to execute any financial plan. Read more at straitstimes.com.", "filename": "business_invest_counting-the-cost-of-dementia-and-how-you-can-be-prepared-for-it_1728741296.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/20/des-lyinsight01.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_invest_counting-the-cost-of-dementia-and-how-you-can-be-prepared-for-it_1728741296.html", "title": "The true cost of dementia: It can set a family back by up to $1.6m over 10 years", "title_page": "The true cost of dementia: It can set a family back by up to $1.6m over 10 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Dementia is an exceptionally distressing health crisis when it hits an individual and their family but almost as damaging can be the severe financial pain it brings.\nDementia victims suffer a gradual deterioration until they lose all mental capacity. They are unable to think and reason, remember new information or recall past events, solve problems or take care of themselves.\nThat also means they cannot work, so income is lost. And an urgent need arises for someone to take care of them, and that is when their loved ones can find themselves under severe pressure.\nFinancial advisory firm SingCapital did a projection for Invest assuming three scenarios: A spouse quits his or her job to take care of the patient; a domestic helper is engaged; and the patient is admitted to a nursing home.\nIts findings will shock many: Dementia can set a family back by up to $1.6 million in expenses if the individual survives for 10 years. That works out to monthly outlays of as much as $13,600.\nThe huge financial impact of the disease has prompted experts to urge people to factor in dementia as part of their preparation for future health expenses.\nMs Lorna Tan, head of financial planning literacy at DBS Bank, says we could first consolidate information such as savings, investments and insurance policies to get a clearer picture of our financial position. This lets us see where our portfolio falls short so we can decide how much to set aside for long-term care protection, how much for other types of insurance and investments and how much more we need to save.\nSome financial advisers say planning for dementia and retirement can go hand in hand.\nMr Willis Lau, a financial planner with Great Eastern, notes that when people plan for retirement, they think only about what they want to do when they quit work, such as go travelling.\nBut people seldom consider that life may not turn out the way they wish as they could fall ill or get dementia.\nMr Lau says the money earmarked for enjoyment in retirement can help pay for care expenses if the individual gets dementia later.\nDementia is more common among those over 65 but global data in recent years has shown a rising trend of young onset dementia, which hits any time from age 30.\nMs Tan says people can consider shoring up their insurance coverage for dementia as soon as they start working.\nThe Government launched two long-term care schemes in 2020 – CareShield Life and MediSave Care – to provide basic financial support for those who become severely disabled.\nMs Tan says CareShield Life pays $600 a month while MediSave Care allows a withdrawal of up to $200 a month if the individual’s MediSave balance in his Central Provident Fund account remains above $20,000.\nSo a person could get up to $800 a month in total – but that is a paltry amount in the face of rising healthcare costs.\nDepartment of Statistics data shows healthcare costs rose 4.3 per cent in the first six months of the year over the same period in 2022. It also shows that these costs have been trending up, rising 1.1 per cent in 2021 and 2.2 per cent in 2022.\nMs Tan says an individual could get a CareShield Life supplementary plan from the three approved insurers – Singlife, Great Eastern and Income.\nThe premiums for the supplement plan can be paid by cash, or the individual’s or his family member’s MediSave account, up to a limit of $600 a year per person.\nMs Tan says that with a supplement, the individual receives a payout when he cannot fulfil one or two out of six activities of daily living (ADLs), as opposed to three ADLs, which is the criteria for the basic CareShield Life.\nThe six ADLs are bathing, wearing your clothes, eating on your own, going to the toilet, walking or moving about, and moving from a bed to an upright chair.\nThe supplements can lift the payout to $5,000 a month, Ms Tan adds, depending on the premiums and the severity of the disability.\nMr Alfred Chia, chief executive of financial advisory firm SingCapital, notes that the yearly premiums for CareShield Life supplements do not go up with age, so if the individual buys the supplementary plan at 30, the premiums will be fixed then.\n“Do it when you are young. Now that you can buy at 30 years old, do so,” he adds.\nYour premiums are cheaper because you are young, he says, noting that it is not like the hospitalisation plans where premiums rise as you age.\nMr Chia says everyone should review their insurance policies which pay out on total permanent disability (TPD), especially if they had bought them 15 to 20 years ago.\nIt is difficult to make any claims on the old TPD policies, he adds, because the criteria – “total and irrecoverable loss of sight of both eyes” or “irrecoverable loss of use of both limbs” – are strict.\nMr Chia says reforms introduced about 10 years ago made the criteria less strict: As long as the individual cannot perform any three of the six ADLs, he will be able to claim for dementia.\nGreat Eastern’s Mr Lau says people who have coverage for critical illness can consider claiming payouts under their policies for these as well.\nAlzheimer’s disease/severe dementia is one of the 37 critical illnesses, notes the Life Insurance Association.\nBeing financially prepared is all well and good, but it will be difficult and time-consuming to execute any well-thought-out financial plan if a person did not make his lasting power of attorney (LPA).\nThe LPA is a legal document that allows a person who is at least 21 to voluntarily appoint one or more people (donees) to make decisions and act on their behalf if they lose mental capacity.\nDonees can be appointed to take care of a person’s personal welfare and manage his property and other financial affairs.\nThere are two LPA forms. Form 1 grants donees general powers with basic restrictions and can be done online on the Office of the Public Guardian website. The second form bestows on donees customised and specific powers and needs to be drafted by a lawyer.\nMs Tan says an LPA prevents a person’s family from being caught in unnecessary, lengthy and costly court proceedings to apply for deputyship to manage his personal and financial affairs.\n“An LPA can prevent families from being locked out of bank accounts, insurance proceeds and assets when they need them most,” she adds.\nLawyer Chong Yue-En from Bethel Chambers says people must think carefully about the person they want to appoint as their donees because there are no checks and balances on them; they do not have to report to anybody on how they use the money.\n“There are donees who run away with the money or spend it on themselves,” he adds.\nHe also advises everyone to also do an advanced care plan when they make their LPAs.\nThese plans spell out how the person wants to be medically treated and cared if he loses mental capacity.", "url": "https://www.straitstimes.com/business/invest/counting-the-cost-of-dementia-and-how-you-can-be-prepared-for-it"}