{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 13:37:25", "date_modify": "2024-10-12 13:37:25", "date_publish": "2024-07-25 14:45:52", "description": "The move will be supported by the Ministry of Trade and Industry and Enterprise Singapore. Read more at straitstimes.com.", "filename": "business_economy_sbf-plans-initiative-to-help-s-pore-businesses-benefit-from-cross-border-trade-investment_1728740245.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/25/IMG3622.JPG?VersionId=CVaW7sbGSSLQI_eyy.rFp687e6hAcn3m", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_sbf-plans-initiative-to-help-s-pore-businesses-benefit-from-cross-border-trade-investment_1728740245.html", "title": "SBF plans initiative to help S’pore businesses benefit from cross-border trade, investment", "title_page": "SBF plans initiative to help S’pore businesses benefit from cross-border trade, investment | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Singapore Business Federation (SBF) is setting up a new public-private partnership initiative to boost cross-border trade and investment between local companies and their regional peers.\nThe Centre for the Future of Trade and Investment (CFOTI) will build capability among Singapore and regional businesses to maximise the benefits of trade and investment, said SBF vice-chairman Andrew Kwan at the Singapore Apex Business Summit on July 25.\nThe centre will be supported by the Ministry of Trade and Industry and Enterprise Singapore as well as businesses, foundations and other like-minded partners, he said.\nSBF said in a statement that the CFOTI aims to build a regional community of trade and investment practitioners, thought leaders and government officials working together to advance global trade.\nManpower Minister Tan See Leng told the summit, held at Sands Expo and Convention Centre, that the new centre “represents a strong desire by the business community to significantly expand its existing trade competencies and capabilities, in response to the increasingly complex global trade environment”.\nHe added that initiatives such as this are imperative, as the next era of trade and globalisation will be marked by significant discontinuities and disruptions. “We hope that for businesses, you can also play your part by staying nimble, agile and responsive,” he noted.\nDr Tan also highlighted global trends that could reshape the global trade and investment landscape, including the US-China rivalry, a reorienting of world trade along geopolitical lines, climate change and technology.\nHe said geo-economic competition has led countries to enact measures to protect their domestic economies. The World Trade Organisation estimates that trade between allied blocs has grown 4 per cent to 6 per cent more slowly than trade within such blocs.\nHowever, the reorientation of trade flows has also led to the formation of new trade corridors within South-east Asia that have benefited from an increase in imports of intermediate goods from China and exports of finished goods to the US.\n“For our businesses, especially our SMEs (small and medium-sized enterprises), this presents an opportunity not only to build your presence in new markets, grow your customer base, but also enables you to diversify and build resilient supply chains,” Dr Tan said.\nMr John Denton, the secretary-general of the International Chamber of Commerce, noted in his address that governments need to strengthen the multilateral trading system amid concerns of growing protectionism and simmering trade frictions.\n“The demise of the rules-based multilateral trading system will result in greater uncertainty and economic losses for all developing countries – including a 33 per cent decline in global trade in goods, as well as permanent GDP (gross domestic product) loss of over 5 per cent,” said Mr Denton.\nMr Kwan told the event that trade is vital to Singapore as a small city-state with no natural resources, adding: “However, a stable and open business environment cannot be taken for granted, given an increasingly volatile trade and regulatory environment.\n“A coordinated response from stakeholders in Singapore and the broader region is required for businesses to anticipate the opportunities and overcome the challenges of trade and investment trends and remain globally competitive.”", "url": "https://www.straitstimes.com/business/economy/sbf-plans-initiative-to-help-s-pore-businesses-benefit-from-cross-border-trade-investment"}