{"authors": [], "date_download": "2024-10-12 14:13:16", "date_modify": "2024-10-12 14:13:16", "date_publish": "2022-10-26 11:56:03", "description": "BEIJING – China’s economy slowed in October as car and real estate sales weakened and global trade and small business confidence contracted, signalling September’s pickup in activity was not enough to change the grim economic picture. Read more at straitstimes.com.", "filename": "business_china-s-economy-slows-in-october-as-business-confidence-slumps_1728742396.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/26/mdflats26102022_3.jpg?VersionId=jmhyLYBcv0XnjXkBULUtMrBOsJZRsRjW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-economy-slows-in-october-as-business-confidence-slumps_1728742396.html", "title": "China’s economy slows in October as business confidence slumps", "title_page": "China’s economy slows in October as business confidence slumps | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China’s economy slowed in October as car and real estate sales weakened and global trade and small business confidence contracted, signalling September’s pickup in activity was not enough to change the grim economic picture.\nThat is the outlook based on Bloomberg’s aggregate index of eight early indicators for October. The overall gauge was at 4, indicating a drop-off in momentum after three months of improvement.\nSmall business confidence fell back into contraction in October for the first time since May, when Shanghai and other cities were at the height of coronavirus lockdowns. The expectation index slowed and almost every other indicator on conditions for smaller companies was negative, according to a survey of more than 500 companies by Standard Chartered Bank economists.\nWhile export orders rose, a contraction at domestically focused companies implied weaker demand in China, the economists wrote. An indicator for the manufacturing sector fell to its lowest level since February 2020, while the index for accommodation and catering was at the lowest level since at least May 2020, underlining how zero-Covid-19 curbs on movement and travel are weighing on the economy.\n“Both manufacturing and services performance sub-indexes dipped into contractionary territory,” wrote economists Hunter Chan and Ding Shuang. “Covid-19 resurgence and weaker demand were likely drags,” they added.\nThe National Day holiday period also did not appear to boost consumer spending much, with the economists calling its effect “insignificant”.\nDaily Covid-19 case numbers in China have been hovering around 1,000 since early August, despite strengthened efforts to contain outbreaks and much tighter restrictions on travel and movement ahead of the just-ended Communist Party Congress. Those controls have stopped exponential increases in cases at the expense of private consumption, which grew only 2.5 per cent in September from a year earlier.\nThere was no indication from the party congress that the government is planning any changes to the country’s zero-Covid-19 strategy, adding to a stock market rout on Monday that was the steepest since 2008. That drop reversed course somewhat on Tuesday, though the benchmark onshore share index has still lost more than a quarter of its value this year.\nThe epic sell-off, though, was almost completely ignored by Chinese state media outlets, which instead dedicated the bulk of their front pages to official news articles about President Xi Jinping. News and discussion on social media were also censored.\nThe Securities Times, which is managed by the Communist Party of China, ran a report on how the housing market might recover this quarter from its more than year-long contraction.\nDespite that optimism, housing sales in the four biggest cities in China were down almost 30 per cent in the first three weeks of the month compared with a year earlier, and property transactions slumped almost 40 per cent during the long holiday earlier in October, which is usually a time of brisk sales.\nMeanwhile, the housing market slump has slashed demand for all sorts of commodities used in construction, including steel and cement. While stocks of steel rebar have continued to fall, total steel inventories at mills rose this month, and daily crude steel production fell from earlier in October. That has caused the price of iron ore to drop to the lowest level since November.", "url": "https://www.straitstimes.com/business/china-s-economy-slows-in-october-as-business-confidence-slumps"}