{"authors": [], "date_download": "2024-10-12 13:28:25", "date_modify": "2024-10-12 13:28:25", "date_publish": "2024-06-03 10:55:00", "description": "Seatrium said the collaboration may also extend into other M1 services, including cyber security. Read more at straitstimes.com.", "filename": "business_seatrium-inks-mou-with-m1-to-explore-5g-connectivity-in-yards_1728739705.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/03/IMGSeatriumYard117U93HR8.jpg?VersionId=TDOEwMuTh6tyhSQPSes5VJ9j9Eh7jziG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_seatrium-inks-mou-with-m1-to-explore-5g-connectivity-in-yards_1728739705.html", "title": "Seatrium inks MOU with M1 to explore 5G connectivity in yards", "title_page": "Seatrium inks MOU with M1 to explore 5G connectivity in yards | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Seatrium has signed a memorandum of understanding (MOU) with M1 to enhance yard operations with 5G network.\nThis is part of Seatrium’s digital strategy, which aims to establish a smart yard equipped with “future-proof ultra-high-speed connectivity”, said the offshore and marine group on June 3.\nThe partnership aims to explore 5G connectivity within Seatrium’s yards in Singapore. This would allow for a range of digital capabilities, such as smart video analytics and artificial intelligence, to enhance the group’s overall operations.\nSeatrium said the collaboration, in addition to 5G exploration, may also extend into other M1 services, including internet of things applications, surveillance and cyber security, to support its operational needs.\nMr Chris Ong, chief executive of Seatrium, said this partnership marks a milestone in the group’s digital transformation journey.\n“By harnessing the advanced capabilities of 5G technology coupled with M1’s robust enterprise solutions, we are committed to fostering innovation and enhancing efficiency throughout our operations and business processes,” he added.", "url": "https://www.straitstimes.com/business/seatrium-inks-mou-with-m1-to-explore-5g-connectivity-in-yards"}