{"authors": [], "date_download": "2024-10-12 14:11:33", "date_modify": "2024-10-12 14:11:33", "date_publish": "2023-11-30 18:12:00", "description": "New proposal also offers creditors 17.8 per cent stake in Evergrande, in addition to an October offer. Read more at straitstimes.com.", "filename": "business_china-evergrande-seeks-to-avoid-liquidation-with-last-ditch-debt-plan-sources_1728742293.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/30/2023-11-30T074026Z1224422695RC28Q2AE85NTRTRMADP3CHINA-PROPERTY-DEBT-EVERGRANDE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-evergrande-seeks-to-avoid-liquidation-with-last-ditch-debt-plan-sources_1728742293.html", "title": "China Evergrande seeks to avoid liquidation with last-ditch debt plan: Sources", "title_page": "China Evergrande seeks to avoid liquidation with last-ditch debt plan: Sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - China Evergrande Group, the world’s most indebted property developer, is seeking to avert a potentially imminent liquidation with a last-minute debt restructuring proposal, three people with direct knowledge of the matter said.\nThe defaulted company has until a Hong Kong court hearing on Dec 4 to present a “concrete” revised debt restructuring proposal for offshore creditors, a judge said in October after its original plan had lapsed.\nBut the sources, who declined to be named as the talks are private, told Reuters that creditors were unlikely to accept Evergrande’s new proposal given low recovery prospects and growing concerns about the developer’s future.\nWith more than US$300 billion (S$400 billion) in liabilities, Evergrande exemplifies a crisis in China’s property sector, which makes up one-quarter of the world’s second-biggest economy.\nThe authorities have scrambled to support the sector as the troubles of embattled developers roiled global markets.\nGuangzhou-based Evergrande, which defaulted on its offshore debt in late 2021, did not respond to a request for comment.\nAhead of the hearing when the Hong Kong High Court will rule on a liquidation petition, Evergrande this week offered to swap some debt held by offshore creditors into equity in the company and two Hong Kong-listed units, and repay the rest with non-tradeable “certificates” backed by offshore assets, two sources said.\nThe offshore assets include the developer’s minority stakes in other companies and its receivables, one of the two sources said, and the certificates would be redeemed by Evergrande when it successfully disposes of the assets.\nThe plan is not expected to require regulatory approval, as Chinese regulators have banned the developer from issuing new bonds, he added.\nThe new proposal also offers creditors a 17.8 per cent stake in Evergrande, in addition to an October offer, previously reported by Reuters, of 30 per cent stakes in each of its two Hong Kong units – Evergrande Property Services Group and Evergrande New Energy Vehicle Group – the person said.\nMany creditors were dissatisfied with the October terms as they implied a major haircut on investments, sources have said, forcing Evergrande to scramble to sweeten the deal in what could be its final attempt to avoid liquidation.\nLiquidation challenges\nThe spectre of a messy collapse of Evergrande has been a major concern for global investors as the Chinese economy sputters, with property sales slowing and hundreds of thousands of unfinished homes across the country.\nThe Chinese authorities have announced a string of measures to revive the sector destabilised by the debt woes of giants like Evergrande and Country Garden.\nEvergrande’s debt revamp hopes were derailed in late September when the company said billionaire founder Hui Ka Yan was under investigation for unspecified “illegal crimes”.\nThe developer was banned from issuing dollar bonds, a key part of the restructuring plan, and its flagship mainland unit was put under investigation by regulators.\nIf the Hong Kong court orders Evergrande’s liquidation, a provisional liquidator and then an official liquidator would be appointed to take control and arrange to sell the company’s assets to repay its debts.\nIn addition to shares of its two Hong Kong-listed units, this would include selling its onshore assets, which could face significant challenges, restructuring experts say.\nA lawyer for an ad hoc group of key offshore bondholders told the Hong Kong court in October that the restructuring plan could have a higher recovery rate for creditors than liquidation, in which they would get back less than 3 per cent.\nStill, the group has nominated consultancy Alvarez & Marsal as its preferred liquidator, two other sources said, as creditors anticipate a potential liquidation of Evergrande, whose liabilities and assets are largely in mainland China.\nAlvarez & Marsal did not immediately respond to request for comment.\nTop Shine, an investor in Evergrande unit Fangchebao, filed the liquidation petition in June 2022 after it said the developer failed to honour an agreement to repurchase shares the investor had bought in the subsidiary. REUTERS", "url": "https://www.straitstimes.com/business/china-evergrande-seeks-to-avoid-liquidation-with-last-ditch-debt-plan-sources"}