{"authors": [], "date_download": "2024-10-12 14:18:32", "date_modify": "2024-10-12 14:18:32", "date_publish": "2024-05-03 07:42:00", "description": "Huawei says its role was kept private to avoid appearing promotional. Read more at straitstimes.com.", "filename": "business_huawei-secretly-backs-us-research-awarding-millions-in-prizes_1728742712.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/03/410952023.jpg?VersionId=dtbgo8uszcRI8Vkp8RGoo10_sKTmkQ1w", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_huawei-secretly-backs-us-research-awarding-millions-in-prizes_1728742712.html", "title": "Huawei quietly funds US research competition, awarding millions in prizes", "title_page": "Huawei quietly funds US research competition, awarding millions in prizes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Huawei Technologies, the Chinese telecommunications giant blacklisted by the US, is secretly funding cutting-edge research at American universities, including Harvard, through an independent Washington-based foundation.\nHuawei is the sole funder of a research competition that has awarded millions of dollars since its inception in 2022 and attracted hundreds of proposals from scientists around the world, including those at top US universities that have banned their researchers from working with the company, according to documents and people familiar with the matter.\nThe competition is administered by Optica Foundation, an arm of the non-profit professional society Optica, whose members’ research on light underpins technologies such as communications, biomedical diagnostics and lasers.\nThe foundation “shall not be required to designate Huawei as the funding source or programme sponsor” of the competition and “the existence and content of this agreement and the relationship between the parties shall also be considered confidential information”, said a non-public document reviewed by Bloomberg.\nThe findings reveal one strategy Huawei is using to remain at the forefront of funding international research, despite a web of US restrictions imposed over the past several years in response to concerns that its technology could be used by Beijing as a spy tool.\nApplicants and university officials contacted by Bloomberg as well as one of the competition’s judges said they had not known of Huawei’s role in funding the programme until they were asked by a reporter.\nA cross-section of applicants interviewed by Bloomberg said they believed the money came from the foundation and not a foreign entity.\nThere are 11 opportunities on the Optica Foundation website listing “early career prizes and fellowships”. All but the Huawei-funded competition – which awards US$1 million (S$1.35 million) per year, or 20 times the next most-lucrative annual cash prize on the site – list individual and corporate financial contributors.\nA Huawei spokesman said the company and the Optica Foundation created the competition to support global research and promote academic communication.\nThe spokesman said Huawei’s name was kept private to keep the contest from being seen as promotional and that there was no ill intent.\nMs Liz Rogan, Optica’s chief executive, said in a statement that some foundation donors “prefer to remain anonymous, including US donors”, and that “there is nothing unusual about this practice”.\nMs Rogan said the Huawei donation had been reviewed by outside legal counsel and won the approval of the foundation’s board.\n“We are completely transparent with the funding and support of the foundation programmes with the Optica Foundation Board, the Optica Board and staff,” she said.\nThe secretive effort in Washington stands in contrast with public initiatives by Huawei in several European countries.\nFrance and Germany, for example, are home to company-branded scientific hubs despite a European Commission recommendation that the company’s equipment be barred from member state networks over security risks.\nOptica Foundation’s 2023 annual report acknowledges Huawei in a section listing “highest-level donors” who have given more than US$1 million since the organisation’s founding more than two decades ago.\nUS tech giants Google and Meta Platforms are among those in the second-highest tier of donors who have given US$200,000 or more.\nFearful of losing funding from federal sources, including the Pentagon and National Science Foundation because of security concerns, many US universities have told researchers in recent years to cut ties with Huawei. Schools have also beefed up policies requiring academics to disclose foreign funding.\nThe foundation’s secret funding arrangement likely does not violate US Commerce Department regulations blocking people and organisations from sharing technology with Huawei, said Mr Kevin Wolf, a partner at the law firm Akin who specialises in export controls.\nThat is because such rules do not apply to the type of research the competition is soliciting – science that is meant to be published, Mr Wolf said.\nBut if Huawei were subject to Treasury Department sanctions, the activity probably would not be legal, he added.\nResearch security specialists said the lack of transparency underlying the arrangement nonetheless violates the spirit of university and US funding-agency policies requiring researchers to disclose whether they are receiving foreign money.\nThey also said some of the resulting research is likely to have both defence and commercial relevance.\nTopics the Optica Foundation singles out in an online post as being “of interest” include “undersea and space-based solutions for the global communications grid” and “high-sensitivity optical sensors and detectors”.\nMr James Mulvenon, a defence contractor who has worked on research security issues and co-authored a seminal book on Chinese industrial espionage, said: “It’s a bad look for a prestigious research foundation to be anonymously accepting money from a Chinese company that raises so many national security concerns for the US government.”\nMr Jeff Stoff, founder of the non-profit Centre for Research Security and Integrity, said funding the competition could effectively let Huawei influence “what research projects it would like to see without having to contract directly with academic institutions”.\nHe said the company could use the arrangement to recruit talent by sponsoring applicants of interest and acquiring intellectual property from their research in the future.\nHuawei optical expert\nHuawei has one executive on the competition’s 10-person selection committee. Hong Kong-based scientist Liu Xiang is Huawei’s chief optical standards expert, according to his LinkedIn profile.\nIn 2021, he published a book about 5G communications technology after spending more than seven years at Huawei’s US unit Futurewei, the profile says. Prior to earning a doctorate at Cornell University, Dr Liu studied at the Chinese Academy of Sciences’ Institute of Physics, which operates under the State Council of China.\nIn April, Dr Liu was advertised as a moderator of a virtual Optica session about “the cutting-edge technologies revolutionising connectivity between data centres”. While Optica listed the panellists’ employers – all major US tech companies – in event marketing materials, it described Dr Liu only as a fellow at Optica and another professional society. BLOOMBERG", "url": "https://www.straitstimes.com/business/huawei-secretly-backs-us-research-awarding-millions-in-prizes"}