{"authors": [], "date_download": "2024-10-12 14:11:14", "date_modify": "2024-10-12 14:11:14", "date_publish": "2024-05-27 07:38:00", "description": "The EV firm has been struggling since its parent company got sucked into China’s property crisis in 2021. Read more at straitstimes.com.", "filename": "business_evergrande-ev-unit-says-liquidators-found-potential-buyer_1728742274.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/27/2024-03-08T050439Z516265079RC2GH6AG41U1RTRMADP3CHINA-PROPERTY-DEBT-EVERGRANDE-LAWYERS.JPG?VersionId=zZSIgjIJMDMUO2Xa0_yGhQyZbbub8eGO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_evergrande-ev-unit-says-liquidators-found-potential-buyer_1728742274.html", "title": "Evergrande EV unit says liquidators found potential buyer", "title_page": "Evergrande EV unit says liquidators found potential buyer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – The electric vehicle (EV) unit of embattled real estate developer China Evergrande Group says liquidators are in talks with a potential buyer that may also extend a new line of credit to support production.\nA group of liquidators representing the owners of China Evergrande New Energy Vehicle (NEV) Group reached a preliminary agreement with an unidentified buyer that could take an initial 29 per cent stake, according to a Hong Kong stock exchange filing on May 26. The deal, which still requires due diligence, would include an option to buy an additional 29.5 per cent later.\nThe agreement includes a possible credit line to be arranged by the potential buyer, which is not connected with Evergrande NEV. If the deal goes ahead, it could trigger an obligation for a “mandatory general offer”, according to the filing.\nShares of Evergrande NEV more than doubled on the news. The stock jumped as much as 113 per cent – the biggest gain on an intraday basis in almost 10 years – in Hong Kong on May 27, when trading resumed after being suspended since May 17. The company said in its May 26 filing that it was applying to the bourse to resume trading on May 27.\nThe announcement comes days after Evergrande NEV was pursued by the local authorities to repay 1.9 billion yuan (S$361 million) in subsidies after failing to start its long-awaited mass production of EVs. The company’s Tianjin factory has stopped operating since the beginning of 2024.\nEvergrande NEV has been struggling since its parent company got sucked into China’s property crisis in 2021.\nThe EV maker had produced only 1,700 of its Hengchi EVs as at the end of 2023. It reported a loss of 12 billion yuan for that year. Valued at more than Ford Motor and General Motors combined at its peak, the company was worth just US$528 million (S$713 million) when the shares were suspended. BLOOMBERG", "url": "https://www.straitstimes.com/business/evergrande-ev-unit-says-liquidators-found-potential-buyer"}