{"authors": [], "date_download": "2024-10-12 14:08:40", "date_modify": "2024-10-12 14:08:40", "date_publish": "2024-05-09 14:12:00", "description": "Move raises question of whether other distressed developers in programme will go on to miss payments. Read more at straitstimes.com.", "filename": "business_country-garden-misses-bond-payment-says-guarantor-will-step-in_1728742120.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/09/2024-04-24T083844Z587149762RC22Q2A7FUK8RTRMADP3CHINA-PROPERTY-DEBT-COUNTRY-GARDEN.JPG?VersionId=vD6ORaIGVxbxtMnklaSpNh88f9C5CrmV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_country-garden-misses-bond-payment-says-guarantor-will-step-in_1728742120.html", "title": "Country Garden misses bond payment, says guarantor will step in", "title_page": "Country Garden misses bond payment, says guarantor will step in | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Chinese developer Country Garden Holdings said it cannot meet initial deadlines for interest payments on two local bonds and that a state guarantor would step in – marking the first test of a key government programme to shore up builder debt.\nThe company’s onshore unit cannot make the coupon payments on its 3.95 per cent note and its 3.8 per cent bond by an initial deadline of May 9, according to filings. Both securities are guaranteed by China Bond Insurance, a state-owned firm at the heart of a programme introduced by the authorities in 2022 to help private-sector developers avoid liquidity crunches.\nCountry Garden said it will make every effort to fully repay the interest – which totals just 65.95 million yuan (S$12.6 million) – within three working days. If payments are not made within that period, then China Bond Insurance would “fulfil its credit-enhancement responsibilities”, the statements said, without elaborating.\nThe development raises broader questions of whether other distressed developers under the state guarantee programme will also go on to miss payments, forcing the guarantor to wade in more. So far at least 33 bonds have been issued via the programme, with 33.7 billion yuan raised in total, according to data compiled by Bloomberg. No others have missed payments yet.\nOnce China’s largest developer by sales, Country Garden itself recently dodged its first local default on yuan bonds, which were not guaranteed. But strains have mounted after it defaulted on US dollar notes in 2023. The builder is fighting a liquidation petition filed by a creditor in a Hong Kong court, and the first hearing is scheduled for May 17.\nCountry Garden has been hit hard by China’s unprecedented property crisis and now is saddled with 1.36 trillion yuan of total liabilities, according to its unaudited 2023 interim results.\nAs for the missed interest payments on the guaranteed bonds, there is a five-day grace period before any default can be called.\nBut China Bond Insurance needs to step in and make payments on the builder’s behalf within three days if the company fails to pay by then, according to the bond prospectuses. BLOOMBERG", "url": "https://www.straitstimes.com/business/country-garden-misses-bond-payment-says-guarantor-will-step-in"}