{"authors": ["Colin Tan"], "date_download": "2024-10-12 14:16:35", "date_modify": "2024-10-12 14:16:35", "date_publish": "2023-08-02 21:00:00", "description": "Both the manufacturing and electronics PMIs improved but stayed in contraction territory. Read more at straitstimes.com.", "filename": "business_economy_s-pore-factory-activity-contracts-more-slowly-in-july-may-signal-a-turnaround_1728742595.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/02/yaohui-ossanwa09-8241.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_s-pore-factory-activity-contracts-more-slowly-in-july-may-signal-a-turnaround_1728742595.html", "title": "S’pore factory activity contracts more slowly in July, signalling possible turnaround", "title_page": "S’pore factory activity contracts more slowly in July, signalling possible turnaround | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - An improvement in Singapore’s factory activity in July may herald that the worst is over, after the economy only narrowly escaped a technical recession in the second quarter.\nBoth the manufacturing and electronics purchasing managers’ indexes (PMIs) improved, though they remained in contraction territory, according to the latest data released on Wednesday by the Singapore Institute of Purchasing and Materials Management.\nThe PMI reading for manufacturing rose to 49.8 points in July, up from 49.7 points in June, showing a slower rate of contraction. Electronics PMI rose over the same period to 49.3 points, up from 49 points.\nThe PMI is a barometer of the health of a sector, with readings below 50 indicating contraction, while those above 50 denote growth.\nThe better PMI data is partly attributable to a slower contraction in key indicators, including new orders and new exports.\nDBS Bank economist Chua Han Teng said the slight uptick in manufacturing was in line with a broader trend seen in other export-oriented markets, with Singapore mirroring South Korea and Vietnam.\nOCBC Bank chief economist Selena Ling noted that there were signs pointing to a bottoming out of the decline in electronics, with the fall in inventory levels due likely to a modest improvement in demand, because the data also showed lower stocks of finished goods and a larger order backlog.\n“Potentially, the manufacturing PMI may be slowly making its way back to the 50-point handle that demarcates expansion from contraction,” she said.\nMr Chua added that the entire manufacturing sector had likely bottomed as well, because “there’s a limit to how low inventory levels could go, as destocking will eventually complete and demand conditions start to stabilise again”.\nThere were other positive signals in the latest PMI data.\nMaybank Research senior economist Chua Hak Bin pointed to a similar picture that was emerging from the employment indexes of both the overall manufacturing sector and the electronics sub-sector.\n“Hiring appears to be picking up after the second-quarter slowdown, with firms turning more optimistic about the demand outlook,” he noted.\n“The worst for the manufacturing sector may already be behind us.”\nMeanwhile, there was also a softening of the input price indexes for both manufacturing and electronics.\nDr Chua said this suggests that cost pressures are continuing to ease, which is consistent with the retreat in global inflationary pressures.\nLooking ahead, DBS’ Mr Chua feels that there could be “a possible recovery over the coming months, albeit a fragile one, given still challenging global economic conditions”.\nHe said this outcome appears more convincing when seen in context with other recent data releases, including the Economic Development Board’s recent survey that showed brighter manufacturing business expectations for the second half of this year.\n“We should see electronics output recuperate somewhat, as the fall in global semiconductor sales bottoms out alongside the medium-term optimism in artificial intelligence-related chips,” he added.\n“That said, lingering geopolitical tensions could disrupt supply chains, so this area remains one to watch,” he cautioned.", "url": "https://www.straitstimes.com/business/economy/s-pore-factory-activity-contracts-more-slowly-in-july-may-signal-a-turnaround"}