{"authors": [], "date_download": "2024-10-12 14:18:57", "date_modify": "2024-10-12 14:18:57", "date_publish": "2024-03-15 08:55:00", "description": "VW needs to reduce emissions by about 15 per cent in 2025. Read more at straitstimes.com.", "filename": "business_vw-wants-eu-to-soften-emissions-targets-the-carmaker-can-t-hit_1728742737.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/15/GERMANY-AUTOMOBILE-EARNINGS-VOLKSWAGEN-085824.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_vw-wants-eu-to-soften-emissions-targets-the-carmaker-can-t-hit_1728742737.html", "title": "VW wants EU to soften emissions targets the carmaker can’t hit", "title_page": "VW wants EU to soften emissions targets the carmaker can’t hit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Volkswagen (VW) wants European regulators to walk back emissions targets that are set to kick in from 2025 and expose Germany’s biggest carmaker to hefty fines.\nVW needs to reduce emissions by about 15 per cent in 2025, according to market researcher Jato, just as electric vehicle (EV) demand in Europe is taking a hit.\nFrom 2025, vehicle-makers in the European Union have to lower the amount of carbon dioxide (CO2) emitted across new vehicle fleets, a task that will be even tougher because of a new measuring standard more closely aligned with actual driving conditions.\n“It doesn’t make sense that the industry has to pay penalties when the framework conditions for the EV ramp-up aren’t in place,” VW chief executive Oliver Blume said during the company’s annual results presentation.\n“Depending on the framework we have in the different markets, it’s important to adjust the CO2 targets, and to think what is realistic.”\nCarmakers are feeling the strain from the cooling EV shift, with new buyers getting harder to win over as incentives fall away and vehicle prices remain high.\nStellantis CEO Carlos Tavares in January warned the rush to offer affordable EVs will end in a “bloodbath” because of high production costs.\nVW on March 13 revealed plans to roll out 30 new models across the group in 2024 to add sales momentum, many of which will be electric.\nBut shifting EVs is tougher, with consumers holding back in the light of high interest rates and a sluggish economy.\nIn Germany, Europe’s biggest market, battery car sales have plummeted after the government cut subsidies altogether.\nWhile Europe’s EV sales are still rising, the trajectory of the shift has veered off course, spreading uncertainty for buyers, as well as an industry that has sunk billions of euros into the shift.\nFor 2025, VW and other carmakers can pool their fleet with battery-only carmakers such as Tesla to help reach their target, though that is costly too.\nThe United States carmaker has raked in almost US$9 billion (S$12 billion) since 2009 from carmakers needing help to meet emissions standards.\nMr Blume said pooling was an option for VW, as well as incentives to avoid the “CO2 payments we would have in 2025”, while also betting on their product offensive.\nCitigroup downgraded expectations for the EU after the share of EVs of total deliveries shrank in February.\nFor 2024, EVs are set to make up 15.5 per cent of sales, down from 18 per cent, according to analyst Harald Hendrikse. Citi also cut its 2025 forecast by 3 percentage points to 18 per cent.\nThe EU plans to phase out new sales of fuel-burning cars by 2035, with some caveats for synthetic fuels. In 2026, policymakers will assess the pace of transition and its feasibility for consumers.\nCharging infrastructure gaps and high vehicle prices remain key hurdles for the ambitious climate-friendly policy that is remaking the business case for the region’s storied auto leaders such as Renault, BMW and Mercedes-Benz.\n“The EV transition was always going to be cyclical and not a straight line,” Mr Blume told journalists on March 13, adding that he wants the EU to stick with ending combustion engine car sales by 2035.\n“We need planning certainty – it’s not helpful to have discussions to change course just when there’s a bit of headwind.” BLOOMBERG", "url": "https://www.straitstimes.com/business/vw-wants-eu-to-soften-emissions-targets-the-carmaker-can-t-hit"}