{"authors": [], "date_download": "2024-10-12 13:48:55", "date_modify": "2024-10-12 13:48:55", "date_publish": "2023-09-25 08:52:00", "description": "His comment is a rare public critique of the country’s crisis-hit property market. Read more at straitstimes.com.", "filename": "business_even-china-s-14-billion-population-can-t-fill-all-its-vacant-homes-says-former-official_1728740935.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/25/FILES-CHINA-US-PROPERTY-BANKRUPTCY-EVERGRANDE-022100.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_even-china-s-14-billion-population-can-t-fill-all-its-vacant-homes-says-former-official_1728740935.html", "title": "Even China’s 1.4 billion population can’t fill all its vacant homes, says former official", "title_page": "Even China’s 1.4 billion population can’t fill all its vacant homes, says former official | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – Even China’s population of 1.4 billion would not be enough to fill all the empty apartments littered across the country, a former official said on Saturday, in a rare public critique of the country’s crisis-hit property market.\nChina’s property sector, once the pillar of the economy, has slumped since 2021 when real estate giant China Evergrande Group defaulted on its debt obligations following a clampdown on new borrowing.\nBig-name developers such as Country Garden Holdings continue to teeter close to default even to this day, keeping home buyer sentiment depressed.\nAs at the end of August, the combined floor area of unsold homes stood at 648 million sq m, the latest data from the National Bureau of Statistics (NBS) shows.\nThat would be equal to 7.2 million homes, according to Reuters calculations, based on the average home size of 90 sq m.\nThat does not include the numerous residential projects that have already been sold but not yet completed due to cash-flow problems, or the multiple homes purchased by speculators in the last market upturn in 2016 that remain vacant, which together make up the bulk of unused space, experts estimate.\n“How many vacant homes are there now? Each expert gives a very different number, with the most extreme believing the current number of vacant homes to be enough for three billion people,” said Mr He Keng, 81, a former deputy head of the statistics bureau.\n“That estimate might be a bit much, but 1.4 billion people probably can’t fill them,” Mr He said at a forum in the southern Chinese city of Dongguan, according to a video released by the official media outlet China News Service.\nHis negative view of the economically significant sector at a public forum stands in sharp contrast to the official narrative that the Chinese economy is “resilient”.\n“All sorts of comments predicting the collapse of China’s economy keep surfacing every now and then, but what has collapsed is such rhetoric, not China’s economy,” a spokesman for the Foreign Ministry said at a recent news conference. REUTERS", "url": "https://www.straitstimes.com/business/even-china-s-14-billion-population-can-t-fill-all-its-vacant-homes-says-former-official"}