{"authors": [], "date_download": "2024-10-12 14:11:32", "date_modify": "2024-10-12 14:11:32", "date_publish": "2023-11-22 10:06:00", "description": "A creditor has seized a pair of luxury houses on Hong Kong’s Peak connected to the Evergrande chairman. Read more at straitstimes.com.", "filename": "business_hong-kong-mansions-tied-to-evergrande-chairman-seized-by-creditor_1728742292.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/22/2023-10-29T224305Z628970847RC2RG3AIZJI4RTRMADP3CHINA-PROPERTY-DEBT-EVERGRANDE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_hong-kong-mansions-tied-to-evergrande-chairman-seized-by-creditor_1728742292.html", "title": "Hong Kong mansions tied to Evergrande chairman seized by creditor", "title_page": "Hong Kong mansions tied to Evergrande chairman seized by creditor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - A creditor has seized a pair of luxury houses on Hong Kong’s Peak connected to China Evergrande Group’s chairman Hui Ka Yan, the latest setback to the fallen property tycoon.\nThe creditor, Orix Asia Capital, appointed receivers for the adjacent homes, according to documents lodged with the Land Ministry. The properties, 10C and 10E on Black’s Link, are linked to Mr Hui via his associate Tan Haijun, who is listed as a director of the companies holding the houses.\nMr Hui has seen his wealth evaporate and his freedom curtailed as creditors look to salvage what’s left of his property empire. Evergrande, the world’s most indebted developer, is at the centre of a credit crisis that has rippled through China’s real estate sector and slowed the world’s second-largest economy.\nThe owner of the two mansions pledged the assets to Orix Asia for a HK$821 million (S$141 million) mortgage loan in late 2021, filings show.\nThe properties, which are valued at more than HK$1.5 billion, will be formally seized within days, local media HK01 reported earlier.\nMr Hui had another house on Black’s Link taken by a bank last year. The creditor has been marketing the property overlooking Victoria Harbour for HK$880 million, but is struggling to find a buyer in a weak real estate market.", "url": "https://www.straitstimes.com/business/hong-kong-mansions-tied-to-evergrande-chairman-seized-by-creditor"}