{"authors": [], "date_download": "2024-10-12 13:53:25", "date_modify": "2024-10-12 13:53:25", "date_publish": "2024-08-16 07:27:00", "description": "Second-quarter net loss narrowed from US$135 million a year earlier. Read more at straitstimes.com.", "filename": "business_grab-misses-quarterly-revenue-estimates-on-tough-competition-shares-drop_1728741205.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/16/Grab220copy.jpg?VersionId=DyvrczBVOkwgajizjtGMt0ZsaDsnVJc1&h=04425db0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_grab-misses-quarterly-revenue-estimates-on-tough-competition-shares-drop_1728741205.html", "title": "Grab misses quarterly revenue estimates on tough competition; net loss narrows to $70 million", "title_page": "Grab misses quarterly revenue estimates on tough competition; net loss narrows to $70 million | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Grab Holdings’ shares slumped after the ride-hailing company reported quarterly revenue growth that trailed estimates, highlighting intense competition in the South-east Asian market.\nThe stock slid 7.4 per cent to US$3.12 at the close of trading in New York on Aug 15 after the company said revenue rose 17 per cent to US$664 million (S$878 million) in the three months to June, missing the US$676.9 million analysts predicted on average.\nSecond-quarter net loss narrowed to US$53 million (S$70 million) from US$135 million a year earlier. Adjusted earnings before interest, taxes, depreciation and amortisation were US$64 million, roughly in line with estimates.\nGrab, the largest of South-east Asia’s ride-hailing and delivery companies, is trying to prove that its brutal cost-cutting drive is yielding results. The Singapore-based company is focused on profits after years of spending to grow its market share and fend off competition.\nYet Indonesia’s GoTo Group is proving a tough rival, keeping prices low and margins thin for both companies as they battle it out in the South-east Asian market of 675 million people.\n“To us, it wasn’t a miss,” Grab chief financial officer Peter Oey said in an interview. “We’re driving more users to the platform. We’re also launching more new products.”\nShares of Grab, which had been one of the region’s hottest start-ups, are down 69 per cent since it went public through a US blank-cheque company in late 2021. Still, they have stabilised in 2024 as its losses narrowed, outperforming its main regional rivals.\nGrab, backed by Uber Technologies, is seeing growth slow from triple-digit rates in years past as customers in the region curb spending to cope with elevated inflation and interest rates. Demand is increasing at a slower pace as Grab’s customer base expands and consumers are less willing to hail a ride or get food delivered to their door in a challenging macroeconomic climate.\nProfitability on net income basis, which it has not set a concrete timeline for, will be the next big target in Grab’s effort to prove to investors it can make money.\n“For the fiscal year 2024 we’ll have a positive free cash flow, and that’ll be an important milestone for us,” Mr Oey said. “The next milestone for us is to get a positive net income.”\nBloomberg Intelligence analyst Nathan Naidu said: “Grab’s investments, such as its tie-up with online travel agent Trip.com, should allow Grab to continue to make gains with travellers amid a comeback in tourism in South-east Asia, particularly tourists from China who are seizing upon visa-free travel.\n“The boost to its fintech sales from loan-book expansion amid a further ramp-up of its Malaysian digital bank should allow it to counter normalising sales in its food delivery segment and drive group revenue.” BLOOMBERG", "url": "https://www.straitstimes.com/business/grab-misses-quarterly-revenue-estimates-on-tough-competition-shares-drop"}