{"authors": [], "date_download": "2024-10-12 14:18:50", "date_modify": "2024-10-12 14:18:50", "date_publish": "2022-06-24 17:53:11", "description": "MOSCOW -Telecoms equipment maker Cisco will wind down its business in Russia and Belarus, the company told Reuters on Thursday, as the pace of Western companies departing accelerates. Read more at straitstimes.com.", "filename": "business_companies-markets_cisco-nike-join-growing-number-of-western-firms-leaving-russia_1728742730.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/24/ads-cisconike-240622.jpg?VersionId=vEKLbhoJaD8bfwIwYDykwZGN6U5ocYC1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_cisco-nike-join-growing-number-of-western-firms-leaving-russia_1728742730.html", "title": "Cisco, Nike join growing number of Western firms leaving Russia", "title_page": "Cisco, Nike join growing number of Western firms leaving Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW (REUTERS) - Telecoms equipment-maker Cisco will wind down its business in Russia and Belarus, the company told Reuters on Thursday (June 23), as the pace of Western companies departing accelerates.\nThe United States company stopped business operations, including sales and services, in the region in March.\nCisco joined US sportswear-maker Nike which also said on Thursday that it was making a full exit from Russia, alongside others who have previously announced plans to leave, ranging from US chain McDonald's to French carmaker Renault.\nNike is leaving Russia three months after suspending its operations there, the US sportswear-maker told Reuters on Thursday.\nNike said on March 3 that it would temporarily suspend operations at all its Nike-owned and operated stores in Russia in response to Moscow's actions in Ukraine, adding that those still open were operated by independent partners.\n\"Nike has made the decision to leave the Russian marketplace. Our priority is to ensure we are fully supporting our employees while we responsibly scale down our operations over the coming months,\" said the company in a statement.\nForeign companies seeking to exit Russia because of Moscow's invasion of Ukraine face the prospect of new laws being passed in coming weeks, allowing Moscow to seize assets and impose criminal penalties. That has encouraged some businesses to accelerate their departure plans.\n\"What was a trickle is becoming a torrent,\" said political science professor Paul Musgrave at the University of Massachusetts, on Western companies exiting Russia.", "url": "https://www.straitstimes.com/business/companies-markets/cisco-nike-join-growing-number-of-western-firms-leaving-russia"}