{"authors": [], "date_download": "2024-10-12 14:10:39", "date_modify": "2024-10-12 14:10:39", "date_publish": "2024-01-25 22:30:00", "description": "The US economy has stunned captains of industry and economists who have predicted a downturn. Read more at straitstimes.com.", "filename": "business_economy_us-fourth-quarter-growth-handily-beats-expectations-on-strong-consumer-spending_1728742239.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/25/406643336.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_us-fourth-quarter-growth-handily-beats-expectations-on-strong-consumer-spending_1728742239.html", "title": "US fourth-quarter growth handily beats expectations on strong consumer spending", "title_page": "US fourth-quarter growth handily beats expectations on strong consumer spending | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – The United States economy grew faster than expected in the fourth quarter amid strong consumer spending, defying dire predictions of a recession in 2023 after the Federal Reserve aggressively raised interest rates, with growth for the full year coming in at 2.5 per cent.\nGross domestic product in the last quarter increased at a 3.3 per cent annualised rate, the Commerce Department’s Bureau of Economic Analysis said on Jan 25 in its advance estimate of fourth-quarter GDP.\nThe economy grew at a 4.9 per cent pace in the third quarter.\nEconomists polled by Reuters had forecast GDP advancing at a 2 per cent rate. Estimates ranged from a 0.8 per cent rate to a 2.8 per cent pace.\nThe US economy is expanding at a pace above what Fed officials regard as the non-inflationary growth rate of around 1.8 per cent.\nGrowth in 2023 accelerated from 1.9 per cent in 2022.\nThe US economy has stunned captains of industry, and some economists who had been calling for a downturn since mid-2022. Part of the economy’s stamina reflects labour market resilience, marked by low layoffs and strong wage gains, which are underpinning consumer spending.\nThe Labour Department, in a separate report on Jan 25, said initial claims for state unemployment benefits increased 25,000 to a seasonally adjusted 214,000 for the week ended Jan 20. Economists had forecast 200,000 claims in the latest week.\nIncreased government spending, as well as near-zero interest rates during the Covid-19 pandemic, which allowed some corporations and households to lock in low rates, have also helped stave off a recession.\nEconomists largely based their gloomy forecasts on the rapid pace at which the US central bank was raising rates to dampen demand. Most have walked back their recession calls and now expect slow growth in 2024.\nThe Fed, at its meeting next week, is expected to keep its policy rate unchanged at the current 5.25 to 5.5 per cent range.\nWith the GDP report also showing inflation pressures subsiding in the last quarter, the central bank is widely anticipated to start cutting rates sometime in the first half of 2024.\nSince March 2022, the Fed has raised its benchmark overnight rate by 525 basis points. REUTERS", "url": "https://www.straitstimes.com/business/economy/us-fourth-quarter-growth-handily-beats-expectations-on-strong-consumer-spending"}