{"authors": [], "date_download": "2024-10-12 14:12:39", "date_modify": "2024-10-12 14:12:39", "date_publish": "2023-10-01 14:00:00", "description": "Making sure the region's economy can keep growing and produce more exports has become a top priority in Beijing. Read more at straitstimes.com.", "filename": "business_economy_slowing-greying-and-in-debt-can-china-s-industrial-heartland-be-revived_1728742359.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/01/CHINANORTHEASTINDUSTRY1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_slowing-greying-and-in-debt-can-china-s-industrial-heartland-be-revived_1728742359.html", "title": "Slowing, greying and in debt, can China’s industrial heartland be revived?", "title_page": "Slowing, greying and in debt, can China’s industrial heartland be revived? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHENYANG, China – Hundreds of workers at a factory in Shenyang in north-eastern China weld automated machines, about 85 metres long, that are used to bore subway tunnels. At another factory there, employees assemble robots that China’s solar panel makers will use to streamline their production.\nShenyang is the capital of Liaoning province, one of three large provinces in the north-east that constitute the cradle of China’s heavy industry. Now the central government, confronting a national economy that has slowed because of a real estate crisis that defies easy fixes, is turning to cities like Shenyang. It hopes to squeeze more productivity and efficiency out of the region’s factories.\nBut those factories tell only part of the story of the economy of north-eastern China, underlining the challenges facing Beijing policymakers, who are turning to what many economists believe is a tired playbook focused on industrial investments instead of more social benefits for consumers.\nThe region’s birthrate is plummeting: A quarter of the population is 65 or older, and that share is growing about 2 percentage points a year, while the share of working-age adults is declining by about the same amount. Fewer people are buying new homes, apartment prices are falling and construction cranes are less active.\nNorth-eastern China is like the Michigan and Ohio of Chinese manufacturing, but with a population considerably greyer than Florida’s. In many ways, the region is a composite of the most deeply embedded problems facing the country’s economy.\nThe area is heavily in debt. Public revenues are slumping because of the real estate bust. Pensions are the responsibility of the region’s three provincial governments – Liaoning, Jilin and Heilongjiang – and their cost is soaring.\nOn a recent evening, Mr Zhang Shaocheng, 70, a retiree from a state-owned paint factory, waited with other seniors for a free outdoor movie at a shuttered Shenyang machinery factory. He appreciates that today’s factories emit less pollution than the ones from his working years, but he and other seniors are counting on the government to take care of them.\n“The air is good now, and I have a pension,” Mr Zhang said.\nAs the Chinese economy has slowed this year, the north-east is perilously close to tipping into a recession. Making sure that the economy of China’s industrial heartland can keep growing and support a rising pension burden, as well as produce more exports, has become a top priority in Beijing.\nIn early September, when heads of state gathered for the Group of 20 summit in New Delhi, China’s top leader, Mr Xi Jinping, stayed home and travelled to north-eastern China.\nThe region holds strategic importance. It encompasses sensitive regions abutting North Korea and Russia. It is home to much of China’s armaments industry, first built with Soviet advisers in the 1950s. It is China’s main producer of grain and crude oil. And it has been a bastion of China’s Communist Party since the 1940s and a hub of often strident nationalism.\nMr Xi called for quick action. What has emerged after the trip, and from media briefings in Liaoning arranged by the national government, is a plan largely focused on more public investment, a long-time theme of Beijing’s policies. A notable aspect of the program involves digital technology, steps like upgrading car factories with robots.\nWhat’s missing from it are measures that could boost consumer confidence, such as expanded unemployment benefits and pensions, or direct payments to households to stimulate spending. Such steps have been absent from measures undertaken so far to try to help the national economy.\nThe biggest step taken so far to increase demand for goods from the north-east is also the measure most likely to upset the West: selling more to Russia. Chinese automakers have captured half the car market there, for example, after Western rivals pulled out in 2022 following Russia’s invasion of Ukraine.\n“The north-east is an important gateway for our country to open to the north,” Mr Xi declared during his visit to Harbin, the capital of Heilongjiang.\nThe company recently performed an original composition, Iron Man, about industrial workers in the 1950s, hoping to attract the province’s many seniors while trying to draw a younger audience as well.\n“We want the young people to know what their fathers have done,” said the ballet’s director Qu Zijiao.\nSummer tourism has picked up after the lifting of Covid-19 controls in December. Cool weather made the north-east a popular destination as other parts of China baked in scorching temperatures.\nMs Sue Sui, 50, an accountant from Beijing, sat on the beach in Dalian on a mid-September afternoon. She said she had not been able to visit in midsummer because every affordable hotel had been fully booked.\n“There is revenge tourism spending,” she said.\nYet weaknesses in consumer spending persist. Retail sales per person in Liaoning province are just a third of the level in Beijing or Shanghai and half what they are in vibrant provinces in south-eastern China.\nThere was almost nowhere to spend money at the well-preserved brick factory buildings where Mr Zhang, the retiree, and others attended the outdoor movie. A small coffee shop was hidden behind a windowless door in a distant, unlit corner with no signage.\nIt was almost empty on the night of the movie. NYTIMES", "url": "https://www.straitstimes.com/business/economy/slowing-greying-and-in-debt-can-china-s-industrial-heartland-be-revived"}