{"authors": ["Navene Elangovan"], "date_download": "2024-10-12 13:28:28", "date_modify": "2024-10-12 13:28:28", "date_publish": "2024-10-02 19:03:47", "description": "Across the broader market, advancers beat decliners 383 to 238. Read more at straitstimes.com.", "filename": "business_companies-markets_singapore-stocks-rise-bucking-regional-trend-sti-up-01_1728739708.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/Azmi-pixgeneric-11.JPG?VersionId=agsd35lqBGGv60BE.fiHVM6fVXsgnt78&h=27eb5b5e", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_singapore-stocks-rise-bucking-regional-trend-sti-up-01_1728739708.html", "title": "Singapore stocks rise, bucking regional trend; STI up 0.1%", "title_page": "Singapore stocks rise, bucking regional trend; STI up 0.1% | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Local shares refused to follow most major regional bourses into the red on Oct 2, although the gains here were nothing to write home about.\nThe benchmark Straits Times Index (STI) inched up a mere 0.1 per cent or 3.71 points to 3,584.6 although gainers easily outpaced losers 383 to 238 on solid trade of 1.5 billion shares worth $1.6 billion.\nThe STI’s biggest gainer was DFI Retail Group, which climbed 4.1 per cent to US$2.27, while offshore and marine company Seatrium was the index’s biggest loser, sliding 2.2 per cent to $1.75.\nCasino operator Genting Singapore, up 0.6 per cent to 88 cents, was the most actively traded by volume, with 64.1 million shares worth $56.4 million changing hands.\nThe local banks were mixed, with DBS down 0.3 per cent to $37.77 and UOB retreating 0.5 per cent to $31.91, but OCBC rising 0.07 per cent to $14.97.\nThe region was mostly downbeat apart from Hong Kong’s Hang Seng, which rocketed 6.2 per cent to its highest point since January 2023, driven in large part by hopes that China’s ambitious stimulus plan will perk up growth.\nIt was gloom elsewhere, however. Australia’s ASX 200 fell 0.1 per cent, the Nikkei in Tokyo dropped by 2.2 per cent and South Korea’s Kospi retreated 1.2 per cent.\nThose numbers mirrored Wall Street overnight, with the prospect of the escalating conflict in the Middle East dragging the key indexes back from records on Oct 1.\nThe S&P 500 slipped 0.9 per cent, the Dow Jones Industrial Average dipped 0.4 per cent while the Nasdaq dropped 1.5 per cent\nSPI Asset Management managing partner Stephen Innes said that markets are “jittery” about the looming threat of a broader conflict between major regional powers in the Middle East.", "url": "https://www.straitstimes.com/business/companies-markets/singapore-stocks-rise-bucking-regional-trend-sti-up-01"}