{"authors": ["Claire Huang"], "date_download": "2024-10-12 13:53:50", "date_modify": "2024-10-12 13:53:50", "date_publish": "2024-03-19 12:10:00", "description": "The crypto top-ups in GrabPay Wallet were rolled out on March 12. Read more at straitstimes.com.", "filename": "business_grab-users-can-now-pay-in-crypto_1728741230.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/19/Grab220copy.jpg?h=04425db0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_grab-users-can-now-pay-in-crypto_1728741230.html", "title": "Grab users can now use digital currencies to top up their e-wallets", "title_page": "Grab users can now use digital currencies to top up their e-wallets | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Users of Grab’s services will now have the option of topping up their GrabPay e-wallets in cryptocurrencies following the ride-hailing operator’s tie-up with payment firm Triple-A.\nThe Straits Times was alerted by Grab users to the development after they found the new payment option available in their e-wallets.\nUsers can top up using five cryptocurrencies – Bitcoin; Ether; StraitsX’s Singapore dollar-backed stablecoin XSGD; United States dollar-backed stablecoin USDC, which is managed by global payments firm Circle; and stablecoin Tether, also known as USDT.\nStablecoins are cryptocurrencies that have their values tied to that of another currency, commodity or financial instrument. They are usually tied to the US dollar on a one-to-one basis.\nWhen asked, Triple-A said the crypto top-ups in GrabPay Wallet were rolled out on March 12.\n“From arranging deliveries to booking rides or paying for coffee at their nearest shop, digital currency owners in Singapore can now use digital currencies for everyday transactions,” it added.\nTriple-A, which is licensed in Singapore, handles the conversion of digital currencies into dollars with bank settlements instantly.\nVarious companies have been moving to add crypto as a payment option as digital assets and blockchain are viewed as having a role to play in the future of transactions.\nIn September, Grab told ST that it was focused on testing the concept of programmable money and its uses in Singapore. At the time, the firm had partnered Circle to test a blockchain-based wallet that holds digital assets in a pilot here.\nSources told ST in late 2023 that Grab had plans to apply for a digital payment token licence from Singapore’s regulator.\nWhen asked, Grab said it believes that digital money has the potential to help consumers, driver- and delivery-partners, and small businesses in its ecosystem by lowering the cost of transactions and improving security and fraud controls.\n“While it’s still in nascent stages of adoption, we have been conducting pilots to explore the potential benefits of digital payment tokens, through collaborative efforts with industry partners including Amazon, Circle, StraitsX, Triple-A and UOB,” it said.\nMeanwhile, Triple-A has been rapidly expanding its reach in the Republic.\nIn late January, the payment firm teamed up with popular bills payment platform AXS to allow people to use four digital currencies for 550 of the 600 AXS payment services. It means that members of the public can make top-ups or pay their recurring bills, such as road tax and enrichment class fees, in four cryptocurrencies – Bitcoin, Ether, USDT or USDC.\nOthers that have partnered Triple-A for crypto payments include retailers iStudio, Farfetch, and Charles and Keith; the Singapore Red Cross; financial platform Reap; and payment firm AsiaPay.", "url": "https://www.straitstimes.com/business/grab-users-can-now-pay-in-crypto"}