{"authors": [], "date_download": "2024-10-12 13:31:26", "date_modify": "2024-10-12 13:31:26", "date_publish": "2024-06-26 12:45:00", "description": "They were investigating suspected embezzlement, fraud and fraudulent bankruptcy. Read more at straitstimes.com.", "filename": "business_signa-founder-rene-benko-s-home-raided-by-police-in-fraud-probe_1728739886.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/AUSTRIA-REAL-ESTATE-BANKRUPTCY-PARLIAMENT-SIGNA-BENKO-090812.jpg?VersionId=ww8FHZMuH4kC8Wd4FPDIZEFcdwemOX6X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_signa-founder-rene-benko-s-home-raided-by-police-in-fraud-probe_1728739886.html", "title": "Signa founder Rene Benko’s home raided by police in fraud probe", "title_page": "Signa founder Rene Benko’s home raided by police in fraud probe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VIENNA - Austrian prosecutors raided the home of Signa Holding founder Rene Benko and his insolvent company’s headquarters as part of a fraud probe.\nAnti-corruption investigators said they were investigating suspected embezzlement, fraud and fraudulent bankruptcy related to Signa and Benko, according to a statement on June 25.\nA lawyer for Benko confirmed the search of the residence and said his client was cooperating with the authorities.\n“A search is currently being carried out on site in order to seize any documents relating to the allegations that have already been reported,” Mr Norbert Wess said by e-mail, referring to suspicions in the wake of Signa’s collapse.\nPhotos published by the Kronen Zeitung newspaper, which first reported the raid, showed armed police officers at the villa on the outskirts of Innsbruck, the capital of Tyrol province in western Austria.\nBenko has come under legal scrutiny in several nations following the financial meltdown of his real estate and retail empire.\nIn January, Singapore’s GIC was reported to be among holders of riskier equity-like instruments issued by Signa’s luxury real estate unit, now caught up in insolvency proceedings in Austria. GIC reportedly owned €85 million (S$123 million) of the securities, according to an insolvency filing dated Dec 28.\nThe authorities in Germany and Liechtenstein are also conducting separate probes into Signa and its founder.\nAustrian prosecutors said they were looking for possible evidence that Signa Holding managers violated their duties in transactions with shares of Signa units that involved a private trust in Liechtenstein. Prosecutors also suspect embezzlement in connection with the sale of a city centre property, according to the statement.\nThe investigation also involves allegations that Benko concealed assets, including a sports car and high-value weapons, from creditors seeking payment, prosecutors said in the statement.\nSigna Holding is working closely with prosecutors and had already secured data in December, insolvency administrator Christof Stapf told Der Standard newspaper.\nSigna’s insolvency has become a matter of hot debate in Austria before a general election at the end of September because of Benko’s ties to the country’s political elite.\nFormer chancellor Alfred Gusenbauer from Austria’s Social Democratic Party was the supervisory board chair at Signa’s two main property units. Mr Sebastian Kurz of the conservative People’s Party helped Benko secure financing as late as 2023 after leaving politics.\nThose connections were not enough to save Signa from the impact of rising interest rates and falling property prices – or subsequent legal challenges.\nSigna’s insolvency remains the focus of Austrian officials and creditors. Dr Wolfgang Peschorn, who acts as the Austrian government’s legal representative, has challenged a restructuring agreement with creditors in court, saying a bankruptcy process would shed more light on the full cause and scope of the meltdown.\nAbu Dhabi sovereign fund Mubadala Investment and other Middle Eastern investors are seeking more than €1 billion from Signa and Benko in arbitration. BLOOMBERG", "url": "https://www.straitstimes.com/business/signa-founder-rene-benko-s-home-raided-by-police-in-fraud-probe"}