{"authors": [], "date_download": "2024-10-12 13:28:09", "date_modify": "2024-10-12 13:28:09", "date_publish": "2024-07-10 07:36:00", "description": "Results show that a cycle of new purchases is underway. Read more at straitstimes.com.", "filename": "business_apple-sees-biggest-gains-as-quarterly-personal-computer-shipments-jump_1728739689.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/10/2024-07-02T201131Z1518957753RC27N8A4CL8RRTRMADP3APPLE-LAWYER.JPG?VersionId=_2i434sPJWHyq0.Vaf7CBwXgqGBDkEza", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_apple-sees-biggest-gains-as-quarterly-personal-computer-shipments-jump_1728739689.html", "title": "Apple sees biggest gains as quarterly personal computer shipments jump", "title_page": "Apple sees biggest gains as quarterly personal computer shipments jump | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Apple reported a 21 per cent gain in personal computer shipments in the second quarter, the biggest jump among global PC makers as part of a budding industry recovery that produced a second consecutive period of growth.\nWorldwide shipments of desktops and laptops increased 3 per cent from a year earlier for the period ended in June, according to a report on July 9 from IDC, an industry research firm.\nApple and Acer, which posted a jump of about 14 per cent, saw the largest growth in shipments among major manufacturers.\n“Two consecutive quarters of growth, combined with plenty of market hype around artificial intelligence PCs and a less sexy but arguably more important commercial refresh cycle, seems to be what the PC market needed,” said IDC group vice-president Ryan Reith.\nThe PC industry experienced historic declines in recent years after consumers, businesses and schools bought new machines during the pandemic in 2020 and 2021, then held off on replacements.\nThe results show that a cycle of new purchases is underway, said Evercore ISI analyst Amit Daryanani.\nComputer makers have touted AI PCs, a new type of device designed specifically to run AI tasks, as helping fuel a new wave of upgrades. IDC has said only about 3 per cent of PCs shipped in 2024 will be AI-optimised.\nDell Technologies’ shipments decreased 2.4 per cent in the quarter, making it the only major company to see a decline, while Lenovo Group commanded the highest market share at almost 23 per cent.\nHP saw an increase of 1.8 per cent from a year earlier and was the second-biggest PC maker with 21 per cent of the market.\nWeak demand in China held the overall results back – excluding that country, worldwide shipments grew more than 5 per cent, IDC said. BLOOMBERG", "url": "https://www.straitstimes.com/business/apple-sees-biggest-gains-as-quarterly-personal-computer-shipments-jump"}