{"authors": [], "date_download": "2024-10-12 14:18:24", "date_modify": "2024-10-12 14:18:24", "date_publish": "2023-03-12 16:44:42", "description": "FRANKFURT - German giant Volkswagen (VW) is set to follow Tesla’s lead with a high-profile price drop as the battle for global dominance in the electric car segment intensifies, and local challengers race ahead in key market China. Read more at straitstimes.com.", "filename": "business_volkswagen-joins-e-car-price-war-as-global-rivalry-heats-up_1728742704.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/12/GERMANY-AUTOMOBILE-ELECTRIC-VOLKSWAGEN-VW-ID3-112559_2.jpg?VersionId=WqHemUUFDrBxmKKIprHW1jklePYl1DlJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_volkswagen-joins-e-car-price-war-as-global-rivalry-heats-up_1728742704.html", "title": "Volkswagen joins e-car price war as global rivalry hots up", "title_page": "Volkswagen joins e-car price war as global rivalry hots up | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "FRANKFURT - German giant Volkswagen (VW) is set to follow Tesla’s lead with a high-profile price drop as the battle for global dominance in the electric car segment intensifies, and local challengers race ahead in key market China.\nA new version of VW’s flagship ID.3 electric car model will go on sale from the end of March for just under €40,000 (S$57,500), the brand announced this week.\nThat is a €3,000 markdown from the current ID.3 price tag, putting it on a par with US rival Tesla’s popular Model Y.\nIndustry insiders see the move as a direct response to several rounds of price-cutting by the Elon Musk-owned Tesla in recent months, including discounts of up to 20 per cent in Europe and the United States.\nIn Germany, Tesla’s sales soared by more than 900 per cent year on year in January as a result, making it the top-selling e-car brand in the country that month.\nAlthough the 10-brand VW group was Europe’s leading e-car manufacturer in 2022 with 352,000 vehicles sold, Tesla’s audacious markdowns have forced the German company’s hand, said industry analyst Ferdinand Dudenhoeffer.\n“Volkswagen sees how big the threat is from Tesla,” he told AFP.\nThe automaker will have “no choice” but to enter “a price war” to defend its place in the hotly contested market for battery-powered vehicles, even if that means profit margins take a hit for a while.\nVW group chief executive Oliver Blume has so far ruled out a general price drop on all its e-cars, but the topic is bound to come up when the group presents its 2022 financial results on Tuesday.\nBut Mr Musk is not VW’s only headache. In China, the world’s largest car market, the industry’s electrification has shifted into higher gear and VW is rapidly falling behind domestic competitors.\nChina accounts for some 40 per cent of VW group sales, mostly vehicles with traditional internal combustion engines, giving the brand a market share in China of 16 per cent.\nBut in the electric car segment, VW has eked out a market share of just 2.4 per cent, trailing Tesla at 7.8 per cent and China’s BYD at 16 per cent.\nA slew of other Chinese automakers, such as Wuling, GAC and Chery, are also outperforming VW, according to data compiled by financial daily Handelsblatt.\nFellow German carmakers Mercedes-Benz and BMW are faring no better in China – their e-models hold a market share of less than 1 per cent each.\nOf the more than five million electric vehicles sold in China in 2022, VW accounted for just 155,700.\nWith VW expecting China to make major strides in autonomous driving in the near future, the German group said in 2022 that it was teaming up with Chinese artificial-intelligence chip specialist Horizon Robotics to accelerate the development of smart-driving technologies. AFP", "url": "https://www.straitstimes.com/business/volkswagen-joins-e-car-price-war-as-global-rivalry-heats-up"}