{"authors": ["Choo Yun Ting"], "date_download": "2024-10-12 14:22:10", "date_modify": "2024-10-12 14:22:10", "date_publish": "2022-08-23 11:52:29", "description": "The frameworks will serve as a basis for future collaboration between the two countries in these two emerging areas of growth. Read more at straitstimes.com.", "filename": "business_economy_singapore-malaysia-conclude-frameworks-for-further-cooperation-in-digital-and-green-economy_1728742930.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/23/md_sgmy1_23082022.jpg?VersionId=d7ph14tfwbZ16xE1wNekJ7sioflXDK1t", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_singapore-malaysia-conclude-frameworks-for-further-cooperation-in-digital-and-green-economy_1728742930.html", "title": "Singapore, Malaysia conclude frameworks for further cooperation in digital and green economies", "title_page": "Singapore, Malaysia conclude frameworks for further cooperation in digital and green economies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore and Malaysia have substantively concluded frameworks of cooperation in the digital and green economies, further deepening bilateral economic collaboration.\nThe two countries have agreed to work towards signing both frameworks by the end of this year, Singapore's Ministry of Trade and Industry announced in a statement on Tuesday (Aug 23).\nThe frameworks will serve as a basis for future collaboration between the two countries in these two emerging areas of growth.\nThe digital economy framework will facilitate further cooperation in areas including trade facilitation, investment promotion and facilitation in digitalisation, as well as the digitalisation of micro, small and medium-sized enterprises.\nThis is intended to unlock a wider range of opportunities benefiting businesses, workers and communities in Singapore and Malaysia, as both countries capture the next phase of growth in the digital economy.\nOn the green economy front, the two South-east Asian countries will strengthen collaboration to decarbonise their industries and enable businesses and workers to seize arising opportunities.\nSingapore and Malaysia have agreed to cooperate in areas such as next-generation mobility; environmental, social and governance policy exchanges; and low-carbon solutions; as well as work on carbon credits industry collaborations.\nThe frameworks of cooperation were concluded after Trade and Industry Minister Gan Kim Yong and Malaysia's Senior Minister and Minister of International Trade and Industry Mohamed Azmin Ali met in Singapore on Monday.\nIn the statement, Mr Gan said the two frameworks of cooperation mark a milestone in the longstanding and multifaceted partnership between Singapore and Malaysia.\n\"The agreements lay the foundation for further cooperation between both countries across various areas of the green and digital economies in Singapore and Malaysia, to deliver tangible benefits to our communities and businesses,\" he said.\nDatuk Seri Azmin noted that the agreed areas of cooperation in the green economy are in line with the 12th Malaysia Plan's goal of promoting green industries and markets, reducing pollution and greenhouse gas emissions, and conserving natural resources.\nThis effort is undertaken as part of the Malaysian government's initiative to expedite the green transition of its local manufacturing sector, he said.\nSingapore has deepened cooperation and collaboration with various trade partners on the digital economy and green economy fronts in recent years, building on its extensive network of free trade agreements and other cooperation initiatives.\nTo date, Singapore has concluded negotiations on several digital economy agreements with like-minded economies such as Chile, New Zealand and Britain.\nThe Republic has also been working with Australia on the next steps towards a green economy deal, which is expected to pave the way for more bilateral trade and investment by lowering the regulatory burden on businesses and removing non-tariff barriers to trade in environmental goods and services.", "url": "https://www.straitstimes.com/business/economy/singapore-malaysia-conclude-frameworks-for-further-cooperation-in-digital-and-green-economy"}