{"authors": [], "date_download": "2024-10-12 14:12:13", "date_modify": "2024-10-12 14:12:13", "date_publish": "2023-11-22 04:33:56", "description": "The central bank wants to bring inflation firmly down to its long-term target of 2% without damaging the economy. Read more at straitstimes.com.", "filename": "business_economy_us-fed-expects-interest-rates-to-stay-high-for-some-time-minutes-show_1728742333.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/22/2023-11-10T113751Z590898261RC2I44AS76X0RTRMADP3GLOBAL-MARKETS-VIEW-USA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_us-fed-expects-interest-rates-to-stay-high-for-some-time-minutes-show_1728742333.html", "title": "US Fed expects interest rates to stay high ‘for some time’, minutes of meeting show", "title_page": "US Fed expects interest rates to stay high ‘for some time’, minutes of meeting show | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – All members of the US Federal Reserve’s powerful rate-setting committee judged earlier in November that it would be appropriate to keep interest rates high “for some time” in order to tackle inflation, minutes of its last meeting showed.\nOn Nov 1, the Fed announced it was holding interest rates at a 22-year high for a second straight meeting, as it looked to bring inflation firmly down to its long-term target of 2 per cent without damaging the strong economy.\nThe Fed’s move raised traders’ expectations that it was done hiking interest rates and was moving into a prolonged pause – although Fed chairman Jerome Powell had since said the United States central bank was prepared to hike interest rates again, if needed.\nThe minutes from the Fed’s Oct 31 to Nov 1 policy meeting showed decision-makers recognised the impact that more than a year of rate hikes has had on US inflation – which has dropped from the four-decade high seen in 2022 – but were mindful to make sure they got the job done. All committee members noted that it would be appropriate for policy “to remain at a restrictive stance for some time until inflation is clearly moving down sustainably” towards the 2 per cent target, said the minutes, which were published on Nov 21.\nThe remarks – which echo warnings from several policymakers, including Mr Powell – tempered some of the hope that the bank would slash rates in 2024, with some commentators having pencilled in such a move in March.\nHowever, it did little to fan fears of more hikes on the way, with any increase in Treasury yields seen as doing enough to tighten financial conditions.\n“If we were to see stronger economic and inflation data before the December meeting, longer-term rates are likely to rebound and substitute for a rate hike. Therefore, we do not expect further hikes,” said senior US strategist Philip Marey at Rabobank.\nThere is a belief among many traders that the Fed has managed to guide the world’s No. 1 economy to a soft landing.\nDespite the Fed’s decision to aggressively tighten monetary policy since March 2022, economic growth has remained strong and the labour market has been fairly buoyant – although it has shown some recent signs of slowing.\nThe strong recent economic data has increased the likelihood of a soft landing, whereby the Fed succeeds in tackling inflation without plunging the US into recession.\nEconomic forecasts prepared by Fed staff for the most recent rate-setting meeting expected fourth-quarter gross domestic product growth “to slow markedly from its third-quarter rate”, the Fed said on Nov 21. “All told, however, average GDP growth over the second half of the year was projected to be a little faster than the first half’s pace,” it added.\nThe Fed said back in September that it expected the US economy to grow by 2.1 per cent in 2023, and by 1.5 per cent in 2024. AFP", "url": "https://www.straitstimes.com/business/economy/us-fed-expects-interest-rates-to-stay-high-for-some-time-minutes-show"}