{"authors": [], "date_download": "2024-10-12 14:16:34", "date_modify": "2024-10-12 14:16:34", "date_publish": "2023-10-02 11:00:00", "description": "The manufacturing revival in South-east Asia lost steam, with even best performer Indonesia seeing expansion slow. Read more at straitstimes.com.", "filename": "business_asia-manufacturing-downturn-deepens-amid-depressed-global-demand_1728742594.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/02/11366981H759833.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_asia-manufacturing-downturn-deepens-amid-depressed-global-demand_1728742594.html", "title": "Asia manufacturing downturn deepens amid depressed global demand", "title_page": "Asia manufacturing downturn deepens amid depressed global demand | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Manufacturing activity remained muted in Asia ahead of the peak holiday season, extending its protracted slump in 2023.\nFactory activity in the region mostly worsened in September as lacklustre global demand for goods drove a decrease in output and new work, according to the manufacturing purchasing managers’ index (PMI) published on Monday by S&P Global and au Jibun Bank.\nJapan’s PMI slowed slightly to 48.5 in September from 49.6 in August, falling even further from the 50 index point mark that separates expansion from contraction.\nTaiwan’s gauge posted a sizeable jump to 46.4 from 44.3, signalling a softer downturn in September. The global slump has hit the export-oriented economy hard, keeping its PMI deep in the red since May 2022.\nThe manufacturing revival in South-east Asia likewise lost steam, with even the region’s best performer, Indonesia, seeing expansion slow to 52.3 in September from 53.9 the month before.\nFactories in Vietnam saw activity shrink after a month of expansion, joining the likes of Thailand, Malaysia and Myanmar. Only the Philippines saw an improvement, flipping from contraction to expansion.\nThe latest data flashes warning signs as manufacturing settles into its peak season ahead of the Christmas and New Year holidays. It undercuts cautious optimism that the global economy is finding itself on steadier footing, with consumer demand and exports firming up in some quarters.\nIt promises to be a tricky path ahead for manufacturers as the onset of the El Nino dry spell and tighter oil supply threaten to revive cost pressures and keep borrowing costs higher for longer.\nEarlier, data out of China showcased how precarious the recovery could be. Its official manufacturing PMI rose to 50.2 in September – the first expansion since March. However, the more export-oriented Caixin manufacturing PMI fell to a lower-than-expected 50.6, although still in expansion territory after the nation rolled out stimulus. BLOOMBERG", "url": "https://www.straitstimes.com/business/asia-manufacturing-downturn-deepens-amid-depressed-global-demand"}