{"authors": [], "date_download": "2024-10-12 14:08:01", "date_modify": "2024-10-12 14:08:01", "date_publish": "2024-08-13 12:39:00", "description": "Regulators told rural banks not to settle government bond purchases. Read more at straitstimes.com.", "filename": "business_china-goes-to-new-extreme-in-crackdown-on-bond-market-frenzy_1728742081.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/13/414923675.jpg?VersionId=v8VKP8DHXfhnk__1_..l6AK4RLWaq3KY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-goes-to-new-extreme-in-crackdown-on-bond-market-frenzy_1728742081.html", "title": "China goes to new extreme in crackdown on bond-market frenzy", "title_page": "China goes to new extreme in crackdown on bond-market frenzy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - The Chinese authorities are going to extraordinary lengths to tighten their grip on the world’s third-largest government bond market.\nIn a highly unusual move on Aug 9, regulators told rural banks in China’s Jiangxi province not to settle recent purchases of government bonds, an order to effectively renege on their market obligations.\nIt was the latest in a string of interventions designed to cool a market rally that sent yields to record lows and stoked official concerns that banks have become too exposed to interest-rate risk.\nFor now, the interventions appear to be having the desired effect. After touching an all-time low of about 2.12 per cent earlier in August amid mounting signs of an economic slowdown in China, the benchmark 10-year yield has steadily increased to around 2.22 per cent.\nBut the risk is that meddling by the authorities detaches the market from its economic fundamentals and undermines long-term investor confidence. The government’s attempts to intervene in shares and currency trading in recent years – with sometimes chaotic consequences – have deterred international money managers.\nIn one sign of how deep pessimism towards the country’s assets remains, data last week showed that foreigners pulled a record amount of money from China in the second quarter.\n“The PBOC (People’s Bank of China) had been repeatedly warning the market about rates risks since April, but rates have continued to decline,” said Standard Chartered head of China macro strategy Becky Liu. “This time, they want to send a strong enough message to the market, to better acknowledge their ‘comfort’ level of long-dated bonds, to reduce future speculative positions.”\nThe saga underscores the dilemma Beijing is in. While it has to support the sluggish economy by keeping borrowing costs low, it is trying to make sure money is not so cheap that a bond bubble is formed, jeopardising financial stability.\nThe authorities are mindful of the collapse of Silicon Valley Bank in the US, which piled into US Treasuries before rates rose, and have been seeking to limit risks at financial institutions.\nAmong recent measures, at least four Chinese brokerages started fresh steps to cut back trading of government bonds beginning last week, according to people with knowledge of the matter, with one saying the change followed guidance from the authorities.\nRegulators have also asked some of the nation’s largest state banks to record details of buyers of sovereign notes they sold, a subtle sign to rein in speculators.\nIn Shanghai, the PBOC branch there asked some financial institutions in the region for a meeting to discuss bond-market risks, people familiar with the matter said.\n“The PBOC’s concerns on financial risks are valid. Whether its moves are sufficient to lift the long-end yield appears uncertain,” wrote Citigroup economist Xiangrong Yu in a note on Aug 12. “Even direct intervention would be temporary, as bond yields are ultimately decided by economic fundamentals.”\nChina’s government bonds have surged in 2024 on the back of the gloomy economic outlook and expectations for interest rate cuts. The lack of attractive alternatives such as real estate and stocks, and a switch out of savings to financial investments have fanned demand. Even an increase in government borrowing to boost fiscal stimulus failed to put off buyers.\nFor Pictet Asset Management, China’s onshore bonds should always be part of global investors’ diversified portfolios, thanks to their lack of correlation to other markets and the country’s economic fundamentals. It is unperturbed by potential intervention from the PBOC, noting that bond buying and selling are normal policy measures in a central bank playbook.\n“The lack of low-volatility investment opportunities should make Chinese government bond investments attractive for many investors, especially at a time when the country’s stock market remains under pressure and the economy recovers only slowly,” Pictet analysts wrote in a note on Aug 12.\n“We don’t think this is a cause for concern.” BLOOMBERG", "url": "https://www.straitstimes.com/business/china-goes-to-new-extreme-in-crackdown-on-bond-market-frenzy"}