{"authors": [], "date_download": "2024-10-12 14:07:14", "date_modify": "2024-10-12 14:07:14", "date_publish": "2023-12-28 14:26:00", "description": "Economists polled see the UK economy growing 0.3 per cent in 2024, averting a recession. Read more at straitstimes.com.", "filename": "business_uk-economy-set-to-escape-hard-landing-in-boost-for-rishi-sunak_1728742034.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/28/BRITAIN-RETAIL-SALE-CHRISTMAS-162241.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_uk-economy-set-to-escape-hard-landing-in-boost-for-rishi-sunak_1728742034.html", "title": "UK economy set to escape hard landing in boost for Rishi Sunak", "title_page": "UK economy set to escape hard landing in boost for Rishi Sunak | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Britain’s economy will probably avoid a recession in 2024 and strengthen in the second half of the year as consumers benefit from falling inflation and the easing of a lengthy cost-of-living crisis.\nIn aggregate, the 52 economists surveyed by Bloomberg believe the Treasury and the Bank of England will engineer a soft landing for the economy in 2024, with growth of 0.3 per cent and a recession averted.\nIf the economy is to decide the outcome of the election, which must be called by January 2025, Prime Minister Rishi Sunak’s best chance is to wait until the summer, judging by forecasts for the year ahead. While those readings signal Britain will join Germany at the bottom of the Group of Seven growth table, 2024 also is expected to deliver an advance in real incomes for consumers after the worst inflation shock in three decades.\n“The outlook is far rosier for 2024 than expected 12 months ago,” said Mr Barret Kupelian, chief economist at the consulting firm PwC.\nNo issue matters more to voters than the economy, with polls by YouGov and Ipsos showing concerns about slipping living standards outranking those about health and immigration. The forecasts show the government may benefit from waiting until the summer to call a vote.\nMr Sunak and Finance Minister Jeremy Hunt have been laying the groundwork for a growth-enhancing consumer boom, scheduling a budget statement on March 6 to highlight the centrepiece of their agenda.\nThe starting point for the economy is ugly. Revisions to gross domestic product for the second and third quarters of 2023 suggest the United Kingdom may have fallen into recession at the end of 2023. Official estimates published on Dec 22 show the economy shrank 0.1 per cent in the third quarter as consumers tightened their belts.\nAlmost a third of the economists who submitted quarterly forecasts to the Bloomberg survey expect a contraction in the final three months of 2023. That would put the UK in recession under the common definition of two consecutive quarters of negative growth.\nEarly 2024 will be touch-and-go as well, according to Mr Dan Hanson, senior UK economist at Bloomberg Economics. The UK will “tread a fine line between stagnation and contraction in the first half,” he said.\nThe backdrop will improve from the summer. In the second half, growth picks up to 0.2 per cent a quarter in the Bloomberg survey. The outlook is for consumer to come to the rescue, thanks to government decisions and good luck, according to Mr Simon French, head of research at Panmure Gordon.\nAt November’s Autumn Statement, Mr Hunt announced a 9.8 per cent increase in the minimum wage for those aged 21 and over, an 8.5 per cent increase in the state pension and a 6.7 per cent increase in working age benefits. The up-ratings take effect from April.\nAt that point, Deutsche Bank chief UK economist Sanjay Raja expects headline inflation to be little more than 2 per cent. For 20 million Britons, it will mean a big, immediate improvement in living standards, Mr French said.\nBy then, 33 million workers will already be benefiting from the 2 per cent cut in National Insurance from January, which Mr Raja estimates “will add nearly £10 billion (S$16.9 billion) to disposable incomes in 2024”.\nAn improving outlook would help Mr Sunak and Mr Hunt’s argument that they have piloted the UK through a difficult patch following the pandemic and war in Ukraine, which sent inflation soaring.\nIn a budget scheduled for March 6, Mr Hunt is expected to put more money in the pockets of consumers by lopping 1 per cent off income tax, handing households £7 billion a year from April.\nMr Sunak and Mr Hunt may also get lucky. The typical household energy bill is on track to fall 14 per cent from £1,928 a year in January to £1,660 in April, according to Cornwall Insight.\nConsumer price inflation is dropping faster than expected, helping the poorest households the most. That trend has shifted the debate about interest rates away from further increases and towards cuts starting from the middle of 2024. Investors are pricing in five quarter-point reductions in the key rate, which at 5.25 per cent now is at the highest level since 2008.\nThat sentiment alone is a big help to mortgage borrowers, about 20 per cent of whom will have to refinance their loans in 2024. With markets tilting towards rate cuts, those whose low-cost deals are ending are facing a much less severe hit than analysts had warned of.\nEven so, the outlook remains unusually uncertain. Growth forecasts for 2024 by the economists surveyed range from minus 0.7 per cent to a positive 1.9 per cent, reflecting the risks that remain.\nA flare-up of the war in Ukraine or regional expansion of the Israel-Gaza conflict could drive up energy prices once more. Supply chains are at risk of disruption after Houthi rebels attacked commercial shipping in the Red Sea, prompting the United States to intervene. BLOOMBERG", "url": "https://www.straitstimes.com/business/uk-economy-set-to-escape-hard-landing-in-boost-for-rishi-sunak"}