{"authors": ["Vivienne Tay"], "date_download": "2024-10-12 14:14:32", "date_modify": "2024-10-12 14:14:32", "date_publish": "2020-12-29 11:46:10", "description": "Property developers see strong residential sales next year, says Cushman & Wakefield. Read more at straitstimes.com.", "filename": "business_property_single-owner-plots-older-cbd-office-sites-will-appeal-in-2021-amid-residential_1728742472.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/12/29/nz_cbd_291250.jpg?VersionId=HvOpjkksK5kXj8jglBVzzaIRrN2Rd2OM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_single-owner-plots-older-cbd-office-sites-will-appeal-in-2021-amid-residential_1728742472.html", "title": "Single-owner plots, older CBD office sites will appeal in 2021 amid residential sales buzz: Report", "title_page": "Single-owner plots, older CBD office sites will appeal in 2021 amid residential sales buzz: Report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE (THE BUSINESS TIMES) - Single-owner plots and older central business district (CBD) offices are now in the spotlight as residential property developers eye strong residential sales.\nCushman & Wakefield (C&W) expects more buzz in residential investment activity in the early part of 2021 as residential sales continue to keep pace, it said in its market outlook 2021 series.\nC&W executive director of capital markets Shaun Poh said the recent sale of the Guillemard-Jalan Molek site at $93 million has sparked a wave of interest by residential developers, particularly mid-sized ones, to look at sites that will help them ride the current cycle.\nThese include single-owner plots and older CBD offices that can take advantage of the CBD Incentive Scheme - which motivates owners of these buildings to redevelop their properties to mixed-use projects including residential.\nPrivate residential prices registered a gain of 0.8 per cent in the third quarter of 2020, compared with Q2 2020, bringing prices to its peak since Q3 2013. For the full year, sales are expected to come in at around 20,000 units, C&W said.\nMs Christine Li, C&W head of research for Singapore and South-east Asia, said the residential collective sales market is back in focus after a three-year hiatus.\n\"Signs are pointing to a possible reactivation of collective sale tenders but the long gestation period makes government land sales and private plots a preferred choice at the moment,\" she said.\nC&W expects developers to sell about 9,800 to 10,000 residential units for the whole of 2020, which can potentially exceed the 9,912 units transacted in 2019 despite the challenging economic situation.\nExcluding related-party transactions, including real estate investment trust mergers, residential sales made up the bulk of investment sales activity for the whole of 2020 at 43 per cent.\nOffice assets remained a favoured asset class in 2020 and are poised for more transactions in 2021, Ms Li said. She noted a growing interest in office properties by institutional players, opportunistic private-equity investors, wealthy individuals and family offices.\nMeanwhile, Q4 2020 saw a strong pickup in shophouse investment sales, totalling $252 million, nearly six times that of the $44 million recorded in Q3 2020.", "url": "https://www.straitstimes.com/business/property/single-owner-plots-older-cbd-office-sites-will-appeal-in-2021-amid-residential"}