{"authors": [], "date_download": "2024-10-12 13:54:09", "date_modify": "2024-10-12 13:54:09", "date_publish": "2024-09-26 07:45:00", "description": "US merchants can now buy, hold and sell cryptocurrency from their business accounts. Read more at straitstimes.com.", "filename": "business_paypal-expands-cryptocurrency-offerings-to-us-business-accounts_1728741249.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/26/2024-07-30T110723Z1779386625RC2M59A55HJZRTRMADP3PAYPAL-RESULTS.JPG?VersionId=yP9WMDsuLX0i_ME4wJqNyODkN5Yfp1lT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_paypal-expands-cryptocurrency-offerings-to-us-business-accounts_1728741249.html", "title": "PayPal expands cryptocurrency offerings to US business accounts", "title_page": "PayPal expands cryptocurrency offerings to US business accounts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – PayPal will now permit merchants in America to buy, hold and sell cryptocurrency from their business accounts, expanding on the payments firm’s already-available consumer offerings.\nPayPal has allowed consumers to buy, hold and sell digital crypto via its PayPal and Venmo accounts since 2020, and then further committed to digital currency with the launch of its US dollar-denominated stablecoin, PayPal USD, in 2023.\nThe San Jose, California-based firm has since learned more about how people want to use their crypto, according to Mr Jose Fernandez da Ponte, PayPal’s senior vice president of blockchain, cryptocurrency and digital currencies.\n“Business owners have increasingly expressed a desire for the same cryptocurrency capabilities available to consumers,” he said in a statement on Sep 25.\nMerchants have had many options for accepting crypto, such as BitPay, along with the ability to accept payments from services like Coinbase Commerce.\nPayPal’s merchant functionality will not be available in New York at launch, the firm said. Businesses will be allowed to transfer the digital currency to third-party eligible wallets, and send and receive supported tokens to and from external blockchain addresses, according to the statement. BLOOMBERG", "url": "https://www.straitstimes.com/business/paypal-expands-cryptocurrency-offerings-to-us-business-accounts"}