{"authors": [], "date_download": "2024-10-12 13:46:11", "date_modify": "2024-10-12 13:46:11", "date_publish": "2024-08-02 10:46:00", "description": "The dour mood in Asia looked set to continue into Europe, as Euro Stoxx 50 futures fell 0.9%. Read more at straitstimes.com.", "filename": "business_asia-stocks-tumble-on-economic-growth-fears-sti-down-11_1728740771.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/11514650.jpg?VersionId=u2FGtJdCXRaUIMViHxRLJY.AKs2ZZxwQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_asia-stocks-tumble-on-economic-growth-fears-sti-down-11_1728740771.html", "title": "Asia stocks slide to three-year low as Japan’s Nikkei sinks nearly 6%", "title_page": "Asia stocks slide to three-year low as Japan’s Nikkei sinks nearly 6% | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Asian shares were headed for their worst day in over three years on Aug 2, hit by a triple whammy of a sell-off in Japanese equities, a global tech rout and signs of weakness in the US economy.\nThe dour mood in Asia, sparked by data on Aug 1 that showed a measure of US manufacturing activity dropped to an eight-month low in July, looked set to continue into Europe, as Euro Stoxx 50 futures slid 0.9 per cent.\nUS stock futures extended their declines. Nasdaq futures tumbled 1.8 per cent and S&P 500 futures fell 1.1 per cent.\nThe MSCI Asia Pacific Index declined as much as 3.6 per cent, the most in over three years, with tech and industrial companies among the top losers.\nWeighing on the tech sector, Intel said third-quarter revenue will disappoint while Amazon.com projected profits that missed analysts’ estimates, sending each company’s shares lower in after-hours trading.\nBroad risk-off moves were evident across markets on Aug 2 after the weak US ISM manufacturing report stoked fears of an economic downturn and led investors to worry that the Federal Reserve may be behind the curve in cutting rates\nGeopolitical tension also weighed on sentiment, after the Israeli military said on Aug 1 that the head of Hamas’ military wing, Mohammed Deif, was killed in an Israeli airstrike in Gaza in July. The comments came a day after the group’s political leader Ismail Haniyeh was killed in Tehran.\n“At the moment... if there are any signs of weakness, then the market will grasp them. It’s looking for bad news,” said Mr Rob Carnell, ING’s regional head of research for Asia-Pacific.\nIn Asia, the Nikkei closed 5.81 per cent lower, its biggest one-day percentage fall since March 2020. The broader Topix fell 6.14 per cent in its biggest one-day drop since March 2020.\nTokyo’s sell-off came on the back of sharp yen gains after the Bank of Japan on July 31 raised interest rates to levels unseen in 15 years and unveiled a detailed plan to slow its massive bond buying.\nSouth Korea’s Kospi Index sank 3.65 per cent, while Hong Kong’s Hang Seng Index tumbled 2.3 per cent and Chinese blue-chips shed 0.9 per cent.\nSingapore’s Straits Times Index was down 1.1 per cent at 3.35pm.\nFocus now turns to the closely watched non-farm payrolls report later on Aug 2 for further clues on the health of the US labour market and the broader economy, likely to guide investor expectations of the pace and scale of Fed cuts expected later in the year.\nFutures point to a roughly 29 per cent chance of a 50-basis-point cut from the Fed in September.\nIn currencies, the yen edged 0.12 per cent higher to 149.18 per US dollar, hovering near an over four-month high.\nIt was eyeing a 3 per cent rise for the week, with gains in the Japanese currency further exacerbated by safety flows on Aug 2.\nThe Swiss franc likewise got a lift from the risk-off mood and rose to its strongest level since early February at 0.87145 per dollar.\nThe pound fell 0.05 per cent to US$1.2728, after the Bank of England cut interest rates from a 16-year high on Aug 1.\nAlso reflecting investor worries about a US economic slowdown, the 10-year Treasury yield fell to a six-month low of 3.944 per cent in early Asia trade as investors poured into the safe-haven bonds. Bond yields move inversely to prices.\nIn commodities, oil prices edged higher, though they were set for a fourth weekly decline as signs of disappointing global fuel demand growth outweighed fears of supply disruptions in the key Middle East production region.\nBrent was last up 0.6 per cent to US$79.99 a barrel, while US crude rose 0.63 per cent to US$76.79 per barrel.\nSpot gold firmed 0.55 per cent to US$2,458.99 an ounce. REUTERS", "url": "https://www.straitstimes.com/business/asia-stocks-tumble-on-economic-growth-fears-sti-down-11"}