{"authors": [], "date_download": "2024-10-12 14:16:17", "date_modify": "2024-10-12 14:16:17", "date_publish": "2023-11-24 11:15:00", "description": "Both manufacturing output and new orders fell further in November. Read more at straitstimes.com.", "filename": "business_japan-factory-activity-shrinks-for-6th-month-on-weak-demand-pmi_1728742577.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/24/FILES-JAPAN-AUTO-TOYOTA-023455.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_japan-factory-activity-shrinks-for-6th-month-on-weak-demand-pmi_1728742577.html", "title": "Japan factory activity shrinks for 6th month on weak demand", "title_page": "Japan factory activity shrinks for 6th month on weak demand | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan’s factory activity shrank for a sixth straight month in November, while modest growth in the services sector was little changed, a business survey showed on Nov 24, highlighting the fragility of the economy amid soft demand and inflation.\nThe au Jibun Bank flash Japan manufacturing purchasing managers’ index (PMI) slipped to 48.1 in November from 48.7 in October. The index has stayed below the 50 threshold that separates contraction from expansion since June.\nBoth output and new orders fell further in November, and the pace of contraction in incoming business accelerated.\nWhile pressure on capacity continued to ease, manufacturers reduced staffing for a second straight month.\n“Activity at Japanese private sector firms stagnated midway through the fourth quarter of 2023,” said Mr Usamah Bhatti, an economist at S&P Global Market Intelligence, which compiled the survey. “Demand conditions at private sector firms remained muted in November and were little changed from October.”\nThe report said that although input price inflation eased to a 27-month low, it remained high and stayed above average in the series.\nRising raw material, fuel and labour costs as well as a weak yen were among the major factors behind higher prices.\nThe au Jibun Bank flash services PMI stood at 51.7 in November, little changed from 51.6 in October, showing modest expansion in the sector, but it was the second-weakest reading so far in 2023.\nCompanies stayed confident about the business activity outlook for one year ahead, the survey said.", "url": "https://www.straitstimes.com/business/japan-factory-activity-shrinks-for-6th-month-on-weak-demand-pmi"}