{"authors": [], "date_download": "2024-10-12 14:14:27", "date_modify": "2024-10-12 14:14:27", "date_publish": "2021-12-17 07:19:47", "description": "Evergrande Group founder Hui Ka Yan's wealth alone has plunged by US$17.2 billion. Read more at straitstimes.com.", "filename": "business_property_evergrande-boss-leads-627-billion-in-lost-wealth-for-chinas-property-tycoons_1728742467.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/12/17/dw-evergrande-huikayan-211217.jpg?VersionId=B5S520ZAKZgvMOLsh1ihtRGQ0PciyUTg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_evergrande-boss-leads-627-billion-in-lost-wealth-for-chinas-property-tycoons_1728742467.html", "title": "Evergrande boss leads $62.7 billion in lost wealth for China's property tycoons", "title_page": "Evergrande boss leads $62.7 billion in lost wealth for China's property tycoons | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (BLOOMBERG) - China Evergrande Group founder Hui Ka Yan was smiling as he attended the celebration of the Communist Party's 100th-year anniversary in Beijing back in July. To many, his invitation was a sign he still had the government's backing, and that gave his company's bonds a rare boost.\nBut if any investor still had hopes then that Evergrande was too big to fail, those are far gone now. The developer's debt and shares are trading near record lows after the firm failed to honour its obligations and Fitch Ratings labelled it a defaulter.\nChinese real estate tycoons are having their worst year since at least 2012 as the government cracks down on the companies' debt binge and President Xi Jinping aims to redistribute wealth to bring \"common prosperity\".\nThe richest bosses behind the nation's property firms have lost more than US$46 billion (S$62.7 billion) combined this year, according to the Bloomberg Billionaires Index, a ranking of the world's 500 richest people that started in 2012. Mr Hui's wealth alone has plunged by US$17.2 billion, one of the biggest slumps for 2021.\n\"The real estate sector in China has grown very fast over the past two decades thanks to an aggressive expansion through high leverage, boosting wealth in the country,\" said Professor Terence Chong, an associate professor of economics at The Chinese University of Hong Kong. \"The development will definitely slow down with lower credit lines from banks. China is transforming and upgrading its economy, and property will become less mainstream in the future.\"\nChina has been trying to stabilise its economy, where the housing sector makes up about a quarter of gross domestic product.\nThe introduction last year of new financing rules to prevent another housing bubble has led to trouble for the developers after years of relying on leverage for growth. Since then, home prices have dropped, banks have become more reluctant to lend and investors have grown more sceptical of the firms.\nThe result: About 15 real estate companies have defaulted on their corporate bonds in 2021 and owners of Chinese developers have deployed at least US$3.8 billion of their own assets to help repay debt. Home buyers are left in limbo, without knowing when the houses they've already partly paid for will be finished.\nThe crisis has dented the wealth of those who got rich during the boom years, and Evergrande's Mr Hui has become the poster child for the country's fallen property tycoons.\nOnce Asia's second-richest person with a US$42 billion fortune, Mr Hui is now worth just US$6.1 billion as shares of units of his empire have tumbled and the government urged him to use his personal wealth to help repay investors.\nEarlier this month, China's central bank governor said the Evergrande tumult had to be dealt with by the market, signalling that Beijing would not bail out the world's most-indebted developer as it struggles with more than US$300 billion in liabilities.\nThe turmoil has also engulfed one of the companies that was considered among the stronger players in the industry, Shimao Group Holdings. Its bonds and shares have plunged on worries it is facing a cash crunch, while a deal between two of its units raised concerns over its corporate governance.\nFor company founder Hui Wing Mau, who started his real estate investments in the late 1980s, that means his wealth has more than halved this year, dropping by US$5.2 billion to US$4.4 billion.\nSome tycoons have even lost their billionaire status: The wealth of the Kwoks behind Kaisa Group Holdings, another defaulter, has slumped by almost 90 per cent this year to about US$160 million. Chairman Zhang Yuanlin of Sinic Holdings Group saw his 75 per cent stake lose almost all of its value in a single day.\nNow the government is doubling down on its efforts to support the economy and counter the housing slump. The People's Bank of China cut banks' reserve requirements earlier this month, and economists expect the nation will add fiscal stimulus next year.\nYet the developers' crisis is likely to lead to restructurings that will be more challenging than those for companies such as HNA Group, according to Dr Angela Zhang, an associate professor at the law faculty of The University of Hong Kong.\n\"It is hard to estimate when the crisis will ease,\" she said.", "url": "https://www.straitstimes.com/business/property/evergrande-boss-leads-627-billion-in-lost-wealth-for-chinas-property-tycoons"}