{"authors": [], "date_download": "2024-10-12 14:07:42", "date_modify": "2024-10-12 14:07:42", "date_publish": "2024-09-10 10:29:00", "description": "The changes seek to boost financial system stability during crises. Read more at straitstimes.com.", "filename": "business_australia-to-phase-out-at1-bonds-for-bank-capital-after-credit-suisse-wipe-out_1728742062.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/wgt-aubanks-100924.jpg?VersionId=Qt4iuqvnjcy2Nlx2SxUHo6wWUHE2JCHe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_australia-to-phase-out-at1-bonds-for-bank-capital-after-credit-suisse-wipe-out_1728742062.html", "title": "Australia to phase out AT1 bonds for bank capital after Credit Suisse wipe-out", "title_page": "Australia to phase out AT1 bonds for bank capital after Credit Suisse wipe-out | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Australia’s banking regulator has proposed lenders phase out the use of AT1 bonds – the kind of securities that were wiped out after Credit Suisse’s collapse – to strengthen their capital holdings in the event of a crisis.\n“The proposed changes seek to support financial system stability at times of crisis with simpler and more certain resolution of banks in the unlikely event of failure,” the Australian Prudential Regulation Authority (Apra) said in a statement on Sept 10. “They are also aimed at reinforcing confidence in the safety of deposits at times of stress.”\nUnder Apra’s proposal, the transition will start from Jan 1, 2027, with all current AT1 bonds on issue expected to be replaced by 2032. The banking regulator began examining the securities known as additional tier 1 bonds in September 2023.\nA legacy of the global financial crisis, AT1s are the lowest rung of bank debt, producing healthy returns in good times but taking a hit when a bank runs into trouble. In March 2023, about US$17 billion (S$22 billion) of the securities were completely written off when UBS Group rescued Credit Suisse.\nThe bailout was brokered by the Swiss government and helped to shore up confidence in the global financial system at a time when US regional lenders were in crisis. But it also triggered legal action by investors left out of pocket in countries from Switzerland to Japan.\nThe proposed changes “draw on the lessons of last year’s global banking turmoil where several US and European banks either failed or needed to be resolved in short succession, with a number of governments having to intervene to minimise the risk of contagion and financial system instability”, Apra said.\nApra chair John Lonsdale said AT1 bonds do not fulfil the function of stabilising a bank during times of crisis due to the complexity of the securities, the potential for legal challenges and the risk of contagion. In Australia, those risks are heightened because an “unusually high proportion” of the notes are held by retail investors, he said.\nAustralia’s big four banks each hold AT1 bonds equal to at least 1.5 per cent of their risk-weighted assets. Under the proposal, they will be able to replace those bonds with 1.25 per cent tier 2 capital and 0.25 per cent common equity tier 1 capital. Smaller lenders would be able to fully replace AT1 with tier 2 instruments.\nImplementation of the framework would likely lead to a “relatively low” increase in funding costs for so-called advanced banks, Apra said. It estimated an A$70 million (S$60.8 million) impact as a base case.\nShares of Commonwealth Bank of Australia, Westpac Banking, National Australia Bank and ANZ Group Holdings all rose more than 1 per cent on the morning of Sept 10. The benchmark S&P/ASX 200 index climbed 0.8 per cent. BLOOMBERG", "url": "https://www.straitstimes.com/business/australia-to-phase-out-at1-bonds-for-bank-capital-after-credit-suisse-wipe-out"}