{"authors": [], "date_download": "2024-10-12 13:27:12", "date_modify": "2024-10-12 13:27:12", "date_publish": "2024-10-02 04:00:00", "description": "With Enterprise Singapore’s support, Denzy is innovating with healthier offerings, scaling up production and setting its sights on South-east Asia Read more at straitstimes.com.", "filename": "business_companies-markets_gelato-cafe-owners-growing-business-supplying-b2b-customers-denzy-enterprise-singapore-keep-growing_1728739632.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/denzy_gelato_owner_damien_yau_no_sugar_added_flavours.jpg?VersionId=RgvxblBHxYRABbzrJweR1x1zpanYzPsy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_gelato-cafe-owners-growing-business-supplying-b2b-customers-denzy-enterprise-singapore-keep-growing_1728739632.html", "title": "The Straits Times", "title_page": "How S’pore couple grows gelato business | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "For years, Mr Damien Yau personally oversaw every spoonful of gelato, testing each new batch to ensure its taste and texture met his standards.\nBut in late 2023, health concerns forced the 36-year-old to step back from quality control at Denzy, the gelato business he founded with his wife, Ms Wong Hao Zhen, 37. Diagnosed with pre-hypertension due to stress and an unhealthy lifestyle, Mr Yau realised it was time for a change.\n“We thought to ourselves, why not create a healthier gelato?” says Mr Yau.\n“A lot of countries had started to put an extra tax on sugar, so we thought this gelato could be our next blockbuster product.”\nWhile working on their new product line, the Denzy team participated in a Design Activation Programme, developed by Enterprise Singapore (EnterpriseSG) and DesignSingapore Council’s School of X. The programme was designed to help companies innovate through a series of design-thinking workshops.\nMr Yau reflects on the workshops’ key takeaways, saying: “When developing a new product, our perspectives can lead us to make biased assumptions of what customers might want.”\n“The programme taught us to thoroughly test our prototype with customers and friends to understand its true utility and value before proceeding with full-scale production.”\nThe programme also provided insights on how to bridge the consumer gap and bring the products to market effectively. “We did a fun exercise where we went on the streets to ask strangers what they thought of our products,” shares Mr Yau. “We then mapped out the results to find common themes and tried to develop a product based on their needs.”\nIt was at the workshops that Mr Yau and Ms Wong crossed paths with Alchemy Foodtech, a local food innovation company.\nThis networking opportunity sparked a novel concept.\n“Alchemy Foodtech makes a probiotic fibre that feeds the good bacteria in the human gut and helps to slow down your sugar absorption rate,” says Mr Yau. “We thought that for our gelato to be a winning product, it should not only have no sugar added, but also offer functional benefits.”\nDenzy added Alchemy’s ingredient into the gelato recipe and, in 2023, launched their new range of no-sugar-added gelato flavours like Chocolate Delite, Black Sesame, and Chrysanthemum Goji. These flavours quickly became Denzy’s fastest-selling products on e-commerce platform RedMart.\n“I think younger folks these days are more health-conscious,” says Ms Wong. “And older folks tend to like their desserts not too sweet.”\nMr Yau adds, “We have customers telling us ‘Oh, my grandmother can actually eat this gelato’. It’s really heartwarming to hear.”\nCreating flavours beyond the ordinary\nThe couple’s passion for creating unique gelato flavours has propelled Denzy from a humble gelato cafe to a thriving central kitchen supplying over 50 flavours to some 100 companies in just five years. Their clientele includes restaurants, cafe chains and the Museum of Ice Cream Singapore in Dempsey.\nMr Yau says that its revenue has doubled in the past three years.\nDriven by a relentless pursuit of innovation, Mr Yau and Ms Wong constantly seek ways to improve their products and processes.\nIn 2022, Denzy participated in the Heartland Innovation Challenge. Held by the Federation of Merchants’ Associations, Singapore and supported by EnterpriseSG, this initiative aims to foster creativity and growth among local businesses.\nThrough the programme, Denzy was introduced to the Tampines West Merchants’ Association and students from Temasek Polytechnic. The new connections ignited fresh ideas.\n“We had a great time being surrounded by young, energetic students and experienced members of the merchant association,” says Mr Yau. “The exchange of ideas was thought-provoking, and we were pleased to come together and find a solution for blemished fruits that are often edible but discarded.”\nThe association collected blemished fruits from local vendors, which Denzy transformed into new gelato flavours, while the students helped with marketing and product launches.\nThe new creation, comprising unwanted oranges, was christened Christmas Orange and is now a favourite for companies ordering Denzy’s gelato for special events.\nBuilding a gelato brand from their savings\nThe Denzy story started in 2018 when the couple still held corporate jobs. Mr Yau was a recruiter at a multinational cosmetics company, and Ms Wong was a chartered accountant.\nMs Wong, now a wife and mother to a three-year-old, says, “We weren't married, we didn't have kids, we had no commitments. We decided it was the time to start our own business before it was too late.”\nThey were both foodies but had no culinary training, which shaped their strategy. “We told ourselves that it would be difficult for us to invest in a full-scale restaurant and rely on chefs to develop menus,” Mr Yau explains.\nThat was why they decided they would sell gelato. Seeing it as a versatile product they could master themselves, the couple signed up for gelato training courses in Singapore.\nMr Yau went on to seek advanced training in Bologna, Italy, where he got to know gelato sellers from around the world and saw how they customised flavours for their local markets.\nFuelled by his desire to create uniquely Asian flavours, he went on to win the Singapore’s Best Gelato award at the Singapore Gelato Championship 2019 with his creation, Pear, Ginger, Ginger Flower.\nThe couple then invested $160,000 in the first Denzy cafe at Bishan in 2019. A year later, they decided to open a central kitchen at Tai Seng to scale their business using automation, with the investment supported by EnterpriseSG.\n“We knew from the start that to sustain and grow the business, we had to move large volumes of gelato,” says Ms Wong. “So instead of concentrating on expanding our retail store, we focused on marketing our products to other businesses.”\nThis strategy led to significant growth, prompting the need for increased production capacity. In 2022, Mr Yau and Ms Wong invested in an industrial gelato maker, further streamlining their operations.\nTheir central kitchen now produces 12 tonnes of gelato monthly for their own cafes, and clients. Mr Yau and Ms Wong run the Hougang and Bedok cafes on their own, as well as operate two co-branded ones with home-grown cafe chain Huggs, at Bras Basah and Katong.\nThe automated production process has not only increased output but also reduced production time. The team can now churn approximately 300 litres of gelato in just one hour, a task that would have required multiple batches on a smaller machine. Additionally, the cooling process has been sped up from one hour to five minutes.\nLearning from regional markets for growth\nWith the central kitchen having the capacity to increase gelato production, Denzy’s next goal is to stock its products in regional supermarkets.\nTo gain insights into how companies have successfully expanded, Mr Yau joined a trade mission to Japan organised by EnterpriseSG in March last year.\nThe group visited the headquarters of renowned companies like Kumon, Ichiran Ramen, and Hakata Chocolate Shop in Tokyo and Fukuoka.\n“It was interesting to see how these brands maintain quality while balancing traditions and innovation,” says Mr Yau. “I saw that successful companies share a common hunger to innovate and differentiate themselves from the competition. From this, I learnt that to grow a company, you have to keep innovating.”\nThe Japanese culture of excellence also inspired him to renew Denzy’s focus on quality, customer satisfaction and sustainability to maintain good first impressions. “We only have one chance to impress customers, and if the quality is not up to standard, we will not get them back.”\nLast June, the couple travelled to Ho Chi Minh City and Hanoi in Vietnam on another EnterpriseSG mission trip. This time, the focus was more tactical: Meeting Vietnamese supermarkets and distributors to promote their products.\nAlthough Denzy didn’t secure a distribution deal during the Vietnam trip, Mr Yau said that the connections made with the retail channels would be vital when the company is ready to enter the Vietnamese market.\nAs Denzy sets its sights on regional expansion, Mr Yau and Ms Wong remain committed to innovation and growth. With the goal of sustained success, the couple consistently reinvests their earnings back into the business.\n“We believe that if we continue investing and working towards where we want to go, we are going to be in a better position to seize opportunities,” he says.\nThis is part of a series showcasing how Enterprise Singapore empowers home-grown businesses in their defining moments of growth, helping them transform, innovate and go global. Find out more here.\nIn partnership with", "url": "https://www.straitstimes.com/business/companies-markets/gelato-cafe-owners-growing-business-supplying-b2b-customers-denzy-enterprise-singapore-keep-growing"}