{"authors": [], "date_download": "2024-10-12 14:18:43", "date_modify": "2024-10-12 14:18:43", "date_publish": "2023-03-06 13:02:03", "description": "A price war among electric vehicle makers in China is taking a toll on even the most resilient players like BYD. Read more at straitstimes.com.", "filename": "business_byd-s-24-billion-market-rout-shows-fallout-of-tesla-price-war-in-china_1728742723.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/06/2023-02-13T071306Z1635479725RC2K3Z9FKPHORTRMADP3TESLA-CHINA-COMPETITION_3.JPG?VersionId=1xe7DYNq8gQCXd1FFAXMkD_M7bHTi9yI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_byd-s-24-billion-market-rout-shows-fallout-of-tesla-price-war-in-china_1728742723.html", "title": "BYD’s $24.2 billion market rout shows fallout of Tesla price war in China", "title_page": "BYD’s $24.2 billion market rout shows fallout of Tesla price war in China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – A price war among electric vehicle (EV) makers in China is taking a toll on even the most resilient players, as evidenced by BYD’s staggering US$18 billion (S$24.2 billion) drop in the past month.\nThe United States-listed shares of the manufacturer that is backed by investment guru Warren Buffett have declined 14 per cent since Feb 1, underperforming rival Tesla, which advanced 9 per cent during the period. In comparison, a gauge of global EV makers fell 9 per cent.\nTraders are growing wary about BYD’s prospects after the EV maker’s dealers slashed prices of some models to boost sales. The change in sentiment underscores the wave of caution that is sweeping the industry following moves by Nio and XPeng to follow Tesla’s lead in lowering prices as demand slows.\n“A gradual industry shift is under way as excessive price cuts can lead to buyers holding back, awaiting even lower prices, while also having an excessively negative impact on margin for all players,” said Mr Robert Mumford, an investment manager at GAM Hong Kong. “Lower input prices to date are not likely to offset a negative hit to margins.”\nInvestors are now sifting through the pile of stocks to determine the likely winners and losers of the price war, Mr Mumford added.\nIn this respect, some say Shenzhen-based BYD may hold up relatively well as it has better pricing power and controls most of its supply chain by producing its own chips and batteries.\n“Some players may have to undergo cash burn for market share gains and improved scale effect, which will lead to intensified competition and market consolidation,” Citigroup analysts wrote in a note. “Over the long term, we believe market consolidation will further strengthen BYD’s market share.” BLOOMBERG", "url": "https://www.straitstimes.com/business/byd-s-24-billion-market-rout-shows-fallout-of-tesla-price-war-in-china"}