{"authors": ["Tan Tam Mei"], "date_download": "2024-10-12 13:50:19", "date_modify": "2024-10-12 13:50:19", "date_publish": "2024-03-27 22:45:00", "description": "The mammoth project to relocate the capital from Jakarta will cost an estimated $39.5 billion. Read more at straitstimes.com.", "filename": "business_indonesia-s-new-capital-nusantara-draws-more-investor-interest-after-prabowo-presidential-win_1728741019.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/27/IMG-20240327-WA0008.jpg?VersionId=xw.zuLHxAlCf2IQxxhXudqNZQoIcU6aQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_indonesia-s-new-capital-nusantara-draws-more-investor-interest-after-prabowo-presidential-win_1728741019.html", "title": "Indonesia’s new capital Nusantara draws more investor interest after Prabowo presidential win", "title_page": "Indonesia’s new capital Nusantara draws more investor interest after Prabowo presidential win | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Investor interest in Indonesia’s proposed new capital Nusantara has been renewed, following official results that confirmed Defence Minister Prabowo Subianto will be the country’s next president.\nMuch of the foreign investor interest has come from Singapore, according to Mr Bambang Susantono, head of the Nusantara Capital Authority, the Cabinet-level agency tasked with managing and developing the future capital.\nIn his election campaign, Indonesian President-elect Prabowo promised to continue the development of Nusantara, which was the brainchild of outgoing Indonesian President Joko Widodo.\n“After the election, I could see the euphoria, some positive energy (for investment),” Mr Bambang told The Straits Times on the sidelines of the Indonesia-Singapore Business Forum 2024 held at the Hilton Singapore Orchard on March 27.\n“The pace of discussions has picked up and it’s now a high time for us.”\nMr Bambang, a trained civil engineer and economist, added: “I think it’s very clear that we have continuity and sustainability (for the Nusantara project). And the President-elect has visited us, he has also put his confidence in the project.”\nThe ambitious dream of moving Indonesia’s capital from Jakarta to a location some 2,000km away in the middle of a forest in East Kalimantan was the signature project for Mr Widodo, who is popularly known as Jokowi.\nHe will step down in October after a decade in office. He made the drive to modernise the nation’s infrastructure a hallmark of his administration.\nPresident-elect Prabowo pledged to continue the policies of the Jokowi administration, riding the tacit support of the popular incumbent to win almost 60 per cent of the ballots cast. His incoming Vice-President, Mr Gibran Rakabuming Raka, is Mr Widodo’s son.\nThe mammoth project to relocate the capital, announced in 2019, will cost an estimated 466 trillion rupiah (S$39.5 billion). It has drawn criticism, including from Mr Prabowo’s election rivals, about its environmental impact, and scepticism over whether it can attract foreign investment.\nMr Bambang said the Nusantara Capital Authority has received 369 letters of intent from interested investors to date, with most of the foreign investor pledges originating from Singapore.\nHe also said there are a “couple” of Singapore companies which have shown greater commitment beyond the written pledges.\n“But I cannot disclose it at this time,” he said, adding that his office typically holds three to four meetings in a day with interested parties who are not just keen to invest financially, but also to contribute in the areas of technology and renewable materials.\nHe said many delegations have asked to visit the site, from countries like Kazakhstan, Malaysia and Finland.\nIn May, more than 130 government officials and businessmen from Singapore – one of the biggest delegations – visited the 2,561 sq km site, which is about three times the size of Singapore.\nNusantara is intended to relieve pressure on Jakarta, which is vulnerable to flooding owing to heavy rainfall and land subsidence, and is beset by traffic congestion and air pollution. Greater Jakarta is home to more than 30 million people.\nBut environmentalists have warned about the destruction of forests that are home to long-nosed monkeys and orang utans, with the development of Nusantara.\nIndigenous communities around Nusantara also fear the prospect of relocation to give way to construction. Mr Bambang said they are working with all the local leaders to ensure they reach a consensus about the project.\n“We want to see the locals better off and not worse off,” he added.\nNusantara plans to be sustainable and high-tech, which will take various forms in its infrastructure. Buildings, for instance, will be required to be smart and green – the first standards of this kind in the country.\nPlanning a city from the ground up has also allowed Indonesia to align itself with international goals related to climate change, sustainable development goals and biodiversity conservation, said Mr Bambang.\n“When you have new things like that, you have an opportunity to implement all the good concepts about a city. And that allows you to put people at the heart of everything,” he said.", "url": "https://www.straitstimes.com/business/indonesia-s-new-capital-nusantara-draws-more-investor-interest-after-prabowo-presidential-win"}