{"authors": ["Kang Wan Chern"], "date_download": "2024-10-12 13:31:27", "date_modify": "2024-10-12 13:31:27", "date_publish": "2024-09-09 22:05:00", "description": "Efforts are under way to revive listings in Singapore. Read more at straitstimes.com.", "filename": "business_blockbuster-ipos-in-hk-kl-could-be-start-of-more-in-asia-as-investor-confidence-returns_1728739887.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/09/416116034.jpg?VersionId=FqB21jc7XJQNKSUo9DV0XsTQwnIFIisk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_blockbuster-ipos-in-hk-kl-could-be-start-of-more-in-asia-as-investor-confidence-returns_1728739887.html", "title": "Blockbuster IPOs in HK, KL could be start of more in Asia as investor confidence returns", "title_page": "Blockbuster IPOs in HK, KL could be start of more in Asia as investor confidence returns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Blockbuster initial public offerings (IPOs) appear to be making a comeback in the region ahead of an expected interest rate cut by the US Federal Reserve and as investor confidence returns on the back of an improving economic outlook.\nA blockbuster IPO typically involves a company whose listing is highly anticipated by investors and the public, enjoys strong valuations and media coverage, and usually raises a substantial amount of capital when it goes public.\nWith risk appetites rising, the market could see more of such IPOs as firms that had held back on listing when interest rates were high now take the opportunity to go public in the months ahead.\nThe higher interest-rate environment since 2022 has been stifling investor appetites for riskier investments like stocks.\n“Many companies are tapping the current window of opportunity to push on with their listings. Depending on the success of these listings, it may pave the way for a further revival in the IPO market, as these major listings are looked upon as a test of investors’ interest,” said Mr Yeap Jun Rong, market strategist at trading firm IG.\nMidea Group is one example. The Chinese home appliance maker on Sept 9 launched a share offering of about HK$26.97 billion (S$4.5 billion) in Hong Kong, marking the city’s largest listing in more than three years.\nThe company, which is already listed in Shenzhen, has allotted around 492.1 million shares for the Hong Kong offering, with the stock to be priced between HK$52 and HK$54.80 per share, according to bourse filings.\nThe listing eclipses that of Chinese lithium battery maker Calb, which raised US$1.3 billion (S$1.7 billion) in October 2022, and will be the biggest in Hong Kong since JD Logistics raised US$3.16 billion in May 2021.\nA successful listing by a well-known company like Midea is expected to revive the Hong Kong market, where just US$2.5 billion in IPO funds has been raised this year, compared with US$22.1 billion raised over the same period in 2021, before the Fed raised rates.\nAlso on Sept 9, Malaysia’s largest convenience store chain, 99 Speed Mart Retail Holdings, made its debut on the country’s stock exchange after an IPO that was over three times subscribed. It raised RM2.36 billion (S$705 million), marking Malaysia’s largest listing in seven years.\nShares of 99 Speed Mart began trading at RM1.85, about 12 per cent above its IPO price of RM1.65, before closing at RM1.88, up almost 14 per cent. It was the most active counter on Bursa Malaysia, with 421.96 million shares traded.\nThe listing trumps that of palm oil producer Johor Plantations Group, which raised RM735 million in July, and takes the number of IPOs on Bursa Malaysia in 2024 to 34, making Malaysia the best-performing IPO market in South-east Asia this year.\nMaybank Securities’ head of research and regional head of financials Thilan Wickramasinghe said: “We think signs of spring are emerging. Asia, and especially South-east Asia, has favourable demographics, rising incomes and a growing consumer class.\n“Many quality companies are serving this space. Now, with expectations of sustained rate cuts, favourable exchange rates, and government spending, the tide may be turning towards growing Asia again.”\nMr Rick Chan, Singapore managing partner at professional services firm Forvis Mazars, noted that Midea and 99 Speed Mart are well-known retail brands which chose to list in their home countries “largely due to the higher liquidity and valuation that similar companies traditionally received in Hong Kong and Malaysia in recent years”.\n“This shows that companies with the right elements can still raise IPO money at good valuations if they choose the right stock exchange,” he said.\n“Investors in their respective regions are already familiar with these names. Matching these IPO projects with the most suitable stock exchange boosts the likelihood of success for both.”\nDespite seeing just two small IPOs this year, efforts are under way to draw more listings to the Singapore Exchange (SGX).\nLast week, SGX hosted a dialogue between Deputy Prime Minister and Monetary Authority of Singapore (MAS) chairman Gan Kim Yong and representatives from venture capital firms and their portfolio companies. It was the first in a series aimed at engaging stakeholders in Singapore to explore strategies to streamline the IPO process and revive the local stock market.\n“The initiative is part of SGX’s ongoing engagement efforts with market stakeholders to explore various channels to enhance and build a dynamic equities market,” SGX said in a LinkedIn post.\nThe move also complements similar efforts by a review group set up by MAS on Aug 2.", "url": "https://www.straitstimes.com/business/blockbuster-ipos-in-hk-kl-could-be-start-of-more-in-asia-as-investor-confidence-returns"}