{"authors": [], "date_download": "2024-10-12 13:28:41", "date_modify": "2024-10-12 13:28:41", "date_publish": "2024-09-29 10:20:00", "description": "The reporting delay in the US could have impacted cotton prices. Read more at straitstimes.com.", "filename": "business_singapore-listed-olam-to-pay-42-million-fine-for-delayed-cotton-sales-reports_1728739721.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/29/Olam20International27s20office20at20Marina20One2C20Singaporepreview.jpg?VersionId=3drgfH8fFTG62wjwuLKRPc0dKAP58XmC&h=5e24fbdd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-listed-olam-to-pay-42-million-fine-for-delayed-cotton-sales-reports_1728739721.html", "title": "Singapore-listed Olam to pay $4.2 million fine for delayed cotton sales reports", "title_page": "Singapore-listed Olam to pay $4.2 million fine for delayed cotton sales reports | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Singapore-listed commodity trader Olam Group will pay a US$3.25 million (S$4.2 million) fine for delayed reporting of cotton sales – a move that could have impacted cotton prices – to the US Department of Agriculture (USDA) and the Commodity Futures Trading Commission (CFTC).\nOlam delayed reporting five cotton sales to an Asian buyer in 2021, the CFTC said on Sept 27.\nThe sales, which were reported as long as five weeks late, amounted to more than 375,000 bales with a value of over US$190 million, according to the commission.\nCompanies like Olam report cotton sales to the USDA, which then releases weekly and monthly export reports that are often used as an indicator of cotton demand.\n“(The delay) resulted in the publication of inaccurate and misleading information regarding cotton sales, undermining faith in a key indicator of supply and demand, and potentially impacting the integrity of commodities pricing,” CFTC director of enforcement Ian McGinley said in a statement.\nThe CFTC said Olam knew “that information indicating Olam’s counterparty might be purchasing large quantities of US cotton is a significant market indicator that affects or tends to affect the price of cotton”.\nThe Asian buyer, who was not named, is “typically one of the largest global purchasers of cotton”, the CFTC said.\nThe CFTC, in its statement, acknowledged Olam’s cooperation with the investigation of the matter, and its representations concerning its remediation.\nOlam said in a statement on Sept 28 that it cooperated fully with the CFTC’s investigation. It added that it had agreed to pay the fine without admitting or denying the findings.\nThe company regards full adherence to the regulatory requirements in all the jurisdictions where it operates as a core principle of its business, it added.\nOlam, then Olam International, agreed to pay US$3 million to settle a complaint levelled by the CFTC in January 2015, The Edge Singapore reported.\nThat settlement came without an admission or denial of the complaint as well, the paper said.\nOlam Group, among the world’s biggest agricultural commodity traders, posted a net profit of $48.03 million for the six months ended June 30, compared with $47.96 million in 2023.\nEarlier in September, its indirectly owned subsidiary Olam Agri increased its takeover bid for Namoi Cotton, just two days after independent directors at the Australian cotton producer recommended a rival offer from Louis Dreyfus Company.\nShares of Olam closed unchanged at $1.13 on Sept 27. BLOOMBERG", "url": "https://www.straitstimes.com/business/singapore-listed-olam-to-pay-42-million-fine-for-delayed-cotton-sales-reports"}