{"authors": [], "date_download": "2024-10-12 14:03:39", "date_modify": "2024-10-12 14:03:39", "date_publish": "2023-01-16 07:27:41", "description": "Taiwan’s heft in the industry rests on the output of giants like TSMC, which has more than half of global market share. Read more at straitstimes.com.", "filename": "business_taiwan-still-semiconductor-leader-as-chip-exports-rise-again_1728741819.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/16/2023-01-12T060351Z1501464010RC2FFY9XVC90RTRMADP3TSMC-RESULTS_4.JPG?VersionId=7vTPm5zeaGYm.A6mOqBxNIM1D8K7ZsuO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_taiwan-still-semiconductor-leader-as-chip-exports-rise-again_1728741819.html", "title": "Taiwan still semiconductor leader as chip exports surge 18.4% in 2022", "title_page": "Taiwan still semiconductor leader as chip exports surge 18.4% in 2022 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Taiwan’s exports of integrated circuit (IC) chips rose in 2022 for a seventh consecutive year, further solidifying the economy’s leadership status in a global semiconductor industry that has been roiled by US-China tensions and diversifying supply chains.\nExports of IC chips – which are pivotal components of electronic appliances, computers and smartphones – rose 18.4 per cent from a year earlier, according to Taiwan’s Ministry of Finance. It was also the third straight year of double-digit growth.\n“We believe Taiwan is irreplaceable in the near term in the semiconductor industry,” Barclays economist Son Bum Ki said in an e-mail to Bloomberg News. The firm said efforts by others such as the United States to bolster chip production will not immediately have an effect on diminishing Taiwan’s importance.\nTaiwan’s heft in the industry rests on the output of giants like Taiwan Semiconductor Manufacturing Company (TSMC), which has more than half of the market share in global semiconductor manufacturing, Mr Son pointed out, especially in the manufacturing of the world’s most cutting-edge chips.\nGlobal sales of semiconductors have driven exports for Taiwan during a time when global trade has been under immense pressure from a worldwide drop-off in demand.\nAlso keeping Taiwan important to places like the US are TSMC’s investment decisions, such as its landmark facility in Arizona, its first advanced chip plant in America.\nMr Son said the future of diversification in the industry will depend on where semiconductor fabrication plants are constructed. Mr Son cited potential plans for TSMC to build plants in Singapore and Japan, a recent Intel Corp investment in Vietnam, and India plans from Foxconn and Vedanta Resources as moves that may have lasting implications for the industry.\nThe outlook in the medium and long term is thus more fluid, Mr Son said, especially as US-China trade conflicts and Covid-19 “continue to underscore the vulnerability of concentrated supply chains”. BLOOMBERG", "url": "https://www.straitstimes.com/business/taiwan-still-semiconductor-leader-as-chip-exports-rise-again"}