{"authors": [], "date_download": "2024-10-12 13:49:07", "date_modify": "2024-10-12 13:49:07", "date_publish": "2023-09-20 09:22:00", "description": "ADB trimmed its 2023 growth forecast for developing Asia to 4.7 per cent, from 4.8 per cent projected in July. Read more at straitstimes.com.", "filename": "business_china-property-crisis-weighs-on-developing-asias-2023-growth-outlook-adb_1728740947.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/20/2023-09-13T225823Z1883802087RC2VO2AB7OMERTRMADP3CHINA-PROPERTY-DEBT-FORESTCITY.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-property-crisis-weighs-on-developing-asias-2023-growth-outlook-adb_1728740947.html", "title": "China property crisis weighs on developing Asia’s 2023 growth outlook: ADB", "title_page": "China property crisis weighs on developing Asia’s 2023 growth outlook: ADB | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA - Economic growth in developing Asia this year will be slightly lower than previously expected as the weakness in China’s property sector and El Nino-related risks cloud regional prospects, the Asian Development Bank (ADB) said on Wednesday.\nUpdating its regional economic outlook, the ADB trimmed its 2023 growth forecast for developing Asia to 4.7 per cent, from 4.8 per cent projected in July.\nBut the growth forecast for next year for the grouping, which consists of 46 economies in the Asia-Pacific and excludes Japan, Australia and New Zealand, was revised slightly upwards to 4.8 per cent from 4.7 per cent previously.\n“We see resilient growth in the region really based on pretty strong domestic consumption and investment, and despite reduced external demand, which is a dampener on export-driven growth,” said Mr Albert Park, ADB’s chief economist.\nThe ADB tempered its growth forecasts for East Asia, South Asia, and South-east Asia this year, with China and India expected to grow 4.9 per cent and 6.3 per cent respectively, slightly lower than the July growth projections of 5 per cent and 6.4 per cent.\nChina’s property crisis “poses a downside risk and could hold back regional growth”, the ADB said in its report.\nThe Manila-based lender maintained its 2024 growth forecasts for China and India at 4.5 per cent and 6.7 per cent respectively.\nWhile growth has so far been robust and inflation pressures are receding in developing Asia, Mr Park said governments need to be vigilant against the region’s many challenges, including food security.\nInflation in developing Asia is forecast to ease to 3.6 per cent this year from 4.4 per cent last year, and continue to slow to 3.5 per cent in 2024, giving central banks policy space, but the ADB said interest-rate hiking and easing cycles will vary going forward. REUTERS", "url": "https://www.straitstimes.com/business/china-property-crisis-weighs-on-developing-asias-2023-growth-outlook-adb"}