{"authors": ["Angela Tan"], "date_download": "2024-10-12 13:28:44", "date_modify": "2024-10-12 13:28:44", "date_publish": "2024-06-20 18:10:20", "description": "Controls have improved, but the global threats and risk environment have also increased in complexity. Read more at straitstimes.com.", "filename": "business_banking-sector-identified-as-posing-the-highest-money-laundering-risk-in-singapore_1728739724.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/20/IMGMoney-laundering11A569H31.jpg?VersionId=K1Gt.QKlxfCMUNlxjQpu_ASK_mzjZ_yt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking-sector-identified-as-posing-the-highest-money-laundering-risk-in-singapore_1728739724.html", "title": "Banking sector identified as posing the highest money laundering risk in Singapore", "title_page": "Banking sector identified as posing the highest money laundering risk in Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The outsize role banks play in Singapore’s financial sector puts them at highest risk of being used by criminals seeking to launder dirty money.\nThe observation came in an updated government report released on June 20 that outlined just how vulnerable banks here are to criminal exploitation.\n“As an international business, financial and trading centre with an open economy, Singapore is inevitably exposed to the threats of complex transnational money laundering, including by criminal syndicates and professional criminal elements seeking to... launder illicit funds from abroad,” said the joint report by the Ministry of Home Affairs, Ministry of Finance and Monetary Authority of Singapore (MAS).\nSingapore, whose banking sector had a total asset size of almost $3.5 trillion as at the end of 2023, has been ranked by the International Monetary Fund as one of 29 systemically important financial centres in the world.\nThe country hosts more than 1,000 financial institutions and has one of the world’s fastest growing wealth management centres, with 76 per cent of the assets under management originating from outside Singapore as at the end of 2022.\nThe authorities have observed a wide range of laundering techniques, including complex and syndicated money laundering involving bank accounts and payment accounts, structures such as shell companies and trusts, and other structures spanning multiple jurisdictions and sectors.\nMoney laundering and terrorism financing have become more complex due to geopolitics and the increased use of sophisticated financial and business structures, said the report, which has been updated from 2014.\nTechnological advancements have also provided more channels for criminals to launder or move illicit funds and assets across jurisdictions with speed and ease.\nThe recent money laundering case here, which involved over $3 billion worth of seized and prohibited assets, led to the convictions of several people for laundering proceeds from illegal online gambling for foreign criminal groups.\nSome of these funds were held in bank accounts in Singapore. Others were converted into assets such as real estate, cars, handbags and collectibles.\nIt was not just banks that were involved in the offenders’ management of their assets. Corporate service providers were engaged to incorporate companies in Singapore to hold assets, property was bought through real estate agents, and funds were placed in high-value goods bought via jewellery and precious metal dealers.\nThe Covid-19 pandemic has also heightened money laundering and terror financing risks in the banking sector as normal operating environments and work practices changed, reducing the effectiveness of some profile monitoring systems.\nThe report also noted that the advent of online-only digital banks here has also brought greater risk.\nThese new entrants may bring innovative practices to the sector, but their novel business models and potential lack of familiarity with the banking industry and money laundering may also increase the sector’s vulnerability.\nRising digital literacy and greater digitalisation of banking services have made Singapore’s banking sector more susceptible to crimes involving cyber-enabled fraud and data theft, including phishing and malware.\nDigital payment token service providers also pose relatively high levels of money laundering risks within the financial sector, the report said.\nLike elsewhere, cyber-enabled fraud, the theft of digital payment tokens, ransomware and deals in darknet markets where people trade illicit goods and services online anonymously using cryptocurrency are the main sources of illicit revenue involving digital payment tokens.\nDigital payment tokens are not actively used in Singapore as a means of payment.\nThere were 19 licensed digital payment token service providers here as at Dec 31, 2023.\nPayment institutions conducting cross-border money transfers are also potentially exploited by criminals.\n“Given that cross-border money transfer service transactions are generally small individually but are collectively voluminous, it may be easier for suspicious activity, including the structuring of transactions, to be overlooked,” the report said.\nThe authorities noted that the money laundering threat to the steadily growing trust company sector here is moderately high.\nTrusts are typically set up by wealthy individuals for succession and estate planning, asset protection or philanthropic purposes.\nThere were around 65 licensed trust companies operating in Singapore and regulated by the MAS as at the end of 2023.\nThe report noted there has been no sign of misuse among fund management companies. There are almost 800 here, and they provide customers with advisory services, among other offerings.\nWhile money changers were less commonly found to be complicit in money laundering activities, they have been seen to be particularly susceptible to dealing with forged banknotes. The cash-intensive nature of this sector and the anonymity of cash also suggest that they may unknowingly process the proceeds of crime.\nThere were about 380 entities licensed to conduct money-changing, as at the end of 2023.\nOverall, the banking industry’s compliance processes, risk awareness and ability to identify and prevent money laundering and terrorism financing are relatively strong, the report said, but it noted that smaller, less resourced banks may be more at risk.\nTo this end, the MAS and the Association of Banks in Singapore are working to uplift their controls through supervisory and industry outreach.", "url": "https://www.straitstimes.com/business/banking-sector-identified-as-posing-the-highest-money-laundering-risk-in-singapore"}