{"authors": [], "date_download": "2024-10-12 14:15:58", "date_modify": "2024-10-12 14:15:58", "date_publish": "2024-02-01 10:40:00", "description": "The Caixin/S&P Global manufacturing PMI stayed at 50.8 in January, unchanged from December. Read more at straitstimes.com.", "filename": "business_economy_chinas-factory-activity-expands-on-export-order-boost-pmi_1728742558.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/01/CHINA-ECONOMY-MANUFACTURING-055911.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_chinas-factory-activity-expands-on-export-order-boost-pmi_1728742558.html", "title": "China’s factory activity expands on export order boost", "title_page": "China’s factory activity expands on export order boost | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China’s factory activity expanded in January thanks to stable growth in output, quicker logistics and the first rise in new export orders since June, helping to lift business confidence to a nine-month high, a private sector survey showed on Feb 1.\nThe positive out-turn, however, contrasted with an official survey on Jan 31 showing manufacturing activity contracted again in January 2024 due to persistently weak demand. Taken together, they point to a still-underperforming economy in need of more policy support.\nThe Caixin/S&P Global manufacturing PMI stayed at 50.8 in January, unchanged from December and surpassing analysts’ forecasts of 50.6. The 50-point mark in the purchasing managers’ index separates growth from contraction.\n“Quicker logistics, increased procurement, and rising inventories reflected improved business confidence,” said Caixin Insight Group senior economist Wang Zhe.\nHowever, he noted that employment remained in contraction, price levels were subdued and “deflationary pressures persisted”.\nPolicymakers in China face a daunting task as they try to revitalise the economy in the face of a property downturn, local government debt risks, deflationary pressures and tepid overseas demand.\nThe crisis-hit property sector was dealt a fresh blow this week after a Hong Kong court ordered the liquidation of the debt-laden developer China Evergrande Group.\nBut the Caixin survey offered some hope that external demand may be starting to improve with new export orders increasing for the first time since June 2023, though marginally.\nThe export index may have been affected by the Chinese New Year, which will fall on Feb 10 in 2024, as factories and workers geared up for the pre-holiday shipment of goods.\nMoreover, forecasts of stronger global demand, planned investment, new product release and efforts to expand into new markets drove manufacturers’ confidence to their highest since April 2023.\nBut factories continued to trim their workforce in January, while efforts to attract and secure new orders prompted them to cut product selling prices.\nHeightened deflationary pressures have raised investor bets for further monetary easing after China announced a deep cut to bank reserves last week to support the economy and a plunging stock market. REUTERS", "url": "https://www.straitstimes.com/business/economy/chinas-factory-activity-expands-on-export-order-boost-pmi"}