{"authors": [], "date_download": "2024-10-12 13:44:28", "date_modify": "2024-10-12 13:44:28", "date_publish": "2023-08-04 09:20:00", "description": "Cathay’s shares have started to outperform SIA's in recent weeks. Read more at straitstimes.com.", "filename": "business_cathay-unseats-singapore-air-as-stock-winner-on-travel-revival_1728740668.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/04/2023-06-24T002355Z351127268RC2BP1A0LM15RTRMADP.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_cathay-unseats-singapore-air-as-stock-winner-on-travel-revival_1728740668.html", "title": "Cathay unseats SIA as stock winner on travel revival", "title_page": "Cathay unseats SIA as stock winner on travel revival | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – A reversal in the fortunes for shares of Cathay Pacific Airways and Singapore Airlines (SIA) may extend further as Hong Kong’s flagship carrier springs back to life after years of pandemic restrictions.\nA jump in buy recommendations in July for Cathay has pushed the ratio of bullish views to the most in more than a decade thanks to cheap valuations and the prospect of a return to profit.\nMeanwhile, a flurry of downgrades since June due to valuation concerns has hurt sentiment for SIA.\nThe outlook for the battered Hong Kong carrier has started to turn around following its profit forecast for the first six months of 2023, which will end a run of losses as the airline buckled under the city’s harsh travel restrictions.\nCathay’s shares have started to outperform its rival’s in recent weeks, and may rebound further if its earnings – scheduled for Aug 9 – unleash further positive momentum.\nCathay’s post-pandemic earnings power has been “underestimated” and there is room for upward revisions, JPMorgan Chase & Co analysts, including Ms Karen Li, wrote in a July 24 note.\nThe carrier preserving its leading market share in Hong Kong is a key positive, making it well-positioned to benefit from mainlanders’ long-haul transit flight demand, Ms Li added.\nShares of Cathay have rallied 21 per cent since the start of June, making it the best performer among its Asia peers and the first time that it has beaten SIA for two consecutive months since December.\nSIA has risen 11 per cent in the period, even as its year-to-date gains have trounced Cathay’s.\nWall Street analysts have already taken a cue. JPMorgan and HSBC Holdings raised Cathay to the equivalent of buy from neutral last month, citing earnings growth on resilient travel demand.\nCitigroup downgraded SIA to sell from buy last month, saying the positive earnings outlook is priced in.\nCathay is trading at a price-to-book ratio of 1.3 times, cheaper than SIA at 1.5 times, according to Bloomberg data. Analysts’ 12-month target price suggests 18 per cent upside for Cathay from its last closing price, while SIA is already trading above the consensus projection.\nThere are some signs that Cathay’s rally may take a breather. Its shares were in overbought territory this week based on the 14-day relative strength index. The put-to-call ratio, which measures the level of interest in bearish options relative to bullish contracts, has started to edge higher after touching March lows.\nBut analysts betting on an earnings revival are optimistic.\n“We expect the carrier to deliver more positive surprises in the near-term as consensus estimates appear muted,” said Mr Jason Sum, an analyst at DBS Bank.\n“We do expect more upside from here on.” BLOOMBERG", "url": "https://www.straitstimes.com/business/cathay-unseats-singapore-air-as-stock-winner-on-travel-revival"}