{"authors": [], "date_download": "2024-10-12 13:31:14", "date_modify": "2024-10-12 13:31:14", "date_publish": "2024-09-16 09:41:00", "description": "GIC and Temasek had been considering investing in Midea’s listing, Bloomberg News reported. Read more at straitstimes.com.", "filename": "business_midea-raises-52-billion-in-upsized-hong-kong-listing_1728739874.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/16/2024-08-20T090706Z393393689RC29Q2AG4H29RTRMADP3ASIA-HEDGEFUNDS-CHINA.JPG?VersionId=1RjsOi0iX0bsAIi8Ok1gdw.XsrBIbIQo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_midea-raises-52-billion-in-upsized-hong-kong-listing_1728739874.html", "title": "Chinese appliance giant Midea raises $5.2 billion in upsized Hong Kong listing", "title_page": "Chinese appliance giant Midea raises $5.2 billion in upsized Hong Kong listing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Chinese appliance giant Midea Group has raised US$4 billion (S$5.2 billion) in its Hong Kong listing in an enlarged deal that was priced at the top of the marketed range, in a show of demand for the city’s biggest share sale in over three years.\nThe Foshan, China-based company sold shares at HK$54.80 apiece, it said in a statement to the Hong Kong stock exchange on Sept 13, confirming an earlier Bloomberg News report.\nThe listing is scheduled to take place in Hong Kong on Sept 17. Midea sold 566 million shares after exercising an option to boost the size of the offering by 15 per cent due to strong demand, it said.\nThe deal size could be increased to US$4.6 billion later on if an overallotment option is exercised.\nCornerstone investors, which commit to keeping shares for at least six months, have agreed to buy US$1.26 billion in Midea stock, amounting to more than a third of the offering. They include a subsidiary of container shipping company Cosco Shipping Holdings and a unit of UBS Asset Management.\nAlternative asset manager Hillhouse Investment, sovereign wealth fund GIC and Singapore’s investment company, Temasek, had been considering investing in Midea’s listing, Bloomberg News reported.\nMidea had planned to offer 492.1 million shares at HK$52 to HK$54.80 apiece, according to its listing document dated Sept 16.\nOrder books were multiple times oversubscribed and closed a day earlier than planned, people familiar with the matter had said.\nAt US$4 billion, Midea’s listing will be Hong Kong’s biggest debut since Kuaishou Technology’s US$6.2 billion listing in early 2021. Midea, at the top end of the price range, would be offering a roughly 20 per cent valuation discount to its shares in Shenzhen before the deal is launched. BLOOMBERG", "url": "https://www.straitstimes.com/business/midea-raises-52-billion-in-upsized-hong-kong-listing"}