{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 14:20:21", "date_modify": "2024-10-12 14:20:21", "date_publish": "2022-10-14 08:19:31", "description": "The Sing$ rose after the move and was up 0.6 per cent at $1.4220 to the US dollar at 10.07am Read more at straitstimes.com.", "filename": "business_economy_mas-tightens-singdollar-policy-again-but-refrains-from-double-barreled-move_1728742821.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/14/md_mas_14102022.jpg?VersionId=t57pVp1uuIlK5ntnv7CH3uIGNX3eUw.0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_mas-tightens-singdollar-policy-again-but-refrains-from-double-barreled-move_1728742821.html", "title": "MAS tightens Singdollar policy again but not as aggressively as expected", "title_page": "MAS tightens Singdollar policy again but not as aggressively as expected | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The central bank boosted its support for the Singapore dollar to fight inflation by tightening monetary policy again, though the move was not as aggressive as widely expected.\nThe Monetary Authority of Singapore (MAS) said on Friday it will re-centre the midpoint of the trade-weighted Singdollar policy band up to its prevailing level. There will be no change to the slope and width of the band, it added.\nThe Singdollar rose after the MAS move and was up 0.6 per cent at $1.4220 to the US dollar at 10.07am.\n\"This policy shift, building on past tightening moves, will further reduce imported inflation and help curb domestic cost pressures,\" said MAS.\n\"The policy stance will help dampen inflation in the near term and ensure medium-term price stability, providing the basis for sustainable economic growth,\" it added.\nThe central bank tweaked its inflation forecasts, saying core inflation in 2022 will average around 4 per cent and headline inflation around 6 per cent. MAS had earlier predicted full-year headline inflation to come in at 5 per cent to 6 per cent and core inflation at 3 per cent to 4 per cent.\nMAS has now tightened monetary policy five times since October 2021. Two of these moves were off-cycle, that is, ahead of a scheduled meeting. The next policy statement is due in April.\nSingapore uses its currency as the main monetary policy tool to cool import costs - the main contributor to inflation here - leaving domestic interest rates tracking those of the United States Federal Reserve.\nSince the end of September 2021, the Singdollar has depreciated 6 per cent to the US dollar, while the US dollar index has gained 19 per cent.\nWhile weakening against the greenback, the Singdollar has appreciated by a cumulative 8.9 per cent against the currencies of all of its other trade partners except the Hong Kong dollar, which is pegged to the greenback. This has raised concerns about the erosion of Singapore's export competitiveness.\nBased on advance estimates, the Singapore economy grew by a better-than-expected 4.4 per cent on a year-on-year basis in the third quarter of 2022, easing slightly from the 4.5 per cent growth in the previous quarter.\nOn a quarter-on-quarter seasonally adjusted basis, the economy expanded by 1.5 per cent. This was a turnaround from the 0.2 per cent contraction in the preceding quarter.\nHence the economy avoided a technical recession, usually defined as two straight quarters of negative growth.\nMost analysts believe that the US and European economies are likely to enter recession next year, while China is already in the grip of a slowdown.\n“The central bank took the calibrated approach of not allowing the pace of currency appreciation to quicken further,” she said, adding that the Singdollar is already one of the strongest-performing currencies so far this year.\n“A Singapore dollar that is too strong could hurt exports and negatively impact economic growth at a time when the risk of a full-scale global recession cannot be written off,” said Ms Chan.\nMr Brian Tan, senior regional economist at Barclays Bank in Singapore, said he expects no more MAS tightening in 2023.\nHowever, he added that the risk of another policy tightening remains significant if inflation expectations rise further because of the scheduled goods and services tax (GST) rate hike in January 2023.\nAnalysts say consumers worldwide usually rush to buy expensive items such as cars, smart TVs and mobile phones ahead of an increase in taxes on consumption such as the GST.", "url": "https://www.straitstimes.com/business/economy/mas-tightens-singdollar-policy-again-but-refrains-from-double-barreled-move"}