{"authors": ["Chor Khieng Yuit"], "date_download": "2024-10-12 13:34:06", "date_modify": "2024-10-12 13:34:06", "date_publish": "2024-04-27 08:30:00", "description": "Hundreds were involved in the internal investigation and some were believed to have been sacked. Read more at straitstimes.com.", "filename": "business_bank-of-singapore-takes-action-against-employees-for-misusing-medical-benefits_1728740046.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/27/YINH4775y.jpg?VersionId=7VU0ywf.mpKg8Mf4dBy.tFKhg2.R.1Vd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_bank-of-singapore-takes-action-against-employees-for-misusing-medical-benefits_1728740046.html", "title": "Bank of Singapore takes action against employees for misusing medical benefits", "title_page": "Bank of Singapore takes action against employees for misusing medical benefits | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Bank of Singapore (BOS) has uncovered cases of misuse of medical benefits by its staff, and up to 40 employees left the bank last week.\nHundreds were involved in the internal investigation by the bank, and some were believed to have been sacked.\nThe investigation was first reported by finance industry career portal efinancialcareers.com on April 24.\nIn response to queries from The Straits Times, a BOS spokesperson declined to provide details, citing confidentiality.\nBut the spokesman added: “Where wrongdoing is alleged, the matter will be investigated and reviewed according to the bank’s investigative and disciplinary framework.”\nCNA reported that BOS, the private banking arm of OCBC, launched an investigation in 2023 into employee medical claims involving one of its company panel clinics.\nST understands the clinic in question is Thompson & Thomson (RadLink Medicare), which is located in CIMB Plaza. It is one of the panel clinics under Fullerton Health.\nBOS’ medical insurance scheme allows employees to claim up to $10,500 for medical and dental expenses.\nThe list of claimable items is believed to include outpatient consultation and medication issued by a general practitioner or specialist, non-aesthetic dental services, vaccinations, X-rays and blood tests.\nSome of the items for which staff submitted claims reportedly included supplements, bird’s nest and skincare products, which were not permitted.\nIt is unclear what triggered the investigations, and BOS did not answer ST’s queries on how internal claims checks were made and why the misuse of benefits was not discovered until recently.\nBut ST understands that staff who were found to have misused their medical benefits were told to repay what they claimed.\nSome also did not get any bonuses given by the bank.\nThe BOS spokesperson said the bank has a “fair and robust process” in place and staff involved will be “given the time and opportunity to be heard”.\n“Should any wrongdoing be found after the conclusion of investigation and necessary disciplinary inquiry, the appropriate disciplinary actions will be undertaken,” the spokesperson added.", "url": "https://www.straitstimes.com/business/bank-of-singapore-takes-action-against-employees-for-misusing-medical-benefits"}