{"authors": [], "date_download": "2024-10-12 14:14:50", "date_modify": "2024-10-12 14:14:50", "date_publish": "2022-03-15 11:06:57", "description": "Investors believe policymakers may resume monetary easing soon to prop up the cooling economy. Read more at straitstimes.com.", "filename": "business_economy_chinas-central-bank-unexpectedly-keeps-medium-term-policy-rates-unchanged_1728742490.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/15/ac_bankofchina_2_150322.jpg?VersionId=chdvgzVqVwoaOYjoAksgTD2gShVnMknW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_chinas-central-bank-unexpectedly-keeps-medium-term-policy-rates-unchanged_1728742490.html", "title": "China's central bank unexpectedly keeps medium-term policy rates unchanged", "title_page": "China's central bank unexpectedly keeps medium-term policy rates unchanged | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (REUTERS) - China's central bank kept some of its policy rates unchanged in a liquidity operation on Tuesday (March 15), dashing expectations for a cut, although investors believe policymakers may resume monetary easing soon to prop up the cooling economy.\nThe surprise decision comes a day before the United States Federal Reserve is expected to deliver its first interest rate hike in three years and analysts say Beijing may want to avoid widening policy divergence for the time being.\nThe People's Bank of China (PBOC) said it would keep the rate on 200 billion yuan (S$42.9 billion) worth of one-year medium-term lending facility (MLF) loans to some financial institutions unchanged at 2.85 per cent from the previous operation.\nThe operation resulted in a net injection of 100 billion yuan in fresh funds, replacing the 100 billion yuan due to mature on Tuesday. The PBOC attributed the move to \"maintaining banking system liquidity reasonably ample\", according to an online statement.\nMost traders and analysts in a Reuters poll predicted a reduction to the one-year MLF rate.\nMizuho Bank chief Asian FX strategist Ken Cheung said the PBOC avoided adjusting its key interest rates ahead of the Fed's policy meeting, at which the US central bank is widely expected to raise interest rates.\n\"But the PBOC will ease monetary policy further by lowering policy interest rates in order to reach the government's annual growth target of around 5.5 per cent,\" Mr Cheung said.\nHe expects the PBOC to cut MLF rate in April when China reports its first quarter growth.\nMajor global central banks, including the US, Britain and Japan, are scheduled to meet this week, with most of them set to turn hawkish in monetary policy stance. China's policy divergence could prompt capital outflow risks.\nAlso, lowering the MLF rate may not necessarily bring about the desired improvement in credit demand, said MUFG chief financial markets analyst Marco Sun.\nThe PBOC may want to wait to see the effects of its cut to key rates in January before additional easing, Mr Sun said, adding that he still sees the possibility for banks to lower the lending benchmark loan prime rate this month.\nThe central bank also injected 10 billion yuan through seven-day reverse repos to offset same amount of such loans due on the same day, while keeping borrowing costs unchanged at 2.1 per cent, according to the statement.", "url": "https://www.straitstimes.com/business/economy/chinas-central-bank-unexpectedly-keeps-medium-term-policy-rates-unchanged"}