{"authors": ["Sue-Ann Tan"], "date_download": "2024-10-12 14:16:31", "date_modify": "2024-10-12 14:16:31", "date_publish": "2024-01-31 13:38:39", "description": "Among manufacturers, the electronics cluster emerged as the most optimistic. Read more at straitstimes.com.", "filename": "business_companies-markets_singapore-manufacturing-services-firms-remain-hopeful-for-first-half-of-2024-surveys_1728742591.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/31/aimanufacturing310124.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_singapore-manufacturing-services-firms-remain-hopeful-for-first-half-of-2024-surveys_1728742591.html", "title": "Singapore manufacturing, services firms remain hopeful for first half of 2024: Surveys", "title_page": "Singapore manufacturing, services firms remain hopeful for first half of 2024: Surveys | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - More local manufacturers are optimistic about business conditions in the first half of 2024, while sentiment among services firms moderated though they remained positive, separate surveys showed on Jan 31.\nA net weighted balance of 10 per cent of manufacturing firms anticipate an improved business situation for the January to June period, according to a poll by the Economic Development Board (EDB).\nThis is higher than the 7 per cent figure in its previous quarterly survey.\nEDB said the recovering global semiconductor industry is expected to lend a boost to demand, even amid continued geopolitical and economic challenges.\nMeanwhile, a Singapore Department of Statistics (SingStat) survey showed that for the services sector, a net weighted balance of 5 per cent of companies expect a more favourable business outlook, down from the 9 per cent in the previous survey.\nThe net weighted balance is the difference between the weighted shares of positive and negative responses, with a positive figure indicating more optimism than pessimism.\nAmong manufacturers, the electronics cluster emerged as the most optimistic.\nEDB said: “This positive sentiment is largely led by the semiconductor segment, which anticipates a gradual recovery in demand as inventory levels in the end markets normalise alongside robust demand for artificial intelligence-related chips.”\nThe transport engineering cluster had a net weighted balance of 14 per cent of companies predicting positive business conditions to continue, led by the marine and offshore engineering segment, which continues to see robust orders from the oil and gas and renewable energy industries.\nCompanies in the aerospace segment also expect sustained demand for aircraft maintenance, repair and overhaul activities on the back of strong global and regional air travel demand, EDB said.\nIn the precision engineering cluster, a net weighted balance of 8 per cent of companies were upbeat. Companies expect improved orders for semiconductor-related equipment and bonding wires.\nBut when it comes to output, a net weighted balance of 6 per cent of manufacturers expect lower output in the first quarter of 2024, compared with the fourth quarter of 2023.\nAll clusters except transport engineering and chemicals project a lower level of production, EDB said.\nIn the electronics industry, semiconductor makers expect a seasonally weak first quarter, while companies in the computer peripherals and data storage segment project lower output amid continued weakness in consumer electronics demand.\nCompanies in the biomedical manufacturing industry also expect output to contract.\nThe pharmaceutical and medical technology segments project a sequential decline due to a different product mix and lower export orders.\nConversely, in the transport engineering industry, the aerospace segment anticipates more aircraft engine repair jobs from commercial airlines, while the marine and offshore engineering segment foresees a higher level of activity in the shipyards.\nIn addition, the specialities segment in the chemicals industry expects higher output due in part to increased capacity, while the other chemicals segment anticipates higher output of flavours and fragrances to meet regional demand.\nIn general manufacturing, companies in the printing and miscellaneous industries segments are concerned about higher operating costs, with printing companies expecting fewer print jobs due to digitalisation and those in miscellaneous industries projecting lower output in batteries and paperboard containers and boxes.\nAs for manpower, a majority of companies in the manufacturing sector expect employment levels in the first quarter of 2024 to remain similar to the fourth quarter of 2023, with the biomedical industry the most optimistic and the precision engineering the least.\nMost companies reported no limiting factors that would affect their obtaining of export orders in the first quarter of 2024.\nThe top two issues that they thought could be challenges are price competition from overseas, and political or economic conditions abroad, such as geopolitical tensions or conflicts and inflationary pressures, EDB said.\nOver in the services sector, SingStat said hoteliers expect an increase in tourist arrivals for leisure and business purposes, and the expected growth in the number of meeting, conference and exhibition events and concerts contributed to the positive sentiment of firms within the industry.\nRetailers are also positive, with the anticipated increase in shopping activities during the Chinese New Year period, as well as the disbursement of a larger amount of Community Development Council vouchers in January.\nThe finance and insurance industry expects a pick-up in business as payment service providers attributed their positive sentiment to the rise in e-commerce spending.\nHowever, the transportation and storage industry expects business conditions to be challenging for the next six months.\nWater transport companies highlight reduced market demand amid economic uncertainties, while food and beverage operators are less optimistic for the first six months of 2024, compared with the last six months of 2023, which coincided with the year-end holiday and the festive season.\nOverall, the majority of the industries in the services sector still foresee higher revenue for the first quarter of 2024.\nCorrection note: In an earlier version of the story, we said the net weighted balance of 10 per cent of manufacturing firms anticipated an improved business situation for January to July. This is incorrect: It should be from January to June.", "url": "https://www.straitstimes.com/business/companies-markets/singapore-manufacturing-services-firms-remain-hopeful-for-first-half-of-2024-surveys"}