{"authors": [], "date_download": "2024-10-12 13:37:53", "date_modify": "2024-10-12 13:37:53", "date_publish": "2024-07-29 09:40:00", "description": "Vice-Finance Minister Liao Min pushed back against US Treasury Secretary Janet Yellen’s latest criticism. Read more at straitstimes.com.", "filename": "business_china-defends-manufacturing-push-says-world-needs-more-evs_1728740273.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/29/CHINAVOLKSWAGEN4.JPG?VersionId=Vgwh4UpuBhafCHaZ3glmaebEB1Hs5JR3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-defends-manufacturing-push-says-world-needs-more-evs_1728740273.html", "title": "China defends manufacturing push, says world needs more EVs", "title_page": "China defends manufacturing push, says world needs more EVs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China’s manufacturing capacity is helping the world fight climate change and contain inflation, said Vice-Finance Minister Liao Min, pushing back against US Treasury Secretary Janet Yellen’s latest criticism of the nation’s industrial excess.\n“For decades, China has been a force of disinflation for the world through its supply of manufactured products with good value for money,” Mr Liao said in Rio de Janeiro, where he attended this week’s meeting of Group of 20 finance ministers and central bank governors.\n“It is now also providing green goods for the world as countries try to achieve their carbon reduction goals by 2030,” he said. Global demand for new energy cars will be 45 million to 75 million units by then, far exceeding the world’s current supply capacity, he added, citing estimates by the International Energy Agency.\nMr Liao spoke to Bloomberg News on July 26, a day after Dr Yellen vowed to “keep pressing China to address its macroeconomic model”, which she said is channelling “too much” savings and subsidies into manufacturing and contributing to the overcapacity.\nChina is facing rising trade barriers in developed economies such as the United States and the European Union, which have been complaining about the excess output and its impact on their industrial sectors and companies.\nThe EU is moving forward with tariffs on Chinese electric cars, while Donald Trump has threatened to impose duties of 50 per cent or more on imports of Chinese goods if he wins November’s presidential election.\nSome developing nations including Brazil and Turkey have also placed tariffs on Chinese products including steel and cars, though they have been less vocal in criticising Beijing’s industrial policy.\nWhile China pays attention to concerns of major economies about overcapacity, it, too, is concerned about trade threats such as tariffs, Mr Liao said.\n“We should communicate in a candid manner with respect to rules of market economy and true facts,” he said, adding that China and the US will continue to discuss the issue at the China-US Economic Working Group meetings.\nMr Liao was a key member of China’s team of trade-war negotiators facing off against US officials during Trump’s presidency. He travelled to the US as an aide to then Vice-Premier Liu He and met Trump in the Oval Office. More recently, Mr Liao greeted Dr Yellen when she visited the country in April.\nGovernment subsidies are not the main reason that Chinese industries such as the renewable energy sector have gained competitive advantages over their peers, Mr Liao said. More important factors are corporate investment in research and development spanning years, entrepreneurship and technological innovation, he said.\n“China’s reform and opening-up experience over the past more than 40 years has told us not a single industry can become a globally competitive sector simply relying on government support,” he said.\nHe also argued that some countries were left behind in terms of developing electric vehicles (EVs) because they enjoy advantages in the conventional auto sector and therefore did not shift their focus to the emerging industry. In contrast, China had to seek growth in new sectors such as EVs due to a lack of advantages in the traditional car market.\nDemand-supply disequilibrium is only natural for any market economy, partly because companies make their own investment decisions, and they do so for the long run, expecting to meet higher demand, Mr Liao said. Market forces will show if they made the right or wrong decisions, he said.\nLarge flows of capital funds into new industries are also not rare, he said, citing previous investment frenzies into sectors such as information technology, shale gas and biopharmaceuticals that resulted in “periodical” excess capacity in developed countries. BLOOMBERG", "url": "https://www.straitstimes.com/business/china-defends-manufacturing-push-says-world-needs-more-evs"}