{"authors": [], "date_download": "2024-10-12 13:29:31", "date_modify": "2024-10-12 13:29:31", "date_publish": "2024-08-30 08:24:04", "description": "Sales have skyrocketed as Chinese consumers look for better value amid falling economic confidence. Read more at straitstimes.com.", "filename": "business_china-s-designer-dupes-enticing-frugal-shoppers-away-from-luxury-labels_1728739771.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/30/rrchinaluxury3008.JPG?VersionId=x8wR1PcOVLca6A5U7KRxHpjK2LULPJuP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-designer-dupes-enticing-frugal-shoppers-away-from-luxury-labels_1728739771.html", "title": "China’s designer dupes are enticing frugal shoppers away from luxury labels", "title_page": "China’s designer dupes are enticing frugal shoppers away from luxury labels | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - Near-facsimiles of some of the world’s most popular fashion staples, from Lululemon Athletica’s yoga tights to Hermes International’s handbags, are appearing in closets across China for a fraction of the price.\nKnown in Chinese as “pingti” and Gen Z shopping parlance as “dupes”, their popularity reflects a backlash against brands among formerly label-loving Chinese shoppers. But they are not cheap counterfeits, either: These local makers sell products at relatively high prices by promising the same quality as top global brands – just without the logos.\nThat includes items like a 3,200 yuan (S$590) herringbone tweed overcoat from fashion apparel maker Chicjoc, which says it is made from Italian fabrics obtained from a supplier to Prada and Bottega Veneta.\nSales have skyrocketed since 2023, as Chinese consumers search for better value amid faltering economic confidence.\nIn the 12 months ending in July, some of the top local labels selling cheaper alternatives saw double- to triple-digit growth on China’s dominant e-commerce platforms, Alibaba Group Holding’s Taobao and Tmall, data from analytics firm Hangzhou Zhiyi Technology shows. At the same time, some of the foreign brands whose products they emulate saw slower growth or declines on the platforms, according to the data.\nWhile online sales are not the full picture for foreign brands that have bricks-and-mortar shops, the meteoric rise of dupes are the latest threat facing global retail giants that cannot seem to figure out what Chinese shoppers want. The economic slowdown is turning consumers more frugal, but even mid-range brands like Nike and Fast Retailing’s Uniqlo are stumbling.\nThe rise of pingti likely reflects what Uniqlo called “a new set of consumer values” – the same instinct that is pushing consumers to seek out products sold directly by manufacturers, cutting out the brand middlemen.\n“Chinese consumers’ understanding of luxury goods is changing, as the traditional mindset that a luxury handbag could signal prestige status is no longer their only preference,” said Mintel senior luxury and fashion analyst Blair Zhang.\n“There’s no more blind trust in well-known brands under the currently-cautious spending trends. Instead, there’s more rational shopping decisions that spur active discussions on cheaper alternatives.”\nDupes are impacting the exclusivity that has made high-end items so desirable and could hurt their future growth in China, consultancy Yaok Group said in a report in August.\nLeather goods manufacturer Sitoy Group Holdings says on social media videos that the quality of its US$100 (S$130) handbags is almost identical to those sold for upwards of US$1,000 when churned out by the same production lines that manufacture for luxury brand clients such as Prada, Tumi and Michael Kors.\nMeanwhile, Chicjoc, one of the biggest Chinese fashion apparel labels on Taobao and Tmall, markets products it claims are made with Copenhagen-produced animal fur from the same supplier to LVMH and Fendi. The company has annual sales of about one billion yuan from its Taobao store, the Zhiyi data shows.\nLocal brands have been selling cheaper alternatives for decades, but they were generally derided by middle-class shoppers who splashed out on labels as status symbols. Pingti retailers entered the mainstream as Covid-19 lockdowns kept people home and dependent on online shopping, giving rise to new direct-to-customer channels on social media platforms and live-streaming shows similar to the United States’ QVC home shopping network.\nPeople mostly find pingti items online and can score bragging rights from sharing finds with the closest resemblance to branded products. Millions of social media videos feature vloggers boasting about price points and quality. Shoppers can usually place orders directly into chat boxes, and receive items within days.\nFor Sitoy, one of the most prominent dupe retailers – and one of the few to be listed – private brands contributed nearly a third of some HK$841 million (S$141 million) in total sales during the six months ended in December 2023. Sitoy’s two main stores on TikTok’s Chinese cousin Douyin posted around 200 million yuan in sales in the past 12 months as at July – more than doubling the amount from the previous year, according to Zhiyi data.\nSitoy, which started out as a manufacturer for outside clients, has seen orders slow amid economic and geopolitical uncertainty, it has said in financial reports. To counter the slide, it is investing in dupes, transforming a four-storey building at its factory in southern city Dongguan into an e-commerce centre for its own labels – complete with live-streaming studios, retail stores and showrooms.\nMost consumers maintain there is little to no difference between pingti and the branded items they mimic. A 330ml bottle of Japanese cosmetics maker SK-II’s best-selling Facial Treatment Essence, featuring a natural fermentation product, typically sells for nearly 1,700 yuan – compared with a 569 yuan dupe from Chinese alternative Chando touting a similar ingredient.\nPopular Lululemon pingti brand VFU charges just 200 yuan for a pair of high-waisted black workout tights similar to the athleisure giant’s, typically costing four times as much.\nDespite the rush, it is unclear if local upstarts will have the same staying power as the global giants they are copying.\nPeople selling cheap counterfeits often try to muscle in on pingti channels. There is little oversight of online and social channels – a sort of Wild West where factories and retailers can advertise products however they want – making it difficult for consumers to know what they are really buying. And there is generally no punishment from e-commerce and social platforms for sellers who falsely claim to be producing for known brands.\nFor now, that is not stopping shoppers like 45-year-old financial programmer Jessica Wang. She recently spent 3,700 yuan on a pingti of a Hermes Lindy purse, which usually sells for thousands of dollars, from a WeChat seller whose handbags mirror luxury designs.\n“It was beyond my expectation in so many ways: The leather is so soft, the stitching is delicate, and its packaging is nice and neat,” Ms Wang said. “I’m going to order other bags from that shop.” BLOOMBERG", "url": "https://www.straitstimes.com/business/china-s-designer-dupes-enticing-frugal-shoppers-away-from-luxury-labels"}