{"authors": [], "date_download": "2024-10-12 14:12:37", "date_modify": "2024-10-12 14:12:37", "date_publish": "2023-10-24 15:32:00", "description": "A slowing global economy drove more shoppers to PDD's discount e-commerce platforms Temu and Pinduoduo. Read more at straitstimes.com.", "filename": "business_founder-of-temu-parent-pdd-races-up-china-s-rich-list_1728742357.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/24/310483510.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_founder-of-temu-parent-pdd-races-up-china-s-rich-list_1728742357.html", "title": "Founder of Temu parent PDD races up China’s rich list", "title_page": "Founder of Temu parent PDD races up China’s rich list | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – The founder of PDD Holdings saw his wealth swell by US$13.8 billion (S$18.8 billion) in a year, as a slowing global economy drove more shoppers to the Chinese company’s discount e-commerce platforms Temu and Pinduoduo, an annual rich list showed on Tuesday.\nMr Colin Huang, who founded PDD in 2015 and stepped down as chief executive in 2020, was the fastest riser in 2023’s Hurun Rich List, leaping seven places to be ranked China’s third-richest man, with a US$37.2 billion fortune. It also marked the first time he had broken into the top three ranking.\nThe growth of his fortune reflects the changing e-commerce landscape both in China, where consumer confidence remains low after three years of Covid-19 curbs, and abroad, where shopping platforms such as Temu and Shein are gaining steam. PDD did not immediately respond to a request for comment.\nBillionaire Jack Ma, founder of rival Alibaba, which is currently going through a restructuring and working to fend off competition from the likes of PDD, fell one place from 2022 to the 10th spot.\nThe number of Alibaba shareholders on the list, which ranks China’s wealthiest people with a minimum net worth of 5 billion yuan (S$952.4 million), fell from 18 in 2022 to 12 this year.\nMr Richard Liu, who founded e-commerce giant JD.com, saw his wealth, and that of his wife Zhang Zetian, fall by US$6.2 billion since 2022 to US$8.26 billion, according to Hurun’s list.\nJD.com’s shares fell to a record low earlier in October after banks cut its price targets, citing a weaker-than-expected recovery in consumer spending.\n“Going global has been one of the key sources of growth this year,” said Mr Rupert Hoogewerf, Hurun Report chairman and chief researcher, citing PDD’s Temu, ByteDance’s short-video platform TikTok and ultra-fast fashion brand Shein as examples.\nThe founder of bottled water brand Nongfu Spring, Mr Zhong Shanshan, retained his first place on the list for the third year running, with a US$62 billion fortune; while Mr Pony Ma, founder of social media and gaming giant Tencent, was second, with US$38.6 billion.\nHurun also said 179 individuals dropped off 2023’s list, 15 per cent of whom were in real estate, as the sector grapples with a prolonged debt crisis.\nMr Wang Jianlin, owner of Dalian Wanda Group and once China’s richest man, saw his wealth and that of his family fall by US$7.3 billion and 57 spots to be placed in 89th position, with a US$6.47 billion fortune.\nThe founder of China Evergrande Group, the world’s most indebted property developer, remained on the list at 268th despite his company’s woes, due to dividends paid out in previous years, Hurun said.\nMr Hui Ka Yan is currently being investigated over suspected “illegal crimes”, Evergrande said in September. REUTERS", "url": "https://www.straitstimes.com/business/founder-of-temu-parent-pdd-races-up-china-s-rich-list"}