{"authors": [], "date_download": "2024-10-12 13:49:06", "date_modify": "2024-10-12 13:49:06", "date_publish": "2023-09-05 08:13:00", "description": "Beijing isn’t pulling out a “bazooka” like it did during the financial crisis in 2008-2009 or when the pandemic hit in 2020. Read more at straitstimes.com.", "filename": "business_economy_why-china-is-avoiding-using-a-bazooka-to-spur-economy_1728740946.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/05/2023-09-04T090008Z439355485RC2NT2AMOUO1RTRMADP3G20-SUMMIT-XI.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_why-china-is-avoiding-using-a-bazooka-to-spur-economy_1728740946.html", "title": "Why China is avoiding using a ‘bazooka’ to spur economy", "title_page": "Why China is avoiding using a ‘bazooka’ to spur economy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – China has taken a series of incremental steps to boost its economy after a run of disappointing data showed the government is increasingly at risk of missing its growth target of about 5 per cent for 2023.\nBut Beijing is not pulling out a “bazooka” stimulus package like it did during the global financial crisis in 2008-2009, or even when the pandemic hit in 2020.\nMuch of the reluctance lies in a drive by President Xi Jinping’s government to control the growth of debt in the country, especially at the municipal level; a desire to shrink the property sector’s outsized influence on the economy; and an aversion to doling out cash to consumers, Western-style.\n1. Why is China’s economy in trouble?\nOne key word: property. This sector has been slumping since 2021 after Beijing tightened credit to large developers and told banks to slow mortgage issuance – part of a specific policy to make the economy less dependent on real estate. Housing, together with related industries like steel, cement and glass, accounts for about 20 per cent of the country’s gross domestic product. As a result of those restrictions, housing sales have plunged and investment in property has contracted. Goldman Sachs estimates the housing downturn will reduce China’s GDP growth by 1.5 percentage points in 2023.\nThe property crisis also means local governments, which are responsible for most public expenditures in China, have less money because they rely on revenue from housing and land sales. As a result, they have cut back on spending – a fiscal contraction that UBS Group estimates was equivalent to a percentage point of GDP in the first half of the year.\nIn the meantime, exports have been falling at double-digit rates, and slower income growth and still fairly high unemployment, especially for young people, mean consumer confidence remains subdued. Putting all those factors together means GDP growth will likely come in at 5.1 per cent this year, according to the latest Bloomberg survey of economists, although several Wall Street banks see the possibility that the official target will be missed.\n2. What has Beijing done so far?\nPolicymakers started rolling back restrictions on financing for property developers and lowering mortgage costs in 2022. But facing increasing risks of a doom loop – where diminished cash flow leaves developers unable to finish properties, hurting buyer appetites and causing further declines in sales and prices – officials have recently gone further. They are allowing big cities, which have had the most restrictive policies, to lower down-payment requirements on homes, taken steps to encourage second-property purchases, and told banks to lower rates on existing mortgages.\nElsewhere, Beijing has ended a crackdown on Internet platform companies and made pledges to better support private-sector firms and improve their access to funding. It has also adopted measures to boost local governments’ funding by refinancing their existing debt at lower rates to support their spending and infrastructure investment, and taken steps to bolster the nation’s stock markets. On the monetary policy side, the central bank has cut interest rates twice in 2023 and taken stronger steps to support the renminbi.\n3. Is there more it could do?\nThe central government has stopped short of ramping up issuance of its own debt – the most sought-after bonds as they are viewed as the safest – to fuel spending, as it did before. The national authorities sold special Treasury bonds in 2020 when the pandemic hit, and in 2009 to cushion the impact of the global financial crisis. Most economists think there is room to do so again as China’s central government debt is low by international standards, and the government’s high degree of control over capital flows and domestic banks gives it plenty of scope to borrow. That funding could then be used for a number of different public spending options.\n4. What’s the ‘bazooka’ option?\nMarket traders have been using this term – which harkens back to the 2008 crisis in the United States – to refer to the use of central government funds spent directly into the economy at a large scale – something measured in trillions of renminbi. Some economists are hoping for measures comparable to the 4 trillion yuan (S$759 billion) stimulus announced in 2008, which was equivalent to about 10 per cent of GDP at the time.\nAnother comparison would be with China’s use of 3 trillion yuan of central bank funding to boost property sales after a slump in 2014-2015. Economists have suggested that central government money could be deployed in radical ways that China has not tried before: providing income directly to households or businesses, as the US and Europe did during the pandemic, or buying up housing to push up prices.\n5. What makes leaders reluctant?\nWhile many indicators lately have disappointed, growth is not plummeting and there is still a fair chance of meeting the target of about 5 per cent for the year, as long as the property market does not get worse. Officials are also happy that advanced industrial sectors, like electric vehicles, are doing well.\nMr Xi and his top aides are pursuing “quality” growth, rather than just focusing on the pace of economic expansion. They have emphasised not relying on property as a short-term stimulus tool, and on limiting the build-up of local government debt – seeking to avoid the excesses of the past, where debt-fuelled expansion led to white elephant projects and industrial overcapacity.\nThere is also internal politics: Beijing does not necessarily trust local governments to distribute money in an efficient way, or without corruption. Cash handouts to consumers are also unlikely: Mr Xi in the past has warned against the trap of “welfarism”, which senior officials say can lead to “laziness”.\nUBS chief China economist Wang Tao says leaders see employment as the best way to boost consumption, and they believe the way to do that is through supporting the corporate sector with tax cuts. So the watchword remains “targeted” stimulus.\n6. Why does this matter?\nGlobally, a weaker GDP trend in the world’s second-largest economy would have an impact on almost every country. When China’s growth rate accelerates by 1 percentage point, other countries benefit by about 0.3 percentage point, according to the International Monetary Fund.\nCountries like Australia and Chile, which export raw materials such as iron ore and copper, are usually affected the most. China is also a big buyer of oil from the Middle East, and tech products from its East Asian neighbours. Foreign businesses that operate in China, from Volkswagen to Nike and McDonald’s, are vulnerable to slower revenue growth and lower stock valuations. Countries around the world that welcome Chinese tourists may see less spending.\nFor the US, which remains China’s biggest trading partner, a slowdown in the Asian country can help lower inflation, but probably not by enough to move the dial for the Federal Reserve, unless there is a hard landing in China. There could also be political consequences: Slower economic growth in China could lead to more domestic discontent and reduce Beijing’s global influence if, for instance, it cuts back on lending to developing nations. BLOOMBERG", "url": "https://www.straitstimes.com/business/economy/why-china-is-avoiding-using-a-bazooka-to-spur-economy"}