{"authors": [], "date_download": "2024-10-12 14:13:33", "date_modify": "2024-10-12 14:13:33", "date_publish": "2023-03-02 08:43:09", "description": "The rise underscores Singapore’s appeal to the super rich, despite recent efforts to raise wealth taxes. Read more at straitstimes.com.", "filename": "business_singapore-wealth-firm-farro-capital-sees-rapid-growth-catering-to-rich-families_1728742413.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/03/mbs039A8321_0.jpg?VersionId=h6frO1qgvP.Wrar_jEJFLRIO4d3mU1wT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-wealth-firm-farro-capital-sees-rapid-growth-catering-to-rich-families_1728742413.html", "title": "Singapore wealth firm Farro Capital sees rapid growth catering to rich families", "title_page": "Singapore wealth firm Farro Capital sees rapid growth catering to rich families | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore-based multi-family office Farro Capital says it has amassed more than US$1 billion (S$1.35 billion) in assets under management (AUM) just four months after it was launched, highlighting the country’s rise as a hub for wealthy clans.\nThe firm was founded in October by Mr Hemant Tucker, former market head for global South Asia and the Middle East at Bank of Singapore, former Maitri Asset Management chief executive Manish Tibrewal and three others. Much of the current client base is of Indian origin and the rest comes from a variety of backgrounds, from Europe to other parts of Asia, said Mr Tucker.\nFarro’s rapid asset accumulation underscores Singapore’s continuing appeal to the super rich, despite recent efforts to raise wealth taxes and introduce stricter conditions for tax breaks. While the city has gained recognition in recent years for seeing an influx of wealthy Chinese families, its low levies and relative stability are attracting a menagerie of global tycoons.\n“We are targeting families across the region from Japan to the UK and the United States – whoever wants to have access to Asia with Singapore as a centre,” said Mr Tibrewal.\nHe added that the company is looking at “adding another 50 families in the next 18 to 24 months”, with an average AUM contribution of US$30 million each.\nMore than 700 family offices – organisations that manage the lives and affairs of the super rich – were based in Singapore as at the end of 2021, according to official estimates. More have set up there since, despite the imposition of tighter rules last April.\nIndian tycoon Mukesh Ambani, Asia’s richest man, opened a family office in Singapore last year, joining Google co-founder Sergey Brin, American hedge fund billionaire Ray Dalio and British billionaire inventor James Dyson, among others.\nFarro’s base in downtown Singapore is a simple office with a single boardroom, far from the glitzy, art-filled lobbies of many of its peers. It aims to have 20 employees by the end of the year who are able to do everything from negotiating bank fees and sourcing deals to arranging home loans and making portfolios compliant with environmental, social and governance criteria. Its fees vary depending on the level of work required.\nAmong its key targets are family offices whose assets are big enough to have a handful of dedicated professionals but too small to warrant hiring a full-service team.\nFarro aims to fill the gaps, providing anything from investment opportunities to arranging trusts. One of its co-founders is Mr Mahesh Kumar, who worked at law firm Withers KhattarWong helping private clients with their tax strategies.\n“We are seeing more first-generation entrepreneurs than ever before and I would say that is more prevalent in a place like India,” said Mr Nirbhay Handa, head of private clients in Asia at Henley & Partners, which helps wealthy customers set up residency and investments around the world. “When wealth increases, generally, you see an uptick of a lot of families looking at a place like Singapore to set up their wealth structuring outfits.”\nMr Handa said interest among wealthy entrepreneurs of Indian origin in moving assets or relocating to Singapore remains high, even though it has not increased at the same rate as that of Chinese peers. BLOOMBERG", "url": "https://www.straitstimes.com/business/singapore-wealth-firm-farro-capital-sees-rapid-growth-catering-to-rich-families"}