{"authors": ["Rosalind Ang"], "date_download": "2024-10-12 14:16:31", "date_modify": "2024-10-12 14:16:31", "date_publish": "2024-01-05 16:23:47", "description": "Food and alcohol, motor vehicles, as well as watches and jewellery had the highest growth rates. Read more at straitstimes.com.", "filename": "business_singapore-retail-sales-rise-in-november-reversing-october-s-dip_1728742591.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/05/B4A308720copy.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-retail-sales-rise-in-november-reversing-october-s-dip_1728742591.html", "title": "Singapore retail sales rise in November, reversing October’s dip", "title_page": "Singapore retail sales rise in November, reversing October’s dip | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Retail sales rose 2.5 per cent in November 2023, compared to a 0.1 per cent decline in October, with the highest growth rates seen for food and alcohol, and motor vehicles, as well as watches and jewellery.\nOn a month-on-month seasonally adjusted basis, retail sales grew 0.5 per cent, against the previous month’s 0.9 per cent fall, according to figures released by the Singapore Department of Statistics (SingStat) on Jan 5.\nExcluding motor vehicles, seasonally adjusted retail sales remained at a similar level as October 2023.\nNovember’s total retail sales value was $4.1 billion.\nOnline sales accounted for 15.2 per cent of this, higher than October’s 13.1 per cent.\nThis higher proportion was mainly due to increased online sales during year-end online shopping events such as Singles’ Day and Black Friday, SingStat said.\nDBS Bank economist Chua Han Teng said overall retail sales should see some support from Singapore’s inbound tourism as its recovery remains intact, and the bank expects a complete return to pre-pandemic levels in 2024.\nHe added: “2024’s tourism uptick will be supported by improving flight capacity, upcoming events such as concerts, and the ongoing return of Chinese tourists that would be boosted by the upcoming mutual visa-free travel arrangement between Singapore and China.”\nHowever, UOB economists Alvin Liew and Jester Koh said Singapore’s competitiveness as a tourist destination could be weighed down by structurally higher price levels as compared to the regional Asean economies, in addition to the effects from the strong exchange-rate based monetary policy to anchor inflation.\nOnline retail sales made up 52.5 per cent of the total sales of computer and telecommunications equipment; 36.4 per cent of that for furniture and household equipment; and 13.5 per cent of the total sales for supermarkets and hypermarkets.\nWithin the retail trade sector, more than half of the industries recorded year-on-year growth in sales in November 2023, with the food and alcohol industry recording the highest growth of 13.6 per cent.\nThe motor vehicle industry rose 12.9 per cent, mainly due to higher certificate of entitlement quotas. Retailers of watches and jewellery saw a similar rise of 12.9 per cent on greater demand for jewellery.\nIn contrast, retailers of recreational goods recorded a year-on-year decrease in sales of 10.6 per cent, and the furniture and household equipment industry a 5.6 per cent drop in November 2023.\nFood and alcohol sales were up year on year but down month on month, which could suggest that momentum could be petering out as more Singaporeans travel overseas, said Ms Selena Ling, chief economist and head of global markets research and strategy for OCBC Bank.\nOn a seasonally adjusted month-on-month basis, sales of motor vehicles rose 5.6 per cent in November 2023. Similarly, retailers of furniture and household equipment saw an increase in sales of 4.1 per cent while department store sales were up 3.3 per cent.", "url": "https://www.straitstimes.com/business/singapore-retail-sales-rise-in-november-reversing-october-s-dip"}