{"authors": [], "date_download": "2024-10-12 13:54:14", "date_modify": "2024-10-12 13:54:14", "date_publish": "2024-06-18 08:35:00", "description": "J&J faces more than 61,000 lawsuits blaming talc used in baby power and similar products for cancer. Read more at straitstimes.com.", "filename": "business_johnson-johnson-baby-powder-users-want-cancer-monitoring-even-if-it-cost-billions_1728741254.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/18/2024-06-11T173641Z1730743582RC2498ANVZK2RTRMADP3JOHNSON-JOHNSON-LAWSUIT.JPG?VersionId=gl6gvVqp3BS3Sn9ExwR.2xWcaHtryESp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_johnson-johnson-baby-powder-users-want-cancer-monitoring-even-if-it-cost-billions_1728741254.html", "title": "Johnson & Johnson baby powder users want cancer monitoring even if it costs billions", "title_page": "Johnson & Johnson baby powder users want cancer monitoring even if it costs billions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WILMINGTON, Delaware – Johnson & Johnson (J&J) should be on the hook for potentially billions of dollars in medical fees for women who used its talc-based baby powders and want to monitor their future health over cancer fears, according to a lawsuit.\nLawyers representing former talc users asked a US federal judge on June 17 to set up a “medical-monitoring class” to cover the expenses of doctor’s visits and tests for women worried about gynaecological and ovarian cancers.\nThe suit is the latest salvo in the ongoing legal battle between J&J and former talc users, who allege the world’s largest maker of healthcare products hid the cancer risks of its iconic baby powder for almost half a century. J&J is seeking the backing of thousands of people who have sued over the product for an US$11 billion (S$14.9 billion) settlement of the claims.\n“This kind of monitoring system, especially if (it) covers thousands of women, will be expensive since it goes on for the rest of their lives,” said Mr Carl Tobias, a University of Richmond professor who teaches about mass-tort law. “It could cost J&J hundreds of millions, if not billions, to cover these costs.”\nJ&J officials on June 17 dismissed the proposed class action as a “meritless complaint”. Mr Erik Haas, J&J’s lead in-house lawyer on the talc cases, said the suit was another attempt by the plaintiffs to “disseminate false messaging in an effort to thwart their clients from voting on” the company’s proposed settlement.\nSuch medical surveillance programmes have been approved in other mass-tort cases, including claims that Dutch manufacturer Koninklijke Philips hid flaws in its line of machines designed to treat sleep apnoea. The firm agreed as part of a US$1.1 billion settlement earlier in 2024 to set up a health-monitoring programme for users.\nJ&J now faces over 61,000 lawsuits blaming talc used in baby powder and similar products for different types of cancers. Many of those cases have been consolidated before the judge in New Jersey overseeing the proposed medical-monitoring class-action case. Other cases are set for trial in state courts.\nSince 2014, at least a dozen juries have awarded a total of more than US$6.5 billion in damages to consumers blaming the powder for their cancers, according to data compiled by Bloomberg News. Many of those awards later were reduced or thrown out on appeal.\nJ&J maintains its talc-based products do not cause cancer and that it has marketed its baby powder appropriately for over a century. The firm has won a number of cases in court and had other suits dismissed before trial. J&J withdrew its talc-based powders worldwide at the end of 2023 and replaced it with a cornstarch version.\nPlaintiffs want the judge to certify a class that covers US women who have used talc from 1960 to now, and who have not already filed an individual suit. They also want their spouses, parents and dependent children included in the class.\nFormer talc users want the judge to order J&J to set up a fund to cover monitoring expenses, including “baseline assessments, diagnostic testing, and preventative measures”, according to the 137-page complaint. BLOOMBERG", "url": "https://www.straitstimes.com/business/johnson-johnson-baby-powder-users-want-cancer-monitoring-even-if-it-cost-billions"}