{"authors": ["Elysia Tan"], "date_download": "2024-10-12 13:36:10", "date_modify": "2024-10-12 13:36:10", "date_publish": "2023-12-17 17:30:00", "description": "It is divesting three hotels in Osaka, Japan to an unrelated third party Read more at straitstimes.com.", "filename": "business_companies-markets_capitaland-ascott-trust-to-sell-three-japanese-hotels-for-107b-yen_1728740170.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/17/hzhotel171223.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_capitaland-ascott-trust-to-sell-three-japanese-hotels-for-107b-yen_1728740170.html", "title": "CapitaLand Ascott Trust to sell three Japanese hotels for $100 million", "title_page": "CapitaLand Ascott Trust to sell three Japanese hotels for $100 million | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - CapitaLand Ascott Trust is divesting three hotels in Osaka, Japan to an unrelated third party for a total of 10.7 billion yen (S$100 million), as part of its ongoing portfolio reconstitution strategy.\nThe properties are Hotel WBF Honmachi, Hotel WBF Kitasemba East and Hotel WBF Kitasemba West, it disclosed in a bourse filing on Dec 17 morning.\nThe divestments will be at about 15 per cent above book value, and are expected to be completed in the first quarter of 2024, CapitaLand Ascott Trust said. They are expected to raise net proceeds of about 3.9 billion yen, and the trust will recognise a net gain of 1.1 billion yen.\nThe sale of these properties, which are located outside Osaka’s prime districts, enables CapitaLand Ascott Trust to redeploy capital to assets and/or asset enhancement initiatives that can generate stronger yields, which will uplift its overall portfolio value, said Ms Serena Teo, chief executive officer of its managers.\nPost-divestment, it will have about 30 properties comprising serviced residences, hotels, rental housing and student accommodation properties in gateway cities in Japan, such as Tokyo, Fukuoka, Hiroshima, Osaka and Sapporo.\nThe country remains an attractive market for CapitaLand Ascott Trust, Ms Teo said, noting strong tourism and population growth in gateway cities.\n“The overall positive demand-supply dynamics bode well for our portfolio of hospitality and longer-stay assets in Japan,” she added.", "url": "https://www.straitstimes.com/business/companies-markets/capitaland-ascott-trust-to-sell-three-japanese-hotels-for-107b-yen"}