{"authors": [], "date_download": "2024-10-12 13:30:59", "date_modify": "2024-10-12 13:30:59", "date_publish": "2024-09-20 13:23:00", "description": "Many firms that GIC backs want further rate cuts for funding. Read more at straitstimes.com.", "filename": "business_gic-chief-investment-officer-warns-of-rising-inflation-risks-after-big-fed-rate-cut_1728739859.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/yaohui-pixsgindon-0964.jpg?VersionId=9bLxu_T5SqXd3DH0iwkqhck37MqzqYn6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_gic-chief-investment-officer-warns-of-rising-inflation-risks-after-big-fed-rate-cut_1728739859.html", "title": "GIC chief investment officer warns of rising inflation risks after big Fed rate cut", "title_page": "GIC chief investment officer warns of rising inflation risks after big Fed rate cut | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - GIC group chief investment officer Jeffrey Jaensubhakij has warned that the market exuberance following its outsized interest rate cut could be short-lived amid the risk of rising inflation.\n“For now we should enjoy it,” Dr Jaensubhakij said at the Milken Institute Asia Summit 2024 in Singapore on Sept 20. “But just be prepared that you have tight labour markets across the United States, Europe, Japan, and so the risk of inflation coming back sooner may be there.”\nThe sovereign wealth fund investor said that with a US election cycle under way, politicians could push unnecessary stimulus into the market in an effort to win votes.\nDr Jaensubhakij’s comments were broadly reflective of a panel that provided tips for other investors on surviving a potential downturn. He added that many of the companies GIC backed need to borrow funds and wanted rates to drop further.\n“In some ways, the interest rate markets are saying you need to cut rates by enough as if we’re going into a recession, but the equity markets on the other hand still say we’re going to re-accelerate the economy and earnings growth is going to come back,” he said. “Only one of them will be right.”\nSpeaking on the same panel, Hillhouse founder Zhang Lei suggested using technology to enhance the skills and processes of businesses, while Granite Asia senior managing partner Jenny Lee said the days of 1,000 times in returns in Asia’s venture capital space were over. BLOOMBERG", "url": "https://www.straitstimes.com/business/gic-chief-investment-officer-warns-of-rising-inflation-risks-after-big-fed-rate-cut"}