{"authors": ["Angela Tan"], "date_download": "2024-10-12 14:13:18", "date_modify": "2024-10-12 14:13:18", "date_publish": "2023-04-05 15:34:39", "description": "Medical devices firm founder Li Xiting is again Singapore's richest, with a net worth of US$16.3 billion. Read more at straitstimes.com.", "filename": "business_singapore-adds-more-billionaires-but-gaming-fortunes-take-a-hit-in-forbes-2023-richest-list_1728742398.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/06/dw-forbes2-230405_3.jpg?VersionId=04wUbiLkt8i9rjLP91zEtlEqbpJzPZja", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-adds-more-billionaires-but-gaming-fortunes-take-a-hit-in-forbes-2023-richest-list_1728742398.html", "title": "Singapore adds more billionaires to Forbes’ 2023 richest list, but tech fortunes take a hit", "title_page": "Singapore adds more billionaires to Forbes’ 2023 richest list, but tech fortunes take a hit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Mr Li Xiting, founder and chairman of Shenzhen Mindray Bio-Medical Electronics, a global provider of medical devices based in China, has again topped Forbes’ list of billionaires in Singapore.\nMr Li was among 35 billionaires from the Republic – up from 26 in 2022. Their collective net worth came to US$118.9 billion (S$157.6 billion), compared with US$106.7 billion in 2022.\nThis year saw several additions to the rarefied list, including Mr Kwek Leng Keow (with US$1.4 billion) of Hong Realty, the private property company within the Hong Leong Group in Singapore; hotel tycoon Michael Kum (with US$1 billion), whose properties include brands such as Hilton and Hyatt; and Dr Loo Choon Yong (with US$1 billion), co-founder of Raffles Medical Group.\nMr Li’s net worth stood at US$16.3 billion, making him the 103rd richest billionaire in the world, according to Forbes’ annual ranking.\nThe 72-year-old co-founded Mindray in Shenzhen in 1991. He made his money selling ventilators and medical devices and saw his wealth grow exponentially during the Covid-19 pandemic. Born in Anhui, China, Mr Li moved to Singapore and became a naturalised citizen in 2018.\nMr Goh Cheng Liang, 95, owner of the regional franchise for Nippon Paint – one of the world’s biggest paint-makers – is Singapore’s second-richest person. His net worth stood at US$14.3 billion, making him the 123rd richest billionaire in the world.\nMr Goh’s fortune was cemented after his privately held Wuthelam Holdings took control of Nippon Paint in 2020.\nVeteran banker Wee Cho Yaw, 94, is worth US$7.1 billion, making him the 325th richest billionaire in the world.\nMr Wee is the largest shareholder and chairman emeritus of UOB. The group reported a record high core net profit of $4.8 billion for 2022, up 18 per cent from 2021. Including one-off expenses relating to the acquisition of Citigroup’s Malaysia and Thailand consumer businesses, its earnings hit a high of $4.6 billion.\nHotel and property tycoon Kwek Leng Beng, 82, saw his net worth inch up to US$3.3 billion, ranking him 878th on the billionaires list.\nMr Zhang Yong, 52, the China-born founder of the Haidilao hotpot restaurant chain, saw an improvement in his net worth to US$7.5 billion. He is ranked 299th globally.\nHis wife, Ms Shu Ping, saw her net worth climb marginally to US$2.1 billion, making her No. 1,434 on the billionaires list.\nFounded in China’s Sichuan province in 1994, Haidilao operates more than 1,300 outlets across China and has 114 outlets overseas, including one that opened in Dubai in March, its first venture into the Middle East market.\nThe group carved out its overseas units to form Super Hi International Holding and listed it in Hong Kong in December.\nOther Singapore names on the list include Far East Organization’s Philip Ng (Singapore’s third-richest person at No. 290) and his brother Robert, with a combined net worth of US$15 billion.\nThe Forbes World’s Billionaires List is a snapshot of wealth using stock prices and currency exchange rates from March 10, 2023.\nIts 37th edition of the list showed the number of billionaires around the globe has fallen for the second straight year, as both public and private markets shuddered under rising interest rates and falling stock prices.\nThe total number of billionaires fell to 2,640, down from 2,668 in 2022. The planet’s richest are now worth US$12.2 trillion, a drop of US$500 billion from US$12.7 trillion in March 2022.\nFrench luxury goods titan Bernard Arnault topped the ranking for the first time, with an estimated net worth of US$211 billion, on the back of a banner year at LVMH.\nHe unseated Mr Elon Musk, who dropped to second place with an estimated net worth of US$180 billion that is US$39 billion less than a year ago, following his highly publicised takeover of Twitter that scared investors and sent Tesla shares plummeting.\nThe United States still boasts the most billionaires, with 735 list members worth a collective US$4.5 trillion. China (including Hong Kong and Macau) remains second, with 562 billionaires worth US$2 trillion, followed by India, with 169 billionaires worth US$675 billion.", "url": "https://www.straitstimes.com/business/singapore-adds-more-billionaires-but-gaming-fortunes-take-a-hit-in-forbes-2023-richest-list"}