{"authors": [], "date_download": "2024-10-12 14:20:30", "date_modify": "2024-10-12 14:20:30", "date_publish": "2023-10-03 00:50:19", "description": "With the job cuts, the group aims to transform into a “lean and powerful, internationally well-positioned company”. Read more at straitstimes.com.", "filename": "business_companies-markets_crisis-struck-german-maker-of-playmobil-toys-cuts-jobs_1728742830.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/03/btplaymobil20231003.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_crisis-struck-german-maker-of-playmobil-toys-cuts-jobs_1728742830.html", "title": "Crisis-struck German maker of Playmobil toys cuts jobs", "title_page": "Crisis-struck German maker of Playmobil toys cuts jobs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - The crisis-hit German toy company behind Playmobil, the small plastic figures loved by children the world over, said on Monday that it was cutting 17 per cent of its workforce.\nThe Horst Brandstaetter Group, named after its founder, plans to slash nearly 700 positions worldwide by 2025, 369 of them in Germany, amid long-running business woes.\n“The company management took this decision after a comprehensive analysis of all divisions and in light of the development of the business and current economic challenges,” it said in a statement.\nThe “fundamental restructuring” comes in the wake of “the worst global recession since World War II”, the group said, triggered by the Covid pandemic and compounded by the Ukraine war and supply chain disruptions.\nThis had led to falls in sales and profit during the past two business years, it said. For the 2021-22 business year, the group reported a 2.8 per cent drop in turnover to 736 million euros (S$1,060 million).\nWith the job cuts, the group said it aims to transform into a “lean and powerful, internationally well-positioned company” with strong investment in its core brands.\nIt said it would work with labour representatives to minimise the impacts on employees by encouraging early retirement or transfers to other business divisions within the group.\nIn 1958, the company launched the first hula hoop which went on to become a worldwide hit.\nWhen the oil crisis drove up the cost of plastic manufacturing in the 1970s, Brandstaetter asked the company’s master mould-maker Hans Beck to develop a completely new toy system that could be continually expanded.\nBeck came up with the 7.5-centimetre play figures. The initial three models – a knight, a construction worker and a Native American – were introduced to the public in 1974.\nToday, the figures range from police and pirates to fairies and clowns.\nDanish competitor Lego said in August that its net profit fell in the first half of the year but its market share grew as sales rose slightly.\nIn contrast to Playmobil, Lego saw three years of record-breaking sales boosted by lockdowns during the Covid pandemic, a feat attributed to the success of its Star Wars and Lego Icons lines. AFP", "url": "https://www.straitstimes.com/business/companies-markets/crisis-struck-german-maker-of-playmobil-toys-cuts-jobs"}