{"authors": ["Angela Tan"], "date_download": "2024-10-12 14:19:55", "date_modify": "2024-10-12 14:19:55", "date_publish": "2023-07-10 13:00:32", "description": "There will be 700 new digital jobs for PMETs in supply chain management from now till 2025, a study forecast. Read more at straitstimes.com.", "filename": "business_economy_singapore-rolls-out-talent-initiatives-to-capture-new-digital-jobs-in-supply-chain-management_1728742795.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/10/2023071042496317e2978ec0-9d25-4c34-9fa5-197c481b1eaa_7.jpg?VersionId=.6UhyGixjLId4tsTIVLwiXDHtgy7I5bk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_singapore-rolls-out-talent-initiatives-to-capture-new-digital-jobs-in-supply-chain-management_1728742795.html", "title": "Singapore rolls out initiatives to capture new digital jobs in supply chain management", "title_page": "Singapore rolls out initiatives to capture new digital jobs in supply chain management | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – There will be 700 new jobs for professionals, managers, executives and technicians (PMETs) requiring advanced digital knowledge and skills in supply chain management (SCM) from now until 2025, as more such businesses set up in Singapore to serve the region.\nCompanies are developing their SCM capabilities as manufacturing networks expand in South-east Asia and Singapore, Minister of State for Trade and Industry Low Yen Ling said on Monday.\nThis is “creating new opportunities for Singapore”, and the Government is mobilising efforts to exploit this, Ms Low said at the Singapore – Leading Supply Chain Management Hub in Asia event held at the Marina Bay Sands convention centre.\nThe 700 jobs forecast come from an inaugural SCM jobs transformation map (JTM) study. A separate survey showed that half of business leaders with supply chain operations in the Asia-Pacific plan to expand their manufacturing capacity in South-east Asia over the next three years.\n“As economic gravity shifts towards South-east Asia, Singapore offers compelling reasons for companies to anchor their SCM activities here,” Ms Low said, citing Singapore’s strong physical and trade connectivity network as well as track record.\nShe said shipping and logistics giant Maersk will be setting up a second regional distribution centre in Singapore.\n“It will anchor Singapore as a major logistics hub in the supply chain network, serving high-value verticals such as healthcare, lifestyle, footwear and apparel, and consumable products,” Ms Low said.\nMeanwhile, in the next decade, Tuas Port will be the world’s largest fully automated port with a capacity of 65 million twenty-foot equivalent units, capable of handling the largest container ships. In addition, Changi Airport – with the expansion of its fifth terminal – will increase its annual air cargo handling capacity by 80 per cent when the new Changi East Industrial Zone is ready.\nSingapore has a robust network of 27 free trade agreements and continues to pursue international partnerships to “promote greater trust, openness and resilience in global supply chains”, said Ms Low.\nIt has also started building a network of digital economy agreements with partners across the globe aimed at promoting digital trade and connectivity, as well as to foster interoperability of standards and systems.\nMs Low highlighted Singapore’s strong commitment to keep trade lanes and ports open even in times of crisis, such as during the Covid-19 pandemic, when PSA port played the role of a “catch-up” port to help connect and expedite shipments to different parts of the world.\nSingapore is also home to a growing base of SCM hubs such as consumer goods giant Procter & Gamble’s product supply hub, which optimises planning and manages risks for demand and supply across the Asia-Pacific, the Middle East and Africa.\nTo ensure the workforce stays relevant and competitive, the Government is supporting companies in training their workers and helping local job seekers acquire relevant and emerging skills, said the minister.\nThe Economic Development Board (EDB) and SkillsFuture Singapore are co-developing a one-stop reference guide, highlighting trends that will reshape SCM job scopes and raising awareness on the skill sets needed to stay relevant and competitive. The SCM Skills Plan will be launched on July 31, and can be found on the EDB website.\nInstitutes of higher learning are also enhancing their SCM curriculum. For example, the Singapore University of Social Sciences and o9 Solutions, a global software provider, are coming together to offer a masterclass that addresses the emerging digital and resilience skill sets required for advanced supply chain planning. It targets junior- to mid-level supply chain planners and is scheduled to run in the third quarter of 2023.\nThis year, the Singapore Management University Academy is slated to launch its first industry practice master’s programme, which will include skills identified that have high demand and transferability.\nThere is also the Career Conversion Programme for supply chain and logistics professionals and coordinators. This on-the-job training programme was launched in May to reskill Singaporeans to adapt to growing supply chain careers or redesigned job roles. Companies that hire mid-career individuals or reskill existing employees may receive up to 90 per cent salary support for the programme’s duration.\nEvery year, institutes of higher learning here produce about 3,600 graduates with the requisite skill sets to take on SCM job roles. The city-state has about 70,000 SCM professionals.\nSCM professionals command a median salary of about $5,900, which is higher than the national median salary of $4,680, according to data from the Ministry of Manpower.\nThe rise of digitalisation and automation will eventually phase out manual processes, so SCM professionals must evolve in other value-added responsibilities or acquire digitalisation-related skills to remain relevant.\nThe SCM JTM study found that 12 out of 38 PMET SCM roles will face a medium-term impact on their key tasks, and require new skills. The 12 roles involve planning, procurement and sourcing, and manufacturing, as well as distribution and logistics. They are expected to bear more complex, value-adding tasks with some responsibilities being substituted by technology.\nOn the other hand, new roles have and will emerge – such as system designer, data analyst, customer insight analyst and integrated business planner – requiring professionals with skills that are not traditionally found in the SCM sector.\nThe study was jointly commissioned by the EDB, Workforce Singapore and the Ministry of Manpower, in partnership with SkillsFuture Singapore. It surveyed 180 companies spanning wholesale and retail trade to computer, electronic and optical products, as well as institutes of higher learning.", "url": "https://www.straitstimes.com/business/economy/singapore-rolls-out-talent-initiatives-to-capture-new-digital-jobs-in-supply-chain-management"}