{"authors": [], "date_download": "2024-10-12 14:03:41", "date_modify": "2024-10-12 14:03:41", "date_publish": "2022-12-22 07:07:40", "description": "As at October last year, Micron employed about 8,600 people in Singapore, where some of its most advanced chips are made. Read more at straitstimes.com.", "filename": "business_micron-to-cut-10-of-workforce-as-demand-for-computer-chips-slumps_1728741821.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/22/2022-12-21T211148Z1313586980RC2KAY9F6S0ZRTRMADP3MICRON-TECH-RESULTS_8.JPG?VersionId=T5LsSTzOszio0hc1RBew_NamjGB7fWyl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_micron-to-cut-10-of-workforce-as-demand-for-computer-chips-slumps_1728741821.html", "title": "Micron to cut 10% of workforce as demand for computer chips slumps", "title_page": "Micron to cut 10% of workforce as demand for computer chips slumps | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAN FRANCISCO – Micron Technology, the largest US maker of memory chips, says the worst industry glut in more than a decade will make it difficult for it to return to profitability in 2023.\nThe company on Wednesday announced a host of cost-cutting measures, including a 10 per cent workforce reduction, aimed at helping it weather a rapid drop in revenue. Micron also projected a steep sales decline and a wider loss than analysts had estimated for the current quarter.\nUnited States-based Micron had 48,000 employees as at Sept 1, according to filings. As at October last year, Micron employed about 8,600 employees in Singapore, where some of its most advanced memory chips are made.\nSemiconductor makers are suffering plummeting demand for their products less than a year after being unable to produce enough to meet orders.\nConsumers have shelved purchases of personal computers and smartphones amid rising inflation and an uncertain economy. Makers of those devices, the main users of memory chips, are now stuck with unused stockpiles of components and are slowing orders for new stock.\nLast month, Micron warned that it was cutting production by about 20 per cent “in response to market conditions”.\nThe industry is experiencing its worst imbalance between supply and demand in 13 years, Micron chief executive officer Sanjay Mehrotra said on Wednesday. Inventory should peak in the current period, then decline in the rest of the year.\nCustomers will move to more healthy inventory levels by about the middle of 2023, and Micron’s revenue will improve in the second half of the year, he added.\n“Profitability will be challenged throughout 2023 because of the oversupply that exists in the industry,” Mr Mehrotra said in an interview. The rate and pace of the recovery in terms of profitability will depend “on how fast supply is brought into line”.\nMr Mehrotra said a unique convergence of circumstances – the war in Ukraine, a surge in inflation, Covid-19 and supply disruptions – has thrust the memory chip industry into a repeat of past cycles when prices plummeted and wiped out profits. Micron has responded aggressively to try to quickly get through the difficult period.\nOnce the downturn is over, the industry will resume profitable growth, helped by demand for artificial intelligence computing and automation of various industries, he said.\nMicron is cutting its budget for new plants and equipment, and now expects to spend US$7 billion to US$7.5 billion (S$9.4 billion to S$10 billion) for the fiscal year, a reduction from an earlier target of as much as US$12 billion. The company is slowing the introduction of more advanced manufacturing techniques and predicts that spending on new production will fall throughout the industry.\nUnlike other parts of the chip sector, products from Micron are built to industry standards, meaning that they can be swopped out for those of its competitors. As memory can be traded like a commodity, its makers are exposed to more pronounced price swings.\nMicron’s pledge to reduce output from its factories and slow expansion projects will not ease the glut of chips available unless rivals, including Samsung Electronics and SK Hynix, follow suit. This step can help support prices but comes with the penalty of running expensive plants at less than full capacity, something that can weigh heavily on profitability.\nIn addition to its planned workforce reductions, the company has suspended share repurchases, is cutting executive salaries and will skip company-wide bonus payments, executives said on a conference call after its results were released.\nMicron said sales will be about US$3.8 billion in the fiscal second quarter. This compares with analysts’ average estimate of US$3.88 billion, according to data compiled by Bloomberg. The company projected a loss of about 62 US cents a share, excluding certain items, in the period ending in February, compared with a loss of 29 US cents expected by analysts.\nIn the three months ended Dec 1, Micron’s sales sank 47 per cent to US$4.09 billion. The company had a loss of four US cents a share, excluding certain items, compared with an average estimate of a loss of one US cent a share on revenue of US$4.13 billion.\nMicron’s shares declined about 2 per cent in extended trading after closing at US$51.19 in New York on Wednesday. The stock has dropped 45 per cent this year, a worse decline than most chip-related equities.\nThe Philadelphia Stock Exchange Semiconductor Index is down 33 per cent in 2022. BLOOMBERG", "url": "https://www.straitstimes.com/business/micron-to-cut-10-of-workforce-as-demand-for-computer-chips-slumps"}