{"authors": [], "date_download": "2024-10-12 14:03:25", "date_modify": "2024-10-12 14:03:25", "date_publish": "2023-01-30 07:48:00", "description": "Inventories have more than tripled to record levels, reaching three to four months’ worth of supply. Read more at straitstimes.com.", "filename": "business_historic-crash-for-memory-chips-threatens-to-wipe-out-earnings_1728741805.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/30/2022-12-13T025033Z2034498140RC2P4Y9B5C90RTRMADP3JAPAN-SEMICONDUCTORS-IBM_3.JPG?VersionId=kpTm.1JWS69bLr7Mmwkk8H3BjV2gUR.2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_historic-crash-for-memory-chips-threatens-to-wipe-out-earnings_1728741805.html", "title": "Historic crash for memory chips threatens to wipe out earnings", "title_page": "Historic crash for memory chips threatens to wipe out earnings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - This time was supposed to be different.\nThe memory chip sector, famous for its boom-and-bust cycles, had changed its ways. A combination of more disciplined management and new markets for its products – including 5G technology and cloud services – would ensure that companies delivered more predictable earnings.\nYet, less than a year after memory companies made such pronouncements, the US$160 billion (S$210 billion) industry is suffering one of its worst routs ever. There is a glut of the chips sitting in warehouses, customers are cutting orders and product prices have plunged.\nThe unprecedented crisis is not just wiping out cash at industry leaders SK Hynix and Micron Technology, but also destabilising their suppliers, denting Asian economies that rely on technology exports and forcing the few remaining memory players to form alliances or even consider mergers.\nIt has been a swift descent from the industry’s pandemic sales surge, which was fuelled by shoppers outfitting home offices and snapping up computers, tablets and smartphones. Now consumers and businesses are holding off on big purchases as they cope with inflation and rising interest rates. Makers of those devices, the main buyers of memory chips, are suddenly stuck with stockpiles of components and have no need for more.\nAlready, Samsung Electronics and its rivals are losing money on every chip they produce. Their collective operating losses are projected to hit a record US$5 billion this year. Inventories, a critical indicator of demand for memory chips, have more than tripled to record levels, reaching three to four months’ worth of supply.\nSamsung looks to be the only one that will escape relatively unscathed, thanks to its heft and diversified business, but even the South Korean giant’s semiconductor division is headed towards losses. The world’s largest maker of chips, smartphones and display panels is set to report fourth-quarter earnings on Tuesday.\nThe industry is suffering from a unique combination of circumstances – a pandemic hangover, the war in Ukraine, historic inflation and supply chain disruptions – that have made the slump much worse than a regular cyclical downturn.\nMicron, the last remaining United States memory chipmaker, has responded aggressively to plummeting demand. The company said late in December that it will cut its budget for new plants and equipment in addition to reducing output.\nOver in South Korea, Hynix has also slashed investments and scaled back output. The company’s inventory glut is partly the result of its acquisition of Intel’s flash memory business – a deal struck before the industry’s decline.\nAll eyes are now on Samsung, which has thus far said little about the industry’s near-term prospects. The memory chip king has typically continued to spend during downturns, hoping to exit them with superior production and higher profitability when demand picks up. This time round, the market has been betting the company will tighten its chip supply, lifting its stock price in recent weeks.\nChip manufacturing equipment maker Lam Research said last week that it is seeing an unprecedented reduction in orders as memory customers cut and postpone spending. Executives at the company, which counts Samsung, SK Hynix and Micron as its top customers, declined to predict when such actions might help the memory market rebound.\n“We have seen extraordinary measures within the memory market,” said Lam Research chief executive Tim Archer on a call with investors. “It is at levels that we have not seen in 25 years.”\nIt has always been difficult for memory makers to handle spikes and troughs in demand. Bringing new factories online takes years and billions of dollars, so it is hard to get the timing right.\nThe risks have prompted companies in the industry to get more conservative. They are more focused on profitability than trying to grow quickly and gain market share.\nThis is especially true for so-called Dram chips, where the three dominant suppliers – Samsung, Hynix and Micron – are reducing supply, said Mr Shin Jin-ho, co-CEO of Midas International Asset Management. The other major part of the memory market, Nand chips, is more fragmented and is set to go through a more severe battle as the many contenders fight for survival, he added.\n“The Nand market is experiencing fierce competition and the recovery will follow one quarter after the Dram market recovery,” said Mr Shin. “If the situation gets longer, eventually, we are going to see consolidation in the Nand market.”\nThe longer-term question is when customers’ demand will bounce back. China’s recent exit from Covid-19-related restrictions could be one catalyst to help the industry, as gadget makers will be able to bring manufacturing plants back to normal rhythm, said Mr Greg Roh, head of technology research at HMC Investment & Securities.\n“There will be pent-up demand for gadgets as well,” said Mr Roh. “Our view is that memory will recover in the second half.” BLOOMBERG", "url": "https://www.straitstimes.com/business/historic-crash-for-memory-chips-threatens-to-wipe-out-earnings"}