{"authors": [], "date_download": "2024-10-12 13:36:10", "date_modify": "2024-10-12 13:36:10", "date_publish": "2024-09-13 07:26:00", "description": "Mr Simon Treacy, CEO of its private equity real estate division, will step down on Oct 31. Read more at straitstimes.com.", "filename": "business_capitaland-shakes-up-leadership-at-private-funds-unit_1728740170.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/13/YINH0512.JPG?VersionId=z.S.n8C2WVReI8nzkQrJPKu81ijpR32B", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_capitaland-shakes-up-leadership-at-private-funds-unit_1728740170.html", "title": "CapitaLand Investment shakes up leadership at private funds unit", "title_page": "CapitaLand Investment shakes up leadership at private funds unit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - CapitaLand Investment (CLI) announced a leadership shake-up at its private funds division, as the real estate firm looks to rearrange units after a mixed set of earnings and tepid stock performance.\nMr Simon Treacy, the chief executive of its private equity real estate division, will step down on Oct 31, CLI said on Sept 12. He will take on the role of senior adviser to group CEO Lee Chee Koon and provide counsel to the firm’s private equity team on capital raising and investments, effective from Nov 1.\nThe private funds division, which currently houses the real estate and alternative assets units, will see the two merged into a single Real Assets platform led by Mr Lee. Group chief operating officer Andrew Lim will have responsibility for capital raising and product development.\nCLI said the changes were part of an ongoing process to strengthen its “leadership team and accelerate the growth of the company’s private funds business”.\nCLI, which was listed in late 2021 as part of a major restructuring at CapitaLand Group, has been facing market pressure over its sizeable investments in China, which is experiencing a major property downturn. CapitaLand Group is owned by Singapore state investor Temasek, which also holds a majority stake in the investment arm.\nThe company’s stock has fallen 9 per cent in 2024 up to the Sept 12 close, underperforming Singapore’s benchmark stock index, which has risen nearly 10 per cent in the same period. In August, Mr Lim acknowledged investor “impatience” with the firm’s pivot away from China, saying it was a delicate process.\nIn a separate exchange filing, the firm said Mr Treacy was giving up his CEO role “for personal reasons”.\nMr Treacy, 56, had been one of the most high-profile members of the real estate investment manager’s leadership team since he joined the company in October 2021. He previously served as the global chief investment officer and head of US equity for BlackRock Real Estate. He had been slated to speak in a public engagement next week – a panel at the Milken Institute’s Asia Summit.\n“While the timing of the announcement may come as a bit of a surprise, we see changes in leadership as part of normal business operations and do not expect a negative impact on the share price,” said Mr Xavier Lee, an equity analyst at Morningstar, which covers the company.\nCLI also announced other additions to its private funds leadership team. It includes Mr Alan Tan, who will join the firm as managing director as well as head of capital raising, private capital markets, and as managing director of special projects, private equity real assets. Other appointments include Mr Kenny Khow, who will be managing director of global data centre. Both appointments are effective from Oct 1. BLOOMBERG", "url": "https://www.straitstimes.com/business/capitaland-shakes-up-leadership-at-private-funds-unit"}