{"authors": [], "date_download": "2024-10-12 14:14:06", "date_modify": "2024-10-12 14:14:06", "date_publish": "2022-02-10 06:49:38", "description": "Xia Haijun sold the notes at prices ranging from about 36 cents on the dollar to 52 cents in late July and early August. Read more at straitstimes.com.", "filename": "business_property_evergrande-ceo-cut-his-bond-holdings-early-in-crisis_1728742446.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/02/10/fhxia100222.JPG?VersionId=2qcx5V6GK2_rkRXdYn8w4AsIkqfpUCR5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_evergrande-ceo-cut-his-bond-holdings-early-in-crisis_1728742446.html", "title": "Evergrande CEO cut his bond holdings early in debt crisis", "title_page": "Evergrande CEO cut his bond holdings early in debt crisis | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (BLOOMBERG) - China Evergrande Group's chief executive officer sold bonds with a face value of US$128 million (S$172 million) in the early months of the developer's debt crisis, paring his exposure before the company's historic default.\nMr Xia Haijun sold the notes at prices ranging from about 36 cents on the dollar to 52 cents in late July and early August, according to a Hong Kong exchange filing on Wednesday (Feb 9). Some of the notes he sold now trade at about 10 cents, Bloomberg-compiled prices show.\nEvergrande is headed for what is likely to be one of China's largest restructurings after defaulting on its dollar debt late last year. Worries about a liquidity crunch began bubbling to the surface in late May, after the Chinese authorities escalated a clampdown on debt-fuelled expansion in the real estate sector.\nPrevious exchange disclosures have shown that Mr Xia was also cutting his exposure to other Evergrande securities in August. He sold shares in the group's property management and new energy vehicle units for average prices of about HK$7.30 (S$1.25) and HK$14.18 respectively. Shares of the property unit now trade at HK$2.68 and the energy vehicle unit is priced at HK$3.62.", "url": "https://www.straitstimes.com/business/property/evergrande-ceo-cut-his-bond-holdings-early-in-crisis"}