{"authors": ["Prisca Ang"], "date_download": "2024-10-12 13:44:13", "date_modify": "2024-10-12 13:44:13", "date_publish": "2024-03-12 05:00:00", "description": "Acquiring fresh skills will give workers a new lease of life in their careers. Read more at straitstimes.com.", "filename": "business_companies-play-key-role-in-helping-workers-gain-new-skills-indranee_1728740653.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/12/yaohui-pixgeneric-9790.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-play-key-role-in-helping-workers-gain-new-skills-indranee_1728740653.html", "title": "Companies play key role in helping workers gain new skills: Indranee", "title_page": "Companies play key role in helping workers gain new skills: Indranee | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Acquiring fresh skills will give workers a new lease of life in their careers, and companies here can play an important role in enabling talent development.\nHowever, more needs to be done to get companies comfortable with the idea of giving their staff time off for further studies and training.\nThese were some of the ideas raised at a roundtable discussion on Singapore’s recent Budget. The event was organised by The Straits Times and The Business Times and held on March 7.\nOne of the measures announced in the Budget was a boost to SkillsFuture credits for those aged 40 and above. They will receive a credit of $4,000, and an allowance of up to $3,000 a month for up to 24 months when they pursue certain full-time courses.\nDespite efforts to encourage workers to upskill themselves, Singapore has seen a low take-up of SkillsFuture, which was introduced in 2015. So far, only around one in three Singaporeans has used their SkillsFuture credits, according to SkillsFuture Singapore data.\nNational Trades Union Congress deputy secretary-general Desmond Tan said that while SkillsFuture provides financial support, other factors might deter people from going for training – many find that they are unable to take time off, and employers might not help them to do so.\nWorkers might also not know where to start in terms of the types of skills they need, he added.\n“Even if they go through training, they think, ‘What kind of recognition and reward do I get out of it?’ There ought to be some (consideration of the impact of) the skill sets and the training they have received on their wages, or the recognition they get from their employers,” said Mr Tan.\nST associate editor and senior columnist Vikram Khanna, who moderated the roundtable discussion, also asked whether companies such as small and medium-sized enterprises (SMEs) would be willing to let workers go for training, given their labour constraints.\nAssociation of Small and Medium Enterprises president Ang Yuit said businesses are interested in employees benefiting from experiences that are relevant to the organisation.\n“If we can apply SkillsFuture and tie it in more with on-the-job training and on-the-job experience, I think that will result in much better take-up and alignment to the business,” he said.\n“What businesses sometimes cannot see is how a particular course impacts the business outcome. And when it doesn’t, then the business would rather the employee focus on what is going to be productive,” he added.\nMinister in the Prime Minister’s Office and Second Minister for Finance and National Development Indranee Rajah said companies play an important role in talent development, and the best ones are those with continued, structured programmes for employees to learn and acquire new skills.\nCompanies need to be progressive and forward-thinking, and they must want to invest in their employees, she said.\n“The older mindset is a plug-and-play one; they expect somebody to come out of the university or school fully formed with all the skills, so the company is able to just plug them in. But the reality is that from day one when you start a job, you are learning.”", "url": "https://www.straitstimes.com/business/companies-play-key-role-in-helping-workers-gain-new-skills-indranee"}