{"authors": [], "date_download": "2024-10-12 14:13:55", "date_modify": "2024-10-12 14:13:55", "date_publish": "2022-10-07 12:37:30", "description": "Asia's second-wealthiest man has picked a manager to hire staff for the new entity, the sources say. Read more at straitstimes.com.", "filename": "business_banking_billionaire-mukesh-ambani-to-open-family-office-in-singapore-sources-say_1728742435.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/07/dw-mukesh-ambani-221007.jpg?VersionId=IyxLT6LKPP68caG1EiQlo6q_qdTttJzB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking_billionaire-mukesh-ambani-to-open-family-office-in-singapore-sources-say_1728742435.html", "title": "Indian billionaire Mukesh Ambani to open family office in Singapore, sources say", "title_page": "Indian billionaire Mukesh Ambani to open family office in Singapore, sources say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Asia's second-wealthiest man, Reliance Industries chairman Mukesh Ambani, is setting up a family office in Singapore, according to people familiar with the move.\nThe Mumbai-based billionaire has picked a manager to hire staff for the new entity and get it running, the people said. The Ambanis have also chosen real estate, one of the people said.\nA Reliance spokesman, who also represents Mr Ambani, was not available for comment.\nMr Ambani is the latest in a series of ultra-rich people to pick Singapore for their family offices - the organisations set up to manage the affairs of wealthy clans - joining the likes of hedge fund billionaire Ray Dalio and Google co-founder Sergey Brin.\nSingapore has become an attractive hub for family offices thanks to its low taxes and relative security. The Monetary Authority of Singapore estimates that about 700 were in place by the end of 2021, up from 400 a year earlier.\nBut the rising number of global rich crowding Singapore's shores is also resulting in higher prices for cars, housing and other goods. Deputy Prime Minister Lawrence Wong signalled in an August interview that the wealthy may face more taxes to boost inclusive growth.\nMr Ambani's move to set up the family office ties in with his larger vision of taking his retail-to-refining empire global and acquiring assets outside India. While announcing the appointment of Aramco's chairman on the board of Reliance in 2021, the billionaire told his shareholders that this marked \"the beginning of internationalisation\" of his conglomerate, without elaborating.\n\"You will hear more about our international plans in the times to come,\" he had said at the time.\nReliance paid US$79 million (S$113 million) for Stoke Park in April 2021, adding an iconic British locale that has been the setting for two James Bond films. It also bought an indirect 73.4 per cent stake in Mandarin Oriental New York for US$98.15 million in January and a US$80 million beachside villa in Dubai this year.\nMr Ambani, who is worth an estimated US$83.7 billion, according to the Bloomberg Wealth Index, wants the Singapore family office to be running within a year, one of the people said. His wife Nita Ambani is also helping to set it up, the people added.\nReliance has been pivoting from its legacy oil refining and petrochemicals business towards e-commerce, green energy and the expansion of its retail footprint across India.\nIn 2020, its technology venture Jio Platforms lured more than US$25 billion from marquee Silicon Valley investors including Meta Platforms and Google. It has also unveiled ambitious plans to take on Amazon.com in the country, including in streaming. BLOOMBERG", "url": "https://www.straitstimes.com/business/banking/billionaire-mukesh-ambani-to-open-family-office-in-singapore-sources-say"}