{"authors": [], "date_download": "2024-10-12 14:12:36", "date_modify": "2024-10-12 14:12:36", "date_publish": "2023-10-10 08:26:10", "description": "He Jinbi founded and built Maike Metals International into China’s biggest importer of refined copper. Read more at straitstimes.com.", "filename": "business_china-copper-tycoon-goes-missing-believed-to-be-detained-by-police_1728742356.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/10/229621086He20Jinbibloomberg.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-copper-tycoon-goes-missing-believed-to-be-detained-by-police_1728742356.html", "title": "China copper tycoon goes missing, believed to be detained by police", "title_page": "China copper tycoon goes missing, believed to be detained by police | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Executives at one of China’s largest copper-trading houses have lost contact with the company’s founder and believe that he has been detained by police for questioning, according to people familiar with the matter.\nMr He Jinbi founded and built Maike Metals International into China’s biggest importer of refined copper before a liquidity crisis in 2022 brought the company to its knees. Colleagues have not heard from him for at least a day, and have been informed that he was taken away by police for interviews in his home province of Shaanxi, the people said.\nThe people did not give a reason for Mr He’s supposed detention. Maike and Mr He have been the focus of legal action by creditors since the company ran into difficulties in 2022 during China’s extended Covid-19 lockdowns, when it began experiencing difficulties paying for purchases. Bloomberg reported last September that its trading activity had largely ground to a halt.\nMaike until recently was responsible for a quarter of China’s copper imports – making Mr He one of the industry’s most powerful players – and its downfall has sent tremors across the industry.\nIn recent years, China’s leadership has not hesitated to go after high-profile business figures, especially when empires falter and consumers are caught in the crossfire. Mr Hui Ka Yan, the billionaire chairman of beleaguered property developer China Evergrande Group, was taken by police in September and placed under residential surveillance. Mr Chen Feng and Mr Tan Xiangdong of HNA Group, a once-high-flying conglomerate whose debt-fuelled acquisitions became an early symbol of corporate excess, were detained in 2021.\nExecutives can be held as targets themselves or to help with investigations into others. Detention does not mean they will be charged. Mr Guo Guangchang, of the debt-laden Fosun conglomerate, briefly disappeared in 2015. After assisting police, he returned to work.\nMr He founded Maike with a group of friends in 1993, and started out trading mechanical and electrical products before shifting focus to copper. With a wide network of friends and business contacts, he built Maike into a vital conduit between big international traders and Chinese consumers to feed the country’s insatiable appetite for raw materials during the 2000s commodity supercycle.\nHis deep connections in the real economy helped him make bold and successful bets on the future of the copper market, and he was a pioneer of China’s cash-for-copper trade, borrowing against the massive volumes of metal he was shipping and storing in warehouses.\nIn the 2010s, Maike expanded into China’s booming real estate sector, investing in the hotels and business centres that would later be left empty for months during China’s extended Covid-19 lockdowns, contributing to 2022’s liquidity crisis.\nThen in February 2023, Maike filed a request to a court for “preliminary restructuring” as it seeks to start trading metal again. However, its continued absence from the market has weighed on liquidity in China’s copper trade.\nMr He was sued this year by ING Groep in Hong Kong over US$147 million (S$200 million) in unpaid debt. The case involved overdue payments owed by a trading arm of Maike, according to court filings. BLOOMBERG", "url": "https://www.straitstimes.com/business/china-copper-tycoon-goes-missing-believed-to-be-detained-by-police"}