{"authors": [], "date_download": "2024-10-12 14:17:02", "date_modify": "2024-10-12 14:17:02", "date_publish": "2023-12-25 05:00:00", "description": "As this year’s trading draws to a close, Bloomberg chronicles the good, the bad and the ugly. Read more at straitstimes.com.", "filename": "business_the-big-trades-of-2023-from-market-busts-to-career-making-wins_1728742622.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/25/IMGdices-over-newspaper11245AGR3.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_the-big-trades-of-2023-from-market-busts-to-career-making-wins_1728742622.html", "title": "The big trades of 2023: From market busts to career-making wins", "title_page": "The big trades of 2023: From market busts to career-making wins | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – A slew of trades around the world, from bank bonds to cryptocurrencies, either blew up or rocketed higher against expectations in 2023.\nShort seller attacks on the Adani Group’s empire in India took a surprising turn. Crypto diehards got a shot of redemption. So-called bubbles, like ESG (environmental, social, and governance), deflated.\nThe irresistible force behind much of the action: the United States Federal Reserve’s disruptive monetary-tightening campaign, creating new winners and losers in its wake.\nAs 2023’s trading draws to a close, Bloomberg chronicles the good, the bad and the ugly, as told by market reporters from New York to Singapore.\nThe great AI rally\nThe great artificial intelligence market rally of 2023 showered untold riches onto tech companies and their visionaries and sparked huge gains for portfolios big and small.\nNothing has been able to stop the AI fervour. Not frothy valuations. Not the drama at ChatGPT owner OpenAI. Not even fears that the newfangled tech will not live up to the hype.\nAll told, the seven largest tech firms – from Microsoft to Nvidia – have been responsible for an astonishing 65 per cent of the S&P 500’s rally in 2023 through Dec 20.\n“Year of the Bond” misfires\nThe “Year of the Bond” misfired. The forecast for 2023 was that the US economy would crater under the weight of the Fed’s run of rate hikes, sending bond prices up on the expectation of policy loosening to come.\nInstead, the US economy has stayed strong, keeping the threat of faster price growth ever-present. Bond prices fell as yields catapulted to highs not seen since 2007.\nWhen the Fed finally pivoted, bonds rallied, sending benchmark yields to multi-month lows, as traders bet on rate cuts in 2024.\nOne big beneficiary from 2023’s big swings in US Treasuries is hedge fund billionaire Bill Ackman.\nIn August, Mr Ackman’s flagship fund was betting against US 30-year bonds, citing elevated inflation and swelling government deficits. He got it right.\nMr Ackman then announced that he unwound the macro trade just as yields peaked, helping his fund return 16 per cent in 2023 through November on a net basis.\nChina: The comeback that wasn’t\nAlmost everybody got China wrong.\nGoldman Sachs called for double-digit increases in both the MSCI China benchmark and the CSI 300 Index and Morgan Stanley turned overweight on Chinese stocks in December 2022, joining prognosticators who expected the world’s second-largest economy and markets would get a lift as the government relaxed Covid-19 restrictions.\nYet the reopening revival failed to materialise. Stocks are nowhere near pre-pandemic levels, and China’s property debt crisis swallowed even more companies.\nAs at Dec 20, the MSCI China Index was down more than 14 per cent for the year.\nIndia: The rally that was\n“Buy India” is a popular Wall Street investment mantra these days, but back in January it was a very different story.\nShort seller Hindenburg Research’s attack on tycoon Gautam Adani suddenly put the billionaire’s energy-to-ports empire into a tailspin – spurring a US$150 billion (S$200 billion) market loss – and raised broader fears about India’s credibility as a hot investment destination.\nMonths later, Mr Adani is enjoying something of a redemption in markets and the court of public opinion.\nThanks to refinancing manoeuvres that improved the group’s financial discipline, sanguine signals from policymakers and continued economic growth, Adani-linked shares and bonds are on a relief rally.\nJapan: Land of the rising stocks\nJapan, a perennial underperformer in world markets in recent years, emerged as an investor darling, thanks to an upturn in economic growth and optimism that central bankers may finally be ready to abandon their rock-bottom interest rate policy.\nChina’s malaise and an endorsement from billionaire Warren Buffett did not hurt, either.\nThe legendary investor said in April that he was considering more Japanese investments after raising his stakes in the nation’s trading houses.\nMr Buffett’s Berkshire Hathaway then said in June it had further increased its stakes in five of Japan’s trading firms.\nThe benchmark Topix index duly rose to a 33-year high.\nThose who expected a turnaround in the yen’s weakness have not been so fortunate.\nBarclays and Nomura Holdings forecast a 9 per cent rally in the yen from December 2022’s levels.\nInstead, the currency once again finds itself as the worst performer in Asia.\nBitcoin: Back from the dead\nThe crypto market was left reeling after high-profile 2022 blow-ups, bankruptcies and overall bad behaviour.\nBitcoin, the oldest and biggest token, was nursing a loss of more than 60 per cent, and the fallout from the collapse of Sam Bankman-Fried’s FTX exchange was still reverberating.\nProspects for a Bitcoin revival – let alone a rally – seemed remote.\nBut starting in June, a sustained turnaround took hold after investment firms led by BlackRock filed a flurry of applications to list exchange-traded funds (ETFs) tracking the spot price of Bitcoin.\nOptimism these ETFs will win approval and spur wider adoption of Bitcoin, combined with the legal resolution of some high-profile crypto cases and expectations for Fed rate cuts, helped turbocharge gains.\nThe result: Bitcoin has more than doubled in 2023, making it one of the best performers in any market.\nESG: Throwing in the towel\nThe alliance between progressives and hard-nosed capitalists in fuelling the environmental, social and governance (ESG) movement was never going to be easy.\nBut in 2023, the ESG agenda took a big beating from all sides of the political aisle.\nThe sector is raising questions from Republican lawmakers as well as watchdogs about its methodology, transparency and the potential for overstating the effectiveness of its stated goals via “greenwashing”.\nSome industry watchers have even gone as far as saying that ESG is headed for its “inevitable end game”.\nThe biggest casualties included a group of BlackRock ETFs as well as veteran hedge fund manager Jeff Ubben.\nBlackRock, the world’s largest asset manager, saw more than US$9 billion pulled from its biggest ESG-focused ETF, a record annual outflow, while Ubben abruptly closed his socially responsible investment firm Inclusive Capital Partners in November.\nCredit Suisse: Out of the AT1 ashes\nThe sudden death of Credit Suisse unexpectedly wiped out big-name holders of the firm’s riskiest bonds – eliciting a backlash from money managers and senior bankers warning the bank-funding market would fall into crisis.\nThat turned out to be melodramatic in hindsight after European policymakers engineered a rescue by UBS.\nYet the controversial decision by the Swiss regulator to liquidate holders of US$17 billion of so-called additional tier 1 (AT1) securities – even while preserving some value for equity investors – left a long list of losers.\nAs ever, bargain-hunting funds spied opportunity.\nGoldenTree Asset Management bought roughly US$300 million of AT1 bonds at knockdown prices for a cool US$100 million profit.\nThere were other fast-money trades that won big by picking over the corpse of Credit Suisse: Scooping up the bank’s senior debt, which was changing hands at deep discounts in the days before the firm’s demise. BLOOMBERG", "url": "https://www.straitstimes.com/business/the-big-trades-of-2023-from-market-busts-to-career-making-wins"}