{"authors": [], "date_download": "2024-10-12 14:18:51", "date_modify": "2024-10-12 14:18:51", "date_publish": "2022-05-16 19:07:18", "description": "It expects to record non-cash charge of about US$1.2 billion to US$1.4 billion following the sale. Read more at straitstimes.com.", "filename": "business_companies-markets_mcdonalds-to-exit-russia-after-more-than-30-years_1728742731.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/16/AK_rucov_160522.jpg?VersionId=eojIkohZbdq2MWE78PC3EbNbSKzNxPb3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_mcdonalds-to-exit-russia-after-more-than-30-years_1728742731.html", "title": "McDonald's to exit Russia after more than 30 years", "title_page": "McDonald's to exit Russia after more than 30 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BENGALURU (REUTERS) - McDonald's Corp said on Monday (May 16) it has started a process to sell all its restaurants in Russia, exiting the country after more than 30 years following Moscow's invasion of Ukraine.\nThe world's largest fast-food chain had in March decided to close its 847 restaurants in Russia, taking a hit of US$50 million (S$69.7 million) per month.\nIt now expects to record a non-cash charge of about US$1.2 billion to US$1.4 billion following the sale.\nThe decision to sell its Russia assets, including the iconic Pushkin Square location in central Moscow, marks a major retreat by an iconic Western brand.\nOnce a symbol of flourishing American capitalism in the dying embers of the Soviet Union, the store was the first to be opened in the country in 1990.\nMore than 5,000 people had attended the opening.\nMcDonald's said it was looking to sell all its restaurants in Russia to a local buyer, but will continue to retain the trademark.\n\"The humanitarian crisis caused by the war in Ukraine and the precipitating unpredictable operating environment have led McDonald's to conclude that continued ownership of the business in Russia is no longer tenable,\" the fast-food giant added.\nA slew of other Western companies have agreed to sell their Russian assets or hand them over to local managers as they scramble to comply with sanctions over the Ukraine conflict and deal with threats from the Kremlin that foreign-owned assets may be seized.\nThe company said it would ensure that its 62,000 employees in Russia continue to be paid until the close of any transaction and that they have future jobs with any potential buyer.", "url": "https://www.straitstimes.com/business/companies-markets/mcdonalds-to-exit-russia-after-more-than-30-years"}