{"authors": [], "date_download": "2024-10-12 13:53:18", "date_modify": "2024-10-12 13:53:18", "date_publish": "2023-02-21 08:39:15", "description": "Most UK companies participating are not returning to the five-day standard, and a third are ready to make that change permanent. Read more at straitstimes.com.", "filename": "business_world-s-largest-4-day-work-week-trial-finds-few-are-going-back_1728741198.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/21/2023-02-10T103634Z958550305RC288Z9KLK31RTRMADP3BRITAIN-ECONOMY_3.JPG?VersionId=Nf_Y3OR67wnNia53xwMIwUZzYm3rNwos", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_world-s-largest-4-day-work-week-trial-finds-few-are-going-back_1728741198.html", "title": "World’s biggest 4-day work week trial finds few participants going back to 5-day week", "title_page": "World’s biggest 4-day work week trial finds few participants going back to 5-day week | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – The largest-ever trial of the four-day work week found that most British companies participating are not returning to the five-day standard, and a third are ready to make that change permanent.\nThe study involved 61 organisations and about 2,900 workers who voluntarily adopted truncated work weeks from June to December 2022. Only three organisations decided to pause the experiment, and two were still considering shorter hours, data released on Tuesday showed. The rest were convinced by revenue gains, drops in turnover and lower levels of worker burnout that four is the new five when it comes to work days.\nThat thousands of employees adopted shorter schedules is notable given that the research occurred during trying economic circumstances that squeezed many British companies, including rapid inflation, political instability and the fallout from Brexit.\n“I was wondering if it might be a lot harder for companies to make four-day weeks work, and the answer seems to be no,” said lead researcher Juliet Schor, an economist and sociologist at Boston College. Her research has long found that five-day work weeks no longer fit the lifestyles and commitments of modern employees, particularly caretakers.\nThe British data strongly confirms the findings of smaller trials, whose results were released in December, of companies based in the United States, Ireland and Australia. That research showed equivalent gains in revenue and employee productivity, as well as drops in absenteeism and turnover. Those pilots were smaller, covering roughly half the number of companies in the British trial, and a third of the employees.\nThe British results are the second major data release in an ongoing series of four-day tests coordinated by 4-Day Week Global, a New Zealand-based non-profit advocacy group. With each iteration, the researchers adjust their data collection, as well as begin tracking the long-term effects of lighter schedules.\nAlthough the studies are well-designed and include organisations across a swathe of industries, weak points include participating organisations skewing smaller and the trials not being randomised: the participating organisations all opt in and invest substantial efforts in training and planning – meaning that leaders are biased towards championing shorter work schedules.\nEmployees who had a taste of the shorter work week in the trial liked what they found. With the new schedule, workers reported improvements in everything from stress, fatigue and health to their personal life. The time that men spent looking after children increased by more than double that of women during the trial. None of the 2,900 participants said they wanted to ditch the four-day arrangement, and 15 per cent even said that no amount of extra money could make them return to five days.\nWorking less in a cost-of-living crisis\nMost companies adopted four-day schedules, although a small percentage opted for shorter five-day arrangements or, in the case of seasonal businesses like restaurants, an annualised four-day week model in which longer opening times in summer would compensate for shorter days in winter.\nHowever, recent evidence showed that many in Britain actually wanted to work more hours. Many saw that as a lifeline to boost their earnings in the cost-of-living crisis, according to the Chartered Institute of Personnel and Development (CIPD), a body for human resources professionals.\n“The point of the trial is to gather evidence from a wide variety of companies to challenge the view that it cannot be done,” said Mr Jon Boys, senior labour market economist at the CIPD. “The big risk is that a 20 per cent reduction in hours requires a 25 per cent increase in productivity to keep output steady.”\nTuesday’s fresh British results help make the business case for the four-day week. Organisational revenue was up 35 per cent from a year earlier and rose by 1.4 per cent during the trial.\nAlthough multi-company measures of productivity are difficult, the organisations rated the impact of four-day schedules as positive, averaging 7.5 on a 10-point scale.\nEmployee absenteeism dropped from two days a month to 0.7, while turnover fell by more than half, although the small sample and broader labour market dynamics make it difficult to isolate the trial effect. Companies rated the overall experience an 8.3 out of 10.\nEnvironmental consultancy Tyler Grange, which permanently adopted a four-day schedule for its 100 or so employees after the trial, said the shorter schedule boosted productivity by over a fifth and led to around 18 fewer lost days per month due to sickness. Employees also said spending an extra day at home helped them cut childcare and commuting costs.\nFlexibility gains and losses\nAfter the pandemic, flexibility around work-life balance became essential for most companies to win and keep workers in a tight labour market. Now, some see the four-day work week as a new weapon in the battle for talent.\nWomen, in particular, benefited from the extra day off. While both genders reported better outcomes, females experienced greater boosts around life and job satisfaction. It is also shifting household dynamics as men reported that they took on more childcare and housework – although men still do not carry a 50 per cent share.\nStill, when it comes to the link between days worked and flexibility, some are sceptical that less is more.\n“You lose flexibility with four days,” said Mr Matthew Crummack, chief executive officer at Domestic & General, which provides insurance and repairing services for appliances.\n“Our view is that inevitably on the fifth day, something will crop up and you will end up having to work.”\nInstead, Mr Crummack’s company preferred to adopt a fully flexible working model after the pandemic that essentially leaves return-to-office decisions completely up to employees.\n“The experiment will probably be deemed a success if hard metrics like productivity and revenue hold up as well as other metrics like well-being. Ultimately, businesses have little to lose by trial and experimentation,” CIPD’s Mr Boys said. “For most businesses, money talks.” BLOOMBERG", "url": "https://www.straitstimes.com/business/world-s-largest-4-day-work-week-trial-finds-few-are-going-back"}