{"authors": ["Timothy Goh"], "date_download": "2024-10-12 14:20:49", "date_modify": "2024-10-12 14:20:49", "date_publish": "2024-06-07 17:00:00", "description": "SINGAPORE – A major shipping company here has set up a training scheme to improve staff skill levels and develop new talent. Read more at straitstimes.com.", "filename": "business_companies-markets_s-pore-shipping-firm-pil-launches-academy-to-train-maritime-professionals-groom-new-talent_1728742849.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/07/btacademy20240607.jpg?VersionId=zF3tDMU5V.UTI_VwlU6gaGqqX7jNSVGc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_s-pore-shipping-firm-pil-launches-academy-to-train-maritime-professionals-groom-new-talent_1728742849.html", "title": "S’pore shipping firm PIL launches academy to train maritime professionals, develop new talent", "title_page": "S’pore shipping firm PIL launches academy to train maritime professionals, develop new talent | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A major shipping company here has set up a training scheme to improve staff skill levels and develop new talent.\nThe academy established by Pacific International Lines (PIL) will offer customised training for employees and new hires.\nIts curriculum includes courses in fleet and vessel operations, maritime finance and commerce, sustainability and decarbonisation.\nThe academy will also offer courses in soft skills like leadership, innovation and communication, and support PIL’s Management Associate Programme to train new employees.\nPIL chief executive Lars Kastrup said on June 7 that the company wants to boost employee skills to future-proof their careers while increasing productivity and innovation in the firm.\n“As PIL transforms into a stronger, more efficient, innovative, sustainable and future-ready organisation, we are empowering our employees to propel the company ahead through PIL Academy’s structured and comprehensive programme,” he said.\nPIL, which is based in Singapore, is the world’s 12th largest container shipping line and the largest home-grown carrier by capacity in South-east Asia.\nThe firm, which has 8,000 employees worldwide, including 4,000 seafarers, inked several memorandums of understanding on June 7 to support its academy.\nOne involves the Singapore Institute of Technology and the PIL Academy co-developing maritime-related micro-credentials that can be stacked towards a degree or other qualifications. They will also conduct continuing education and training programmes and workplace learning projects.\nThe academy has also teamed up with skills management software company JobKred to facilitate technology-based learning for PIL employees.\nAnother initiative will see the academy offer maritime diplomas to PIL employees via a partnership with the Britain-based Maritime Training Academy.\nTransport Minister Chee Hong Tat told the academy’s launch event at Guoco Midtown on June 7 that the maritime industry is key to international trade, with more than 80 per cent of the world’s cargo transported by sea.\nHe said Singapore aims to be a global hub for maritime talent development, leveraging the strong tripartite partnership between the Government, industry and unions.\n“As the global maritime industry embraces new challenges such as digitalisation and decarbonisation, Maritime Singapore must continue to upskill and reskill our workforce so that workers can remain relevant and competitive,” said Mr Chee.\nMr Chee added that PIL’s approach to training will help to attract and retain talent within the firm and in the overall maritime sector.\n“We hope what PIL is doing can serve as a good role model for other companies to also use this tripartite arrangement and stackable micro-credential learning modules to upgrade their employees,” he said.\nPIL employees at the event told The Straits Times that the academy will provide a more targeted approach to maritime training.\nMs Lai Sok Kuan, a senior manager who has been at the firm for a decade, said there is little specialised training in the maritime industry: “There are a lot of external courses that we went for, but they are all generic and don’t cater directly to our company.\n“For example, ship sizes vary from small to large, but PIL only has small to medium-sized ships, and each ship has its own technical specification... For in-house training like PIL Academy, we can tap our own experts to guide us directly.”\nMr Ahmad Dzul Danial, a new hire who is enrolled in the firm’s Management Associate Programme, said that PIL Academy will equip employees with better knowledge and expertise.\n“(It) will enable us to learn more about the entire maritime company, but it’s also specialised in the sense that it’ll help us understand the company’s internal operations and needs.”", "url": "https://www.straitstimes.com/business/companies-markets/s-pore-shipping-firm-pil-launches-academy-to-train-maritime-professionals-groom-new-talent"}