{"authors": [], "date_download": "2024-10-12 13:44:27", "date_modify": "2024-10-12 13:44:27", "date_publish": "2023-08-17 13:42:26", "description": "It is offering 100,000 round-trip economy seats at steep discounts. Read more at straitstimes.com.", "filename": "business_cathay-pacific-to-offer-cheapest-tickets-since-covid-19_1728740667.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/17/FILES-HONGKONG-CHINA-AVIATION-EARNINGS-CATHAY-052800.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_cathay-pacific-to-offer-cheapest-tickets-since-covid-19_1728740667.html", "title": "Cathay Pacific woos travellers with cheapest tickets in more than 3 years", "title_page": "Cathay Pacific woos travellers with cheapest tickets in more than 3 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - Cathay Pacific Airways started selling some of its cheapest tickets in more than 3½ years on Thursday, with 100,000 economy seats being offered at steep discounts.\nThe promotional offer by Hong Kong’s main airline covered more than 30 destinations for travel between January and June 2024. The two-week sale started at 2pm local time, though many customers were left waiting for over an hour. Some were lucky to snap up flights, including a return trip to London for slightly less than the initially advertised promotional price.\nAmong the biggest discounts on offer were flights to London for HK$5,538 (S$960), including taxes and surcharges. Cathay is currently selling tickets to London in the second week of January for HK$12,563 – typical of the inflated prices travellers are paying as the airline rebuilds from Covid-19.\nThe carrier’s revenue over recent months has been buoyed by strong demand, limited supply and high airfares, helping it post its largest first-half profit in 13 years.\nOther destinations on sale included Bangkok, Singapore and Seoul, and long-haul flights to Sydney, Tel Aviv, Amsterdam and Chicago.\nA spokesman said Cathay was running the campaign to tempt travellers to fly more, including to destinations they would not otherwise try, as the airline adds capacity. It will top 70 per cent of pre-Covid-19 capacity by the end of 2023, and fully recover by the end of 2024.\nCathay shares closed at HK$8.56 on Thursday, unchanged from the previous day. BLOOMBERG", "url": "https://www.straitstimes.com/business/cathay-pacific-to-offer-cheapest-tickets-since-covid-19"}