{"authors": [], "date_download": "2024-10-12 14:14:23", "date_modify": "2024-10-12 14:14:23", "date_publish": "2022-03-22 10:10:14", "description": "BEIJING (BLOOMBERG) - China's government said it will step up policy support for the economy and capital market, reiterating earlier vows to shore up battered investor confidence in the face of weaker growth, a slump in property and regulatory crackdowns on technology businesses. Read more at straitstimes.com.", "filename": "business_economy_china-pledges-stronger-policy-support-for-economy-and-markets_1728742463.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/22/AK_chflag_220322.jpg?VersionId=lvXBhIQbocMyrqTq_t9sH8DQsCM.NGxI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_china-pledges-stronger-policy-support-for-economy-and-markets_1728742463.html", "title": "China pledges stronger policy support for economy and markets", "title_page": "China pledges stronger policy support for economy and markets | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (BLOOMBERG) - China's government said it will step up policy support for the economy and capital market, reiterating earlier vows to shore up battered investor confidence in the face of weaker growth, a slump in property and regulatory crackdowns on technology businesses.\nIn a meeting of the State Council chaired by Premier Li Keqiang, the cabinet called for the adoption of monetary policy tools to sustain credit expansion at a stable pace, according to a Xinhua news agency report posted on the central government's website on Monday night (March 21). The authorities also promised to maintain policies that can support the economy, and avoid measures that can hurt sentiment in the capital market.\n\"We should properly handle the problems in the operation of the capital market in accordance with the principle of market and international rules, and create a stable, transparent and predictable development environment for all kinds of market participants,\" according to the report.\nThe statement came about a week after China's top financial policy committee led by Vice Premier Liu He, the country's top economic official, vowed to stabilize the domestic financial markets, ease a regulatory crackdown on property and technology companies and stimulate the economy.\nThe world's second-largest economy has come under mounting pressure since late 2021, with a persistent housing market slump and the latest wave of Covid-19 outbreaks hurting domestic demand.\nOne monetary policy action expected by economists is a reduction in the reserve requirement ratio. The PBOC lowered the ratio in July and December for most banks last year, with both of the cuts first signaled by the premier or the cabinet days in advance.\nThe State Council didn't make specific reference to the RRR when mentioning monetary policy tools, focusing instead on plans to implement about 1 trillion yuan (S$213.5 billion) of tax refunds for smaller firms.\nThe cabinet, however, reiterated caution against flooding the economy with liquidity, saying it will step up support for the real economy with stable monetary policy while using various tools to keep liquidity \"reasonably ample.\"\nChinese banks left borrowing costs unchanged Monday amid some speculation of a cut following Liu He's strong vow last week to support growth. The one and five-year loan prime rates were kept unchanged at 3.7 per cent and 4.6 per cent respectively.\nThe cabinet also pledged on Monday to boost policy coordination and closely \"monitor impact from changes in international situation\" on the domestic capital market, while keeping the exchange rate of its currency \"basically stable at an equilibrium level\", Xinhua reported.", "url": "https://www.straitstimes.com/business/economy/china-pledges-stronger-policy-support-for-economy-and-markets"}