{"authors": [], "date_download": "2024-10-12 14:20:30", "date_modify": "2024-10-12 14:20:30", "date_publish": "2023-11-06 23:30:00", "description": "The reorganisation is known internally as “Project Bora Bora”, according to CNBC. Read more at straitstimes.com.", "filename": "business_banking_citigroup-considering-at-least-10-job-cuts-in-major-businesses-cnbc_1728742830.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/06/2023-09-13T130218Z1358635330RC2O73AJB2KIRTRMADP3CITIGROUP-REORGANIZATION.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking_citigroup-considering-at-least-10-job-cuts-in-major-businesses-cnbc_1728742830.html", "title": "Citigroup considering at least 10% job cuts in major businesses: CNBC report", "title_page": "Citigroup considering at least 10% job cuts in major businesses: CNBC report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BENGALURU - Citigroup’s managers and consultants working on chief executive Jane Fraser’s reorganisation have discussed job cuts of at least 10 per cent in several major businesses, CNBC reported on Monday, citing people with knowledge of the process.\nThe bank has warned of job cuts as part of a sweeping overhaul it unveiled in September, but has said it will estimate the scale of layoffs and cost savings in the current quarter.\nThe reorganisation, known internally as “Project Bora Bora” according to CNBC, is intended to give Ms Fraser more direct control as she seeks to simplify the Wall Street giant and boost its stock price.\nThe discussions are at an early stage and the number of people axed could change, CNBC said, adding that the lender had hired Boston Consulting Group for the plan.\nMs Fraser’s push to eliminate regional managers, co-heads and others with overlapping roles will translate into job cuts beyond 10 per cent for executives, the report said.\nIn October, Citi said it would cut management layers from 13 to eight.\nIn the two top layers of leadership, 15 per cent of functional roles were reduced and 60 committees were eliminated, it said.\nThe bank’s global headcount has stayed at 240,000 in 2023, it disclosed in its latest quarterly supplement in October.\n“As we’ve said previously, we are committed to delivering the full potential of the bank and meeting our commitments to our stakeholders,” a spokesperson for the bank said, while declining to comment if it had hired Boston Consulting Group.\n“We’ve acknowledged the actions we’re taking to reorganise the firm involve some difficult, consequential decisions, but they’re the right steps to align our structure to our strategy and deliver the plan we shared at our 2022 Investor Day.”\nSince taking charge of the banking giant in 2021, Ms Fraser has tried to improve profits, streamline the bank and fix regulatory problems. Its stock, however, has still lagged behind peers. REUTERS", "url": "https://www.straitstimes.com/business/banking/citigroup-considering-at-least-10-job-cuts-in-major-businesses-cnbc"}