{"authors": [], "date_download": "2024-10-12 13:35:44", "date_modify": "2024-10-12 13:35:44", "date_publish": "2024-08-28 09:50:00", "description": "This raises a potential hurdle for Alimentation Couche-Tard’s buyout proposal to proceed. Read more at straitstimes.com.", "filename": "business_seven-i-seeks-government-protection-after-499-billion-approach_1728740144.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/28/2024-08-19T083405Z398792958RC2WI9APWUR7RTRMADP3SEVEN-I-M-A-COUCHETARD.JPG?VersionId=s5dcxpWK3B4WNnqN6c0raSw0W8ZJJG7x", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_seven-i-seeks-government-protection-after-499-billion-approach_1728740144.html", "title": "7-Eleven’s Japanese owner seeks government protection after $49.9 billion approach", "title_page": "7-Eleven’s Japanese owner seeks government protection after $49.9 billion approach | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Seven & i Holdings wants the Japanese government to require prior notification of any purchase of its shares above 10 per cent, people familiar with the matter said, raising a potential hurdle for Alimentation Couche-Tard’s buyout proposal to proceed.\nThe Japanese operator of 7-Eleven stores is seeking designation as a “core” company under the Foreign Exchange and Foreign Trade Act, an upgrade from its current “non-core” status under the law, said the people, asking not to be identified because the information is not public.\nJapan’s Ministry of Finance would have to vet any entity seeking to acquire more than 10 per cent of a company considered part of a core industry, which includes sectors such as aerospace, nuclear energy and rare earths. The law was designed to protect the country from security risks, such as the outflow of military technology.\nThe Japanese operator of 7-Eleven stores made the application after Couche-Tard approached the company last week, one of the people said. Seven & i’s effort to invoke governmental oversight of Couche-Tard’s proposal reflects the retailer’s wariness toward the approach, which comes after years of activist investor criticism that its assets are undervalued.\nIt is not clear whether the ministry and other relevant government agencies will approve Seven & i’s application to become a core company under the law, one person said. Under the company’s current non-core category, a takeover effort would require approval only after an agreed deal.\nThe Finance Ministry did not immediately respond to an e-mailed request for comment. A representative for Seven & i referred to a prior statement, saying that no decisions have been made, and added that “a special committee of independent outside directors is currently reviewing the proposal”.\nIn its application to become a “core” company, Seven & i is arguing that its convenience stores play a critical role in supplying food and supplies in the event of natural disasters, the people said. They also provide municipal services, allowing residents to obtain official documents.\nCouche-Tarde has not provided terms or a price for its proposed buyout of Seven & i, which has a market value of 5.53 trillion yen (S$49.9 billion). If successful, it would be the largest takeover of a Japanese company, and a rare example of inbound cross-border acquisitions. Although Japan’s government has taken a protectionist stance in the past, new corporate guidelines aimed at injecting more vigour into corporate Japan through improved governance and protections for investors are making such deals more likely.\nThe Foreign Exchange and Foreign Trade Act has foiled deals in the past. In 2008, for example, concerns over power supply and nuclear energy led Japan to block the London-based Children’s Investment Fund from buying shares in Electric Power Development, known as J-Power. BLOOMBERG", "url": "https://www.straitstimes.com/business/seven-i-seeks-government-protection-after-499-billion-approach"}