{"authors": [], "date_download": "2024-10-12 13:35:55", "date_modify": "2024-10-12 13:35:55", "date_publish": "2024-09-15 16:59:00", "description": "The transaction could value the visa outsourcing and technology services firm at about $9.1 billion. Read more at straitstimes.com.", "filename": "business_temasek-said-to-near-stake-purchase-in-blackstone-owned-vfs-sources_1728740155.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/15/IMGL6251EFBD82.jpg?VersionId=BtRoyHrzw8mhygWD9WkK7SDKJlnctgiP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_temasek-said-to-near-stake-purchase-in-blackstone-owned-vfs-sources_1728740155.html", "title": "Temasek said to near stake purchase in Blackstone-owned VFS Global: Sources", "title_page": "Temasek said to near stake purchase in Blackstone-owned VFS Global: Sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Temasek Holdings is nearing a deal to buy a significant minority stake in VFS Global, according to people familiar with the matter, a transaction that could value the visa outsourcing and technology services firm at about US$7 billion (S$9.1 billion) including debt.\nThe Singapore state-owned investor is poised to acquire about 20 per cent in closely held VFS, which is controlled by US alternative asset manager Blackstone, the people said, asking not to be identified because the deliberations are private. Temasek and Blackstone are hammering out the details of a deal that could be announced as soon as Sept 16, the people said.\nBlackstone will remain the majority shareholder in VFS after the transaction, the people said. Considerations are ongoing and no final decisions have been made, they added.\nRepresentatives for Blackstone and Temasek declined to comment.\nBlackstone has been weighing options including a full or partial sale in VFS after receiving interest from investors such as sovereign wealth funds, Bloomberg News reported on Sept 13. One of the options included bringing in a minority investor to help raise cash and boost growth, the people had said.\nVFS Global, headquartered in Zurich and Dubai, provides governments with administrative solutions for processing passport applications and visa consular services, according to its website. It was founded in 2001 by Zubin Karkaria, who is also its chief executive officer. It has processed more than 294 million applications since inception, and about 141 million biometric enrolments since 2007.\nBlackstone bought a majority stake in VFS from EQT AB for an undisclosed amount in 2022, with the Swedish investor retaining a minority stake in the business along with the Kuoni and Hugentobler Foundation.\nTemasek’s net portfolio value reached $389 billion as at March, up from $382 billion a year earlier. Its investments include both publicly traded and closely held assets globally.\nVFS has a large presence in India, where it provides visa application services for the US consulate across cities in the country.\nGlobal investors have been increasing their focus on India, lured by its rapid economic growth. That’s turned the country into a hotspot for deal-making. Blackstone is aiming to add an additional US$25 billion of Indian private equity assets over the next five years, its head of private equity in Asia, Amit Dixit, said in March.\nTemasek has deployed nearly US$37 billion in India over the past two decades, according to Mr Vishesh Shrivastav, its managing director for India investments. That figure is set to rise sharply, with the company saying in 2023 it planned to commit billions more.\nTemasek has been targeting minority stakes and helping Indian companies to grow from there, largely eschewing the trend of taking majority holdings in firms based in the world’s most populous country. Core areas include digitisation, consumption and sustainable living, according to Mr Shrivastav.\nBLOOMBERG", "url": "https://www.straitstimes.com/business/temasek-said-to-near-stake-purchase-in-blackstone-owned-vfs-sources"}