{"authors": [], "date_download": "2024-10-12 14:13:48", "date_modify": "2024-10-12 14:13:48", "date_publish": "2022-07-11 18:11:49", "description": "Development may encourage investors to take tougher stance against other developers battered by China's property debt crisis. Read more at straitstimes.com.", "filename": "business_property_evergrande-risks-first-local-bond-default-as-delay-rejected_1728742428.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/11/sv_Evergrande_110722.jpg?VersionId=EcolDdJtq69cosh97Le4dnSGA7.TRuf7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_evergrande-risks-first-local-bond-default-as-delay-rejected_1728742428.html", "title": "Evergrande risks first local bond default as delay rejected", "title_page": "Evergrande risks first local bond default as delay rejected | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (BLOOMBERG) - China Evergrande Group suffered its first rejection from local creditors to extend a bond payment, a development that may result in a landmark onshore default and encourage investors to take a tougher stance against other developers battered by the nation's property debt crisis.\nHolders of a puttable renminbi-denominated bond from the firm's main onshore unit Hengda Real Estate Group rejected a plan to further extend payment past a July 8 deadline by six months, according to a Shenzhen stock exchange filing on Monday.\nThe company had held a meeting last week to seek creditor approval, but more than 90 per cent of the voting holders rejected the proposed extension.\nA credit crunch at the Chinese property giant roiled markets last year as the authorities embarked on a sweeping clampdown of the nation's debt-saddled real estate sector.\nIf Evergrande fails to repay the local bond, it could mark the developer's first official delinquency on a domestic note, after it defaulted on dollar-bond payments in December.\n\"This is the first time it failed to extend an onshore bond and will constitute a default,\" said Mr Li Kai, CIO at Beijing Shengao Private Equity Fund Management.\n\"It will create a new path for restructuring and will have implications in pricing of real estate bonds especially extended bonds. We expect more onshore defaults from here.\"\nDeveloper shares slumped as much as 3 per cent on Monday, the most since June 13, according to a Bloomberg Intelligence gauge, while China's high-yield dollar junk notes fell 0.5 to 1 cent on the dollar.\nEvergrande did not immediately have any comment when asked about the extension failure.\nThe local note in question is a 4.5 billion yuan (S$941 million) security due in 2023 with a put option for investors to seek early repayment.\nThe security does not have a grace period, according to its offering circular.\nThe developer had in January avoided what would have been its first default on a public onshore bond by obtaining investor backing to delay early repayment on the note for six months.\nEvergrande has so far avoided missing payments on its local bonds by securing delays on its deadlines.\nThe unit had said last week that it was seeking the further delay to Jan 8 next year, when the bond is set to mature.\nBoth onshore and offshore investors are closely watching what could be one of the nation's biggest debt restructurings, as they prepare for a lengthy battle over who gets paid from what remains. Evergrande has more than US$300 billion (S$421 billion) in liabilities.\nEvergrande had previously said it aims to provide creditors with a preliminary overhaul proposal by the end of July.\nThe real estate giant said last month that it was actively pushing forward with the restructuring work.\nOn the onshore bond, Hengda said that it will actively negotiate with bondholders to reach a plan.\n\"Evergrande needs to talk with holders and improve its plan,\" according to Bloomberg Intelligence analyst Daniel Fan.\nThe developer may also move to ring-fence its offshore assets for its overseas bondholders in an attempt to forestall possible legal action, he said.", "url": "https://www.straitstimes.com/business/property/evergrande-risks-first-local-bond-default-as-delay-rejected"}