{"authors": [], "date_download": "2024-10-12 13:54:28", "date_modify": "2024-10-12 13:54:28", "date_publish": "2024-04-09 08:29:00", "description": "The 2018 car crash killed an Apple engineer after his Model X, operating on Autopilot, swerved off a highway near San Francisco. Read more at straitstimes.com.", "filename": "business_tesla-settles-over-fatal-autopilot-crash-on-eve-of-trial_1728741268.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/09/2024-03-12T040027Z1802936671RC23K6AHOV9MRTRMADP3AUTOS-SAFETY-ADAS-INSURANCE.JPG?VersionId=5POQk7PNC_2BE70ZZGOReAPZHNdT.S_.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_tesla-settles-over-fatal-autopilot-crash-on-eve-of-trial_1728741268.html", "title": "Tesla settles over fatal Autopilot crash on eve of trial", "title_page": "Tesla settles over fatal Autopilot crash on eve of trial | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAN FRANCISCO - Tesla reached a settlement on the eve of its highest-profile trial yet over a crash blamed on Autopilot, the driver-assistance system Mr Elon Musk has billed as crucial to his pursuit of self-driving cars, according to court filings.\nTerms of the settlement were not disclosed in filings made public on April 8 in state court in San Jose, California.\nThe trial that was set to kick off this week centred on Mr Walter Huang, a 38-year-old Apple engineer who was killed on the way to work in 2018 when his Model X veered off the highway and slammed into a roadside barrier at about 110kmh.\nA US federal safety agency’s investigation of the accident found that Mr Huang was probably distracted with a video game app on his phone, while also pointing to “limitations” with the Autopilot system.\nThe electric vehicle maker prevailed in two previous trials in California after juries found the accidents, one fatal and one not, were due to driver error rather than the company’s technology.\nEach of the trials – and more that are scheduled in coming months in California and Florida – clash with Mr Musk’s mantra that Teslas are the safest cars ever made.\nMr Musk has touted fully autonomous driving as the way of the future for 10 years – and has frequently predicted his engineers were on the cusp of mastering the technology. That has triggered false advertising claims against Tesla by consumers, as well as civil and criminal government investigations.\nTesla has also faced increasing regulatory scrutiny over the safety of Autopilot and the company’s more sophisticated system, Full Self-Driving, including multiple investigations into alleged defects.\nIn December, Tesla rolled out over-the-air software updates for more than two million vehicles after the National Highway Traffic Safety Administration said Autopilot does not do enough to guard against misuse.\nMr Huang’s widow and children claimed in their lawsuit that he believed his 2017 Model X “was safer than a human-operated vehicle”, but that it failed to perform as it should have.\nThe family alleged that the Autopilot software became confused and caused the car to swerve out of its lane because it had not been trained to detect barriers in areas where one highway merges with another.\nLawyers for the Huangs were also expected at the trial to make a bigger point that Mr Musk, as the face of Tesla, has for years aggressively promoted Autopilot to the public as better than human drivers despite its limitations.\nThey claimed the marketing of the driving-assistance features set “reasonable expectations” among consumers – even if they did not understand the technology – that the system would not affirmatively steer their cars into barriers or fail to deploy emergency braking.\nTesla argued the sole cause of the crash was Mr Huang’s “highly extraordinary misuse of his vehicle and its Autopilot features” so that he could play a video game while driving.\nThe company contended that Mr Huang knew Autopilot did not make his Model X autonomous, but chose during morning rush-hour traffic to play Sega’s Total War: Three Kingdoms.\nDuring the 19 minutes he was driving in Autopilot mode before he crashed, Mr Huang’s hands were not detected on the steering wheel 34 per cent of the time, including the final six seconds, Tesla has said in court filings.\nTesla’s website describes Autopilot as “an advanced driver assistance system that enhances safety and convenience behind the wheel”.\nThe company says that Autopilot enables its vehicles to steer, accelerate and brake automatically, but that the system’s features require “active driver supervision and do not make the vehicle autonomous”.\nTesla and a spokesperson for the Huang family’s lawyers did not immediately respond to requests for comment. BLOOMBERG", "url": "https://www.straitstimes.com/business/tesla-settles-over-fatal-autopilot-crash-on-eve-of-trial"}