{"authors": [], "date_download": "2024-10-12 14:12:10", "date_modify": "2024-10-12 14:12:10", "date_publish": "2023-10-02 11:07:00", "description": "Hui Ka Yan is suspected of transferring assets offshore while Evergrande struggles to complete unfinished projects. Read more at straitstimes.com.", "filename": "business_evergrande-chairman-being-investigated-over-asset-transfers-abroad-wsj_1728742330.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/02/FILES-CHINA-ECONOMY-EVERGRANDE-XU-065532.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_evergrande-chairman-being-investigated-over-asset-transfers-abroad-wsj_1728742330.html", "title": "Evergrande chairman being investigated over asset transfers abroad: WSJ", "title_page": "Evergrande chairman being investigated over asset transfers abroad: WSJ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BENGALURU – China Evergrande Group founder and chairman Hui Ka Yan is being investigated on suspicion of transferring assets offshore while the indebted property developer struggles to complete unfinished projects, the Wall Street Journal reported on Monday.\nEvergrande has been working to get creditors’ approval to restructure its offshore debt, but the process grew more complicated last week when the company said it could not issue new debt due to an investigation into its main China unit.\nAdding to the embattled developer’s woes, it said on Friday that its chairman was under police watch and was suspected of committing unspecified crimes.\nReuters reported last week that a group of offshore creditors was planning to join a court petition to liquidate the developer if it did not submit a new debt restructuring plan by the end of October.\nEvergrande did not immediately respond to a Reuters request for comment during week-long National Day holidays.\nWith more than US$300 billion (S$410.7 billion) in liabilities, Evergrande has become the poster child of a debt crisis in China’s property sector, which contributes to roughly a quarter of the economy.\nTrading in the shares of Evergrande and two of its units was suspended on Thursday after the media reported that Mr Hui had been taken away by police and was being monitored at a designated location. REUTERS", "url": "https://www.straitstimes.com/business/evergrande-chairman-being-investigated-over-asset-transfers-abroad-wsj"}