{"authors": [], "date_download": "2024-10-12 13:27:27", "date_modify": "2024-10-12 13:27:27", "date_publish": "2024-03-07 20:59:00", "description": "GENEVA - International patent filings declined in 2023 for the first time in 14 years due to higher interest rates and economic uncertainty, the UN said on March 7, with India among the few countries bucking the trend. Read more at straitstimes.com.", "filename": "business_global-patent-filings-fall-for-first-time-in-14-years-un_1728739647.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/07/mddaren10092022.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_global-patent-filings-fall-for-first-time-in-14-years-un_1728739647.html", "title": "Global patent filings fall for first time in 14 years: UN", "title_page": "Global patent filings fall for first time in 14 years: UN | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GENEVA - International patent filings declined in 2023 for the first time in 14 years due to higher interest rates and economic uncertainty, the UN said on March 7, with India among the few countries bucking the trend.\nA total of 272,600 international patents were filed in 2023, marking a 1.8 per cent decline from a year earlier, the United Nations’ World Intellectual Property Organisation (Wipo) said in its annual overview.\n“We believe that this reflects the currently adverse environment for innovation and entrepreneurial activity,” its chief economist Carsten Fink told reporters in Geneva.\nEconomic uncertainties and especially higher interest rates last year were seen as key reasons for the decline.\nHowever, Mr Fink stressed, the decline should be seen as “a cyclical phenomenon”.\n“We think that IP filings will pick up again once the external environment improves.”\nWipo director-general Daren Tang agreed, noting that likely declining inflation rates could provide more business confidence and innovation investments, “setting the stage for a recovery in international IP filings later this year”.\n“Despite these shorter-term dips, longer-term trends show IP use rising steadily in an increasingly global, digitalised economy and spreading across the globe as economies around the world develop,” he said in a statement.\nSurging growth in India\nWipo’s complex system of registering international patents involves multiple categories, including global trademarks and design filing systems.\nIn the main category, the Patent Cooperation Treaty (PCT), China continued to top the rankings, with 69,610 filings, slipping 0.6 per cent from 2022.\nThat marked the first year-on-year decrease from China since 2002, Wipo said.\nThe United States, meanwhile, remained in second place in 2023 with 55,678 filings, marking a far steeper decline of 5.3 percent from a year earlier.\nChina and the US were followed by Japan, South Korea and Germany, with South Korea the only country in the top five whose patent applications inched up last year, rising 1.2 per cent at 22,288 filings.\nIndia posted the biggest growth, with its international patent filings surging 44.6 percent to 3,791.\nWipo said that followed a 25.9 per cent hike a year earlier.\nAnd the upward trend is likely to continue.\nMr Fink said that in a country of nearly 1.5 billion people, “there is of course still tremendous growth opportunity” in India.\nAmong the few other countries that showed growth was Turkey, enjoying an 8.5 per cent increase, the Netherlands was up 5.8 per cent and France was up two per cent.\nWipo’s report showed Asia represented 55.7 per cent of all filings last year, up from just over 40 per cent a decade earlier.\nAs for companies, China-based telecoms giant Huawei Technologies again topped the ranking, with 6,494 international patent filings to its name in 2023.\nIt was followed by South Korea’s Samsung Electronics, US firm Qualcomm, Japan’s Mitsubishi Electric and BOE Technology of China.\nComputer technology accounted for the largest share of published PCT applications, making up 10.2 per cent of all filings, followed by digital communication and electrical machinery. AGENCE FRANCE-PRESSE", "url": "https://www.straitstimes.com/business/global-patent-filings-fall-for-first-time-in-14-years-un"}