{"authors": [], "date_download": "2024-10-12 13:35:56", "date_modify": "2024-10-12 13:35:56", "date_publish": "2024-08-20 08:29:00", "description": "Mr Masatoshi Ito's descendents are the second-largest shareholders of Seven & i. Read more at straitstimes.com.", "filename": "business_7-eleven-billionaire-heirs-would-see-big-payday-from-shock-offer_1728740156.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/2017-06-16T120000Z1769343147MT1IMGCN2017061631219RTRMADP3CHINA-CHENGDU-ITO-YOKADO-20TH-ANNIVERSARY.JPG?VersionId=U7WHzb6ZlMRqO9yvk_aT7Ee3UNTDJerN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_7-eleven-billionaire-heirs-would-see-big-payday-from-shock-offer_1728740156.html", "title": "7-Eleven billionaire heirs would see big payday from shock offer", "title_page": "7-Eleven billionaire heirs would see big payday from shock offer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – The billionaire family behind Seven & i Holdings, owner of 7-Eleven convenience stores, is poised for a massive payday if it supports what would be the biggest foreign takeover of a Japanese company.\nThe descendants of the late Mr Masatoshi Ito are the second-largest shareholders of Seven & i, with an 8.1 per cent stake worth US$3.1 billion (S$4.1 billion) through their family vehicle, according to the company’s annual report.\nCanadian convenience store operator Alimentation Couche-Tard confirmed that it has made a “friendly, non-binding proposal” to Seven & i, which had a stock market value of about US$38 billion as at Aug 19’s close in Tokyo.\nIt is not clear if the Ito clan supports the deal, and they may be unwilling to part with their family legacy, said Mr Michael Causton, co-founder of Tokyo-based JapanConsuming, a research firm focused on the Japanese retail and consumer sector.\n“Seven & i is a Japanese institution and a part of Japan’s corporate establishment,” he said. “Selling to a foreign company, and one that is a competitor in North America, is extremely unlikely.”\nA successful deal would also mark a rare exit by a billionaire family in Japan, where founders in many sectors stepped back from day-to-day management of their publicly listed enterprises decades ago but still hold on to their shares.\nThe Ito clan’s stake is already worth US$866 million more on paper, after Seven & i shares jumped a record 23 per cent on Aug 19 in Tokyo. That gives the company a market value of 5.63 trillion yen (S$50.3 billion).\nThe Japanese group’s founder died in 2023 at the age of 98 with a net worth of US$5 billion, according to the Bloomberg Billionaires Index. His son Junro Ito is an executive vice-president and sits on the board.\nCouche-Tard founders Alain Bouchard and Jacques D’Amours also built 10-figure fortunes from the convenience store business, with net worths of US$7.9 billion and US$3.9 billion respectively, according to Bloomberg’s wealth index.\nThe company has grown from a single suburban Montreal location opened by Mr Bouchard in 1980 to more than 16,700 stores globally via a deal spree that has seen it snap up rivals, including US chain Circle K.\nActivist pressure\nThe late Mr Masatoshi Ito, who was born in 1924, expanded and transformed his small family-owned shop into one of Japan’s largest retailers and took 7-Eleven convenience stores global.\nSometimes called the Sam Walton of Japan, Mr Masatoshi Ito was known for a decentralised business style that was influenced by his long friendship with famed management consultant Peter Drucker, who once described Mr Ito as “one of the world’s outstanding entrepreneurs and business builders”.\nThe company’s empire now spans 85,000 convenience stores, gas stations and retail outlets worldwide.\nMr Causton said it also plays an outsized role in Japan, offering essential services, including food and water delivery in times of calamities such as earthquakes.\n“Seven & i is more than just a retailer; it is part of the backbone of Japanese emergency response services,” he said. “So I don’t see government being supportive of a foreign takeover in this case.”\nUntil recently, the firm was forging takeovers of its own. In 2020, Seven & i agreed to buy about 3,900 Speedway gas stations and stores from US-based Marathon Petroleum for US$21 billion, at the time its biggest-ever deal.\nSeven & i has come under pressure from activist fund ValueAct Capital Management over perceptions that its assets could be worth more, and to narrow its focus to 7-Eleven stores.\nForeign takeovers of Japanese companies are extremely rare, but recent changes in guidelines for mergers, as well as activist investors pushing companies to boost value, could open the door to a deal that would create a global convenience-store behemoth.\nHeirs of Mr Masatoshi Ito own the majority of their Seven & i shares through an investment vehicle that does not disclose individual ownership. Mr Masatoshi Ito and his wife Nobuko had three children – Yasuhisa, Hisako and Junro. BLOOMBERG", "url": "https://www.straitstimes.com/business/7-eleven-billionaire-heirs-would-see-big-payday-from-shock-offer"}