{"authors": [], "date_download": "2024-10-12 14:17:47", "date_modify": "2024-10-12 14:17:47", "date_publish": "2023-06-27 08:01:14", "description": "The biggest winners are players already at the top, like BYD and Tesla, which have been consolidating their power. Read more at straitstimes.com.", "filename": "business_china-s-electric-vehicle-bubble-starting-to-deflate_1728742667.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/27/2023-05-08T011001Z1158909605RC2IN0AY4ZQMRTRMADP3CHINA-SUVS-PRICING_0.JPG?VersionId=E_gtq7VqGxG_E4LAjJ2kc_l3zCCuqT5X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-electric-vehicle-bubble-starting-to-deflate_1728742667.html", "title": "China’s electric vehicle bubble starting to deflate", "title_page": "China’s electric vehicle bubble starting to deflate | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – The world’s largest electric vehicle (EV) market is putting its crowded infancy stage behind it.\nThe explosive industry in China – supercharged by government subsidies more than a decade ago – now spans about a hundred manufacturers churning out pure-electric and plug-in hybrid models. While that is down from roughly 500 registered EV makers in 2019, the end now looks to be in sight for scores more.\nThe cut-throat market formally transitioned from overcrowded to moderately concentrated in the first quarter, based on the Herfindahl-Hirschman Index, a metric used by academics and regulators to evaluate competition and measure market concentration. The biggest winners are players already at the top, like BYD and Tesla, which have been consolidating their power.\nAccording to Mr Wang Hanyang, an auto analyst at Shanghai-based 86Research, “80 per cent of the new-energy vehicle start-ups, if we count all of them since the initial subsidies, have exited or are exiting the market”.\nThis is not good news for struggling players like Nio, whose sales have been tumbling and which said last week that the government of Abu Dhabi is taking a 7 per cent stake following a capital infusion. Just two short years ago, Nio founder and chief executive William Li was being mobbed by fans at customer gala dinners and the company was riding high after already escaping one near-death experience, fixed by a large financial injection from the municipal government of Hefei.\nThe Herfindahl-Hirschman Index shows a clear consolidation trend over the past several years, winnowing the initial surge of new players that emerged when China first rolled out plans to support cleaner-energy vehicles with state subsidies and other sweeteners.\nThe squeeze has only intensified over time, with dominant players strengthening their positions and smaller firms struggling to survive. The market share by unit sales for the top four players rose to 60 per cent in the first quarter of 2023, compared with 44 per cent in the same period three years ago.\nWhile China has extended a tax break for consumers buying new-energy vehicles to 2027, all signs are that the government will not continue to prop up troubled carmakers. The consolidation push from market forces and regulatory mechanisms will help make the surviving brands competitive internationally, said Ministry of Industry and Information Technology official Xin Guobin.\nBYD, backed by billionaire Warren Buffett’s Berkshire Hathaway, has witnessed its domination surge over the past two years. More than one in three new-energy vehicles sold in China today are from the company, up from less than 15 per cent in late 2020 when the clean-car market first started steadily selling more than 100,000 units every month.\nIts success is squeezing even the market’s No. 2 player, Tesla, which gradually lost share for the past two years until a breakthrough in the first quarter. Now it is poised to grab about 11 per cent of the pie, giving the two leaders nearly half of the market.\nMeanwhile, some of the industry’s early crown jewels have silently disappeared. Many early electric vehicles were built mainly to qualify for subsidies and meet regulatory requirements, and often did not offer high-quality design and performance.\n“We call them regulation cars,” said Mr Jochen Siebert at JSC Automotive, a car consulting firm in Singapore, referring to the vehicles mostly sold to fleets and that were designed to meet fuel consumption rules and garner new-energy credits and other subsidies. “The only important thing was that they had to be an EV.”\nDemand for those vehicles started to fade once requirements increased, competitors emerged and the fleet market became saturated.\nBut the market is by no means easy for carmakers trying to lure customers rather than meet regulatory rules.", "url": "https://www.straitstimes.com/business/china-s-electric-vehicle-bubble-starting-to-deflate"}