{"authors": [], "date_download": "2024-10-12 14:18:33", "date_modify": "2024-10-12 14:18:33", "date_publish": "2024-05-09 11:36:00", "description": "Huawei’s resurgence in the high-end smartphone market amid US sanctions is being widely watched by US politicians. Read more at straitstimes.com.", "filename": "business_huawei-s-new-phone-uses-more-china-made-parts-memory-chip_1728742713.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/09/2024-05-09T020307Z1130715419RC2D97AJ2XS7RTRMADP3HUAWEI-CHINA-PHONE.JPG?VersionId=IpjJ3t8wigJFL_jDcc1KYRCWKv7pWoAW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_huawei-s-new-phone-uses-more-china-made-parts-memory-chip_1728742713.html", "title": "Huawei’s new phone uses more China-made parts, memory chip", "title_page": "Huawei’s new phone uses more China-made parts, memory chip | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHENZHEN – Huawei’s latest high-end phone features more Chinese suppliers, including a new flash memory storage chip and an improved chip processor, a teardown analysis showed, pointing to the progress China is making towards technology self-sufficiency.\nOnline tech repair company iFixit and consultancy TechSearch International examined the inside of Huawei Technologies’ Pura 70 Pro for Reuters, finding a Nand memory chip they said was likely packaged by the Chinese telecoms equipment maker’s in-house chip unit HiSilicon and several other components made by Chinese suppliers.\nThese findings have not been previously reported.\nHuawei’s resurgence in the high-end smartphone market after four years of US sanctions is being widely watched by both rivals and US politicians as it has become a symbol of growing US-China trade frictions and China’s bid for technology self-sufficiency.\nThe firms also found that the Pura 70 phones run on an advanced processing chipset made by Huawei called the Kirin 9010 that is likely only a slightly improved version of the Chinese-made advanced chip used by Huawei’s Mate 60 series.\n“While we cannot provide an exact percentage, we’d say the domestic component usage is high, and definitely higher than in the Mate 60,” said Mr Shahram Mokhtari, iFixit’s lead teardown technician.\n“This is about self-sufficiency, all of this, everything you see when you open up a smartphone and see whatever (is) made by Chinese manufacturers, this is all about self-sufficiency,” Mr Mokhtari said.\nHuawei declined to comment.\nHuawei launched the Pura 70’s four smartphone models in late April and the series quickly sold out. Analysts say it will likely take more market share from iPhone manufacturer Apple, while policymakers in Washington are questioning the efficacy of US curbs on the telecoms equipment giant.\nChina-made flash memory chip\nEarlier analysis by teardown firms such as TechInsights of the Mate 60, launched in August 2023, found the phone to be using Dram and Nand memory chips made by South Korea’s SK Hynix. SK Hynix said at the time it no longer did business with Huawei and analysts said the chips likely came from stockpiles.\nThe Pura 70 still contains a Dram chip made by SK Hynix, iFixit and TechSearch found, but the Nand flash memory chip was likely packaged by Huawei’s HiSilicon unit this time around and was made up of Nand dies each with a capacity of 1 terabit. This is comparable to products made by major flash memory producers such as SK Hynix, Kioxia and Micron.\nHowever, the firms were unable to definitively identify the manufacturer of the wafer as the markings on the Nand die were unfamiliar, they added. But iFixit added that it believed that HiSilicon may have produced the memory controller as well.\n“In our teardown our chip ID expert has identified it as a particular HiSilicon chip,” Mr Mokhtari said.\nSK Hynix reiterated that it was “strictly complying with the relevant policies since the restrictions against Huawei were announced and has also suspended any transactions with the company since then”.\nIncremental improvements\nIFixit and TechSearch’s analysis of the processor used by the Pura 70 Pro also suggests Huawei may have made only incremental improvements in its ability to produce an advanced chip with Chinese partners in the months since it launched the Mate 60 series.\nThe processor is similar to the one employed in the Mate 60 series that was produced for Huawei by Semiconductor Manufacturing International Corp (SMIC) using the Chinese chip foundry’s 7 nanometer (nm) N+2 manufacturing process, they said.\n“This is significant because news of the 9000S on a 7nm node caused a bit of a panic last year when US lawmakers were confronted with the possibility that the sanctions imposed on Chinese chipmakers might not slow their technological progress after all,” iFixit said.\n“The fact that the 9010 is still a 7nm process chip, and that it’s so close to the 9000S, might seem to suggest that Chinese chip manufacturing has indeed been slowed.”\nStill, he cautioned against underestimating Huawei, saying that SMIC was still expected to make a leap to a 5nm manufacturing node before the end of the year.\nSMIC did not respond to a request for comment. REUTERS", "url": "https://www.straitstimes.com/business/huawei-s-new-phone-uses-more-china-made-parts-memory-chip"}