{"authors": [], "date_download": "2024-10-12 13:47:07", "date_modify": "2024-10-12 13:47:07", "date_publish": "2024-04-21 18:40:00", "description": "Analysts estimate between 30,000 and 35,000 jobs could go globally. Read more at straitstimes.com.", "filename": "business_banking_5-waves-of-ubs-layoffs-to-start-in-june-swiss-newspaper-says_1728740827.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/21/2024-04-18T113014Z1007738302RC2HXZ9JHY23RTRMADP3UBS-CHINA-LAYOFFS.JPG?VersionId=b2FpuZ2ZK1_PyldAEkzbAULQpZjTyh2O", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking_5-waves-of-ubs-layoffs-to-start-in-june-swiss-newspaper-says_1728740827.html", "title": "5 waves of UBS layoffs to start in June, says Swiss newspaper", "title_page": "5 waves of UBS layoffs to start in June, says Swiss newspaper | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VIENNA – Layoffs under Swiss banking giant UBS’ cost-cutting programme announced after its takeover of Credit Suisse will take place in five waves in 2024 starting in June, newspaper SonntagsZeitung reported on April 21.\nUBS declined to comment.\nIn August, UBS announced its plan to eliminate around one in 12 of its Swiss jobs and cut costs by more than US$10 billion (S$14 billion) as it consolidates a competitor that unravelled as panicked customers withdrew billions from their accounts.\nMost of the cost savings are set to come from cutting staff, and analysts have estimated between 30,000 and 35,000 jobs could go globally.\n“In total, 50 to 60 per cent of ex-CS (Credit Suisse staff) will probably be laid off over the five rounds,” SonntagsZeitung quoted a source it described as an insider as saying.\nAfter the first round in June, in which 25 to 30 per cent of former Credit Suisse staff are expected to be made redundant, the next rounds will take place in August, September, October and November, the newspaper reported, putting the planned savings at 12 billion Swiss francs (S$18 billion). REUTERS", "url": "https://www.straitstimes.com/business/banking/5-waves-of-ubs-layoffs-to-start-in-june-swiss-newspaper-says"}