{"authors": [], "date_download": "2024-10-12 14:13:46", "date_modify": "2024-10-12 14:13:46", "date_publish": "2022-10-11 10:13:07", "description": "Goldman Sachs sees HK home prices plummeting 30% in 2023 from last year's levels. Read more at straitstimes.com.", "filename": "business_property_hong-kong-property-market-tumbling-as-unsold-homes-pile-up_1728742426.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/11/AK_hksl_111022.jpg?VersionId=m6v_.gRIZmJOcqV.lOvyt_YAww0Hf6_X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_hong-kong-property-market-tumbling-as-unsold-homes-pile-up_1728742426.html", "title": "Hong Kong property market tumbling as unsold homes pile up", "title_page": "Hong Kong property market tumbling as unsold homes pile up | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - On a recent Saturday, more than 100 salespeople swarmed the floors of a luxury shopping mall in Hong Kong, haranguing shoppers to check out deals at one of the city's latest residential projects.\nOne Innovale - Bellevue, built by Henderson Land Development, priced its first batch of apartments 9 per cent lower than the nearby second-hand homes in New Territories, about 40km from the central financial district. But the response has been below par since its launch last month, with about a third remaining unsold as at the first week of October.\nIt is even worse for others. At the end of the first day on sale, a 139-unit development failed to move a single unit - rare for a city where projects get snapped up within hours in a robust market. Another widely advertised project found buyers for only two units throughout the day, according to sales records.\n\"We are fighting for fewer customers due to concerns about interest rates,\" said realtor Sam Wong. \"Everyone is competing to be cheaper.\"\nThe sliding demand shows how a city at the forefront of a global property downturn is bracing for an even deeper slump in the coming months as interest rates rise.\nHigher borrowing costs are weighing on an economy already battered by population outflow, Covid-19 curbs and political turmoil caused by Beijing's tightening control.\nGoldman Sachs sees home prices plummeting 30 per cent in 2023 from last year's levels, while Jefferies Group predicts further declines after an 8 per cent drop this year. The secondary market is approaching a five-year-low.\nReal estate has remained at the centre of Hong Kong's economy, mainly through wealth created by high valuations - a result of the territory's scarce land resources. Seven of the city's 10 richest home-grown tycoons had their fortunes built on property. Home ownership is an important indicator of success for Hong Kong's residents, who have considered it a safe bet after a two-decade bull run. A declining market is threatening to dent that sense of well-being, which could indirectly weigh on spending.\nThe latest data from the Hong Kong Monetary Authority (HKMA) - which has raised benchmark rates five times this year - showed that mortgage loans approved in July dropped 22.1 per cent from June, and declined 3.9 per cent in August month on month. Those financing secondary-market transactions, in particular, plummeted 30.3 per cent in July and 11.1 per cent more in August.\nHawkish signals from United States Federal Reserve officials mean more interest rate hikes are likely in Hong Kong as well. The HKMA moves in lockstep with the Fed as the local currency is pegged to the greenback. Last month, banks in the city, including HSBC and Standard Chartered Bank, raised their main lending rates for the first time since 2018. They have also increased the mortgage price caps for loans linked to the Hong Kong Interbank Offered Rate. Some 97 per cent of Hong Kong's home buyers are tied to such loans.\nHong Kong's economy may potentially contract this year, with the city downgrading its annual economic forecast twice and Financial Secretary Paul Chan warning of a fiscal deficit that is double the budget estimate.\n\"A higher interest rate usually contracts economic activity, especially considering the already weakened demand in Hong Kong under the pandemic and control measures,\" said Dr Aries Wong Kin Ming, who teaches economics at Hong Kong Baptist University. \"It can have an even greater impact on property markets as the recent wave of emigration has already put a downward pressure on the prices.\"\nThe city's shrinking labour force and diminishing appeal for mainland buyers have also added to the woes. Stringent Covid-19 quarantine requirements, which were in force until recently, have resulted in a brain drain, with official figures showing a record population drop.\nBeijing's tightening grip has also taken the sheen off Hong Kong for those affluent mainlanders seeking to hedge their assets. Instead, they are eyeing places such as Singapore, Australia and California.", "url": "https://www.straitstimes.com/business/property/hong-kong-property-market-tumbling-as-unsold-homes-pile-up"}