{"authors": [], "date_download": "2024-10-12 14:11:33", "date_modify": "2024-10-12 14:11:33", "date_publish": "2023-11-30 05:40:08", "description": "The Fed is looking to return inflation firmly to its long-term target of 2% without triggering a damaging recession. Read more at straitstimes.com.", "filename": "business_economy_us-fed-finds-signs-of-slowing-economic-activity_1728742293.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/30/2023-11-27T110016Z1638976615RC2U90A1L5LCRTRMADP3USA-FED-LABOR.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_us-fed-finds-signs-of-slowing-economic-activity_1728742293.html", "title": "US Fed finds signs of slowing economic activity", "title_page": "US Fed finds signs of slowing economic activity | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – US economic activity slowed in recent weeks and the labour market continued to cool, the Federal Reserve announced on Nov 29 as it continues its fight against stubborn inflation.\nThe Fed announced earlier in November that it was holding its key lending rate at a 22-year high as it looks to return inflation firmly to its long-term target of 2 per cent without triggering a damaging recession.\nCutting inflation while avoiding a downturn, commonly known as a “soft landing”, is challenging, but the latest update from the United States central bank suggests it could be on track.\n“On balance, economic activity slowed since the previous report,” the Fed announced in its regular survey of US economic conditions, known as the “beige book”.\nFour of the Fed’s 12 regional districts reported “modest” growth between early October and mid-November, while two reported flat conditions. The remaining six noted “slight declines in activity”.\nAt the same time, “demand for labour continued to ease”, the Fed said, adding that most districts reported “flat to modest increases in overall employment”.\nRetention appears to have improved in many districts, while some reported reductions in headcounts through layoffs or attrition.\nSome employers even “felt comfortable letting go low performers”, the Fed said.\nWhile this would normally be concerning for the central bank – which has a dual mandate to tackle inflation and unemployment – it comes at a time when the US unemployment rate remains close to historic lows.\nPolicymakers at the Fed have indicated they expect that some softening in the labour market will be required to get US inflation to come down firmly to the 2 per cent target. AFP", "url": "https://www.straitstimes.com/business/economy/us-fed-finds-signs-of-slowing-economic-activity"}