{"authors": [], "date_download": "2024-10-12 13:28:38", "date_modify": "2024-10-12 13:28:38", "date_publish": "2024-09-26 20:50:00", "description": "A first-time share sale may raise $400 million to $500 million, the sources said. Read more at straitstimes.com.", "filename": "business_companies-markets_singapore-entertainment-firm-neon-may-launch-ipo-to-raise-500-million-in-2025_1728739718.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/26/IMG4173.JPG?VersionId=Nbhvr.ZMf063mmODtSkc4MIDAGn6FkTr&h=e2c68bd4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_singapore-entertainment-firm-neon-may-launch-ipo-to-raise-500-million-in-2025_1728739718.html", "title": "Singapore entertainment firm Neon mulling over IPO in 2025", "title_page": "Singapore entertainment firm Neon mulling over IPO in 2025 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Immersive entertainment group Neon is considering an initial public offering in Singapore that may raise as much as $500 million, according to people with knowledge of the matter.\nThe company, which is backed by Temasek Holdings’s 65 Equity Partners, has interviewed financial advisers for a potential offering that could take place as soon as next year, the people said, asking not to be identified as the process is private. A first-time share sale may raise $400 million to $500 million, the people said.\nDeliberations are ongoing and details such as size and timing could change, the people said.\nPhone calls and e-mails to Neon’s investors relations and press department went unanswered and the company did not respond to attempts to reach it via LinkedIn.\nOnly US$19.5 million (S$ 25 million) has been raised in IPOs in Singapore this year, in a solitary first-time listing by Singapore Institute of Advanced Medicine Holdings, set for the lowest amount in decades.\nSCI Ecommerce is also planning to list on the domestic bourse next year, Bloomberg News reported this month.\nJapan’s Nippon Telegraph & Telephone Corp is considering listing a global data centre real estate investment trust in Singapore, according to people familiar with the matter.\nNeon produces immersive experiences with franchises including Marvel’s Avengers, Jurassic Park and The Hunger Games, according to its website. It also partners with the governments of Peru and Egypt on exhibitions of historical sites.\n65 Equity Partners invested $150 million in Neon in October 2022 after the company, which was called Cityneon Holdings at the time, concluded a private funding round that raised $235 million. Investors included Pavilion Capital, Temasek’s Seatown Holdings International unit and an investment arm of Singapore’s Economic Development Board. Neon also counts China’s Citic Capital and Qatar’s Doha Venture Capital among its backers.\nIn 2023, Neon had been considering raising about US$200 million in fresh capital to help expand, Bloomberg News reported.", "url": "https://www.straitstimes.com/business/companies-markets/singapore-entertainment-firm-neon-may-launch-ipo-to-raise-500-million-in-2025"}