{"authors": [], "date_download": "2024-10-12 14:19:05", "date_modify": "2024-10-12 14:19:05", "date_publish": "2023-11-22 11:10:00", "description": "Huawei’s China smartphone sales surged 37% in the 3rd quarter as shoppers snapped up its Mate 60 series phones. Read more at straitstimes.com.", "filename": "business_global-smartphone-market-sees-growth-after-more-than-2-years-in-october-report_1728742745.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/22/CHINA-TELECOMMUNICATION-HUAWEI-EARNINGS-100844.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_global-smartphone-market-sees-growth-after-more-than-2-years-in-october-report_1728742745.html", "title": "Global smartphone market sees growth in October after more than 2 years: Report", "title_page": "Global smartphone market sees growth in October after more than 2 years: Report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BENGALURU – The global smartphone market returned to growth in October after a slump of more than two years, helped by a recovery in emerging markets, according to data from Counterpoint Research.\nThe data showed that global monthly smartphone sell-through volume grew 5 per cent, making October the first month to record year-on-year growth since June 2021 and breaking the streak of 27 consecutive months of negative year-on-year growth.\nGlobal smartphone sales have been under stress for the last two years, affected by various issues including component shortages, inventory build-up and the lengthening of replacement cycles, Counterpoint said in its report.\n“Following strong growth in October, we expect the market to grow year on year in the fourth quarter of 2023 as well, setting the market on the path to gradual recovery in the coming quarters,” the market research firm said.\nThe growth has been led by emerging markets, with a continuous recovery in the Middle East and Africa, Huawei’s comeback in China and the onset of the festive season in India, it added.\nThe previous growth, last seen in June 2021, came from pent-up demand caused by the Covid-19 pandemic.\nHuawei’s China smartphone sales grew strongly in the third quarter, surging 37 per cent, as shoppers snapped up its Mate 60 series phones.", "url": "https://www.straitstimes.com/business/global-smartphone-market-sees-growth-after-more-than-2-years-in-october-report"}