{"authors": [], "date_download": "2024-10-12 14:20:13", "date_modify": "2024-10-12 14:20:13", "date_publish": "2024-05-14 23:28:50", "description": "The US central bank is awaiting more evidence that high interest rates are curbing inflation. Read more at straitstimes.com.", "filename": "business_powell-reiterates-fed-likely-to-keep-rates-higher-for-longer_1728742813.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/14/2024-05-14T144153Z381831085RC2UH7A24WSLRTRMADP3USA-FED-POWELL.JPG?VersionId=QfIgYcmjKUQq_W0GyjCzDqle_.lKFZI.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_powell-reiterates-fed-likely-to-keep-rates-higher-for-longer_1728742813.html", "title": "Powell reiterates Fed likely to keep rates higher for longer", "title_page": "Powell reiterates Fed likely to keep rates higher for longer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Federal Reserve chairman Jerome Powell said the US central bank needs to be patient as it awaits more evidence that high interest rates are curbing inflation, doubling down on the need to keep borrowing costs elevated.\nMr Powell reiterated it will likely take longer than previously thought to attain the confidence needed to lower interest rates, echoing remarks made following the Fed’s latest meeting on May 1. He described current rates as restrictive by “many, many measures” but noted time will tell if policy is sufficiently restrictive to bring inflation back to the Fed’s 2 per cent target.\n“We think about the effect of the things we’re doing on financial conditions more broadly and on the economy,” Mr Powell said on May 14 during an event hosted by the Foreign Bankers’ Association in Amsterdam.\n“All of those things lead us to believe at this time that policy is restrictive, and that it looks like it will take longer for us to become confident that inflation is coming down to 2 per cent over time,” he added.\n“We think that it’s probably a matter of just staying at that stance for longer.”\nDuring the moderated discussion between Mr Powell and European Central Bank governing council member Klaas Knot, the Fed chief reiterated it was not likely that the Fed’s next move will be a rate hike. Mr Powell added that it is more likely that the Fed will just keep the policy rate where it is.\nUS central bankers, including Mr Powell, have expressed disappointment at the lack of inflation progress in the first quarter. In May, policymakers kept their benchmark policy rate unchanged at a 23-year high, a level Mr Powell said he was prepared to maintain “for as long as appropriate”.\nMr Powell expects inflation will move lower on a monthly basis, but price figures in the first quarter have tempered his confidence.\n“The first quarter in the United States was notable for its lack of further progress on inflation,” he said. “We did not expect this to be a smooth road, but these were higher than I think anybody expected.”\nHe added: “What that has told us is that we’ll need to be patient and let restrictive policy do its work.”\nThe producer price index, a measure of wholesale prices, topped all economists’ forecasts in April, a government report showed on May 14. That said, several components from the report that feed into the calculation of the Fed’s preferred inflation gauge – the per­sonal consumption expenditures price index – were more mixed.\nMr Powell described the May 14 report as “mixed”. The consumer price index for April was set to be released on May 15, and economists surveyed by Bloomberg estimate prices rose a firm 3.4 per cent from a year earlier.\nThe US economy continues to show resilience, even with the Fed settling in with higher-for-longer rates. Non-farm payrolls have averaged 246,000 a month so far in 2024, and unemployment remains low. The April jobs report, how­ever, did show some signs of moderation, with a slower pace of job growth and an unexpected uptick in unemployment.\nMr Powell described the labour market as “very strong” with signs of gradual cooling and rebalancing, in part driven by an increase in labour supply from immigration as well as an easing in demand. He added that the labour market is about as tight as it was before the pandemic in 2019. BLOOMBERG", "url": "https://www.straitstimes.com/business/powell-reiterates-fed-likely-to-keep-rates-higher-for-longer"}