{"authors": [], "date_download": "2024-10-12 14:20:45", "date_modify": "2024-10-12 14:20:45", "date_publish": "2023-10-20 08:33:00", "description": "The reductions, targeting about 10% of support staff, will start on Nov 6, a report said. Read more at straitstimes.com.", "filename": "business_ubs-poised-for-next-wave-of-job-cuts-at-credit-suisse_1728742845.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/20/2023-10-04T071806Z1300261694RC2IL3A4BLHWRTRMADP3UBS-GROUP-CREDIT-SUISSE-DEPOSITS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_ubs-poised-for-next-wave-of-job-cuts-at-credit-suisse_1728742845.html", "title": "UBS poised for next wave of job cuts at Credit Suisse", "title_page": "UBS poised for next wave of job cuts at Credit Suisse | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEATTLE - UBS Group is poised to start its next wave of job cuts at Credit Suisse, targeting about 10 per cent of support staff, likely in areas like compliance, marketing and risk, Financial News reported.\nThe Swiss bank informed employees that the reductions will start on Nov 6, it said, citing people familiar with the matter.\nA UBS spokesperson declined to comment, the publication added.\nUBS is taking over its long-time Swiss rival in a government-orchestrated deal in 2023 and is paring a combined workforce that has swelled to about 120,000.\nEarlier reductions thinned management, as well as bankers and traders in revenue-generating operations.\nUBS is also overhauling the board of its Swiss business following its takeover of Credit Suisse.\nIt said on Friday that Mr Roger von Mentlen will become chairman of the boards of directors of UBS Switzerland and Credit Suisse Switzerland.\nHe will replace Mr Markus Ronner, who has been chairman of UBS Switzerland since 2022, and Dr Peter Derendinger, who has served as chairman of the board of directors of Credit Suisse Switzerland since March 2019.\nThe change, effective Nov 1, is designed to ensure “closely coordinated supervision” of the two Swiss banks, which are expected to complete their legal merger in 2024. BLOOMBERG, REUTERS", "url": "https://www.straitstimes.com/business/ubs-poised-for-next-wave-of-job-cuts-at-credit-suisse"}