{"authors": ["Choo Yun Ting"], "date_download": "2024-10-12 14:20:23", "date_modify": "2024-10-12 14:20:23", "date_publish": "2020-01-29 05:00:00", "description": "Next-generation business owners and founders of fast-growing companies are set to benefit from the changes. Read more at straitstimes.com.", "filename": "business_economy_pr-scheme-updated-to-woo-new-groups-of-foreign-investors_1728742823.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/01/29/st_20200129_ytgip5mfk_54109.jpg?VersionId=wLn9qPW2BaxJ.tE9.7S_tkVrNltr_4Q0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_pr-scheme-updated-to-woo-new-groups-of-foreign-investors_1728742823.html", "title": "PR scheme updated to woo new groups of foreign investors", "title_page": "PR scheme updated to woo new groups of foreign investors | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Next-generation business owners and founders of fast-growing companies are set to benefit from changes to a government scheme which attracts and grants permanent residence (PR) status to investors and entrepreneurs.\nChanges to the Global Investor Programme (GIP), first reported by The Business Times, were made public in the new year and will take effect on March 1.\nUnder the updated scheme, next-generation business owners and founders of fast-growing companies from certain industries, as well as family office principals, will qualify to apply for PR status through the programme. Family offices are investment firms that manage money for the ultra-rich.\nCurrently, only established business owners and entrepreneurs are eligible to apply under the GIP.\nMr Matthew Lee, director of Contact Singapore, a division of the Economic Development Board which oversees the GIP, said that the updates to the scheme were made to better reflect rapid shifts in the global economy over the past few years which have resulted in new business opportunities and new breeds of entrepreneurs and business owners.\nExpanding the scheme to attract business owners who want to start a single family office in Singapore will \"strengthen our banking and finance sector\", he added.\nThe GIP, which was introduced in 2004, is also extending qualification for the scheme to those who invest $2.5 million in a new or existing Singapore-based single family office with at least $200 million of assets under management.\nIt currently allows foreigners to apply for PR status if they invest at least $2.5 million to start or expand a business here, or in a GIP fund that invests in Singapore-based companies.\nThe qualifying criteria places an emphasis on high-performing firms even though the scheme is opening up more avenues for applications.\nFast-growing start-up founders must be one of the largest individual shareholders of a company worth at least $500 million. Family office principals must have net investable assets such as bank deposits and collective investment schemes of at least $200 million.\nMr Dainial Sani Lim, group director of immigration consultancy firm Cayman Group Holdings, said the changes \"place emphasis on high-performing companies which can open up more opportunities for Singapore's economy and create more jobs here\".\nThe minimum revenue requirement for established business owners applying for the GIP has been raised from $50 million to $200 million.\nRequirements for renewal of PR status will also be tightened, as firms will have to incur annual total business costs of at least $2 million, compared with the current $1 million.", "url": "https://www.straitstimes.com/business/economy/pr-scheme-updated-to-woo-new-groups-of-foreign-investors"}