{"authors": [], "date_download": "2024-10-12 14:07:27", "date_modify": "2024-10-12 14:07:27", "date_publish": "2023-10-03 14:54:00", "description": "All other Asian currencies are already in the red against the greenback. Read more at straitstimes.com.", "filename": "business_asia-s-last-holdout-against-strong-us-dollar-falls_1728742047.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/03/money-34317721920.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_asia-s-last-holdout-against-strong-us-dollar-falls_1728742047.html", "title": "Asia’s last holdout against strong US dollar falls", "title_page": "Asia’s last holdout against strong US dollar falls | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Asia’s last currency standing against the US dollar in 2023 has fallen, with the rupiah joining regional peers to erase gains against the strengthening greenback.\nThe rupiah dropped as much as 0.5 per cent against the dollar on Tuesday, losing all its gains after rallying more that 6 per cent in the first four months of 2023. All other Asian currencies are already in the red against the US currency, which has advanced in the past 10 out of 11 weeks.\n“Higher US yields and the stronger dollar have been the key driver of the rupiah’s recent weakness,” said macro strategist Vijay Kannan at Societe Generale in Singapore. “This should continue to be a headwind for bond flows and the rupiah.”\nWhile most emerging Asia benchmark rates are at or near their terminal levels, the Federal Reserve may hike even more. The rupiah has not been immune to the Fed’s higher-for-longer mantra. It has been weakened by capital outflows as a narrowing yield differential with the United States sapped the appeal of rupiah bonds. Indonesia’s policy rate is offering only a 25-basis-point premium over the upper bound of the Fed fund target rate.\nWhile the rupiah declined on Tuesday, it still remains Asia’s best performer this year. In contrast, the Malaysian ringgit and Thailand’s baht have done far worse, and are among the worst performers in Asia. The Taiwan dollar is trading at the weakest since 2017 against the greenback.\nThe Singapore dollar was trading at 1.3742 to the dollar as at 2.28pm on Tuesday. It is down about 2.6 per cent to the US currency this year.\nAsian currencies do not appear likely to erase losses in the near term. US overnight indexed swaps are pricing a one-in-three chance for another 25-basis-point Fed rate hike in November following hawkish rhetoric this week. China’s challenging outlook will also continue to weigh on Asia’s trade-dependent economies.\nOverseas investors pulled out US$1.1 billion (S$1.5 billion) from Indonesian bonds in September, the largest outflow in a year. As a result, Indonesia’s 10-year government yield has climbed above the 7 per cent psychological threshold.\nBank Indonesia has so far not signalled further rate increases but turned to other monetary tools to lure global bond inflows. It introduced the so-called SRBI bills in September, which have not yet proven effective in curbing the rupiah’s losses.\n“Bank Indonesia’s defence is likely no silver bullet and likely limited to smoothing moves,” Barclays Bank strategist Audrey Ong wrote in a note. BLOOMBERG", "url": "https://www.straitstimes.com/business/asia-s-last-holdout-against-strong-us-dollar-falls"}