{"authors": [], "date_download": "2024-10-12 13:51:23", "date_modify": "2024-10-12 13:51:23", "date_publish": "2024-08-01 07:30:00", "description": "The yen punched through the key 150-per-dollar level – adding to an advance that began earlier in July. Read more at straitstimes.com.", "filename": "business_yen-soars-to-strongest-since-march-after-japan-raises-interest-rates_1728741083.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/2024-07-11T145051Z692071490RC2JN8AINFK8RTRMADP3JAPAN-YEN.JPG?VersionId=j5Ag9jpSryUS6B8YI18GZnBpXvTUKok0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_yen-soars-to-strongest-since-march-after-japan-raises-interest-rates_1728741083.html", "title": "Yen soars to strongest since March after Japan raises interest rates", "title_page": "Yen soars to strongest since March after Japan raises interest rates | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – The yen surged to the strongest since March versus the US dollar on July 31 after the Bank of Japan (BOJ) raised interest rates and announced plans to cut bond purchases, reigniting an aggressive rally.\nThe currency climbed as much as 2.1 per cent against the greenback, punching through the key 150-per-dollar level – adding to a rapid advance that began earlier in July in anticipation of a hawkish decision by the central bank. Japanese government bonds tumbled in the wake of the announcement, with the yield on two-year notes climbing to the highest in 15 years.\nThe yen has benefited in recent days from a rapid unwind in carry trades, a strategy that uses low-yielding currencies like the yen to fund purchases in higher yielders such as the Mexican peso. That capitulation has seen the currency rally more than 7 per cent from a 38-year low versus the dollar reached July 3.\n“From the Japan side, the BOJ’s hike to 0.25 per cent is still a small step, but could eventually be seen as the start of a larger trend,” said Nomura International currency strategist Yusuke Miyairi. “If the market expectation becomes more hawkish, then there’s more scope for the yen to strengthen.”\nThe yen extended its rally to touch 149.61 versus the US dollar in New York afternoon trading.\nThe Japanese currency jumped 1.5 per cent to 112.1367 against the Singapore dollar on July 31 after the BOJ move. It eased 0.1 per cent to 112.3788 per Singdollar as of 7.10am Singapore time on Aug 1.\nThe yield on Japan’s benchmark 10-year bonds rose as much as 8 basis points to 1.083 per cent, while the yield on two-year notes climbed to 0.456 per cent, the highest since 2009. Meanwhile, the Topix stock index closed 1.5 per cent higher on July 31, led by a surge in banking shares.\nTraders also kept an eye on the US Federal Reserve’s path. US central bank chief Jerome Powell said policymakers could lower rates as soon as September, though they kept borrowing costs steady on July 31. Such a move would further curtail the rate gap between the US and Japan, aiding the yen. The Japanese currency also gained on safe haven appeal as geopolitical risk in the Middle East again rose to the forefront.\n“The Bank of Japan is firmly on a path to monetary policy normalisation. That allows the safe-haven yen to catch a bid,” said Ms Kathleen Brooks, research director at XTB. “The yen hasn’t been reacting as much to geopolitical tensions, and now it can.”\nJPMorgan Chase estimated on July 26 that around 40 per cent of carry trades in Group of 10 currencies have been unwound in recent weeks, and data published on July 26 showed the biggest retreat of bets against the yen since 2011.\nStrategists at Wells Fargo see this reduction in bearish yen positions as a factor limiting the yen’s gains going forward. There “may be better value in buying dollar-yen at or around these levels” as the pair finds its footing around the 150 level, the bank’s Mr Erik Nelson and Mr Jack Boswell wrote on July 31.\nOptions traders are positioning for a possible rebound by the dollar against the yen, with two times more demand for options to buy the dollar than for options to sell the greenback.\nThe BOJ raised its policy rate to around 0.25 per cent from a range of 0 to 0.1 per cent, according to its statement on July 31. It also said it would reduce its monthly pace of bond buying – both actions that underscored its determination to normalise policy.\nThe initial pace of the BOJ’s cuts to bond buying was a touch slower than some expectations but the plan looks more aggressive than other market forecasts for a halving of purchases over a two-year period.\nBOJ governor Kazuo Ueda said any additional hikes this year would be data dependent and would be undertaken only after gauging the impact of July 31’s move as well as the March rate increase.\nAsked if the bank could lift rates beyond 0.5 per cent, Mr Ueda said: “If you’re asking if we view that as a wall, we don’t really have that sense.”\nBloomberg strategists said: “The yen has more upside from here, because the short-term drivers of the currency have been provided by what the BOJ delivered, even if its underlying policy choices may turn out flawed. Governor Ueda backed up an interest rate hike with a full-fledged attempt at being hawkish, and that shouldn’t be dismissed lightly.” BLOOMBERG", "url": "https://www.straitstimes.com/business/yen-soars-to-strongest-since-march-after-japan-raises-interest-rates"}