{"authors": [], "date_download": "2024-10-12 13:35:24", "date_modify": "2024-10-12 13:35:24", "date_publish": "2024-10-03 11:25:00", "description": "Much of the spare oil is in the Middle East Gulf region and vulnerable should the conflict escalate. Read more at straitstimes.com.", "filename": "business_companies-markets_why-an-attack-on-iran-may-not-see-oil-prices-spike-but-what-will_1728740124.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/2024-10-02T213243Z609304708RC2KCAABLAMTRTRMADP3OIL-OPEC-IRAN_0.JPG?VersionId=AcKhSYS89FOB.2ZMNwv4aDV5FfbOCbWx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_why-an-attack-on-iran-may-not-see-oil-prices-spike-but-what-will_1728740124.html", "title": "Why an attack on Iran may not see oil prices spike - but what will", "title_page": "Why an attack on Iran may not see oil prices spike – but what will | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Opec has enough spare oil capacity to compensate for a full loss of Iranian supply if Israel knocks out that country’s facilities, but the producer group would struggle if Iran retaliates by hitting installations of its Gulf neighbours.\nIran fired hundreds of missiles at Israel on Oct 1 in response to Israeli air strikes and attacks. Israeli Prime Minister Benjamin Netanyahu said Iran made a big mistake and would pay for it, and Iran threatened a crushing response if Israel retaliated.\nIsrael’s options include targeting Iranian oil production facilities among other strategic sites, US news website Axios reported on Oct 2 citing Israeli officials. Iran is an Opec member with production of around 3.2 million barrels per day (bpd) or 3 per cent of global output.\nIranian oil exports have climbed this year to near multi-year highs of 1.7 million bpd despite US sanctions. Chinese refiners buy most of its supply.\nEnergy Aspects co-founder Amrita Sen said: “In theory, if we lost all Iranian production – which is not our base case – Opec+ has enough spare capacity to make up for the shock.”\nOpec+, which includes allies of the oil cartel such as Russia and Kazakhstan, has been cutting production in recent years to support prices amid weak global demand. So the group is sitting on millions of barrels of spare capacity.\nCuts by Opec+ producers currently total 5.86 million bpd. Analysts estimated Saudi Arabia is able to raise output by 3 million bpd and the United Arab Emirates by 1.4 million.\nWhile Opec has enough spare capacity to compensate for the loss of Iranian supplies, much of that capacity is in the Middle East Gulf region and potentially vulnerable should the conflict escalate further, said Mr Giovanni Staunovo, analyst at UBS.\n“The effectively available spare capacity might be much lower if renewed attacks on energy infrastructure on countries in the region happen,” he said, adding the West might have to tap strategic reserves if there were severe disruptions.\nIsrael has so far refrained from attacking Iranian oil facilities. Oil analysts and security experts have said Israel could target Iran’s oil refining sites and the Kharg Island oil port, which handles around 90 per cent of the country’s crude exports.\nDuring the Iran-Iraq War in the 1980s, Baghdad regularly attacked tankers around Kharg Island and threatened to destroy the oil terminal.\nRBC Capital Markets managing director Helima Croft said: “Iran and its proxies could potentially target energy operations in other parts of the region in order to internationalise the cost if the current crisis devolves into an all-out war.”\nIn 2019, a drone attack by Iranian proxies on Saudi oil processing facilities briefly knocked out 50 per cent of the kingdom’s crude production.\nPVM analyst Tamas Varga said: “In case of an escalation, Iran’s proxies might launch attacks on Middle East oil producers, namely Saudi Arabia.”\nRiyadh and Tehran have had a political rapprochement since 2019, which helped ease regional tensions, but relations remain difficult.\nOil prices have traded in a narrow range of US$70 to US$90 per barrel over the past years, despite the war between Russia and Ukraine and conflict in the Middle East.\nA rise in US production has helped ease the fear premium in oil markets, said Mr Rhett Bennett, chief executive at Black Mountain, which has operations in the US Permian Basin.\nThe United States produces 13 per cent of global crude and almost 20 per cent of global oil liquid production compared to Opec’s 25 per cent global crude production share and some 40 per cent by Opec+.\n“This diversity of supply from US domestic sources, combined with healthy spare capacity within Opec, is translating into the market feeling insulated from a dramatic supply shock – regardless of perpetual Middle East flare-ups,” Mr Bennett said.\nHowever, a broad conflict in the Middle East with a major impact on production would inevitably push oil prices up sharply.\nThat would drive up fuel costs. A related rally in petrol prices could hurt US Vice-President Kamala Harris in her campaign to win the Nov 5 presidential election against Republican candidate Donald Trump.\nING’s head of commodities strategy Warren Patterson said: “The United States will likely try to push Israel for a more modest response, wanting to avoid a significant escalation in tensions.” REUTERS", "url": "https://www.straitstimes.com/business/companies-markets/why-an-attack-on-iran-may-not-see-oil-prices-spike-but-what-will"}