{"authors": [], "date_download": "2024-10-12 14:06:25", "date_modify": "2024-10-12 14:06:25", "date_publish": "2024-01-25 21:30:00", "description": "Europe’s largest economy is struggling to shake off a recession. Read more at straitstimes.com.", "filename": "business_economy_german-economy-limps-into-2024-as-business-sentiment-falls_1728741985.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/25/2024-01-25T112046Z1533478724RC2YO5A64WCORTRMADP3GERMANY-TRAINS-STRIKE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_german-economy-limps-into-2024-as-business-sentiment-falls_1728741985.html", "title": "German economy limps into 2024 as business sentiment falls", "title_page": "German economy limps into 2024 as business sentiment falls | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - German business morale unexpectedly worsened in January, declining for the second month in a row as Europe’s largest economy struggles to shake off a recession and short-lived optimism gives way to fears of another weak year.\nThe ifo institute said its business climate index fell to 85.2 from a slightly downwardly revised reading of 86.3 in December. Analysts polled by Reuters had expected the indicator to improve in January to 86.7.\n“The German economy is stuck in recession,” said ifo president Clemens Fuest.\nGerman gross domestic product (GDP) contracted by 0.3 per cent in 2023.\n“The tentative revival of optimism last autumn has turned out to be very short-lived,” said ING economist Carsten Brzeski, forecasting another shallow recession this year of -0.3 per cent.\nIn 2023, Germany was plagued by persistently high inflation, high energy prices and weak foreign demand, and topped off with a budget meltdown that prompted deep subsidy cuts while rattling the nation’s fractious coalition government.\nAs trade disruptions caused by Houthi attacks on shipping in the Red Sea bring fresh concerns for Germany’s export industry, the closely watched composite PMI index fell for a seventh consecutive month in January.\nHowever, ifo’s head of surveys Klaus Wohlrabe told Reuters that supply chains remained robust in the face of the Red Sea attacks.\n“They have not yet led to supply bottlenecks for raw materials and primary products,” Dr Wohlrabe said.\n2024 Recession Fears\nThe start of the new year also brought mass farmer protests and nationwide rail strikes, as discontent grows over Chancellor Olaf Scholz’s economic policies.\nOn Jan 24, the ifo revised down its growth estimate, with the economy now expected to rebound by a meagre 0.7 per cent this year.\nFurther highlighting Germany’s economic woes, particularly the outlook for its struggling property sector, other data released on Jan 25 showed incoming orders in the country’s construction industry fell 7.4 per cent month-on-month in November\n“Most economists are still too optimistic,” said Dr Joerg Kraemer of Commerzbank, which is also expecting a 0.3 per cent decline in GDP this year.\nThe ifo’s current assessment and expectations components, based on a survey of around 9,000 managers, also dimmed in January.\n“The business climate is keeping hopes for growth in the current quarter at zero,” said Mr Alexander Krueger of Hacuk Aufhaeuser Lampe.\n“Unfavourable location conditions and unsettling economic policy are major problems,” he added. REUTERS", "url": "https://www.straitstimes.com/business/economy/german-economy-limps-into-2024-as-business-sentiment-falls"}