{"authors": ["Timothy Goh"], "date_download": "2024-10-12 14:16:17", "date_modify": "2024-10-12 14:16:17", "date_publish": "2023-11-02 21:00:00", "description": "It may indicate that a gradual manufacturing recovery could be underway, say economists. Read more at straitstimes.com.", "filename": "business_singapore-s-pmi-sees-back-to-back-gains-after-six-month-contraction_1728742577.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/02/IMG2813.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-s-pmi-sees-back-to-back-gains-after-six-month-contraction_1728742577.html", "title": "S’pore manufacturing activity sees back-to-back gains after six-month contraction", "title_page": "S’pore manufacturing activity sees back-to-back gains after six-month contraction | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Factory activity in Singapore inched up for a second consecutive month after a six-month slump, indicating a potential turnaround for manufacturing even as the electronics sector continued to decline.\nThe purchasing managers’ index (PMI), a barometer of the manufacturing sector, nudged higher to 50.2 points in October, from 50.1 points in the previous month.\nReadings below 50 indicate contraction, whereas those above 50 points denote growth. October’s expansion was helped by broad-based improvements across key indicators such as new exports, factory output and employment.\nBut supplier deliveries worsened, while new orders and input purchases showed marginal improvement but remained in contraction territory, according to the latest data released by the Singapore Institute of Purchasing and Materials Management on Thursday.\nOCBC Bank chief economist Selena Ling said the decline in supplier deliveries may be due to “supply chain calibration”, possibly driven by the economic slowdown in China and geopolitical tensions.\n“Since it’s across both manufacturing and electronics industries and the trend started as early as May 2023, it may be a systemic issue rather than industry-specific or Middle East-related,” she said, referring to the Israel-Hamas war.\nMeanwhile, the contraction in new orders and input purchases may be due to headwinds in the manufacturing sector remaining, given the weak external demand, which could persist for the rest of 2023 and into early 2024, noted UOB associate economist Jester Koh.\nDBS Group Research economist Chua Han Teng said October manufacturing PMI reflects better conditions for Singapore’s factories.\nHe also pointed out that October’s figure was the highest since mid-2022, with upticks across most indexes.\nHe said: “The improving manufacturing PMI trend over the past few months is a nascent sign that the gradual yet fragile manufacturing recovery appears to be under way.”\nFor the electronics segment, the latest PMI data indicates signs of a recovery, with a 0.1 point improvement from the previous month, taking it to 49.9, which is a hair’s breadth away from the 50-point threshold.\nMs Ling noted that the electronics PMI has been stuck in contraction territory for the 13th straight month, but said it is positive that the electronics PMI is edging closer towards the 50-point mark.\nShe said: “There have been recent signs that the global semiconductor industry destocking and inventory adjustments may be nearing an end, and some global chip companies have indicated some improvement in 2024.\n“But challenges may persist due to the US-China strategic rivalry within the chip sector.”\nMr Koh said the sub-50 reading for electronics PMI is a sign that the electronics sector is likely to remain lacklustre in the near term, even though the latest Singapore non-oil domestic exports and industrial production readings suggest that the electronics cycle has tentatively bottomed out.\nWithin the electronics segment, key indicators such as new orders, production and employment saw improved readings, while several others, such as new exports, input purchases, imports, order backlog and supplier deliveries, worsened.\nMr Koh added: “The variation in the improvement in October’s electronics PMI imply uncertainty in the prospects as external demand is likely to remain weak in the near term.”\nLooking ahead, Mr Koh said that headwinds he foresees in the manufacturing sector could be the result of tight financial conditions stemming from an elevated interest rate environment.\nHe added: “While we are heartened by the broad-based improvement in October’s overall PMI, we caution that the manufacturing sector could remain downbeat in the near term, given the weak external demand.”\nMr Chua was slightly more hopeful, saying that a “gradual and fragile” recovery in manufacturing can be expected in 2024.\nHowever, he also agreed that macroeconomic headwinds remain.\n“The global economic backdrop is still uncertain amid high interest rates in advanced economies, bumpy conditions in China, and lingering geopolitical tensions that could disrupt supply chains,” he added.", "url": "https://www.straitstimes.com/business/singapore-s-pmi-sees-back-to-back-gains-after-six-month-contraction"}