{"authors": [], "date_download": "2024-10-12 14:20:56", "date_modify": "2024-10-12 14:20:56", "date_publish": "2023-05-17 22:44:08", "description": "Revenue rose at a faster-than-anticipated 11 per cent for the three months ended March. Read more at straitstimes.com.", "filename": "business_tencent-s-sales-grow-the-most-in-over-a-year-after-china-reopens_1728742856.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/17/2023-05-17T092720Z1898338189RC2W8W9E2GB4RTRMADP3TENCENT-CLOUD_3.JPG?VersionId=uJeR9Zcd0AfFIQbSqJD9jL7W6u.Mtegx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_tencent-s-sales-grow-the-most-in-over-a-year-after-china-reopens_1728742856.html", "title": "Tencent’s sales grow the most in over a year following China’s reopening", "title_page": "Tencent’s sales grow the most in over a year following China’s reopening | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHENZHEN – Tencent Holdings’ earnings missed estimates despite the fastest pace of revenue growth in more than a year, reflecting an uneven Internet sector recovery during China’s post-pandemic reopening.\nRevenue rose at a faster-than-anticipated 11 per cent to almost 150 billion yuan (S$28.8 billion) for the three months ended March, exceeding the 146.29 billion yuan average forecast. But net income of 25.8 billion yuan fell short of projections. Shares in Prosus NV, a major Tencent shareholder, were largely unchanged in Europe.\nChina’s most valuable company grew online advertising by 17 per cent, as a gradual resumption of marketing fuelled the business for sector leaders including Baidu Inc. But investors remain cautious after a year in which Tencent and its peers barely grew, following regulatory crackdowns and Covid-19 restrictions choked off consumer and corporate spending.\nMainstay Internet businesses such as advertising and gaming are only now emerging from their historic trough, while big tech firms have been forced to push aggressive cost cuts to endure an uncertain macroeconomic environment.\n“Tencent remains one of the most uniquely positioned China Internet companies, given its unrivalled WeChat ecosystem, leadership in games, and new growth drivers across video account and fintech,” Goldman Sachs analyst Ronald Keung wrote in a note ahead of the results.\nTencent and peers such as Alibaba Group Holding, JD.com Inc and Baidu are watched for clues to the health of Chinese business sentiment and consumption. JD.com’s revenue barely rose during the March quarter, but the more advertising-dependent search leader Baidu returned to double-digit growth. The WeChat operator itself had only just resumed expanding revenue in the December quarter after months of decline.\nInvestors have flip-flopped on Chinese tech stocks in 2023, first buying into the belief that Beijing would rally the giant sector to boost the world’s No. 2 economy in 2023. But cheerleading by officials did not translate into concrete policy and signs have since grown that the country’s nascent economic recovery may already be petering out.\nTencent faces more specific challenges as well. It has yet to find its next big gaming success in China, after Honor Of Kings and Peacekeeper Elite cemented its lead in the pre-Covid-19 era. The company aims to fill its long-empty pipeline in 2023 with hits like Valorant after Beijing’s censors resumed licensing approvals in 2022.\nSuch new launches will test a rapidly saturating domestic market, where younger players are increasingly drawn to up-and-comers like anime specialist Mihoyo.\nGlobally, Tencent’s appetite for content is not waning, even at a time when it is divesting assets and spending more judiciously at home. The world’s largest games publisher has, over the past years, ramped up its effort to acquire mid-sized games studios in places from Europe to Japan, while growing its stakes in established names such as Ubisoft Entertainment SA. In March, Tencent debuted its evergreen Honor Of Kings in Brazil, paving the way for a global roll-out.\nInternational gaming sales for the first quarter grew an accelerated 25 per cent, versus a 6 per cent gain in the domestic division, which had contracted over the past year.\nInvestors will, however, keep a close watch on content costs, particularly as Tencent builds out its cloud service and begins to integrate artificial intelligence (AI) across its portfolio. Its fintech and cloud arm returned to double-digit growth for the March period, after attempts to get rid of unappealing contracts.\nAnd just this week, the WeChat operator announced a price cut for some of its core cloud products by as much as 40 per cent, following a similar move by nemesis Alibaba.\nTencent is hoping to integrate AI capabilities across its suite of products, from WeChat to online media, calling the technology a “growth multiplier”.\nChatGPT, now a global phenomenon, triggered a race among Chinese tech firms to catch up. But the Shenzhen-based firm appears to lag behind rivals such as Alibaba and Baidu, both of which have announced ChatGPT-style platforms and triggered a frenzy among investors.\nAs the backbone of Tencent’s online content and commerce empire, WeChat has been shouldering more of the burden for monetisation while other businesses falter. Its fledgling short-video feed generated more than one billion yuan of ad sales in the final quarter of 2022 despite intensifying competition from rivals like ByteDance. BLOOMBERG", "url": "https://www.straitstimes.com/business/tencent-s-sales-grow-the-most-in-over-a-year-after-china-reopens"}