{"authors": [], "date_download": "2024-10-12 14:09:05", "date_modify": "2024-10-12 14:09:05", "date_publish": "2022-06-22 15:47:24", "description": "Supply shocks continue to push up inflation and drive down growth, while central banks are hiking interest rates. Read more at straitstimes.com.", "filename": "business_economy_citigroup-economists-see-chance-of-global-recession-nearing-50_1728742145.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/22/ads-nyc-220622.jpg?VersionId=6T0rQnVPjHAl2S3Z.mGasmY8SnqYNlZc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_citigroup-economists-see-chance-of-global-recession-nearing-50_1728742145.html", "title": "Citigroup economists see chance of global recession nearing 50%", "title_page": "Citigroup economists see chance of global recession nearing 50% | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON (BLOOMBERG) - The probability of the world economy succumbing to a recession is nearing 50 per cent as central banks tighten monetary policy and demand for goods weakens, according to economists at Citigroup.\nSupply shocks continue to push up inflation and drive down growth, while central banks are now hiking interest rates vigorously and consumer demand for goods is softening, the economists led by Citigroup's global chief economist Nathan Sheets said in a report on Wednesday (June 22).\n\"The experience of history indicates that disinflation often carries meaningful costs for growth, and we see the aggregate probability of recession as now approaching 50 per cent,\" the economists wrote.\n\"Central banks may yet engineer the soft - or softish - landings embodied in their forecasts (and in ours), but this will require supply shocks to ebb and demand to remain resilient.\"\nCitigroup now sees the world economy growing 3 per cent this year and 2.8 per cent in 2023. Its economists said if a recession did occur it was likely to be a \"garden variety\" one in which unemployment rises several percentage points and output experiences a couple of weak quarters.\n\"We see this as a reasonable expectation, but the wildcard - as we have emphasised - is how stubborn inflationary dynamics ultimately prove to be,\" they said.", "url": "https://www.straitstimes.com/business/economy/citigroup-economists-see-chance-of-global-recession-nearing-50"}