{"authors": [], "date_download": "2024-10-12 14:15:16", "date_modify": "2024-10-12 14:15:16", "date_publish": "2024-08-22 23:59:00", "description": "Average prices charged for goods and services rose at the slowest rate since January. Read more at straitstimes.com.", "filename": "business_us-business-activity-edges-lower-pricing-power-ebbs-further_1728742516.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/23/FILES-US-ECONOMY-EMPLOYMENT-INDICATOR-132750.jpg?VersionId=hFqrWsW1WKmjOTLH5qBA2aXX70rJSim2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_us-business-activity-edges-lower-pricing-power-ebbs-further_1728742516.html", "title": "US business activity edges lower; pricing power ebbs further", "title_page": "US business activity edges lower; pricing power ebbs further | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "US business activity fell to a four-month low in August and firms continued to struggle to pass on higher prices to consumers, bolstering the likelihood that inflation will stay on a downward trend over the coming months.\nS&P Global said on Aug 22 that its flash US Composite PMI Output Index, which tracks the manufacturing and services sectors, edged down to 54.1 this month, a still healthy level among the highest measured over the past two years. That followed a final reading of 54.3 in July.\nA reading above 50 indicates expansion in the private sector. A slight pick-up in the services sector was outpaced by an easing in the manufacturing industry.\nAverage prices charged for goods and services rose at the slowest rate since January and are now at levels that S&P Global viewed as consistent with the Federal Reserve’s 2 per cent inflation target. This echoed reports from businesses that customers are pushing back against high prices, through bargain hunting, scaling back on purchases and trading down to lower-priced substitutes.\nInflation in July on an annual basis slowed to below 3 per cent for the first time in nearly 3½ years, the Labour Department reported last week.\nThe nearly unchanged composite Purchasing Managers’ Index implied that economic activity remained on a solid footing as the third quarter progressed. Gross domestic product increased at a 2.8 per cent annualised rate in the second quarter, picking up from the January-March quarter’s 1.4 per cent pace.\n“The solid growth picture in August points to robust GDP growth in excess of 2 per cent annualised in the third quarter, which should help allay near-term recession fears,” said S&P Global Market Intelligence chief business economist Chris Williamson. “Similarly, the fall in selling price inflation to a level close to the pre-pandemic average signals a ‘normalisation’ of inflation and adds to the case for lower interest rates.”\nThe S&P Global survey’s measure of new orders received by private businesses edged up to 52.3 from 52.2 in July. Its measure of prices paid by businesses for inputs was unchanged at 58, but the survey’s gauge of prices charged slipped to 52.8 from 53.1 in July.\nPrivate sector employment fell, with a decline in the service sector accompanied by the manufacturing sector adding the fewest jobs since January. The survey’s flash manufacturing PMI retreated to an eight-month low, falling to 48 this month from 49.6 in July. Economists polled by Reuters had forecast the index for the sector, which accounts for 10.3 per cent of the economy, to remain unchanged.\nIts flash services PMI rose to 55.2, from 55 in July, confounding economists’ expectations for a drop to a reading of 54. S&P Global said sentiment about the future continued to be adversely impacted by uncertainty regarding the November presidential election and concerns about future demand, particularly in the manufacturing sector. REUTERS", "url": "https://www.straitstimes.com/business/us-business-activity-edges-lower-pricing-power-ebbs-further"}