{"authors": [], "date_download": "2024-10-12 14:10:51", "date_modify": "2024-10-12 14:10:51", "date_publish": "2024-05-30 13:10:00", "description": "PwC faces a fine of at least one billion yuan (S$190 million), sources say. Read more at straitstimes.com.", "filename": "business_china-weighs-record-fine-for-pwc-over-evergrande-auditing-work-sources-say_1728742251.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/30/2024-03-13T025706Z1439738112RC21O1A4LMRJRTRMADP3AUSTRALIA-PWC-JOB-CUTS.JPG?VersionId=L68HHwve5AojKd4pi534TVt13HTTChvQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-weighs-record-fine-for-pwc-over-evergrande-auditing-work-sources-say_1728742251.html", "title": "China weighs record fine for PwC over Evergrande auditing work, sources say", "title_page": "China weighs record fine for PwC over Evergrande auditing work, sources say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China is poised to impose a record fine on PricewaterhouseCoopers (PwC) and suspend some of the global auditor’s local operations over its role in one of the nation’s biggest alleged financial fraud cases, according to people familiar with the matter.\nThe Ministry of Finance (MOF) may announce the penalties on PwC as soon as this week over its auditing work for China Evergrande Group, said the people, asking not to be identified discussing a private matter.\nPwC faces a fine of at least one billion yuan (S$190 million), the people said.\nThat would exceed the previous record fine for an accounting firm, the 212 million yuan handed out to Deloitte Touche Tohmatsu in 2023.\nPart of the penalties could also include a halt of operations at some of PwC’s mainland offices, the people said, adding that the decision is not final, and the specifics could be subject to change.\nThe MOF and PwC did not immediately respond to Bloomberg requests for comments.\nPwC has been under the spotlight after China launched one of the biggest investigations of financial fraud in history involving developer Evergrande.\nThe authorities earlier in 2024 levied a 4.18 billion yuan fine against the once high-flying real estate company and said the company’s main unit, Hengda, overstated its revenue by 564 billion yuan in the two years through 2020.\nIn May alone, PwC lost a handful of Chinese clients, adding to a list of more than a dozen companies it has stopped auditing in the country in the last two years. China Taiping Insurance Holdings, China Merchants Bank and People’s Insurance Company (Group) of China were among them.\nThe penalties come as President Xi Jinping has increased a focus on tackling financial risks and crime to stabilise the world’s second-largest economy.\nAt a Politburo meeting on May 27, Mr Xi instructed the financial regulators and local governments to implement new rules and make sure financial oversight has “teeth”.\nPricewaterhouseCoopers Zhong Tian, a Shanghai-registered firm that is part of PwC’s global network, was Hengda’s auditor during the period in question.\nThe firm served as Evergrande’s auditor for more than a decade until it resigned in January 2023 due to what the developer said were audit-related disagreements.\nAmong the Big Four accounting firms, PwC was one of the most commonly used by Chinese real estate companies listed in Hong Kong, according to data compiled by Bloomberg.\nIt audited the books of some of the nation’s largest developers, including Country Garden Holdings and Sunac China Holdings, before they also defaulted on their debt.\nPwC’s mainland Chinese arm, with more than 1,600 certified accountants, reported revenue of 7.9 billion yuan in 2022, making it the top earner among more than 9,000 local rivals, according to official data.\nStill, that is a fraction of its global revenue of US$50.3 billion (S$68 billion) during the year.\nPwC has run into trouble in other jurisdictions. In Hong Kong, the city’s Financial Reporting Council said in 2022 that it was looking into Evergrande’s financial statements for 2020 and expanding an investigation of an audit carried out by PwC.\nThe company earlier pledged to boost governance controls in Australia over questions of a serious conflict of interest in leaking government tax plans to its clients. Its British network was also fined £5.6 million (S$9.6 million) for failures in auditing Babcock International Group. BLOOMBERG", "url": "https://www.straitstimes.com/business/china-weighs-record-fine-for-pwc-over-evergrande-auditing-work-sources-say"}