{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 13:51:39", "date_modify": "2024-10-12 13:51:39", "date_publish": "2024-04-12 08:05:51", "description": "The decision was widely expected after core inflation in February shot up more than expected. Read more at straitstimes.com.", "filename": "business_mas-keeps-singapore-dollar-policy-2024-inflation-forecasts-unchanged_1728741099.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/12/2023053022057852f5c32010-60b0-4e38-930a-af0cbbbac88e.jpg?VersionId=q4MvvZ3b.qzA5XuMhW0ZA00pqHYN4fzQ&h=acec710f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_mas-keeps-singapore-dollar-policy-2024-inflation-forecasts-unchanged_1728741099.html", "title": "MAS keeps Singdollar policy unchanged to fight still-elevated inflation", "title_page": "MAS keeps Singdollar policy unchanged to fight still-elevated inflation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore’s central bank kept unchanged its monetary policy stance aimed at strengthening the trade-weighted Singapore dollar to fight still-elevated inflation.\nThe Monetary Authority of Singapore (MAS) said on April 12 that it will maintain the prevailing rate of appreciation of the Singapore dollar nominal effective exchange rate policy band, with no change to the width of the band or the level at which it is centred – parameters that indicate how high and how fast the central bank wants the currency to appreciate.\nThe Singapore dollar ticked up soon after the MAS statement, rising to 1.353 to the US dollar from its close of 1.354 on April 11.\nThe central bank kept its projection for both all-items inflation and core inflation – which excludes private accommodation and transport costs and better represents the expenses of Singapore households – unchanged at an average of 2.5 per cent to 3.5 per cent for 2024.\nIts latest decision to again stand pat was widely expected after core inflation in February shot up more than expected on the back of higher services and food inflation partly linked to Chinese New Year spending.\nIt rose to 3.6 per cent year on year in February, up from January’s 3.1 per cent. This was also the highest reading for core inflation since July 2023.\nWith core inflation stubbornly above the widely perceived MAS target of 2 per cent, all 20 economists surveyed by Bloomberg News had expected the central bank to maintain its overall policy settings.\n“MAS core inflation is likely to remain elevated in the earlier part of the year but should decline gradually and step down by the fourth quarter, before falling further into 2025,” the central bank said in its monetary policy statement on April 12.\n“Accordingly, current monetary policy settings remain appropriate. The prevailing rate of appreciation of the policy band is needed to keep a restraining effect on imported inflation as well as domestic cost pressures and is sufficient to ensure medium-term price stability,” it noted.\nMAS tightened its policy five times between October 2021 and October 2022 before pausing.\nThe MAS decision also comes on the heels of hotter-than-expected inflation in the US, pushing back expectations for an interest rate cut by the US Federal Reserve from June to much later in the year. This would make it more difficult for other countries to embark on an easing cycle, as it would put more pressure on their currencies and possibly spur cost-push inflation through imports.\nThe European Central Bank on April 11 also held its policy stance unchanged. But ECB president Christine Lagarde in her comments to the press kept alive hopes of a possible rate cut in June.\nExplaining the persistence of inflation in Singapore, MAS said core inflation in the near term will be supported by the recent hike in water tariffs. Also, prices of certain services, such as education and healthcare, will continue to rise after staying muted in the past few quarters.\n“Nevertheless, as imported and domestic cost pressures continue to abate, underlying inflation should moderate further,” MAS added.\nThe central bank warned that both upside and downside risks to the inflation outlook remain.\n“Shocks to global food and energy prices or stronger-than-expected demand for labour in the domestic economy could bring about additional inflationary pressures. However, an unexpected weakening in the global economy could induce a faster easing of cost and price pressures.”\nMeanwhile, the Ministry of Trade and Industry in advance estimates, which were also released on April 12, said Singapore’s economy grew by 2.7 per cent on a year-on-year basis in the first quarter of 2024, lifted by a pickup in services-producing industries amid an increase in tourist arrivals.\nHowever, the estimates also showed that growth came in at 0.1 per cent on a seasonally adjusted quarterly basis, down from 1.2 per cent in the fourth quarter of 2023. Manufacturing and modern services activity saw some slowing in the first quarter of 2024, after having expanded strongly in the preceding quarters.\nMr Edward Lee, chief economist at Standard Chartered Bank, said that while MAS leaving the policy unchanged was not surprising, the central bank did sound slightly dovish – that is, it does not see the need to further tighten its stance to further boost the Singapore dollar’s trade-weighted strength.\nHowever, Mr Lee, who is also the bank’s forex head for Asean and South Asia, said MAS did not give any signal to support expectations of an imminent easing either.\n“If you were thinking easing in July, well, MAS is saying maybe not. If you were thinking maybe a hint of some slope increase (tightening) may be a risk, then it’s a disappointment for you too,” he said.\nHence Mr Lee does not expect the Singapore dollar to depreciate any time soon and believes that it will remain attractive for traders seeking to buy it against currencies with low interest rates – a strategy called carry trade.\nMr Ang Kai Wei, Asia and Asean economist at Bank of America, also sees no change in MAS policy settings for some time though if inflation remains stubborn, the central bank may choose to tighten further.", "url": "https://www.straitstimes.com/business/mas-keeps-singapore-dollar-policy-2024-inflation-forecasts-unchanged"}