{"authors": ["Ven Sreenivasan"], "date_download": "2024-10-12 13:28:37", "date_modify": "2024-10-12 13:28:37", "date_publish": "2024-10-03 09:00:00", "description": "Stocks like Yanlord Land have risen by almost 60 per cent in the last week. Read more at straitstimes.com.", "filename": "business_singapore-listed-china-companies-soar-following-stimulus_1728739717.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/btsgx20241002.jpg?VersionId=xzk2JyTD0ciouM9B6E97YdNZXMsSSNRM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-listed-china-companies-soar-following-stimulus_1728739717.html", "title": "Singapore-listed China companies soar after Beijing’s stimulus blitz", "title_page": "Singapore-listed China companies soar after Beijing’s stimulus blitz | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Beijing’s unexpectedly huge stimulus package sent the share prices of Chinese companies listed in Singapore surging in recent days to their highest level in years.\nSingapore Exchange-quoted Chinese property group Yanlord Land’s stock price has surged a whopping 57 per cent over the past week, while solar energy player Sunpower Group is up 38 per cent.\nOthers like Sasseur Reit (real estate investment trust), China Aviation Oil, property developer Ying Li International and even chemical producer Jiutian Chemical have also popped.\nThis came after China last week unveiled a stimulus package to counter a multi-year slowdown in growth due to its ailing property sector, weak exports and sluggish domestic demand.\nKey elements of the package included monetary easing by the People’s Bank of China, increased infrastructure spending, support for the real estate sector via re-lending programmes, cuts in taxes and subsidies to boost domestic consumption and easing restrictions on foreign investments.\nThe measures surprised analysts, but ignited a sharp rally in China-linked stocks here on optimism that they could benefit from a rejuvenation of an economy that has been stagnant for the better part of the four years.\nMaybank Securities’ head of research Thilan Wickramasinghe noted that SGX-listed companies with significant China exposure are enjoying the spillover effects from China’s big bazooka stimulus.\n“Right now, we think the market is also participating in the potential upside from stimulus through Singapore, given China is closed for Golden Week,” he pointed out.\n“Some of the key beneficiaries are real estate investment trusts with mainland exposure, such as Mapletree Pan Asia Commercial Trust, banks with large North Asia books such as DBS, and developers such as UOL, Hongkong Land and City Developments. Wilmar International should also benefit given its large market share in consumer staples in China.”\nCompanies like CapitaLand China Trust, Yangzijiang Financial, Hong Leong Asia, Nanofilm Tech, Hutchison Port, Jardine Matheson, DFI Retail and numerous others with significant China exposure are also seen benefiting from the “China fever”.\nThe Hong Kong and mainland China markets have also rallied strongly.\nHong Kong’s Hang Seng Index has risen almost 15 per cent since Sept 27, bringing its total gain since Sept 20 to almost 20 per cent. The Shanghai Composite index was up nearly 10 per cent on Sept 27 before closing for the Golden Week holiday.\nIn Singapore, the FTSE ST China Index is up about 10 per cent over the past five trading sessions, outpacing most regional markets and Singapore sectors.\nWhile the immediate impact on markets is obvious, analysts are also watching to see how effective the stimulus measures will be over time.\n“We don’t think these monetary measures will immediately reverse the weakness in demand,” noted Phillip Capital in a recent note.\n“It will be a gradual improvement in consumption through a wealth effect. This is similar to the Fed’s quantitative easing objective. Only a bump in fiscal spending can reverse the economy in the short term.”\nStill, there seems to be a consensus among experts that the rally can be sustained in the near term because of a significant re-rating of China as the risk of a sharper economic downturn diminishes.\nAnalysts are also optimistic that the China stimulus could spark a recovery of some beaten-down stocks towards fair values.\nYanlord Land, despite surging almost 60 per cent in recent days to just below 70 cents, is considered a quality China property play with a net asset value of $3.24 per share and cash at $1 per share.\nSimilarly, Sasseur Reit, which has risen about 6 per cent in recent days, is seen as benefiting from a recovery in domestic consumer spending, especially through this Golden Week. The Reit holds retail properties in China in its portfolio.\nHowever, OCBC Investment Research head of research Carmen Lee warned that a resurgence of the North-east Asia markets like Hong Kong could also potentially divert funds away from South-east Asia.\n“The inflow of funds into China and Hong Kong equities is real and strong, and this has the potential to divert interest away from South-east Asia,” she noted.\nBut for the moment the general market view is that the “China fever” rally still has some legs, especially if the Chinese economy responds positively to the stimulus.", "url": "https://www.straitstimes.com/business/singapore-listed-china-companies-soar-following-stimulus"}