{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 14:14:52", "date_modify": "2024-10-12 14:14:52", "date_publish": "2020-05-26 08:00:46", "description": "The forecast is worse than the 4 to 1 per cent contraction earlier predicted. Read more at straitstimes.com.", "filename": "business_economy_spore-to-sink-into-deeper-recession-than-expected-2020-growth-forecast-cut-to_1728742492.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/05/26/rk_singaporeskyline_260520.jpg?VersionId=bSPX5M122iv4MibmmsAH_.wlA63HAVMp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_spore-to-sink-into-deeper-recession-than-expected-2020-growth-forecast-cut-to_1728742492.html", "title": "Singapore heads for worst recession since independence; economy to shrink by 7% to 4% on Covid-19 impact", "title_page": "Singapore heads for worst recession since independence; economy to shrink by 7% to 4% on Covid-19 impact | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore will sink into a deeper recession this year than expected earlier, amid the deterioration in global demand from the coronavirus pandemic as well as the expected impact of circuit breaker measures at home.\nWhile the Government will respond with further support measures, the outlook for the overall economy and especially the jobs market may worsen even more in the second quarter and possibly beyond.\nThere is still considerable uncertainty and the country must be prepared for retrenchments to increase, an official of the Ministry of Manpower at a virtual press conference on Tuesday.\nAny recovery, which is dependent on the success of measures against the pandemic and the subsequent recession at home and abroad, is only likely to take shape sometime in the second half of the year, the Ministry of Trade and Industry (MTI) added at the briefing.\nMTI forecast the Singapore economy will shrink by 7 to 4 per cent, worse than the 4 to 1 per cent contraction earlier predicted - making it Singapore’s worst-ever recession since independence in 1965.\nThe ministry said that there were significant uncertainties in the global economy, with a risk that subsequent waves of infections in major economies such as the United States and euro zone could further disrupt economic activity. In particular, if infections start to rise and strict measures such as lockdowns and movement restrictions are reimposed, the downturn in these economies could be more severe and prolonged than expected.\nAlso, a growing perception of diminished ability to use fiscal and monetary stimulus in many major economies could damage confidence in authorities' ability to respond to shocks, undermining risk appetite and driving further financial market volatility, with negative spillovers for the broader global economy, it said.\n\"Against this backdrop, the outlook for the Singapore economy has weakened further since March,\" MTI said in a press release.\nBriefing the media, Mr Gabriel Lim, MTI’s Permanent Secretary, said that outward-oriented sectors such as manufacturing, wholesale trade and transportation and storage will be adversely affected by the sharper-than-expected slowdown in many of Singapore’s key markets, as well as more prolonged supply chain disruptions.\nMr Lim said the fourth budget due later on Tuesday will respond to the increased risk of higher unemployment. Singapore Deputy Prime Minister Heng Swee Keat is scheduled to announce the fourth round of Covid-19 support measures at 3.30pm on Tuesday.\nMTI said a gradual recovery is expected to start taking shape only in the second half of the year.\nMs Selena Ling, head of treasury research and strategy at OCBC Bank, said the downward revision of the official 2020 growth forecast was anticipated and implies a significant deterioration in the second-quarter growth momentum due to the circuit breaker measures, as well as a weak recovery trajectory in the second half depending on the global and domestic Covid-19 recovery process.\n“Market focus will be on the fourth Budget this afternoon where fiscal policy will do the heavy lifting, with another tap on the past reserves already receiving the President’s in-principle approval. The policy priorities are to mitigate the expected softening in the domestic labour market,” she said.\nSingapore Deputy Prime Minister Heng Swee Keat is scheduled to deliver a ministerial statement on the fourth round of Covid-19 support measures at 3.30pm on Tuesday.\nMTI on Tuesday also said the economy contracted by 0.7 per cent year on year in the first quarter, a reversal from the 1.0 per cent growth in the previous quarter but better than the 2.2 per cent drop earlier estimated.\nThat was made possible by the “pockets of resilience” in the Singapore economy, it said.\nWithin the manufacturing sector, biomedical manufacturing is expected to continue to expand, supported by the production of pharmaceutical and biological products. Among services, the information and communications sector is also projected to grow given firms’ resilient demand for IT and digital solutions.\nMs Ling said the upward revision for the first quarter GDP was largely driven by the March manufacturing data.\n“But the first quarter is water under the bridge,” she said.\nOn a quarter-on-quarter seasonally adjusted annualised basis, the economy shrank by 4.7 per cent, a pullback from the 0.6 per cent expansion in the fourth quarter of last year, MTI data showed.\nDBS Bank noted that the better-than-expected first-quarter performance was aided by a 16.5 per cent surge in industrial output in March, which brought manufacturing growth to 6.6 per cent in the quarter.\n“This has provided a much needed jab in the arm for the economy, offsetting partially the drag from the services sector,” said Mr Irvin Seah, senior economist at DBS.\nHe noted that besides the manufacturing sector, financial and ICT services have bucked the trend.\n“This is in line with our projection that services industries which are more digitalised will better weather the pandemic because of their relatively higher resilience to disruptions from restrictive measures,” he said.\nThese three clusters will likely outperform this year and they will also bounce back faster in the recovery phase, Mr Seah predicted.\nStill, DBS expects overall GDP to contract by 8 per cent year on year in the second quarter, before some modest and gradual improvement in the subsequent quarters. DBS kept its full-year growth forecast unchanged at -5.7 per cent.\nBarnabas Gan, economist at UOB Group, also maintained his 2020 GDP estimate at -4 per cent, with downside risks.\n\"The economic environment remains extremely uncertain at this juncture, especially given the phased easing of Singapore’s circuit breaker measures. Little clarity has been given on border reopening, suggesting that tourist activities may remain subdued for a considerable period,” he said.\nMr Gan’s base case scenario is for Covid-19 concerns to dissipate into the year-end, and for the economy to pick up in 2021 with growth rebounding to 4.5 per cent.", "url": "https://www.straitstimes.com/business/economy/spore-to-sink-into-deeper-recession-than-expected-2020-growth-forecast-cut-to"}