{"authors": [], "date_download": "2024-10-12 14:12:59", "date_modify": "2024-10-12 14:12:59", "date_publish": "2023-09-21 08:44:27", "description": "The combined fortunes of the top 15 Chinese healthcare billionaires has fallen to $115 billion. Read more at straitstimes.com.", "filename": "business_china-healthcare-tycoons-lose-24-billion-as-crackdown-spreads_1728742379.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/21/2023-06-24T003016Z462100472RC2HHY91OVFBRTRMADP3HEALTH-CORONAVIRUS-USA-ORIGINS.JPG?h=56d552e6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-healthcare-tycoons-lose-24-billion-as-crackdown-spreads_1728742379.html", "title": "China’s healthcare tycoons lose $23.7 billion as crackdown spreads", "title_page": "China’s healthcare tycoons lose $23.7 billion as crackdown spreads | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – China’s latest anti-corruption crackdown is hammering the personal wealth of the nation’s healthcare tycoons, with their worth dropping by US$17.3 billion (S$23.7).\nThe combined fortune of the top 15 Chinese healthcare billionaires has fallen to US$84.1 billion from US$101.4 billion at the end of 2022, according to the Bloomberg Billionaires Index.\nThe drop comes as the country’s top regulators started a sweeping anti-graft campaign across the nation’s healthcare sector about two months ago. It has resulted in hundreds of hospital chiefs and pharmaceutical executives being probed, sparking a sector-wide share slump as investors chose to sell instead of guessing which companies will be hit by the clampdown.\nThe focus on healthcare comes after similar market-roiling campaigns to reform the real estate and education sectors, which banned most tutoring companies from making a profit.\n“This is a much bigger sector than online tutoring and increasingly dependent on private sector investment,” Ms Alicia Garcia Herrero, chief economist for Asia-Pacific at Natixis, said about the consequences for China’s healthcare sector. “This time around, the crackdown could exert additional pressures dampening investment.”\nIn dollar terms, Mr Chen Bang, the chairman of Aier Eye Hospital Group, has seen the biggest fall in his personal fortune. It has dropped US$3.4 billion since the beginning of the year to US$9.5 billion, after shares of the ophthalmic medical group fell about 25 per cent since January.\nShenzhen Mindray Bio-Medical Electronics co-founder Xu Hang and Zhong Huijuan, founder and chair of Hansoh Pharmaceutical, both lost about US$2.3 billion. Shenzhen Mindray’s other co-founder Li Xiting is Singapore’s richest tycoon, topping its latest Forbes’ list of billionaires. Mr Zhong, a former chemistry teacher, founded Hansoh in 1995, which has since become one of China’s largest makers of psychotropic drugs.\nShanghai United Imaging Healthcare founder Xue Min saw his fortune shrink by 44 per cent in 2023. The company completed an initial public offering in 2022 after revenue surged from scanners and X-ray systems during the Covid-19 pandemic.\nThe clampdown on the health sector was to be expected after the excess stemming from years of zero-Covid policies, Ms Garcia said.\nThe sector had until recently been growing at a breakneck pace to accommodate the country’s ageing population and expanding middle class. Yet, healthcare workers, including the nation’s 4.4 million doctors and 5.2 million nurses, have not reaped the gains in terms of wages. That has spawned practices that boost the pay of medical workers, such as companies giving kickbacks to doctors for prescribing their drugs or using their medical devices.\nThe recent clampdown spurred investor concerns that healthcare companies will see lower budget from public hospitals for medicine supplies and medical equipment, and it could hurt profitability.\nOver the past three years, high-profile crackdowns in various sectors have slashed valuations of many star companies, including Ant Group and Didi Global. Although China has signalled a more welcoming environment for businesses in the past few months and planned to set up a new agency to promote private sector growth, investors remain sceptical.\nStill, the anti-corruption campaign in healthcare may finish earlier than expected, Citigroup analysts including Mr John Yung said in a note in September. In the medium to long term, industry leaders should be able to consolidate market share and deliver higher profitability due to permanently lowered selling expenses, they said. BLOOMBERG", "url": "https://www.straitstimes.com/business/china-healthcare-tycoons-lose-24-billion-as-crackdown-spreads"}