{"authors": ["Navene Elangovan"], "date_download": "2024-10-12 13:28:41", "date_modify": "2024-10-12 13:28:41", "date_publish": "2024-09-30 19:38:44", "description": "The benchmark Straits Times Index rose 0.3 per cent or 11.93 points to 3,585.29. Read more at straitstimes.com.", "filename": "business_companies-markets_singapore-stocks-rise-in-the-wake-of-china-stimulus-measures-sti-up-03_1728739721.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/30/IMG4193.JPG?VersionId=Ad78xM_qIbX4Il_RVapbc9FNRSm7QmPB&h=18ff7f98", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_singapore-stocks-rise-in-the-wake-of-china-stimulus-measures-sti-up-03_1728739721.html", "title": "Singapore stocks rise in the wake of China stimulus measures", "title_page": "Singapore stocks rise in the wake of China stimulus measures | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Local equities kicked off the week in the black on Sept 30, a week after China announced a stimulus package.\nThe benchmark Straits Times Index (STI) rose 0.3 per cent, or 11.93 points, to 3,585.29.\nAcross the broader market, gainers outnumbered losers 392 to 236, with 1.8 billion shares worth $1.9 billion having been traded through the day.\nThe biggest gainer on the STI was offshore and marine company Seatrium, which gained 2.9 per cent to close at $1.78.\nYangzijiang Shipbuilding made the biggest drop on the index. The counter slid 2.4 per cent to close at $2.45. It was also the most actively traded counter by volume, with 42.5 million shares worth $104.5 million traded.\nChinese indexes rallied on Sept 30 in the wake of the country’s stimulus package; other markets in the region ended mixed.\nChina’s blue-chip CSI 300 Index rose 8.5 per cent to its highest level in more than a year, and the Shanghai Composite Index surged 8.1 per cent.\nMr Vasu Menon, managing director of investment strategy at OCBC Bank, said that Chinese stocks were the “darling” among global markets last week, following the unveiling of the stimulus package by the country’s central bank.\nBut while Chinese stocks have made a “spectacular rebound”, he noted that China’s market could be extremely volatile.\n“A lot hinges now on whether the latest stimulus will indeed help the economy, and whether China will follow through with aggressive fiscal stimulus as well,” Mr Menon added.\nAcross the rest of the region, Australia’s ASX 200 gained 0.7 per cent; Japan’s Nikkei fell 4.8 per cent, and South Korea’s Kospi slipped 2.1 per cent. THE BUSINESS TIMES", "url": "https://www.straitstimes.com/business/companies-markets/singapore-stocks-rise-in-the-wake-of-china-stimulus-measures-sti-up-03"}