{"authors": [], "date_download": "2024-10-12 14:14:51", "date_modify": "2024-10-12 14:14:51", "date_publish": "2022-01-06 12:42:37", "description": "Rapid slowdown after government crackdown on risky lending has made it harder to start charging the levy. Read more at straitstimes.com.", "filename": "business_property_china-property-tax-trial-likely-delayed-during-real-estate-slump_1728742491.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/01/06/mdcnevergrande06012022.jpg?VersionId=0lV5XuM9okYfwewErfgYleJmReUFKCm6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_china-property-tax-trial-likely-delayed-during-real-estate-slump_1728742491.html", "title": "China property tax trial likely delayed amid real estate slump", "title_page": "China property tax trial likely delayed amid real estate slump | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING (BLOOMBERG) - China's property tax could be another casualty of the slump in the housing market, with analysts expecting the government to hold off on expanding trials of the levy because of a real estate-led economic slowdown.\nIn October last year, China's Parliament authorised that the limited property tax in Shanghai and Chongqing be expanded to more cities, with some analysts forecasting it could begin by the end of 2021.\nHowever, the rapid deterioration of the real estate sector and the lack of any detailed implementation plan from the State Council is fanning speculation that the government is waiting for a market uptick before it starts the tax.\n\"Now may not be an appropriate time to launch the trials as the economy and the real estate market are both under pressure,\" said Peking University professor Liu Jianwen, who is also the legal adviser to the Finance Ministry and legislative adviser to the standing committee of the National People's Congress.\nAlthough the nation's top leaders are \"very cautious\" about it now, the trial will not be shelved for a long time as officials are \"very determined\" to start it, Prof Liu said last week.\nChina has been talking about rolling out a nationwide property tax to regulate the market and control soaring prices for over a decade, since before the trial began in Shanghai and Chongqing in 2011.\nNothing has happened so far, likely due to opposition from home owners and developers who are afraid the levy would push prices lower. The authorities returned to the land tax idea last year amid a broad effort led by President Xi Jinping to promote \"common prosperity\".\nAccording to an October statement from the nation's Parliament, the tax is designed to guide rational property buying and will target all kinds of residential and non-residential properties in the trial areas except rural housing.\nHowever, the rapid slowdown of the industry after the government's crackdown on risky lending and other factors such as the announcement of the tax plan have now made it harder to actually start charging the levy.\nThe government's fine-tuning of some property curbs and support for mortgages have not been enough to halt the slide, according to analysts.\n\"These are just marginal policy easing and the regulatory tone of stabilising home prices, land prices and market expectations is clear,\" Bloomberg Intelligence analysts Kristy Hung and Lisa Zhou said last week. \"It may be a better time to launch the property tax trials when the market is calm.\"\nOne sign of a recovery in sentiment would be a halt to the decline in sales that began in July, they added.\nSome analysts expect that could happen this year. \"The real estate market is expected to see signs of recovery in the first half of this year,\" according to Mr Xu Xiaole, chief market analyst at Beike Research Institute. \"Transaction volumes will likely bottom out in the first quarter and home prices may stop falling in the second quarter.\"", "url": "https://www.straitstimes.com/business/property/china-property-tax-trial-likely-delayed-during-real-estate-slump"}