{"authors": [], "date_download": "2024-10-12 14:12:43", "date_modify": "2024-10-12 14:12:43", "date_publish": "2023-11-14 08:22:00", "description": "Mr Zhang Yiming’s firm has taken two suites on the 21st floor of Two International Finance Centre. Read more at straitstimes.com.", "filename": "business_bytedance-billionaire-s-vc-firm-sets-up-shop-in-marquee-hk-tower_1728742363.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/14/3168370711-11.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_bytedance-billionaire-s-vc-firm-sets-up-shop-in-marquee-hk-tower_1728742363.html", "title": "ByteDance billionaire’s VC firm sets up shop in marquee Hong Kong tower", "title_page": "ByteDance billionaire’s VC firm sets up shop in marquee Hong Kong tower | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – ByteDance co-founder Zhang Yiming’s five-month-old venture capital firm has leased space in one of Hong Kong’s most recognisable skyscrapers, joining an influx of Chinese financial houses into the city.\nCool River Venture HK, an investment company that Mr Zhang set up in May, has taken two suites on the 21st floor of Two International Finance Centre, according to a filing with Hong Kong’s Land Registry. The fund will share the floor with CTBC Bank, a Taiwanese lender.\nMr Zhang is among China’s best-known entrepreneurs, founding the social media company that first popularised artificial intelligence-driven news services before creating the global phenomenon known as TikTok.\nHowever, the billionaire quit his corporate roles around the time Beijing began cracking down on alleged excesses by tech firms and impresarios such as fellow billionaire Jack Ma’s Alibaba Group Holding, ceding the helm to long-time confidant Liang Rubo in 2021.\nHong Kong is trying to promote itself as an Asian financial hub emerging from the barren years of Covid-19 to again help shape investment and fintech innovation around the region. Cool River itself is regarded as an indicator of Mr Zhang’s future intentions, given that the billionaire has largely stayed out of the limelight since stepping back in 2021.\nMr Zhang, who holds a Hong Kong identity card, has a fortune estimated at US$42.3 billion (S$57.5 billion), according to the Bloomberg Billionaires Index.\nCool River lists Mr Zhang as its sole director, another filing with the Hong Kong Companies Registry showed. Its only shareholder is a Cayman Islands financial vehicle named Galaxy LLC.\nEarlier in 2023, ByteDance rented a 20,000 sq ft space in the adjacent International Finance Centre, in the heart of Hong Kong’s Central area. TikTok’s owner previously set up a temporary base in a co-working space to house dozens of employees in legal and finance.\nA ByteDance spokesman did not respond to a request for comment on Monday. BLOOMBERG", "url": "https://www.straitstimes.com/business/bytedance-billionaire-s-vc-firm-sets-up-shop-in-marquee-hk-tower"}