{"authors": ["Clara Chong"], "date_download": "2024-10-12 14:19:57", "date_modify": "2024-10-12 14:19:57", "date_publish": "2023-03-02 12:00:00", "description": "These investors, including those keen to set up family offices here, will have to channel more funds to the local financial system. Read more at straitstimes.com.", "filename": "business_changes-to-global-investor-programme-to-further-support-start-ups-create-jobs-for-singaporeans_1728742797.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/02/cbd039A8691_9.jpg?VersionId=BfzIgcd9pLWzQI4tjqGSiyL90fRhYIwI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_changes-to-global-investor-programme-to-further-support-start-ups-create-jobs-for-singaporeans_1728742797.html", "title": "Foreigners must invest more, hire more S’poreans to gain PR status with changes to EDB scheme", "title_page": "Foreigners must invest more, hire more S’poreans to gain PR status with changes to EDB scheme | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Foreign businessmen will have to invest more and hire more locals to qualify to become permanent residents under the Global Investor Programme (GIP).\nThese investors, including those keen to set up family offices here, will also have to channel more funds to the local financial system.\nThe new requirements, which kick in on March 15, will therefore generate more jobs for Singaporeans such as in finance, tax, fund management and the legal sector, the Economic Development Board (EDB) said on Thursday.\nNoting that many jurisdictions around the world are competing to attract high-calibre business owners and owners of capital, the EDB said the changes are meant to “selectively attract individuals with the ability to make more economic impact for Singapore, and the affinity to be more rooted to Singapore”.\nThe GIP was launched in 2004 and last revised in March 2020. This programme accords permanent residency to eligible global investors who intend to drive their businesses and investment growth from Singapore.\nIt is part of the Government’s efforts to strengthen Singapore’s status as a key Asian node for high-growth technology companies and investment activities, grow existing and new industries, and create jobs for Singaporeans.\nBetween 2011 and 2022, GIP investors created 24,699 jobs, including for software engineers, researchers and public relations practitioners.\nBetween 2020 and 2022, a total of 200 investors attained Singapore PR status through the programme.\nSingapore is among dozens of countries, including the United States, Britain, Canada and Australia, that offer what is popularly known as the “golden visa”, aimed at attracting high-net-worth individuals who can contribute to economic activity and boost investments.\nThere are changes to all three investment options under the GIP.\nUnder the first option, new investors will have to invest at least $10 million, inclusive of existing paid-up capital, in a new business entity or existing business operation in Singapore.\nThis is up from the previous $2.5 million required. Applicants must also hire at least 30 employees, with at least half of them Singapore citizens and 10 of whom must be new employees, to be eligible for Re-entry Permit Renewal after the initial five-year period.\nUnder the second option, applicants will be required to invest $25 million in a GIP-selected fund. These funds will be shortlisted by EDB based on their track record, investment mandate in Singapore and the type of industries or markets they focus on.\nPreviously, applicants had to allocate only $2.5 million in a GIP fund that invests at least 50 per cent in Singapore-based companies upon in-principle approval.\nUnder the third investment option, applicants will be required to establish a Singapore-based single family office with assets under management of at least $200 million, of which at least $50 million must be deployed and maintained in certain investment categories, such as companies listed on the Singapore Exchange’s mainboard and secondary Catalist board.\n“Since it was introduced, the GIP has been successful in attracting high-calibre applicants who value Singapore’s stability, competitive business environment, skilled talent pool and global connectivity,” said Mr Matthew Lee, senior vice-president of Contact Singapore, a division of EDB that oversees the GIP.\nMr Desmond Teo, Ernst and Young’s Asean private tax leader, said the refinements will not only encourage the growth of businesses and capital accumulated in Singapore, but also boost employment opportunities for Singaporeans.\nThe asset management industry here will stand to gain, he noted, as the programme applicants could be a rich source of funds for the GIP select funds distributed by Singapore-based fund managers. Another beneficiary will be the Singapore-based portfolio companies these funds will invest into.\n“In a world of elevated funding costs where competition for capital is getting fiercer, these updates will place Singapore in a stronger position to attract global capital as a top-notch wealth management hub,” he added.", "url": "https://www.straitstimes.com/business/changes-to-global-investor-programme-to-further-support-start-ups-create-jobs-for-singaporeans"}