{"authors": ["Timothy Goh"], "date_download": "2024-10-12 14:20:51", "date_modify": "2024-10-12 14:20:51", "date_publish": "2023-07-11 20:40:00", "description": "Areas targeted include digital marketing, visual merchandising, service excellence, and financial management. Read more at straitstimes.com.", "filename": "business_more-support-for-heartland-firms-to-boost-digital-capabilities-post-covid-19_1728742851.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/11/2023071173046346snapseed7_9.jpg?VersionId=LzeXlNGagUYpOgN9LqGroLb_A4MOhwpV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_more-support-for-heartland-firms-to-boost-digital-capabilities-post-covid-19_1728742851.html", "title": "More support for heartland businesses to boost digital capabilities post-Covid-19", "title_page": "More support for heartland businesses to boost digital capabilities post-Covid-19 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Businesses in the heartland are receiving additional support to expand their digital capabilities in areas such as digital marketing, visual merchandising, service excellence and financial management.\nUnder the new Heartlands Go Digital (HGD) 3.0 initiative, which was first announced at the Committee of Supply debates in March, two new training programmes have been introduced – Service Excellence and Financial Management advisories and in-shop training.\nThe service excellence advisory introduced in January is designed for heartland enterprises that are interested in improving the service experience to attract more customers. An example is using a messaging platform like WhatsApp to follow up with customers.\nThe financial management programme, which was rolled out in June, will support heartland businesses in deepening their understanding of financial management, such as through the use of digital accounting and inventory management systems.\nBoth initiatives will have advisers from Heartland Enterprise Centre Singapore providing tailored advisory for the businesses.\nHGD was launched in October 2020 to spur the adoption of e-payments and digital commerce solutions among heartland enterprises, such as F&B and retail shops. It was a collaboration between Enterprise Singapore, Heartland Enterprise Centre Singapore, and Federation of Merchants’ Associations Singapore.\nAt a walkabout in Ang Mo Kio town centre on Tuesday, Minister of State for Trade and Industry Low Yen Ling said that HGD was first developed to support heartland enterprises during the height of the pandemic, when human traffic was low due to the circuit breaker and businesses suffered.\n“Our concern back then was to support our heartland enterprises to pivot away from manual, paper-based, in-person transactions,” she said.\nAccording to Ms Low, the objective of HGD 3.0 is to help heartland enterprises “spread their wings” in three ways.\nThe first is to use digital marketing, visual merchandising, service excellence and financial management to grow their revenue.\nSecond, Ms Low said, “it is to improve their operational efficiency – we can actually help to redesign certain jobs and cut down on manpower”.\n“The third one is to really help them attract new customers who, because of their busy schedules, cannot step into the shop but can easily press a button to order products,” she said.\nEligible participants can receive a one-time support to defray up to 70 per cent of their project costs, capped at $8,400. The previous grant was capped at 80 per cent, up to a maximum of $4,000.\nMr Daniel Yeo, co-founder of tuition centre New Dawn Learning Studio and co-working space Wings of the Dawn in Ang Mo Kio, said that his businesses have benefited from the visual merchandising programme.\nCiting how consultants worked with them to create assets like their signage, as well as give advice on how to display it to increase visibility, Mr Yeo said: “It enables customers to locate us more easily because previously they really could not find us. We have more walk-ins.”\nHe added that sales have improved by about 20 to 30 per cent.", "url": "https://www.straitstimes.com/business/more-support-for-heartland-firms-to-boost-digital-capabilities-post-covid-19"}