{"authors": ["Prisca Ang"], "date_download": "2024-10-12 14:19:56", "date_modify": "2024-10-12 14:19:56", "date_publish": "2024-01-12 18:00:00", "description": "Besides bonds, equities are also likely to benefit from an easing of financial conditions along with falling rates, said BOS. Read more at straitstimes.com.", "filename": "business_fixed-income-assets-such-as-bonds-likely-to-star-in-2024-on-interest-rate-cuts-bank-of-singapore_1728742796.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/12/IMG6471.JPG.JPEG?h=75596b1e", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_fixed-income-assets-such-as-bonds-likely-to-star-in-2024-on-interest-rate-cuts-bank-of-singapore_1728742796.html", "title": "Fixed income assets such as bonds likely to star in 2024 on interest rate cuts: Bank of Singapore", "title_page": "Fixed income assets such as bonds likely to star in 2024 on interest rate cuts: Bank of Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The US Federal Reserve’s pivot towards interest rate cuts in 2024 is expected to create more opportunities in fixed income assets such as bonds, said the Bank of Singapore (BOS) on Jan 11.\nBOS chief economist Mansoor Mohi-uddin said high yields on bonds are currently helping investors beat inflation but beyond that, upcoming cuts by global central banks will allow bond investors to benefit from capital gains.\n“We think that investors should be looking at fixed income very favourably in 2024,” he said at a conference attended by 800 clients of OCBC’s private banking arm at Marina Bay Sands.\nBond prices are inversely related to interest rates, meaning that rate cuts would generally push the prices of older bonds up as they become more attractive to investors.\nUS Treasuries and developed market investment-grade bonds offer the longest durations and are thus the most sensitive to falling interest rates, said Mr Mohi-uddin.\n“These are bonds that will give you hedges against recession risks. They are safe haven assets that will be in demand,” he said, advising clients to consider those with maturities of between eight and 15 years.\nBOS forecasts that the 10-year US Treasury yield will likely climb to 4.25 per cent by March, three months before the bank expects the Fed to make its first rate cut.\nThe yield stood at 3.98 per cent as at Jan 11. It will likely drop to 3.75 per cent after the Fed’s first cut, before retreating further to 3.25 per cent by the end of the year, it noted.\nIts forecasts show that the market will return to a normal trend of lower yields for short-term Treasury debt such as two-year notes – which BOS expects will end the year at 3 per cent – and higher yields for long-term bonds like the 30-year bond, with an estimated yield of 3.4 per cent.\nThe reverse has been true since mid- to late 2022, with longer-term yields falling below those of shorter maturities, signalling bond buyers’ expectations of an economic slowdown.\nBOS’ forecasts come even as it predicts a 50 per cent chance of a mild US recession for two quarters in mid-2024 as the lagged effects of higher rates continue to drag on growth.\nCore inflation is expected to drop below 3 per cent in this scenario.\nBOS chief investment strategist Eli Lee told The Straits Times that the rate cuts the bank expects in 2024 are quite measured, and this is in line with its expectations for a mild slowdown in US output expansion.\n“We expect the long-end rates to move by a broadly similar quantum, which will yield compelling returns given the duration impact,” he said.\nBesides bonds, equities are also likely to benefit from an easing of financial conditions along with falling rates, said BOS.\nThe bank highlighted markets such as Japan, which it said is going through constructive corporate reforms, and sectors such as technology, healthcare, consumer staples and utilities.\nInvestors should also note that 2024 will be the biggest election year in history, with 40 national elections across the globe, said BOS.\n“The 2024 geopolitical landscape will be tumultuous. We do not rule out increased market volatility amid potential heightened geopolitical tensions between China and the US as we head into Taiwan’s elections (on Jan 13) and the US presidential election in November,” it said in a report.\nBOS added that investors should consider adding gold and alternative assets to make their portfolios more resilient.\n“In currencies, we see the yen significantly outperforming in 2024, when we expect the Bank of Japan to further normalise policy... On the other hand, a mild recession and potential rate cuts in the US could result in a gradual US dollar descent this year,” it added.", "url": "https://www.straitstimes.com/business/fixed-income-assets-such-as-bonds-likely-to-star-in-2024-on-interest-rate-cuts-bank-of-singapore"}