{"authors": ["Ven Sreenivasan"], "date_download": "2024-10-12 13:44:43", "date_modify": "2024-10-12 13:44:43", "date_publish": "2023-07-28 09:00:00", "description": "This follows its record full year earnings to end-March 2023 of $2.16 billion – the highest net profit in its 76-year history. Read more at straitstimes.com.", "filename": "business_cgs-cimb-downgrades-sia-stock-citing-rising-fuel-costs_1728740683.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/28/IMGSIA11672SG1B.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_cgs-cimb-downgrades-sia-stock-citing-rising-fuel-costs_1728740683.html", "title": "CGS CIMB downgrades SIA stock, citing rising fuel costs", "title_page": "CGS CIMB downgrades SIA stock, citing rising fuel costs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Investment house CGS CIMB has called a “reduce” on Singapore Airlines (SIA) stock and stamped a target price of $6.78, despite the airline group posting another set of record results this week.\nSIA closed at $7.58 on Friday.\nThe report comes a day after SIA unveiled a net profit of $734 million for the April-to-June first quarter of the current financial year, a 98.4 per cent increase from the $370 million net profit for the same period a year earlier.\nThe airline group’s topline revenue rose 14 per cent year on year to $4.5 billion, from $3.9 billion a year ago as passenger-flown revenue grew 37.4 per cent to $1 billion, partially offsetting a 50.6 per cent decline in cargo-flown revenue.\nThis follows its record full-year earnings to end-March 2023 of $2.16 billion – the highest net profit in its 76-year history – and a massive rebound from a loss of $962 million a year earlier.\nBut analyst Raymond Yap of CGS CIMB fears that rising fuel costs will take the fizz away from future earnings.\nWhile acknowledging that passenger load numbers will remain robust for the rest of the current financial year ending March 2024, he noted that jet fuel prices, which averaged only US$92 a barrel during the April-to-June 2023 first quarter, have since risen to US$108 a barrel as at July 27.\n“We estimate that every US$1 per barrel increase in jet fuel prices will negatively impact our FY2024 forecast core net profit by 2 per cent, and in the same way that low jet fuel prices played an important role in SIA’s strong first quarter performance, recovering jet fuel prices in second quarter FY2024 may deduct from SIA’s profits moving forward,” he wrote.\n“Also, SIA’s legacy fuel hedges all expired at end-June 2023, and the remaining hedge positions are at prices closer to prevailing market levels, which suggest that fuel hedging gains, if any, may be narrowed in the quarters ahead.”\nMr Yap noted that earnings before interest and tax was “only” 7.4 per cent higher quarter on quarter, but the superior 28 per cent quarter-on-quarter rise in core net profit may have been due to stronger associate profits, higher net interest income or lower tax provisions.\nHe warned that SIA’s expensive valuations could expose investors to de-rating catalysts such as intensifying competition from other airlines, particularly during the next financial year (April 2024 to March 2025).\nThat said, the report acknowledged upside risks to its forecast such as the potential for SIA to outperform the investment house’s assumptions for yield, passenger load factor and other revenue metrics.\nDespite the downbeat report, CGS CIMB seemed to hint at another record earnings year for FY2024 for the airline. It expects SIA to post core net profit of $2.5 billion at end-March 2024, boosted by low jet fuel prices, which it reiterated “will likely peak this year”. Core net profit in 2022 was $1.9 billion.\nMr Yap also forecast SIA paying out a dividend per share of 38 cents for the current financial year, up from a dividend per share of 28 cents it paid for the last financial year.", "url": "https://www.straitstimes.com/business/cgs-cimb-downgrades-sia-stock-citing-rising-fuel-costs"}