{"authors": [], "date_download": "2024-10-12 14:15:02", "date_modify": "2024-10-12 14:15:02", "date_publish": "2020-05-26 08:53:58", "description": "SINGAPORE (THE BUSINESS TIMES) - Hopes for at least some growth in the key non-oil domestic exports (Nodx) this year has given way to a projection of up to a 4.0 per cent drop, as the Covid-19 pandemic continues to put a near-freeze on movements and economic activities. Read more at straitstimes.com.", "filename": "business_economy_singapore-non-oil-exports-forecast-to-shrink-by-1-to-4-this-year_1728742502.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/05/26/nz_nodx_260547.jpg?VersionId=pjzdVTen7xMb29xJnniAfEp.LG26K4cE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_singapore-non-oil-exports-forecast-to-shrink-by-1-to-4-this-year_1728742502.html", "title": "Singapore non-oil exports forecast to shrink by 1 to 4% this year", "title_page": "Singapore non-oil exports forecast to shrink by 1 to 4% this year | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE (THE BUSINESS TIMES) - Hopes for at least some growth in the key non-oil domestic exports (Nodx) this year has given way to a projection of up to a 4.0 per cent drop, as the Covid-19 pandemic continues to put a near-freeze on movements and economic activities.\nTrade promotion agency Enterprise Singapore (ESG) has downgraded its 2020 forecast for Nodx to -4.0 to -1.0 per cent growth, from its most recent -0.5 to +1.5 per cent growth projection made just three months ago in February.\nThe latest revision came despite Nodx posting a 5.8 per cent year-on-year increase in the first three months of the year, thanks largely to a low base a year ago. Nodx slipped by around 7 per cent in the first quarter of 2019 and plunged 9.2 per cent for the full year, the worst showing since the 2009 recession.\nESG tips total merchandise trade, which rose just 0.6 per cent in the first quarter after declining since the second quarter of 2019, to dive -12 to -9.0 per cent in 2020.\nEven though many countries are starting to reopen their economies, ESG said \"the global economy and trade are now expected to contract instead of grow in 2020 amid an escalation of the Covid-19 outbreak worldwide since February, with dampened outlook for most of our key trade partners; lower oil prices amid weakened demand to further weigh on our trade\".\nNodx to Singapore's top 10 markets posted an increase in January-March this year, but shipments to China, Hong Kong, Malaysia and Indonesia fell. The biggest contributors to the rise were the US (+23.1 per cent), Thailand (+46.9 per cent) and the European Union (+15.1 per cent).\nNon-oil exports increased 4.0 per cent year on year in the first quarter of 2020. Non-oil re-exports also rose 2.9 per cent in the same period. But total services trade fell 3.5 per cent to S$129.5 billion in the first quarter this year.", "url": "https://www.straitstimes.com/business/economy/singapore-non-oil-exports-forecast-to-shrink-by-1-to-4-this-year"}