{"authors": [], "date_download": "2024-10-12 14:20:12", "date_modify": "2024-10-12 14:20:12", "date_publish": "2023-11-27 13:44:00", "description": "It will unwind projects under development and weigh potential sales of existing titles, sources say Read more at straitstimes.com.", "filename": "business_companies-markets_bytedance-fires-hundreds-slashes-games-arm-in-major-retreat_1728742812.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/27/aibytedance271123.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_bytedance-fires-hundreds-slashes-games-arm-in-major-retreat_1728742812.html", "title": "ByteDance fires hundreds, slashes games arm in major retreat", "title_page": "ByteDance fires hundreds, slashes games arm in major retreat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – ByteDance plans to cut hundreds of jobs in gaming and wind down its showpiece brand Nuverse in a major withdrawal from the sector, handing a victory to rival Tencent Holdings.\nTikTok’s owner will fire several hundred people, unwind projects under development and weigh potential sales of existing titles, people familiar with the matter said. The Chinese company intends to announce the move on Nov 27, one person added, asking to remain anonymous discussing a private deal.\nThe closure marks ByteDance’s biggest retreat from a once-booming gaming industry dominated by Tencent and its smaller foe NetEase. The start-up, known for short-video platforms TikTok and Douyin, has gradually scaled back its gaming ambitions in the post-Covid-19 era after failing to grab market share from Tencent. The Beijing-based firm is considering selling Shanghai Moonton Technology, a high-profile studio it acquired for US$4 billion (S$5.35 billion) in 2021, Bloomberg News has reported.\n“We regularly review our businesses and make adjustments to centre on long-term strategic growth areas. Following a recent review, we’ve made the difficult decision to restructure our gaming business,” a ByteDance spokesperson said. Reuters earlier reported on the move.\nByteDance, founded more than a decade ago by Mr Zhang Yiming and Mr Liang Rubo, grew into an Internet leader worth more than US$200 billion thanks to the virality of TikTok and Douyin. In recent years, it bought studios and exclusive distribution rights to titles, hoping to get into the games business much as it disrupted social media players from Meta Platforms to Tencent.\nThe start-up’s pullback comes as the Chinese mobile gaming sector – the world’s largest – struggles to regain its pandemic-era heights during a global downturn. Tencent, however, has managed to sustain growth, driven by its industry-leading portfolio as well as resilient consumption in cheaper segments such as online entertainment.\nBut games creation is a notoriously fickle business. Since 2022, ByteDance had begun to shutter in-house studios and slash development jobs, after shifting its focus to core businesses like short-video and e-commerce. In November, it also cut almost a quarter of its staff at virtual-reality arm Pico.\nOne of ByteDance’s biggest hits is Crystal Of Atlan, an action role-playing mobile game which debuted to much fanfare over the summer. Globally, the TikTok owner publishes the hit card game Marvel Snap, which is developed by United States studio Second Dinner.\nDespite its best efforts, Tencent remains the undisputed leader of the sphere. The company, which benefits from the enormous user traffic that flows through its all-in-one messaging service WeChat, has amassed a large library of content both in China and abroad through acquisitions. BLOOMBERG", "url": "https://www.straitstimes.com/business/companies-markets/bytedance-fires-hundreds-slashes-games-arm-in-major-retreat"}