{"authors": ["Michelle Ng"], "date_download": "2024-10-12 14:14:09", "date_modify": "2024-10-12 14:14:09", "date_publish": "2021-01-04 10:55:36", "description": "For the whole of 2020, however, prices rose 2.2 per cent, less than the 2.7 per cent gain in 2019. Read more at straitstimes.com.", "filename": "business_property_spore-private-home-prices-rise-21-in-q4-fastest-pace-since-cooling-measures-ura_1728742449.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/01/04/rk_skyville_040121.jpg?VersionId=yoz3LtTqGkJQ1L6YFr0pEKLv3QwmjTof", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_spore-private-home-prices-rise-21-in-q4-fastest-pace-since-cooling-measures-ura_1728742449.html", "title": "Singapore private home prices rise 2.1% in Q4, fastest pace since mid-2018", "title_page": "Singapore private home prices rise 2.1% in Q4, fastest pace since mid-2018 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Prices of private homes in Singapore rose for a third consecutive quarter, defying the Covid-19 pandemic and a recession.\nThe overall price index for private residential properties climbed 2.1 per cent in the fourth quarter of 2020, faster than the 0.8 per cent increase in the third quarter, according to flash estimates from the Urban Redevelopment Authority (URA) on Monday (Jan 4).\nThis is the steepest quarterly increase since the second quarter of 2018 when private home prices rose by 3.4 per cent before property cooling measures hit in July that year.\nFor the whole of 2020, however, private home prices increased by 2.2 per cent, less than the 2.7 per cent gain in 2019.\nThe price increase in the fourth quarter was driven mainly by the prices of private homes in the rest of central region (RCR) and core central region (CCR), which rose quarter-on-quarter by 4.8 per cent and 3.3 per cent respectively.\nPrices in the outside central region (OCR) rose 1.7 per cent, same as the previous quarter.\nFor the whole of 2020, prices in RCR and OCR increased the most by 5.1 per cent and 3.1 per cent respectively, while prices in CCR decreased by 0.2 per cent.\nSome new projects launched in the fourth quarter of 2020 could have driven prices up, said Ms Christine Sun, head of research and consultancy at OrangeTee & Tie.\nIn the RCR, the median price of new units at The Landmark near Outram Park MRT was $2,137 per square foot (psf) while The Linq @ Beauty World in Upper Bukit Timah saw $2,171 psf, above the $1,813 psf median price for all new condo units in the region in 2020.\nIn the OCR, the median price of new units at Clavon in Clementi was $1,637 psf, Ki Residences at Brookvale was $1,766 psf and Midwood in Hillview was $1,624 psf.\nAll these projects were similarly transacted above the $1,547 psf median price for all new condo units in the region in 2020.\nMs Sun noted that prices have also increased at many newly launched condo projects.\nFor instance, in CCR, the median price of Fourth Avenue Residences in Bukit Timah rose from $2,258 psf in the third quarter of 2020 to $2,296 psf in the fourth quarter of 2020. Prices at Kopar at Newton have also increased from $2,384 psf to $2,433 psf over the same period.\nSimilar price increases were observed at other projects such as Treasure at Tampines, Jadescape and Forett at Bukit Timah, Ms Sun added.\nColliers International head of research for Singapore Tricia Song said developers sold 2,381 new private homes, excluding executive condos, in the last three months of 2020, down by 32.3 per cent quarter-on-quarter and a marginal 2.5 per cent decline year-on-year.\nThis should bring full year new sales to 9,760 units, down 1.5 per cent from 9,912 units in 2019, she said.\nSales in the secondary market was more resilient in the fourth quarter of 2020, falling just 5.6 per cent quarter-on-quarter but up 36.9 per cent year-on-year. This brings full year secondary sales to 9,905 units, up 7.2 per cent from 9,238 units in 2019, said Ms Song.\nHuttons Asia head of research Lee Sze Teck said up to 20 new launches can be expected in the first quarter of this year, with some 9,000 new units and a price increase up to 3 per cent this year.\n\"Selling prices are expected to edge up because of recent firm land tender prices and higher construction costs because of Covid-19 safety management measures,\" he said.", "url": "https://www.straitstimes.com/business/property/spore-private-home-prices-rise-21-in-q4-fastest-pace-since-cooling-measures-ura"}