{"authors": [], "date_download": "2024-10-12 14:14:05", "date_modify": "2024-10-12 14:14:05", "date_publish": "2022-06-21 09:20:40", "description": "The world's most indebted property developer is struggling to emerge from its financial crisis. Read more at straitstimes.com.", "filename": "business_property_china-evergrande-sticks-to-restructuring-plan-target-of-before-end-of-july_1728742445.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/21/dw-evergrande-220621.jpg?VersionId=PDMdHx10b_Zf3QE7npxNlrE7OhPpDWQW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_china-evergrande-sticks-to-restructuring-plan-target-of-before-end-of-july_1728742445.html", "title": "China Evergrande sticks to restructuring plan target of before end of July", "title_page": "China Evergrande sticks to restructuring plan target of before end of July | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (REUTERS) - China Evergrande Group said it expects to announce its preliminary restructuring plan before the end of July, sticking to its original deadline as the world’s most indebted property developer struggles to emerge from its financial crisis.\nReeling under more than US$300 billion (S$416.5 billion) in liabilities, the firm’s offshore debt is deemed to be in default after missing payment obligations late last year.\nIn a stock exchange filing late on Monday (June 20), Evergrande also said it does not have a timeline for publishing its 2021 annual results or completing a probe in its property services unit.\nShares of embattled Evergrande have been suspended from trading since March 21 as it was not able to deliver its financial results on time and its unit Evergrande Property Services Group had launched an investigation into how banks seized 13.4 billion yuan (S$2.78 billion) in deposits that had been pledged as security for third party guarantees.\nEvergrande said the Hong Kong Stock Exchange had advised the firm that it must remedy the issues causing its trading suspension by Sept 20, 2023, to avoid possible delisting of its shares.\n“The Stock Exchange also has the right to impose a shorter specific remedial period, where appropriate,” Evergrande said, citing the stock exchange in the filing.\nIt also said it was “actively pushing forward with its restructuring work”, and expects to announce its plan before the end of July, in line with its original deadline announced in late January.\nIn the proposal, Evergrande was considering repaying offshore public bondholders owed around US$19 billion with cash instalments and equity in its two Hong Kong-listed units, Reuters reported last month.\nOffshore bonds of Evergrande were trading at around 9 cents on the dollar on Tuesday, according to data by Duration Finance.\nIts units, China Evergrande New Energy Vehicle and Evergrande Property Services, issued similar releases separately. Their shares are also under suspension, and will remain so until further notice, they said.", "url": "https://www.straitstimes.com/business/property/china-evergrande-sticks-to-restructuring-plan-target-of-before-end-of-july"}