{"authors": [], "date_download": "2024-10-12 14:11:13", "date_modify": "2024-10-12 14:11:13", "date_publish": "2024-03-22 13:08:23", "description": "The accounting giant is also dealing with the fallout of other scandals in its global network. Read more at straitstimes.com.", "filename": "business_china-examining-pwc-role-in-1048-billion-evergrande-fraud-case_1728742273.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/22/2024-03-01T033700Z423958568RC2QC6A857E3RTRMADP3CHINA-EVERGRANDE-DEBT-HONGKONG.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-examining-pwc-role-in-1048-billion-evergrande-fraud-case_1728742273.html", "title": "China examining PwC role in $105 billion Evergrande fraud case", "title_page": "China examining PwC role in $105 billion Evergrande fraud case | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI - The Chinese authorities are examining the role of PricewaterhouseCoopers (PwC) in China Evergrande Group’s accounting practices after the developer was accused of a US$78 billion (S$105 billion) fraud, ramping up pressure on the global accounting giant that audited a slew of developers before the sector’s meltdown.\nThe country’s securities regulator this week accused Evergrande’s main onshore subsidiary Hengda Real Estate Group of recognising sales in advance and massively overstating its revenue in the two years to end-2020, prior to Evergrande’s default.\nChinese officials are now looking into PwC as they continue their probes of the developer’s founder Hui Ka Yan, according to people familiar with the matter. They are in contact with some former PwC accountants who handled Evergrande’s audit, one of the people said.\nNo decision has been made on whether to penalise the auditor, said the people, adding that officials are still investigating other suspected crimes of Hui, who was detained in 2023. PwC declined to comment.\nBeijing’s fresh revelations of Evergrande’s fraud come at a difficult time for PwC, which is dealing with the fallout of scandals in other parts of its global network, and has cut jobs from Britain to Canada. The firm’s practice in Australia – which is also slashing jobs – came under fire for leaking confidential government tax plans to clients. PwC’s British arm was hit with a £5.6 million (S$9.5 million) fine in 2023 for failures in its work on Babcock International Group’s books.\n“There are serious questions about PwC’s role in the Evergrande fraud, specifically what it knew about the improper revenue recognition,” said Mr Nigel Stevenson, an analyst at accounting research firm GMT Research in Hong Kong.\nGMT has previously questioned the accuracy of Evergrande’s financial reporting, and alleged in December 2023 that the developer may have never been profitable. In response, Evergrande said the research firm’s recent report was “without basis”.\nBy inflating revenue, Hengda also overstated a total of 91.9 billion yuan (S$17.3 billion) in profit, or more than three-quarters of its reported income between 2019 and 2020, according to the China Securities Regulatory Commission. That is about 20 times the inflated profit at Enron’s 2001 scandal, which ultimately brought down its auditor Arthur Andersen.\nPrior to 2021, Evergrande recorded revenue from contracted sales of many projects before completing and delivering the homes to buyers. Its aggressive revenue-recognition tactics enabled the developer to report lower liabilities and leverage ratios during those years, which facilitated its sales of domestic and international bonds. The world’s most indebted developer began having cash flow problems in 2021 and spiralled into default, imperilling millions of apartment units that it had pre-sold to buyers but had not completed.\nWhile Chinese regulators laid much of the blame on Evergrande’s Hui, their allegation could create legal trouble for PwC. Evergrande is currently going through liquidation proceedings in Hong Kong, and liquidators that are trying to recover money for the company’s creditors may go after deep-pocketed PwC for compensation, according to several lawyers and insolvency practitioners, who asked not to be identified discussing a sensitive matter.\nThe regulator’s fine of 4.18 billion yuan on Hengda also means Evergrande will have even less money to pay off its creditors. The Chinese developer was saddled with about US$332 billion in liabilities as at June 2023.\nThe Chinese authorities have previously come down hard on accounting firms for lapses in their audits of domestic companies. In 2023, the Ministry of Finance slapped a record 212 million yuan fine on Deloitte’s China unit and suspended the operations of its Beijing office for three months for “serious audit deficiencies” in its work on state-owned China Huarong Asset Management between 2014 and 2019. The bad-debt manager received a US$6.6 billion bailout in 2021 after reporting massive losses.\nPricewaterhouseCoopers Zhong Tian, a Shanghai-registered firm that is part of PwC’s global network, was Hengda’s auditor during the period in question. PwC was Evergrande’s auditor for more than a decade until the global accounting firm resigned in January 2023, due to what the developer said were audit-related disagreements.\nPwC’s onshore arm, with more than 1,600 certified accountants, reported revenue of 7.9 billion yuan in 2022, making it the top earner among more than 9,000 local rivals, according to official data. Still, that is a fraction of its global revenue of US$50.3 billion during the year.\nAmong the Big Four accounting firms, PwC was one of the most commonly used by Chinese real estate firms listed in Hong Kong, according to data compiled by Bloomberg. It audited the books of some of the nation’s largest developers, including Country Garden Holdings and Sunac China Holdings, before they also defaulted on their debt.\nOver the past two years, however, PwC has resigned from at least 10 Chinese property companies including Sunac and Shimao Group Holdings, data compiled by Bloomberg showed.\n“We weren’t aware that Evergrande was doing anything different from the rest of the industry,” said Mr Tyran Kam, head of China property at Fitch Ratings. “Based on the information available to us, Evergrande’s revenue recognition and other accounting policies were generally perceived to be similar to the accounting practices to many of its listed peers,” he added.\nThat said, while many Chinese developers have stated in their annual reports similar revenue-recognition policies, Evergrande may have pushed the limits further.\nPwC is also being investigated by Hong Kong’s Financial Reporting Council in 2021, after it failed to identify Evergrande’s inability to operate as a going concern. The inquiry by the city’s accounting watchdog was on Evergrande’s 2020 annual accounts and 2021 interim report.\n“The issue is that the auditing process is fundamentally broken, conflicted and, at times, corrupted,” said Dr Tom Kirchmaier, professor at the Centre for Economic Performance at the London School of Economics. “Hence, the problem might be bigger than PwC.” BLOOMBERG", "url": "https://www.straitstimes.com/business/china-examining-pwc-role-in-1048-billion-evergrande-fraud-case"}