{"authors": [], "date_download": "2024-10-12 14:12:24", "date_modify": "2024-10-12 14:12:24", "date_publish": "2023-10-24 09:45:00", "description": "With US$186 billion of total liabilities, Country Garden is one of the world’s most indebted developers. Read more at straitstimes.com.", "filename": "business_country-garden-creditors-seek-ruling-on-failure-to-pay-event_1728742344.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/24/2023-10-19T033238Z378126330RC22Q2AAYV4XRTRMADP3CHINA-PROPERTY-DEBT-COUNTRY-GARDEN.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_country-garden-creditors-seek-ruling-on-failure-to-pay-event_1728742344.html", "title": "Country Garden creditor seeks ruling on failure-to-pay event", "title_page": "Country Garden creditor seeks ruling on failure-to-pay event | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – The Credit Derivatives Determinations Committees were asked if Country Garden Holdings’ missed US dollar bond interest payment would trigger credit default swaps tied to the developer’s debt, according to a notice posted on Monday.\nThe determinations committees were set up in 2009 by the International Swaps and Derivatives Association, in the aftermath of the global financial crisis, among reforms designed to strengthen credit derivatives markets.\nA panel of banks and investment managers was asked by an eligible market participant if a failure-to-pay event had occurred after the company skipped an interest payment on its 6.15 per cent dollar bonds due on Sept 17. A 30-day grace period on the US$15.4 million (S$21 million) interest payment expired last week, and a default can be called after that.\nChina’s former top builder has remained silent after saying in a statement to Bloomberg News last week that it does not expect to meet all of its offshore payments on time, citing China’s home market weakness and subdued sales.\nThe company added that it hopes to seek a “holistic solution” to its debt problems.\nWith US$186 billion of total liabilities, Country Garden is one of the world’s most indebted developers, and has come to symbolise China’s broader property woes.\nCreditors are now examining whether the latest payment failure will trigger a cross-default on other debt, and when the company will deliver a restructuring blueprint.\nCountry Garden’s debt now trades for pennies on the dollar. The 6.15 per cent note due in 2025 last traded for under 10 US cents, according to Trace bond pricing data. BLOOMBERG", "url": "https://www.straitstimes.com/business/country-garden-creditors-seek-ruling-on-failure-to-pay-event"}