{"authors": [], "date_download": "2024-10-12 13:27:02", "date_modify": "2024-10-12 13:27:02", "date_publish": "2024-10-11 08:03:40", "description": "The bungalow at Nassim Road is owned by Hong Fok Corp joint CEO Cheong Pin Chuan and his wife. Read more at straitstimes.com.", "filename": "business_property_nassim-road-good-class-bungalow-on-sale-for-record-308-million-after-failed-attempts_1728739622.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/Nassim20Road-09.jpg?VersionId=TNS5A2JO7eQ.OeSIsCe27ijKvAY8Rw6_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_nassim-road-good-class-bungalow-on-sale-for-record-308-million-after-failed-attempts_1728739622.html", "title": "Singapore mansion on sale for record $308 million after failed attempts", "title_page": "Singapore mansion on sale for record $308 million after failed attempts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A luxury mansion in Singapore’s most exclusive neighbourhood is being put on the market for $308 million, following at least two unsuccessful attempts to sell it previously.\nThe good class bungalow (GCB) at Nassim Road – which sits near the Orchard Road shopping belt – spans a total land area of more than 58,000 sq ft. The property is labelled as a conservation bungalow, which means it needs to be preserved, and houses a front garden that can be split into two more plots to construct more mansions.\nThe Nassim Road mansion is owned by Mr Cheong Pin Chuan, joint chief executive of Singapore property investment firm Hong Fok Corporation, and his wife. It is being marketed by Realstar Premier Group.\nA successful sale would be a record absolute price for such assets, according to The Business Times, but it will not be easy securing a buyer at that price tag.\nThe property was put on sale for $175 million in 2019 and again marketed by property consultancy CBRE Group in 2022. It failed to sell in both instances.\nSingapore’s mansion market is seeing a recovery in interest, with some high-profile transactions, although many local buyers are still wary of big ticket transactions.\nSome assets have seen their asking prices slashed, including a GCB in Tanglin Hill belonging to convicted Hin Leong founder O.K. Lim that was sold for $39.2 million in August, nearly $4 million off its original asking price.\nThe Cheongs’ property is diagonally opposite another GCB on Nassim Road which Wing Tai chairman Cheng Wai Keung and his wife sold for $230 million in 2019 – believed to be the biggest GCB transaction to date. The buyer was reported to be an entity linked to Facebook co-founder Eduardo Saverin, who became a Singapore citizen and moved here.\nTypically, a person has to be a Singapore citizen before you can buy a GCB or landed property in Singapore. BLOOMBERG", "url": "https://www.straitstimes.com/business/property/nassim-road-good-class-bungalow-on-sale-for-record-308-million-after-failed-attempts"}