{"authors": [], "date_download": "2024-10-12 14:09:52", "date_modify": "2024-10-12 14:09:52", "date_publish": "2024-01-19 17:59:00", "description": "The number of sponsored equity funds and balanced funds jumped nearly 40 per cent to 122 in 2023 Read more at straitstimes.com.", "filename": "business_chinese-fund-managers-dig-deep-into-own-pockets-to-launch-equity-funds_1728742192.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/19/yaohui-pixchina-6049.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_chinese-fund-managers-dig-deep-into-own-pockets-to-launch-equity-funds_1728742192.html", "title": "Chinese fund managers dig deep into own pockets to launch equity funds", "title_page": "Chinese fund managers dig deep into own pockets to launch equity funds | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI/SINGAPORE - In the face of intense pressure from the authorities to help revive a sickly stock market, Chinese fund management companies are increasingly launching equity funds that are bankrolled mostly by the firms’ own money.\nChina’s securities regulator has been nudging fund managers to prioritise the launch of equity products as the authorities scramble to revive a stock market plumbing five-year lows. In recent informal guidance, the regulator told some fund managers they needed to launch at least four equity funds before they open any new bond fund, in hopes of propping up the stock market in a way that some analysts think is unlikely to succeed.\nTorn between the regulator’s guidance and investors’ apathy towards equities in an ailing economy, mutual fund companies are increasingly setting up so-called “sponsored funds”.\nUnder Chinese regulations, fund management companies can kick off sponsored funds with just 10 million yuan (S$1.89 million) of seed money that must remain in the fund for three years. That compares to the normal requirement for new funds to have at least 200 million yuan of assets and 200 investors before the launch.\n“Fund performance is ugly and clients are suffering from losses, so money managers have to take money out of their own pockets,” said hedge fund manager Zhang Kaihua. “What else can they do?“\nThe number of sponsored equity funds and balanced funds that invest in both stocks and bonds jumped nearly 40 per cent to 122 in 2023, according to fund consultancy Z-Ben Advisors.\nDespite the burst of such funds, China’s blue-chip index has extended its decline in the new year, casting doubts over the effectiveness of the raft of policy measures regulators have announced since the middle of 2023.\nThe impasse in markets has seen Chinese funds perish as rapidly as they are born. A total of 148 equity and balanced funds were forced to liquidate in 2023 because they were too small to be viable, the most in five years.\nFund managers are under pressure to launch equity funds, but “in such an environment, you can hardly raise money”, said a Shanghai-based portfolio manager who is preparing to launch a sponsored fund. “You have no choice but to invest with your own money first,” said the fund manager, who spoke on condition of anonymity.\nThe anaemic fund-raising by funds and a sliding stock market feed each other “in a vicious cycle that dents long-term investor confidence”, said UBS Securities China equity strategist Lei Meng.\nSponsored funds, which charge the usual management fees, will be wound up after three years if they do not have a required 200 million yuan in assets.\nTop managers of sponsored funds include China Asset Management, E Fund Management, China Southern Asset Management and Fullgoal Fund Management, according to Z-Ben Advisors.\nWanjia Asset Management in January set up a 10 million yuan fund that invests in pharmaceutical stocks, almost entirely with its own money, a regulatory filing showed.\nIn December, Galaxy Asset Management set up a new materials equity fund after securing only four subscribers, according to a filing. Galaxy ended up contributing 10 million yuan, or 98.9 per cent of the fund assets.\nChina Southern Asset Management declined to comment. Wanjia, Galaxy and the other named managers of sponsored funds did not respond immediately to requests for comment.\nBond funds are more popular with investors, but regulators have slowed vetting applications for fixed-income products, instead speeding up the approval for equity funds.\n“Once you get green light to launch an equity fund, you don’t want to waste it,” said another fund manager who also declined to be identified. “It’s also a condition to launch bond funds.”\nAnother reason behind the burst of sponsored funds is a hope among money managers that investors disappointed with the performance of existing funds will look for fresh opportunities, and hence a new lease of life for their business.\n“Investors have been losing money in existing funds, triggering heavy redemptions and fund liquidation,” said hedge fund manager Zhang. “With new funds, portfolio managers can start afresh.” REUTERS", "url": "https://www.straitstimes.com/business/chinese-fund-managers-dig-deep-into-own-pockets-to-launch-equity-funds"}