{"authors": ["Raphael Lim"], "date_download": "2024-10-12 13:46:53", "date_modify": "2024-10-12 13:46:53", "date_publish": "2024-05-23 21:05:00", "description": "Shares in the company fell 1.7 per cent to close at US$38.45 on May 23 before the business update. Read more at straitstimes.com.", "filename": "business_companies-markets_jardine-matheson-q1-performance-similar-year-on-year-lower-full-year-profit-expected_1728740813.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/23/ST-logo-placeholder_25.jpg?VersionId=CwW4dVC.TPKpyYeumDSnn4op2s6VH3fV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_jardine-matheson-q1-performance-similar-year-on-year-lower-full-year-profit-expected_1728740813.html", "title": "Jardine Matheson’s Q1 showing similar year on year; lower full-year profit expected", "title_page": "Jardine Matheson’s Q1 showing similar year on year; lower full-year profit expected | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Jardine Matheson Holdings on May 23 reported that the performance of its businesses in the first quarter of 2024 was similar to that in the year-ago period.\nHowever, the conglomerate said it expected its full-year underlying profits to be “modestly down” compared with 2023, mainly due to its share of expected non-cash impairment charges in Hongkong Land’s development properties business in China, as well as lower commodity prices at Astra.\n“We remain, however, confident in the economic resilience of the group’s markets and believe we are well positioned to benefit from their recovery,” Jardine Matheson said in a business update filed with the Singapore Exchange.\nThe group said its performance for the three months ended March 31, 2024, was on a par with that in the first quarter of 2023, with strong growth from DFI Retail Group and stable performances from Hongkong Land and Mandarin Oriental. This was partially offset by lower contributions from Astra, Jardine Pacific and Jardine Cycle & Carriage.\nDFI’s underlying profits in the first quarter of 2024 grew more than 60 per cent year on year, driven primarily by improved performances in its food, convenience and health and beauty divisions.\nMeanwhile, Mandarin Oriental recorded a “small underlying profit”, with owned hotels in Asia logging an improvement in earnings, partially offset by lower contributions from Europe.\nHongkong Land’s first-quarter underlying profit was in line with that of the same period a year ago. The company had better performance from its luxury retail portfolio and Singapore office business, largely offsetting lower contributions from its Hong Kong office portfolio.\nHowever, market sentiment for residential properties in China remained weak, reducing total contracted sales.\nHongkong Land expects profits in the first half of 2024 to be “significantly lower” year on year. It is carrying out a review of the group’s projects, and this is expected to result in a non-cash impairment charge of US$200 million (S$270 million) to US$300 million, which will be reflected in the first-half results.\nMeanwhile, Jardine C&C’s direct motor interests had lower profits, with Cycle & Carriage in Singapore impacted by higher leasing expenses as well as lower profit contributions from the used car operations. It also experienced softer trading conditions in its Vietnam business.\nJardine Matheson’s Indonesia-based Astra business reported a 5 per cent decline in underlying earnings for the first quarter, with a 9 per cent decrease in net income for the automotive division, which achieved lower car and motorcycle sales.\nProfit from Astra’s heavy equipment and mining division was also lower, but the financial services division benefited from higher contributions from its consumer and heavy equipment finance businesses on a larger loan portfolio.", "url": "https://www.straitstimes.com/business/companies-markets/jardine-matheson-q1-performance-similar-year-on-year-lower-full-year-profit-expected"}