{"authors": ["Navene Elangovan"], "date_download": "2024-10-12 13:46:54", "date_modify": "2024-10-12 13:46:54", "date_publish": "2024-05-23 22:40:00", "description": "Profit growth trend expected to decelerate over the remainder of the year. Read more at straitstimes.com.", "filename": "business_companies-markets_dfi-retail-s-underlying-profit-for-fy24-expected-to-be-between-us180-million-and-us220-million_1728740814.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/23/IMGL4806.JPG?VersionId=VpwYQoZtFuQodfvwio1Z9ozQNIADvWoJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_dfi-retail-s-underlying-profit-for-fy24-expected-to-be-between-us180-million-and-us220-million_1728740814.html", "title": "DFI Retail’s FY2024 underlying profit expected to be between US$180m and US$220m", "title_page": "DFI Retail’s FY2024 underlying profit expected to be between US$180m and US$220m | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – DFI Retail Group said in a bourse filing on May 23 that it continues to expect its underlying profit for FY2024 to be between US$180 million ($243.3 million) and US$220 million, in line with its guidance released in March 2024.\nAlthough the group reported strong profit growth in the first quarter, the growth trend is expected to decelerate over the remainder of the year, reflecting the group’s stronger performance in the comparable period in 2023.\nIn its interim management statement for Q1 FY2024, the group said that its underlying subsidiary revenues, excluding the impact of divestments, increased by 2 per cent compared with the same period in FY2023.\nThe group’s underlying profits grew by more than 60 per cent in the period, driven primarily by improved profit performance across its subsidiaries.\nThe retailer, which is a member of the Jardine Matheson Group, said that its food retail division reported like-for-like sales slightly behind the first quarter of 2023.\nWithin North Asia, like-for-like sales continued to be affected by reduced consumer spending on groceries and increased outbound travel.\nIn South-east Asia, like-for-like sales marginally increased relative to the same period in 2023, supported by good festive trading performance, despite a slow start to the year.\nLike-for-like sales for the group’s convenience division in Q1 increased compared with the same period in 2023. Sales were supported by good performance in Macau, South China and Singapore.\nHowever, like-for-like sales in 7-Eleven convenience stores in Hong Kong were “adversely affected” by reduced cigarette demand, said the group.\nThe group’s health and beauty division, which includes pharmacies like Guardian, reported “high-single-digit” like-for-like sales growth in Q1 while home furnishings reported “significantly lower” underlying profit due to a challenging macroeconomic environment.", "url": "https://www.straitstimes.com/business/companies-markets/dfi-retail-s-underlying-profit-for-fy24-expected-to-be-between-us180-million-and-us220-million"}