{"authors": ["Claire Huang"], "date_download": "2024-10-12 14:16:41", "date_modify": "2024-10-12 14:16:41", "date_publish": "2023-12-26 13:12:20", "description": "November saw slower price increases for retail and other goods, food, as well as electricity and gas. Read more at straitstimes.com.", "filename": "business_singapore-core-inflation-dips-to-32-in-november-in-return-to-slower-price-increases_1728742601.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/26/aiinflation261223.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-core-inflation-dips-to-32-in-november-in-return-to-slower-price-increases_1728742601.html", "title": "Singapore core inflation dips to 3.2% in November, expected to remain elevated in the near term", "title_page": "Singapore core inflation dips to 3.2% in November, expected to remain elevated in the near term | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Consumer prices might have edged down in November on the back of a slower rise in the costs of items and services, but core inflation is expected to remain sticky and cool only marginally in the new year.\nOfficial data on Dec 26 showed that core inflation, which excludes private transport and accommodation costs to better reflect the expenses of households here, came in at 3.2 per cent year on year in November, matching a Bloomberg poll of economists.\nLed by a slower rise in prices of retail goods, food, electricity, gas and transport, it is a touch lower than the 3.3 per cent in October, when core consumer prices had picked up after rising at a slower pace for several months.\nOverall or headline inflation in November eased to 3.6 per cent year on year, from 4.7 per cent in October, largely due to lower private transport inflation.\nOn a month-on-month basis, which represents how much momentum there still is in prices, core consumer prices crept up 0.1 per cent in November on account of higher costs of food and services.\nHowever, headline inflation dipped by 0.2 per cent month on month, mainly due to a fall in private transport costs.\nThe Ministry of Trade and Industry (MTI) and the Monetary Authority of Singapore (MAS) said on Dec 26 that core inflation is expected to remain around current levels and come in at the upper end of the 2.5 per cent to 3 per cent range at the year end.\nThey said core inflation is expected to go up in early 2024, as the goods and services tax is raised from 8 per cent in 2023 to 9 per cent in 2024.\nHowever, core inflation should resume a broadly moderating trend over the course of 2024, as import cost pressures decline and tightness in the domestic labour market continues to ease, said MTI and MAS.\nThey reiterated that headline inflation is expected to average around 5 per cent for full-year 2023, and core inflation to be 4 per cent.\nIn 2024, headline inflation is projected to average 3 per cent to 4 per cent, with core inflation forecast at 2.5 per cent to 3.5 per cent.\nMaybank economist Brian Lee said core inflation is expected to remain sticky and cool only marginally in 2024, remaining above historical norms.\n“There will be an uptick in early 2024, given hikes in the goods and services tax, carbon taxes and other administrative prices such as water and public transport. Wage cost pressures amid a tight labour market will limit the fall in inflation.”\nHe noted that headline inflation should continue to ease as certificate of entitlement prices cool.\nMr Lee added that recreation and culture inflation remains elevated, fuelled by holiday expenses amid high demand for revenge travel. Inflation in other services components such as restaurants and health services also remains uncomfortably high.\nUOB said in a note that core inflation is likely to moderate further as global food prices continue to recede, while services inflation moderates as wage growth eases in 2024. This is in addition to the ongoing nominal appreciation of MAS monetary policy to help curb imported inflation.\n“There remains upside risks to inflation on price pressures stemming from any escalation in geopolitical conflicts or on stickiness in food prices owing to climate-related events impacting regional/global supply,” UOB added.\nThe bank’s economists expect MAS to stand pat on its monetary policy in January 2024, adding that they see a rising risk that the reversal of monetary policy tightening may be delayed to July 2024.\nThe official data for November 2023 showed that services inflation was the only category that bucked the downward trend, edging up to 3.5 per cent year on year from 3.4 per cent in October.\nThis was due to the costs of outpatient, recreational, cultural and telecommunication services rising at a faster pace.\nPrivate transport inflation recorded the steepest decline among categories in November, falling to 4.2 per cent from 11.7 per cent in October as car prices rose at a much slower pace.\nInflation for retail and other goods fell to 1 per cent in November from 1.6 per cent the previous month, largely owing to a decline in the prices of medical goods and household durables.\nA smaller increase in electricity costs meant that inflation for electricity and gas dipped to 1.5 per cent from 1.8 per cent in October.\nFood and accommodation inflation both edged down, to 4 per cent and 4.1 per cent, respectively.", "url": "https://www.straitstimes.com/business/singapore-core-inflation-dips-to-32-in-november-in-return-to-slower-price-increases"}