{"authors": [], "date_download": "2024-10-12 14:20:28", "date_modify": "2024-10-12 14:20:28", "date_publish": "2023-11-16 08:00:00", "description": "A sale would mark the Bytedance's biggest retreat in the attempt to conquer video gaming. Read more at straitstimes.com.", "filename": "business_bytedance-weighs-sale-of-gaming-studio-behind-mobile-legends_1728742828.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/16/SINGAPORE-CHINA-INTERNET-SOCIAL-MEDIA-BYTEDANCE-042802.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_bytedance-weighs-sale-of-gaming-studio-behind-mobile-legends_1728742828.html", "title": "ByteDance weighs sale of gaming studio behind Mobile Legends", "title_page": "ByteDance weighs sale of gaming studio behind Mobile Legends | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – ByteDance is considering selling gaming studio Shanghai Moonton Technology, people familiar with the matter said, as the TikTok owner looks to streamline its operations and focus on core businesses.\nThe start-up is working with an adviser to gauge interest from potential buyers for the studio behind popular battle arena title Mobile Legends: Bang Bang, the sources said.\nByteDance acquired Moonton in 2021 at a valuation of about US$4 billion (S$5.4 billion), according to the sources.\nDiscussions are at an early stage and the deal size target could not be immediately learnt, said the sources, who asked not to be identified as the information is private. ByteDance may also decide against a sale, they added. Representatives for ByteDance and Moonton did not immediately respond to requests for comment.\nByteDance, founded more than a decade ago by Mr Zhang Yiming and Mr Liang Rubo, grew into an Internet leader worth more than US$200 billion thanks to the virality of short-video platforms TikTok and Douyin.\nThe company has bought game studios and exclusive distribution rights, hoping to jump-start the games business much as it disrupted social media and rivalled players such as Tencent and NetEase.\nByteDance has cut some of its game creation and publishing teams, as it shifts focus towards the new growth driver of e-commerce. A sale of Moonton, if struck, would mark its biggest retreat in the attempt to conquer video gaming.\nFounded in 2014 by a pair of Tencent veterans, Moonton is best known for Mobile Legends: Bang Bang, which has struck a chord with fans in South-east Asia. It was approved for release in China in April. Yet the ageing title has struggled to make it in a bigger e-sports arena dominated by Tencent and its subsidiary Riot Games.\nByteDance has left Moonton to operate in near-autonomy since the 2021 acquisition. Moonton has more than 1,600 employees globally and operates offices in Indonesia, Malaysia, Singapore, Hong Kong and China, its website shows. BLOOMBERG", "url": "https://www.straitstimes.com/business/bytedance-weighs-sale-of-gaming-studio-behind-mobile-legends"}