{"authors": [], "date_download": "2024-10-12 13:44:46", "date_modify": "2024-10-12 13:44:46", "date_publish": "2023-08-09 14:45:00", "description": "It expects to reach 70 per cent of its pre-pandemic capacity by the end of the year and 100 per cent by the end of 2024. Read more at straitstimes.com.", "filename": "business_cathay-pacific-posts-best-h1-profit-since-2010-to-repay-govt-aid-package_1728740686.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/09/FILES-HONGKONG-CHINA-AVIATION-EARNINGS-CATHAY-052800.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_cathay-pacific-posts-best-h1-profit-since-2010-to-repay-govt-aid-package_1728740686.html", "title": "Cathay Pacific posts best H1 profit since 2010, to repay govt aid package", "title_page": "Cathay Pacific posts best H1 profit since 2010, to repay govt aid package | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - Cathay Pacific Airways reported on Wednesday its best first-half profit since 2010, and announced plans to order more planes and repay a Hong Kong government rescue package after a major turnaround in travel demand.\nThe interim net profit of HK$4.3 billion (S$740 million) is in line with its guidance for earnings of up to HK$4.5 billion, compared with a HK$5 billion loss a year earlier, when Hong Kong’s strict quarantine rules were in place.\n“While we are still only part way along our rebuilding journey, our results for the first six months of 2023 demonstrate that we are on the right track,” Cathay chairman Patrick Healy said in a statement.\nCathay has recovered capacity more slowly than its closest rival, Singapore Airlines, because it faced tighter quarantine rules for longer, and needed to train more staff and bring back grounded planes.\nThe Hong Kong carrier expects to reach 70 per cent of its pre-pandemic capacity by the end of 2023, and 100 per cent by the end of 2024.\nCathay said it intended to exercise purchase rights to buy 32 Airbus A320neo family aircraft, looking to add to its fleet as demand rebounds.\nIt will also buy back 50 per cent of the HK$19.5 billion of preference shares held by the Hong Kong government by the end of 2023, and the remainder by the end of July 2024, subject to completion of a proposed capital reduction and business conditions at the time.\nCathay issued the shares in 2020 as part of a HK$39 billion rescue package from the government and its biggest shareholders, Swire Pacific and Air China, that shored up its finances after travel demand collapsed during the Covid-19 pandemic.\nChief executive Ronald Lam said the main challenges faced by the industry globally, namely manpower shortages and supply chain issues, are expected to improve and normalise into 2024.\n“I must say, compared to the challenges we faced in the last three years during the pandemic, all these are... happy problems, right?” said Mr Lam. REUTERS", "url": "https://www.straitstimes.com/business/cathay-pacific-posts-best-h1-profit-since-2010-to-repay-govt-aid-package"}