{"authors": [], "date_download": "2024-10-12 14:07:16", "date_modify": "2024-10-12 14:07:16", "date_publish": "2023-11-15 20:55:00", "description": "Even Germany, which has fared worse than peers, is predicted to avoid a recession.  Read more at straitstimes.com.", "filename": "business_economy_euro-area-to-avoid-recession-as-inflation-retreats-eu-says_1728742036.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/15/bteuro20231115.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_euro-area-to-avoid-recession-as-inflation-retreats-eu-says_1728742036.html", "title": "Euro area to avoid recession as inflation retreats, EU says", "title_page": "Euro area to avoid recession as inflation retreats, EU says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The euro area and its biggest economies will avoid a recession as growth returns at the end of 2023, helped by slowing inflation and a robust jobs market, according to new European Union forecasts.\nOutput in the 20-nation euro area will increase by 0.2 per cent in the fourth quarter after shrinking 0.1 per cent in the three months through September, the European Commission said in a report on Wednesday.\nEven Germany, which has fared worse than peers amid a prolonged manufacturing slump, is predicted to avoid a recession.\nFor the full year, the EU’s executive arm now sees 0.6 per cent growth, down from a September forecast of 0.8 per cent. That is seen picking up to 1.2 per cent in 2024 and 1.6 per cent in 2025 – a slightly more optimistic view than that of the European Central Bank (ECB).\n“Strong price pressures and the monetary tightening needed to contain them, as well as weak global demand, have taken their toll on households and businesses,” EU Economy Commissioner Paolo Gentiloni said in a statement. “Looking ahead to 2024, we expect a modest uptick in growth as inflation eases further and the labour market remains resilient.”\nPrice growth will average 5.6 per cent in 2023 and ease to 3.2 per cent in 2024 and 2.2 per cent in 2025. That is similar to the ECB’s prediction and an upward revision for 2024 compared with the EU’s September forecast, prompted by higher energy and food commodity costs.\n“Still, price pressures related to non-energy consumption categories are expected to unwind, broadly in line with the previous forecast and in a context of slightly tighter financing conditions, moderating wage growth and normalising profit shares,” the commission said.\nInflation eased to 2.9 per cent in October, down from a peak of more than 10 per cent, but ECB policymakers have warned against complacency as price growth may pick up again in coming months. They kept interest rates on hold in October, saying the current level will help return inflation to the 2 per cent goal – if held for long enough.\nHigh living costs and the ECB’s unprecedented tightening campaign that started in mid-2022 “took a heavier toll than previously expected”, the commission said.\nSpeaking on Wednesday to Bloomberg TV, ECB governing council member Mario Centeno acknowledged worries over the lack of momentum in the euro-area economy.\n“The numbers have not been great, zero, 0.1, minus 0.1 quarter on quarter for five quarters in a row creates a little bit of anxiety over will this be a soft landing,” he said. “This stagnation of the euro area is of course a source of concern for all.”\nEU officials also warned of stalling efforts to bring down public debt in some of the bloc’s biggest economies. Italy’s is seen increasing back above 140 per cent of output in the next two years, with an uptick in 2025 also seen in France after a slight dip in the preceding year.\nInitially helped by inflation, debt reduction is set to become tougher as price growth slows, borrowing costs rise and growth remains subdued, the commission said.\nThe euro area’s sovereign debt has become an increasing source of unease after governments borrowed heavily during the Covid-19 pandemic and the energy crisis, while borrowing costs jumped to combat inflation.\nThe labour market has been a bright spot so far, with unemployment barely increasing even as the economy struggled.\nWhile some member states have meanwhile seen an uptick, jobless rates “are expected to remain broadly stable”, the commission said.\nThe continued war in Ukraine and conflict in the Middle East mean uncertainty around the economic outlook has increased, it added. How China fares and the transmission of monetary tightening within the euro area also pose risks.\nThe report covered Ukraine itself for the first time after the country gained EU candidate status. The commission predicts 3.7 per cent growth next year and 6.1 per cent in 2025 – after a 29 per cent slump in 2022. BLOOMBERG", "url": "https://www.straitstimes.com/business/economy/euro-area-to-avoid-recession-as-inflation-retreats-eu-says"}