{"authors": [], "date_download": "2024-10-12 13:35:56", "date_modify": "2024-10-12 13:35:56", "date_publish": "2024-08-21 09:38:00", "description": "Couche-Tard's bid for Seven & i aims to globalise Japan's top-notch convenience store experience. Read more at straitstimes.com.", "filename": "business_7-eleven-deal-talk-reflects-allure-of-japan-s-convenience-stores_1728740156.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/21/2024-08-20T095110Z1221945186RC2WI9AR0U33RTRMADP3JAPAN-M-A-SEVEN-I-HLDGS.JPG?VersionId=xJVXqCcJ2FM6SB.Tudv3AKF2Z6yNSs_O", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_7-eleven-deal-talk-reflects-allure-of-japan-s-convenience-stores_1728740156.html", "title": "7-Eleven deal talk reflects allure of Japan’s convenience stores", "title_page": "7-Eleven deal talk reflects allure of Japan’s convenience stores | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Anyone who has stepped into a 7-Eleven in Japan to grab a quick snack or withdraw cash from the ATM will understand why Alimentation Couche-Tard would want to pay billions to acquire the business. It is clean, service is efficient and the food is good.\nLike cars, electronics and rail travel, the convenience-store chain is a Western invention that the Japanese have refined to near-perfection. After bringing the concept to the island nation, the stores have transformed Seven & i Holdings into a five trillion yen (S$45 billion) global retailer.\nCircle K owner Couche-Tard, a smaller rival in Canada with humble beginnings, is betting that it can take the business further, confirming earlier this week that it made a preliminary proposal to buy out Seven & i.\nAlthough details are still scant, such as the price, financing or structure of any potential deal, the approach follows attempts by activist investor ValueAct Capital Management to focus Seven & i’s management on global expansion of the 7-Eleven concept.\nSuccessfully bringing the standards and quality of Japanese convenience stores to North America could breathe new life into the small store shopping experience.\n“I want the stores to be operated by a Japanese company as they reflect our taste and needs in their products, at an affordable price,” said Ms Kirina, a woman in her 50s who was shopping at a 7-Eleven store in Tokyo’s Asakusa area.\n“But considering globalisation, a buyout might be right because Japanese companies need to become financially stronger and more international.”\nMr Ryuichi Isaka, Seven & i’s chief executive, understands this only too well. He has spent more than US$25 billion (S$33 billion) during the past few years to expand his convenience-store empire outside Japan, where the population is shrinking and the market is saturated.\nThe CEO orchestrated the acquisition of Speedway and Sunoco petrol station networks in North America, adding to 7-Eleven outlets that have already taken root across Asia. In total, Seven & i operates 85,000 convenience stores, petrol stations and retail outlets.\nIn contrast, Couche-Tard has about 16,700 stores. Yet, it enjoys a bigger valuation of about US$58.5 billion, underscoring the lingering concerns that Mr Isaka’s moves have barely scratched the surface.\nThe buyout offer has “highlighted Seven & i’s significant undervaluation versus global peers”, said Mr Mark Chadwick, an analyst who publishes on Smartkarma.\n“There could be a number of potential strategies at play,” he said, such as the Canadian company taking full control, non-core asset sales, or even a Japanese partner coming to help relist 7-Eleven as an independent entity.\nSeven & i grew from small beginnings, tracing its origins to the small family-owned Yokado Clothing Store that first opened in Tokyo in 1920. The retailer, then known as Ito-Yokado, expanded swiftly during Japan’s rapid post-war reconstruction.\nIn 1974, it brought the US-based casual restaurant chain Denny’s to the country. It was during a visit to the US to negotiate that deal that a young executive at the Japanese company discovered 7-Eleven and struck a deal with Texas-based Southland Corp, then owner of the chain, to open the first outlet in Japan in the same year.\nThe company took the concept to new heights in Japan, becoming a retail behemoth along the way, with assets ranging from department stores to restaurants and a banking network.\nThe convenience store, which locals call “combini”, is now the locus of every Japanese neighbourhood, an institution where you can not only buy a meal, but also pay your bills, send packages and access municipal services 24 hours a day, seven days a week.\nIn other parts of Asia, such as Hong Kong and Taiwan, 7-Elevens have made the same mark, where stores are key fronts for public services and have become known for staying open through typhoons and earthquakes.\nUnder pressure from ValueAct, Mr Isaka has been unloading some of the company’s under-performing legacy businesses: In 2023, it finalised the sale of the Sogo & Seibu department store chain to Fortress Investment Group at an enterprise value of about 220 billion yen.\nThe CEO is also squarely focused on expansion in Europe and the US, telling Bloomberg in an interview earlier in 2024 that 7-Eleven’s expertise in making cheap, high-quality food can help transform Speedway and Sunoco petrol stations into a new retail experience.\nThe goal is to move away from selling petrol and cigarettes – arguably industries facing a long-term decline – and draw people in the same way as Japan’s convenience stores.\n“The key to this change is fresh food,” Mr Isaka said in an interview. “We are in an industry that must continue to adapt to change in order to grow.”\nDespite this burst of activity by Japanese standards, Mr Isaka appears to still be moving too slowly for some investors, who may see Couche-Tard’s offer as a fast way to realise 7-Eleven’s value.\nA merger of the two companies’ operations would create a chain of over 100,000 convenience stores across the globe, by far the world’s biggest and most sprawling.\nHurdles for any deal, which include national political sentiment in Japan and antitrust regulators in the US, are substantial.\nYet even ordinary Japanese consumers cannot deny the pull of global domination.\n“They have a uniquely Japanese hospitality regarding their service, so I’m worried that might change,” said Ms Kita, a developer in her 20s, as she bought an onigiri rice ball and a small salad at a store near Tokyo Station. “But 7-Eleven shouldn’t stay in Japan and should expand overseas.” BLOOMBERG", "url": "https://www.straitstimes.com/business/7-eleven-deal-talk-reflects-allure-of-japan-s-convenience-stores"}