{"authors": ["Navene Elangovan"], "date_download": "2024-10-12 13:28:28", "date_modify": "2024-10-12 13:28:28", "date_publish": "2024-10-03 18:57:43", "description": "The index's biggest gainer was ground handler and caterer Sats, which climbed 1.3 per cent to $3.79. Read more at straitstimes.com.", "filename": "business_companies-markets_sti-down-02-as-regional-bourses-end-mixed_1728739708.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/BrianTeo-pixgeneric-1.jpg?VersionId=89yMvTTFBl0wYcCO0HnzY_kzsJIc8iLI&h=2bab2a7d", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_sti-down-02-as-regional-bourses-end-mixed_1728739708.html", "title": "STI down 0.2% as regional bourses end mixed", "title_page": "STI down 0.2% as regional bourses end mixed | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Local shares meandered into the red on Oct 3 as markets on Wall Street and across the region stepped back a little after a week of geopolitical turmoil.\nThe uncertain mood sent the Straits Times Index (STI) down 0.2 per cent or 7.24 points to 3,577.43 with losers outpacing gainers 340 to 261 on a turnover of 1.3 billion shares worth $1.3 billion across the broader market.\nThe STI’s biggest gainer was ground handler and caterer Sats, which climbed 1.3 per cent to close at $3.79. DFI Retail Group was the index’s biggest decliner after being the top gainer on Oct 2. It slid 3.1 per cent to US$2.20.\nThai Beverage was the most actively traded by volume, with 35.9 million shares traded. The counter fell 1.9 per cent to 52.5 cents. The food and beverage company said earlier this week that it is reviving plans for an initial public offering of its beer unit.\nWall Street was listless overnight and failed to give regional markets much of a shot in the arm, although the three key indexes all rose, albeit by 0.1 per cent or less.\nDespite the modest rises, some US investors believed recent data indicated that concerns about an imminent economic downturn were overstated.\nThe region was mixed: Hong Kong’s Hang Seng Index was down 1.5 per cent, Australia’s ASX 200 rose 0.1 per cent and the Nikkei in Japan added 2 per cent.\nMarkets in China and South Korea were closed for the public holidays.\nAhead of the next round of US Federal Reserve interest rate cuts in November, market sentiment will be “highly sensitive” to upcoming employment data from the US, said Mr Yeap Jun Rong, market strategist at online trading platform IG.", "url": "https://www.straitstimes.com/business/companies-markets/sti-down-02-as-regional-bourses-end-mixed"}