{"authors": [], "date_download": "2024-10-12 14:09:14", "date_modify": "2024-10-12 14:09:14", "date_publish": "2024-03-05 10:55:00", "description": "Insurers are sounding an alarm over the debt risks of China’s second-biggest developer by sales. Read more at straitstimes.com.", "filename": "business_china-s-property-debt-woes-deepen-with-vanke-under-closer-scrutiny_1728742154.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/05/10208161H1181278.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-property-debt-woes-deepen-with-vanke-under-closer-scrutiny_1728742154.html", "title": "China’s property debt woes deepen with developer Vanke under closer scrutiny", "title_page": "China’s property debt woes deepen with developer Vanke under closer scrutiny | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI - China’s property debt crisis is showing new signs of trouble after entering its fourth year, with one of the country’s major state-backed developers placed under unprecedented scrutiny by investors.\nSome of China’s largest insurers are sounding an alarm over the debt risks of China Vanke, according to people familiar with the matter, as shares and bonds of the major developer hit record lows on repayment concerns.\nAt least two Beijing-based insurers that farm out annuity investments told their external portfolio managers late last week to closely monitor Vanke’s credit risks, said the people, asking not to be identified discussing a private matter. One life insurer also told its pension managers to curb exposure, the people added.\nMeanwhile, Vanke, China’s second-biggest developer by sales, has begun a new round of negotiations with several state insurers in recent days to extend maturities of some private borrowings, the people said. No agreement has been reached so far.\nThe warnings about Vanke’s risks are particularly worrisome and threaten to elevate the sector’s debt woes to the next level because the company is seen as a bellwether for Beijing’s support for major developers with strong ties to the state.\nThe company is also one of China’s few remaining and surviving investment-grade builders, following a record wave of defaults that engulfed mostly private-sector builders, including former industry giants Country Garden Holdings and China Evergrande Group.\nThe growing concerns about Vanke also come at an inconvenient time for the authorities as the nation kicked off its seven-day-long annual parliamentary sessions on March 5, with key policy topics from the housing crisis to local government debt in focus.\nPresident Xi Jinping’s government has maintained an economic growth target of around 5 per cent for 2024 and plans to issue one trillion yuan (S$190 billion) of ultra-long special central government bonds in a rare move to shore up growth.\nVanke did not respond to a request for comment.\n“It is no surprise that Vanke is in trouble today,” said Beijing Shengao Fund Management chief investment officer Li Kai. “Domestic real estate sales have been so poor that it is difficult for companies to hang on, and the market has not seen strong visible support from local governments.”\nThe developer’s shares and bonds extended a sell-off on March 4. Its stock fell 7.1 per cent in Hong Kong at their lowest level ever, and dropped 4.7 per cent in Shenzhen, the biggest decline since December 2022. Some of Vanke’s yuan bonds also hit their lowest levels, according to Bloomberg-compiled prices, while its 3.975 per cent US dollar note due in 2027 fell by more than six US cents to 47.3 US cents.\nIt is not the first state-linked Chinese developer to be in trouble. China South City Holdings and Sino-Ocean Group Holding, two such firms, are also on the list of defaulters. But their sizes and impact are nowhere near Vanke’s.\n“If Vanke does have a redemption risk, I think it will be comparable to the impact on the market of Country Garden’s default, and will directly hit other private real estate developers that are still struggling to support themselves,” said Beijing Shengao’s Mr Li.\nVanke’s Hong Kong-listed shares may remain weak until there is a sales recovery or stronger support from the Shenzhen government, according to JPMorgan Chase analysts, who forecast a 20 per cent to 30 per cent yearly drop in the developer’s full-year earnings. BLOOMBERG", "url": "https://www.straitstimes.com/business/china-s-property-debt-woes-deepen-with-vanke-under-closer-scrutiny"}