{"authors": [], "date_download": "2024-10-12 14:19:12", "date_modify": "2024-10-12 14:19:12", "date_publish": "2023-12-19 23:23:00", "description": "The steps are the first in a series of programmes to improve productivity and stay competitive. Read more at straitstimes.com.", "filename": "business_volkswagen-cost-cutting-drive-aims-to-yield-up-to-4b-in-2024_1728742752.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/19/VOLKSWAGEN-RENAULT.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_volkswagen-cost-cutting-drive-aims-to-yield-up-to-4b-in-2024_1728742752.html", "title": "Volkswagen cost-cutting drive aims to yield up to $5.8 billion in 2024", "title_page": "Volkswagen cost-cutting drive aims to yield up to $5.8 billion in 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN – Volkswagen and workers’ representatives have agreed on the key points of a cost-cutting drive at the VW brand that should yield a positive contribution of €4 billion (S$5.84 billion) to its results in 2024, the company said on Dec 19.\nThe steps, which aim to make €10 billion in gains by 2026 via cutting costs and boosting revenues, are the first in a series of programmes across the carmaker to improve productivity and stay competitive in the transition to electric vehicles.\nIn a memo to staff earlier in December, Volkswagen said it planned to slash administrative staff costs at its namesake brand by a fifth, save €1 billion by 2028 through reducing product development cycles to three years from 50 months, cut production times and scrap a planned new €800 million research and development site in its home city of Wolfsburg, Germany.\nDec 19’s statement listed further cost-cutting measures including partial retirement for workers born in 1967, or 1968 for those with severe disabilities, to reduce costs particularly in the administrative personnel area.\nThe carmaker also planned to save €320 million a year through better purchasing performance in its procurement, generate over €250 million a year through optimising its after-sales business, and save more than €200 million a year by improving production times.\nA further €400 million annually would be saved by reducing the number of test vehicles used in technical development by up to 50 per cent, with more testing done via digital processes, it said.\nIf necessary, the carmaker could also offer selective contract termination agreements across the company, human resources board member Gunnar Kilian said.\n“With the agreement reached, we will create the necessary flexibility from 2024 to successfully secure the company’s profitability and thus sustainable employment,” he added. REUTERS", "url": "https://www.straitstimes.com/business/volkswagen-cost-cutting-drive-aims-to-yield-up-to-4b-in-2024"}