{"authors": [], "date_download": "2024-10-12 14:13:06", "date_modify": "2024-10-12 14:13:06", "date_publish": "2023-09-15 10:56:03", "description": "Country Garden’s tumble into crisis has shocked China’s financial markets because it is a household name. Read more at straitstimes.com.", "filename": "business_country-garden-delays-yuan-bond-extension-vote-to-monday_1728742386.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/15/btgarden20230915.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_country-garden-delays-yuan-bond-extension-vote-to-monday_1728742386.html", "title": "Country Garden raising risks by repeatedly delaying bond vote", "title_page": "Country Garden raising risks by repeatedly delaying bond vote | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI - Chinese developer Country Garden Holdings left investors grasping for more information after it again delayed a deadline for voting on its request to extend a bond, underscoring a broader lack of transparency amid the nation’s property debt crisis.\nVoting was extended to 10pm Beijing time on Monday from Thursday, according to a note holder briefed by one of the underwriting banks.\nThat is the third time Country Garden has delayed the deadline.\nThe bond has 492 million yuan (S$93 million) of outstanding principal due on Oct 21 unless holders agree to stretch repayment by three years.\nAs the crisis in China’s real estate sector heads into its fourth year, money managers say that weak disclosure and governance practices are putting them off mainland borrowers for the longer term.\nWhile Country Garden is not obliged to issue public statements on the vote outcomes and has not done so, news on the vote outcomes has moved markets.\nThat underscores the immense appetite for information on how one of the world’s most heavily indebted property firms will manage its 1.36 trillion yuan of total liabilities.\n“The lack of clear communication has weighed on investor confidence, and could render it difficult to secure agreement on extensions,” said DBS Bank strategist Chang Wei Liang.\nCreditors are increasingly pushing back on requests to delay bond principal payments.\nCountry Garden had to delay voting on another plan twice, before getting sufficient approval just before the due date.\nCountry Garden’s tumble into crisis has shocked China’s financial markets because it is a household name, known for building homes in smaller cities.\nHelmed by one of the country’s richest women, Ms Yang Huiyan, the company has become a symbol of the country’s broader property crisis.\nThe bond on which voting was again extended was issued by unit Guangdong Giant Leap Construction.\nIt is the last in a group of eight notes totalling 10.8 billion yuan that Country Garden asked to stretch repayment on by three years, with extension of the other seven having already been approved in recent days.\nThose other extensions on 10.3 billion yuan of bonds marked a significant respite, leaving Country Garden with just about 2 billion yuan of principal and interest for local notes with maturities or put options remaining in 2023.\nBut in a sign of how deeply distressed Country Garden still is, its US dollar bonds have continued to hover about 9 US cents to 13 US cents, indicating that investors expect to recover very little if the company does go on to default.\nCountry Garden does still have until the Oct 21 maturity date to get an extension passed on the Giant Leap bond.\nWhile the company has so far avoided defaulting, it recently warned it still could, after posting a record first-half loss of almost US$7 billion (S$9.5 billion).\nAny stumble could impact China’s housing market even more than a landmark default in late 2021 by China Evergrande Group, as Country Garden has four times as many projects. BLOOMBERG", "url": "https://www.straitstimes.com/business/country-garden-delays-yuan-bond-extension-vote-to-monday"}