{"authors": [], "date_download": "2024-10-12 14:19:57", "date_modify": "2024-10-12 14:19:57", "date_publish": "2024-02-14 23:15:00", "description": "It would also lose around 5,400 posts as part of a previously announced cost-cutting programme Read more at straitstimes.com.", "filename": "business_companies-markets_german-car-supplier-continental-plans-to-cut-7150-jobs_1728742797.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/14/FILES-GERMANY-TECHNOLOGY-CONTINENTAL-AUTO-144140.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_german-car-supplier-continental-plans-to-cut-7150-jobs_1728742797.html", "title": "German car supplier Continental plans to cut 7,150 jobs", "title_page": "German car supplier Continental plans to cut 7,150 jobs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - German car parts supplier Continental said on Feb 14 it would cut some 7,150 posts worldwide by 2025 as the difficult switch to electric vehicles forces companies in the sector to retool.\nThe group, which makes tyres and supplies components to carmakers, said in a statement it would shed 1,750 jobs in research and development.\nIt would also lose around 5,400 posts as part of a previously announced cost-cutting programme aimed at saving the group €400 million (S$578 million) by 2025.\nContinental, which currently employs around 200,000 people worldwide, announced the plan in November without putting a precise figure on the number of jobs that would go.\n“We are aware of the impact on our employees and will do everything we can to find good, tailored solutions (for employees),” Continental’s automotive chief Philipp von Hirschheydt said.\nThe cuts would allow Continental to “focus our resources even more on future technologies for software-defined vehicles”, Mr von Hirschheydt said.\nGermany’s car suppliers have been facing problems as the transition to electric mobility gathers pace, after decades relying on fossil fuel vehicles for their profits.\nContinental is also the latest German manufacturer to announce job cuts as the country’s export-focused industry contends with a global slowdown in growth and high rates of inflation.\nAppliance maker Miele said earlier in February it would eliminate up to 2,700 posts amid low demand for its products, while Bosch announced plans in December for 1,500 job cuts. AFP", "url": "https://www.straitstimes.com/business/companies-markets/german-car-supplier-continental-plans-to-cut-7150-jobs"}