{"authors": ["Angela Tan"], "date_download": "2024-10-12 13:31:49", "date_modify": "2024-10-12 13:31:49", "date_publish": "2024-01-18 17:10:00", "description": "SINGAPORE - Listings of initial public offerings on the Singapore Exchange (SGX) are expected to remain subdued, but experts at Deloitte Singapore are sanguine about the prospects. Read more at straitstimes.com.", "filename": "business_asean-weathers-ipo-drought-sgx-potential-intact-amid-subdued-performance-deloitte_1728739909.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/18/2023030375641039730b9977-6a3d-42e1-8817-ae1104526231.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_asean-weathers-ipo-drought-sgx-potential-intact-amid-subdued-performance-deloitte_1728739909.html", "title": "South-east Asia weathers IPO drought, SGX potential intact amid subdued performance: Deloitte", "title_page": "South-east Asia weathers IPO drought, SGX potential intact amid subdued performance: Deloitte | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Listings of initial public offerings on the Singapore Exchange (SGX) are expected to remain subdued, but experts at Deloitte Singapore are sanguine about the prospects.\nThe stock exchanges of Indonesia, Thailand and Malaysia lead South-east Asia in displaying resilience against challenging macroeconomic conditions, with the region managing a constant number of IPO listings, they said in a report on Jan 18.\nHowever, in line with global trends, there was a 24 per cent decrease in the total IPO amount raised to US$5.8 billion (S$7.8 billion), the lowest in eight years, and a 26 per cent decrease in total IPO market capitalisation.\nOn Singapore’s subdued performance, the Deloitte report noted that Singapore companies are exposed to various opportunities in the global markets as various stock exchanges have held marketing road shows in the Republic to compete for new listings on their bourses.\nMr Darren Ng, Deloitte Singapore’s disruptive events advisory deputy leader, said there are many Singapore companies enjoying international recognition for their robust business fundamentals that have explored cross-border listings on global exchanges.\nMany of these companies have chosen to list in the United States for better exposure to key target markets, access to a deeper pool of investors, or for liquidity and status. Since 2021, 14 Singapore companies, including property platform Ohmyhome and facilities management platform Simpple, have listed in the US.\nBut the economic infrastructure and initiatives by the Singapore Government and the SGX provide an ideal platform for companies aspiring to go public, Mr Ng said.\n“Singapore, with its political stability and strong regulatory environment, sets the stage for unprecedented capital inflows, acts as a strategic bridge between the US and China, and is the regional headquarters of choice for numerous funds and family offices,” he added.\nSix IPOs on the SGX’s Catalist board raised about US$35 million in proceeds in 2023. This compares with a total of US$428 million in proceeds raised by 11 IPOs in 2022, and US$1.2 billion in proceeds by eight IPOs in 2021.\nDeloitte’s IPO tally excludes secondary listings and reverse takeovers.\nThe six companies which listed in 2023 were YKGI, the company behind Yew Kee duck rice; engineering service provider Ever Glory United Holdings; medical supplier Pasture Holdings; dermatology and medical skincare company Niks Professional; renewable energy-related Sheffield Green; and game developer Winking Studios.\nThese came after secondary listings resumed in Singapore after five years, with two such listings which do not involve any share offer for subscription or sale on the mainboard in 2023.\nThese were wireless solutions provider Comba Telecom Systems Holdings from Hong Kong and oil palm plantation company TSH Resources from Malaysia.\nIn a first for Singapore, live-streaming platform 17Live Group debuted on the SGX mainboard in December after its business was merged with Singapore’s first special-purpose acquisition company (Spac), Vertex Technology Acquisition Corporation.\nSpacs, or “blank cheque” firms, are shell companies that raise capital in an IPO and use the cash to merge with a private company in order to take it public.\nDeloitte noted that since the listing of Vertex and two other Spacs in January 2022, interest in Spacs on the SGX has cooled.\nOut of the three Spacs, only Vertex has managed to successfully complete an acquisition, although shares of 17Live are down by more than 76 per cent since their SGX debut in December.\nMeanwhile, the other two Spacs – Novo Tellus Alpha Acquisition and Pegasus Asia – have both announced that they would not conclude any merger.\n“Spacs have a limited shelf life, and there are still many Spacs in the market looking for targets before the end of their shelf life, especially in the United States, which is the largest market for Spacs globally,” Deloitte experts said in the report.\nThe report added that with Singapore’s sound Spacs framework, companies will tap this opportunity when the time is right.\n“Spacs typically target high-growth tech-enabled companies. With the current challenging economic outlook, many of these high-growth companies are also facing challenges, coupled with a lack of readiness of investors in the current economic climate, hence leading to an accumulation of factors that do not optimise the SGX Spacs framework at the moment,” it said.\nSingapore will continue to be the destination of choice for real estate investment trust (Reit) aspirants, going forward, even though high interest rates in recent years have kept most at bay.\nA high interest rate environment means Reit IPO aspirants will need to offer higher dividend yields to attract investors. Most economists expect rates to ease later this year.\nSouth-east Asia produced 163 IPOs which raised US$5.8 billion in funds in 2023. Compared with 2022, the number of IPOs in the region was unchanged, but total IPO proceeds fell from US$7.6 billion.\nThis was led by listings from Indonesia’s renewable energy as well as metals and minerals sector. The country saw 79 companies listed in 2023, up from 59 in 2022.\nDeloitte expects to see more growth in Indonesia’s energy and resources sector, especially those related to the electric vehicle supply chain leading to sizeable and more IPOs in 2024.\nElsewhere, the US and Hong Kong enjoyed a minor rebound in IPOs, although they are still a far cry from the pre-Covid-19 levels.", "url": "https://www.straitstimes.com/business/asean-weathers-ipo-drought-sgx-potential-intact-amid-subdued-performance-deloitte"}