{"authors": [], "date_download": "2024-10-12 14:12:26", "date_modify": "2024-10-12 14:12:26", "date_publish": "2023-10-09 11:30:00", "description": "The market is closely watching whether China’s largest private developer can manage to dodge default again. Read more at straitstimes.com.", "filename": "business_chinese-developer-country-garden-faces-fresh-offshore-payments-deadline_1728742346.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/09/2023-10-09T024855Z1232130442RC27K2A1JF2WRTRMADP3CHINA-PROPERTY-DEBT-COUNTRY-GARDEN.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_chinese-developer-country-garden-faces-fresh-offshore-payments-deadline_1728742346.html", "title": "China’s Country Garden faces fresh debt payments, could announce restructuring soon", "title_page": "China’s Country Garden faces fresh debt payments, could announce restructuring soon | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Country Garden may announce a restructuring plan for its offshore debt soon, a local media outlet reported on Monday, as China’s largest private property developer faces another looming debt deadline.\nThe developer, which missed two US dollar interest payments in September, has two coupons totalling US$66.8 million (S$91.5 million) coming due on Monday.\nIt declined to comment on the report by media outlet Cailianshe and whether it has made any payments.\nThe coupons due on Monday are tied to Country Garden’s 6.5 per cent April 2024 and 7.25 per cent April 2026 bonds.\nThe payments have a 30-day grace period, but the developer faces a big test later in October, when its entire offshore debt could be deemed in default if it fails to pay a US$15 million September coupon by Oct 17.\nThe market is closely watching whether the firm, which owns projects across the country, can manage to dodge default again by making payments at the last minute.\nCountry Garden has US$10.96 billion offshore bonds and 42.4 billion yuan (S$8.1 billion) worth of loans not denominated in renminbi. If it defaults, these debts will need to be restructured, and the company or its assets also risk liquidation by creditors.\nChina’s property sector has been hit by a debt crisis since 2021. Companies accounting for 40 per cent of Chinese home sales – mostly private property developers – have defaulted on debt obligations, leaving many homes unfinished.\nMore than two years on, the crisis has deepened as confidence in both housing and capital markets dried up, further squeezing developers’ liquidity.\nBeijing has rolled out a range of support measures in recent months to revive the sector, which makes up about a quarter of the world’s second-largest economy.\nSome analysts, however, say more measures are needed.\nIn a research note last Friday, UBS said property sales growth in major cities likely stayed weak in September, suggesting a limited rebound in sales despite more supportive measures to ease the property crisis.\nChina’s average daily home sales based on floor area during the Golden Week holiday were down 17 per cent from a year ago, according to China Index Academy last Saturday.\nIn September, Country Garden won approval from its onshore creditors to extend renminbi bond payments and, in the same month, made coupon payments on the offshore markets in the last hours of a grace period.\nBut the developer has not yet paid a US$15 million coupon due on Sept 17 and a US$40 million coupon due on Sept 27, both of which have 30-day grace periods. REUTERS", "url": "https://www.straitstimes.com/business/chinese-developer-country-garden-faces-fresh-offshore-payments-deadline"}