{"authors": ["Angela Tan"], "date_download": "2024-10-12 13:34:13", "date_modify": "2024-10-12 13:34:13", "date_publish": "2024-08-23 15:52:46", "description": "CPFIS funds have a relatively higher concentration of Asia-focused funds than the MSCI World Index. Read more at straitstimes.com.", "filename": "business_singapore-s-cpfis-funds-underperformed-global-equities-in-year-to-end-june_1728740053.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/23/2023102751282452gin1537.jpg?VersionId=sszD1sTUhAiPjksCMoVTLKX0pj_P2XNx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-s-cpfis-funds-underperformed-global-equities-in-year-to-end-june_1728740053.html", "title": "Singapore’s CPFIS funds underperformed global equities in year to end-June", "title_page": "Singapore’s CPFIS funds underperformed global equities in year to end-June | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The funds in the Central Provident Fund Investment Scheme (CPFIS) underperformed global equities after being left in the dust by surging US stocks.\nThe average one-year return of the 230 or so funds in the scheme was 9.69 per cent on a cumulative basis over the 12 months to June 30, 2024.\nThat was well under the MSCI World Index’s return of 20.36 per cent and the 13.05 per cent racked up by MSCI All Country Asia excluding Japan, Morningstar noted.\nMr Arvind Subramanian, a senior analyst at the research house, said CPFIS funds cover diverse categories globally, with a relatively higher concentration of Asia-focused funds than the MSCI World Index, which has more than 70 per cent weighting in the well-performing US market.\nHe added: “Given the divergence in the performance between US and Asia equities, that tends to limit the performance of CPF funds,” he said.\nThe CPFIS allows members to invest part of their retirement money in funds approved by the Monetary Authority of Singapore. A total of $32.2 billion was invested out of the $580 billion in CPF assets as at March 2024.\nMorningstar data showed that unit trusts in the scheme returned 9.71 per cent in the year to June 30, marginally better than the 9.68 per cent return from investment-linked insurance products. The overall performance of CPFIS-included funds fell to 3.11 per cent in the second quarter from 4.88 per cent in the first quarter of this year.\nGlobal equities rose 3.06 per cent in the second quarter of 2024, with the MSCI AC Asia excluding Japan delivering 7.65 per cent. Bond returns eased slightly to a negative 1.17 per cent for investors.\nOn a three-year cumulative basis, CPFIS funds returned a negative 2.26 per cent compared with the MSCI World Index’s positive 23.02 per cent return.\nUnit trusts posted net inflows into Singapore of $1.8 billion in the three months to June 30, up 88.9 per cent from $975.3 million in the preceding quarter. Every asset class registered positive net flows except for convertibles in the three months to June 30, according to Morningstar.\nFixed income remained the focus of investors and led the pack, attracting net inflows of $906.94 million. A lot of the money was garnered by popular funds like Pimco Income fund, followed by Asia bond funds.\nSingapore investors piled back into cash amid market volatility. Money market inflows jumped 70 per cent in the second quarter of 2024 compared with the preceding three months to $622.2 million.", "url": "https://www.straitstimes.com/business/singapore-s-cpfis-funds-underperformed-global-equities-in-year-to-end-june"}