{"authors": [], "date_download": "2024-10-12 14:08:57", "date_modify": "2024-10-12 14:08:57", "date_publish": "2024-04-19 09:18:05", "description": "The funds said the borrower’s action could set a dangerous precedent for the broader market. Read more at straitstimes.com.", "filename": "business_hedge-funds-cry-foul-over-chinese-education-firm-s-default_1728742137.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/19/SOLOMONS-CHINA-VOTE-072332.jpg?VersionId=MQf1aOjhoFlRJikTwp3VySyaySBEp3Mu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_hedge-funds-cry-foul-over-chinese-education-firm-s-default_1728742137.html", "title": "Hedge funds cry foul over Chinese education firm’s default", "title_page": "Hedge funds cry foul over Chinese education firm’s default | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - Hedge funds and other international investors are sounding alarms after a profitable education company from China defaulted on its convertible bonds in March.\nA group of bond holders – including some of Asia’s most prominent hedge funds – has alleged in public statements that the company chose not to pay its offshore debt even though its business is healthy and growing.\nThe investors, which include Hong Kong-based Oasis Management, PAG and Enhanced Investment Products, said the borrower’s action could set a dangerous precedent for the broader market.\nThe borrower in question is XJ International Holdings, a 16-year-old company that used to be called Hope Education Group.\nIt said in a filing in March that it had defaulted on the US$315 million (S$429 million) of convertible bonds, which are hybrid securities that can be converted into stock. Holders had used an option to demand repayment in March.\nThe bloc of investors – called the ad-hoc group, a term often used when creditors band together to try to recoup money – holds 49 per cent of the convertibles. It moved swiftly to file a winding-up petition in Hong Kong against the company.\nXJ did not reply to Bloomberg’s requests for comment. It said on March 28 that it was having difficulty redeeming the bonds because of “the impact of the external environment, industry policies and the company’s financial condition”.\nIn an April 14 statement, XJ said the cash on its balance sheet could only be used to run its schools, and that it has “a preliminary plan” to settle or restructure the defaulted debt.\nThe funds’ predicament shows how perilous investing in Chinese corporate bonds has become, after the country’s property sector downturn caused a wave of international debt defaults.\n“This could trigger a sector-wide reassessment of credit risk,” said Mr Lee Kher Sheng, Asia-Pacific co-head of the Alternative Investment Management Association, a global body representing hedge funds and private credit funds.\nHe said the incident shows that a company’s liquidity and ability to repay its debt are not the only factors that investors should consider when assessing default risk.\n“Equally vital are investor confidence and a firm’s willingness to fulfil its financial obligations,” said Mr Lee, who is not involved in the XJ case.\nCompanies from China have defaulted on more than US$100 billion in offshore bonds since 2021, according to data compiled by Bloomberg News.\nInternational bond holders have been struggling to recover money from some companies whose assets and operations are mostly onshore, as it has been difficult to enforce offshore court rulings in mainland China.\nIssuance of new high-yield dollar bonds and convertible debt from Chinese companies has dropped sharply, after many investors backed away from the formerly bustling market.\nXJ, which hails from the south-western Chinese city of Chengdu, operates 24 schools, including universities, junior colleges and vocational institutes that are mostly in China.\nThe Hong Kong-listed company posted 3.58 billion yuan (S$687 million) in revenue in its 2023 fiscal year, which ended in August, up 18 per cent from the previous year. It also reported a 20 per cent increase in gross profit.\nIn November 2023, XJ had said it expected to be able to “meet in full its financial obligations as they fall due for the foreseeable future”. The company reported cash and bank balances of 2.9 billion yuan at the end of August.\nDespite that, XJ in March defaulted on the outstanding convertible bonds that it issued in 2021. The five-year, zero-coupon securities had terms that required the company to redeem them that month if bond holders required it to –which they did.\nThe ad-hoc group of bond holders has since then released strongly worded statements accusing XJ of avoiding its debt obligations and not engaging with the investors.\nIt also said that XJ repaid a HK$620 million (S$107.8 million) loan to banks including Standard Chartered in January 2024, some 18 months ahead of its maturity date. It said XJ owes bond holders US$325 million, including accrued interest.\nA winding-up hearing for XJ has been scheduled for June.\n“The company believes that it is in the best interests of its creditors to achieve a reasonable debt restructuring plan,” XJ said in its recent filing, adding that the winding-up petition could harm its viability and hurt creditors’ recovery prospects.\nXJ’s shares have already slumped more than 90 per cent over the past three years to about 22 Hong Kong cents, giving the company a market capitalisation of HK$1.8 billion and rendering the warrant to convert the bonds to shares at HK$3.85 effectively worthless.\nThe company was caught up in a broader Chinese education stocks sell-off in 2021, when regulators in the country banned after-school tutoring companies that teach compulsory school subjects from making profits and raising capital.\nBeijing has instead been encouraging vocational training and higher education, a fact that XJ noted in its latest financial report. It said student enrolment at its schools hit a record high of 290,000 in 2023.\nIn Thailand and Malaysia, where the company also has schools, XJ’s international offshoots were able to raise money from Thai baht and Malaysian ringgit bond sales in 2023, guaranteed by a trust fund under the Asian Development Bank. BLOOMBERG", "url": "https://www.straitstimes.com/business/hedge-funds-cry-foul-over-chinese-education-firm-s-default"}