{"authors": [], "date_download": "2024-10-12 13:47:20", "date_modify": "2024-10-12 13:47:20", "date_publish": "2024-01-23 19:50:00", "description": "Switzerland’s biggest lender will use the slogan “Banking is our craft” as it seeks to attract new customers Read more at straitstimes.com.", "filename": "business_banking_ubs-unveils-big-branding-push-after-credit-suisse-takeover_1728740840.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/23/FILES-SWITZERLAND-BANKING-UBS-CREDITSUISSE-081141.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking_ubs-unveils-big-branding-push-after-credit-suisse-takeover_1728740840.html", "title": "UBS launches biggest branding push after takeover of Credit Suisse", "title_page": "UBS launches biggest branding push after takeover of Credit Suisse | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ZURICH - UBS on Jan 23 unveiled its biggest branding campaign since 2016 to drive growth, spending tens of millions of dollars to freshen its image after the takeover of Credit Suisse.\nSwitzerland’s biggest lender will use the slogan “Banking is our craft” as it seeks to attract new customers to its wealth management, asset management, and investment banking franchises.\nUBS declined to reveal the exact cost of the campaign, which will include online and printed advertisements, sponsorship, events, social media and billboards.\n“This is the most we’re investing in the brand since 2016,” UBS Group chief marketing officer John McDonald told Reuters. “This is about driving the business towards its growth ambitions.”\n“We want to make sure prospective customers become more familiar with UBS so they’re more likely to consider us when it’s time to choose a wealth manager, for instance.”\nThe decision to come up with a new tagline goes back to April 2023, after the rescue of Credit Suisse was arranged by the Swiss authorities to stave off a broader banking crisis and former CEO Sergio Ermotti returned to UBS.\nIn the past, UBS has used the slogans “We will not rest” and “For some of life’s questions, you are not alone. Together we can find an answer” in previous campaigns.\nThe new campaign was developed together with advertising firm Publicis Zurich and brand strategy company Prophet.\n“This campaign portrays UBS as a strengthened, global firm, and helps reshape how our clients, prospects and investors perceive us,” Mr Ermotti said.\nThe bank, which oversees more than US$5 trillion (S$6.7 trillion) in assets and is currently integrating Credit Suisse, has already agreed to continue the fallen bank’s longstanding sponsorship of the Swiss national football team and tennis legend Roger Federer.\nThe global campaign will go live first in Britain and the United States from Tuesday before being rolled out to 10 other countries, including Singapore, Australia, Germany and Japan.\nThe concept of “craft” evokes the best attributes of Swissness, Mr McDonald said, and would help raise awareness of UBS particularly in the United States and the Asia-Pacific region.\n“Craft signals personal attention, care, expertise, precision, passion,” Mr McDonald said. “...in a sense of a carefully curated expertise that’s deployed for an individual customer.” REUTERS", "url": "https://www.straitstimes.com/business/banking/ubs-unveils-big-branding-push-after-credit-suisse-takeover"}