{"authors": [], "date_download": "2024-10-12 14:16:07", "date_modify": "2024-10-12 14:16:07", "date_publish": "2022-03-14 12:40:07", "description": "\"This is short-term pain that we have to endure to truly maximise our long-term potential,\" he said in a company-wide e-mail. Read more at straitstimes.com.", "filename": "business_companies-markets_seas-secretive-billionaire-ceo-forrest-li-opens-up-after-75-stock-crash_1728742567.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/14/ac_forrestli_140322_2x.jpg?VersionId=W2SCPOPuozuIzh4.glgv4fEKPs6.xhNC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_seas-secretive-billionaire-ceo-forrest-li-opens-up-after-75-stock-crash_1728742567.html", "title": "Sea's secretive billionaire CEO Forrest Li opens up after 75% stock crash", "title_page": "Sea's secretive billionaire CEO Forrest Li opens up after 75% stock crash | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE (BLOOMBERG) - Last Monday (March 7), Sea's employees were starting their week when an e-mail from chief executive officer Forrest Li arrived. In the 900-word memo, the billionaire adopted a contrite tone, addressing head on a US$150 billion (S$205 billion) plunge in his company's value since late 2021.\n\"This drop is painful, and you might be feeling frustrated, disheartened or worried about Sea's future,\" the 44-year-old wrote in his e-mail, seen by Bloomberg News, which as sent companywide on the first working day after Sea notched its third-biggest stock decline. \"Do not fear: We are in a strong position internally and we are clear on our next steps. This is short-term pain that we have to endure to truly maximise our long-term potential.\"\nMr Li's missive was unusual and underscores changes under way at the gaming and e-commerce giant. In recent years, with the business growing rapidly, the founder addressed his troops mainly to celebrate key milestones. But after a run of extraordinary setbacks this year - including India's abrupt ban of its most popular mobile game - the company is showing signs of acceding to demands from shareholders and employees for more openness.\nGlobal investors that rode a 2,300 per cent rally from 2017 to 2021 had long been content to let Sea go about its business. That began to change in November when a disappointing quarterly report prompted a bout of profit-taking. The sell-off quickened in January when biggest backer Tencent Holdings announced it was selling part of its stake, then accelerated with India's ban in February before culminating in horrendous quarterly earnings this month. All told, Sea lost three-quarters of its value in five months.\nFund managers in recent months began to urge Sea to be more transparent about its strategy and numbers, according to people familiar with the matter. During an earnings call last week, Mr Li made unusually long and detailed remarks. He rarely talks about his ambitions at public forums, deferring communications to group chief corporate officer Yanjun Wang, a tight-lipped lawyer.\nDuring the call, Sea provided new and more specific data, including its first annual guidance for financial services arm SeaMoney and unit economics for online shopping arm Shopee in Brazil, as well as for South-east Asia and Taiwan.\n\"If not for the declining share prices, Sea might not have disclosed so many metrics,\" said Mr Kelvin Seetoh, a shareholder and co-founder of Singapore-based investor group 10X Capital. \"They could be doing this to allow investors to understand their business better and it's not too late.\"\nSea said additional disclosures reflect the growth and evolution of the business. \"As our businesses continue to grow and evolve around the world, we continue to share relevant information about those changes and our performance consistent with our longstanding commitment to our investors,\" the company said in a statement to Bloomberg News.\nEmployees, too, are requesting more information. In early March, Singapore-based consulting start-up Momentum Academy organised a webinar, enticingly titled Off The Record - Behind Shopee's Doors, to discuss the inner workings at the Sea unit. Among the more than 400 attendees were Shopee employees, eager to hear from the researchers with no ties to the company.\nThe pressure has triggered an internal debate among some teams as to how much the company should share publicly, said the people, who asked not to be named as the matter is private.\nSea's early tendency to share as little as possible stands out in industries where publicity is often sought. Unlike most gaming companies, its Garena unit almost never discloses upcoming titles. Senior executives began talking about Sea's ambition to become a global Internet company only two years after Shopee started operating in Brazil. A French business was started with little advance warning and then abruptly shut down.\nInvestors have resorted to creative ways to navigate the culture of secrecy - nurtured by Sea's top echelon including billionaires Mr Li and co-founder Gang Ye. The two own about a fifth of the company, while Mr Li has majority voting control. The firm's six-member board includes an executive each from Tencent and billionaire tycoon Robert Kuok's Kerry Group. Both firms are famously low-profile and among Sea's earliest investors.\nDuring Sea's early days as a publicly traded company, United States hedge funds hired local teams in Indonesia to collect data to verify whether Shopee was gaining traction, according to people with knowledge of the matter. The firms increased their bets on Sea as Shopee went on to become a major e-commerce player in South-east Asia and Taiwan. Soon, value investors, pension funds and sovereign wealth funds piled on.\n\"Many emerging-market fund managers had over-concentration in Sea, an off-benchmark stock,\" said Mr Gaurav Patankar, head of emerging market equity strategy at Bloomberg Intelligence in New York. \"The people left holding the bags are good old long-only investors, so panic sets in.\"\nMr Fred Liu, founder of New York-based hedge fund Hayden Capital, is among Sea investors who fly to South-east Asia regularly to gain insights. Passionate traders in Singapore keep close tabs on Mr Li and Mr Ye. They show up when the executives appear at public events, hoping to throw some burning questions, get some fresh business clues or even just to read their body language, one of the people said.\n\"You have to get in front of investors when times are bad,\" said Mr Liu, a Sea investor since 2018. \"You can't hide in a corner and not say anything. Investors will kill you for that. You have to communicate and be more open.\"\nSome even try to track down three corporate jets that Sea is believed to have purchased for its top brass to figure out which country the company plans to expand in next. The trio driving Sea's global business is Mr Li, Mr Ye and Mr Chris Feng, who is widely credited for Shopee's success and was recently promoted to Sea group president.\nAfter the India app ban, Mr Ye, who is in charge of government relations, travelled to the country and met Home Secretary Ajay Bhalla, according to a person familiar with the matter. The government is unlikely to reverse its ban on Sea's Free Fire game, though it probably will not block Shopee, another person with knowledge of the matter said. A government spokesman did not respond to a text message seeking comment.\nOn March 1, Mr Li and Mr Ye travelled to Jakarta to host Indonesian President Joko Widodo at a Sea event, part of a campaign to expand operations in South-east Asia's biggest economy. The live-streamed event showed a rare public appearance of the two low-profile executives.\nIn his e-mail to staff, Mr Li defended the management's decision to continue spending on growth for the next few years, rather than pursuing profitability to appease shareholders. The stock fell for a fifth consecutive session that day, resulting in a drop of about 40 per cent over the week.\n\"Some investors may prefer a different approach, but this is us taking a longer-term view,\" Mr Li wrote. \"We believe it is best for us to invest in capabilities now that will let us capture huge growth opportunities in our future.\"", "url": "https://www.straitstimes.com/business/companies-markets/seas-secretive-billionaire-ceo-forrest-li-opens-up-after-75-stock-crash"}