{"authors": [], "date_download": "2024-10-12 14:19:23", "date_modify": "2024-10-12 14:19:23", "date_publish": "2022-03-07 08:22:36", "description": "They are taking a cue from Beijing's stance of refraining from criticising Moscow over its invasion of Ukraine. Read more at straitstimes.com.", "filename": "business_economy_chinese-brands-stay-put-in-russia-for-now-despite-western-exodus_1728742763.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/07/ac_chinadidi_070322.jpg?VersionId=34yWltiz.mdnmvRgi4sDPTLCfyWYWYP8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_chinese-brands-stay-put-in-russia-for-now-despite-western-exodus_1728742763.html", "title": "Chinese brands stay put in Russia for now despite Western exodus", "title_page": "Chinese brands stay put in Russia for now despite Western exodus | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI (REUTERS) - Chinese firms are staying put in Russia for the moment despite a growing exodus of Western companies - albeit bracing for growing uncertainty - taking a cue from Beijing's stance of refraining from criticising Moscow over its invasion of Ukraine.\nEven as Apple, Nike, Netflix, fashion chain H&M and many other Western companies have cut or paused business in Russia amid a tide of sanctions and international criticism of President Vladimir Putin's actions, Chinese firms have so far stayed largely silent about their operations in Russia.\nThe Chinese government, which struck a \"no limits\" partnership accord with Russia just weeks before Moscow's Feb 24 invasion, has blamed Nato expansion for the crisis and urged talks to resolve the situation. On social media, the Chinese public has shown overwhelming support for Russia's attack, which Moscow calls a \"special operation\".\nChinese ride-hailing giant Didi Chuxing faced a public backlash in China last week after it announced it would pull out of Russia, with social media users accusing it of succumbing to United States pressure on Moscow. It later reversed the decision without giving an explanation.\nLenovo, the world's No. 1 personal computer maker, was also subject to heavy criticism in China when a local Belarusian news outlet reported, without saying where it got the information, that the company would stop supplying Russia. Lenovo did not respond to Reuters' requests for comment on the issue.\nThe relatively small size of the Russian market for Chinese firms would, however, make it easier for them to change tack and join foreign rivals in departing, especially as Moscow faces economic collapse due to growing Western sanctions.\n\"For most Chinese companies, Russia is just too small of a market for the business to be worth the risk of getting cut off from developed markets or being sanctioned itself,\" wrote Mr Dan Wang, an analyst for Gavekal Dragonomics, in a research note.\nRussia's smartphone market, for example, totalled 31 million units last year, or just one-tenth of China's domestic market size by comparison, according to research firm IDC.\nBy opting to stay in Russia, Chinese companies may be in a position to grab market share. But how long more they will be able to sell there for is a big question, given escalating sanctions and export curbs, analysts said.\nIn the realm of smartphones, Chinese brands such as Xiaomi and Honor vie with market leader Samsung and Apple for sales in Russia, while Chinese automakers such as Great Wall Motor and BYD have also targeted the Russian market in recent years.\nThese Chinese smartphone makers use chips designed at least partially with US-origin technology.\nThis potentially subjects them to secondary sanctions against Russia via the Foreign Direct Product Rule, which stipulates that products with a certain percentage of US-origin technology cannot be shipped to targeted parties without a proper licence.", "url": "https://www.straitstimes.com/business/economy/chinese-brands-stay-put-in-russia-for-now-despite-western-exodus"}