{"authors": [], "date_download": "2024-10-12 14:13:51", "date_modify": "2024-10-12 14:13:51", "date_publish": "2021-04-29 11:34:38", "description": "HSBC is also hiring more than 5,000 new wealth planners to grow its Asia business. Read more at straitstimes.com.", "filename": "business_banking_hsbc-opens-family-office-in-singapore-and-hong-kong-for-crazy-rich-asian-clients_1728742431.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/04/29/rk_hsbc_290421.jpg?VersionId=obt3Co.zXOlFs7xptSdOUWfDSCxVqGab", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking_hsbc-opens-family-office-in-singapore-and-hong-kong-for-crazy-rich-asian-clients_1728742431.html", "title": "HSBC opens family office in Singapore and Hong Kong for crazy rich Asian clients", "title_page": "HSBC opens family office in Singapore and Hong Kong for crazy rich Asian clients | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE (BLOOMBERG) - HSBC Holdings is offering its ultra-rich clients in Asia direct access to its investment bankers as the lender targets becoming a leader in managing wealth in an increasingly affluent region.\nThe London-based bank, which makes the bulk of its profits in Asia, has opened a new institutional family office in Hong Kong and Singapore, which will give access to a full spate of financing and investment products, deal making and institutional market access, the lender said in a statement on Thursday (April 29).\nHSBC is investing US$3.5 billion (S$4.6 billion) and hiring more than 5,000 new wealth planners to grow its business in Asia over the next three to five years as part of a broader pivot to the region. Like other banks, it has struggled with low interest rates over the past years and is seeking out more fee-based income to boost profitability.\n\"We are seeing greater interest from Asian clients who are setting up and expanding family offices, to adopt institutional approaches to build continuity, diversification and resilience in their investment portfolios,\" said Ms Siew Meng Tan, regional head of HSBC Private Banking, Asia-Pacific in the statement.\nIn the next decade, about US$1.9 trillion of wealth in Asia will be passed on to the next generation, HSBC said. Globally, HSBC Private Banking attracted US$13.1 billion of inflows in the first quarter, up from $5.4 billion in the same period last year.", "url": "https://www.straitstimes.com/business/banking/hsbc-opens-family-office-in-singapore-and-hong-kong-for-crazy-rich-asian-clients"}