{"authors": [], "date_download": "2024-10-12 14:08:13", "date_modify": "2024-10-12 14:08:13", "date_publish": "2024-08-12 12:19:00", "description": "If the decline continues for the rest of year, it would be the first annual net outflow since at least 1990. Read more at straitstimes.com.", "filename": "business_foreign-investors-pulled-record-amount-of-money-from-china-in-second-quarter_1728742093.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/12/awshanghai2.jpg?VersionId=2juEaRmxzdvuIENf_8lXTMgwoj2KgB8W", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_foreign-investors-pulled-record-amount-of-money-from-china-in-second-quarter_1728742093.html", "title": "Foreign investors pulled record amount of money from China in second quarter", "title_page": "Foreign investors pulled record amount of money from China in second quarter | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Foreign investors pulled a record amount of money from China in the second quarter, likely reflecting deep pessimism about the world’s second-largest economy.\nChina’s direct investment liabilities in its balance of payments dropped almost US$15 billion (S$19.9 billion) in the April to June period, marking only the second time this figure has turned negative, according to data released on Aug 9 by the State Administration of Foreign Exchange (Safe). It was down about US$5 billion for the first six months.\nShould the decline continue for the rest of 2024, it would be the first annual net outflow since at least 1990, when comparable data begins.\nForeign investment into China has slumped in recent years, after hitting a record US$344 billion in 2021. The slowdown in the economy and rising geopolitical tensions have led some companies to reduce their exposure, and the rapid shift to electric vehicles in China also caught foreign car companies off guard, prompting some to withdraw or scale back their investments.\nThe fall comes despite Beijing’s growing efforts to attract and retain foreign investment, following the smallest increase on record in 2023.\nThe government wants to show that the country remains open and attractive to foreign businesses, in the hope that companies will bring advanced technologies and resist pressure from the United States and elsewhere to decouple from China.\nSafe’s data, which tracks net flows, can reflect trends in foreign companies’ profits, as well as changes in the size of their operations in China. Multinationals have more reason to keep cash abroad than in China, as advanced economies have been raising interest rates while Beijing has been lowering them to stimulate the economy.\nEarlier figures from the Ministry of Commerce showed that new foreign direct investment into China during the first half of 2024 was the lowest since the start of the Covid-19 pandemic in 2020.\nChinese outbound investment also hit a record, with firms sending US$71 billion overseas in the second quarter, a rise of more than 80 per cent from the US$39 billion in the same period in 2023.\nChinese companies have been rapidly stepping up investment, with money going into projects such as electric vehicle and battery factories.\nThe data also showed that the anomaly in the measurement of China’s trade surplus continues to grow, hitting a record US$87 billion in the second quarter and taking it to almost US$150 billion for the first half of 2024. That gap was highlighted by the US Treasury earlier in 2024 in a report that called on China to clarify why the numbers were so different.\nAccording to a recent report from the International Monetary Fund, this discrepancy “seems to be mainly caused by the different methodologies used to record exports and imports of goods”. BLOOMBERG", "url": "https://www.straitstimes.com/business/foreign-investors-pulled-record-amount-of-money-from-china-in-second-quarter"}