{"authors": [], "date_download": "2024-10-12 14:16:18", "date_modify": "2024-10-12 14:16:18", "date_publish": "2023-11-24 23:35:00", "description": "Employment in the private sector declined for the first time in almost three-and-a-half years Read more at straitstimes.com.", "filename": "business_economy_us-business-activity-steady-in-november-sp-global-survey_1728742578.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/24/ENTERTAINMENT-CHINA-MUSIC-LANGLANG-Entertainment-US-China-music-LangLang-002117.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_us-business-activity-steady-in-november-sp-global-survey_1728742578.html", "title": "US business activity steady in November: S&P Global survey", "title_page": "US business activity steady in November: S&P Global survey | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - US business activity held steady in November, but employment in the private sector declined for the first time in almost three-and-a-half years, consistent with expectations for an economic slowdown in the fourth quarter.\nS&P Global said on Nov 24 that its flash US Composite PMI Output Index, which tracks the manufacturing and services sectors, was unchanged at 50.7 this month as a modest rise in services sector activity offset a contraction in manufacturing. A reading above 50 indicates expansion in the private sector.\nThe survey’s flash manufacturing PMI dropped to 49.4 this month from 50.0 in October. Its flash services sector PMI edged up to 50.8 from 50.6 in the prior month.\nEconomists expect overall economic activity to moderate considerably this quarter as the lagged effects of higher interest rates from the Federal Reserve start to have a greater impact. Since March 2022, the U.S. central bank has raised its policy rate by 525 basis points to the current 5.25 per cent - 5.50 per cent band.\nThe economy grew at a 4.9 per cent annualised rate in the third quarter. Growth estimates for the October-December quarter are mostly below a 2 per cent pace.\nThe flash composite new orders index increased to 50.4 in November, ending three straight monthly declines. The modest rise from a reading of 49.0 in October was mostly driven by the services sector, with factory orders stagnant.\nThe lack of strong order growth resulted in businesses shedding workers, with the survey’s employment index dropping to 49.7. That was the first contraction since June 2020 and followed a reading of 51.3 in October.\nS&P Global said businesses commonly cited relatively muted demand conditions and elevated cost pressures as the reasons for layoffs, which were across both manufacturing and services sectors. Companies were also implementing hiring freezes.\n“Job shedding has spread beyond the manufacturing sector, as services firms signalled a renewed drop in staff in November as cost savings were sought,” S&P Global Market Intelligence principal economist Sian Jones said in a statement.\nThe decline in the employment gauge could be flagging a sharp slowdown in the labour market in the months ahead. The labour market has been gradually cooling, with the unemployment rate rising to 3.9 per cent in October, the highest in nearly two years.\nAn easing labor market will aid the Fed’s fight against inflation. That battle is likely to get another boost from subsiding prices for energy and other raw materials.\nThe S&P Global survey’s measure of prices paid by businesses for inputs fell to 55.7, the lowest level since October 2020, from 57.3 in October. In addition to the lower energy and raw material prices, some firms also reported that a reduction in headcount had eased cost pressures.\nThough businesses are still raising prices for their products and services, the pace has slowed considerably from last year. REUTERS", "url": "https://www.straitstimes.com/business/economy/us-business-activity-steady-in-november-sp-global-survey"}