{"authors": [], "date_download": "2024-10-12 13:28:36", "date_modify": "2024-10-12 13:28:36", "date_publish": "2024-10-04 04:37:32", "description": "Dow Jones Industrial Average falls 0.4 per cent to 42,011.59. Read more at straitstimes.com.", "filename": "business_companies-markets_us-stocks-fall-amid-caution-over-middle-east_1728739716.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/04/US-NEW-YORK-STOCK-EXCHANGE-OPENS-ON-MONDAY-MORNING-143757.jpg?VersionId=O2vfikyVZXJnEY0gxoj7bey74L0OALi4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_us-stocks-fall-amid-caution-over-middle-east_1728739716.html", "title": "US stocks fall amid caution over Middle East", "title_page": "US stocks fall amid caution over Middle East | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Wall Street stocks slipped on Oct 3, extending a downcast week as markets assessed tensions in the Middle East and awaited key US jobs data.\nOil prices jumped after President Joe Biden told reporters he was discussing possible Israeli retaliatory strikes on Iranian oil facilities. The move lifted petroleum-linked equities but pressured the broader market.\nThere’s a “lot of concern” that the Iran-Israel conflict will escalate, said Briefing.com analyst Patrick O’Hare. “So you have a little bit of a hesitation factor, not a lot of conviction on the part of buyers.”\nThe Dow Jones Industrial Average dropped 0.4 per cent to 42,011.59.\nThe broad-based S&P 500 declined 0.2 per cent to 4,699.94, while the tech-rich Nasdaq Composite Index slipped less than 0.1 per cent at 17,918.48.\nThe Institute for Supply Management’s services index jumped to 54.9 per cent in September, above expectations and a boost to confidence in the US economy.\nMarkets are looking ahead to Friday’s September jobs report, which will influence upcoming Federal Reserve decisions on whether to keep cutting interest rates.\nInvestors are also monitoring a major US ports strike, which entered its third day and has potential to reignite inflation.\nPetroleum-linked shares advanced with oil prices. ConocoPhillips gained 1.8 per cent and both Halliburton and Apache won about 3 per cent.\nBut Constellation Brands dropped 4.7 per cent as the company’s wine and spirits division experienced a 12 per cent drop in quarterly sales compared with the year-ago period. AFP", "url": "https://www.straitstimes.com/business/companies-markets/us-stocks-fall-amid-caution-over-middle-east"}