{"authors": ["Kang Wan Chern"], "date_download": "2024-10-12 14:22:02", "date_modify": "2024-10-12 14:22:02", "date_publish": "2024-07-12 14:15:00", "description": "This will increase the likelihood of the two countries reaching an agreement, they said at a forum. Read more at straitstimes.com.", "filename": "business_private-sector-needs-to-shape-policies-on-johor-s-pore-sez-as-negotiations-continue_1728742922.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/IMG1345.JPG?VersionId=KErCQvg.3tgQVZAUe9rIUsDPqOPok96N", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_private-sector-needs-to-shape-policies-on-johor-s-pore-sez-as-negotiations-continue_1728742922.html", "title": "Private-sector needs to shape policies on Johor-S’pore SEZ as talks continue, say panellists", "title_page": "Private-sector needs to shape policies on Johor-S’pore SEZ as talks continue, say panellists | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A deal between Singapore and Malaysia to develop South-east Asia’s first cross-border economic zone in Johor will be shaped by private-sector needs from both sides of the Causeway, trade officials and businesses said at a July 11 forum.\nThis will increase the likelihood of the two countries reaching an agreement to implement the Johor-Singapore Special Economic Zone (JSSEZ), which was first formally proposed in January.\nBoth governments are intensifying efforts to establish a workable framework for the economic zone and secure greater buy-in from potential investors.\n“By combining Singapore’s advantages in areas such as technology and connectivity, with Malaysia’s manufacturing capabilities and resources, we can create a synergistic partnership that propels both economies forward,” said Mr Teo Siong Seng, chaiman of a Singapore business working group put together to understand the perspectives and needs of the business community regarding the JSSEZ.\n“We must approach this opportunity with creativity and a willingness to challenge conventional business models.”\nMr Teo was speaking at the JSSEZ Joint Investor Forum, which was held in the Republic by the Singapore Business Federation (SBF).\nThe proposal to establish the JSSEZ comes after similar efforts to collaborate on projects like the Iskandar Economic Zone failed to hit their investment targets.\n“When Malaysia established Iskandar (in 2006), we tried to get Singapore to come and invest. But that model is no longer workable for the future that we are facing,” High Commissioner of Malaysia to Singapore Azfar Mohamad Mustafa said at the forum.\nIskandar did not realise its full potential due to the strategies adopted for investment structuring and implementation, which adversely affected investment climate and investor confidence, according to industry feedback.\nDr Azfar said Singapore and Johor must now draw from each other’s resources and skills and establish a single ecosystem with streamlined regulations and free movement of goods and people, as this will appeal to investors looking to invest or expand further in South-east Asia.\n“That is the whole idea of establishing the JSSEZ,” he said.\nSupport and feedback from the private sector will be crucial to a deal on the JSSEZ, where Malaysia and Singapore officials are hoping to draw investments from sectors such as logistics and manufacturing amid geopolitical shifts away from China, as well as from data centres, healthcare and financial services.\n“The days when the government knows all are over. We can come up with good policies, but if they don’t make sense to the private sector, then they will not be sustainable features for that project,” Dr Azfar said.\nThe forum in Singapore took place a day after Malaysia’s Economy Minister Rafizi Ramli said at a similar forum in Kuala Lumpur that an agreement on the JSSEZ should be signed in September.\nIt was previously reported that the definitive full-fledged agreement between both countries is expected to be inked in the fourth quarter of 2024.\nSingapore’s Ministry of Trade and Industry, which is negotiating with its Malaysian counterparts on the JSSEZ, has not provided a timeline on a deal.\nIn replies to parliamentary questions in May, Minister of State for Trade and Industry Alvin Tan noted that updates on the progress will be provided at a Singapore-Malaysia leaders’ retreat later in the year.\nAt the forum, SBF shared the findings of a survey it conducted earlier in 2024 of 160 Singaporean businesses about the potential of an SEZ. This revealed that 93 per cent of respondents view Johor as an attractive investment destination, with 50 per cent already operating in the state.\nRecommendations from a JSSEZ working group comprising Singapore companies to address key pain points were also revealed at the forum. These include harmonising workforce regulations and streamlining tax and customs policies to ease the movement of goods.\nThere were also discussions with private-sector organisations, which included the Singapore Manufacturing Federation, United Overseas Bank and CapitaLand Development.\nAsked how the JSSEZ is different from previous initiatives, trade officials from Malaysia noted that engagement between the two governments as well as with the private sector has gained momentum in the six months since a memorandum of understanding to work on the JSSEZ was signed in January.\nThey added that there is strong buy-in from Malaysia’s federal and state governments, and that the JSSEZ will not be starting from scratch, as it can leverage existing infrastructure at Iskandar to draw investors.\n“Coupled with tax incentives, that will really attract businesses and investors to be based (in the SEZ),” said Mr Vinothan Tulisinathzan, director of the Malaysian Investment Development Authority in Singapore.", "url": "https://www.straitstimes.com/business/private-sector-needs-to-shape-policies-on-johor-s-pore-sez-as-negotiations-continue"}