{"authors": ["Rosalind Ang"], "date_download": "2024-10-12 13:44:26", "date_modify": "2024-10-12 13:44:26", "date_publish": "2023-05-31 15:00:00", "description": "It comes after the airline said it will make some changes to its meal offerings from June 1. Read more at straitstimes.com.", "filename": "business_sia-to-offer-free-unlimited-wi-fi-to-krisflyer-members-flying-economy-from-july-1_1728740666.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/31/IMGSIA21KA1H456_7.jpg?VersionId=WOImuoRr_mwKLKXNNrFYunou0V8.u_jm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_sia-to-offer-free-unlimited-wi-fi-to-krisflyer-members-flying-economy-from-july-1_1728740666.html", "title": "SIA to offer free unlimited Wi-Fi to KrisFlyer members flying economy from July 1", "title_page": "SIA to offer free unlimited Wi-Fi to KrisFlyer members flying economy from July 1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore Airlines (SIA) will give free unlimited in-flight Wi-Fi to KrisFlyer member passengers flying in economy and premium economy classes from July 1.\nThe move is part of SIA’s efforts to improve flight experiences for its passengers, said chief executive officer Goh Choon Phong at a media roundtable on Tuesday.\nIt comes after the airline said it will make some changes to its meal offerings from June 1, such as re-introducing appetisers to economy class meals.\nThe roll-out of free in-flight Wi-Fi to KrisFlyer members in the economy and premium economy classes is a step up from SIA’s increase in Wi-Fi privileges in January.\nThe airline had said in January that passengers travelling in its suites, and first and business classes, as well as Priority Passenger Service (PPS) Club members, will enjoy complimentary unlimited in-flight Wi-Fi.\nKrisFlyer members in the economy class and premium economy classes are currently given two hours and three hours of free Wi-Fi respectively.\nSigning up for a KrisFlyer membership is free.\nSIA had recently announced that from June 1, it will bring appetisers back for its economy class main course meals on flights that are longer than 3½ hours.\nIn addition to an appetiser, meals on economy class flights that are 3½ hours and longer will be served with a bread roll, a main course, cheese and crackers, and a dessert.\nBread rolls will also be added back to economy class meals on short-haul flights between 1½ and 3½ hours, complete with a main course and dessert.\nIn April 2020, SIA increased the weight of its main courses by 30 per cent. This is applicable to flights lasting 3½ hours and above.\nSome passengers called its March trial of paper serviceware a cost-cutting measure. The trial was rolled out in economy class and premium economy class on selected flights to reduce the amount of single-use plastics on board the aircraft, according to SIA.\nSome netizens then compared the paper boxes to paper meal boxes used by the Singapore Armed Forces.\nNetizens in April also took to online forum Reddit to question the drop in food quality for economy class passengers.\nMr Goh, 60, said SIA had removed the appetisers from its in-flight main courses as data collected showed that many passengers did not consume them. The decision was made in a bid to reduce food wastage.\nHe added that the design of the serviceware is able to retain heat and moisture for dishes like mee siam, helping to enhance the taste and quality of the airline’s main courses.\nDespite that, he acknowledged that SIA could have done better in understanding how its customers would perceive the execution of such plans. “People probably expect more when they travel on medium- and long-haul flights. Such events are lessons for us; our people will be looking into this to see what exactly we can learn from it,” said Mr Goh.\n“We can implement certain things based on data, but when we implement things that touch consumers, more has to be considered than the data.”\nEconomy class meals served in sustainable tableware were first introduced in December 2020 for short-haul flights. The meals include a variety of dishes like congee, laksa and mee siam.\nSIA’s current budget for in-flight meals is about 20 per cent higher than that for the 2019/2020 financial year, he added.\nResponding to queries on whether the improvements will lead to higher fares, Mr Goh said tickets are not priced based on SIA’s business costs but depend on demand and supply.\n“There are areas we can look at to improve our processes’ workflow and productivity, but we should not compromise on our customers,” he said.", "url": "https://www.straitstimes.com/business/sia-to-offer-free-unlimited-wi-fi-to-krisflyer-members-flying-economy-from-july-1"}