{"authors": [], "date_download": "2024-10-12 13:51:52", "date_modify": "2024-10-12 13:51:52", "date_publish": "2023-12-11 18:39:23", "description": "TOKYO - The yen fell against the US and Singapore currencies on Dec 11 due to waning expectations that the Bank of Japan (BOJ) will tighten its ultra-loose monetary policy next week. Read more at straitstimes.com.", "filename": "business_yen-falls-versus-us-singapore-dollar-as-bank-of-japan-tightening-bets-fade_1728741112.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/11/2023-11-24T055354Z1050030200RC2GJ4ANDW11RTRMADP3JAPAN-YEN.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_yen-falls-versus-us-singapore-dollar-as-bank-of-japan-tightening-bets-fade_1728741112.html", "title": "Yen falls versus US, Singapore dollar as Bank of Japan tightening bets fade", "title_page": "Yen falls versus US, Singapore dollar as Bank of Japan tightening bets fade | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO - The yen fell against the US and Singapore currencies on Dec 11 due to waning expectations that the Bank of Japan (BOJ) will tighten its ultra-loose monetary policy next week.\nThe Japanese currency firmed sharply last week after comments from officials including governor Kazuo Ueda were taken as hints that it could end its long-running negative interest rates policy after its Dec 19 gathering.\nBloomberg on Monday cited unnamed sources as saying that BoJ officials see little need to rush into tightening policy without more evidence of wage growth that would support sustainable inflation.\nThat was taken as an indication the bank will stand pat next week, Bloomberg reported.\nThe yen weakened to 146.14 per US dollar and to 108.77 per Singdollar in Singapore at the market close.\nMost other major central banks have pressed ahead with a campaign of interest rate hikes in a bid to tame rising prices but the BoJ has refused to shift from its long-term programme of sub-zero rates in order to kickstart the world’s number three economy.\nJapanese policymakers have for several months merely made minor tweaks to its yield curve control scheme, which sees the BoJ control the band within which government bonds are allowed to move.\nAnalysts have said the BoJ’s outlier policy is harming the economy by skewing the bond market and weakening the yen, in turn making imports more expensive.\nHigher interest rates outside Japan have also prompted investors to invest money elsewhere and any tightening in BoJ policy could see cash flowing back, hitting assets elsewhere such as US Treasuries and stocks. AFP", "url": "https://www.straitstimes.com/business/yen-falls-versus-us-singapore-dollar-as-bank-of-japan-tightening-bets-fade"}