{"authors": [], "date_download": "2024-10-12 14:19:36", "date_modify": "2024-10-12 14:19:36", "date_publish": "2023-01-26 07:36:54", "description": "Tesla beat Wall Street targets for Q4 revenue and profit earlier on Wednesday despite a sharp decline in vehicle profit margins. Read more at straitstimes.com.", "filename": "business_elon-musk-says-tesla-demand-is-double-production-rate-as-price-cuts-trigger-interest_1728742776.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/26/FILES-US-AUTOMOBILE-EARNINGS-ENVIRONMENT-TESLA-213407_6.jpg?VersionId=c8syaEbxpYEX3GqDPX8XvIhFAA8qEIHz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_elon-musk-says-tesla-demand-is-double-production-rate-as-price-cuts-trigger-interest_1728742776.html", "title": "Elon Musk says Tesla price cuts triggered demand, 2023 sales could hit 2 million vehicles", "title_page": "Elon Musk says Tesla price cuts triggered demand, 2023 sales could hit 2 million vehicles | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAN FRANCISCO – Tesla’s aggressive price cuts have ignited demand for its electric vehicles (EVs), chief executive Elon Musk said on Wednesday, playing down concerns that a weak economy will throttle buyers’ interest.\nThe company slightly beat Wall Street targets for fourth-quarter revenue and profit earlier on Wednesday despite a sharp decline in vehicle profit margins, and it sought to reassure investors that it can cut costs to cope with recession and as competition intensifies in the year ahead.\nDeep price cuts this month have positioned Tesla as the initiator of a price war, but its forecast of a 37 per cent rise in car volume for the year to 1.8 million vehicles was down from 2022’s pace.\nTesla’s sales prospects, as it confronts a weaker economy, are a key focus for investors. The company said it maintains a long-term target of a compounded 50 per cent annual rise in sales.\nMr Musk addressed the issue at the start of a call with investors and analysts.\n“These price changes really make a difference for the average consumer,” he said, adding that vehicle orders were roughly double the production in January, leading the automaker to make small price increases for the Model Y sport utility vehicle.\nMr Musk, who has missed his own ambitious sales targets for Tesla in recent years, said that deliveries in 2023 could hit two million vehicles, absent external disruption.\n“There are going to be bumps along the way and we will probably have a pretty difficult recession this year,” he said. “We think demand will be good despite probably a contraction in the automotive market as a whole.”\nTesla shares rose 5.3 per cent in extended trading on Wednesday.\nThe company said its automotive profit margins, which dropped to a two-year low of 25.9 per cent in the reported quarter, would be above 20 per cent, pressured by the costs of ramping up battery production and new factories in Berlin and Texas, as well as higher raw material, commodity, logistics and warranty costs.\nAnalysts said Tesla’s goal is bullish given the macroeconomic uncertainties.\n“I think that you are going to see some severe demand destruction across consumer spending and I think cars are going to take a big hit,” said Oanda senior market analyst Edward Moya.\nTesla said it does not expect meaningful volume growth in the near term from China, as its Shanghai factory was running at near full capacity, rebounding from production challenges earlier this year.\n“Even a small cooling of demand will have significant implications for the bottom line,” said Ms Sophie Lund-Yates, an analyst at Hargreaves Lansdown.\nMargins generally are expected to be under further pressure from its aggressive price cuts. Tesla, which had made a series of price increases since early 2021, reversed course and offered discounts in December in the United States, followed by price cuts of as much as 20 per cent in January.\nAnalysts had said Tesla’s profitability gave it room to cut prices and pressure rivals. The company’s US$9,000 (S$11,800) in net profit per vehicle in the past quarter was more than seven times the comparable figure for Toyota Motor in the third quarter. But it was down from almost US$9,700 in the third quarter.\nThe company’s stock posted its worst drop last year, hit by demand worries and Mr Musk’s acquisition of Twitter, which fuelled investor concerns that he would be distracted from running Tesla.\nMr Musk dismissed surveys that suggest his political comments on Twitter are damaging the Tesla brand. “I might not be popular (with some), but for the vast majority of people, my follow count speaks for itself,” he said. He has 127 million followers.\nThe company said revenue was US$24.32 billion for the three months ended Dec 31, compared with analysts’ average estimate of US$24.16 billion, according to IBES data from Refinitiv.\nTesla’s full-year earnings were bolstered by US$1.78 billion in regulatory credits, up 21 per cent from a year earlier.\nNet profit for the quarter was US$3.69 billion, or US$1.07 per share, compared with US$2.32 billion, or 68 cents per share, a year earlier. Adjusted earnings per share of US$1.19 topped the Wall Street analyst average of US$1.13. REUTERS", "url": "https://www.straitstimes.com/business/elon-musk-says-tesla-demand-is-double-production-rate-as-price-cuts-trigger-interest"}