{"authors": [], "date_download": "2024-10-12 13:46:57", "date_modify": "2024-10-12 13:46:57", "date_publish": "2024-05-28 11:05:00", "description": "UBS is present in 13 locations in Asia Pacific. Read more at straitstimes.com.", "filename": "business_ubs-signals-it-s-mostly-done-cutting-asia-jobs-after-credit-suiise-takeover_1728740817.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/28/FILES-SWITZERLAND-UBS-BANKING-EARNING-093247.jpg?VersionId=LQfBrXsNWKO3myRBgqP9i08Xd7hnGbyN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_ubs-signals-it-s-mostly-done-cutting-asia-jobs-after-credit-suiise-takeover_1728740817.html", "title": "UBS signals it’s mostly done cutting Asia jobs after Credit Suisse takeover", "title_page": "UBS signals it’s mostly done cutting Asia jobs after Credit Suisse takeover | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – UBS Group’s Asia-Pacific president signalled that most of the bank’s job cuts in the region are over as it nears an official completion of its historic merger with Credit Suisse Group.\n“We have optimised most of the positions both in terms of lines of business and the geography,” Mr Edmund Koh, Asia Pacific president at UBS, said in an interview with Bloomberg Television on May 28.\nUBS is present in 13 locations in Asia Pacific and “for most of that, we are done”, he added.\nThe Swiss lender has been cutting thousands of staff following an emergency rescue of Credit Suisse last year in a government-brokered deal. The takeover is due to close officially this week, according to Mr Koh.\n“Staff attrition rate, both voluntary and involuntary, you know, was quite high,” he noted at the UBS Investment Conference in Hong Kong. “That’s because of duplication of roles that we have eliminated.”\nUBS has retained the best of both teams and added net new assets while client retention has been “very strong”.\nMr Koh said the bank tries not to cut jobs, but roles are assessed every year based on productivity. On behalf of shareholders, it is always right to swop for “better and more committed staff”.\nClients have been putting money to work, investing in bonds and the US market, while the China internet industry is “coming back”, added Mr Koh.\nUBS, which runs the largest private bank in Asia with about US$850 billion (S$1.15 trillion) of assets, is rebuilding in markets such as India. “It’s a good market for us, but still early days in India, still a lot of heavy lifting to do”, he said.\nZurich-based UBS returned to profit in the first quarter after two quarters of losses, cementing sustained progress in the integration of Credit Suisse after its rescue last year. BLOOMBERG", "url": "https://www.straitstimes.com/business/ubs-signals-it-s-mostly-done-cutting-asia-jobs-after-credit-suiise-takeover"}