{"authors": [], "date_download": "2024-10-12 13:57:19", "date_modify": "2024-10-12 13:57:19", "date_publish": "2024-01-15 07:32:00", "description": "Final binding bids are due by February before Chinese New Year, sources said. Read more at straitstimes.com.", "filename": "business_hillhouse-mitsui-vying-for-singapore-s-eu-yan-sang-in-9325-million-deal-sources_1728741439.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/15/RAJafeys020865.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_hillhouse-mitsui-vying-for-singapore-s-eu-yan-sang-in-9325-million-deal-sources_1728741439.html", "title": "Hillhouse, Mitsui vying for Singapore’s Eu Yan Sang in $933 million deal: Sources", "title_page": "Hillhouse, Mitsui vying for Singapore’s Eu Yan Sang in $933 million deal: Sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG/SINGAPORE – Private equity firm Hillhouse and Japan’s Mitsui & Co have emerged as final bidders vying for Singapore-headquartered traditional Chinese medicine (TCM) chain Eu Yan Sang International, in a deal that could fetch more than US$700 million (S$933 million), two people with knowledge of the matter said.\nEu Yan Sang’s shareholders, led by Singapore-based asset manager Tower Capital Asia, will conduct management presentations with the bidders next week, said one of the sources.\nFinal binding bids are due by February before Chinese New Year, the sources said.\nA third bidder is also in the mix to buy Eu Yan Sang, according to one of the sources and a third person familiar with the transaction, but Reuters could not verify the identity.\nAll the sources declined to be named as the process is private.\nHillhouse and Mitsui declined to comment. Eu Yan Sang and Tower Capital did not immediately respond to requests seeking comment on Jan 12.\nEu Yan Sang, which has been around for over 140 years, now runs a distribution network with more than 170 retail outlets in mainland China, Hong Kong, Macau, Malaysia and Singapore.\nIt also operates 30 TCM clinics in Singapore, Malaysia, Hong Kong and mainland China, and a food and beverage outlet in Malaysia, its website shows.\nA consortium consisting of Tower Capital, a unit of Singapore’s Temasek, and Eu Yan Sang’s group chief executive officer, Mr Richard Eu, took the company private from the Singapore bourse in 2016. The deal valued Eu Yan Sang at about US$196 million at the time.\nMitsui has an indirect interest in Eu Yan Sang by way of having participated in 2022 in a Tower Capital Asia fund that is an investor in Eu Yan Sang, according to a statement at the time.\nHillhouse, founded by China-born dealmaker Lei Zhang, has a minority interest in Eu Yan Sang, having first invested in the company before its delisting in 2016. REUTERS", "url": "https://www.straitstimes.com/business/hillhouse-mitsui-vying-for-singapore-s-eu-yan-sang-in-9325-million-deal-sources"}