{"authors": ["Colin Tan"], "date_download": "2024-10-12 13:28:16", "date_modify": "2024-10-12 13:28:16", "date_publish": "2024-10-11 19:45:00", "description": "The new scheme by EnterpriseSG offers only trade and commodity financing for now. Read more at straitstimes.com.", "filename": "business_new-scheme-lets-local-companies-borrow-from-foreign-lenders-when-expanding-to-europe_1728739696.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/IMG3247.JPG?VersionId=oiyZslbVvGs9w3E.Do1G7aLwSENsTs.1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_new-scheme-lets-local-companies-borrow-from-foreign-lenders-when-expanding-to-europe_1728739696.html", "title": "New scheme lets local companies borrow from foreign lenders when expanding to Europe", "title_page": "New scheme lets local companies borrow from foreign lenders when expanding to Europe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Local companies looking to expand into Europe and beyond will now be able to leverage a new scheme that allows them to obtain loans directly from selected foreign lenders, with Enterprise Singapore (EnterpriseSG) sharing 50 per cent of the risk.\nThe Enterprise Financing Scheme – Foreign-based Financial Institutions currently offers international trade and commodity financing of up to $8 million for a period of up to a year.\nOver the longer term, financing options will be gradually extended to include loans for working capital, fixed assets, projects, as well as mergers and acquisitions, which will have different quantum and tenor.\nTo be eligible for the scheme, companies must have an annual sales turnover of $100 million or less for working capital loans, or $500 million or less for other types of loans, in addition to meeting other criteria.\nThe move is in line with the push to help Singapore companies break into new markets and take advantage of the opportunities there, said Mr Geoffrey Yeo, EnterpriseSG assistant managing director for capabilities, urban systems and solutions, adding that “financing is a key enabler”.\nCredit Europe Bank (CEB), a niche lender headquartered in Amsterdam, is the first to participate in the scheme.\n“The access to CEB’s networks, expertise and funding can help more companies accelerate their market expansion – not just in Europe, but in markets worldwide,” noted Mr Yeo.\nThe Dutch lender operates in markets such as the Netherlands, Germany, Malta, Romania, Switzerland, Ukraine and Turkey, serving just under a million retail and corporate clients worldwide, particularly from emerging economies.\nCEB chief executive Senol Aloglu said: “Trade and commodity finance are core components of our business, and we have decades of experience.”\nHe added: “It aligns with our ambition to further diversify our customer base and to serve more customers in major global trade and commodity hubs.”\nSimilar to other financing schemes EnterpriseSG provides, the new scheme sees the statutory board share part of the risk “to support lending to Singapore companies from partner foreign-based financial institutions”.\nShould borrowers default, the foreign lenders must have first used their own standard process to recover the outstanding loan before they can make a claim against EnterpriseSG.\nThe scheme is open for applications that must be approved by a participating financial institution and reach EnterpriseSG by March 31, 2026.", "url": "https://www.straitstimes.com/business/new-scheme-lets-local-companies-borrow-from-foreign-lenders-when-expanding-to-europe"}