{"authors": ["Cheow Sue-Ann"], "date_download": "2024-10-12 14:10:54", "date_modify": "2024-10-12 14:10:54", "date_publish": "2023-10-09 05:00:00", "description": "These breaks can last months and could be to combat burnout or switch careers, for instance. Read more at straitstimes.com.", "filename": "business_more-young-pmets-taking-long-breaks-from-work-to-recharge-experts_1728742254.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/09/IMG3595.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_more-young-pmets-taking-long-breaks-from-work-to-recharge-experts_1728742254.html", "title": "More young PMETs taking long breaks from work to recharge: Experts", "title_page": "More young PMETs taking long breaks from work to recharge: Experts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Overwhelmed with stress, a 35-year-old media professional struggled to sleep, lost his appetite and frequently had nightmares about work.\nHe was sometimes so overcome with anxiety that he was unable to even enjoy the company of family and friends.\nThe cause was clear: His work environment was becoming increasingly hostile, and he was having a hard time getting along with his employers.\nAfraid of the consequences staying put could have on his physical and mental health, he decided in August to leave the firm without a new job in hand, looking to take a break for a few months and take the chance to explore other career options.\n“Just a month before I tendered my resignation, quitting without a new job was never an option. It was just too risky and not the kind of work ethic I was raised to have,” said the man, who had worked at the firm for more than two years, and asked not to be named as he has yet to find a new job.\nHe said: “Of course, I’m worried about how the future will look, but I know I am very privileged to be able to take this option, and right now, I’m feeling optimistic.”\nSeveral experts told The Straits Times that more young people are taking extended breaks from work, though the trend does not appear to be showing up in official figures yet. These breaks can last months, or even a year, and are often to combat burnout or seek a career change, among other reasons.\nMr John Shepherd Lim, chief well-being officer of the Singapore Counselling Centre (SCC), said the organisation has noticed a rising trend in recent years among people aged 20 to 30 who are contemplating leaving, or have left, their jobs to take an extended break. He was unable to disclose specific data.\nDr Xu Le, a lecturer in the department of strategy and policy at the National University of Singapore Business School, added that this trend is present not just in Singapore, but also in other countries such as the United States as young people seek better work-life balance and other career growth opportunities.\n“Young people see the advantages of achieving a more balanced life as including a healthier body, a happier life and a certain level of freedom,” she said.\nShe cited the wider variety of career options available as another possible reason that people are more willing to take a break from their jobs.\n“Young professionals have more options now as new industries or new business opportunities emerge fast with the fast development of technology. For example, the platform economy and streaming broadcasting have developed very fast in the past several years,” she said.\nMr Danny Tan, consultant for commerce contract at recruitment firm Robert Walters Singapore, agreed that there is a growing number of young professionals here taking sabbaticals, though the size of the group might not be significant enough to make an impact on the labour market yet.\nA Ministry of Manpower spokesperson said that the share of younger professionals, managers, executives and technicians (PMETs) who are taking breaks between jobs has been stable at about 20 per cent each year between 2018 and 2022.\nThis group of Singapore residents in their early 30s were outside the labour force, had held PMET jobs previously and indicated in the ministry’s national survey that they were taking breaks, such as not seeking work for a short period of time to pursue personal interests and hobbies.\nWhile experts agree that there are clear benefits to taking a break in between jobs, there are also possible downsides.\nMr Tan from Robert Walters said a significant gap in one’s work history can raise questions for potential employers. Depending on the length of the hiatus and the nature of the industry, candidates’ skills may decline or their knowledge may be outdated, and they could face difficulties in negotiating salary and benefits if their previous earning potential does not align with their current market value.\nSome recruiters and employers may see an extended break as a positive sign of self-awareness and commitment to well-being, while others may have concerns about a candidate’s dedication and skill relevancy, said Mr Tan.\nCandidates can try to mitigate possible negative perceptions by keeping up with industry trends during their break, he said.\nIn interviewing for new jobs, they should address the employment gap honestly, and can also emphasise skills and experiences gained during the break that are transferable to the desired role.\nOne way to make the transition back to the workforce easier is to take up a contract role after a sabbatical, added Mr Tan.\nGoing on a long break might also weigh on a young person’s finances.\nSCC’s Mr Lim said that while some young professionals may be financially comfortable and able to take a break, that is not necessarily the case for all.\nStill, he said that in the face of the rising cost of living, those who decide to take career breaks either have ascertained that the benefits of taking a break far outweigh the forgone salary, or have the option of exploring other sources of income.", "url": "https://www.straitstimes.com/business/more-young-pmets-taking-long-breaks-from-work-to-recharge-experts"}