{"authors": [], "date_download": "2024-10-12 14:11:18", "date_modify": "2024-10-12 14:11:18", "date_publish": "2023-12-01 03:48:41", "description": "The US Treasury Secretary told reporters “inflation has now come way down”. Read more at straitstimes.com.", "filename": "business_economy_yellen-says-us-economy-does-not-need-drastic-tightening-soft-landing-on-track_1728742278.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/01/US-JUSTICE-CRYPTOCURRENCY-ENFORCEMENT-205446.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_yellen-says-us-economy-does-not-need-drastic-tightening-soft-landing-on-track_1728742278.html", "title": "Yellen says US economy does not need drastic tightening, ‘soft landing’ on track", "title_page": "Yellen says US economy does not need drastic tightening, ‘soft landing’ on track | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BESSEMER CITY, North Carolina – US Treasury Secretary Janet Yellen said on Nov 30 she believes the US economy does not need further drastic monetary policy tightening to stamp out inflationary expectations, and is on track to achieve a “soft landing” with strong employment.\nDr Yellen told reporters after a speech at a lithium processing plant in North Carolina that in the past, the United States Federal Reserve sometimes had to tighten monetary policy so much to prevent inflation from becoming ingrained in the economy that it caused recessions.\n“We don’t need that now,” Dr Yellen said.\n“I believe the signs are very good that we will achieve this soft landing, with unemployment stabilising more or less we’re where it is in this general vicinity, and growth slowing to a sustainable level. I think that is what we’re in the middle of.”\nShe said that “inflation has now come way down”, with high prices for some goods, such as eggs, returning to pre-pandemic levels.\n“And now wage gains are really translating into more real income. So my hope is that Americans gradually will see that things are getting better,” Dr Yellen said. REUTERS", "url": "https://www.straitstimes.com/business/economy/yellen-says-us-economy-does-not-need-drastic-tightening-soft-landing-on-track"}