{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 13:33:32", "date_modify": "2024-10-12 13:33:32", "date_publish": "2024-05-30 15:00:00", "description": "Customers can expect enhanced protection across all financial institutions and all the products they offer Read more at straitstimes.com.", "filename": "business_banking_all-hands-on-deck-at-financial-institutions-expected-under-updated-guidelines-to-treat-users-fairly_1728740012.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/30/btmas20240530.JPG?VersionId=A_T4PMWr0.JQCg3oh_Qrp2E.esnXEsa4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking_all-hands-on-deck-at-financial-institutions-expected-under-updated-guidelines-to-treat-users-fairly_1728740012.html", "title": "Updated guidelines to protect S’poreans in dealings with financial institutions: What to expect", "title_page": "Updated guidelines to protect S’poreans in dealings with financial institutions: What to expect | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Customers who head to financial institutions (FIs) to place a fixed deposit will not have to face being peddled investment products by staff there, one of the outcomes expected under an updated set of guidelines aimed at enhancing protection for Singaporeans in their dealings with FIs.\nThe Monetary Authority of Singapore (MAS) said the Guidelines on Fair Dealing aim to raise standards of fair dealing and improve customer experience at FIs, such as banks and wealth managers.\nCustomers can expect financial products that are suited to their needs, advice with suitable recommendations, accurate representation of information and extra consideration for those who are more vulnerable, including customers with physical disabilities or impaired mental capacities, MAS said in a statement.\nIn addition, FIs are expected to explain clearly their products and terms and conditions, while responding to customer feedback.\nIntroduced in 2009 under the Financial Advisers Act, the guidelines covered the selection, marketing and distribution of investment products, as well as the provision of advice and post-sales services for these products.\nMAS said most FIs have adhered to the core objectives of fair dealing and focus on customer outcomes.\nMs Ho Hern Shin, MAS deputy managing director for financial supervision, said this update to the fair dealing guidelines reflects the central bank’s expectation for all FIs to treat all customers fairly.\n“This must be a foundational value championed by boards and senior management. Fair dealing should be demonstrated across all activities that impact the customer, from product design to post-sales service. We look forward to financial institutions implementing these guidelines robustly,” she said.\nExplaining the rationale of the guidelines, MAS said the way FIs manufacture, select, market and distribute financial products and services affects their customers’ financial decisions.\n“Financial institutions should therefore ensure that their business functions are cognisant of the influence on customers’ decisions, and have a strong emphasis on fair dealing in their corporate culture.”\nFIs should duly consider the needs and interests of customers, and act accordingly throughout every aspect of their business to achieve this, from product design and governance, to marketing and sales, and in the provision of after-sales services and complaints handling, it noted.\nMeanwhile, the board and senior management of FIs should set the culture for their FIs, determine risk appetites and put in place governance structures, policies and processes, the central bank said.\nMAS expects FIs to ensure customers feel they are dealing with institutions where fair dealing is central to the corporate culture, and they are being offered products and services that are suitable for them.\nIt also expects FIs to ensure their customers are served by competent representatives, they receive clear, relevant and timely information that accurately represents the products and services offered and delivered, and that customer complaints are handled in an independent, effective and prompt manner.\nSingapore banks welcomed the updated guidelines.\nMs Jacquelyn Tan, who heads UOB’s personal financial services group, said the bank will continue to safeguard the needs and interests of its customers.\n“UOB prioritises the customer’s understanding of the risks associated with any investment over any potential returns. The guidelines align with our consistent objective of ensuring that financial products and services offered to customers are suitable for their unique needs and profiles, taking into account their background, risk appetites and other factors,” she told The Straits Times.\nMs Loretta Yuen, head of legal and compliance at OCBC, said fair dealing has always been a core part of the bank’s culture.\n“We therefore welcome the updated guidelines... as it formalises what we believe in and what we have already been putting into practice – acting with integrity, transparency and doing what is right for all customers,” she said.\n“This includes providing clear, relevant and timely information so that they can make informed decisions, recommending products that are aligned with their objectives and risk profiles, and deepening our employees’ knowledge so they can give the most appropriate advice.”\nMr Lam Chee Kin, group head of legal and compliance at DBS Bank, said the bank stands behind the updated guidelines.\n“Today, fair dealing is already the foundation of our business and is embedded in everything we do. This includes communicating with our customers in a clear and transparent manner, understanding our customers’ risk profile, and ensuring the suitability of products and services,” he said.", "url": "https://www.straitstimes.com/business/banking/all-hands-on-deck-at-financial-institutions-expected-under-updated-guidelines-to-treat-users-fairly"}