{"authors": ["Sue-Ann Tan"], "date_download": "2024-10-12 13:31:49", "date_modify": "2024-10-12 13:31:49", "date_publish": "2023-11-17 17:11:36", "description": "There have been 153 IPOs so far in 2023 in the six key stock exchanges in South-East Asia. Read more at straitstimes.com.", "filename": "business_sea-ipos-raised-lowest-amount-in-8-years-despite-healthy-number-of-listings-deloitte_1728739909.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/17/aibiz171123.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_sea-ipos-raised-lowest-amount-in-8-years-despite-healthy-number-of-listings-deloitte_1728739909.html", "title": "S-E Asian IPOs raised lowest amount in 8 years despite healthy number of listings in 2023: Deloitte", "title_page": "S-E Asian IPOs raised lowest amount in 8 years despite healthy number of listings in 2023: Deloitte | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A healthy number of companies were listed across the region in 2023, but the total amount raised is the lowest in eight years.\nThere have been 153 initial public offerings (IPOs) so far in 2023 on the region’s key stock exchanges – Singapore, Indonesia, Thailand, Malaysia, Vietnam and the Philippines – down from a total of 163 in 2022. No more listings are scheduled for 2023. The IPOs raised around US$5.5 billion (S$7.4 billion), well below the US$7.6 billion collected in 2022, noted a study by accounting giant Deloitte.\nIts analysis showed that Indonesia was the strongest regional performer, with 77 IPOs raising US$3.6 billion (S$4.8 billion). This accounted for half of the region’s listings and 66 per cent of the total amount raised across the six bourses. It makes Indonesia the fourth-strongest stock exchange globally so far in 2023, behind only China, the United States and the United Arab Emirates.\nThe 2023 listings have seen a trend of firms affiliated with the electric vehicle market, including those in the mining and associated ancillary sectors, and renewable energy firms.\nDeloitte noted: “As countries strive to meet their climate objectives and establish carbon-neutral economies, electric vehicle firms and renewable energy companies... alongside those providing environmental solutions, are being embraced.”\nThe consumer industry remained among the top three sectors, as in the preceding two years, with a growing young middle class in the region armed with higher spending power.\nDeloitte said: “South-east Asian companies are thriving and have the ability to go beyond their shores for cross-border IPOs.\n“This is driven by expectations of favourable valuations, enhanced liquidity, industry comparability and investor familiarity with certain sectors.”\nIt added that exchanges across the world are implementing various initiatives in a bid to attract some of the region’s high-growth businesses.\nMs Tay Hwee Ling, Deloitte South-east Asia and Singapore disruptive events advisory leader, said the challenge of sustaining a vibrant and attractive cash equities market is not unique to the region.\n“Globally, the number of IPOs and IPO proceeds raised have normalised to pre-Covid-19 levels. This is driven by companies staying private for longer, and more recently against the backdrop of a challenging global macroeconomic and interest rate environment,” she said.\nThere have been five IPOs on Singapore’s Catalist board so far in 2023, raising US$29 million.\nDeloitte noted that Singapore typically has some sizeable mainboard IPOs, including real estate investment trusts (Reits) and special purpose acquisition companies, to bolster its overall performance, but these have not materialised in 2023.\nMs Tay said there has been a hiatus of Reit and business trust listings on the Singapore Exchange since 2021, against the backdrop of high interest rates. “The high Fed rates also encourage investors to take advantage of high rates of return, resulting in capital flight to the United States. As a result, there has been a steady stream of Singapore companies successfully listing in the US in recent years,” she said.\nBut Ms Tay added that Singapore companies also have various fund-raising opportunities here, and are able to hold off tapping equity capital markets until the right window opens for an IPO.\nDeloitte Singapore disruptive events advisory deputy leader Darren Ng also noted: “While the Singapore IPO market may appear subdued this year, it is important to note the wealth of high-calibre Singaporean companies ready to explore cross-border listings on global exchanges.\n“They are also enjoying international recognition for their robust business fundamentals.”\nIndeed, there has been a trend of South-east Asian firms looking to list on large overseas markets instead in the hopes that those bourses can enable their business growth or expansion in that region, Ms Tay said.\n“It is a positive sign that South-east Asian companies are getting attention from other exchanges,” she added. Countries in the region are tipped to enjoy positive economic growth in 2024, she noted. “In addition, there are signs that inflation rates have levelled out and talks about rate cuts are on the horizon... With the right valuation and timing, there remains a sea of opportunities for the IPO capital market in 2024.”", "url": "https://www.straitstimes.com/business/sea-ipos-raised-lowest-amount-in-8-years-despite-healthy-number-of-listings-deloitte"}