{"authors": [], "date_download": "2024-10-12 14:15:37", "date_modify": "2024-10-12 14:15:37", "date_publish": "2024-03-31 13:45:00", "description": "Recent indicators suggest the world’s second-largest economy is slowly getting back on better footing. Read more at straitstimes.com.", "filename": "business_china-s-march-factory-activity-expands-for-first-time-in-six-months_1728742537.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/31/CHINA-ECONOMY-084116.jpg?VersionId=K73.X5Vsfal8n9.SiicJATDCDCmqzeCZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-march-factory-activity-expands-for-first-time-in-six-months_1728742537.html", "title": "China’s March factory activity expands for first time in six months", "title_page": "China’s March factory activity expands for first time in six months | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHENZHEN - China’s manufacturing activity expanded for the first time in six months in March, an official factory survey showed on March 31, offering relief to policymakers even as a crisis in the property sector remains a drag on the economy and confidence.\nThe official purchasing managers’ index (PMI) rose to 50.8 in March from 49.1 in February, above the 50 mark separating growth from contraction and topping a median forecast of 49.9 in a Reuters poll.\nThough the pace of growth was modest, it was also the highest PMI reading since March 2023, when momentum from the lifting of tough Covid-19 restrictions began to stall.\n“From the indicators, domestic supply and demand has improved, while home owner and business confidence is recovering, while willingness to consume and invest are increasing,” said analyst Zhou Maohua from China Everbright Bank.\nNew export orders rose into positive territory, breaking an 11-month slump, but employment continued to shrink, albeit at a slower rate, the PMI data showed.\nRecent upbeat indicators suggest the world’s second-largest economy is slowly getting back on better footing, leading analysts to start upgrading their growth forecasts for 2024.\nPolicymakers have wrestled with persistent economic sluggishness since the abandonment of Covid-19 curbs in late 2022, amid a deepening housing crisis, mounting local government debts and weakening global demand.\n“March data show the economy is poised for a strong end to Q1,” China Beige Book, an advisory firm, said in a note last week. “Hiring recorded its longest stretch of improvement since late 2020. Manufacturing picked up, as did retail.”\nHowever, a deep property slump remains a major drag on growth, testing the health of heavily indebted local governments and state-owned banks’ balance sheets.\nThe official non-manufacturing PMI, which includes services and construction, rose to 53 from 51.4 in February, marking the highest reading since September.\nPremier Li Qiang announced an ambitious 2024 economic growth target of around 5 per cent earlier in March at the annual meeting of the National People’s Congress, China’s rubber-stamp Parliament.\nBut analysts say policymakers will need to roll out more stimulus to hit that target as they will not be able to count on the low statistical base of 2022 which flattered 2023 growth data.\nCiti on March 28 raised its economic growth forecast for China for 2024 to 5 per cent from 4.6 per cent, citing “recent positive data and policy delivery”.\nChina’s Cabinet on March 1 approved a plan aimed at promoting large-scale equipment upgrades and sales of consumer goods. The head of the country’s state planner told a news conference earlier in March that the plan could generate market demand of more than 5 trillion yuan (S$949 billion) annually.\nMany analysts worry that China may begin flirting with Japan-style stagnation later this decade unless policymakers take steps to reorient the economy towards household consumption and market allocation of resources, and away from the heavy reliance on infrastructure investments seen in the past. REUTERS", "url": "https://www.straitstimes.com/business/china-s-march-factory-activity-expands-for-first-time-in-six-months"}