{"authors": ["Claire Huang"], "date_download": "2024-10-12 14:16:16", "date_modify": "2024-10-12 14:16:16", "date_publish": "2024-05-03 13:07:07", "description": "Month on month and seasonally adjusted, retail sales dipped 1 per cent. Read more at straitstimes.com.", "filename": "business_singapore-retail-sales-up-27-in-march-on-higher-food-and-alcohol-spending_1728742576.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/03/2023021921995382b0445e07-f26e-4f56-b9c9-fcc50df034db.jpg?VersionId=h0wJJsWDzM7mpjIAB6m7PJahld_hRizy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-retail-sales-up-27-in-march-on-higher-food-and-alcohol-spending_1728742576.html", "title": "S’pore retail sales up 2.7% in March, fuelled by higher F&B spending, Taylor Swift concerts", "title_page": "S’pore retail sales up 2.7% in March, fuelled by higher F&B spending, Taylor Swift concerts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Retail sales in Singapore rose for the third month in a row, lifted by Taylor Swift’s Eras Tour performances in March, but there is concern that the trend could weaken in the coming months.\nTakings at the till increased 2.7 per cent in March from the year-ago period, slowing from a revised 8.6 per cent gain in February, data from the Department of Statistics showed on May 3.\nExcluding motor vehicles, retail sales grew 2 per cent, extending the 9.5 per cent increase in February. Ten of the 14 categories saw a rise in turnover.\nOxford Economics’ economist Sheana Yue said the March data adds to wider evidence that the retail sector rebounded at the start of the year, with sales growing 1.3 per cent quarter on quarter in the first quarter, compared with a 0.3 per cent contraction in the fourth quarter of 2023.\nShe attributed the recovery to the return of tourists from mainland China after a visa-free travel arrangement began in February, and regional tourists who came here to catch concerts.\nHowever, month on month and seasonally adjusted, retail sales dipped 1 per cent from February.\nMs Liu Yun, Asean economist at HSBC, said the 1 per cent dip was a one-off correction from the Chinese New Year holidays in February, when people shopped more for the festivity.\nShe added that the March figures point to broad-based improvements, largely due to the busy line-up for music tourism. “Not only did the food and beverage (F&B) sector continue to expand by double-digit percentage points, so did discretionary goods.”\nThe biggest month-on-month rise was for food and alcohol (15.1 per cent), followed by cosmetics, toiletries and medical goods (8.8 per cent) and sales at department stores (7.7 per cent).\nSales dropped month on month for other industries, with the largest declines coming from big-ticket items such as computer and telecommunications equipment (minus 8.5 per cent) as well as furniture and household equipment (minus 7.9 per cent).\nUOB senior economist Alvin Liew and associate economist Jester Koh said the March data was “slightly underwhelming”, likely due to a dip in Chinese tourist arrivals.\n“In addition, we saw seasonally adjusted month-on-month declines for several components that may reflect the dip in demand after the festive season and could be temporary,” added the UOB economists.\nThe estimated total retail sales value in March came in at $4.2 billion. Of this amount, about 11.7 per cent was from online sales, higher than the 10.8 per cent in February.\nExcluding motor vehicles, total retail takings were about $3.5 billion, of which 13.9 per cent came from online sales.\nLooking ahead, Ms Yue warned that the lift to retail sales will fade over the coming months as the 21 per cent quarter-on-quarter jump in tourist arrivals in the first quarter is unlikely to be repeated.\n“There is smaller scope for a boost now that arrivals are back to roughly 90 per cent of their 2019 levels. What’s more, governments are starting to pare back fiscal support to rebalance their balance sheets, and with the United States Federal Reserve policy rates set to stay higher for longer, we suspect visitors from other countries as well as locals in Singapore will start to tighten their purses,” she added.\nMs Liu thinks the initial signs of an easing in the labour market may dampen private consumption in the months ahead. But she is optimistic that a continued tourism recovery will support growth.\nDBS economist Chua Han Teng is more upbeat, saying that while the one-off boost from the Swift concerts is likely to fade, F&B sales should still be supported by the ongoing recovery in Singapore’s foreign tourist arrivals over the coming months.\nHowever, he said Singapore consumers could stay prudent if wage improvements slow.\nAlready, the Manpower Ministry’s first-quarter forward-looking polls show a decline in the proportion of firms that intend to raise wages in the next three months, Mr Chua noted. He added that the Assurance Package enhancement in Budget 2024 would provide support amid ongoing economic uncertainty.\nSales at food and alcohol retailers recorded the steepest jump, up 17 per cent in March from a year ago. Sales of watches and jewellery rose 14.1 per cent, while motor vehicle sales went up 7 per cent on the back of a higher certificate of entitlement quota.\nConversely, sales of computer and telecommunications equipment dropped 5.1 per cent year on year in March, while takings at minimarts and convenience stores fell 3.7 per cent.", "url": "https://www.straitstimes.com/business/singapore-retail-sales-up-27-in-march-on-higher-food-and-alcohol-spending"}