{"authors": [], "date_download": "2024-10-12 14:10:57", "date_modify": "2024-10-12 14:10:57", "date_publish": "2023-12-14 03:50:51", "description": "Rates are kept high as the Fed continues its fight to slow inflation towards its long-term target of 2%. Read more at straitstimes.com.", "filename": "business_economy_us-fed-holds-rate-steady-signals-three-cuts-ahead_1728742257.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/14/FILES-US-ECONOMY-INFLATION-PCE-143323.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_us-fed-holds-rate-steady-signals-three-cuts-ahead_1728742257.html", "title": "US Fed holds rate steady, signals three cuts ahead in 2024", "title_page": "US Fed holds rate steady, signals three cuts ahead in 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – The United States Federal Reserve voted on Dec 13 to hold interest rates at a 22-year high for the third straight meeting, and signalled that it expects to make three cuts in 2024.\nThe Fed’s decision to keep its key lending rate between 5.25 per cent and 5.5 per cent lets policymakers determine “the extent of any additional policy firming that may be appropriate”, the US central bank said in a statement.\nThe inclusion of the word “any”, which was absent in November’s decision, is likely to further dampen lingering expectations of interest rate hikes ahead – and fuel traders’ hopes of cuts.\nLower interest rates make borrowing cheaper and help to encourage consumer spending, which is good news for company earnings.\nThe widely expected decision keeps interest rates high as the Fed continues its fight to slow inflation towards its long-term target of 2 per cent amid a recent flurry of positive economic news.\nThe Fed, which has a dual mandate to tackle both inflation and unemployment, is the first major central bank to unveil its interest rate decision this week.\nThe European Central Bank and the Bank of England will publish their own rate decisions on Dec 14, and are also expected to hold their key lending rates steady in the face of slowing inflation.\n‘Soft landing’ in sight\nDespite the Fed’s aggressive policy of monetary tightening, the world’s biggest economy grew at an annualised rate of 5.2 per cent in the third quarter of 2023.\nHeadline consumer inflation in the US fell further in November, according to fresh data published on Dec 12, while the unemployment rate has remained close to historic lows.\nThe data suggests that the Fed is on track for a so-called “soft landing”, a rare feat in monetary policy when high interest rates bring down inflation without plunging the country into a damaging recession.\nSpeaking ahead of the decision, US Treasury Secretary Janet Yellen welcomed the Fed’s recent progress against inflation, and said she expects the rate of price increases to fall below 3 per cent in 2024.\n“My baseline is that we’ll achieve a soft landing,” Dr Yellen, a former Fed chairwoman, told CNBC in an interview.\n“Monetary policy is an art and not exactly a science yet, and it requires skill and a good dose of luck to get that exactly right,” she said.\nRate cuts ahead\nAlongside its interest rate decision, the Fed’s rate-setting Federal Open Market Committee (FOMC) also published updated economic forecasts.\nThe FOMC now expects the economy to grow by 2.6 per cent in 2023, up from 2.1 per cent in September, before slowing down to 1.4 per cent in 2024.\nHeadline inflation is expected to slow more than previously expected to 2.8 per cent in 2023, before easing to 2.4 per cent in 2024.\nIn the meantime, the Fed’s favoured measure of inflation, stripping out volatile food and energy costs, is now expected to reach 3.2 per cent in 2023 and 2.4 per cent in 2024, while the unemployment rate remains unchanged from the September forecast.\nMembers of the FOMC also cut the median projection for interest rates at the end of 2024 to the midpoint between 4.5 and 4.75, signalling that they now expect 0.75 percentage point of cuts.\nAt 25 basis points per cut, this would translate to three rate cuts in 2024 – one more than most analysts were predicting going into the meeting.\nBefore the Fed’s decision, financial markets were pricing in around 1.25 percentage points of rate cuts in 2024, starting in March, according to EY chief economist Gregory Daco.\nFed chairman Jerome Powell was due to speak to reporters later on Dec 13, and could provide further clarity on what the Fed expects to unfold in the months ahead. AFP", "url": "https://www.straitstimes.com/business/economy/us-fed-holds-rate-steady-signals-three-cuts-ahead"}