{"authors": ["Prisca Ang"], "date_download": "2024-10-12 13:28:39", "date_modify": "2024-10-12 13:28:39", "date_publish": "2024-09-26 17:35:00", "description": "The total penalties for such actions exceeded $4.9 million. Read more at straitstimes.com.", "filename": "business_over-4700-companies-prosecuted-in-2023-for-failing-to-file-their-tax-returns-or-doing-so-late-iras_1728739719.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/26/btiras20240926.jpg?VersionId=EIyHRVvCP5FS6SfOMbmkTKWg_Lgpz_g5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_over-4700-companies-prosecuted-in-2023-for-failing-to-file-their-tax-returns-or-doing-so-late-iras_1728739719.html", "title": "Over 4,700 companies prosecuted in 2023 for failing to file tax returns or doing so late: Iras", "title_page": "Over 4,700 companies prosecuted in 2023 for failing to file tax returns or doing so late: Iras | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Over 4,700 companies were prosecuted in 2023 for failing to file their tax returns or doing so late, said the Inland Revenue Authority of Singapore (Iras) on Sept 26.\nThis was an increase from 2022, when more than 4,400 companies were prosecuted for these actions, according to Iras data provided to The Straits Times. In 2021, over 5,400 companies were prosecuted for not filing their tax returns or filing them late.\nThe total penalties for such actions exceeded $4.9 million in 2023, said Iras. This was up from more than $1.5 million in 2022 and over $1.7 million in 2021, according to data from the taxman.\nAbout one in 10 companies fail to comply with their corporate income tax filing obligations despite repeated reminders, said the authority.\nSome 262,000 companies are expected to file their corporate income tax returns in 2024.\nIras reminded all companies, including those with no business activities or those making a loss, and their directors to do so for the Year of Assessment 2024 – which covers income earned in the preceding financial year – by Nov 30.\nCompanies that adopt software with seamless filing capabilities will get an automatic extension of their corporate income tax filing due date to Dec 15, said Iras.\n“To avoid any last-minute rush, companies are encouraged to prepare their financial statements, tax computations, and supporting documents well in advance,” said Iras.\n“Preparing and filing tax returns ahead of the deadline not only help companies avoid unnecessary fines but also provide them with ample time to review the documents, reducing the likelihood of mistakes.”\nCompanies that do not file their corporate income tax returns by the due date can be fined up to $5,000.\nDepending on factors such as the company’s past compliance records, Iras may compound the offence instead of taking prosecution actions.\nA company that receives a letter of composition must pay the composition amount and file the overdue tax return, failing which it will be issued a notice to attend court, said Iras.\nErrant companies that fail to file their returns for two years or more may be ordered by the courts to pay a penalty twice the amount of tax assessed, in addition to the fine, added the taxman.\nFor companies that do not file their returns, Iras may issue notices to the company directors to request the business’ financial information. Directors who fail to furnish the information by the stipulated date will be subject to heavier penalties of up to $10,000 or court attendance.\nFailure to attend court may result in a warrant of arrest issued against the company director. In 2023, 1,690 court summons were issued to directors who did not comply with these notices.\nWhen filing their tax returns, companies can tap tools such as Iras’ Basic Corporate Income Tax Calculator, which includes explanatory notes to guide companies in working through their tax computations, as well as validation checks against common errors.\nBusinesses that require assistance with their tax filing can visit the Iras website and watch the authority’s e-learning videos, said Iras. They can also get help from Iras officers over live chat, call the helpline on 1800-356-8622 or contact the authority via myTax Mail if they need further support.\nIf companies discover errors in past years’ corporate income tax returns, they should initiate a voluntary disclosure to Iras to avoid hefty penalties, added the authority.", "url": "https://www.straitstimes.com/business/over-4700-companies-prosecuted-in-2023-for-failing-to-file-their-tax-returns-or-doing-so-late-iras"}