{"authors": [], "date_download": "2024-10-12 14:09:51", "date_modify": "2024-10-12 14:09:51", "date_publish": "2024-02-14 11:37:00", "description": "Bets on the first Fed interest rate cut have been pushed back to July from March. Read more at straitstimes.com.", "filename": "business_us-inflation-data-erases-last-remnant-of-global-rally-as-traders-push-back-bets-on-fed-rate-cuts_1728742191.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/14/2024-01-12T203458Z53911688RC2JG5AUTW9HRTRMADP3USA-FED-INCOME.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_us-inflation-data-erases-last-remnant-of-global-rally-as-traders-push-back-bets-on-fed-rate-cuts_1728742191.html", "title": "US ‘hot’ inflation data sees traders push back bets on Fed rate cuts", "title_page": "US ‘hot’ inflation data sees traders push back bets on Fed rate cuts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - Traders pushed back bets on the first Federal Reserve interest rate cut from March to July after data on Feb 13 showed inflation in the United States was stronger than expected in January.\nThe US consumer price index (CPI) rose by more than forecast across the board in January – on a monthly and annual basis – as did the core measures, which strip out food and energy costs.\nA key subset of services prices advanced by the most in nearly two years, and shelter costs heated up, government data showed on Feb 13.\n“January’s CPI is a game changer – the narrative that Fed disinflation provided scope for insurance cuts is clearly now on the chopping board,” said senior rates strategist Prashant Newnaha at TD Securities in Singapore. “There is now a real risk that price pressures begin to shift higher.”\nThe figures further reduced already-slim chances that Fed officials will start lowering interest rates soon, and any additional re-acceleration risks reigniting talks that they will resume hikes.\nSome policymakers have said they want to see a broader easing of price pressures before cutting rates.\nThe Dow Jones Industrial Average tumbled 525 points or 1.4 per cent, while Treasury yields jumped, as the hot inflation data stoked fears about higher-for-longer rates.\nTraders pushed out bets of when the Fed will start cutting rates and marked down March odds to almost zero.\nEconomists have long contended that the path to 2 per cent inflation – which the Fed targets, based on a separate index – would be arduous, and the CPI release suggests it may be longer and bumpier.\nMany forecasters still maintain that inflation is broadly on a downward trend, and that the January inflation surprise likely will not translate to the Fed’s preferred measure, known as the personal consumption expenditures (PCE) price index.\n“The Fed will view this as another reason to wait until May or June, but the direction of the trend is still lower,” said Charles Schwab chief fixed income strategist Kathy Jones. “With much of the increase due to housing, it’s a waiting game to see when those costs will come down.”\nTraders are now only fully pricing in three Fed rate cuts for 2024, with a fourth reduction seen as a coin toss.\nThat lines up with the US central bank’s own forecast for three easing moves, though it is a far cry from January, when swaps showed the potential for as many as seven downward shifts in the cash rate.\nTreasury 10-year yields were at 4.31 per cent in Asia on Feb 14 after surging 14 basis points in the previous session, while Japan’s 10-year yield climbed as much as four basis points.\nAustralian 10-year bond yields jumped as much as 12 basis points to 4.29 per cent.\nThe release on Feb 16 of the producer price index will provide more clues as to what the Fed may do, as several categories within that report feed directly into the central bank’s PCE price calculation.\nThe PCE figures will be released later in February. BLOOMBERG", "url": "https://www.straitstimes.com/business/us-inflation-data-erases-last-remnant-of-global-rally-as-traders-push-back-bets-on-fed-rate-cuts"}