{"authors": ["Kang Wan Chern"], "date_download": "2024-10-12 13:31:14", "date_modify": "2024-10-12 13:31:14", "date_publish": "2024-09-12 15:40:00", "description": "The Chinese appliance maker is expected to raise as much as $4.57 billion. Read more at straitstimes.com.", "filename": "business_gic-temasek-said-to-be-in-talks-to-invest-in-mideas-hong-kong-ipo_1728739874.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/PX001679.jpg?VersionId=U4QYcJOAmSQV.NzrxSvmAsPiSTpiTSLQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_gic-temasek-said-to-be-in-talks-to-invest-in-mideas-hong-kong-ipo_1728739874.html", "title": "GIC, Temasek said to be in talks to invest in Midea’s Hong Kong IPO", "title_page": "GIC, Temasek said to be in talks to invest in Midea’s Hong Kong IPO | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore’s GIC and Temasek are considering investing in Midea Group’s Hong Kong initial public offering (IPO), according to Bloomberg, citing people familiar with the matter.\nGIC is weighing subscribing for about US$500 million (S$652 million) in the Chinese appliance maker’s offering, the people said, asking not to be identified as the information is not public. They said Singapore’s investment company, Temasek, is also in talks to buy shares.\nAnother investor, alternative asset manager Hillhouse Investment, is in talks to place an order for more than US$1 billion of Midea stock, Bloomberg reported.\nMidea, which is already listed in Shenzhen, China, is offering 492.1 million shares at HK$52 (S$8.70) to HK$54.80 apiece to raise as much as US$3.5 billion in its second listing in Hong Kong, according to its listing document.\nOrder books are multiple times oversubscribed and will close a day earlier than planned, the people told Bloomberg. Talks are ongoing and details such as the size of potential investments have not been finalised.\nWhen contacted by The Straits Times, Temasek said it declined to comment on speculation. GIC also declined to comment.\nMidea’s offering is set to be the largest in Hong Kong in more than three years and takes place amid what could be a resurgence in IPOs ahead of anticipated rate cuts by the US Federal Reserve, analysts said.\nIn Singapore, the stock exchange has listed just two companies so far in 2024 amid lacklustre equities trading on the bourse.\nSuggestions on how to revive equities trading on the Singapore Exchange (SGX) have been forthcoming in recent months, including calls by some to allocate part of GIC’s investments to SGX stocks.\nIn Parliament on July 2, Second Minister for Finance Chee Hong Tat said Singapore will continue to find ways to improve the attractiveness of the country’s equity market, but it will not direct or interfere with GIC’s investment decisions.\nThis is because GIC must make investment decisions that aim to achieve good long-term returns for Singapore and invest in a globally diversified portfolio to preserve the international purchasing power of the reserves, Mr Chee said.\nAt the release of its results for the financial year 2024 on July 9, Temasek International’s head of financial services Connie Chan said reviving trading on the SGX is “not our primary concern”.\nTemasek’s focus is “on delivering long-term, sustainable returns, and then ultimately, where a company decides to list will be up to the company itself”, she added.\nShe said 65 Equity Partners, a Temasek-backed investment firm, will focus on investing in companies that want to list on the SGX.\nOn Aug 2, a review group was set up to look into ways to revive the SGX.", "url": "https://www.straitstimes.com/business/gic-temasek-said-to-be-in-talks-to-invest-in-mideas-hong-kong-ipo"}