{"authors": [], "date_download": "2024-10-12 14:13:34", "date_modify": "2024-10-12 14:13:34", "date_publish": "2023-03-10 14:53:21", "description": "The latest cuts affect fewer than 500 full-time and contract workers in its customer service team in Indonesia, sources said. Read more at straitstimes.com.", "filename": "business_sea-cuts-more-jobs-at-shopee-in-indonesia-days-after-posting-surprise-profit_1728742414.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/10/2022122017913203fafd1ddf-3a05-47b8-865f-df59973f9c66_4.jpg?VersionId=tGPjicD6t1Cy4GWHuukNHGv.ntgX_kmG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_sea-cuts-more-jobs-at-shopee-in-indonesia-days-after-posting-surprise-profit_1728742414.html", "title": "Sea cuts more jobs at Shopee days after posting surprise profit", "title_page": "Sea cuts more jobs at Shopee days after posting surprise profit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Sea Limited is cutting more jobs at e-commerce unit Shopee in Indonesia, days after reporting a surprise first-ever quarterly profit helped by last year’s extensive firings.\nThe latest cuts affect fewer than 500 full-time and contract workers in Shopee’s customer service team in Indonesia, according to a person with direct knowledge of the matter. Those affected were notified on Thursday, the person said.\nA representative for Sea did not immediately respond to a request for comment.\nIn September, Bloomberg reported that Sea cut 3 per cent of employees at the Indonesian unit.\nThe Singapore-based e-commerce, gaming and fintech provider last year cut more than 7,000 jobs, froze salaries and trimmed spending, helping it to swing to a profit in the fourth quarter.\nSea chief corporate officer Wang Yanjun told analysts on Tuesday’s earnings call that the company does not foresee any further major changes with regard to headcount.\nSouth-east Asia’s largest Internet firm racked up its biggest single-day gain in months on Tuesday after reporting the surprise profit – energising investors who are hoping that the company will pull off one of the biggest turnaround efforts the region’s fledgling tech sector has ever witnessed. BLOOMBERG", "url": "https://www.straitstimes.com/business/sea-cuts-more-jobs-at-shopee-in-indonesia-days-after-posting-surprise-profit"}