{"authors": ["Andy Mukherjee"], "date_download": "2024-10-12 13:46:38", "date_modify": "2024-10-12 13:46:38", "date_publish": "2024-02-08 12:45:00", "description": "Under Mr Gupta, DBS has always aspired to be less of a bank and more of a technology powerhouse. Read more at straitstimes.com.", "filename": "business_piyush-gupta-must-act-fast-to-cement-his-legacy-at-dbs_1728740798.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/08/407267524.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_piyush-gupta-must-act-fast-to-cement-his-legacy-at-dbs_1728740798.html", "title": "Piyush Gupta must act fast to cement his legacy at DBS", "title_page": "Piyush Gupta must act fast to cement his legacy at DBS | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - It is rare for a bank boss to take a 30 per cent cut in variable pay – after delivering a chart-topping return on equity of 18 per cent.\nIn doing just that, Mr Piyush Gupta, the chief executive at DBS Group Holdings, has acknowledged the role of small things – like an overheated data centre – in making a bank good, average or bad in the digital age.\nBut the $4 million hit to salary also shows how far Singapore’s largest lender is from realising its CEO’s ambition.\nUnder Mr Gupta, DBS has always aspired to be less of a bank and more of a technology powerhouse. And not just any tech firm, but one that would rank alongside some of the world’s most admired brands.\nAs DBS told McKinsey & Co, the plan was to borrow the initials of Google, Amazon, Netflix, Apple, LinkedIn and Facebook, supply the missing D, and voila: You have Gandalf from The Lord Of The Rings.\nTrouble is, after more than 14 years leading DBS, the wizard of Asian banking is running out of time: Succession is on the horizon. To cement his legacy as the banker who inserted DBS into Gandalf, the CEO has to act fast. In full-year earnings on Feb 7, Mr Gupta promised to eliminate single points of failure for key services during the current quarter. The bank is also close to appointing a chief information officer, he said.\nStalled ATM transactions and other tech disruptions became DBS’ Achilles heel in what was otherwise a much better year than I had anticipated. Trouble in United States regional banking failed to derail the Federal Reserve’s campaign to keep interest rates higher for longer. That helped DBS extract a juicy profit margin on its loans.\nOn its home turf, elevated borrowing costs failed to deter first-time local homebuyers. Mortgage demand in Singapore has been trending lower since end-2021, but it has not fallen off a cliff.\nYet, before the results, DBS shares were down nearly 12 per cent in one year, the worst among the Asian financial centre’s three home-grown banks. The stock closed up 2.5 per cent on Feb 7.\nIt was not big credit mishaps or spectacular interest rate miscalculations that hobbled performance, but everyday operational snafus. In the end, 2023 will be remembered as the year in which DBS annoyed its customers and regulator, and suffered business and reputational damage that was not expected from what Euromoney magazine named the world’s best digital bank in 2016.\nThe infirmities should have been addressed right after digital services failed for two days in 2021. Now DBS is playing catch-up in a somewhat less favourable environment. All lenders with exposure to China are anxious about the country’s deteriorating economy and its repercussions for the rest of the world.\nThough Mr Gupta is still projecting a strong return on equity of 15 per cent to 17 per cent in 2024, there would be a trade-off between profitability and growth. Net interest margin is expected to slow slightly from 2.1 per cent in the December quarter, but loan growth may hum along, aided by the lender’s acquisition of Citigroup’s consumer business in Taiwan.\nCredit quality remains stable, meanwhile. With the non-performing loan ratio currently at 1.1 per cent, there is plenty of cushion to make provisions for losses without having to slow investment in technology, which must be Mr Gupta’s top priority for the year.\nIt is unfortunate that when the tech world – titans and start-ups alike – is all excited over generative artificial intelligence, DBS should be stuck with a version of what American psychologist Frederick Herzberg described as a “hygiene factor”: A bank app that works 24x7 will not motivate customers to use it more often; but one glitchy experience can leave them miserable.\nForget ranking alongside the world’s iconic tech brands; the challenge right now is to get the basics right. When Gandalf the Grey could not complete his task on Middle-earth, the novelist J.R.R. Tolkien gave the sorcerer a second chance.\nIn some ways, 2024 may be the 64-year-old Gupta’s year as Gandalf the White. Under his leadership, DBS has got the big calls mostly right. If the bank does not make more headlines for its service snags than its return on equity – three percentage points higher in 2023 than in the previous year – investors will be forgiving. It is time to sweat the small stuff. BLOOMBERG", "url": "https://www.straitstimes.com/business/piyush-gupta-must-act-fast-to-cement-his-legacy-at-dbs"}