{"authors": [], "date_download": "2024-10-12 14:12:27", "date_modify": "2024-10-12 14:12:27", "date_publish": "2023-10-24 09:02:46", "description": "The debt is aimed at spurring infrastructure spending and encouraging economic growth. Read more at straitstimes.com.", "filename": "business_china-set-to-approve-190-billion-in-extra-sovereign-debt-on-tuesday-sources_1728742347.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/24/IMG2022-06-16T092232Z9111ADVRV.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-set-to-approve-190-billion-in-extra-sovereign-debt-on-tuesday-sources_1728742347.html", "title": "China to issue $191 billion sovereign debt to support economy", "title_page": "China to issue $191 billion sovereign debt to support economy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China’s top Parliament body has approved a one trillion yuan (S$191 billion) sovereign bond issue and passed a Bill to allow local governments to front load part of their 2024 bond quotas, state media said on Tuesday, in a move to support the economy.\nFunds raised from the new sovereign bonds will support the rebuilding of disaster-hit areas in the country and improve urban drainage prevention infrastructure to boost China’s ability to withstand natural disasters, state news agency Xinhua said.\nThat will widen the country’s 2023 budget deficit to around 3.8 per cent of gross domestic product from a previously set 3 per cent, Xinhua said.\nReuters reported on Monday that China’s Parliament was set to approve just over one trillion yuan in additional sovereign debt issuance, citing sources.\nThe approval of the Bill by the Standing Committee of the National People’s Congress came as it concluded a five-day meeting.\n“The additional fiscal support approved today is the intervention we had been expecting and that was needed to prevent an abrupt fiscal tightening in China in the closing weeks of the year,” said Mr Mark Williams, chief Asia economist at Capital Economics.\n“Fiscal policy has been a prop to growth in China over the last few quarters. These new steps will keep it supportive but not deliver any additional boost.”\nThe world’s second-largest economy grew faster than expected in the third quarter, improving the chances that Beijing can meet its growth target of around 5 per cent for 2023. But economists say persistent drag from the property sector still weighs on the economic outlook.\n“It is rare for the central governments fiscal plans to be revised outside the usual budget cycle, so this move signals clear concern about near-term growth,” Mr Williams said.\nChina has previously let local governments issue bonds ahead of the annual session of Parliament, which approves government budget plans and is usually held in March.\nLocal governments had been told to complete the issuance of the 2023 quota of 3.8 trillion yuan in special local bonds by September to fund infrastructure projects. The government has not disclosed the size of local governments’ 2024 front-loaded bond quotas. REUTERS", "url": "https://www.straitstimes.com/business/china-set-to-approve-190-billion-in-extra-sovereign-debt-on-tuesday-sources"}