{"authors": ["Chong Xin Wei"], "date_download": "2024-10-12 13:30:49", "date_modify": "2024-10-12 13:30:49", "date_publish": "2024-09-24 15:35:00", "description": "The minister for trade and industry will begin his new GIC role on Oct 1. Read more at straitstimes.com.", "filename": "business_dpm-gan-kim-yong-appointed-director-of-gic-board_1728739849.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/gnakim.png?VersionId=vq9Uw8Zob5kVo3c_Zkk5bmTIedErbiBE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_dpm-gan-kim-yong-appointed-director-of-gic-board_1728739849.html", "title": "DPM Gan Kim Yong appointed director of GIC board", "title_page": "DPM Gan Kim Yong appointed director of GIC board | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Deputy Prime Minister Gan Kim Yong has been appointed director of the GIC board and will begin his role on Oct 1, said the sovereign wealth fund on Sept 24.\nDPM Gan, who is also Singapore’s Minister for Trade and Industry, is chairman of the Monetary Authority of Singapore and is responsible for the strategy group in the Prime Minister’s Office.\nGIC chief executive Lim Chow Kiat said that DPM Gan’s “wide-ranging experience will add valuable insights to important asset allocation and other strategic decisions”.\nDPM Gan, 65, graduated from Cambridge University with bachelor’s and master’s degrees in engineering. He began his career in the Singapore Civil Service at the Ministry of Trade and Industry and the Ministry of Home Affairs.\nIn 1989, he left the civil service for the private sector and joined NatSteel, which produces reinforcement steel products and solutions for the construction industry. He became the company’s chief executive and president in 2005.", "url": "https://www.straitstimes.com/business/dpm-gan-kim-yong-appointed-director-of-gic-board"}