{"authors": [], "date_download": "2024-10-12 14:06:42", "date_modify": "2024-10-12 14:06:42", "date_publish": "2024-08-05 22:23:00", "description": "About 15 minutes into trading, the Dow Jones Industrial Average was down 2.7 per cent at 38,660.45. Read more at straitstimes.com.", "filename": "business_economy_us-stocks-open-sharply-lower-extending-global-rout_1728742002.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/05/US-DOW-JONES-INDUSTRIAL-AVERAGE-CLOSES-DOWN-500-POINTS-213122.jpg?VersionId=lRvGSdUgUClLXhfXiXDmE6O35.n.C.A8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_us-stocks-open-sharply-lower-extending-global-rout_1728742002.html", "title": "US stocks open sharply lower, extending global rout", "title_page": "US stocks open sharply lower, extending global rout | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Wall Street stocks dived in early trading on Aug 5, extending a sell-off after last week’s poor July US employment report raised recession worries.\nAbout 15 minutes into trading, the Dow Jones Industrial Average was down 2.7 per cent at 38,660.45, a drop of more than 1,000 points.\nThe broad-based S&P 500 fell 3.3 per cent to 5,170.41, while the tech-rich Nasdaq Composite Index slumped 4.2 per cent to 16,069.97.\nOn Aug 2, the Department of Labour reported that the US economy added 114,000 jobs in July, fewer than expected, while the jobless rate rose to 4.3 per cent.\n“The deep-rooted weakness in July’s labour market data signals that the Fed has waited too long to ease,” said Pantheon Macroeconomics, noting that the weak data came two days after the United States central bank’s decision to keep interest rates unchanged.\nAll 30 stocks in the Dow were in the red, while tech giants Alphabet, Netflix and Meta were down between 2.5 per cent and 4 per cent.\nSome market watchers think stocks could be in for more bumpiness in August, but that such volatility does not portend a recession.\nCFRA Research “continues to foresee a soft landing, rather than a new recession”, said a note from chief investment strategist Sam Stovall that pointed out that August is historically a weak period for stocks.\nOther factors behind the volatility include anticipation of a possible Iranian retaliation against following high-profile killings of Hamas and Hezbollah officials.\nAnalysts have also pointed to ripple effects from Japan’s shifting monetary policy that led to a more than 12 per cent drop in the Nikkei on Aug 5.\nSome market watchers have said US equities could be vulnerable to selling pressure from investors seeking to raise funds to repay debt priced in yen. AFP", "url": "https://www.straitstimes.com/business/economy/us-stocks-open-sharply-lower-extending-global-rout"}