{"authors": ["Benjamin Cher"], "date_download": "2024-10-12 13:28:40", "date_modify": "2024-10-12 13:28:40", "date_publish": "2024-09-27 19:02:32", "description": "Across the broader market, advancers outnumbered decliners 404 to 244. Read more at straitstimes.com.", "filename": "business_companies-markets_broader-market-continues-rally-while-sti-closes-down-03_1728739720.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/27/IMG4156.JPG?VersionId=2HRBJBDlPvOfBg2eTUD1gbIVrJCftdTo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_broader-market-continues-rally-while-sti-closes-down-03_1728739720.html", "title": "Broader market continues rally while STI closes down 0.3%", "title_page": "Broader market continues rally while STI closes down 0.3% | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The week ended on a downbeat note on Sept 27 with local shares sliding on what was a mixed session for regional markets, but a buoyant one for Wall Street.\nThe hit was a minor one here, with the Straits Times Index (STI) closing down 0.3 per cent or 8.87 points at 3,573.36, although gainers thumped losers 404 to 244 on robust trade of 1.6 billion shares worth $1.9 billion.\nDFI Retail Group continued to rally, surging 9.5 per cent to US$2.18 and ending the day as the STI’s top gainer.\nThe local lenders ceded their gains from earlier this week, with DBS Bank the index’s second-biggest loser, falling 1.8 per cent to $37.60.\nOCBC Bank lost 0.8 per cent to $15.11 and UOB was down 0.4 per cent at $32.22.\nYangzijiang Shipbuilding was the STI’s biggest loser, sliding 6.3 per cent to close at $2.51.\nMajor regional indexes were running hot and cold: South Korea’s Kospi lost 0.8 per cent, Malaysian shares fell 0.7 per cent and Australian stocks were flat.\nBut Hong Kong’s Hang Seng continued to rally, gaining 3.6 per cent.\nThe new Chinese stimulus package has swung sentiment from despondency to delirium in Chinese markets, noted Mizuho Securities head of macro research Vishnu Varathan. A rekindled risk appetite now has investors devouring all things China, from equities to currency.\n“While still short on the granular details, this is as close as Beijing gets to guns blazing,” he said.\nHe added that this bullish tide has spilled over into global equities and risk sentiment elsewhere, resulting in Wall Street’s three key indexes all heading north overnight.\nThe Dow Jones Industrial Average added 0.6 per cent, the tech-heavy Nasdaq advanced 0.6 per cent and the S&P 500 inched up 0.4 per cent.", "url": "https://www.straitstimes.com/business/companies-markets/broader-market-continues-rally-while-sti-closes-down-03"}