{"authors": [], "date_download": "2024-10-12 14:15:58", "date_modify": "2024-10-12 14:15:58", "date_publish": "2024-02-01 14:10:00", "description": "The HSBC final India Manufacturing PMI rose to 56.5 in January from December’s 18-month low of 54.9 Read more at straitstimes.com.", "filename": "business_economy_indias-factory-growth-hits-four-month-high-in-january-on-robust-demand_1728742558.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/01/407024218.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_indias-factory-growth-hits-four-month-high-in-january-on-robust-demand_1728742558.html", "title": "India’s factory growth hits four-month high in January on robust demand", "title_page": "India’s factory growth hits four-month high in January on robust demand | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BENGALURU - India’s manufacturing industry improved substantially at the start of 2024, with factory activity expanding at its fastest pace in four months in January on robust demand and an upbeat year-ahead outlook, a private survey showed on Feb 1.\nThe HSBC final India Manufacturing Purchasing Managers’ Index (PMI), compiled by S&P Global, rose to 56.5 in January from December’s 18-month low of 54.9.\nAlthough the final reading was lower than a preliminary estimate of 56.9, it was comfortably above the 50 mark that separates expansion from contraction. It has been above breakeven since June 2021.\nIndia will remain the fastest-growing major economy in 2024 and 2025, bolstered by heavy government spending, according to a recent Reuters poll.\nHowever, the government will target narrowing the fiscal deficit as a percentage of gross domestic product, another Reuters poll showed.\nThe budget for the fiscal year 2024/25, due to be announced on Feb 1, is expected to strike a balance between populist measures and fiscal prudence.\nThe PMI’s new orders sub-index, also supported by international demand, rose sharply to its highest since September 2023, stretching the current sequence of expansion to over 2½ years.\n“India’s final manufacturing PMI showed that manufacturing activity accelerated in January. Current output expanded on robust demand, with domestic orders growing at a faster pace than export orders,” said HSBC economist Ines Lam.\nStrong demand and an optimistic year-ahead outlook prompted companies to scale up their buying of raw materials.\nThe future output sub-index strengthened to a 13-month high, while purchasing rose at the fastest pace since September.\nHowever, there was hardly any change in employment levels from December as firms reported sufficient capacity for their current workloads.\nDespite input cost inflation ticking to a three-month high, the rate of increase was marginal.\nPrices charged increased mildly as firms passed on some of the additional cost burden to clients in response to greater rubber, steel, packing materials, transportation and wage costs.", "url": "https://www.straitstimes.com/business/economy/indias-factory-growth-hits-four-month-high-in-january-on-robust-demand"}