{"authors": [], "date_download": "2024-10-12 14:18:59", "date_modify": "2024-10-12 14:18:59", "date_publish": "2024-05-24 08:10:00", "description": "EU’s plan for additional barriers risks painful retaliatory actions by China. Read more at straitstimes.com.", "filename": "business_vw-says-cost-cuts-not-tariffs-will-protect-europe-from-chinese-evs_1728742739.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/24/412012823.jpg?VersionId=9PsZSkBusK7g_D85ArG1Op1b_ynYlv.T", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_vw-says-cost-cuts-not-tariffs-will-protect-europe-from-chinese-evs_1728742739.html", "title": "VW says cost cuts, not tariffs, will help Europe fend off Chinese EVs", "title_page": "VW says cost cuts, not tariffs, will help Europe fend off Chinese EVs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Volkswagen said higher import tariffs for Chinese-made electric vehicles (EVs) in the European Union (EU) will offer only a short respite, with lower costs necessary to stay competitive over the long run.\nThis is because Chinese automakers are set to start making cars in Europe, according to chief financial officer Arno Antlitz, who said the EU’s plan for additional barriers risks painful retaliatory actions.\nOn May 22, China signalled it is ready to unleash tariffs as high as 25 per cent on imported cars with large engines, as trade tensions escalate with the US and EU.\n“We have to use the next two to three years to become even more competitive on the cost side,” Mr Antlitz said in a post on LinkedIn. “It is very questionable whether the current tariff discussion leads into the right direction.”\nCarmakers are again finding themselves in the crosshairs of shifting global trade tectonics, with manufacturers like VW, BMW and Mercedes-Benz Group particularly exposed to retaliatory measures. All three count China as their biggest market – and Mercedes imports all the luxury S-Class and Maybach models it sells in China.\nThe EU is due to inform Chinese exporters of the results of a probe into EV subsidies in early June, and higher tariffs on top of the current 10 per cent levy could take effect a month later.\nTrade tensions between the EU and China have soared since the EV probe was announced in 2023, and President Xi Jinping’s visit to Europe this month seemingly did little to relieve the strain.\nEVs made by Chinese brands like MG Motors and BYD in 2023 accounted for just under 9 per cent of battery-only vehicle sales, according to Dataforce, though this is set to rise to about a fifth by 2027, lobby group Transport & Environment said in March.\nBYD, which is weighing two plants in Europe, plans to introduce its Seagull hatchback in the region next year at a price below 20,000 euros (S$29,233). This will undercut VW, Stellantis and Renault offerings while the industry is already battling slowing EV uptake.\n“The next few years present a significant opportunity to advance our cost competitiveness,” said Mr Antlitz. This will “improve the affordability of our EVs while securing the margins we need to finance the transformation ahead”. BLOOMBERG", "url": "https://www.straitstimes.com/business/vw-says-cost-cuts-not-tariffs-will-protect-europe-from-chinese-evs"}