{"authors": [], "date_download": "2024-10-12 13:28:29", "date_modify": "2024-10-12 13:28:29", "date_publish": "2024-10-04 19:04:47", "description": "The STI climbed 0.3 per cent or 11.7 points to 3,589.13 with gainers outnumbering losers 351 to 225. Read more at straitstimes.com.", "filename": "business_companies-markets_singapore-stocks-end-higher-ahead-of-us-jobs-report-sti-up-03_1728739709.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/04/Azmi-pixgeneric-10.JPG?VersionId=hrPBf.BA21u_KOmOCpKNi6ep97H4B_v0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_singapore-stocks-end-higher-ahead-of-us-jobs-report-sti-up-03_1728739709.html", "title": "Singapore stocks end higher ahead of US jobs report; STI up 0.3%", "title_page": "Singapore stocks end higher ahead of US jobs report; STI up 0.3% | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Local shares defied the gathering investor gloom over a possible escalation of hostilities in the Middle East to inch north on Oct 4 ahead of US jobs data for September.\nThe Straits Times Index (STI) climbed 0.3 per cent or 11.7 points to 3,589.13 with gainers outnumbering losers 351 to 225 across the broader market on trade of 1.7 billion securities worth $1.5 billion.\nRegional indexes also mostly rose. Hong Kong’s Hang Seng climbed 2.8 per cent, the Kospi in South Korea added 0.3 per cent and Japan’s Nikkei 225 edged up 0.2 per cent.\nMalaysian shares went the other way, falling 0.7 per cent, as did the ASX 200 in Australia, which closed 0.7 per cent lower, led by mining declines.\nDespite these movements, SPI Asset Management managing partner Stephen Innes said that risk-averse traders are “hesitant to make bold moves”.\n“Asian stocks and bonds are stuck to narrow ranges, awaiting the US jobs data (on Oct 4) to light a fire under interest rate expectations,” he said.\nWall Street signalled its caution overnight, with indexes faltering as investors felt caught between fears of a broader conflict in the Middle East and stronger signs that the US economy is going well.\nThe uncertainty left the Dow industrials down 0.4 per cent while the S&P 500 fell 0.17 per cent and the Nasdaq was off 0.04 per cent.\nBack home, offshore and marine player Seatrium led gains on the STI, surging 12.3 per cent to $1.99.\nThis came after the company announced on Oct 3 that chief executive Chris Ong had been granted 2.2 million group shares on May 31 under its performance and restricted share plans.\nMapletree Pan Asia Commercial Trust was the STI laggard, losing 1.3 per cent to $1.51.", "url": "https://www.straitstimes.com/business/companies-markets/singapore-stocks-end-higher-ahead-of-us-jobs-report-sti-up-03"}