{"authors": [], "date_download": "2024-10-12 14:07:32", "date_modify": "2024-10-12 14:07:32", "date_publish": "2023-10-04 09:31:45", "description": "The spike in bond yields raises long-term borrowing costs and could hasten a global economic slowdown. Read more at straitstimes.com.", "filename": "business_asia-stocks-hit-11-month-low-on-soaring-bond-yields-yen-spike-stirs-intervention-talk_1728742052.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/04/JAPAN-ECONOMY-MARKETS-FOREX-STOCKS-035616.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_asia-stocks-hit-11-month-low-on-soaring-bond-yields-yen-spike-stirs-intervention-talk_1728742052.html", "title": "US 30-year bond yield hits highest since 2007, spooking financial markets", "title_page": "US 30-year bond yield hits highest since 2007, spooking financial markets | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON/SINGAPORE – The sell-off in US government bonds extended into a third straight day on Wednesday, with 30-year yields touching 5 per cent for the first time since 2007, sending global financial markets into a tailspin.\nAs conviction grew that US interest rates could rise further from current 22-year highs, 10-year Treasury yields also climbed closer to the key 5 per cent threshold.\nThe spike in bond yields, which has spread across the world, raises long-term borrowing costs and could hasten a global economic slowdown.\nMSCI’s Asia stock benchmark dropped by 1.6 per cent to an 11-month low on Wednesday, on course for a technical correction. Japan’s Nikkei index tumbled 2.3 per cent, while South Korea’s Kospi lost 2.4 per cent, and Hong Kong’s Hang Seng Index dropped 0.8 per cent.\nSingapore’s Straits Times Index closed 1.4 per cent lower.\nEuropean stocks tumbled as much as 0.6 per cent in early trading before clawing back some ground, with indexes in France and Germany both posting losses.\nThe pain was set to spread to Wall Street, where S&P 500 futures traded down 0.5 per cent. On Tuesday, the Dow Jones Industrial Average lost more than 400 points, turning negative for the year.\nThe latest leg of the sell-off was fuelled by Tuesday’s better-than-expected US jobs data, as well as a slew of hawkish comments from Federal Reserve officials.\nMarkets are now pricing a one-in-three chance of a November hike and see a more than 50 per cent likelihood of a move in December.\n“The bond sell-off was triggered after peak rate hopes vanished into thin air for the moment,” said Mr Guillermo Hernandez Sampere, head of trading at asset manager MPPM. “The fear of higher yields in the future has forced investors to sell and – no surprise – the crowd runs towards a small door.”\nTen-year Treasury yields, the benchmark for the global cost of capital, have risen about 30 basis points this week. Bonds globally have followed suit.\nYields on Germany’s benchmark 10-year debt rose above 3 per cent for the first time since 2011. The country’s 30-year yield also climbed to its latest 12-year high.\nEven Japan’s 10-year yield, which is capped by the Bank of Japan (BOJ), rose 4.5 basis points to a decade high despite the BOJ offering to buy US$4.5 billion (S$6.2 billion) worth of bonds on Wednesday.\nThe impact of the bond rout has rippled across asset classes. US crude futures slipped back below US$89 a barrel, and global currencies buckled under the US currency’s renewed strength as the spike in Treasury yields sucked money from all corners into dollars.\nThe US dollar’s march pushed the euro to its lowest in 10 months at US$1.0448 overnight, and the pound to a seven-month trough at US$1.20535.\nTaiwan pledged to step in to moderate currency moves if needed, while the Indonesian authorities said they were buying bonds to steady the rupiah.\nThe Singapore dollar, which had earlier in the day weakened against the US dollar, was at 5.54pm trading 0.1 per cent higher at 1.3716, still about a 10-month low.\nAmid the greenback’s rise, speculation grew of Japanese intervention to stabilise the yen. It was just on the stronger side of 150 per dollar on Wednesday, after an unexpected but short-lived surge in the previous session stoked speculation of intervention.\nThe Japanese currency had breached the 150-per-dollar level on Tuesday before suddenly shooting to 147.3. There was no confirmation from Tokyo on the move.\nA check with Singapore money changers on Wednesday by The Straits Times found that the exchange rate for the local currency was between 107.50 and 107.87 yen, down from Tuesday’s 108.00.\nMoney changers ST spoke to on Wednesday said they have seen more purchases and inquiries for the yen in the last few months.\nA director of VS Money Changer, Mr Tajdeen Vanchilabbai, said this was because the Japanese currency had earlier fallen to its lowest in recent times.\n“We still have some stocks left from yesterday and with the rate having gone down today, it has benefited us as we can now sell it at a higher rate,” the director added.\n“However, as the yen is closely linked to the US dollar, and the latter has gone down for us, we now need to compensate for its fall.”\nFor Amaanath Trading, Mr Mohamed Manaseer said it did not lose anything as it sold the currency at a “reasonable price” but the profit remained low.\n“We’re happy with the intervention,” said the manager. “If we buy to sell tomorrow, we might lose money. But if we buy and sell today, it will be better for us.”\nBank of Singapore currency strategist Sim Moh Siong told ST that the yen is very sensitive to the US interest rates, which have been rising as the market is concerned about a higher-for-longer rates environment.\n“Another driver is that Japan is an energy importer and oil prices have gone up, which contributed to the weakening of the yen,” said Mr Sim, adding that the country may tighten monetary policy in response to higher inflation next year.\nBLOOMBERG, REUTERS", "url": "https://www.straitstimes.com/business/asia-stocks-hit-11-month-low-on-soaring-bond-yields-yen-spike-stirs-intervention-talk"}