{"authors": [], "date_download": "2024-10-12 14:06:41", "date_modify": "2024-10-12 14:06:41", "date_publish": "2024-08-05 07:28:00", "description": "Latest US jobs data showed hiring had slowed markedly in July. Read more at straitstimes.com.", "filename": "business_goldman-economists-lift-limited-us-recession-risk-to-25_1728742001.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/05/US-ECONOMIC-REPORT-SHOWS-JOB-GROWTH-IN-US-SLOWER-THAN-EXPECTED-172845.jpg?VersionId=mnvU4eS7b69ZNUIsQp1.KIvhnS6cU9HG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_goldman-economists-lift-limited-us-recession-risk-to-25_1728742001.html", "title": "Goldman economists lift ‘limited’ US recession risk to 25%", "title_page": "Goldman economists lift ‘limited’ US recession risk to 25% | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Goldman Sachs Group economists increased the probability of a recession in the US in the next year to 25 per cent from 15 per cent, but said there were several reasons not to fear a slump even after unemployment jumped.\n“We continue to see recession risk as limited,” Goldman economists led by Mr Jan Hatzius said on Aug 4.\nThe economy continues to look “fine overall”, there are no major financial imbalances and the Federal Reserve has a lot of room to cut interest rates and can do so quickly if needed, they said.\nLast week ended with US jobs data showing that hiring had slowed markedly in July and unemployment had risen to its highest in almost three years, raising concerns of a slowdown and fears the Fed has waited too long to cut interest rates.\nGoldman’s Fed forecasts are less aggressive than those of JPMorgan Chase and Citigroup. Mr Hatzius’s team expects the central bank will reduce its benchmark by 25 basis points in September, November and December.\nBy contrast, JPMorgan and Citigroup revamped their forecasts to predict policymakers will deliver a half-point cut in September.\nThe Goldman Sachs economists said: “The premise of our forecast is that jobs growth will recover in August and the FOMC (Federal Open Market Committee) will judge 25 basis-point cuts a sufficient response to any downside risks.\n“If we are wrong and the August employment report is as weak as the July report, then a 50 basis-point cut would be likely in September.”\nThe economists added that they are sceptical the US labour market is at risk of deteriorating rapidly, in part because job openings indicate demand remains solid and there has been no obvious shock to spark a downturn. BLOOMBERG", "url": "https://www.straitstimes.com/business/goldman-economists-lift-limited-us-recession-risk-to-25"}