{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 14:14:32", "date_modify": "2024-10-12 14:14:32", "date_publish": "2020-06-16 17:00:00", "description": "SINGAPORE - Singapore has retained its top spot as the world's most competitive economy in the latest edition of the IMD World Competitiveness Ranking. Read more at straitstimes.com.", "filename": "business_economy_singapore-retains-top-spot-as-worlds-most-competitive-economy_1728742472.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/06/16/ym-sgskyline-160620.jpg?VersionId=ykxZtBxdpwRWANyMxu2gAo8HVzIvM3qV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_singapore-retains-top-spot-as-worlds-most-competitive-economy_1728742472.html", "title": "Singapore retains top spot as world's most competitive economy", "title_page": "Singapore retains top spot as world's most competitive economy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore has retained its top spot as the world's most competitive economy in the latest edition of the IMD World Competitiveness Ranking.\nThe Republic held on to the top slot for a second straight year in the annual list of 63 economies, which analyses their ability to generate prosperity.\nMaking up the top five after Singapore were Denmark, Switzerland, the Netherlands and Hong Kong. As a group, they illustrate the strength of many small economies amid the disruption caused by the coronavirus pandemic, the Institute for Management Development (IMD), which is based in Lausanne, Switzerland, said in a statement on Tuesday (June 16).\nHowever, Hong Kong dropped three spots on the list to settle at No. 5 this year. IMD attributed Hong Kong's slide to a relatively deficient performance of its economy, employment and societal framework. The underlying strengths of the autonomous region's economy, however, remain in place, it said.\nIn fact, besides Singapore and Taiwan - which rose to 11th place from 16th - rankings for all other Asian economies dropped from their year-ago positions.\nBoth the world's two largest economies fell in the rankings as well.\nThe trade war between the United States and China damaged both the economies, reversing their positive growth trajectories, IMD said. The US fell seven spots to 10th place, while China slipped to 20th from 14th in 2019. The US was toppled from its No. 1 spot in 2019 by Singapore.\nProfessor Arturo Bris, director of the IMD World Competitiveness Centre, said: \"The benefit of small economies in the current crisis comes from their ability to fight a pandemic and from their economic competitiveness. In part, these may be fed by the fact it is easy to find social consensus.\"\nThe rankings are based on responses in the first quarter of 2020 from business executives on questions about how they perceive their country's economy and hard data from 2019.\nIMD noted that the factors behind Singapore's success include its strong economic performance, which stems from robust international trade and investment, employment and labour market measures.\n\"Singapore is a small economy with similarities to Denmark and the Netherlands. Its rise to the No. 1 spot was largely driven by the relative ease of setting up business, the availability of skilled labour and its cutting-edge technological infrastructure,\" IMD said.\nStable performances in both Singapore's education system and technological infrastructure - telecommunications, Internet bandwidth speed and high-tech exports - also played key roles, it said.\nElsewhere in the Americas, Canada moved up to 8th from 13th, while in Europe, the United Kingdom climbed from 23rd to 19th, and France lost its foothold on 31st, having to settle this year for 32nd.", "url": "https://www.straitstimes.com/business/economy/singapore-retains-top-spot-as-worlds-most-competitive-economy"}