{"authors": [], "date_download": "2024-10-12 14:18:00", "date_modify": "2024-10-12 14:18:00", "date_publish": "2023-02-10 11:26:32", "description": "Singapore-based Asia Fuel and Unicious Energy are accused of doing business with Triliance Petrochemical. Read more at straitstimes.com.", "filename": "business_us-sanctions-firms-in-singapore-malaysia-over-iran-petrol-links_1728742680.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/10/2023-01-15T080618Z1605198819RC2VQY9QWHPARTRMADP3IRAN-OIL-EXPORTS_10.JPG?VersionId=AqLoouJ.yExunVpD3rpRWpI3YN8zvrit", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_us-sanctions-firms-in-singapore-malaysia-over-iran-petrol-links_1728742680.html", "title": "US sanctions firms in Singapore, Malaysia over Iran petrol links", "title_page": "US sanctions firms in Singapore, Malaysia over Iran petrol links | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The United States has sanctioned two firms in Singapore and one in Malaysia for their roles in allegedly facilitating the sale and shipment of millions of dollars worth of petroleum and petrochemicals on behalf of a company with known connections to Iran.\nAsia Fuel and Unicious Energy, both Singapore-based, and Sense Shipping and Trading of Malaysia are accused of doing business with Triliance Petrochemical, which was sanctioned in 2020 for facilitating the sale of Iranian petroleum products from the National Iranian Oil Company.\nSingapore is an important hub for the oil and gas trade and from time to time, reports have surfaced of local companies helping countries such as Iran and Russia evade US sanctions.\nThe latest move comes as demand for oil storage tanks has soared in the city-state, in a sign that a flood of Russian fuel is being blended and re-exported globally.\n“Iran is increasingly turning to buyers in East Asia to sell its petrochemical and petroleum products, in violation of US sanctions,” Mr Brian Nelson, Undersecretary of the Treasury for Terrorism and Financial Intelligence, said in a statement.\n“The United States remains focused on targeting Teheran’s sources of illicit revenue and will continue to enforce its sanctions against those who wittingly facilitate this trade,” he added.\nThe three firms mentioned are among nine entities that the US said played a role in the production, sale and shipment of hundreds of millions of dollars worth of Iranian petrochemicals and petroleum to buyers in Asia.\nAsia Fuel had allegedly facilitated the shipment of petroleum products to customers in East Asia since late 2021 and had arranged to pay storage fees on behalf of Triliance to house petroleum products in a Malaysia-based floating storage vessel.\nUnicious is accused of “coordinating millions of dollars in petroleum-related payments for other companies within the network and aiding Triliance”. The US said Sense Shipping is a “front company for Triliance”.\nIn May 2022, Unicious Energy managing director Sabil Siddique told The Straits Times that his company purchased about 80,000 tonnes of marine fuel from United Arab Emirates (UAE) company Desert Oasis Petrochemical Trading, which he valued at around US$50 million (S$66.4 million), with payment already made in full.\nMr Siddique said that this was not the first time Unicious had purchased oil from the UAE-based firm, and that Unicious took delivery of the oil only after it was discharged into a floating storage vessel leased by his company.\nUnicious did not respond to calls and e-mails requesting comment by Bloomberg. Asia Fuel and Sense Shipping could not immediately be reached for comment.\nEarlier in February, a Singapore trading company and its director were among several entities sanctioned by the US over their involvement in a Russian sanctions evasion network that sold helicopters to a Latin American government on behalf of a Russian state-owned firm. BLOOMBERG", "url": "https://www.straitstimes.com/business/us-sanctions-firms-in-singapore-malaysia-over-iran-petrol-links"}