{"authors": [], "date_download": "2024-10-12 14:10:45", "date_modify": "2024-10-12 14:10:45", "date_publish": "2024-09-11 12:30:00", "description": "Ding Yumei has over $5.2 million in her UK bank account and lives in a luxury London apartment. Read more at straitstimes.com.", "filename": "business_evergrande-founder-s-ex-wife-gets-34000-a-month-after-asset-freeze_1728742245.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/IMG389802730.jpg11UEDQTA.jpg?VersionId=MJphku.D1VgvIyOB4a3xQULDT1UdH4M6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_evergrande-founder-s-ex-wife-gets-34000-a-month-after-asset-freeze_1728742245.html", "title": "Evergrande founder’s ex-wife gets $34,000 a month after asset freeze", "title_page": "Evergrande founder’s ex-wife gets $34,000 a month after asset freeze | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - A British court allowed the former wife of China Evergrande Group founder Hui Ka Yan to spend as much as £20,000 (S$34,000) a month after freezing her assets in a case brought by the developer’s liquidators.\nThe move is part of efforts aimed at recovering about HK$2.8 billion (S$468 million) from Ms Ding Yumei. The money was paid to Ms Ding through two of her wholly owned corporate vehicles as dividends between 2018 and 2020.\nMs Ding was allowed the monthly living expenses and to pay legal fees of as much as £350,000 in August, according to court documents. She held a 5.99 per cent stake in Evergrande, according to filings in 2023.\nMs Ding has over US$4 million (S$5.2 million) in her UK bank account, according to a court document dated Aug 29, and lives in a luxury London apartment that is part of Thames City, a project developed by CC Land Holdings, chaired by Mr Hui’s long-time friend Cheung Chung Kiu.\nThe lawsuit is part of wider efforts to recover US$6 billion in dividends and remuneration from the Evergrande founder, his former wife, former chief executive officer Xia Haijun and former chief financial officer Pan Darong. A Hong Kong court earlier in 2024 ordered Evergrande’s winding up, kick-starting one of China’s biggest liquidation cases.\nLawyers for Ms Ding declined to comment, while lawyers for Evergrande’s liquidator did not return messages seeking comment.\nMr Hui, once Asia’s second-richest person with a US$42 billion net worth, lost most of his fortune as Evergrande slid into financial distress.\nThe liquidators have obtained injunctions restraining Mr Hui, Ms Ding and Mr Xia from dealing with, disposing of or diminishing the value – up to prescribed limits – of their assets around the world, according to an earlier Hong Kong filing. BLOOMBERG", "url": "https://www.straitstimes.com/business/evergrande-founder-s-ex-wife-gets-34000-a-month-after-asset-freeze"}