{"authors": [], "date_download": "2024-10-12 14:09:13", "date_modify": "2024-10-12 14:09:13", "date_publish": "2024-03-05 08:51:00", "description": "The huge demand for the bond is yet another sign the group has regained the confidence of investors. Read more at straitstimes.com.", "filename": "business_adani-storms-into-bond-market-with-549-million-sale_1728742153.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/05/2024-02-14T055851Z271591332RC282Y9BFJDZRTRMADP3ADANI-INDIA-DEBT.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_adani-storms-into-bond-market-with-549-million-sale_1728742153.html", "title": "Adani storms into bond market, pulling in $3.9b of orders for $549m sale", "title_page": "Adani storms into bond market, pulling in $3.9b of orders for $549m sale | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CHICAGO – Adani Group saw huge demand for its first public bond sale since a report in 2023 by short-seller Hindenburg Research, in yet another sign that the Indian conglomerate has regained the confidence of investors.\nIts solar energy unit Adani Green Energy and associated firms, known together as Adani Green Energy Restricted Group 1, pulled in around US$2.9 billion (S$3.9 billion) of orders for a US$409 million (S$549 million) 18-year bond. This was about seven times the deal size.\nIn addition, the final yield guidance of 6.7 per cent looks set to allay fears that the company would have to pay dearly to raise overseas capital after the United States short-seller’s claims triggered a rout in the stock and bond prices of group firms a year ago.\n“They are basically ticking the final box towards becoming an investment grade company again – which is to regain access to the public bond market,” said emerging markets credit analyst Zhang Xuchen of Jupiter Asset Management, a United Kingdom-based money manager.\nUnderlining the strength of the result, Nomura Holdings analyst Eric Liu sees “fair value” for the new bonds at about 6.825 per cent, a term used in the market to signify where an outstanding bond of the same maturity and type may trade. Typically, issuers offer a premium to this fair value to get a new deal done.\nIt appeared that Adani was indeed offering a premium with the initial marketing levels of 7.125 per cent, according to a person familiar with the matter, but strong demand allowed it to tighten pricing.\nHindenburg levied accusations of fraud and stock manipulation in its early 2023 report. Billionaire Gautam Adani’s conglomerate, whose business dealings range from ports to airports and solar energy, has repeatedly denied the claims.\nSince then, Adani has won fresh equity backing from investors including GQG Partners and successfully refinanced US$3.5 billion worth of debt for the acquisition of cement companies, helping its securities to recover. On many measures, the company has emerged even stronger from the episode.\nSome of the world’s largest asset managers, including Neuberger Berman Group, bought Adani dollar bonds after the unprecedented rout, according to an analysis by Bloomberg published in January. By contrast, Singapore’s state-owned investor Temasek exited its position entirely, the analysis showed.\nThe proceeds of the bond will be used to redeem a US$500 million note that matures in December, according to a person familiar with the matter.\nThe longer maturity and structure of the new notes removes refinancing risk, Fitch Ratings wrote on Feb 27. The issuer group operates assets generating solar power in India. The assessor said it expected to rate the new notes “BBB-”, higher than the debt they are replacing.\nBarclays and Deutsche Bank are among the banks tapped to help with the bond deal, a sign that major lenders are prepared to do business with the Indian billionaire. BLOOMBERG", "url": "https://www.straitstimes.com/business/adani-storms-into-bond-market-with-549-million-sale"}