{"authors": ["Ann Williams"], "date_download": "2024-10-12 13:30:34", "date_modify": "2024-10-12 13:30:34", "date_publish": "2021-09-16 10:57:16", "description": "The stock more than doubled, jumping 3.5 cents, or 140 per cent, to 6 cents. Read more at straitstimes.com.", "filename": "business_companies-markets_hatten-land-shares-jump-after-news-of-crypto-mining-solar-energy-ventures_1728739834.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/09/16/hattencity-img1.jpg?VersionId=CJZ6WMZcT0e.FSDUDQFNg0HcT4h_HjML", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_hatten-land-shares-jump-after-news-of-crypto-mining-solar-energy-ventures_1728739834.html", "title": "Hatten Land shares soar after news of crypto mining, solar energy ventures", "title_page": "Hatten Land shares soar after news of crypto mining, solar energy ventures | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Malaysian property developer Hatten Land shares soared in heavy trading on Thursday (Sept 16) after the Catalist-listed company announced ventures into cryptocurrency mining and solar energy.\nHatten Land was the most heavily traded counter by volume on Thursday, with 385.3 million shares changing hands. The stock more than doubled, jumping 3.5 cents, or 140 per cent, to 6 cents.\nHatten Land had called for a trading halt on Monday and resumed trading on Thursday.\nIn a filing with the Singapore Exchange before the market opened on Thursday, Hatten Land said its wholly owned subsidiary Hatten Technology had signed a memorandum of understanding with mainboard-listed Singapore Myanmar Investco (SMI) to jointly explore business opportunities in energy-efficient \"green\" crypto mining.\nSMI plans to install and operate up to 2,000 crypto mining rigs on Hatten Land's Melaka properties from December. It recently partnered with Nasdaq-listed The9 to procure up to 4,000 sets of crypto mining rigs.\nSMI shares closed up 0.1 cent, or 0.8 per cent, at 12.7 cents.\nThe crypto mining will be enabled by solar panels installed on the rooftops of retail malls Hatten Land owns or manages, as it pivots towards an environmental-friendly digital economy. Hatten operates six malls and owns four hotels in the Malaysia state.\nHatten Tech will share technological know-how on \"green\" crypto mining facility management, and will also share the net proceeds of the cryptocurrencies to be mined.\nRelated to its tie-up with SMI, Hatten Land also announced that its subsidiary Hatten Commercial Management had inked a strategic partnership agreement with Bursa-listed Nestcon to install solar panels on the rooftops of some of its Melaka properties.\nThe subsidiaries of both companies will set up a joint venture or consortium with other partners to install the solar panels at Hatten Land-owned malls.\nTo start with, about 6,373 solar panels will be installed at Dataran Pahlawan Melaka Megamall, managed by the Hatten Group, that can generate up to 3.19 megawatt-peak of solar energy.\nHatten Land said this initiative will allow it to lower energy costs, accelerate its sustainability efforts and contribute to \"green\" crypto mining.\nHatten Land will also collaborate with Nestcon on opportunities to utilise or secure current and future landbank in Malaysia for solar farms.\nTo help fund its new strategic initiatives, the company is placing out 80,000,000 new shares at 2.3 cents each to three investors.\nThis represents a discount of about 5.74 per cent over the volume weighted average price of 2.44 cents on Sept 10, the last full trading day before the placement agreements were signed.", "url": "https://www.straitstimes.com/business/companies-markets/hatten-land-shares-jump-after-news-of-crypto-mining-solar-energy-ventures"}