{"authors": [], "date_download": "2024-10-12 13:39:58", "date_modify": "2024-10-12 13:39:58", "date_publish": "2024-08-29 13:36:15", "description": "He said he wants to hold his staff \"captive all day long\". Read more at straitstimes.com.", "filename": "business_mining-billionaire-who-banned-work-from-home-now-targets-coffee-runs_1728740398.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/GettyImages-1804933571.jpg?VersionId=bkFXOsNSpe1yojcWgvvaNHz5MbcDzETc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_mining-billionaire-who-banned-work-from-home-now-targets-coffee-runs_1728740398.html", "title": "Mining billionaire Chris Ellison who banned work from home is now targeting coffee runs", "title_page": "Mining billionaire Chris Ellison who banned work from home is now targeting coffee runs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MELBOURNE - Staff at billionaire Chris Ellison’s mining company have already been banned from working from home. Stepping outside for a coffee could well be the next endangered perk.\n“I want to hold them captive all day long,” Mr Ellison, chief executive of Mineral Resources, said on Aug 29.\n“I don’t want them leaving the building. So I don’t want them walking down the road for a cup of coffee. We kind of figured out a few years ago how much that costs.”\nMr Ellison was championing the perks of working at the firm’s two-year-old Perth headquarters, which boasts a cafe, restaurant, gym, creche, reflection room and wellness centre. The 67-year-old mining veteran said staff “loved working” in the building and its facilities “kept them glued” there.\n“I have a no-work-from-home policy,” he said, according to a transcript of a call with analysts following an earnings update. “I wish everyone else would get on board with that, the sooner the better.”\nHe added: “We can’t have people working three days a week and picking up five days a week pay.”\nMr Ellison’s office policy is something of an outlier in Australia, where working from home has become the norm for white-collar workers. Many companies allow their employees to work remotely at least two days a week, with many parents embracing their new-found flexibility.\nFor those juggling busy work schedules and children, Mr Ellison said the firm’s daycare centre would charge just A$20 (S$17.70) a day, compared with external costs of about A$180 a day.\n“Drop the little tykes off next door,” he said. “We’re going to feed them, but mum and dad will be working in our office.” BLOOMBERG", "url": "https://www.straitstimes.com/business/mining-billionaire-who-banned-work-from-home-now-targets-coffee-runs"}