{"authors": [], "date_download": "2024-10-12 13:28:35", "date_modify": "2024-10-12 13:28:35", "date_publish": "2024-10-04 08:34:00", "description": "China’s benchmark stock index posted the biggest gain since 2008 on Sept 30, entering a bull market. Read more at straitstimes.com.", "filename": "business_companies-markets_china-s-stock-boom-may-turn-to-bust-as-in-2015-nomura-warns_1728739715.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/04/CHINA-ECONOMY-041711.jpg?VersionId=ntlJ_Vh4nwHrVKUCKHo2RMWYpCbSgFzc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_china-s-stock-boom-may-turn-to-bust-as-in-2015-nomura-warns_1728739715.html", "title": "China’s stock boom may turn to bust as in 2015, Nomura warns", "title_page": "China’s stock boom may turn to bust as in 2015, Nomura warns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - Investors should brace themselves for the biggest stock rally in China in 16 years to turn to bust, with the economy on a much weaker footing than before the pandemic, said Nomura Holdings.\nIn the most gloomy scenario, “a stock market mania would be followed by a crash, similar to what happened in 2015”, economists led by Dr Ting Lu wrote in a note to clients on Oct 3. That outcome may have a “much higher probability” than more optimistic scenarios.\nChina’s benchmark stock index posted the biggest gain since 2008 on Sept 30, entering a bull market, following a string of measures to turbocharge the growth of an ailing Chinese economy.\nSince then, the onshore markets have closed for holidays.\nHong Kong’s benchmark Hang Seng Index soared on Oct 2 for a 13th day, before dipping lower on Oct 3 and closing up 2.8 per cent on Oct 4.\nOptimism remains high that the rally is different from previous short-lived rebounds, with a growing number of global money managers turning bullish on the market. But Nomura is unconvinced.\n“While investors might still be okay to indulge in the boom for now, a more sober assessment is required,” the bank said.\nThe vulnerabilities of the economy stem from almost four years of the housing crisis, much higher local government debt, escalating geopolitical tensions and other factors, Nomura said.\nShould the rally turn to bust, worse could follow, with Beijing potentially resorting to printing money, the bank said. In that case, capital flight will likely be rampant and China’s renminbi may come under depreciation pressure.\nTo Mr Neo Wang, Evercore ISI’s New York-based managing director for China research, a repeat of the 2015-style stock rout would be something China’s top leadership cannot afford.\nThe Shanghai Composite Index more than doubled from September 2014 through its June 12, 2015, peak. Then the equity gauge plunged 40 per cent in about two months.\nStill, Mr Wang said the authorities have more instruments they can use to prop up stocks this time around.\n“New capital market liquidity tools like swap and relending facilities have not debuted yet,” he said.\nNomura’s baseline scenario is a bubble that busts “on a smaller scale”. Beijing is likely to introduce fiscal measures to stabilise demand and maintain local governments’ basic operations, but it may fail to address any serious structural problems and clean up the real mess in the property sector, according to the economists.\nOther global banks are more bullish though. HSBC Holdings strategist Alastair Pinder upgraded Chinese stocks to overweight and said it is “not too late to enter the rally”.\nMeanwhile, Morgan Stanley’s Ms Laura Wang said the country’s equities can gain a further 10 per cent to 15 per cent as the government may announce fiscal measures to expand the previously reported stimulus. BLOOMBERG", "url": "https://www.straitstimes.com/business/companies-markets/china-s-stock-boom-may-turn-to-bust-as-in-2015-nomura-warns"}