{"authors": [], "date_download": "2024-10-12 13:35:20", "date_modify": "2024-10-12 13:35:20", "date_publish": "2024-09-06 07:40:00", "description": "Ms Nadine Ahn is one of Canada’s most prominent women in finance with 25 years of experience at the bank. Read more at straitstimes.com.", "filename": "business_ex-cfo-says-rbc-manufactured-workplace-romance-case-against-her_1728740120.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/06/2024-08-28T105412Z327749931RC2XO9AY78DIRTRMADP3RBC-RESULTS.JPG?VersionId=TsQe2x5Qsxm_Xve8zAyPmB_KcjzhFcXN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_ex-cfo-says-rbc-manufactured-workplace-romance-case-against-her_1728740120.html", "title": "Sacked CFO alleges RBC ‘manufactured’ workplace romance case while bank reveals pet names, poetry", "title_page": "Sacked CFO alleges RBC ‘manufactured’ workplace romance case while bank reveals pet names, poetry | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TORONTO – Royal Bank of Canada’s former chief financial officer (CFO), fired over allegations she had an undisclosed personal relationship with another executive, said the bank was trying to “manufacture” a reason to get rid of her, as both sides double down in the increasingly acrimonious fight.\nMs Nadine Ahn repeated her denial that she was in a romantic relationship with Mr Ken Mason, a former executive in the bank’s treasury department. They were nothing more than “good friends” and she never abused her power to orchestrate promotions or pay increases for him, according to new legal documents filed in an Ontario court.\nCanada’s biggest bank sacked Ms Ahn in April after an investigation sparked by an anonymous whistle-blower’s complaint about the alleged relationship. The former CFO, who has 25 years of experience at the bank, filed a wrongful dismissal lawsuit in August.\nThe bank fired back a week later, alleging it has more than a decade of communications between Ms Ahn and Mr Mason proving the two had an intimate relationship that they failed to disclose. RBC claimed the colleagues used pet names, swopped romantic poetry, celebrated anniversaries and met outside of work for drinks.\nRBC has “selectively quoted” communications between the former colleagues, Ms Ahn’s lawyer, Mr Mark Fletcher, said in a separate statement on Sept 5. “There is no policy against workplace friendships and that’s all this was.”\nAn RBC spokesperson declined to comment on her new filings and referred to the bank’s previous responses. Lawyers for Mr Mason, who is also suing for wrongful dismissal, did not reply to a request for comment. BLOOMBERG", "url": "https://www.straitstimes.com/business/ex-cfo-says-rbc-manufactured-workplace-romance-case-against-her"}