{"authors": [], "date_download": "2024-10-12 14:20:31", "date_modify": "2024-10-12 14:20:31", "date_publish": "2023-11-15 17:59:00", "description": "The result reinforces views that lower-cost and leisure spending remains resilient. Read more at straitstimes.com.", "filename": "business_companies-markets_tencent-s-profit-beats-estimates-in-defiance-of-china-slowdown_1728742831.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/15/bttencent20231115.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_tencent-s-profit-beats-estimates-in-defiance-of-china-slowdown_1728742831.html", "title": "Tencent’s profit beats estimates in defiance of China slowdown", "title_page": "Tencent’s profit beats estimates in defiance of China slowdown | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Tencent Holdings’ earnings beat estimates in another sign that Chinese consumers remain willing to spend on games and entertainment during a nationwide downturn.\nRevenue rose to 154.6 billion yuan (S$29.1 billion) for the three months ended September, compared with the 154.8 billion yuan average forecast. Net income slid 9 per cent to 36.2 billion yuan, versus the 32.4 billion yuan projected.\nThe results may help assuage concerns that the world’s largest Internet arena has lost steam after years of regulatory and economic turmoil. They reinforce views that lower-cost and leisure spending remains resilient despite pullbacks in a plethora of segments from luxury to overseas travel.\nInvestors worry that the Chinese economy is in danger of entering a deflationary spiral, a fear reinforced by lacklustre spending on e-commerce platforms during this year’s Singles’ Day shopping festival.\nChinese consumption remains muted, thanks to a plethora of headwinds ranging from a crumbling property market to rising youth unemployment. Deflationary pressure worsened in October, fuelling expectations the world’s No. 2 economy needs more stimulus to shore up growth.\nBut Tencent hopes its mainstay businesses from gaming to payments are less vulnerable to the downturn as consumers keep spending on low-ticket items. Monetisation by summer hits including Valorant and Lost Ark is expected to fully kick in during the remainder of this year, while the world’s biggest games publisher expands Honour Of Kings – its most lucrative intellectual property – into more genres.\nAlibaba Group Holding and NetEase will report earnings on Nov 16 in another set of signals on how e-commerce and gaming fared during the post-pandemic reopening.\nIn the longer run, Tencent joins much of the Chinese technology sector in exploring the potential of generative artificial intelligence (AI). Its in-house large language model, Hunyuan, is now integrated with over 180 services including search and online marketing.\nTogether with arch-foe Alibaba, the Shenzhen-based company also made multiple bets on domestic AI upstarts in the so-called “war of a hundred models”, helping mint new unicorns like Baichuan.\nStill, WeChat for now is a more dependable growth driver before any AI foray comes to fruition. China’s go-to super app is credited with engineering a turnaround in advertisement sales, after its short-video feed lured users and marketers back from ByteDance’s Douyin. But TikTok’s Chinese twin, meanwhile, is rapidly encroaching on WeChat’s territory, adding real-world services like e-commerce and food delivery.\nShares of Tencent have plunged roughly 25 per cent since their January high, trailing the Hang Seng Tech Index. That is despite the Chinese firm returning about US$24 billion (S$32.4 billion) to shareholders via buybacks and dividends this year.\nTencent’s largest shareholder Prosus remains an overhang, as the Dutch investment arm of Naspers has been gradually offloading its Tencent stake to fund its own buybacks. BLOOMBERG", "url": "https://www.straitstimes.com/business/companies-markets/tencent-s-profit-beats-estimates-in-defiance-of-china-slowdown"}