{"authors": [], "date_download": "2024-10-12 14:16:33", "date_modify": "2024-10-12 14:16:33", "date_publish": "2023-11-01 10:30:00", "description": "Countries across the region reported pressures from cost inflation, shrinking output and new orders. Read more at straitstimes.com.", "filename": "business_asia-s-factories-grapple-with-rising-costs-amid-israel-hamas-war_1728742593.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/01/aifactory011123.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_asia-s-factories-grapple-with-rising-costs-amid-israel-hamas-war_1728742593.html", "title": "Asia’s factories grapple with rising costs amid Israel-Hamas war", "title_page": "Asia’s factories grapple with rising costs amid Israel-Hamas war | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAKARTA – Manufacturing activity in Asia slumped again in October as conflict in the Middle East drove oil prices higher, costs rose and global demand remained under pressure.\nMost countries across the region reported pressures from cost inflation, shrinking output and new orders, according to manufacturing purchasing managers’ indexes (PMIs) published on Wednesday by S&P Global and au Jibun Bank.\nJapan and South Korea remained in contraction at 48.7 and 49.8, respectively, little changed from September.\nA reading above 50 indicates an expansion in activity, while anything below suggests contraction.\n“The rate of inflation was robust and the strongest seen in the year to date amid reports of higher raw material prices, notably those linked to oil,” said Mr Usamah Bhatti, economist at S&P Global Market Intelligence, in a statement accompanying the South Korean data.\nMr Bhatti also noted that companies had mentioned unfavourable exchange rates as their currencies came under pressure, leading to higher input costs.\nThe latest data is a discouraging sign for a global economy that has been trying to recover from the worst of its downturn.\nAsia – which makes much of the world’s goods – has struggled to ramp up production in 2023 amid patchy demand from economies including the United States, Europe and China.\nWhile oil prices are beginning to cool again, the conflict between Israel and Hamas led to volatility in crude over October – just as many Asian factories had begun to enjoy cooling inflation and widening profit margins.\nCrude costs may surge further in this quarter if a broader conflict erupts in the Middle East.\nElevated interest rates – or ones that climb even higher – would crimp any plans to expand manufacturing activity.\nMost of South-east Asia, which has typically been able to rely on the strength of its domestic markets to power growth, was in contraction in October.\nPMIs for Vietnam, Myanmar and Thailand deteriorated, while Malaysia’s was unchanged.\nOnly Indonesia managed to register expansion in October from the month before, though the rate of growth was slower.\nTrade bellwether Taiwan – which has seen PMI contract for more than a year – recorded a reading of 47.6 in October.\nThe best reading in seven months suggested that the decline in activity in the economy is becoming less severe.\nThe stop-start recovery is also evident in China, where an official gauge this week showed factory activity shrank in October, reversing September’s return to expansion.\nWhile that partly reflected seasonal factors from a stretch of public holidays, it also suggested market demand is still weak. BLOOMBERG", "url": "https://www.straitstimes.com/business/asia-s-factories-grapple-with-rising-costs-amid-israel-hamas-war"}