{"authors": [], "date_download": "2024-10-12 14:18:49", "date_modify": "2024-10-12 14:18:49", "date_publish": "2022-06-17 15:29:02", "description": "How companies speak out and the messages they deliver are being reconsidered once again.   Read more at straitstimes.com.", "filename": "business_economy_rethinking-the-role-of-business-in-society_1728742729.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/17/ads-policyforum-17062022.jpg?VersionId=4YyrHzOc8JxNAXFqCBWRZUuQFvlsVa_L", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_rethinking-the-role-of-business-in-society_1728742729.html", "title": "Rethinking the role of business in society", "title_page": "Rethinking the role of business in society  | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (NYTIMES) - Business leaders seem to have been compelled in the last several years to speak out not only on behalf of their companies but also on social issues confronting the nation and their own employees.\nBut even more recently – amid the coronavirus pandemic, the war between Russia and Ukraine, rising inflation and a new, more aggressive political class – how the businesses speak out and the messages they deliver are being rethought once again.\nThat was the lesson from a series of in-depth conversations and roundtables with business and political leaders last week when The New York Times hosted its annual DealBook D.C. policy forum in Washington.\nEverything, it seems, has become politicised – and polarised. The effort among businesses to move away from fossil fuels in the name of climate change has been challenged over the increasing price of oil amid the Russia-Ukraine war and has become an issue of national security.\nBusinesses' role in China is being questioned, as that country is increasingly being cast as an existential enemy and human rights abuser. Companies that have fought for gun safety are being threatened with lost business in Republican-controlled states.\nEven the future of finance – and cryptocurrency – has become a political football, complicated by issues of inequality and race.\n\"I think we would probably all agree regardless of where your political persuasion is that we have a void of leadership – that we have a polarised system in which both parties, regardless of the issue, are in bed with special interests and trying their best to appeal to their base,\" said Mr Howard Schultz, chief executive of Starbucks, who returned to the company for the second time after retiring.\nThat has left companies increasingly anxious about what they can say aloud. The experience of Disney in Florida, which found itself the target of Republican Governor Ron DeSantis when it spoke out against the Don't Say Gay Bill, now a law, was a wake-up call about the costs.\nIndeed, when the Tampa Bay Rays tweeted about gun safety after the mass shooting in Uvalde, Texas, the governor pulled US$35 million (S$48.5 million) in funding for a stadium.\n\"It is pretty stunning the chilling of free speech that is going on in Florida today, that you have a governor who is essentially trying to dictate to his citizens what they can say and what they can't say and doling out pretty significant consequences for speaking their mind,\" Democratic Connecticut Senator Chris Murphy said at the summit. \"He is obviously engaged in a presidential primary campaign, and this may serve his own personal political ends.\"\nAsked about whether it is fair for politicians to use their power against companies that speak out on social issues, Treasury Secretary Janet Yellen said: \"It is political. I don't know if it is fair or unfair; I am not sure. But it is something the companies have to contend with.\"", "url": "https://www.straitstimes.com/business/economy/rethinking-the-role-of-business-in-society"}