{"authors": ["Prisca Ang"], "date_download": "2024-10-12 14:17:00", "date_modify": "2024-10-12 14:17:00", "date_publish": "2023-10-05 13:17:34", "description": "The growth in sales topped the 0.9% median forecast by analysts in a Bloomberg poll. Read more at straitstimes.com.", "filename": "business_s-pore-retail-sales-gain-steam-in-august-rising-better-than-expected-4_1728742620.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/05/cs-generic-airport.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_s-pore-retail-sales-gain-steam-in-august-rising-better-than-expected-4_1728742620.html", "title": "S’pore retail sales gain steam in August, rising better-than-expected 4%", "title_page": "S’pore retail sales gain steam in August, rising better-than-expected 4% | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Retail sales in Singapore picked up pace in August, rising for the seventh consecutive month on the back of higher alcohol sales.\nAugust’s takings at the till increased 4 per cent year on year, sharper than the revised 1.3 per cent growth in July and higher than the 0.9 per cent median forecast by analysts in a Bloomberg poll.\nExcluding motor vehicles, retail sales rose 3.7 per cent year on year, extending the 0.6 per cent growth recorded in July, according to figures released by the Singapore Department of Statistics on Thursday.\nOCBC Bank chief economist Selena Ling said August’s retail sales performance is the strongest since March, while retail sales, excluding motor vehicles, were also the highest since April.\nThe improvement in sales of discretionary items like alcohol, watches and jewellery likely reflects growing vibrancy in the entertainment and hospitality sectors, she added.\nDBS Bank economist Chua Han Teng said the continued expansion in retail sales reflects not only the return of overseas visitors, but also Singapore’s resilient labour market conditions.\nHe said retail sales will likely stay buoyant over the coming months.\n“The reasons for this include continued inbound tourism recovery and possible front-loading of purchases ahead of the upcoming GST (goods and services tax) hike, as well as cash support in December 2023 and CDC (Community Development Council) vouchers to be disbursed in January 2024.\n“From a statistical perspective, base effects are also likely to become more favourable as we head towards end-2023,” he said.\nMr Chua, however, cautioned that “cooler wage gains amid an uncertain economic environment could pose downside risks to consumers’ discretionary spending”.\nAugust’s data shows an increase in sales across most categories, with food and alcohol posting the strongest growth of 24.1 per cent owing to higher sales of alcoholic products, including those sold in duty-free shops. The category retained its pole position and remains a key beneficiary of the ongoing international travel recovery, said Mr Chua.\nThe estimated total retail sales value in August was $4 billion. Of this, online retail sales made up 12.2 per cent, similar to July.\nAugust’s overall takings increased 1.7 per cent, compared with the previous month and seasonally adjusted, thanks to petrol service stations and computer and telecommunications equipment.\nExcluding motor vehicles, retail sales rose 1.9 per cent from July.\nSales also gained steam in the food and beverage sector, rising 8.6 per cent year on year in August, compared with 6.6 per cent in July.\nFood caterers saw their takings swell by 29.8 per cent, while sales at restaurants, fast-food outlets, and cafes, foodcourts and other eating places grew between 5.3 per cent and 7.8 per cent.", "url": "https://www.straitstimes.com/business/s-pore-retail-sales-gain-steam-in-august-rising-better-than-expected-4"}