{"authors": ["Grace Leong"], "date_download": "2024-10-12 14:14:09", "date_modify": "2024-10-12 14:14:09", "date_publish": "2021-01-06 19:53:31", "description": "At $1,940 psf, the freehold good class bungalow in Gallop Road is the priciest per square foot for the area. Read more at straitstimes.com.", "filename": "business_property_family-of-singapores-richest-billionaire-a-co-founder-of-hotpot-chain-haidilao_1728742449.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/rrglbungalowb0601.jpg?VersionId=64nfEa8Zc32Ges4V.X5clxoDXvkeJyR2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_family-of-singapores-richest-billionaire-a-co-founder-of-hotpot-chain-haidilao_1728742449.html", "title": "Family of Singapore's richest billionaire, a co-founder of hotpot chain Haidilao, buys freehold bungalow for $42m", "title_page": "Family of Singapore's richest billionaire, a co-founder of hotpot chain Haidilao, buys freehold bungalow for $42m | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The family of Singapore's richest billionaire, a co-founder of Sichuan hotpot chain Haidilao, is buying a freehold good class bungalow (GCB) in Gallop Road at the highest price per square foot for the area.\nAccording to documents seen by The Straits Times, the option to purchase the 21,649 sq ft bungalow, located a stone's throw from the Singapore Botanic Gardens, was granted to Mr Zhang Hanzhi at $42 million on Dec 22.\nThis works out to $1,940 psf, which analysts say is the highest price per square foot paid for a GCB in that area.\nMr Zhang Hanzhi is the son of Mr Zhang Yong, the chairman of Haidilao International Holding, which went public in Hong Kong in September 2018.\nMr Zhang Yong, a naturalised Singapore citizen, topped Forbes' Singapore's Richest list in 2020 for a second straight year.\nHe has a combined net worth of US$19 billion (S$25 billion) with his wife Shu Ping, co-founder and director of Haidilao. She made the Forbes' list last year as well.\nThe Gallop Road property is located next to Mr Zhang Yong's existing bungalow, which was purchased at $1,700 psf or $27 million in 2016.\nDubbed The Winged House, the 15,884 sq ft freehold bungalow was designed by K2LD Architects in the shape of two wings.\nMs Carin Puah, senior director (capital markets) of real estate agency JLL Singapore, said $1,940 psf was a record price for the Gallop Road area last year.\n\"They are paying for the privacy of the location, as both bungalows are located in a cul de sac,\" she added.\nBut she also noted that there were at least three GCB transactions in other areas that were done at $2,000 psf and above last year.\nRecent transactions within the GCB areas included a Cluny Hill bungalow, which was transacted for $38.6 million or $2,315 psf.\nA GCB at Chatsworth Park was transacted last month at $44 million, which translates to $2,082 psf based on land area, and a bungalow at Lermit Road was sold for $34.75 million or $2,000 psf.\n\"There's market talk that the family were looking for a bigger plot GCB, but supply is limited... Most GCB buyers like to buy the 21,000 sq ft and larger plots, as you can build up to 17,000 sq ft,\" Mr Samuel Eyo, managing director of Lighthouse Property Consultants, said in reference to Mr Zhang Yong and his family.\nBungalows in the 39 gazetted GCB areas are the most prestigious form of landed housing in Singapore, with strict planning conditions stipulated by the Urban Redevelopment Authority to preserve their exclusivity and low-rise character.\nMarket watchers say bungalow activity and sentiment has improved, as some industries, particularly those in e-commerce and tech, have done well amid the pandemic, and as more foreigners are setting up family offices here, which bodes well for GCB demand.\nAccording to Bloomberg, Ms Shu Ping, the sole shareholder and director of Sunrise Capital Management, has opened a family office in Singapore to help manage her wealth.\nFamily offices are businesses created to run the finances of the world's super rich, providing discretion and personalised services beyond those offered by private banks.", "url": "https://www.straitstimes.com/business/property/family-of-singapores-richest-billionaire-a-co-founder-of-hotpot-chain-haidilao"}