{"authors": [], "date_download": "2024-10-12 14:06:26", "date_modify": "2024-10-12 14:06:26", "date_publish": "2024-01-15 18:15:00", "description": "It avoids a recession in the wake of an energy crisis, despite output shrinking at the end of 2023 Read more at straitstimes.com.", "filename": "business_economy_germany-sidesteps-recession-despite-year-end-contraction_1728741986.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/15/aigermany150124.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_germany-sidesteps-recession-despite-year-end-contraction_1728741986.html", "title": "Germany sidesteps recession despite year-end contraction", "title_page": "Germany sidesteps recession despite year-end contraction | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - Germany continued to dodge a recession in the wake of the energy crisis, despite output shrinking at the end of 2023 and across the year as a whole.\nGross domestic product (GDP) fell 0.3 per cent between October and December, according to a preliminary estimate on Jan 15, but an upward revision to the previous three months meant Europe’s largest economy avoided two straight quarters of contraction.\nIt was nevertheless a tough year: GDP also shrank 0.3 per cent over the full 12 months – the first such downturn since the pandemic. It is a stark contrast to peers around the globe and one that’s raising questions about the country’s future as an industrial powerhouse.\nGermany had been singled out by forecasters as the world’s only major developed nation that would fail to record economic expansion in 2023 – largely due to its manufacturing sector reeling from higher energy costs, surging interest rates and subdued foreign demand.\nWhile 2023 began with relief that the energy shock triggered by Russia’s war in Ukraine would be more manageable than initially feared, the economy lost steam and never regained traction. A recovery that had been expected in the second half of the year failed to materialise, with output faltering even as inflation retreated.\nThe disappointing performance sparked a debate over whether Germany is once again turning into the “sick man” of Europe – a moniker it first earned after reunification in the 1990s weighed on the economy and brought stubbornly high unemployment.\nTop officials including Finance Minister Christian Lindner and Bundesbank president Joachim Nagel have dismissed such talk, insisting the country has proved it can adapt to a changing environment.\nThe central bank has nevertheless acknowledged challenges to a business model that was long based on Russian energy imports and a strong reliance on China – both for components and as a market for combustion-engine cars.\nWhile natural gas prices have fallen sharply from a peak reached after the Kremlin cut off supplies, they remain higher than before Covid-19 struck. The chemical industry is among the sectors most affected, with companies including BASF and Lanxess responding by shelving investments and laying off workers.\nContinued squabbling within Chancellor Olaf Scholz’s three-party alliance has, meanwhile, highlighted the difficulty in agreeing on measures to tackle Germany’s woes.\nThat has helped feed a surge in popularity for the far-right Alternative for Germany, which now leads polls in three eastern German provinces that hold elections in 2024. Most recently, dissatisfaction with the government has brought protests by farmers, who disrupted traffic nationwide last week and are holding their main rally in Berlin on Jan 15.\nThe Constitutional Court created further headwinds at the end of 2023 by disrupting the coalition’s plans to finance investments via off-balance sheet funds, forcing savings in the current budget and fuelling fresh uncertainty among households and firms.\nOngoing concerns about Germany’s prospects are reflected in forecasts for 2024. The OECD said in November that, at 0.6 per cent, growth will be the slowest among all Group of 20 members except Argentina. BLOOMBERG", "url": "https://www.straitstimes.com/business/economy/germany-sidesteps-recession-despite-year-end-contraction"}