{"authors": [], "date_download": "2024-10-12 14:11:12", "date_modify": "2024-10-12 14:11:12", "date_publish": "2024-04-16 10:24:00", "description": "The letter circulating on social media made “false allegations” about its role in auditing China Evergrande, said PwC. Read more at straitstimes.com.", "filename": "business_pwc-denies-anonymous-letter-allegations-plans-investigation_1728742272.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/2024-03-13T025706Z1439738112RC21O1A4LMRJRTRMADP3AUSTRALIA-PWC-JOB-CUTS.JPG?VersionId=tCdTDrckjtANnFpE978pjTNTM9NzBUaZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_pwc-denies-anonymous-letter-allegations-plans-investigation_1728742272.html", "title": "PwC denies anonymous letter allegations, plans investigation", "title_page": "PwC denies anonymous letter allegations, plans investigation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - PricewaterhouseCoopers (PwC) said it will investigate an anonymous letter circulating on social media that made “false allegations” about the company and its partners over its role in auditing China Evergrande Group.\n“We believe the letter contains inaccurate statements” that “could tarnish PwC’s reputation and infringe” its legal rights, the company said in a statement on April 16.\nPwC Hong Kong has reported it to the relevant authorities, and is “treating this incident with high priority”, it said.\nThe professional services company has been under the spotlight after China launched one of the biggest investigations of financial fraud in history.\nThe authorities said property developer Evergrande’s main onshore unit had overstated its revenue in the two years through 2020.\nThe government is examining PwC’s role as a former auditor for the real estate company, sources familiar with the matter said in March.\nThe letter questioned PwC’s role in Evergrande’s accounting fraud, among other corporate governance issues.\nBloomberg was unable to verify the authenticity of the letter.\nThe auditor has run into trouble in other regions. It pledged to boost governance controls in Australia over questions of a serious conflict of interest in leaking government tax plans to its clients. Its British network was also fined £5.6 million (S$9.5 million) for failures in auditing defence company Babcock International Group. BLOOMBERG", "url": "https://www.straitstimes.com/business/pwc-denies-anonymous-letter-allegations-plans-investigation"}