{"authors": [], "date_download": "2024-10-12 14:17:41", "date_modify": "2024-10-12 14:17:41", "date_publish": "2024-05-05 15:54:00", "description": "The visit comes as the Treasury has increased its focus on terrorist financing through South-east Asia. Read more at straitstimes.com.", "filename": "business_top-us-treasury-official-to-travel-to-singapore-malaysia-to-discuss-sanctions_1728742661.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/05/202303205038809019d8790b-4d08-4e51-9039-e66f28dc912a.jpg?VersionId=CotqtBzl3y2yvp1f0cXctbX3Swh4Sd5g", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_top-us-treasury-official-to-travel-to-singapore-malaysia-to-discuss-sanctions_1728742661.html", "title": "Top US Treasury official to visit Singapore, Malaysia to discuss sanctions", "title_page": "Top US Treasury official to visit Singapore, Malaysia to discuss sanctions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The US Treasury Department’s top sanctions official will travel to Singapore and Malaysia next week, a source familiar with the matter told Reuters, as Washington seeks to combat funding for Iran and its proxy groups as well as evasion of its sanctions on Russia.\nThe source, speaking on condition of anonymity, said there has been an uptick in money moving to Iran and its proxies, including Hamas, through the Malaysian financial system.\nDuring the visit, first reported by Reuters, Mr Brian Nelson, the Treasury’s Undersecretary for Terrorism and Financial Intelligence, is expected to discuss US concerns and the sanctions risk such activity poses, the source said. Mr Neil MacBride, the Treasury’s General Counsel, will also be on the trip.\nThe visit comes as the Treasury has increased its focus on terrorist financing through South-east Asia, including through fund-raising efforts and illicit Iranian oil sales, the source added.\nThe Treasury Department in December imposed sanctions on four Malaysia-based companies that it accused of being fronts supporting Iran’s production of drones.\nWashington has recently imposed further sanctions targeting Iran, including over Iranian drones used by Russia in the war in Ukraine, as the US sought to ratchet up pressure on Tehran after its attack on Israel.\nWhile in Singapore, Mr Nelson will discuss the enforcement of a Group of Seven-led price cap on Russian oil as well as cutting off the transshipment of critical dual-use goods – those which have both civilian and military purposes, said the source.\nThe US and its allies have imposed sanctions on thousands of targets since Russia invaded neighbouring Ukraine. The war has seen tens of thousands killed and cities destroyed.\nWashington has since sought to crack down on evasion of the Western measures, including the shipment of dual-use goods through third countries to Russia.\nSingapore is a major shipping hub. Insurance and other maritime service providers operating in Singapore have warned of evasion of the price cap on Russian oil, complaining that it is difficult to confirm that paperwork promising oil is bought at or below the US$60 cap is accurate.\nThe Group of Seven price cap on Russian crude oil, imposed in December 2022, aims to reduce Russia’s revenues available for its war in Ukraine by allowing Western-supplied insurance and other services only on cargoes priced below US$60 a barrel. REUTERS", "url": "https://www.straitstimes.com/business/top-us-treasury-official-to-travel-to-singapore-malaysia-to-discuss-sanctions"}