{"authors": [], "date_download": "2024-10-12 14:09:49", "date_modify": "2024-10-12 14:09:49", "date_publish": "2024-02-23 08:40:44", "description": "The talks include ways to pre-emptively extend loan periods before countries miss payments. Read more at straitstimes.com.", "filename": "business_us-china-exploring-new-debt-relief-options-to-avoid-wave-of-emerging-market-defaults_1728742189.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/23/business-1730089150.jpg.png", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_us-china-exploring-new-debt-relief-options-to-avoid-wave-of-emerging-market-defaults_1728742189.html", "title": "US, China in talks on new debt relief options to avoid wave of emerging-market defaults", "title_page": "US, China in talks on new debt relief options to avoid wave of emerging-market defaults | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – The United States and China are discussing new measures to prevent a wave of emerging market sovereign defaults, according to people familiar with the situation, one of the most significant attempts in years at economic cooperation between the rival superpowers.\nThe talks – including ways to pre-emptively extend loan periods before countries miss payments – are broadly aimed at both easing the US$400 billion-plus (S$537 billion) annual debt service burden for poor countries and finding an alternative to the high borrowing rates those nations now face in the market.\nIn addition to extending repayment times, other ideas being discussed include increasing financing from the World Bank and other multilateral banks. A key point is to roll out those measures before countries default and enter formal restructuring talks with creditors.\nAny resulting joint proposal on global sovereign debt issues between Washington and Beijing would likely need the support of the full Group of 20 (G-20), as well as the International Monetary Fund (IMF) and the World Bank – the trifecta that has struggled to resolve global debt distress issues since the pandemic.\nIt would also eventually require broad buy-in from private creditors, who have captured a bigger share of emerging market sovereign lending and expect a bigger say at the negotiating table.\nThe Treasury Department declined to confirm the specifics of the discussions, saying in a statement that “we talk frequently with China about sovereign debt concerns. And we talk to many countries about how to make sure the international financial architecture is meeting low-income country financing needs”.\nChina’s Ministry of Finance and the Ministry of Foreign Affairs did not respond to requests for comment.\nA joint US-China approach would be a breakthrough as the two sides are the most powerful forces acting on many nations’ debt workouts: Washington dominates the global financial architecture through the Treasury Department’s influence at the IMF and World Bank, while Beijing essentially has veto power over many deals as the biggest creditor to developing countries.\nThe discussions come amid growing concerns over the slow progress of restructuring talks for countries like Zambia and Ghana, which are now engaged in a process known as the Common Framework, a programme to restructure debts launched in 2020 by the G-20, World Bank and IMF.\nThe framework’s ambitions included bringing traditional lenders from the so-called Paris Club – mostly rich, Western creditor nations – around the table with emerging creditors, notably China and the private sector.\nBut that process has drawn criticism for moving forward at a dangerously sluggish pace, leaving defaulted countries suspended for years while dissuading others near bankruptcy from seeking help given the grinding process.\nFor example, Zambia defaulted in 2020 and has still not finalised an overhaul of its debts. It appeared to have reached an agreement for restructuring more than US$3 billion of debt late in 2023, only to have it fall apart amid a stand-off between Beijing and bond holders.\nThe talks between the US and China began before a meeting in California in November between presidents Joe Biden and Xi Jinping and have continued into 2024, according to one of the people.\nDebt issues were discussed during US Treasury Undersecretary Jay Shambaugh’s visit to Beijing earlier in February.\nDeveloping nations spent a record US$443 billion on debt service payments in 2022, according to the World Bank, which has warned that the situation risks tipping them into crisis and creating a “lost decade” of economic stagnation.", "url": "https://www.straitstimes.com/business/us-china-exploring-new-debt-relief-options-to-avoid-wave-of-emerging-market-defaults"}