{"authors": [], "date_download": "2024-10-12 14:19:35", "date_modify": "2024-10-12 14:19:35", "date_publish": "2023-01-24 10:22:21", "description": "NEW YORK - Billionaire Elon Musk said on Monday that he had not lied or misspoken about his plan to take Tesla off the stock market in 2018, testifying in federal court that Saudi Arabia’s sovereign wealth fund had “unequivocally wanted to take Tesla private”. Read more at straitstimes.com.", "filename": "business_elon-musk-says-he-could-have-raised-funds-to-take-tesla-private_1728742775.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/24/2023-01-24T002359Z1910106149RC2HZT9VA06RRTRMADP3TESLA-MUSK-TRIAL_1.JPG?VersionId=6Td6AZQnZfbEoo.hS8YGS14zVmyJe6yO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_elon-musk-says-he-could-have-raised-funds-to-take-tesla-private_1728742775.html", "title": "Elon Musk says he could have raised funds to take Tesla private", "title_page": "Elon Musk says he could have raised funds to take Tesla private | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Billionaire Elon Musk said on Monday that he had not lied or misspoken about his plan to take Tesla off the stock market in 2018, testifying in federal court that Saudi Arabia’s sovereign wealth fund had “unequivocally wanted to take Tesla private”.\nInvestors are suing Mr Musk, Tesla and the company’s board because they contend that they lost money as a result of Mr Musk’s statements about his plan to take Tesla private, which later collapsed.\nOn Aug 7, 2018, Mr Musk, who was chairman and chief executive of the electric carmaker then, wrote on Twitter: “Am considering taking Tesla private at US$420 (S$550). Funding secured.”\nHe then wrote: “Investor support is confirmed. Only reason why this is not certain is that it’s contingent on a shareholder vote.”\nTesla’s share price jumped after those posts, but later fell as the proposal fizzled out.\nHow jurors interpret Mr Musk’s statements and the effect these had on investors could be critical to the outcome of this case. A victory for investors could mean Mr Musk and Tesla would have to pay billions of dollars in damages.\nMr Musk has testified for about four hours in this trial and was due back on the stand on Tuesday. He answered Monday’s questions about the Saudi fund, called the Public Investment Fund, from a plaintiffs’ lawyer. Mr Musk said officials from the Saudi fund had not signed documents committing to a deal or discussed how much they would invest.\nMr Musk had long claimed that Saudi investors were committed to the transaction.\nHe testified that “funding secured” referred not just to financing from the Saudi fund but also to his stake in SpaceX, a rocket company where he is also CEO. Mr Musk could theoretically have borrowed against his stake in SpaceX or sold some of that stock to come up with the money needed to take Tesla private.\n“This is an extremely important point, and you seem to be deliberately avoiding it,” Mr Musk said to Mr Nicholas Porritt, a lawyer for the plaintiffs.\nBut under questioning from Mr Porritt, Mr Musk acknowledged he had not mentioned his SpaceX shares as a potential funding source in a 2021 deposition. He later said he had mentioned using those shares in a deposition that was part of an investigation by the US Securities and Exchange Commission into his efforts to take Tesla private. NYTIMES", "url": "https://www.straitstimes.com/business/elon-musk-says-he-could-have-raised-funds-to-take-tesla-private"}