{"authors": [], "date_download": "2024-10-12 14:04:33", "date_modify": "2024-10-12 14:04:33", "date_publish": "2022-11-15 13:47:22", "description": "The billionaire is one of the world’s most successful investors and has a long track record of making savvy, lucrative bets. Read more at straitstimes.com.", "filename": "business_chip-giant-tsmc-shares-surge-after-warren-buffett-takes-us5b-stake_1728741873.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/15/2022-05-04T214448Z819810908RC2K0U97ZPKURTRMADP3BERKSHIRE-BUFFETT-FILING_3.JPG?VersionId=8zH.zKu_GdltQPWPcP4y4sMuhpJ.BoOC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_chip-giant-tsmc-shares-surge-after-warren-buffett-takes-us5b-stake_1728741873.html", "title": "Chip giant TSMC shares surge after Warren Buffett takes $6.9b stake", "title_page": "Chip giant TSMC shares surge after Warren Buffett takes $6.9b stake | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TAIPEI – Shares in Taiwan Semiconductor Manufacturing Company (TSMC) soared on Tuesday after billionaire investor Warren Buffett’s Berkshire Hathaway confirmed it had taken a close to US$5 billion (S$6.9 billion) stake in a major boost of confidence for the semiconductor giant.\nTSMC operates the world’s largest silicon wafer factories and produces some of the most advanced microchips used in everything from smartphones and cars to missiles.\nThe company’s shares and profits soared for the first two years of the coronavirus pandemic during a global shortage of semiconductors.\nThe climb came to an end this year as demand was clipped and the prospect of a global downturn loomed, with the firm’s shares down 24 per cent since Jan 1 and some US$230 billion wiped from its valuation.\nBut that rout turned a corner last week with a sudden surge of investor buying, and the company was up nearly 8 per cent in Tuesday morning trade.\nThis came after Berkshire Hathaway confirmed in a filing that it had acquired about 60 million American depository receipts in TSMC in the three months ended September.\nMr Buffett is one of the world’s most successful investors and has a long track record of making savvy, lucrative bets.\nIn October, TSMC announced plans to slash expenditure by around 10 per cent, in the latest sign from a major global chipmaker that it is expecting the global downturn to deepen.\nBut the company remains in the fortunate position of making some of the world’s most advanced chips, with key clients including Apple, Nvidia and Qualcomm.\nThe company reported forecast-beating results in the third quarter, with a net income of NT$280.9 billion (S$12.4 billion). AFP", "url": "https://www.straitstimes.com/business/chip-giant-tsmc-shares-surge-after-warren-buffett-takes-us5b-stake"}