{"authors": [], "date_download": "2024-10-12 14:10:16", "date_modify": "2024-10-12 14:10:16", "date_publish": "2024-01-26 08:29:00", "description": "China is struggling under the weight of a years-long real estate bust and its worst streak of deflation in 25 years. Read more at straitstimes.com.", "filename": "business_us-extends-lead-over-china-in-race-for-world-s-biggest-economy_1728742216.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/26/2024-01-25T163326Z1410504402RC23P5A0DFJ6RTRMADP3MARKETS-BONDS-CHINA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_us-extends-lead-over-china-in-race-for-world-s-biggest-economy_1728742216.html", "title": "US extends lead over China in race for world’s biggest economy", "title_page": "US extends lead over China in race for world’s biggest economy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The United States has pulled further ahead of China in the race for the world’s biggest economy, thanks in part to a vibrant American consumer.\nUS gross domestic product (GDP) rose 6.3 per cent in nominal terms – that is, unadjusted for inflation – in 2023, outpacing China’s 4.6 per cent gain. While some of the outperformance reflected America’s elevated price increases, the 2023 outturn underscores a broader point: The US economy is emerging from the pandemic period in a better place than China’s.\n“It is a striking turn of fortunes,” said Dr Eswar Prasad, who once led the International Monetary Fund’s (IMF) China team and is now at Cornell University. “The strong performance of the US economy, in tandem with all the short-term and long-term headwinds the Chinese economy is facing, renders it a less obvious proposition that China’s GDP will someday overtake that of the US.”\nThe economic outperformance is reflected in the respective countries’ stock markets. US shares have hit all-time highs this week, while Chinese equities are mired in a US$6 trillion-plus (S$8 trillion-plus) bear-market rout.\nIt was not expected to be this way. At the start of 2023, the US was widely tipped to fall into a recession as the Federal Reserve jacked up interest rates to combat an inflation scourge not seen in decades.\nChina, on the other hand, was expected to experience a rip-roaring recovery as it reopened its economy fully to commerce after strict lockdowns to combat the spread of Covid-19.\nThat is not what happened. GDP data released on Jan 25 showed the US economy ended the year with a bang, growing 3.3 per cent in real, inflation-adjusted terms in the fourth quarter after expanding 4.9 per cent in the third. Inflation is on its way back down to the Fed’s 2 per cent target, and fears of a recession are fading.\nChina, by contrast, is struggling under the weight of a years-long real estate bust and its worst streak of deflation in some 25 years. Exports – once a critical pillar of growth – declined in 2023, joblessness among young people has soared, and local governments are saddled with too much debt.\nWhile government figures show the economy met the authorities’ annual growth target, by expanding 5.2 per cent in 2023, there are suspicions that this is not a true picture of what is going on.\nMr Josh Lipsky, a former IMF adviser who is now director of the Atlantic Council’s GeoEconomics Centre, said: “The pandemic covered up a lot of China’s weaknesses that are deep and structural and will last through the decade – depending on their ability to reform.”\nPeterson Institute for International Economics president Adam Posen argues that Chinese President Xi Jinping has greatly compounded the country’s underlying economic weaknesses by his arbitrary and authoritarian exercise of power throughout the economy and society, particularly during the pandemic.\nThat has spooked households and small businesses into hoarding cash, because they just do not know what is coming next. It is a malady that Mr Posen has called “economic long Covid” – a chronic condition marked by a lack of vitality and extended sluggishness.\nThe US, meanwhile, has surprised economists with the resiliency of its economy coming out of the pandemic. Some, like Mr Posen, even suspect the country may be on the cusp of a pickup in productivity growth that will allow the economy to grow faster without generating inflation.", "url": "https://www.straitstimes.com/business/us-extends-lead-over-china-in-race-for-world-s-biggest-economy"}