{"authors": ["Ry-Anne Lim"], "date_download": "2024-10-12 14:21:08", "date_modify": "2024-10-12 14:21:08", "date_publish": "2024-02-06 16:50:00", "description": "Non-owner-occupied homes are expected to account for two-thirds of the increase. Read more at straitstimes.com.", "filename": "business_property_2024-property-tax-revenue-to-rise-by-600-million-more-than-the-380-million-government-projected_1728742868.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/06/prop039A2844.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_2024-property-tax-revenue-to-rise-by-600-million-more-than-the-380-million-government-projected_1728742868.html", "title": "Residential property tax revenue projected to grow $600m in 2024, higher than earlier $380m forecast", "title_page": "Residential property tax revenue projected to grow $600m in 2024, higher than earlier $380m forecast | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The residential property tax revenue in Singapore is projected to grow by around $600 million in 2024, with non-owner-occupied homes accounting for two-thirds of the increase, said Second Minister for Finance Chee Hong Tat on Feb 6.\n“(This) is higher than what we had originally anticipated when we debated this issue in Budget 2022,” said Mr Chee, who is also Minister for Transport.\nBack then, Finance Minister Lawrence Wong, who is now also Deputy Prime Minister, estimated that the increase in property tax, when fully implemented, would raise property tax revenue by about $380 million per year.\nIn financial year 2022 ended March 2023, property tax collection was $5.1 billion, up 9.1 per cent from $4.7 billion in FY2021.\nThe figure was shared in response to questions raised by Workers’ Party chief and Leader of the Opposition Pritam Singh on property tax collections in 2024, given the hike in tax rates for most home owners.\nMr Chee attributed the higher-than-expected property tax revenue to higher annual values (AVs), which rose in tandem with rents for both private and public housing. Based on the latest data from the Urban Redevelopment Authority, rents for private residential properties grew 8.7 per cent year on year in the fourth quarter.\nProperty taxes are calculated based on AVs, which are revised yearly based on the estimated annual rent if the property was rented out. This also depends on the condition of the property, its age and locational attributes, and general market trends, said Mr Chee.\nAs announced in Budget 2022, property taxes for non-owner-occupied and “high-value” owner-occupied residential properties will also increase as a form of wealth tax, he noted.\nThe second and final step of the hike took effect from Jan 1, with tax rates growing to between 12 per cent and 36 per cent.\nWhen asked about implementing differential tax rates for retirees with no income, Mr Chee said the Government “will take a look and see how” it can help not just seniors, but also other families who are facing a large jump in their property taxes.", "url": "https://www.straitstimes.com/business/property/2024-property-tax-revenue-to-rise-by-600-million-more-than-the-380-million-government-projected"}