{"authors": [], "date_download": "2024-10-12 14:15:24", "date_modify": "2024-10-12 14:15:24", "date_publish": "2024-09-04 10:59:00", "description": "The Caixin/S&P Global services PMI slipped to 51.6 in August from 52.1 in July. Read more at straitstimes.com.", "filename": "business_economy_chinas-services-activity-expansion-slows-in-august-caixin-pmi-shows_1728742524.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/CHINAECON3.JPG?VersionId=WwgZULn5aoU7wbFCwGFM2wBwHbXwoo4V", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_chinas-services-activity-expansion-slows-in-august-caixin-pmi-shows_1728742524.html", "title": "China’s services activity expansion slows in August, Caixin PMI shows", "title_page": "China’s services activity expansion slows in August, Caixin PMI shows | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - Growth in China’s services sector activity slowed in August despite the summer travel peak, prompting some firms to cut staff amid concerns about rising costs, a private-sector survey showed on Sept 4.\nThe Caixin/S&P Global services purchasing managers’ index (PMI) slipped to 51.6 in August from 52.1 in July. The 50-point mark separates expansion from contraction on a monthly basis.\nThe new business index remained above 50, extending the sequence of expansion that started from January 2023, but the rate of growth was softer than July.\nExport business quickened, however. According to panellists, overseas client interest in the tourism industry supported faster business growth.\nThe State Council, or the Cabinet, on Sept 3 published a notice to improve high-quality development of China’s service trade, including facilitating cross-border talent flow and enhancing international transport service capacity.\nAlthough still below the series average, the survey showed the level of business optimism climbed to the highest since May.\nAn official survey on Aug 31 showed an upbeat picture of the industry, with services activity returning to expansion in August.\nBut growth in new business did not translate into more jobs. According to the Caixin survey, employment declined in August after rising in July. According to panellists, job shedding occurred due to resignations and redundancies stemming from the need to lower costs.\nAverage input prices continued to rise, with the rate of cost inflation accelerating to the highest since June 2023.\nIn contrast, selling prices fell for the first time in seven months and the rate of decline was the most pronounced since April 2022. Anecdotal evidence suggested that rising competition led service providers to lower prices and offer discounts to support sales.\nTogether with the manufacturing PMI, the Caixin/S&P Global Composite PMI posted 51.2 in August, unchanged from July. Faster manufacturing output growth was offset by slower services activity expansion in August.\nWith factory owners trimming product prices to stay competitive, consumers tightening their belts and the ailing property sector failing to see a meaningful rebound, the economy faces increasing challenges in tandem with external geopolitical uncertainties.\n“The economy was under a double whammy of weather shocks and weak demand in August,” said Citi analysts in a note on Sept 3.\nThe government’s 2024 growth target of “around 5 per cent” could be at risk, it added. REUTERS", "url": "https://www.straitstimes.com/business/economy/chinas-services-activity-expansion-slows-in-august-caixin-pmi-shows"}