{"authors": [], "date_download": "2024-10-12 14:18:24", "date_modify": "2024-10-12 14:18:24", "date_publish": "2023-03-21 08:46:01", "description": "Japanese auto giants are losing out In China, the world’s largest auto market, where one in four cars sold last year was electric. Read more at straitstimes.com.", "filename": "business_china-s-ev-revolution-shows-grim-future-for-japan-s-car-titans_1728742704.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/21/2023-03-09T131754Z1800831436RC2K3Z99P18YRTRMADP3BYD-ELECTRIC-PRICES_1.JPG?VersionId=XbtceUW7I34T0VP4RGL3f6fuRmB5aztB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-ev-revolution-shows-grim-future-for-japan-s-car-titans_1728742704.html", "title": "China’s EV revolution shows grim future for Japan’s car titans", "title_page": "China’s EV revolution shows grim future for Japan’s car titans | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – In the world of petrol cars, Japan’s automakers are king. Toyota Motor has held the title of the world’s No. 1 car company for the past three years, while Honda Motor and Nissan Motor remain global bestsellers.\nBut as the transition to electric vehicles (EVs) accelerates, the Japanese giants are facing stiffer competition from EV upstarts like Tesla and BYD. Nowhere is the threat more apparent than in China – the world’s largest auto market and where one in four cars sold last year was electric. EV sales are forecast to climb to nine million in 2023, reaching market penetration of 35 per cent.\nHonda and Nissan sales in China have been falling for at least two years, while Toyota’s sales last year declined for the first time in a decade. Although chip shortages, Covid-19 lockdowns and the related supply chain snarls played their part, a growing issue is the lack of attractive EV offerings from the trio.\nChina is providing a window into a future where these Japanese titans fall from their pedestal, potentially upending the global automaking landscape for good. Tesla is the world’s top EV maker by vehicles sold, followed by companies including China’s BYD and Volkswagen, according to Bloomberg Intelligence. No Japanese carmaker makes the top 20, leaving them on the sidelines of the auto industry’s fastest-growing sector.\n“If the Japanese automakers continue a conservative and indecisive approach to their EV strategies, it is only a matter of time before they fail in the global market,” said Mr Yale Zhang, managing director of Shanghai-based consultancy Automotive Foresight.\nIn China, Japanese cars are mostly produced and sold through joint ventures with local partners. Guangzhou Automobile Group has partnerships with Toyota and Honda, while state-backed Dongfeng Motor Group has ventures with Honda and Nissan.\nThe ventures have long excelled with good-value, reliable petrol vehicles in the mid-range category – cars priced between 100,000 yuan and 300,000 yuan (between S$19,450 and S$58,350). Nissan’s compact Sylphy sedan, the Toyota Corolla and Honda’s Civic are known in China as the “three musketeers” of popular Japanese cars. Sylphy was the No. 2 best-selling model in China last year, with deliveries of 393,500 units. Coralla was No. 10 at 191,610.\nBut starting in 2020, when Tesla’s entry supercharged China’s EV market, the Japanese trio started to be squeezed at both ends of the market. Tesla and local EV companies like Nio and Xpeng began to make inroads at the top end, while budget cars like the Hongguang Mini EV from General Motors and its Chinese partners became popular with first-time buyers, and was the top-selling model in 2022.\nNow, BYD is staking a claim in the mid-market where the Japanese companies operate, with a line-up of electric models such as the crossover sport utility vehicle Song Plus, starting from 140,000 yuan. This and other popular models propelled BYD to be the top-selling domestic brand in 2022, shipping more than 1.85 million vehicles.\nJapanese companies should better promote their hybrid offerings to gain an edge in China, said Mr Cui Dongshu, secretary-general of the China Passenger Car Association. The benefits of hybrids – popular elsewhere among those anxious of making the full electric leap – have not been effectively promoted in China, he said.\n“We think there is still room for growth for Japanese car brands in China,” Mr Cui said.\nStill, Nissan last month lowered its electrification target in China to 35 per cent of sales from 40 per cent in fiscal year 2026, even as it said 98 per cent of sales in Europe will be hybrid or fully electric by then.\nNissan chief operating officer Ashwani Gupta said this is because local brands are “leading the way” in China. With only two EVS on offer in China – the Ariya and an electric version of the Sylphy – the category accounted for just 1 per cent of Nissan’s sales there in the third quarter of last year. While the company plans to launch 19 battery-electric vehicles and 35 hybrid models by 2030, the next electric SUV will not come until 2024.", "url": "https://www.straitstimes.com/business/china-s-ev-revolution-shows-grim-future-for-japan-s-car-titans"}