{"authors": [], "date_download": "2024-10-12 14:11:10", "date_modify": "2024-10-12 14:11:10", "date_publish": "2024-01-08 07:50:00", "description": "China’s leaders are pouring money into manufacturing as property-related activity turn into a drag on growth. Read more at straitstimes.com.", "filename": "business_xi-s-solution-for-china-s-economy-risks-triggering-new-trade-war_1728742270.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/08/FILES-CHINA-BYD-INDUSTRY-CARS-053755.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_xi-s-solution-for-china-s-economy-risks-triggering-new-trade-war_1728742270.html", "title": "Xi’s solution for China’s economy risks triggering new trade war", "title_page": "Xi’s solution for China’s economy risks triggering new trade war | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – As China’s property sector declines, President Xi Jinping needs to reshape the nation’s economic model to drive growth over the next decade. His government’s solution risks igniting a new wave of trade tensions across the globe.\nChina’s leaders are pouring money into manufacturing as property-related activity, which once spurred about a fifth of the economy’s expansion, turned into a drag on growth in 2022. Part of that focus is what they call the “new three” growth drivers of electric vehicles (EVs), batteries and renewable energy, aiding the world’s decarbonisation push and fuelling demand for commodities such as copper and lithium.\nSo far, the strategy is helping China avoid the recessions that hit Japan in the 1990s and the United States in 2008 when their housing markets melted down. The world’s second-biggest economy is now growing at about 5 per cent a year. Yet it is also fuelling imbalances that are setting the stage for renewed global trade tensions between China and the developed world, as well as emerging economies that are pushing to reach the lower rungs of the industrialisation ladder.\nThe US and European Union have recently stepped up warnings on China’s overcapacity. Europe initiated a series of trade investigations, leading China last week to launch an anti-dumping probe into EU liquor products like brandy – a move analysts saw as targeted at France, the main backer of the bloc’s action on Chinese EV subsidies. US President Joe Biden has also tightened measures to deny China advanced technology, and a presidential race in 2024 likely to feature Donald Trump could see protectionist policies ramp up even further.\nDeveloping countries are also impacted. While China’s strategy can lower the cost of capital goods, its efforts to retain lower-end industries narrow the space for nations like Vietnam and Indonesia that would otherwise benefit from China’s move up the value chain. Other countries seeking to attract more sophisticated industries, including Turkey and India, are increasing protectionism aimed at China.\nMr Xi’s manufacturing focus is driven by a mix of economic, security and social stability objectives. Chinese policy advisers and government-linked economists say that this includes a desire to avoid problems such as widening income inequality and rising populism that emerged in the US after it lost manufacturing jobs to China. The US curbs on high-end chips have also prompted China to redouble efforts to attain self-sufficiency in cutting-edge technology as an urgent national security priority.\nThe numbers are historic: China’s manufactured goods surplus relative to global gross domestic product is now around 2 per cent, a level probably unseen since the US after World War II, according to Bloomberg Intelligence. It estimates that about 45 per cent of China’s manufacturing output is being exported as the nation’s 1.4 billion people cannot buy enough goods like EVs, ships and household appliances to meet the increased supply.\nChina’s new focus on “industrial upgrading” means pushing into sectors now dominated by the wealthiest nations. This is leading to lower imports from countries like Germany, South Korea and Japan that traditionally ran trade surpluses with China because they provided its factories with high-tech components.\nEvidence of China’s renewed focus on manufacturing is everywhere, from surging bank loans to the industrial sector to booming investment in industrial parks and increased exports of everything from cars and excavators to washing machines. To the surprise of traders, that has also propped up global commodity prices, despite the slump in residential construction.\nChina’s clearest manufacturing success has been the “new three” products. The export value of EVs, batteries and solar panels grew 42 per cent year on year in the first three quarters of 2023, according to official statistics. Domestic sales of those products are even larger than exports, fuelled by subsidies for solar installation and EV purchases. Local consumers bought nearly six million domestically made passenger EVs in the first ten months of 2023, compared with exports of 1.6 million.\nThat is drawing parallels with Japan’s economic trajectory – but not the familiar comparison to its lost decades after its own property collapse.\nMuch like Japan in the 1980s, China’s rise into more sophisticated areas of manufacturing is now making it a head-to-head competitor with developed nations, according to Dr Andre Sapir, senior fellow at Brussels-based Bruegel and an economic adviser to former EU president Romano Prodi. The main difference, he said, was that Japan was a US ally.\nThis time, it is different.\nTreasury Secretary Janet Yellen in November warned that oversupply “could arise in the future in industries that China is investing in very heavily”. Selective subsidies in Mr Biden’s Inflation Reduction Act aim to price Chinese-made green technology out of the US market, while a steady ratcheting up of restrictions on high-tech chip sales seeks to slow China’s ascent.\nThe European Commission has also directly launched a probe into Chinese EVs – a rare move as such investigations are normally requested by industry. In November, European Commission chief Ursula von der Leyen said that China’s “overcapacities in protected industries are flooding global markets and can undermine our industrial base”.\nBeijing has tried to defuse tensions with Washington and others by pointing out that foreign companies are welcome: The goal is made in China, not necessarily made by Chinese companies, officials say. Tesla, for instance, has been welcomed to produce in China for domestic sales and exports.\nHowever, other firms have complained that the Chinese market is becoming less open to goods made by foreign companies, even if the manufacturing is done locally. Some sectors are still off-limits to foreign investors and governments are increasingly implementing a “buy Chinese” policy for goods such as medical devices, they say.\nChina’s need for foreign investment to help bring the know-how to upgrade manufacturing means policymakers need to make strategic concessions to keep overseas businesses onside. During his November trip to San Francisco, Mr Xi told a room full of business executives that China is ready to be a partner and friend of the US.\nBut there will not be any compromise on the underlying strategy. In a 2020 speech laying out the dual circulation strategy, an attempt to rebalance the economy towards domestic demand in the face of growing external hostilities, Mr Xi called manufacturing the “lifeline” and “foundation” of the country.\nThe share of manufacturing in China’s GDP peaked in 2011, and in 2015, services started to account for more than half the economy, which is normal as countries grow wealthier. But China has since decided to defy economic gravity: The country’s latest five-year economic plan proclaimed that the manufacturing share would not be allowed to shrink from 2020 onwards. Aided by the surge in demand for Chinese goods during the pandemic, the share rose by 2 percentage points over the next two years to reach 28 per cent of GDP.\nThere is an economic rationale for Mr Xi’s plan. Economic growth tends to slow as countries become more services-dominated because productivity improvements are harder to come by. Manufacturing also has more spillovers to other sectors.\nA 2017 study published by Singapore’s Ministry of Trade and Industry found that every 100 new manufacturing jobs are associated with 27 new non-manufacturing jobs; by contrast, every 100 new service jobs are associated with only three additional manufacturing jobs. It also has the highest innovation potential, accounts for the bulk of economywide research and development spending and employs the majority of scientists and engineers.\n“China’s economic growth model is moving from ‘investment plus housing plus export-driven’ to ‘domestic demand plus manufacturing plus carbon neutrality-driven’,” Dr Zhu Min, a former People’s Bank of China deputy governor, said in a November speech. “This is a long-term structural transformation.”\nThe transition will not be easy.\nThe rapid growth of the “new three” industries will not be able to offset a real estate decline and falling production of petrol-powered cars, according to Goldman Sachs Group economists. This will result in a cut to economic growth of 0.5 percentage point a year from 2023 to 2027 and hurt urban employment, they wrote in a recent report.\nThat means China’s manufacturing growth will need to be broad-based. China is making progress in sectors like advanced materials, robotics and biotechnology. Mr Xi used his annual new year address on Dec 31 to highlight the launch of China’s first home-made cruise ship and narrow-body airliner. But it is unclear if China can make rapid progress on all these fronts.\nA second constraint on manufacturing growth is that deepening trade tensions mean China will have to sell a larger share of its manufacturing output domestically. Beijing has recognised the need to increase domestic demand, but ranked it second behind developing industry as an economic priority for 2024. The authorities have resisted measures such as cash handouts to directly boost consumption and are largely deploying an approach where supply is expected to create demand, as greater productivity leads to higher wages.\nThat logic has constraints, especially as manufacturing becomes more automated. Income gains from higher productivity are often distributed among fewer workers and wealthy shareholders who spend less of their earnings.\nMr Arthur Kroeber, head of research at economic consultancy Gavekal Dragonomics, says Mr Xi’s vision for China is something akin to a “Leninist Germany”, in which a slower pace of expansion with greater stability and a focus on production is preferred to a US-style system.\nHe expects China’s annual economic growth to be somewhere between 3 per cent and 4 per cent over the rest of the decade if the current investment and industry-driven policy settings continue.\n“The positive element of this is that there are going to be some technological success stories. That’s good,” he said. “The problem with that is there’s a big question to how much the rest of the world is going to put up with ever-growing Chinese trade surpluses. And you’re already starting to see some protectionist backlash.” BLOOMBERG", "url": "https://www.straitstimes.com/business/xi-s-solution-for-china-s-economy-risks-triggering-new-trade-war"}