{"authors": ["Timothy Goh"], "date_download": "2024-10-12 13:46:40", "date_modify": "2024-10-12 13:46:40", "date_publish": "2023-11-01 13:15:00", "description": "SPH Media noted that the acquisition will support the group’s broader transformation efforts. Read more at straitstimes.com.", "filename": "business_sph-media-to-acquire-technology-media-company-tech-in-asia_1728740800.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/01/SPH-TIA-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_sph-media-to-acquire-technology-media-company-tech-in-asia_1728740800.html", "title": "SPH Media to acquire technology media company Tech in Asia", "title_page": "SPH Media to acquire technology media company Tech in Asia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – SPH Media has entered into an agreement to acquire technology media company Tech in Asia (TIA).\nThis will strengthen the offerings of the group, in particular that of The Business Times, it said in a statement on Wednesday.\n“The synergies from this proposed acquisition will deepen the value BT brings to businesses and readers in the region, and accelerate its goal of becoming a regional player for business and tech news, and events,” SPH Media said.\nIt added: “The acquisition will infuse new digital media talent and capabilities into BT, in areas of journalism, tech, business insights, product, events and marketing.\n“Readers will also be able to benefit from a strengthened core content in business and tech. We will also continue to explore further synergies that will help deliver greater value to our audiences.”\nA spokesperson for the group said: “We are not disclosing the financial terms of the transaction. The acquisition is funded from SPH Media’s existing resources. We expect that the combination of BT and TIA will generate new revenue opportunities for the wider group.\n“We have mapped out a post-merger integration process, which will take 12 to 18 months. During this period, TIA and BT will operate as separate brands.”\nSPH Media also noted that the acquisition will support the group’s broader transformation efforts.\n“TIA’s commitment to high-quality content and events is well aligned with BT’s vision of becoming the leading business title in the Asia-Pacific, and this acquisition will help both TIA and BT bring more value to their audiences,” it said.\nMr Wong Wei Kong, editor-in-chief of SPH Media’s English/Malay/Tamil Media Group, said: “By coming together with their strengths and capabilities, BT and TIA present an exciting business proposition in Asia, centred on good journalism.\n“For SPH Media, this acquisition is a strategic move that will enable us to provide our readers with a more comprehensive suite of products and services.”\nTIA chief executive and founder Willis Wee said: “We are committed to delivering top-notch content and events, and with SPH Media by our side, we are poised to achieve even greater heights.\n“We are enthusiastic about the opportunities this acquisition will bring. Rest assured, our start-up spirit and data-driven approach will remain at the core of our competencies post-acquisition.”\nEstablished in 1976, The Business Times is Singapore’s sole financial daily. With digital and print editions, it provides news and commentaries on markets, companies, start-ups, wealth, property, lifestyle and small and medium-sized enterprises in Singapore, Asean and globally.\nFounded in 2010, TIA is one of the pioneers of business tech media in the region.\nThe digital news publication covers start-up and venture capital news for a user base spanning mainly South-east Asia, India and North America.\nThe publication has 90 employees based in Singapore, Indonesia and other countries in the Asia-Pacific region.\nIt also has a regional events network and corporate customers across several markets.\nThe acquisition is subject to customary closing conditions and is expected to close by the end of 2023.", "url": "https://www.straitstimes.com/business/sph-media-to-acquire-technology-media-company-tech-in-asia"}