{"authors": [], "date_download": "2024-10-12 14:10:17", "date_modify": "2024-10-12 14:10:17", "date_publish": "2024-02-14 05:18:29", "description": "Yields on US Treasury notes across the board spiked to two-month highs. Read more at straitstimes.com.", "filename": "business_companies-markets_wall-st-ends-sharply-lower-as-hot-inflation-sparks-sell-off_1728742217.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/14/btwall20240214.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_wall-st-ends-sharply-lower-as-hot-inflation-sparks-sell-off_1728742217.html", "title": "Wall St ends sharply lower as hot inflation sparks sell-off", "title_page": "Wall St ends sharply lower as hot inflation sparks sell-off | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Wall Street’s main indexes ended sharply lower on Feb 13 after a higher-than-expected consumer inflation reading pushed back market expectations of imminent interest rate cuts, driving US Treasury yields higher.\nA Labor Department report showed US consumer prices increased above forecasts in January amid a surge in the cost of shelter.\n“Equities are in retreat mode following a still inflationary CPI report,” said Terry Sandven, chief equity strategist at US Bank Wealth Management. “The higher for longer inflation is a setback for the Federal Reserve.”\nMarkets have rallied this year on bets that the Fed would start trimming rates in May. The S&P 500 closed above 5,000 for the first time on Friday. The Dow is also trading near a record-high level, and on Monday the Nasdaq briefly surpassed its record closing high from Nov 2021.\nAfter the release of the inflation data, bets by traders for a rate reduction in May of at least 25 basis points dropped to 36.1 per cent, from about 58 per cent before the data, while expectations for June stood at 74.3 per cent, the CME FedWatch tool showed.\nRate-sensitive megacaps like Microsoft, Alphabet , Amazon.com and Meta Platforms fell, as yields on US Treasury notes across the board spiked to two-month highs.\nMost chip stocks such as Micron Technology, Qualcomm and Broadcom also dropped, sending the Philadelphia SE Semiconductor index down.\nReal estate, consumer discretionary utilities led losses among the 11 major S&P 500 sector indexes, with real estate falling to an over two-month low.\nThe small-cap Russell 2000 index also fell.\n“Many Federal Reserve governors have come out in the last couple of weeks and given various indications that the cuts expected by the market in the first half of the year may have been premature. Now the CPI data are certainly reaffirming that picture,” said Bob Elliott, chief investment officer at Unlimited Funds.\nThe latest data comes on the heels of a modest revision to inflation in the last quarter of 2023 that left investors briefly relieved on the trajectory of inflation.\nThe Cboe volatility index, a market fear gauge, hit its highest level since November.\nAccording to preliminary data, the S&P 500 lost 68.14 points, or 1.36 per cent, to end at 4,953.70 points, while the Nasdaq Composite lost 282.64 points, or 1.77 per cent, to 15,659.91. The Dow Jones Industrial Average fell 522.05 points, or 1.35 per cent, to 38,275.33.\nAmong top movers, JetBlue Airways soared after activist investor Carl Icahn reported a 9.91 per cent stake, adding that the carrier’s stock is “undervalued.”\nArista Networks shares fell after the cloud solutions provider forecast current-quarter adjusted gross margin below expectations, while Marriott International lost ground after the hotel operator forecast annual profit below Street expectations.\nShares of software firm Cadence Design Systems dropped following a bleak quarterly sales forecast, while toymaker Hasbro lost after a steeper-than-expected drop in holiday-quarter sales and profit.\nTripadvisor stock jumped as the online travel agency formed a special committee to evaluate deal proposals. REUTERS", "url": "https://www.straitstimes.com/business/companies-markets/wall-st-ends-sharply-lower-as-hot-inflation-sparks-sell-off"}