{"authors": [], "date_download": "2024-10-12 14:10:37", "date_modify": "2024-10-12 14:10:37", "date_publish": "2024-01-12 11:30:00", "description": "China also will have to contend with underpowered overseas economies. Read more at straitstimes.com.", "filename": "business_china-s-december-trade-consumer-prices-paint-mixed-economic-picture-at-start-of-2024_1728742237.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/12/2023-10-30T064616Z1224903055RC2T24A5J5PCRTRMADP3SOUTHKOREA-ECONOMY-TRADE-POLL.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-december-trade-consumer-prices-paint-mixed-economic-picture-at-start-of-2024_1728742237.html", "title": "China exports rise but deflation persists as economy enters 2024 on shaky footing", "title_page": "China exports rise but deflation persists as economy enters 2024 on shaky footing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China’s exports grew at a faster pace in December 2023 while deflationary pressures persisted, keeping alive expectations for more policy easing measures to shore up an economy carrying significant pockets of weakness into 2024.\nChinese policymakers could breathe a sigh of relief on signs that global trade is slowly turning the corner with the prospect of lower borrowing costs on the horizon, but a protracted property crisis, cautious consumers and geopolitical challenges point to another bumpy year for the world’s second-biggest economy.\nExports grew 2.3 per cent from a year earlier in December, customs data showed on Jan 12, compared with a 0.5 per cent increase in November and beating the 1.7 per cent boost expected in a Reuters poll.\nImports grew 0.2 per cent year on year, missing forecasts for a 0.3 per cent rise but still better than the 0.6 per cent drop a month prior.\n“The better export data is first and foremost driven by semiconductors and electronics, and the recovery on that side comes from a cyclical rebound in consumer demand overseas,” said Mr Xu Tianchen, senior economist at the Economist Intelligence Unit.\nMr Xu said the figure was also buoyed by a low statistical base since “there was severe disruption to exports last December following China’s abrupt reopening”.\nThe improved Chinese export data joins those from Germany, South Korea and Taiwan in suggesting global trade is starting to recover, after higher interest rates in the United States and Europe crimped demand over 2023.\nThe United Nations had warned of a likely contraction in goods trade by US$2 trillion (S$2.66 trillion) or 8 per cent in 2023.\nSouth Korea’s exports, a closely watched indicator of global trade, rose for a third month in December, while the latest German export data for November surprised on the upside.\nAnd yet, consumer prices in China extended their decline for a third month in December while factory-gate prices also fell, data from the National Bureau of Statistics showed, highlighting the persistence of deflationary forces in the economy.\nAnalysts also anticipate a drop in interest rates of at least 1.5 percentage points in the US and Europe in 2024, which should improve demand for imported goods.\nThe consumer price index rose 0.2 per cent in 2023 – the slowest pace since 2009 – and the full-year producer price index fell 3 per cent, marking the steepest downturn since 2015.\n“The deflationary pressure in China’s economy remains as domestic demand is still weak. The property sector continues to weigh on the economy,” said Mr Zhang Zhiwei, chief economist at Pinpoint Asset Management.\n“Exports improved on the margin... but exports as a pillar for growth in China are not strong enough to boost overall domestic demand,” he added.\nChinese policymakers also will have to contend with underpowered overseas economies, with the World Bank on Jan 9 warning that global growth is set to slow for a third year in a row.\n“New foreign orders for Chinese producers increased significantly in December, but it is not a long-term trend,” said Ms Dan Wang, chief economist at Hang Seng Bank China. REUTERS", "url": "https://www.straitstimes.com/business/china-s-december-trade-consumer-prices-paint-mixed-economic-picture-at-start-of-2024"}