{"authors": [], "date_download": "2024-10-12 14:18:07", "date_modify": "2024-10-12 14:18:07", "date_publish": "2023-06-21 12:20:00", "description": "China’s Ministry of Commerce launched a Green Cars Going Rural campaign on June 15 to promote EV adoption. Read more at straitstimes.com.", "filename": "business_china-extends-tax-breaks-for-new-energy-vehicles-until-2027_1728742687.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/21/2023-04-18T081134Z946217509RC2UG0AQUEDQRTRMADP3AUTOSHOW-SHANGHAI_3.JPG?VersionId=q2bNZkRQg7NUgbeIaJGdJtk00D0tKuWu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-extends-tax-breaks-for-new-energy-vehicles-until-2027_1728742687.html", "title": "China extends tax breaks for new energy vehicles until 2027", "title_page": "China extends tax breaks for new energy vehicles until 2027 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – China unveiled on Wednesday a 520 billion yuan (S$97 billion) package to boost sales of electric vehicles (EVs) and other green cars over the next four years to prop up softening car demand, sending shares of automakers sharply higher.\nThe package, widely expected after an earlier government pledge to promote the industry, comes as softening sales in the world’s biggest car market has raised concern over economic growth which is losing momentum after a brisk start to the year.\nNew energy vehicles (NEVs) purchased in 2024 and 2025 will be exempted from purchase tax amounting to as much as 30,000 yuan per vehicle, with the exemption halving for purchases made in 2026 and 2027, the Ministry of Finance said in a statement.\nThe total tax breaks will amount to 520 billion yuan, Vice-Minister of Finance Xu Hongcai said at a press conference.\nShares in industry leaders shifted higher, with BYD gaining as much as 1.5 per cent following three days of losses. Li Auto added more than 3 per cent in Hong Kong, while Nio climbed as much as 6.1 per cent. Top battery maker Contemporary Amperex Technology rose 1.1 per cent before paring its gain to just 0.1 per cent as of 10.46am, Singapore time.\nThe announcement follows a June 2 Cabinet meeting during which the authorities said they would extend and optimise the tax exemption and study policies to promote NEV development.\nThe incentives put NEVs, a mainstay of big-ticket spending, on the front burner of a broad-based push to rekindle growth in the world’s second-largest economy.\nThe government heavily promoted NEVs in recent years to curb air pollution, through incentives that supported the rise of local players such as Li Auto, Nio and BYD.\nNEV sales suffered a hit earlier in 2023 after the government ended a more than decade-long subsidy for EV purchases, but bounced back after automakers including Tesla cut prices to defend market share and after the previous extension of the purchase tax exemption.\nWednesday’s announcement is the fourth extension. The tax break was announced in 2014 and extended in 2017, 2020 and 2022.\nChina’s Ministry of Commerce launched a Green Cars Going Rural campaign last Thursday to promote EV adoption, particularly in the countryside, while the State Council and other agencies have called for stabilising car consumption and building charging infrastructure.\nDeliveries of EVs and plug-in hybrids in China rose about 41 per cent from January through May, according to the country’s Passenger Car Association, much slower than the 120 per cent growth for the same five-month period of 2022.\nNew cars are generally subject to 10 per cent sales tax, but that has not applied to clean-energy vehicles since 2014, a policy recently extended through 2023. Wednesday’s announcement pushes that date back to the end of 2025 for clean cars under 300,000 yuan that do not seat more than nine people, while cars under 150,000 yuan will get further support to the end of 2027. REUTERS, BLOOMBERG", "url": "https://www.straitstimes.com/business/china-extends-tax-breaks-for-new-energy-vehicles-until-2027"}