{"authors": [], "date_download": "2024-10-12 14:11:30", "date_modify": "2024-10-12 14:11:30", "date_publish": "2023-11-01 12:45:00", "description": "Analysts say more supportive measures will be needed in major cities to sustain the recovery. Read more at straitstimes.com.", "filename": "business_chinas-new-home-prices-rise-for-second-month-in-oct-survey_1728742290.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/01/CHINA-ECONOMY-PROPERTY-EVERGRANDE-090831.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_chinas-new-home-prices-rise-for-second-month-in-oct-survey_1728742290.html", "title": "China's new home prices rise for second month in Oct: Survey", "title_page": "China's new home prices rise for second month in Oct: Survey | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China’s new home prices rose for a second straight month in October, private sector data showed on Wednesday, but analysts say more supportive measures will be needed in major cities to sustain the recovery.\nPrices rose 0.07 per cent on average month on month, widening an increase of 0.05 per cent in September, according to a survey by the China Index Academy, a real estate research firm.\nNew home sales measured by floor area fell around 10 per cent in October, narrowing a 20 per cent slump in September, the firm said.\nWhile the property recovery is still fragile, China Index Academy said support policies have increased with more steps expected, including easing home purchase curbs and reducing down payment ratios, mortgage rates and transaction taxes in some major cities.\nThe property sector, once a pillar of the world’s second-biggest economy, has been in a liquidity crisis since 2021.\nThis has rattled global markets and prompted a slew of measures in recent months to reassure investors and home owners.\nChina vowed to satisfy all developers’ reasonable financing needs regardless of ownership, with “equal treatment”, according to the Central Financial Work Conference – a twice-a-decade policy meeting – which concluded on Tuesday.\nChina Evergrande, which has more than US$300 billion (S$410.47 billion) of liabilities, is trying to stave off liquidation by revising its debt restructuring plan.\nEvergrande defaulted on its offshore debt in late 2021, becoming the poster child of a debt crisis that has since engulfed China’s property sector.\n“The latest remarks from the National Financial Work Conference offer no surprise, with no new concrete measures to mitigate sector risk. We stay cautious on the sector,” economists at JPMorgan said in a research note. REUTERS", "url": "https://www.straitstimes.com/business/chinas-new-home-prices-rise-for-second-month-in-oct-survey"}