{"authors": ["Colin Tan"], "date_download": "2024-10-12 13:47:07", "date_modify": "2024-10-12 13:47:07", "date_publish": "2023-06-12 22:10:47", "description": "UBS and Credit Suisse will continue to operate in Singapore under separate licences. Read more at straitstimes.com.", "filename": "business_banking_ubs-credit-suisse-operations-in-s-pore-to-continue-without-interruption-after-takeover-mas_1728740827.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/12/10686609_6.jpg?VersionId=MvvLyQrpX4pxmxxgJdPQLY_VWNLeBejn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking_ubs-credit-suisse-operations-in-s-pore-to-continue-without-interruption-after-takeover-mas_1728740827.html", "title": "UBS takeover of Credit Suisse: Both banks’ operations in S’pore to continue uninterrupted, says MAS", "title_page": "UBS takeover of Credit Suisse: Both banks’ operations in S’pore to continue uninterrupted, says MAS | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Daily operations at both UBS and Credit Suisse in Singapore will continue uninterrupted, said the Monetary Authority of Singapore (MAS), after UBS’ takeover of its troubled rival was legally completed on Monday.\nBoth banks, whose main businesses here are private banking and investment banking, have “put in place governance structures to monitor and facilitate the orderly integration of the Singapore operations”, said the authority.\nUBS and Credit Suisse will continue to operate in Singapore under separate licences, it said in a statement on Monday.\nUBS had agreed to acquire Credit Suisse in March in a deal orchestrated by the Swiss authorities in a bid to shore up customer confidence.\nThe three billion Swiss franc (S$4.4 billion) acquisition was completed in under three months, with the combined entity expected to reach US$5 trillion (S$6.7 trillion) in assets.\n“This is the start of a new chapter – for UBS, Switzerland as a financial centre and the global financial industry,” UBS chief executive Sergio Ermotti and chairman Colm Kelleher said in an open letter published in Swiss newspapers.\nBut Mr Ermotti also warned that the coming months will be “bumpy” as UBS gets on with absorbing Credit Suisse, a process UBS has said will take three to five years, reported Reuters.\nThe completion of the merger marks the end of Credit Suisse’s 167-year history, marred in recent years by scandals and losses.\nMeanwhile, MAS said it had conveyed its expectations for both banks to handle the staffing issue in Singapore responsibly, and will be closely monitoring the implications on jobs.\n“The banks are working out the details of the manpower implications. MAS will work with relevant stakeholders to proactively address any impact on employment,” it said.\nJointly, the two banks have some 120,000 staff worldwide, and their combined headcount in Singapore is estimated to be around 7,500.\nUBS had said it would be cutting jobs to reduce costs. Mr Ermotti told Swiss broadcaster SRF on Monday that around 10 per cent of Credit Suisse staff had already left the company before its takeover by his bank.\nUBS also unveiled a slew of leadership changes on Monday, which will see a number of top Credit Suisse executives leaving, while others will take on lesser roles.\nOnly a fifth of the 160 leadership positions in the combined bank are coming from Credit Suisse, according to Bloomberg.\nUBS’ key wealth division will also see several changes, including the hiring of Singaporean Young Jin Yee as co-head of the bank’s global wealth management for the Asia-Pacific. She had worked at Credit Suisse for almost 20 years before joining Deutsche Bank.\nUBS noted that it had been attracting talent, with senior hires understood to be up by 20 per cent to 30 per cent in 2023 since it announced the acquisition.\nMAS said it is in close contact with its Swiss counterpart, the Financial Market Supervisory Authority, which said in a statement on Monday that the legal completion of the takeover will bring clarity and stability for the banks, as well as for the banks’ clients.", "url": "https://www.straitstimes.com/business/banking/ubs-credit-suisse-operations-in-s-pore-to-continue-without-interruption-after-takeover-mas"}