{"authors": [], "date_download": "2024-10-12 14:16:32", "date_modify": "2024-10-12 14:16:32", "date_publish": "2023-10-02 08:20:00", "description": "Sluggish external demand is weighing on China's manufacturing outlook even as output increases. Read more at straitstimes.com.", "filename": "business_china-s-factory-activity-recovery-slows-in-september-caixin-pmi_1728742592.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/02/CHINA-ECONOMY-091543.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-factory-activity-recovery-slows-in-september-caixin-pmi_1728742592.html", "title": "China’s factory activity recovery slows in September: Caixin PMI", "title_page": "China’s factory activity recovery slows in September: Caixin PMI | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China’s factory activity expanded at a slower pace in September, a private-sector survey showed on Sunday, with sluggish external demand weighing on the outlook even as output increased.\nThe Caixin/S&P Global manufacturing purchasing managers’ index (PMI) fell to 50.6 in September from 51 in the previous month, missing analysts’ forecasts of 51.2. The 50 index point mark separates growth from contraction.\nThe world’s second-largest economy is showing some signs of stabilising after a flurry of modest policy measures, but the outlook is clouded by a property slump, falling exports and high youth unemployment.\nThe survey comes a day after China released its official PMI, which showed that factory activity expanded for the first time in six months in September, adding to the run of indicators suggesting the economy has begun to bottom out.\nAccording to the Caixin PMI, factory output and new orders remained in expansionary territory in September. However, external demand remained weak, with the export orders index contracting for the third month.\n“The economic recovery has yet to find a solid footing, with insufficient domestic demand, external uncertainties and pressure on the job market,” said senior economist Wang Zhe at Caixin Insight Group.\nFactory owners’ confidence for the year ahead hit a 12-month low. Producers of consumer, investment and intermediate goods all cut staff, the survey showed.\nInput costs rose at the fastest pace since January due to rising prices of chemicals, crude oil and industrial metals.\nChinese policymakers face a daunting task of reviving stalled economic growth, with analysts calling for more aggressive steps on top of the piecemeal support of recent months.\n“The implementation and effectiveness of the economic stabilisation policies should be the next focus of attention,” said Dr Wang. “More effort may be needed to increase employment and income.”\nTo support growth, the central bank in September cut the amount of cash that banks must hold as reserves.\n“We do not anticipate substantial fiscal or monetary stimulus by the Chinese authorities in the coming months,” said S&P Global Ratings in a research note. “While muted policy stimulus means more pain in store for corporates and banks, it also shows China continues to move away from unproductive debt-fuelled growth.”\nA separate PMI released by Caixin/S&P Global on Sunday showed that China’s services activity expanded at the slowest pace this year in September. REUTERS", "url": "https://www.straitstimes.com/business/china-s-factory-activity-recovery-slows-in-september-caixin-pmi"}