{"authors": [], "date_download": "2024-10-12 14:08:11", "date_modify": "2024-10-12 14:08:11", "date_publish": "2024-07-12 07:13:00", "description": "ANZ on July 11 conceded there had been an “issue in our bond trading data reporting processes”. Read more at straitstimes.com.", "filename": "business_trading-scandal-engulfs-anz-s-markets-unit-as-ceo-starts-probe_1728742091.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/2024-07-04T075041Z1072086434RC24Q7ATTSO5RTRMADP3ANZ-GROUP-BLACKSTONE-DE-FUND.JPG?VersionId=P9CWI7JHTUdiSqLb2VhMlc5vGlgxOaHD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_trading-scandal-engulfs-anz-s-markets-unit-as-ceo-starts-probe_1728742091.html", "title": "Trading scandal engulfs ANZ’s markets unit as CEO starts probe", "title_page": "Trading scandal engulfs ANZ’s markets unit as CEO starts probe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY - ANZ Group Holdings bosses are battling to contain the fallout from a string of scandals as the Australian banking giant grapples with one of the toughest periods in recent years.\nChief executive officer Shayne Elliott and his key lieutenant Mark Whelan told staff on July 11 that action will be taken if any evidence of wrongdoing is found after fresh allegations emerged of it inflating bond trading data. ANZ has hired external lawyers to help investigate the claims as well as to look into workplace culture in its markets unit, which falls under the Whelan-led institutional division.\n“We have been working rigorously on these matters for several months and as you would expect we are treating them with the utmost seriousness,” Mr Elliott and Mr Whelan wrote in a memo to staff on July 11. A spokesperson for ANZ confirmed the contents of the memo.\nAt issue is whether ANZ overstated the value of government bonds that it traded in order to win more business on future sales. The Australian Securities and Investments Commission (Asic) is already investigating the bank’s execution of a 10-year Treasury sale in 2023 and its role as a risk manager.\n“Banking history has been fraught with scandals, but what’s come to light seems more like misconduct than mistake,” said Ms Anna Milne, senior investment analyst at Wilson Asset Management.\nANZ on July 11 conceded that there had been an “issue in our bond trading data reporting processes”. The lender overstated the value of Australian government bonds that it traded by more than A$50 billion (S$45.4 billion) during a one-year period, the Australian Financial Review has reported.\nMr Anshul Sidher was appointed managing director for the markets division in August last year and has continued to be based in Singapore. He has been with ANZ for more than 12 years and previously held roles at Barclays and Dresdner Kleinwort. Mr Sidher reports to Mr Whelan, a two-decade-plus veteran of the firm who has led the bank’s institutional business since 2016.\nANZ shares fell 1.2 per cent on July 11. Domestic rivals Commonwealth Bank of Australia, Westpac Banking and National Australia Bank all closed higher.\nANZ’s institutional division posted record profit in the last financial year, with transaction banking, corporate finance, and the markets unit all generating more than A$2 billion each in revenue.\nStill, the outlook for Australian lenders is souring amid fierce competition in mortgage lending along with emerging private credit competitors in commercial loans. With benchmark interest rates sitting near their peak, analysts are predicting net income will fall for all four of the country’s major banks, according to data compiled by Bloomberg.\nThe matter “might deal a serious blow to ANZ’s reputation, shaking investor confidence to the core,” said Mr Junvum Kim, a senior sales trader at Saxo Capital Markets in Singapore. There’s the potential for “hefty penalties from Asic looming large”. BLOOMBERG", "url": "https://www.straitstimes.com/business/trading-scandal-engulfs-anz-s-markets-unit-as-ceo-starts-probe"}