{"authors": [], "date_download": "2024-10-12 13:27:58", "date_modify": "2024-10-12 13:27:58", "date_publish": "2024-01-15 20:50:00", "description": "Wilmar’s Yihai Kerry Arawana Holdings said that one of its units had been sued in Anhui, China Read more at straitstimes.com.", "filename": "business_companies-markets_wilmar-unit-denies-involvement-in-alleged-china-palm-oil-fraud_1728739678.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/15/2022040665226390bdabcfef-1fd4-47d4-86e8-0930a99cdb59.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_wilmar-unit-denies-involvement-in-alleged-china-palm-oil-fraud_1728739678.html", "title": "Wilmar unit denies involvement in alleged China palm oil fraud", "title_page": "Wilmar unit denies involvement in alleged China palm oil fraud | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GUANGZHOU – Wilmar International said on Jan 16 that it has zero tolerance for corrupt practices and does not condone any such acts by any of its employees or office holders after its China subsidiary denied involvement in an alleged palm oil fraud.\nThe Shenzhen-listed subsidiary, Yihai Kerry Arawana Holdings, had on Jan 12 denied allegations by a city prosecution agency that one of its units was partially accountable for a trade fraud that led to a 5.2 billion yuan (S$977 million) loss for a state-owned company.\nYihai Kerry said one of its units had been sued in the eastern province of Anhui over its alleged role in loss-making palm oil trades between a state-owned trader and a privately owned counterparty. The company, one of China’s top food processors, said it was not involved in the fraud.\nChinese commodity trading has been hit by a series of scandals in recent years, including cases where fraudulent financial documents and warehouse receipts were used as proof of collateral and credit. The filing by the unit of Singapore-listed Wilmar, co-founded by billionaire Kuok Khoon Hong, gives a rare insight into commodity trading in the world’s largest consumer.\nThe case focuses on state-owned trader Anhui Whywin International and its palm oil deals with private feed trader Yunnan Huijia Import and Export, according to the indictment cited in the filing. The prosecutor alleges that Huijia used forged documents to obtain palm oil deliveries from Whywin without paying the full amounts, the indictment said. The prosecutor alleges that the Yihai Kerry unit was also involved in the case.\nYihai Kerry said all transactions conducted by its Guangzhou unit in the trades were in compliance with normal practices and contractual agreements. The company did not obtain any improper benefit from Huijia, nor did it participate in the alleged fraud against Whywin, according to the filing. BLOOMBERG", "url": "https://www.straitstimes.com/business/companies-markets/wilmar-unit-denies-involvement-in-alleged-china-palm-oil-fraud"}