{"authors": [], "date_download": "2024-10-12 14:04:17", "date_modify": "2024-10-12 14:04:17", "date_publish": "2022-12-01 13:47:14", "description": "Supply-chain disruptions and trade tensions with China have fueled efforts to bring more manufacturing to the US and Europe. Read more at straitstimes.com.", "filename": "business_tsmc-plans-to-make-more-advanced-chips-in-us-at-urging-of-apple_1728741857.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/01/2022-11-09T070833Z93992355RC26IX9MRHZWRTRMADP3TSMC-ARIZONA_1.JPG?VersionId=CuWOp1O9VfgCRDbwvoP9Rz7UMUMWPMG2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_tsmc-plans-to-make-more-advanced-chips-in-us-at-urging-of-apple_1728741857.html", "title": "TSMC plans to make more advanced chips in US at urging of Apple", "title_page": "TSMC plans to make more advanced chips in US at urging of Apple | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAN FRANCISCO - Taiwan Semiconductor Manufacturing Co (TSMC) will offer advanced 4-nanometer chips when its new US$12 billion (S$16 billion) plant in Arizona opens in 2024, an upgrade from its previous public statements, after US customers such as Apple pushed the company to do so, according to sources familiar with the matter.\nTSMC is expected to announce the new plan when US President Joe Biden and Commerce Secretary Gina Raimondo visit Phoenix for a ceremony next Tuesday, said the sources, who asked not to be identified because the matter is private.\nThe TSMC factory had been slated to make 5-nanometer semiconductors, a standard that will be far from the cutting edge by 2024. The Taiwanese company also will commit to adding a second nearby plant, which will make even more advanced 3-nanometer chips, the sources said.\nTSMC previously said it would make 20,000 wafers a month at the Arizona facility, although production may increase from those original plans, the sources said. Apple will use about a third of the output as production gets under way.\nApple and other major technology companies rely on TSMC for their chipmaking needs, and the change means they will be able to get more of their processors from the United States. Apple chief executive Tim Cook has previously told employees that his company plans to source chips from the Arizona plant. He is scheduled to attend the event next week, the sources said.\nSupply chain disruptions and trade tensions with China have fuelled efforts to move more manufacturing to the US and Europe. US lawmakers also passed the Chips and Science Act in 2022, offering US$50 billion in incentives for companies looking to create semiconductors in the country. TSMC is likely to receive billions in subsidies.\nThe possibility of China taking over Taiwan also has sparked concerns about relying on that region for so much of the semiconductor industry’s current supply. TSMC, headquartered on the island, is the world’s go-to supplier for chips powering everything from smartphones to electric vehicles. Most of its production is still centralised in Taiwan.\nIn addition to Apple, TSMC customers like Advanced Micro Devices and Nvidia have asked the Taiwanese company to make more sophisticated chips at the Arizona plant, according to sources familiar with the discussions.\nTSMC’s customers have asked the company to roll out its latest technologies simultaneously in the US and Taiwan, the sources said, which would help fulfil a Biden administration goal of having the most cutting-edge chips in the world produced on US soil. But TSMC has not committed to that approach, and Taiwanese and company officials have said that they intend to keep the latest technology at home. BLOOMBERG", "url": "https://www.straitstimes.com/business/tsmc-plans-to-make-more-advanced-chips-in-us-at-urging-of-apple"}