{"authors": [], "date_download": "2024-10-12 14:11:29", "date_modify": "2024-10-12 14:11:29", "date_publish": "2023-10-30 12:17:00", "description": "Evergrande’s saga injects more uncertainty into China’s property debt crisis. Read more at straitstimes.com.", "filename": "business_evergrande-liquidation-hearing-delayed-again-to-dec-4_1728742289.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/30/RTRMADP3CHINA-PROPERTY-DEBT-EVERGRANDE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_evergrande-liquidation-hearing-delayed-again-to-dec-4_1728742289.html", "title": "Evergrande liquidation hearing delayed again to Dec 4", "title_page": "Evergrande liquidation hearing delayed again to Dec 4 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – China Evergrande Group, the world’s most indebted developer, got a final chance to get what could be the nation’s biggest-ever restructuring back on track, as a Hong Kong court adjourned a winding-up hearing.\nThe decision was made by Justice Linda Chan in Hong Kong’s High Court on Monday to adjourn the hearing to Dec 4, the latest in a series of delays since the proceedings began in 2022.\n“This is really the last adjournment,” Judge Chan said.\nEvergrande shares, which trade as a penny stock, pared earlier losses of as much as 23 per cent to 14 per cent as at 10.35am in Hong Kong on Monday.\nLiquidation risks rose recently after a shock from Evergrande late in September, when it scrapped creditor meetings at the last minute and said it must reassess its proposed restructuring plan.\nAny eventual winding-up would make Evergrande, with about 2.39 trillion yuan (S$456.8 billion) of liabilities, the biggest Chinese developer to ever face such a fate.\nEvergrande’s reassessment of its proposed restructuring plan prompted an ad-hoc group of creditors – who hold more than US$6 billion (S$8.2 billion) of the builder’s about US$19 billion of offshore notes – to say they were “left in the dark”.\nJust days before the hearing, the bloc had yet to decide whether it would speak out against the winding-up request despite having done so previously.\nEvergrande’s saga injects more uncertainty into China’s property debt crisis as it heads into its fourth year amid record defaults.\nThe problems for the industry began in 2020 when the authorities laid out “three red lines”, which set leverage benchmarks for builders if they wanted to borrow more money. By the end of the following year, Evergrande had defaulted.\nThe liquidation hearing originates from a wind-up lawsuit filed by a creditor, Top Shine Global Limited of Intershore Consult (Samoa), who was a strategic investor in Evergrande’s online sales platform.\nThe Hong Kong court has issued at least three winding-up orders for Chinese developers since the nation’s property debt crisis began, despite thorny jurisdictional issues and China’s interest in keeping developers afloat to ensure homebuyers get the houses they have paid for.\nThe fate of the builder and even bigger peer Country Garden Holdings – deemed in default for the first time in recent days – is of broader significance to an economy where the property market and related industries account for about 20 per cent of gross domestic product.\nAs the real estate crisis came to threaten worse contagion, the authorities have recently taken steps to fine-tune policy, including a broad relaxation of down payment requirements for homes and cuts to some mortgage rates.\nBut that has not been enough to turn things around: Property investment contracted 9.1 per cent in the first nine months of 2023.\nAny liquidation may not necessarily lead to an immediate suspension of Evergrande’s construction work, housing delivery and other activities.\nAfter any order, the court could appoint a liquidator, who would seize control from directors and management to make major business decisions and seek gains for creditors from existing assets.\nThat is not an easy process in dealing with Chinese developers.\nMost Evergrande projects are operated by local units, which could be hard for the offshore liquidator to seize.", "url": "https://www.straitstimes.com/business/evergrande-liquidation-hearing-delayed-again-to-dec-4"}