{"authors": [], "date_download": "2024-10-12 14:08:44", "date_modify": "2024-10-12 14:08:44", "date_publish": "2023-03-22 08:29:22", "description": "NEW YORK – Roger Ng, the only Goldman Sachs Group banker tried and convicted in the global 1Malaysia Development Berhad (1MDB) scandal, asked a judge to let him serve his 10-year prison term in a facility in Danbury, Connecticut – the same one where hotel magnate Leona Helmsley was imprisoned for tax evasion in the early 1990s. Read more at straitstimes.com.", "filename": "business_banking_ex-goldman-banker-ng-seeks-celebrity-prison-for-1mdb-fraud_1728742124.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/22/2023-03-09T194111Z1543720094RC2JQZ95HNV8RTRMADP3GOLDMAN-SACHS-1MDB_2.JPG?VersionId=1.o8n8JCG8XYVreca50Sd11j.hhbrlgK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_banking_ex-goldman-banker-ng-seeks-celebrity-prison-for-1mdb-fraud_1728742124.html", "title": "Ex-Goldman banker Ng seeks celebrity prison for 1MDB fraud", "title_page": "Ex-Goldman banker Ng seeks celebrity prison for 1MDB fraud | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Roger Ng, the only Goldman Sachs Group banker tried and convicted in the global 1Malaysia Development Berhad (1MDB) scandal, asked a judge to let him serve his 10-year prison term in a facility in Danbury, Connecticut – the same one where hotel magnate Leona Helmsley was imprisoned for tax evasion in the early 1990s.\nNg’s lawyer Marc Agnifilo asked US District Judge Margo Brodie in a letter that she recommend the “lowest-possible designation” at the low-security federal prison for his client.\nNg requires mental health treatment because he suffers from post-traumatic stress disorder after he was jailed in a squalid Malaysian prison for six months before being extradited to the United States for trial, Mr Agnifilo wrote.\nThe federal institution is about 90km from New York City, and served as the inspiration for the women’s prison in Netflix’s television series Orange Is The New Black.\nAmong those who served time there were reality TV star Teresa Giudice and singer Lauryn Hill.\nConvicted sex trafficker Ghislaine Maxwell had also asked to serve her 20-year sentence in Danbury, but was instead sent to a Florida prison.\nNg, 51, a Malaysian national, was convicted in April of conspiring to violate US anti-bribery laws and taking part in a money laundering scheme. His former Goldman boss and 1MDB co-conspirator, Tim Leissner, previously pleaded guilty and was the government’s star witness against Ng.\nLeissner is scheduled to be sentenced in September.\nThe looting of billions of dollars from the 1MDB fund was allegedly masterminded by Jho Low, a Malaysian financier who is now a fugitive.\nHe is accused of paying tens of millions of dollars to officials in Malaysia and Abu Dhabi to clinch bond deals arranged by Goldman, while pocketing US$1.42 billion (S$1.91 billion). BLOOMBERG", "url": "https://www.straitstimes.com/business/banking/ex-goldman-banker-ng-seeks-celebrity-prison-for-1mdb-fraud"}