{"authors": [], "date_download": "2024-10-12 14:08:05", "date_modify": "2024-10-12 14:08:05", "date_publish": "2022-09-06 23:49:25", "description": "Ukraine has said it will take at least US$750 billion (S$1 trillion) to rebuild after Russia's invasion. Read more at straitstimes.com.", "filename": "business_companies-markets_zelensky-urges-investment-in-ukraine-at-us-stock-exchange-opening_1728742085.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/06/US-URKAINE_S-PRESIDENT-ZELESNKY-VIRTUALLY-RINGS-OPENING-BELL-OF--144019.jpg?VersionId=X3YS1o5XxLbNDVqgN4gJ_fxWIx3JbJLQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_zelensky-urges-investment-in-ukraine-at-us-stock-exchange-opening_1728742085.html", "title": "Ukraine’s Zelensky ‘rings’ NYSE bell, seeks US$400b in foreign investment", "title_page": "Ukraine’s Zelensky ‘rings’ NYSE bell, seeks US$400b in foreign investment | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV/NEW YORK – Ukraine’s President Volodymyr Zelensky remotely rang the opening bell at the New York Stock Exchange on Tuesday as his nation appealed for billions of dollars in private investment to rebuild factories and industries destroyed by Russia.\nZelensky’s government launched a platform of over 500 projects worth US$400 billion (S$560 billion) for foreign companies and private investors to help rebuild Ukraine’s economy, even as the war with Russia drags on.\nZelensky appeared on a video screen behind the platform overlooking the NYSE floor where the opening bell is traditionally rung. Traders applauded and whooped while a banner read: “We are free. We are strong. We are open for business.”\nFresh from a roundtable with top executives from JP Morgan , Pfizer, and other US companies, Zelensky said in English that Ukraine was already rebuilding its economy, more than six months since the Russian invasion began.\n“ Ukraine is the story of a future victory and a chance for you to invest now in projects worth hundreds of billions of dollars to share the victory with us,” he said.\nUkraine is also appealing for some US$5 billion in international aid each month to keep its economy running, in addition to military aid from Nato alliance members.\nThe United States and allies in Europe and Asia have already sent billions in humanitarian aid, weapons and other security spending, and officials are watching closely for any signs domestic political support could be flagging.\nJust over half of Americans said the United States should support Ukraine until Russia withdraws, a recent Reuters/Ipsos poll showed.\n‘Invest now’\n“Advantage Ukraine,” the investment push, focuses on 10 key sectors, including the military-industrial complex, energy, pharmaceuticals, metallurgy, woodworking, and logistics.\n“It is necessary to invest in Ukraine now, and not wait for the end of the war,” Economy Minister Yulia Svyrydenko said in a statement.\nAdvertising group WPP is leading the marketing campaign for the initiative.\nSvyrydenko told Reuters last month that Ukraine’s economy should stabilise over the coming year and expand by as much as 15.5 per cent in 2023, after a likely contraction of 30-35 per cent this year.", "url": "https://www.straitstimes.com/business/companies-markets/zelensky-urges-investment-in-ukraine-at-us-stock-exchange-opening"}