{"authors": [], "date_download": "2024-10-12 14:14:07", "date_modify": "2024-10-12 14:14:07", "date_publish": "2022-05-27 08:05:58", "description": "The world’s most indebted developer looks to emerge from its financial woes. Read more at straitstimes.com.", "filename": "business_property_evergrande-to-sell-project-in-eastern-china-for-275-million_1728742447.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/27/md_evergrande_27052022.jpg?VersionId=zLvy8R3yD0ke6vNxR1_PBZLkq_RjF585", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_evergrande-to-sell-project-in-eastern-china-for-275-million_1728742447.html", "title": "Evergrande weighs staggered payments, debt-to-equity swaps for $26b offshore bonds: Sources", "title_page": "Evergrande weighs staggered payments, debt-to-equity swaps for $26b offshore bonds: Sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG (REUTERS) - China Evergrande Group is considering repaying offshore public bond holders owed around US$19 billion (S$26 billion) with cash instalments and equity in two of its Hong Kong-listed units, two sources said, as the world’s most indebted developer looks to emerge from its financial woes.\nEvergrande, whose entire US$22.7 billion worth of offshore debt, including loans and private bonds, is deemed to be in default after missing payment obligations late last year, said in March that it will unveil a preliminary debt restructuring proposal by the end of July.\nAs part of the proposal, Evergrande is looking to repay offshore creditors the principal and interest by turning these into new bonds, which will then be repaid in instalments over a period of seven to 10 years, said one of the sources.\nOffshore creditors will also be allowed to swap a portion of their debt into stakes in the developer’s Hong Kong-listed property services unit, Evergrande Property Services Group, and electric vehicle maker China Evergrande New Energy Vehicle Group, said the two sources.\nThe first source said up to 20 per cent of the offshore debt can be swapped into equities of those two units. The restructuring proposals are, however, at an early stage and are subject to change, the source added.\nEvergrande is reeling under more than US$300 billion in liabilities and has become the poster child of the country’s property sector crisis as it lurched from one missed payment deadline to another last year.\nThe developer’s woes quickly led to a wave of defaults in China’s property sector, a key pillar for the world’s second-largest economy, rattling investors and leading to a slump in home sales and firms struggling to access funding.\nWhile state intervention has quelled market concern over a disorderly collapse of Evergrande, which has also struggled to repay suppliers and complete projects and homes, investors are still in the dark over whether they will recoup their money.\nEvergrande, which began talks with offshore bond holders earlier this year about the restructuring proposal, aims to finalise the plan by July and sign the agreements with investors by December, said the first source.\n“(Evergrande) chairman Hui Ka Yan hopes the bond holders will accept the proposal, as there are not many assets offshore that can be sold immediately to pay off the debts,” said the source.\nIt is not immediately clear how Evergrande will be able to secure sufficient cash to implement the cash repayment plan. The company saw contracted sales plunged by 39 per cent in 2021 from the previous year.\nTwo offshore Evergrande bond holders said they were more inclined to pick the debt-to-equity swap option, as they do not hold high hopes that the developer will be able to make full repayment in cash even within a promised extended timetable.\nMost Evergrande dollar bonds had fallen below 10 cents on the dollar as at Friday morning (May 27). One of the bond holders said that most creditors, particularly the hedge funds, may prefer taking a haircut for the swap than go for extended notes.\n“The distressed funds... they just want out,” said the bond holder, adding that the views were very split in the creditors group and no consensus has been reached yet.", "url": "https://www.straitstimes.com/business/property/evergrande-to-sell-project-in-eastern-china-for-275-million"}