{"authors": ["Megan Cheah"], "date_download": "2024-10-12 14:19:59", "date_modify": "2024-10-12 14:19:59", "date_publish": "2024-05-17 07:43:00", "description": "IMF economist says geopolitical conflicts could raise volatility in global energy and food prices. Read more at straitstimes.com.", "filename": "business_singapore-s-monetary-policy-should-remain-tight-until-inflationary-pressures-recede-imf_1728742799.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/17/2024-04-15T173243Z1781822154RC2477AO4GQ9RTRMADP3IMF-WORLDBANK-USA-YELLEN.JPG?VersionId=7FrFgQMBEgqvIBZx0sTlOwxeaXdPtWN6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_singapore-s-monetary-policy-should-remain-tight-until-inflationary-pressures-recede-imf_1728742799.html", "title": "Singapore’s monetary policy should remain tight until inflationary pressures recede: IMF", "title_page": "Singapore’s monetary policy should remain tight until inflationary pressures recede: IMF | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A team from the International Monetary Fund (IMF) said at the close of its visit to Singapore that as the economy recovers amid gradual disinflation, the Republic’s monetary policy should remain tight until inflationary pressures recede.\nIMF economist Masahiro Nozaki, who led the team in discussions in Singapore from May 7 to 16, said: “The current monetary policy stance is appropriately tight and geared towards continued disinflation. However, risks to inflation remain tilted to the upside.”\nHe highlighted that intensified geopolitical conflicts could increase volatility in global energy and food prices, and that the tight labour market and accumulated cost pressures from high wage growth in the past could lead to continued inflation stickiness.\n“Once the envisaged disinflation is firmly in sight, monetary policy should be adjusted in a timely manner to address risks to price stability, continued to be guided by data and articulated through clearly communicated policy decisions,” he added.\nIMF usually holds yearly talks with its members through a staff team that visits the country, collects economic and financial information, and discusses with officials the country’s economic developments and policies.\nMr Nozaki, who is mission chief and deputy division chief at the IMF, said Singapore’s growth gained momentum in the second half of 2023, following a moderation in the first half. This growth was supported by improved global demand for semiconductors and a rebound in tourism.\nLabour market conditions eased in 2023 amid weaker gross domestic product (GDP) growth, he said. While nominal wage growth slowed in the fourth quarter of 2023, unemployment remained low.\nThe IMF team projects that Singapore’s GDP will recover to 2.1 per cent in 2024, from 2023’s 1.1 per cent, on the back of “continued recovery” in sectors such as manufacturing, tourism and consumer-facing services.\nThis projection keeps to the 2.1 per cent full-year growth projection that the IMF made in its World Economic Outlook 2024 report released in April.\nMr Nozaki said headline inflation and Monetary Authority of Singapore (MAS) core inflation are expected to moderate to 3 per cent in 2024. MAS core inflation is projected to stabilise around 2 per cent by 2025.\nExternal factors, such as a steeper-than-projected slowdown in China, a prolonged tight US monetary policy and deeper geo-economic fragmentation are the main risks to Singapore’s growth outlook, he said.\n“On the other hand, stronger global growth would have positive spillovers to Singapore,” he added.\nHe found the 2024 Budget’s implied “broadly neutral fiscal stance” to be appropriate, complementing the Republic’s tight monetary policy stance aimed at achieving price stability.\nWith a balanced budget anchoring public finance and fiscal institutions, Singapore is “well positioned” to address future downside risks and spending needs, which could arise from the rapidly ageing population, the need to raise productivity and climate-change risks, he added.\nHe described Singapore’s financial sector as sound, having been supported by solid capital and liquidity buffers. In particular, he noted that non-bank financial institutions have “weathered a rise in interest rates well”.\nMr Nozaki cautioned, however, that a tight macroprudential policy stance would still be required, even as risks are well contained for now. A macroprudential policy aims to preserve financial stability in a country by, for example, stepping up the resilience of the financial system.\n“Continued maintenance of adequate provisioning buffers, rigorous stress testing and prudent risk-management practices across banks will help navigate external shocks,” he said.\nThe IMF welcomed reforms introduced in the Forward Singapore initiative, which aims to further strengthen social safety nets and healthcare and pension systems, as well as boost lifelong learning programmes.", "url": "https://www.straitstimes.com/business/singapore-s-monetary-policy-should-remain-tight-until-inflationary-pressures-recede-imf"}