{"authors": [], "date_download": "2024-10-12 14:12:22", "date_modify": "2024-10-12 14:12:22", "date_publish": "2024-04-23 08:56:00", "description": "But growing competition threatens to take out some of the weaker players. Read more at straitstimes.com.", "filename": "business_china-s-bubble-tea-boom-creates-a-half-dozen-billionaires_1728742342.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/23/Mixue1.jpg?VersionId=FrzzJmucZyhH_YBuyYLc0jsAnuqRyTyK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-s-bubble-tea-boom-creates-a-half-dozen-billionaires_1728742342.html", "title": "China’s bubble tea boom a brew for billionaires", "title_page": "China’s bubble tea boom a brew for billionaires | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Are you a fan of bubble tea? Love it or hate it, the passion for the drink has created at least six billionaires in China in the past few years and is at the heart of several other potential fortunes.\nSichuan Baicha Baidao Industrial, China’s No. 3 bubble tea chain, this week raised about HK$2.59 billion (S$450 million) in Hong Kong’s biggest new share sale since November. The valuation gives its husband-and-wife founders, Mr Wang Xiaokun and Ms Liu Weihong, a combined net worth of US$2.7 billion (S$3.7 billion) based on the 73 per cent stake they will own after the initial public offering (IPO), according to the Bloomberg Billionaires Index.\nDespite Baicha Baidao’s confidence, the market debuts of several other Chinese bubble tea makers that have hinted at Hong Kong IPOs are in limbo. Growing competition threatens to take out some of the weaker players, and Hong Kong – once among the busiest venues for deals – has lost its appeal as shares have slumped in China’s economic downturn. Baicha Baidao shares plunged more than 31 per cent in their trading debut in Hong Kong on April 23, underscoring the challenges the financial hub is facing in reviving investor confidence. The shares ended the day at HK$12.80, 26.86 per cent lower than the IPO price.\n“The market is not giving this sector as lofty valuations as before,” said Mr Kenny Ng, a strategist at Everbright Securities International. “There has been an uneven revival of consumption in mainland China, so the profitability of consumer businesses remains uncertain.”\nBubble tea was invented in Taiwan in the late 1980s, with small stalls selling it near schools and offices. As the trend started to take root in Hong Kong and mainland China in the 1990s, chains began springing up. Today, thousands of brands vie for the attention of thirsty tea lovers across China, and countless shops have popped up in the United States and Europe, although the biggest Chinese providers do not sell there – yet.\nBaicha Baidao, also known as Chabaidao (“100 varieties of tea”), was built on serving price-conscious fans of the stuff. The founders opened their first outlet in 2008, a 20 sq m shop near a middle school in Chengdu. In 2018, they introduced a franchise model that turbocharged growth, and today, the company has more than 8,000 shops across China. In January, Baicha Baidao opened an outlet in Seoul, its first outside China, and at home, it introduced its first coffee shop, Coffree.\nBaicha Baidao’s stores have long sold a half-litre serving of bubble tea for a bit more than US$2, while the industry average until recently was closer to US$5. The strategy has paid off, with sales jumping more than 56 per cent between 2021 and 2023 to 5.7 billion yuan (S$1.1 billion), according to Baicha Baidao’s IPO prospectus.\nTwo other bubble tea billionaires are brothers Zhang Hongchao and Zhang Hongfu, who in 1997 founded Mixue Bingcheng in Henan province. The Mixue Group calls itself the world’s second-largest drink chain after Starbucks by number of stores, with more than 32,000 outlets across China and 4,000 in 11 other countries, mostly nearby.\nAfter a 2020 cash infusion from investors, including the venture arm of Chinese food delivery giant Meituan and Hillhouse Investment Management, the tea maker was valued at 23.3 billion yuan, pushing the net worth of each brother to US$1.5 billion, according to the Bloomberg Billionaires Index.\nWith China’s economy slowing and inflation-weary consumers tightening their belts, more producers are cutting prices. Guming Holdings – China’s second-largest player, with some 9,000 stores – and No. 4 Auntea Jenny (Shanghai) Industrial, which have also filed IPO documents in Hong Kong, now charge less than US$3.50 per cup.\nHigher-end tea makers such as Nayuki Holdings – an 1,800-store chain that went public in Hong Kong three years ago – have suffered from the rapid growth of cheaper rivals. Nayuki, which reduced the price of a cup to about US$2.50, has seen its shares tumble almost 90 per cent since their listing on concerns over competition, and its once-billionaire founders, Ms Peng Xin and husband Zhao Lin, are now worth less than US$300 million, down from US$2.2 billion in 2021.\n“I’m optimistic about the prospects of the industry leaders,” said Mr Steven Nie, an analyst at Daiwa Capital Markets. “But the fresh tea drinks sector is getting too crowded.” BLOOMBERG", "url": "https://www.straitstimes.com/business/china-s-bubble-tea-boom-creates-a-half-dozen-billionaires"}