{"authors": ["Kang Wan Chern"], "date_download": "2024-10-12 13:31:24", "date_modify": "2024-10-12 13:31:24", "date_publish": "2024-06-17 05:00:00", "description": "The returns are expected to vary, with the risks from climate change running high. Read more at straitstimes.com.", "filename": "business_gic-sees-opportunities-to-invest-in-greener-environment-even-as-risks-from-climate-change-rise_1728739884.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/17/HENG8322a.jpg?VersionId=KfdhO7YwgLBHZLI3tcReKtZEfug36wEj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_gic-sees-opportunities-to-invest-in-greener-environment-even-as-risks-from-climate-change-rise_1728739884.html", "title": "GIC sees opportunities to invest in greener environment even as risks from climate change rise", "title_page": "GIC sees opportunities to invest in greener environment even as risks from climate change rise | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Sovereign wealth fund GIC continues to see long-term opportunities from investing in sustainable assets and helping the world reduce carbon dioxide emissions.\nThis comes as extreme weather events like floods, cyclones and wildfires linked to rising temperatures and sea levels are becoming more frequent, and despite greater risks from potential physical damage to the assets in its portfolio, among others.\n“It is a rich opportunity for us because the total addressable market from this area is expected to grow as we do more and require more capital expenditure,” Ms Liew Tzu Mi, head of the sustainability committee and chief investment officer for fixed income at GIC, told The Straits Times in an interview.\nStill, the returns are expected to vary, with the risks from climate change running high.\nFor one thing, rising greenhouse gas emissions have led to 2023 being the hottest year on record, and there is a greater chance that at least one in the next five years will be hotter than that, a United Nations agency said in June.\nSupporting evidence presented by the European Union’s climate change monitoring service showed that each of the past 12 months has set a new global temperature record for that time of year, with the global average temperature from June 2023 to May rising to around 1.6 deg C above the pre-industrial average.\nThat is higher than the threshold of 1.5 deg C, above which the planet could begin to see more extreme weather events linked to climate change, such as the recent heatwave in Asia and flash floods in parts of the United Arab Emirates, Germany and Brazil in 2024.\nThe consequent damage to farming, infrastructure, productivity and public health could cost the world an estimated US$38 trillion (S$51 trillion) per year by 2050, and this will only grow, German-backed research has shown.\n“To put it in context, we are running against time, and we are losing the race so far,” President Tharman Shanmugaratnam said at a forum in Singapore on June 5.\n“At the current rate of global emissions, we have at least a 50 per cent chance of hitting 1.5 deg C in seven years’ time,” he said, adding that the risks of a worse outcome are mounting.\nBut therein also lies “the largest investment opportunity the world has seen in 50 years – to be able to invest in renewable energies and everything else to do with the clean economy”, said President Tharman.\nIn 2023, for example, clean energy alone contributed about 10 per cent of global growth.\nTo capture that opportunity, GIC, with a mandate to manage and enhance Singapore’s reserves for future generations, is investing in companies with strong sustainability practices, as it believes they offer prospects of better returns over the long term.\nFor the 20-year period ended March 31, 2023, the GIC portfolio achieved an annualised rate of return of 4.6 per cent after adjusting for inflation, up from 4.2 per cent the year before.\nGIC’s Ms Liew said: “Given its material impact on both the physical and financial worlds, including our assets, climate change is an investment issue that affects the bottom line.\n“Over the long term, for companies to do well, they must also be sustainable.”\nShe said that from now until 2050, about US$126 trillion of additional capital expenditure will be needed to reduce carbon dioxide emissions including from electricity generation, transport, buildings and industry.\nBut while governments have pledged funds towards attaining the International Energy Agency’s (IEA) net-zero emissions target by 2050, public sector money makes up just 20 per cent of the required capital, Ms Liew said.\n“Investors such as GIC play a critical role in closing this investment gap.”\nWhen investing for sustainability, GIC groups the assets in its portfolio into three categories, and adopts a different investment approach to each of these three categories of companies, based on their capital requirements and risk profiles.\nCapital is directed to companies directly involved in decarbonisation to help them commercialise or scale up, while firms in the process of transitioning to lower emissions models receive funds and support where there are good commercial returns versus the risks involved, Ms Liew said.\nShe added: “Where businesses are unable or unwilling to transition, we would choose to divest or avoid investing in them.”\nFirms transitioning to greener and more sustainable business models hold the biggest promise for good returns, she said.\nGIC’s January 2021 investment in Duke Energy Indiana (DEI), a subsidiary of US energy giant Duke Energy, is one example.\nProceeds from the US$2.05 billion transaction were deployed to help DEI transition from coal-fired power plants to cleaner sources of energy.\n“We want to work with these companies and think about what is realistic and constructive for them rather than impose a one-size-fits-all net-zero target for everyone. It is more pragmatic this way,” said Ms Liew.\nGIC’s sustainability-linked investments cut across different asset classes, including portfolios focusing on private equity, the stock market, and fixed income.\nIn September 2023, it co-invested in H2 Green Steel, which raised about €1.5 billion (S$2.1 billion) in private equity to finance the construction of a large-scale steel plant in Sweden.\nThis new plant will be able to produce steel with up to 95 per cent less carbon dioxide emissions compared with traditional steel plants, by replacing coal in the production process with hydrogen.\nStill, Ms Liew noted that these investments do not come without risks.\nTo mitigate them, GIC incorporates various climate scenarios into its investment process, which enables it to analyse any upside and downside effects on its portfolio under different circumstances and manage the risks accordingly.\nMs Liew said the predominant climate scenario GIC is preparing for is one where a delayed introduction of climate policies fails to limit the physical impact of climate change on the economy, resulting in global warming of between 2 deg C and 3 deg C by 2100.\nGIC also conducts physical risk assessments for potential investments, where tools are used to map out where the assets are located and assess the risks they might be impacted by, such as floods, cyclones or wildfires, as well as temperature extremes or drought, she said.\nThese assessments are then used to help with investment decisions.\n“For example, our real estate team might decide not to proceed with a potential investment due to the asset’s proximity to unstable cliffs and receding shorelines, which would have made it vulnerable to rising sea levels and storm surges,” Ms Liew said.\nDespite this, she noted that capital investments for climate solutions such as electricity networks, sustainable vehicles and renewable energy have reached record highs in recent years, to US$1.7 trillion in 2023, according to the IEA’s estimates.\n“However, investment levels remain several times below what’s needed to reach net zero by 2050,” she said.\n“The majority of climate solutions are expected to see the fastest growth within this decade, while the Asia-Pacific region represents the largest total addressable market due to rapid economic and emissions growth.”\nEditor’s note: This article has been updated for clarity.", "url": "https://www.straitstimes.com/business/gic-sees-opportunities-to-invest-in-greener-environment-even-as-risks-from-climate-change-rise"}