{"authors": ["Ann Williams"], "date_download": "2024-10-12 13:30:21", "date_modify": "2024-10-12 13:30:21", "date_publish": "2022-05-17 15:37:08", "description": "Market experts note the ample supply in the area, rising construction costs and property cooling measures. Read more at straitstimes.com.", "filename": "business_property_3-residential-sites-at-lentor-hills-estate-released-for-sale-more-cautious-bids-expected_1728739821.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/17/AK_lp_170522.jpg?VersionId=dfqJNQfdRutshXHOEgGuRrEJ4jf8P2uL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_3-residential-sites-at-lentor-hills-estate-released-for-sale-more-cautious-bids-expected_1728739821.html", "title": "3 residential sites at Lentor Hills estate released for sale, more cautious bids expected", "title_page": "3 residential sites at Lentor Hills estate released for sale, more cautious bids expected | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Three 99-year leasehold private home sites were released by the Urban Redevelopment Authority (URA) on Tuesday (May 17), with market experts expecting a more cautious reception from developers given ample supply in the area, rising construction costs and property cooling measures.\nTwo of the sites - Lentor Central and Lentor Hills Road (Parcel B) - have been put up for tender. They are on the confirmed list of the Government Land Sales (GLS) programme for the first half of 2022. Tender for the sites - which can yield up to 735 units- close at 12pm on Sept 13.\nAnother parcel in Lentor Gardens is on the GLS reserve list and is only available for application by developers under the GLS reserve list, meaning it will be put up for tender only if the minimum price submitted by a developer is acceptable to the government.\nThe three parcels are located within the new Lentor Hills estate near Lentor MRT Station along the Thomson-East Coast Line.\nPopular schools within the vicinity include Presbyterian High School, Anderson Primary School, and CHIJ St Nicholas Girls' School.\nFuture residents at all three sites will enjoy direct access via public transport to Woodlands Regional Centre, the Central Business District, and various parts of Singapore.\nComing up are also retail outlets, a supermarket, and childcare facilities within the nearby mixed-use development at Lentor Modern.\nThe Lentor Central site spans a site area of 13,443 square metres (sq m) with a maximum gross floor area (GFA) of 40,333 sq m. The site, which has a maximum building height of 23 storeys, can accommodate 470 units.\nThe Lentor Hills Road (Parcel B) site has a land area of 10,819 sq m with a maximum GFA of 22,720 sq m. A development up to eight and 19 storeys respectively may be built within the site's low-rise and high-rise zones to yield a total of 265 units.\nThe reserve list site at Lentor Gardens covers 21,867 sq m and has a maximum GFA of 45,921 sq m. With eight storeys in the low-rise zone and 16 storeys in the mid-rise zone, it can house 530 units.\nHuttons Asia senior director for research Lee Sze Teck said: \"Interest in the Lentor Central and Lentor Hills Road (Parcel B) sites may be lukewarm despite developers having a need to replenish their land bank.\n\"In the face of increased risks from the cooling measures and rising construction costs, developers may not want to buy land in an area where there is ample supply.\"\nMr Lee estimates that, assuming the two latest confirmed list sites are sold, the Lentor area will see up to 1,935 new homes being developed. \"This may be sufficient to meet the pent-up demand in the area, hence the Lentor Gardens site on the reserve list may not be triggered for sale,\" he said.\nMs Wong Siew Ying, PropNex's head of research and content, said developers will be keen on the Lentor Central and Lentor Hills Road (Parcel B) sites but will be mindful of two other nearby plots that were sold recently and may be \"more judicious\" with their bids.", "url": "https://www.straitstimes.com/business/property/3-residential-sites-at-lentor-hills-estate-released-for-sale-more-cautious-bids-expected"}