{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 13:51:52", "date_modify": "2024-10-12 13:51:52", "date_publish": "2024-01-29 08:10:35", "description": "Some analysts say it may keep its policy unchanged through most of 2024 amid pressures on core inflation. Read more at straitstimes.com.", "filename": "business_mas-keeps-singdollar-policy-unchanged-lowers-overall-inflation-forecast-for-2024_1728741112.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/29/yaohui-pixgeneric-5832.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_mas-keeps-singdollar-policy-unchanged-lowers-overall-inflation-forecast-for-2024_1728741112.html", "title": "MAS keeps Singdollar policy unchanged, lowers overall inflation forecast for 2024", "title_page": "MAS keeps Singdollar policy unchanged, lowers overall inflation forecast for 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore’s central bank has kept unchanged its monetary policy stance aimed at strengthening the trade-weighted Singapore dollar to fight still-elevated inflation.\nWhile core inflation – which excludes private transport and accommodation costs to better reflect the expenses of local households – has surprised on the upside, the Monetary Authority of Singapore (MAS) expects overall inflation to ease at a faster pace in 2024.\nIt lowered its estimate for overall inflation in 2024 to 2.5 per cent to 3.5 per cent, down from a previous projection of between 3 per cent and 4 per cent.\nBut it kept its core inflation projection unchanged at an average of 2.5 per cent to 3.5 per cent for 2024.\nThe MAS said on Jan 29 that it will maintain the prevailing rate of appreciation of the Singapore dollar nominal effective exchange rate (S$Neer) policy band, with no change to the width of the band or the level at which it is centred.\n“Current monetary policy settings remain appropriate. The sustained appreciation of the policy band will continue to dampen imported inflation and curb domestic cost pressures, thus ensuring medium-term price stability,” the central bank said in the first of its quarterly monetary policy statements.\nThe MAS said that with certificate of entitlement (COE) premiums falling since November and the larger COE supply this year compared with 2023, overall inflation in 2024 is now forecast to be lower.\nAll 19 economists surveyed by Bloomberg News had expected the MAS to maintain its overall policy settings.\nThe decision to stand pat was widely expected after data last week showed that core inflation rose in December from a month earlier after easing for several months. The full-year rate of increase in core prices also came in higher than the average in 2022.\nCore inflation in December accelerated to 3.3 per cent year on year from 3.2 per cent in November. It averaged 4.2 per cent in 2023, up from 4.1 per cent in 2022.\nOverall inflation also rose, to 3.7 per cent in December from 3.6 per cent in November. For the whole of 2023, it averaged 4.8 per cent, down from 6.1 per cent in 2022.\nInflation rates in 2023 were impacted by the increase in the goods and services tax (GST) rate to 8 per cent, the MAS and the Ministry of Trade and Industry had said on Jan 23 in their monthly joint inflation statement, which noted other price increases, such as for bus and train fares – which took effect in late 2023 – and electricity and gas tariffs in the first quarter of 2024.\nThe MAS said on Jan 29: “Core inflation is expected to rise in the current quarter due in part to the one-off impact of the 1 percentage point hike in the GST from January this year, as well as the increase in the carbon tax.\n“Water prices will rise from the second quarter of this year amid increases in production costs. Inflation for certain services components, including public transport and healthcare, could also stay elevated as less frequently adjusted prices rise to catch up with higher cost levels.”\nThis is the MAS’ first monetary policy statement since it shifted to a quarterly schedule from biannual reviews previously. It is also the first policy statement under new managing director Chia Der Jiun, who replaced Mr Ravi Menon on Jan 1.\nThe central bank is also hopeful for export-driven Singapore’s economic growth to pick up later in 2024, even as the near-term outlook remains depressed by the lagged effects of elevated interest rates in advanced economies.\n“MAS will closely monitor global and domestic economic developments, and remain vigilant to risks to inflation and growth,” it said.\nSome analysts pointed out that the above sentence was not in the MAS’ monetary policy statement last October, while the reference then to “the policy band is assessed to be sufficiently tight” was omitted in the latest statement.\nTaken together, analysts believe the central bank is now more worried about elevated core inflation rather than growth, suggesting it might keep the policy stance unchanged through most of 2024.\nMr Ang Kai Wei, Asia and Asean economist at Bank of America, said: “We don’t expect the MAS to change policy settings for the rest of the year as yet.”\nHowever, Mr Ang believes there is a chance that if core inflation remains sticky through the first quarter, the MAS may, in fact, tighten the policy setting even further in its next meeting due in April.\nRHB Bank acting group chief economist Barnabas Gan said: “Global inflation signals are flashing red.”\nHe said the disruption of shipping in the Red Sea, which connects Asia to Europe, and escalating violence in other parts of the Middle East have already sent crude oil prices rising above US$80 per barrel, up from around US$75 in early January.\n“There is no impetus for the MAS to tweak its policy parameters for the year ahead,” Mr Gan noted.", "url": "https://www.straitstimes.com/business/mas-keeps-singdollar-policy-unchanged-lowers-overall-inflation-forecast-for-2024"}