{"authors": ["Natalie Choy"], "date_download": "2024-10-12 13:30:47", "date_modify": "2024-10-12 13:30:47", "date_publish": "2021-06-03 07:28:21", "description": "The company said Mr Mahtani Bhagwandas was interviewed over an investigation involving certain private companies. Read more at straitstimes.com.", "filename": "business_companies-markets_grp-ltd-director-mahtani-bhagwandas-assisting-with-cad-probe_1728739847.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/06/03/rk_mahtanibhagwandas_030621.jpg?VersionId=lRIhMiTVtPMVqxGjoZXVuyJiGBrZB.js", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_companies-markets_grp-ltd-director-mahtani-bhagwandas-assisting-with-cad-probe_1728739847.html", "title": "Industrial product supplier GRP says director assisting with CAD probe", "title_page": "Industrial product supplier GRP says director assisting with CAD probe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE (THE BUSINESS TIMES) - Industrial product supplier GRP announced on Wednesday (June 2) that one of its independent directors, Mr Mahtani Bhagwandas, was recently interviewed by the authorities over an investigation involving certain private companies in which he is, or was, a nominee director.\nIn a regulatory filing, GRP said that Mr Mahtani had attended an interview with the Commercial Affairs Department (CAD) on May 17. He had informed the group that he is \"not the subject of the investigation and was assisting in the investigation\".\nHe also confirmed that CAD had imposed no restrictions or conditions on him, and that his travel documents had not been retained.\nHe has sought legal advice on the investigation, which is still ongoing. No charges have been made against any person or entity as of now, said GRP.\nThere is therefore no reason to question the suitability of Mr Mahtani to continue as director, said the group. The nominating committee, excluding Mr Mahtani, will reassess its view as and when a basis to do so arises, and when further information is available.\nMr Mahtani, a lawyer by profession, is a founding partner in law firm LegalStandard. He was recently in the news for his role as counsel for the mistress of the murder victim in the high-profile Boon Tat Street killing case in 2017.\nShares of GRP last traded at 18 cents on Tuesday.", "url": "https://www.straitstimes.com/business/companies-markets/grp-ltd-director-mahtani-bhagwandas-assisting-with-cad-probe"}