{"authors": [], "date_download": "2024-10-12 14:11:32", "date_modify": "2024-10-12 14:11:32", "date_publish": "2023-11-01 13:55:00", "description": "The new terms might mean the company’s offshore bond holders will get a major cut on investments. Read more at straitstimes.com.", "filename": "business_evergrande-proposes-offshore-creditors-get-30-equity-stake-in-subsidiaries-sources_1728742292.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/01/2023-10-25T062608Z1811777735RC28Q2A6M6CKRTRMADP3CHINA-PROPERTY-DEBT-EVERGRANDE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_evergrande-proposes-offshore-creditors-get-30-equity-stake-in-subsidiaries-sources_1728742292.html", "title": "Evergrande proposes offshore creditors get 30% equity stake in subsidiaries: Sources", "title_page": "Evergrande proposes offshore creditors get 30% equity stake in subsidiaries: Sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – China Evergrande has proposed a new debt restructuring plan for offshore bond holders, offering to swap their debts into about a 30 per cent equity stake in each of the developer’s two Hong Kong-listed subsidiaries.\nThis is according to two sources familiar with the matter.\nThe property company’s offshore bond holders holding about US$19 billion (S$26 billion) of debt are likely to take a major haircut on their investments if they agree to the new terms, said the two sources, who declined to be named because they were not authorised to speak to media.\nEvergrande did not respond to a request for comment.\nThe property developer’s dollar bonds last traded at about 2.25 US cents on the dollar on Tuesday, according to London Stock Exchange Group data, as bond holders weigh the possible recoveries in the revised restructuring plan against other options like a winding up.\nA lawyer representing an ad hoc group of key bond holders told a Hong Kong court on Monday that the restructuring plan could have a higher recovery rate for creditors than a liquidation scenario of less than 3 per cent.\nShares in the subsidiaries the bond holders will be offered the stake in, Evergrande Property Services Group and Evergrande New Energy Vehicle Group, have fallen by more than 80 per cent in 2023 amid Evergrande’s debt woes.\nTheir combined market value was only around HK$9 billion (S$1.6 billion) as at Wednesday morning, with the parent holding 52 per cent of the property company and 59 per cent of the vehicle company.\nCreditors would be given existing shares of the two subsidiaries, the first source said, in a deal that would need to be approved by Chinese regulators.\nThe new plan was raised with some bond holders about two weeks ago, the first source added, after Evergrande’s original debt restructuring plan was thrown off course when its founder Hui Ka Yan was in late September confirmed to be under investigation for suspected criminal activities.\nEvergrande was also banned from issuing new dollar bonds, a key part of its original plan, while its flagship China unit was being investigated by regulators.\nThe second source said the new plan was driven by a work committee under the southern Guangdong provincial government that has been overseeing Evegrande’s restructuring since late 2021, after the developer defaulted on its debts.\nThe provincial government did not respond to a request for comment.\nThe renewed proposal will be key to Evergrande’s survival, as the company was on Monday ordered by a Hong Kong court to form a concrete debt restructuring plan before a liquidation hearing on Dec 4 that will decide whether it should be wound up.\nEvergrande’s original plan, which was backed by the ad hoc group of bond holders before it was thrown off course, offered options including equity-linked instruments backed by the parent Evergrande and the two Hong Kong-listed subsidiaries.\nCreditors were allowed to either swap all of their holdings into new notes with maturities of 10 to 12 years, or convert them into different combinations of new notes with tenors of five to nine years and equity-linked instruments, with no direct haircut.\nThe biggest challenge ahead for Evergrande will be convincing its creditors and shareholders in the two Hong Kong-listed subsidiaries that the new proposal is worthwhile, industry experts said.\nA key group of creditors, categorised as Class C by Evergrande, including private lenders, some Chinese banks and pre-initial public offering investors, had opposed the old plan and demanded better terms before it collapsed.\nThe ad hoc group of bond holders is unhappy about the revised terms offering equity in the Hong Kong-listed subsidiaries, according to sources. REUTERS", "url": "https://www.straitstimes.com/business/evergrande-proposes-offshore-creditors-get-30-equity-stake-in-subsidiaries-sources"}