{"authors": [], "date_download": "2024-10-12 14:17:21", "date_modify": "2024-10-12 14:17:21", "date_publish": "2024-08-16 13:44:00", "description": "Amec is considered one of China's foremost suppliers of equipment vital to semiconductor production. Read more at straitstimes.com.", "filename": "business_top-chinese-chip-gear-maker-sues-pentagon-to-void-sanctions_1728742641.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/16/2024-08-07T183500Z1058106900RC2UCZ9ARSL8RTRMADP3USA-ELECTION-WALZ-CHINA.JPG?VersionId=_V.tOS7fDZCf5PWmK1y1aLiD1cMq_oi7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_top-chinese-chip-gear-maker-sues-pentagon-to-void-sanctions_1728742641.html", "title": "Top Chinese chip gear maker sues Pentagon to void sanctions", "title_page": "Top Chinese chip gear maker sues Pentagon to void sanctions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - One of China’s most prominent chip gear makers is suing the Pentagon for linking it to the People’s Liberation Army (PLA), seeking to get off a blacklist that bars business with American firms.\nAdvanced Micro-Fabrication Equipment China (Amec) alleged that the US defence agency harmed the Shanghainese entity’s business and reputation by adding it to the so-called Section 1260H list of firms linked to China’s military. Pentagon officials took months to respond to a request for additional information, then justified their decision with evidence of an award from China’s Ministry of Industry and Information Technology, Amec said in its lawsuit.\nAmec becomes the latest Chinese firm to try to overturn its addition to a blacklist intended to guard the United States against national security threats.\nThe company is considered one of the country’s foremost suppliers of equipment critical to semiconductor production, a key component of Beijing’s ambitions to ascend the geopolitical and technology ladder.\nThe US government has in past years grown increasingly concerned about what it calls China’s military-civil fusion strategy, describing that concept as regular civilian companies aiding the PLA in some fashion. That concern centres in particular on the country’s technology champions.\nAmec competes with top US firms, including Applied Materials and Lam Research. In its latest annual report, the Chinese company said some of its machines are now being used to make chips as advanced as 5 nanometres, or technology only one generation behind the most cutting-edge.\nThe Chinese company supplies to Huawei Technologies’ production partner Semiconductor Manufacturing International Corporation (SMIC), chipmaker Hua Hong Semiconductor and Taiwan Semiconductor Manufacturing Company, according to Bloomberg supply chain data.\nAmec said in its complaint that its leadership is predominantly American. Its founder and chairman Gerald Yin, born in 1944, has a doctorate from the University of California, Los Angeles and previously worked for Intel, Applied Materials and Lam Research, according to the annual report. He was identified as a US national in the firm’s annual report for 2021.\nEarlier in 2024, the US Department of Defence added Amec to its blacklist alongside several major Chinese tech firms, including Yangtze Memory Technologies and an arm of Hesai Group. Hesai Technology later sued the Pentagon, though the Financial Times reported this week that the US was now considering its removal.\nThe current Section 1260H list includes fellow chip industry names Huawei and SMIC. In 2021, the Biden administration agreed to remove Chinese smartphone giant Xiaomi from the list, after a US court sided with the company and placed a temporary halt on the ban. BLOOMBERG", "url": "https://www.straitstimes.com/business/top-chinese-chip-gear-maker-sues-pentagon-to-void-sanctions"}