{"authors": [], "date_download": "2024-10-12 14:07:12", "date_modify": "2024-10-12 14:07:12", "date_publish": "2023-10-06 07:47:00", "description": "The surge in long-term US bond yields heightens the danger in the near term of a financial blow-up. Read more at straitstimes.com.", "filename": "business_fed-s-bid-to-avoid-us-recession-tested-by-bond-yields-nearing-20-year-highs_1728742032.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/06/2023-10-05T200622Z1050077458RC2JM3A9MFM2RTRMADP3USA-FED.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_fed-s-bid-to-avoid-us-recession-tested-by-bond-yields-nearing-20-year-highs_1728742032.html", "title": "Fed’s bid to avoid US recession tested by bond yields nearing 20-year highs", "title_page": "Fed’s bid to avoid US recession tested by bond yields nearing 20-year highs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – The US Federal Reserve may be putting its hoped for soft landing of the United States economy at risk by tacitly accepting a run-up in long-term interest rates to the highest levels since 2007.\nThe surge – 10-year Treasury yields rose more than half a percentage point in the past month to surpass 4.7 per cent – heightens the danger in the near term of a financial blow-up akin to the regional bank breakdown in March.\nIn the longer run, it threatens to undercut the economy by markedly raising borrowing costs for consumers and companies.\n“Ultimately, the feedback effect starts to fuel fears that you’re going to have a hard landing,” said Federated Hermes senior portfolio manager R. J. Gallo.\nWhat may have a particularly strong impact is the rise in so-called real rates, which remove the impact of inflation.\nYields on 10-year inflation-linked Treasuries have soared in recent weeks to levels rarely seen over the past two decades.\nFed leadership has so far not shown much, if any, inclination to resist the rise in long-term rates.\nWhile New York Fed president John Williams suggested last week the US central bank may be finished raising rates, he also said policymakers would keep them high “for some time” to bring inflation down to their 2 per cent goal.\n“Fed officials have had a chance at various appearances – and they’ve not really taken that opportunity to push back against this,” former vice-chair Richard Clarida said on Bloomberg Television on Wednesday.\nThe rise in yields “actually does some of the Fed’s job for it” by slowing economic growth and helping to contain inflation, added Mr Clarida, who is now a global economic adviser for Pacific Investment Management Co.\nFor her part, Cleveland Fed president Loretta Mester said on Thursday that officials are watching the rise in yields, though adding that it is not clear that the increase would be sustained.\nThe danger is the leg up in long-term rates does more damage than the Fed expects.\nThe collapse of Silicon Valley Bank in March came in the wake of a rise in bond yields that was partly driven by tough talk on Fed policy by chair Jerome Powell.\nOther headwinds\n“There’s a potential near-term disruptive effect to worry about,” said JPMorgan Chase & Co chief economist Bruce Kasman.\nThe rise in rates is also occurring at a time when the economy is already facing a number of headwinds – from a resumption of student loan payments to a strike by autoworkers.\nIndeed, Bloomberg Economics chief US economist Anna Wong says the US economy is probably on the verge of tipping into a recession.\nMarket participants have identified a variety of triggers for the surge in bond yields – which moderated slightly on Wednesday.\nAmong them: Investor concern about burgeoning US budget deficits, slackening demand for Treasury securities from foreign investors including China and expectations that Japan will exit its ultra-loose monetary policy in coming quarters.\nSome economists and investors have also cited what they see as a muddled message from the US central bank regarding its stance on real interest rates.\nReal rates\n“We’ve gotten conflicting signals from the Fed,” MacroPolicy Perspectives founder and former central bank economist Julia Coronado said.\nIn an environment where bond yields were already rising, that “basically just gave the market permission to keep marching higher”.\nWhat is puzzling investors is how exactly policymakers define real rates.\nFed officials have sometimes cited gauges that are based on past inflation and sometimes those tied to prospective inflation rates.\nThe difference can be critical in determining the future path of Fed policy.\nNew York’s Mr Williams in August suggested that the Fed would cut rates in 2024 in tandem with an expected fall in inflation.\nThe aim, he explained, would be to prevent real rates from rising and policy from becoming more restrictive.\nBut Cleveland’s Ms Mester, who does not vote on monetary policy decisions in 2023, suggested on Tuesday that this is not inevitably so.\n“Real rates should be based on expected inflation, not necessarily current inflation,” she told reporters.\nIn that case, a slowdown in inflation would not automatically call for a reduction in Fed rates, unless also accompanied by an easing in expectations.\nThe Fed’s preferred gauge of core inflation, which strips out food and energy costs, was 3.9 per cent in August.\nBy comparison, a benchmark for expected inflation derived from bond market pricing indicates about a 2.5 per cent pace over the longer term.\nWhatever the reason for the rise in long-term rates, it is something that policymakers will need to keep their eye on in case in gets out of control. BLOOMBERG", "url": "https://www.straitstimes.com/business/fed-s-bid-to-avoid-us-recession-tested-by-bond-yields-nearing-20-year-highs"}