{"authors": [], "date_download": "2024-10-12 13:51:12", "date_modify": "2024-10-12 13:51:12", "date_publish": "2024-03-19 07:31:00", "description": "The shift makes the BOJ the last central bank to exit negative rates. Read more at straitstimes.com.", "filename": "business_economy_japan-poised-to-end-negative-rates-closing-era-of-radical-policy_1728741072.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/19/2024-03-18T054719Z721540636RC23O6AEIVASRTRMADP3JAPAN-ECONOMY-BOJ.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_economy_japan-poised-to-end-negative-rates-closing-era-of-radical-policy_1728741072.html", "title": "Bank of Japan scraps radical policy, makes first rate hike in 17 years", "title_page": "Bank of Japan scraps radical policy, makes first rate hike in 17 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – The Bank of Japan (BOJ) ended eight years of negative interest rates and other remnants of its unorthodox policy on March 19, making a historic shift away from a focus on reflating growth with decades of massive monetary stimulus.\nWhile the move is Japan’s first interest rate hike in 17 years, it still keeps rates stuck at around zero as a fragile economic recovery forces the central bank to go slow in any further rise in borrowing costs, analysts say.\nThe shift makes the BOJ the last central bank to exit negative rates and ends an era in which policymakers around the world sought to prop up growth through cheap money and unconventional monetary tools.\n“We reverted to a normal monetary policy targeting short-term interest rates, as with other central banks,” BOJ governor Kazuo Ueda said at a press conference after the decision. “We will choose the appropriate level of short-term rates in line with our economic and price outlook.”\nIn a widely expected decision, the BOJ ditched a policy put in place since 2016 that applied a 0.1 per cent charge on some excess reserves that financial institutions parked with the central bank.\nThe BOJ set the overnight call rate as its new policy rate and decided to guide it in a range of 0 per cent to 0.1 per cent, partly by paying 0.1 per cent interest on deposits at the central bank.\n“The BOJ today took its first, tentative step towards policy normalisation,” said Mr Frederic Neumann, chief Asia economist at HSBC in Hong Kong.\n“The elimination of negative interest rates, in particular, signals the BOJ’s confidence that Japan has emerged from the grip of deflation.”\nThe central bank also abandoned yield curve control (YCC), a policy that had been in place since 2016 that capped long-term interest rates at around zero.\nBut in a statement announcing the decision, the BOJ said it will keep buying “broadly the same amount” of government bonds as before and ramp up purchases in case yields rise rapidly.\nThe BOJ additionally decided to discontinue purchases of risky assets like exchange-traded funds and Japanese real estate investment trusts.\n“We judged that sustainable, stable achievement of our price target came in sight,” the central bank said in a statement explaining the decision to dismantle former governor Haruhiko Kuroda’s huge stimulus programme.\nWith inflation having exceeded the BOJ’s 2 per cent target for well over a year, many market players had projected an end to negative interest rates either in March or April.\nExpectations for a shift this week heightened significantly after unions’ annual wage talks with major firms delivered the biggest pay hikes in 33 years.\nIn a sign that future rate hikes will be moderate, the BOJ said in the statement that it expects “accommodative financial conditions will be maintained for the time being”. The language compared with the more dovish guidance that was removed from the statement, in which the BOJ pledged to ramp up stimulus as needed and keep increasing the pace of money printing until inflation stably exceeded 2 per cent.\nJapanese shares were volatile on March 19. The yen fell to almost 150 per US dollar as investors took the BOJ’s dovish guidance as a sign that the interest rate differential between Japan and the United States will likely not narrow much.\nThe stakes are high. A spike in bond yields would boost the cost of funding Japan’s huge public debt, which, at twice the size of its economy, is the largest among advanced economies.\nAn end to the world’s last remaining provider of cheap funds could also jolt global financial markets as Japanese investors, who amassed overseas investments in search of yields, shift money back to their home country.\nUnder previous governor Kuroda, the BOJ deployed a huge asset-buying programme in 2013, originally aimed at firing up inflation to a 2 per cent target within roughly two years.\nThe central bank introduced negative rates and YCC in 2016 as tepid inflation forced it to tweak its stimulus programme to a more sustainable one.\nAs the yen’s sharp falls pushed up the cost of imports and heightened public criticism over the demerits of Japan’s ultra-low interest rates, however, the BOJ in 2023 tweaked the YCC to relax its grip on long-term rates. REUTERS", "url": "https://www.straitstimes.com/business/economy/japan-poised-to-end-negative-rates-closing-era-of-radical-policy"}