{"authors": [], "date_download": "2024-10-12 14:11:16", "date_modify": "2024-10-12 14:11:16", "date_publish": "2024-05-26 10:00:00", "description": "New approach pales against the problem: a vast number of empty apartments no one wants to buy. Read more at straitstimes.com.", "filename": "business_property_china-has-a-plan-for-its-housing-crisis-here-s-why-it-s-not-enough_1728742276.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/26/CHINAHOUSING1.JPG?VersionId=65yNoLRjk1WMGko6XoftdA0nnK9YvZWM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_property_china-has-a-plan-for-its-housing-crisis-here-s-why-it-s-not-enough_1728742276.html", "title": "China has a plan for its housing crisis. Here’s why it’s not enough", "title_page": "China has a plan for its housing crisis. Here’s why it’s not enough | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – China has a housing problem. A very big one. It has nearly four million apartments that no one wants to buy, a combined expanse of unwanted living space roughly the area of the US city of Philadelphia.\nMr Xi Jinping, the country’s leader, and his deputies have called on the government to buy them.\nThe plan, announced last week, is the boldest move yet by Beijing to stop the tailspin of a housing crisis that threatens one of the world’s biggest economies. It is also not nearly enough.\nChina has a bigger problem lurking behind all those empty apartments: even more homes that developers already sold but have not finished building. By one conservative estimate, that figure is around 10 million apartments.\nThe scale of China’s real estate boom was breathtaking. The extent of its unrelenting bust, which began nearly four years ago, remains vast and unclear.\nChina’s leaders were already managing a slowdown after three decades of double-digit growth before the housing crisis created a downturn that is spiralling out of their control.\nFew experts believe that Beijing can transition to more sustainable growth without confronting all those empty apartments and the developers that overextended to build them.\nAll told, trillions of dollars are owed to builders, painters, real estate agents, small companies and banks around the country.\nAfter decades of promoting the biggest real estate boom the world has ever seen, and allowing it to become nearly one-third of China’s economic growth, Beijing stepped in suddenly in 2020 to cut off the easy money that fuelled the expansion, setting off a chain of bankruptcies that shocked a nation of homebuyers.\nIt was the first test of Beijing’s determination to wean China’s economy off its decades-long dependence on building and construction to sustain the economy.\nNow the government is confronting another test of its resolve.\nTo stop the excesses of the past, it signalled over the last few years that no real estate company was too big to fail. But as dozens of big developers have gone bust, they have obliterated any confidence that remained in the housing market.\nOfficials have since tried everything to restore optimism among buyers. Nothing has worked.\nWith few buyers, developers that are still standing are also on the brink of default. And they are intricately connected to local banks and the financial system that underpins the government in every village, town and city.\nOne recent estimate, from research firm Rhodium Group, put the real estate sector’s entire domestic borrowings, including loans and bonds, at more than $10 trillion, of which only a tiny portion have been recognised.\n“Right now, not being able to sell homes looks like a risk, but it isn’t. More developers going bankrupt is,” said Dr Dan Wang, chief economist at Hang Seng Bank.\nThe first big developers to default, including China Evergrande, were problems hiding in plain sight.\nEvergrande’s initial default in December 2021 set off fears of China’s own “Lehman moment”, a reference to the 2008 collapse of Lehman Brothers, which set off a global financial meltdown.\nThe fallout, however, was carefully and quietly managed through policy support that let Evergrande finish building many apartments. By the time a judge ordered the company to be liquidated five months ago, Evergrande had effectively ceased being a viable business.\nBut China has tens of thousands of smaller developers around the country. The only way for officials to stop the free fall in the market, Dr Wang said, is to bail out some mid-sized developers in cities where the crisis is more acute.\nThe support was not enough to stop housing prices from crashing.\nPolicymakers pulled other levers. They made their biggest cut ever to mortgage rates. They tried pilot programmes to get residents to trade in old apartments and buy new ones.\nThey even offered cheap loans to some cities to test out the idea of buying unsold apartments.\nIn all, the local authorities tried out more than 300 measures to increase sales and bolster real estate companies, according to Caixin, a Chinese economic news outlet.\nStill, the number of unsold homes continued to reach new levels. Prices of new homes kept falling.\nSo at the end of April, Mr Xi and his 23 top policymakers began to discuss the idea of taking some of those unwanted apartments off the market in a programme not unlike the Troubled Asset Relief Programme, which the US government set up in the wake of the American housing market crash.\nLast week, China’s most senior official in charge of the economy, Vice-Premier He Lifeng, convened an online gathering of officials from across the country and delivered the news: It was time to start buying apartments.\nNot long after, the central bank loosened rules for mortgages and promised to make billions of dollars available to help state-owned companies buy apartments.\nThe move underscored just how worried the government had become about the dysfunctions in the housing market.\nYet almost as soon as state media reported Mr He’s call on local governments to buy unsold apartments, economists started asking questions.\nWould local governments be expected to buy all the unsold apartments? What if they, in turn, could not find buyers? And there was the price tag: Economists calculated that such a programme should be in the hundreds of billions of dollars, not tens of billions.", "url": "https://www.straitstimes.com/business/property/china-has-a-plan-for-its-housing-crisis-here-s-why-it-s-not-enough"}