{"authors": [], "date_download": "2024-10-12 14:12:12", "date_modify": "2024-10-12 14:12:12", "date_publish": "2023-10-03 09:00:00", "description": "The shares jumped as much as 42 per cent in early Tuesday trade. Read more at straitstimes.com.", "filename": "business_evergrande-seeks-to-resume-trading-amid-police-probe_1728742332.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/03/2023-07-28T070457Z2056849460RC26C2AWOFZYRTRMADP3CHINA-PROPERTY-DEBT-EVERGRANDE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_evergrande-seeks-to-resume-trading-amid-police-probe_1728742332.html", "title": "Evergrande shares soar as trade resumes amid police probe", "title_page": "Evergrande shares soar as trade resumes amid police probe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – China Evergrande Group soared as it resumed stock trading following a halt last week, after its billionaire founder was put under police control on suspicion of committing as-yet-undisclosed crimes.\nThe troubled property group’s shares jumped as much as 42 per cent in early Tuesday trade, with unit Evergrande Property Services Group also up nearly 14 per cent. The property group’s shares ended 28.1 per cent higher at HK$0.41 on Tuesday, while Evergrande Property Services Group shares closed 3.4 per cent lower at HK$0.57.\nEvergrande requested trading resumption from the Hong Kong stock exchange on Monday, saying there is no other pertinent information that needs to be disclosed. Shares in the company and its property services unit were suspended last Thursday, a day after people familiar with the matter said the firm’s founder had been taken away by police.\nThe developer sits at the centre of a years-long property crisis that has hurt the Chinese economy and hammered confidence in the housing market. The company faces an Oct 30 hearing at a Hong Kong court on a winding-up petition, which could potentially force it into liquidation. Its shares resumed trading only in August after a 17-month halt – dropping 87 per cent upon their return – as the indebted developer revealed more losses and delayed meetings with creditors.\n“Evergrande shares are really volatile and always full of surprise moves,” said Mr Willer Chen, senior research analyst at Forsyth Barr Asia. “I’m not sure who will buy it up under this situation.”\nThe authorities in China notified Evergrande last week that chairman Hui Ka Yan has been subject to “mandatory measures” relating to “suspicion of illegal crimes”, according to a company statement. The Shenzhen-based firm did not elaborate on what the measures entailed or what crimes he is suspected of committing.\nThe Chinese authorities are investigating whether Mr Hui attempted to transfer assets offshore while the company was struggling to complete unfinished projects, the Wall Street Journal reported on Monday, citing unidentified people with knowledge of the matter.\n“The board is of the view that the operations of the company are normal,” a separate filing by the Property Services unit said. That statement was not included in the China Evergrande Group filing, which advised holders and investors to exercise caution when considering the stock. BLOOMBERG", "url": "https://www.straitstimes.com/business/evergrande-seeks-to-resume-trading-amid-police-probe"}