{"authors": [], "date_download": "2024-10-12 14:17:23", "date_modify": "2024-10-12 14:17:23", "date_publish": "2024-09-02 13:35:00", "description": "One concern is auto giant Toyota could lose access to critical minerals. Read more at straitstimes.com.", "filename": "business_china-warns-japan-of-retaliation-over-potential-new-chip-curbs-sources-say_1728742643.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/IMGpcb-gfa7cd01011920.11SUNQLB.jpg?VersionId=dA8sRlejDcFqfmpMMFnDyrdbK6d_SNS7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/business_china-warns-japan-of-retaliation-over-potential-new-chip-curbs-sources-say_1728742643.html", "title": "China warns Japan of retaliation over potential new chip curbs: Sources", "title_page": "China warns Japan of retaliation over potential new chip curbs: Sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - China has threatened severe economic retaliation against Japan if Tokyo further restricts sales and servicing of chipmaking equipment to Chinese firms, complicating US-led efforts to cut the world’s second-largest economy off from advanced technology.\nSenior Chinese officials have repeatedly outlined that position in recent meetings with their Japanese counterparts, according to people familiar with the matter. One specific fear in Japan, Toyota Motor privately told officials in Tokyo, is that Beijing could react to new semiconductor controls by cutting Japan’s access to critical minerals that are essential for automotive production, the people said.\nToyota is among the most important companies in Japan, and is deeply involved in the country’s chip policy, partly reflected by the fact that it has invested in a new chip campus being built by Taiwan Semiconductor Manufacturing Company in Kumamoto, according to one of the people. That makes its concerns a major consideration for Japanese officials, in addition to those of Tokyo Electron, the semiconductor gear maker that would be principally affected by any new Japanese export controls.\nThe United States has been pressuring Japan to impose additional restrictions on the ability of firms including Tokyo Electron to sell advanced chipmaking tools to China, as part of a long-running campaign to curtail China’s semiconductor progress. As part of those talks, senior US officials have been working with their Japanese counterparts on a strategy to ensure adequate supplies of critical minerals, some of the people said, especially since China imposed restrictions on the exports of gallium, germanium and graphite in 2023.\nThe concern about Toyota has some historical precedent. In 2010, China temporarily suspended exports of rare earths to Japan after a clash in waters of the East China Sea claimed by both sides. The move shook Japan’s electronics sector and threatened to choke off global supplies of high-power magnets produced in Japan employing rare earths from China. Tokyo has since worked with mixed success to reduce its reliance on Chinese rare earth imports.\nThe Biden administration is confident that it can assuage Tokyo’s concerns and reach an agreement with Japan by the end of 2024, some of the people said.\nBut there are more aggressive options: Behind the scenes, the US has been wielding a power known as the foreign direct product rule, or FDPR. The rule allows Washington to control sales of products made anywhere in the world, provided they use even the smallest amount of American technology.\nIn the current talks, American officials so far have refrained from invoking that authority against Japan and other key allies, which see the rule as a draconian step. A senior administration official said the US would prefer to reach a diplomatic solution but would not rule out the use of FDPR.\nThe timing of any deal is complicated by the US presidential election in November and the planned resignation of Japanese Prime Minister Fumio Kishida in September. But Mr Kishida stepping down should not impact the negotiations for further curbs, the senior administration official said, because Tokyo has built consensus for the policy across its government.\nJapan’s Ministry of Economy, Trade and Industry did not have immediate comment.\nThe Chinese Foreign Ministry said in a statement that it opposes efforts by any individual nation to politicise normal trade and lure other countries to join any technology blockade against China.\nThe US first unveiled sweeping chip export controls in October 2022 – focused on both equipment and cutting-edge processors – and Japan and the Netherlands later followed suit with their own, less restrictive measures. Washington has since then been trying to convince allies to fully align with the original US controls, particularly by limiting Dutch supplier ASML Holding and Tokyo Electron’s ability to repair restricted machines that are already in China – something US firms are barred from doing. The Hague is planning to impose some servicing restrictions, Bloomberg News has reported.\nNow, Washington is eyeing more US curbs on high-bandwidth memory chips – an essential AI component – and additional chipmaking tools, as well as measures targeting specific Chinese companies. That has triggered a second, parallel set of negotiations with officials in Japan and the Netherlands, as the US pressures both governments to match its potential new measures, which currently have a carve-out for allies.\nThe Biden administration is under pressure from US industry – and some lawmakers in its own party – to secure an agreement with key allies before moving ahead with its own measures.\nASML and Tokyo Electron have both posted large sales increases in China since the US imposed its rules. US firms including Applied Materials, Lam Research, and KLA have also continued to sell large amounts of gear to China, as businesses there stockpile less-advanced equipment in an effort to get ahead of potential new US restrictions.\nA senior US official downplayed the impact of stockpiling, saying it pertains only to less-advanced machinery and that Beijing’s ability to innovate has been severely hampered by a lack of access to cutting-edge tools. BLOOMBERG", "url": "https://www.straitstimes.com/business/china-warns-japan-of-retaliation-over-potential-new-chip-curbs-sources-say"}