{"authors": ["Ravi Velloor"], "date_download": "2024-10-12 13:59:55", "date_modify": "2024-10-12 13:59:55", "date_publish": "2022-10-21 05:00:00", "description": "US has figured that prying Beijing and Moscow apart may not be possible, so is working to seriously weaken Russia. Read more at straitstimes.com.", "filename": "opinion_just-what-does-biden-mean-by-most-decisive-decade_1728741595.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/21/AKjb191022_2.jpg?VersionId=LXNq62sRfDuJg7iWfimdHrmaF7N3.Qka", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_just-what-does-biden-mean-by-most-decisive-decade_1728741595.html", "title": "US-China ties: Just what does Biden mean by ‘most decisive decade’?", "title_page": "US-China ties: Just what does Biden mean by ‘most decisive decade’? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "What a dab hand the United States has played in Europe. By accident or design, without firing a shot or losing a single American life, the US has lured Russian President Vladimir Putin into doing incalculable harm to his nation in potentially lasting ways. For about US$15 billion (S$21.3 billion) in arms shipped to Kyiv, Ukrainians – who have probably surprised themselves with their own resilience and emerged as a true nation regardless of whatever Moscow might think of it – have sacrificed thousands of lives, and may even prevail in the war with Russia.\nKey European states, starting with its pre-eminent economic power, Germany, have been galvanised into opening their treasuries to significantly boost defence spending and, as winter approaches, will be visibly trading income and warmth as they turn away from critical gas supplied by Russia. Europe’s biggest economy is currently enduring the worst inflation since the founding of the Federal Republic.", "url": "https://www.straitstimes.com/opinion/just-what-does-biden-mean-by-most-decisive-decade"}