{"authors": [], "date_download": "2024-10-12 13:31:11", "date_modify": "2024-10-12 13:31:11", "date_publish": "2024-09-12 05:00:00", "description": "We thank Mr Joachim Sim Khim Huang for his letter and are heartened by his support for the Yellow Ribbon cause (Breaking free from biases, prejudices could be harder to do, Sept 5). Read more at straitstimes.com.", "filename": "opinion_forum_forum-nudging-society-into-more-active-participation-in-yellow-ribbon_1728739871.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/st-forum-thumbnail.jpg_0.JPEG?VersionId=oQc7KVuQCuiYfeqyc8s_HgWArdPUTZvZ&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-nudging-society-into-more-active-participation-in-yellow-ribbon_1728739871.html", "title": "Forum: Nudging society into more active participation in Yellow Ribbon", "title_page": "Forum: Nudging society into more active participation in Yellow Ribbon | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "We thank Mr Joachim Sim Khim Huang for his letter and are heartened by his support for the Yellow Ribbon cause (Breaking free from biases, prejudices could be harder to do, Sept 5).\nThe Yellow Ribbon Project (YRP) encourages society to give ex-offenders second chances in life. This in turn encourages them to contribute to society, and pay it forward.\nTo this end, the YRP organises events and initiatives such as the Yellow Ribbon Prison Run. Ex-offenders volunteered at the Yellow Ribbon Prison Run this year by cheering participants along the run route and manning the exhibition booths at the end-point carnival. The YRP also actively engages the community to support the Yellow Ribbon cause by recruiting volunteers as well as conducting sharing sessions in schools, and organising student-led YRP activities.\nWe train and give inmates and ex-offenders skills that would help them find a good job. Our career coaches give them career development and career retention support. Currently, we have more than 6,500 employers who have registered their willingness to offer jobs to ex-offenders.\nThis year, the YRP marks its 20th anniversary in championing second chances for ex-offenders. The campaign tagline is “Don’t Just Wear A Yellow Ribbon. Be One”. We want to shift society towards more action and more active participation in the movement.\nWe welcome everyone to join us and Mr Sim in supporting the Yellow Ribbon cause. You can find out more at www.yellowribbon.gov.sg.", "url": "https://www.straitstimes.com/opinion/forum/forum-nudging-society-into-more-active-participation-in-yellow-ribbon"}