{"authors": [], "date_download": "2024-10-12 13:53:41", "date_modify": "2024-10-12 13:53:41", "date_publish": "2024-09-20 05:00:00", "description": "I refer to the Forum letter “Don’t have children just for them to look after you” (Sept 12). People have children for various reasons. Read more at straitstimes.com.", "filename": "opinion_forum_letter-of-the-week-seeing-children-as-future-caregivers-can-t-be-the-norm-among-parents_1728741221.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/jqgeneric0A1A5093.jpg?VersionId=LWe9wAGmVmSkQ9Say12yTsREHswqKP25", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_letter-of-the-week-seeing-children-as-future-caregivers-can-t-be-the-norm-among-parents_1728741221.html", "title": "Letter of the week: Seeing children as future caregivers can’t be the norm among parents", "title_page": "Letter of the week: Seeing children as future caregivers can’t be the norm among parents | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I refer to the Forum letter “Don’t have children just for them to look after you” (Sept 12). People have children for various reasons.\nIn my experience across different age groups, I have never encountered a parent who said: “I want children so they can take care of me when I’m old.”\nAs a parent, I can say that we work extra hard to ensure our children won’t feel burdened by us in the future, whether through financial support or time spent on us. We are well aware that, due to the nature of raising children, they might feel obligated to care for us, so we prepare ourselves to ease that pressure.\nI cared for my late father for many years, and, during that time, I could sense his frustration at not being able to be self-sufficient. If he had been physically capable, he would have preferred not to depend on me. As for me, I saw it as my God-given duty to care for him, and I accepted that responsibility.\nIn my community work, I have seen the same. Aged parents would rather try hard to get community support before they even turn to their children (and families for that matter). When they do, it is likely because they have exhausted all options.\nReducing raising families to mere insurance or a retirement plan cheapens the richness of those relationships. The love, care and support we share – first within families, and then in the broader society – are central to our human experience.\nI don’t believe we have children just so that they could “look after us”. Without solid empirical data, I can’t say how common this sentiment is, but I think it’s important to question if this mindset is the norm.", "url": "https://www.straitstimes.com/opinion/forum/letter-of-the-week-seeing-children-as-future-caregivers-can-t-be-the-norm-among-parents"}