{"authors": [], "date_download": "2024-10-12 13:59:31", "date_modify": "2024-10-12 13:59:31", "date_publish": "2024-07-17 05:00:00", "description": "The article “Number of babies born in 2023 fell to lowest in at least past 50 years: ICA report” (July 14) painted a sombre and dismal picture of what is to become of our population in the years to come. Read more at straitstimes.com.", "filename": "opinion_forum_forum-hard-to-reverse-low-fertility-rate_1728741571.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/17/st-forum-thumbnail.jpg?VersionId=FC3.yeY42.FKwUi3tb1RpccYnKHTtmya", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-hard-to-reverse-low-fertility-rate_1728741571.html", "title": "Forum: Hard to reverse low fertility rate", "title_page": "Forum: Hard to reverse low fertility rate | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The article “Number of babies born in 2023 fell to lowest in at least past 50 years: ICA report” (July 14) painted a sombre and dismal picture of what is to become of our population in the years to come.\nSingaporeans have been putting marriage on hold and even when they do get married, parenthood is not on their agenda. There are many reasons for not wanting to have babies – the most pressing being the high cost of living and the amount needed to raise a child from play school to university.\nThe declining birth rate will be very difficult to reverse and leaves us with not much choice but to keep on importing foreign talent. As such, we cannot fault the Government for taking that route, no matter how unpopular it may be.\nIn one of our recent family gatherings, one of my nieces in her mid-30s told her mother not to harbour any thoughts of being a grandmother because she wishes to remain single. It would appear to me that this is the trend nowadays.", "url": "https://www.straitstimes.com/opinion/forum/forum-hard-to-reverse-low-fertility-rate"}