{"authors": ["Philip Yap", "Gabriel Wong", "Jason Foo"], "date_download": "2024-10-12 13:54:21", "date_modify": "2024-10-12 13:54:21", "date_publish": "2024-05-06 05:00:00", "description": "Some people may not be offered the treatment they need because attending teams may be subconsciously prejudiced. Read more at straitstimes.com.", "filename": "opinion_are-doctors-biased-against-older-patients-and-those-with-dementia_1728741261.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/06/2023102460248405gin9823.jpg?VersionId=.ADvL_.rudI8ApuQuxf6WquEh6.WzUlt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_are-doctors-biased-against-older-patients-and-those-with-dementia_1728741261.html", "title": "Are doctors biased against older patients and those with dementia?", "title_page": "Are doctors biased against older patients and those with dementia? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "As society ages, efforts are afoot to enable seniors to live dignified and meaningful lives. But ageism – prejudices based on a person’s chronological age – remains entrenched. While ageism in the workplace is not uncommon, is there ageism in healthcare too?\nPatient A was a 78-year-old man with mild dementia. A degenerative spine disease meant that he also needed assistance in daily activities.\nHe was referred to a colleague for consideration for bile duct (biliary) stones, given his recurrent bouts of biliary infection. However, he was told that he was too frail for the endoscopic procedure and that the risks outweighed the potential benefits.\nPatient B, with moderate-stage dementia, was treated for pneumonia. She had been physically well and mobile before she was hospitalised. But the attending team told her son that if the 82-year-old woman turned seriously ill, she would not be offered treatment in the critical care unit as her advanced age and dementia would render her unlikely to survive, even with intensive care.\nEvidence of bias\nThere is both anecdotal and published evidence that seniors tend to receive less evidence-based treatments on account of their age and apparent frailty. The World Health Organisation’s 2021 Global Report On Ageism highlighted the lesser known yet widespread impact of ageism on quality of care for seniors. One study found doctors were quicker to write up do-not-resuscitate orders for patients aged over 75, regardless of clinical prognosis.\nA close corollary to ageism is dementia-ism, where people living with dementia (PLWDs) are discriminated against. PLWDs have been known to receive lower rates of general health screenings and surgery consultations, and are less likely to be considered for intensive care.\nIn a large cohort study published in 2023 by Age And Ageing, the journal of the British Geriatrics Society, the one-year survival rate of PLWDs following a critical care admission was similar to that observed in general older populations.\nDecisions not to offer resuscitative treatment to frail seniors are often justified on grounds of futility. Similarly, when treatments are assessed to carry a greater risk of harm than benefit, they are typically not recommended.\nIt is not unreasonable to construe that treatment will be futile in situations where patients are clearly in an advanced state of frailty or dementia. It is more challenging to decide on appropriate intervention in cases of less severe frailty or dementia.\nHence, treatment decisions depend on how futility is determined. An intervention can be deemed futile either because it has little likelihood of succeeding or because it may add little to quality of life.\nSuch decisions, underpinned by clinical experience, knowledge and personal values, are also susceptible to biases. It has been shown that when doctors are under time pressure, they are more vulnerable to implicit biases towards disadvantaged groups such as frail seniors and PLWDs.\nBut to base treatment decisions on age or subjective appraisals of frailty does not stand up to scrutiny. Even as patient A was assessed to be frail because his spine condition limited his mobility and independence, he did not suffer from conditions such as heart disease or stroke that would heighten the risk of adverse outcomes from endoscopy.\nSimilarly, patient B was denied intensive care on account of her advanced age and dementia.\nThe attending medical team could have unwittingly based their judgment on ableism – the notion that the value and quality of life of a person with a disability, such as dementia, is so low that medical intervention would be too burdensome and hence not worthwhile.\nBut such an approach could mean that older patients and those with dementia can be discriminated against. How can we prevent that?\nImbalance of power\nWe would do well to first consider, as a default, well-evidenced and standard-of-care treatment, even for frail seniors and PLWDs. A patient’s age or cognitive function should not be the foremost consideration.\nInstead, treatment decisions should rest on the tenets of research evidence, a patient’s state and circumstances, a patient’s preferences, and clinical expertise. Securing the patient’s best interests after carefully weighing all factors is what matters, especially whether the modality of treatment is appropriate and proportionate to the desired outcome.\nIn the case of patient A, you’d weigh the slight chance of adverse outcomes from the endoscopic procedure against the benefit of resolving the recurrent biliary infections which would inevitably lead to eventual death.\nIn situations of clinical ambiguity, such as the case of patient B wherein the benefits of intensive care may be uncertain, time-limited trials of treatment can be considered.\nIt involves an agreement between the attending team and patients or their families to undertake treatment for a predetermined time period. The treatment can be withdrawn if certain pre-defined outcomes are not attained.\nThis balances the benefits and burdens of treatment, and affords time for the situation to evolve and bring about greater clarity.\nIn the case of patient B, the decision was taken largely based on the attending team’s opinion, which could have been influenced by ageism. There would be greater equity if the patient and her family could weigh in with their preferences.\nHowever, power asymmetry between doctors and patients remains. While patients can choose not to undergo a treatment offered, they cannot insist on treatments that are judged by doctors to be of no benefit.\nThe patients and their families are supposed to make informed decisions, but these decisions are still liable to being nudged by choice architecture – the way choices are presented.\nMoreover, when the attending team does not recommend a particular treatment option, it is unlikely that the patients and their families will want to take it up. In the case of patient A, this would mean not undergoing the endoscopic procedure that might have potentially benefited the patient.\nAbleism, ageism and dementia-ism are real, and even seniors may devalue their own lives. To combat this, a whole-of-society approach is necessary. This would entail emphasising the dignity and intrinsic value of people beyond utility. We have to transcend the divides between the old and young, and the able and disabled.\nIntergenerational mingling can help, as would initiatives such as the NUS Longitudinal Patient Experience. This offers students in healthcare-related disciplines the opportunity to journey with seniors over time to foster greater empathy and appreciation of the lived experience of seniors.\nIn his timely ST Forum letter, emeritus consultant Quah Thuan Chong lamented the lack of love in medical practice. Love, according to philosopher and theologian Thomas Aquinas, involves willing the good of the other.\nTreatment decisions involving frail seniors and PLWDs are often complex, nuanced and multivalent. It behoves us to navigate them with wisdom, humility and love, so that no one is discriminated against.\nPhilip Yap is the chairman of Dementia Singapore. Gabriel Wong is a volunteer and Jason Foo is the chief executive officer of the same organisation.", "url": "https://www.straitstimes.com/opinion/are-doctors-biased-against-older-patients-and-those-with-dementia"}