{"authors": ["Li Xueying"], "date_download": "2024-10-12 14:19:26", "date_modify": "2024-10-12 14:19:26", "date_publish": "2022-04-13 10:41:00", "description": "In Short brings to you selected Opinion pieces in bite-sized portions. This is a shorter version of the full commentary.https://www.straitstimes.com/opinion/onmymind-keeping-sight-of-spore-story-as-we-navigate-big-power-dynamics Read more at straitstimes.com.", "filename": "opinion_discerning-the-many-stripes-of-pro-china-singaporeans_1728742766.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/brightcove-thumbnails/_eKhpMwFqsqet1pH-nDC_JVUcKOVDctUF2SvXV-UjUA.jpg?VersionId=5JdTogkJxonQh6eq3WkLmauBWYHmME7C", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_discerning-the-many-stripes-of-pro-china-singaporeans_1728742766.html", "title": "Discerning the many stripes of pro-China Singaporeans", "title_page": "Discerning the many stripes of pro-China Singaporeans | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "In Short brings to you selected Opinion pieces in bite-sized portions. This is a shorter version of the full commentary.\nThe Straits Times' YouTube channel is not where one usually airs family worries. But that is what Mr Quek Liwei did recently.\nHe wrote about a family member: \"In recent years, he was influenced by pro-Chinese YouTube content. He is not interested in Singapore news and affairs. He is only interested in China and the US.\n\"If you disagree with his opinion, he will be very angry and shout at you. So, the best approach is to ignore his WhatsApp messages and don't talk about current affairs at home. I find it very sad that the world is changing and society is divided.\"\nSuch anecdotes of family tensions over clashing views on the United States-China rivalry have made the rounds in recent years.\nIt was not unforseen. Seven years ago, the pre-eminent historian Wang Gungwu wrote a prescient essay on Singapore's \"Chinese dilemma\" as China ascends.\nHe noted that the Chinese in South-east Asia - Singapore being a case in point - are known to have a strong sense of ethnic identity.\nHe also made the point that even as modern Chinese communities shed traits that are quintessentially Chinese, they may paradoxically become more alike in lifestyles and even thought processes, no matter where they live.\nProfessor Wang then sketched out various scenarios in which Singapore will be sorely tested. Among them: if a conflict involving China and the US - \"on whose commitment in the Asia-Pacific region the State has pinned great hopes\" - breaks out.\n\"Some segments of Singapore's Chinese population may sympathise with China,\" he wrote.\n\"If that happens, Singapore would have to make extra efforts to demonstrate its national coherence. At worst, it may have to join with others to determine the rights and the wrongs of the conflict and openly take sides.\"\nToday, as the geopolitical struggle between China and the US takes on an increasingly brittle edge, temperatures on Singapore have indeed risen in tandem.\nDebates rage on in social media, online forums and family WhatsApp chat groups. At home, older Chinese-educated folks may be watching China's state-owned CCTV news in the living room, while their offspring binge on Netflix in their bedroom.\nA 2021 survey by the Pew Research Centre found that Singaporeans were the only ones among developed economies in the Asia-Pacific to view China more favourably than the US.\nPropaganda is a major driving force. The Chinese state's way of viewing nationality through ethnic heritage lenses - or the bloodline principle - means that Singapore is a natural target for Chinese political influence operations.\nA report in 2011 by the research institute of France's ministry of the armed forces said that Beijing's main narrative describes Singapore as a \"Chinese country\", part of the \"Greater China\" that owes its loyalty to China.\nWhile Singaporeans have long been used to the diverse flows of information from the US and other Western sources, the more recent onslaught of pro-China videos, articles and memes has made its impact felt.\nYet, identities are complex, and it will also not be fair to assume that all Singaporeans who feel the pull of China feel it solely from the power of propaganda.\nMany Singaporeans have long harboured dual if not multiple identities. Those who felt an emotional affinity for China - some are older, Chinese-educated and perhaps feel themselves disadvantaged - have tended to cloak their sentiments, for historical and political reasons.\nNow, their time has come. China's progress has gained it a growing chorus of admirers, who offer safety and affirmation in taking a certain stance. For others, it is about economic opportunities.\nThere is a genuine belief that their stance holds merit, and that they have arrived at their views independently, as my colleagues found when interviewing some Singaporeans - Mr Michael Chan, Mr Rodney Tan and Mr Tan Ming Hui - for an ST CloseUp documentary, China Calling.\nAnd then there are those who identify strongly as Chinese because of their attraction to Chinese culture and heritage, without necessarily viewing their identities in political terms.\nAs Prof Wang noted, in a later interview in 2018: \"There are many shades of grey (in this world), and we need to be sensitive to the varieties of human experience.\"\nIn navigating today's world of big power dynamics, there is a lot at stake if we Singaporeans let ourselves slip unthinkingly into taking positions that echo that of others, be they the US or China.\nMuch has been eloquently said about the critical need for Singaporeans to be just on one side: the Singapore side.\nThe question is, how?\nAs we sort ourselves into separate camps, it can be easy to oversimplify the other person's motivations or beliefs. At best, we dismiss and disengage. At worst, there is derogatory labelling, all around.\nThat is ultimately damaging to our unity as Singaporeans first, not to mention personal relationships with family and friends who don't see eye to eye with us.\nThere is no easy answer to dealing with highly emotive issues, but perhaps a starting point is to simply try to listen to why one's fellow countrymen think what they think, and do our best to disentangle the threads of their experiences from which their beliefs are woven.\nUltimately, our individual identities are deeply personal, borne out of our varied life stories and the meaning we make out of them.\nBut if we look for it, we may be able to find enough common ground in our shared experience here. And that can only be good for the Singapore story.", "url": "https://www.straitstimes.com/opinion/discerning-the-many-stripes-of-pro-china-singaporeans"}