{"authors": ["Ravi Velloor"], "date_download": "2024-10-12 13:45:31", "date_modify": "2024-10-12 13:45:31", "date_publish": "2023-10-05 05:00:00", "description": "Who killed Hardeep Singh Nijjar? Canada sees the hand of Indian government agents in it. But unravelling the mystery is not easy as more than one party had reason to want him dead. Read more at straitstimes.com.", "filename": "opinion_killing-of-canadian-sikh-a-murder-wrapped-in-mixed-motives_1728740731.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/05/dw-hardeep-231003.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_killing-of-canadian-sikh-a-murder-wrapped-in-mixed-motives_1728740731.html", "title": "Killing of Canadian Sikh: A murder wrapped in mixed motives", "title_page": "Killing of Canadian Sikh: A murder wrapped in mixed motives | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "In the annals of Indian anti-terror law enforcement, the July 1992 arrest of Lal Singh under the Terrorist and Disruptive Activities (Prevention) Act by Mumbai police is regarded as something of a landmark.\nIndia’s Intelligence Bureau (IB) had relayed information that the dreaded Sikh militant, who figured in the country’s most wanted list, was on a train headed to the metropolis. He was said to have a trunk full of explosives with him, and be wearing clothes of a particular colour.\nBut when the train arrived at Mumbai’s Dadar Station, the posse of some 40 plain-clothes men could not easily spot the shaven Sikh among the disembarking passengers; he had changed clothes just before the train entered the city.\nEventually, a police sub-inspector thought he had his suspect, whispered an alert over his concealed radio and, cutting diagonally into the hurrying man’s path, grabbed him in a body lock as colleagues swarmed in to wrench the luggage away from his grasp. It turned out that the Mumbai police had indeed got their man.\nWhen superior officers questioned the sub-inspector about how he had been so sure of his mark, the officer responded that in the notes sent down by the IB was a line that Lal Singh’s right hand was possibly weaker than his left.\nThe officer had noted that as he departed the station on foot, Lal Singh often switched the luggage from hand to hand, and tended to carry the trunk a few moments longer in his stronger left hand.\nThose detailed IB notes were the work of the bureau’s then joint director (operations) Ajit Doval, considered in the trade to be a quintessential “operations man”.\nMr Doval’s field successes are reputedly so immense that he is the only police officer to have been awarded a Kirti Chakra by the Indian state, a high decoration awarded to military personnel for valour away from the battlefield.\nToday, Mr Doval is India’s National Security Adviser (NSA), overseeing the intelligence agencies and the nuclear triad. The fifth to hold the job since the office of the NSA was created in 1998, he is the only one to date to carry Cabinet rank.\nSo sure is he of his standing with Prime Minister Narendra Modi that in a national capital where proximity often is the source of power, he chooses to work not out of the Prime Minister’s Office as his predecessors did, but from a building a few kilometres away – the easier for him to meet the people he needs to meet without excessive attention.\n‘Doval doctrine’\nPeople who know Mr Doval say his persona combines a guard dog ferocity with a beat policeman’s sense of vigilance; former neighbours in his government housing complex say that at times when he returned late from meetings, he was apt to try their doors. Should one be found unlocked, he would ring the doorbell to deliver a scolding, regardless of the hour.\nHis reputation for “operations” and penchant to take the fight to the enemy have been dubbed the “Doval doctrine” by a former head of India’s external intelligence arm RAW, or Research and Analysis Wing.\nMr Doval himself can be seen on a publicly available YouTube video threatening Pakistan that another terrorist strike along the lines of the 2008 attack on Mumbai that left 166 people dead, including a Singaporean woman lawyer staying in a city hotel, could see Islamabad losing Balochistan, Pakistan’s largest province by territory and home to a restive populace.\n“We engage an enemy in three modes,” he says in the lecture, delivered shortly after he was appointed NSA in 2014.\n“One is defensive. If somebody comes here, we will prevent him. One is defensive-offence. To defend ourselves, we will go to the place where the offence is coming. And the third is direct attack.\n“We are working today only on the defensive mode... Once they know India has shifted its gear from defensive mode to defensive offence, they will find that it is unaffordable for them. You can do one Mumbai, you may lose Balochistan.”\nAn Indian spokesman called the allegation “absurd” and External Affairs Minister S. Jaishankar later said “we told the Canadians that this is not the government of India’s policy”.\nMr Trudeau has yet to produce the evidence to back the claim. Perhaps he cannot; some of it came from partners in the Five Eyes intelligence sharing arrangement, which demands full sharing of information but also secrecy in handling what is shared.\nIt does not help him either that the killers are yet to be caught, although it appears that at least four people were involved in the shooting – two gunmen and two others in the getaway car.\nSo, more than hard evidence, it appears that snatches of telephone intercepts, and human intelligence, seem to be the basis for the allegation. For now, at least.\nDr Jaishankar says that if Canada shares specific information, “we will look at it”.\nMixed motives in Canada\nAn emerging theory advanced by some people is that mixed motives concerning more than one party were involved.\nAmong those who hold this view is Canadian commentator Terry Milewski, author of a book on the Khalistan movement which he has covered since Canada-based Sikh militants conducted an in-flight bombing of an Air India plane in 1985, killing all 329 on board.\nIn 2022, Mr Ripudaman Singh Malik, the Canadian Sikh accused of funding the attack, was killed in British Columbia.\nMr Malik, who was subsequently acquitted of the charges, had latterly seemed to have made peace with the Indian state, having praised Prime Minister Modi publicly, and even thanking him for helping the Sikh community.\nThat fetched him plenty of enemies within his community. Mr Malik, noted Mr Milewski, also had a long-running feud with Mr Nijjar on a host of issues, including business-related ones.\nAs the Malik camp planned to get even, goes this theory, it may have got a nod and a wink from covert Indian state actors whose interests to bring Mr Nijjar to justice converged with that of Mr Nijjar’s detractors.\nAs a now-retired senior Indian Police Service officer put it, a full-scale assassination abroad would not only be most unusual but would need to be sanctioned at very high levels.\nMr Doval would have needed to know. Had he indeed given consent, given his reputation for meticulous planning, it is unlikely that it would ever have been traced back to India.\nBut this officer points to the Lal Singh arrest to argue that Mr Nijjar did not rank so high on the threat list as to warrant a planned extermination in full public view.\nWhen a high-value target like Lal Singh is picked up, he explained, security agencies have the following options: eliminate the man after interrogation if his criminal record is overwhelming – as they have sometimes done – or attempt to turn him and thus help the agencies infiltrate terrorist ranks.\nThe third, of course, is to go through the lengthy court process and hopefully find a judge who would agree to put the man away for years.\nSince there were no cellphone cameras in 1992, and the snatch was clean and quick, the agencies could easily have done away with Lal Singh without leaving a trace, this officer argues. But the state chose to prosecute Lal Singh and he subsequently spent 28 years in prison, freed only in 2020 as part of an amnesty programme.\nPatriotic gangsters\nThat said, there is some evidence to suggest that India’s agencies are not above using the underworld to perform operations too risky, or potentially too complicated, for themselves. Apparently, several other nations also use such methods.\nIndeed, Mr Doval’s biggest career embarrassment came in mid-2005 when the Mumbai police followed gangster Vicky Malhotra to New Delhi and, upon surrounding him, discovered Mr Doval also on the premises.\nApparently, the two had been discussing the elimination of Dawood Ibrahim, a Mumbai underworld figure now living overseas as a fugitive.\nMalhotra was a former hit man for Dawood and had fallen out with his boss.\nThere are no winners in the spat that has erupted between Ottawa and New Delhi. Canadian-Indian ties are broken, at least until either Mr Modi or Mr Trudeau leaves office.\nMr Trudeau’s dilemma is whether he should reveal all he knows and risk the wrath of the Western world that is so desperately trying to woo India to its side, or keep quiet and endure a massive hit to his credibility that might cost him his government’s tenuous hold on power, dependent as it is on the conditional support of a leftist party led by a Sikh figure sympathetic to the Khalistan cause.\nCanada’s liberal traditions which give shelter and freedom to several subject to government probes elsewhere are being questioned.\nLast week, Bangladesh Foreign Minister A.K. Abdul Momen pointed out that one of the key accused in the 1975 assassination of his country’s founding father Sheikh Mujibur Rehman had been given political asylum by Ottawa.\nCanada, he said, must not be a “hub of all the murderers”.\nAnd even diehard liberals in Asia look askance at a nation that permits a tableau depicting an Indian premier’s assassination by her Sikh bodyguards to be paraded in a flatbed truck – all in the name of freedom of expression.\nRegardless of the merits, or otherwise, of Mr Trudeau’s accusation, it is inevitable that India takes a massive hit from his publicly stated charge.\nAside from the reputational damage, every counter-intelligence agency in the world will doubtless step up surveillance of Indian diplomats and missions. That would make their everyday jobs that much harder.\nAlso, India’s politicians will soon be going to the ground as the national election approaches – potentially exposing them to physical danger, especially from those who might have led themselves to believe that key people from their community had been unfairly targeted by the agencies.\nWhile there is next to no support for a Khalistan among India’s Sikhs, there is spreading unease among minorities, particularly Muslims but also Christians and even the prosperous Sikhs, about the majoritarian trajectory of the Indian state. There’s plenty for India’s enemies to work with.\nSenior Columnist Ravi Velloor served as the New Delhi-based South Asia Bureau chief of ST from 2005-2012. His book, India Rising: Fresh Hope, New Fears, was released in 2016.\nMore of his insights on the murder case and related issues can be found in this podcast.", "url": "https://www.straitstimes.com/opinion/killing-of-canadian-sikh-a-murder-wrapped-in-mixed-motives"}