{"authors": [], "date_download": "2024-10-12 13:28:21", "date_modify": "2024-10-12 13:28:21", "date_publish": "2024-08-08 05:00:00", "description": "Recently, I drove my aunt to the National Heart Centre Singapore in Outram. Read more at straitstimes.com.", "filename": "opinion_forum_forum-signage-for-sgh-campus-buildings-thoughtfully-designed_1728739701.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/btnni20240808.jpg?VersionId=A.ixTjAleIxcsZdqVKFSiZ0470eje5gk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-signage-for-sgh-campus-buildings-thoughtfully-designed_1728739701.html", "title": "Forum: Signage for SGH campus buildings thoughtfully designed", "title_page": "Forum: Signage for SGH campus buildings thoughtfully designed | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Recently, I drove my aunt to the National Heart Centre Singapore in Outram.\nAs I approached the area, I saw the new buildings for Singapore General Hospital and the National Neuroscience Institute.\nIt struck me how clear the signage is. The names are spelt out in full at just the right level for drivers like me. Also, at the top of the buildings are the logos and initials of the institutions.\nI was also impressed by the thinking behind having different colours for the two organisations.\nThis is a simple, practical move which makes it clearer for people like me who are rushed and stressed when we visit the hospital. My aunt even remarked that the choice of colours somehow cheered her up.\nAs healthcare needs in Singapore continue to grow, we need more doctors, nurses and other healthcare professionals.\nEqually, we need talented, dedicated people in the operations, design, administrative and management divisions too. I hope this serves as an encouragement to them.", "url": "https://www.straitstimes.com/opinion/forum/forum-signage-for-sgh-campus-buildings-thoughtfully-designed"}