{"authors": [], "date_download": "2024-10-12 13:53:55", "date_modify": "2024-10-12 13:53:55", "date_publish": "2024-08-16 05:00:00", "description": "I refer to the reports “35 evacuated after fire linked to e-bike battery breaks out in Clementi flat” (Aug 9) and “Fires involving active mobility devices rise again; total number of blazes up 8.6% in 2023: SCDF” (Feb 21). Read more at straitstimes.com.", "filename": "opinion_forum_letter-of-the-week-take-steps-to-prevent-pmas-from-catching-fire-in-trains_1728741235.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/16/IMG3512.JPG?VersionId=C2z9meCAq.r33jX6bIqcOJ8tVvzTi1mI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_letter-of-the-week-take-steps-to-prevent-pmas-from-catching-fire-in-trains_1728741235.html", "title": "Letter of the week: Take steps to prevent PMAs from catching fire in trains", "title_page": "Letter of the week: Take steps to prevent PMAs from catching fire in trains | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I refer to the reports “35 evacuated after fire linked to e-bike battery breaks out in Clementi flat” (Aug 9) and “Fires involving active mobility devices rise again; total number of blazes up 8.6% in 2023: SCDF” (Feb 21).\nIn 2021, a man died after his personal mobility device burst into flames while he was in a lift. An inquiry found that the battery had been modified. The battery was not even being charged then, yet it exploded.\nWe need stringent measures to prevent something like this from happening in our public transport system.\nIn March, the Government accepted recommendations from the active mobility advisory panel on regulations for personal mobility aids (PMAs). The scope covered certification of users of mobility scooters, speed limits and dimension restrictions for PMAs on public paths.\nWith mobility scooters getting more popular with the rapidly ageing population, there should be stricter rules and regulations governing their use – in particular, the fire and electrical safety standards of such devices.\nAll motorised personal mobility devices used on public paths must be certified to the UL2272 standard. However, this does not apply to mobility scooters.\nIf all mobility scooters are also required to have the UL2272 certification, with original batteries, this would discourage people from modifying the batteries. And if registration with number plates issued is also required, it would make it much easier for MRT staff to ascertain which scooters are safe to go on the trains.\nBesides safeguarding the public transport system, we would also be safeguarding malls, hawker centres and homes. We should not take any chances with safety.", "url": "https://www.straitstimes.com/opinion/forum/letter-of-the-week-take-steps-to-prevent-pmas-from-catching-fire-in-trains"}