{"authors": ["Gan Kim Yong", "Lawrence Wong", "Ong Ye Kung"], "date_download": "2024-10-12 13:30:27", "date_modify": "2024-10-12 13:30:27", "date_publish": "2021-06-24 05:00:00", "description": "It involves vaccination, testing, treatment and social responsibility. Read more at straitstimes.com.", "filename": "opinion_living-normally-with-covid-19_1728739827.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/06/23/af_observationrarea_2306.jpg?VersionId=OU1YWGWU3p7PIjY7YlsA2yh2d6IVuNNe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_living-normally-with-covid-19_1728739827.html", "title": "Living normally, with Covid-19: Task force ministers on how S'pore is drawing road map for new normal", "title_page": "Living normally, with Covid-19: Task force ministers on how S'pore is drawing road map for new normal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "We are continuing with our efforts to control the worrisome Delta variant of Covid-19. Given its high transmissibility, it will be hard to bring infections down to zero. Instead, we are adopting an aggressive ring-fencing strategy - casting a wide net to isolate contacts of infected persons, and testing tens of thousands every day. The aim is to minimise the risk of large clusters forming.\nBut it has been 18 months since the pandemic started, and our people are battle-weary. All are asking: When and how will the pandemic end?\nEndemic Covid-19\nThe bad news is that Covid-19 may never go away. The good news is that it is possible to live normally with it in our midst. This means Covid-19 will very likely become endemic. But what does that mean?\nIt means that the virus will continue to mutate, and thereby survive in our community. One example of such an endemic disease is influenza. Every year, many people catch the flu. The overwhelming majority recover without needing to be hospitalised, and with little or no medication. But a minority, especially the elderly and those with co-morbidities, can get very ill, and some succumb.\nIn a large country, the number hospitalised from influenza can be huge. For example, in the United States, hundreds of thousands are hospitalised every year because of the flu, and tens of thousands die.\nBut because the chances of falling very ill from influenza are so low, people live with it. They carry on with their daily activities even during the flu season, taking simple precautions or getting an annual flu jab.\nWe can work towards a similar outcome for Covid-19. We can't eradicate it, but we can turn the pandemic into something much less threatening, like influenza, hand, foot and mouth disease, or chickenpox, and get on with our lives.\nDoing so will be our priority in the coming months. We already have a broad plan.\nVaccination is key\nFirst, vaccination. During his broadcast on May 31, the Prime Minister said we aimed to have two-thirds of our population take at least their first dose by early July. We are on track to achieve that target. Our next milestone will be to have at least two-thirds of our population fully vaccinated with two doses around National Day, supply permitting.\nWe are working to bring forward the delivery of vaccines and to speed up the process.\nThe evidence is clear: Vaccines are highly effective in reducing the risk of infection as well as transmission. Even if you are infected, vaccines will help prevent severe Covid-19 symptoms.\nIsrael's experience shows that the infection rate among vaccinated persons is 30 times less than that of the unvaccinated. The hospitalisation rate for the vaccinated is also lower - by 10 times.\nEarly evidence suggests that with vaccination, we can tame Covid-19. Again, the experience of Israel - which has vaccinated 60 per cent of its population, the highest vaccination rate in the world currently - is pertinent.\nAcross all age groups, the hospitalisation rate due to Covid-19 in Israel among those fully vaccinated is 0.3 per 100,000 persons daily, and the mortality rate is 0.1 per 100,000 persons.\nIn comparison, in 2018/19, the hospitalisation and mortality rates for influenza in the US were 0.4 and 0.03 per 100,000 persons daily, respectively. In a severe flu season, like in 2017/18, the rates were 0.67 and 0.05, respectively.\nEssentially with a high rate of vaccination, Israel has brought the clinical outcomes of Covid-19 close to that of seasonal influenza in the US. These are very promising outcomes.\nTesting will be easier\nSecond, testing and surveillance will still be needed, but the focus will be different. We would still need rigorous testing at our borders to identify any person carrying the virus, especially variants of concern.\nDomestically, testing will be less of a tool for ring-fencing and quarantining people exposed to infected persons. Instead, it would be to ensure that events, social activities and overseas trips can take place safely; as well as to reduce transmission risks, especially to those who are vulnerable to infections.\nTreatments will improve\nThird, scientists around the world are working on treatments for Covid-19. Today, we already have a range of effective treatments, which is one reason why Singapore's Covid-19 mortality rate is among the lowest in the world.\nEighteen months after the pandemic started, we now have many therapeutic agents that are effective in treating the critically ill, quickening recovery, and reducing disease progression, severity and mortality. The Ministry of Health tracks these developments closely, ensuring that we have adequate supplies of these drugs. Our medical researchers actively participate in the development of new treatments.\nSocial responsibility remains critical\nFinally, whether we can live with Covid-19 depends also on Singaporeans' acceptance that Covid-19 will be endemic and our collective behaviour.\nIf all of us practise good personal hygiene, we are less likely to be infected. If all of us are considerate to one another, staying away from crowds when we feel unwell, we will reduce transmission. If all of us shoulder the burden together - workers keeping their colleagues safe by staying at home when ill, and employers not faulting them - our society will be so much safer.\nTowards a new normal\nWith vaccination, testing, treatment and social responsibility, it may mean that in the near future, when someone gets Covid-19, our response can be very different from now.\nThe new norm can perhaps look like this:\nFirst, an infected person can recover at home, because with vaccination the symptoms will be mostly mild. With others around the infected person also vaccinated, the risk of transmission will be low. We will worry less about the healthcare system being overwhelmed.\nSecond, there may not be a need to conduct massive contact tracing and quarantining of people each time we discover an infection. People can get themselves tested regularly using a variety of fast and easy tests. If positive, they can confirm with a PCR test and then isolate themselves.\nThird, instead of monitoring Covid-19 infection numbers every day, we will focus on the outcomes: how many fall very sick, how many in the intensive care unit, how many need to be intubated for oxygen, and so on. This is like how we now monitor influenza.\nFourth, we can progressively ease our safe management rules and resume large gatherings as well at major events, like the National Day Parade or New Year Countdown. Businesses will have certainty that their operations will not be disrupted.\nFifth, we will be able to travel again, at least to countries that have also controlled the virus and turned it into an endemic norm. We will recognise each other's vaccination certificates. Travellers, especially those vaccinated, can get themselves tested before departure and be exempted from quarantine with a negative test upon arrival.", "url": "https://www.straitstimes.com/opinion/living-normally-with-covid-19"}