{"authors": [], "date_download": "2024-10-12 13:55:26", "date_modify": "2024-10-12 13:55:26", "date_publish": "2023-10-09 05:00:00", "description": "I was surprised to find out recently that the Animal and Veterinary Service (AVS) does not stipulate in its guidelines or make it mandatory for pet shops and breeders to sell only neutered or spayed pets to customers. Read more at straitstimes.com.", "filename": "opinion_forum_forum-make-it-mandatory-for-pet-shops-to-sell-only-sterilised-animals_1728741326.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/09/st-forum-thumbnail_3.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-make-it-mandatory-for-pet-shops-to-sell-only-sterilised-animals_1728741326.html", "title": "Forum: Make it mandatory for pet shops to sell only sterilised animals", "title_page": "Forum: Make it mandatory for pet shops to sell only sterilised animals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I was surprised to find out recently that the Animal and Veterinary Service (AVS) does not stipulate in its guidelines or make it mandatory for pet shops and breeders to sell only neutered or spayed pets to customers.\nWhat does this mean? Irresponsible customers may use these pets to breed illegally for profit. This can result in overpopulation and abandonment of pets. Sterilising a pet is important because it stops family pets from having accidental litters. No accidental puppies or kittens means a smaller animal population, fewer crowded shelters and fewer cases of euthanasia.\nResearch has shown the benefits of neutering and spaying pets, which include the prevention of major health issues such as mammary cancer and womb infections. Sterilising pets can prolong their lifespans and also reduce the likelihood of potentially deadly diseases and unwanted behaviour.\nThe Cat Welfare Society (CWS) has established a wide sterilisation programme in Singapore. The Society for the Prevention of Cruelty to Animals (SPCA) has also worked tirelessly to improve animal welfare here.\nNot making it mandatory for shops and breeders to sell only sterilised pets works against CWS’ efforts to improve the welfare of stray cats. It can also nullify what SPCA has been doing for many years to improve animal well-being. All this can result in an upsurge in cruelty cases, because unwanted dogs and cats can end up being abandoned, neglected or even abused.\nAVS has been conducting a review of the pet sector, and is also conducting a public consultation on managing pets and community cats in Singapore.\nSpaying and neutering should be made mandatory and seen as a normal part of responsible pet ownership. I hope AVS will make it mandatory for pet shops to sell only spayed or neutered pets in Singapore.", "url": "https://www.straitstimes.com/opinion/forum/forum-make-it-mandatory-for-pet-shops-to-sell-only-sterilised-animals"}