{"authors": [], "date_download": "2024-10-12 13:49:05", "date_modify": "2024-10-12 13:49:05", "date_publish": "2024-02-12 05:00:00", "description": "While all three candidates have green policies, questions remain about how effective they will be. Read more at straitstimes.com.", "filename": "opinion_st-editorial_indonesia-s-big-climate-challenge_1728740945.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/12/st-editorial.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_st-editorial_indonesia-s-big-climate-challenge_1728740945.html", "title": "Indonesia’s big climate challenge", "title_page": "Indonesia’s big climate challenge | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "On the campaign trail for Indonesia’s Feb 14 presidential election, all three contenders have vowed to ramp up the fight against climate change and do more to protect the environment. This is a welcome change. These key issues did not figure so prominently in the 2019 election. The manifestos of the three candidates – Defence Minister Prabowo Subianto, former Central Java governor Ganjar Pranowo and former Jakarta governor Anies Baswedan – pledge to accelerate efforts to achieve net-zero emissions and protect forests. Mr Anies has pledged to work towards achieving net-zero emissions by 2050, reduce the rate of forest destruction and promote reforestation and rehabilitation. Mr Ganjar wants to limit the use of plastics, cut air pollution from vehicle and industrial emissions, maintain forests and improve the greening of coastal areas. Mr Prabowo backs greater use of biofuels, expansion of food estates, carbon taxes and trading of carbon offsets from nature-based projects, such as forests.\nThe concern is that many of these pledges lack detail. After a recent public debate, the candidates and their vice-presidential running mates were criticised for their failure to go deeper into their green policies. Yet, the next president will need to get into the details because the nation faces many environmental challenges. Indonesia, South-east Asia’s biggest carbon emitter, remains deeply dependent on coal for energy and is the world’s largest exporter of coal used in power plants. Coal production hit a record in 2023, and the nation is building more coal plants to power mineral processing zones. More mines are also being built, causing more pollution.", "url": "https://www.straitstimes.com/opinion/st-editorial/indonesia-s-big-climate-challenge"}