{"authors": [], "date_download": "2024-10-12 13:53:52", "date_modify": "2024-10-12 13:53:52", "date_publish": "2024-08-02 05:00:00", "description": "I refer to the Straits Times article, “Dog found dead hanging by a leash at grooming salon; NParks investigating” (July 25), and the Society for the Prevention of Cruelty to Animals (SPCA) Facebook statement about the incident. Read more at straitstimes.com.", "filename": "opinion_forum_letter-of-the-week-impose-stricter-laws-and-heavier-penalties-to-regulate-pet-grooming-industry_1728741232.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/st-forum-thumbnail.jpg_0.JPEG?VersionId=NDGPg811mKSZfQtWLR0trPVAepp7k3K.&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_letter-of-the-week-impose-stricter-laws-and-heavier-penalties-to-regulate-pet-grooming-industry_1728741232.html", "title": "Letter of the week: Impose stricter laws and heavier penalties to regulate pet grooming industry", "title_page": "Letter of the week: Impose stricter laws and heavier penalties to regulate pet grooming industry | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I refer to the Straits Times article, “Dog found dead hanging by a leash at grooming salon; NParks investigating” (July 25), and the Society for the Prevention of Cruelty to Animals (SPCA) Facebook statement about the incident.\nI was sick to my stomach watching the video of Fendi the corgi choking to death at the grooming salon.\nThis is not the first such case. It was reported in May 2023 that another groomer was fined $8,000 and disqualified for nine months after a dog died in 2021 in similar circumstances.\nAnother groomer was caught on video rough-handling a poodle. After the initial furore, this shop has reopened under a new name in the same location.\nThe number of dog licences in Singapore increased from about 70,000 in 2019 to about 87,000 in 2022, according to the Animal and Veterinary Service.\nIn tandem, there has been a proliferation of pet shops and pet grooming businesses since the pandemic. Anybody who has money and can wield a pair of scissors can set up a pet grooming shop easily here.\nThere is no legal requirement for these so-called pet groomers to be trained professionally or certified. Groomers here are not required to be licensed and need not undergo professional pet safety and management courses.\nAs pointed out by the SPCA, “while there are some minimum standards specified under the Code of Animal Welfare (for the Pet Industry), failure to comply is not considered an offence”.\nAs a pet owner, I urge the authorities to change animal protection laws to specify pet groomers’ legal obligations and hand out heavier penalties to errant businesses as a deterrent to those who wish to make quick profits and disregard pet safety.\nLet us prevent another needless death.", "url": "https://www.straitstimes.com/opinion/forum/letter-of-the-week-impose-stricter-laws-and-heavier-penalties-to-regulate-pet-grooming-industry"}