{"authors": [], "date_download": "2024-10-12 13:30:36", "date_modify": "2024-10-12 13:30:36", "date_publish": "2021-01-26 05:00:00", "description": "The theme of the conference is aptly titled Reset. There's still great uncertainty about how the coronavirus will reshape our society in the coming years. But there is no doubt that Covid-19 is the most serious crisis the world has faced in a long time. The virus has already changed our world, and we have to be prepared for more changes to come. Read more at straitstimes.com.", "filename": "opinion_covid-19-challenges-and-3-resets-lawrence-wong-0_1728739836.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/01/27/ST_20210126_IPSLAWRENCE_6287335.jpg?VersionId=dm1QDTNtSOeMo3fkb_FZ4NduhP4zGmGe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_covid-19-challenges-and-3-resets-lawrence-wong-0_1728739836.html", "title": "Covid-19 challenges and 3 resets: Lawrence Wong", "title_page": "Covid-19 challenges and 3 resets: Lawrence Wong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The theme of the conference is aptly titled Reset. There's still great uncertainty about how the coronavirus will reshape our society in the coming years. But there is no doubt that Covid-19 is the most serious crisis the world has faced in a long time. The virus has already changed our world, and we have to be prepared for more changes to come.\nI think it's useful to think of these changes over different timeframes. For this year and maybe even a good part of next year, we must be prepared to live in an acutely changed world, meaning that the rules of wearing masks, upholding safe distancing rules and avoiding crowded places will continue to be part of everyday life.\nBeyond that, the availability of Covid-19 vaccinations will progressively restart global travel. But getting the world vaccinated won't be quick or easy. It will take time for vaccines to be manufactured and distributed, and even longer before the world gradually builds up immunity.\nPOST-PANDEMIC WORLD\nWhat will this new post-Covid-19 world look like? No one can tell. Some positive changes will certainly arise. In Singapore, the pandemic has prompted greater awareness of hygiene habits and social responsibility. Singaporeans have become more conscious about washing and sanitising their hands.\nIn a crisis like this, the natural tendency is to extrapolate the worst from our immediate circumstances. For example, some predict that digital technologies will accelerate the move towards less dense living and working arrangements, and render cities obsolete.\nBut predictions about the decline of cities, I think, are premature. Throughout history, pandemics have not dampened the waves of urbanisation nor the flourishing of innovation taking place in cities everywhere.\nAfter the yellow fever pandemic hit Philadelphia in 1793, Thomas Jefferson said this would \"discourage the growth of great cities in our nation\". Now look what happened in the United States after that. After the 1918 Spanish flu pandemic, we saw the Roaring Twenties and a boom in major cities like Chicago and New York City. If history is a guide, it has shown that cities can bounce back from catastrophe and emerge stronger than before.\nThe reason this happens is that cities are not just buildings and monuments, they are fundamentally about the people who dwell in them. Humans are by nature social animals. We are naturally drawn to participation, collaboration and social interactions. We are also adaptable and capable of adjusting to new situations.\nSo we have the ability to shape what our future looks like, and as suggested by the theme of the conference, let us think of this crisis as setting the stage for a software update - a \"reboot\" of sorts after the tremendous damage inflicted by the virus.\nBeyond the immediate task of protecting lives and livelihoods, I would like to highlight three resets that we must make in our policy thinking, our lifestyles and our mindsets, even as we tide over the immediate season.\nA FAIRER AND MORE EQUAL SOCIETY\nFirst, we must reset our social compact to emerge as a fairer and more equal society. The pandemic may be indiscriminate about who it infects, but its impact is anything but equal. It has in fact widened the gulf between the haves and the have-nots.\nGlobally, we see poorer segments of society paying a heavier price - be it in terms of economic impact or access to healthcare. That's why governments all over the world have had to spend huge sums to help their people cope.\nIn Singapore, it's always been at the top of the Government's agenda to reduce inequality and ensure a meritocratic system that works for the good of all.\nWe recognise that markets are incredibly powerful - they inject dynamism, transform societies, and give people from all backgrounds a chance to better their lives.\nBut free markets have their flaws. They create anxieties and stresses about technological change and foreign competition, and we see a continued stretching of incomes and wealth.\nSo we need a combination of open markets and effective state intervention - to level the playing field at the starting point, provide support and buffers for every citizen to help them bounce back from setbacks, and to equip them to excel in an uncertain environment of global competition and technological change.\nWe started this journey more than a decade ago when we tilted social policies actively in favour of the lower-income group, for example, through Workfare, and through a whole range of support programmes in education, housing and healthcare, and more recently by providing more retirement assurance through the Silver Support Scheme.\nIncome inequality in Singapore as measured by the Gini coefficient has in fact been trending downward.\nLast year, we rolled out a significant package of emergency measures. We are luckier than most countries in that we do not have to borrow to fund these measures. We were able to draw on our reserves to save jobs and tide over the Singaporeans who are hardest hit. These temporary measures will have to be tapered down this year as the economy improves, and to ensure our finances remain sustainable.\nBut the impact of the pandemic has created added impetus to strengthen our social support system. So there will be a permanent shift towards further strengthening of our social safety nets to protect the disadvantaged and vulnerable, and we will have to work out how this will be sustainable over the longer term. The bottom line is that we aim to give Singaporeans more assurance in an uncertain post-Covid-19 world.\nBeyond tackling inequality, we must keep our society fluid and mobile. Meritocracy in Singapore must not ossify into a hereditary system where the condition of your birth determines the outcome of your life. How do we achieve this?\nWe start by intervening early and uplifting our children from birth. That's a key focus and priority for me in the Ministry of Education. That's why we're making significant investments in pre-school. We want to make sure you don't need expensive private enrichment classes. Instead, all can benefit from quality programmes in Ministry of Education (MOE) kindergartens and across our anchor and partner operators, where fees are kept affordable and regulated.\nWe're now looking at the earliest years of childhood, even at the pre-natal stage, where the well-being of a pregnant mother can have lasting effects on a child's development. Early intervention is effective, and we are going all out to do more on this front.\nWe are continuing this strong support in schools. Since joining MOE, I've made it a point to visit schools with a higher proportion of students from lower-income and disadvantaged family backgrounds. Some of our most committed and dedicated principals and teachers serve in these schools.\nWe are giving them more resources so they are able to provide additional support for their students - for example, learning support in smaller pull-out classes. And beyond academic support, exposure to a whole range of different activities and programmes, so that it's not just about improving their academic results but also nurturing soft skills, for example, through public speaking, through learning journeys, through overseas trips.\nWe are also deploying more allied educators, counsellors and welfare officers to support students, especially those with special needs.\nWe are also making fundamental shifts in our model of education. We don't want to front-load learning when someone is young, or treat education as a conveyor belt for the job market.\nInstead, we want to have a system of education for life, which is what we are doing through our national movement, SkillsFuture. We want to have multiple entry points across the age distribution and across the entire skills spectrum.\nBesides intervention in education, a broader mindset change is required. Societies everywhere today place too much of a premium on cognitive abilities, and do not value sufficiently those engaging in other forms of work.\nAs a result, merit has become narrowly defined by academic and cognitive abilities. But in fact, there's a wide range of abilities and aptitudes needed for societies to thrive - we need the craft skills of artisans and technicians; the creativity and imagination of artists; and the human touch of those doing care jobs.\nAnd the pandemic has thrown a spotlight on this imbalance. We've come to better appreciate the contributions of our essential workers, who help to keep our lives going - our allied health workers, contractors, security guards, food and beverage operators, transport workers, just to name a few. We must honour them for their work and accord them the dignity and respect they deserve.\nAnd that's why we are pushing on with moves across different jobs through our Progressive Wage Model. We are also reviewing Institute of Technical Education and polytechnic pathways to ensure graduates from these institutions get better jobs with higher pay, good career progression, and a strong foundation for lifelong learning.\nIf we attach more value in terms of prestige and income to people who excel across a wide range of fields and not just cognitively, incomes would naturally spread out more evenly across society, and we will go a long way in advancing our cause towards a fairer and more equal society.\nA GREENER SINGAPORE\nSecond, new habits from the pandemic show us that we can and must push for a greener Singapore. When human activity came to a standstill this year, carbon emissions around the world dropped significantly.\nAs the economic activities begin to pick up, we have to figure out a way forward. We cannot go back to the status quo ante. Aside from dealing with the crisis of the pandemic, climate change will be the existential emergency of our time. We must build a greener economy and society that is more environmentally sustainable.\nThis idea of sustainability is not new to Singapore. We are one of the greenest cities in the world. We are the only country in the world to freeze the growth of our vehicle population. We are one of a few countries to have closed its water loop, and to re-use every last drop of water. But we must go further and build on what we have done to achieve greener growth and greener mindsets.\nSo we are deploying more renewable energy like solar power, we are exploring regional power grids and investing in new capabilities like hydrogen and carbon capture, utilisation and storage. We are transforming our industries to be more sustainable and investing in research in new energy-and resource-efficient technologies.\nBeyond that, we have other ambitious plans. We are going to phase out vehicles with internal combustion engines and have all vehicles run on cleaner energy. We are making sustainable living a key feature of all Housing Board towns - where they incorporate features to reduce energy consumption, recycle rainwater and cool our towns. We will significantly cut greenhouse gas emissions and seek to achieve net zero emissions as soon as we can.\nSustainability can also be a new source of competitive advantage and open up new opportunities for growth and job creation. There is potential for Singapore to be a carbon trading and services hub in Asia, for example, in areas like sustainability consultancy, verification, carbon credits trading, and risk management. We can also be a leading centre for green finance in the region and globally.\nThe greatest promise of going green, however, is not what it will mean for us today. It's about building for the future - for our children and the next generation. We must embark on a sustainability movement, so that we can leave Singapore in a better shape for our future generations, just as previous generations have done for us.\nA STRONGER SPIRIT OF SOLIDARITY\nFinally, one silver lining in Covid-19 is that it can present an opportunity for us to strengthen our sense of social solidarity.\nThroughout history, we've seen societies rise and fall. What is it that enables some societies to thrive, while others go into decline? It's a big question.\nOne of our founding leaders, Mr S. Rajaratnam, used to ponder over this, and he would refer to the ideas of 14th-century Islamic philosopher and historian Ibn Khaldun, who wrote about the concept of asabiyyah - it's an Arabic word that describes the bond that exists in a community. In his view, it's this sense of community and solidarity that explains the rise and decline of society.\nWhen a community starts out, everyone is prepared for austerity and discipline together, people are prepared to make sacrifices for the common good, and society prospers. But as life becomes more comfortable, this sense of solidarity is weakened. People lose their social anchors and seek to advance their own individual interests. When that sense of community and common purpose is eroded, things start to fall apart.\nIn fact, before we were struck by Covid-19, there were already powerful forces chipping away at social cohesion - both here and in countries everywhere. Even today, in the midst of this pandemic, there are significant minorities around the world who think that Covid-19 is a hoax and does not really exist. This is a pandemic where 100 million have been infected and more than two million have died. When we do global surveys, it is not just 1 per cent or 2 per cent, it's a significant percentage who think it is a hoax.\nAnd this is the great irony. We are living in an age where everyone can access information so readily. People can access raw, instant, unfiltered information from multiple sources, and unfortunately, salacious falsehoods and conspiracy theories tend to gain circulation over facts. So the irony is, despite the overwhelming ease of access to information, we are living in a \"golden age of ignorance\".\nWe are also seeing the downgrading of expertise because experts are seen as out-of-touch elites, and expert knowledge is sometimes portrayed negatively as a conspiracy by the elites to perpetuate their dominance.\nWith easy access to information, everyone can claim to be an \"expert\". In a way, this is healthy, as experts do not always get things right, and you do need to have some level of questioning. But when you disregard expertise altogether, that's when the trouble starts. Or when we have a tendency to view expert advice from the narrow prism of our own social and political tribes - we end up self-selecting information to support and reinforce our own points of view. As a result, it makes it very hard to find consensus.\nAt the same time, going through a crisis like this can lead to renewed strength. Because we are forced to reflect deeply on our own values, we develop a more acute sense of shared memories and common destiny. We go through difficulties together, and we forge a stronger sense of group solidarity and social cohesion.\nSo which path will apply to Singapore? How will the pandemic change us? I am confident that we will prevail and emerge stronger from this crucible. And I do not say this lightly. I speak from my own conviction of seeing the best of Singaporeans over the past year, in the face of adversity and very tough conditions.\nI've seen front-line workers both in the public and private sectors giving their all, round the clock. I've seen many ground-up initiatives - people stepping out of their comfort zone to look out for the vulnerable, and to help those in need. And I've seen the resilient attitude that Singaporeans have shown, affirming the values we have nurtured since the founding of our nation.\nThis renewed sense of solidarity is critical as we recover, and it will enable us to build a better society together. And that's why the Government is intentionally creating more opportunities for our citizens and stakeholders to be part of the decision-making process - including in policy and implementation.\nThrough the Emerging Stronger Conversations, we are bringing together Singaporeans to share their hopes for a post-Covid-19 society and discuss how we can partner them to get there. We are also strengthening our engagements with young people on the SG Youth Action Plan, starting with their vision of Singapore in 2025.\nWe are convening more Alliances for Action - action-oriented coalitions with a mix of government, community and business stakeholders to solve our problems and co-create solutions together.\nWe hope all this will pave the way for much higher levels of participation in shaping our future Singapore together.\nHARD TRUTH\nWe've just crossed the one-year mark in our fight against Covid-19. This fight is far from over. There are still many uncertainties ahead of us.\nEven as we focus on the immediate battle at hand, we must look ahead to the task of resetting for the future. My hope is for Singapore to emerge as a fairer, greener and more equal country, with a much stronger spirit of solidarity and shared purpose.\nWe all know the hard truth from this crisis: Singapore remains a perpetually vulnerable country. We are ultimately a tiny little red dot. Many things can still go wrong which we have no control over. For example, we cheer that we have managed to procure vaccines for everyone in Singapore. But anything can go wrong with the manufacturing, distribution or even disruptions in the supply chain.\nBut crisis has also shown that we are not without our resources and resolve - we have the nimbleness, ingenuity and gumption to solve our problems and move forward. Most of all, we have seen that as \"one united people\", we can achieve exceptional things together. So that's how, as one united people, we can realise our aspirations and ideals, and build a better Singapore together.", "url": "https://www.straitstimes.com/opinion/covid-19-challenges-and-3-resets-lawrence-wong-0"}