{"authors": [], "date_download": "2024-10-12 13:53:41", "date_modify": "2024-10-12 13:53:41", "date_publish": "2024-09-13 05:00:00", "description": "It is indeed stressful for seniors who have to take care of their parents (As seniors become caregivers to seniors, can doctors lighten their load?, Sept 5). Read more at straitstimes.com.", "filename": "opinion_forum_letter-of-the-week-don-t-have-children-just-for-them-to-look-after-you_1728741221.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/13/st-forum-thumbnail.jpg.JPEG?VersionId=4XlSB6MSJFjMvAtsVEcZxbuqQ76PfZjG&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_letter-of-the-week-don-t-have-children-just-for-them-to-look-after-you_1728741221.html", "title": "Letter of the week: Don’t have children just for them to look after you", "title_page": "Letter of the week: Don’t have children just for them to look after you | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "It is indeed stressful for seniors who have to take care of their parents (As seniors become caregivers to seniors, can doctors lighten their load?, Sept 5).\nChildren are not insurance, or future servants, or anything else but people in their own right, with their own needs and wishes that are quite independent of others’ needs or wishes.\nIf you want children for selfish reasons, including wanting them to provide all the amenities of a retirement home for you later, then the last thing you should do is have children. Old age infirmaries are best left to the professionals, and not children who may be under-financed and under-skilled.\nThere is also no guarantee that having children means they’ll take care of you when you are old. Visit any old folks’ home and ask the residents and the staff how many residents never see their family.\nIf you want children, enjoy watching and helping them grow from helpless babies into fully competent adults, independent of you in every way.\nAnd if you make your children’s childhood happy, they might actively want to go on seeing you once they’ve left home and look after you in your old age. If not, and if you persist in considering them and their needs and wants only as they relate to you, then it will be nothing but duty that makes them visit you (if they do) once they are adults. And you may see resentment seething in them.\nHopefully, people without children are saving up and have retirement and health insurance plans in place that will see them through their old age.", "url": "https://www.straitstimes.com/opinion/forum/letter-of-the-week-don-t-have-children-just-for-them-to-look-after-you"}