{"authors": [], "date_download": "2024-10-12 13:54:03", "date_modify": "2024-10-12 13:54:03", "date_publish": "2024-06-14 05:00:00", "description": "As a doctor and an unsuccessful perfectionist, I wish I could say that I have never made a mistake in my life. In a perfect world, doctors would never make mistakes and airplane pilots would never have accidents. Read more at straitstimes.com.", "filename": "opinion_forum_letter-of-the-week-doctors-don-t-be-too-hard-on-yourselves-when-a-mistake-occurs_1728741243.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/14/aidoctor130624.jpg?VersionId=v4JF7iu9yu0if.HUCiBuvpciTxJGXPId", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_letter-of-the-week-doctors-don-t-be-too-hard-on-yourselves-when-a-mistake-occurs_1728741243.html", "title": "Letter of the week: Doctors, don’t be too hard on yourselves when a mistake occurs", "title_page": "Letter of the week: Doctors, don’t be too hard on yourselves when a mistake occurs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "As a doctor and an unsuccessful perfectionist, I wish I could say that I have never made a mistake in my life. In a perfect world, doctors would never make mistakes and airplane pilots would never have accidents.\nBut we don’t live in a perfect world because we’re inherently flawed humans working in inherently flawed systems.\nA mistake feels like regret, shame, guilt and anger all crushed up into a ball of heavy emotions. It is large, heavy, looming and slow-moving. It bulldozes over all the other thoughts in your head until your brain becomes consumed by this one thing.\nWhen you hear the words “Do you remember this patient that you saw?”, usually from colleagues or senior doctors, it makes your heart race, your breath shallow and your brain foggy. The first thought that comes into my mind as soon as I realise I’ve made a mistake is: “No, that can’t be right.”\nJust like grief, denial is the first stage. It’s refusing to believe you have made a mistake and that you are (somewhat) to blame.\nYou dive into the recesses of your mind to try and recall what happened on the day. A million thoughts rush through your mind as you try to confirm whether you did or did not make a mistake. When the awful gut-wrenching realisation sets in, the next thought is, “What’s going to happen to me now?”\nPeople in healthcare sometimes jump straight from denial to depression. As a people, we are ever so ready to punish ourselves when someone in our care has a bad or unforeseen outcome.\nI have seen it in myself, I have seen it in others. We instantly shut down and hide away. We believe we’re terrible people.\nWe become stuck in that moment, and it keeps replaying in our heads.\nEventually, after days to weeks (and maybe even years), we recover, and we learn to go on with our lives. That is acceptance.\nWe decide that this mistake should not deter us from helping patients and their families.\nMaking mistakes is part of the risk of being in the healthcare profession. After all, for every mistake we make, how many patients do we actually help?\nMaybe if we knew the answer, we might not give up so easily.", "url": "https://www.straitstimes.com/opinion/forum/letter-of-the-week-doctors-don-t-be-too-hard-on-yourselves-when-a-mistake-occurs"}