{"authors": ["Ong Kian Ming"], "date_download": "2024-10-12 14:06:33", "date_modify": "2024-10-12 14:06:33", "date_publish": "2023-06-28 05:00:00", "description": "The “Green Wave” narrative, given its inaccuracies, inadequately captures the growing electoral complexities in Malaysia. Read more at straitstimes.com.", "filename": "opinion_debunking-the-myth-of-malaysia-s-green-wave_1728741993.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/28/Parti20Islam20Se-Malaysia2028PAS2920Pusat20FB_0.jpg?VersionId=aLppMNoEXSRpVNG8eenmH6yQqScXh_Yx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_debunking-the-myth-of-malaysia-s-green-wave_1728741993.html", "title": "Debunking the myth of Malaysia’s ‘Green Wave’", "title_page": "Debunking the myth of Malaysia’s ‘Green Wave’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "In Malaysia’s 1999 general election (GE10), Parti Islam SeMalaysia (PAS) emerged as the largest opposition party, winning 27 parliamentary seats and taking control of the Terengganu state government.\nThe former PAS president, the late Fadzil Noor, became the Leader of the Opposition.\nThis led some commentators to frame the election results as “a rising wave of Islamisation” in the country.\nIn the 2004 general election, PAS managed to win only six parliamentary seats, lost control of the Terengganu state government and came within three votes of losing the Kelantan state government.\nEven though the circumstances surrounding GE15 in 2022 were very different from those in 1999, there is a need for caution in framing electoral outcomes using all-encompassing terms such as the “Green Wave” narrative that was used to interpret the GE15 outcomes.\nThe “Green Wave” narrative is inaccurate for the following reasons.\nFirst, it ignores the significant gains made by Parti Pribumi Bersatu Malaysia (Bersatu), from 13 parliamentary seats in GE14 to 30 seats in GE15, which included seats in many areas such as Tasek Gelugor (Penang), Padang Rengas (Perak), and Masjid Tanah (Melaka) where PAS’ influence was not significant.\nSecond, it ignores the advantages which PAS enjoyed in using the Perikatan Nasional (PN) banner for its campaign in states outside Kelantan and Terengganu.\nPAS was able to make inroads into Umno strongholds such as Kepala Batas in Penang and Pasir Salak in Perak.\nThird, it diverts attention from the main reason for the increase in votes for PN: a disastrous collapse in support for Umno in all states in Peninsular Malaysia, except for Negeri Sembilan and Johor.\nIt was this unhappiness with Umno, and specifically the leadership of Datuk Seri Zahid Hamidi, that enabled PN to benefit from the groundswell of dissatisfaction.\nFourth, this narrative led to the chattering classes attributing the rise in support for PN to the influence of Islamic residential or tahfiz schools rather than other more plausible explanations such as PN’s strategic use of social media, especially TikTok, to reach out to younger voters.\nWhile the rise of religious influence over the past decades in Malaysia cannot be denied, there is far less evidence that there is a correlation between this phenomenon and political support for PAS.\nTo attribute the “Green Wave” to the influence of tahfiz schools, which constitute only a tiny fraction (of less than 1 per cent, or about 50,000 out of six million primary and secondary students) of Malaysia’s overall enrolment, is to compound one analytical mistake on top of another.\nFifth, this Peninsular-centric narrative ignores voting patterns in Sabah and Sarawak, which constitute 25 per cent of total parliamentary seats, where PAS and Bersatu failed to make any significant headway in GE15.\nThe electoral landscape has become much more competitive and electoral outcomes will depend on many factors.\nLabelling GE15 as a “Green Wave” leads to many pitfalls.\nIf religious sentiment explained PN’s gains, then the most effective response for the unity government would be to counter this with religious rhetoric and related policies.\nThen Prime Minister Mahathir Mohamad’s declaration on Sept 29, 2001, that Malaysia was already an Islamic state was an example of such a response to PAS’ ascendancy post-1999.\nSecond, such a move can lead to ignoring the middle-ground Malays who abandoned Umno but who may still return to support the party if there were a clearer direction forward.\nSimilarly, it will distract Pakatan Harapan (PH) from trying to regain support from this group which may have been disillusioned with PH’s attempts to wrestle back control of the federal government, post-Sheraton Move.\nThe so-called Sheraton Move refers to a gathering of MPs at the Sheraton Hotel just outside of Kuala Lumpur in February 2020, which eventually resulted in the toppling of the PH government, which was incidentally led by Tun Dr Mahathir again.\nThird, this plays into a larger Islamophobic narrative. This attitude is prevalent among some segments of the non-Malay community and abroad.\nThis kind of sentiment is particularly unhelpful, especially when it comes to understanding the different demands of the increasingly diverse Malay community in Malaysia.\nI propose the following counter-narratives.\nWe should acknowledge that the GE15 results were part of a larger trend of increased political competition in Malaysia and the collapse of support for the once-dominant Umno-led Barisan Nasional coalition.\nWhile it is unlikely that the coalition will be able to regain its dominance, Umno remains an important political force, especially if there is internal renewal within the party.\nAt the same time, we cannot assume that PN will automatically control most of the Malay support or that the Democratic Action Party will have an automatic stranglehold on the non-Malay vote.\nThe electoral landscape has become much more competitive and electoral outcomes will depend on many factors. In short, religion is an important but not determinative voting issue.\nPoliticians should emphasise policies and political messaging that appeal to the middle ground, especially among the Malay voters. While race and religion are still important, greater political contestation will lead to more competition in public policy ideas and better delivery of public services.\nConsideration must be given to the electoral dynamics in East Malaysia, which are different from that of Peninsular Malaysia but equally dynamic, especially in Sabah.\nI hope that observers of Malaysian politics discontinue the use of the “Green Wave” narrative, given its inaccuracies and dangers.\nIt is a lazy shorthand that inadequately captures the growing electoral complexities in Malaysia. This would be prudent regardless of the upcoming state elections’ outcomes, including any potential result favouring PN.\nOng Kian Ming is director of the Philosophy, Politics and Economics (PPE) programme at Taylor’s University, Malaysia, and former deputy minister of international trade and industry, Malaysia. He is a senior visiting fellow at ISEAS – Yusof Ishak Institute. This article was first published in Fulcrum, the commentary and analysis website of the institute.", "url": "https://www.straitstimes.com/opinion/debunking-the-myth-of-malaysia-s-green-wave"}