{"authors": [], "date_download": "2024-10-12 14:20:57", "date_modify": "2024-10-12 14:20:57", "date_publish": "2024-07-30 05:00:00", "description": "In the letter “Budget meals can be of high standards too” (July 26), the writer notes that it is not necessarily true that poor-quality ingredients are used at coffee shops offering budget meals (Beware of downsides to low-cost hawker food, July 24). Read more at straitstimes.com.", "filename": "opinion_forum_forum-unfair-to-exert-pressure-on-hawkers-to-offer-budget-meals_1728742857.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/30/st-forum-thumbnail_2.jpg?VersionId=uicJ_9Zi9lWGdCiRuyXNHRoVVFNEY90y", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-unfair-to-exert-pressure-on-hawkers-to-offer-budget-meals_1728742857.html", "title": "Forum: Unfair to exert pressure on hawkers to offer budget meals", "title_page": "Forum: Unfair to exert pressure on hawkers to offer budget meals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "In the letter “Budget meals can be of high standards too” (July 26), the writer notes that it is not necessarily true that poor-quality ingredients are used at coffee shops offering budget meals (Beware of downsides to low-cost hawker food, July 24).\nI agree that this is sometimes the case, given that there are coffee shop hawkers focused on economies of scale and who have a heart to keep prices as low as they can afford.\nBut pressure on hawkers to offer budget meals is deeply unfair. If they want to and are able to, then that is great. The public should not make a public policy push for it.\nCoffee shops are run by private-sector businesses, some of which are publicly listed and have a duty to shareholders to maximise profitability.\nHawkers operating under them are obligated to pay rents that are profitable for the operator. So why do we expect these hawkers to offer public benefits that are paid from their income?\nIf there is an issue of affordability, targeted support to low-income customers may be the better way. For example, the Government could reimburse hawkers when they provide discounts through discount cards given to the needy.\nHawkers have historically offered low-cost meals to Singaporeans and residents when wages were much lower. Their incomes have lagged wage growth, even as most continue to work long hours of over 12 hours a day, six days a week. Business is also cut-throat, with competition strong from chain hawker stalls and the very nature of coffee shops and hawker centres offering many stalls.\nSo we should not begrudge hawkers for wanting to earn a little more where they can, especially if it means helping them keep food quality high.\nIf we need evidence that being a hawker isn’t an attractive trade, the median age of hawkers was 60 in 2019. Except for those who have a strong passion, there is a severe shortage of young hawkers joining the trade. We should do our best to encourage them, and this starts by making the hawker trade a viable business.", "url": "https://www.straitstimes.com/opinion/forum/forum-unfair-to-exert-pressure-on-hawkers-to-offer-budget-meals"}