{"authors": ["Leonid Bershidsky"], "date_download": "2024-10-12 14:01:18", "date_modify": "2024-10-12 14:01:18", "date_publish": "2023-05-23 17:00:00", "description": "The question for the Russians is whether the fall of Bakhmut is nothing but a pyrrhic victory. Read more at straitstimes.com.", "filename": "opinion_bakhmut-falls-but-is-it-really-a-russian-victory_1728741678.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/23/UKRAINEBAKHMUTDESTRUCTION1.JPG?VersionId=6Gm5z_11wrC91Rmpn8mOj.xdi0ktTegb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_bakhmut-falls-but-is-it-really-a-russian-victory_1728741678.html", "title": "Bakhmut falls, but is it really a Russian victory?", "title_page": "Bakhmut falls, but is it really a Russian victory? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The eastern Ukrainian town of Bakhmut, captured by Russian forces after more than 220 days of house-to-house fighting, is unique in that it comes with its own supply of bubbly to celebrate the victory. The workers of Artwinery, one of eastern Europe’s biggest producers of sparkling wine, managed to evacuate only about a million bottles from cellars 72m underground in 200-year-old gypsum mines, leaving nine million bottles behind. The question is whether this Pyrrhic victory is to be toasted, or whether the defiant winemakers, who moved production to the Odessa region, will save what was once known as “Soviet Champagne” to celebrate the town’s eventual Ukrainian liberators.\nThe battle for Bakhmut, the most protracted of the war so far, could also have been the bloodiest. The Russian occupation authorities estimated Ukrainian losses at 15,000 to 20,000 dead last month, though propaganda outlets have cited numbers up to 40,000. United States President Joe Biden has said that Russia has “suffered over 100,000 casualties in Bakhmut”. In any case, it is likely that more people died or were wounded in the fighting than the 70,000 residents of Bakhmut before the war – a population now almost completely gone, save for a few dozen desperate souls hiding out in basements.", "url": "https://www.straitstimes.com/opinion/bakhmut-falls-but-is-it-really-a-russian-victory"}