{"authors": [], "date_download": "2024-10-12 13:52:40", "date_modify": "2024-10-12 13:52:40", "date_publish": "2023-10-26 05:00:00", "description": "I agree with the report “37% willing to take the lead on neighbourhood issues: Survey” (Oct 24). Read more at straitstimes.com.", "filename": "opinion_forum_forum-taking-the-lead-for-the-good-of-neighbourhood_1728741160.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/26/st-forum-thumbnail_2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-taking-the-lead-for-the-good-of-neighbourhood_1728741160.html", "title": "Forum: Taking the lead for the good of neighbourhood", "title_page": "Forum: Taking the lead for the good of neighbourhood | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I agree with the report “37% willing to take the lead on neighbourhood issues: Survey” (Oct 24).\nMost people say that Singaporeans like to complain a lot. However, complaining without taking action is fruitless. If something can be done about a problem, the resources available should be utilised to bring about a community good.\nI am the founder of Dunearn Youth, a ground-up initiative started in 2020 during the Covid-19 pandemic to help those in need, such as the elderly and lower-income families.\nThe group has taken part in the annual Love Our ’Hood Youth Challenge and received support from the Municipal Services Office (MSO) of the Ministry of National Development and National Youth Council for our community projects.\nOne of the projects is Recycle Right, a youth-led, ground-up initiative on sustainability issues and recycling.\nWith the support of community partners such as MSO and the National Environment Agency, we organised Recycle Right workshops and upcycle projects in Bukit Timah CC, St Luke’s Eldercare and St Theresa’s Home.\nIn leading such activities, the group is grateful for the support from the MSO and other government agencies.\nAs part of the Forward SG conversation, the Government is empowering us to shape our environment and have a greater stake in the community.\nWe must each play our part and together realise the vision of a City of Good.", "url": "https://www.straitstimes.com/opinion/forum/forum-taking-the-lead-for-the-good-of-neighbourhood"}