{"authors": [], "date_download": "2024-10-12 13:29:01", "date_modify": "2024-10-12 13:29:01", "date_publish": "2024-09-17 05:00:00", "description": "I refer to the report “Just over one in 100 children in Singapore have autism” (Sept 16). Read more at straitstimes.com.", "filename": "opinion_forum_forum-more-can-be-done-to-help-those-with-autism-spectrum-disorder_1728739741.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/st-forum-thumbnail.jpg?VersionId=t1i1NSF6s744Ed6ZfrIg2Q_Dq7e_AWRn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-more-can-be-done-to-help-those-with-autism-spectrum-disorder_1728739741.html", "title": "Forum: More can be done to help those with autism spectrum disorder", "title_page": "Forum: More can be done to help those with autism spectrum disorder | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I refer to the report “Just over one in 100 children in Singapore have autism” (Sept 16).\nPerhaps a more appropriate term for this condition is autism spectrum disorder (ASD). On this spectrum, there may be those with more severe manifestations, who may present with more severe behaviour manifestations such as throwing tantrums and crying for many hours, with attention-deficit hyperactivity disorder features.\nOn the spectrum are also those who are high-functioning. They may be missed as having ASD, for they may be rather intelligent and behave normally but may have difficulties in certain areas of language, speech and social interaction.\nIt is important to realise that those with severe ASD are not naughty or misbehaving – they cannot help but have problems in speech, language, behaviour and so on. They may, for instance, perceive certain sounds as frightening, which causes them to cry out in fear for long periods. Many of us who are aware of ASD children with such difficulties tend to be more empathetic.\nHowever, for high-functioning ASD children, the likelihood of them being misunderstood, punished or ostracised is much higher and this is a cause for concern. These people, traumatised by others in school, at work and in social interactions, are among those who develop depression, anxiety and other mental problems, with some ending up suicidal.\nWe should be aware of the difficulties and sufferings of these high-functioning ASD individuals and not brand them as lazy, incompetent and uncooperative.\nChildren with ASD also require early intervention, even before going to pre-school. They need to be diagnosed early and be managed by a team of psychologists, occupational therapists, education therapists and paediatricians before their problems become so severe that correction may not be effective.\nChildren may be diagnosed with ASD but without such resources, ASD remains a problem. Private facilities may be financially beyond the average family in Singapore as intervention is over a long period, and this is an added financial and social concern.\nBefore some of these shortcomings can be corrected, the appeal is for Singaporeans to be kinder to such children and adults and not brand them as social misfits.\nAlso, doctors in general practice and other fields should be more alert to diagnose such children early, for intervention to start.", "url": "https://www.straitstimes.com/opinion/forum/forum-more-can-be-done-to-help-those-with-autism-spectrum-disorder"}