{"authors": [], "date_download": "2024-10-12 13:53:55", "date_modify": "2024-10-12 13:53:55", "date_publish": "2024-08-02 05:00:00", "description": "This year’s National Day falls on a Friday. It is a public holiday. Many Singaporeans will no doubt go overseas for the long weekend. This comes despite years of efforts to instil a greater sense of patriotism among Singaporeans. Read more at straitstimes.com.", "filename": "opinion_forum_letter-of-the-week-our-national-day-but-other-countries-gain_1728741235.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/st-forum-thumbnail.jpg_4.JPEG?VersionId=NUJds0Y3WdOveCNXnmVY86VCFRqLyqLA&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_letter-of-the-week-our-national-day-but-other-countries-gain_1728741235.html", "title": "Letter of the week: Our National Day but other countries’ gain?", "title_page": "Letter of the week: Our National Day but other countries’ gain? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "This year’s National Day falls on a Friday. It is a public holiday. Many Singaporeans will no doubt go overseas for the long weekend. This comes despite years of efforts to instil a greater sense of patriotism among Singaporeans.\nIn 1986, the National Day Parade was revamped. From an early morning parade, it became an early evening celebratory event and was made primarily for television. This was so that the whole nation would find it meaningful to stay home, and have dinner parties with family members, friends and neighbours to celebrate the National Day.\nNational Day observance ceremonies were held at workplaces for management and employees to mark the occasion. There were also National Day dinners in each constituency.\nNational Day carnivals, Sing Singapore, and Swing Singapore were also organised for people of all ages to enjoy the National Day weekend.\nFamilies and organisations were encouraged to fly the state flag so that homes and buildings all over Singapore, including those along Orchard Road, would be decorated to create the atmosphere for the occasion. Patriotic and traditional English, Chinese, Malay and Indian folk songs were played on TV and radio and at shopping malls for the same reason.\nBut did we succeed in inspiring Singaporeans to stay home on Aug 9? Probably not. Looking at the traffic jams at the Causeway and the Second Link every Aug 9, we still have a long way to go to instil in our citizens the level of patriotism we see in other countries.\nFor instance, the Swiss are known to fly home to celebrate their National Day on Aug 1. Americans do likewise for their Fourth of July.\nMany Singaporeans instead leave the country to celebrate our nation’s independence elsewhere, mainly in Malaysia. I am not sure if we should feel embarrassed, especially as we gained independence following our separation from Malaysia.\nA Malaysian minister actually told me, at an Asean event, that Malaysia’s tourism receipts were among the highest on Singapore’s National Day. And he suggested in jest that Singapore should declare every day a National Day.", "url": "https://www.straitstimes.com/opinion/forum/letter-of-the-week-our-national-day-but-other-countries-gain"}