{"authors": ["The Economist"], "date_download": "2024-10-12 13:39:51", "date_modify": "2024-10-12 13:39:51", "date_publish": "2023-07-03 17:00:00", "description": "In several respects, mining the seabed is more environmentally friendly than mining in Indonesia. Read more at straitstimes.com.", "filename": "opinion_deep-sea-mining-may-soon-ease-the-world-s-battery-metal-shortage_1728740391.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/03/INDONESIA-MINING-NICKEL-122514.jpg?VersionId=1331oFCbcn_iRkwuyR5tp_P1.nQBPINv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_deep-sea-mining-may-soon-ease-the-world-s-battery-metal-shortage_1728740391.html", "title": "Deep-sea mining may soon ease the world’s battery-metal shortage", "title_page": "Deep-sea mining may soon ease the world’s battery-metal shortage | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Pushed by the threat of climate change, rich countries are embarking on a grand electrification project. Britain, France and Norway, among others, plan to ban the sale of new internal-combustion cars over the coming decade. Even where bans are not on the statute books, electric-car sales are growing rapidly. Power grids are changing, too, as wind turbines and solar panels displace fossil-fuelled power plants. The International Energy Agency (IEA) reckons the world will add as much renewable power in the coming five years as it did in the past 20.\nAll that means batteries, and lots of them – both to propel the cars and to store energy from intermittent renewable power stations. Demand for the minerals from which those batteries are made is soaring. Nickel in particular is in short supply. The element is used in the cathodes of high-performance electric-car batteries to boost capacity and cut weight. The IEA calculates that if it is to meet its decarbonisation goals, the world will need to be producing 48 million tonnes of the stuff every year by 2040, around 19 times more than it manages today. That adds up to between 300 million and 400 million tonnes of metal in total between now and then.", "url": "https://www.straitstimes.com/opinion/deep-sea-mining-may-soon-ease-the-world-s-battery-metal-shortage"}