{"authors": [], "date_download": "2024-10-12 13:57:12", "date_modify": "2024-10-12 13:57:12", "date_publish": "2024-06-06 05:00:00", "description": "I refer to the commentary “Sorry, but we’re Chinese Singaporeans – not your compatriots” (June 2). Read more at straitstimes.com.", "filename": "opinion_forum_forum-loyalty-to-singapore-never-questioned-when-i-was-in-china_1728741432.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/06/st-forum-thumbnail.jpg_0.JPEG?VersionId=HRwWXVLVSIrnIXFHCfNl3oG3.M1zI0go&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-loyalty-to-singapore-never-questioned-when-i-was-in-china_1728741432.html", "title": "Forum: Loyalty to Singapore never questioned when I was in China", "title_page": "Forum: Loyalty to Singapore never questioned when I was in China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I refer to the commentary “Sorry, but we’re Chinese Singaporeans – not your compatriots” (June 2).\nAs a Chinese Singaporean who has travelled extensively in China since the early 1990s, I have experienced the same curiosity from the locals as Straits Times journalist Danson Cheong did, but with quite different reactions.\nAs soon as the local Chinese, both young and old, realised that I was from Singapore, an independent country, there were no further questions about my ethnicity. My allegiance or loyalty to Singapore was never questioned. But, not surprisingly, the locals would describe us as tong zong (same ancestors) or yi jia ren (one family) if my forefathers were from the same region as theirs.\nFor those who have heard of Singapore, inevitably, recognition and praise would be given to our founding prime minister Lee Kuan Yew, for his leadership in transforming Singapore into a modern prosperous city-state.\nI would say that the more educated and urban Chinese are generally better-informed and less emotional or opinionated. It is not surprising that China’s nation-building efforts have made many of its citizens more patriotic and proud of their culture and heritage. I believe they would be keen, given the opportunity, to share this with their foreign Chinese and non-Chinese friends.", "url": "https://www.straitstimes.com/opinion/forum/forum-loyalty-to-singapore-never-questioned-when-i-was-in-china"}