{"authors": [], "date_download": "2024-10-12 13:52:53", "date_modify": "2024-10-12 13:52:53", "date_publish": "2024-05-02 05:00:00", "description": "I refer to the Opinion piece “Why flexible work arrangements are not so straightforward for some businesses” (April 30). Read more at straitstimes.com.", "filename": "opinion_forum_forum-employers-managers-need-to-be-open-to-change-arising-from-flexible-work-arrangements_1728741173.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/02/st-forum-thumbnail.jpg_1.JPEG?VersionId=VXAwtu7eVA0BT1OWyZO7Hrhd6BxN.qkz&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-employers-managers-need-to-be-open-to-change-arising-from-flexible-work-arrangements_1728741173.html", "title": "Forum: Employers, managers need to be open to change arising from flexible work arrangements", "title_page": "Forum: Employers, managers need to be open to change arising from flexible work arrangements | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I refer to the Opinion piece “Why flexible work arrangements are not so straightforward for some businesses” (April 30).\nThe Singapore Business Federation (SBF) has highlighted ground feedback from some businesses about the Government’s guidelines on flexible work arrangements (FWAs), as well as some resources that businesses can tap.\nWith any new policies or guidelines, one key factor for successful implementation is change management. In this case, the onus is on the employers and managers.\nGiven the traditional power balance, it is not surprising that having to change is unfamiliar territory for some. Nonetheless, businesses in Singapore, big or small, have to recognise that the workplace and business operating environments have evolved, particularly when many have seen the effectiveness of FWAs during the Covid-19 pandemic period.\nWith the FWA guidelines, the Government is also sending a strong signal that employers or those in managerial roles have to change their mindsets and managerial practices.\nThe traditional work arrangement is “easier” for managers because it is a one-size-fits-all approach and primarily predicated on presenteeism. Under the new arrangement, managers are now required to be more flexible, more focused on staff welfare and work outcomes (instead of outputs).\nIn short, this is more work for those in managerial positions. In fact, progressive employers and managers would relish the opportunity to manage a more efficient and happier workforce.\nSimilarly, businesses that embrace FWAs will be in a more advantageous position in the era of tight manpower.\nBusinesses that choose to retain outdated operating models or managerial philosophies are best left to the ash heap of history.\nGiven the above, besides articulating ground concerns, SBF can also fulfil its thought leadership role by exhorting employers and managers to re-examine their management philosophy and practices. This will better serve not only these businesses, but also our society in the long run.", "url": "https://www.straitstimes.com/opinion/forum/forum-employers-managers-need-to-be-open-to-change-arising-from-flexible-work-arrangements"}