{"authors": [], "date_download": "2024-10-12 13:54:13", "date_modify": "2024-10-12 13:54:13", "date_publish": "2024-05-11 05:00:00", "description": "I agree there is a need to change the driving culture here (This father is worried sick about S’pore drivers rushing to get ahead, May 3). Despite culture being intricate and multidimensional, personal values are the primary driver of behaviours and actions. Read more at straitstimes.com.", "filename": "opinion_forum_letter-of-the-week-drivers-must-see-other-road-users-as-fellow-human-beings-and-not-rivals_1728741253.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/11/IMG3139.JPG?VersionId=ZFC1FsmUGKUFPAMA.VmAtATuRpRM7mCT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_letter-of-the-week-drivers-must-see-other-road-users-as-fellow-human-beings-and-not-rivals_1728741253.html", "title": "Letter of the week: Drivers must see other road users as fellow human beings and not rivals", "title_page": "Letter of the week: Drivers must see other road users as fellow human beings and not rivals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I agree there is a need to change the driving culture here (This father is worried sick about S’pore drivers rushing to get ahead, May 3). Despite culture being intricate and multidimensional, personal values are the primary driver of behaviours and actions.\nBut how do we inculcate the right values and drive cultural change? The short answer is – education.\nIt is not just the one-off, basic and final theory of driving for learner drivers, but recurrent education to implant in qualified drivers a defensive driving mindset.\nA core principle of defensive driving is to drive carefully – to keep everyone safe.\nBesides “seeing their cars... as machines that can kill someone if they are not careful”, as put forward by senior correspondent Chua Mui Hoong, drivers must also reframe the way they see other road users – to see them as fellow human beings and not as rival road users in a zero-sum game of vehicular combat.\nBy recognising this and realising the sanctity of life – drivers will appreciate they have a duty of care to keep others safe.\nThe so-called vulnerable road users, such as pedestrians and cyclists, should also know they share a similar duty of care.\nDo not think that vulnerable road users can only be harmed and not cause harm. Self-entitled jaywalking pedestrians and red-light-beating cyclists can put drivers’ lives in danger.\nDrivers may swerve instinctively, lose control and crash while attempting to avoid pedestrians and cyclists who recklessly encroach into their path.\nI agree with deputy opinion editor Mubin Saadat that enforcement and increasing surveillance can only go so far (It’s simple – slow down to save lives, May 4).\nHence, if drivers develop a conscience to keep other road users safe, they should be doing the right thing, even when nobody is watching. This form of self-management will be far more effective and sustainable than the reactive road calming measures and enforcement actions that spring up after high-profile car crashes.\nTo develop a safer driving culture here, lifelong continuing driver education will be needed to give drivers the right attitude and risk-management skills.\nTo motivate and support drivers to attend defensive driving courses, perhaps insurers can offer a discount on their car insurance premiums. Safer drivers can benefit from cheaper premiums, and insurers, from reduced accident claims.", "url": "https://www.straitstimes.com/opinion/forum/letter-of-the-week-drivers-must-see-other-road-users-as-fellow-human-beings-and-not-rivals"}