{"authors": [], "date_download": "2024-10-12 13:33:46", "date_modify": "2024-10-12 13:33:46", "date_publish": "2023-08-01 05:00:00", "description": "This election will be remembered not for its results so much as Hun Sen’s announcement that he is stepping aside for his son. Read more at straitstimes.com.", "filename": "opinion_st-editorial_new-beginnings-in-cambodia_1728740026.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/01/st-editorial-high-res.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_st-editorial_new-beginnings-in-cambodia_1728740026.html", "title": "New beginnings in Cambodia?", "title_page": "New beginnings in Cambodia? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Cambodia’s controversial general election has delivered the widely expected result of a landslide win for the ruling Cambodian People’s Party (CPP) led by long-serving Prime Minister Hun Sen. Although the Candlelight Party, the only opposition group with a measure of worthy support, was disqualified on a technicality by the National Election Committee, the polls saw a significant turnout of 84 per cent of the eligible voters. The election, which saw the CPP take 120 of the 125 seats available, was denounced as unfair by Asean Parliamentarians for Human Rights, a non-governmental body.\nMost Western nations declined to send observers to the elections but, tellingly, China and Russia – whose bilateral relationship is strengthening by the day – did send observers. Beijing’s consistent political support over the years has helped Mr Hun Sen consolidate his grip on Cambodia, and Phnom Penh has responded with diplomatic backing for Chinese positions and strategic concerns even at the risk of offending its Asean peers, and by being highly receptive to President Xi Jinping’s signature Belt and Road Initiative.", "url": "https://www.straitstimes.com/opinion/st-editorial/new-beginnings-in-cambodia"}