{"authors": ["Robert Huish"], "date_download": "2024-10-12 13:36:37", "date_modify": "2024-10-12 13:36:37", "date_publish": "2023-10-11 17:00:00", "description": "Hamas has said it is not prepared to discuss a “prisoner exchange” until the end of the conflict. Read more at straitstimes.com.", "filename": "opinion_hamas-hostages-no-ordinary-prisoner-diplomacy_1728740197.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/11/US-RALLY-AND-VIGIL-HELD-IN-NEW-YORK-CITY.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_hamas-hostages-no-ordinary-prisoner-diplomacy_1728740197.html", "title": "Hamas’ hostages: No ordinary prisoner diplomacy", "title_page": "Hamas’ hostages: No ordinary prisoner diplomacy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "It is usually quite difficult to get people and things in and out of Gaza. Until the past weekend.\nThousands of rockets poured out of Gaza, and more than 100 Israelis were taken hostage by Hamas.\nMr Gilad Erdan, Israel’s Ambassador to the United Nations, has said the total number of hostages seized was between 100 and 150. The Times of Israel reported that most of the hostages have been identified and that families were being notified.\nVideos of Israelis being abducted were filmed by Hamas and shared on social media and through WhatsApp groups.\nBut where these hostages are being held is anyone’s guess.\nQatari officials have been attempting to broker a prisoner exchange of 36 Palestinian women and children held by Israel in exchange for the hostages taken by Hamas. Hamas has announced that it is not prepared to discuss a “prisoner exchange” until the end of the conflict.\nA couple of different messages can be taken from this.\nDeterring retaliation?\nFirst, it could mean that Israeli hostages are being held across Gaza in order to deter any major bombardment from Israel or to deter the Israel Defence Forces from a ground invasion.\nOr it could mean that Hamas itself is unclear as to how many hostages it has, and who they are.\nAlready, footage has surfaced of Israeli hostages executed in Gaza by Hamas militants carrying assault rifles. Another video showed a German woman dragged through the streets in Gaza.\nIsraelis have been taken as hostages before. In 1985, a Trans World Airlines jet with 139 passengers and a crew of eight was hijacked by two Lebanese terrorists who demanded the release of 700 Shi’ite Muslims from Israeli custody.\nHighly orchestrated\nThis is no ordinary prisoner diplomacy. This is not a desperate attempt to free prisoners on the other side or to broker a deal. Nor is it using civilian prisoners in a diplomatic proxy war, like the exchange between Canada and China for Chinese telecommunications executive Meng Wanzhou for Canadians Michael Kovrig and Michael Spavor.\nIt’s a highly orchestrated act by Hamas meant to achieve three political goals.\nThe first is to disrupt the emerging diplomacy between Israel and Saudi Arabia. The second is to mock Israeli Prime Minister Benjamin Netanyahu’s war hawk platform. And finally, it could be aimed at undermining Fatah’s stated role as representing the Palestinian people.\nWhile Hamas advocates using armed resistance and has called for the destruction of Israel, Fatah believes in negotiating with Israel for a two-state solution and has ruled out using force.\nA living nightmare\nThe Israeli hostages in Gaza are living a nightmare. They are likely to remain displaced, under duress and will be the human shields of this war.\nThe confidence of Hamas to carry out this attack is also cause for concern. Who is providing the resources and arms to Hamas needs to be made clear. Already Israel has intercepted chemicals destined to be rocket fuel, and has gathered intelligence revealing that Hamas acquires weapons through complex smuggling networks involving sea-to-sea transfers.\nAfter the initial bombardment, it appears Hamas is preparing for an Israeli ground invasion, counting on Israel’s internal political chaos and assuming the Israeli target list for aerial assault is now outdated.\nIf ground fighting breaks out between Hamas and Israeli forces, the hostages will likely be squarely in the middle of it.\nFor this war, these hostages are not meant to be used to solve diplomatic spats. They are intended to be put in the deadly cross hairs of what is certainly going to continue to be a brutal and bloody conflict.\nRobert Huish is associate professor in the Department of International Development Studies at Dalhousie University in Canada. This article was published first in The Conversation.", "url": "https://www.straitstimes.com/opinion/hamas-hostages-no-ordinary-prisoner-diplomacy"}