{"authors": ["The Economist"], "date_download": "2024-10-12 13:38:19", "date_modify": "2024-10-12 13:38:19", "date_publish": "2024-04-23 17:00:00", "description": "China and the US have launched a new bilateral forum to discuss the problem. Read more at straitstimes.com.", "filename": "opinion_how-chinese-networks-clean-dirty-money-on-a-vast-scale_1728740299.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/23/2024-04-22T074203Z1112595429RC2X2X91YEKTRTRMADP3CHINA-FINANCIAL-LAYOFFS.JPG?VersionId=6XSsu.M7ipWOGYpM6rg17aUSjXAZn0M_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_how-chinese-networks-clean-dirty-money-on-a-vast-scale_1728740299.html", "title": "How Chinese networks clean dirty money on a vast scale", "title_page": "How Chinese networks clean dirty money on a vast scale | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "It is rare these days for the US and China to cooperate on anything. During a three-day visit to Beijing and Shanghai, beginning on April 24, US Secretary of State Antony Blinken will press his hosts to stop sending weapons-related materials to Russia’s defence industries. He will be lucky to get much more than a polite smile. So it is noteworthy that the two countries have recently decided to boost mutual support in another domain: the fight against money laundering. In April, they launched a new bilateral forum to discuss the problem. Unlike Russia, it is a big one for both of them.\nThe menace has grown in recent years, fuelled by underground Chinese networks equipped with new technologies that can enable dirty money to be washed clean in minutes. For transnational criminal gangs across the world, these shadowy “banks” are becoming the financiers of choice. Suppressing them requires the two great powers to talk. On that, at least, they agree.", "url": "https://www.straitstimes.com/opinion/how-chinese-networks-clean-dirty-money-on-a-vast-scale"}