{"authors": ["Lim Seok Hui"], "date_download": "2024-10-12 13:48:25", "date_modify": "2024-10-12 13:48:25", "date_publish": "2024-05-22 05:00:00", "description": "Philanthropy’s nimble and risk-tolerant capital also serves as an incubator for innovation. Read more at straitstimes.com.", "filename": "opinion_a-new-kind-of-philanthropy-to-fight-climate-change_1728740905.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/22/WJ9673.jpg?VersionId=oYLPS4bs82.t7zlVgMdnJGfELxZ8XXjd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_a-new-kind-of-philanthropy-to-fight-climate-change_1728740905.html", "title": "A new kind of philanthropy to fight climate change", "title_page": "A new kind of philanthropy to fight climate change | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "At the World Economic Forum in January, marine biologist Diva Amon joined a live session in Davos from an extraordinary location: 350m under the sea, in the Seychelles.\nSeated in a deep-sea submersible from the OceanXplorer, the world’s most advanced scientific research vessel, she offered us a rare glimpse into the depths of the Indian Ocean.\nThis ground-breaking work is part of the OceanX initiative by Dalio Philanthropies, founded by the Dalio family, which aims to foster a deeper understanding and care for marine environments worldwide.\nOceanX has achieved remarkable milestones, including comprehensive research of the Red Sea and capturing the first-ever footage of the giant squid. Now in Indonesia, the OceanXplorer is continuing its multi-year mission to explore the biodiverse waters of South-east Asia, which are crucial in the world’s fight against climate change.\nPhilanthropy is changing\nPhilanthropic efforts like those of Dalio Philanthropies demonstrate how strategic, mission-driven funding can catalyse significant global impact and tackle some of the world’s most pressing challenges, such as climate change. In Asia alone, an estimated US$1.1 trillion (S$1.48 trillion) is required to meet climate mitigation and adaptation needs annually, with the current investment falling short by an estimated US$800 billion.\nThis investment to tackle climate change in the region can benefit other interconnected areas, such as public health.\nAlready, the World Health Organisation has warned that climate change is undermining many social determinants for good health, including livelihoods, equality, and access to education and social support structures.\nThere is cause for optimism. A projected US$2.5 trillion will be transferred from business founders and wealth owners to their younger family members by 2030. There is a corresponding increase in philanthropic giving, as per a recent report by ClimateWorks Foundation and various global surveys, to speed up and scale positive impact in the region. Giving today is also moving towards catalytic philanthropy, away from traditional cheque-book giving, mostly as a result of the desire for more evidence-based outcomes.\nThe rise of PPPPs\nPhilanthropy, however, needs partners, and the complex, interconnected nature of challenges such as climate change has led to greater appreciation of the need for public-private-philanthropic partnerships (PPPPs).\nEach “P” in PPPPs brings its own unique strengths to the table.\nThe public sector provides regulatory support and scale, ensuring that innovative solutions can be implemented at a societal level. The private sector provides efficiency and market expertise, driving sustainable and scalable models for impact. Philanthropy, while the smallest “P” in the equation, provides the initial funding and has the risk tolerance to test new ideas and drive early-stage innovation.\nIn short, philanthropy’s nimble and risk-tolerant capital puts it in a unique position to push for transformative solutions while serving as an incubator for innovation.\nTake, for example, US-based start-up Equatic, formerly known as Project SeaChange, which removes carbon dioxide from the atmosphere with the help of seawater in a process that produces solid carbonates that can then be used to make construction materials. Equatic was the winner of The Liveability Challenge 2021, securing $1 million in funding from Temasek Foundation to run a pilot of their carbon capture solution.\nIn March 2024, national water agency PUB announced that Equatic is now building the world’s largest ocean-based carbon dioxide removal plant in Singapore, co-funded by PUB, the National Research Foundation and the University of California, Los Angeles’ Institute for Carbon Management.\nWith the help of philanthropic capital, critical funding gaps can be bridged to advance societal needs through research and the development of solutions. But realising philanthropy’s full potential to create and catalyse impact demands a systemic approach to foster cross-sector collaboration and coordination to deploy diverse financing structures.\nWhat is needed for successful PPPPs? The 2023 Climate Philanthropy report by the World Economic Forum’s Giving to Amplify Earth Action, ClimateWorks Foundation and the Philanthropy Asia Alliance emphasised four key characteristics: alignment on a systems-thinking strategy, active collaboration, and the adoption of innovative financing approaches, all while putting people and talent development at the heart of them.\nCatalysing impact\nIt is heartening that PPPPs are becoming more commonplace.\nAt COP28, the Asian Development Bank, Global Energy Alliance for People and Planet, and the Monetary Authority of Singapore (MAS) announced their partnership to set up a US$2 billion blended finance fund to finance the energy transition in Asia.\nMore recently, the social investor network, AVPN, collaborated with MAS to launch ImpactCollab, an outcomes-based social investing system designed to facilitate philanthropic giving and impact investing among the private sector. The rise of such PPPPs signals progress towards mobilising catalytic capital from philanthropic and public sectors, attracting private sector investment, and leveraging partners’ expertise for large energy transition projects in Asia.\nSingapore, as an emerging regional philanthropic hub, can be a nexus for PPPPs catalysing such innovative solutions. As a leading regional financial centre with the wealth management talent and ancillary service providers to act as a rallying point for philanthropy, it has attracted over 1,400 family offices to set up base locally.\nBy bringing together international, regional and local partners through collaborative funding platforms, cross-sector convenings and knowledge-sharing networks, Singapore can play a key role in developing a more vibrant and impactful regional philanthropic ecosystem to propel Asian solutions for global challenges.\nThe beta phase of Co-Axis, the first-ever digital impact marketplace that will connect funders with high-impact projects, was unveiled in April. Initiated by Temasek Trust with strategic partners DBS Foundation and UBS Optimus Foundation, and 13 other industry partners, Co-Axis features over 70 high-impact project opportunities from more than 40 countries.\nIt will also enable the sharing of best practices, data, and critical insights through partnership and training opportunities.\nAs we look towards the future, PPPPs will be key to shaping a sustainable future.\nPartnerships make the impossible possible, and PPPPs can bridge the gap between aspiration and implementation, driving meaningful progress on a global scale. Together, we can do more, do better, and be bolder.\nLim Seok Hui is chief executive officer of the Philanthropy Asia Alliance.", "url": "https://www.straitstimes.com/opinion/a-new-kind-of-philanthropy-to-fight-climate-change"}