{"authors": ["Pamela Paul"], "date_download": "2024-10-12 13:56:59", "date_modify": "2024-10-12 13:56:59", "date_publish": "2022-11-28 17:00:00", "description": "Many of today's female pop stars admit that rapacious public scrutiny gets to them Read more at straitstimes.com.", "filename": "opinion_taylor-swift-selena-gomez-and-why-fans-love-a-vulnerable-starlet_1728741419.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/29/sv-gomezswift-281122.jpg?VersionId=x_mi5VyLUVWZ.edYHdNQxwIF29TiT_qS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_taylor-swift-selena-gomez-and-why-fans-love-a-vulnerable-starlet_1728741419.html", "title": "Taylor Swift, Selena Gomez and why fans love a vulnerable starlet", "title_page": "Taylor Swift, Selena Gomez and why fans love a vulnerable starlet | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "By most measures, Selena Gomez and Taylor Swift are remarkable women. Intelligent and capable, they’ve succeeded through innate talent, hard and sustained work, ambition and vision. Both are the kind of mega pop stars who inspire convulsions of adulation and tears. Crowds surge and part in their presence. They are graced with a radiance that seems almost exclusive to celebrities, with skin so incandescent it needs no filter.\nBut they are not perfect. Nor, importantly, do they pretend to be. A recent Apple TV+ documentary, Selena Gomez: My Mind & Me, offers an unsparing portrait of Gomez, now 30, and her experiences with bipolar disorder, lupus, anxiety and psychosis. On her latest album, Midnights, Swift, 32, sings about her depression working the graveyard shift, about ending up in crisis. “It’s me, hi, I’m the problem, it’s me / It’s me, hi, everybody agrees, everybody agrees,” goes the song “Anti-Hero.” “Sometimes I feel like everybody is a sexy baby / And I’m a monster.”", "url": "https://www.straitstimes.com/opinion/taylor-swift-selena-gomez-and-why-fans-love-a-vulnerable-starlet"}