{"authors": [], "date_download": "2024-10-12 13:30:41", "date_modify": "2024-10-12 13:30:41", "date_publish": "2024-07-18 05:00:00", "description": "The survey on family ties conducted by the Ministry of Social and Family Development is important and timely, given our fast-ageing population (Family ties in S’pore are strong, many feel it is their responsibility to care for parents: Survey, July 15). Read more at straitstimes.com.", "filename": "opinion_forum_forum-young-families-must-stay-in-touch-with-ageing-parents_1728739841.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/18/st-forum-thumbnail.jpg_2.JPEG?VersionId=N5ylS.eWnTzY.upWncvDDP9JFqMd1j8t&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-young-families-must-stay-in-touch-with-ageing-parents_1728739841.html", "title": "Forum: Young families must stay in touch with ageing parents", "title_page": "Forum: Young families must stay in touch with ageing parents | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The survey on family ties conducted by the Ministry of Social and Family Development is important and timely, given our fast-ageing population (Family ties in S’pore are strong, many feel it is their responsibility to care for parents: Survey, July 15).\nIt is heartening to learn from the findings that many agree that taking care of their parents is their responsibility, while most older people would turn to their family members for caregiving help.\nThe family is the basic building block of our society where we find love, support and fulfilment. In times of difficulties, this is the nest we return to for comfort and succour.\nBuilding a resilient family can be challenging for individuals; hence, support from the relevant agencies, social institutions and also employers is imperative.\nAs Singaporeans want to spend more time with their families, employers are encouraged to adopt work-life-friendly practices which can lead to better job performance and morale.\nHowever, the growing numbers of the elderly left to live alone may pose economic, healthcare and social challenges.\nSome older people prefer to live alone or with their ageing spouse for reasons such as changes in family values, lifestyles, and their children’s greater job mobility.\nWhatever the case may be, young families must stay in touch with ageing parents and also visit them regularly as no institution can replace the love and warmth of family members.", "url": "https://www.straitstimes.com/opinion/forum/forum-young-families-must-stay-in-touch-with-ageing-parents"}