{"authors": [], "date_download": "2024-10-12 13:53:19", "date_modify": "2024-10-12 13:53:19", "date_publish": "2023-10-26 05:00:00", "description": "I applaud the Municipal Services Office’s (MSO) initiative to come up with the noise experiential lab in a vacant HDB block in Tanglin Halt, “New lab will help visitors understand the impact of noise on fellow residents” (Sept 23). Read more at straitstimes.com.", "filename": "opinion_forum_forum-use-noise-experiential-lab-to-educate-students-on-sound-pollution_1728741199.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/26/st-forum-thumbnail_0.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-use-noise-experiential-lab-to-educate-students-on-sound-pollution_1728741199.html", "title": "Forum: Use noise experiential lab to educate students on sound pollution", "title_page": "Forum: Use noise experiential lab to educate students on sound pollution | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I applaud the Municipal Services Office’s (MSO) initiative to come up with the noise experiential lab in a vacant HDB block in Tanglin Halt, “New lab will help visitors understand the impact of noise on fellow residents” (Sept 23).\nThe lab is open for booking by the public from Sept 23 to Dec 15. I wonder how the MSO will measure the effectiveness of the initiative and to what extent the lab fulfils the goals set.\nI am a resident affected by noise from people jumping, screaming, shouting, and playing basketball and football.\nPerhaps the lab could be used to encourage students to experience noise so that they will know how it affects others.\nChildren and teenagers are not only affected by noise, but are also responsible for creating it.\nThe MSO should work with the Ministry of Education to identify ways that primary and secondary schools and tertiary institutions could engage students in the lab.\nThe students could be taken to the lab during school holidays to learn how the noise they make affects their neighbours.\nThe lab could also be taken to schools as a mobile installation to remind students of the need for civic-mindedness and to teach them how to handle issues with neighbours over noise.", "url": "https://www.straitstimes.com/opinion/forum/forum-use-noise-experiential-lab-to-educate-students-on-sound-pollution"}