{"authors": [], "date_download": "2024-10-12 14:21:28", "date_modify": "2024-10-12 14:21:28", "date_publish": "2024-06-03 05:00:00", "description": "We thank Mr Harry Ong Heng Poh for his feedback (Rising prices of hawker food, May 28). The consumer price index (CPI) measures the average price changes of a fixed basket of consumer goods and services commonly purchased by households. The CPI reflects the collective inflation experience for all households which may not correspond to the inflation experience of individual consumers or individual households. Read more at straitstimes.com.", "filename": "opinion_forum_forum-various-reasons-why-consumers-experience-higher-inflation-than-cpi_1728742888.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/03/st-forum-thumbnail.jpg_0.JPEG?VersionId=YiKGFKzYgq2h7eRenVQDcNl4CUDfs9Rh&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-various-reasons-why-consumers-experience-higher-inflation-than-cpi_1728742888.html", "title": "Forum: Various reasons why consumers experience higher inflation than CPI", "title_page": "Forum: Various reasons why consumers experience higher inflation than CPI | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "We thank Mr Harry Ong Heng Poh for his feedback (Rising prices of hawker food, May 28).\nThe consumer price index (CPI) measures the average price changes of a fixed basket of consumer goods and services commonly purchased by households. The CPI reflects the collective inflation experience for all households which may not correspond to the inflation experience of individual consumers or individual households.\nPrices used to compile the CPI are gathered for a wide variety of items from a large number of outlets. Outlets revise their prices at different times for varying food items. The price increases also differ in magnitude. For example, some outlets may significantly increase prices for a particular food item, while other outlets may increase prices only slightly or not at all for the same food item.\nAs a result, the average price increase reflected in the CPI based on the different food items across outlets could be smaller than the price increase experienced by individual consumers who may purchase food items from certain outlets with larger price increases.\nSpending patterns also differ across households. Some households may spend a larger proportion of their expenditure on items that face sharper price increases in the year. These households would therefore experience higher inflation than what is captured by the CPI inflation rate, which reflects the average price increase across households.\nMore information on why the reported inflation may differ from an individual’s experience can be found at https://go.gov.sg/infographics-economy-cpi-inflation", "url": "https://www.straitstimes.com/opinion/forum/forum-various-reasons-why-consumers-experience-higher-inflation-than-cpi"}