{"authors": [], "date_download": "2024-10-12 13:52:57", "date_modify": "2024-10-12 13:52:57", "date_publish": "2024-09-20 05:00:00", "description": "We refer to Mr Foo Sing Kheng’s letter “Do what’s essential but don’t over-protect platform workers” (Sept 11). Read more at straitstimes.com.", "filename": "opinion_forum_forum-platform-workers-differ-from-the-self-employed-and-need-support_1728741177.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/st-forum-thumbnail.jpg_0.JPEG?VersionId=erIUNB1o7yUhfQ3HF1RmjJ6Jcr_8rKy2&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-platform-workers-differ-from-the-self-employed-and-need-support_1728741177.html", "title": "Forum: Platform workers differ from the self-employed and need support", "title_page": "Forum: Platform workers differ from the self-employed and need support | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "We refer to Mr Foo Sing Kheng’s letter “Do what’s essential but don’t over-protect platform workers” (Sept 11).\nWe thank Mr Foo for supporting the need for work injury compensation insurance for platform workers.\nThe reason for extending higher CPF contributions to platform workers and giving them a legal framework for representation is likewise due to the precarious nature of their work.\nWhile platform workers have the flexibility to decide when and how much to work, they are different from self-employed persons. This is because they are under significant management control by platform operators in terms of how they provide services, and therefore resemble employees to an extent.\nFor example, platform workers generally do not have a say over how much to charge for their services and what set of tasks they can take on, which are controlled by the platform operators’ algorithms.\nThis limited autonomy is why we have given platform workers some labour rights, including increased CPF contributions, to better support them at work.\nPlatform workers in the mandatory cohort or who opt in to make increased CPF contributions are also being responsible in taking care of their housing and retirement needs.\nIn contrast to platform workers, self-employed persons have full autonomy to negotiate their own compensation with service buyers. This allows them to price in their own personal injury insurance, and housing and retirement adequacy needs.\nWe hope that as a society, we will recognise and empathise with the different working conditions and constraints that platform workers are subject to, and support them in having similar protections to employees in key areas of need.", "url": "https://www.straitstimes.com/opinion/forum/forum-platform-workers-differ-from-the-self-employed-and-need-support"}