{"authors": [], "date_download": "2024-10-12 13:54:19", "date_modify": "2024-10-12 13:54:19", "date_publish": "2023-10-20 05:00:00", "description": "I refer to the report “Singapore’s competition watchdog raises concerns over Grab’s proposed takeover of Trans-Cab” (Oct 16). Read more at straitstimes.com.", "filename": "opinion_forum_forum-study-past-acquisitions-before-approving-grab-s-proposed-takeover_1728741259.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/20/st-forum-thumbnail_2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-study-past-acquisitions-before-approving-grab-s-proposed-takeover_1728741259.html", "title": "Forum: Study past acquisitions before approving Grab’s proposed takeover", "title_page": "Forum: Study past acquisitions before approving Grab’s proposed takeover | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I refer to the report “Singapore’s competition watchdog raises concerns over Grab’s proposed takeover of Trans-Cab” (Oct 16).\nThe Competition and Consumer Commission of Singapore (CCCS) should study past takeovers and acquisitions that it has approved.\nA good example could be the clearance for acquisition by NTUC Enterprise Co-operative Limited of 100 per cent of equity interests in Kopitiam Investment and its subsidiaries in December 2018.\nHas this acquisition led to a substantial lessening of competition within the relevant markets in Singapore?\nBesides the issue of lessening competition, CCCS should review if the 2018 acquisition has resulted in some form of consumer demand inelasticity leading to consumers paying higher prices for certain segments or food types.\nAlso, is NTUC Foodfare still operating Kopitiam’s hawker centres, coffee shops and foodcourts as per its acquisition plans cleared by CCCS?\nThere are good learning points for all and especially for future acquisitions which can lessen competition, reduce consumers’ choices and options, and result in consumers paying more in the long run because of inelastic demand.\nThe Grab and Trans-Cab deal is quite similar to the NTUC Foodfare and Kopitiam transaction in that both occupy the same consumer space with a relatively small number of market players.", "url": "https://www.straitstimes.com/opinion/forum/forum-study-past-acquisitions-before-approving-grab-s-proposed-takeover"}