{"authors": [], "date_download": "2024-10-12 13:32:11", "date_modify": "2024-10-12 13:32:11", "date_publish": "2024-02-14 05:00:00", "description": "The recent surge in nursing recruitment has brought me, a former Filipino nurse academic immersed in the healthcare landscape of Singapore, a sense of optimism and gratitude. Read more at straitstimes.com.", "filename": "opinion_forum_forum-granting-of-pr-status-reflects-recognition-of-foreign-nurses_1728739931.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/14/st-forum-thumbnail_1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-granting-of-pr-status-reflects-recognition-of-foreign-nurses_1728739931.html", "title": "Forum: Granting of PR status reflects recognition of foreign nurses", "title_page": "Forum: Granting of PR status reflects recognition of foreign nurses | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The recent surge in nursing recruitment has brought me, a former Filipino nurse academic immersed in the healthcare landscape of Singapore, a sense of optimism and gratitude.\nThe addition of 5,600 nurses bolsters Singapore’s nursing strength and proves to be a considerable boon for my Filipino nursing colleagues, who have been an integral part of the country’s healthcare tapestry (S’pore’s nursing strength boosted by recruitment of 5,600 nurses; most registered to work in 2023, Feb 11).\nIn 2022, Singapore had 36,995 registered nurses. According to Singapore Nursing Board’s 2019 report, about 18 per cent of the nursing workforce is Filipino.\nThis surge in recruitment is a testament to the nation’s commitment to fortifying its healthcare system to meet the escalating demands, particularly in the aftermath of the Covid-19 pandemic.\nThe article quoted Health Minister Ong Ye Kung as saying more foreign nurses were granted permanent resident status in 2023, in recognition of the essential role they played in fighting the Covid-19 pandemic and supporting Singapore’s growing healthcare needs.\nThis acknowledgement of their unwavering dedication during the pandemic underscores the vital role played by nurses, who form the biggest group of professionals within Singapore’s healthcare system.\nBeyond the immediate impact on the workforce, this move signals a broader understanding of the importance of diversity and inclusivity in healthcare.\nThe granting of permanent resident status to those who have performed well and are committed to Singapore is a game changer.\nBeyond the monetary benefits, this status offers nurses a sense of stability and permanence, giving them a more profound connection to their community. It elevates their professional standing and contributes to the overall resilience and adaptability of the healthcare system.", "url": "https://www.straitstimes.com/opinion/forum/forum-granting-of-pr-status-reflects-recognition-of-foreign-nurses"}