{"authors": [], "date_download": "2024-10-12 13:29:01", "date_modify": "2024-10-12 13:29:01", "date_publish": "2024-09-04 05:00:00", "description": "Given the proliferation of applications of all forms and functions these days, it may be timely to consider developing apps that can help those with special needs prepare for visits to the doctor or for medical procedures. Read more at straitstimes.com.", "filename": "opinion_forum_forum-create-apps-to-help-those-with-special-needs-for-medical-procedures_1728739741.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/st-forum-thumbnail.jpg_0.JPEG?VersionId=cEzcf.p1arNXz2ooImPSRtGnzYGOFfC8&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-create-apps-to-help-those-with-special-needs-for-medical-procedures_1728739741.html", "title": "Forum: Create apps to help those with special needs for medical procedures", "title_page": "Forum: Create apps to help those with special needs for medical procedures | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Given the proliferation of applications of all forms and functions these days, it may be timely to consider developing apps that can help those with special needs prepare for visits to the doctor or for medical procedures.\nThe multi-modality feature of apps – text, image and sound – can explain things and give people with special needs an idea of what to expect and what they need to do.\nThis may work out much more effectively for them than the verbal-gestural instructions, reminders or assurances from medical staff or family members trying to convey such messages.\nApps that play social stories set in the context of a hospital or clinic, for example, help to bring the experience of what a visit entails closer to the understanding of individuals with special needs.\nHealthcare providers can use a wide range of social stories through apps – on drawing blood, dental cleaning or an MRI, for instance.\nWatching social stories related to a medical consultation or surgery before the event can help to take the attention of patients with special needs away from the uncertainty of what lies ahead or their anticipation of pain. This has the potential to reduce their fear and anxiety.\nSuch apps can reduce the stress of, and load on parents and caregivers trying to get such patients to navigate the unfamiliar settings at the hospital during treatment.\nThey also give hospital staff who may not be adequately prepared for or informed about the special needs of patients an immediate tool to reach out to them.", "url": "https://www.straitstimes.com/opinion/forum/forum-create-apps-to-help-those-with-special-needs-for-medical-procedures"}