{"authors": ["Chua Mui Hoong"], "date_download": "2024-10-12 13:45:50", "date_modify": "2024-10-12 13:45:50", "date_publish": "2022-10-28 05:00:00", "description": "A new content management system and a new editorial leadership team will put ST on a firmer footing for the future. Read more at straitstimes.com.", "filename": "opinion_a-time-of-change-in-the-st-newsroom_1728740750.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/28/yaohui-pixrenovation-8706_2.jpg?VersionId=zyRQYFZQBcpOvjGvI3.oLVCrZYvaEvyF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_a-time-of-change-in-the-st-newsroom_1728740750.html", "title": "A time of change in the ST newsroom", "title_page": "A time of change in the ST newsroom | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Straits Times is undergoing a significant change in its internal workings that may not be visible to its readers, but which will help put the 177-year-old flagship newspaper on a firmer footing to navigate the brave new digital world.\nThose who have kept up with the news in the last month may think a new editor taking over the helm is the significant change I am referring to. Indeed, The Straits Times has a new editor this week, in the person of Mr Jaime Ho, 49, a former foreign service officer who moved to broadcast journalism and became chief editor of CNA Digital, before leaving earlier in 2022 to join as a partner in FGS Global, a firm that “advises the stakeholder economy”. Mr Ho took over as ST editor on Oct 25 from Mr Warren Fernandez, 56, who moved on to global communications firm Edelman as Asia-Pacific CEO. Former Business Times editor Wong Wei Kong, 54, took over Mr Fernandez’s role as editor-in-chief of the English/Malay/Tamil Media (EMTM) group within SPH Media Trust.", "url": "https://www.straitstimes.com/opinion/a-time-of-change-in-the-st-newsroom"}