{"authors": [], "date_download": "2024-10-12 14:22:05", "date_modify": "2024-10-12 14:22:05", "date_publish": "2023-12-22 05:00:00", "description": "While there may be many implications once the RTS Link becomes operational, this development should be seen in a positive light (Share results of studies on possible impact of RTS Link on S’pore businesses, Dec 21). Read more at straitstimes.com.", "filename": "opinion_forum_forum-a-win-win-situation-for-singapore-and-jb-with-rts-link_1728742925.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/22/st-forum-thumbnail.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-a-win-win-situation-for-singapore-and-jb-with-rts-link_1728742925.html", "title": "Forum: A win-win situation for Singapore and JB with RTS Link", "title_page": "Forum: A win-win situation for Singapore and JB with RTS Link | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "While there may be many implications once the RTS Link becomes operational, this development should be seen in a positive light (Share results of studies on possible impact of RTS Link on S’pore businesses, Dec 21).\nJohor Bahru’s pulling power may be stronger because of cheaper rentals and labour costs.\nJB may also attract more day trips by Singaporeans for shopping and dining due to Singapore’s stronger currency.\nBut Singapore should look at the bigger picture in terms of the opportunities that the RTS Link will bring.\nThe opening of the link has a pull factor for businesses on both sides of the Causeway.\nFor instance, medical groups and institutions of higher learning in Singapore could set up branches in JB to lower their operating cost to attract patients and students from neighbouring countries with lower fees.\nSingapore can also establish its own Silicon Valley for start-ups for research and development. We can explore high-tech farming of vegetables and fruits to address our food security issues.\nJB has much to offer for land-scarce Singapore.\nThe RTS Link will make JB more prosperous and that, in turn, will benefit Singapore as a financial and business hub.", "url": "https://www.straitstimes.com/opinion/forum/forum-a-win-win-situation-for-singapore-and-jb-with-rts-link"}