{"authors": [], "date_download": "2024-10-12 13:29:33", "date_modify": "2024-10-12 13:29:33", "date_publish": "2024-09-18 05:00:00", "description": "I am not against small weddings but some aspects of the article “Smaller ceremonies, lower budgets, more destination nuptials: How wedding trends are changing” (Sunday Life, Sept 15) did not sit well with me. Read more at straitstimes.com.", "filename": "opinion_forum_forum-small-weddings-are-fine-but-include-your-parents_1728739773.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/18/st-forum-thumbnail.jpg_2.JPEG?VersionId=vjI4J_2S9KRECsoLtPuD.7BBIwCFsznn&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-small-weddings-are-fine-but-include-your-parents_1728739773.html", "title": "Forum: Small weddings are fine but include your parents", "title_page": "Forum: Small weddings are fine but include your parents | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I am not against small weddings but some aspects of the article “Smaller ceremonies, lower budgets, more destination nuptials: How wedding trends are changing” (Sunday Life, Sept 15) did not sit well with me.\nMs Dana Ho and her groom Marco had a guest list so small that “their parents did not even make the cut”.\nShe said her parents “have three other chances” (she is the third of four daughters) so they were “pretty chill about this”.\nChill as in cold to the idea? Or disappointed that they did not measure up to be on the select list of wedding guests? As parents, why do they even need to “make the cut”?\nTo add insult to injury, Ms Ho said: “I just wanted to be with the people I loved, the ones who would be genuinely happy for us.”\nI am not sure if this behaviour of cutting your parents out of your wedding to save money should be endorsed.\nA wedding is an important life event and for the ones who brought you into the world, a momentous occasion.\nIt is not “a small thing” as it marks the start of your marriage and you would want your parents’ blessing.\nExcluding them from the start just to spend less doesn’t seem wise. Honestly, you do not save much but lose much more in the long run.", "url": "https://www.straitstimes.com/opinion/forum/forum-small-weddings-are-fine-but-include-your-parents"}