{"authors": [], "date_download": "2024-10-12 13:29:07", "date_modify": "2024-10-12 13:29:07", "date_publish": "2024-06-12 05:00:00", "description": "We thank Mr Er Chiang Kai for his letter focusing on how mainstream schools should be inclusive to students with special educational needs (SEN) (Schools should have subjects for students with special needs, June 6). Read more at straitstimes.com.", "filename": "opinion_forum_forum-supporting-students-with-special-educational-needs-in-mainstream-schools_1728739747.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/12/st-forum-thumbnail.jpg_1.JPEG?VersionId=OgoPH6mcEtea8zCIzsNMTr4sv1Ew7NMr&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-supporting-students-with-special-educational-needs-in-mainstream-schools_1728739747.html", "title": "Forum: Supporting students with special educational needs in mainstream schools", "title_page": "Forum: Supporting students with special educational needs in mainstream schools | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "We thank Mr Er Chiang Kai for his letter focusing on how mainstream schools should be inclusive to students with special educational needs (SEN) (Schools should have subjects for students with special needs, June 6).\nThe majority of students with SEN attend mainstream schools, and they learn together with peers through our teachers’ inclusive classroom practices. All teachers in mainstream schools receive basic knowledge in SEN as part of their pre-service teacher training, where they are exposed to inclusive strategies that can be implemented in their classrooms.\nStudents with SEN also receive support through intervention planning and strategies, and in-class support by SEN officers. For example, Primary 1 pupils who require more social and behavioural support are identified by schools for TRANsition Support for InTegration (TRANSIT), which helps them to develop foundational self-management skills when they start school. Schools also have Physical Education (PE) teachers who are trained in inclusive PE to support the learning of students with SEN.\nTo support students with additional social, emotional and behavioural difficulties, SEN officers have been trained to implement evidence-based interventions, such as Circle of Friends (CoF).\nCoF uses a structured peer support network to support students in primary and secondary schools. CoF aims to help students with SEN become aware of and learn to manage their social-behavioural difficulties better, through involvement of their peers who help through joint problem-solving, providing encouragement and affirmation.\nIn addition, the Character and Citizenship Education curriculum, as well as experiences through Values in Action, develops all students to be empathetic, sensitive and respectful to all, including those with SEN or disabilities. It also engages students on ways to contribute to an inclusive society and advocate against stigmas and stereotyping.\nWe recognise that some students with severe SEN require more intensive support. The parents of these children are encouraged to consider special education schools, which are resourced to provide customised and a higher level of specialised support.\nMOE will continue to work with schools, families and community partners to help our students with SEN integrate meaningfully within and outside their school communities. We certainly need the support of many helping hands to promote an inclusive learning environment for all our students.", "url": "https://www.straitstimes.com/opinion/forum/forum-supporting-students-with-special-educational-needs-in-mainstream-schools"}