{"authors": [], "date_download": "2024-10-12 13:54:12", "date_modify": "2024-10-12 13:54:12", "date_publish": "2024-05-11 05:00:00", "description": "I refer to the Forum letter “Worth retaining magazine store to preserve a bit of history” (May 6), which was a response to the article “‘I am not giving up’: Thambi Magazine Store owner seeking new Holland Village site after closure” (May 5). Read more at straitstimes.com.", "filename": "opinion_forum_letter-of-the-week-let-s-appreciate-what-we-still-have-and-support-small-businesses_1728741252.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/11/ST18089.jpg?VersionId=XX767isPB3BRsTq6bP7GU5xVwnG.1GEb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_letter-of-the-week-let-s-appreciate-what-we-still-have-and-support-small-businesses_1728741252.html", "title": "Letter of the week: Let’s appreciate what we still have and support small businesses", "title_page": "Letter of the week: Let’s appreciate what we still have and support small businesses | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I refer to the Forum letter “Worth retaining magazine store to preserve a bit of history” (May 6), which was a response to the article “‘I am not giving up’: Thambi Magazine Store owner seeking new Holland Village site after closure” (May 5).\nTo his credit, Sam, the owner of the store, has not directly expressed any wish for assistance in any form, especially regarding a new rental location for business.\nStill, he has tugged at heartstrings by recounting the shop’s long and illustrious history and its continued relevance in the heritage of Holland Village.\nThis brings us to the pertinent question of what establishments we should try to save and why.\nAt the heart of this issue is history and nostalgia, relevance and worth, with a potent blend of emotions and personal agenda thrown into the heady mix.\nAs a recent example, there has been much hand-wringing as bookshops closed down all over the country. Going by the Forum writer’s reasoning, many of these should be saved.\nEven as we continue difficult conversations, those which have closed see no hope of returning and more will close in time.\nEven as I write, Chinatown music shop Tang Nan Ah, a beloved purveyor of dialect opera CDs which has been in business for over 70 years, will be closing on May 11 (More than 70 years later, music shop Tang Nan Ah Company calls it a day, May 7).\nYes, we can appeal all we want to the relevant landlords, government agencies and other stakeholders, and we should. But we should all get used to this inevitable fact of life in Singapore, that much of what we cherish will be lost forever in the headlong rush of progress.\nMeanwhile, let us appreciate what we have and continue to support these small businesses which make our lives so much more interesting.\nOnce they fall on hard times, it’s, more often than not, the end. There is only so much, or so little, we can save.", "url": "https://www.straitstimes.com/opinion/forum/letter-of-the-week-let-s-appreciate-what-we-still-have-and-support-small-businesses"}