{"authors": ["Bill Saporito"], "date_download": "2024-10-12 13:43:19", "date_modify": "2024-10-12 13:43:19", "date_publish": "2024-08-28 05:00:00", "description": "The coffee chain is not alone in struggling with the complexity that comes from too many choices Read more at straitstimes.com.", "filename": "opinion_there-are-a-bazillion-possible-starbucks-orders-and-it-s-killing-the-company_1728740599.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/28/2024-08-16T222716Z1648289547RC29H9A2MMUIRTRMADP3STARBUCKS-LIP-GLOSS-LAWSUIT.JPG?VersionId=4BX2Qu8BgD.NEx1xVxnJ8PkU43dGj8PS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_there-are-a-bazillion-possible-starbucks-orders-and-it-s-killing-the-company_1728740599.html", "title": "There are a bazillion possible Starbucks orders - and it’s killing the company", "title_page": "There are a bazillion possible Starbucks orders – and it’s killing the company | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "You’re already in line at Starbucks – having failed to order by app – when you spot one of them. That dude who is looking down not at a cellphone but at the Post-it note that holds the orders of his office mates. Which is confirming that you are going to be late for that next meeting, because this person plans to order six coffee beverages, each of which involves some combination of tall venti grande double-pump, one to four shots of espresso, half-caf, oat milk, nonfat milk, soya milk, milk milk, whipped cream, syrup, brown sugar, white sugar, no sugar and mocha drizzle, from the pike position with two and a half twists.\nEven ordering via app has issues. There’s often a crowd waiting at the bar end because Gen Z, which tends to prefer anything but human interface, has overwhelmed the baristas with the same orders-of-magnitude drinks. Starbucks says there are more than 170,000 possible drink combinations available, but outside estimates have put the number at more than 300 billion. And the person in front of you always seems to be ordering 100 million of them.", "url": "https://www.straitstimes.com/opinion/there-are-a-bazillion-possible-starbucks-orders-and-it-s-killing-the-company"}