{"authors": [], "date_download": "2024-10-12 13:48:48", "date_modify": "2024-10-12 13:48:48", "date_publish": "2024-05-24 05:00:00", "description": "I refer to the Opinion piece “A new kind of philanthropy to fight climate change” (May 22) and agree that philanthropy is much needed to help deal with the complex, interconnected nature of challenges such as climate change. Read more at straitstimes.com.", "filename": "opinion_forum_forum-green-philanthropy-much-needed-to-help-save-environment_1728740928.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/24/st-forum-thumbnail.jpg.JPEG?VersionId=_CTlxJhyVy5hAj.6owWbCYpxOAVPnEsc&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum_forum-green-philanthropy-much-needed-to-help-save-environment_1728740928.html", "title": "Forum: Green philanthropy much needed to help save environment", "title_page": "Forum: Green philanthropy much needed to help save environment | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "I refer to the Opinion piece “A new kind of philanthropy to fight climate change” (May 22) and agree that philanthropy is much needed to help deal with the complex, interconnected nature of challenges such as climate change.\nSocial philanthropy, where members of the community are helped directly, has been around for a long time. Green philanthropy, where charitable efforts support the natural environment directly, has sprouted only in the last century.\nToday, philanthropists still fund social causes many times more than they do environmental causes.\nIt can be understandable, as they may feel a greater affinity to a person than a tree. Or when they can see a tangible outcome, such as improved employability, after one year. Or when they can engage their beneficiaries, such as children from low-income families. A child’s face, for that matter, elicits more donations than a littered river.\nHowever, it is at our own peril that we disregard green philanthropy. We will cross that dreaded 1.5 deg C increase threshold (1.48 deg C in 2023) and now need, more than ever, to focus on adaptive and mitigative efforts.\nThere are myriad green philanthropic opportunities, from seeding and actively growing an interest in students to research and implementing climate solutions.\nIf we do not save our environment today, the humans we are helping will have no habitat tomorrow.", "url": "https://www.straitstimes.com/opinion/forum/forum-green-philanthropy-much-needed-to-help-save-environment"}