{"authors": [], "date_download": "2024-10-12 13:56:08", "date_modify": "2024-10-12 13:56:08", "date_publish": "2023-12-14 05:00:00", "description": "The rise in Covid-19 infections should spark Singaporeans' customary vigilance but not ignite needless panic. Read more at straitstimes.com.", "filename": "opinion_st-editorial_don-t-overreact-to-rising-covid-19-infections_1728741368.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/14/st-editorial-high-res.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_st-editorial_don-t-overreact-to-rising-covid-19-infections_1728741368.html", "title": "Don’t overreact to rising Covid-19 infections", "title_page": "Don’t overreact to rising Covid-19 infections | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Doctors are calling on people to get vaccinated and mask up to reduce the usual year-end increase in acute respiratory infections, which include Covid-19, influenza and the common cold. It’s also important to practise what became habitual during the years of the coronavirus pandemic, namely, good hygiene, including handwashing and not touching the face with the hands. These simple measures help to reduce the spread of respiratory infections, of which Covid-19 is the most troubling of course, given the deaths and social dislocation that it caused in Singapore and around the world. Covid-19 has become an endemic disease that is best dealt with through personal precautions, social thoughtfulness and the preparedness of the healthcare system for any sudden spike in cases.\nThe healthcare system has come into focus as Covid-19 infections and hospitalisation numbers increase, putting a strain on hospitals in Singapore. Public hospitals are urging individuals with mild to moderate symptoms of the disease to visit a general practitioner clinic or a polyclinic near their home. These clinics will refer the patients to an emergency department or a specialist for outpatient care, if needed. The healthcare system is prepared for a resurgence in cases. Health Minister Ong Ye Kung told Parliament in March 2023 that Singapore would strengthen its hospital capacity given how the pandemic had tested the healthcare system severely, so much so that, at one point, the Government was monitoring bed availability, capacity and caseloads almost by the hour to detect any signs of imminent overload. That lesson has been learnt. Also, in the wake of that terrible outbreak, it was announced that the Government would boost its pandemic preparedness and response, which meant having the capability to understand quickly what virus or pathogen was being dealt with, and what actions to take.", "url": "https://www.straitstimes.com/opinion/st-editorial/don-t-overreact-to-rising-covid-19-infections"}