{"authors": ["Grace Ho"], "date_download": "2024-10-12 14:19:08", "date_modify": "2024-10-12 14:19:08", "date_publish": "2022-04-16 05:00:00", "description": "Since the Ukraine crisis began, over 600 companies have unwound their investments, closed stores or halted sales in Russia. Read more at straitstimes.com.", "filename": "opinion_companies-that-refuse-to-exit-russia-and-the-evil-of-war_1728742748.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/13/starbucks.jpg?VersionId=HKLqtXBS0wxTjBqTnOxZd.Fk5_IRGh1v", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_companies-that-refuse-to-exit-russia-and-the-evil-of-war_1728742748.html", "title": "Companies that refuse to exit Russia, and the evil of war", "title_page": "Companies that refuse to exit Russia, and the evil of war | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Since the Ukraine crisis began, over 600 companies have unwound their investments, closed stores or halted sales in Russia.\nThere's a way to classify them, says Yale University management professor Jeffrey Sonnenfeld. He came up with a list that puts them into five categories:\n1. Withdrawal: Completely halting Russian engagements or exiting Russia.\n2. Suspension: Temporarily curtailing operations while keeping return options open.\n3. Scaling back: Scaling back some business operations while continuing others.\n4. Buying time: Postponing future planned investment, development, or marketing while continuing substantive business.\n5. Digging in: Defying demands for exit or reduction of activities.\nIn my commentary, I describe how the list will exert peer pressure on companies to rethink their presence in Russia, particularly consumer-facing goods and services industries that are vulnerable to reputational damage and consumer boycotts.\nBut ultimately, any firm's decision to withdraw from a country is nuanced and seldom binary. Companies must weigh the continued Russian military aggression and reputational cost of going against global opinion, against continuing to serve ordinary citizens who may be bystanders to geopolitical conflict.\nUkraine war: The evil that men do\nAdolf Hitler and Nazism - after all these years - have remained morally instructive and perhaps even more so now, says Professor Chong Siow Ann in this commentary.\nOne of Russian President Vladimir Putin's strangest justifications for the invasion of Ukraine - or the \"special military operation\" as he described it - is saving innocent civilians by \"de-Nazifying\" the country and toppling the government in Kyiv, which he claims has been seized by \"extreme nationalists and neo-Nazis\".\nThis is even though Ukrainian President Volodymyr Zelensky is Jewish and had relatives who perished in the Holocaust.\nHow does one comprehend or justify the atrocities in Bucha - the mass graves and bodies of civilians scattered along its streets?\nSays Prof Chong: \"In the face of whatever evil being done to others, we should recall the incandescent words of Elie Wiesel: 'We must always take sides. Neutrality helps the oppressor, never the victim. Silence encourages the tormentor, never the tormented. Sometimes we must interfere'.\"\nNew podcast on social and political affairs\nAnd on the subject of Ukraine, here's a plug for the new Opinion podcast series, In Your Opinion. The first episode: What do people think about the Ukraine conflict, and why are some Singaporeans pro-China?\nElsewhere in Opinion", "url": "https://www.straitstimes.com/opinion/companies-that-refuse-to-exit-russia-and-the-evil-of-war"}