{"authors": [], "date_download": "2024-10-12 13:28:14", "date_modify": "2024-10-12 13:28:14", "date_publish": "2024-08-30 05:00:00", "description": "Mr Jeffrey Law raised valid points about helping foreigners integrate into Singapore society (Let’s do more to help immigrants integrate into S’pore society, Aug 29). Read more at straitstimes.com.", "filename": "opinion_forum-integration-is-a-two-way-street_1728739694.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/30/st-forum-thumbnail.jpg.JPEG?VersionId=dkia_ejsxEHBK_HtONInEPpByzwksXni&h=0f8e3b93", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_forum-integration-is-a-two-way-street_1728739694.html", "title": "Forum: Integration is a two-way street", "title_page": "Forum: Integration is a two-way street | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Mr Jeffrey Law raised valid points about helping foreigners integrate into Singapore society (Let’s do more to help immigrants integrate into S’pore society, Aug 29).\nIntegration is a two-way street. In addition to integration programmes such as the Singapore Citizen Journey and organising workshops and activities to help foreigners integrate, our foreign friends in our midst can also, beyond raving over local food and speaking Singlish, proactively do their part to integrate through concrete and constructive actions.\nTake the case of Singaporean Mark Yeong, who as a foreign student at the University of Sydney in 2019, volunteered nonetheless to battle bush fires as a volunteer firefighter with the Rural Fire Service (Singapore student fights bush fires in Australia 3 times a week, Dec 30, 2019). His is a good example of a foreigner proactively integrating into society through concrete and constructive actions.\nForeigners in Singapore could similarly integrate through proactive concrete and constructive actions, such as volunteering through the Singapore Civil Defence Force’s Community Emergency Preparedness Programme, the Singapore Police Force’s Citizens on Patrol Programme, joining the SAF Volunteer Corps, or volunteering with charities and organisations such as the Movement for the Intellectually Disabled of Singapore.\nThrough these proactive concrete and constructive actions by foreigners to integrate, there should be little doubt that foreigners will surely develop a sense of belonging and acceptance.", "url": "https://www.straitstimes.com/opinion/forum-integration-is-a-two-way-street"}