{"authors": [], "date_download": "2024-10-12 13:52:29", "date_modify": "2024-10-12 13:52:29", "date_publish": "2023-11-01 05:00:00", "description": "The Forward SG report charts the way ahead, but citizen participation is critical for goals to be achieved. Read more at straitstimes.com.", "filename": "opinion_a-renewed-social-compact-for-singapore_1728741149.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/01/st-editorial-high-res.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/opinion_a-renewed-social-compact-for-singapore_1728741149.html", "title": "A renewed social compact for Singapore", "title_page": "A renewed social compact for Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Forward SG report released recently signals the seriousness with which the fourth-generation political leadership sees its role in renewing the social compact required to hold this country together. The report mentions seven shifts needed to reach a more equitable and thriving Singapore. These shifts are: embracing learning beyond grades; respecting and rewarding every job; supporting families through every stage; enabling seniors to age well; empowering those in need; investing in a shared tomorrow; and playing one’s part as a united people. The shifts recognise that Singapore – according to Deputy Prime Minister Lawrence Wong as he launched the report – has reached a key inflection point where there will be more disruptions, workplace churn and impact on people’s lives.\nThese shifts can be achieved only by the Government and the people converging on shared objectives. On the education front, the goal is to give every child a good start, provide more diverse pathways to success and pursue lifelong learning. The Government will provide the template of this change, but parents, too, must be willing to embrace education as a cultural asset that ensures their children’s holistic development as citizens of tomorrow. Likewise, companies must recognise, in their long term and enlightened self-interest, the need for the Singapore system to reduce wage gaps, support job transitions and nurture local talent. Another shift lies in ensuring that public housing remains affordable and fair, and that it reflects a good social mix. This, no one will quarrel with.", "url": "https://www.straitstimes.com/opinion/a-renewed-social-compact-for-singapore"}