{"authors": ["Linette Lai"], "date_download": "2024-10-12 13:46:05", "date_modify": "2024-10-12 13:46:05", "date_publish": "2020-03-25 14:05:13", "description": "Mr Gan noted that the number of cases in Singapore has more than doubled in the past week. Read more at straitstimes.com.", "filename": "politics_parliament-coronavirus-cases-to-rise-as-more-overseas-singaporeans-return-home-says-gan-kim_1728740765.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/03/25/nmchangiairpor22503.jpg?VersionId=avw5opy9ARch3t.lvxoWdMusJiYNp.Qh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/politics_parliament-coronavirus-cases-to-rise-as-more-overseas-singaporeans-return-home-says-gan-kim_1728740765.html", "title": "Parliament: Coronavirus cases to rise as more overseas Singaporeans return home, says Gan Kim Yong", "title_page": "Parliament: Coronavirus cases to rise as more overseas Singaporeans return home, says Gan Kim Yong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The number of coronavirus cases will continue to rise in coming weeks, as some of the 200,000 overseas Singaporeans return home, said Health Minister Gan Kim Yong on Wednesday (March 25).\nHe noted that the number of cases in Singapore has more than doubled in the past week, from 266 to a total of 558 currently.\n\"Almost 80 per cent of these new cases were imported, all from countries other than China even though we continued to see around 1,000 residents and long-term pass holders return from China in the past week,\" he said.\nAs of Tuesday, there were more than 370,000 Covid-19 cases and over 16,500 fatalities from the disease worldwide, with the epicentre shifting from China to Europe.\nIn his ministerial statement in Parliament, Mr Gan said Singapore has slowed the spread of Covid-19 through a three-pronged approach: reducing importation, detecting and isolating cases early, and emphasising social responsibility and good personal hygiene habits.\nFirst, Singapore has implemented border controls to stem the inflow of travellers - all short-term visitors, including tourists, have been barred from entering or transiting since Tuesday.\nThe Government also advised Singaporeans to defer all travel until the global situation is under control.\nIt has strengthened border checks to detect and isolate cases before they come into contact with the wider community, and taken steps to detect cases early through surveillance at hospitals, polyclinics and the network of Public Health Preparedness Clinics.\nSingapore residents have benefited from more than 267,000 subsidised attendances at these clinics so far, on top of those at polyclinics, Mr Gan said.\nHe added that Singapore has also carried out around 39,000 tests for Covid-19 to date.\nThis translates to 6,800 tests per million people in Singapore, compared with around 6,500 in South Korea, and 1,000 in Taiwan.\nThese tests are key in detecting as many cases as possible and as early as possible, he said.\n\"How the outbreak develops globally will depend on the strategies and efforts of countries around the world,\" Mr Gan said, noting the World Health Organisation has advised that the course of the pandemic can still be changed if all countries take the necessary containment actions.\n\"Otherwise, we will continue to see the number of affected countries and cases rise rapidly.\"\nThe top three sources of imported cases to Singapore are the United Kingdom, the United States and Indonesia, Mr Gan said.\nAt the beginning of the epidemic, Singapore took the conservative approach of admitting all Covid-19 cases, regardless of severity, until they tested negative twice over 24 hours.\nBut now, it is clear that about 80 per cent of cases are mild or moderate, with many patients in hospital experiencing mild symptoms similar to the flu.\n\"They only require limited medical care, and what we need really are isolation facilities to prevent them from infecting others, until they are free of the virus,\" Mr Gan said.\nThis is why the Government is tapping private hospitals and setting up community care facilities, he said.\nConcord International Hospital started accepting well and stable Covid-19 patients last Friday and Mount Elizabeth Hospital saw its first such patient on Monday. The Government has also converted some government quarantine facilities, starting with D'Resort with a maximum capacity of about 500, for this purpose.\nPatients in these facilities will continue to be quarantined and closely monitored, Mr Gan said, so there is no risk of the public in the community being exposed to these cases while they are at these facilities.\n\"Only when they have fully recovered and tested negative for the virus twice over a duration of 24 hours, will they be discharged back into the community. At this point, they no longer have any risk of transmitting the virus to others, as they have fully recovered,\" he added.\n\"We will continue to explore the use of such isolation facilities for our well and stable Covid-19 patients. This way, we can focus our critical hospital resources on the seriously ill, to minimise the number of fatalities.\"\nSingapore's strategy, he said, is to slow down the infection rate and keep it as low as possible.", "url": "https://www.straitstimes.com/politics/parliament-coronavirus-cases-to-rise-as-more-overseas-singaporeans-return-home-says-gan-kim"}