{"authors": ["Wang Meng Meng"], "date_download": "2024-10-12 14:20:32", "date_modify": "2024-10-12 14:20:32", "date_publish": "2018-03-08 13:24:43", "description": "SINGAPORE - The sports scene in Punggol and Sembawang is set to get even livelier as two new sports centres will be completed there by 2021. Read more at straitstimes.com.", "filename": "politics_parliament-punggol-and-sembawang-sports-centres-to-open-by-2021_1728742832.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/03/08/file6uczot7mmeae81m02au.jpg?VersionId=yLU82rBsdbEJ5Y39Gy3H4hv9gGD14kl.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/politics_parliament-punggol-and-sembawang-sports-centres-to-open-by-2021_1728742832.html", "title": "Parliament: Punggol and Sembawang sports centres to open by 2021", "title_page": "Parliament: Punggol and Sembawang sports centres to open by 2021 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The sports scene in Punggol and Sembawang is set to get even livelier as two new sports centres will be completed there by 2021.\nIn her speech during the debate on her ministry's budget in Parliament on Thursday (March 8), Minister for Culture, Community and Youth Grace Fu announced the building of a new sports centre in Sembawang and the rejuvenation of existing facilities at Delta and Choa Chu Kang.\nAs part of the Sports Facilities Master Plan, residents in Punggol can also look forward to a regional sports centre.\nMs Fu said: \"Under the Sports Facilities Master Plan, we enhance and expand sporting access to Singaporeans, through an extensive network of sporting spaces across the country.\n\"At the regional and town levels, we have opened sports centres at Our Tampines Hub and HeartBeat@Bedok. In the next few years, a new integrated sports and community hub in Sembawang will be ready - details will be announced later this year.\n\"We will also have new facilities lined up, including new play fields at Yan Kit and Jurong Lake. The latter will be our first 'sport-in-the-park' collaboration with NParks (National Parks Board).\"\nThe Sports Facilities Master Plan is a key initiative of Vision 2030, the national sports blueprint. And the plan aims to serve the sporting needs at the national, regional, town and neighbourhood levels through new facilities and the redevelopment of existing infrastructure.\nA regional sports centre is a Tier 2 facility under the Government's Sports Facilities Master Plan, second in scale only to the Tier 1 Singapore Sports Hub. A town sports and recreation centre is a smaller-scale Tier 3 facility.\nA town sports and recreation centre typically will have an indoor sports hall, swimming complex, gymnasium and may include other facilities such as tennis and futsal courts.\nIn addition, Minister Fu also announced six new Sports-in-Precinct facilities in Taman Jurong, Nee Soon Central, Tampines North, Keat Hong, Hong Kah North and Bukit Batok. Two new playing fields are also in the pipeline at Jurong Lake and in Yan Kit.\nSelected existing sports centres, such as those in Delta and Choa Chu Kang, will also be rejuvenated this year under the Sports Facilities Master Plan.\nUnder the Sports-in-Precinct scheme, new spaces in neighbourhoods for sports and recreation will be created and will feature sheltered playing areas and multi-use courts.", "url": "https://www.straitstimes.com/politics/parliament-punggol-and-sembawang-sports-centres-to-open-by-2021"}