{"authors": ["Adrian Lim"], "date_download": "2024-10-12 13:46:33", "date_modify": "2024-10-12 13:46:33", "date_publish": "2018-11-23 19:16:02", "description": "\"We endorse and support Swee Keat and Chun Sing as our leaders,\" said a statement by a group of 30 PAP members. Read more at straitstimes.com.", "filename": "politics_younger-political-office-holders-rally-behind-heng-and-chan-as-paps-first-and-second_1728740793.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/11/23/hzccsheng1123c.jpg?VersionId=A1lTeb2pWnFPVTP2Rjycpk5XuL62oANi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/politics_younger-political-office-holders-rally-behind-heng-and-chan-as-paps-first-and-second_1728740793.html", "title": "Younger political office-holders rally behind Heng Swee Keat and Chan Chun Sing as PAP's first and second assistant secretaries-general", "title_page": "Younger political office-holders rally behind Heng Swee Keat and Chan Chun Sing as PAP's first and second assistant secretaries-general | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A group of 30 People's Action Party (PAP) members have expressed their support for the appointment of Finance Minister Heng Swee Keat as the party's first assistant secretary-general.\nIn a statement sent out on Friday afternoon (Nov 23) - shortly after the appointments in the party's Central Executive Committee (CEC) were made public - they also endorsed Trade and Industry Minister Chan Chun Sing as the PAP's second assistant secretary-general.\n\"We have been carefully considering the issue of leadership for the team. In January, we issued a statement that we will choose a leader 'in good time'. Now we have a consensus that the team will be led by Swee Keat,\" they said.\n\"We also note that Swee Keat has asked Chun Sing to be his deputy, and that Chun Sing has agreed to do so. We endorse and support Swee Keat and Chun Sing as our leaders,\" the statement read.\nThe younger political office-holders also said that they have been working closely together over the past few years, through collaborations in committees and task forces, developing and implementing policies, and walking the ground.\nThey also thanked their senior colleagues for the guidance and mentorship and for giving them opportunities to take on greater responsibilities.\n\"We have a diverse team, comprising members with different experiences, as well as complementary skills and strengths,\" they said.", "url": "https://www.straitstimes.com/politics/younger-political-office-holders-rally-behind-heng-and-chan-as-paps-first-and-second"}