{"authors": ["Toh Yong Chuan"], "date_download": "2024-10-12 14:20:19", "date_modify": "2024-10-12 14:20:19", "date_publish": "2017-11-06 17:45:20", "description": "SINGAPORE - More Central Provident Fund (CPF) members can contribute to the retirement savings of their parents and grandparents, under a new CPF Act passed in Parliament on Monday (Nov 6). Read more at straitstimes.com.", "filename": "politics_parliament-more-cpf-members-to-meet-minimum-savings-required-to-top-up-accounts-of-parents_1728742819.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2017/11/06/lwxcpf061117.jpg?VersionId=kA..7NxueFQZhEQb7W364ff1h1oGJNhn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/politics_parliament-more-cpf-members-to-meet-minimum-savings-required-to-top-up-accounts-of-parents_1728742819.html", "title": "Parliament: More CPF members to meet minimum savings required to top-up accounts of parents, grandparents", "title_page": "Parliament: More CPF members to meet minimum savings required to top-up accounts of parents, grandparents | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - More Central Provident Fund (CPF) members can contribute to the retirement savings of their parents and grandparents, under a new CPF Act passed in Parliament on Monday (Nov 6).\nWith the change, the new minimum savings they must have before they can make such contributions will include the properties they bought using their CPF savings.\nPreviously, the calculation of the minimum savings amount does not include such properties.\nWith the change, 30 per cent of CPF members aged 30 to 70 - or an additional 340,000 contributors - will be eligible to transfer their excess savings to their parents and grandparents, compared to about 20 per cent now.\nSecond Minister of Manpower Josephine Teo said during the debate on the changes that the move \"will give members more options to strengthen their parents' and grandparents' retirement adequacy\".\nFour MPs spoke at the debate on the changes.\nMr Patrick Tay (West Coast GRC) asked whether Singaporeans are saving enough for retirement, Mr Gan Thiam Poh (Ang Mo Kio GRC) wanted greater flexibility for spouses to transfer their savings to each other, while Mr Louis Ng (Nee Soon GRC) suggested tax reliefs to encourage CPF members to transfer their excess savings to their family members.\nMrs Teo, in her reply, said more Singaporeans are meeting their retirement needs from CPF savings and the latest move will encourage younger Singaporeans who have met their own retirement needs to help their older family members.\nShe added that it is already easier for spouses to transfer their CPF savings to each other than to make the transfer between family members.\nIn rejecting the idea of additional tax reliefs for such CPF transfers, she said: \"CPF contributions are already tax deductible, and interest earned on the contributions are not taxable. Hence, CPF monies transferred from one member's account to another already enjoy tax relief.\"\nWorkers' Party MP Png Eng Huat (Hougang SMC) asked if CPF officers will advise members who turn 55 to withdraw money from their CPF account and then top up the CPF accounts of the loved ones, instead of transferring the savings directly. In doing so, they can enjoy tax reliefs.\nMrs Teo said staff of the CPF Board will advise those who want to make the transfers accordingly.\nShe noted that Mr Png's tax relief suggestion will not benefit those who are not working, since these CPF members are no longer earning an income and \"a tax relief means nothing to them\".", "url": "https://www.straitstimes.com/politics/parliament-more-cpf-members-to-meet-minimum-savings-required-to-top-up-accounts-of-parents"}