{"authors": ["Toh Yong Chuan"], "date_download": "2024-10-12 14:20:16", "date_modify": "2024-10-12 14:20:16", "date_publish": "2018-03-20 14:51:35", "description": "SINGAPORE - Seniors and people with disabilities who cannot care for themselves will get more protection under a proposed law introduced in Parliament on Tuesday (March 20). Read more at straitstimes.com.", "filename": "politics_parliament-seniors-and-people-with-disabilities-to-get-more-protection-under-proposed-law_1728742816.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/03/20/gmvulnerable0320_1_2x.jpg?VersionId=0vfni2BsC566cxKw.bIAxDELi8H2aFZ3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/politics_parliament-seniors-and-people-with-disabilities-to-get-more-protection-under-proposed-law_1728742816.html", "title": "Parliament: Seniors and people with disabilities to get more protection under proposed law", "title_page": "Parliament: Seniors and people with disabilities to get more protection under proposed law | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Seniors and people with disabilities who cannot care for themselves will get more protection under a proposed law introduced in Parliament on Tuesday (March 20).\nThe long-awaited Vulnerable Adults Bill, if passed, will allow the Ministry of Social and Family Development (MSF) to intervene to protect these vulnerable groups against abuse and neglect.\nMSF officials will be able to enter private premises to assess a person's well-being. They will also be allowed to temporarily relocate vulnerable adults to safe places such as shelters and disability homes. They currently do not have such powers.\nUnder the Bill, the officials can also apply for protection orders in court to prevent abusers from causing further harm.\nIn extreme circumstances, the MSF can ask the courts to give its officials powers to step in even if the vulnerable persons refuse help. This would typically involve those who are pressured by their family members, said the ministry in a statement after the Bill was introduced.\nIt added that whistleblowers will be protected under the law, while abusers will face \"enhanced penalties\", though it did not spell out details of the protection and heavier punishment.\nThe proposed law comes amid a rapidly ageing population, with more seniors likely to be unable to care for themselves.\nSingapore today has around 500,000 people aged 65 and above, and the number is expected to almost double to around 900,000 by 2030.\nThe number of elderly living alone is also projected to increase from 35,000 in 2012 to 83,000 in 2030, the MSF said.\nAn estimated 103,000 people will have dementia by 2030.\nOne in 10 people aged 60 and above have the disease, which causes the gradual decline of the brain and abilities such as thinking, memory and judgement, while half of those aged 85 and older have it.\nThe Vulnerable Adults Bill, first mooted in October 2014 by then Minister for Social and Family Development Chan Chun Sing, was more than three years in the making.\nAt that time, Mr Chan described it as \"the final safeguard, the final resort\", and stressed that it was not meant for people to push the responsibility of caring for vulnerable seniors to the state.\nThe proposed law had been slated to be passed by 2015, but in July 2016, the MSF held a month-long drive to seek public views. It received 43 inputs from individuals and groups such as family service centres, the Law Society of Singapore, the Singapore Medical Council and Association of Women for Action and Research (Aware), and said in September 2016 that there was \"strong support\" for the proposed law.\nThe proposed law is slated to be debated in the House later this year.", "url": "https://www.straitstimes.com/politics/parliament-seniors-and-people-with-disabilities-to-get-more-protection-under-proposed-law"}