{"authors": ["Gabrielle Chan"], "date_download": "2024-10-12 13:29:04", "date_modify": "2024-10-12 13:29:04", "date_publish": "2023-12-20 14:45:00", "description": "Victims would receive e-mails from scammers impersonating Iras personnel. Read more at straitstimes.com.", "filename": "singapore_10-victims-lose-at-least-9000-to-phishing-scam-involving-iras-refunds_1728739744.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/20/aiphishing201223.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_10-victims-lose-at-least-9000-to-phishing-scam-involving-iras-refunds_1728739744.html", "title": "10 victims lose at least $9,000 to phishing scam involving supposed tax refunds", "title_page": "10 victims lose at least $9,000 to phishing scam involving supposed tax refunds | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - About 10 victims have lost at least $9000 since Dec 9 to scams involving supposed refunds from the Inland Revenue Authority of Singapore (Iras).\nThe police said on Dec 20 that victims of this phishing scam variant would receive e-mails from scammers impersonating Iras personnel.\nThe e-mails would inform recipients that they are eligible for a refund due to prior “overcharging”.\nA weblink, which directs victims to a phishing website impersonating the Iras website, would require victims to select their preferred refund method via debit or credit card.\nVictims would then enter their bank card details and one-time passwords (OTPs) on the phishing website.\nThey would discover they had been scammed only after receiving notifications of unauthorised transactions made on their debit or credit cards.\nThe public is advised to adopt precautionary measures such as using the ScamShield application and setting security features like enabling two-factor authentication or multi-factor authentication for banks, said the police.\nThey added that the public should check for signs of scams with official sources – such as the Anti-Scam Helpline or the Scam Alert website – and verify the authenticity of claims of problems with their income tax status with the official Iras website.\nPersonal or banking credentials as well as OTPs should never be disclosed to anyone, the police said.\nAll fraudulent transactions should be reported to the bank immediately. Those with information relating to scams should call the police hotline on 1800-255-0000, or submit it online at www.police.gov.sg/iwitness.", "url": "https://www.straitstimes.com/singapore/10-victims-lose-at-least-9000-to-phishing-scam-involving-iras-refunds"}