{"authors": ["Fatimah Mujibah"], "date_download": "2024-10-12 14:03:22", "date_modify": "2024-10-12 14:03:22", "date_publish": "2024-09-11 17:31:34", "description": "The Japanese retail chain said the move is part of its ongoing commitment to sustainability. Read more at straitstimes.com.", "filename": "singapore_don-don-donki-to-end-plastic-bag-sales-from-oct-1-drawing-mixed-reactions-from-shoppers_1728741802.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/hzdonki110924.jpg?VersionId=Oa8RblyQwZzd8cM1jeTAOfUxjx_buhWd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_don-don-donki-to-end-plastic-bag-sales-from-oct-1-drawing-mixed-reactions-from-shoppers_1728741802.html", "title": "Don Don Donki to end plastic bag sales from Oct 1, drawing mixed reactions from shoppers", "title_page": "Don Don Donki to end plastic bag sales from Oct 1, drawing mixed reactions from shoppers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Japanese retail chain Don Don Donki will stop the sale of plastic bags at its 16 outlets in Singapore from Oct 1.\nThis shift comes as part of the franchise’s ongoing sustainability commitment, following the National Environment Agency’s 2021 “Say No to Plastic Bags” campaign.\nCustomers who needed plastic bags paid 10 cents for each transaction until July 2023, when plastic bags at the store cost five cents each.\nNews of the change spread after a Reddit post showed the signs placed in various Don Don Donki stores. The A4-sized notices urge customers to bring reusable bags and support a greener future. “Thank you for your understanding and support,” the message reads.\nWhen The Straits Times visited the Paya Lebar Quarter Mall outlet on Sept 10, many shoppers were seen juggling items in their hands instead of using plastic or reusable bags.\nOf the 12 people ST spoke to, half of them said they are fine with the sale of plastic bags ceasing, as they already have the habit of carrying their own bags since major supermarkets such as FairPrice and Sheng Siong began charging at least five cents for plastic bags in July 2023.\nFrequent customer Adeline Low, 64, a retiree, said: “It has become a routine for me to carry an additional recyclable bag for a few years now, so I’m not going to be one of those affected.”\nCustomer Shermaine Tan, 30, who works in accounting, feels the same way. She said she uses her own reusable bag when she buys bulky items, like a carton of drinks.\nHowever, some others found the new policy “hypocritical” and “troublesome”.\nMr Daniel Quah, 27, said: “What commitment to sustainability? Most of their items such as pre-made bento and sushi sets include a lot of plastic packaging.”\nThe corporate analyst said he visits Don Don Donki at least once a week to buy vegetables, fruits and fresh meat. He usually buys two plastic bags from the store on each visit, and carries his own cooler bag for perishable items.\nHe said it is better if the retail chain can still give customers the option of buying plastic bags at checkout, although the price could be increased to 30 cents per bag to discourage usage.\nAnother shopper, who wanted to be known only as Mel Chandan, said: “I think it doesn’t make sense if Don Don Donki uses plastic for advertising (materials) such as brochures, and then charge for plastic bags.”\nThe 25-year-old customer service officer added: “I feel like businesses should practise what they preach if they are trying to promote sustainability.”\nResponding to queries, a Don Don Donki spokesman on Sept 12 said: “As part of our sustainability efforts, Don Don Donki Singapore will join the other regions such as Hong Kong, Taiwan, Macau and Malaysia to stop the sale of plastic bags.\n“More reusable bag alternatives will be provided.”", "url": "https://www.straitstimes.com/singapore/don-don-donki-to-end-plastic-bag-sales-from-oct-1-drawing-mixed-reactions-from-shoppers"}