{"authors": ["Audrey Tan"], "date_download": "2024-10-12 13:31:35", "date_modify": "2024-10-12 13:31:35", "date_publish": "2024-04-16 20:38:00", "description": "Such projects generate positive social and environmental impact, alongside a financial return. Read more at straitstimes.com.", "filename": "singapore_family-offices-in-singapore-show-growing-interest-in-nature-friendly-investments_1728739895.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/IMGphoto-output411JC3FMLI.jpg?VersionId=i8UjuQd8YZ1OVvGXr8mNw6xRj3mWhCc7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_family-offices-in-singapore-show-growing-interest-in-nature-friendly-investments_1728739895.html", "title": "Family offices in Singapore show growing interest in nature-friendly investments", "title_page": "Family offices in Singapore show growing interest in nature-friendly investments | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Nature conservation, usually funded by governments and philanthropic organisations, is getting a new source of support – family offices in Singapore.\nSome of these private wealth management advisory firms that serve high-net-worth families have expressed growing interest in nature-friendly impact investments.\nThis comes amid growing calls by the United Nations for financial institutions, governments and the private sector to step up financing for nature conservation.\nIn a video address aired on April 16 at Ecosperity Week – a sustainability conference convened by global investment company Temasek – International Union for Conservation of Nature president Razan Al Mubarak said: “We need to redirect financial flows from activities that harm nature towards those that protect, restore and sustain nature.\n“It is imperative that non-state actors, businesses, financial institutions, cities and regions embrace this paradigm shift by placing nature at the forefront of climate action and strategic agendas.”\nIn Singapore, Silverstrand Capital was founded as a family office in 2019 with a mission to scale up regenerative agriculture – farming practices that restore soil health, increase biodiversity, capture carbon and benefit local communities – through impact investing.\nSuch investments generate positive and measurable social and environmental impact, alongside a financial return.\nSilverstrand founder Kelvin Chiu, 37, said the focus on regenerative agriculture was broadened in 2021 to include biodiversity protection. “I realised that we were trying to change agriculture because it is the biggest contributor to nature loss globally,” he said.\n“As a single family office without external investors, we are in a unique position with more flexibility in terms of investment timeframe, return expectations and types of investment.\n“Unlike many funds… that often prioritise financial returns and proven business models, we have the liberty to support nature-positive businesses that create deeper impact but may be deemed too early or too risky by others and end up being overlooked.”\nAnother family office, Rumah Group, started its environmental portfolio in 2017. It supports initiatives that aim to improve the health of the oceans, such as seaweed farming and plant-based proteins, among other sustainability-linked investments.\n“As the natural world crumbles around us, family offices have the aptitude to recognise long-term threats and opportunities, and have the opportunity to play a pivotal role in catalysing funding for much-needed work to repair our planet home,” said Rumah Group director Kathlyn Tan, 36. “And as financial sustainability and environmental sustainability increasingly align, those who act early stand to reap higher rewards.”\nThe financing of nature was a key focus on the second day of Ecosperity Week, held at Marina Bay Sands from April 15 to 17.\nA report on South-east Asia’s green economy, published on April 15 by Bain & Company, GenZero, Standard Chartered and Temasek, identified nature as a sector in the region where there are opportunities to cut emissions, protect ecosystems and generate revenues. For example, investments in sustainable rice cultivation could cut water use and emissions of methane, a powerful greenhouse gas.\nMs Kyung-Ah Park, Temasek’s head of environmental, social and governance investment management and managing director for sustainability, said nature can help in humanity’s bid to tackle climate change, but that it is declining at unprecedented rates.\n“Asia is among the most at-risk regions, with 63 per cent of its GDP at risk from nature loss, but it is also where the opportunity is,” she said. “(At Ecosperity), we aim to rally stakeholders for action, and catalyse the systems-level change we need to realise a thriving, sustainable world for current and future generations.”\nMr Lee Woon Shiu, group head of wealth planning, family office and insurance solutions at DBS Private Bank, said that with a new generation of family members taking over the reins of their familial wealth, there is growing interest among this group to see how their capital can be channelled into more impactful investments with social or environmental benefits.\nAs many of such investments are in private markets, it is challenging to identify trends or glean concrete figures on the number of family offices expressing interest in such fields, said Mr Lee. But anecdotally, the bank has seen “strong interest” among the next generation of family office leaders in environmental causes, he added.\nFor example, DBS Foundation – which supports businesses that help or make an impact on vulnerable communities – had supported social enterprise Phool from India, which collects floral waste from the Ganges River to create a sustainable alternative to leather, dubbed Fleather.\nThis material was featured during Paris Fashion Week, Mr Lee said, and it won a strong following among some of the family offices managed by the bank. “The massive opportunities created by investments into such sustainable investments are drawing more family offices to review and step up their support in this regard,” he added.\nSilverstrand’s Mr Chiu agreed, saying: “In South-east Asia, there is growing momentum in impact investing with the emergence of more first-generation family offices, driven by younger, entrepreneurial founders who embrace the concept of profit with purpose.”\nImpact investments are the most effective way to create long-lasting, positive change at scale, he noted. “We believe that for the impact to be enduring, the solution must also be financially self-sustaining,” he said. “There is a new generation of impact entrepreneurs looking to do good and do well, and it is up to us as investors to support them in their journey.”\nProfit-with-purpose philosophy aside, Mr Lee from DBS said research has shown that over the longer term, stocks with strong environmental, social and governance scores outperformed the larger benchmark index.\nMoreover, as national policies evolve in favour of greater disclosure of climate and nature-related risks and opportunities, with greater clarity on what sustainable financing entails, the trend of an increasing interest in sustainable investments looks set to continue, he added.\nAsked if such investments made by family offices will have cascading effects on the economy, Mr Lee said their investments have a longer-term strategic impact.\n“The many ultra-high-net-worth families we have spoken to have shared with us that capital will make the most impact if there is a network in place to make connections,” he said.\n“The choice of Singapore as a preferred hotbed for partnerships and collaboration will create continuous... inflows of deep talent and new investors or family offices who would choose Singapore as their hub, which will, in turn, translate into sustained growth in new pockets within the financial and associated support sectors in Singapore.”", "url": "https://www.straitstimes.com/singapore/family-offices-in-singapore-show-growing-interest-in-nature-friendly-investments"}