{"authors": ["Esther Loi"], "date_download": "2024-10-12 14:17:02", "date_modify": "2024-10-12 14:17:02", "date_publish": "2023-10-12 18:40:00", "description": "New brands include Japanese custom-built car-maker Mitsuoka and Chinese electric car brand Ora. Read more at straitstimes.com.", "filename": "singapore_the-car-expo-returns-oct-14-15-new-brands-taking-part-for-first-time_1728742622.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/12/JYU4946.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_the-car-expo-returns-oct-14-15-new-brands-taking-part-for-first-time_1728742622.html", "title": "The Car Expo returns Oct 14-15, new brands taking part for first time", "title_page": "The Car Expo returns Oct 14-15, new brands taking part for first time | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Car Expo, previously known as Cars@Expo, returns this weekend, with new car brands like Japanese custom-built car manufacturer Mitsuoka and Chinese electric car brand Ora participating in the event for the first time.\nThirty-four car brands – the same number as April’s edition – will be showcased at the two-day event at Singapore Expo Halls 4B and 5, despite the high certificate of entitlement (COE) prices, noted organiser SPH Media, which publishes The Straits Times.\nThese comprise 18 authorised distributors, seven pre-owned car dealerships and nine auto accessory companies.\nOn Oct 4, The COE premium for the Open category – which can be used for any vehicle type except motorcycles, but is used mostly for bigger cars – closed at a new all-time high of $152,000, while that for larger cars climbed to a record $146,002. The COE premium for smaller cars ended at $104,000.\nAuthorised distributors Citroen, Kia and Mercedes-Benz; pre-owned car dealerships CarTimes Automobile and Motor-East; and auto accessory companies City TyreAuto and Mobot, are among the participating brands this weekend.\nThe event, which is the biggest car show in Singapore, will also include car rental companies in its line-up, such as Fasst and Lion City Rentals.\nWith any purchase of a used or new car at the expo, customers will receive up to $1,000 worth of cash vouchers from fuel retailer SPC.\nThe first 100 buyers of pre-owned cars will also each get an SPC car servicing voucher worth $115.\nTo redeem their vouchers, customers must present their original order form, dated Oct 14 or 15, at the SPH Media Organiser booth.\nThe first 1,000 expo visitors daily will each receive a limited-edition eco-friendly event tote bag.\nDr Tan Wei Ming, 37, will be attending the event to look for deals to buy a second car.\nBesides considering COE prices, the doctor said that he looks at other factors such as discounts, dealer margins, freebies, and servicing and warranty packages for his car purchases.\n“The most important factor to me is whether I like the car, regardless of the COE prices, as long as it’s within my means,” added Dr Tan.", "url": "https://www.straitstimes.com/singapore/the-car-expo-returns-oct-14-15-new-brands-taking-part-for-first-time"}