{"authors": ["Yew Lun Tian"], "date_download": "2024-10-12 13:37:11", "date_modify": "2024-10-12 13:37:11", "date_publish": "2024-06-02 11:10:00", "description": "They are responsible for tensions in the Taiwan Strait and South China Sea: China's defence chief Read more at straitstimes.com.", "filename": "singapore_beijing-takes-aim-at-taipei-manila-and-washington-for-escalating-tensions-in-the-region_1728740231.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/02/wgt-dongjunsrl-020624_0.jpg?VersionId=ENrTO94L8qCEcLWDdFKLF7jmHoRoQBg_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_beijing-takes-aim-at-taipei-manila-and-washington-for-escalating-tensions-in-the-region_1728740231.html", "title": "Beijing accuses ‘external forces’ of escalating tensions, warns them to stay out of the region", "title_page": "Beijing accuses ‘external forces’ of escalating tensions, warns them to stay out of the region | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Chinese defence minister has warned “hegemonic powers” to stay out of the Asia-Pacific, one day after his US counterpart proffered his country’s commitment to the region.\nExternal forces, charged Admiral Dong Jun, have worked with separatists to erode the prospects of peaceful reunification with Taiwan.\nSpeaking on June 2 at the Shangri-La Dialogue in Singapore, Adm Dong pinned the blame for escalating tensions in Asia – whether in the Taiwan Strait or the South China Sea – on the US, without directly naming it.\nAnyone who dares split Taiwan from China will be “crushed to pieces” and destroyed, he warned.\n“Speaking as a defence minister, I tell you frankly that we are very well-prepared for any extreme scenario related to Taiwan independence,” Adm Dong, a former Navy chief, said.\n“It would be as easy as catching a turtle in a jar, nothing to sweat about,” he added, using a Chinese idiom.\nTrying to fight the People’s Liberation Army is as futile as “the praying mantis that tries to block a cart with its arm”, he said.\nChina has never renounced the use of force to “take back” Taiwan and views the self-ruled island as its territory, a claim rejected by Taipei. The US is obligated by its Taiwan Relations Act to provide the island with the arms it needs to defend itself.\nUS officials’ visits and arms sales to Taiwan have angered China, which views such acts as providing tacit support for Taiwan independence.\nDuring the question-and-answer session that followed his speech, Adm Dong dwelled on Taiwan for 10 minutes, even as delegates asked questions on other matters, including China’s position on Ukraine and the Middle East.\n“Taiwan is the core of China’s core interests; since I’m asked about it, I have to answer it responsibly,” he explained to the moderator, Dr Bastian Giegerich, chief executive of the International Institute for Strategic Studies (IISS), who interrupted him twice to nudge him to address other questions.\nOn the broader regional security concerns, he said: “We countries in the Asia-Pacific have the ability and confidence to resolve issues in our region. Our people hate to take orders from hegemonic powers or be sucked into confrontational camps.”\nHe also said: “We do not allow hegemony politics to harm Asia-Pacific. We do not allow others to bring their geopolitical conflict and cold and hot wars into Asia-Pacific. We do not allow any country, any force to start wars and create chaos here.”\nAlthough he did not name any country, it was an obvious allusion to the US. The Joe Biden administration has adopted a strategy of enlisting its allies and partners so that it can speak to China from a “position of strength”.\nSpeaking at the same forum a day earlier, US Defence Secretary Lloyd Austin had stressed that the Indo-Pacific remains a priority and encouraged like-minded countries in the region to “converge” on security matters. “The United States can be secure only if Asia is,” he said.\nAnalysts say this differing view is partly why both countries are on a path of collision.\nAssociate Professor Alfred Wu at the Lee Kuan Yew School of Public Policy pointed out to The Straits Times that while China views the US as an “external force”, the US sees itself as part of the Asia-Pacific community as it is next to the Pacific Ocean and has many interests intertwined with Asia.\n“As China sees the risks over Taiwan and South China Sea rising and blames the US for fanning the flame, it will become more entrenched on a path of collision with the US,” he said.\nAdm Dong on June 2 also spoke on the South China Sea, taking aim at a “certain country” that allowed the US to deploy an intermediate-range missile system. It was a pointed response to Philippine President Ferdinand Marcos Jr, who on May 31 asserted his nation’s territorial claims in the South China Sea that are disputed by China.\nThe Chinese Coast Guard had in recent months used water cannon to hit at Philippine military vessels near the disputed Second Thomas Shoal, causing a few injuries. President Marcos said that if one Philippine national were to die in such conflict, he would consider it as close to an act of war.\nThe US has a mutual defence treaty with the Philippines and is obliged to go to its defence if the latter comes under attack.\nMr Austin had said on June 1: “The harassment that the Philippines has faced is dangerous – plain and simple.”\nAdm Dong turned that comment on its head, likening the Philippines’ action to “peng ci’er”, a Chinese colloquial term to describe fraudsters who intentionally get themselves injured, so as to claim compensation.\n“You let yourself be bumped into a car, you fall and create an impression that you are hurt, you are vulnerable. When in actual fact you violated laws and regulations, had made a premeditated move and were distorting the facts and creating trouble,” he said.\n“China has exercised sufficient restraint, but there is a limit,” Adm Dong warned.", "url": "https://www.straitstimes.com/singapore/beijing-takes-aim-at-taipei-manila-and-washington-for-escalating-tensions-in-the-region"}