{"authors": ["Selina Lum"], "date_download": "2024-10-12 13:55:05", "date_modify": "2024-10-12 13:55:05", "date_publish": "2024-07-29 19:10:00", "description": "He said he was justified in accessing the records as it was for the purposes of whistle-blowing. Read more at straitstimes.com.", "filename": "singapore_courts-crime_doctor-who-accessed-records-of-colleague-s-patients-sues-singhealth-for-wrongful-dismissal_1728741305.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/29/202404132779910220240301132148img3233.jpg?VersionId=wIwLnn8hYdrj0BWawOX.rKCCAH.TcqYI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_doctor-who-accessed-records-of-colleague-s-patients-sues-singhealth-for-wrongful-dismissal_1728741305.html", "title": "Doctor who accessed records of colleague’s patients sues SingHealth for wrongful dismissal", "title_page": "Doctor who accessed records of colleague’s patients sues SingHealth for wrongful dismissal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A neurosurgeon is suing SingHealth for wrongful dismissal after he was sacked for repeatedly accessing the medical records of a fellow doctor’s patients so that he can “police” the colleague.\nDr Eddie Tan Tung Wee, 43, said in court on July 29 that what he had done was “unauthorised but justified”, as he had accessed patient records for the purposes of whistle-blowing.\nThe healthcare group rejected Dr Tan’s purported reasons for committing data breach, arguing that he was simply motivated by professional rivalry.\nDr Tan, who is not represented by a lawyer, was taking the stand on the first day of a nine-day High Court trial.\nHe was dismissed on March 14, 2022, after SingHealth, Singapore’s largest public healthcare cluster, convened a committee of inquiry (COI) to investigate his data breach.\nThe reason for his dismissal was his “recalcitrant and targeted unauthorised access” of patient records, which had “irrevocably destroyed the trust and confidence necessary to continue the employment relationship”.\nDr Tan filed the lawsuit against SingHealth on June 6, 2023.\nHe alleged that the termination of his employment was unlawful because SingHealth did not comply with certain processes during the COI proceedings, and had failed to consider that he had acted out of concern for patient safety.\nSingHealth, which is represented by Senior Counsel Kuah Boon Theng, contended that it had complied with internal policies and processes.\nIn Ms Kuah’s opening statement, she contended that Dr Tan “went out of his way” to target his colleagues.\nInstead of respecting SingHealth’s investigation processes into the complaints he raised regarding his colleagues, Dr Tan repeatedly committed data breach, she said.\nEven after his superiors at the National Neuroscience Institute (NNI) specifically warned him to stop doing so, Dr Tan persisted with his misconduct, said Ms Kuah.\nShe described Dr Tan as disgruntled and lacking insight into his own wrongdoing.\nAccording to the opening statement, restrictions imposed during the Covid-19 pandemic in 2020 prevented healthcare professionals from crossing over to other hospitals.\nDr Tan was then based in Sengkang General Hospital.\nMs Kuah said Dr Tan suspected that his colleague, referred to only as Dr Chen, who was based in Singapore General Hospital (SGH), was becoming more involved in skull base surgery cases, which was Dr Tan’s chosen sub-speciality.\nDr Tan expressed concern to his heads of department (HODs) that Dr Chen had allegedly been “running” a clinic at the SGH ear, nose and throat (ENT) department.\nThis was against the rule set by NNI’s department of neurosurgery – that associate consultants should not run sub-speciality clinics or manage patients at these places.\nInvestigations showed that Dr Chen had attended the ENT clinic as an observer, and his posting to SGH, a major tertiary institution, gave him more opportunities and enabled him to work with a mentor.\nMs Kuah said Dr Tan was not satisfied with the HODs’ explanations and remained aggrieved that no disciplinary action was taken against Dr Chen.\nA few months later, Dr Tan escalated his concerns to Professor Ivy Ng, SingHealth’s then group chief executive officer, accusing the HODs of “rampant favouritism”.\nAn independent review panel concluded that the favouritism allegation was unsubstantiated.\nDr Tan remained unhappy, and felt that there was a conspiracy within the department for Dr Chen’s benefit.\nHe subsequently raised concerns about two patients to Prof Ng, which led to two COIs being convened to investigate Dr Chen and his mentor.\nThe first patient developed complications after an operation largely performed by Dr Chen, while the second patient died a day after Dr Chen performed emergency surgery without his mentor being present.\nThe first COI concluded that there had been no professional misconduct, while the second COI found that there was no negligence or criminal act committed.\nSeparately, a whistle-blower report was lodged against Dr Tan and two other NNI doctors, alleging that they had been “trying to find fault” with Dr Chen and his mentor, and that Dr Tan had accessed the medical records of one of their patients.\nA third COI was then convened to investigate the data breach.\nDr Tan admitted he had accessed the records of patients who were not under his care. He said he had done so to look for evidence of Dr Chen’s non-compliance with the HODs’ instruction to stop attending the ENT clinic and to check if Dr Chen had stopped misbehaving.\nThe COI recommended that Dr Tan be issued a warning.\nGiven that the case involved data breach, it was escalated to the SingHealth disciplinary council, which is chaired by the group CEO, with the deputy group CEOs as its members.\nThe council decided to dismiss Dr Tan. Ms Kuah said the council members will testify on the reasons why each of them decided to do so.\n“It was SingHealth’s prerogative as an employer to reject his self-proclaimed justifications for his misconduct, and well within SingHealth’s contractual right to terminate his employment,” she said.", "url": "https://www.straitstimes.com/singapore/courts-crime/doctor-who-accessed-records-of-colleague-s-patients-sues-singhealth-for-wrongful-dismissal"}