{"authors": ["Zhaki Abdullah"], "date_download": "2024-10-12 13:54:48", "date_modify": "2024-10-12 13:54:48", "date_publish": "2024-04-29 05:00:00", "description": "Jury still out on the effectiveness of collagen in food and drinks, experts say. Read more at straitstimes.com.", "filename": "singapore_health_will-that-collagen-bubble-tea-really-make-your-skin-more-supple_1728741288.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/29/rosalind-chang-PwPicZYoPI-unsplash.jpg?VersionId=gqr4_iBCDhlUrVt2a4Rw9vrQEEWzkGMi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_will-that-collagen-bubble-tea-really-make-your-skin-more-supple_1728741288.html", "title": "Will that collagen bubble tea really make your skin more supple?", "title_page": "Will that collagen bubble tea really make your skin more supple? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Produced naturally by the human body, collagen is a protein responsible for the elasticity of the skin, as well as strengthening and hydrating it.\nIn recent years, some eateries have added collagen to popular food and drinks such as hotpot and bubble tea, touting the protein’s effectiveness in making skin more supple.\nBut is there any truth to such assertions? Simply Science casts a closer look at the claims behind collagen.\nFound in bones, cartilage, nails and hair, collagen is one of the most commonly found proteins in the human body, providing structural support for cells and tissues, as well as protecting organs and joints.\n“Our bodies are able to naturally produce collagen through the amino acids – the building blocks of protein – found in protein-rich foods like meat, fish and poultry,” said Singapore-accredited nutritionist Adlyn Farizah.\nIt is more concentrated in parts of the animals such as bones and joints, and foods like fish skin, gelatin and bone broth are considered collagen-rich, she said.\nMs Adlyn added that other nutrients naturally present in the food we eat – such as vitamins A, C and E, as well as minerals such as zinc and copper – are also required to support the process of collagen production in the human body.\nDr Tan Kian Teo, a dermatologist with specialist clinic Skin Physicians, noted that the body produces less collagen as one ages, with the quality of collagen also becoming poorer.\n“Therefore, our skin becomes less firm and elastic (as we age),” he said.\nFactors such as excessive exposure to the sun, smoking, as well as a lack of sleep and physical activity, can also reduce the production of collagen, Ms Adlyn added.\nSo will sipping on that collagen-infused bubble tea or slurping mala soup with collagen give us what we need for more supple skin?\nThe jury is still out on how effective these really are, the experts say.\n“There isn’t enough evidence to show that taking collagen drinks and supplements will benefit the skin,” said Ms Adlyn, noting that this is because our bodies are unable to absorb collagen in its whole form.\nShe said that digestion results in collagen being broken down into peptides.\nPeptides are short chains of amino acids – organic compounds consisting of carbon, hydrogen and nitrogen – which are the molecules used by all living things to make proteins.\nWhile these peptides pass through the intestinal tract and enter the bloodstream, they will not necessarily be reformed into collagen and deposited into our skin, she said.\nThough most supplements will come in the form of collagen peptides – typically made from small pieces of animal collagen – there is no way to control what happens to collagen once ingested, said Ms Adlyn.\nInstead, collagen ingested orally could also be deposited in other areas where it is needed – such as the muscles, bones, tendons and cartilage, she noted.\nShe noted that research on the benefits of such collagen supplements on skin health are often small-scale trials, done by the companies which manufacture such collagen products.\n“There could also be other ingredients in the supplements that could have led to the results, so it’s hard to pinpoint if it really is due to ingesting collagen,” she said.\nStill, those who choose to consume collagen drinks or supplements should try to avoid the ones with a lot of fillers or additives, said Ms Adlyn, noting that, as supplements are not regulated, consumers should opt to purchase from reliable sources such as pharmacies.\nShe added that they should also check the Health Sciences Authority’s online database for safe supplements at https://www.hsa.gov.sg/vns-list.\nIn addition to a healthy, well-balanced diet, people should use sunscreen too, as ultraviolet (UV) radiation can damage collagen, said Dr Tan.\nIn addition, procedures like high-intensity focused ultrasound treatment could stimulate production of collagen in the skin and result in its tightening, he added.\nHe said: “If we have a healthy and well-balanced diet, it should provide the necessary raw ingredients for us to produce our own collagen.”\n- Simply Science is a new fortnightly series looking at the science behind everyday questions.", "url": "https://www.straitstimes.com/singapore/health/will-that-collagen-bubble-tea-really-make-your-skin-more-supple"}