{"authors": ["Rachael Seow"], "date_download": "2024-10-12 13:31:33", "date_modify": "2024-10-12 13:31:33", "date_publish": "2018-05-21 12:30:00", "description": "Imagine a vehicle bomb explosion, a chemical attack and a riot taking place at the same time in different parts of Singapore. How will the different Home Team departments react? Read more at straitstimes.com.", "filename": "singapore_home-team-introduces-new-simulation-training-system_1728739893.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/05/21/yq-hometeam-210518.jpg?VersionId=O24EQZxHQBXT1hi6Y5NZ_PLF6qGs_S7V", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_home-team-introduces-new-simulation-training-system_1728739893.html", "title": "Home Team introduces new simulation training system using realistic 3D scenarios and locations", "title_page": "Home Team introduces new simulation training system using realistic 3D scenarios and locations | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Imagine a vehicle bomb explosion, a chemical attack and a riot taking place at the same time in different parts of Singapore.\nHow will the different Home Team departments react?\nSince January this year, the Home Team has been conducting exercises involving its various department including the Singapore Police Force and the Singapore Civil Defence Force using a new simulation system.\nLooking like a virtual reality game, but on a much larger scale, commanders in different rooms watch scenes unfold on large screens as they shout instructions on their headsets.\nFor example in a riot situation, as commanders give their orders, 3D images show officers on the ground confronting rioters on actual streets in Singapore.\nDeveloped by the Home Team Academy, and customised based on technology by Dutch company XVR Simulation, the makers strived for realism in simulating emergency and crisis scenarios. Four areas in Singapore - Bishan, Orchard Road, Marina Bay Sands and Little India - have been mapped out, right down to the individual buildings.\nThe system, in development since last year, is housed at the new Home Team Simulation Centre in Choa Chu Kang. It was opened on Monday (May 21) by Home Affairs and Law Minister K. Shanmugam.\nSpeaking at the launch, Mr Shanmugam said the system allows for an integration of the different Home Team departments.\n\"We will need to strengthen Home Team integration, based on common values, a shared mission and the academy has a key role to play in that.\"\nHere is how the system works: commanders are housed in different rooms, each with a specific role.\nThere is a front-line post; forward-command posts near the different incident sites; and a main, more removed, command post located at headquarters. They are referred to collectively as the mock command centre.\nIn a separate simulation control room, officers in charge of the training introduce rapid scenario changes and live \"injects\", meaning disruptions such as the appearance of a violent protester. This is to generate unpredictability.\nThere is no limit to the number of injects that can be added to an exercise.\nThe commanders have to communicate effectively from their various posts, while under pressure, so that there is a cohesive chain of command for officers on the ground to act. The scenarios then evolve based on decisions made by the different commanders.\nThe system allows up to 20 commanders from different departments to be trained in joint operations. A simulation exercise can take up to a whole day, depending on the complexities.\nAfter the exercise, commanders and trainers can review the performance with the system's detailed playback function which can highlight critical decision-making points for commanders.\nStaff Sergeant Siti Badariah of Tanglin Police Divsion, 29, who trained under the system in preparation for a deployment, said: \"It's as close to what we are going to experience on the ground.\n\"In real life, you won't get a situation where just one thing is happening, especially if the area is big. The system gives us that option to try injects simultaneously.\"\nDeputy Superintendent Kenny Yeo, 44, who has been in service for 24 years, contributed his extensive police front-line experience in the development of the system, which he said is useful in creating the pressures a commander can face on the ground.\n\"As soon as he has decided how to deal with the first inject, we can prepare to release the second. We train a commander to multi-task...how he can maintain an overview when two things are happening at the same time,\" added DSP Yeo.\nPreviously, large scale training exercises involved significant logistics and manpower resources.\nThe system's project manager Ms See Pei Jun said the increased training frequency afforded by the system allows multiple commanders to be trained without tiring ground troops, unlike in a real-life exercise.\nOther countries have used similar simulation systems to train their officers, including the United Kingdom, the Netherlands and South Korea.\nThe Home Team also announced the introduction of a mobile learning application (app) for its officers on Monday. The app enables all officers to learn on the go and at their own pace.\nCurrently, officers can access e-learning through the Home Team Learning Management System, an internal e-learning portal which is only available on their office desktops. However, this poses a challenge particularly for frontline officers who often have to be away from their desk.\nIt is currently still under trial, with over a hundred officers from various Home Team departments having used the app.", "url": "https://www.straitstimes.com/singapore/home-team-introduces-new-simulation-training-system"}