{"authors": ["Lee Nian Tjoe"], "date_download": "2024-10-12 13:32:52", "date_modify": "2024-10-12 13:32:52", "date_publish": "2023-12-07 22:14:41", "description": "By end-2024, EV drivers will also be able to pay for charging at publicly accessible points by credit card. Read more at straitstimes.com.", "filename": "singapore_transport_new-ev-chargers-bought-from-dec-8-must-be-registered-before-use-under-new-law_1728739972.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/07/20220805971626768a265323-d2f5-45c9-91d1-3b2b96cb07b8.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_new-ev-chargers-bought-from-dec-8-must-be-registered-before-use-under-new-law_1728739972.html", "title": "New EV chargers bought from Dec 8 must be registered before use under new law", "title_page": "New EV chargers bought from Dec 8 must be registered before use under new law | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - By end-2024, companies providing public charging services for electric vehicles (EVs) will have to allow users to pay by credit card or by scanning a QR code, instead of only via the companies’ smartphone apps or charge cards. This will make it more convenient for drivers who use EV charging services islandwide.\nThis is one of the conditions charging service companies must meet to be licensed under the EV Charging Act, which comes into force on Dec 8. Operators have 12 months to become fully compliant and licensed, the Land Transport Authority (LTA) announced on Dec 7.\nUnder the new law, all EV chargers bought and installed from Dec 8 must be registered with LTA before they can be used.\nOwners of existing chargers, which must comply with safety standards, can continue using them but will have to register the chargers by June 7, 2024, on LTA’s OneMotoring website.\nRegistration costs $750 but is free for applications for existing chargers submitted by June 7, 2024. Once a charger is registered, LTA will issue a sticker that must be attached to it.\nFrom June 8, 2024, it will be a crime to use an unregistered EV charger. First-time offenders found guilty of charging an EV with an unregistered charger may be fined up to $10,000 or jailed up to six months, or both.\nRegistration of new chargers will cost between $150 and $750 (with differentiated subsidies), depending on their power rating and whether they are in locations such as malls or landed properties such as bungalows and terraced houses. There will be higher subsidies for the registration of shared and publicly accessible chargers.\nFor instance, registering a new charger in locations without access curbs, such as malls, will cost $150 to $600, while those in landed properties could cost up to $750.\nThese rates will apply until Dec 31, 2025. LTA said it will review the fees closer to December 2025.\nLTA said in a statement on Dec 7 that the law, which was passed in Parliament in 2022 to regulate the safe charging of EVs, will ensure the provision of reliable EV charging services and expand the network of accessible charging infrastructure.\nSuppliers of EV chargers must ensure that their products are compliant with LTA’s standards and have approval labels. These parties have six months until June 7, 2024, to get their charger models approved. In the interim, these products can still be sold if they comply with safety standards.\nAs for operators of public EV chargers, the licence to provide the service is valid for three years.\nIn addition to widening payment methods, chargers deployed by a licence holder must use technology that would make it possible for another operator to take over the provision of the service in the event that the licence holder pulls out.\nThe new law also makes provisions for EV charging mandatory in new buildings and properties undergoing major renovations. This includes setting a minimum power capacity and requirement for charging points.\nThe law also lowers the voting threshold for the installation or uninstallation of EV chargers in condominiums to 50 per cent of residents, down from 90 per cent.\nThis is provided that the lease contract with the EV charging operator is not for more than 10 years, and the proposal does not draw down on funds from the condos’ management corporations.\nDr Amy Khor, Senior Minister of State for Transport, and Sustainability and the Environment, said that as at November, 275 condos have received the green light to install 789 chargers.\nAbout 450 of these chargers in 165 condos are already up and running, she added.\nDr Khor added that the share of electric cars out of total car registrations has soared from under 4 per cent in 2021 to almost 18 per cent so far in 2023. New electric car registrations were at 22 per cent of total registrations in November.\n“The accessibility and availability of EV chargers is an important factor for the switch to EVs,” she said.", "url": "https://www.straitstimes.com/singapore/transport/new-ev-chargers-bought-from-dec-8-must-be-registered-before-use-under-new-law"}