{"authors": ["Chin Hui Shan"], "date_download": "2024-10-12 13:32:08", "date_modify": "2024-10-12 13:32:08", "date_publish": "2024-01-31 10:40:00", "description": "The drugs seized can feed the addiction of about 850 abusers for a week. Read more at straitstimes.com.", "filename": "singapore_three-singaporeans-arrested-for-allegedly-trafficking-drugs-worth-about-470000_1728739928.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/31/aadrugs310124.png?h=96981266", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_three-singaporeans-arrested-for-allegedly-trafficking-drugs-worth-about-470000_1728739928.html", "title": "Three Singaporeans arrested for allegedly trafficking drugs worth about $470,000", "title_page": "Three Singaporeans arrested for allegedly trafficking drugs worth about $470,000 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Three Singaporeans were arrested on Jan 29 for allegedly trafficking drugs with an estimated worth of about $470,000.\nThe drugs seized include 2,602g of cannabis and 842g of Ice, which can feed the addiction of about 850 abusers for a week, said the Central Narcotics Bureau (CNB) in a statement on Jan 31.\nThe suspected drug traffickers – two men and one woman – were arrested in two separate operations.\nIn the late afternoon of Jan 29, CNB officers searched a car in Havelock Road and found 955g of cannabis, 166g of Ecstasy, 138g of Ice, 24g of ketamine, 160 Erimin-5 tablets, 107 LSD stamps and five bottles of liquid suspected to contain GHB (gamma-hydroxybutyrate).\nThe estimated value of these seized drugs is around $118,000 and the driver of the car, a 35-year-old man, was arrested.\nIn another operation on the same day, officers raided a residential unit in the area of Bedok Reservoir Road and arrested a 35-year-old man and a 23-year-old woman.\nThe officers seized 1,647g of cannabis, 704g of Ice, 346 tablets and 332g of Ecstasy, 22g of ketamine and 11g of cocaine from the unit. The drugs were estimated to be worth about $352,000.\nIt is an offence for a person – on his or her own behalf, or on behalf of any other person, whether or not that other person is in Singapore – to traffic in a controlled drug or offer to traffic in a controlled drug, CNB said.\nIt is also an offence to carry out or offer to perform any act preparatory to or for the purpose of trafficking in a controlled drug.\nA person found guilty of trafficking more than 250g of Ice or 500g of cannabis faces the mandatory death penalty.\nCNB said investigations are ongoing.", "url": "https://www.straitstimes.com/singapore/three-singaporeans-arrested-for-allegedly-trafficking-drugs-worth-about-470000"}