{"authors": ["Goh Yan Han"], "date_download": "2024-10-12 14:20:09", "date_modify": "2024-10-12 14:20:09", "date_publish": "2023-11-06 18:08:26", "description": "In October, eight police reports of offensive remarks or actions targeted at Jews or Muslims were made. Read more at straitstimes.com.", "filename": "singapore_politics_pap-wp-and-psp-condemn-violence-against-civilians-in-israel-hamas-war-urge-cohesion-and-harmony_1728742809.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/06/10954343.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_pap-wp-and-psp-condemn-violence-against-civilians-in-israel-hamas-war-urge-cohesion-and-harmony_1728742809.html", "title": "PAP, WP and PSP condemn violence against civilians in Israel-Hamas war, urge cohesion and harmony", "title_page": "PAP, WP and PSP condemn violence against civilians in Israel-Hamas war, urge cohesion and harmony | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Parliament unanimously condemned the violence against innocent civilians in the Israel-Hamas conflict, and stressed that Singapore must never allow external conflicts to disrupt racial and religious harmony here.\nTwenty-one MPs, including those from the People’s Action Party (PAP), Workers’ Party (WP) and Progress Singapore Party (PSP), spoke on Monday in a debate on a motion on the Israel-Hamas conflict, which was passed after about six hours.\nSpeaking in the middle of the debate, Deputy Prime Minister Lawrence Wong said that beyond upholding national interests, Singapore must not allow external events to divide it.\nSocial media can turn a faraway conflict into an emotionally charged issue that can easily spiral out of control, even here, he added.\nForeign Minister Vivian Balakrishnan said the country’s ability to conduct consistent, coherent foreign policy depends on domestic cohesion and consensus.\nHe called on all MPs, regardless of party, to be united in upholding the principles essential for Singapore’s survival, which had been put forth by three of his party colleagues in a motion on solidarity, security and peace with regard to the conflict.\nLeader of the Opposition and WP chief Pritam Singh said: “This conflict will test us, but it should not be allowed to compromise our multiracial and multi-religious peace and harmony.”\nSingaporeans should not analyse a political issue through religious lenses – instead it is a humanitarian issue, he added.\nPSP Non-Constituency MP Leong Mun Wai urged Singaporeans of all communities to be mindful of what they say and do concerning this issue, especially on online forums.\n“We all have the responsibility to refrain from engaging in inflammatory rhetoric that could threaten the peace and harmony that we enjoy in Singapore,” he said.\nDPM Wong said Singapore is not immune to divisive forces – in the month of October alone, the police received eight reports of offensive remarks or actions targeted at members of the Jewish or Muslim communities in Singapore.\nThis is almost the same number of related reports made between January and September.\n“We cannot afford to be complacent. We know from our own painful history how disastrous ethnic and religious strife can be. And that’s why we have worked so hard over the years to foster social harmony across our different communities,” said DPM Wong.\nHe and Dr Balakrishnan pointed out that when the conflict first erupted, Mufti Nazirudin Mohd Nasir wrote to Singapore’s Chief Rabbi Mordechai Abergel, who later replied, and both expressed empathy and solidarity with one another.\nDr Balakrishnan said this episode is a stark reminder to all Singaporeans that the country’s national interests are at stake.\nHe added that Singapore must reject terrorism: “No excuses, no ifs, no buts. No short-term political advantage. (We must) reject terrorism. If attacked, all of us here must give the government of the day the ability to exercise the right of self-defence.”\nHe also emphasised that the Israeli-Palestinian conflict is not a religious conflict.\nAt its core, the conflict has always been about territory, self-determination and identity, which has been complicated by intra-Israeli and intra-Palestinian politics.\n“It provides fertile ground for extremists on both sides to misuse religion to further their political games, and we must not fall into that trap,” said Dr Balakrishnan.\nIn his speech, Dr Balakrishnan laid out the principles underpinning the Singapore Government’s position on the issue.\nThese include a zero-tolerance approach towards terrorism, an abidance by international law that dictates all states have the legitimate and inherent right of self-defence, and that all countries must ensure that if military action is taken in exercising this right of self-defence, that they abide by principles of necessity and proportionality and comply with the laws of war.\nHe also stressed the need for humanitarian assistance to reach affected civilian populations immediately, and reiterated Singapore’s longstanding and consistent position that a negotiated two-state solution was the only viable option.\nMr Singh and Mr Leong both said in their speeches that their parties supported the motion.\nMr Singh also stressed that the latest eruption in hostilities should not be seen in isolation.\n“The same history always repeats itself. In the end, the story on the Palestinian side is always far more gruesome in scale – overwhelming casualties, with a large number of children among the dead,” he added.\nMr Leong said the PSP urged the Government to enhance education on Israeli-Palestinian history to reduce the risk of Singaporeans being swayed by biased, inaccurate or one-sided emotional discourse.\nAmid the debate, Dr Balakrishnan pressed Mr Singh on why the WP did not categorise the Hamas attacks on Oct 7 as “acts of terror”.\nMr Singh said the reason for not doing so in the party’s statement was that Hamas is not included on the list by the inter-ministry committee on terrorist designation, and that he was not questioning the definitions in the Terrorism (Suppression of Financing) Act.\nDPM Wong said political parties should not try to outflank the Government to score political points.\n“Let’s not risk our precious unity for short-term political gain, not when our collective security and fundamental interests are at stake,” he said, adding that it was not a nitpicking of words.\nHe asked the WP to clarify its position on social media, to which Mr Singh replied that the WP would append its Monday speeches to its Oct 18 statement.\nMr Singh added that on issues of national security, the Government should inform the WP, which would certainly take those views on board very carefully.\nOn the security front, he said the Government fully expects extremist and terrorist groups in the region to use the conflict to get sentiments riled up and radicalise more individuals.\nSince the conflict started, regional Internet traffic on extremist sites has gone up threefold and anti-Singapore rhetoric, including violent threats against Singapore by regional extremist elements online, has seen an uptick.\nSecurity agencies are on high alert and more security measures have been put in place as a precaution, DPM Wong said.\n“Singaporeans must stay vigilant too... Our ability to respond to any terrorist incident depends on all of us as Singaporeans working together. We must remain cohesive and united as a society, so that we can keep Singapore safe and secure.”", "url": "https://www.straitstimes.com/singapore/politics/pap-wp-and-psp-condemn-violence-against-civilians-in-israel-hamas-war-urge-cohesion-and-harmony"}