{"authors": ["Lim Min Zhang"], "date_download": "2024-10-12 14:03:06", "date_modify": "2024-10-12 14:03:06", "date_publish": "2023-05-04 20:15:00", "description": "A deep sense of distrust is now fuelling divisions among countries, said Indonesia's former foreign minister Marty Natalegawa. Read more at straitstimes.com.", "filename": "singapore_us-china-disputes-could-worsen-tensions-in-asian-waters-say-speakers-at-s-pore-forum_1728741786.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/04/2023-04-17T032745Z1207353998RC23G0AWD72NRTRMADP3CHINA-TAIWAN-USA_4.JPG?VersionId=2zZw_QzQwU4xbDQHFElMkCYaZJwLMeDl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_us-china-disputes-could-worsen-tensions-in-asian-waters-say-speakers-at-s-pore-forum_1728741786.html", "title": "US-China disputes could worsen tensions in Asian waters, say speakers at S’pore forum", "title_page": "US-China disputes could worsen tensions in Asian waters, say speakers at S’pore forum | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Temperatures are rising in major waterways in the Asia-Pacific region, a trend that is made more worrying by the lack of communication and trust between the United States and China.\nThis was a key theme of discussion among academics from the two countries, as well as India and Indonesia, at a biennial forum – the eighth International Maritime Security Conference – in Singapore on Thursday.\nDr Marty Natalegawa, Indonesia’s former foreign minister, said that from South-east Asia’s perspective, there is an “arc of instability” all around the region – from a potential rivalry between China and India for access in the Indian Ocean, to nuclear weapons on the Korean peninsula, and competition between the US, China, Australia and New Zealand for influence among Pacific island countries.\nWhile much of the situation can be attributed to longstanding issues, “what is perhaps new is the extremely deep sense of distrust that is now fuelling and driving divisions among countries”, he said.\nRetired admiral Karambir Singh, who is chairman of the Delhi-based National Maritime Foundation think-tank, said the international environment today is reminiscent of the Cold War years, and perhaps even more worrisome.\nIssues such as the Covid-19 pandemic, the war in Ukraine, and other flashpoints in the Indo-Pacific have been exacerbated by geopolitical confrontation, he said.\n“The free and open seas that have underwritten our common prosperity are now in danger of being converted into contested and closed seas, which is the very antithesis of prosperity.”\nVeteran diplomat Tommy Koh, who moderated the session held at the Changi Exhibition Centre, drew attention to the disputed island chains known as the Senkaku to the Japanese or Diaoyu to the Chinese in the East China Sea, as well as the South China Sea waterway that is contested by China and several South-east Asian countries.\nThe US and other navies have challenged China’s claims to sovereignty in the South China Sea by sailing in freedom of navigation operations, to which China has responded by sending its own warships and planes to the same area. There have been several incidents of near collision between Chinese vessels and those of other countries, and the situation there is “combustible”, added Professor Koh.\nSpeakers at the forum also discussed issues such as whether China has shown restraint over Taiwan as well as India’s role as a “net security provider” for the Indian Ocean region – how it contributes to security there through activities such as military exercises and exchanges.\nThe one-day forum, established in 2009, was co-organised by the Republic of Singapore Navy and the S. Rajaratnam School of International Studies (RSIS).\nProf Koh asked Mr Zhou Bo, a retired senior colonel of China’s People’s Liberation Army (PLA), and American academic David Finkelstein to share their thoughts on the lack of communication between Beijing and Washington.\nBilateral relations have soured in recent years, and the superpowers have been trading barbs over issues such as technology, Taiwan and trade.\nDr Finkelstein, director of the China and Indo-Pacific Security Affairs Division at the Centre for Naval Analyses in Virginia, said he agrees that both countries and the region would be better off when China and the US talk to each other.\n“I know that people in the Pentagon would be very anxious to have serious dialogues with friends in the PLA. And one of the priorities, as I understand, is risk management, in order to deal with all of the very difficult issues,” he said, adding that these include Chinese activities near Taiwan and freedom of navigation operations.\nMr Zhou, who is a senior fellow at Tsinghua University’s Centre for International Security and Strategy in Beijing, responded that although he is not optimistic about the US-China relationship, he is still hopeful that disagreements can be managed.\n“Even if they don’t trust each other at all, I don’t believe this is the end of the world. Why? Because the Cold War example tells us that even enemies could actually talk to each other out of mutual fear. And China and the US are not enemies yet,” he said.\n“So we should have confidence in this relationship being manageable... We have to try very hard because peace has to be earned. It is still possible, because none of us wants to have a war.”", "url": "https://www.straitstimes.com/singapore/us-china-disputes-could-worsen-tensions-in-asian-waters-say-speakers-at-s-pore-forum"}