{"authors": [], "date_download": "2024-10-12 14:00:51", "date_modify": "2024-10-12 14:00:51", "date_publish": "2022-11-21 05:00:00", "description": "ST asks an expert how we can safeguard ourselves against it. Read more at straitstimes.com.", "filename": "singapore_health_why-is-antimicrobial-resistance-a-public-health-threat_1728741651.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/24/pills-gca7ec0a191920.jpg?VersionId=npatii0jXqvzgdbDPXMPUlNTI78SKXJx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_why-is-antimicrobial-resistance-a-public-health-threat_1728741651.html", "title": "Why is antimicrobial resistance a public health threat?", "title_page": "Why is antimicrobial resistance a public health threat? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Antimicrobial resistance (AMR) is one of the World Health Organisation’s (WHO) top 10 global public health threats. When AMR develops, bacterial infections can become untreatable, and sometimes even fatal. With the WHO’s World Antimicrobial Awareness Week taking place from Nov 18 to 24, Dr Lee Tau Hong, head of the Antimicrobial Resistance Coordinating Office at the National Centre for Infectious Diseases, dispels AMR misconceptions and explains how we can safeguard ourselves against it.\nWhat is AMR?\nAMR occurs naturally when microorganisms such as viruses, bacteria, parasites and fungi change over time and no longer respond to antimicrobial agents such as antivirals and antibiotics, and antiparasitics and antifungals. As a result, antimicrobials are no longer effective, making infections harder to treat and increasing the risk of disease spread.\nAntibiotics are the most common antimicrobial agent. They work against only bacteria by stopping their growth or killing them.\nThe main cause of AMR is the overuse and misuse of antibiotics. This accelerates the emergence and spread of antimicrobial-resistant pathogens globally and renders antibiotics no longer effective in treating bacterial infections.\nWhy is AMR a serious public health concern and what is the impact?\nIt is estimated that without intervention, AMR could cause up to 10 million deaths worldwide per year by 2050. In 2022, The Lancet, a leading medical journal, estimated that 4.95 million deaths worldwide in 2019 were associated with bacterial AMR.\nAMR rates are outpacing the development of new antibiotics and this could result in common infections becoming difficult to treat, or even untreatable, leading to longer treatment periods, longer hospital stays, higher medical costs, severe illness and death.\nWhat are the common misconceptions about AMR?\n“Humans can become resistant to antibiotics.”\n“Antibiotic resistance occurs when your body becomes resistant to antibiotics, and they no longer work well.”\nIn a survey jointly conducted by academic researchers published in 2022, nearly eight in 10 people in Singapore erroneously believe that humans can develop resistance to antibiotics. In fact, it is the bacteria that become resistant to antibiotics, and this is known as antibiotic resistance. The person or the animal does not develop resistance to antibiotics.\n“Antibiotic resistance is a problem only for people who take antibiotics regularly.”\n“Resistant bacteria cannot spread from person to person.”\n“Infection by antibiotic-resistant bacteria can be easily cured.”\nDrug-resistant bacteria can spread from person to person, and antibiotic resistance can affect anyone at any time.\nInfections caused by antibiotic-resistant bacteria are harder to treat as the standard antibiotics may not work. Alternative antibiotics, or even “last-line antibiotics”, may have to be used, but these tend to be less effective, have more side effects, and are more expensive. Polymyxins, for example, are used primarily to treat infections that fail to respond to multiple antimicrobials.\n“Antibiotics can treat viral infections.”\nIn the same survey, one in three people wrongly believes that antibiotics can treat viral infections. In fact, antibiotics are effective against infections caused by only bacteria and not viruses.\nExamples of bacterial infections are meningitis, tuberculosis, pneumonia and urinary tract infections, and examples of viral infections are Covid-19, the common cold, influenza, measles and HIV/Aids. For Covid-19, there are specific antiviral medications that doctors may prescribe.\n“Antibiotics are the same as anti-inflammatory agents.”\nAntibiotics are different from anti-inflammatory agents, which act on the immune system to reduce inflammation that can be brought on by infections, trauma, burns, auto-immune conditions and a variety of illness.\nAntibiotics complement our immune system in the fight against bacterial infections by blocking vital processes in bacteria, thereby killing them or stopping them from multiplying.", "url": "https://www.straitstimes.com/singapore/health/why-is-antimicrobial-resistance-a-public-health-threat"}