{"authors": ["Timothy Goh"], "date_download": "2024-10-12 14:20:40", "date_modify": "2024-10-12 14:20:40", "date_publish": "2024-04-05 20:40:00", "description": "Visitors can explore a variety of stalls selling traditional snacks, household wares and groceries. Read more at straitstimes.com.", "filename": "singapore_food-and-crafts-festival-kicks-off-in-bukit-gombak-as-part-of-heartland-rejuvenation-efforts_1728742840.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/06/2024040537496040dar2496.jpg?VersionId=gzUxK_K3K.Cs_4I.g69zATo3H3TDAIEX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_food-and-crafts-festival-kicks-off-in-bukit-gombak-as-part-of-heartland-rejuvenation-efforts_1728742840.html", "title": "Food and crafts festival kicks off in Bukit Gombak as part of heartland rejuvenation efforts", "title_page": "Food and crafts festival kicks off in Bukit Gombak as part of heartland rejuvenation efforts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A three-day festival featuring food stalls, homemade crafts and live music kicked off at Bukit Gombak Neighbourhood Centre on April 5, as part of wider efforts to help heartland enterprises innovate and seize new opportunities.\nOrganised by Enterprise Singapore, Rasa Gombak Day Out is a first-of-its-kind event that showcases the history and heritage of the neighbourhood centre.\nVendors ranging from longstanding neighbourhood favourites to newly established businesses sell traditional snacks, household wares and groceries.\nThe festival, which runs until April 7, is among the first activities organised by the Modern Heritage Heartland Hub, one of two pilot projects aimed at revitalising the heartland announced during the debate on the Ministry of Trade and Industry’s budget on March 1.\nThe event runs from 4pm to 9pm on April 5 and noon to 9pm on April 6 and 7.\nMinister of State for Trade and Industry Low Yen Ling, who was guest of honour at the festival on April 5, noted that the global retail industry has changed rapidly due to the growth of technology, the rise of e-commerce as well as fast-changing consumer preferences.\nThe Government remains committed to supporting heartland merchants to continue to transform, innovate and capture new opportunities, Ms Low said, adding that events like Rasa Gombak Day Out can bolster the vibrancy of neighbourhood centres and draw both Singaporeans and tourists alike.\n“When residents, Singaporeans and tourists come here, they will be able to experience the new and old in a very contemporary way,” she said.\n“We will work with our entrepreneurs and our heartland merchants in Bukit Gombak to co-curate new products and services and, more importantly, new experiences... This is what we mean by repositioning Bukit Gombak Neighbourhood Centre into a Modern Heritage Heartland Hub.”\nMs Shiny Phua, who has taken up a stall at the festival, said events like Rasa Gombak Day Out can help build brand awareness for her business – AhMah’s Legacy, a kueh shop in Sin Ming Road.\nShe added: “I like talking to potential customers to know more about their preferences, and during these events, I get to expand my network by talking to customers and other vendors.”\nMr Rayn Leow, who owns boutique porcelain studio Ceramication, said such events are a good way for him to source potential customers as well as students for his pottery classes.\nCeramication has an online store and a physical pottery studio in Tengah.\n“I’m not sure if I’ll make money at this event, but that is not why I’m here,” he said.\n“I’m here because I’m an online business, and I need to go offline to meet people and direct them to my website.”\nMr Chee Chin Young, president of the Bukit Gombak Traders’ Association, said events like this will draw not only residents of Bukit Gombak, but also those from other neighbourhoods.\n“It definitely adds some zest to our neighbourhood, as residents are used to the ‘traditional’ stores that they already see every day.\n“At the same time, there are opportunities for youngsters volunteering at these stalls to learn more about neighbourhood entrepreneurship, and this is how we can develop more entrepreneurs.”", "url": "https://www.straitstimes.com/singapore/food-and-crafts-festival-kicks-off-in-bukit-gombak-as-part-of-heartland-rejuvenation-efforts"}