{"authors": ["Wallace Woon"], "date_download": "2024-10-12 13:33:06", "date_modify": "2024-10-12 13:33:06", "date_publish": "2024-05-05 16:46:49", "description": "A 26-year-old man was also charged in relation to the false story on April 24. Read more at straitstimes.com.", "filename": "singapore_second-person-to-be-charged-with-defamation-over-false-report-on-miscarriage-at-kkh_1728739986.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/05/courts-and-crime.jpg?VersionId=lmbuVaG5tFpwFmhVX021.PtKOwO5Ksj9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_second-person-to-be-charged-with-defamation-over-false-report-on-miscarriage-at-kkh_1728739986.html", "title": "Second person to be charged with defamation over false report on miscarriage at KKH", "title_page": "Second person to be charged with defamation over false report on miscarriage at KKH | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A 27-year-old woman linked to a 2022 publication of an online report carrying false claims about a pregnant woman losing her baby in KK Women’s and Children’s Hospital (KKH) will face defamation charges on May 6.\nThe police, in a statement on May 5, said KKH lodged a police report on March 25, 2022, over an online report titled “The baby is probably dead – woman shares a harrowing account of her miscarriage at KKH A&E”.\nThe story – published on Wake Up Singapore’s (WUSG) website, Facebook page and Instagram account – alleged that the hospital mismanaged the care of a female patient on Feb 28, 2022.\nAriffin Iskandar Sha Ali Akbar, 26, allegedly an administrator for alternative news site WUSG, was charged with defamation on April 24, 2024. He will appear in court again on May 24.\nThe report said a woman who was 20 weeks pregnant and Covid-19 positive was reported to have arrived at KKH to seek treatment after experiencing severe abdominal pains at 2pm on that day. It added that she was told to wait at a drop-off area but started to bleed at 5pm, and was not attended to. She said she saw a doctor only at 6pm, after a four-hour wait, and was told she had lost her baby.\nShe also alleged that her foetus had been discarded as medical waste.\nPolice investigations found the claims to be false. KKH later said the woman was seen by a doctor within an hour of her arrival, and did not suffer a miscarriage.\nIt later emerged that she allegedly sent messages on Instagram to WUSG detailing how she suffered a miscarriage at KKH.\nIn March 2022, the Ministry of Health said it instructed the Protection from Online Falsehoods and Manipulation Act Office to issue a correction direction to WUSG for publishing the false account.\nCorrection notices were published on WUSG’s Facebook and Instagram accounts on March 27, 2022. The outlet also issued an apology.\nIf found guilty of defamation, a person can be jailed for up to two years, fined, or both.", "url": "https://www.straitstimes.com/singapore/second-person-to-be-charged-with-defamation-over-false-report-on-miscarriage-at-kkh"}