{"authors": ["Selina Lum"], "date_download": "2024-10-12 13:28:51", "date_modify": "2024-10-12 13:28:51", "date_publish": "2022-01-10 20:04:00", "description": "The move to split the two services comes after six decades under an integrated system. Read more at straitstimes.com.", "filename": "singapore_cj-a-g-set-out-training-and-specialisation-plans-for-separate-judicial-and-legal-services_1728739731.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/01/10/mi_legal_100122.jpg?VersionId=dVI_7eOF.S1uJOiwfz4m2reNgBssWB8W", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_cj-a-g-set-out-training-and-specialisation-plans-for-separate-judicial-and-legal-services_1728739731.html", "title": "CJ, A-G set out training and specialisation plans for separate judicial and legal services", "title_page": "CJ, A-G set out training and specialisation plans for separate judicial and legal services | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A team led by two Supreme Court judges will look into developing a world-class programme for the Singapore Judicial College to train judges.\nMeanwhile, the Attorney-General's Chambers (AGC) will set up a specialist corporate law cluster to respond to a growing demand for legal support in this area within the Government.\nThe AGC's technology law cluster has also been revamped to build up a pool of public lawyers trained to deal with cutting-edge legal and regulatory issues.\nThese moves to enhance the training and specialisation of judicial and legal service officers were announced by Chief Justice Sundaresh Menon and Attorney-General Lucien Wong on Monday (Jan 10).\nIn their respective speeches at the annual ceremony to mark the opening of the legal year, CJ Menon and Mr Wong both spoke about the imminent separation of Singapore's judicial and legal services.\nThe move to split the two services comes after six decades under an integrated system where a single Legal Service Commission (LSC) oversaw officers deployed to both the judicial and legal branches.\nCome Friday (Jan 14), a new Judicial Service Commission (JSC), led by CJ Menon, will oversee judicial service officers such as State Courts judges and assistant registrars in the Supreme Court.\nThe LSC will be reconstituted and headed by Mr Wong.\nIt will oversee about 400 legal service officers in the AGC such as prosecutors and law drafters, and another 200 in ministries and statutory boards.\nIn his speech, the Chief Justice said the restructuring will enhance the ability of each service to provide specialist training and development.\nFor those in the judiciary, the work will include deepening and broadening the judicial skill set, he said.\nCJ Menon said judges will need some familiarity with fields such as psychiatry, statistics, financial accounting, technology, public policy and criminology.\nHe added that the judiciary also has to keep in mind the importance of enhancing access to justice.\n\"A key focus will be to ensure that we can secure a strong pipeline of talent within the Judicial Service,\" he said.\n\"This will entail bringing in suitable officers at all levels of seniority, as well as providing the necessary training, development and resources to ensure that they find meaning and satisfaction in the course of their judicial careers.\"\nThe team looking into developing a training programme will be led by Justice Philip Jeyaretnam and Judicial Commissioner Kwek Mean Luck.\nThis will be accompanied by a planned career path for judicial service officers, which could comprise initial broad-based training within the courts and external attachments, followed by more specialised vocational training and mentoring.\nIn his speech, the Attorney-General said: \"The goal now is to build a vibrant and agile legal service that will be prepared to meet the challenges of the future.\n\"This will require us to pivot even more towards specialisation than before, to respond to the increasing scope and complexity of legal work.\"\nMr Wong added that legal service officers in the ministries and statutory boards will be given access to the same training and legal resources that are available to AGC officers.\n\"To attract and retain talent, we must offer the best opportunities for legal service officers to develop meaningful and deeply rewarding careers as public lawyers,\" he said.\nMr Wong also mentioned two initiatives which were started in July last year to speed up the investigative and decision-making processes.\nIn one scheme, 30 deputy public prosecutors were embedded at police divisions to help review investigation papers (IP). This led to a 30 per cent increase in the total number of IP-related requests processed last year, he said.", "url": "https://www.straitstimes.com/singapore/cj-a-g-set-out-training-and-specialisation-plans-for-separate-judicial-and-legal-services"}