{"authors": ["Ng Keng Gene"], "date_download": "2024-10-12 13:28:23", "date_modify": "2024-10-12 13:28:23", "date_publish": "2024-06-03 10:30:00", "description": "The $1 million study was commissioned by URA and HDB. Read more at straitstimes.com.", "filename": "singapore_astar-to-study-impact-of-urban-environment-on-mental-health-over-three-years_1728739703.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/03/yaohui-pixheat25-9960.jpg?VersionId=TLlCS9SKNVojvMB8bJvlJqx2pMHkrBUx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_astar-to-study-impact-of-urban-environment-on-mental-health-over-three-years_1728739703.html", "title": "A*Star to study impact of urban environment on mental health over three years", "title_page": "A*Star to study impact of urban environment on mental health over three years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Agency for Science, Technology and Research (A*Star) will study over three years the impact of the urban environment on mental health, said Deputy Prime Minister Heng Swee Keat on June 3.\nThe study will examine factors such as urban design features, density and human behaviours, Mr Heng said at the opening plenary of the World Cities Summit 2024, held at Suntec Singapore Convention and Exhibition Centre.\nMr Heng, who is chairman of the National Research Foundation Board, said insights from the study will “serve to better inform the way we rejuvenate, reinvent and reimagine our city-state”.\nThe A*Star study, which costs $1 million and was commissioned by the Urban Redevelopment Authority and the Housing Board, will be funded by the Government’s $28 billion Research, Innovation and Enterprise 2025 plan.\nThe five-year plan was launched in December 2020 with an initial sum of $25 billion.\nThe mental health study was awarded to A*Star in May 2024, and will be carried out by the agency’s Singapore Institute for Clinical Sciences.\nThe Ministry of National Development (MND) said the study will devise a data-driven method to assess how different aspects of the built environment affect the mental well-being of the general population.\nGiven Singapore’s highly built-up environment, said MND, the country “offers a unique opportunity to conduct mental health research”.\n“Current research in our local context has primarily focused on the impact of our built environment on physical well-being, and the benefits of greenery on mental well-being,” MND added.\n“This project aims to expand this knowledge by investigating other aspects of the built environment more holistically, and their impacts on mental well-being.”\nAs part of the study, a list of indicators that link the built environment to mental well-being will be developed.\nMND said that these indicators could help urban planners understand how factors such as the provision of facilities, land use configuration, and the intensity of development on a piece of land may affect mental well-being.\nResearchers plan to validate the study’s findings against four ongoing Singapore cohort studies: Growing Up In Singapore Towards Healthy Outcomes, Singapore Preconception Study Of Long-Term Maternal And Child Outcomes, Singapore Longitudinal Early Developmental Study and Mapping Antenatal Maternal Stress.\nMND said that the four studies have collected extensive data from study participants using validated questionnaires, including mental well-being indicators.\nThe ministry added that findings from the new study will inform how the authorities plan, design and prioritise built environment interventions to enable a healthier and more liveable environment.\nThe three-day World Cities Summit, held every two years in Singapore, ends on June 4.\nIt gathers city leaders, industry experts and others who work on urban environments, and the 2024 edition has delegates from more than 90 cities around the world.\nAmong its highlights was the Mayors Forum, chaired by National Development Minister Desmond Lee on June 2.\nSpeaking at the summit’s opening plenary on June 3, Mr Lee announced an updated Singapore Liveability Framework – a set of principles and systems that guide city planners and policymakers.\nThe upgraded framework is captured in a new e-publication, Building Liveable And Sustainable Cities: A Framework For The Future, which can be downloaded at go.gov.sg/clcbook-liveableframework2024. It has a new emphasis on “collaborative ecosystems”.\nSuch systems involve the public, the private sector and the Government, recognising that citizens have a part to play in policymaking, and in the governance of cities.\nOne prime example of such collaboration, said the publication, is the Forward Singapore exercise, a nationwide engagement with Singaporeans to refresh the country’s social compact and develop the national agenda for a new generation.\nA series of memorandums of understanding (MOUs) will be signed during the summit.\nThe Singapore Land Authority (SLA) and the Singapore Management University (SMU) signed an MOU on June 3.\nSLA said that its geospatial information – referring to data associated with a particular location such as aerial images and street maps – will be used in the Cooling Singapore 2.0 research project, which SMU co-leads.\nAmong the project’s products is a Digital Urban Climate Twin of Singapore that will explore the heat effects of buildings, transport and industry.\nSLA said its data, and the digital twin, will aid policymakers in Singapore in assessing effective climate adaptation solutions that can enhance the city’s climate resilience.\nDuring a panel discussion on leveraging geospatial data to improve citizens’ quality of life, Mr Vincent Karremans, vice-mayor of Rotterdam in the Netherlands, said such data has helped his city to prioritise investments in climate adaptation.\n“Due to this geospatial technology, we know exactly which neighbourhoods, which streets – even portions of streets – are the most vulnerable to heatwaves or heavy rainfall because we can put that all into a model,” he said.\n“It is an instrument to determine where to invest in a city, where to put more green infrastructure, and where to expand our sewer system.”", "url": "https://www.straitstimes.com/singapore/astar-to-study-impact-of-urban-environment-on-mental-health-over-three-years"}