{"authors": ["Wallace Woon"], "date_download": "2024-10-12 13:53:02", "date_modify": "2024-10-12 13:53:02", "date_publish": "2024-04-25 15:50:00", "description": "It means the link bridge was used to expand the monkey's habitat and increase its chances of survival. Read more at straitstimes.com.", "filename": "singapore_raffles-banded-langur-spotted-on-eco-linkbke-for-the-first-time_1728741182.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/25/image00002.jpg?VersionId=fTwMFtQjroaQkIYCuv3thknAA7csg0uM&h=925f46d3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_raffles-banded-langur-spotted-on-eco-linkbke-for-the-first-time_1728741182.html", "title": "Critically endangered Raffles’ banded langur spotted on Eco-Link@BKE for the first time", "title_page": "Critically endangered Raffles’ banded langur spotted on Eco-Link@BKE for the first time | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A Raffles’ banded langur was spotted for the first time on Eco-Link@BKE, a positive sign that the monkey – which is now mainly found in the Central Catchment Nature Reserve – could be venturing into other forested areas to find food and mates.\nThe sighting represents an encouraging sign for the critically endangered species, said the National Parks Board (NParks) in a statement on April 25, as it means that the link bridge was used to expand its habitat and increase its chances of survival.\nThe monkey with distinctive black fur and white bands was recorded on Oct 16, 2023, by a camera trap installed 10m above ground on a tree on the Eco-Link@BKE.\nThe pictures were published in the April edition of Nature in Singapore.\nIn these images, taken at 6.27pm on that day, the monkey can be seen sitting on a branch while looking directly at the camera. The video also shows the monkey scratching itself and looking around.\nIt moved away from the branch less than a minute later, the report said.\nAnother langur sighting was recorded at the same location on Oct 19, 2023, but researchers could not verify if this was the same animal recorded three days earlier.\nNational Development Minister Desmond Lee said in a Facebook post on April 25 that he had visited the Eco-Link@BKE in November 2023 to commemorate the 10th anniversary of the structure’s completion, shortly after the sighting.\nCalling the sighting “very exciting news”, Mr Lee said: “Raffles’ banded langurs in Singapore are known to only reside in the Central Catchment Nature Reserve. In fact, the last sighting of one in Bukit Timah Nature Reserve was in 1987.”\nCrossing aids, like the Eco-Link@BKE, help to improve ecological connectivity for local fauna, NParks said.\nOther tools such as canopy linkages – in the form of trees that have spreading canopies – and rope bridges have been installed to help the Raffles’ banded langur cross Old Upper Thomson Road, which separates Thomson Nature Park from the Central Catchment area.\nThe location of the crossing sites was determined through collaboration with the Raffles’ Banded Langur Working Group, which includes members from NParks and Mandai Nature, the conservation arm of the Mandai Wildlife Group.\nNumbers of the shy tree-dwelling monkey, which are found only in Singapore and southern Peninsular Malaysia, were predicted to dwindle to the point of extinction in the 1990s due to habitat loss and fragmentation.\nAround a decade ago, the population was estimated to have dipped to as low as 40 but has since made a recovery to 76, according to Dr Andie Ang, who heads the working group.\nDr Ang told The Straits Times that the sighting was concrete evidence that the species is using the Eco-Link@BKE.\nShe said: “While there have been earlier sightings of the Raffles’ banded langur on the west of the BKE, where Bukit Timah Nature Reserve and Rifle Range Nature Park are, this sighting confirms that the link bridge is in use.\n“The animal might have crossed using Rifle Range Road, which runs over the BKE, and an earlier instance, such as a 2017 case where a langur was found dead, indicates that the species had tried to cross but did not use the Eco-Link@BKE as a safer option.”\nDr Ang said the animal’s carcass was found below the Rifle Range Flyover, just 70m away from the Eco-Link.\nIn December 2022, two Raffles’ banded langurs were found dead in separate incidents along the SLE within 24 hours.\nAccording to NParks, the 62m-long, 50m-wide Eco-Link@BKE is an ecological bridge that spans the BKE, connecting the Bukit Timah and Central Catchment nature reserves after the two forests were separated by the expressway’s construction in 1986.\n“The interaction of wildlife between the two nature reserves via Eco-Link@BKE prevents genetic isolation and promotes a bigger spread of their genetic pool, reducing the occurrence of inbreeding and ensuring a higher chance of the survival of the species,” NParks said.\nA study published in the Raffles Bulletin of Zoology journal in September 2023 found that the langur population is expected to double to 150 in the next 15 years, and go up to more than 240 monkeys by 2071.", "url": "https://www.straitstimes.com/singapore/raffles-banded-langur-spotted-on-eco-linkbke-for-the-first-time"}