{"authors": ["Gabrielle Chan"], "date_download": "2024-10-12 14:17:04", "date_modify": "2024-10-12 14:17:04", "date_publish": "2023-01-31 20:46:06", "description": "Prices were at $88 for the party pass, and $128 and $168 for VIP passes. Read more at straitstimes.com.", "filename": "singapore_buyers-of-tickets-to-cancelled-siloso-beach-party-file-police-reports-after-failing-to-get-refund_1728742624.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/01/dw-silosobeach-230131_0.jpg?VersionId=yCjrjr6FPpKxcSzW3o.gE36axJCgKoVz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_buyers-of-tickets-to-cancelled-siloso-beach-party-file-police-reports-after-failing-to-get-refund_1728742624.html", "title": "Ticket holders of cancelled Siloso beach party file police reports after failing to get refund", "title_page": "Ticket holders of cancelled Siloso beach party file police reports after failing to get refund | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Mr Prakhar Goyal and his friends were looking forward to celebrating his 24th birthday at a New Year’s Eve beach party on Sentosa.\nIt was to feature well-known music DJs such as Rave Republic, Jade Rasif and Simon Patterson, and drone shows throughout the night.\nBut three days before the NYE Beach Party and Drone Show 2022, organiser D1 Racing e-mailed Mr Goyal and other ticket holders to say that the party was cancelled because Rasif and her replacement, Amber Na, could not perform that night.\nPrices for the party were at $88 for the party pass, and $128 and $168 for VIP passes.\nVIP pass holders were promised access to air-conditioned zones and free alcohol, and the top-tier tickets were to give holders the opportunity to mingle with the guest DJs and championship drone pilots.\nIn the e-mail dated Dec 28, D1 Racing gave ticket holders a redemption code to claim a free ticket for the following year’s party while it “explored the possibility of a refund”.\nSince then, Mr Goyal and many others have been trying to get a refund for their tickets, and police reports have been lodged.\nMr Goyal had contacted the organiser immediately after receiving the e-mail to say that he and his friends were not interested in attending the 2023 event, and wanted a refund instead.\n“Unfortunately, we didn’t get any mail back from the event organisers. They just disappeared, and we didn’t hear a word back about any future event or possibility of a refund,” he said.\nMr Goyal searched Facebook, Google and Telegram for others in the same situation. So far, 44 people have come forward to say they could not get their refund.\nStudent Min Khant, 21, who contacted Mr Goyal, said: “As soon as I realised that the event was cancelled, I tried to get a refund instead of using the redemption code for the other event that has yet to be confirmed.\n“After I didn’t get a reply, I assumed that I had been scammed and made a police report.”\nThe police have confirmed that reports have been lodged and that they are looking into the matter.\nResponding to queries by The Straits Times, Sentosa Development Corporation (SDC) said D1 Racing booked the space on Siloso Beach in October.\n“Upon being informed of the event’s cancellation, SDC immediately requested the event organiser to inform all ticket holders of the cancellation as they were solely responsible for all marketing, ticket sales and execution of the event,” SDC said.\nRasif said she had pulled out of the event for personal reasons.\nShe told ST that she found out she was one of the featured acts only from D1 Racing’s Facebook advertisement, and that she then asked the organiser for payment and assurance that it had the necessary licences for the event.\nShe added: “We reminded the organisers that my attendance was not confirmed until we received a deposit and conducted due diligence, and requested they stop using me in ads until then.\n“We ceased any further negotiations with D1 after realising some inaccuracies in their contract.”\nThe 28-year-old, who is also a social media influencer, said the organiser did not have permission to use pictures of her in its promotion, and was told four times to remove them but did not do so.\nResponding to ST queries, D1 Racing said the event had to be cancelled due to drastic changes.\nIt added that it was “left stranded and had no choice but to cancel the event”.", "url": "https://www.straitstimes.com/singapore/buyers-of-tickets-to-cancelled-siloso-beach-party-file-police-reports-after-failing-to-get-refund"}