{"authors": ["Justin Ong"], "date_download": "2024-10-12 13:46:31", "date_modify": "2024-10-12 13:46:31", "date_publish": "2022-05-07 05:00:00", "description": "How the Republic translates the lessons learnt from the crisis will be closely watched by others attempting similar transitions. Read more at straitstimes.com.", "filename": "singapore_politics_moving-beyond-covid-19-how-can-singapore-find-a-new-way-forward-in-a-more-challenging-landscape_1728740791.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/07/aacovid0705.jpg?VersionId=cHMoWcABcLsI3piZuswpxl4L.cxn1Em0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_moving-beyond-covid-19-how-can-singapore-find-a-new-way-forward-in-a-more-challenging-landscape_1728740791.html", "title": "The new normal: How can Singapore move beyond Covid-19?", "title_page": "The new normal: How can Singapore move beyond Covid-19? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Over the past month, as Singapore took its most decisive strides towards life as it was before the pandemic, it appeared to be fulfilling a prognosis by Prime Minister Lee Hsien Loong in October last year.\nIn a national address on the Covid-19 situation, he indicated that it could take up to six months to reach a state of living with the virus. \"How will we know when we have arrived at the new normal? It will be when we can ease off restrictions, have just light SMMs (safe management measures) in place, and cases remain stable - perhaps hundreds a day, but not growing,\" said PM Lee then.\n\"When we can resume doing the things we used to do, and see crowds again without getting worried or feeling strange.\"\nSince April 26, Singapore has jettisoned most of its Covid-19 curbs, save for the stipulation to keep wearing masks indoors and on public transport. But daily caseloads, while steadily falling from the Omicron variant-fuelled highs of February, remain in the thousands.\nSome people interviewed over the past few weeks have cited the high number of infections as reason to take precautions by continuing to don masks outdoors.\nAnd for every individual capitalising on the elimination of group size and safe distancing limits to paint the town red, there are just as likely others who are cautiously sticking to the small gatherings they have become attuned to over the past two years.\nSingapore finds itself in this liminal stage as it mounts a recovery effort from a pandemic that has infected some 1.2 million and killed more than 1,300 here while imposing widespread social and economic disruption and straining more than a few societal fault lines.\nHow the Republic translates the lessons learnt from the crisis will be closely watched by others attempting similar transitions.\nThe challenge will be to locate a new equilibrium - in how its people live, play and work; and in the compact between state and citizens - amid a raft of present and emerging uncertainties both internal and external.\nFairness, inclusivity and openness ought to be guiding principles in a ground-up and continually iterative undertaking, as experts and observers tell Insight.\nDr Lim Wee Kiat, associate director of the Centre for Management Practice at Singapore Management University (SMU), says neither governments, businesses, non-profits, academics nor public intellectuals should enjoy a monopoly over perspectives on the most complex issues. \"The vulnerable communities - be they migrant workers, the economically disadvantaged, or seniors who live alone - should be given a seat at the table, so that they can also help shape the solution that they are subject to,\" adds the sociologist, who studies how organisations recover from crises.\n\"This 'all of us' approach should become the modus operandi in our whole-of-society model.\"\nShifting mindsets\nOn May 7, 2020, while in the throes of a circuit breaker lockdown from April to June, Singapore reported 10 community cases of Covid-19, next to 724 in the migrant workers' dormitories.\nA year later, amid an outbreak caused by the Delta variant, the authorities tightened both border and safe management measures, including a reduction of permissible group sizes from eight to five persons. The number of community infections on May 7, 2021 stood at four, with 21 imported.\nIn contrast, daily local infections have hovered upwards of 1,300 since April 22, when Health Minister Ong Ye Kung described Singapore as being in a position where it can \"afford to take further steps to restore pre-Covid-19 normalcy\".\nThe sweeping changes include, among others, the lowering of the Disease Outbreak Response System Condition (Dorscon) level from orange - where Singapore has been since February 2020 - to yellow; optional mask-wearing outdoors; allowing all workers to return to their offices; and the scrapping of the TraceTogether and SafeEntry contact tracing tools.\nA confluence of factors made this possible. Hospitalisation numbers are down, about 96 per cent of the eligible population have completed their full vaccination regimen, and 74 per cent have received booster shots. Nearly 900,000 people have also caught Covid-19 since the start of 2022 - with the real number likely higher - granting protection from immunity.\nThe circulating virus in its current incarnation is also relatively mild even if very transmissible, as infectious disease modelling expert Alex Cook told The Straits Times' online news programme The Big Story earlier this week.\n\"Singapore's Covid-19 situation is now at the best since December 2019,\" said the associate professor at the National University of Singapore's Saw Swee Hock School of Public Health. \"Effectively, we are leaving it up to individuals to make their own decisions about whether and how to modify their lifestyles and protect themselves, rather than having the Government make those decisions for us.\"\nThis necessary shift in mindset will inevitably encounter some inertia among the population, says Dr Woo Jun Jie, a senior research fellow in the governance and economy department at the Institute of Policy Studies (IPS) think-tank.\nThe noticeable choice made by some to continue wearing masks outdoors is one example. He says: \"It will take time and effort, in the form of public messaging from the government, to assure individuals that it is indeed safe to loosen Covid-19 restrictions in light of Singapore's high rate of vaccination.\"\nAssociate Professor Sulfikar Amir from Nanyang Technological University, who researches risk and disaster, notes that Singapore's population has been living under restrictions for some two years now - enough time to shape behaviours that internalise health protocols and precautions at both individual and communal levels. \"Habits of reducing risk of infection will stay for a longer time and remain part of our new normal culture,\" he says, adding that Singaporeans' acceptance of such conditions could be a factor in the country's success in handling the pandemic and averting high fatality rates as seen in other countries.\nBut Dr Joanne Yoong, senior economist and director at the University of Southern California's (USC) Centre for Economic and Social Research, believes a mentality of opening up has been effectively settling in for some time, with accounts from other countries resonating with people here. \"So making the mindset shift to the endemic phase is, on the ground, not a sharp reversal. The public are ready to live life,\" she says. \"However, finding a middle ground especially with respect to individual responsibility is indeed challenging. We know the virus is incredibly adaptable and we also know that managing the long tail of Covid-19 complications is still to come.\"\nSingaporeans also run the risk of underappreciating one important fact, says Dr Yoong, who is also a visiting associate professor at the Yong Loo Lin School of Medicine at National University Hospital. \"That we are not 'free' of Covid-19 because Covid-19 has ceased to exist, but because we are able to manage the threat through vaccination and health and social system strengthening.\"\nFor Associate Professor Terence Ho from the Lee Kuan Yew School of Public Policy (LKYSPP), a continued precautionary stance is a positive. \"The exercise of personal responsibility and judgment is an important part of the transition to the new normal,\" he says.\nBeyond the individual, it is also about decisions made by organisations on whether to retain norms from the Covid-19 era - like workers staying away from the office when ill and without a need for medical certificates, says Dr Lim from SMU. \"Management and business owners may see such measures as temporary, taken only to cope with the public health crisis,\" he adds. \"Once the danger passes, some may feel it is time to ditch them, especially when such actions come with no legal or regulatory repercussions.\"\nLabelled the \"inequality virus\", Covid-19 has exposed and exacerbated existing fissures in society along class, race, nationality and gender lines; with those at the margins hit disproportionately hard. \"While we are all floating on the same sea, it's clear that some are in super yachts, while others are clinging to the drifting debris,\" said United Nations secretary-general Antonio Guterres in July 2020.\nSays Prof Ho: \"The uneven impact of Covid-19 - in both human health and economic terms - has underscored the importance of fairness and inclusion within societies as well as across borders.\"\nHe adds that social protection needs to be enhanced for the economically vulnerable - such as the lower-income and freelance workers - to boost incomes and savings, and reduce their vulnerability to job or income loss. He also notes that retraining has to be stepped up, especially for mature workers aged 40 and above.\nThis year's Budget makes some headway in these areas. Finance Minister Lawrence Wong has said that lower-income groups will benefit the most from measures such as significant utility rebates and cash vouchers for daily expenses, as well as extending support through progressive wages and the Workfare scheme. A new career transition initiative provides mid-career workers with highly subsidised, industry-oriented training courses to help them secure jobs.\nMigrant workers bore the brunt of Covid-19 infections in the first year of the pandemic, with case numbers in dorms surging from 31 in April 2020 to 33,000 in June. The workers made up 19 in 20 infections that year, and as at the end of 2021, more than 175,000 out of 275,000-odd dormitory residents had caught the disease.\nThe outbreaks also laid bare the cramped and unsanitary living conditions faced by the workers, sparking numerous grassroots aid initiatives and impelling the Government to announce improved standards for dorms last September.\nBut there were also parts of the populace - particularly online - faulting the workers for being unhygienic, and blaming them for driving up case numbers. Today, the workers remain largely confined to their living quarters other than for work, essential errands or visits to recreation centres. Over 99 per cent of those living in dormitories are fully vaccinated, but they still need to apply for exit passes to visit public places, and their numbers are capped at 50,000 on weekends and 25,000 on weekdays.\n\"The Government could not have foreseen the outbreaks in migrant worker dormitories because the policy structure by nature is crafted to render invisible the bodies of low-wage migrant workers and silence their voices,\" says Professor Mohan Dutta, director of the Centre for Culture-Centred Approach to Research and Evaluation (Care) at Massey University in New Zealand.\n\"Had low-wage migrant workers had a voice in how policies are developed, adequate and decent housing infrastructures would have already been in place.\"\nSome degree of hostility has also been extended to foreigners on the other end of the wage spectrum, with job cuts and business closures heightening concerns and disquiet about high-earning blue-collar workers competing with locals for employment opportunities. The Government's foreign talent policy came under the microscope in 2021, with two parliamentary debates where ministers stressed the need for a balancing act between welcoming foreigners as a complement to the local workforce, and continuing to prioritise and invest in a \"Singaporean core\".\nSingapore's Comprehensive Economic Cooperation Agreement or Ceca trade deal with India was a particular lightning rod in the discourse, with racist and xenophobic undertones.\nChinese nationals experienced this when the coronavirus started spreading from Wuhan in January 2020. There was also outrage after reports of foreigners at Robertson Quay drinking and flouting social distancing rules in the middle of that year; and in 2021, it was Indian immigrants who were targeted amid reports of record infections and mutant strains in India.\nLocals were swept up in the bile and bigotry, with a spate of incidents and an increase in police reports made over racial and religious matters. Among others, a Chinese man shouted racial slurs at a 55-year-old Indian Singaporean woman and kicked her in the chest; shortly after, a viral video showed a Chinese man accusing a Singaporean man of mixed Indian-Filipino heritage of preying on a Chinese girl.\nThese three hot potatoes - race, the place of foreigners, and the plight of lower-wage workers - were identified as fault lines by PM Lee in his National Day message last August. And in his National Day Rally speech, he committed to tackling these issues through landmark measures like an upcoming law on racial harmony.\nAssistant Professor Catherine Wong from the University of Amsterdam's faculty of social and behavioural sciences points out that amid an atmosphere of finger-pointing at minorities and foreigners, there were also segments of society rallying to speak out against such behaviour and mentality.\n\"Covid-19 tested the norms and values we seek to protect in our society, and the everyday rebuttals against racism and discrimination help to keep those norms and values intact,\" she says. \"Going forward, we need to learn the language and etiquette of how to have a civilised debate and dialogue about difficult issues like inequality, migrant workers, race… Now that social media has forced these issues to the surface, we need to have a public discussion about these issues and learn to do so in an open and reflexive way.\"\nFor USC's Dr Yoong, one key lesson from the impact of Covid-19 is that social capital and cohesion cannot be taken for granted. \"It is not easy, and costly, to be aware of and work with different perspectives, while also trying to establish necessary ways forward,\" she says.\nShaping collectivism\nRecent months have seen PM Lee and other ministers emphasise that it was Singapore's high trust levels - between the people and the Government - which enabled a cohesive and robust response to the public health crisis.\n\"Trust that the Government has the best interest of Singapore and Singaporeans at heart, that the Government is competent and will make the right decisions on behalf of Singaporeans,\" the Prime Minister said last month at the Singapore General Hospital's Lecture and Formal Dinner 2022.\nHe pointed to people largely abiding by safe management measures, enduring rounds of easing and tightening, going for vaccinations and booster jabs, and exercising personal and social responsibility.\nThroughout the pandemic, trust in the Government's management of Covid-19 has dipped in tandem with rising caseloads, according to an IPS survey last year. The proportion of those who saw the authorities as exercising good political leadership fell to 53 per cent from Oct 28 to Nov 1, compared to about 70 per cent in July to September.\nThe decline in sentiment followed a stretch of frustration and confusion over logistical issues in a protocol switch to home-based isolation. Daily cases were also beginning to climb into the thousands for the first time, as public dissatisfaction congealed around perceptions of stop-start measures and contradictory messaging in the Government's intentions to actually live with Covid-19.\nBut observers Insight spoke to argue that a fine line exists between what has been characterised in some quarters as policy flip-flops, and the Government being nimble and flexible enough to make new rules on the fly, in the face of constantly changing and highly-uncertain conditions.\nPivoting from a Covid-zero approach to an endemic one, for example, shows the authorities being adaptive to the new reality of the pandemic, they say.\nIn late October, news that the Bloomberg New Economy Forum would allow foreign delegates to dine in groups of five at designated restaurants roused some public ire and claims of unfairness and inconsistency, given that people here were then limited to a maximum of two when eating out. Trade and Industry Minister Gan Kim Yong had to explain that the larger group size would facilitate business networking, and the Forum's requirements - to be fully vaccinated and undergo daily pre-event testing - were stricter than those for the likes of wedding receptions, where attendees were already allowed to dine in groups of five then.\nBut the pandemic's sternest test of public trust was perhaps the controversy around TraceTogether, which stemmed from the Government revealing in January last year that - contrary to earlier assurances - the data could be accessed by police for criminal investigations, and that this had been done in May 2020 for a murder case.\nA law was later passed to restrict tapping of this information to investigate seven types of serious crimes; and on April 26 this year, the use of TraceTogether was stepped down with the public no longer needing to check in at most venues, except where vaccination status needs to be shown.\nProf Ho from LKYSPP says the Government has fundamentally been open and transparent by not suppressing information or seeking to cover up mistakes.\nHe and other observers believe that, on balance, the public's trust in the Government has remained intact - although it is just as key to keep strengthening that faith.\n\"Singapore's Covid-19 response has not been perfect, but what is clear is that the nation has come through this generational crisis fairly well in terms of limiting the impact of the pandemic on human lives and livelihoods - certainly better than many other countries have,\" says Prof Ho. \"While there was clearly room for improvement, this should not detract from what was an overall successful response to the pandemic.\"\nIPS' Dr Woo points out that Singaporeans have not had to endure a full-scale lockdown apart from the circuit breaker of 2020.\nSays Dr Yoong the economist: \"One thing Covid-19 has taught us is never to be too early to comment on government 'success' or 'failure'. Singapore's image of competent governance on a world stage has not been compromised by Covid-19, and domestically, at this point, the Government is riding the wave of positive opening.\n\"However, given the strong likelihood of economic headwinds ahead and other deeper uncertainties about geopolitics, climate, etc, much remains to be seen.\"\nIn his May Day Rally speech last week, PM Lee said the cautious optimism around Singapore's post-Covid-19 recovery has now been clouded by Russia's invasion of Ukraine. Singaporeans are feeling the war's impact on the cost of living, and the world could face a recession within the next two years, he warned.\nIt is in this \"very different and uncertain world\" that Mr Wong will lead Singapore - having been selected last month to head the People's Action Party's fourth-generation (4G) team, thus assuming the mantle of heir apparent to PM Lee.\nDr Yoong says Mr Wong's leadership style so far \"... signals a recognition that there will be continuity, but politics will not be completely as usual… In the future it will be critical for the Government to (show) that it genuinely listens to and respects the views of its citizens, and holds itself accountable.\"\nThis must include giving voice to those on the margins of society, says Prof Dutta. \"In Singapore and globally, Covid-19 made evident the limits of technocratic policy-making devoid of participatory democracy,\" he adds. \"It is through participatory voice infrastructures that trust in institutions and government can be built and secured, in addressing the complex challenges of the future.\"\nProf Wong says the emphasis should be on cultivating a bottom-up culture of collective responsibility - rather than a top-down, manufactured and performed collectivism foisted on Singaporeans by a Government-led narrative.\n\"It may be messier, but it will contribute to a more resilient society and better response to risk.\"\nSpeaking at the May Day Rally, Mr Wong offered a glimpse of his approach as he announced a new 4G-led \"Forward Singapore\" agenda to refresh the social compact and set out a roadmap for the next decade and beyond.\n\"This is not just about what the Government can do for you,\" he said. \"But also, as we learnt throughout this pandemic - what we can all do for one another; and how we can all, collectively, contribute towards building a better society that embodies the values we stand for.\"\nMr Wong's commitment to equal treatment and engagement across the board is not new. But if he makes good on his word in the wake of a defining, teaching moment in history - that the worst of crises can wreak universal havoc without care for identity - then it augurs well in shaping a Singapore with greater parity - and perhaps a better, brighter tomorrow.", "url": "https://www.straitstimes.com/singapore/politics/moving-beyond-covid-19-how-can-singapore-find-a-new-way-forward-in-a-more-challenging-landscape"}