{"authors": ["Wallace Woon"], "date_download": "2024-10-12 14:01:59", "date_modify": "2024-10-12 14:01:59", "date_publish": "2024-02-08 14:30:00", "description": "17 clinics will stay open 24 hours a day for all four days of the CNY long weekend. Read more at straitstimes.com.", "filename": "singapore_nearly-1000-gp-clinics-will-remain-open-during-chinese-new-year_1728741719.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/08/IMG1906.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_nearly-1000-gp-clinics-will-remain-open-during-chinese-new-year_1728741719.html", "title": "Nearly 1,000 GP clinics will remain open during Chinese New Year", "title_page": "Nearly 1,000 GP clinics will remain open during Chinese New Year | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Worried about falling ill over the Chinese New Year long weekend? There is no cause for worry as there will be 993 general practitioner (GP) clinics open at various times from Feb 9 to 12.\nThe Ministry of Health (MOH) said on Feb 8 that the public can access the list of clinics and their operating hours on its own website, or the websites of the Agency for Integrated Care and the Community Health Assist Scheme.\nA total of 17 clinics will stay open for 24 hours a day for all four days, while 101 clinics will be open on Feb 10, the first day of Chinese New Year.\nOn Feb 11, 149 clinics will open, while 250 clinics will be open on Feb 12.\nA total of 967 clinics will be open on Feb 9.\nMOH said that people are encouraged to visit GP clinics for minor conditions and make an appointment or call before heading down.\nIt added that members of the public should head to accident and emergency departments at hospitals only for serious or life-threatening emergencies, such as chest pains, breathlessness or uncontrollable bleeding.\nIndividuals who are not experiencing life-threatening emergencies should refrain from calling 995 so that emergency medical services can respond swiftly to those with emergency conditions.", "url": "https://www.straitstimes.com/singapore/nearly-1000-gp-clinics-will-remain-open-during-chinese-new-year"}