{"authors": ["Timothy Goh"], "date_download": "2024-10-12 13:30:38", "date_modify": "2024-10-12 13:30:38", "date_publish": "2021-06-10 21:24:12", "description": "The focus will shift away from how many cases there are each day, said Finance Minister Lawrence Wong.  Read more at straitstimes.com.", "filename": "singapore_health_as-covid-19-becomes-endemic-focus-will-shift-from-daily-covid-19-case-numbers-to_1728739838.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/06/10/af_ngtengfong_1006.jpg?VersionId=5chtp7iswinQ6QNrrY8n5l.1Am2jH5Q2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_as-covid-19-becomes-endemic-focus-will-shift-from-daily-covid-19-case-numbers-to_1728739838.html", "title": "As Covid-19 becomes endemic, S'pore will shift focus from daily case numbers to their clinical condition", "title_page": "As Covid-19 becomes endemic, S'pore will shift focus from daily case numbers to their clinical condition | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - As Covid-19 becomes endemic around the world, the focus in Singapore will shift away from how many cases there are each day, and more to the clinical condition of these cases.\nFinance Minister Lawrence Wong on Thursday (June 10) said in such a scenario, \"it's no longer about going after each and every infected case\".\nHe explained that even if a person were to be infected despite being vaccinated, the infection will likely be very mild or even asymptomatic.\n\"So we will need a different protocol for such cases,\" said Mr Wong at a virtual press conference by the multi-ministry task force on Covid-19, which he co-chairs.\nHealth Minister Ong Ye Kung, his fellow co-chair, said such a shift is already happening, with the authorities looking at the clinical condition of people who are infected here.\nThis means, for instance, examining how many people need oxygen due to the severity of their condition, and how many are in the intensive care unit.\nThe ministers were responding to a question about Singapore's Covid-19 strategy in the long-term, when the virus is endemic - meaning it has settled in a certain population in a geographical region, and continues to persist. Some examples of endemic diseases here include influenza, dengue, and hand, foot and mouth disease.\nThis is a lower intensity level than a pandemic, which is the current situation as the coronavirus spreads across the world at an unprecedented scale and speed.\nMr Wong said it is \"very likely\" that Covid-19 will never go away.\nHe added that Singapore is currently developing a strategy to deal with Covid-19 being endemic, although it is still too early to paint a full picture of what this may look like.\nHowever, he noted that there will likely be several components to life in this new normal.\nFirst, high vaccination rates will be essential. This means not only getting people here vaccinated with their first and second doses, said Mr Wong, but also probably taking booster shots in the future.\nFor this to happen, Singapore needs a \"proper and comprehensive vaccination programme\", which the authorities are already working out, he added.\nSecond, better medical treatments for Covid-19 may be available. If so, this will give the authorities greater assurance that even if a breakthrough infection were to occur, or in the rare occasion where there are serious illnesses, treatments are available and people can recover, said Mr Wong.\nThird, border restrictions will likely be eased, but more risk-based and targeted precautions will need to be in place, taking into account the overall infection situation in other countries as well as the vaccination status of travellers.\nMr Ong said more focus will be placed on the capabilities Singapore has in suppressing clusters, such as testing and quarantining cases.\nHe added: \"I really hope we have put circuit breakers as a tool behind us, that in the future with capabilities like these, we don't have to resort to big sledgehammer approaches like circuit breakers.\"", "url": "https://www.straitstimes.com/singapore/health/as-covid-19-becomes-endemic-focus-will-shift-from-daily-covid-19-case-numbers-to"}