{"authors": ["Anjali Raguraman"], "date_download": "2024-10-12 13:44:45", "date_modify": "2024-10-12 13:44:45", "date_publish": "2023-03-02 13:07:21", "description": "The giveaway kicked off at noon on Thursday and was meant to last till March 8. Read more at straitstimes.com.", "filename": "singapore_hour-long-wait-for-thousands-who-swamp-cathay-pacific-website-for-free-air-tickets-to-hk_1728740685.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/02/10494920_6.jpg?VersionId=pxj1xjGatxK2LUL2EGlUsrHzngwXuLip", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_hour-long-wait-for-thousands-who-swamp-cathay-pacific-website-for-free-air-tickets-to-hk_1728740685.html", "title": "12,500 free Cathay Pacific tickets to HK for S’pore residents snapped up after ‘overwhelming response’", "title_page": "12,500 free Cathay Pacific tickets to HK for S’pore residents snapped up after ‘overwhelming response’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - All 12,500 free round-trip tickets to Hong Kong were snapped up within an hour of being released by Cathay Pacific, bringing a quick end to what was supposed to be a seven-day giveaway.\nThe giveaway, announced by the Hong Kong flag carrier, kicked off at noon on Thursday and was meant to last till next Wednesday.\nAs at 1.20pm, a message on the airline’s giveaway website said: “Due to the overwhelming response, all tickets from the Cathay Pacific World of Winners ticket offers online campaign in Singapore have been awarded.”\nThose hoping to get the tickets had faced hour-long waits at the start of the giveaway on Thursday, with thousands of people trying their luck.\nAs at 12.03pm on Thursday – three minutes after the campaign kicked off – the system said there were 56,549 users ahead of this reporter, with an estimated waiting time of more than an hour.\nOn the website’s social media pages, several users said they could not get past the system maintenance page.\nIn response to queries from The Straits Times, Cathay Pacific said the system maintenance message lasted only a short while.\nIt added: “We understand that it may have taken a bit longer for customers not registering for the campaign to access our website during the peak period of the campaign, and we appreciate their patience and understanding.”\nThe winners will be announced on the campaign website on March 20. They will receive an e-mail with details on how to redeem their prize, which does not include airport taxes and surcharges.\nThe giveaway for customers in Singapore is part of a larger “Hello, Hong Kong” campaign announced by Hong Kong Chief Executive John Lee in early February.\nThe move by the Asian financial hub to woo tourists back post-pandemic includes an international giveaway of 500,000 flight tickets that has been rolled out in phases.\nMeanwhile, Cathay Pacific’s giveaway of 17,400 round-trip tickets from Thailand to Hong Kong ended on Wednesday afternoon, despite initially being scheduled to last seven days, according to Agence France-Presse.\nHong Kong has expedited its emergence from the shadow of Covid-19 in recent months as part of the measures to lure back visitors and restore normal life.\nOn Wednesday, the city dropped its mask mandate after more than three years. It was one of the last places globally that still imposed a mask mandate.", "url": "https://www.straitstimes.com/singapore/hour-long-wait-for-thousands-who-swamp-cathay-pacific-website-for-free-air-tickets-to-hk"}