{"authors": ["Tham Yuen-C"], "date_download": "2024-10-12 14:00:33", "date_modify": "2024-10-12 14:00:33", "date_publish": "2024-02-09 03:00:00", "description": "The Dragon year is as good a time as any to try for a baby, he said in his Chinese New Year message. Read more at straitstimes.com.", "filename": "singapore_politics_pm-lee-urges-singaporeans-to-have-more-children-and-to-do-so-earlier_1728741633.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/09/2024012850085464f6142c41-041f-4736-81d5-fff783b6f001.jpg.JPEG?h=f133d4c4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_pm-lee-urges-singaporeans-to-have-more-children-and-to-do-so-earlier_1728741633.html", "title": "PM Lee urges Singaporeans to have more children, and to do so earlier", "title_page": "PM Lee urges Singaporeans to have more children, and to do so earlier | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - As the Year of the Dragon beckons, it is as good a time as any for young couples to try for babies, said Prime Minister Lee Hsien Loong, as he once again took the opportunity to urge people to have children in his annual Chinese New Year message.\nOn its part, the Government will support the marriage and parenthood aspirations of Singaporeans, and build a “Singapore Made For Families”, he added.\n“Many Chinese families consider a child born in the Year of the Dragon to be especially auspicious, the dragon being a symbol of power, strength and good fortune,” he said.\n“So, now is as good a time as any for young couples to add a ‘little dragon’ to your family.”\nSingapore’s crude birth rate – the number of births per 1,000 people – has been steadily declining since the 1960s, but increases were recorded in the years that fell under the Chinese zodiac sign of the dragon – in 1976, 1988, 2000 and 2012.\nThe country’s total fertility rate has also been coming down over the years, hitting a low of 1.04 in 2022 – far below the replacement level of 2.1.\nFertility rates have been declining all over the world, especially in developed societies like Singapore, said PM Lee, who was born under the Chinese zodiac sign of the dragon and turns 72 on the first day of Chinese New Year.\nHe noted that the decision to have children is a very personal one.\nEach generation has different aspirations, and many young people prioritise developing their careers, spending time with their partners and pursuing other interests, over parenthood, he said.\nEven those who want children may put off starting families, not realising how quickly it can get harder to conceive with each passing year, he added.\n“All this is quite understandable. But I still hope that more Singaporean couples will decide to have more children, and to have them earlier,” he said.\nTo support those who want to be parents, the Government has progressively strengthened support for infant caregiving and work-life harmony, he noted.\nSince Jan 1, government-paid paternity leave has also been doubled from two to four weeks on a voluntary basis.\nMeasures like these will lighten the burden on parents, but they are merely enablers, he said.\n“Ultimately, couples will decide whether to have children for their own reasons. I hope more will decide to go ahead, and I am confident they will find parenthood a deeply rewarding and fulfilling journey,” he added.\nPM Lee, who has four children and is a grandfather, said bringing up children is an important element of family life, and there is great joy in watching the young ones learn, grow and reach milestones year by year.\n“Grandparents, like me, share this joy too. We dote and fuss over our grandchildren, helping the parents to bring them up and contributing our part in this journey filled with happiness, purpose and love,” he said.\nAs Singaporeans gather to usher in new beginnings and good luck during Chinese New Year, he urged people to celebrate their families, which are at the heart of society.\n“Our families give us unwavering strength and support, cheer for us in our triumphs and stand by us through adversity. They are a big part of our sense of identity, belonging and purpose. Through our families, we pass on our aspirations and values from generation to generation,” he said.\nThe Prime Minister wished all Singaporeans good health and a very happy Chinese New Year.\n“Entering the Dragon Year, let us press forward with optimism and determination,” he said.\nCorrection note: An earlier version of this story said Singapore’s crude birth rate increased in years that fell under the Chinese zodiac sign of the dragon, including 1964. The Department of Statistics has clarified that the crude birth rate did not increase in 1964.", "url": "https://www.straitstimes.com/singapore/politics/pm-lee-urges-singaporeans-to-have-more-children-and-to-do-so-earlier"}