{"authors": ["Ian Cheng"], "date_download": "2024-10-12 14:00:12", "date_modify": "2024-10-12 14:00:12", "date_publish": "2024-09-03 19:35:00", "description": "Reverend Philip Lim will take over from Rev Gordon Wong after the latter ends his term in December. Read more at straitstimes.com.", "filename": "singapore_methodist-church-appoints-new-bishop_1728741612.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/methodistchurchphiliplim.jpg?VersionId=TVCF06JdIUmPLQuW2TMmVGe6FK4V3n2Z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_methodist-church-appoints-new-bishop_1728741612.html", "title": "Methodist Church elects new bishop", "title_page": "Methodist Church elects new bishop | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Methodist Church in Singapore (MCS) has elected a new bishop.\nReverend Philip Lim, 58, was elected the church’s new head at its 13th General Conference Session from Sept 2 to 6.\nThe General Conference is the highest body in MCS, responsible for legislation for the whole Methodist denomination within Singapore.\nRev Lim will take over from Rev Gordon Wong – who took office in 2020 and will retire after a four-year stint – and will be consecrated on Dec 6.\nAccording to The Methodist Church’s website, it is the largest Protestant denomination in Singapore, with more than 45,000 members.\nThe bishop is tasked with overseeing MCS’ 46 churches, providing counsel to 15 Methodist schools, and offering support for MCS’ social welfare arm Methodist Welfare Services, which runs 20 community-based care centres and programmes.\nCurrently the pastor-in-charge of Kum Yan Methodist Church, Rev Lim, a married father of one, is also the chairman of the Board of Ministry at the Chinese Annual Conference.\nIt is a network of 17 Methodist churches in Singapore which reaches out to the Chinese community, including those who speak Mandarin, English and dialects including Hokkien, Cantonese, Foochow, Hakka, Teochew and Hinghwa.\nHis previous roles included a stint as Methodist Missions Society’s executive director from 2012 to 2018. The society was established in 1991 as the missions agency of MCS.", "url": "https://www.straitstimes.com/singapore/methodist-church-appoints-new-bishop"}