{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:28:20", "date_modify": "2024-10-12 13:28:20", "date_publish": "2024-08-03 12:00:00", "description": "Melas syndrome is a rare genetic condition; 10 people in Singapore are being treated for it. Read more at straitstimes.com.", "filename": "singapore_singapore-woman-with-rare-genetic-disorder-lives-her-life-to-the-fullest-one-day-at-a-time_1728739700.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/03/bthand20240801.jpg?VersionId=TsP7skjhBRobpMKwU9UXZHU_RSZkMIRz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-woman-with-rare-genetic-disorder-lives-her-life-to-the-fullest-one-day-at-a-time_1728739700.html", "title": "13 pills every morning, 9 every evening: Woman with rare genetic disorder", "title_page": "13 pills every morning, 9 every evening: Woman with rare genetic disorder | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Ms Iris Quek had returned from the United States – where she had lived since 2018 – to attend the funeral of her husband’s grandmother, when she felt unwell.\nIt was June 2020, and she was then 39.\n“I was seeing specks flying around in my eyes and subsequently I could no longer control my eye movements,” the petite 43-year-old told The Straits Times recently.\nShe consulted a polyclinic doctor and was referred to the Singapore General Hospital (SGH).\nThe doctors at SGH suspected Ms Quek was having a series of strokes, and she was hospitalised for observation.\nWhen Dr Kaavya Narasimhalu, a consultant with the Department of Neurology at the National Neuroscience Institute, spoke to Ms Quek, the doctor felt there was something more to the problem than strokes.\nMs Quek was then put through a battery of tests and was diagnosed with Melas (mitochondrial encephalopathy, lactic acidosis and stroke-like episodes) syndrome in July 2021.\n“It was the first time I had heard of such a condition,” Ms Quek said slowly. “By then, my brain was not working too well and I was not processing what Dr Kaavya was saying. It was a good thing that my brother was with me.”\nShe was later transferred to Outram Community Hospital to undergo therapy. Unfortunately, her condition had become worse and she could no longer remember names or recognise faces.\n“The Covid-19 pandemic made things worse. Only two people were allowed to visit and for five minutes each time. By then, I could remember only three people – my brother, my husband and my sister-in-law. It took me a long time to recognise my parents,” she said.\nThe treatment for this condition is different from that for stroke.\nDr Kaavya said: “Instead of blood thinners that we give for stroke, we had to start her on a very high dose of supplements to stop the mitochondrial crisis.”\nMelas syndrome is a rare genetic condition, affecting one in 100,000 adults globally, but the disease typically begins during childhood, with symptoms sometimes developing before the age of two.\nOnly 10 people in Singapore, including Ms Quek, have been diagnosed with the condition and are being treated for it.\nMelas syndrome affects the body’s systems, particularly the brain, nervous system and muscles, by affecting the activity of the mitochondria of cells in the body which help turn food into energy and allow cells to function.\n“Mitochondria are like the battery unit of every cell in the human body that creates energy to drive cellular function and all of our biological processes,” said Dr Kaavya, adding that mutations in a particular gene can impair the ability of mitochondria to make proteins, use oxygen and produce energy.\nShe said these mutations affect both men and women, but children inherit the disorder only from their mothers. Early symptoms of Melas syndrome include muscle weakness and pain, recurrent headaches, loss of appetite, vomiting and seizures. Affected individuals experience stroke-like episodes before turning 40.\nWhen the stroke-like episodes occur repeatedly, they can progressively cause damage to the brain, leading to vision loss, problems with movement and dementia.\nOver time, the symptoms will worsen and become fatal.\n“The condition manifests in many different ways,” Dr Kaavya said, adding that the proportion of affected mitochondria in any particular organ matters. “If 80 per cent of your mitochondria is affected, then you probably will present in infancy. Whereas if about 30 or 40 per cent is affected, then you will present in adulthood.”\nLike many people with the condition, Ms Quek is thin and petite, and went through her childhood without being symptomatic.\nDr Kaavya said people with Melas “can have a very large constellation of conditions”. Having diabetes when they are young “is one of them, hearing loss is another and night blindness is a third”.\nThere is no cure for Melas syndrome, but doctors manage its symptoms with a combination of treatments such as anti-seizure medication for stroke-like episodes and supplements “to bypass the blocked pathways”, Dr Kaavya added.\nThe supplements include arginine, an amino acid that is necessary for making proteins and is naturally found in red meat, poultry, fish and dairy; citrulline, an amino acid found in watermelon; and coenzyme Q10, which bodybuilders take to increase muscle bulk.\n“The reality is these patients take almost 15 to 20 pills three times a day. A lot of times, getting the medication and supplements in a form that is palatable is not easy,” Dr Kaavya said, adding that patients spend large amounts of money buying the supplements.\nApart from her medication for seizures and diabetes, Ms Quek spends $400 a month on supplements. She is fortunate that her husband, who is still working in the US, can buy the supplements there as they cost less and are available in higher-dose formulations than in Singapore.\nDr Kaavya said: “The pill burden from the supplements for Melas patients is very high. The formulations we have available for carnitine and arginine are 500mg each, which is difficult when you need 12g to 15g of arginine and 3g of carnitine a day. That alone (without diabetes or seizure medications) would be 30 to 36 pills per day.”\nShe added: “There are other higher-dose formulations internationally that some patients buy... but not all patients have that option. It would be good to have higher-dose formulations available locally that could help patients.”\nMs Quek returned to the US with her husband in 2022 and consulted a Melas syndrome specialist at the Phoenix Children’s Hospital, where she underwent speech therapy and “was given homework to exercise my brain”.\nShe came back to Singapore in October 2023 for a family wedding and continues to manage her condition here with Dr Kaavya’s help.\nMs Quek lives with her parents, who take turns with her brother to look after her needs and help her manage her health.\n“I need to take 13 pills and capsules every morning and nine in the evening to keep my symptoms at bay. My hands continue to shake and I still cannot stand for too long,” said Ms Quek.\n“I am still not able to concentrate properly, but I continue to live to the fullest, a day at a time”.", "url": "https://www.straitstimes.com/singapore/singapore-woman-with-rare-genetic-disorder-lives-her-life-to-the-fullest-one-day-at-a-time"}