{"authors": ["Lee Nian Tjoe"], "date_download": "2024-10-12 14:17:49", "date_modify": "2024-10-12 14:17:49", "date_publish": "2023-08-14 05:00:00", "description": "The rush for rebates led to a spike in registrations, but demand appears to be lagging behind supply. Read more at straitstimes.com.", "filename": "singapore_transport_unused-electric-vans-put-up-for-sale-after-dealers-claim-higher-rebate-before-it-was-halved_1728742669.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/14/DSC8404.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_unused-electric-vans-put-up-for-sale-after-dealers-claim-higher-rebate-before-it-was-halved_1728742669.html", "title": "Unused electric vans put up for sale after dealers claim higher rebate before it was halved", "title_page": "Unused electric vans put up for sale after dealers claim higher rebate before it was halved | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Good-as-new electric vans are being offloaded in the used market after dealers registered them before April 1, to get a $30,000 rebate, which was halved after the deadline.\nThe rush for the Commercial Vehicle Emissions Scheme (CVES) rebate was why electric van registrations spiked to 610 units in March, accounting for nearly 65 per cent of 939 units registered in the first quarter of the year.\nBut some of these vehicles were never actually sold to buyers or used.\nOn online used vehicle portal Sgcarmart, more than 70 practically new electric vans – all registered in the first quarter of 2023 – were listed for sale as used vehicles in end-July.\nA BYD T3 electric van registered on March 31 is listed for sale at over $120,000, with 10km on its odometer. A salesman for the vehicle said the dealership had two such units left after selling other vans earlier.\nBYD electric vans are imported by ST Engineering and sold by appointed dealers.\nAs the pre-registered electric van was registered under the earlier incentive scheme, its buyer would receive the remaining $20,000 of rebate from the Land Transport Authority over the next two years of ownership. The first $10,000 would have been given out at registration.\nThis makes the pre-registered electric van comparatively cheaper than a brand new, unregistered one, which would cost just over $140,000 before the $15,000 rebate given upon registration.\nSome industry insiders deny that there are many such registered but unused electric vans, noting that the practice is expensive for dealers as they have to pay for the certificate of entitlement (COE) to register the van, on top of bearing the vehicle cost.\nCommercial vehicle COE premiums have been high. In the first quarter of 2023, the commercial vehicle COE premium ranged between $77,109 and $91,101, compared with between $42,200 and $51,504 in the same period a year ago.\nHowever, Mr Edward Tan, executive director of Hong Seh Evolution, which imports electric vehicles, said there are at least some excess electric van registrations.\nHe estimates the actual market demand to be around 100 or so electric van registrations a month, after subtracting the surge in registration numbers in February and March.\nThis, in turn, suggests that the actual rate of adoption of electric vans by businesses may not be as strong as indicated by the high number of registrations in the first quarter of the year.\nChecks by The Straits Times with some rental companies found that the leasing rate of electric vans has not risen in the past 12 months either. This is despite the cost of registering electric vans rising in 2023, with the reduced CVES incentives and rising COE premiums.\nLeasing is a popular option for companies wanting to try out using electric vans instead of buying them, as it gives firms the flexibility to revert to traditional internal combustion engine options if the electric vans do not meet their needs or expectations.\nIn the first half of 2023, EVCo registered 204 Shineray electric vans – 197 units in March and just seven in June.\nThere are two units of the imported Shineray electric vans from March that are listed as used vehicles for sale on Sgcarmart by independent motor dealers.\nOther players have also committed to large fleets of electric vans.\nSome of these vehicles would have arrived in Singapore, with more potentially on the way, at a time when dealers are trying to sell their pre-registered units. This means that it is not likely the excess supply of such vehicles will be eased soon.\nIn August 2022, Chinese manufacturer Foton announced that it had received an order for 210 units of its electric iBlue EV van from Singapore. Only 64 vans have been registered as at the first half of 2023.\nTransport giant ComfortDelGro will start importing Chinese electric vans by the last quarter of 2023 and is committing to register at least 100 electric vans by end-2024.", "url": "https://www.straitstimes.com/singapore/transport/unused-electric-vans-put-up-for-sale-after-dealers-claim-higher-rebate-before-it-was-halved"}