{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 13:55:18", "date_modify": "2024-10-12 13:55:18", "date_publish": "2024-04-20 17:20:00", "description": "The hospital campus can start serving the community even before it is physically completed. Read more at straitstimes.com.", "filename": "singapore_pandemic-ready-tech-enabled-new-hospital-campus-with-1400-beds-to-open-in-the-east-by-2030_1728741318.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/20/Fig.20320Artists20Impression20of20the20EGH20Campus2028View20from20park29.jpg.jpg?VersionId=YzIwTipO29JwHC_woQH0X3zGbymCRXiS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_pandemic-ready-tech-enabled-new-hospital-campus-with-1400-beds-to-open-in-the-east-by-2030_1728741318.html", "title": "Pandemic-ready, tech-enabled: New hospital campus with 1,400 beds to open in the east by 2030", "title_page": "Pandemic-ready, tech-enabled: New hospital campus with 1,400 beds to open in the east by 2030 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A new hospital campus will add about 1,400 beds to augment Singapore’s healthcare capacity, bringing services closer to residents in the eastern region by 2030.\nLocated beside Bedok North MRT station, the campus comprises the Eastern General Hospital (EGH) and the Eastern Community Hospital. Collectively known as the EGH Campus, it will open around 2029 to 2030 and will be operated by SingHealth.\nEGH will provide a comprehensive suite of emergency care as well as inpatient and outpatient clinical specialities.\nThe Eastern Community Hospital will offer continuing and rehabilitative care services, including specialised programmes for palliative patients and dementia patients, and those with other medical conditions to improve their work ability and facilitate an early return to work.\nMinister for Health Ong Ye Kung, who officiated the ground-breaking ceremony in Bedok North on April 20, said the EGH will incorporate new, unique features that differentiate it from other general hospitals.\nFirst, it will be a more pandemic-ready hospital.\n“The planning and design process benefited from the Covid-19 experience,” Mr Ong said in his address. “The team has thus designed EGH to have wards that can be quickly converted for isolation use, and to accommodate the need for bed surges.”\nWorking spaces can also be quickly segregated to support new work arrangements during a pandemic, without major modifications to the building infrastructure.\nSecond, EGH will have information technology infrastructure that is designed and incorporated from the outset, and its personnel will be trained to deliver telemedicine more effectively.\nFor example, during teleconsultation, doctors can ask if patients are keeping up with their exercises, but are not able to verify what the patients say.\nThe EGH team is working on developing wearable sensors that could remotely track the frequency and accuracy of the prescribed exercises.\nThird, EGH will be the first general hospital in Singapore that can deliver its services before the completion of the physical hospital, with the help of telemedicine and digital technology.\nThe hospital intends to start operating virtual wards around 2026, with teleconsultation and remote monitoring of patients at home. As its premises will not be ready by then, it will be nested in other SingHealth hospitals, such as Changi General Hospital (CGH).\nMr Ong said CGH is facing a challenging capacity crunch and shouldering the rising healthcare needs of residents in the eastern region. It is increasing its emergency department’s capacity and bed capacity over the next few years.\nTo support CGH, the Ministry of Health is building a 200-bed transitional care facility – the sixth in Singapore – in Upper Changi Road North. The facility is expected to be completed in January 2025.\nThe Eastern Community Hospital will be part of Singapore’s cluster of community hospitals. It will tap SingHealth Community Hospitals’ (SCH) network to form key partnerships with healthcare and community partners that will benefit residents in the east.\nThis will ensure seamless care transition for patients from hospital to home, using a programme that connects patients to social and health-promoting community assets to support their well-being, said Associate Professor Gan Wee Hoe, chief executive of SCH, which will oversee the operations for the Eastern Community Hospital.\nProfessor Lee Chien Earn, chairman of the EGH hospital planning committee, said the new campus will be no new kid on the block in terms of clinical capabilities and healthcare know-how. Its workforce will draw expertise from the hospitals and speciality centres under SingHealth.\n“Through this One SingHealth approach, residents and patients will also have access to national speciality services close to their homes when the EGH Campus is ready,” said Prof Lee, who is also deputy group chief executive (regional health system) of SingHealth.\n“This is made possible through close collaboration and setting up of onsite services by SingHealth institutions such as the national cancer, dental, heart, neuroscience and eye centres in EGH.”", "url": "https://www.straitstimes.com/singapore/pandemic-ready-tech-enabled-new-hospital-campus-with-1400-beds-to-open-in-the-east-by-2030"}