{"authors": ["Rhea Yasmine"], "date_download": "2024-10-12 13:33:51", "date_modify": "2024-10-12 13:33:51", "date_publish": "2024-09-13 12:51:27", "description": "The park features amenities like a lawn, nature playgarden and garden swings. Read more at straitstimes.com.", "filename": "singapore_partial-opening-of-tampines-boulevard-park-adds-to-list-of-green-spots-for-residents_1728740031.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/13/Tampines20Boulevard20Park20overview.jpg?VersionId=Q9fIoHZonAN3f7z1lRelFdFIsur3pD0B", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_partial-opening-of-tampines-boulevard-park-adds-to-list-of-green-spots-for-residents_1728740031.html", "title": "Partial opening of Tampines Boulevard Park adds to list of green spots for residents", "title_page": "Partial opening of Tampines Boulevard Park adds to list of green spots for residents | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Tampines residents can look forward to another green space in their neighbourhood with the opening of Tampines Boulevard Park’s west section on Sept 13.\nLocated in the Tampines North region, the park’s west section spans 4.78ha, slightly larger than 6½ football fields.\nIt features amenities such as a 60m-long cycling track for children, garden swings scattered throughout the park and an outdoor fitness area.\nThe park – comprising the east and west sections – was designed with feedback from Tampines residents in mind. Ideas were gathered through an online survey conducted from March to April 2020.\nMore than 600 responses were received, including requests for amenities such as a nature playgarden and a lawn for activities, both of which have been incorporated into the park’s design, the National Parks Board said on Sept 13.\nThe nature playgarden features a slide designed to resemble a dragon head and was constructed using natural materials such as Balau wood and laminated wood grain panel. It aims to encourage play and closer connections to nature.\nChildren can also enjoy the park’s sand play area, which includes swings and a rock wall. The amenity was inspired by the former Tampines sand quarries.", "url": "https://www.straitstimes.com/singapore/partial-opening-of-tampines-boulevard-park-adds-to-list-of-green-spots-for-residents"}