{"authors": ["Wallace Woon"], "date_download": "2024-10-12 13:55:49", "date_modify": "2024-10-12 13:55:49", "date_publish": "2024-01-16 22:15:00", "description": "There were 30 cases in 2021 and 35 cases in 2022. Read more at straitstimes.com.", "filename": "singapore_spike-in-dog-abuse-cases-in-2023-with-9-involving-trainers-spca_1728741349.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/16/2019101815713769275175723820417215102a2obmczuann.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_spike-in-dog-abuse-cases-in-2023-with-9-involving-trainers-spca_1728741349.html", "title": "Spike in dog abuse cases: 69 reported in 2023, with 9 involving trainers, says SPCA", "title_page": "Spike in dog abuse cases: 69 reported in 2023, with 9 involving trainers, says SPCA | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – There was a spike in dog abuse cases here in 2023, with 69 reported cases, said the Society for the Prevention of Cruelty to Animals (SPCA) on Jan 16 in response to queries from The Straits Times.\nThere were 202 cases of dog abuse between 2019 and 2023, SPCA added, with 2023’s figure making up a third of the five-year total.\nSPCA received reports of 48 cases in 2019, 20 cases in 2020, 30 cases in 2021 and 35 cases in 2022.\nNine of the cases in 2023 involved dog trainers.\nSPCA executive director Aarthi Sankar said that pet owners should engage trainers who use only humane training methods, which do not employ physical force on the animals.\nMs Sankar’s comments were in response to a video posted on Instagram on Jan 15 showing two employees at dog training firm Xavian and Pack pushing and hitting dogs.\nShe also warned against hiring dog trainers who use training tools such as shock, choke or prong collars.\n“It is essential to check reviews of the trainers and do your research before engaging their services,” Ms Sankar said, adding that training dogs takes time and that owners should be wary of trainers who promise immediate positive results.\n“The SPCA also advises against engaging trainers who exclude pet guardians from the training process. Training is a two-way process and your participation will help you bond with your pet, and equip you with the right skill sets and mindset to guide your pet,” she said.\nIn the video, one of the men pushes down on a dog’s back to get it to sit. When the dog stands back up, the man uses both his arms to shove the dog down again and it eventually sits.\nThe other man drags another dog, before appearing to hit its body and head to get it to stay in place.\nXavian and Pack’s owner said that the pair have since been suspended. The Animal and Veterinary Service (AVS) said it is investigating the matter.\nMs Sankar said that businesses that conduct dog training should have stringent recruitment processes and regular training for employees.\nBusinesses should develop a code of conduct for their employees and have them obtain relevant certification from government bodies before being allowed to handle animals without supervision, she added.\nThe AVS launched its Accredited Certified Dog Trainer Scheme on Dec 10, 2022, for dog trainers.\nUnder the scheme, which is voluntary, dog trainers can get certification from any of these four international animal behaviour and training organisations: the International Association of Animal Behaviour Consultants, the Certification Council for Professional Dog Trainers, the Animal Behaviour Society, and the American College of Veterinary Behaviourists.\nDog trainers who wish to apply for the scheme may visit AVS’ website for more information.\nDog owners who wish to engage an accredited trainer may also refer to a list on the same page.", "url": "https://www.straitstimes.com/singapore/spike-in-dog-abuse-cases-in-2023-with-9-involving-trainers-spca"}