{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:35:33", "date_modify": "2024-10-12 13:35:33", "date_publish": "2023-01-09 17:08:06", "description": "The man is not involved in his child's care and has not offered to help with expenses, the court heard. Read more at straitstimes.com.", "filename": "singapore_courts-crime_jail-for-man-who-had-sex-with-2-underage-girls-impregnating-one-of-them_1728740133.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/09/court_13.jpg?VersionId=b0hPU_c0wSwmGGf85C4zV0slfc2m8FNO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_jail-for-man-who-had-sex-with-2-underage-girls-impregnating-one-of-them_1728740133.html", "title": "Jail for man who had sex with 2 underage girls, impregnating one of them", "title_page": "Jail for man who had sex with 2 underage girls, impregnating one of them | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A youth had sex with two of his underage girlfriends in separate incidents and impregnated one of them.\nShe has since given birth to their baby, whose gender was not disclosed in court documents.\nThe young mother has made plans to enrol in private studies, so that she can take care of the child while improving herself.\nThe offender, however, has not been involved in his child’s care as he is no longer on good terms with his former girlfriend.\nDeputy Public Prosecutor Gladys Lim told the court that he had also not offered to help with his child’s expenses.\nOn Monday, the 22-year-old man, who pleaded guilty to offences including having sex with minors and driving without a licence, was sentenced to 16 months and four weeks’ jail, as well as a fine of $2,600.\nHe was also disqualified from holding or obtaining all classes of driving licences for two years.\nThe offender cannot be named owing to a gag order to protect his victims’ identities.\nHe was between 18 and 19 years old when he was in a relationship with one of the underage girls from December 2018 to July 2019.\nShe was between 14 and 15 years old at the time.\nThe pair had unprotected sexual intercourse up to three times a week at her home.\nThe offender was 19 years old when he got into a relationship with the second minor, who was then 15, in November 2019.\nThe couple engaged in unprotected sexual intercourse regularly, and the girl later became pregnant.\nThe DPP said: “The accused was aware that (she) was pregnant with his baby. Subsequent DNA sampling confirmed that the baby belonged to the accused.\n“On March 18, 2020, when (she) went for her pregnancy check-up... a doctor at Bukit Batok Polyclinic lodged (a report that the underage victim was pregnant).”\nThe couple broke up in April 2020.\nCourt documents did not disclose what happened next, but in an unrelated case, the offender, who did not have a valid driving licence, later borrowed a friend’s rented car.\nA Traffic Police officer spotted the offender on Oct 4, 2020, as the latter was speeding along the Pan-Island Expressway in the vehicle at around 4am.\nAt the time, the offender was driving at a speed of 157kmh, almost double the 80kmh limit.\nDPP Lim said the officer chased after the car and the offender then turned into Onraet Road near Mount Pleasant.\nThe car stopped when it reached a dead end and the offender was taken to the Traffic Police headquarters in Ubi Avenue 3.", "url": "https://www.straitstimes.com/singapore/courts-crime/jail-for-man-who-had-sex-with-2-underage-girls-impregnating-one-of-them"}