{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 14:20:38", "date_modify": "2024-10-12 14:20:38", "date_publish": "2024-07-30 17:00:00", "description": "New bus routes and additional trips will be rolled out over eight years to better serve commuters. Read more at straitstimes.com.", "filename": "singapore_transport_up-to-900m-to-be-invested-in-new-initiative-to-improve-singapore-s-public-bus-network_1728742838.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/30/pixbuses.31c63acc.Attachment.060336.jpg?VersionId=uQQEh2HX00I88YBqf.dp4lTslBPVljNm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_up-to-900m-to-be-invested-in-new-initiative-to-improve-singapore-s-public-bus-network_1728742838.html", "title": "Up to $900m for new initiative to improve Singapore’s public bus network", "title_page": "Up to $900m for new initiative to improve Singapore’s public bus network | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Residents of newer housing estates as well as those moving into new housing projects – whether in new towns or mature ones – will benefit from better public bus connectivity under a new government initiative.\nThose in Yishun, Punggol and Tampines will be among the first to benefit.\nUp to $900 million will be spent over the next eight years to improve the bus network in several ways under the Bus Connectivity Enhancement Programme, said the Land Transport Authority (LTA) on July 30.\nFirst, the roll-out of bus services in new towns will be sped up, so early batches of residents will get access to public transport options as soon as possible, instead of having to wait for more people to move in.\nSecond, express feeder buses that will call at fewer stops will be introduced, so those living in new housing developments a distance from the town centre and major transport nodes can get there more quickly.\nThird, more peak-hour express bus services – including those from housing estates to the city – will be added to complement busier MRT lines.\nFinally, in response to changing travel patterns, more bus trips will be added to certain routes, new services will be rolled out, and some bus routes adjusted, LTA added.\nThe authority noted that housing development in Singapore has gathered speed in recent years, and demand for bus services has climbed.\nIt said some precincts in newer housing estates that are growing are located farther from town centres and MRT stations.\nNew developments in more mature estates can also be better served, LTA said. This is especially in areas with fewer bus services, or where the number of residents has increased substantially and passenger loads on the MRT and buses have risen.\nThe new bus enhancement programme will kick off in Yishun East, where the introduction of a new bus service will be brought forward to connect residents of new and upcoming Build-To-Order developments with the nearby Khatib MRT station.\nThe aim is to launch this service by September.\nAs for the new express feeder services, the first such route will be introduced in Tampines North in December to give residents a more direct link to Tampines MRT station.\nFor those living in Sumang in Punggol, a new City Direct Service to the Central Business District will start around October.\nBy the end of 2024, a bus service in Toa Payoh East will also be extended to connect residents there with the Thomson-East Coast and Circle lines at Caldecott MRT station. More of such adjustments will be made based on regular reviews of the bus network, LTA said.\nSpeaking to reporters on July 30, Transport Minister Chee Hong Tat said the additional funds will be used to buy more buses, hire more bus drivers and maintenance staff, and build new infrastructure, such as bus stops, so the planned improvements can be made.\nLTA said the sum will also go towards operating new services, and similar to the arrangement for existing bus services, part of the costs will be recovered through the fares passengers pay to use the services.\nAsked how many new buses and services will be introduced, and how many new workers are needed, Mr Chee said it was difficult for the authorities to be too precise at this point because it is not a one-off scheme, but a multi-year one.\n“It is town by town,” the minister said in an interview at the Ministry of Transport’s office in Alexandra Road. “We don’t have a template that is the same across different parts of Singapore. It depends on the needs of the commuters in that location. And we will do this in consultation with grassroots advisers.”\nThe $900 million programme will not have an impact on fares, he added.\nThe minister was also asked about the timing of the new programme and whether it was tied to the next general election, which must be held by November 2025, or recent discussions about a free shuttle bus service launched in Marine Parade GRC, MacPherson and Mountbatten to plug gaps in the bus network there.\nIn response, he said the authorities have been planning for the new programme for some time, and his ministry worked with the National Development Ministry to understand where the new housing developments are and assess the public transport needs of residents there. The funds were then secured from the Finance Ministry.\nThe new initiative shares many similarities with the $1.1 billion Bus Service Enhancement Programme, which ran from 2012 to 2017.\nThat programme added 1,000 government-funded buses to Singapore’s roads and introduced 80 bus services, of which 22 were City Direct Services plying express routes between housing estates such as Bedok and Hougang and the city.\nMany of the other services introduced were feeder or short trunk services to improve local connectivity, especially in areas such as Choa Chu Kang, Sengkang, Punggol and Yishun, which were newly developed then.\nEven with the new injection of funds, LTA stressed the need to spend public transport resources prudently.\nThe authority said it would continue to review and adjust the bus network, and reallocate any potential savings – a reference to the Government’s efforts to rein in operating costs by withdrawing or altering bus services that run parallel to new MRT lines.\nMr Chee told Parliament in October 2023 that bus services have been operating at an overall loss, which is why the Government subsidises bus operations to the tune of $1 billion yearly.\nAsked about this on July 30, the minister said the resources freed up by the rationalisation of bus services are inadequate to support the growing public transport needs of those living in new developments. “We can’t just rely on the existing subsidies.”\nThe Government’s hope is that ridership for bus services introduced under the new programme will rise over time, especially in newer estates as more people move in.\n“We are putting in place the infrastructure and buying the buses because we hope that the ridership will improve over time... But let’s be clear, public buses, public transport are a public good and we don’t fully recover all the costs,” Mr Chee said.\nHe added: “During the initial period, the buses will have lower ridership. So, yes, this is a commitment.\n“(It will) require resources from the Government. But we think that in exchange, we will be able to get better connectivity and better services for our residents.”", "url": "https://www.straitstimes.com/singapore/transport/up-to-900m-to-be-invested-in-new-initiative-to-improve-singapore-s-public-bus-network"}