{"authors": ["Judd Siow", "Zaihan Mohamed Yusof"], "date_download": "2024-10-12 13:31:11", "date_modify": "2024-10-12 13:31:11", "date_publish": "2023-03-07 18:39:23", "description": "About 100 people were evacuated and one person was injured on Tuesday morning. Read more at straitstimes.com.", "filename": "singapore_worker-has-near-miss-after-explosion-at-audi-service-centre_1728739871.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/08/sv-audicrash-070323.jpg?VersionId=zjmWdXIlqRaW91emi5CPp.jrIiac3ID1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_worker-has-near-miss-after-explosion-at-audi-service-centre_1728739871.html", "title": "‘How could an explosion like this happen?’: Worker recounts near miss in Audi service centre blast", "title_page": "‘How could an explosion like this happen?’: Worker recounts near miss in Audi service centre blast | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE –The explosion at the Audi service centre at 55 Ubi Road 1 on Tuesday was felt by those working in nearby buildings, and sent some running for cover.\nMr Pan Wei Min, who was on his way to work at a hardware store in the nearby Oxley BizHub 2 building, said he was about 4m away from the site when the shockwave almost knocked him off his feet.\nThe 35-year-old said debris flew everywhere, and one fragment narrowly missed his left eye. It left him with a small cut above his eyebrow.\n“The blast wasn’t too loud, but I felt a ringing in my ears afterwards. Some debris flew to the adjacent building,” the Chinese national said in Mandarin.\n“My first thought was, ‘How could an explosion like this happen?’ I decided to crouch and then run away from the blast as I feared there would be another explosion.”\nThe incident happened at about 8.55am as Mr Pan was walking on a path by the fence that separates the Audi service centre from the Oxley BizHub building.\nA fire had broken out in the motor room on the ground floor of the building that houses the service centre before a blast sent debris flying in all directions.\nMr Pan, who ran to a nearby bus stop, said: “I was the only person in the immediate vicinity when the blast occurred. A security guard ran over from Oxley BizHub to see what happened.”\n“If I had been a little closer, the shockwave might have knocked me over. It caught me off guard.”\nAn employee of Cafe Limonci at Oxley BizHub was opening the eatery for business when she heard the blast.\n“I heard and felt the explosion. I thought something large had fallen at first.\n“When I stepped outside to take a look, I saw glass shards scattered everywhere,” said the employee, who declined to be named.\nA security guard who works in the same building said he saw flames shooting out from the motor room.", "url": "https://www.straitstimes.com/singapore/worker-has-near-miss-after-explosion-at-audi-service-centre"}