{"authors": ["Joyce Teo"], "date_download": "2024-10-12 13:58:24", "date_modify": "2024-10-12 13:58:24", "date_publish": "2022-11-04 16:31:17", "description": "It is a continuous challenge to achieve a good balance among cost, accessibility and quality.  Read more at straitstimes.com.", "filename": "singapore_health_5g-robots-and-other-innovations-may-help-singapore-s-healthcare-system-cope-with-ageing-population_1728741504.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/07/eNSL6674.jpg?VersionId=xb5dBGZ9P.gajAVdChvXrEuLIqF3yHKP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_5g-robots-and-other-innovations-may-help-singapore-s-healthcare-system-cope-with-ageing-population_1728741504.html", "title": "5G robots, other innovations may help healthcare system cope with ageing population", "title_page": "5G robots, other innovations may help healthcare system cope with ageing population | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Nifty 5G-powered robots and augmented reality may be part of the healthcare landscape here soon, as Singapore continues to find smarter ways of better caring for patients in the face of a rapidly ageing population.\nInnovations such as these will help the nation’s healthcare system cope with future challenges, such as a limited labour force arising from a greying population, said Deputy Prime Minister Heng Swee Keat at the Centre for Healthcare Innovation’s Innovate 2022 conference on Friday.\nHe announced that a new Virtual Centre for Healthcare Innovation Living Lab will be launched in early 2023, which will look into virtual reality and augmented reality innovations in the training of medical students and healthcare professionals.\nCurrently, robots are already being used to deliver medication to patients at Tan Tock Seng Hospital (TTSH). These robots are now being considered for other uses, such as helping people navigate in hospitals, as part of a new 5G collaboration between the hospital’s Centre for Healthcare Innovation (CHI) and the Infocomm Media Development Authority.\nMr Heng said Singapore has built a world-class healthcare system, but it is a continuous challenge to achieve a good balance among what some have called the “iron triangle” of healthcare: cost, accessibility and quality.\nWith the rapidly ageing population, the country is also facing constraints such as a more limited labour force. Hence, finding an optimal spot within the iron triangle will remain a key challenge for Singapore and many other societies, the minister said.\nThe key to balancing the iron triangle is innovation and translating it into impactful uses, he added.\nAt the event, Dr Janil Puthucheary, Senior Minister of State for Health, officially opened TTSH’s Medical 3D Printing Centre, which is located at CHI.\nThe 3D printing centre started operating in 2020 and has come up with 250 models for various uses, including body parts to help patients understand their medical conditions and why they have to undergo certain procedures.\nIn their speeches, Mr Heng and Dr Janil highlighted TTSH’s vision of becoming a “hospital without walls”, where digitalisation enables care to be delivered beyond the hospital any time.\nFor instance, patients can use the HealthHub app to register themselves at a clinic and find out the number of patients ahead of them, said Dr Janil.\nIn his speech, Mr Heng said TTSH is ramping up the use of telehealth and that in 2023, it will be launching “telepods”, which will provide clinicians with a conducive space to carry out teleconsultations.\nThe use of artificial intelligence to predict and prevent falls in patients is another example given by Dr Janil.\nThe fall prediction system, known as Presage, was trialled at TTSH in 2021.\nIt is now also being used at Ng Teng Fong General Hospital, Mount Elizabeth Novena Hospital, Jurong Community Hospital and the AWWA Adult Disability Home in Pasir Ris, said Mr Myron Wee, deputy director of the digital and smart health office at CHI, at a media tour of CHI on Thursday.\nHealthcare ultimately remains a high-touch industry, and an innovative workplace culture must be encouraged so that every healthcare worker feels empowered to make suggestions on how to innovate for the better, said Mr Heng on Friday.\nHe said underpinning all of this are partnerships and collaborations. Healthcare clusters can learn from one another, and collaborate with industry, research institutes and international partners.", "url": "https://www.straitstimes.com/singapore/health/5g-robots-and-other-innovations-may-help-singapore-s-healthcare-system-cope-with-ageing-population"}