{"authors": ["David Sun", "Jefferson Lin Zi Xuan", "Rebekah Chia"], "date_download": "2024-10-12 13:28:52", "date_modify": "2024-10-12 13:28:52", "date_publish": "2023-03-28 19:07:10", "description": "A 19-year-old woman was taken to hospital. Read more at straitstimes.com.", "filename": "singapore_5-youth-arrested-after-woman-found-with-injuries-in-bugis-hotel-two-sharp-weapons-found_1728739732.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/28/2023032710928384720230327134112cyq1558-01_5.jpg?VersionId=CwJ.tf6A9Zf31TiFGgmHzC.FK_5ZeLlI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_5-youth-arrested-after-woman-found-with-injuries-in-bugis-hotel-two-sharp-weapons-found_1728739732.html", "title": "Five arrested after incident at Bugis hotel; two weapons found", "title_page": "Five arrested after incident at Bugis hotel; two weapons found | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Five people aged 16 to 23, including two women, have been arrested for voluntarily causing hurt with a dangerous weapon after police descended on a hotel in the Bugis area on Monday.\nOne of the women arrested was found injured there, and the 19-year-old was taken to hospital. She was conscious.\nThe woman, a 16-year-old youth and a 23-year-old woman were also suspected of drug offences, police said. The other two who were arrested were men aged 18 and 22.\nThe police got a call for assistance at about 11.50am. Witnesses said they saw several police officers and forensics staff at the Rest Bugis Hotel at 8 Jalan Kubor around noon.\nMs Allen Tong, 42, a manager of a cafe opposite the hotel, said: “I came to the cafe at about noon and saw a lot of police in the area. I later saw the police taking a person with blonde hair out of the hotel in handcuffs.”\nMr Giorgio Cetkovic, 39, an executive chef for several restaurants in the area, said he saw police officers with gloves searching the back alleys in Jalan Kubor.\n“Staff from the different eateries in the area had come out to look, but we didn’t know what was going on,” he said.\n“The police appeared to be looking for something, and trying to get security camera footage.”\nTwo weapons, believed to be sharp objects, were later found in the area.\nA man working at one of the nearby hostels, who did not want to be identified, said the police approached him with a list of names and IC numbers, asking if anyone with those particulars had been staying at the hostel. None of them turned up in the hostel’s records.\nOne of the people, believed to be the 18-year-old arrested, is Indonesian, while the others are Singaporeans, he said.\nStaff at Rest Bugis Hotel declined to comment. Police said investigations are ongoing.\nThose convicted of voluntarily causing hurt with a weapon may be jailed for up to seven years, fined and caned.", "url": "https://www.straitstimes.com/singapore/5-youth-arrested-after-woman-found-with-injuries-in-bugis-hotel-two-sharp-weapons-found"}