{"authors": ["Ng Wei Kai"], "date_download": "2024-10-12 13:27:03", "date_modify": "2024-10-12 13:27:03", "date_publish": "2024-10-11 12:02:51", "description": "“They are and have always been free to return to Singapore,” the police said in response to media queries. Read more at straitstimes.com.", "filename": "singapore_no-legal-restraints-on-lee-hsien-yang-returning-to-singapore-police_1728739623.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/IMGLeeHsienYang116B3D9E0.jpg?VersionId=19_wNKvHOPeYkHjq2vz1wpvGZFSurTMP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_no-legal-restraints-on-lee-hsien-yang-returning-to-singapore-police_1728739623.html", "title": "No legal restraints on Lee Hsien Yang returning to Singapore: Police", "title_page": "No legal restraints on Lee Hsien Yang returning to Singapore: Police | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – There are no legal restraints on Mr Lee Hsien Yang, the younger son of founding prime minister Lee Kuan Yew, and his wife Lee Suet Fern returning to Singapore, said the police.\n“They are and have always been free to return to Singapore,” the police said in a statement on Oct 11 in response to media queries.\nThe statement added that the police had asked Mr and Mrs Lee to assist in investigations in June 2022 by attending an interview. It said: “They had initially agreed but in the end did not turn up for the scheduled interview, left Singapore on June 15, 2022, and have not returned since.”\nThe subject of Mr Lee’s possible return to Singapore re-emerged following the death of his older sister, Dr Lee Wei Ling, on Oct 9. Mr Lee had earlier said he would not be returning to Singapore for the wake and funeral, and that his son Li Huanwu would be helping with them.\nDr Lee died aged 69, four years after being diagnosed with a rare brain disorder called progressive supranuclear palsy.\nIn 2023, Mr Lee said in a Facebook post that he may never return to Singapore amid the ongoing police investigation, the root of which is a legal disagreement between Senior Minister Lee Hsien Loong and his younger siblings over the fate of their late father’s house in Oxley Road.\nAmong the differences was a demolition clause – relating to the demolition of the 38 Oxley Road house after Mr Lee Kuan Yew’s death – which had not been in the sixth or penultimate will but was in the last.\nThis clause became a sticking point among the late Mr Lee’s children.\nIn 2020, the Court of Three Judges and a disciplinary tribunal found that Mr Lee Hsien Yang and Mrs Lee Suet Fern had lied under oath during disciplinary proceedings against Mrs Lee, a lawyer, over her handling of the last will of Mr Lee Kuan Yew, who died on March 23, 2015, at the age of 91.\nThe police then became involved.", "url": "https://www.straitstimes.com/singapore/no-legal-restraints-on-lee-hsien-yang-returning-to-singapore-police"}