{"authors": ["Goh Yan Han"], "date_download": "2024-10-12 13:53:31", "date_modify": "2024-10-12 13:53:31", "date_publish": "2022-03-03 19:23:22", "description": "Second Minister for Law Edwin Tong said changes will be introduced to make enforcement simpler and more streamlined. Read more at straitstimes.com.", "filename": "singapore_politics_budget-debate-2022-courts-to-get-more-power-to-ensure-compliance-to-orders-in-civil-disputes_1728741211.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/03/yq-statecourt-03032022.jpg?VersionId=nFw85WXGdxt.3CNw3zNZ4MHKAcC4Y_9X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_budget-debate-2022-courts-to-get-more-power-to-ensure-compliance-to-orders-in-civil-disputes_1728741211.html", "title": "Budget debate: Courts to get more power to ensure compliance to orders in civil disputes", "title_page": "Budget debate: Courts to get more power to ensure compliance to orders in civil disputes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The courts will be given more powers to ensure that its judgments in civil proceedings are enforced, following feedback that some cases require a disproportionate amount of time, effort and cost to ensure compliance.\nDuring the debate on his ministry's budget on Thursday (March 3), Second Minister for Law Edwin Tong said that changes will be introduced to make enforcement simpler and more streamlined.\nThese include introducing new powers to punish and disincentivise non-compliance with court orders, as well as enhanced powers to track and trace the assets of debtors who still fail to comply with the judgment.\n\"These are complex changes and we are studying the options and will engage stakeholders, gather feedback and fine-tune some of the proposals that we have in mind. We'll provide more details in due course,\" said Mr Tong.\nSmall and medium-sized enterprises and litigants-in-person, in particular, will benefit from these changes, he added. Litigants-in- person refer to those who represent themselves in court proceedings.\nMr Sitoh Yih Pin (Potong Pasir) had asked about enforcement of court orders following prolonged litigation, requiring further time and resources.\nMr Tong said the ministry had also received feedback that the time, effort and costs of enforcing a judgment in some cases, particularly lower-value judgments, can be disproportionate to the judgment sum.\nThe proposals are also intended to apply to orders by the Employment Claims Tribunals, he said.\nThe ministry is also looking into enhancing the process of enforcing payment of maintenance orders, said Mr Tong.\nOne example is providing financial support to a former spouse after divorce. He said: \"We will empower the courts to question parties and obtain the information directly. This facilitates a simpler and more efficient process, and really gets to the crux of the issues directly. These are the issues that matter.\"\nThe ministry is also considering additional enforcement mechanisms to strengthen compliance of maintenance orders, which was a suggestion made by Dr Tan Wu Meng (Jurong GRC).\nThe Law Ministry has also been working with the Ministry of Social and Family Development and Family Justice Courts to implement the recommendations of the Committee to Review and Enhance Reforms in the Family Justice System, said Mr Tong.\nThe recommendations were submitted to and accepted by the Government in 2020, and included suggestions to help strengthen the existing family justice system, reduce acrimonious disputes and achieve more positive family outcomes.\nMr Tong said on Thursday that legislative amendments are expected later in 2022.\nIn the area of community disputes, Mr Tong noted that the inter-agency committee comprising the Ministry of Culture, Community and Youth (MCCY), Ministry of National Development (MND), Ministry of Law and Ministry of Home Affairs had been working on a holistic review of the Community Dispute Management Framework and had made progress.\nThe committee is looking at proposals to enhance upstream measures to reduce the occurrence of disputes, and how to enhance the current framework to promote an amicable resolution, he said. These include measures such as mandatory mediation in suitable cases and having an appropriate response protocol to address disputes quickly and effectively.\nMore details will be announced in the debate on the budgets for MCCY and MND.\nTo reduce the amount of unclaimed Central Provident Fund (CPF) monies held by the Public Trustee, Mr Tong said that the claims process is being simplified through the beneficiary representative approach, which applies to about half of all un-nominated CPF monies cases handled by the Public Trustee annually.\nThe approach will be implemented by the second quarter of 2022 and allow an eligible beneficiary to represent all beneficiaries for cases up to $10,000 and halve disbursement time from between three and six months, to one to three months.\nThe ministry is also planning to review the monetary limit for cases to qualify under this approach - potentially extending it to a larger group of cases, said Mr Tong.\nIn his speech, Mr Tong also responded to two proposals from Mr Murali Pillai (Bukit Batok) and Mr Vikram Nair (Sembawang GRC) on legal aid.\nMr Murali had proposed reviewing the means test limit for the public to receive legal aid, to which Mr Tong said that it had been less than three years since the criteria was revised and it should be allowed to run for a period of time.\nMr Nair had asked, for those who lack resources but may not qualify for legal aid, if \"no win, no fee\" agreements could be extended to domestic litigation and include damages-based awards.\nParliament had passed an amendment to the law in January to permit such Condition Fee Agreements (CFA) in international and domestic arbitration proceedings, and certain proceedings in the Singapore International Commercial Court.\nThe ministry is studying extending CFAs to more categories, but such domestic proceedings are likely to involve more vulnerable litigants and hence needs to be approached carefully, said Mr Tong.", "url": "https://www.straitstimes.com/singapore/politics/budget-debate-2022-courts-to-get-more-power-to-ensure-compliance-to-orders-in-civil-disputes"}