{"authors": ["Audrey Tan"], "date_download": "2024-10-12 13:48:26", "date_modify": "2024-10-12 13:48:26", "date_publish": "2024-04-17 20:25:00", "description": "Private sector finance could help narrow the funding gap for solutions to deal with climate impacts. Read more at straitstimes.com.", "filename": "singapore_with-some-climate-impacts-irreversible-investing-in-climate-resilience-could-pay-off-panel_1728740906.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/17/FILES-US-CLIMATE-FIRE-COP28-UN-UAE-012446.jpg?VersionId=MKLFirbCNCPnCDxXMTcFS.p4q0.RwhSP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_with-some-climate-impacts-irreversible-investing-in-climate-resilience-could-pay-off-panel_1728740906.html", "title": "With some climate impacts irreversible, investing in climate resilience could pay off: Panel", "title_page": "With some climate impacts irreversible, investing in climate resilience could pay off: Panel | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Initiatives that protect communities from climate change impacts, such as building seawalls to keep out rising sea levels, are often funded by governments.\nBut panellists at a sustainability conference on April 17 said there is a business case to be made for private sector involvement as well.\nPointing to the latest assessment report by the UN’s Intergovernmental Panel on Climate Change, which had warned that certain climate impacts were now irreversible, Mr Jay Koh, co-founder and managing director of investment firm Lightsmith Group, said reports such as this should give investors certainty in putting money into solutions that will improve the resilience of communities.\nCompared with other assumptions, such as the path of interest rates, inflation and consumer behaviour, there is greater certainty around the near-term trajectory of climate change and the demand drivers for climate resilience.\n“These are things we can plan against and invest around,” he said. “There is a great growth investment opportunity... in the market for climate resilience and adaptation solutions,” said Mr Koh, who is also founder and chair of the Global Adaptation and Resilience Investment Working Group.\nThe working group is a private investor-led initiative that aims to galvanise the private sector to channel more investments into resilience.\nMr Koh was speaking at a panel discussion on how private sector finance can be channelled into climate adaptation during the third and final day of Ecosperity Week, a sustainability conference convened by Singapore’s investment company Temasek.\nProjects that help to cut emissions, such as solar or wind farms, tend to attract more funding than projects that aim to help communities adapt to climate change, like building seawalls or investing in agriculture. The UN estimates that the current adaptation finance gap is US$194 billion (S$264 billion) to US$366 billion per year.\nMs Marisa Drew, chief sustainability officer at Standard Chartered Bank, said that defining the commercial opportunities involved in financing adaptation is key to getting the private sector involved.\n“Because we are private sector actors, we’re here to make a return,” she said.\nShe added that case studies are valuable in helping firms grasp the opportunities involved in the space.\n“Often, we talk about these things in a very big-picture way. But if we have proof points, your investments that are proving out the return or the project that worked... (we can say) here’s a good one. Copy it. And... that’s when you start to see that scaling effect start to take hold,” said Ms Drew.\nMr Koh said the list of climate hazards that scientists have warned about can serve as “shopping lists” for technologies and solutions to deal with these challenges.\nHe cited one solution his firm will soon announce that it is funding: an artificial intelligence company that analyses satellite imagery for vegetation management for utilities.\n“Sparking from power lines, globally, is what causes the giant wildfires we are seeing in the United States, Australia and other countries where vegetation, trees, shrubs, grasses encroach too much on the transmission distribution lines,” he said.\nCurrently, managing this threat is done manually, Mr Koh said, with one group of workers identifying trees growing too close to the power lines, and another group coming in to trim the limbs that are getting too close.\n“However, this is not a scalable strategy with the acceleration (of climate impacts) that we’re seeing now in heat events, weather events, and the kind of wildfire risks that we have,” he said.\n“But now we have applications of technology, artificial intelligence, and satellite and drone imagery to enable over 40 utilities today to manage that risk in a much more efficient way,” Mr Koh said.\nThe session was moderated by Mr Dave Sivaprasad, managing director and partner at management consultancy Boston Consulting Group, and featured as panellists Mr Koh, Ms Drew and two other speakers.\nThe two other speakers were Mr Tom Moody, regional director for South-east Asia, climate and energy at the British government’s Foreign, Commonwealth and Development Office, and Mr Lubomir Varbanov, managing director and head of public sector solutions for the Asia-Pacific at reinsurance giant Swiss Re​.", "url": "https://www.straitstimes.com/singapore/with-some-climate-impacts-irreversible-investing-in-climate-resilience-could-pay-off-panel"}