{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:17:30", "date_modify": "2024-10-12 14:17:30", "date_publish": "2023-08-31 12:00:00", "description": "SINGAPORE - Car buyers are gradually but surely warming to electric vehicles (EV), with one in five new cars registered in July being battery-powered models. Read more at straitstimes.com.", "filename": "singapore_transport_ev-share-of-new-car-sales-in-singapore-crosses-20-in-july-led-by-byd-tesla-bmw_1728742650.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/31/2023062799507387snapseed.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_ev-share-of-new-car-sales-in-singapore-crosses-20-in-july-led-by-byd-tesla-bmw_1728742650.html", "title": "EV share of new car sales in Singapore crosses 20% in July, led by BYD, Tesla, BMW", "title_page": "EV share of new car sales in Singapore crosses 20% in July, led by BYD, Tesla, BMW | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Car buyers are gradually but surely warming to electric vehicles (EV), with one in five new cars registered in July being battery-powered models.\nAccording to Land Transport Authority (LTA) figures, 486 new electric cars were registered in July, accounting for 20.4 per cent of the 2,382 passenger cars put on the road that month.\nThis compared with a share of 18.5 per cent in June, and 11.7 per cent at the end of 2022.\nThe latest tally brings the share of EVs in the first seven months of the year to 15.2 per cent, or 2,378 cars. In the first six months, the EV share was 14.3 per cent (1,892 cars) – up from 13.4 per cent (1,462 cars) in the January to May period.\nJuly’s spurt was spearheaded by BYD, Tesla and BMW.\nFor the seven months, BYD, Tesla and BMW registered 474, 451 and 400 cars, respectively, to become the three best-selling electric brands. Mercedes-Benz followed at a distance with 249 cars, and Hyundai with 200.\nRanked by country, German EV brands led the way, with a share of 36.2 per cent, or 861 cars, followed by Chinese brands with 23.4 per cent, or 577 cars, and American makers with 19 per cent, or 451 cars.\nThis may change.\nDr Zafar Momin, an adjunct associate professor at the National University of Singapore Business School and a former automotive expert at Boston Consulting Group, said: “The Chinese will eventually lead because they are furthest ahead in EV market development.\n“The Japanese, depending on whether they do create superior batteries, will slowly but surely join the top three as they are the leading mass market carmakers.”\nObservers said uncertainty over the status of EV tax breaks may have fuelled the sharp uptake in registration of electric models in July.\nFor instance, the EV Early Adoption Incentive – which gives a rebate of 45 per cent off the Additional Registration Fee, capped at $20,000 – is due to end on Dec 31, 2023. Rebates in the revised Vehicular Emissions Scheme have not yet been spelt out.\nIndustry players however, expect the authorities to pare down monetary enticements to encourage EV adoption – just like they had done for commercial vehicles.\nAs at April, incentives for cleaner commercial vehicles were halved to $15,000 for those that meet criteria for Band A emissions, and $5,000 for those meeting criteria for Band B.\nSingapore University of Social Sciences associate professor Walter Theseira reckons that EV adoption is currently held back because Japanese makers do not have a range of products, and family-oriented options such as seven-seaters are not yet widely available.\n“It is more realistic to see a potential tipping point closer to the latter half of this decade, when we will have more COEs (certificates of entitlement), and prices are expected to fall. And based on current progress in battery technology, we also expect to see substantial improvements in range, charging speed and cost,” he said.\n“We also expect Japanese carmakers to have more credible electric models by then. And the Chinese EV brands should have more established reputations, too.”\nBut Prof Theseira added that the tipping point may not happen if all these factors do not fall in place during the COE supply boom years of 2025 to 2029, when “the majority of car owners will replace their cars”.\nAs at end-July, there were 8,873 electric cars on the road, accounting for merely 1.4 per cent of the passenger car population of 650,323, according to LTA figures.\nTogether with other vehicle types, there were 12,733 EVs here at end-July, or 1.3 per cent of the total vehicle population of 968,537.", "url": "https://www.straitstimes.com/singapore/transport/ev-share-of-new-car-sales-in-singapore-crosses-20-in-july-led-by-byd-tesla-bmw"}