{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:49:04", "date_modify": "2024-10-12 13:49:04", "date_publish": "2023-12-10 19:45:00", "description": "Finance for adaptation to climate change continues to be lacking for many countries.  Read more at straitstimes.com.", "filename": "singapore_mixed-use-coastal-protection-infrastructure-may-attract-private-finance-s-pore-panellist-at-cop28_1728740944.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/10/yaohui-pixgeneric-8287.jpg?h=b78aa5f0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_mixed-use-coastal-protection-infrastructure-may-attract-private-finance-s-pore-panellist-at-cop28_1728740944.html", "title": "Mixed-use coastal protection infrastructure may attract private finance: S’pore panellist at COP28", "title_page": "Mixed-use coastal protection infrastructure may attract private finance: S’pore panellist at COP28 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI – Ensuring that coastal protection infrastructure is multi-functional can be a way to attract private-sector investments for adaptation, which will help countries to build resilience against climate change, said a Singapore expert on the sidelines of the United Nations COP28 climate talks.\n“So you’re not just building a wall... to defend against the tracts of the sea, but you layer it with other opportunities for financial returns, (such as having) mixed-use developments,” said Mr James Lam, the coastal engineering director of infrastructure consultancy Surbana Jurong.\nThe suggestion comes as climate finance for adaptation continues to be lacking. Many countries will not have the resources to cope with the worsening impact of climate change.\nThe Adaptation Gap Report published in October stated that additional adaptation finance of between US$194 billion (S$260 billion) and US$366 billion a year is needed by 2030.\nFinance sources come from international public finance, countries’ domestic expenditure and private finance. It has been challenging to garner private finance to fund adaptation projects as these are often not profitable.\nThe proposed Long Island project, which will be reclaimed off East Coast Park, will not only serve as Singapore’s response to the threat of rising sea levels and inland flooding, but also create up to 60,000 new homes, which will be a mix of both public and private housing.\nThe sea level around Singapore is expected to rise by 1m by the end of the century. When coupled with high tides and storms, this could make the Republic vulnerable to heavy flooding.\nMr Lam said during a panel discussion on Dec 9 at the Singapore Pavilion of the COP28 summit: “Unfortunately, adaptation doesn’t attract as much finance because the returns (on investments) are the prevention of losses. And prevention of losses is something you don’t see until the loss actually happens.”\nMulti-functional coastal protection solutions that Singapore has adopted could be viable for other cities to attract private-sector finance, he added.\nThe panel discussion was titled Adapting To Climate Impacts: Building Resilience Against Extreme Weather Events And Sea Level Rise. It was moderated by urban climate professor Winston Chow from the Singapore Management University.\nTo ensure more adaptation finance is given to rural communities to protect them from sea-level rise, some revenue from carbon projects involving nature-based solutions, like the planting of mangroves, can be directed to adaptation, said Mr Lam.\nMangroves are not only coastal guardians against sea-level rise, but also huge stores of carbon dioxide, trapping the planet-warming gas in their roots.\nThe other panellists were Ms Hazel Khoo, national water agency PUB’s director of coastal protection; Ms Meike van Ginneken, water envoy for the Netherlands; and Mr Takahiro Konami, director of international affairs office at Japan’s Ministry of Land, Infrastructure, Transport and Tourism.\nMs van Ginneken pointed to the latest figures by the Organisation for Economic Cooperation and Development, which found that only 9 per cent of private finance has gone to adaptation.\nShe suggested that the bulk of public finance be channelled to more adaptation projects, and for private finance to be used for renewable energy, which helps to mitigate climate change.\nThe Monetary Authority of Singapore (MAS) had launched a US$5 billion blended finance initiative to channel finance to projects that would otherwise not be profitable, such as those in clean energy, nature-based solutions, and waste and water management.\nMAS told The Straits Times that the Financing Asia’s Transition Partnership is “not precluded” from investing in climate adaptation projects if it meets the risk-return and climate-impact criteria for the investment themes under the partnership.\nMs Khoo said multi-functional coastal protection solutions also enable Singapore to optimise its space constraints.\n“Beyond that, we also want to see whether we can employ nature-based solutions that can be incorporated with engineering measures so that we can enhance our marine biodiversity and natural development at the same time,” she added.\nSingapore is conducting eight islandwide site-specific studies of its coastlines to determine the most suitable coastal protection solutions for each segment.\nAsked whether Singapore has plans for coastal infrastructure at each of the coastlines, Ms Khoo said: “There are a lot of opportunities for hybrid solutions, but I wouldn’t say that at this point in time, we will be able to nail down specifically what works at each segment of the coastline.\n“We are learning a lot from other countries, we have learnt from Japan and we want to see what they have done there to inspire us to similarly think about the type of approach towards nature-based solutions.”", "url": "https://www.straitstimes.com/singapore/mixed-use-coastal-protection-infrastructure-may-attract-private-finance-s-pore-panellist-at-cop28"}