{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:56:36", "date_modify": "2024-10-12 13:56:36", "date_publish": "2023-09-11 12:24:00", "description": "Phoon Chiu Yoke was convicted of four charges in August after a trial. Read more at straitstimes.com.", "filename": "singapore_courts-crime_second-jail-term-for-badge-lady-over-offences-including-failing-to-wear-mask-in-orchard-road_1728741396.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/11/AC1I321020copy.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_second-jail-term-for-badge-lady-over-offences-including-failing-to-wear-mask-in-orchard-road_1728741396.html", "title": "Second jail term for ‘Badge Lady’ over offences including failing to wear mask", "title_page": "Second jail term for ‘Badge Lady’ over offences including failing to wear mask | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Phoon Chiu Yoke, better known as “Badge Lady”, was sentenced to nine weeks’ jail and a fine of $3,000 on Monday, for offences that included repeatedly failing to wear a mask in Orchard Road amid the Covid-19 pandemic in 2022.\nThis will be her second stint behind bars over similar offences, as she was earlier sentenced to 16 weeks’ jail in September 2021.\nThe latest offences were committed after her release from jail.\nDeputy Public Prosecutor Heershan Kaur had urged the court on Monday to sentence Phoon to between eight and 14 weeks’ jail, and a fine of between $2,000 and $3,000.\nThe prosecutor said Phoon was a serial offender who had committed the acts in 2022 when the Covid-19 pandemic was still rife.\nStressing that the offender cannot be allowed to make a mockery of the measures to deal with the pandemic, the prosecutor said: “(Her) cavalier attitude towards Covid-19 was appalling.”\nPhoon, 56, who had served 12 years in the Republic of Singapore Navy as one of its pioneer female naval commanding officers and was not represented by a lawyer in court, pleaded for a fine. She told the judge that there was no need for a deterrent sentence, and added: “The offences are no longer offences today.”\nWithout revealing details, she said she was medically unfit to be in prison and that her earlier duties with the Singapore Armed Forces should be taken into consideration. Phoon also said that she had a clean record while serving the navy.\nBefore handing down the sentence, District Judge Tan Jen Tse noted that Phoon was a recalcitrant offender. He also found that she was unremorseful and unrepentant. “She had not learnt her lesson,” he added.\nFollowing a trial, the judge had convicted her on Aug 11, 2023, of three charges under the Covid-19 (Temporary Measures) Act and one charge under the Infectious Diseases Act.\nPhoon was not wearing a mask at the Mandarin Gallery in Orchard Road from 3.02pm to 3.04pm on March 6, 2022.\nShe committed a similar offence while walking past a Victoria’s Secret shop in Orchard Road between 3.35pm and 3.37pm the same day.\nWearing a mask outdoors became optional in Singapore only from March 29, 2022.\nOn Aug 16, 2022, Phoon again failed to don a mask while walking within Ion Orchard shopping mall.\nMask-wearing indoors in places such as malls was made optional only from Aug 29, 2022.\nShortly before her conviction in August 2023, Phoon said there was no longer a requirement to wear a mask, and questioned the need for prosecution. She said then: “If the section (in the Covid-19 [Temporary Measures] Act 2020) has been revoked, then why are we sitting here discussing an offence that is no longer an offence?\n“It comes across as being very vindictive, it comes across as getting back (at) this person, looking for the slightest problem.”\nDPP Kaur, however, stressed that the acts were chargeable offences at the times when Phoon failed to wear a mask in public.\nSeparately, Phoon had failed to attend an interview for an investigation by the Singapore Tourism Board (STB) regarding a mask-related offence.\nShe did not comply with the first two orders on March 19 and 23, 2022, and she made a police report on March 24, 2022, accusing someone of impersonating STB officers.\nOn the same day she made the police report, STB’s investigation officers explained to Phoon what their powers were and showed her their badges.\nPhoon then suggested going to STB on March 31, said the prosecutor. However, she did not turn up or answer the officers’ calls.\nShe had earlier claimed that anybody familiar with the STB would know that it “does not have enforcement powers”, and stated that she had filed the police report as a dutiful citizen.\nShe also cast doubt on the closed-circuit television footage of her not wearing a mask that was submitted as evidence, describing it as “staged” footage that did not verify her identity.", "url": "https://www.straitstimes.com/singapore/courts-crime/second-jail-term-for-badge-lady-over-offences-including-failing-to-wear-mask-in-orchard-road"}