{"authors": ["Andrew Wong"], "date_download": "2024-10-12 13:32:05", "date_modify": "2024-10-12 13:32:05", "date_publish": "2024-01-09 19:45:13", "description": "Details about what the Transport Minister is being investigated for have not yet been released. Read more at straitstimes.com.", "filename": "singapore_politics_cpib-probe-into-iswaran-completed-findings-before-agc-chan-chun-sing_1728739925.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/09/IMGWJ08EFBD819211CK39NTV.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_cpib-probe-into-iswaran-completed-findings-before-agc-chan-chun-sing_1728739925.html", "title": "CPIB probe into Iswaran completed; findings before AGC: Chan Chun Sing", "title_page": "CPIB probe into Iswaran completed; findings before AGC: Chan Chun Sing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Corrupt Practices Investigation Bureau (CPIB) has completed its investigation into Transport Minister S. Iswaran, with the matter now before the Attorney-General’s Chambers (AGC).\nEducation Minister Chan Chun Sing was replying to Progress Singapore Party Non-Constituency MP Hazel Poa, who had requested an update into the ongoing investigations, in Parliament on Jan 9.\nIn a written response on behalf of the Prime Minister, Mr Chan said: “I understand that there is much public interest in this matter. I want to give my assurance that this case will be put through the due legal process.”\nHe said the CPIB has completed a “robust and thorough” investigation, and added that the matter is currently being reviewed by the AGC.\nMr Iswaran was arrested by the graft busters on July 11, 2023. He is currently out on bail.\nIn an interview with The Straits Times and Chinese-language daily Lianhe Zaobao published on Jan 8, National Development Minister Desmond Lee described the corruption probe as a “very worrying development”, adding that the case has had a big impact on West Coast GRC.\nThe group representation constituency consists of five divisions: Ayer Rajah-Gek Poh, Boon Lay, Nanyang, Telok Blangah and West Coast.\nMr Lee oversees the Boon Lay ward, and Mr Iswaran is in charge of the West Coast ward.\nThe corruption probe stems from an earlier unrelated investigation on a separate matter. Further details about what the Transport Minister is being investigated for have not yet been released.\nIn July 2023, Mr Iswaran was instructed by Prime Minister Lee Hsien Loong to take leave of absence until the completion of the investigation.\nMr Iswaran had his monthly pay reduced to $8,500 until further notice, though he continues to draw his MP allowance.\nProperty tycoon Ong Beng Seng was also arrested on July 11 as part of the corruption probe. Mr Ong is the man who brought Formula One to Singapore.\nMr Iswaran was elected into Parliament in 1997 as an MP for West Coast GRC, where he has served for the last 26 years.\nHe was promoted to full minister in the Prime Minister’s Office in 2011, and has held ministerial positions in the ministries of education, home affairs, and communications and information.\nWhile not unprecedented, the ongoing investigations are rare in Singapore’s political landscape.\nThe last time a Cabinet minister was involved in a CPIB probe was in November 1986, when then National Development Minister Teh Cheang Wan was investigated for allegedly accepting bribes.\nTeh died before he could be charged in court.", "url": "https://www.straitstimes.com/singapore/politics/cpib-probe-into-iswaran-completed-findings-before-agc-chan-chun-sing"}