{"authors": ["David Sun"], "date_download": "2024-10-12 13:56:48", "date_modify": "2024-10-12 13:56:48", "date_publish": "2021-05-15 21:56:38", "description": "In a video of the incident, she is seen without a mask while arguing with a safe distancing ambassador. Read more at straitstimes.com.", "filename": "singapore_courts-crime_woman-who-refused-to-wear-mask-at-mbs-being-investigated_1728741408.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/hzmbs0515a.jpg?VersionId=amglbpWYhNbxH23oVMmbgB.MW5.d16vI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_woman-who-refused-to-wear-mask-at-mbs-being-investigated_1728741408.html", "title": "Woman who refused to wear mask at MBS being investigated", "title_page": "Woman who refused to wear mask at MBS being investigated | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A woman who refused to wear a mask at Marina Bay Sands is being investigated by the police.\nIn a statement on Saturday evening (May 15), the police said the 53-year-old woman had allegedly not worn a mask despite numerous requests from a safe distancing ambassador (SDA) to do so.\nThey received a call for assistance at about 5.15pm on Saturday, and are investigating her for public nuisance and breaching safe distancing measures.\nIn a widely circulated video of the incident, the woman is seen without a mask arguing with a safe distancing ambassador, who is trying to convince her to put a mask on.\nThe woman questions the safe distancing ambassador on whether she has a badge and who she represents.\nShe said: \"If you have no badge, why are you asking me to do something? Who are you representing?\"\nWhen the safe distancing ambassador says she represents MBS, the woman replies: \"That's what you say, I can say that I'm a police (officer).\"\nIn the rest of the one-and-a-half-minute video, the safe distancing ambassador repeatedly tries to get the woman to put on a mask to no avail.\nThe woman also repeatedly questions the safe distancing ambassador about a badge.\nAt the end of the video, the woman can be seen clutching a mask which she slides into her pocket.\nThe police said the woman is believed to be involved in other similar instances where she was in various buildings and establishments without a mask on.", "url": "https://www.straitstimes.com/singapore/courts-crime/woman-who-refused-to-wear-mask-at-mbs-being-investigated"}