{"authors": ["Leow Wen Xuan"], "date_download": "2024-10-12 13:39:52", "date_modify": "2024-10-12 13:39:52", "date_publish": "2024-06-03 05:00:00", "description": "To mark World Oceans Day on June 8, The Straits Times dives into ocean exploration and its importance to humanity. Read more at straitstimes.com.", "filename": "singapore_from-cities-of-whale-flesh-to-vents-of-sulphur-and-stone-explore-the-deep-sea-this-world-oceans-day_1728740392.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/03/A20squat20lobster20in20a20coral20garden20on20the20southwestern20flank20of20Rapa20Nui.jpg?VersionId=rReVuESYde8EqcGcyRrYmkUIMijE0G9Q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_from-cities-of-whale-flesh-to-vents-of-sulphur-and-stone-explore-the-deep-sea-this-world-oceans-day_1728740392.html", "title": "From cities of whale flesh to vents of sulphur and stone: Explore the deep sea this World Oceans Day", "title_page": "From cities of whale flesh to vents of sulphur and stone: Explore the deep sea this World Oceans Day | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The deep oceans contain a whole universe of wonders, many precious metals and countless organisms that hold rich potential to combat human diseases.\nWhile humans have never lost their fascination with the deep, World Oceans Day – held annually on June 8 – encourages “collective action for a healthy ocean and a stable climate”.\nAs ocean exploration technology advances, so does humanity’s understanding of the oceans and awareness of threats such as climate change and deep-sea mining that confront the oceans and their inhabitants.\nMost journeys to the depths of the oceans have been undertaken by research institutions in places such as the eastern Pacific and the Atlantic oceans. But now, there is growing interest in the depths of South-east Asia’s seas.\nTo gain a deeper understanding of the region’s rich biodiversity, ocean exploration non-profit OceanX has embarked on a series of expeditions via its research vessel, OceanXplorer.\nThe vessel departed Singapore in May to begin its mission in Indonesia to study the archipelago’s fishes, hydrothermal vents and underwater mountains.\nResearchers from the National University of Singapore have also sought to uncover the mysteries of the deep sea through expeditions to the Indian and Pacific oceans.\nTo mark World Oceans Day, The Straits Times dives into underwater exploration, and the importance of learning what lies beneath.\nPotential of the deep sea\nOver millions of years, marine organisms in the deep sea have evolved to produce compounds that can defend themselves from harmful bacteria and fungi, which can be useful for fighting human diseases.\nFor instance, the first anti-leukaemia drug was developed from two chemicals found in sea sponges. These chemicals are also used to treat patients with the human immunodeficiency virus.\nA green fluorescent protein produced by the jellyfish Aequorea victoria has helped scientists to illuminate growing cancer tumours and what happens to neurons in Alzheimer’s disease.\nValuable metals such as copper, gold, silver and zinc have also been found surrounding hydrothermal vents – fissures on the sea floor that spew toxic gases, fluids and sulphur compounds – attracting the interest of deep-sea mining companies.\nDespite the toxic environment, hundreds of animal species thrive around these vents. For instance, giant tubeworms over 2m in length were discovered growing in clusters around the vents.\nWhat humans have discovered so far is just the tip of the iceberg – 80 per cent of the world’s oceans still remain unexplored.\nIt is difficult to protect what is unknown. Only an estimated 8 per cent of the world’s oceans has been established as marine protected areas – areas in the ocean where intrusive human activities such as fishing and mining are legally limited, but research activities are allowed.\nTo define where to place these limits and to expand the protection of the seas, scientists are racing to find out what lives in the deep sea and the environmental impacts of human activities on the oceans.\nOceanXplorer’s aim with its expeditions in Indonesian waters is to better understand the marine life of South-east Asia.\nThe region has one of the world’s most diverse fish populations, which thrive in nutrient-rich seagrass beds and coral reefs that are at risk of disappearing due to the rapid rise in sea temperatures.\nThe vessel was designed to study areas that are difficult to access, including hydrothermal vent sites and underwater mountains. It is equipped with cutting-edge technology, such as a remotely operated vehicle that can study waters up to 6,000m in depth.\nLocally, researchers from NUS and the Indonesian Institute of Sciences’ Research Centre for Oceanography in 2018 explored Indonesia’s seas off West Java, uncovering 27 new species.\nIn 2020, nine researchers from the university went on a 37-day expedition to explore the Clarion-Clipperton Zone, an understudied area in the Pacific Ocean that holds a large amount of commercially valuable metals such as manganese, cobalt, nickel, copper and rare earth elements.\nThe team discovered three species that are potentially new to science, including a deep-sea sponge, some isopod crustaceans, as well as a unique type of Foraminifera – a group of microscopic organisms with shells.\nOverseas ocean research institutions such as Schmidt Ocean Institute have also played key roles in deep-sea exploration.\nWhile exploring the Salas y Gomez ridge – a 2,900km long underwater mountain range that extends off the coast of Chile – in 2024, researchers from the institute found pristine ecosystems such as glass sponge gardens and deep-sea coral reefs, as well as the deepest-known photosynthesis-dependent animal in the world, the wrinkle coral.\nFrom 2018 to 2024, the Woods Hole Oceanographic Institution led expeditions to the Atlantic and Pacific oceans to learn about the twilight zone, an under-explored layer of the ocean that lies 200m to 1,000m below the surface, and the environmental impacts of extracting resources from this zone.\nThe data they collected suggests that the expansion of commercial fishing into the twilight zone could deplete a critical food source for tuna, swordfish and other commercially important fish.\nDuring these expeditions, the Woods Hole scientists also studied the diel vertical migration – earth’s largest migration in which trillions of organisms move from the twilight zone to the surface each night to feed on plankton and return to the deep at sunrise.\nThis was for the purpose of learning how the migration helps with regulating climate change.\nGiant squids and cities of whale flesh\nIn the abyss, creatures have to adapt to extreme conditions such as immense pressure and complete darkness.\nCreatures such as the giant squid grow to enormous sizes to withstand pressure that can crush a submarine.\nSome thrive under pressure like the blobfish, which relies on the pressure of the deep sea to hold its shape together. When pulled up to the surface, it collapses into a frowning pile of mush, earning it the title of World’s Ugliest Animal in 2013.\nCreatures of the deep have also evolved to make use of light in the darkness. Jellyfish such as comb jellies produce bright flashes to startle a predator. Others such as siphonophores release thousands of glowing particles into the water to mimic small plankton, confusing predators.\nOther fascinating sights at the bottom of the ocean include dead whales, whose flesh support entire ecosystems and act as major carbon sinks.\nAfter a whale dies and sinks to the sea floor, its body turns into a “city” of sorts, hosting many other creatures of the deep. The different stages in the decomposition of the whale support a succession of marine biological communities, from flesh-eating scavengers to bone-dissolving zombie worms.\nIn this way, the carbon that whales accumulate throughout their long lifespans and in their enormous bodies is transferred to the deep sea as they decay.\nOver its lifetime, a whale can capture an average of 33 tonnes of carbon from eating large quantities of carbon-rich krill, preventing a significant amount of carbon dioxide from entering the atmosphere and trapping heat for centuries or more.", "url": "https://www.straitstimes.com/singapore/from-cities-of-whale-flesh-to-vents-of-sulphur-and-stone-explore-the-deep-sea-this-world-oceans-day"}