{"authors": ["Justin Ong"], "date_download": "2024-10-12 13:48:57", "date_modify": "2024-10-12 13:48:57", "date_publish": "2021-10-04 23:21:02", "description": "Bill was passed with 75 MPs saying \"yes\", 11 from the WP and PSP objecting, and two NMPs abstaining.   Read more at straitstimes.com.", "filename": "singapore_politics_singapore-passes-law-to-counter-foreign-interference-after-10-hour-parliament_1728740937.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/10/04/dw-fica-passed-211004.jpg?VersionId=As3J4KG0T2KI7xCPyyzRguoML0lAIk1X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_singapore-passes-law-to-counter-foreign-interference-after-10-hour-parliament_1728740937.html", "title": "Singapore passes law to counter foreign interference after 10-hour Parliament debate", "title_page": "Singapore passes law to counter foreign interference after 10-hour Parliament debate | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A law against foreign interference was on Monday (Oct 4) passed by Singapore's Parliament after a 10-hour airing in the House, three years after it was first raised and three weeks after the extensive, hotly debated legislation was tabled.\n\"This Bill is intended to address a serious threat that concerns our national security and sovereignty,\" said Law and Home Affairs Minister K. Shanmugam.\n\"And these are important to ensure that Singaporeans continue to make our own choices on how we should govern our country and live our lives.\"\nThe Foreign Interference (Countermeasures) Act, or Fica, aims to tackle foreign meddling in domestic politics conducted through hostile information campaigns and the use of local proxies.\nDuring the debate, 16 MPs from both sides of the aisle surfaced criticisms and concerns raised by lawyers, experts and civil society activists in recent days, including over the law's broad language and lack of judicial oversight.\nThese resulted in a parliamentary petition to delay its passage put forward by Non-Constituency MP Leong Mun Wai, a raft of proposed changes tabled by the Workers' Party (WP), and recorded dissent from opposition MPs at the final vote - but the ruling People's Action Party's supermajority meant Fica's passage was a given.\nAt around 11.15pm, the Bill was passed with 75 MPs saying \"yes\", 11 from the WP and Progress Singapore Party objecting, and two Nominated MPs abstaining.\nWP chief Pritam Singh had called for a division in which each MP's vote is recorded.\nSome proposed amendments to the Bill by the WP were accepted by the Government, including to expand the list of defined politically significant persons to include a member of the executive committee or similar governing body of a political party.\nAnother accepted modification was to make it obligatory to publicise the designations of these persons, as well as some stepped-up countermeasures against them.\nThe party had also suggested additional provisions allowing appeals to the court and a public registry of politically significant persons among other changes, which it said would lower the likelihood of abuse of power and lead to greater transparency.\nOther MPs had also suggested for greater checks and balances to be incorporated into the law, citing \"extensive\" discretion granted to the authorities.\nMr Shanmugam agreed that while executive powers must be subject to checks and balances, the questions are in what form and what are the appropriate and best solutions for Singapore's context.\nEarlier, in a speech running more than two hours long to kick off the debate, Mr Shanmugam said Singapore's interracial and inter-religious mix was easily exploitable by foreign actors, who have been steadily building up covert, clever narratives to try an condition Singaporeans' thinking.\n\"In my view, this is one of the most serious threats we face, and our population and I think most MPs are not really aware of this,\" he said.\nWhile international media regularly identifies Russia, China, Iran and North Korea as perpetrators, the United States and other Western countries have similar, or in the case of the US, even superior capabilities, added the minister.\nHe also said foreign interference and the need for legislation have been extensively discussed and debated for more than three years now, dating back to 2018, when a select committee set up to study the issue of fake news gathered detailed evidence on the seriousness of the threat.\nMr Shanmugam also described Fica as offering a more calibrated approach for the Internet age in contrast to blunter levers in other laws, and argued that the risk of rogue foreign interference was far greater than the risk of a rogue government abusing its power.\nHe also noted that the scope of Fica was narrower than that of laws in America and Australia on political activity by foreign persons or entities, and rejected suggestions by the WP to classify senior civil servants as politically significant persons.\nAnd to protect sensitive information, appeals against directions issued should be heard by an independent reviewing tribunal instead of the courts, he said.\nMr Shanmugam also addressed the law's impact on trust in public institutions.\n\"Let's get real… Trust doesn't depend on putting in a series of legislation, just copying other (jurisdictions) whose trust levels are abysmally low.\"\nHigh trust levels in Singapore can be attributed to its performance, probity, leaders' behaviour and exercise of powers, he said, adding that trust would also dissipate quickly in the face of abuse and corruption - particularly in a small place like the Republic.\nThe minister admitted that in the process of drafting Fica with his officers, there were parts he wished had turned out differently.\n\"But the threat we face is people armed with bazookas, and I describe this legislation as a toy gun,\" he said.\n\"Singapore believes in the law, so we give ourselves legal powers. But in reality the kind of threats we face, the kind of adversaries and the resources they have in terms of manpower, are far greater than what we have.\n\"Our people haven't even begun to realise what the problem is, and the nature of the problem.\"", "url": "https://www.straitstimes.com/singapore/politics/singapore-passes-law-to-counter-foreign-interference-after-10-hour-parliament"}