{"authors": ["Toh Yong Chuan"], "date_download": "2024-10-12 14:20:17", "date_modify": "2024-10-12 14:20:17", "date_publish": "2017-11-01 18:24:19", "description": "SINGAPORE - Workers who get injured while on the job will soon find it easier to get back to work thanks to a new \"Return to Work\" programme rolled out by Minister of State for Manpower Sam Tan on Wednesday (Nov 1). Read more at straitstimes.com.", "filename": "singapore_manpower_more-help-for-workers-injured-on-the-job-to-return-to-work_1728742817.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2017/11/01/file6vcayzn6yg210czdp5bc.jpg?VersionId=5uHlM0or.8pGdAs4f8z3EGc3yqP38yBY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_manpower_more-help-for-workers-injured-on-the-job-to-return-to-work_1728742817.html", "title": "More help for workers injured on the job to return to work", "title_page": "More help for workers injured on the job to return to work | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Workers who get injured while on the job will soon find it easier to get back to work.\nPublic hospitals will appoint staff to coordinate with doctors and the injured workers' employers, to help the workers get back on their feet and rejoin the workforce.\nEmployers will also get financial help from the government if they need to modify their premises to accommodate the injured workers.\nThese moves are part of a new \"Return to Work\" programme rolled out by Minister of State for Manpower Sam Tan on Wednesday (Nov 1).\nThe programme will \"provide early intervention\" to ensure that action is taken to support injured workers and their employers, so the workers can recover and return to work as soon as possible, he said.\n\"Injured workers do not have to wait for complete recovery before returning to work,\" he added. \"As long as they are medically stabilised, work can be part of the recovery process as long as work modifications are made to accommodate the injured workers' functional capacity.\"\nDr Sylvia Teo, a principal occupational safety and heath specialist at the Ministry of Manpower (MOM) who is spearheading the programme, said the likelihood of a person returning to work decreases with time, regardless of the cause.\nA 2014 MOM study of 407 local workers who were injured found that about three in four of them eventually returned to work.\nSeven in 10 of those who returned to work did not see any changes to their job scopes, while eight in 10 faced difficulties such as tiredness and lack of support.\nTan Tock Seng Hospital was the first public hospital to deploy trained coordinators to help injured workers in September. A total of 40 such coordinators will be trained and deployed across the seven public hospitals by the end of next year.\nBesides these coordinators, employers can also receive subsidies of up to 90 percent, capped at $1,000 per worker, when they have to make adjustments to workplaces to accommodate their injured workers.\nThey can also claim up to $7,000 per worker if they need to hire consultants to evaluate the workers' recovery and assess whether the workplaces need to be modified.\nThese grants are in addition to the $36,000 in medical expenses that can be claimed for each injured worker under the Work Injury Compensation Act.\nA total of 6,132 workers were injured at work in the first six months of this year, down slightly from 6,203 in the same period last year.\nAmong them, 268 suffered major injuries such as burns and fractures.", "url": "https://www.straitstimes.com/singapore/manpower/more-help-for-workers-injured-on-the-job-to-return-to-work"}