{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:57:39", "date_modify": "2024-10-12 13:57:39", "date_publish": "2023-12-01 19:10:00", "description": "There were 188 newly diagnosed HIV cases from January to October 2023. Read more at straitstimes.com.", "filename": "singapore_health_new-hiv-infections-in-first-10-months-of-2023-up-by-10-but-2022-infection-rate-lowest-in-26-years_1728741459.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/01/ccHIV4023.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_new-hiv-infections-in-first-10-months-of-2023-up-by-10-but-2022-infection-rate-lowest-in-26-years_1728741459.html", "title": "New HIV infections in first 10 months of 2023 up by 10%, but 2022 infection rate lowest in 26 years", "title_page": "New HIV infections in first 10 months of 2023 up by 10%, but 2022 infection rate lowest in 26 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – There was a 10 per cent increase in the number of new human immunodeficiency virus (HIV) infections among Singapore residents in the first 10 months of 2023 compared with the same period in 2022.\nIn an update on Dec 1 on the HIV/Aids situation in Singapore, the Ministry of Health (MOH) said that there were 188 newly diagnosed HIV cases among Singapore citizens and permanent residents from January to October 2023.\nHowever, the overall infection rate – measured in the number of infections per 100,000 residents – in 2022 was five, the lowest since 1996, when the rate was 4.5.\nIn analysing the 104 cases reported from January to June 2023, MOH said that 97 per cent were male. Twenty-eight people among cases analysed were aged between 30 and 39, forming the age group with the most number of cases. Nearly half of the analysed cases – 48 per cent – had late-stage HIV infection at diagnosis. This was 11 per cent lower than in the same period in 2022, noted MOH.\nSexual intercourse remains the main mode of HIV transmission and accounted for 96 per cent of the 104 cases, said MOH.\nHeterosexuals accounted for 28 per cent of these cases, while 68 per cent of the cases were men who have sex with men, including those who reported sexual activity with men and women (4 per cent).\nHowever, the total number of HIV/Aids transmissions through heterosexual sex from 1985 to June 2023 (4,986) is still higher than the combined number of those transmitted through sex between men, and bisexuals (3,993).\nSome 58 per cent of the newly reported cases were detected when they were receiving medical care, while 18 per cent were from voluntary screening, and another 13 per cent were detected via routine screening.\nA greater proportion of those whose infections were detected while receiving medical care had late-stage HIV infection than other modes of detection, MOH said.\nMOH said: “The most effective way to prevent HIV infection is to remain faithful to one’s spouse or partner and to avoid casual sex, or sex with sex workers.\n“Persons engaging in high-risk sexual behaviour, such as having multiple sexual partners or engaging in casual or commercial sex, are strongly advised to use condoms consistently and correctly to reduce their risk of HIV infection and other sexually transmitted infections. In addition, preventive measures like HIV pre-exposure prophylaxis are highly effective when used as part of a comprehensive HIV prevention strategy.”\nThose who take part in high-risk sexual behaviour should go for HIV testing every three to six months, MOH said, and every adult should get tested at least once in their lifetime regardless of risk factors.\n“With early and effective treatment, persons living with HIV can lead lives no different from others. Although there is no cure for HIV, persons living with HIV can be treated with antiretroviral therapy, which is effective at controlling the infection,” said MOH.\nHIV patients who are on regular treatment and have an undetectable viral load have “practically no risk of transmitting the virus to their sexual partners”, MOH noted, with 94 per cent of Singapore residents living with HIV and undergoing treatment having achieved undetectable viral loads.", "url": "https://www.straitstimes.com/singapore/health/new-hiv-infections-in-first-10-months-of-2023-up-by-10-but-2022-infection-rate-lowest-in-26-years"}