{"authors": ["Zhaki Abdullah"], "date_download": "2024-10-12 13:54:47", "date_modify": "2024-10-12 13:54:47", "date_publish": "2024-05-13 05:00:00", "description": "Studies have found chemical repellents to be more effective than natural alternatives. Read more at straitstimes.com.", "filename": "singapore_health_what-should-i-look-out-for-when-choosing-a-mosquito-repellent_1728741287.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/13/WJ2669.jpg?VersionId=ZlZPU6m73x.NmlLIKoKT5W7XqU4i6YNF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_what-should-i-look-out-for-when-choosing-a-mosquito-repellent_1728741287.html", "title": "What should I look out for when choosing a mosquito repellent?", "title_page": "What should I look out for when choosing a mosquito repellent? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Dengue is on the rise in Singapore, with more than 5,000 cases and seven deaths reported in the first quarter of 2024.\nThis is more than double the number of cases during the same period in 2023, according to figures from the National Environment Agency (NEA).\nWith a plethora of both natural and chemical-based products claiming to keep mosquitoes away, what should you look out for when trying to keep yourself or your loved ones safe from dengue?\nSimply Science has a look at what you need to know.\nFirst of all, what attracts mosquitoes to feed on humans?\nMr Leon Tan, an entomologist with pest control firm Ikari Services, said mosquitoes are attracted to humans by a combination of factors ranging from body heat to body odour from sources such as sweat.\n“Mosquito repellents work by creating a barrier that makes it difficult for mosquitoes to detect and land on human skin,” he said, adding that these differ from those targeted at other insects as they are formulated to target the sensory mechanisms and behaviours of mosquitoes.\nMr Tan noted that common repellents contain active ingredients such as diethyltoluamide (Deet), picaridin, or plant-based oils like citronella or eucalyptus.\nMeanwhile, electrical devices such as mosquito traps or zappers use attractants – which range from light to octenol, a chemical contained in human sweat that attracts biting insects – to lure mosquitoes into a trap or kill them upon contact.\nSo what should people look out for when buying mosquito repellents?\nThe most effective repellents typically contain chemicals such as Deet, picaridin or IR3535 as their active ingredients, said Mr Tan, noting that such substances have been proven to provide long-lasting protection against mosquitoes.\nLess effective repellents may contain weak concentrations of these ingredients or use ineffective formulations that do not provide adequate protection, he said.\nMs Jo Lynn Teh, an Entomological Society of America board-certified entomologist, noted that studies have pointed to several reasons why Deet, one of the more widely used chemicals, works to repel mosquitoes.\n“Researchers from Rockefeller University, New York, have studied how insects respond to Deet and found that repellents like Deet confuse the receptors in the insect’s nervous system that process odours. This response masks the odours of our body that normally attracts biting insects,” she said\nMs Teh added that another group from the University of California, Davis, found mosquitoes have olfactory receptor neurons that can detect repellents such as Deet, and avoid it by flying away from the source of the smell.\nWhile concerns have been raised about the safety of Deet, repellents containing the chemical are generally safe if used as directed, said Mr Tan.\nHe pointed to recommendations by the American Academy of Paediatrics that repellents with Deet be applied sparingly and as directed, with concentrations of between 10 per cent and 30 per cent for children above two months old, and up to 50 per cent for adults.\n“Concerns about Deet primarily revolve around potential skin irritation or allergic reactions, as well as safety concerns regarding prolonged or excessive exposure, particularly in children,” he noted.\nMr Tan said that while there have been environmental concerns about Deet entering water bodies through wastewater, it is not “overly toxic” to wildlife such as fish and waterbirds.\nHe added that there is little to no harm of secondary or tertiary consumers being affected, referring to animals that eat other animals that may have consumed Deet.\nSuch concerns about the chemicals used in commercial repellents have led some to seek natural repellents – including those containing ingredients such as citronella or lemongrass oils – as safer alternatives.\nBut are they effective?\nThe NEA website states that studies have shown that repellents containing Deet, picaridin or IR3535 are more effective and have longer mosquito-repelling effects than natural repellents.\nOne study by researchers from New Mexico State University, which was published in the Journal of Insect Science in October 2015, compared commercially available natural repellents against those containing Deet.\nThe study found that while mosquitoes were strongly repelled by all products containing the chemical, the products that used natural repellents showed mixed results.\n“While natural repellents may offer some protection against mosquitoes, their effectiveness and duration of protection may vary compared (with) chemical alternatives like Deet or picaridin,” said Mr Tan.\n“Additionally, natural repellents need to be reapplied more frequently to maintain efficacy,” he said.\nThe least effective products are ultrasonic repellent devices, which purport to use high frequency tones to repel the insects, said Ms Teh.\nWhile these are popularly found on e-commerce sites, studies have disproved their effectiveness, she said, citing the American Mosquito Control Association, which notes on its website that at least 10 studies have “unanimously denounced ultrasonic devices as having no repellency value whatsoever”.\nFogging – where an insecticide designed to kill adult mosquitoes and their larvae is combined with water and sprayed in the air – is one way of controlling the mosquito population in Singapore.\nHowever, this method is not suitable for indoor environments as potentially dangerous fumes are emitted during the process, said Mr Tan.\nAccording to the NEA website, fogging is to be carried out only when there is a mosquito nuisance problem or disease outbreak.\n“Fogging is also not recommended as the only treatment method, as fogging only kills adult mosquitoes present at that time, and also insects that prey on them,” said Mr Tan, adding that these mosquitoes often just fly off to nearby areas while fogging is being conducted.\n“It is better to focus the attention on removing mosquito breeding sources through maintenance and housekeeping, and relying on other more sustainable methods instead,” said Ms Teh.\nShe suggested home owners could also consider installing mosquito screens on their doors and windows, describing it as an effective long-term method.\nOther effective ways of keeping mosquitoes away include wearing long-sleeved clothing and trousers, and avoiding outdoor activities during peak mosquito activity times (dawn and dusk), said Mr Tan.\n“If unsure, it is best to bring in trained pest professionals to ensure that there are no breeding sites and get a customised treatment plan with long-term effectiveness as we have access to professional tools and solutions that are not available to the public,” he added.\nSimply Science is a new fortnightly series looking at the science behind everyday questions.", "url": "https://www.straitstimes.com/singapore/health/what-should-i-look-out-for-when-choosing-a-mosquito-repellent"}