{"authors": ["David Sun"], "date_download": "2024-10-12 13:55:41", "date_modify": "2024-10-12 13:55:41", "date_publish": "2021-08-31 15:15:01", "description": "Numerous dogs suffered under Liew's care and two of them died. Read more at straitstimes.com.", "filename": "singapore_courts-crime_owner-of-platinium-dogs-club-pet-hotel-jailed-for-failing-to-care-for-dogs_1728741341.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/08/31/ak_doggo_210821.jpg?VersionId=D5ZHLZ3YPqI02388sPqSl9yFxLtXVs6s", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_owner-of-platinium-dogs-club-pet-hotel-jailed-for-failing-to-care-for-dogs_1728741341.html", "title": "Owner of Platinium Dogs Club pet hotel jailed for failing to care for dogs", "title_page": "Owner of Platinium Dogs Club pet hotel jailed for failing to care for dogs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The owner of pet hotel Platinium Dogs Club has been jailed and fined for failing to properly care for the animals entrusted to her.\nCharlotte Liew, 33, was jailed for two weeks and fined $35,700 on Tuesday (Aug 31).\nShe pleaded guilty to four charges of failing in her duty to care for the dogs, and one charge each of giving false information, obstructing the course of justice, and registering the business under a different address and her sister's name.\nAnother five charges, which include four for failing in her duty of care for the dogs, were taken into consideration in sentencing.\nLiew has also been banned from running pet-related businesses for a year.\nNumerous dogs suffered under Liew's care and two of them died.\nThe pet hotel operated from January 2018 at a residential house in Bukit Panjang, offering boarding services for dogs.\nBut it was registered only in October that year, under Liew's sister's name, with an address in Woodlands.\nOn Dec 16 that year, a shetland sheepdog named Prince was boarded at the house.\nBut he died sometime between Dec 22 and 24.\nLiew claimed Prince died after being bitten by another dog housed there.\nBut the actual cause of Prince's death could not be determined, as Liew had cremated the dog under a false identity on Dec 24.\nIt was almost a week later when she told the owner Prince had gone missing, ignoring further questions from her.\nThe owner went to look for Liew at the house, even getting down on her knees to plead with her to reveal Prince's whereabouts. But Liew continued to ignore her.\nOn Dec 20 that year, a jack russell terrier named QQ was boarded at the house.\nShe suffered from acute pancreatitis in 2017 and Liew was told she should be fed only special low-fat kibble provided by the owner.\nBut Liew did not ensure this, and had on occasion fed the dog unsuitable food.\nA week later, QQ was on the verge of death and looked skinny, with abrasions on her inner thighs and faeces and urine all over her body and limbs.\nLiew then took her to a vet, where QQ died from acute renal failure a few hours after admission.\nOn Dec 29, the pet boarding house in Bukit Panjang was raided by the authorities following complaints that pets in its care were allegedly mistreated.\nThe then Agri-Food and Veterinary Authority (AVA) found 12 dogs and a rabbit during the raid.\nSome of these animals were leashed to fixtures while others roamed freely.\nUrine and faeces also littered the three floors of the house.\nDogs were found in hot and stuffy rooms without ventilation and water.\nThe day after the raid, a dog named Texas that was boarded at the house escaped through an open gate.\nLiew tried to get him to return, but found Texas aggressive.\nShe gave up after a while and went back to the house without the dog.\nA neighbour who saw this volunteered to help recover him, but Liew rebuffed her.\nLiew made no further attempts to retrieve Texas, and drove away.\nBut the neighbour managed to find the dog and boarded him before returning him to his owner two days later.\nThe AVA subsequently took temporary custody of the animals found at the house.\nOn Tuesday, Liew's lawyer Tang Shangwei said Liew was remorseful and had \"suffered a fair bit as a result of the circumstances\".\nHe said she would have done things differently, in hindsight.\nDeputy Presiding Judge Jennifer Marie said it was important that the sentence sent a strong signal to owners of animal-related businesses that the courts take a dim view of such offences.\nLiew has been given time to pay the fine in instalments.\nIf she fails to pay the fine, she will be jailed for another 11 weeks and two days in default.\nFor each charge of failing in her duty to care for the dogs, she could have been jailed for up to two years and fined $40,000.", "url": "https://www.straitstimes.com/singapore/courts-crime/owner-of-platinium-dogs-club-pet-hotel-jailed-for-failing-to-care-for-dogs"}