{"authors": ["Ng Keng Gene", "Shabana Begum"], "date_download": "2024-10-12 13:48:50", "date_modify": "2024-10-12 13:48:50", "date_publish": "2023-11-28 12:00:00", "description": "Technical studies for the project will be carried out over five years from early 2024. Read more at straitstimes.com.", "filename": "singapore_long-island-to-be-reclaimed-off-east-coast-could-add-800ha-of-land-and-singapore-s-18th-reservoir_1728740930.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/28/rrlongisland2811.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_long-island-to-be-reclaimed-off-east-coast-could-add-800ha-of-land-and-singapore-s-18th-reservoir_1728740930.html", "title": "Long Island to be reclaimed off East Coast could add 800ha of land, create Singapore’s 18th reservoir", "title_page": "Long Island to be reclaimed off East Coast could add 800ha of land, create Singapore’s 18th reservoir | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Three tracts of land could be reclaimed off East Coast Park in the coming decades, creating about 800ha of land for new homes and other amenities, as well as a new reservoir.\nCalled the Long Island, these land tracts – collectively about twice the size of Marina Bay – are Singapore’s response to the threat of rising sea levels and inland flooding in the East Coast area.\nLand in the area is largely lower than 5m above the mean sea level, the extent that sea levels are projected to rise to by the end of this century if extreme high tides coincide with storm surges.\nOn Nov 28, National Development Minister Desmond Lee announced that public agencies will carry out technical studies for the Long Island project over five years, starting from early 2024.\nOver the next few years, members of the public will be consulted for their ideas and suggestions for the project, which will take several decades to plan, design and develop.\nThe current plan is for three elongated tracts of land to be reclaimed in the area, extending from Marina East to Tanah Merah. The easternmost land tract will start from Tanah Merah, while the westernmost tract will be an extension of Marina East. Between these two tracts, a third tract will be reclaimed.\nA large tidal gate and pumping station will be built in between each new land mass. These will control the water level in a new reservoir bordered by East Coast Park and the new land masses, and, in the process, reduce flood risks in the East Coast area.\nNational water agency PUB said the reclamation project is likely to create Singapore’s 18th reservoir.\nLike the gate at Marina Barrage, the two gates at the new reservoir in East Coast will open to release excess storm water into the sea during heavy rain when the tide is low. At high tide, the pumps will be used instead to release the storm water.\nMr Lee said the new reservoir can also be used for water activities such as canoeing and dragon-boating.\nBesides offering flood protection and increasing Singapore’s freshwater supply, the project will help meet future development and recreation needs, said Mr Lee.\nWaterfront homes are expected to be built on the reclaimed land, along with amenities and industrial facilities. About 20km of new coastal and reservoir parks could be added, tripling the length of waterfront parks in the East Coast area, he said.", "url": "https://www.straitstimes.com/singapore/long-island-to-be-reclaimed-off-east-coast-could-add-800ha-of-land-and-singapore-s-18th-reservoir"}