{"authors": ["Ann Williams"], "date_download": "2024-10-12 13:29:59", "date_modify": "2024-10-12 13:29:59", "date_publish": "2018-02-19 16:02:01", "description": "SINGAPORE - A new streamlined grant that makes it easier for smaller firms to get access to funds was among the measures announced by Finance Minister Heng Swee Keat on Monday (Feb 19) to \"foster pervasive innovation\". Read more at straitstimes.com.", "filename": "singapore_singapore-budget-2018-productivity-solutions-grant-among-measures-to-foster-pervasive_1728739799.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/02/19/01-hz-skyline-180219_0.jpg?VersionId=DjCHZ0SBYv58ubrs2eR_CBoQqn3e54PZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-budget-2018-productivity-solutions-grant-among-measures-to-foster-pervasive_1728739799.html", "title": "Singapore Budget 2018: Productivity Solutions Grant among measures to 'foster pervasive innovation'", "title_page": "Singapore Budget 2018: Productivity Solutions Grant among measures to 'foster pervasive innovation' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A new streamlined grant that makes it easier for smaller firms to get access to funds was among the measures announced by Finance Minister Heng Swee Keat on Monday (Feb 19) to \"foster pervasive innovation\".\nThe new Productivity Solutions Grant (PSG) will provide funding for up to 70 per cent of qualifying costs for small and medium-sized enterprises (SMEs) seeking to adopt off-the-shelf technologies with a defined scope, Mr Heng announced in Parliament.\n\"With the rapid pace of change and greater competition, we must make innovation pervasive throughout our economy,\" he said.\nThe new grant, which comes into effect from April 1 this year, follows the Production and Innovation Credit (PIC) scheme which expired this year. The PIC enabled smaller companies to tap cash and tax incentives for adopting technology or innovative processes that raised productivity.\nFor larger companies which need help to innovate and internationalise, the Government will offer a new Enterprise Development Grant (EDG) from the merger of two existing grants run by Spring Singapore and International Enterprise (IE) Singapore.\nThe EDG will provide up to 70 per cent of co-funding for companies to build a range of capabilities. It will be run by Enterprise Singapore, the new agency emerging from the marriage of Spring and IE Singapore.\nMr Heng also announced the launch of a new investment vehicle to help companies turn research into commercial projects . At least $100 million will go into this joint venture.\nTo be launched this year by the National Research Foundation (NRF) and Temasek Holdings, the NRF-Temasek IP Commercialisation Vehicle will draw on Temasek's global investment networks and NRF's local R&D connections to grow companies that draw on IP from publicly-funded research.\nMr Heng also announced the launch of a pilot virtual crowd-sourcing platform to help companies find partners to co-create innovative business solutions. The Open Innovation Platform will match businesses with info-communications and technology (ICT) firms and research institutes.\nTo drive greater adoption of digital technologies, automation and robotics, the government will launch this year the Aviation Transformation Programme and Maritime Transformation Porgramme. Under these, Singapore's airport and seaport will become platforms for companies to develop, test and use new technologies, said Mr Heng.\nThe National Robotics Programme will also be expanded to encourage use of robotics in the built environment sector, especially in construction.\nMr Heng also outlined three tax measures to help companies become more innovative:\n- Increased tax deduction on licensing payments for the commercial use of intellectual property (IP) , a measure which expired with the PIC scheme.\nThe tax deduction in this case has been upped to 200 per cent, capped at $100,000 of licensing payment per year. The cap, said Mr Heng, will ensure smaller businesses benefit more from the rebate.\n- Tax deduction for IP registration fees has been doubled to 200 per cent and capped at $100,000 of fees per year, while the tax deduction for qualifying expenses incurred on R&D done in Singapore will be raised to 250 per cent from 150 per cent.\n- The double tax deduction for internationalisation has been enhanced. The amount of expenses that qualify for this rebate will be raised to $150,000 per year from $100,000, with effect from year of assessment 2019.\nOn the other hand, Mr Heng also raised the threshold for tax deductions for the Start-up Tax Exemption and the Partial Tax Exemption. Tax exemptions for the two broad-based tax schemes will be limited to the first $200,000 of chargeable income (CI), while for start-ups, 75 per cent of their first $100,000 of CI will be exempt from tax, down from 100 per cent. These changes will take effect from Year of Assessment 2020.\nMr Heng said: \"These schemes lower costs for smaller firms and start-ups, but do not directly help firms develop capabilities.\"\nHe said: \"In addition, every profitable company should pay some taxes. This is sound and equitable.\"\nEven with the changes, corporate tax will remain low for start-ups and smaller firms, which can also tap a wide range of government measures for support, he added.\nMr Heng also spoke about the need to build digital capabilities and upskill workers, and laid out a series of measures to do so.\nThey include:\n- A pilot Capability Transfer Programme to support the transfer of skills from foreign specialists to Singaporean trainers and trainees, targeted at plugging gaps in key areas. The Government will release more information on this during the debate on the Ministry for Manpower's spending plans.\n- A new Asean Leadership Programme to help business leaders build networks and plan business expansions in South-east Asian markets.\n- The expansion of the Tech Skills Accelerator into new sectors like manufacturing and professional services, where digital technologies are becoming important. Since the programme was launched in 2016, more than 27,000 training places have been taken up or committed. The programme will also train more people in emerging digital skills like data analytics, artificial intelligence and cybersecurity.\nThe Government will also upgrade the existing Work Trial scheme into a Career Trial programme with more funding for workers to try out new jobs and careers. More details will be provided during the debate of MOM's spending plans.", "url": "https://www.straitstimes.com/singapore/singapore-budget-2018-productivity-solutions-grant-among-measures-to-foster-pervasive"}