{"authors": ["Zhaki Abdullah"], "date_download": "2024-10-12 13:55:06", "date_modify": "2024-10-12 13:55:06", "date_publish": "2024-09-27 19:05:00", "description": "The College of Clinical Pharmacy aims to offer training for 400 pharmacists and pharmacy support staff annually. Read more at straitstimes.com.", "filename": "singapore_health_new-college-to-enhance-training-for-pharmacists-in-singapore_1728741306.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/28/20240927161797102m6a3619.jpg?VersionId=.8TKMC4v7HhQrZVydqJLc33JBTcdQvRJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_new-college-to-enhance-training-for-pharmacists-in-singapore_1728741306.html", "title": "Singapore pharmacists get training boost with opening of new SingHealth college", "title_page": "Singapore pharmacists get training boost with opening of new SingHealth college | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A new institution here aims to meet the training needs of pharmacy professionals in Singapore, amid the country’s rapidly ageing population and an ever-evolving healthcare sector.\nLaunched on Sept 27, the College of Clinical Pharmacy will provide pharmacists here with knowledge in population health, as well as areas such as illness prevention, encouraging wellness and active ageing, in line with the greater emphasis on community-based care.\nIt is the seventh such institute under the SingHealth Academy, the health cluster’s education arm.\nThe academy – which also includes the College of Allied Health and the College of Clinical Nursing – provides education pathways for those in the healthcare sector, from undergraduates to professionals seeking continuing education in healthcare.\nThe College of Clinical Pharmacy will enhance the training and education needs of SingHealth’s pharmacy staff – which includes more than 1,400 pharmacists, pharmacy technicians and pharmacy assistants.\nPharmacy professionals not under SingHealth, both in Singapore and abroad, will also be eligible for training at the college.\nIt will enable SingHealth to almost double its current pharmacy training capacity to 400 pharmacists and pharmacy support staff annually.\n“By sharpening their skills and deepening their understanding of their role in new community-based care models, pharmacists will be better poised to supplement care and extend their roles in areas such as illness prevention, encouraging wellness and active ageing in the community beyond hospital walls,” SingHealth said.\nThe college was launched by Senior Minister of State for Health Janil Puthucheary during the SingHealth Duke-NUS Education Conference 2024, held at the Academia building on the Singapore General Hospital’s (SGH) campus.\nAs Singapore’s population is expected to become super-aged by 2026 – with more than 21 per cent of the population aged 65 or older – there is a need to expand healthcare capacity and enhance the capabilities of the healthcare workforce through technology, said Dr Janil, noting this, in turn, would require that healthcare education standards be enhanced.\nHe pointed to the efforts of the SingHealth Academy, NHG College, under the National Healthcare Group, and the National University of Singapore’s Centre for Medical Education in advancing healthcare education here.\n“In the past year alone, these institutions together have provided comprehensive, impactful training to over 100,000 healthcare and administrative learners through more than 500 diverse programmes,” the minister said.\nMs Petrina Fan, who chairs the new college, said it will enable SingHealth to “build a community of highly competent, dedicated and passionate pharmacy staff to serve our patients”.\nSaid SingHealth group chief pharmacist Lita Chew: “We aim to keep pushing the frontiers of clinical pharmacy and strengthen our capabilities to address current gaps and emerging health challenges both locally and internationally.”\nThe event on Sept 27 also saw 55 healthcare educators receive the Academic Medicine Education Institute Golden Apple Awards, which recognise educators and staff from the SingHealth Duke-NUS Academic Medical Centre for excellence in teaching.\nThey included Dr Jai Rao, head and senior consultant at the department of neurosurgery at SGH’s National Neuroscience Institute, who spearheaded the use of virtual reality (VR) headsets for Duke-NUS Medical School students, allowing them to virtually explore the anatomy of the brain.\nAlso recognised was a team of six nurses from the KK Women’s and Children’s Hospital, led by senior nurse clinician Linda Ang, who created an interactive simulation which prepares nurses to handle medical emergencies in a clinical setting.", "url": "https://www.straitstimes.com/singapore/health/new-college-to-enhance-training-for-pharmacists-in-singapore"}