{"authors": ["Wong Yang"], "date_download": "2024-10-12 13:29:32", "date_modify": "2024-10-12 13:29:32", "date_publish": "2024-08-30 11:00:00", "description": "In recent years, vending machines selling everything from fresh flowers to pet food have popped up across the island. Read more at straitstimes.com.", "filename": "singapore_consumer_online-retailers-turn-to-vending-machines-to-boost-sales-market-themselves-in-singapore_1728739772.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/30/wyvending28.a799140d.Attachment.113050_1.jpg?VersionId=E9yBKrYFUfgWghK4EjTS0rCmXRasySKZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_consumer_online-retailers-turn-to-vending-machines-to-boost-sales-market-themselves-in-singapore_1728739772.html", "title": "Online retailers turn to vending machines to boost sales, market themselves in Singapore", "title_page": "Online retailers turn to vending machines to boost sales, market themselves in Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - When Mr Alvin Lim was thinking about where he should open his first physical store for his range of men’s grooming products, he turned to sales data from his 14 vending machines to help him make a decision.\nHe picked the Tampines 1 shopping mall to open the first bricks-and-mortar store in 2022 for his online business SGPomades, after seeing that his vending machine there had been generating 50 per cent more revenue compared with the others he operated.\nThat decision paid off – after the Tampines 1 store launched, new sign-ups to SGPomades’ rewards programme doubled to about 500 a month.\nIn January, the retailer opened its second physical store selling a range of hair-styling wax and shaving products at Jurong Point.\nMr Lim, 35, told The Straits Times his vending machines have helped increase his brand’s visibility and get consumers familiar with his products. “E-commerce businesses like ours need to establish some kind of credibility, and our vending machines really helped with that,” he said.\nWhere they once used to sell mainly just drinks and snacks, in recent years, vending machines selling everything from fresh flowers to pet food have popped up across the island.\nThat growth is driven partly by online retailers such as SGPomades, which are increasingly tapping vending machines to promote their products, raise brand awareness and gauge market sentiment.\nMr Steve Chia, director of vending machine operator Le Tach Vending, said inquiries from online businesses interested in customising and installing vending machines have gone up by about 20 per cent since 2021.\n“Many e-commerce outfits really grew during Covid-19, so many of them are now thinking of how to grow their brand and produce another source of revenue,” said Mr Chia, 51.\nIncluding machines it leases to other businesses, Le Tach operates close to a thousand vending machines at shopping malls, MRT stations, residential properties and offices, up from about 500 in 2016.\nFor online retailers, buying a new vending machine can cost around $5,000 to $10,000, while renting one can cost between $300 and $800 a month.\nMr Sam Zhiquan, 38, sees his three machines as a way to market his online business selling pet products.\nHe makes a slight loss on his machines every month – monthly rental and location fees cost him between $1,200 and $1,600 per machine – but online sales have doubled after he installed his first machine at Compass One shopping mall last October.\n“I treat my vending machines as more of a marketing tool and less of a profit generator. More pet owners have been promoting my online shop after I installed the machines,” said Mr Sam.\nAnother online retailer, Pitstop Detailz, which sells automotive care products, has five vending machines in carparks across Singapore, with a sixth set to launch in September.\nIts director, Mr Emmanuel Maniam, said the machines have allowed his business, which previously operated on Carousell, to save time spent on packing and sending out orders.\n“After installing our first machine in 2021, we observed considerable demand for such a concept, and customers began using our Carousell page more as a catalogue before coming down to pick the items up from the machines,” the 31-year-old said.\nMr Kegan Tan, director of Spartan Sports, which sells sporting goods online, added that vending machines are a relatively low-cost way for online businesses to have a physical presence.\n“Vending machines became a way for us to create an offline presence that generates traffic to our online store and e-commerce platform pages,” said Mr Tan, 37, who owns three machines that he has rotated among malls, bus stops and residential areas.\nLe Tach’s Mr Chia said vending machines could become a bigger part of the retail scene here.\n“Vending machines used to offer products that are impulse buys. But increasingly we are seeing people go down to vending machines intentionally for things that they need,” he said.\n“This could be the way forward for many businesses, online or offline.”", "url": "https://www.straitstimes.com/singapore/consumer/online-retailers-turn-to-vending-machines-to-boost-sales-market-themselves-in-singapore"}