{"authors": ["Christie Chiu"], "date_download": "2024-10-12 13:46:13", "date_modify": "2024-10-12 13:46:13", "date_publish": "2024-08-08 15:50:00", "description": "He was caught on video shouting when police officers tried to escort him off the premises. Read more at straitstimes.com.", "filename": "singapore_man-25-arrested-for-public-nuisance-in-sim-campus_1728740773.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/hzsim080824.jpg?VersionId=8Cad_WPcSXuTNHTmaxWEbvEV84Cubsvh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_man-25-arrested-for-public-nuisance-in-sim-campus_1728740773.html", "title": "Man, 25, arrested for public nuisance on SIM campus", "title_page": "Man, 25, arrested for public nuisance on SIM campus | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A 25-year-old man was arrested on Aug 6 for public nuisance at the Singapore Institute of Management Global Education (SIM) campus in Clementi.\nThe police said they received a call for assistance at around 3.35pm that day at 461 Clementi Road, where SIM is located.\nIn a video of the arrest posted on Chinese social media platform Xiaohongshu on Aug 7, two police officers are shown holding on to the arms of a man wearing glasses.\nThe incident appears to be taking place during an event and a crowd is watching the officers make the arrest.\nThe man who was arrested can be heard shouting: “You cannot treat me like this! I was a student! I am a student... I’m not leaving!”\nHe is later seen with his hands behind his back while being escorted out of the building by three police officers.\nThe police said that investigations are ongoing.\nIn a media reply, an SIM spokesperson confirmed that the man was one of its students and that he is currently warded at the Institute of Mental Health for further evaluation.", "url": "https://www.straitstimes.com/singapore/man-25-arrested-for-public-nuisance-in-sim-campus"}