{"authors": ["Aqil Hamzah"], "date_download": "2024-10-12 13:59:09", "date_modify": "2024-10-12 13:59:09", "date_publish": "2022-10-15 11:53:03", "description": "Singapore’s director of medical services Kenneth Mak says this is “what we hoped for”. Read more at straitstimes.com.", "filename": "singapore_xbb-subvariant-more-transmissible-but-may-be-less-virulent_1728741549.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/15/rrhospitalbed1510.jpg?VersionId=xLBMbnUBlm_7GViSzpRyC_TrGq6XYf6i", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_xbb-subvariant-more-transmissible-but-may-be-less-virulent_1728741549.html", "title": "XBB sub-variant more transmissible but no severe cases linked to it in S'pore so far", "title_page": "XBB sub-variant more transmissible but no severe cases linked to it in S'pore so far | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - No deaths or severe cases have been linked to the XBB strain of the Omicron variant so far.\nThe sub-variant has been driving up case numbers in Singapore and other parts of the world, with test samples taken a month ago from Covid-19 patients in intensive care units or in need of oxygen supplementation not showing signs of the new strain.\nHowever, only time will tell if these individuals have tested positive for the new sub-variant, with there being a lag time between developing severe symptoms and sequencing to confirm the strain of Covid-19.\nBut although the XBB sub-variant is highly transmissible, Singapore's director of medical services Kenneth Mak said it may be less virulent than prior waves of the virus.\nThis, he added, is \"what we hoped for\".\nAssociate Professor Mak said: \"If we can have a variant that outcompetes all the other variants but, in fact, contributes to less severe infections... that would be a lesser burden on our hospital resources.\"\nThe latest rise reflects a new wave of Covid-19 cases for the Republic, with more than 9,000 reported to the Ministry of Health (MOH) on Friday.\nThe XBB sub-variant accounted for 54 per cent of local cases during the week of Oct 3 to 9.\nThis was an increase from the week prior, when XBB cases made up 22 per cent of local Covid-19 cases.\nThe sub-variant has been detected in countries such as Australia, Bangladesh, Denmark, India, Japan and the United States since August.", "url": "https://www.straitstimes.com/singapore/xbb-subvariant-more-transmissible-but-may-be-less-virulent"}