{"authors": ["Joyce Teo"], "date_download": "2024-10-12 13:56:19", "date_modify": "2024-10-12 13:56:19", "date_publish": "2023-10-08 21:07:00", "description": "It is part of precision medicine, where disease treatment and prevention assess differences in genes and lifestyles. Read more at straitstimes.com.", "filename": "singapore_health_your-genes-can-affect-how-you-react-to-specific-drugs-and-diseases_1728741379.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/08/ST18903.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_your-genes-can-affect-how-you-react-to-specific-drugs-and-diseases_1728741379.html", "title": "Your genes can affect how you react to specific drugs and diseases", "title_page": "Your genes can affect how you react to specific drugs and diseases | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - During a recent routine visit to the endocrine clinic at National University Hospital (NUH), diabetic patient Wesley Tan, 29, was asked by research coordinators if he was keen to join a pilot study that aims to tell individuals ahead of time if a particular drug is unsafe or ineffective for them.\nHe said yes and became one of 122 individuals who signed up for the study. Mr Tan was only 17 when he was diagnosed with Type 2 diabetes, and he had to learn how to give himself insulin injections before meals.\n“I remember doing it at a hawker centre and at the table beside me, a father told his daughter, ‘You better study. If not, next time, you’ll take drugs like this man!’” Mr Tan said.\nHaving to inject insulin about four or five times a day, and go for follow-up checks every three months, he is constantly reminded of the need to take care of his health.\n“There may come a time when I will require medication for any sort of illness that (may come),” he said. High blood sugar levels can lead to various complications such as heart disease, kidney disease, nerve damage and more.\nPilot participants take a test that screens for a panel of genes, to see if they have genetic variants that could lead to a bad reaction to medications commonly used for conditions such as stroke, cancer and depression, or render them less effective or useless.\nThis is a field in precision medicine known as pharmacogenomics (PGx), which looks at how a person’s genes affect the way he reacts or responds to drugs.\nIt is an example of precision medicine, an approach to disease treatment and prevention that takes into account the individual differences in genes, environments and lifestyles.\nSingapore’s drive to use precision medicine is led by Precision Health Research, Singapore (Precise). It was set up in 2021 to coordinate a whole-of-government effort to implement Singapore’s National Precision Medicine strategy.\nThis 10-year precision medicine research road map is now in its second phase.\nThe first phase established a Singaporean reference database containing 10,000 genomes with the SG10K genetic study. One of the findings was that one in four Singaporeans carries a genetic variant that increases the risk of life-threatening side effects from at least one medication.\nIn the second phase, the SG100K study focuses on the influence of genes, environments and lifestyles on a person’s health. It involves five pilots – including the one on PGx, funded by Precise, to determine how best to implement national programmes offering such precision health screenings.\nPhase three, which could start in 2025, would involve many more participants, said Professor Patrick Tan, executive director of Precise.\n“You can expand precision medicine away from the individual to populations as well. And this is where the engagement of efforts such as Healthier SG comes into play,” he said.\nHealthier SG is the recently launched national preventative health programme that aims to pair Singapore residents with a primary care physician, who will help them take charge of their health.\nThe PGx pilot test is currently for the multiple genes that may impact 30 drugs such as codeine (which is used to treat pain), statins, several chemotherapy drugs including mercaptopurine, and antidepressants like amitriptyline, said Dr Elaine Lo, lead pharmacist of the PGx pilot and a principal clinical pharmacist at NUH. More drugs may be added later.\nMr Tan’s pharmacogenomics report, which he can access via an online portal, will be included in the electronic medical record system. In future, if a doctor were to prescribe him a drug that he is allergic to, a notification would be triggered in the system.\nThe pilot will also look into a hotline that doctors can dial to contact a team of trained pharmacists who can provide drug information support.\nProfessor Goh Boon Cher, the clinical co-principal investigator of the PGx pilot, said researchers aim to get 1,000 adult participants from participating institutions such as NUH, the National Cancer Centre Singapore, Alexandra Hospital, Ng Teng Fong General Hospital, Singapore General Hospital and Tan Tock Seng Hospital (TTSH).\nPharmacogenetic guidelines on drug-gene pairs exist elsewhere, but Singapore wants to construct its own, as the research in Western populations is not always applicable to Asian populations, he said.\n“It’s important that we have a local team of experts to curate the data and make sure that it pertains to our population of basically Chinese, Malays and Indians, and various other races,” said Prof Goh, a senior consultant at the National University Cancer Institute, Singapore.\nThe list of drugs in the pilot comes with a story of its own. Mercaptopurine, an oral chemotherapy drug used for treating childhood leukaemia, was long ago found to lead to infections, anaemia and bleeding in some patients.\nResearch by the St Jude Children’s Hospital in the United States showed that it was because these children had a variant of a gene called Thiopurine Methyltransferase, or TPMT.\nIn Singapore, some children treated with the drug became similarly ill, but tests showed that they did not have that variant. “So, for many years, we were wondering, how could that be?” said Prof Goh.\nThe answer came a couple of years ago from a research collaboration between a St Jude team and a local children’s cancer team, he said. They found that one of the children here had a variant of the NUDT15 (nudix hydrolase 15) gene, which also affected the body’s ability to metabolise mercaptopurine. The gene variant is more common among Asians.\nTest results for the pilot study are being processed in a lab at TTSH, currently the only facility that offers multi-gene testing.\nTTSH also recently started offering pre-emptive multi-gene testing services for the public, as long as they are referred by a clinician who can then interpret the results for them, said Dr Goh Liuh Ling, senior principal scientific officer at TTSH’s personalised medicine service. The cost of testing starts from $300, depending on the complexity.\nThe public can also buy direct-to-consumer DNA test kits that screen for pharmacogenetic risk and disease risk, and they can even analyse how a person’s body responds to the nutrients in his diet.\nBut experts warn of risks. For instance, if the kits do not screen for a variant prevalent in the Singapore population, the test results could give a false sense of assurance, Dr Lo said.\n“I think the bottom line is that too much information at one time can be harmful,” Prof Goh said, particularly if people do not know how to act on the information they receive.\nBreast cancer screening based on risk, not age\nAnother study funded by Precise is looking at the feasibility and cost-effectiveness of a risk-based approach to breast cancer screening, to encourage more women to go for screening.\nRecruitment for the BREAst screening Tailored for HEr (Breathe) study has ended, with a total of 4,538 participants.\nSo far, 10 women predicted to be at high risk were found to have breast cancer. One was in the 35-to-39 age group, six were aged between 40 and 49, and three were aged between 50 and 59.\nCurrently, women aged between 50 and 69 are recommended to get a mammogram every two years, while those between 40 and 49 years should get one every year, if advised to do so by a doctor.\nAssociate Professor Mikael Hartman, the study’s clinical co-principal investigator and head of breast surgery at NUH, said: “Instead of using age as a marker of when to start screening mammograms, we are suggesting that we can augment the current screening guidelines by estimating women’s risk and by knowing that risk, we can translate that into an appropriate age to start screening.”\nAs breast cancer is complex, a combination of various methods, including a genetic test, a questionnaire to find out lifestyle and hormonal risk factors, and an analysis of mammographic density can be used to assess a woman’s cancer risk, said Dr Li Jingmei, the study’s scientific co-principal investigator.\n“From the mammography, we can predict the woman’s future risk of getting breast cancer, so that’s another risk factor,” she said.\nThe team is now looking at how to encourage women to go for screening.\nThere have been a lot of developments in the genetic predictive testing space, but not all diseases are suitable for using genetics.\n“Breast cancer is one of those cancers that have higher heritability, (so) using genetics will be a better choice. But if we look at other cancers, which have very low heritability, for example, lung cancer... then using genetics to test doesn’t make so much sense,” said Dr Li.\nHeritability is a measure of how well differences in people’s genes account for differences in their traits, such as eye colour and intelligence, as well as disorders like schizophrenia.\nThe three other pilots funded by Precise include looking at the challenges of clinically implementing genome testing to pick up individuals predisposed to having very high cholesterol levels, which puts them at high risk of having an early heart attack, and those with hereditary cancers or primary glomerular diseases, which affect kidney function.\nAside from the studies funded by Precise, other precision health research projects are happening, such as one at TTSH that aims to predict heart disease in the local population. This study will incorporate PGx, so participants will also receive their drug response results.\nAdjunct Associate Professor Leong Khai Pang, head of TTSH’s personalised medicine service, said: “Imagine that if you do one test, you can get a pharmacogenetic report to see if certain drugs are effective and also find out the risk of a disease. For all the chronic diseases that we see now, I think there could be tests to predict our risk.”\nIn the future, studies could be done to look at one’s genetic predisposition to conditions such as breast cancer, chronic kidney disease and depression, he added.\nThis is just the start. Dr Clive Tan, a founding member of the Precision Public Health Asia Society in Singapore, which was set up to promote precision public health, said: “Although evidence is mounting and practices are changing, it will take years to develop and adopt the technologies, and individual-level behavioural changes en masse.”", "url": "https://www.straitstimes.com/singapore/health/your-genes-can-affect-how-you-react-to-specific-drugs-and-diseases"}