{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 13:40:07", "date_modify": "2024-10-12 13:40:07", "date_publish": "2024-09-10 21:03:46", "description": "After a heated exchange on Sept 9, the issue got another airing at the end of the Platform Workers Bill debate. Read more at straitstimes.com.", "filename": "singapore_politics_pap-wp-mps-clash-for-a-second-day-over-the-ruling-party-s-close-ties-with-ntuc_1728740407.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/Azmi-pixgeneric-2_0.JPG?VersionId=cjXkuug_NqEIInMRptWG1YRosAAC6UxD&h=27eb5b5e", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_pap-wp-mps-clash-for-a-second-day-over-the-ruling-party-s-close-ties-with-ntuc_1728740407.html", "title": "Clash between PAP, WP over ruling party’s close ties with NTUC continues for second day", "title_page": "Clash between PAP, WP over ruling party’s close ties with NTUC continues for second day | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A clash of views over the independence of trade unions in Singapore and the close relationship between the ruling People’s Action Party (PAP) and NTUC got a second airing in Parliament on Sept 10.\nSenior Minister of State for Manpower Koh Poh Koon said in his speech to wrap up the debate on the Platform Workers Bill that the Workers’ Party (WP), in attacking the symbiotic relationship between the PAP and NTUC, seeks to dismantle Singapore’s model of tripartism.\nThis, he added, also indicates the WP is no longer pro-worker.\nHis statements were rejected by Leader of the Opposition Pritam Singh and WP MP Gerald Giam (Aljunied GRC), whose call for Singapore unions to be independent sparked a 30-minute exchange with several PAP MPs on Sept 9.\nIn his speech on Sept 10, Dr Koh cited the Platform Workers Bill, which was passed with unanimous support, as an example of tripartism at work.\nHe credited the close working relationship and trust among the tripartite partners as the reason why the Government was able to craft a Bill that balanced the needs of all parties.\nIn contrast, some overseas jurisdictions had to take a more acrimonious path when regulating platform work, he added.\n“The tripartism that we have in Singapore today, which many other countries want to emulate, only exists because of the close relationship and the mutual respect between the PAP and the NTUC,” Dr Koh said. “You dismantle this. Everything falls apart.”\nHe then accused the WP leadership of wanting to “kill tripartism”, warning that a more adversarial relationship with unions would take its place.\nDr Koh also argued that Mr Giam’s calls for independent, non-partisan unions imply that the WP will not align itself with any unions or develop relationships with unions, and suggested that Mr Giam and the party were “completely ignorant” of the fact that the WP started as a party of unionists.\n“Somehow along the way, they lost the trust and the relationship with the unions. So now, Mr Gerald Giam says, like a bit of a toxic ex-boyfriend, because I can’t have a relationship with unions, no one else should have (it) as well,” said Dr Koh.\nResponding, Mr Giam said it is important for unions to work with the government of the day, but they should maintain their independence and not be subordinated to the government.\nHe cited the International Labour Organisation’s (ILO) Convention Number 87, which gives workers and employers the right to organise without interference from the public authorities.\nSenior Minister of State in the Prime Minister’s Office Desmond Tan, who is also deputy secretary-general of the National Trades Union Congress (NTUC), then rose to ask Mr Giam if he had any personal experience or anecdotes that suggested unions or union leaders faced restrictions due to the symbiotic relationship.\nMr Tan said he had received feedback from union leaders that Mr Giam’s earlier comments on Sept 9 did not represent their experience on the ground. The WP MP had said that an overly close relationship between the PAP and unions risks creating groupthink, where union leaders are less inclined to challenge prevailing policies.\nIn response, Mr Giam said his concerns were about the institutional constraints on unionists. He then asked Mr Tan to cite recent instances where NTUC had taken a public position contrary to government policy.\nTo this, Mr Tan said NTUC has, over the years, been pushing policies the Government has not always accepted. He gave the example of the upcoming SkillsFuture Jobseeker Support scheme, which he said took 14 years of lobbying before it was finally given the nod.\nAt this point, Dr Koh interjected, noting that Singapore, like the US and New Zealand, has not ratified ILO Convention Number 87.\nThis is because the Republic requires unions to be registered, to guard against “yellow unions” that act on behalf of employers to the detriment of workers and ensure union officers have not been convicted of criminal breach of trust, he said.\nDr Koh and Mr Giam traded words on the WP’s history with unions and its approach towards them, before Mr Singh stepped in.\nThe WP chief said his party rejected Dr Koh’s comments “entirely”, adding that the PAP MP had disregarded the fact that the political situation in Singapore has changed dramatically since the WP’s founding in 1957.\n“I would be grateful if the Senior Minister of State can raise a single example where an NTUC secretary-general or a deputy secretary-general has spoken out against a 3G or 4G leader to defend the rights of workers.\n“Now, I am not suggesting that this is the gold standard or the test... But this comes to the heart of what people see and believe to be a conflict of interest,” Mr Singh added.\nDr Koh replied that the debate on the Bill is a “proof point” of how the relationship between the PAP and NTUC has endured for the past 60 years and made the platform workers legislation a possibility today.\nMPs returned to discussing the Bill, before Mr Christopher de Souza (Holland-Bukit Timah GRC) rose to say Mr Giam’s suggestion that the NTUC is subordinate to the PAP’s interests was “completely inaccurate”. He added that the WP was trying to score a political point.\nProgress Singapore Party Non-Constituency MP Leong Mun Wai waded in to speak in support of the WP MPs. He said the issue is that the nature of the relationship between NTUC and the Government is “more than what we have seen in the world today”.\n“If the NTUC secretary-general is a minister, or a former minister, and there are many leaders in the NTUC that come from the ruling party, I think we are entitled to think that the independence of NTUC ought to be better than this,” Mr Leong added.\nThe exchange was brought to a close by Manpower Minister Tan See Leng, who said he felt compelled to intervene.\n“You keep talking about independence, independence, independence. Behind closed doors, the tripartite partners do not always agree. Heated discussions happen behind closed doors on many, many issues. The raising of retirement age or even the upcoming workplace fairness legislation. I am sure we will have another very intense debate,” Dr Tan said.\n“The lack of open confrontation, your so-called being more independent, doesn’t mean that our unions are weak. It shows the power of positive collaboration in delivering results without disruption,” he added.\n“So I hope that you do not judge NTUC or SNEF (Singapore National Employers Federation) by what you think the relationship between unions, employers and the Government should be, but look at the record. Look at the outcomes... that tripartism has delivered for Singapore through the decades,” said Dr Tan.", "url": "https://www.straitstimes.com/singapore/politics/pap-wp-mps-clash-for-a-second-day-over-the-ruling-party-s-close-ties-with-ntuc"}