{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 14:02:59", "date_modify": "2024-10-12 14:02:59", "date_publish": "2023-01-16 10:51:31", "description": "The baby’s current condition was not stated in court documents. Read more at straitstimes.com.", "filename": "singapore_courts-crime_duo-charged-over-alleged-abuse-of-2-month-old-baby-girl-found-with-fractured-skull-in-sembawang-flat_1728741779.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/17/court.jpg?VersionId=KGPq0OKJqFDm3EBx_MH3IFbeKWk69M8Z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_duo-charged-over-alleged-abuse-of-2-month-old-baby-girl-found-with-fractured-skull-in-sembawang-flat_1728741779.html", "title": "Duo charged over alleged abuse of 2-month-old girl found with fractured skull in Sembawang flat", "title_page": "Duo charged over alleged abuse of 2-month-old girl found with fractured skull in Sembawang flat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A man and a woman have been charged over their alleged abuse of a two-month-old baby girl, who was found with a fractured skull.\nCourt documents did not say how they are related to the child, but their names cannot be disclosed due to a gag order to protect her identity.\nThe baby girl’s current condition was also not stated in the documents.\nThe man, aged 31, was charged on Saturday with an offence under the Children and Young Persons Act.\nHe allegedly caused unnecessary injury to the infant by slapping her face in a Sembawang flat at around 1.30am on Jan 5.\nThe woman, aged 29, allegedly caused grievous hurt to the baby three days later in the same block of flats but in a different unit.\nShe is accused of forcefully dropping the child into a cot, and this allegedly caused the child’s skull to be fractured.\nThe pair were ordered to be remanded at the Institute of Mental Health and their cases have been adjourned to Jan 27.\nFor causing grievous hurt, an offender can be jailed for up to 10 years and fined or caned.\nWomen cannot be caned, but they can receive longer jail sentences in lieu of strokes of the cane.", "url": "https://www.straitstimes.com/singapore/courts-crime/duo-charged-over-alleged-abuse-of-2-month-old-baby-girl-found-with-fractured-skull-in-sembawang-flat"}