{"authors": ["Aqil Hamzah"], "date_download": "2024-10-12 13:29:40", "date_modify": "2024-10-12 13:29:40", "date_publish": "2022-12-04 05:00:00", "description": "The authorities work with online platforms to take down listings suspected of selling prohibited items. Read more at straitstimes.com.", "filename": "singapore_illegal-items-found-on-e-commerce-platforms-disguised-as-other-goods_1728739780.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/04/Amazon20Vape20Listing_0.jpg?VersionId=KMzkbSPkcaSH2HVeGoq_RkN4G3JKticj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_illegal-items-found-on-e-commerce-platforms-disguised-as-other-goods_1728739780.html", "title": "Illegal items found on e-commerce platforms disguised as other goods", "title_page": "Illegal items found on e-commerce platforms disguised as other goods | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – It was marketed as an incense burner that would give off fruity notes of banana and kiwi, good for at least 800 uses.\nCustomers in Singapore could get it delivered to their doorstep within a week at the earliest, if they paid an extra US$7.77 (S$10.50) on top of its US$19.99 price.\nBut people can get into trouble with the law if they purchase it, because the item – actually an electronic vaporiser – is illegal here.\nThe blanket ban on e-vaporisers here is due to several reasons, which were outlined in a parliamentary written response in 2019. These include their harmful effects on health, as well as the possibility of it acting as a gateway for youth to get started on cigarette smoking.\nThe Sunday Times found that some sellers on e-commerce platforms such as Amazon and Lazada deliberately mislabelled prohibited items, including e-vaporisers and drug paraphernalia, in an attempt to evade detection.\nIn one case, a tool used to smoke methamphetamine was described as a glass straw, retailing for US$15.60.\nAnother tool used to smoke cannabis was labelled as a “hydroponic plant vase” and sold for $14.93.\nAfter Lazada was alerted to the sale of drug paraphernalia on its platform, a spokesman for the e-commerce company said: “Lazada has a zero-tolerance policy for prohibited items in Singapore.\n“We work closely with the relevant authorities to ensure illicit items are not sold on the platform, and continually update our algorithms to weed out and disable listings that are against our marketplace policy for sellers.”\nAccording to its policy, sellers who display prohibited items incur a varying number of non-compliance points, up to a maximum of 48, which results in their stores getting deactivated permanently.\nThis penalty is immediately meted out to those who put drugs or drug paraphernalia on sale, with The Sunday Times observing the majority of sellers to be based overseas.\nSimilarly, Amazon has a universal policy that prohibits the sale of e-vaporisers and drug paraphernalia. The prohibited items that were previously available had been incorrectly listed, which allowed them to evade detection.\n“Third-party sellers are independent businesses and are required to follow all applicable laws, regulations and Amazon policies when listing items for sale in our store,” said a spokesman, who added that sellers could get their accounts removed if found violating its policies.\nThe authorities also work with these platforms to take down any listings suspected of peddling prohibited items.\nBetween January and October, the Health Sciences Authority took down more than 4,000 online postings of illegal tobacco-related products.\nThe previous year, it took down more than 6,800 postings, and destroyed about $1.85 million worth of e-vaporisers and related products, which it had seized in raids and enforcement operations.\nThe Sunday Times understands that the Central Narcotics Bureau frequently liaises with e-commerce platforms to remove listings of drugs and drug paraphernalia.\nThe authorities also work closely with courier firms to curb the importation of such goods here.\nDespite efforts to prevent such items from being sold here, people in Singapore continue to get their hands on them, with e-vaporisers becoming increasingly common.\nIn 2021, 4,697 people were caught using and possessing such items, up from 1,266 in the previous year.\nAs at August this year, 3,912 people have been caught.\nThose found using, buying or possessing such products are liable to a fine of $2,000 – a reminder that the authorities conveyed to parents and students ahead of the school holidays through an advisory sent on the Parents Gateway app that facilitates communication between parents and schools.\nA similar advisory was also sent out to remind students to stay away from crimes, including drug and inhalant abuse.\nParents, too, need to take a more active role in monitoring their children, said Mr Muhammad Nizam Uddin Miazee, a father of three children aged between 13 and 18.\nIn his household, the computer is placed in the living room, and his children use it only after completing their homework and revision for the day.\n“The Internet is a very useful tool no doubt, but you need to know how to use it appropriately. You need to set boundaries for your children, so their curiosity doesn’t get the better of them,” said the 47-year-old, who runs his own electrical appliance business.\nHarmful effects of vaping\nSINGAPORE - Despite claims that electronic vaporisers are “safer” than traditional cigarettes, Dr Ong Kian Chung, a respiratory physician at Mount Elizabeth Hospital, said there are no definitive answers yet to prove their relative safety.\nIn fact, the use of e-vaporisers, which is illegal here, can lead to several effects on users, he added.\nRespiratory issues\nAn additive known as diacetyl, used in e-vaporiser liquid to give it its flavour, has been shown to scar the smallest airways in the lungs. The process is irreversible and gives rise to obliterative bronchiolitis, with symptoms such as shortness of breath, persistent cough and tiredness.\nIn 2019, there were 2,409 cases of young people being hospitalised for respiratory failure in the United States because of Evali, or “e-cigarette or vaping product use-associated lung injury”. Fifty-two of the people affected by Evali died. The cause was vitamin E acetate, a chemical used in e-vaporiser liquid as a thickening agent.\nCardiovascular issues\nPeople who use e-vaporisers and smoke cigarettes have a higher chance of getting coronary heart disease.\nNicotine addiction\nMost e-vaporisers contain nicotine – an addictive chemical that disrupts brain development in youth. This could lead to a host of potential problems, including impulse control issues and a susceptibility to substance abuse.", "url": "https://www.straitstimes.com/singapore/illegal-items-found-on-e-commerce-platforms-disguised-as-other-goods"}