{"authors": ["Varun Karthik"], "date_download": "2024-10-12 13:38:27", "date_modify": "2024-10-12 13:38:27", "date_publish": "2024-07-19 23:59:00", "description": "With only six years to achieve these global targets, a lot more needs to be done, says UNGA president. Read more at straitstimes.com.", "filename": "singapore_un-states-called-to-turbocharge-action-on-sustainability-goals-derailed-by-global-wars_1728740307.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/19/vkunga19.138cb552.Attachment.100406.jpg?VersionId=VZVdI4J3kmUyieiL5_EtN_PHUH0OcVdQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_un-states-called-to-turbocharge-action-on-sustainability-goals-derailed-by-global-wars_1728740307.html", "title": "UN states called to ‘turbocharge’ action on sustainability goals derailed by global wars", "title_page": "UN states called to ‘turbocharge’ action on sustainability goals derailed by global wars | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - United Nations member states are “heavily off-track” in terms of achieving the 17 Sustainable Development Goals (SDGs) that will, among other things, uplift impoverished communities globally, and need to intensify efforts in spite of the various wars raging in the world today.\nWith only six years to achieve these global targets, a lot more needs to be done to attain them, UN General Assembly (UNGA) president Dennis Francis said on July 19, in a media interview during an official visit to Singapore.\nThe goals under the 2030 Agenda for Sustainable Development adopted in 2015 are designed to achieve a better and more sustainable future for all by 2030, by addressing issues such as poverty, inequality, climate change, peace and justice.\n“Even as the issues of peace and security linger without there being a definitive solution at this period of time, we cannot suspend and/or ignore the need for sustainable development,” the career Trinidad and Tobago diplomat added.\nWith wars in the Gaza Strip and Ukraine dominating the world’s attention in recent years, UN member states have put more resources towards security.\nThis has compounded the development gaps that have only grown since the Covid-19 pandemic.\nA 2023 World Bank study showed that the pandemic derailed development for millions of children and young people in low- and middle-income countries.\nMr Francis said he hopes world leaders will “recommit to” and “turbocharge” their progress on the 2015 SDGs at the Summit of the Future in September, while considering new issues that have since come onto the development agenda.\nNoting how the current geopolitical environment impacts everyone, he said: “Whether it is recognised or not, every time you go to the supermarket, you are paying for the wars in Ukraine and in Gaza.\n“Because global supply chains continue to be disrupted and so prices are up.”\nCalling Singapore a “voice of reason, balance and respect” on the international stage, he added: “Singapore provides much needed leadership among the countries in terms of always ensuring that the interests of the Global South, in particular, are protected.”\nMr Francis met various leaders during his visit, including President Tharman Shanmugaratnam, Prime Minister Lawrence Wong, and Foreign Minister Vivian Balakrishnan.\nMr Tharman and PM Wong exchanged views on issues of global concern during their respective meetings with Mr Francis, while Dr Balakrishnan also “expressed Singapore’s support for the Summit of the Future” during his meeting, the Ministry of Foreign Affairs said on July 19.\nIn an Instagram post, PM Wong said that he and Mr Francis discussed how Singapore and the UN could work together to support developing countries and the UN SDGs.\n“I reiterated Singapore’s commitment to supporting the UN and the rules-based multilateral system, which matters greatly to small states like Singapore,” he added.\nIn a separate post on Instagram, Dr Balakrishnan said that Mr Francis was known for his efforts at the UN in addressing common challenges faced by small states, including climate change.\n“His focus on accelerating action on the 2030 Agenda for Sustainable Development is another vital piece in addressing the needs of small island developing states,” he said.", "url": "https://www.straitstimes.com/singapore/un-states-called-to-turbocharge-action-on-sustainability-goals-derailed-by-global-wars"}