{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:27:17", "date_modify": "2024-10-12 13:27:17", "date_publish": "2024-07-04 16:30:00", "description": "Aizil A Rahim committed the offences in 2023. Read more at straitstimes.com.", "filename": "singapore_courts-crime_man-jailed-for-making-off-with-nearly-115k-in-ruse-involving-pokemon-one-piece-cards_1728739637.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/04/hzpokemon0407.jpg?VersionId=3Djsq6VcshClyZIBU16g9hhjQzOj0Cdc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_man-jailed-for-making-off-with-nearly-115k-in-ruse-involving-pokemon-one-piece-cards_1728739637.html", "title": "Man jailed for making off with nearly $115k in ruse involving Pokemon, One Piece cards", "title_page": "Man jailed for making off with nearly $115k in ruse involving Pokemon, One Piece cards | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – He convinced his victims that he would help them obtain Pokemon trading cards, as well as cards linked to the One Piece manga series, before making off with their money totalling nearly $115,000.\nAizil A Rahim, 28, who has since made restitution to the tune of nearly $9,400, was sentenced to 16 months and eight weeks’ jail on July 4.\nHe had pleaded guilty to nine counts of criminal breach of trust involving more than $88,500 and one count of giving false information to a public servant.\nSixteen other charges linked to the remaining amount were considered during sentencing.\nAt the time of the offences, Aizil was the owner of two accounts on online marketplace Carousell.\nAround mid-2022, he started selling Pokemon and One Piece trading cards, which he knew to be expensive after checking their prices online.\nHe took pre-orders for trading cards from customers and then sourced the cards from a local supplier.\nAround February or March 2023, he started to advertise pre-orders for Pokemon cards on his Carousell accounts. The prosecution referred to this as the “first wave of pre-orders”.\nThe following month, Aizil started to get addicted to buying watches, and he later told investigators that he had spent more than $30,000 on his watch-collecting hobby.\nHe also collected expensive football trading cards and estimated that he had spent more than $10,000 on them.\nBetween April and May 2023, he started to advertise pre-orders for One Piece trading cards on his Carousell accounts.\nAizil admitted that many clients in the first wave of pre-orders were returning customers because he had earlier gained their trust and obtained positive ratings from them.\nThe customers then transferred money to his bank account, which was linked to his mobile phone number.\nAs part of the arrangement, Aizil was supposed to deliver the trading cards to the customers once the cards were released in Singapore from July to September 2023.\nDeputy Public Prosecutor Tay Jia En told the court: “Instead of using the funds he received from the customers of the first wave of pre-orders to purchase the trading cards, the accused misappropriated the monies by spending them on (items including) his watch purchases, expensive (football) trading cards, food, shopping (and) a staycation.\n“The accused also used the misappropriated monies to buy a cabinet... to store all the watches he had bought.”\nAizil later launched another pre-order advertisement for the period of July to October 2023. This involved a second wave of pre-orders, the court heard.\nHe intended to use the money that he collected from the second wave of pre-orders to refund customers or fulfil his obligations from the first wave.\nIf there was any shortfall, he planned to first borrow money from his nine siblings or attempt to pay off his customers by taking up different jobs such as working as a freelance videographer.\nAizil had thought that he could easily “roll” the money from one pre-order to the next, said the DPP. He also admitted that he never intended to deliver the orders to the customers.\nWhenever customers started to question him about the trading cards, he would lie to them by giving different excuses, including claiming that he had been hospitalised due to an “accident”.\nAizil’s scheme eventually failed when he was unable to raise the funds to refund his customers and became uncontactable soon after. Twenty-five victims then alerted the police in June and July 2023.\nMeanwhile, Aizil lodged a police report on June 28, 2023, claiming that he had been scammed.\nHe later gave three statements and lied to a police officer that a Japanese man known as “Nagashima” had purportedly offered to supply the Pokemon cards.\nAmong other things, Aizil claimed that he had paid $30,000 to Nagashima, who later became uncontactable.\nIn July 2023, Aizil finally admitted that he had lied to the authorities and that Nagashima did not exist.\nIt turned out that Aizil had lodged the police report in an attempt to show his customers that he was “not a scammer”.\nHe also wanted to provide “evidence” to his customers, should they show up at his doorstep to demand the cards.", "url": "https://www.straitstimes.com/singapore/courts-crime/man-jailed-for-making-off-with-nearly-115k-in-ruse-involving-pokemon-one-piece-cards"}