{"authors": ["Shabana Begum"], "date_download": "2024-10-12 13:28:06", "date_modify": "2024-10-12 13:28:06", "date_publish": "2024-09-05 23:15:00", "description": "The centre's focus will be on creating better quality hybrid meats and ramping up research in fermented proteins. Read more at straitstimes.com.", "filename": "singapore_new-nus-bezos-centre-to-focus-on-combining-novel-foods-to-make-hybrids_1728739686.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/Bezos20Centre20at20NUS28Lab29-1.jpg?VersionId=xyOxw14XFhSOU2kIJpJDtmW0qQGNe63K", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_new-nus-bezos-centre-to-focus-on-combining-novel-foods-to-make-hybrids_1728739686.html", "title": "New NUS Bezos Centre to focus on combining novel foods to make hybrids", "title_page": "New NUS Bezos Centre to focus on combining novel foods to make hybrids | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - While cell-based meat, plant-based food and fermented protein may be struggling to remain viable, food scientists here increasingly believe that mixing the three novel foods together could be a boost to the alternative protein sector.\nThis is known as hybrid meat, where cow cells, for example, can grow on a plant-based scaffold to give cultivated steak a more realistic texture. Protein-rich microalgae can be added to the meat to raise its nutritional quality.\n“On the market today, some products are great at texture, but not so good on the taste. Others are very strong in nutrition and health benefits, (but) maybe they are not cracking the texture,” said Dr Andy Jarvis, director of future of food at the Bezos Earth Fund on Sept 5.\nThis is the basis of a new alternative protein research centre at the National University of Singapore (NUS), which will focus on creating better quality hybrid meats and ramping up research in fermented proteins, currently an overlooked field.\nAsia’s first Bezos Centre for Sustainable Protein was launched on Sept 5 at NUS, backed by $39 million from the Bezos Earth Fund. The fund was started by Amazon founder Jeff Bezos as a philanthropic commitment to address the climate crisis.\nSpeaking to the media before the launch of the research centre, Dr Jarvis said fermented protein, aside from tofu, has been least researched, but it is an area of enormous potential.\nFermentation is an age-old method used to make beer and yogurt. In the alternative protein sector, it refers to how microalgae, for example, can be cultured in a bioreactor and grow with the help of tofu waste. Microalgae are tiny greens packed with protein.\nAccording to the Good Food Institute, a think-tank that is also involved in the Bezos Centre, the root network or mycelium of fungi, microalgae, microbes and fermented plant proteins can provide the sensory experiences and nutrition of animal products, but without undesirable substances such as cholesterol, antibiotics and hormones.\nThe Bezos Centre for Sustainable Protein has its own office next to the NUS Department of Food Science and Technology.\nResearch at the centre will be led by 23 scientists from institutes including NUS, Nanyang Technological University, Singapore Institute of Technology, and ETH Zurich.\nThere are two other Bezos centres focusing on alternative proteins, at Imperial College London and North Carolina State University.\nThe NUS centre’s acting director, Professor Zhou Weibiao – who also heads the NUS Department of Food Science and Technology – said the centre will also look at solving the gaps and pain points of the alternative protein sector.\nThe cultivated meat sector, for instance, had gained momentum up till 2022, but investor appetite for the fledgling sector began to wane in 2023 amid concerns over its technological scalability and the long timeline from research to commercialisation.\nOne challenge for cultivated meat firms is to scale up production of chicken or fish cells. Part of this is due to contamination when the cells are transferred from one vat to a larger bioreactor.\nA research project at the new centre plans to look into the behaviour of bioreactors to improve their design and operations, so that animal cells can grow optimally in them, Prof Zhou said.\nThe centre will also conduct studies related to the safety of novel food, nutrition and consumer acceptance of alternative proteins.", "url": "https://www.straitstimes.com/singapore/new-nus-bezos-centre-to-focus-on-combining-novel-foods-to-make-hybrids"}