{"authors": ["Esther Loi"], "date_download": "2024-10-12 13:43:42", "date_modify": "2024-10-12 13:43:42", "date_publish": "2024-02-21 21:55:00", "description": "Three A330neo aircraft will be delivered between 2025 and 2026. Read more at straitstimes.com.", "filename": "singapore_transport_taiwan-s-starlux-airlines-orders-eight-airbus-planes-at-singapore-airshow_1728740622.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/21/2024022125758520img5691.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_taiwan-s-starlux-airlines-orders-eight-airbus-planes-at-singapore-airshow_1728740622.html", "title": "Taiwan’s Starlux Airlines orders eight Airbus planes at Singapore Airshow", "title_page": "Taiwan’s Starlux Airlines orders eight Airbus planes at Singapore Airshow | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Taiwanese carrier Starlux Airlines has placed an order for three more Airbus A330neo wide-body passenger aircraft and five A350F cargo planes.\nThe agreement was inked on Feb 21, during the second day of the biennial Singapore Airshow, which runs till Feb 25.\nThis will take Starlux’s fleet size to 29 aircraft.\nIt already has four A330neo aircraft, 13 A321neo narrow-body passenger planes, and four A350-900 wide-body passenger jets.\nAirbus declined to reveal the value of the deal.\nSpeaking to the media on Feb 21, Starlux chairman Chang Kuo-wei said the airline has the option to buy five more A350F cargo aircraft, on top of this deal.\nMr Chang, the son of Taiwan’s EVA Air founder Chang Yung-fa, started Starlux in 2018, after he was forced to leave his family business in a succession feud.\nThe Taiwanese airline flies to various destinations, including Singapore, Osaka and Los Angeles.\nMr Benoit de Saint-Exupery, executive vice-president for sales of commercial aircraft at Airbus, told reporters that the A330neo aircraft will be delivered to Starlux between 2025 and 2026, while the A350Fs will arrive “a bit later”.\nStarlux chief executive Glenn Chai noted that the carrier is the first Taiwanese airline to operate the A350F cargo planes.\nThe Airbus A330neo is a wide-body jet with a capacity of up to 287 passengers, and has a range of up to 13,330km – the equivalent of 17 hours in the air.\nThe A350F is a cargo aircraft that can carry a load of up to 111 tonnes, and fly up to 8,700km.\nOn the airline’s acquisition of the cargo planes, Mr Chang said he did not want to miss the opportunity of tapping into Taiwan’s status as an “important cargo hub”.\nHe added that the purchase of the A330neo will raise the capacity of Starlux’s services within Asia, as well as support its operations from South-east Asia to North America via Taiwan.\nJoining an airline alliance will be part of Starlux’s plans in the near future, after it completes its network expansion in North America, noted Mr Chang.\nHe cited the airline’s experience with passenger operations on Airbus aircraft and the fuel efficiency of the manufacturer’s equipment as reasons behind the deal.\n“A lot of you will know that I’m a Boeing fan,” added Mr Chang. “But the timeframe of aircraft delivery is very important to us.”", "url": "https://www.straitstimes.com/singapore/transport/taiwan-s-starlux-airlines-orders-eight-airbus-planes-at-singapore-airshow"}