{"authors": ["Vanessa Liu"], "date_download": "2024-10-12 13:28:43", "date_modify": "2024-10-12 13:28:43", "date_publish": "2019-04-04 14:56:25", "description": "Singapore Customs and the National Parks Board, which staged the joint operation that led to the haul, said the scales are likely from 17,000 pangolins. Read more at straitstimes.com.", "filename": "singapore_environment_record-haul-of-pangolin-scales-worth-52-million-seized-from-container-at-pasir_1728739723.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/XmdG-Ki7_9BMJ9x78Kvm34EutPq2IwmEBT_8e0BjByM.jpg?VersionId=HbhWQyGlk9ydKjD3cvyebIzhUJ_.cDqp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_record-haul-of-pangolin-scales-worth-52-million-seized-from-container-at-pasir_1728739723.html", "title": "World record haul of pangolin scales worth $52 million seized from container at Pasir Panjang", "title_page": "World record haul of pangolin scales worth $52 million seized from container at Pasir Panjang | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - In the biggest single haul in the world in recent years, the authorities on Wednesday (April 3) seized 12.9 tonnes of pangolin scales worth $52.3 million from a container at Pasir Panjang Export Inspection Station.\nThe scales originated from Nigeria and were bound for Vietnam. They were found packed in 230 bags among packets of frozen beef, and declared to contain \"frozen beef\".\nAlong with the pangolin scales, 177kg of cut up and carved elephant ivory worth $120,000 were also seized during the inspection.\nSingapore Customs and the National Parks Board (NParks), which staged the joint operation that led to the haul, said the scales are likely from 17,000 pangolins, taking into account the weight of the various species.\nThe four species native to Africa are the Giant Ground Pangolin (smutsia gigantea), the Black Bellied Tree Pangolin (phataginus tetradactyla), the Ground Pangolin (smutsia temminckii) and the White Bellied Tree Pangolin (phataginus tricuspis).\nThe previous biggest haul on record was in China in 2017, where nearly 12 tonnes of scales were seized.\nNParks said it intercepted shipping of pangolin scales in Singapore in 2015 and 2016 as well.\nThe pangolin is believed to be the world's most trafficked mammal.\nIts meat is also considered a delicacy in some countries.\nSingapore is a signatory of the Convention on International Trade in Endangered Species of Wild Fauna and Flora (Cites).\nUnder local laws - the Endangered Species (Import & Export) Act - the penalty for the illegal import, export and re-export of wildlife is a fine of up to $500,000 and may include two years' imprisonment.\nNParks said investigations are ongoing. It added that the scales will be disposed of by incineration after investigations are completed so that they will \"not be in the market\".", "url": "https://www.straitstimes.com/singapore/environment/record-haul-of-pangolin-scales-worth-52-million-seized-from-container-at-pasir"}