{"authors": ["Chin Hui Shan", "Yong Li Xuan"], "date_download": "2024-10-12 13:46:01", "date_modify": "2024-10-12 13:46:01", "date_publish": "2023-07-04 16:22:00", "description": "The tattoo studio posted on its Instagram account the man’s name and picture. Read more at straitstimes.com.", "filename": "singapore_tattoo-studio-takes-to-social-media-to-track-down-client-who-left-without-paying_1728740761.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/05/yuhstattoocollage0407.jpg?VersionId=WsqRhe0P8LilUjbX7hEt98ByS5Fv4bML", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_tattoo-studio-takes-to-social-media-to-track-down-client-who-left-without-paying_1728740761.html", "title": "Tattoo studio posts name, photo of client who left without paying", "title_page": "Tattoo studio posts name, photo of client who left without paying | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – It took seven hours for tattoo artist Brandon Christopher to etch an image of a Tibetan phurba dagger into the arm of his client.\nBut the man, who was supposed to pay $500, left without settling the bill.\nNow the tattoo studio is trying to track him down, posting his name and photo on its Instagram account.\nMr Brandon, who works at the Inkvasion studio in Far East Plaza, said the man asked to use the toilet at the end of the tattoo session on June 30.\nBut he did not return, texting the tattoo artist later that “something urgent cropped up” and that he would transfer the money when he reached home.\n“I thought he would do a bank transfer right away because that’s what people usually do,” said Mr Brandon, who has been a tattoo artist since 2014.\nWhen he chased for payment later that night, the man asked if he could transfer the money before July 18 – when he was supposed to return for a second tattoo session.\nWhen Mr Brandon said no, the man appeared to block the tattoo artist from sending him more messages.\nThe client had another unfinished tattoo of a tiger done by another tattoo artist, which Mr Brandon was supposed to complete during the second session on July 18. He had paid a $100 deposit for this booking.\n“I am disappointed at how this unfolded – $500 may not be a big deal to some people, but it is to me,” said Mr Brandon, 31.\n“I spend a lot of time tattooing, which is extremely tiring and taxing. I could have easily given a slot to someone else who would actually pay,” he added.\nThe tattoo studio said the man has other unfinished tattoos.\nAttempts by The Straits Times to contact him on Monday were unsuccessful.\nSaid Mr Brandon: “I just want to make sure that this does not happen to other fellow artists in the community… It’s a big waste of time. I felt so disappointed and dejected.”\nHe and the studio have reported the matter to the police.", "url": "https://www.straitstimes.com/singapore/tattoo-studio-takes-to-social-media-to-track-down-client-who-left-without-paying"}