{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 13:43:29", "date_modify": "2024-10-12 13:43:29", "date_publish": "2024-07-14 05:00:00", "description": "Currently, ad spaces on buses and in interchanges are managed by the four public bus operators. Read more at straitstimes.com.", "filename": "singapore_transport_lta-to-consolidate-management-of-bus-ads-under-one-operator-to-grow-revenue_1728740609.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/14/2024011579195710gin4497.jpg?VersionId=u74yCXyhvUuR74B1.G9GXThPk8SiiXMW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_lta-to-consolidate-management-of-bus-ads-under-one-operator-to-grow-revenue_1728740609.html", "title": "LTA to consolidate management of bus ads under one operator to grow revenue", "title_page": "LTA to consolidate management of bus ads under one operator to grow revenue | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – In a bid to eke out more revenue for the public transport system here, the management of advertisements on public buses as well as at terminals and interchanges will be consolidated under a single operator.\nThe move is expected to give advertisers a wider reach and allow the operator to reap economies of scale, said the Land Transport Authority (LTA) in response to queries.\nToday, ad spaces on buses and in interchanges are managed by the four public bus operators – SBS Transit (SBST), SMRT, Tower Transit Singapore and Go-Ahead Singapore – which appoint their own partners.\nThis is set to change with a tender called by LTA on July 2. It said the tender will be awarded in the first quarter of 2025 and more details will be announced then.\nIt did not address questions about the commercial arrangements under the tender, including who will get to keep the ad revenue. It also did not address questions about the potential financial impact the move may have on the four bus operators.\nThe public bus system in Singapore uses a contracting model, which means operators bid for contracts and are paid by LTA to run the services. LTA keeps the fares, while the operators get to pocket non-fare revenue, which includes income from advertising and renting out commercial spaces in interchanges.\nSimilarly, rail operators here have been allowed to run non-transit businesses but the Government began to review this practice in 2017.\nIn 2019, LTA, for the first time, outsourced advertising rights on the Thomson-East Coast Line to a third party, Asiaray Connect, in a deal that will bring over $140 million in concession fees for the authority over a 16-year term.\nLTA cited the need to improve the rail line’s financial sustainability, and said at the time that it would explore expanding this outsourcing framework to other rail lines, buses, bus interchanges as well as road and pedestrian infrastructure.\nIn November 2023, LTA auctioned off the right to operate ad spaces at about 120 pedestrian overhead bridges, underpasses and covered linkways. At the same time, it also consolidated ad concessions for its bus stops and taxi stands into a single contract.\nThe combined tender was won by Stellar Experience, a subsidiary of SMRT, which will pay LTA a guaranteed minimum of $268.9 million over 10 years.\nOn LTA’s latest move to consolidate the management of bus ads, Tower Transit Singapore said it will support the authority’s plans and work with the appointed operator.\nGo-Ahead Singapore did not respond by press time, while SMRT declined to comment. SBST directed queries to its parent company, ComfortDelGro, which also did not respond.\nWhile the four bus operators are free to appoint their own partners, in reality, the market has become a duopoly. SMRT’s advertising arm Stellar Ace handles its bus ads, while ComfortDelGro’s advertising arm Moove Media does so for the remaining three bus operators.\nWith the Government shelling out more than $2 billion in subsidies every year to keep public transport services running, industry observers have long urged LTA to grow non-fare revenue as one way to bridge the gap, especially amid rising costs.\nAssociate Professor Walter Theseira, head of the urban transportation programme at the Singapore University of Social Sciences (SUSS), said the move to consolidate public transport ad operations will bring incremental revenue, but he does not expect the amount to be huge.\nWhile the four bus operators did not respond to queries about how much revenue they make from bus and bus interchange ads, Tower Transit Singapore’s latest financial statements indicate it is a fraction of its overall income.\nThe firm, which operates more than 700 buses that ply more than 60 routes, made about $1.9 million in advertising income in the financial year ending June 30, 2023. This was around 1 per cent of the $169.6 million in total revenue the company earned that year.\nAssociate Professor Elaine Chan, who heads the marketing division at Nanyang Technological University’s Nanyang Business School, said bus advertising is increasingly popular among advertisers due to its high visibility.\nWhile she agrees that LTA’s move to consolidate the management of bus ads is strategic and logical, she noted several downsides, including reduced competition among ad operators, which could potentially lead to higher rates.\nThis may be more detrimental to small and medium-sized companies, which often have a limited budget. Depending on how bus advertising is managed, the consolidation may also restrict advertisers’ ability to launch more localised ad placements, Prof Chan added.\nAssociate Professor Lau Kong Cheen, who heads the marketing programme at the SUSS School of Business, said LTA’s consolidation would increase the efficiency and effectiveness of bus advertising.\nIt would give the appointed ad operator a better overview of ad space utilisation across the various bus operators, which in turn would allow for the sale of these spaces to be better optimised.", "url": "https://www.straitstimes.com/singapore/transport/lta-to-consolidate-management-of-bus-ads-under-one-operator-to-grow-revenue"}