{"authors": ["Carmen Sin"], "date_download": "2024-10-12 13:29:20", "date_modify": "2024-10-12 13:29:20", "date_publish": "2023-10-27 15:55:00", "description": "Pay close attention to what is in your Web browser’s address bar the next time you log into WhatsApp Web. Read more at straitstimes.com.", "filename": "singapore_beware-of-phishing-scam-involving-fake-whatsapp-web-pages-police_1728739760.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/27/2023-09-15T041846Z555288550RC2UFZ935NDURTRMADP3META-WHATSAPP-ADS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_beware-of-phishing-scam-involving-fake-whatsapp-web-pages-police_1728739760.html", "title": "Beware of phishing scam involving fake ‘WhatsApp Web’ pages: Police", "title_page": "Beware of phishing scam involving fake ‘WhatsApp Web’ pages: Police | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Pay close attention to what is in your Web browser’s address bar the next time you log in to WhatsApp Web as it could be a new variant of phishing scams instead.\nIn a media statement on Friday, the police warned of fraudulent websites that “trick users into authorising access to their WhatsApp account for the scammers”.\nIn these cases, victims wanting to use WhatsApp on their computers searched for the official WhatsApp Web webpage on online search engines and clicked on the first few search results without verifying the URL links.\nThe links took them to phishing websites embedded with the genuine QR code extracted from the official website of WhatsApp, said the police.\nWhen victims scanned the QR code on the phishing website with their mobile phones, the page became unresponsive and scammers gained remote access to their WhatsApp accounts.\nThe scammers then messaged the victims’ contacts asking for personal details and Internet banking credentials, or for money transfers to a designated bank account.\nEven though the victims would have noticed that the QR codes on the fake phishing websites did not bring them to WhatsApp Web’s desktop interface, they did not immediately realise that their accounts had been compromised as they could still access WhatsApp.\n“The victims would only discover that their WhatsApp accounts were compromised when they were notified by their contacts of unusual requests such as asking for transfer of monies or i-banking credentials,” the police said.", "url": "https://www.straitstimes.com/singapore/beware-of-phishing-scam-involving-fake-whatsapp-web-pages-police"}