{"authors": ["Zaihan Mohamed Yusof", "Nadine Chua"], "date_download": "2024-10-12 13:31:09", "date_modify": "2024-10-12 13:31:09", "date_publish": "2023-02-27 05:00:00", "description": "SINGAPORE - Parents need to be more actively involved in shaping their children’s attitudes towards drug use, say counsellors and therapists who work with young drug users. Read more at straitstimes.com.", "filename": "singapore_parents-must-help-shape-their-children-s-attitudes-towards-drug-use-counsellors_1728739869.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/27/rrdrugs2502_0.jpg?VersionId=KB19qbJcENToHEsIg1cahH83LdrWqNs2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_parents-must-help-shape-their-children-s-attitudes-towards-drug-use-counsellors_1728739869.html", "title": "Parents must help shape their children’s attitudes towards drug use: Counsellors", "title_page": "Parents must help shape their children’s attitudes towards drug use: Counsellors | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Parents need to be more actively involved in shaping their children’s attitudes towards drug use, say counsellors and therapists who work with young drug users.\nMr Tan Han Lay, who helps inmates in their drug rehabilitation journey, said parents who take no action or spend little time supervising them may risk losing their children to drug abuse.\nMr Tan, chairman of Loving Hand Fellowship, said: “There are parents who lack information. They work hard each day, but they don’t seek updates from their children. They don’t know anything about what their children are doing, and some parents even think that smoking cannabis is OK.”\nIn cases Mr Tan has seen, inmates who have absent parents often end up relying on friends, who unfortunately introduce drugs to them. The counsellor said cannabis abuse by young abusers is more “a family problem than a drug problem”.\nPsychotherapist Andrew Da Roza, who deals with addictions at Promises Healthcare, said some young drug abusers pick up the habit because of pressures at home and in school.\n“Unreasonably high parental expectations of achievements at school (in examinations), demanding and directive- or punishment-driven parenting styles... and the lack of parental presence are factors that have prevented efficacious parental guidance on cannabis, alcohol, smoking and other drug use,” said Mr Da Roza.\nHe said parents should talk to their children about the effects of cannabis, as well as the perceived immediate attractions and risks.\nThey should also actively listen to their children’s points of view while teaching them alternatives to managing emotions and stress, said Mr Da Roza, who added that schools also have a role in teaching about distress tolerance and emotion regulation tools from a very young age till adolescence.\nPerceptions on drug use are shifting among the young, a survey by the National Council Against Drug Abuse in 2020 found. In 2016, 88.8 per cent of young people aged 13 to 30 disagreed that drug taking is fine as long as it does not affect others. This dropped to 80.5 per cent in a survey conducted in 2020.\nMr Da Roza said there needs to be a deeper understanding of the reasons for cannabis use among the young.\n“While a continued policy of no tolerance to cannabis use is a worthy aim and interdiction is a worthy tool, the underlying socio-economic... and psychological causes of cannabis use are also worthy of attention,” he added.", "url": "https://www.straitstimes.com/singapore/parents-must-help-shape-their-children-s-attitudes-towards-drug-use-counsellors"}