{"authors": ["Aqil Hamzah"], "date_download": "2024-10-12 13:29:54", "date_modify": "2024-10-12 13:29:54", "date_publish": "2022-09-27 16:26:13", "description": "Number of people caught for the use and possession of e-vaporisers has also been on the rise. Read more at straitstimes.com.", "filename": "singapore_428-people-in-singapore-caught-selling-e-vaporisers-since-2018-with-91-prosecuted_1728739794.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/27/sv_Tobacco_270922.jpg?VersionId=DQZHtDRK8vIP7ij_czMp3svswYKVOh.P", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_428-people-in-singapore-caught-selling-e-vaporisers-since-2018-with-91-prosecuted_1728739794.html", "title": "428 people in Singapore caught selling e-vaporisers since 2018, with 91 prosecuted", "title_page": "428 people in Singapore caught selling e-vaporisers since 2018, with 91 prosecuted | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A total of 428 people were caught selling electronic vaporisers from the start of 2018 to August 2022, with 91 prosecuted during the same period, said the Health Sciences Authority (HSA) on Tuesday.\nThe number of people caught for the use and possession of e-vaporisers has also been on the rise.\nIn 2021, 4,697 people were caught using and possessing e-vaporisers, up from 1,266 the previous year.\nMeanwhile, 3,912 people have already been caught as at August.\nAlthough the use and sale of e-vaporisers were banned in Singapore from Feb 1, 2018, such products continue to be advertised and sold online, including on e-commerce platforms and messaging apps like Telegram.\nAn HSA spokesman said the authority took down more than 6,800 online postings in 2021 alone, adding that it constantly monitors the online space.\n\"We work with related e-commerce sites to shut down such listings promptly upon detection.\n\"To complement our enforcement operations, HSA has also collaborated with online platforms like Instagram, Facebook, Carousell, et cetera, to remove illegal postings on tobacco-related products,\" he said.\nThe authority also works closely with the Ministry of Health, Health Promotion Board and Ministry of Education to tackle the problem of vaping among youth.\n\"Singapore adopts a multi-pronged approach to tackle the use of e-vaporisers, comprising legislation, enforcement, public education and counselling,\" he added.\nThose caught using, buying or possessing such products in Singapore are liable to a fine of $2,000.\nHarsher penalties are meted out to those who sell, possess for sale, import or distribute such items.\nThose convicted can be fined up to $10,000 and jailed for up to six months, with the maximum sentence doubled for repeat offenders.\nThose who have information on the illegal import, distribution, sale or offer for sale of e-vaporisers can submit a report online.\nThey can also contact HSA's Tobacco Regulation Branch on 6684-2036 or 6684-2037 from 9am to 5.30pm on weekdays.", "url": "https://www.straitstimes.com/singapore/428-people-in-singapore-caught-selling-e-vaporisers-since-2018-with-91-prosecuted"}