{"authors": ["Judith Tan"], "date_download": "2024-10-12 14:01:59", "date_modify": "2024-10-12 14:01:59", "date_publish": "2024-01-25 20:50:00", "description": "Singaporeans can get certain common drugs from their Healthier SG GP clinics at prices comparable with those from polyclinics. Read more at straitstimes.com.", "filename": "singapore_more-subsidies-available-under-healthier-sg-chronic-tier-from-feb-1_1728741719.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/26/file7rhs7wxods83q2ds8zo.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_more-subsidies-available-under-healthier-sg-chronic-tier-from-feb-1_1728741719.html", "title": "More subsidies available under new Healthier SG Chronic Tier from Feb 1", "title_page": "More subsidies available under new Healthier SG Chronic Tier from Feb 1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singaporeans with chronic medical needs who have enrolled with a general practitioner (GP) under Healthier SG can get more subsidies when they opt for the programme’s new Chronic Tier from Feb 1.\nUnder this framework, they will be able to access certain common drugs from their Healthier SG GP clinics at prices comparable with those at polyclinics, the Ministry of Health (MOH) said in a press statement on Jan 25.\nThis is an enhanced subsidy for chronic drugs at GP clinics for Healthier SG enrollees who are Community Health Assist Scheme (Chas), Pioneer Generation (PG) and Merdeka Generation (MG) card holders.\nMost Singaporean patients with complex chronic diseases have the cost of medications for their condition covered by Chas at their enrolled GP clinics.\nHowever, they prefer to get their medications from polyclinics due to the lower prices as their current Chas benefits are not enough to pay for the drugs at GP clinics.\nUnder the Healthier SG Chronic Tier, they can get their supply of chronic drugs from GP clinics at around the same price as that at polyclinics.\nThese card holders can also receive means-tested subsidies of up to 87.5 per cent for selected chronic medications with no dollar cap at their enrolled GPs.\nFor other parts of their care, such as consultation, laboratory tests and other types of medicine, they can get subsidies of up to $360 a year.\nHealth Minister Ong Ye Kung said in March 2022 that Chas already provides significant subsidies for patients who have lower chronic medication needs, and that they pay nothing or very little for doctor visits and medications for their chronic conditions.\nWith the annual limit of $500, patients with chronic diseases are well covered by the Chas Chronic Tier. Should they apply for subsidies to cover their medication, they will get a 75 per cent subsidy without any dollar cap, with the annual limit at $330.\nMost Healthier SG enrollees, therefore, will likely not need to switch to the new tier. But clinic assistant Kathleen Koh, 43, still signed up for it.\nShe has had hypertension since she was 19, but was put on medication only when she was in her mid-30s.\n“When the readings spiked, both my doctor and I got worried,” she told The Straits Times.\n“For each visit to the clinic in Buangkok, the bill is about $80. But I have the blue Chas card and I am fully subsidised, so I did not have to pay a cent.”\nBut Ms Koh signed up for the new tier under Healthier SG “in case I suffer from more chronic diseases when I get older”.\nMOH said in its statement that more than 1,000 Healthier SG GP clinics will be ready to offer enhanced subsidies for selected medications under the Healthier SG Chronic Tier.\nThe remaining clinics, making up less than 5 per cent of eligible ones, are expected to be ready in the coming weeks after completing the required logistical preparation.\nPatients enrolled at these remaining clinics may continue to tap their existing Chas subsidies.\nAlso, from Feb 1, enrolled residents with chronic conditions can use their MediSave savings of up to between $500 and $700 to fully pay for their treatment at the enrolled primary care clinic, instead of having to co-pay 15 per cent of their bill in cash.\nAs at Jan 23, about 700,000 Singapore residents have enrolled in Healthier SG.\nResidents aged 40 and above can enrol with their preferred Healthier SG GP clinic or polyclinic through the HealthHub app or at any of the 39 enrolment stations located in community centres and clubs or polyclinics.", "url": "https://www.straitstimes.com/singapore/more-subsidies-available-under-healthier-sg-chronic-tier-from-feb-1"}