{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:56:29", "date_modify": "2024-10-12 13:56:29", "date_publish": "2023-12-11 12:20:00", "description": "In the week ended Dec 2, there were 32,035 Covid-19 cases recorded, the highest number in 2023 up to that point. Read more at straitstimes.com.", "filename": "singapore_go-to-the-gp-polyclinic-if-covid-19-symptoms-are-mild-stop-hospital-bed-crunch_1728741389.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/11/a963e443-d4c1-4205-89f0-79b4afec1393.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_go-to-the-gp-polyclinic-if-covid-19-symptoms-are-mild-stop-hospital-bed-crunch_1728741389.html", "title": "Covid-19 patients with mild symptoms urged to visit clinics to ease hospital bed crunch", "title_page": "Covid-19 patients with mild symptoms urged to visit clinics to ease hospital bed crunch | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Public hospitals are urging individuals with mild to moderate symptoms of Covid-19 to visit a general practitioner clinic or polyclinic near their home.\nThese clinics will refer the patients to an emergency department (ED) or a specialist for outpatient care, if needed.\nThe call came as Covid-19 infections and hospitalisation numbers increase, putting a strain on hospitals in Singapore.\nA retiree in her late 70s, who does not want to be named, said she was discharged from the Singapore General Hospital (SGH) after being admitted for three nights for lung infection.\nThis took place in the last week of November, the week of the highest number of Covid-19 infections recorded in 2023 up to that point.\nShe said that while the initial triage and tests at the ED at 9.30am on Nov 25 were “fast and efficient”, the wait for a bed in the ward was “painful”.\nThe retiree said she saw patients on trolley beds along the corridors outside the ED observation rooms as she was being wheeled to the holding area.\n“I was told there were no beds available in the wards as they were fully occupied. I was then put in a huge unisex hall near Outram Community Hospital.\n“It felt like being at Grand Central station (in New York City), with the constant traffic of patients being wheeled in from the emergency room and patients going to their wards,” she said.\nIn his reply to The Straits Times, acting chairman of the Division of Medicine at SGH Geoffrey Samuel said patients from the ED “may be housed in a transient ward at our linkway to Outram Community Hospital” while awaiting admission.\n“We recognise that the physical environment may not be ideal, but would like to give the assurance that patients receive the same level of medical care as they would in a normal ward. Our colleagues also ensure that patients remain comfortable while waiting,” he said.\nHe added that patients who are in a less critical condition can receive appropriate care through alternative avenues, including Mobile Inpatient Care @ Home, where patients receive hospital-level care while at home.\n“Suitable patients from the ED and inpatient wards are also transferred to the Outram Community Hospital or transitional care facilities for step-down care,” he said.\nIn the week that ended on Dec 2, 32,035 people were diagnosed with Covid-19 – the highest number of infections recorded up to that point in 2023.\nThe Ministry of Health (MOH) raised the alert on Dec 8, but it reassured people that this number was not as high as that during the pandemic, and that the circulating variants were not known to cause more severe illness.\nMOH also said the average daily Covid-19 hospitalisations rose to 225 from 136 the week before. The average daily intensive care unit cases rose to four from one case in the previous week.\nThe ministry said then that the rise “could be due to a number of factors, including waning population immunity and increased travel and community interactions during the year-end travel and festive season”.\nWith the bed crunch in hospitals being a reality again, patients are finding themselves in holding areas for longer periods.\n“Although the doctors did make their rounds in the hall, I was not able to rest (while waiting for a bed in the ward).\n“Men and women were put together in the same hall. The woman next to me was ranting loudly, while another was groaning in pain. I managed to get a bed just after midnight,” the retiree said.\nSGH has also moved more elective inpatient surgery cases to day surgery.\n“Some patients are cared for in a short-stay ward where they are monitored for less than 24 hours after the (day) surgery. This initiative helps free up hospital beds for acute admission from the ED,” Dr Samuel said.", "url": "https://www.straitstimes.com/singapore/go-to-the-gp-polyclinic-if-covid-19-symptoms-are-mild-stop-hospital-bed-crunch"}