{"authors": ["Rachel Au-Yong"], "date_download": "2024-10-12 13:30:01", "date_modify": "2024-10-12 13:30:01", "date_publish": "2018-02-20 05:00:00", "description": "The higher stamp duty, which has not been changed since 1996, is in line with other changes to the tax system to make it more progressive. Read more at straitstimes.com.", "filename": "singapore_higher-stamp-duty-not-a-cooling-measure-analysts_1728739801.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/02/20/st_20180220_vngem_3775565.jpg?VersionId=jc1D6a5rTMXifqLOTGf3q_57M_jV8ltl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_higher-stamp-duty-not-a-cooling-measure-analysts_1728739801.html", "title": "Singapore Budget 2018: Higher stamp duty not a cooling measure, say analysts", "title_page": "Singapore Budget 2018: Higher stamp duty not a cooling measure, say analysts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A 47-year-old housewife saved $67,000 when she signed on the dotted line to buy a $7.7 million flat in New Futura condominium yesterday, minutes after Finance Minister Heng Swee Keat announced a higher stamp duty for home buyers.\nFrom today, the stamp duty on the value or price of a home above $1 million will be taxed at 4 per cent, instead of 3 per cent.\nAs the stamp duty is tiered, this means the first $180,000 of the four-room flat bought by the permanent resident will be charged at 1 per cent, the next $180,000 at 2 per cent, the next $640,000 at 3 per cent, and the remaining $6.7 million at 4 per cent.\nThe higher stamp duty, which has not been changed since 1996, is in line with other changes to the tax system to make it more progressive, Mr Heng said, adding that the Government \"will continue to study options to ensure that our tax system remains progressive\".\nThe rates for non-residential properties, however, remain unchanged, he added.\nWhile the move caught many by surprise - Mr Heng announced it at about 5.20pm, when most showflats and law offices were closing - analysts were quick to point out that it was not a cooling measure, but a tax on those with higher incomes.\nThey noted that most home owners will not be affected, as only a handful of Housing Board flats exceed the $1 million mark every year.\nEven among those affected, many will see only a marginal increase in taxes, as 36 per cent of private residential property transactions go for below $1 million, while another one-third buy homes valued at between $1 million and $1.5 million, said ERA Realty key executive officer Eugene Lim.\nFor a $1.5 million home, this works out to $5,000 in additional taxes, which is not a significantly large sum \"to affect the current momentum adversely\", he added.\nIn fact, the higher stamp duty is unlikely to dampen buying demand, as private property prices are expected to grow between 5 per cent and 7 per cent this year, said Cushman & Wake-field Research head Christine Li .\nShe noted that since the duty is progressive, the effective increase in additional taxes paid is only about 0.5 percentage point for a $2 million property, and around 0.9 point for a $10 million property. Still, she said, the increase may sway some to buy a smaller home in suburban areas.\nNew launches would also benefit as the current mix of homes in most condominiums tends to tilt towards smaller units.\nDevelopers keeping an eye on the market for collective sales, however, may \"pull back a little\", as the stamp duty would be hefty for such deals, which run into the hundreds of millions of dollars, she added.\nHuttons research head Lee Sze Teck said the Government is \"sending a little signal that they are monitoring the market and do not want to see prices increasing beyond fundamentals\".\nHe also noted that many who signed the Option to Purchase (OTP) yesterday could have done so as a knee-jerk reaction. The OTP is a legal document that gives a buyer the exclusive right to buy a flat.\nTo enjoy the old stamp duty rate, these buyers have to confirm the purchase within three weeks of Mr Heng's announcement, meaning by March 12.\nSingapore's two biggest realty companies, PropNex and ERA, said at least 15 OTPs were signed in all for flats above $1 million yesterday, calling the total \"abnormally high\" after a Chinese New Year weekend.\nSaid agent Douglas Fun, who sold the New Futura flat to the housewife, who had been house-hunting for three months: \"Even though rich people are rich, the 1 point increase is not insignificant. It is still money which they can avoid spending.\"", "url": "https://www.straitstimes.com/singapore/higher-stamp-duty-not-a-cooling-measure-analysts"}