{"authors": ["Elisa Chia"], "date_download": "2024-10-12 13:29:57", "date_modify": "2024-10-12 13:29:57", "date_publish": "2024-08-11 15:00:00", "description": "Make family time all the more special with these ideas and activities. Read more at straitstimes.com.", "filename": "singapore_parenting-education_fun-with-kids-yo-gabba-gabbaland-lovevery-play-kits_1728739797.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/11/aigabba110824.jpg?VersionId=M279d_SCOW6r1rbbc5CbdXZAqOlmi.15", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_parenting-education_fun-with-kids-yo-gabba-gabbaland-lovevery-play-kits_1728739797.html", "title": "Fun With Kids: Yo Gabba GabbaLand!, Lovevery play kits", "title_page": "Fun With Kids: Yo Gabba GabbaLand!, Lovevery play kits | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Make family time all the more special with these ideas and activities.\nYo Gabba GabbaLand!\nChildren’s musical television series Yo Gabba Gabba! gets a second life on Apple TV+, with 10 episodes released on Aug 9.\nThe series, which ran on Nickelodeon from 2007 to 2015, is remembered for its toy characters: Brobee the green broccoli bee, Foofa the pink flower bubble, Muno the red cyclops, Toodee the blue cat-dragon and Plex the yellow robot.\nIt was also known for its indie-culture guest celebrities.\nNow titled Yo Gabba GabbaLand!, the new season features American musicians and bands such as Thundercat, The Drums and The Interrupters. Catch them performing songs that tie back to each episode’s themes, including creativity, growth and friendship.\nThere are also storytelling segments by American actors such as Sam Richardson and Utkarsh Ambudkar.\nLovevery subscription-based play kits\nWhat are the right toys and play activities to support your kids’ development? Lovevery wants to help you take out the guesswork. Its range of play kits is designed for newborns and children up to four years old.\nFounded in the United States, the brand works with academics, researchers and practitioners in early childhood learning.\nA box of play items tailored to your child’s growth stage will be sent to your door every two to three months upon subscription. Each set also comes with a parent’s guide, suggesting ways that you can engage your kids as they play.\nFor example, a kit for children from 43 to 45 months old comes with a set of Montessori-inspired number tiles. Parents are encouraged to use words like “more, less, most, least, first and last” to build their kids’ maths vocabulary.\nSingapore subscribers can shop on lovevery.com.au with free shipping from its Singapore facility. It costs A$130 (S$113) a play kit curated for babies under 12 months old and A$195 a kit for children aged one to four.\nMaths And Coding Adventures activity books\nLocal coding school The Lab has released its first series of activity books.\nRecommended for children aged five to seven, Maths And Coding Adventures For Young Explorers has fun exercises that introduce coding concepts by integrating mathematics skills.\nFor example, as your kids learn to identify number sequence, they will also understand that it is an important skill in coding. That is because programming tasks often involve working with patterned data.\nAnd when they work their way through maze puzzles, they are also developing essential programming skills such as algorithmic thinking and problem-solving.\nPublished by Educational Publishing House, the books retail for $9.90 each and are available at Popular Bookstore.", "url": "https://www.straitstimes.com/singapore/parenting-education/fun-with-kids-yo-gabba-gabbaland-lovevery-play-kits"}