{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 13:53:59", "date_modify": "2024-10-12 13:53:59", "date_publish": "2024-02-02 05:00:00", "description": "Fares affordability and reliability are key focuses for Grab this year, said the firm's Singapore managing director. Read more at straitstimes.com.", "filename": "singapore_transport_fare-affordability-and-service-reliability-key-focuses-for-grab-in-2024-singapore-md_1728741239.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/02/20240130121415526ad858f4-7728-4834-ba84-026340bcb9ed.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_fare-affordability-and-service-reliability-key-focuses-for-grab-in-2024-singapore-md_1728741239.html", "title": "Affordable fares a focus for Grab in 2024, plans to improve ride-sharing and carpooling services", "title_page": "Affordable fares a focus for Grab in 2024, plans to improve ride-sharing and carpooling services | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Keeping fares affordable, boosting driver income and improving service reliability will be key focuses for ride-hailing giant Grab in 2024, said its Singapore managing director Yee Wee Tang.\nAfter largely tackling a driver supply crunch that drove fares to eye-watering levels in 2023, the Nasdaq-listed company has now found “a good balance”, Mr Yee told The Straits Times in an interview.\n“There are obviously segments who say the fare is too high, and some drivers will say it is too low... I think we have found a good spot from our point of view,” he said.\nHowever, the 47-year-old, who has been helming Grab’s operations in the city-state since 2019, acknowledged that fares are still high when there is rain or major events due to surge pricing.\nHence, the company has plans to improve its ride-sharing service GrabShare and carpooling service GrabHitch, which Mr Yee said are lower-cost options.\nGrab is also trying to be smarter in how it deals with situations that lead to a big surge in fares. For instance, it is looking at possibly incorporating weather forecasts into its app to better direct drivers during downpours.\nMr Yee said efforts to lower fares in 2023 may have led to lower income for some drivers, so the aim in 2024 is to improve or at least protect their earnings.\nHe defended the changes made in late 2023 to Grab’s commission structure, which drew ire from some drivers as they felt it would hurt their takings. Asked if there was mistrust between Grab and its drivers, Mr Yee said the company has been as transparent as possible, and it continues to listen to feedback.\nInstead of a fixed rate, Grab drivers are charged a commission that changes based on the distance travelled and time taken to pick up passengers.\nTo boost the adoption of GrabShare, which is still in beta mode more than a year after it was relaunched, Grab will have its app display the estimated travel time for shared rides.\nIt is also exploring a feature that will inform users waiting to get a ride about a potential GrabShare match in their area.\nGrab said the biggest reason passengers do not use the service is that they do not know how much longer it would take to reach their destinations compared with a regular ride. By addressing this, the hope is more will give it a try.\nWhen asked, Mr Yee declined to reveal the current take-up for GrabShare. He would only say the take-up rate is “quite healthy” and that the company is “nearly there in terms of percentage of rides”.\nThe use of GrabHitch, however, has not grown much, and the product needs a revamp, Mr Yee added.\nTo encourage more drivers to carpool, improvements will be made to help them find a GrabHitch passenger faster, Grab later said, without elaborating.\nSeparately, a feature to help passengers hail a ride faster will be tested with a small group of Grab users next week and rolled out to all Singapore users in February if the experiment is successful.\nMr Yee hopes the review will lead to ride-hailing becoming more inclusive, noting how young families face issues when booking private-hire cars, as drivers need to have two different child seats to cater for children of different heights.\nGrab will also need to comply with a new set of policies kicking in from the second half of 2024 that will grant employee-like levels of work injury compensation insurance and Central Provident Fund contributions to its drivers and deliverymen.\nHe said Grab is supportive of the added protections for gig workers, but there are details yet to be finalised. A concern is whether administrative costs will skyrocket as a result.\nMr Yee noted that any additional costs, which “can be substantial if we don’t do it right”, will need to be shared.\nThere is the likelihood that a sizeable chunk of this will be passed on to consumers.\nGrab, he said, is trying to reduce the extra costs with the use of technology, though he did not provide specifics.\nIn the food delivery space, Grab is also looking to cut costs, for the company and customers, as it continues to gain market share.\nOne way is to batch more orders together, which lowers the delivery fee and increases productivity for delivery riders, and Grab is looking to introduce a group-order feature, Mr Yee said.\nWith flagging demand and merchants grappling with labour shortages, the company is closing its two remaining cloud kitchens in Hillview and Jurong, pending ongoing negotiations with the landlord and those affected.\nMeanwhile, the company is shifting focus towards dine-in restaurants, by allowing users to buy vouchers on the app that they can use at bricks-and-mortar outlets.\nMr Yee expects ride-hailing demand to continue rising in 2024, citing a projected increase in tourist arrivals, the line-up of concerts and major events, and more workers returning to offices.\nNoting that the number of private-hire vocational licence holders has climbed more than 10 per cent since January 2023, he said supply is returning and Grab will roll out more productivity tools to help drivers earn more and meet the growing demand.\nBut it is not all rosy and there are still issues to resolve.\n“We do find supply challenging at night. After 9pm, we still have supply shortages,” Mr Yee added.", "url": "https://www.straitstimes.com/singapore/transport/fare-affordability-and-service-reliability-key-focuses-for-grab-in-2024-singapore-md"}