{"authors": ["Ng Wei Kai"], "date_download": "2024-10-12 13:37:28", "date_modify": "2024-10-12 13:37:28", "date_publish": "2024-07-05 18:45:00", "description": "Mr Chan also urged people to avoid “the laziness of mind” that reduces complex global issues to simplistic binaries. Read more at straitstimes.com.", "filename": "singapore_politics_leaders-must-be-honest-with-the-people-about-challenges-seek-sustainable-solutions-chan-chun-sing_1728740248.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/05/2024070526745197ga30015.jpg?VersionId=VTaIoozXsuvofFmJhZeCyfoJyRaWaK.b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_leaders-must-be-honest-with-the-people-about-challenges-seek-sustainable-solutions-chan-chun-sing_1728740248.html", "title": "Leaders must be honest with the people about challenges, seek sustainable solutions: Chan Chun Sing", "title_page": "Leaders must be honest with the people about challenges, seek sustainable solutions: Chan Chun Sing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – In an age of uncertainty, leaders must be honest with their people about challenges, rather than externalise problems, seek easy solutions or reduce complex global issues to binary labels, said Education Minister Chan Chun Sing.\nSpeaking at the launch of a new book by international affairs scholar Joseph Liow, Mr Chan said leadership is paramount in a world where there are conflicts around the world, protectionism is rising, and politics is becoming more polarised.\nTo navigate this era, Singapore needs leaders who are courageous in communicating the truth, make tough decisions and work towards sustainable solutions, he told an audience of close to 100 people at the event at the Lee Kuan Yew School of Public Policy on July 5.\nFor instance, protectionism may appear to be a quick fix for fierce global competition, but this will not enhance global efficiency nor will it improve Singaporeans’ lives in the long run, he said. Trading with others means adjusting industries and jobs, and key for Singapore is helping its people manage these changes, said Mr Chan.\nThe way to deal with rapid changes in technology is to invest in education and training so that people can reskill to seize new opportunities, while policies to provide equitable access to opportunities can mitigate the unequal distribution of economic growth, he added.\n“These tasks demand leadership with honesty, gumption and vision,” he said.\nChoosing sides in a polarised world is unconstructive, Mr Chan added.\nWhile it takes much more effort to bridge differences and find new ways to cooperate, that is the only way forward that fosters peace and stability, he stressed.\nSingaporeans can do so by deepening their understanding of the global forces at play, and how they impact partner countries’ motivations and actions in order to find space for feasible collaboration, he said.\nHe noted that Professor Liow’s new book – Navigating Uncertainty: Our Region In An Age Of Flux – makes this point, reframing the question from who Singapore chooses to partner, to how to make others choose Singapore.\nHe urged people to avoid “the laziness of mind” that reduces complex global issues to simplistic binaries, such as good versus evil, or democratic versus authoritarian. “These labels hinder our ability to find common ground.”\nHe also stressed that historical interpretations of contemporary actions can illuminate, but may also end up confining countries’ choices.\n“We are all familiar with the saying, ‘Those who do not read history are bound to repeat it’. Yet, at the same time, I must say those who are captured by history are also equally bound to repeat it – if we use old concepts, then we become prisoners of those ideas,” he said.", "url": "https://www.straitstimes.com/singapore/politics/leaders-must-be-honest-with-the-people-about-challenges-seek-sustainable-solutions-chan-chun-sing"}