{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:50:31", "date_modify": "2024-10-12 13:50:31", "date_publish": "2023-11-30 10:00:00", "description": "At least 35 young people from Singapore will be attending the conference. Read more at straitstimes.com.", "filename": "singapore_who-are-the-young-s-poreans-heading-to-cop28-and-what-are-some-key-things-to-watch_1728741031.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/30/wgt-cop28wyws-281123.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_who-are-the-young-s-poreans-heading-to-cop28-and-what-are-some-key-things-to-watch_1728741031.html", "title": "Who are the young Singaporeans heading to COP28 and what are the key things to watch?", "title_page": "Who are the young Singaporeans heading to COP28 and what are the key things to watch? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Just days before the start of the United Nations COP28 climate conference in Dubai, heavy rain and thunderstorms flooded parts of the desert city for the first time.\nComing on the back of a series of extreme weather events that have surfaced in 2023 – from heatwaves in Brazil to flash floods in Libya – the realities of climate change have never been more apparent. Countries have a long list of items that need to be hammered out from Nov 30 to Dec 12, with a crucial goal of limiting global warming to 1.5 deg C.\nAt least 35 young people from Singapore will be attending the conference, 20 of whom are part of the Government’s inaugural climate youth development programme to groom and empower sustainability champions.\nThe Straits Times speaks to four of the youth heading to the event, and finds out what they care about.\n1. Science teacher turned content creator Kong Man Jing wants to raise awareness\nThe 29-year-old, who usually produces fun and entertaining videos on science and nature, hopes to find a way to make the COP28 happenings relatable too.\n“We cannot protect something we do not love, and we cannot love what we do not know. So that’s what I’ve set out to do – educate people through powerful storytelling, and maybe the fate of planet earth can have a better outcome,” said Ms Kong.\nREAD MORE HERE\nWhat is COP28, and what are some of the issues on the agenda in 2023?\nThese range from addressing loss and damage to ensuring sufficient climate finance is channelled from developed nations to developing ones. Ensuring that countries cut greenhouse gas emissions drastically and have an ability to adapt to climate impacts will also be crucial.\nREAD MORE HERE\n2. Water researcher hopes to help poorer countries have a sustainable water supply\nReading about the devastating floods that struck Pakistan in 2022 left an indelible impact on Mr Naeem Nadzri, 26, who is looking at ways to recover precious minerals from desalination as part of his doctorate pursuit at Nanyang Technological University.\nHe hopes to be part of efforts to help create a sustainable water supply for all the world’s populations, rich or poor.\nREAD MORE HERE\nHow is climate change linked to water scarcity?\nAs the world warms, frequent extreme weather disasters from floods to droughts to sea-level rise will deplete clean water resources, highlighting the need for countries to manage water use sustainably and find new sources of water.\nREAD MORE HERE\n3. NUS researcher wants to find ways to channel more finance into conserving nature\nHaving seen the spectrum of Singapore’s sustainability efforts from bolstering food security to investments in clean water technologies, Ms Shakura Bashir, 33, has set her sights on nature.\nThrough her doctorate pursuit at NUS, she hopes to find ways to channel more finance towards conserving nature, to address the twin challenges of climate change and biodiversity loss.\nREAD MORE HERE\nRole of carbon markets in tackling climate change\nOne way of channelling finance to nature is through carbon credits, which would also help countries to meet their climate targets by reducing greenhouse gas emissions. A number of issues related to this will need to be sorted out at COP28.\nREAD MORE HERE\n4. Sustainability advocate on a mission to tell simple, engaging stories on complex climate issues\nMs Woo Qiyun, 26, made her foray into the sustainability advocacy space as she wanted to educate the public about banning the ivory trade in Singapore.\nThis ignited her passion to create climate-related comics and illustrations to make complex concepts relatable and easy to understand.\nREAD MORE HERE\nA health check on Paris Agreement goals\nA key prong of COP28 is the global stocktake, which is also known as a health check on the goals of the Paris Agreement, which was signed in 2015 to limit global warming to 1.5 deg C.\nThe process, which is meant to conclude in Dubai, is crucial in determining how and the extent to which countries have to expand their climate ambition in response to the report’s findings.\nREAD MORE HERE", "url": "https://www.straitstimes.com/singapore/who-are-the-young-s-poreans-heading-to-cop28-and-what-are-some-key-things-to-watch"}