{"authors": ["Samuel Devaraj"], "date_download": "2024-10-12 13:57:18", "date_modify": "2024-10-12 13:57:18", "date_publish": "2024-05-26 16:20:00", "description": "Pasir-Ris Punggol MP Teo Chee Hean said TCM can help and encourage residents to stay healthy and stay fit. Read more at straitstimes.com.", "filename": "singapore_community_free-tcm-clinic-opens-in-punggol_1728741438.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/26/aitcm260524.jpg?VersionId=8USesMhiGjuIJtgYHk_nPNwl3gSRWxsA", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_community_free-tcm-clinic-opens-in-punggol_1728741438.html", "title": "Free TCM clinic opens in Punggol", "title_page": "Free TCM clinic opens in Punggol | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A new clinic providing free traditional Chinese medicine (TCM) services officially opened in Punggol on May 26.\nSeu Teck Medical Institution (Punggol Branch) at Block 176A Edgefield Plains provides services such as consultation, dispensary services, acupuncture and therapeutic tuina massage.\nThe clinic, which has been running since March, has two physicians.\nThis is the third free TCM clinic operated by Seu Teck Medical Institution, a charity managed by Bukit Timah Seu Teck Sean Tong Institution. The other two are in Jurong East and Clementi.\nAll three clinics rely entirely on donations to sustain their operations.\nPasir Ris-Punggol MPs Teo Chee Hean and Yeo Wan Ling were at the new Punggol branch’s official opening.\nSpeaking at the event, Senior Minister Teo said TCM plays a very important role in helping and encouraging residents to stay healthy and stay fit.\n“Many of the residents want to live a happy and healthy life, and they also believe in a good balance in the body and in the environment, and the TCM techniques help us to find that,” he said.\nMs Yeo told the media that while Punggol is often thought of as a young town, there are areas like Punggol Shore – her constituency – that have quite a number of seniors.\nTo provide amenities for these residents, discussions with Seu Teck Medical Institution began in 2022 to see how they could engage the community.\nThe new clinic close to the residents brings them convenience, she added.\n“I think the Healthier SG message by the Government is resonating well in the community and so people are actually taking charge of their care,” said Ms Yeo, adding that many of the seniors welcome TCM as a form of treatment.\nEdgefield Plains resident Jim Bek, who is in his 60s, was diagnosed with terminal jaw cancer in January 2023.\nHe said he had issues with his sight since he was young, but his vision deteriorated further after his cancer and treatment.\nHis hearing has also been affected, as well as his sense of touch.\nHe has been visiting the clinic almost every week, and said with treatment, which includes acupuncture, the pain in his hands has lessened.\nMr Bek, who is a counsellor, said: “When the facility is near my home, it gives me a lot of liberty to come down at my own time.”", "url": "https://www.straitstimes.com/singapore/community/free-tcm-clinic-opens-in-punggol"}