{"authors": ["Wong Shiying"], "date_download": "2024-10-12 13:31:22", "date_modify": "2024-10-12 13:31:22", "date_publish": "2022-08-02 22:11:13", "description": "She sustained cuts and bruises on her legs but has since been discharged from hospital. Read more at straitstimes.com.", "filename": "singapore_maid-taken-to-hospital-after-suspected-gas-explosion-in-upper-paya-lebar_1728739882.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/02/sv_kitchen_02082022.jpg?VersionId=PJ8iXhv4NbI0csrecW_xm7iLB_vuCESp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_maid-taken-to-hospital-after-suspected-gas-explosion-in-upper-paya-lebar_1728739882.html", "title": "Maid taken to hospital after suspected gas explosion in Upper Paya Lebar", "title_page": "Maid taken to hospital after suspected gas explosion in Upper Paya Lebar | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A migrant domestic worker in her 30s was taken to hospital on Monday afternoon (Aug 1) after a suspected gas explosion at a landed property in Upper Paya Lebar Road.\nHer employer, who wanted to be known only as Mr Lim, told The Straits Times on Tuesday that the maid had sustained cuts and bruises on her legs. She has since been discharged from hospital.\nMr Lim, a retiree in his 60s, said he heard a loud bang at around 11.30am on Monday. When he went to check, he saw his domestic helper running out of the kitchen.\n\"My maid was in a state of shock and there were cuts on her leg. The (sliding) door of the stove cabinet where the gas cylinder is kept had shattered into pieces on the kitchen floor,\" he said.\nMr Lim said his domestic helper from Myanmar has been in his household for over eight years.\nThe Singapore Civil Defence Force (SCDF) said on Tuesday that it had been alerted to a fire in Upper Paya Lebar Road at around 11.50am on Monday.\nThe fire, which involved contents of a stove cabinet in the kitchen, had burnt itself out before firefighters arrived, said SCDF.\nIt added that a person was taken to Raffles Hospital, and the cause of the fire is under investigation.\nMr Lim said a Tan Bros Gas Supply employee conducted checks in his home after the incident and found that a gas cylinder hose had been damaged.\n\"He told me that rats had most likely chewed through the hose, causing a gas leak,\" he added.\nST has contacted Tan Bros Gas Supply for comment.\nA video of the aftermath of the explosion seen by ST shows the sliding door of the stove cabinet had been completely blown off. There were holes in the false ceiling of the kitchen and chunks of debris on the floor.\nA neighbour, Mr William Yap, 74, said he heard the explosion while cooking and was shocked by how loud it was.\nThe retiree said in Mandarin: \"After making sure the explosion was not in my home, I ran next door. There was no fire in the kitchen of the affected house where a number of neighbours had gathered outside.\n\"The maid's leg was bleeding and she was too stunned to speak. I got a chair for her and went into the house to turn off the gas stove.\"\nMr Yap added that this was the first such incident in his more than 40 years living in the estate.\nAnother neighbour, Mr Wilfred Liang, told ST that he called SCDF after he saw what had happened.\n\"There was a foul smell coming from the kitchen, like that of rotten eggs. I saw the maid being supported by another domestic helper living next door. She was in pain and could barely stand up,\" he added.\nMr Liang, a clinical case manager in his 30s, said she had sustained cuts and there were multiple patches of redness and swelling on both legs.\n\"The maid was visibly distressed, shaken by the event and was in tears,\" he said.\nHe noted she did not appear to have any visible injuries to her head and vital areas and was accompanied by her employer to the hospital.", "url": "https://www.straitstimes.com/singapore/maid-taken-to-hospital-after-suspected-gas-explosion-in-upper-paya-lebar"}