{"authors": ["Charmaine Ng"], "date_download": "2024-10-12 13:29:52", "date_modify": "2024-10-12 13:29:52", "date_publish": "2018-02-19 18:07:49", "description": "All you need to know about Budget 2018 in 3 minutes. Read more at straitstimes.com.", "filename": "singapore_singapore-budget-2018-12-highlights-from-minister-heng-swee-keats-speech_1728739792.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/02/19/budget-hsk-1902.jpg?VersionId=mF2.kFnCizeZ_5gBnlfdEi86Pcs.altn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-budget-2018-12-highlights-from-minister-heng-swee-keats-speech_1728739792.html", "title": "From GST hike to budget surplus hongbao: 12 highlights from Heng Swee Keat's 2018 speech", "title_page": "From GST hike to budget surplus hongbao: 12 highlights from Heng Swee Keat's 2018 speech | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Finance Minister Heng Swee Keat presented the Budget before Parliament on Monday (Feb 19), laying out the Government's revenue and expenditure for the 2018 financial year.\nKicking off his speech, he said the economy picked up last year, with Singapore's gross domestic product (GDP) increasing by 3.6 per cent - up from 2.4 per cent in 2016.\nProductivity and real median income also increased last year, he added.\nFor the next fiscal year, he announced a crop of key measures focused on developing an innovative economy, a smart and green city, a caring and cohesive society, and a fiscally sustainable future.\nHere are 12 key highlights from his speech.\n1. GST will be raised by 2 percentage points\nThe goods and services tax will be increased for the first time in more than a decade, from 7 per cent to 9 per cent.\nThe increased GST will be implemented some time from 2021 to 2025. Mr Heng said he expected that the Government would \"need to do so earlier rather than later\".\nThe timing of the raised GST will depend on the state of the economy, how much expenditures grow, and how buoyant existing taxes are, said Mr Heng.\nTo help lower-income households cope, the permanent GST Voucher scheme will be topped up by $2 billion. Currently, $800 million is given out a year.\nGST on publicly subsidised education and healthcare will continue to be absorbed.\n2. Help for households\nIn the light of the impending GST increase from 2021 to 2025, the permanent GST Voucher scheme will be enhanced with a $2 billion top-up to the fund.\nOther announcements for households also include increased Proximity Housing Grants for families and singles, and the extension of the service and conservancy charges rebate for another year.\nThe GST will also cover imported services for businesses here, such as marketing, accounting, IT and management services.\nHowever, the move will not affect e-commerce for goods.\n4. Buyer's Stamp Duty rates for residential properties to increase\nIn a surprise announcement, Mr Heng said the top marginal Buyer's Stamp Duty (BSD) will increase from 3 per cent to 4 per cent.\nThe new top marginal rate will apply to the portion of residential property value which is in excess of $1 million.\nThe change will apply to all residential properties acquired from Tuesday (Feb 20), Mr Heng added.\nRates for non-residential properties remain unchanged at 1 per cent to 3 per cent.\n5. Tobacco excise duty to increase by 10%\nTobacco excise duty will increase by 10 per cent, in efforts to discourage consumption of tobacco products.\nThe increased duty will take effect from Monday (Feb 19), said Mr Heng.\n6. Extended measures to help businesses with costs\nThe Wage Credit Scheme, which helps co-fund wage increases for Singaporean employees up to a gross monthly wage of $4,000, will be extended for another three years.\nFor FY2017, more than $800 million will be paid out to more than 90,000 firms, for wage increases for more than 600,000 employees.\nRebates under the Corporate Income Tax scheme will also be raised, from 20 per cent to 40 per cent this year. The cap will be raised from $10,000 to $15,000.\nThe scheme will also be extended to next year, where firms will receive 20 per cent rebate capped at $10,000.\n7. Foreign worker levy increases to be deferred\nThe earlier-announced increases in foreign worker levy rates will be deferred for the marine shipyard and process sectors, which still face weakness.\nThere will be no change in the increases in rates for all other sectors.\n8. Measures to promote innovation\nAmong the new measures include a productivity solutions grant to be introduced to make it easier for companies to access support to adopt off-the-shelf technology and productivity solutions.\nThe tax deduction on licensing payments for the commercial use of intellectual property will also be raised.\n9. Carbon tax to be introduced\nAll facilities that produce 25,000 tonnes or more in greenhouse gas emissions a year will be taxed on their total emissions.\nThe carbon tax will be $5 per tonne of greenhouse gas emissions from 2019 to 2023, by which the tax rate will be reviewed.\nThe Government plans to increase the rate to between $10 and $15 per tonne of emissions by 2030.\nHouseholds will receive additional $20 under the Utilities-Save GST Voucher for three years, to help offset the impact of the carbon tax on electricity and gas consumption.\n10. Save and borrow for infrastructure expenditure\nWhere possible, the Government will save ahead to prepare for costly infrastructure investments, such as the Changi Airport Development Fund set up in 2015 for the upcoming Terminal 5.\nIt is also considering borrowing by statutory boards and government-owned companies that build infrastructure, to help spread the cost of larger investments over more years.\nTo help lower the financing cost, Mr Heng said, the Government is \"considering providing guarantees for some of these long-term borrowings for critical national infrastructure\".\n11. Hongbao from FY2017's budget surplus\nThanks to a budget surplus in FY2017, all Singaporeans aged 21 and above will receive a \"hongbao\" of up to $300 this year, depending on their annual income.\nThose who earn $28,000 and below a year will receive $300, while those earning $28,001 to $100,000 will receive $200.\nSingaporeans who earn more than $100,000 a year or who own more than one property will receive $100.\nThe bonus, which will cost the Government $700 million, comes from this year's budget surplus of $9.6 billion.\n12. Expected 'slight' budget deficit in FY2018\nTotal expenditures of the ministries are expected to increase by 8.3 per cent in FY2018, at $80 billion, said Mr Heng.\nOn the whole, it is expected that there will be a \"slight overall budget deficit\" of $0.6 billion, which makes up 0.1 per cent of Singapore's GDP.", "url": "https://www.straitstimes.com/singapore/singapore-budget-2018-12-highlights-from-minister-heng-swee-keats-speech"}