{"authors": ["Nadine Chua"], "date_download": "2024-10-12 14:20:02", "date_modify": "2024-10-12 14:20:02", "date_publish": "2023-10-03 13:12:25", "description": "The authorities got wind of the money laundering case in 2021, said Mrs Josephine Teo. Read more at straitstimes.com.", "filename": "singapore_politics_money-laundering-case-among-world-s-largest-with-assets-seized-worth-over-28b_1728742802.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/03/rrmoneylaundering0310.png?h=de8fe406", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_money-laundering-case-among-world-s-largest-with-assets-seized-worth-over-28b_1728742802.html", "title": "S’pore money laundering case among world’s largest with assets seized worth over $2.8b", "title_page": "S’pore money laundering case among world’s largest with assets seized worth over $2.8b | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The first sign of trouble, that something big was afoot, came in 2021 when the authorities noticed possibly forged documents being used to substantiate sources of funds in bank accounts here.\nSo as not to alert the suspected money launderers, only a small group of police officers was involved in initial investigations.\nAfter an extensive probe in 2022, the police uncovered a web of people allegedly transferring money to Singapore from abroad that was suspected to be earned from criminal activities. Some of the people were connected by family ties.\nThe assets seized or issued with prohibition of disposal orders following islandwide raids conducted on Aug 15 are now worth more than $2.8 billion, making it one of the world’s largest money laundering cases.\nSecond Minister for Home Affairs Josephine Teo said this in a ministerial statement on Tuesday to address about 60 parliamentary questions filed on the case.\nShe said the authorities were alerted in 2021 when they picked up several signals, including the use of suspected forged documents to support sources of funds in bank accounts here.\nSome suspicious transaction reports (STRs) were filed by financial institutions and other companies, and the police investigated these alerts.\nIn early 2022, the police launched an extensive intelligence probe that uncovered a web of people believed to be connected to one another, including by familial ties.\nMrs Teo said: “The police analysed the information and probed further, quietly. To avoid alerting the suspects, the work was kept to a very small group of officers, and a decision was made to hold off any enforcement or overt investigative actions.”\nShe said the aim of the police was to develop as full a picture as possible of the suspects and their associates, their suspected criminal activities and their assets, before moving against them.\nMrs Teo added: “As the probe progressed, the web uncovered by the police grew and grew.\n“More and more individuals were implicated in the alleged money laundering operation, and more and more of their assets held in Singapore were discovered. The police painstakingly and discreetly traced their ties and assets.”\nShe highlighted that anti-money laundering probes of this scale and nature are complex.\nShe said: “Had the suspects caught wind of our probes, the suspects and their assets might have fled, and the investigations and the entire operation might have been jeopardised.”\nIn an update on the case, which is now before the courts, Mrs Teo said the proceeds most likely came from criminal activities abroad, including illegal online gambling and unlicensed moneylending.\nThere are others who have not been arrested but are assisting with investigations, she said. Other individuals are wanted by the police for investigations, but are not in Singapore.\nShe said the police had conducted further operations, and the authorities have taken control of over $2.8 billion worth of assets.\nThese assets include 152 properties and 62 vehicles with an estimated value of more than $1.24 billion, money in bank accounts amounting to more than $1.45 billion, and cash of various currencies worth more than $76 million.\nOther items include thousands of bottles of liquor and wine, cryptocurrency worth more than $38 million, 68 gold bars, 294 luxury bags, 164 branded watches and 546 pieces of jewellery.\nTo ensure that the country’s strategy to tackle money laundering remains robust, an inter-ministerial committee, led by Second Minister for Finance Indranee Rajah, will be set up to oversee the Government’s anti-money laundering efforts.\nNoting that the police’s investigations in this case had strengthened Singapore’s reputation as a serious, high-quality financial hub, Mrs Teo said: “It will strengthen trust and confidence among investors, and Singaporeans, that we run a clean system that stands amongst the tallest in the world.”\nWhen rounding off her statement, she said: “Singapore has in place a robust anti-money laundering regime. We are held in high regard internationally not just as a financial centre, but for our strong, principled and no-nonsense approach to taking down individuals who break our laws.”\nShe added that the country is taking steps to update its measures to keep pace with evolving risks and trends, and strengthening its capabilities to proactively detect and take firm enforcement action against wrongdoing.\n“Nevertheless, this case is a reminder that even the most stringent preventive measures can be circumvented by determined criminals. But it also shows that our system is able to detect suspicious individuals and activities, and that when we do, we have the resolve and capabilities to track them down, and take them to task,” she said.", "url": "https://www.straitstimes.com/singapore/politics/money-laundering-case-among-world-s-largest-with-assets-seized-worth-over-28b"}