{"authors": ["Chin Hui Shan"], "date_download": "2024-10-12 13:59:10", "date_modify": "2024-10-12 13:59:10", "date_publish": "2022-10-15 13:15:29", "description": "As Singapore continues to live with Covid-19 amid the XBB wave, Health Minister Ong Ye Kung raised four important guidelines. Read more at straitstimes.com.", "filename": "singapore_four-guidelines-on-living-with-covid-19-amid-xbb-wave_1728741550.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/15/rrcovidmtflisticle1510.jpg?VersionId=azCj0eTctik._f3EO3Ax2GEf9UKlRVJd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_four-guidelines-on-living-with-covid-19-amid-xbb-wave_1728741550.html", "title": "4 guidelines on living with Covid-19 amid XBB wave", "title_page": "4 guidelines on living with Covid-19 amid XBB wave | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - As Singapore continues to live with Covid-19 amid the XBB wave, Health Minister Ong Ye Kung raised four important guidelines:\n1. Keeping up to date with vaccination\nThose aged above 50 who have received three shots or had taken the last shot more than five months ago are advised to receive the bivalent version of Moderna's Spikevax vaccine.\nEven as vaccine supplies are coming in, priority is now given to those aged above 50, as they are more likely to be severely ill if infected, said Health Minister Ong Ye Kung.\nAbout 4,200 people took the bivalent vaccine jab on Friday when the vaccination was rolled out, he said.\nMr Ong said that more people are expected to take the vaccination and the vaccination centres will be open every day if needed. Currently, joint testing and vaccination centres (JVTC) are only open from Monday to Saturday afternoon.\n\"Get your vaccination updated, it will prevent you from becoming severely ill if you are infected,\" he said.\n2. Possibility of resuming some safe management measures\nMeasures such as wearing masks indoors and outdoors and vaccination-differentiated measures (VDS) may resume if the Covid-19 situation worsens, said Mr Ong.\nHe said: \"We stepped down all VDS but when the situation requires, we may have to step up VDS to an appropriate level in order to protect those who are not up to date with their vaccinations.\"\n\"We are monitoring the XBB very closely and the impact on the healthcare system to see if some of these measures are necessary. As of now, no decision has been taken.\"\nVDS were fully lifted from Oct 10.\n3. Hospital visitors' restrictions in place during Covid-19 waves\nWith spikes in Covid-19 cases, visitor safe management measures in the hospital were tightened from Friday. There were 11,732 new Covid-19 infections on Tuesday, more than double from the 4,719 new cases the day before.\n\"From time to time when we have a wave like that and hospitals come under additional pressure, we will have to restrict visitors,\" said Mr Ong.\nOn Oct 12, the Ministry of Health (MOH) announced that visitor safe management measures at all hospital wards and residential care homes will be tightened for four weeks, starting from Oct 14 to Nov 10, as Covid-19 cases in the community rise.\n4. Personal responsibility is key\nThose not feeling well or living with the elderly should mask up, said Mr Ong.\n\"Test yourself, isolate yourself when you're not feeling well,\" he said.\nThose infected with Covid-19 should also follow the necessary protocol, he said.\nProtocol 2 would be applicable to pregnant women and infants between the age of three months and one who test positive for Covid-19 from Oct 25, as the risk of severe illness is low, said MOH. This means that they will be able to recover by themselves at home. Currently, Covid-19 patients aged between three months and one, as well as women who are less than 36 weeks pregnant, follow Protocol 1, where MOH will check on their recovery.", "url": "https://www.straitstimes.com/singapore/four-guidelines-on-living-with-covid-19-amid-xbb-wave"}