{"authors": ["Lim Min Zhang"], "date_download": "2024-10-12 14:14:54", "date_modify": "2024-10-12 14:14:54", "date_publish": "2020-06-14 19:49:28", "description": "SINGAPORE - Singaporeans will have opportunities to improve their lives at every stage of their careers, no matter how old they are, Minister for Trade and Industry Chan Chun Sing on Sunday (June 14) said, pledging that the government would always help Singaporean workers. Read more at straitstimes.com.", "filename": "singapore_opportunities-will-be-available-for-singaporeans-at-every-stage-of-their-careers-chan-chun_1728742494.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/06/14/ycppl140620.jpg?VersionId=ZV62IYgboGFD1_Rom5tbGoUVWNnDn1KL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_opportunities-will-be-available-for-singaporeans-at-every-stage-of-their-careers-chan-chun_1728742494.html", "title": "Opportunities will be available for Singaporeans at every stage of their career: Chan Chun Sing", "title_page": "Opportunities will be available for Singaporeans at every stage of their career: Chan Chun Sing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singaporeans will have opportunities to improve their lives at every stage of their career, no matter how old they are, Minister for Trade and Industry Chan Chun Sing on Sunday (June 14) said, pledging that the government would always help Singaporean workers.\nNoting that the Covid-19 pandemic has pushed many to embrace digitalisation, he said the Government will ensure that Singaporeans of all ages can go digital and thrive.\n\"We will never be done upskilling our people. This is especially so for workers who have left school many years ago and did not benefit from the more recent improvements in our education and training system,\" he said. \"So long as you are able and willing, we will support you. Every Singaporean, regardless of background, can have the chance to take on the new jobs being created.\"\nHe also noted that Singapore has adapted before.\n\"In the 1980s, we uplifted a generation through computerisation and automation. In the 2020s, we will transform another generation through digitalisation and data,\" said Mr Chan in the fourth of six national broadcasts on Singapore's post-coronavirus future.\nHe said this transformation includes having a thousand-strong digital ambassador corps to help companies apply digitalisation and help senior citizens use technology. He said the Singapore Tourism Board is already helping hospitality companies and event organisers overcome the collapse in travel demand by using digital tools.\nHe also cited some Singaporean businesses that are helping newcomers and smaller firms.\nFor instance, property giant CapitaLand takes along Singapore companies in its overseas development projects, helping them to penetrate new markets, he said.\n\"The retail and hospitality sector may be going through a challenging time, but CapitaLand will press on and do more to support our local SMEs (small and medium-sized enterprises).\"\n\"Our business leaders and workers will be key to these efforts. We must have the aptitude and attitude to serve global markets,\" he said. \"We cannot be content with doing well just within Singapore.\"\nTo that end, he said that more will be done to help businesses access new markets.\nThe Scale-Up SG programme was introduced to groom promising local companies into global champions, said Mr Chan. \"So long as our companies have the ambition, we will find the resources to support them.\"\nOverseas exposure will be intensified through initiatives like the Global Ready Talent programme, so that Singaporeans can gain fresh perspectives and networks.\nThe programme, launched last year, provides support for young people keen to work abroad and for companies to train their staff through stints overseas.\nHe cited the example of Carousell founders Quek Siu Rui, Marcus Tan and Lucas Ngoo, who all spent a year in Silicon Valley as part of the National University of Singapore Overseas Colleges programme. The online marketplace today has grown beyond Singapore to eight markets across South-east Asia.\nMr Chan also noted that earlier this year, the Ministry of Education announced a \"70-70 target\" for more local students from institutes of higher learning (IHLs) to have some form of overseas exposure.\nThe aim is for 70 per cent of graduates from universities, polytechnics and the Institute of Technical Education to get some international experience, whether through an internship, exchange programme or service learning or study trip.\nThis is up from half of all IHL students currently. Another 70 per cent of this proportion of IHL students will have exposure to Asean, China or India.\n\"We will press on with this once the Covid-19 situation allows,\" said Mr Chan.", "url": "https://www.straitstimes.com/singapore/opportunities-will-be-available-for-singaporeans-at-every-stage-of-their-careers-chan-chun"}