{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 13:37:13", "date_modify": "2024-10-12 13:37:13", "date_publish": "2024-09-27 17:40:19", "description": "Singaporeans also believe China will have the most influence in Asia in 10 years’ time. Read more at straitstimes.com.", "filename": "singapore_s-poreans-view-china-s-influence-as-slightly-more-positive-than-that-of-us_1728740233.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/27/2024-09-12T100055Z2132780426RC2XY9AHPZ3ERTRMADP3USA-ELECTION-TRUMP-CHINA.JPG?VersionId=Xx1dBn9PoQwOSQ8W3FrnamtDZ03h3TRQ&h=b97b96a1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-poreans-view-china-s-influence-as-slightly-more-positive-than-that-of-us_1728740233.html", "title": "S’poreans view China’s influence as slightly more positive than that of US", "title_page": "S’poreans view China’s influence as slightly more positive than that of US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - China’s influence on Asia and the world is viewed slightly more positively than that of the US, according to a survey of some 1,000 Singapore citizens aged 21 and above.\nSingaporeans also believe that China far outstrips the US in influence over Asia, and that the gap will only widen in 10 years’ time.\nBoth the US and China are perceived to have a very similar level of influence over Singapore, and the Republic did not lean towards either power compared with respondents from other Asian countries, the Institute of Policy Studies (IPS) found.\nThese were the key findings from the latest Asian Barometer Survey released on Sept 27, an occasional cross-national survey of attitudes and values towards governance and democracy in 15 countries and territories.\nThe Singapore edition is conducted by IPS, with the latest wave carried out between September and November 2023.\nHalf of the Singaporean respondents saw the US’ influence on Singapore today as positive, compared with 57.5 per cent who saw China’s influence here in the same light.\nMeanwhile, 28.2 per cent more respondents said China has the most influence over Asia today, rather than the US. The perceived gap nearly doubled when respondents were asked if China (59.1 per cent) or the US (6.9 per cent) would be more influential in the region in a decade’s time.\nThat said, Singaporeans have cooled somewhat on the amount of influence China has on Asia, compared with in the last survey in 2020.\nThe number of respondents who felt that China has the most influence over Asia today fell by more than 20 percentage points, while those who saw China exerting a great deal of influence over Singapore receded by 17 percentage points.\nDr Tan Ern Ser, adjunct principal research fellow and academic adviser at IPS Social Lab, said this could be due to China’s declining economic miracle. China is grappling with a real estate crisis, while youth unemployment climbed to 18.8 per cent in August amid a flagging economy.\nResponses collected from the last three waves (2014, 2020 and 2023) found that, on aggregate, the extent of influence of both the US and China on Singapore was very close, with a slight edge to China.\nThe 2020 edition found that Chinese and older respondents here were more likely to view China as the more influential power, but Dr Tan said there were no significant differences between races for the latest survey.\nResearchers analysed the latest data for variables such as political interest, age, gender and ethnicity, and found that they had no effect on how Singaporeans assessed the quality of influence the US and China had on Singapore.\nIncome was the only significant variable – those with higher incomes were more likely to see the US and China as equally influential on Singapore.\nIn contrast, such variables could predict how respondents in Taiwan, Vietnam and the Philippines viewed the quality of influence of the US and China on their respective societies, said IPS.\nFor instance, older Filipino respondents aged 56 and above were more likely to have a more positive view of the US. The Philippines was an American colony until 1946, and remains a close US ally.\nIn Taiwan, those aged 36 and above – and particularly those who were 56 years old and above – were more likely to be pro-China. Older citizens may have a stronger affinity with or even have their own personal histories tied to mainland China, noted IPS senior research fellow Gillian Koh, who was the principal investigator for the survey.\nMeanwhile, Vietnamese respondents with stronger attachment to authoritarian values were likely to be pro-China, as their political values were more aligned to the political system of the Chinese regime, she added.\nThat Singaporeans view the two major powers in the same way suggests that people here see their merits in equal measure, said Dr Koh, adding: “No political values, nothing ideological, so to speak, is at play.”", "url": "https://www.straitstimes.com/singapore/s-poreans-view-china-s-influence-as-slightly-more-positive-than-that-of-us"}