{"authors": ["Elise Wong"], "date_download": "2024-10-12 14:21:39", "date_modify": "2024-10-12 14:21:39", "date_publish": "2024-07-16 19:45:00", "description": "Cleanup operations have entered the final phase at Siloso Beach and part of East Coast Park. Read more at straitstimes.com.", "filename": "singapore_environment_volunteers-needed-to-remove-tar-balls-from-some-beaches-affected-by-oil-spill-grace-fu_1728742899.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/16/8778n.jpg?VersionId=GZaXT9WnuBgE_h6i44OiBHAfDrWKZxDe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_volunteers-needed-to-remove-tar-balls-from-some-beaches-affected-by-oil-spill-grace-fu_1728742899.html", "title": "Volunteers will be deployed to remove tar balls from some beaches affected by oil spill: Grace Fu", "title_page": "Volunteers will be deployed to remove tar balls from some beaches affected by oil spill: Grace Fu | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Volunteers will be deployed in the “coming days” to help with the removal of tar balls from some beaches, said Minister for Sustainability and the Environment Grace Fu in a Facebook post on July 16.\nCleanup efforts along beaches and rock bunds affected by the June 14 oil spill have progressed “faster than expected”, said Ms Fu.\nAt Siloso Beach on Sentosa, as well as at the beaches in Area B of East Coast Park, cleanup operations have entered the final phase, she added.\nThe authorities had earlier classified the oil spill cleanup efforts into three stages: an emergency phase that focused on containing the spill in the immediate aftermath of the incident; a project phase that targets areas not easily accessible, such as rock bunds; and a final polishing phase to remove remnants on land.\nThe second phase of cleanup operations, which started around June 21, had initially been expected to take up to three months.\nThe third phase of cleanup efforts entails the manual extraction of residual oil from the sand.\nTar balls are remnant oil deposits which have hardened and mixed with sand.\n“They can be as small as pebbles and as big as our fists. They are scattered across the affected beaches and it is a labour-intensive process to pick them up,” said Ms Fu.\n“We are calling all volunteers to come forward to help our cleaning staff to comb and remove tar balls from the beaches,” she said, urging people to join in the “biggest beach cleanup exercise in Singapore”.\n“Personally, I am quite excited to do this because I have always liked to play with sand,” added Ms Fu.\n“The sooner we can clear these tar balls, the sooner we can enjoy our beautiful beaches.”\nAs at June 24, more than 1,500 volunteers had signed up to help with oil spill management efforts, and more than 2,000 others have registered to be kept closely updated on ongoing efforts and future volunteering opportunities.\nThe Straits Times has contacted the National Environment Agency (NEA) – an agency under Ms Fu’s ministry – and the Sentosa Development Corporation, which manages the beaches on the resort island, for more details.\nOn June 14, the Netherlands-flagged dredging boat Vox Maxima hit stationary bunker vessel Marine Honour at Pasir Panjang Terminal after suffering a sudden loss of engine and steering control.\nThis caused 400 tonnes of low-sulphur oil from one of Marine Honour’s tanks to leak into the sea, affecting numerous coastlines, including East Coast Park, Keppel Bay, the Southern Islands and Sentosa.\nAccording to a July 2 statement from the authorities, other affected beaches, including Tanjong and Palawan beaches on Sentosa, as well as the remaining areas of East Coast Park, are in the second phase of cleanup operations.\nSince the spill, more than 700 personnel from various government agencies and private organisations have been deployed to help in cleanup efforts, and more than 3,400m of containment booms – devices used to control the spread of oil – were laid.\nThe public is still advised against swimming and primary contact water activities at beaches in East Coast Park and on Sentosa, as well as in the waters off the Southern Islands, “until further notice”, according to government advisories.\nOne Degree 15 Marina and Marina at Keppel Bay, which were closed after the incident, reopened for regular operations on June 25 and 28, respectively.\nDuring a press conference on oil spill cleanup efforts on June 24, Ms Fu said that the authorities plan to involve volunteers working alongside cleaning personnel in the final phase of the operation to accelerate the reopening of Singapore’s beaches.\nVolunteers will receive training and protective equipment before embarking on cleanup efforts at the various beaches, she said then.", "url": "https://www.straitstimes.com/singapore/environment/volunteers-needed-to-remove-tar-balls-from-some-beaches-affected-by-oil-spill-grace-fu"}