{"authors": ["Tham Yuen-C"], "date_download": "2024-10-12 13:52:55", "date_modify": "2024-10-12 13:52:55", "date_publish": "2023-10-23 23:55:00", "description": "Two studies found a “high willingness” among people to engage in municipal initiatives with the right support. Read more at straitstimes.com.", "filename": "singapore_politics_are-you-champion-charlie-or-neutral-nancy-new-survey-profiles-people-on-issues_1728741175.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/24/bthdb20231024.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_are-you-champion-charlie-or-neutral-nancy-new-survey-profiles-people-on-issues_1728741175.html", "title": "Are you Champion Charlie or Neutral Nancy? New survey profiles people on issues", "title_page": "Are you Champion Charlie or Neutral Nancy? New survey profiles people on issues | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - When it comes to resolving disputes over excessive noise or working with neighbours on community initiatives, 37 per cent of Singaporeans would be willing to take the lead and do something on their own, a survey found.\nThese proactive and enthusiastic individuals, or “Champion Charlies”, were also the most satisfied with municipal services, which typically include the cleanliness of estates, maintenance of shared facilities and pest control, among other things.\nThe remaining majority polled in the survey commissioned by the Municipal Services Office (MSO) were more likely to stay neutral, tolerant or silent about neighbourhood matters, and were also either neutral or less satisfied with municipal services.\nThese “Neutral Nancys”, “Tolerant Tinas” and “Quiet Quinns” each make up 21 per cent of the population.\nBased on these and other findings, the MSO plans to develop a profiling tool to better understand the different attitudes people have towards municipal issues and to better engage residents in each neighbourhood.\nA short quiz will be made available on the MSO’s website by the middle of 2024, for people to find out which profile they fall under.\nThe study by RySense, which polled 1,050 people and conducted focus groups, was one of two studies commissioned by the MSO that showed a “high willingness” among people to participate in municipal and community initiatives when provided with appropriate resources and support, said the office.\nThe other study looked at how to cultivate positive social norms within high-rise, high-density housing environments, through observing a community-led project to tackle the improper disposal of bulky waste at the Toa Payoh East constituency.\nThe study was conducted by the Centre for Sustainable Asian Cities at the National University of Singapore’s (NUS) College of Design and Engineering.\nIt found that residents were more inclined to join, rather than lead neighbourhood projects, and that participation in such projects begets more participation, among other things.\nThe MSO said it will draw from the findings and work on training members under its OneServiceKakis network to become facilitators, so that they can lead and sustain community initiatives on a local level. The network is an initiative started to encourage community partnerships.\nFollowing a dialogue on fostering community action for municipal issues on Monday, Senior Minister of State for National Development Sim Ann said: “The findings are very interesting and also very encouraging because we have found that, for instance, about 37 per cent of Singaporeans belong to a very active profile of people who are prepared to take the lead in resolving community or municipal issues, and in co-creating solutions.\n“This encourages and affirms our work in helping communities to shape social norms.”\nSuch norms will go some way to address some of the causes of municipal disamenities, such as excessive noise, clutter in walkways, second-hand smoke and pigeon feeding, said Ms Sim and the other panellists from RySense and the Centre for Sustainable Asian Cities.\nDuring the dialogue, some participants suggested that efforts to foster norms were not enough on their own. They cited their own experiences with recalcitrant residents who continued their anti-social behaviour despite repeated reminders by grassroots leaders and even the authorities.\nAcknowledging this, Ms Sim said that is why engagement and enforcement are all part of the “toolkit approach”. “It’s not about just banking on one approach to the exclusion of others,” she added.\nIn the RySense study, about one in two respondents said they would talk to their neighbours as a first step to resolving problems such as excessive noise or clutter.\nHowever, if they hit a wall, six in 10 of these people would lodge a complaint to the authorities, with the majority favouring stricter enforcement measures should the situation still not improve.\nMs Sim said this showed there is strong support for enforcement action when face-to-face talks between the parties do not resolve the issues.\nYale-NUS Associate Professor of Social Sciences Ho Kong Chong, who was a co-investigator in the Centre for Sustainable Asian Cities study, suggested that the softer approach would be more suitable for issues faced by more people, as more people may buy into the solution.\nHe said tougher action can be taken for issues that affect fewer people, such as noise problems.\nOne instance of when the community engagement approach worked is the Alliance for Action on Norms for Joss Paper Burning, launched in 2022, said Ms Sim.\nThe alliance had worked with religious organisations and cultural experts, among others, to raise awareness on the desired norms for joss paper burning, with several education campaigns launched in 2022 and 2023.\nAfter these efforts, complaints and feedback about the burning of joss paper during the lunar seventh month fell by 20 per cent in 2023, compared with 2021.\nTaken together, said Ms Sim, the studies showed Singaporeans are ready to come together to address municipal issues.", "url": "https://www.straitstimes.com/singapore/politics/are-you-champion-charlie-or-neutral-nancy-new-survey-profiles-people-on-issues"}