{"authors": ["Toh Yong Chuan"], "date_download": "2024-10-12 14:20:35", "date_modify": "2024-10-12 14:20:35", "date_publish": "2017-06-25 17:12:06", "description": "SINGAPORE - The Islam faith is one that respects local cultures, and the traditions and cultures in Singapore do not conflict with the Prophet's teachings, said the top Islamic scholar in Singapore. Read more at straitstimes.com.", "filename": "singapore_islam-respects-local-cultures-says-mufti_1728742835.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2017/06/25/des-pixchangi07e0046.jpg?VersionId=xGdOZvfF6T457aXO2eOwEfHtUbeYx5Yt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_islam-respects-local-cultures-says-mufti_1728742835.html", "title": "Islam respects local cultures, says Mufti", "title_page": "Islam respects local cultures, says Mufti | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Islam faith is one that respects local cultures, and the traditions and cultures in Singapore do not conflict with the Prophet's teachings, said the top Islamic scholar in Singapore.\n\"Being Islamic does not mean that we should abandon our customs and cultures which do not run contrary to Islamic principles,\" said Mufti Dr Fatris Bakaram in his Hari Raya Aidilfitri sermon on Sunday (June 25).\nDelivering his sermon in Malay, Dr Fatris said it will be problematic if a believer of Islam imposes foreign cultures and norms on a community like Singapore, which already has its own practices and traditions.\nHe warned against concluding that \"what is foreign is definitely more Islamic\".\n\"Such attitudes usually arise from being easily fascinated by something new and something that differs from the norm,\" he told a congregation of about 3,500 people at the Al-Mukminin Mosque in Jurong East.\nHis sermon - which was also read by other imams in all mosques here on Sunday - follows news of three people arrested under the Internal Security Act in last two weeks.\nTwo of the three were radicalised after being exposed to pro-Islamic State in Iraq and Syria (ISIS) propaganda online.\nOn Sunday, Dr Fatris called on the Muslim community to always be wary and discerning of calls from unsure sources, especially given the widespread use of social media today.\nHe said: \"Without a proper understanding of the religion, it is possible for us to be deceived by such manipulations. There are those who are influenced by calls to participate in conflicts, wars and acts of violence.\"\nThese violent acts taint Islam and causes confusion on what the faith represents, Dr Fatris added.\nDr Fatris, as Mufti, helms the religious leadership in the 500,000-strong Muslim community here. He interprets Islamic law and provides spiritual guidance to the community.\nMinister-in- charge of Muslim Affairs Yaacob Ibrahim, who attended the sermon, told reporters the Mufti's message was \"very appropriate\".\n\"The Mufti was trying to reinforce the message that whatever we have been practising in Singapore, within our context, is appropriately Islamic for us to manifest it in our own way,\" said Dr Yaacob, who is also Minister for Communications and Information.\n\"We are inundated with many other influences that we see today across the world today through the Internet. At the end of the day, there is always the debate as to which one is more Islamic than the other,\" he noted.\nThe assurance by the Mufti is very important in that Islam practised in Singapore is \"perfectly within the framework of Islam\", Dr Yaacob noted.\nHe also warned against allowing Islamophobia to sink its roots here.\n\"I wouldn't say it is not a problem but we must always remain vigilant that it might take root in Singapore,\" he added. \"In corridors, in dinner tables, in gatherings, you never know what is being said, what is being uttered.\"\nThe Muslim community has developed the skills to explain Islam to the non-Muslim community, Dr Yaacob noted, but both Muslim and non-Muslim leaders need to work \"doubly hard\" to ensure anti-Muslim sentiments do not take root here.\nAsked about the upcoming presidential election, Dr Yaacob said potential candidates have to decide for themselves whether to contest.\n\"The electoral process is transparent, is fair. It is up to the individual to decide. We will take whatever outcomes that comes,\" he said, adding: \"Whether it is a walkover, whether it is a contest, we have to decide whatever the outcome is and embrace it wholeheartedly.\"\nThe election, to be held in September, is the first reserved for Malay candidates, following changes to the law last year to ensure the major races are periodically represented in the office of the president, which should reflect Singapore's multiracial society.\nSo far, Second Chance Properties chief executive Mohamed Salleh Marican, 67, and Bourbon Offshore Asia Pacific chairman Farid Khan, 62, have collected application forms.", "url": "https://www.straitstimes.com/singapore/islam-respects-local-cultures-says-mufti"}