{"authors": ["Wong Shiying"], "date_download": "2024-10-12 13:31:55", "date_modify": "2024-10-12 13:31:55", "date_publish": "2024-03-26 10:14:24", "description": "No charges have been filed against Mr Lum. Read more at straitstimes.com.", "filename": "singapore_lum-kok-seng-the-man-named-in-latest-charges-against-iswaran-was-interviewed-by-cpib-several-times_1728739915.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/26/rrlumkoksenglumchang2603.jpg?h=e33b708b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_lum-kok-seng-the-man-named-in-latest-charges-against-iswaran-was-interviewed-by-cpib-several-times_1728739915.html", "title": "Lum Kok Seng, the man named in latest charges against Iswaran, was interviewed by CPIB several times", "title_page": "Lum Kok Seng, the man named in latest charges against Iswaran, was interviewed by CPIB several times | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Mr Lum Kok Seng, the man named in former transport minister S. Iswaran’s latest eight charges, attended several interviews with the Corrupt Practices Investigation Bureau (CPIB) regarding Iswaran’s graft probe.\nMr Lum, 75, a Singaporean, is managing director of Lum Chang – a property management, interior design and construction firm.\nLum Chang was responding to queries from the Singapore Exchange (SGX) late on March 25.\nSGX had asked the company earlier that day whether Mr Lum was contacted by CPIB to assist in investigations and if any charges were filed against him, or if any restrictions were imposed by CPIB.\nLum Chang said Mr Lum had informed the company’s board that he attended several interviews with CPIB in relation to its investigations into Iswaran, adding that no charges have been filed against Mr Lum, and no restriction has been imposed on him by CPIB.\nThe statement added: “The board and the nominating committee have assessed the above and have determined that Mr Lum continues to be suitable to carry out his duties and responsibilities as managing director of the company, unless there are subsequent developments which require the board and the nominating committee to make a reassessment.”\nLum Chang added that its board will give updates on any developments on this matter.\nShares of Lum Chang sank on news of the CPIB interviews on March 26, falling as much as 10.3 per cent to 26 cents in the morning. It recouped most of its losses in the afternoon, but ended the trading day at 26 cents.\nOn March 25, Iswaran was handed eight new charges that allege he had obtained, as a public servant, valuable items worth nearly $19,000 from Mr Lum.\nIswaran is said to have obtained items such as a Brompton bicycle, golf clubs and bottles of whisky from Mr Lum between November 2021 and November 2022.\nIswaran, who was appointed transport minister in May 2021 and resigned from the post in January 2024, allegedly knew that Mr Lum was linked to a Land Transport Authority (LTA) contract for works at Tanah Merah MRT station through the latter’s company, Lum Chang Building Contractors (LCBC).\nLCBC is Lum Chang’s construction arm. The $325 million contract involving Tanah Merah MRT station was awarded to LCBC by LTA in October 2016 and the works are slated to be completed in 2025.\nIswaran now faces a total of 35 charges, 32 of which are under Section 165 of the Penal Code, which makes it an offence for a public servant to accept gifts from someone involved with him in an official capacity.\nHis remaining charges comprise two for corruption and one for obstructing the course of justice. He pleaded not guilty to all charges.\nAccording to Lum Chang’s 2023 annual report, Mr Lum is a director of LCBC, among other subsidiaries.\nThe report states that Mr Lum has around 50 years of industry experience and led the expansion of the company’s property development activities in Singapore, Malaysia and Britain.\nAccording to the Prime Minister’s Office website, Mr Lum was awarded the Public Service Medal in 2010 in his capacity as patron of Ayer Rajah-West Coast Citizens’ Consultative Committee.\nAyer Rajah is part of West Coast GRC, where Iswaran served as MP from 1997 till his resignation in January 2024.\nThe Public Service Medal may be awarded to any person who has rendered commendable public service in Singapore, or for his achievement in fields such as business, sports and the sciences.", "url": "https://www.straitstimes.com/singapore/lum-kok-seng-the-man-named-in-latest-charges-against-iswaran-was-interviewed-by-cpib-several-times"}