{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:28:37", "date_modify": "2024-10-12 13:28:37", "date_publish": "2023-04-07 19:00:00", "description": "They are the oldest among the 30-member Pink Paddlers Singapore team. Read more at straitstimes.com.", "filename": "singapore_septuagenarians-among-breast-cancer-survivors-from-s-pore-competing-in-international-dragon-boat-race_1728739717.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/08/2023040652736600f0dff328-fea7-42e1-bec3-8d22521671a1_2.jpg?VersionId=vnARNKnCKDrpweSX74XelqPshQ9dIRLZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_septuagenarians-among-breast-cancer-survivors-from-s-pore-competing-in-international-dragon-boat-race_1728739717.html", "title": "Septuagenarians among breast cancer survivors from S’pore competing in international dragon boat race", "title_page": "Septuagenarians among breast cancer survivors from S’pore competing in international dragon boat race | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - They may be in their 70s, but breast cancer survivors Andrea Tay and Esther Sim will compete against younger paddlers at the International Breast Cancer Paddlers’ Commission (IBCPC) Dragon Boat Festival in New Zealand from Monday.\n“When it comes to teamwork, age doesn’t matter. The camaraderie does,” Madam Tay, 76, said.\nThe septuagenarians are the oldest among the 30-member Pink Paddlers Singapore, a dragon boat team comprising breast cancer survivors. The team, which has been training every Saturday and has ramped it up to twice a week from January, leaves for New Zealand on Monday for the two-week event.\n“(We are) making our way to do Singapore and our sisters in surviving cancer proud,” said Ms Sim, 73, who joined the group in 2005.\nMs Sim survived breast cancer for the third time. She was first diagnosed in 2004 and suffered a relapse two years later. Both times, she went through a lumpectomy – an operation to remove breast lumps.\n“It was in 2008 that I suffered a second relapse and, this time, I decided on a mastectomy,” said the former travel agent of her decision to have an entire breast removed.\nHaving always been a sporty person, she continued to challenge herself physically after her diagnosis and surgery, running regularly.\nHowever, she had to stop running due to weakness and paralysis of the muscles in her foot caused by an earlier spine implant.\n“Since I can no longer run, I joined my fellow breast cancer survivors in dragon boat racing. I believe in the three Fs – faith, family and friends. They help raise my strength and confidence,” she said.\n“Apart from developing friendship and trust, paddling also helps reduce my chances of developing lymphedema,” she adds. A side effect of cancer treatment, lymphedema is swelling due to build-up of lymph fluid in the body that usually happens in the arms or legs.\nLike Ms Sim, Madam Tay, who joined the group in 2009, was attracted to the “sisterhood of survivors”.\nShe was 45 when she was diagnosed with breast cancer and went through a mastectomy to remove her breast. Madam Tay kept herself busy at work and outside of it.\n“I played tennis and golf. I still do. It was at qigong class that I met a couple of the Pink Paddlers, who invited me to join them,” she said, adding that she competed in the last IBCPC Dragon Boat Festival held in Florence, Italy, in 2018.\n“We are all defined not by age, but by our determination to live life to the fullest despite the cancer,” said one of the paddlers, Mrs Anusuya Chia.\nPink Paddlers Singapore captain Irene Chui, 58, said: “It is all about teamwork and supporting each other. It is surviving the disease that is keeping us together and helping to move us forward. We stall when one of us is out of sync.”\nMs Chui was diagnosed with stage 2 cancer and had a mastectomy at the age of 35.\n“There will also be a flower ceremony at the festival. It is most significant because we pay tribute to our paddlers and friends who lost the fight to breast cancer. We have lost two who competed at the last IBCPC in 2018 and we will be racing hard in their memory,” said Ms Chui, a community engagement specialist.\nBreast cancer is the most common cancer among Singapore women, accounting for almost 30 per cent of all female cancers. Each year, over 2,000 women are diagnosed with breast cancer, and more than 400 die from the disease.", "url": "https://www.straitstimes.com/singapore/septuagenarians-among-breast-cancer-survivors-from-s-pore-competing-in-international-dragon-boat-race"}