{"authors": ["Kolette Lim"], "date_download": "2024-10-12 13:31:34", "date_modify": "2024-10-12 13:31:34", "date_publish": "2024-08-07 18:45:00", "description": "He will take over from Mr Denis Tang. Read more at straitstimes.com.", "filename": "singapore_cnb-director-sam-tee-to-step-down-and-helm-cpib-from-sept-1_1728739894.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/07/0E2A5736.JPG?VersionId=i58DrYyRLM3v4oqFzuoCZbtEZXBQKjoT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_cnb-director-sam-tee-to-step-down-and-helm-cpib-from-sept-1_1728739894.html", "title": "CNB director Sam Tee to step down and helm CPIB from Sept 1", "title_page": "CNB director Sam Tee to step down and helm CPIB from Sept 1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A new director will helm the Corrupt Practices Investigation Bureau (CPIB) from Sept 1.\nDirector of the Central Narcotics Bureau (CNB) Sam Tee will take over from Mr Denis Tang, the Ministry of Home Affairs (MHA) and the Prime Minister’s Office said in separate statements on Aug 7.\nMr Tang has served as CPIB director since Oct 1, 2018.\nThe appointment was made by President Tharman Shanmugaratnam, with advice from Prime Minister Lawrence Wong.\nMr Tang, who is on secondment to CPIB, will return to MHA when his tenure ends.\nSince Mr Tee’s appointment as CNB director on Nov 6, 2022, he has led efforts in Singapore’s fight against drug abuse such as the arrests of traffickers and breaking up syndicates, said MHA.\nHe was previously senior director of the joint operations group at the MHA headquarters. As the senior director, Mr Tee led the Homefront Crisis Executive Group (HCEG) secretariat, which supported the HCEG and multi-ministry task force during the Covid-19 pandemic.\nMr Tee, a Senior Assistant Commissioner (SAC) of Police, joined the police force in 1994, and previously held positions such as the commander of Traffic Police and the Airport Police Division.\nWith the departure of SAC Tee, Mr Leon Chan will be appointed as the acting director of CNB from Sept 1, said the MHA.\nHe will continue serving as the deputy director of operations in the bureau, a position he has held since June 1, 2021.\nMr Chan was previously a commander of the Woodlands Police Division, and played key roles in ensuring public safety during events such as the 2020 General Election.", "url": "https://www.straitstimes.com/singapore/cnb-director-sam-tee-to-step-down-and-helm-cpib-from-sept-1"}