{"authors": ["Chin Hui Shan", "Samuel Devaraj"], "date_download": "2024-10-12 13:32:09", "date_modify": "2024-10-12 13:32:09", "date_publish": "2024-05-09 22:50:27", "description": "The incident follows recent reported fires in industrial areas. Read more at straitstimes.com.", "filename": "singapore_fire-breaks-out-in-toa-payoh-industrial-park_1728739929.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/09/tpyfire0905a.jpeg?VersionId=cGW0IQQefNrix2tlvo7NfeoLThgcT3fJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_fire-breaks-out-in-toa-payoh-industrial-park_1728739929.html", "title": "Fire breaks out at Toa Payoh Industrial Park; one firefighter taken to hospital", "title_page": "Fire breaks out at Toa Payoh Industrial Park; one firefighter taken to hospital | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A fire broke out at 3 Toa Payoh Industrial Park on the night of May 9, with one firefighter taken to hospital for cramps.\nThe Singapore Civil Defence Force (SCDF) said in a Facebook post at 11.47pm the same night that it was alerted to the fire at about 9.40pm and was at the scene fighting the fire.\nThe area of the fire, measuring about four basketball courts, involved two units, SCDF said in an update on Facebook at 12.33am on May 10.\n“The first unit is a car workshop and the second unit is an industrial workshop. The fire was extinguished in about 1½ hours with six water jets and one unmanned firefighting machine.”\nA total of 15 emergency vehicles and about 60 firefighters were deployed to the incident, SCDF added.\nA firefighter had cramps in his legs and was conscious and stable when taken to Tan Tock Seng Hospital as a precaution. He was assessed by a doctor at the hospital and did not require further treatment, SCDF said. He is currently resting at home.\nThere were no other reported injuries.\n“SCDF is currently carrying out the damping-down operation of the affected area,” the agency added, referring to the use of water to wet burnt surfaces after a fire to prevent it from rekindling.\nPhotos and videos of the incident circulating on social media show a bright orange blaze with thick black smoke billowing from the fire.\nWhen The Straits Times arrived at the scene at about 10.45pm, a crowd of about 50 bystanders had gathered near the fire.\nEyewitnesses and residents in the area said that they heard explosions.\nMs Praserdsuk Natnicha, 17, said she was on the way to buy supper at about 10.40pm when she saw police cars and fire engines by the roadside, and heard two explosions.\nA Straits Times reader, who declined to be named, said that at about 9.30pm, her husband told her that he smelled smoke.\n“We looked out of the window of the bedroom, and realised that there was thick black smoke coming from the industrial building nearby,” said the Toa Payoh resident.\n“We couldn’t see any flames initially but eventually, we saw that it spread to the roof of the building,” said the 31-year-old woman, who added that a large crowd had gathered at the nearby fitness corner to watch what was happening.\nShe said that she received an SMS at 10.58pm from the Ministry of Home Affairs about the fire with an advisory to stay clear of the area. It also said to refer to SCDF’s social media pages for updates.\nAnother resident living nearby, Mr Tyler Siya, 31, said he was in the area at about 10.40pm when he smelled something “strong and toxic” and found out that it came from the fire.\n“It smelled like burning tyre,” he said.\nThe Toa Payoh incident followed recent fires reported in industrial areas.\nOn April 2, a fire broke out at an industrial estate in Eunos that affected three units along a row of terrace workshops. No injuries were reported, but about 70 firefighters and 19 emergency vehicles were deployed to fight the fire.\nEarly on April 3 morning, a firefighter was taken to hospital for heat exhaustion after an industrial fire broke out in Defu Lane.\nThe Defu Lane incident took place about three hours after a fire in another industrial estate in Eunos that took firefighters about four hours to put out.", "url": "https://www.straitstimes.com/singapore/fire-breaks-out-in-toa-payoh-industrial-park"}