{"authors": ["Ariel Yu"], "date_download": "2024-10-12 13:29:08", "date_modify": "2024-10-12 13:29:08", "date_publish": "2024-08-01 18:00:00", "description": "From April to June, 690 students were referred to HSA by schools and institutes of higher learning. Read more at straitstimes.com.", "filename": "singapore_around-5480-caught-for-using-or-possessing-vapes-in-first-half-of-2024-in-singapore_1728739748.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/aivape010824.jpg?VersionId=.SxRba5MuTwVZXMv8uX2AahxdjAh3G4m", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_around-5480-caught-for-using-or-possessing-vapes-in-first-half-of-2024-in-singapore_1728739748.html", "title": "Around 5,480 caught for using or possessing vapes in first half of 2024 in Singapore", "title_page": "Around 5,480 caught for using or possessing vapes in first half of 2024 in Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Around 5,480 people were caught for possessing or using e-vaporisers in Singapore in the first half of 2024, said the Ministry of Health (MOH) and Health Sciences Authority (HSA).\nThe figure is more than two-thirds the number of offenders caught for the whole of 2023.\nThe number of people caught for illegal possession or use of e-vaporisers totalled 7,838 in 2023, which was a sharp rise from 4,916 in 2022.\nIn a joint statement on Aug 1, MOH and HSA said the rise is a result of stepped-up enforcement to prevent vaping from being entrenched in the population.\nThe 2024 figure includes around 690 students referred to HSA by schools and institutes of higher learning, and 19 people caught at the Woodlands and Tuas checkpoints, Changi Airport, Singapore Cruise Centre, Marina Bay Cruise Centre Singapore and Tanah Merah Ferry Terminal.\nIt was a multi-agency effort that includes the Health Promotion Board, Ministry of Education, Immigration and Checkpoints Authority, National Environment Agency and National Parks Board.\nMOH and HSA are also clamping down on the supply side of the problem, removing listings on social media platforms for the sale of e-vaporisers and related components, as well as raiding warehouses where these items are kept.\nIn collaboration with local e-commerce and social media platforms from April 1 to June 30, the HSA removed over 2,000 listings for e-vaporisers and related components.\nAll sales and advertisements of e-vaporisers are prohibited here.\nUnder the Tobacco (Control of Advertisements and Sale) Act, those caught buying, using or possessing vaping products can be fined up to $2,000.\nThose convicted of selling, offering for sale, possessing for sale, importing or distributing e-vaporisers and their components can face a fine of up to $10,000, or imprisonment of up to six months, or both, for the first offence.\nRepeat offenders face a fine of up to $20,000, or jail of up to 12 months, or both.\nAn e-vaporiser is an electronic device that heats up a liquid to turn it into a vapour, which users inhale. It is also known as vape, e-cigarette or electronic nicotine delivery system.\nVaping is often mistakenly regarded as “safer” than smoking cigarettes, but in fact it has been flagged by the World Health Organisation as a harmful activity.\nOn March 6, Minister of State for Health Rahayu Mahzam said in Parliament that the ministry is studying the feasibility of a tobacco cohort ban.\nShe was responding to MP Gerald Giam’s call for a generational smoking ban for all individuals born in or after 2010.\nIn December 2022, New Zealand raised the legal smoking age by one year every year, effectively banning the sale of tobacco to people born after 2008.\nAbout a year later, the new government said it planned to scrap the ban to fund tax cuts, and that it was taking a different regulatory approach to discourage smoking.\n57 people caught in one day\nOn July 29, HSA officers caught and fined 57 people for using and possessing e-vaporisers in Chinatown, Kampong Glam, Raffles Place, Suntec City and Tanjong Pagar. The majority of them were office workers aged 20 to 48, a spokesperson for HSA said.\nFifty-seven vapes were also seized.\nRaids conducted in 2024\nThe authorities have stepped up efforts against suppliers of e-vaporisers in the first half of 2024, resulting in significant seizures and disruptions to the illegal supply chain.\nOn March 19, a police roadblock in St Andrew’s Road led to the discovery of two men transporting two packages of vapes in their car. Subsequently, the HSA raided two warehouses and seized over 400,000 e-vaporisers and related components with a record street value of over $6 million.\nOn April 24, vapes and parts worth more than $5 million were seized in a raid at a warehouse in Woodlands Industrial Park.\nFrom June 14 to 18, HSA seized over 350,000 e-vaporisers and their components worth more than $6 million in street value in raids at three locations.\nOn July 8, it disrupted an e-vaporiser distribution network, seizing over 17,000 e-vaporisers and related parts worth more than $200,000 in street value.\nMembers of the public who have information on the illegal import, distribution, sale or offer for sale of e-vaporisers can contact the HSA’s Tobacco Regulation Branch on 6684-2036 or 6684-2037.", "url": "https://www.straitstimes.com/singapore/around-5480-caught-for-using-or-possessing-vapes-in-first-half-of-2024-in-singapore"}