{"authors": ["Ng Wei Kai"], "date_download": "2024-10-12 13:40:24", "date_modify": "2024-10-12 13:40:24", "date_publish": "2024-06-25 15:30:00", "description": "He was MP for Aljunied and Marine Parade GRCs from 1991 to 2006. Read more at straitstimes.com.", "filename": "singapore_politics_former-mp-and-journalist-maidin-packer-dies-at-66_1728740424.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/25/rrmaidin2506.jpg?VersionId=eqzurZ79UCZ44y0H8roIqCQX58xTTv.5&h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_former-mp-and-journalist-maidin-packer-dies-at-66_1728740424.html", "title": "Former MP and journalist Maidin Packer dies at 66", "title_page": "Former MP and journalist Maidin Packer dies at 66 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Mr Mohamad Maidin Packer, a former People’s Action Party (PAP) MP and Malay/Muslim community leader, died on June 24 at age 66.\nMr Maidin was MP for Aljunied and Marine Parade GRCs from 1991 to 2006, holding political office over the same period as parliamentary secretary for Information and the Arts and later senior parliamentary secretary for Home Affairs, Education, and the Environment.\nIn a Facebook post, Prime Minister Lawrence Wong spoke of Mr Maidin’s contributions to the Malay/Muslim community. These included his work helming the Bulan Bahasa, or Malay Language Month, in the 1990s and his efforts to rejuvenate Geylang Serai.\n“His pioneering efforts ensured that Geylang Serai remains a thriving hub for the Malay/Muslim community, and also laid the foundations for our plans for the upcoming Geylang Serai Cultural Belt,” PM Wong wrote. “More recently, he has continued to stay active in promoting and preserving the rich cultural heritage of the Malay community.”\nHe added that he had gone to pay his respects to Mr Maidin on the morning of June 25.\nSenior Minister Lee Hsien Loong, in a letter to Mr Maidin’s widow, Madam Rahimah Asmore, on June 25, said: “His deep connections with the Malay/Muslim community made him a good adviser on matters relating to the community and on national issues.\n“Successive prime ministers, including myself, appreciated his insights and political sense. His ability to connect and inform the community was valuable to us.”\nSenior Minister Teo Chee Hean said in a Facebook post that he had paid his last respects to Mr Maidin.\nSM Teo, who was Education Minister from 1997 to 2003, said: “We served together in the Ministry of Education, where he helped to initiate parent support groups in our schools. He was also very active in the cultural scene, including Bulan Bahasa.”\nMr Maidin began his career in journalism, rising to become the assistant editor of Malay newspapers Berita Harian and Berita Minggu before being appointed political secretary to then Prime Minister Goh Chok Tong in 1990 and standing for the 1991 General Election.\nHis background as a journalist gave him a good sense of the ground, said Senior Minister of State for Defence and Manpower Zaqy Mohamad.\nMr Zaqy, who understudied Mr Maidin in Kampong Ubi in Marine Parade GRC before joining politics in 2006, added that Mr Maidin championed the interests of the Malay/Muslim community and worked tirelessly to improve their well-being.\nHe added: “In his recent years, as chairman of Creative Malay Arts & Culture (CMAC), he promoted and preserved the rich cultural heritage of the Malay people. His dedication and service have left a lasting impact on the community.”\nMinister for Social and Family Development Masagos Zulkifli said Mr Maidin had dedicated his life to serving and uplifting the Malay/Muslim community not just as a politician, but also as someone who was passionate about the Malay language, culture and heritage.\nMr Masagos, who is also Minister-in-charge of Muslim Affairs, said in a Facebook post on June 25: “It was a great honour to have Mr Maidin as my mentor when I first entered politics in 2006. In overcoming drug and crime issues in the community, he showed me why we must continue to build over the efforts of our predecessors...\n“Today, the two-year recidivism rate of Malay offenders dropped to about 25 per cent from almost 50 per cent because he too took the mantle left by others and never let a problem fester.”\nHe added: “I am thankful for his mentorship and guidance, and the strong foundation he has built for us, generations of Malay/Muslim MPs and political office holders after him.” Mr Maidin was a strong advocate for the Malay/Muslim community even before entering politics, said Mr Masagos.\nMr Maidin was a strong advocate for the Malay/Muslim community even before entering politics, Mr Masagos added.\nHe said: “As the assistant editor of Berita Harian and Berita Minggu, he was sharp in identifying issues that needed to be addressed, ensuring that the voices and concerns of the community were heard. He also played a pivotal role in preserving our rich culture and heritage as a champion of the Malay language.”\nAfter leaving politics in 2006, Mr Maidin went into various businesses including the distribution of natural products, and became the chairman of the non-profit CMAC in 2013.\nIn 2011, he was the only former PAP MP to publicly support Dr Tan Cheng Bock’s bid for Singapore’s presidency.\nMr Maidin also played a role in the rejuvenation of Geylang Serai, said SM Lee.\nHe added: “Malay/Muslim leaders who succeeded him built on his efforts, and kept Geylang a thriving centre of the Malay/Muslim community in Singapore.\n“The soon to be launched Geylang Serai Cultural Belt is a testament to these endeavours.”\nMr Maidin continued to share his views on Singapore and public service long after retirement.\nTampines GRC MP Desmond Choo said in a Facebook post that Mr Maidin had moved into Changkat – Mr Choo’s ward – some time ago. “He was weaker but still strong enough to share his views on service to the people, public service and politics. He reminded us to keep working for the good of the people. A reminder that my team and I would always remember.”\nMr Maidin’s son-in-law, creative director and photojournalist Danial Hakim, told The Straits Times that despite struggling with his health over the past few years, Mr Maidin always had the community at heart and was determined to grow the CMAC to provide a platform for Malay youth to continue appreciating their culture.\nMr Danial, 36, said: “He was my midnight ‘teh tarik’ buddy for the past seven years and his conversations with me and my wife and my close friends always centred on how, as professionals in the creative space, we have the responsibility to contribute to uphold values as a Singaporean. It was always about putting people first and making sure that what we do has meaning.\n“He was always a jester and a cheeky guy and always brought laughter and joy to the table. His warmth will be sorely missed.”", "url": "https://www.straitstimes.com/singapore/politics/former-mp-and-journalist-maidin-packer-dies-at-66"}