{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:33:07", "date_modify": "2024-10-12 13:33:07", "date_publish": "2024-05-06 13:00:00", "description": "Ma Su Nandar Htwe is the second person allegedly linked to the case to be hauled to court. Read more at straitstimes.com.", "filename": "singapore_courts-crime_woman-charged-with-defamation-over-false-kkh-miscarriage-report_1728739987.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/06/courts-and-crime.jpg?VersionId=As3arnHdS5hxx6FpK3J9vz3y1lRID7Wy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_woman-charged-with-defamation-over-false-kkh-miscarriage-report_1728739987.html", "title": "Woman charged with defamation over false KKH miscarriage report", "title_page": "Woman charged with defamation over false KKH miscarriage report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A woman was handed a defamation charge on May 6 after she allegedly sent messages to Wake Up, Singapore’s (WUSG) Instagram account, claiming she had suffered a miscarriage at KK Women’s and Children’s Hospital (KKH).\nPolice said on May 5 that investigations showed the allegations by Myanmar national Ma Su Nandar Htwe were untrue.\nThe 27-year-old Singapore permanent resident’s alleged ordeal was reported by the alternative news website in March 2022, in an article titled “The baby is probably dead – Woman shares a harrowing account of her miscarriage at KKH A&E”.\nKKH made a police report on March 25, 2022, over the article, which was published on online platforms, including WUSG’s Facebook and Instagram pages.\nThe woman is the second person allegedly linked to the case to be hauled to court.\nOn April 24, Ariffin Iskandar Sha Ali Akbar, 26, said to be an administrator for WUSG, was also handed a defamation charge. His case is pending.\nThe fabricated story had stated that on Feb 28, 2022, the woman, who was 20 weeks pregnant and was Covid-19 positive, arrived at KKH to seek treatment after experiencing severe abdominal pain at 2pm.\nAccording to the article, the woman said she was told to wait at the drop-off area and that she started to bleed at 5pm, but was not attended to.\nShe claimed she saw the doctor only at 6pm after a four-hour wait, and was told she had lost her foetus. She also alleged that her foetus was discarded as medical waste.\nPolice investigations showed that the story and its allegations were false. KKH confirmed that the patient had been seen by a doctor within an hour of her arrival and did not suffer a miscarriage.\nIn March 2022, the Ministry of Health said it had instructed the Protection from Online Falsehoods and Manipulation Act Office to issue a correction direction to WUSG for publishing the false account.\nCorrection notices were published on WUSG’s Facebook and Instagram accounts on March 27, 2022.\nWUSG also issued an apology on April 1 that year, stating in a Facebook post: “We have just learnt that we were lied to at every turn, and the documents sent to us were doctored. We apologise to KKH and all our readers.”\nMa Su Nandar Htwe’s case has been adjourned to May 24.\nOffenders convicted of defamation can be jailed for up to two years and fined.", "url": "https://www.straitstimes.com/singapore/courts-crime/woman-charged-with-defamation-over-false-kkh-miscarriage-report"}