{"authors": ["Wallace Woon"], "date_download": "2024-10-12 13:32:06", "date_modify": "2024-10-12 13:32:06", "date_publish": "2023-11-03 11:00:00", "description": "CNB: Amount of cannabis, Ice, heroin seized can feed addiction of about 1,240 abusers for a week. Read more at straitstimes.com.", "filename": "singapore_5-youth-arrested-500k-worth-of-cannabis-ice-heroin-and-other-drugs-seized-cnb_1728739926.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/03/NR200311202320-20FINAL-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_5-youth-arrested-500k-worth-of-cannabis-ice-heroin-and-other-drugs-seized-cnb_1728739926.html", "title": "5 youth arrested, $500k worth of cannabis, Ice, heroin and other drugs seized: CNB", "title_page": "5 youth arrested, $500k worth of cannabis, Ice, heroin and other drugs seized: CNB | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Five people aged between 19 and 23 were arrested for suspected drug offences during an anti-drug operation on Wednesday conducted by the Central Narcotics Bureau (CNB).\nIn a statement on Friday, CNB said 5,487g of cannabis, 751g of Ice (methamphetamine), 63g of heroin, 10g of lysergic acid diethylamide (LSD) stamps, 380g of Ecstasy tablets and 590 Erimin-5 tablets were seized during the operation. These have an estimated street value of $507,000.\nAccording to the bureau, the amount of cannabis, Ice and heroin seized can feed the addiction of about 1,240 abusers for a week.\nThe first phase of the operation, which took place on Wednesday afternoon at a residential unit near Buangkok Crescent, saw a 21-year-old Singaporean woman arrested by CNB officers.\nAs the suspect refused to comply with the officers’ orders to open the door, they had to make a forced entry.\nCNB officers recovered 2,297g of cannabis, 216g of Ice, 63g of heroin, 10g of LSD stamps, 211g of Ecstasy tablets and 260 Erimin-5 tablets from the unit.\nLater that day, CNB officers arrested a 19-year-old Singaporean man and two foreign men, aged 20 and 21, in the vicinity of Duchess Avenue in the Bukit Timah area.\nThe fifth person arrested in the operation was a 23-year-old Singaporean man at a residential unit in Petir Road in Bukit Panjang, where officers also had to conduct a forced entry.\nThe suspect was escorted to a car, from which officers seized 3,190g of cannabis, 535g of Ice, 169g of Ecstasy tablets and 330 Erimin-5 tablets.\nIf found guilty of trafficking more than 250g of methamphetamine or 500g of cannabis, the suspects may face the mandatory death penalty.\nDeputy Assistant Commissioner Chang Gim Fook, deputy director of CNB’s intelligence division, said: “Drugs are highly addictive, can destroy lives and tear families apart, but syndicates have no qualms in getting young people addicted to drugs and involved in serious drug offences. CNB is committed to keeping up the pressure against drug syndicates and traffickers and will continue to target them to prevent harm to individuals and society.”\nCNB said investigations into the suspects are ongoing.", "url": "https://www.straitstimes.com/singapore/5-youth-arrested-500k-worth-of-cannabis-ice-heroin-and-other-drugs-seized-cnb"}