{"authors": ["Timothy Goh", "Ning Chionh", "Kolette Lim"], "date_download": "2024-10-12 13:46:45", "date_modify": "2024-10-12 13:46:45", "date_publish": "2022-05-07 05:00:00", "description": "Employees in test and vaccination centres, as well as safe distancing ambassadors, will be moving on to other roles.  Read more at straitstimes.com.", "filename": "singapore_moving-on-after-covid-19-front-line-workers-conclude-stints-as-spore-eases-restrictions_1728740805.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/07/dw-jobs-covid-220506.jpg?VersionId=OChZ1QjuvR4uR41xPCj4EIvxEfdXao08", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_moving-on-after-covid-19-front-line-workers-conclude-stints-as-spore-eases-restrictions_1728740805.html", "title": "Front-line workers conclude stints as S'pore eases Covid-19 restrictions", "title_page": "Front-line workers conclude stints as S'pore eases Covid-19 restrictions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "About 85 per cent of workers supporting operations in Covid-19 testing and vaccination centres are on short-term contracts, the Ministry of Health (MOH) said on Friday (May 6).\nResponding to queries from The Straits Times (ST), MOH said there are currently 3,700 staff supporting such operations.\n\"As we move toward living with Covid-19, we will be gradually stepping down our operations in the testing and vaccination centres,\" said MOH.\nREAD MORE HERE\nNurse who administers jabs at vaccination centre looking for new part-time job\nWhile waiting to start her university studies in sports science, Ms Cindy Kong, 23, began working part-time as a vaccinator nurse at Teck Ghee vaccination centre in February 2021 to fund her education.\nAt the peak of Singapore's Covid-19 vaccination drive in 2021, the centre saw more than 2,000 patients a day, said Ms Kong, who has a diploma in health sciences (nursing) and a practising certificate from the Singapore Nursing Board.\nHer work - which entails preparing and administering vaccines to patients - was extremely fast-paced, she said.\nREAD MORE HERE\nFormer safe distancing ambassador hopes for more understanding, appreciation\nFor former safe distancing ambassador (SDA) Miel Lim, one of the hardest parts of the job was explaining to families why he had to separate them into smaller groups when social group sizes were cut to two.\nHe recounted an instance when the management at VivoCity closed the connection between the Sentosa Monorail platform and the shopping mall, which meant commuters had to take the lift to a lower floor to enter the mall.\nMany people complained and blamed him and his fellow SDAs for the closure and he received numerous complaints, said the 22-year-old Nanyang Polytechnic student.\nREAD MORE HERE\nFreelance actor recalls working as a swabber at front line of Covid-19\nHaving worked as a swabber at various locations such as quick test centres, hotels and checkpoints, Mr Chia De Zhong, 30, knows his stint will soon come to an end.\nThe freelance actor and emcee currently administers swab tests at a private clinic which offers pre-departure testing for travellers.\nHe said: \"Having a job as a swabber is a ticking clock. The sector might close in another six months as travel borders open up and swab tests are no longer needed.\"\nREAD MORE HERE", "url": "https://www.straitstimes.com/singapore/moving-on-after-covid-19-front-line-workers-conclude-stints-as-spore-eases-restrictions"}