{"authors": ["Elisha Tushara"], "date_download": "2024-10-12 13:32:10", "date_modify": "2024-10-12 13:32:10", "date_publish": "2024-02-10 15:50:06", "description": "The number of nurses registered in 2023 surpassed the figure seen in the previous year. Read more at straitstimes.com.", "filename": "singapore_s-pore-s-nursing-strength-boosted-by-recruitment-of-5600-nurses-most-registered-to-work-in-2023_1728739930.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/10/20240210230413690e905e8b-26b7-44ac-a92d-6f2ec0daad61.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-s-nursing-strength-boosted-by-recruitment-of-5600-nurses-most-registered-to-work-in-2023_1728739930.html", "title": "S’pore’s nursing strength boosted by recruitment of 5,600 nurses; most registered to work in 2023", "title_page": "S’pore’s nursing strength boosted by recruitment of 5,600 nurses; most registered to work in 2023 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Efforts to enhance Singapore’s nursing workforce have paid off, with 5,600 nurses accepting offers to work in the public healthcare system in 2023, including 4,500 already registered to work.\nSpeaking on Feb 10 during a visit to Tan Tock Seng Hospital (TTSH), on the first day of Chinese New Year celebrations, Health Minister Ong Ye Kung said the number recruited exceeded the target announced earlier.\n“We are always short of healthcare manpower. So last year, we set ourselves a target to recruit 4,000 nurses, in private as well as public healthcare systems, in order to first replenish those we lost during Covid-19 and, at the same time, expand our workforce further,” said Mr Ong.\nThe Ministry of Health (MOH) said in January that the number of nurses registered in 2023 surpassed the figure seen in the previous year, when 3,400 new nurses were registered.\nThere were 43,772 nurses and registered midwives in Singapore in 2022, including 36,995 registered nurses.\nThe ministry had announced in 2022 the need for intensified local and overseas recruitment to make up for nurses who left the country or the profession during the Covid-19 pandemic, and to meet the growing healthcare needs of Singapore’s ageing population.\nThe Republic experienced a higher attrition rate of foreign nurses in 2021 and 2022, as borders reopened and the global competition for healthcare professionals intensified.\nMOH also previously announced that by 2030, 82,000 nurses, allied health professionals and support care staff will be needed to operate hospitals, clinics and eldercare centres, to support Singapore’s ageing population.\nIn July 2023, Mr Ong said more foreign nurses were granted permanent resident status in 2023, in recognition of the essential role they played in fighting the Covid-19 pandemic and supporting Singapore’s growing healthcare needs.\nMost of the foreign nurses here are from the region, including the Philippines, Malaysia and Myanmar.\nDuring his visit to TTSH, Mr Ong said that MOH would announce the details of a long-term incentive programme for nurses before the 15th day of the Chinese New Year.\nHe said long-term incentives are already given to teachers, and officers in the Home Team and the Singapore Armed Forces.\nNoting that nurses form the biggest group of professionals within Singapore’s healthcare system, Mr Ong said the incentive can “become quite a significant component of their remunerations”.\nDuring his visit, the minister thanked healthcare staff who were working during the public holiday to keep essential healthcare services running over the festive period.\nHe dropped by Ward 5C – the smart ward of the hospital that tests technological innovations to improve inpatient care – to distribute Chinese New Year goodie bags containing oranges and red packets to patients and staff.\nAddressing healthcare staff, Mr Ong acknowledged that working in public healthcare can be challenging.\n“Patient load is rising, patients’ families can be demanding. But whatever it is, I think we have to do it together, help out each other, and work as a team,” he said.\nSenior staff nurse Samantha Loke Xin Yu, 29, has been working at TTSH for more than six years.\nMs Loke, who works in the emergency department, told The Straits Times that it was not her first time working during Chinese New Year.\n“When you sign up as a healthcare worker, you already know what you are in for. Everyone in healthcare makes sacrifices,” said Ms Loke, adding that her shift on the first day of Chinese New Year started at 8am and ended at 4.30pm.\nShe worked the night shift on the second day, from 10pm to 8.30am.\nThough it takes some getting used to, Miss Loke, who is single, said her family understands that the nature of her work is important and complex.\n“Be it a public holiday or not, everybody needs to be taken care of.”", "url": "https://www.straitstimes.com/singapore/s-pore-s-nursing-strength-boosted-by-recruitment-of-5600-nurses-most-registered-to-work-in-2023"}