{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:49:32", "date_modify": "2024-10-12 13:49:32", "date_publish": "2023-09-10 12:00:00", "description": "If it hits 3 deg C, nearly all mangrove forests and coral reef islands will not survive. Read more at straitstimes.com.", "filename": "singapore_corals-mangroves-unlikely-to-survive-if-global-warming-exceeds-2-deg-c-study_1728740972.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/10/CORRECTION-EGYPT-MARINE-FISH-CORAL-NATURE-153821.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_corals-mangroves-unlikely-to-survive-if-global-warming-exceeds-2-deg-c-study_1728740972.html", "title": "Corals, mangroves unlikely to survive if global warming exceeds 2 deg C: Study", "title_page": "Corals, mangroves unlikely to survive if global warming exceeds 2 deg C: Study | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - While the world’s coastal ecosystems – such as coral reefs and mangroves – could help to guard against sea level rise, many of these species will not be able to survive if global warming exceeds 2 deg C.\nIf it hits 3 deg C, sea levels will rise by nearly 7mm a year, rendering nearly all the mangrove forests and coral reef islands unable to survive. About 40 per cent of tidal marshes will also not survive. Currently, the rate of sea level rise is around 4mm a year.\nIf global warming is limited to 2 deg C, 70 per cent of mangroves could still have a shot at survival, and around 95 per cent of tidal marshes and coral islands will continue to thrive.\nThese were the findings of a new study, led by researchers from Singapore’s Nanyang Technological University (NTU) and Australia’s Macquarie University.\nUsing data on sea levels from the last Ice Age, when glaciers were at their maximum area across the globe, researchers found that rising seas will devastate coastal habitats within the next 30 years.\nThe world has already warmed by close to 1.2 deg C so far.\nProfessor Benjamin Horton, director of the NTU’s Earth Observatory of Singapore (EOS), told The Straits Times that mangroves and coral reefs in Singapore have helped to reduce the impact of wave energy, protect coastlines, and serve as a habitat for a wide range of species.\nWork is under way on mangrove protection and restoration, but sea level rise could threaten all this progress, he said.\nWhile the EOS is working to quantify the survival thresholds and ecological tipping points of mangroves and coral reefs in Singapore, efforts must be made to rapidly reduce global greenhouse-gas emissions, he added.\nMangroves, while effective in keeping pace with rising sea levels as their roots can trap sediments brought in by the tides, will not be able to survive if constantly submerged in water.\nLikewise, rising ocean temperatures could cause coral reefs to bleach and subsequently die.\nThe data will help a study to assess the long-term viability of nature-based solutions, said Prof Horton. The study is funded by the National Parks Board’s Marine Climate Change Science Programme.\n“We are also examining the economic implications of differing sea level rise scenarios on coastal adaptation. Currently, the economic costs are largely unknown,” he added.\nThe paper, which was published in the scientific journal Nature on Aug 31, found that over 17,000 years ago, sea levels were so low – about 120m lower than they are today – that one could walk from Singapore to Indonesia or the Philippines.\nBut when the last Ice Age ended 11,700 years ago, increasing temperatures caused the ocean to rise rapidly, by 1m a century on average.\nThis wiped out vast swathes of coastal habitats globally, and it took thousands of years for nature to recover from the rapid loss.\nA similar catastrophe could occur if warming levels exceed the targets set out in the 2015 United Nations Paris climate agreement, which aims to keep global warming below 2 deg C, with a view of limiting it to 1.5 deg C.\nCoastal habitats are essential for coastal protection, storing carbon, nurturing juvenile fish, and helping to sustain millions of coastal residents.\nCoral islands are formed by the organic material derived from skeletons of corals and other animals and plants associated with corals. Such islands are found in the Pacific and the Caribbean, several of which are inhabited by people.\nAssociate Professor Simon Albert from the University of Queensland, who was one of the researchers from 17 institutions that had collaborated on the study, noted that these islands not only serve as fishing grounds, but are also home to generations of human settlements and often have deep cultural significance to indigenous communities.\nProf Horton said that studying past sea levels is one of the “most important fields” of climate science study, and is the basis for sea level projections. He noted that around 70 per cent of the one billion or so people living in low-elevation coastal zones are in Asia.\n“Improving our understanding of past and present sea level changes is crucial in minimising the effects of sea level rise through appropriate coastal planning, adaptation and mitigation strategies,” he added.", "url": "https://www.straitstimes.com/singapore/corals-mangroves-unlikely-to-survive-if-global-warming-exceeds-2-deg-c-study"}