{"authors": ["Kolette Lim"], "date_download": "2024-10-12 13:56:25", "date_modify": "2024-10-12 13:56:25", "date_publish": "2023-12-11 20:05:36", "description": "Retailers have placed additional orders to meet the increasing demand, said the Health Ministry. Read more at straitstimes.com.", "filename": "singapore_public-should-not-hoard-art-kits-pharmacies-and-stores-have-sufficient-supply-moh_1728741385.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/11/2023120762015329img9948.jpg?h=acec710f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_public-should-not-hoard-art-kits-pharmacies-and-stores-have-sufficient-supply-moh_1728741385.html", "title": "Public should not hoard ART kits; pharmacies and stores have sufficient supply: MOH", "title_page": "Public should not hoard ART kits; pharmacies and stores have sufficient supply: MOH | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Ministry of Health (MOH) has urged the public not to hoard antigen rapid test (ART) kits as Covid-19 cases spike here.\nRetailers and pharmacies here have a sufficient supply and have placed fresh orders to meet growing demand, said MOH in a statement on Dec 11.\n“MOH maintains a stockpile of ART kits and will release the stockpile to support retailers if the need arises,” the ministry added.\nIt advises the public to purchase ART kits in quantities that are sufficient only for immediate needs.\nCases of Covid-19 are rising in Singapore, putting a strain on medical resources. The rise in cases has led to increased demand for ART kits.\nChecks by The Straits Times on Dec 6 found that some pharmacies and stores had run out of ART kits, and not all had been restocked the day after.\nIn the week ending on Dec 2, 32,035 people were diagnosed with Covid-19, the highest number of infections recorded in 2023.\nIn the week of Nov 19 to 25, the estimated number of infections was 22,094, more than double the 10,726 in the week of Nov 12 to 18.\nMOH said in an earlier statement that the spike in cases could be due to many factors, including the year-end travelling season and waning population immunity.", "url": "https://www.straitstimes.com/singapore/public-should-not-hoard-art-kits-pharmacies-and-stores-have-sufficient-supply-moh"}