{"authors": ["Christopher Tan"], "date_download": "2024-10-12 13:33:11", "date_modify": "2024-10-12 13:33:11", "date_publish": "2023-06-22 17:35:01", "description": "There were two EV fires in 2022, up from one in 2021, SCDF said. Read more at straitstimes.com.", "filename": "singapore_transport_ev-fire-cases-rise-with-growing-adoption_1728739991.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/23/svfire220623_0.jpg?VersionId=LCJ4ZrqRHqkW7jegq.HVPk95DswbC3Wq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_ev-fire-cases-rise-with-growing-adoption_1728739991.html", "title": "EV fire cases rise with growing adoption of such cars", "title_page": "EV fire cases rise with growing adoption of such cars | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - While there have been just a couple of fires involving electric vehicles (EVs) here in the past two years, the low numbers represent a higher incidence rate than that of vehicles with other engine types – but this may be no cause for alarm.\nThere were two EV fires in 2022, up from one in 2021, according to the Singapore Civil Defence Force (SCDF).\nSuch incidents were double for electric hybrid vehicles – four in 2022 and two in 2021.\nCases of combustion engine vehicles had also gone up to 198 cases, from 152 in 2021.\nAlthough EV fires are relatively more rare than other vehicular fires, they are not insignificant in relation to their small and young fleet here.\nCompared with their respective population here, EV fires averaged 2.45 per 10,000 vehicles, versus 0.42 for electric hybrids and 1.97 for combustion engine vehicles.\nThis contrasts with statistics elsewhere. For instance, data from the US National Transport Safety Board found that EV fires averaged 25.1 fires per 100,000 sales – compared with 3,474 for hybrids and 1,529 for combustion engine vehicles.\nExperts here warn against drawing conclusions from the Singapore figures as the numbers are too small to yield statistically reliable inferences from.\nDr Zafar Momin, an adjunct associate professor at the National University of Singapore Business School, said: “Currently, the data on EVs in Singapore is very limited and it is hard to draw generalisations based on such a small sample size.”\nHe said data in the United States, which has a much larger vehicle and EV population, showed that EVs were “far less prone to catching fire” than other vehicles.\nHe added, however, that “when comparing across countries, there are many other factors that influence the comparative statistics such as accuracy of data, average vehicle age and mileage, driver profiles and driving conditions”.\nGeneral Insurance Association (GIA) chief executive Ho Kai Weng said: “The sample of one and two is not statistically meaningful to draw conclusions. Insurers seem to be taking the view that they don’t have enough dataset for Singapore EVs for now for any sort of modelling.”\nEven so, The Straits Times understands at least one major insurer has an EV policy which covers fire risks. Singlife’s Prestige package pays 110 per cent of an EV’s market value at time of loss caused by “fire or explosion during charging”.\nAccording to the SCDF, all the EV fires took place when the vehicles were on the move. The firefighting agency said that it is equipped to deal with EV fires.\n“Notwithstanding the relatively low number of EV fires, SCDF is aware and prepared for the unique challenges of fires involving EVs, such as the risk of a thermal runaway involving the high-voltage battery,” a spokesman said.\n“Water is the recommended medium for EV firefighting by manufacturers and organisations such as the US National Fire Protection Association,” the spokesman added.\n“Studies indicate that the application of water to extinguish EV fires poses a low risk of electric shock to responders. Nevertheless, we are mindful of the risk, particularly if responders are required to cut into the vehicle to extricate casualties.”\nIn November 2022, the SCDF introduced a vehicle fire blanket, which can effectively suffocate a conventional car fire. “If used in tandem with a firefighting water stream penetrating into the high-voltage battery, this can extinguish an EV-related fire,” the spokesman said.\nMeanwhile, members of the public are advised not to try to fight a fire if it spreads quickly or engulfs a vehicle, especially if it involves an EV. “In such instances, they are advised to retreat to a safe distance and call 995 for assistance,” the SCDF advised.", "url": "https://www.straitstimes.com/singapore/transport/ev-fire-cases-rise-with-growing-adoption"}