{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 13:30:58", "date_modify": "2024-10-12 13:30:58", "date_publish": "2024-08-18 21:29:58", "description": "Here are eight highlights from his speech. Read more at straitstimes.com.", "filename": "singapore_politics_ndr-2024-key-highlights-from-pm-wong-s-first-rally_1728739858.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/18/ndrsfwongcoll1808a.jpg?VersionId=j1qR4A4O9aCx6yRE0kiYocV8Vl7hN.cW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_ndr-2024-key-highlights-from-pm-wong-s-first-rally_1728739858.html", "title": "NDR 2024: Key highlights from PM Wong’s first National Day Rally", "title_page": "NDR 2024: Key highlights from PM Wong’s first National Day Rally | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Keeping Singapore strong and united, and sharing the benefits of progress to uplift all Singaporeans, and not just a few.\nThis was a key message from Prime Minister Lawrence Wong, who delivered his first National Day Rally speech on Aug 18 at the ITE College Central in Ang Mo Kio.\nPM Wong, who took over as Singapore’s fourth head of government in May, said Singapore needs a renewed social compact where every Singaporean feels there is hope. It is also where all citizens, even the most disadvantaged, know that they can get a fair shot in life and can get ahead if they make the effort and work hard, he said as he outlined enhancements in areas such as families, jobs, housing and education.\nParents will get an additional 10 weeks of shared parental leave, to be shared by both spouses. This will replace the current arrangement where husbands can share up to four weeks of their wives’ 16 weeks of maternity leave.\nThe new initiative will start with six weeks for babies born from April 1, 2025, and be increased to the full 10 weeks a year later, said PM Wong.\nThe additional 10 weeks will be paid for by the Government, and is on top of the current four weeks of leave for fathers and 16 weeks for mothers.\nIn total, parents will get 30 weeks – or 7.5 months – of paid parental leave, come 2026.\nAnd while paternity leave had been doubled from two to four weeks earlier in 2024, employers had discretion whether to offer the additional time off. From April 1, 2025, this will become mandatory, said PM Wong.\nHe said more support will also be provided to those who want to have a third child or currently have three or more young children, with details to be unveiled at Budget 2025.\nWhy it matters:\nThe additional 10 weeks of shared parental leave by 2026 is arguably the most headline-grabbing policy move of this National Day Rally.\nTogether with the doubling of mandatory paternity leave from two to four weeks, the moves on parental leave are emblematic of what PM Wong termed “a major reset” to policies to realise Singapore’s new ambitions, but which also require a major change in mindsets.\nA new SkillsFuture Jobseeker Support scheme will give temporary financial support to those who have lost their job.\nThese workers will get up to $6,000 over up to six months while they go for training, career coaching and job matching.\nA new training allowance under the SkillsFuture Level-Up programme will also take effect in 2025. Announced at Budget 2024, every Singaporean aged 40 and above will get an allowance of up to $3,000 a month when they go for full-time training. The cap is 24 months’ allowance, amounting to $72,000.\nSeparately, the $4,000 in SkillsFuture Credit announced earlier has been topped up in the accounts of Singaporeans aged 40 and above and is ready for use, said PM Wong.\nWhy it matters:\nThe up to $6,000 in support is tangible assistance aimed at helping lower- and middle-income workers who lose their jobs to bounce back stronger.\nFirst sketched out by then Prime Minister Lee Hsien Loong at his swansong National Day Rally in 2023, the goal is for a temporary safety net that would free retrenched workers to upgrade their skills by taking care of their immediate needs.\nThis is so that they could turn the setback into an opportunity to prepare themselves for a good long-term job, rather than to seize the first available job out of desperation.\nPM Wong said the scheme underscores the Republic’s renewed social compact that the Government will have Singaporeans’ backs, but each person must make an effort to pull themselves up.\nREAD MORE HERE: Up to $6,000 in financial support over maximum of 6 months for those who lose jobs\n3. Housing enhancements for couples, singles and aged\nThe Enhanced CPF Housing Grant, which offers lower-income couples up to $80,000 to get their first homes, will be increased.\nSingles applying for Build-To-Order (BTO) flats will get priority when buying a home near their parents from mid-2025. Currently, married children and their parents who are buying new flats to live with or near each other get priority access to BTO flats. This will soon be extended to all parents and their children – married or single.\nThe authorities are also studying ways to improve existing homes and make them more senior-friendly for those who wish to age where they live. This is on top of launching more elderly-friendly housing with care and social services.\nWhy it matters:\nAlongside the new Standard, Plus and Prime HDB classification, the increased grant seeks to assure young couples that there will be an HDB flat within their budget when they wish to settle down, in every region of Singapore.\nPM Wong acknowledged that the home price-to-income ratio of HDB resale flats is slightly higher than in the pre-Covid-19 years, but that the Government is on track to meet its commitment to build 100,000 new flats by 2025, which is stabilising the property market.\nThe move to give singles who want to live near their parents the same priority access to BTO flats increases housing equity, especially as more people here are staying single.\nREAD MORE HERE: Enhanced CPF Housing Grant to be raised to help first-timers, lower-income couples\n4. Gifted Education Programme to be revamped\nWhy it matters:\nThe replacement of the GEP in nine primary schools with a new approach that encompasses all primary schools means more high-ability students will get to be stretched to their full potential.\nThe shift, after 40 years of the GEP, is intended to signal the Government’s intent to take care of all students – not just early bloomers but also those who grow up in the heartland and attend neighbourhood schools, said PM Wong, who counted himself among this number.\nMeanwhile, schools with more students from disadvantaged backgrounds or higher learning needs will get more teachers and funding.\nTaken together, the moves make the education system more inclusive, and help all students here learn at their own pace to realise their full potential.\nREAD MORE HERE: Gifted education programme to be updated; all primary schools to stretch high-ability pupils\n5. Higher mother tongue learning\nMore students will be able to take higher mother tongue as a subject, with plans to lower the criteria for eligibility, said PM Wong in his Mandarin speech.\nCurrently, if students wish to take Higher Chinese Language (HCL) in secondary school, they must attain a certain overall Primary School Leaving Examination score to be eligible. This excludes those who did well in Chinese but who did not meet the PSLE score requirement.\nThe change will allow students who are strong in Chinese to take HCL from Secondary 1. Students who wish to take Higher Malay and Higher Tamil will also benefit.\nWhy it matters:\nThe policy tweak means those who show aptitude and interest in their mother tongue will soon be able to stretch themselves by taking the subject at a higher level in secondary school, without having to attain a certain PSLE score.\nThis is in keeping with moves over the years – such as full subject-based banding, which took effect in 2024 – for students to take subjects at a higher or lower level based on their strengths, and to evolve the education system to stay fit for purpose.\nThe change will nurture more students who are proficient in the Chinese language, and is part of the Government’s commitment to support the cultivation of bilingual capability here, said PM Wong.\nREAD MORE HERE: More students strong in mother tongue to be allowed to take it at higher level from Sec 1\n6. Kallang Alive Masterplan\nAs part of the new Kallang Alive Masterplan, a new indoor arena with a capacity of 18,000 will be built to host more top-tier events, in place of the current Singapore Indoor Stadium. This means that Singapore athletes can compete on home ground, cheered on by fellow Singaporeans.\nBetter facilities will be built there for Team Singapore athletes too, including new sports science and sports medicine facilities.\nThe national training centres for key sports will also be sited together there. The Sports School, which is located in Woodlands now, will move to the Kallang area so that student athletes can study and train with their seniors.\nKallang will also be a place for all Singaporeans to enjoy sports. A main road running through the Sports Hub will be converted into a pedestrianised community boulevard with sporting facilities and programmes.\nWhy it matters:\nThe indoor stadium is 35 years old, which makes a reboot timely if Singapore is to have world-class facilities to meet its sporting ambitions.\nKallang will also become the new home for Team Singapore athletes, while unlocking synergies for various sports through co-location.\nWith the Sports Hub firmly back in public control, the initiative is with the Government to use it and the surrounding area to strengthen the Republic’s sporting culture.\nThe masterplan aims to shape Kallang into a lifestyle destination for Singaporeans of all abilities to take part in and enjoy sports, while also promoting family bonding and a healthier nation.\nREAD MORE HERE: Singapore Sports School to move to Kallang; new indoor stadium to seat 18,000\n7. Prime waterfront coastline\nA 120km-long prime waterfront coastline will be built, with current waterfront areas to be stitched together in the future.\nThere will be new precincts around this waterfront. First, the Nicoll and Kampong Bugis precincts will have new residential and recreational developments. Second, Tanjong Rhu, currently made up of private housing, will have new HDB flats.\nThird, Marina South and Marina East will have more than 10,000 new homes. They will be sustainable and car-lite precincts with cycling networks and pedestrian-friendly streets, and be well served by the MRT network.\nWhy it matters:\nDespite being the historic area where modern Singapore was born, the plans show that there is space all around the waterfront for new precincts that will lay the foundation for a reimagined, future city.\nMaking ambitious plans for the Republic that will take decades to bear fruit is a National Day Rally tradition.\nThe Greater Southern Waterfront was announced in the 2019 rally, comprising 30km of coastline from Gardens by the Bay East to Pasir Panjang. Other major projects announced at past rallies include the Jurong Lake District, Changi Terminal 5 and the redevelopment of Paya Lebar Airbase.\nThese plans reflect Singapore’s forward-looking approach to urban planning, focusing on sustainability, resilience and enhancing the quality of life for its residents.\nREAD MORE HERE: S’pore to have accessible 120km southern coastline; new homes in Nicoll, Marina East\n8. New Singapore College of Islamic Studies\nA new Singapore College of Islamic Studies will be built, which will nurture future generations of Singapore’s Islamic leaders.\nPM Wong said the Government supports efforts to build a modern and progressive Malay/Muslim community, while still maintaining their distinctive customs and way of life.\nHe also committed to ensuring that all in the community will benefit from Singapore’s progress and be able to play a role in shaping the nation’s future.\nWhy it matters:\nThe new college is the culmination of eight years of work by Malay/Muslim leaders here, and signifies confidence that the Republic is ready to build a religious training institute of good repute.\nWhen it was mooted in 2016, the idea of setting up a local Islamic college was driven by the need to groom home-grown religious leaders grounded in Singapore’s multiracial and multi-religious society.\nSome of the lead-up work by the authorities over the years included engaging the Muslim community on their views, and study trips to Islamic colleges in countries such as Egypt, Turkey and the United States.\nIn 2020, a postgraduate programme was started by the Islamic Religious Council of Singapore to help returning overseas religious graduates contextualise what they had learnt overseas to Singapore’s social and political realities, in preparation for their becoming religious teachers, or asatizah.\nREAD MORE HERE: New Singapore College of Islamic Studies to nurture future Islamic leaders\nWatch PM Wong’s National Day Rally speech here:", "url": "https://www.straitstimes.com/singapore/politics/ndr-2024-key-highlights-from-pm-wong-s-first-rally"}