{"authors": ["Leow Wen Xuan"], "date_download": "2024-10-12 13:48:27", "date_modify": "2024-10-12 13:48:27", "date_publish": "2024-03-21 22:00:00", "description": "The finance community must collaborate with other sectors to drive change more effectively, he said. Read more at straitstimes.com.", "filename": "singapore_the-financial-sector-plays-a-critical-role-in-achieving-net-zero-emissions-in-asia-dpm-heng_1728740907.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/21/202420032120NUS20SGFIN20Sustainability20Summit20-20DPM20Heng20Swee20Keat2028229.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_the-financial-sector-plays-a-critical-role-in-achieving-net-zero-emissions-in-asia-dpm-heng_1728740907.html", "title": "Financial sector plays a critical role in achieving net-zero emissions in Asia: DPM Heng", "title_page": "Financial sector plays a critical role in achieving net-zero emissions in Asia: DPM Heng | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The financial sector plays a key role in helping Asia tackle climate change, but players in this space need to deepen their sustainability-related skills and capabilities, and collaborate with other sectors in the economy to drive change more effectively, Deputy Prime Minister Heng Swee Keat said on March 21.\nCiting Singapore’s own road map to cutting emissions, DPM Heng said the sustainability journey is a cross-cutting one, ranging from increasing renewable energy generation to making buildings more energy-efficient and reducing waste, water and energy consumption, among other efforts.\n“The sustainable finance community must, therefore, develop cross-sectoral expertise and collaborate with counterparts in the real economy. Doing so will help catalyse Asia’s net-zero transition more effectively,” said DPM Heng during a summit on sustainable finance convened by the National University of Singapore’s (NUS) Sustainable and Green Finance Institute.\nNet zero can be achieved when carbon emissions due to human activity are counterbalanced by natural processes that remove carbon from the atmosphere.\nRestoring forests that remove and store carbon, switching from fossil fuels – the primary source of carbon emissions – to renewable energy, and carbon capture technologies are all paths that countries can take to reach net zero.\nDPM Heng said the application of robust science-based research, expertise and innovation is critical to solving the climate challenge, and the financial sector can help to catalyse the flow of “venture and private equity capital to support deep-tech innovations that can have a major impact”.\n“By combining our strengths in financial services with our growing capabilities as a Global-Asia node of technology, innovation and enterprise, Singapore can play a relevant role here,” added DPM Heng, who is also Coordinating Minister for Economic Policies.\n“To address the challenges of climate change, the sector must continue to invest in deepening sustainability-related skills and capabilities, forge closer collaborations with academia and industry, and position itself to pursue innovation with impact and at scale,” DPM Heng said.\nHe added that the Government was moving on this front and funding research that looks into how complex climate challenges can be tackled. It is also investing in the translation of research insights into real-world solutions and incubating start-ups to convert solutions into fresh business ideas, DPM Heng said.\n“Much more needs to be done to promote more investment by venture capital, private equity and corporate venture funds, and to bring the expertise of venture funding to the increasingly urgent and important areas of climate transition and sustainability,” he added.\nDPM Heng’s comments come amid growing interest in the role the financial sector can play to help countries – especially in developing regions – cut their emissions and adapt to the impacts of climate change.\nCOP29, the United Nations climate change conference, will be held in Baku, the capital of Azerbaijan, in November.\nIt is highly anticipated that an agreement on a climate finance target could be reached during the conference that will see developed countries supporting climate action in developing countries.\nA target of US$100 billion (S$134 billion) in climate finance annually that was set in 2009 is considered insufficient when compared with the investment required to avoid dangerous levels of climate change.\nThe new target is meant to better incorporate the needs and priorities of developing countries.\nDuring the event at the Carlton Hotel, DPM Heng cited a report by management consultancy firm McKinsey, which estimated that Asia needs more than US$3 trillion to achieve net zero by 2050.\nSpeaking to an audience of about 200, which included academics, policymakers and representatives from financial institutions, DPM Heng said: “Many of you here are part of the sustainable finance community – in Singapore, in the region, and around the world.\n“Your efforts in working together, across sectors and borders, will help facilitate our net-zero goals and the broader success of the green transition.”\nClosing the finance gap is especially pressing in the Asia-Pacific as the region accounts for about half of greenhouse gas emissions globally, DPM Heng said.\n“If we do not manage the green transition early, we will have to deal with an increasing carbon footprint,” he added.\nSingapore is already feeling the heat from rising temperatures, said DPM Heng. For example, Singapore’s third national climate change study that was released in January projected very hot days and warm nights to be the new normal in Singapore, with annual mean temperatures rising between 0.6 deg C and 5 deg C by the year 2100.\n“In other words, our coolest month today is hotter than the warmest month in the 1960s,” said DPM Heng.\nProfessor Sumit Agarwal, managing director of NUS’ Sustainable and Green Finance Institute, said at the event that the financial sector has to pivot to prioritise environmentally sustainable economic growth over conventional economic growth or face the consequences.\n“As national and corporate transition commitments convert into actions, some companies – particularly those owning stranded assets – will inevitably face the need to wind down and maybe even shut down,” he said.\n“These companies need to transform, and new ones have emerged and will emerge to provide future-ready technologies, resources, supply chains and associated infrastructures.”", "url": "https://www.straitstimes.com/singapore/the-financial-sector-plays-a-critical-role-in-achieving-net-zero-emissions-in-asia-dpm-heng"}