{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 13:56:19", "date_modify": "2024-10-12 13:56:19", "date_publish": "2023-02-19 05:00:00", "description": "HPB said a national survey in 2021/22 found prevalence of breastfeeding was high at 97 per cent. Read more at straitstimes.com.", "filename": "singapore_breastfeeding-on-the-rise-in-singapore-maternity-hospitals_1728741379.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/21/svbaby170223_5.jpg?VersionId=UO_F0nQKZivfighYmuTk90LYbylnSE3m", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_breastfeeding-on-the-rise-in-singapore-maternity-hospitals_1728741379.html", "title": "Workplaces should support mums as more breastfeed their children: HPB", "title_page": "Workplaces should support mums as more breastfeed their children: HPB | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Ms Krystal Yeo expresses milk under her work jacket at her desk every day – her workplace does not have a nursing room and her boss does not like her to be away from her workstation.\nThe mother of a five-month-old boy has had to go to the office every day since Covid-19 safety rules were relaxed in 2021.\n“It is quite awkward doing this, especially when we have many (male) contractors walking around,” said the 36-year-old training and development executive. “There is no privacy.”\nBut she persisted due to the benefits of breast milk and the high prices of formula milk.\nBreastfeeding is on the rise in Singapore, according to the Health Promotion Board (HPB) and maternity hospitals here.\nHPB said a national survey in 2021-2022 showed that the prevalence of breastfeeding was high at 97 per cent. Among infants up to six months old, nearly 40 per cent were exclusively breastfed.\nKK Women’s and Children’s Hospital said mothers who exclusively breastfed upon discharge rose from 75 per cent in 2013 to 86 per cent in 2021, while those who initiate breastfeeding in the hospital rose from 95 per cent previously to 98 per cent in the last three years.\nKKH launched Singapore’s first and only milk bank for donor human milk in 2017, which helps premature infants as well as infants 12 months and under with medical problems such as malabsorption.\nThe National University Hospital (NUH) said more than 99 per cent of mums in NUH breastfeed their newborns.\nAt the Singapore General Hospital, breastfeeding rates upon discharge have remained consistent at nearly 90 per cent in the last five years.\nHPB said all three public maternity hospitals here are BFHI-certified, and one private hospital – Raffles – is also certified.\nThe BFHI or Baby Friendly Hospital Initiative, is part of a global effort by the United Nations Children’s Fund (Unicef) and the World Health Organisation (WHO) to ensure maternity hospitals meet best practice standards in supporting mothers to breastfeed successfully.\nNearly all maternity hospitals here, including private hospital Thomson Medical, said they have stopped accepting sponsorships from milk companies, and milk brands are fed to infants on a rotating basis in hospitals.\nMothers here are also breastfeeding longer, with a NielsenIQ Baby Power 2022 study showing women were nursing their babies for an average of 11.8 months in 2022, up from 8.1 months in 2018.\nExperts have long extolled the health benefits of breastfeeding, noting that breastfed children are healthier, perform better on intelligence tests and are less likely to be overweight or suffer from diabetes later in life.\nMs Eunice Choo, a senior teacher, had a better experience at her workplace, Rainbow Centre, where she and some colleagues would express milk together in the nursing room.\nShe had a tough first few weeks of breastfeeding. “The baby and I were both learning, he couldn’t latch on properly and kept crying because he couldn’t get milk,” she said. But once she got the hang of it, it was easy.\nDoctors said educating new mothers on the benefits of breast milk is important, as misinformation, as well as conflicting advice, from well-meaning family and friends is common.\nThe Nielsen study showed that 64 per cent of mums rely on the Internet and 50 per cent on word of mouth for information on formula milk.\nThe most common assumption is that the mother does not have enough milk, said lactation consultant Wong Boh Boi. “So she gives up breastfeeding before it is established,” said Dr Wong, adding that it takes about two weeks to establish breastfeeding.\nShe added that new mothers should get help from lactation consultants and breastfeeding support groups.\nShe also stressed the importance of support from immediate family.\nMilk storage at work an issue\nRachel (not her real name), who works in healthcare, said storing her breast milk at work is an issue, as the pantry fridge is usually packed with her colleagues’ food. She is worried about spillage and contamination of her milk.\nCompared with her friends in the private sector who have to express milk in meeting rooms, she considers herself lucky to be able to use a nursing room. But the room has no water and cleaning facilities.\n“I have to prepare wet tissues to do the cleaning. There is no table, so I have to be extra careful when pouring the milk into the storage bag,” she said.\nAnother new mother, Nicole (not her real name), said breastfeeding was costly for her as she had to buy the right breast pump and supplements to ensure a good milk supply.\n“Breastfeeding is more stressful than giving formula milk, which my husband and helper can do,” said the programme manager in a multinational corporation.\nBut even with a supportive workplace, hectic work schedules can make expressing milk challenging.\nA senior account executive who wanted to be known only as Cheryl L said her workplace at an international advertising agency has a dedicated mother’s room for expressing milk, including a fridge to store it.\n“I pump three times a day at work,” said the mother of a five-month-old and a two-year-old. “It is difficult sometimes because there are back-to-back meetings. Then I get stressed because if I don’t pump regularly, the milk supply will dip.”", "url": "https://www.straitstimes.com/singapore/breastfeeding-on-the-rise-in-singapore-maternity-hospitals"}