{"authors": ["Leow Wen Xuan"], "date_download": "2024-10-12 13:40:03", "date_modify": "2024-10-12 13:40:03", "date_publish": "2024-04-18 16:03:03", "description": "Mrs Rena Lee had helped broker a historic agreement that lays the groundwork for international collaboration. Read more at straitstimes.com.", "filename": "singapore_s-pore-oceans-ambassador-rena-lee-makes-time-magazine-s-list-of-100-most-influential-people-of-2024_1728740403.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/18/wgt-renaleestandby-180424.jpg?VersionId=SsmdmOnod1UwSjEHcgok7W7tTBltOV3o", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-oceans-ambassador-rena-lee-makes-time-magazine-s-list-of-100-most-influential-people-of-2024_1728740403.html", "title": "S’pore oceans ambassador Rena Lee makes Time magazine’s list of 100 most influential people of 2024", "title_page": "S’pore oceans ambassador Rena Lee makes Time magazine’s list of 100 most influential people of 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore’s Ambassador for Oceans and Law of the Sea Issues Rena Lee has been named one of Time magazine’s top 100 most influential people.\n“With calm dignity, determination and grace, Lee successfully led deliberations to legally protect biodiversity within the blue heart of the planet, the cornerstone of earth’s life-support system,” said the publication on April 17.\n“We all should applaud her heroic moves, breaking decades of deadlock over governance of human actions that impact not just the future of tunas, sharks, squids and whales, but that of all of life on earth – humans included,” it added.\nAs Singapore’s Ambassador for Oceans and Law of the Sea Issues and Special Envoy of the Minister for Foreign Affairs, Mrs Lee had helped broker the high seas treaty, a historic agreement that lays the groundwork for international collaboration to protect the areas outside of national jurisdictions.\nAlso known as the Marine Biodiversity of Areas Beyond National Jurisdiction (BBNJ) Agreement, it was a treaty more than 15 years in the making, including over four years of formal talks.\nMore than 190 nations agreed on the text of the treaty at UN headquarters in March 2023, after a 40-hour negotiation session chaired by Mrs Lee. At the conclusion of the session, Mrs Lee, who is in her 50s, announced to thunderous applause: “The ship has reached the shore.”\nSingapore’s Ministry of Foreign Affairs said at the conclusion of the talks in March 2023 that Mrs Lee’s leadership had “enabled parties to bridge differences and arrive at an ambitious and future-proof BBNJ Agreement”.\nTime magazine said: “Imagine navigating negotiations for a legal framework governing human activities over and under about half of the world.\n“That has been the challenge facing Rena Lee... the president of a UN intergovernmental conference on marine biodiversity, during five years of turbulent discussions over efforts to safeguard life in the high seas.”\n“This is a woman with a will of steel,” said Professor Peter Ng, who was technical adviser to the Singapore delegation during the BBNJ proceedings.\n“With scientists, leaders and ambassadors from over 100 countries, all with their own interests, actively arguing their cases, the whole exercise can be very chaotic. Getting a general consensus appears almost impossible,” he said.\nBut with her “soft-spoken and very firm style”, Mrs Lee was able to command the respect of the room and keep things in order.\nA “perfect diplomat”, Prof Ng called her. “And it’s not just talk; she gets things done.”\nHe added that even after all the proceedings and disagreements, most of the delegates still had “immense respect” for her. “That is something I don’t always see. It’s easy to see why they honoured her as such.”\nThe treaty, which was adopted by the UN in June 2023, helps pave the way for the establishment of marine protected areas in the high seas. The high seas refer to international waters, located more than 200 nautical miles from any coastline.\nWhen the new treaty comes into force after it is formally adopted, signed and ratified by enough countries, it will allow the creation of marine protected areas in these international waters. It will enter into force after 60 countries ratify the treaty. To date, only four nations – Palau, Chile, Belize and Seychelles – have done so.\nOthers who made Time’s list include China’s Premier Li Qiang and Iranian journalist and human rights activist Narges Mohammadi, who received the Nobel Peace Prize in 2023.", "url": "https://www.straitstimes.com/singapore/s-pore-oceans-ambassador-rena-lee-makes-time-magazine-s-list-of-100-most-influential-people-of-2024"}