{"authors": ["Ian Cheng", "Judith Tan"], "date_download": "2024-10-12 13:53:01", "date_modify": "2024-10-12 13:53:01", "date_publish": "2023-12-29 18:50:00", "description": "With cruelty and welfare cases at an 11-year high, authorities and organisations are stepping up their game. Read more at straitstimes.com.", "filename": "singapore_animals-in-singapore-have-had-a-bleak-2023-but-things-may-look-up-yet_1728741181.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/29/cs-generic-Cat04.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_animals-in-singapore-have-had-a-bleak-2023-but-things-may-look-up-yet_1728741181.html", "title": "Animals in Singapore had a bleak 2023 - but acts of kindness show there is hope", "title_page": "Animals in Singapore had a bleak 2023 – but acts of kindness show there is hope | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The year 2023 paints a bleak picture for animals in Singapore, with cruelty and welfare cases at an 11-year high.\nHowever, things may yet look up – there were also incredible acts of kindness by good Samaritans, as well as programmes and initiatives from both animal welfare groups and the authorities for 2024 and beyond.\nBut first, the bad news.\nThe Society for the Prevention of Cruelty to Animals (SPCA) revealed in October that it had investigated 862 cases of cruelty and welfare concerns between July 2022 and June 2023 – the highest since the same period between 2011 and 2012.\nDuring that same period, it helped 266 abandoned animals – a sharp increase from a yearly average of up to 70 cases in previous years. However, the organisation acknowledged that the surge in cases could have been due to greater awareness and willingness on the public’s part to make reports.\nIn the first half of 2023, there were more than 400 cats found in cases of pet hoarding, with rescuers pleading burnout – the first few months alone saw a “disproportionately high number” of abuse cases.\nThere were a number of shocking cases that drew the ire of animal lovers in Singapore – among them, the arrest of a teenage boy caught on video trying to perform obscene acts on a cat outside a Housing Board flat, and a case of two emaciated cats found locked in a cage with the skeletal remains of three others in a rental flat in Jalan Minyak for over a month.\nPets of all shapes and sizes were involved in other cases – at least 20 hamsters were abandoned under a shrub and drenched in heavy rain, while more than a dozen guinea pigs were found abandoned in thermal food bags at the side of a road.\nA parrot was also rescued by an animal welfare society after a video of a woman abusing it circulated, while a director at a dog training and daycare centre was charged with animal cruelty after being caught on video hitting a dog multiple times and shouting profanities. He could be heard telling it: “Welcome to hell, my friend. Four weeks of hell, stupid idiot dog. Tonight, you make a single noise, see what happens to you.”\nIt’s not just pets that have had it hard – the trade in illegal wildlife and animal parts in Singapore is “thriving” in physical and online marketplaces, with black markets hawking live exotic animals to the tens of thousands of people who subscribe to such messaging groups.\nHot water, insecticide or glue traps have been used to abuse and kill snakes in several cases. Speaking of glue traps, the Animal Concerns Research and Education Society (Acres) revealed in March that nearly a thousand birds and other wildlife have been accidentally caught by these cruel contraptions since 2020.\nLocal animal shelters and welfare organisations here saw adoption numbers halved in recent years, with some attributing this to the rising cost of living and more people returning to the office after the Covid-19 pandemic, among other reasons.\nIn fact, more pets were abandoned after the pandemic, with the trend possibly worsening as animal groups reported a spike in the number of pets being abandoned and surrendered.\nExperts told The Straits Times that boredom and exposure to domestic violence are among the reasons people abuse animals. A psychiatrist at the Institute of Mental Health called it a “complex tangle of related issues”, which raises further questions as well as concerns in the search for answers to why people abuse animals.\nRemember the two cats rescued from Jalan Minyak?\nToday, Barry and Nori have found their fur-ever homes – though separated from each other, they are away from the distress they were put through.\nBird Paradise avian keeper Ellen Tay, 37, who read about their plight in ST in June, could not get the two cats out of her head.\n“My senior cat died in December last year at the age of 16. He was my first cat, adopted at just three weeks old. After reading the news, I was drawn to this one cat and could not really stop thinking about its plight. I told my husband, Ken, about this and he was open to giving him a home,” Ms Tay said.\nCat rescuer Fiona Loh, who “bailed” the two cats from the Animal and Veterinary Service (AVS), had her hands full with other rescues when Ms Tay approached her “for a home trial with one of them”.\n“The home trial was to see if Nori was able to get on well with our other cats. I was told he was quite a handful with his loud wails and meows for food,” she said.\nAfter two months with the couple, Nori has settled down. He has put on weight and has become particularly close to a tabby named Goma.\n“The only time he whines and meows loudly is when they are apart. He weighs about 6.4kg now, plays with toys like a kitten and follows us around like a dog,” she said.\nLike Ms Tay, Ms Leow’s previous cat also died in December 2022, and she felt it was time to adopt another.\n“When Barry came, he was sniffing around for other cats,” she said.\nWhen the family went away for two weeks, Barry was settled at Cat Crib for boarding.\n“There he was reunited with Rong, a tabby. They were together after Fiona’s rescue and rehabilitation and they looked like they needed one another, so I decided to adopt Rong as well. Both of them came home with me on Dec 13 after I returned from my trip,” Ms Leow said.\nMs Loh said it was good that the two cats went to different families because it would help them heal and perhaps forget about the trauma they went through.\nWhen asked about the cats abandoned in the Jalan Minyak rental flat, AVS said it is still investigating the case.\nThose who abandon their pets can be charged under the Animals and Birds Act. First-time offenders can be fined a maximum of $10,000, jailed for up to 12 months, or both. However, about 95 per cent of cases that are reported to AVS are not substantiated.\nThe authorities also took steps in 2023 to ensure a better future for animals, with new initiatives to protect them.\nIn October, it was announced that a council will be established by 2025 to raise professional standards and practices in the veterinary sector.\nStandards for the breeding and sale of pet cats in Singapore were aligned to conditions already in place for pet dogs, as part of efforts to ensure their health and welfare.\nA programme to manage the population of stray dogs by trapping and neutering them will be extended by the authorities – 80 per cent of these animals have been sterilised since November 2018.\nA new bridge will be built to allow both wildlife and pedestrians to cross between Bukit Timah Nature Reserve and the Western Water Catchment Area via Bukit Batok Nature Park.\nIn December, the Government proposed a framework on cat management that will lift a 34-year ban on cat ownership in Housing Board flats – two cats will be allowed for each HDB flat, and three cats for each private residence. Of course, this will come with the caveat that this should not inconvenience neighbours or impact public health. It will be implemented in the later part of 2024.\nWelfare groups also stepped up their game.\nLocal animal welfare group Chained Dog Awareness Singapore launched a new campaign to educate the public about dog behaviour and science-based pet care.\nSPCA enhanced its youth education programme to raise awareness of animal abuse among young people. In May, SPCA started an initiative that saw more than 100 pets whose owners are from low-income households given free health screening.\nMeanwhile, a pilot programme in two nursing homes allows their residents to play with cats to help the residents improve their mobility.", "url": "https://www.straitstimes.com/singapore/animals-in-singapore-have-had-a-bleak-2023-but-things-may-look-up-yet"}