{"authors": ["David Sun"], "date_download": "2024-10-12 13:29:16", "date_modify": "2024-10-12 13:29:16", "date_publish": "2024-05-07 20:40:00", "description": "Assets seized include Bearbricks, luxury watches, designer bags and thousands of bottles of alcohol. Read more at straitstimes.com.", "filename": "singapore_politics_646k-spent-so-far-to-maintain-wine-handbags-and-other-assets-seized-in-3b-money-laundering-case_1728739756.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/07/hzassets070524.jpg?VersionId=EHpRVUF3RRVIEiM5iN_iFkTe1IJLFNjb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_646k-spent-so-far-to-maintain-wine-handbags-and-other-assets-seized-in-3b-money-laundering-case_1728739756.html", "title": "Police have incurred $646k so far to maintain assets seized in $3b money laundering case", "title_page": "Police have incurred $646k so far to maintain assets seized in $3b money laundering case | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Almost $650,000 has been spent by the authorities for the upkeep of assets seized in relation to Singapore’s largest money laundering case.\nOn May 7, Minister for Home Affairs K. Shanmugam said the expenses were incurred for the storage, maintenance and safeguarding of the seized assets, which included properties, vehicles and luxury goods such as branded bags, watches and alcohol.\nHe said expenses included engaging specialised services from industry partners or service providers to oversee the handling, upkeep and value preservation of the assets.\nHe said: “As of March 2024, police have incurred about $646,282 in such expenses. These expenses are borne by the state. They are covered by the forfeited cash, and the proceeds of sale of the forfeited non-cash assets, which are channelled to the state.”\nMr Shanmugam was replying to a parliamentary question by Mr Saktiandi Supaat (Bishan-Toa Payoh GRC) about what expenses had been incurred in preserving the assets seized and how these expenses would be covered.\nSo far, more than $3 billion in assets have been seized.\nThese included 207 properties, 77 vehicles, more than $1.45 billion in bank accounts, more than $76 million in cash of various currencies, thousands of bottles of liquor and wine, cryptocurrency worth more than $38 million, 68 gold bars, 483 luxury bags, 169 branded watches and 580 pieces of jewellery.\nAlso seized were colourful bear-like figurines, called Bearbricks, which were listed as “ornaments” by the police. They are collectible toy figures produced by Japanese collectible company Medicom Toy.\nLuxury goods, such as the designer handbags seized in the case, would have to be stored and handled with care to maintain their value.\nA total of 10 foreigners linked to the case were nabbed by the authorities in simultaneous raids on luxury homes across Singapore on Aug 15, 2023.\nThey were charged the next day, and as at April 30, five have been jailed.\nThe first to be dealt with was Su Wenqiang, 32, who was sentenced to 13 months’ jail on April 2 after pleading guilty to two money laundering charges. Nine other charges were taken into consideration for sentencing.\nHe forfeited to the state $5.9 million in assets, including more than $2 million in a bank account, more than $600,000 in cash, a Mercedes-Benz car, a Toyota Alphard, more than 200 bottles of alcohol and luxury items such as bags, jewellery and watches.\nCyprus national Su Haijin, 41, who had jumped from the second-floor balcony of a good class bungalow during a police raid, was sentenced to 14 months’ jail on April 4 after pleading guilty to one charge of resisting arrest and two money laundering charges. Another 11 charges were taken into consideration for sentencing.\nHe forfeited assets worth around $165 million to the state, including 13 properties worth some $91 million, $45 million in bank accounts, $2.1 million in cash, $3.3 million worth of proceeds from the sale of seven cars including a Ferrari Spider, and 69 Bearbrick figurines.\nWang Baosen, 32, was sentenced to 13 months’ jail on April 16 after pleading guilty to two money laundering charges. Another six charges were taken into consideration.\nHe forfeited about $8 million in assets, including $4.4 million used to pay for a luxury condominium unit, over $3.2 million in bank accounts, a Toyota Alphard worth $284,000 and more than $112,000 in cash.\nSu Baolin, 42, was jailed for 14 months on April 29.\nHe pleaded guilty to two money laundering charges and one charge for abetting false representations made to the Inland Revenue Authority of Singapore. Another 10 charges were taken into consideration for sentencing.\nHe forfeited about $65 million, or around 90 per cent of his assets, to the state. These included more than $30 million in seven properties, more than $22 million in bank accounts, and jewellery, watches and bags worth over $4 million in total.\nZhang Ruijin, 45, was jailed for 15 months on April 30 after pleading guilty to one money laundering charge and two forgery charges. Five other charges were taken into consideration for sentencing.\nHe forfeited about $118 million, or around 90 per cent of his assets. These included $51 million in properties, $38.4 million in bank accounts, $14.6 million in cash, $6.3 million in vehicles, $2.2 million in cryptocurrency, a $4.3 million Patek Philippe watch and 1,084 bottles of alcohol.\nThe Immigration and Checkpoints Authority said Su Wenqiang and Wang were deported to Cambodia on May 6 and will be barred from re-entering Singapore.", "url": "https://www.straitstimes.com/singapore/politics/646k-spent-so-far-to-maintain-wine-handbags-and-other-assets-seized-in-3b-money-laundering-case"}