{"authors": ["Ng Wei Kai"], "date_download": "2024-10-12 14:20:22", "date_modify": "2024-10-12 14:20:22", "date_publish": "2022-08-02 15:36:13", "description": "NS liabilities are the same for all young male citizens, says Defence Minister. Read more at straitstimes.com.", "filename": "singapore_politics_1-in-5-nsfs-enlisted-are-new-citizens-and-prs-up-from-1-in-20-in-the-early-2000s-ng-eng-hen_1728742822.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/03/md_nsf_03082022.jpg?VersionId=p8GChDOoofOVuSY6srMkbk89FIqlGYBK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_1-in-5-nsfs-enlisted-are-new-citizens-and-prs-up-from-1-in-20-in-the-early-2000s-ng-eng-hen_1728742822.html", "title": "1 in 5 NSFs enlisted is a new citizen or PR, up from 1 in 20 in the early 2000s: Ng Eng Hen", "title_page": "1 in 5 NSFs enlisted is a new citizen or PR, up from 1 in 20 in the early 2000s: Ng Eng Hen | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - About one in five full-time national servicemen (NSFs) enlisted yearly is a new citizen or permanent resident (PR), said Defence Minister Ng Eng Hen on Tuesday (Aug 2).\nThis is up from about one in 20 in the early 2000s, with PRs and new citizens forming an increasing proportion of enlistees over the years, he added.\nHe said: \"Without that extra inject of new citizens and PRs, our smaller birth cohorts would have impacted Singapore Armed Forces' (SAF) manpower needs more acutely.\"\nOf the enlistees who are new citizens or PRs, slightly more than half belong to the former category while the rest are PRs, Dr Ng told Parliament in response to statements about national service (NS) exemptions for new citizens made by Non-Constituency MP Leong Mun Wai.\nDr Ng said: \"I have decided that it is important to correct the misleading statements put out by Mr Leong, because they strike at the foundations of equity and universality that underpin NS in Singapore.\"\nThe minister cited a Facebook post that Mr Leong had made on SAF Day (July 1), where he said it is only fair that all PRs who want to become citizens must do NS. In the post, Mr Leong also argued that Singapore should allow easier deferment or even exemption from NS for talented individuals.\nHe said: \"Is it fair that we forfeit our local talents their chances of developing their talents while many new male citizens do not need to do NS?\"\nReferring to this statement and others Mr Leong had made over the last year, Dr Ng said the facts must be put out to reassure the national servicemen in the SAF and Home Team.\nHe said: \"If pre-enlistees are misled into thinking that new citizens of their age are exempted, where will they have the heart to serve NS?\"\nMany new citizens are enlisted for NS every year, Dr Ng added, and new citizens and PRs are contributing to national defence.\nHe said NS is the bedrock of the SAF and Singapore's national defence.\n\"MPs have the duty to ask questions and debate policies, including NS policies, in this House. But they should not make misleading statements that can weaken NS, the SAF and Home Team.\"\nDr Ng added that there should be no doubt that for every young male citizen, whether by birth, registration or descent, NS liabilities are the same.\nHe said they will be enlisted for NS at 18 years or older to perform full-time NS and thereafter must fulfil their Operationally Ready NS duties.\nIn a separate written response to Mr Leong, Dr Ng said that in 2021, 9 per cent of NSFs enlisted were PRs. This has grown from about 1 per cent in the early 2000s, he said.\nHe added that if a foreigner comes to Singapore and becomes a citizen as a mature adult, typically in his 30s or 40s, he is exempt from NS as he did not enjoy any socio-economic benefits like young Singaporeans did, and also because he would be too old to enlist for full-time NS.\nAfter Dr Ng spoke, Mr Leong took the floor to register an objection and seek clarifications. He objected to not being allowed a speech in response to Dr Ng, adding that the minister had made several accusations against him.\nMr Leong went on but was reminded by Deputy Speaker of Parliament Jessica Tan that he was allowed only to ask for clarifications and not make statements - as per Parliament’s standing orders for ministerial statements.\nHe then said the minister had not answered his question on the number of new citizens who were not required to serve NS.\nMr Leong said: \"What is the number or the number of new citizens who have not performed NS? The number the minister has given only forms a subset of the new citizens.\"\nDr Ng reiterated that an average of 3,400 new citizens serve or will serve NS each year - a figure that the Defence Ministry had given Mr Leong in July - and said he had already answered Mr Leong's question.\n\"It's not in the interest of this House to further debate based on misleading statements and inaccurate statements,\" said Dr Ng.\nHe added that he had given Mr Leong the full facts, and that the facts speak for themselves.\nOn Monday, Dr Ng said there were about 60,000 new citizens who sponsored their children for Singapore citizenship or PR between 2000 and 2021.\nIn a written reply to a question from Mr Leong, Dr Ng added that among the male children who were below 18 at the point they were sponsored, around 3 per cent were exempted from NS for reasons such as being medically unfit.\nThis mirrored the overall exemption rates for each enlistment cohort, he said.", "url": "https://www.straitstimes.com/singapore/politics/1-in-5-nsfs-enlisted-are-new-citizens-and-prs-up-from-1-in-20-in-the-early-2000s-ng-eng-hen"}