{"authors": ["Justin Ong"], "date_download": "2024-10-12 13:46:08", "date_modify": "2024-10-12 13:46:08", "date_publish": "2021-04-08 18:14:28", "description": "PAP leaders stress it is about picking someone best able to ensure the team can be greater than sum of its parts. Read more at straitstimes.com.", "filename": "singapore_politics_4g-leaders-should-be-given-chance-to-relook-succession-plan-holistically-says_1728740768.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/04/08/photo_2021-04-08_18-07-44.jpg?VersionId=6c6CJKgMQj7mqXmPfvb86UQDRcjUjM8T", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_4g-leaders-should-be-given-chance-to-relook-succession-plan-holistically-says_1728740768.html", "title": "4G leaders should be given chance to relook succession plan holistically, says Chan Chun Sing", "title_page": "4G leaders should be given chance to relook succession plan holistically, says Chan Chun Sing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The People's Action Party's (PAP) fourth-generation team should be given an opportunity to relook the question of succession holistically, now that Deputy Prime Minister Heng Swee Keat has stepped aside as leader, said Minister for Trade and Industry Chan Chun Sing on Thursday (April 8).\nThis is because the process goes beyond a ranking of the available candidates, to choosing a leader best able to ensure that the team can be greater than the sum of its parts, PAP leaders emphasised.\nMr Chan was responding to a question at a press conference on whether he is next in line, given his role in the party as second assistant secretary-general and deputy to DPM Heng.\nNoting that a collective decision on the next 4G leader would be made in due course, Mr Chan said: \"Our leadership succession plans go beyond just choosing a leader... It is always about finding and forming the strongest team possible for Singapore so that Singapore has the best chance to defy the odds of history, to not only survive but to thrive.\"\nAsked if there are any candidates and front runners for the 4G leadership, Transport Minister Ong Ye Kung echoed Mr Chan's points, adding that it is not a race to choose a single winner.\nThe PAP way, said Mr Ong, is to fundamentally look at how the leadership team can work together and support one another.\n\"It's different when it's a race. You only have one winner at the end, standing on the podium with a medal around his or her neck,\" he said. \"If (it's) a team, we fight heart and soul on the field, and if we win, we have a trophy for the nation. And in that winning team, you will have a captain that can bring out the best in everybody.\n\"So that process of developing a strong team and rallying around the first-among-equals leader takes some time. What we have just learnt is a big change, a big reconfiguration. So we seek your understanding and support to give us some time to regroup.\"\nMr Chan said the 4G team would continue to remain focused on making sure Singapore emerges stronger from the Covid-19 pandemic while establishing the foundations for future success.\n\"In making any decision, all of us in the team will continue to put the interests of Singapore and Singaporeans foremost,\" he added. \"Just as how we have been taught, how it has been shown to us, and how previous generations of leaders have all exemplified this.\"", "url": "https://www.straitstimes.com/singapore/politics/4g-leaders-should-be-given-chance-to-relook-succession-plan-holistically-says"}