{"authors": ["Ang Qing"], "date_download": "2024-10-12 14:08:54", "date_modify": "2024-10-12 14:08:54", "date_publish": "2023-10-11 20:15:50", "description": "This comes after Food Standards Australia New Zealand issued a notification to recall the product. Read more at straitstimes.com.", "filename": "singapore_australian-cheese-product-recalled-due-to-possible-bacterial-contamination_1728742134.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/11/yusfacheesecollage1110.png", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_australian-cheese-product-recalled-due-to-possible-bacterial-contamination_1728742134.html", "title": "Australian cheese product recalled due to possible bacterial contamination", "title_page": "Australian cheese product recalled due to possible bacterial contamination | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – An Australian cheese product is being recalled because of possible contamination with bacteria that can cause food poisoning.\nIn a statement on Wednesday, the Singapore Food Agency (SFA) said it had directed importer Xie Chun Trading to recall Unicorn Classic Camembert, a 125g cheese product.\nThe affected batch has an expiry date of Nov 8.\nThe recall is ongoing, the agency added.\nMr Chung Jian Yuan, a director of Xie Chun Trading, said some products from the affected batch were sold at several FairPrice outlets but these have been recalled.\nHe added that his firm had started recalling the products on Monday when they learnt that a person in Australia had food poisoning, possibly after consuming the contaminated cheese.\nThe recall of the affected batch here is expected to be completed on Thursday, said Mr Chung.\nRyan’s Grocery sold the same brand of cheese, but the company said its stock is not from the affected batch.\nSFA’s directive came after Food Standards Australia New Zealand issued a notification to recall the product earlier this week due to the potential presence of Listeria monocytogenes, a food-borne bacterium that can cause food poisoning.\nThe SFA said: “Food that is at higher risk of being contaminated with listeria include unpasteurised (raw) dairy products, soft cheese including those ripened by mould, refrigerated meat spread, smoked fish and ready-to-eat deli meats and sausages.\n“Symptoms of listeria infection may include fever, muscle ache, nausea and diarrhoea.”\nThose who have bought the affected product are advised not to eat it, SFA said.\nIf they have consumed the product and have concerns about their health, they should seek medical advice, the agency added.\nCustomers may contact their point of purchase for inquiries.", "url": "https://www.straitstimes.com/singapore/australian-cheese-product-recalled-due-to-possible-bacterial-contamination"}