{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:53:33", "date_modify": "2024-10-12 13:53:33", "date_publish": "2024-08-07 15:15:00", "description": "They congratulated him over his appointment as General Secretary of the Communist Party of Vietnam. Read more at straitstimes.com.", "filename": "singapore_pm-wong-pap-sec-gen-lee-hsien-loong-pen-congratulatory-letters-to-vietnam-s-to-lam_1728741213.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/07/VIETNAM-POLITICS-LEADER-051901.jpg?VersionId=12HdfOOCkKwptLezAGGXcQtPaeEpYAdv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_pm-wong-pap-sec-gen-lee-hsien-loong-pen-congratulatory-letters-to-vietnam-s-to-lam_1728741213.html", "title": "PM Wong, PAP sec-gen Lee Hsien Loong pen congratulatory letters to Vietnam’s To Lam", "title_page": "PM Wong, PAP sec-gen Lee Hsien Loong pen congratulatory letters to Vietnam’s To Lam | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Prime Minister Lawrence Wong and PAP secretary-general Lee Hsien Loong have written letters to congratulate Mr To Lam on his appointment as General Secretary of the Communist Party of Vietnam.\nIn his letter dated Aug 7, PM Wong told Mr Lam his appointment “reflects your colleagues’ support for and confidence in your leadership”.\nHe also said Singapore and Vietnam share excellent and mutually beneficial relations, noting that leaders of both nations regularly engage with each other at both bilateral and multilateral fora.\nThey have also built up a deep reserve of political and strategic trust, PM Wong added.\nPM Wong said over the years and in his various capacities, Mr Lam has been a strong supporter of Singapore-Vietnam ties.\nHe said both countries have deepened their political, economic and people-to-people links, as well as broken new ground by cooperating in renewable energy, climate change, cybersecurity, innovation and the digital economy.\n“I am certain that the close ties between our two countries will continue to strengthen under your leadership, especially as we work towards the upgrading of our bilateral relations to a Comprehensive Strategic Partnership,” said PM Wong.\nMr Lam, who is also Vietnam’s President, was named General Secretary of the Communist Party of Vietnam, the nation’s top position, on Aug 3.\nHe replaced former chief Nguyen Phu Trong, who died on July 19.\nIn his Aug 6 congratulatory letter to Mr Lam, Mr Lee said the appointment is testament to the contributions Mr Lam has made to his party and country.\n“You have assumed this role at a crucial juncture, as Vietnam embarks on a new chapter in its socio-economic development.\n“As a close friend and longstanding partner of Vietnam, Singapore stands ready to partner Vietnam in navigating the strategic and economic opportunities in our region, including in emerging areas such as renewable energy, sustainability, and digitalisation.\n“There is much more that our two countries can do together, especially in deepening party-to-party relations and our ongoing discussions to upgrade bilateral relations to a Comprehensive Strategic Partnership,” said Mr Lee, who also extended his best wishes for Mr Lam’s health and success.", "url": "https://www.straitstimes.com/singapore/pm-wong-pap-sec-gen-lee-hsien-loong-pen-congratulatory-letters-to-vietnam-s-to-lam"}