{"authors": ["Christopher Tan"], "date_download": "2024-10-12 13:33:03", "date_modify": "2024-10-12 13:33:03", "date_publish": "2023-09-05 18:46:56", "description": "Great Eastern’s plan is targeted primarily at landed home owners, who number more than 70,000 here. Read more at straitstimes.com.", "filename": "singapore_transport_motor-insurer-rolls-out-policy-to-address-risks-linked-to-charging-evs-at-home_1728739983.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/05/202102249902420550d1e8f0-703f-48bd-9416-24cbe2e7d5e3.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_motor-insurer-rolls-out-policy-to-address-risks-linked-to-charging-evs-at-home_1728739983.html", "title": "Motor insurer rolls out policy to address risks linked to charging EVs at home", "title_page": "Motor insurer rolls out policy to address risks linked to charging EVs at home | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Great Eastern, an insurer under the OCBC Group, has introduced a motor insurance policy which covers risks associated with charging an electric vehicle (EV) at home – the first here to do so.\nThe insurer’s Great EV Protect scheme covers home content losses arising from an EV fire (up to $20,000), outpatient treatment for electrocution from an EV charger (up to $1,000), and accidental damage to an EV charger (up to $5,000).\nGreat Eastern managing director of general and group insurance Jimmy Tong said: “Such incidents are infrequent, but there is still a risk.”\nMr Tong said the three areas of coverage are unique to Great Eastern, and come on top of the usual protection offered in a car insurance policy.\nFor instance, a driver has personal accident coverage of up to $120,000 while on the move, passengers are covered for up to $1,000 in medical reimbursement, and 24/7 roadside assistance is available in case of accidents – even in West Malaysia and Thailand.\nGreat Eastern’s EV plan is targeted primarily at landed home owners, who number more than 70,000 here.\nMr Tong pointed out that a home owner’s existing fire insurance may not cover damage arising from an EV blaze.\n“Most of these policies were worded before EVs came into existence,” he said, adding that the Great EV Protect fire damage payout would be “above and beyond” existing fire coverage a policyholder may have.\nWhile EV home chargers are covered by warranty, he said such warranties may not cover accidental damage.\nThe premium for Great Eastern’s EV policy will depend on factors such as driver profile and age, but Mr Tong said it would likely be “20 to 30 per cent higher” than the premium for an equivalent internal combustion engine vehicle.\n“This is to account for repairs, which are likely to be costlier with an EV,” he said, adding that the average price of its premium for a regular petrol Japanese car is around $1,000 a year.\nGreat Eastern is a relatively small player in the motor insurance arena, accounting for less than 5 per cent of the market. But Mr Tong said its business had grown by “more than 20 per cent in the last two years”.\nHe does not have a target market share with the new EV policy, although he is confident it will outperform the insurer’s current motor insurance market share.\nThere are more than 20 motor insurers in Singapore, but only eight are known to offer coverage for EVs. Out of the eight, only one other is known to address EV fire risks. Singlife’s Prestige package pays 110 per cent of an EV’s market value at the time of loss caused by “fire or explosion during charging”.\nAccording to the Singapore Civil Defence Force, there were two EV fires here in 2022, up from one in 2021. Although rare, they are not insignificant in relation to their small and young fleet here.\nCompared with their respective population here, EV fires averaged 2.45 per 10,000 vehicles, versus 0.42 for electric hybrids and 1.97 for pure internal combustion engine vehicles.\nAccording to global reinsurer MS Amlin, high voltages needed to charge EVs can pose an electrocution risk, especially when there is damage to cables and charging equipment caused by wear and tear or misuse.\nMr Tong noted that “as the EV market gets bigger – as we expect it to – the number of mishaps would naturally be higher”. The three additional areas of coverage would thus “provide peace of mind to consumers”.\n“That is what insurance is about,” he said.", "url": "https://www.straitstimes.com/singapore/transport/motor-insurer-rolls-out-policy-to-address-risks-linked-to-charging-evs-at-home"}