{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 13:30:40", "date_modify": "2024-10-12 13:30:40", "date_publish": "2024-07-17 18:43:53", "description": "The findings were part of the AGO’s thematic audit on parenthood support measures by MSF and ECDA. Read more at straitstimes.com.", "filename": "singapore_auditor-general-finds-misuse-of-cda-funds-government-paid-leave-for-parents_1728739840.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/17/kc-msf1707.jpg?VersionId=nVtQ.IAw7QUBUEWlEZlvofN8g5o9K_0r", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_auditor-general-finds-misuse-of-cda-funds-government-paid-leave-for-parents_1728739840.html", "title": "Auditor-General finds misuse of CDA funds, government-paid leave for parents", "title_page": "Auditor-General finds misuse of CDA funds, government-paid leave for parents | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - An audit of government accounts has flagged issues such as the misuse of government-paid parental leave and withdrawals from the Child Development Account (CDA) to purchase unapproved items, including adult-size sunglasses.\nIn a report on July 17, the Auditor-General’s Office (AGO) noted that some parents over-declared their employment income at the start of the leave claim period. Others made multiple employer claims for the same child, with companies where they were directors or shareholders.\nThree parents accounted for 26 of 55 cases of possible abuse of the government-paid parental leave scheme, involving disbursements totalling $690,000.\nThe Ministry of Social and Family Development (MSF) has reported this to the police and blocked errant employers from making further claims.\nThese findings were part of the AGO’s thematic audit on parenthood support measures by MSF and the Early Childhood Development Agency (ECDA). This audit is an in-depth examination of a selected area, which may involve more than one public sector entity.\nThe full report by the AGO also highlighted key lapses by various ministries and public agencies for the 2023/2024 financial year.\nBoth MSF and ECDA were found to have put in place processes and controls to ensure proper management of the schemes. These included using technology to reduce human error in grant administration, as well as processes to check and approve the disbursement of grants.\nThey also had processes to monitor grants or subsidies given, and manage the cessation of grants.\nHowever, the audit also pointed out certain areas for improvement, such as system errors leading to inaccurate grant administration.\nFor MSF, the audit found 77 cases where a total of $75,700 extra in grants had been given out. These typically involved cases where disbursements for government-paid maternity, paternity and childcare leave were made, even though eligibility criteria were not met.\nFor example, some parents had claimed extended childcare leave when the child was over 12 years old, when the last such claim should be made. These occurred mainly due to inadequate system checks or lapses.\nOn the misuse of CDA funds, the AGO also found that receipts provided as supporting documents for two CDA withdrawals could have been fabricated for the audit.\nThe AGO also flagged issues with system errors that affected subsidies for infant care and childcare, as well as kindergarten fee assistance in pre-schools.\nFor 45 such instances, these errors resulted in a total of at least $26,900 extra being given out in some cases, and at least $1,300 too little given out in others. They also led to subsidies being disbursed to ineligible applicants.\nThe AGO also noted that two pre-school centres did not declare that significant discounts had been given for programme fees for eight children enrolled. This resulted in $19,400 extra being given out in subsidies.\nIt also found over-disbursement of $272,100 to seven pre-school anchor and partner operators that submitted ineligible grant claims. These included claims for centre-based staff bonuses and salary costs of senior management at operators’ headquarters.\nThere were also delays in ECDA’s processing and disbursing of grant claims to pre-school operators, with AGO noting that this could affect operators’ cash flows.\nResponding to the AGO report, MSF said it has taken action against unauthorised CDA withdrawals. CDA trustees who misuse CDA monies will be required to make refunds to the CDA.\nInstitutions approved for such withdrawals – such as childcare centres, medical clinics and optical shops – will be fined or suspended if they breach their obligations to check the purchase and keep proper records.\nMSF has made police reports for six cases of unauthorised withdrawals with suspected criminal intent.\n“To prevent future cases of fraud and abuse, MSF has enhanced capabilities for detection, investigation and enforcement,” said the ministry.\nThese include system checks to flag suspicious claims for government-paid parental leave and send them for additional verification and investigation. MSF added that this may result in longer processing times for non-straightforward claims, such as for those who hold multiple jobs.\nThe AGO said MSF will be revising the reimbursement cap for government-paid parental leave to prevent parents from making multiple claims through different employers.\nOn the lapses in the administration of pre-school subsidies, MSF said ECDA has taken action to recover over-disbursements of subsidies and make up for under-disbursements, as well as issuing warning letters to the errant pre-schools.\nECDA is taking steps to strengthen its subsidy administration system, such as by rolling out a national means-testing system by end-2024 to improve the efficiency and accuracy of the means-testing of families applying for pre-school subsidies.\nThe ministry said that MSF and ECDA have systems and controls in place to ensure Singaporeans can benefit from the various grants, including new digital systems to ensure accurate disbursements and detect fraudulent behaviour.\n“These systems and controls have worked as intended for the vast majority of cases. Cases where there is potential abuse of the system are exceptions and have been promptly dealt with,” it added.", "url": "https://www.straitstimes.com/singapore/auditor-general-finds-misuse-of-cda-funds-government-paid-leave-for-parents"}