{"authors": ["Choo Li Meng"], "date_download": "2024-10-12 14:02:05", "date_modify": "2024-10-12 14:02:05", "date_publish": "2014-03-19 19:31:20", "description": "On March 18, 2014, Russian President Vladimir Putin signed a treaty making Crimea part of Russia, in the most radical redrawing of Europe’s map since Kosovo’s 2008 declaration of independence from Serbia. The move came just two days after a referendum in Crimea where the two million residents voted overwhelmingly to split from Ukraine. Read more at straitstimes.com.", "filename": "singapore_10-things-to-know-about-the-situation-in-crimea_1728741725.html", "image_url": "https://www.straitstimes.com/themes/custom/straitstimes/images/st-subscribe-placeholder.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_10-things-to-know-about-the-situation-in-crimea_1728741725.html", "title": "10 things to know about the situation in Crimea", "title_page": "10 things to know about the situation in Crimea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "On March 18, 2014, Russian President Vladimir Putin signed a treaty making Crimea part of Russia, in the most radical redrawing of Europe's map since Kosovo's 2008 declaration of independence from Serbia. The move came just two days after a referendum in Crimea where the two million residents voted overwhelmingly to split from Ukraine.\nHere are 10 things you need to know to keep up to date with the situation:\n1. What was the referendum about?\nCrimeans went to the poll on March 16 to decide whether to be reunited with Russia after 60 years as part of the Ukrainian republic, or go back to a 1992 constitution that effectively made Crimea an independent state within Ukraine. Nearly 97 per cent of the two million residents voted in favour of joining Russia.\nThe referendum was called after Russian forces seized de facto control of the region on Feb 27 and pro-Moscow authorities took power - dramatic developments that took place shortly after Ukraine's pro-Kremlin president Viktor Yanukovych was ousted on Feb 22 following three months of bloody protests against his rule.\n2. Why is Crimea significant to Russia?\nCrimea, a peninsula jutting into the Black Sea with 2.3 million inhabitants, is strategically important to Russia. It was under Russian control from the 18th century down through the Soviet era and until the German occupation in World War II. In 1954, then Soviet leader Nikita Khrushchev \"gifted\" Crimea to Ukraine from Russia when both were part of the Soviet Union.\nWhen the Union collapsed, Russia was left in an awkward position as the naval base for its Black Sea Fleet was situated in a newly independent Ukraine. Still, Russia has been able to keep its base. Its prior lease accord, due to expire in 2017, was extended until at least 2042. Mr Yanukovych signed a 2010 agreement that gives Ukraine a 30-per-cent discount on Russian gas in exchange for Russia's presence in Crimea.\n3. What did Russia say about Crimea?\nAhead of Crimea's referendum, Mr Putin defended the vote as \"legal'' and \"fully in line with the norms of international law and the UN Charter\". After the signing of the treaty making the region part of Russia, he told the Russian parliament in an emotional address: \"Crimea has always been an integral part of Russia in the hearts and minds of people.\" A theme throughout his speech was the restoration of Russia after a period of humiliation following the Soviet collapse, which he had famously described as \"the greatest geopolitical catastrophe of the 20th century.\"\n\"Don't believe those who try to frighten you with Russia and who scream that other regions will follow after Crimea,\" he said. \"We do not want a partition of Ukraine.\" Mr Putin said Russian forces in Crimea had taken great care to avoid any bloodshed, contrasting it with Nato's 1999 campaign to drive Serbian forces out of Kosovo.\n4. What did Ukraine say?\nUkraine's new pro-Western government has so far voiced restraint in the face of Russia's move to officially annex Crimea, but it has stressed that it \"will never recognise\" Crimea's status as a part of Russia. The fast sequence of events has left the Ukrainian government in a tough diplomatic quandary, at once trying to defuse tension with its superpower neighbour while also disputing that the breakaway southern province of Crimea may be lost. The Ukrainian Foreign Ministry said that \"Ukraine and the entire civilised world will never recognise the illegitimate declaration of independence of Crimea and its violent renunciation of the territory of our country.\" At the same time, a sombre Prime Minister Arseniy Yatsenyuk - pointedly speaking in Russian - told a nationally televised audience on March 18 that he wanted to ease the situation. The reactions appeared to be an attempt to calm pro-Russian protests in eastern Ukraine that are challenging the new government in Kiev, as well as ease strains with Moscow that have raised fears of more incursions.\n5. How did the rest of the world react?\nWorld leaders have condemned the annexation of Crimea as \"illegitimate\" and \"land grab\" by Russia, saying they will not recognise the move. The United States and Europe have slapped sanctions on senior Russian officials and pro-Russia Ukrainian officials for their role in threatening the security and borders of Ukraine. The US targeted 11 Russians and Ukrainians, including two aides to Mr Putin - Mr Vladislav Surkov and Mr Sergei Glazyev - deputy prime minister Dimitri Rogozi and the ousted Ukrainian president Yanukovcych who has fled to Russia. The EU targeted 21 Russians and Ukrainians, among them Alexsandr Vitko, commander of the Black Sea fleet that has been based in the Crimean port of Sevastopol since the late 1800s. Several names appear on both the US and EU lists, including Mr Leonid Slutsky, head of the committee in Russia's lower house of parliament. Australia followed suit with similar sanctions but did not name any of the 12 Russian and Ukrainian officials targeted.\nJapan has also condemned Russia for violating Ukraine's territorial integrity and said it was suspending negotiations on easing visa requirements and would not be starting talks on a new investment accord.\nVenezuela, a Russia ally, however criticised the US and EU sanctions, saying such issues should be resolved through the diplomatic channels of international law. Venezuela and Russia are tied by multi-million dollar contracts in areas such as defence, energy, manufacturing and construction.\n6. Why did Mr Putin move so quickly on Crimea despite global outrage?\nObservers say the speed of the annexation of Crimea has been fast and unstoppable, even with the looming threat of more sanctions from the West to damage the Russian economy. Mr Putin appeared to be gambling that the global outrage would eventually pass, as it did after Russia's war with Georgia in 2008, because a newly assertive Russia would be simply too important to ignore on the world stage. Although his actions have provoked threats of even tougher sanctions and diplomatic isolation, it remains unclear how far countries are willing to go to punish Russia and Mr Putin. Economic action, which would result in loss of jobs and huge investments, could hurt Western states as much as Russia, if not more so.\nThe Kremlin also has what geopolitical analysts and investment managers call \"the nuclear option\" if economy-wrecking sanctions are put in place: reducing natural gas supplies to the European Union.\nRussia, through state controlled energy giant Gazprom, supplies about a quarter of all the gas consumed in the 28-country EU - worth almost US$100 million (S$126 million) a day - and half of the gas supplied to Ukraine. Most of the EU-bound gas travels through pipelines that cross Ukraine.\nWithin Russia, Mr Putin - president for more than 14 years - enjoys unchallenged political authority and the wild popularity of his actions so far has raised his approval ratings and unleashed nationalistic fervour that has drowned out the voices of opposition or even caution about the potential costs to Russia.\n7. What are the potential risks and costs?\nThe fate of hundreds of Ukrainian soldiers, as well as military bases and ships, in Crimea remains dangerously unresolved. Crimean Prime Minister Sergey Aksenov said on March 14 that Ukrainian military personnel in Crimea would be allowed to choose either to leave or to serve in the armed forces of Crimea and later in the Russian armed forces. He also said the military equipment and properties belong to the Republic of Crimea military units. On March 19, Russian troops seized two Ukrainian naval bases, including a headquarters in the port of Sevastopol where they raised their flag. The commander of the Ukrainian navy, Admiral Serhiy Haiduk, was driven away by what appeared to be Russian special forces, but he was released a day later.\nMr Putin also faces a steep financial liability as he pushes to annex the peninsula, which lacks a self-sustaining economy and depends heavily on mainland Ukraine for vital services. Russia's regional development minister, Igor N. Slyunayev, has said Crimea is not self-sufficient for important resources such as electricity and water. About 80 per cent of its water comes through the northern Crimean canal from the Dnieper River and 80 per cent of Crimea depends on imports of electricity. There is also the burden of public salaries, pensions and other costs. Although Mr Putin and Russian lawmakers have made reassuring statements, including some promises of more than US$1 billion (S$1.26 billion) in immediate aid, there are no guarantees. Russia's revenue growth from oil and natural gas is projected to slow precipitously, and the Kremlin is grappling with big bills from salary increases for the police, the military and other public workers that preceded Mr Putin's return to the presidency in 2012.\nThere is also the possibility that the Ukrainian government could shut vital transportation lines to the geographically remote peninsula. In addition, there is no direct overland transportation link between Russia and Crimea, and building a bridge across the shortest waterway, near the Crimean city of Kerch, would take years and cost billions. The costs for Russia - and for Crimeans - could spike if the political instability disrupts Crimea's major industries, particularly tourism and banking, which are already suffering.\nBeyond the potential economic costs, fully absorbing Crimea is a herculean undertaking, requiring new passports, changing the currency to rubles from Ukrainian hryvnias, and integrating distinct systems for property records, taxes and more.\n8. What are the implications for NATO?\nRussia's annexation of Crimea has suddenly revived the North Atlantic Treaty Organisation's (NATO) central role as a counterweight to Moscow, and with it questions about the alliance's options and ability to act. US Vice-President Joe Biden swept into Poland and the Baltic nations on March 18 with a message of reassurance that their membership in Nato carries the protection of the United States. But given deep Western reluctance to use military force in response to Russia's aggression, it remains unclear what the alliance's commitment to collective security means for Ukraine and other non-members, should President Vladimir Putin continue to try to expand Moscow's influence in the former Soviet bloc.\nThe renewed emphasis on Russia and Europe is also likely to delay the alliance's efforts to turn itself into a global actor, able to deal with threats like terrorism and cyber warfare. Those goals are supposed to be the focus of the next Nato summit meeting in September in Wales.\n9. After Crimea, what's next?\nNow that Crimea has broken away from Ukraine, all eyes are on Mr Putin's next move. Although he has said the Kremlin has no plans to seize any other parts of Ukraine, there are lingering concerns that Russia might seek to grab areas in eastern Ukraine whose Russian-speaking population is far from supportive of the new government in Ukraine. Experts say eastern Ukraine is not a separate geographical entity like Crimea and there is no easy way to define where Russian-speaking regions end and Ukrainian-speaking parts of the country begin.\nIn a clear warning to Moscow, US Secretary of State John Kerry said a move into eastern Ukraine \"would be as egregious as any step that I can think of\". Such a scenario would \"require a response that commensurate with the level of that challenge,\" he added.\n10. What to look out for in the next few weeks?\nObservers have identified some things to watch out for as the Crimea situation continues to develop:\n- If the European Union and United States will impose further sanctions against Russia;\n- Whether pro-Russia voices in East Ukraine will demand a referendum to become part of Russia;\n- If Russian troops massing along the border of East Ukraine will infiltrate Ukraine as Russian troops have done in Crimea?;\n- What will the reaction be from the Ukraine government in Kiev? Will it try to send troops to Crimea to turn back the insurgency, or to East Ukraine to blunt Russian influence there?\nSource: BBC, CNN, AFP, Reuters, Washington Post, New York Times, Bloomberg", "url": "https://www.straitstimes.com/singapore/10-things-to-know-about-the-situation-in-crimea"}