{"authors": ["Toh Yong Chuan"], "date_download": "2024-10-12 14:20:37", "date_modify": "2024-10-12 14:20:37", "date_publish": "2017-06-29 10:00:00", "description": "SINGAPORE - Sunday was Hari Raya Puasa when Muslims celebrate the completion of the fasting month of Ramadan. But for Bangladeshi construction workers Alam Ataur Rahman, 40, and Islam Mohd Rubayet, 30, a dark cloud was hanging over the celebratory occasion. Read more at straitstimes.com.", "filename": "singapore_manpower_no-hari-raya-joy-for-two-bangladeshi-construction-workers_1728742837.html", "image_url": "https://www.straitstimes.com/themes/custom/straitstimes/images/st-subscribe-placeholder.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_manpower_no-hari-raya-joy-for-two-bangladeshi-construction-workers_1728742837.html", "title": "No Hari Raya joy for two Bangladeshi construction workers", "title_page": "No Hari Raya joy for two Bangladeshi construction workers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Sunday was Hari Raya Puasa when Muslims celebrate the completion of the fasting month of Ramadan. But for Bangladeshi construction workers Alam Ataur Rahman, 40, and Islam Mohd Rubayet, 30, a dark cloud was hanging over the celebratory occasion.\nThe duo are owed $19,152 in salaries by their former employer Zach Engineering Services, which had been ordered by the Labour Court to pay them on Oct 7, 2016.\nBut until now, they have yet to receive a cent from the company, which are owned by two Singapore permanent residents.\nMeanwhile, pro bono lawyers are helping them to get the money owed, by taking action to seize the company's assets.\nThe duo's nightmare began in 2015.\nMr Alam had joined the company in March and Mr Islam, a month later.\nOn paper, their employer was supposed to pay each of them $1,700 a month because they were experienced and skilled metal workers. Mr Alam had been working in Singapore since 1999 and Mr Islam, since 2008.\nEach had borrowed about $4,000 from moneylenders in Bangladesh to pay the agent fees to join the company.\nHowever, Mr Alam said he was paid only \"about $300 a month for makan (food)\", despite his boss promising repeatedly to give him his full salary.\nHe has two daughters aged 11 and 7, and a son, aged 3. His wife, a teacher, earns very little at home, he said.\nHis money woes drove him to tears: \"I cannot (bear to) call home. Every time I call home, my wife cry, I cry.\"\nIn December 2015, Mr Alam, Mr Islam and three fellow-workers complained to the Manpower Ministry.\nAfter 10 months of mediation sessions and a hearing, the Labour Court ordered their employer to pay Mr Alam $10,669.71 and Mr Islam $8,482.08. The other three workers were awarded about $31,200 in total.\nBoth Mr Alam and Mr Islam said they were owed more than the award amount but they had no proof because the company did not give them proper payslips.\nThe law now requires employers to issue itemised payslips for workers. It came into effect in April last year, after the start of their ordeal.\nThe duo said the company appealed against the Labour Court order. But before its conclusion, the company sent all five workers home in November 2016.\nMr Alam and Mr Islam subsequently borrowed more money from moneylenders, about $4,000 each, and found new employers in Singapore earlier this year.\nThe other three remained in Bangladesh.\nPro-bono lawyers arranged by non-government organisation Transient Workers Count Two (TWC2) are trying to recover the debt for the two men.\nA TWC2 spokesman said the case shows the weaknesses of the Labour Court system: the men were persistently underpaid, their long wait to get justice and even after the Labour Court ruled in their favour, the court did not have powers to enforce the order to pay.\nTheir former employer appears to be non-contactable.\n#Official records show Zach Engineering Services was set up in August 2012 and has a paid-up capital of $100,000. Its official address is an Anson Road office.\nIts owners are Mr Anthony Wong Yoon Fatt and Ms Natalie Lim Siew Ling, both of whom are Singapore permanent residents in their 40s.\nCalls to Mr Wong's mobile phone went unanswered. Also, nobody answered the door when The Straits Times visited their Chai Chee Street Housing Board flat on Wednesday (June 28).", "url": "https://www.straitstimes.com/singapore/manpower/no-hari-raya-joy-for-two-bangladeshi-construction-workers"}