{"authors": ["Sumiko Tan"], "date_download": "2024-10-12 13:45:55", "date_modify": "2024-10-12 13:45:55", "date_publish": "2021-04-08 18:00:00", "description": "Mr Heng, who turns 60 this year, cited long-term Covid-19 challenges, his age and demands of the top job as reasons. Read more at straitstimes.com.", "filename": "singapore_politics_dpm-heng-swee-keat-steps-aside-as-leader-of-4g-team-setting-back-singapores_1728740755.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/ppZiNe2_rdz15NgO8E-0HjO69ZY9zVsrILQ-yLQ3Lt0.jpg?VersionId=j_JmuKUKSt5MNrhRiQEemIZRuARuyw6i", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_dpm-heng-swee-keat-steps-aside-as-leader-of-4g-team-setting-back-singapores_1728740755.html", "title": "DPM Heng Swee Keat steps aside as leader of 4G team, setting back Singapore's succession plan for next PM", "title_page": "DPM Heng Swee Keat steps aside as leader of 4G team, setting back Singapore's succession plan for next PM | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Deputy Prime Minister Heng Swee Keat has decided to step aside as leader of the People's Action Party's fourth-generation (4G) team, and pave the way for a younger person with a longer runway to lead the country when Prime Minister Lee Hsien Loong retires.\nMr Heng, who turns 60 this year, cited the long-term and profound challenges of the Covid-19 pandemic, his age, and the demands of the top job, as reasons for his decision.\nIn a letter to PM Lee on Thursday (April 8), he said: \"This year, I am 60. As the crisis will be prolonged, I would be close to the mid-60s when the crisis is over. The 60s are still a very productive time of life.\n\"But when I also consider the ages at which our first three prime ministers took on the job, I would have too short a runway should I become the next prime minister then. We need a leader who will not only rebuild Singapore post-Covid-19, but also lead the next phase of our nation-building effort.\"\nMr Heng said the next prime minister should have a \"sufficiently long runway - to master the demands of leading our nation; formulate and see through our longer-term strategies for our country; and win the confidence and support of Singaporeans to build this shared future together\".\nSingapore's first prime minister Lee Kuan Yew was 35 when he took on the job, his successor Goh Chok Tong was 49 and PM Lee was 52.\nMr Heng, who said his decision was taken after careful deliberation and discussion with his family, said: \"I have decided to step aside as leader of the 4G team, so that a younger leader who will have a longer runway can take over. It will be for the 4G team to choose the person, and I stand ready to support the next leader. I appreciate the support of Singaporeans and have made this decision with the best interests of Singapore and Singaporeans at heart.\"\nIn his letter of reply, PM Lee said he understood and respected Mr Heng's decision. Mr Heng will stay on in Cabinet as DPM and Coordinating Minister for Economic Policies. As had been earlier planned between the two men, he will relinquish his finance portfolio when a Cabinet reshuffle takes place in about two weeks' time. Mr Heng will also remain the PAP's first assistant secretary-general.\nNoting that Mr Heng had done exceptional work as Minister for Finance, especially in the past year, PM Lee also said: \"I thank you for your selfless decision to stand aside. Your actions now are fully in keeping with the spirit of public service and sense of duty that motivated you to step forward when I asked you to stand for election in 2011.\"\nThe 4G leadership also issued a statement saying it respected and accepted Mr Heng's decision. \"We appreciate what a difficult decision it must have been. But no one could have foreseen the disruption of Covid-19, the great uncertainty it has created, and its long-lasting impact. We know that he has made the decision with Singapore's long-term interests at heart.\"\nThe statement noted the critical role that Mr Heng played in leading key initiatives, including delivering five Budgets in 2020. \"We are glad that DPM Heng will remain a member of our team, and will continue in his roles as DPM and Coordinating Minister for Economic Policies. We have all benefited from his experience and expertise, and we look forward to his continued advice and contributions as we navigate our recovery and chart Singapore's path forward.\"\nThe 4G statement, which bore the names of 30 office-holders, the Speaker of Parliament and the secretary-general of the NTUC, also noted that tackling Singapore's pressing immediate challenges and ensuring that the country emerges stronger from this crisis remain the foremost priority.\n\"Under these circumstances, the 4G team will need more time to select another leader from amongst us. We have therefore requested PM Lee Hsien Loong to stay on as Prime Minister until such time when a new successor is chosen by the team and is ready to take over. We are grateful that PM has agreed to our request.\"\nThe statement added: \"This unexpected turn of events is a setback for our succession planning. We recognise that Singaporeans will be concerned. We seek your support and understanding, as we choose another leader for the team. We will continue working as a team to serve our people, and to earn the confidence and trust of all Singaporeans.\"\nThe shocking news was announced at a 4.30pm press conference at the Istana on Thursday. Facing the media were PM Lee, Mr Heng, and seven other ministers who are in the PAP central executive committee. They included 4G ministers Chan Chun Sing and Ong Ye Kung, both 51, who had in earlier years been touted as contenders for the role of 4G leader, as well as younger ministers Lawrence Wong, 48, and Desmond Lee, 44.\nMr Heng, a former top civil servant, had been chosen by his PAP peers as \"first among equals\" in 2018, and was on track to be Singapore's fourth prime minister when PM Lee retired. While there was a question mark about his health after he had a brain aneurysm during a Cabinet meeting in May 2016, he fully recovered.\nPM Lee, 69, who succeeded Emeritus Senior Minister Goh Chok Tong as Prime Minister in 2004, had said that he aimed to hand over the reins of power by the age of 70 in February 2022.\nBut the Covid-19 pandemic appeared to have affected the succession timeline. In July 2020, when Singapore held its general election, PM Lee had said he would see Singapore through the crisis and hand the country over \"intact and in working order\" to his successor.\nOn Wednesday, Mr Heng had informed the ministers of his intentions to stand aside at the Istana. Following this, he, PM Lee and senior ministers Teo Chee Hean and Tharman Shanmugaratnam left the room. Health Minister Gan Kim Yong, who is chairman of the PAP, then chaired a meeting of all ministers, senior ministers of state and ministers of state, as well as the Speaker and the secretary-general of the NTUC, where they discussed the matter and agreed to the statement.\nSpeaking at the press conference on Thursday, Mr Heng - who was his usual relaxed and smiling self - said that when he joined politics, it was not with an ambition to become the prime minister. \"In fact, I did not even ask what appointments I would get,\" he said, adding that his life \"has been uplifted in significant ways\".\nOn when he made his decision to step aside, he said: \"I do not want to take on any job which I cannot deliver. As those of you who have worked with me know, I am a workaholic. I put my heart and soul into what I do. And therefore, I've been thinking about... whether am I the right person?\"\nGiven how the pandemic is such a bad crisis, he reiterated: \"I think it is better for someone who is younger, with a longer runway, to take on this job.\"\nAsked if the 2020 General Election results had a part to play in his decision, Mr Heng said it hadn't. In a surprise move, he had moved from his Tampines GRC ward to the East Coast GRC at the last minute. \"I did my best together with my team,\" he said.\nThe PAP won East Coast GRC, considered a shakier ward for the party, with 53.41 per cent of the votes. The party retained Tampines group representation constituency with 66.41 per cent.\nAt the press conference, PM Lee reiterated how Mr Heng had made a selfless decision with the best interests of Singapore in mind. \"Nevertheless, as the 4G statement acknowledges, this is a significant setback to our succession plans,\" he said.\nThe 4G team wants more time to work out new succession arrangements and he has agreed to stay on until such time as the new leader is chosen. \"I think they will take longer than a few months, but I hope that they will reach a consensus and identify a new leader before the next general election,\" said PM Lee. \"I have no intention of staying on longer than necessary.\"", "url": "https://www.straitstimes.com/singapore/politics/dpm-heng-swee-keat-steps-aside-as-leader-of-4g-team-setting-back-singapores"}