{"authors": [], "date_download": "2024-10-12 13:46:03", "date_modify": "2024-10-12 13:46:03", "date_publish": "2020-03-25 18:30:59", "description": "The crux of Singapore's strategy is to slow down the infection rate and maintain it at as low a level for as long as possible, Mr Gan said. Read more at straitstimes.com.", "filename": "singapore_health_singapores-strategy-in-fighting-covid-19_1728740763.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/03/25/yclab260320.jpg?VersionId=qUlkt5EqN5W2Bj45NBXW5QmTJcfFcQxF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_singapores-strategy-in-fighting-covid-19_1728740763.html", "title": "Singapore's strategy in fighting Covid-19", "title_page": "Singapore's strategy in fighting Covid-19 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - In Parliament on Wednesday (March 25), Health Minister Gan Kim Yong gave an update on the Republic's strategy in fighting the coronavirus since the outbreak here in January.\nAs of Wednesday, Singapore has seen 558 cases, of which two patients have died. Of the total, 155 have recovered.\nThe crux of Singapore's strategy is to slow down the infection rate and maintain it at as low a level for as long as possible, Mr Gan said.\nThis will help the country to better conduct epidemiological investigations, contact tracing and quarantining of close contacts, to prevent further spread and to preserve healthcare capacity to care for the more severe cases.\nThese were the key points in his ministerial statement.\n3 waves of cases\nSingapore has seen three waves of cases so far.\nLate-January to February: Imported cases from China. The virus originated in Wuhan, the capital city of Hubei province. These early patients were mostly tourists from Wuhan to Singapore.\nFebruary to March: Some of these imported cases led to local clusters, such as one at a health products store frequented by Chinese tourists, and another cluster comprising two churches. Two Chinese visitors had visited one of the churches, leading to Singaporeans being infected.\nMid-March to present: Second wave of imported cases. This has seen numbers doubling in a week from 266 to 558 as of Tuesday, and almost 80 per cent of these were imported. The patients are not from China, even though about 1,000 Singapore permanent residents and long-term pass holders have returned from China in the past week.\nInstead, the new cases are Singaporeans and residents returning from three key countries: Britain, the United States and Indonesia.\nThe big worry now: \"Over the coming weeks, the number of cases will continue to rise, as some of our around 200,000 overseas Singaporeans return home from all over the world,\" said Mr Gan.\nSingapore's 3-pronged strategy to fight Covid-19\n1. Reduce importation of cases\nBorder controls have been imposed since January to stem the inflow of travellers to the country.\nSuspected cases are conveyed directly to hospitals, and symptomatic travellers and some selected travellers are swabbed as a precautionary measure.\nBeyond checkpoints, there is a surveillance system in place at hospitals, polyclinics and the more than 900 clinics under the Public Health Preparedness scheme.\nThese clinics offer attractive subsidised rates for patients with respiratory illnesses to seek treatment and be spotted early if they have Covid-19.\nThere have been more than 267,000 subsidised attendances at these clinics so far, on top of patients checked at polyclinics, said Mr Gan.\nTo date, Singapore has done around 39,000 Covid-19 tests. This translates to 6,800 tests per million people in Singapore. It compares with about 6,500 in South Korea and 1,000 in Taiwan.\nSaid Mr Gan: \"These tests are important in helping us to detect as many cases as possible and as early as possible.\"\nContact tracing is also a crucial weapon.\nThe moment a case is confirmed, contact tracing is activated to identify close contacts and to quarantine them as soon as possible, so as to reduce further spread of the disease.\nSingapore has ramped up contact tracing efforts, from three teams when the process started to 20 teams. Officers are from the Health Ministry, Singapore Police Force and, now, also agencies like the Singapore Armed Forces.\nThe teams can trace up to 4,000 contacts each day, and will continue to scale up as needed. Technology is also being used, such as the TraceTogether app launched by the Health Ministry and GovTech last week.\nIt has urged people to abide by quarantine orders and stay-home notices.\n\"If you violate them, there will be penalties, and the greatest penalty is that you may infect others close to you,\" the minister said.\nMessages on things like the need to wash your hands and to see a doctor immediately have been widely circulated.\nThe Government has also extended help to employers whose employees have to serve out quarantine and stay-home notices.\nThe Health Ministry has paid particular attention to seniors, urging them to stay safe and to avoid activities in large groups.\nResearch efforts\nScientists in Singapore have been developing research and knowledge on Covid-19 and sharing these with other countries, said Mr Gan.\nIn the area of treatment, a therapeutic work group comprising members from various hospitals across different disciplines and the Health Sciences Authority has been set up.\nIt is working on guidelines for repurposed drugs with antiviral activity - such as Lopinavir-ritonavir, Interferon Beta-1B and hydroxychloroquine - to treat infected patients in Singapore.\nThe National Centre for Infectious Disease and Tan Tock Seng Hospital, together with the Singapore Blood Blank, have started to collect convalescent blood plasma from recovered patients for treatment for other patients.\nDoctors have also been taking part in international clinical trials, with collaborators such as the United States National Institutes of Health.\nOn vaccines, scientists around the world have successfully isolated and cultured the virus, which will help develop a vaccine, said Mr Gan.\nGlobal work is also being done to identify vaccine candidates and conduct testing, such as how Moderna Inc has started human trials.\nSingapore's Duke-NUS Medical School is working with Coalition for Epidemic Preparedness Innovations (CEPI) and international partners to develop a clinical trial for a vaccine. There are plans to start testing this year.\nMr Gan said that with all these ongoing efforts, WHO estimates that the earliest a vaccine will be ready would likely be sometime next year.\n\"We do not know how long the pandemic will last, but we have to plan on the basis that Covid-19 will be with us for a long while, maybe till the end of the year or longer, and ensure that we have the resources and capabilities to see us through.\"\nManaging healthcare capacity\nThe Government has said it will ensure sufficient capacity to meet not just the needs of Covid-19 patients but also that of other patients.\nInvestments had already been made to manage infectious outbreaks in Singapore, with the 330-bed National Centre for Infections Diseases (NCID) built for just this purpose, and with spare capacity, said Mr Gan.\nThe NCID can be further increased to over 500 beds if needed, he added.\nTo fight the coronavirus, public hospitals had earlier reviewed their patients and deferred non-urgent and elective procedures, while also ensuring these patients get enough supportive care.\nThe ministry is also collaborating with private hospitals for some non-Covid-19 patients to be cared for there instead.\nAlso, because about 80 per cent of Covid-19 cases have been found to be mild to moderate, the MOH is tapping private hospitals and setting up community care facilities for such patients. Patients here will continue to be quarantined and closely monitored so there is no community risk. Only when they have fully recovered and tested negative for the virus twice over 24 hours will they be discharged.\nThese steps will allow critical hospital resources to be focused on the seriously ill and minimise deaths.\nMr Gan also noted how healthcare workers - \"the most important resource\" - are taking on a very heavy load, and thanked them, and said measures have been put in place to reduce burnout. \"Most importantly, every case we can avoid will help to lighten their load,\" he said.\n'No sharp peak or long tail'\nJust as it's important to ensure sufficient healthcare capacity, it is equally important to prevent new local clusters in the first place, he stressed.\nThis way, Singapore can try to avoid an exponential growth in the number of infections, which could quickly overwhelm the healthcare system, as seen in Hubei and Italy, and increasingly in many other countries.\nSingapore's strategy is to slow down the infection rate and maintain it at as low a level for as long as possible, Mr Gan told Parliament.\nA lower infection rate will help the country to better conduct epidemiological investigations, contact tracing and quarantining of close contacts, to prevent further spread in the community, he said.\nIt also preserves healthcare capacity to care for the more severe cases.\nHe noted that if nothing is done, the number of cases will shoot up, as seen in some countries.\nIn such a scenario, the only hope is that most of the population gets infected and becomes immune, and the rate of infection starts to slow down as more become immune, or a vaccine or a cure is found.\n\"This scenario may seem attractive - you get over with it very quickly - but there are unfortunately two major risks,\" Mr Gan said.\nFirst, an uncontrolled spike in the number of cases in a short period of time will overwhelm the healthcare system, easily resulting in high mortality rates, \"and there is no turning back once we are on this track\".\nThe second risk is that it is not certain yet that this immunity will be effective or sustained.\nOne alternative is to introduce stringent safe distancing and other measures to slow down the infection rate.\n\"The number will still grow, but if we do it right, we will end up with a lower peak,\" he said.\nThis is commonly known as flattening the curve.\n\"But by flattening the curve, we may actually stretch out the pandemic, meaning it will take longer for the pandemic to be over,\" he said.\n\"For Singapore, we are still at the start of the curve today, and we have a chance, to do neither,\" he said.\n\"We hope that if we do it right, we can significantly slow down the growth as much as we can, until the pandemic is over, without either a sharp peak or long tail,\" he said.\n\"This may sound impossible, because these are the two curves that are established by academics. But as impossible as it may sound, we have to try our best to do so.\"\nLISTEN TO HEALTH CHECK PODCAST", "url": "https://www.straitstimes.com/singapore/health/singapores-strategy-in-fighting-covid-19"}