{"authors": ["Sherlyn Sim"], "date_download": "2024-10-12 13:28:21", "date_modify": "2024-10-12 13:28:21", "date_publish": "2024-08-21 20:56:05", "description": "Preliminary investigation indicates that the fire is likely to have been caused by cooking left unattended. Read more at straitstimes.com.", "filename": "singapore_two-taken-to-hospital-150-evacuated-after-fire-at-great-world-serviced-apartments-in-river-valley_1728739701.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/21/hzfire210824.jpg?VersionId=bJjGyGE8nkLQrma2LizhHk12H9KzrMth", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_two-taken-to-hospital-150-evacuated-after-fire-at-great-world-serviced-apartments-in-river-valley_1728739701.html", "title": "Two taken to hospital, 150 evacuated after fire breaks out at Great World Serviced Apartments", "title_page": "Two taken to hospital, 150 evacuated after fire breaks out at Great World Serviced Apartments | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Two people were taken to hospital and 150 others evacuated from their homes after a fire broke out at Great World Serviced Apartments in River Valley on Aug 21.\nThe Singapore Civil Defence Force (SCDF) said in a Facebook post that it was alerted to the fire in an 18th floor unit at 4.50pm, which its firefighters extinguished using a water jet.\nThe kitchen was damaged by the fire, and the rest of the unit suffered heat and soot damage.\nNo one was inside the unit at the time of the fire, while two people from neighbouring units were assessed for smoke inhalation and taken to Singapore General Hospital.\nAbout 150 people had evacuated the block before SCDF’s arrival.\n“Preliminary investigation indicates that the fire is likely to have been caused by cooking left unattended,” SCDF said, adding a reminder that people should not to leave their cooking unattended, even for a short while.\nIn February, the SCDF released its annual statistics report, which found that there were 1,954 cases of fire in 2023 – an 8.6 per cent increase from 1,799 cases in 2022.\nThe top two causes were electrical fires and unattended cooking, with 597 and 456 cases respectively.", "url": "https://www.straitstimes.com/singapore/two-taken-to-hospital-150-evacuated-after-fire-at-great-world-serviced-apartments-in-river-valley"}