{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 14:20:11", "date_modify": "2024-10-12 14:20:11", "date_publish": "2023-02-23 15:09:58", "description": "Foreigners can apply to be PRs under the programme if they invest at least $2.5 million into starting or expanding a business here. Read more at straitstimes.com.", "filename": "singapore_200-people-granted-singapore-permanent-residency-under-global-investor-programme-in-last-3-years_1728742811.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/23/IMGIMGbiz1175SEHQ111Q104JU_8.jpg?VersionId=b2sesvVzGKLG9Y7rSbW8cDdmM0FZjNke", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_200-people-granted-singapore-permanent-residency-under-global-investor-programme-in-last-3-years_1728742811.html", "title": "200 people granted Singapore permanent residency under Global Investor Programme in last 3 years", "title_page": "200 people granted Singapore permanent residency under Global Investor Programme in last 3 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - About 200 people obtained permanent residency through the Global Investor Programme (GIP) from 2020 to 2022, said Minister of State for Trade and Industry Low Yen Ling.\nShe gave the figure on Thursday in response to Mr Yip Hon Weng (Yio Chu Kang), who asked how many people have used the programme to qualify for permanent residency in the past three years.\nForeigners can apply to be PRs under the programme if they invest at least $2.5 million into starting or expanding a business here, or into a GIP fund that invests in Singapore-based companies. The GIP, launched in 2004, is managed by the Economic Development Board (EDB).\nApplicants should have at least three years of entrepreneurial and business track record, and be running a company with an annual turnover of at least $200 million in the year immediately preceding the application.\nThe GIP has attracted about $5.46 billion in investments from 2011 to 2022, and generated more than 24,000 jobs, Ms Low said in Parliament.\nShe added that as at October 2022, GIP investors have also injected $1.62 billion into approved GIP funds, of which fund managers have deployed $1.41 billion into actual investments.\nAbout 65.6 per cent of the $1.41 billion, or $930 million, have been invested in Singapore-based companies, she said.\nSingapore is among dozens of countries, including major economies such as the United States, the United Kingdom, Canada and Australia, that offer what is popularly known as the golden visa aimed at attracting high-net-worth individuals who can contribute to economic activity and boost investments.\nThe closest competitors to Singapore’s GIP are the United Arab Emirates and Hong Kong, experts believe. The latter recently announced plans to revive its golden visa that was suspended in 2015 in response to rising property prices and rents.\nMs Low said investors in the GIP come from a wide spectrum of areas and sectors such as technology, urban solutions and sustainability, as well as financial services.\nShe told the House that EDB conducts regular reviews to ensure GIP investors are rooted in Singapore, and that they contribute to the country’s economy and job creation.\nGIP PRs have to submit documentary evidence of the Singapore-based companies they have invested in, she noted, adding that EDB will also conduct site visits to assess the company’s business activities.\nLeader of the Opposition Pritam Singh asked how many PRs under the GIP have become citizens.\nIn response, Ms Low said a “very, very low” percentage of them gain citizenship. She also noted that GIP investors account for less than 1 per cent of the total number of PRs approved each year.\nOn Mr Yip’s question about government initiatives to integrate GIP PRs, Ms Low said they can join other new residents in various integration activities organised by the National Integration Council and partners. For example, the People’s Association Integration Council conducts a heartland orientation trail to give participants an immersive experience of Singapore’s heartland and way of life, she said. New PRs under the GIP are also able to tap EDB’s network to embark on philanthropy activities or contribute to community causes that benefit all, she added.", "url": "https://www.straitstimes.com/singapore/200-people-granted-singapore-permanent-residency-under-global-investor-programme-in-last-3-years"}