{"authors": ["Elisha Tushara"], "date_download": "2024-10-12 13:29:30", "date_modify": "2024-10-12 13:29:30", "date_publish": "2024-06-21 19:00:00", "description": "This comes after US surgeon-general Vivek Murthy called for a warning label on social media platforms. Read more at straitstimes.com.", "filename": "singapore_singapore-to-put-in-place-measures-to-deal-with-screen-time-and-device-use-in-coming-months_1728739770.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/21/IMG9150.JPG?VersionId=VPexU2w4dojeqHvZbbuuVApCACYNFXFk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-to-put-in-place-measures-to-deal-with-screen-time-and-device-use-in-coming-months_1728739770.html", "title": "Singapore to put in place measures to deal with screen time and device use in coming months", "title_page": "Singapore to put in place measures to deal with screen time and device use in coming months | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Measures to deal with device usage in Singapore will be released in the coming months, as electronic devices and social media become a big part of people’s lives, Health Minister Ong Ye Kung and Minister for Social and Family Development Masagos Zulkifli said in separate Facebook posts on June 21.\nThey highlighted the need for more decisive and effective measures to shape habits of device usage, especially for the young, with research showing negative effects and links to worsening mental health.\n“We can make our advice clearer and more definitive; we need to deliver them consistently across all healthcare settings, with more reminders; we need to put them into practice in pre-schools; and we need to find ways to encourage their adoption at home,” said the ministers.\n“We will finalise and announce these initiatives in the coming few months.”\nTheir comments come after United States surgeon-general Vivek Murthy recently called for a warning label on social media platforms for young users, arguing that social media is associated with mental health harms for adolescents.\nHe argued that the mental health crisis among young people constitutes an emergency and that social media, which is addictive by design, is likely an important contributor.\n“Although some commentators disagree with this hypothesis, in an emergency, Dr Murthy argued that we cannot afford to wait for the debate to be concluded. We need to act and put in place measures now,” Mr Ong and Mr Masagos said in their Facebook posts.\n“The starting point is screen time for the very young, 0-six years old. This shapes their habits in social media usage,” they said, adding that the Ministry of Health (MOH) and the Ministry of Social and Family Development (MSF) oversee the key touch points for children up to six years old, through child and maternity care, and pre-schools.\nThe impact of screen time on child development is a key focus of Gusto – Growing Up in Singapore Towards Healthy Outcomes – a local research effort, which has followed children conceived in 2009, the ministers said.\nThe Gusto study examines how conditions in pregnancy and early childhood influence the health and development of women and their children.\nOne finding from the study showed that pervasive screen time when the child is 12 months old altered brain activity before the child is two years old.\nIt also negatively affected executive function – a set of mental skills such as self-control and working memory – when the child reached nine years of age.\n“Another study found that screen time in infancy contributes to enduring individual differences in topological brain restructuring. Simply put, screen time exposure compromises the brain development of young children,” said the ministers in their posts.\nAnother yet-to-be-published study explores how a child’s mental wellness is affected by the linkage between brain development and executive function, they added.\nThe ministers said that the MOH and MSF have been discussing this issue of screen time over the past months, and share the concerns expressed by Dr Murthy. Prime Minister Lawrence Wong has also said tackling the mental health challenge is a national priority.\nThey said: “The impact of social media on mental health is not an unintuitive concept. Today, young minds are exposed to information, interactions and behaviours they do not have the maturity for; it takes away time for physical play and interactions, all of which can affect them profoundly as they grow up.”", "url": "https://www.straitstimes.com/singapore/singapore-to-put-in-place-measures-to-deal-with-screen-time-and-device-use-in-coming-months"}