{"authors": ["Royston Sim"], "date_download": "2024-10-12 13:49:10", "date_modify": "2024-10-12 13:49:10", "date_publish": "2017-09-08 12:10:45", "description": "Academic Huang Jing, who had his permanent residency revoked for working as an \"agent of influence\" for a foreign government, has left Singapore with his wife. Read more at straitstimes.com.", "filename": "singapore_academic-stripped-of-pr-status-and-his-wife-have-left-singapore-mha_1728740950.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2017/09/08/file6w3gfpeh4wi1fgjlt741.jpg?VersionId=f34NlZQb63shfOA.d2j46HURBKB6c56g", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_academic-stripped-of-pr-status-and-his-wife-have-left-singapore-mha_1728740950.html", "title": "Academic Huang Jing and wife have left Singapore after being stripped of PR status: MHA", "title_page": "Academic Huang Jing and wife have left Singapore after being stripped of PR status: MHA | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Academic Huang Jing, who had his permanent residency revoked for working as an \"agent of influence\" for a foreign government, has left Singapore with his wife.\nThe Ministry of Home Affairs (MHA) confirmed their departure in a statement on Friday (Sept 8).\nDr Huang, 60, and his wife, Shirley Yang Xiuping, had their permanent residency cancelled last month, and are permanently banned from Singapore.\nThe MHA had identified Dr Huang, the former professor from the Lee Kuan Yew School of Public Policy, as an \"agent of influence\" who sought to influence Singapore's foreign policy and public opinion here.\nThe couple appealed to the Home Affairs Minister, but it was rejected. They were then given a 14-day grace period - till Sept 6 - to leave the country.\nThe China-born couple are citizens of the United States. Dr Huang earlier told The Straits Times they would return to the US, where they have a house in the state of Virginia.\nDr Huang was director of the Centre on Asia and Globalisation and Lee Foundation Professor on US-China relations at the LKY School, and his views on China were regularly sought by organisations and the media.\nThe MHA said last month that Dr Huang \"used his senior position in the LKY School to deliberately and covertly advance the agenda of a foreign country at Singapore's expense. He did this in collaboration with foreign intelligence agents\".\n\"This amounts to subversion and foreign interference in Singapore's domestic politics. Huang's continued presence in Singapore, and that of his wife, are therefore undesirable.\"\nThe National University of Singapore, which the LKY School is a part of, has terminated Dr Huang's employment as he no longer had the necessary immigration permits to work in Singapore.", "url": "https://www.straitstimes.com/singapore/academic-stripped-of-pr-status-and-his-wife-have-left-singapore-mha"}