{"authors": ["Aqil Hamzah"], "date_download": "2024-10-12 13:32:41", "date_modify": "2024-10-12 13:32:41", "date_publish": "2024-06-29 13:30:00", "description": "She has appealed to the building's management, but has not received a response more than a month later. Read more at straitstimes.com.", "filename": "singapore_shocked-and-frustrated-woman-charged-400-by-building-management-to-have-wheel-clamp-removed_1728739961.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/29/rrclamp2906.jpg?VersionId=oCYQN1hOQozLK0.Z1YSEaQagtvWQb5zb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_shocked-and-frustrated-woman-charged-400-by-building-management-to-have-wheel-clamp-removed_1728739961.html", "title": "‘Shocked and frustrated’: Woman charged $400 by building management to have wheel clamp removed", "title_page": "‘Shocked and frustrated’: Woman charged $400 by building management to have wheel clamp removed | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – After taking a pilates class in the vicinity, a woman returned to the car she had parked at a building in River Valley Road only to find that its wheel had been clamped.\nThe 29-year-old, who wanted to be known only as Ms Ong, received a shock, as she had only been gone for an hour and had gained access to the building’s carpark after passing through a gantry.\nTo have the clamp removed from the wheel of her car, the analyst was instructed through a slip issued by management corporation strata title (MCST) 325 – the Chiap Chuan Building’s management office – to pay $400.\nMs Ong said the incident took place on May 24, and she was told by the building’s management that her car’s wheel had been clamped because she had parked illegally within the estate.\nThe management told her this was because the vehicle’s rear wheel had mounted the kerb next to the designated parking space.\nPhotos she shared with The Straits Times on June 24 showed her car – with a clamped wheel – parked within a parking space, albeit with its rear left wheel touching the line.\n“It was so frustrating. There was no negotiation, and the building’s management refused to release my car until I made the payment,” said the analyst. “In the end, I called the police, who advised me to pay the fee first and then appeal, as the management was adamant not to let me off with a warning.”\nOn the day of the incident – and after paying the fee – she e-mailed the Chiap Chuan Building’s management office to lodge an appeal.\nOn June 7, a representative responded that the appeal would be discussed during a council meeting on June 11 and that Ms Ong would be updated on the outcome.\nBut when Ms Ong tried to contact him subsequently on three different days, there was no reply.\nShe said: “I’m upset at the lack of transparency and accountability. It’s not just a personal grievance... other vehicle owners might encounter the same thing.”\nWhen contacted, the building’s management office did not give details of the incident. Meanwhile, the representative who communicated with Ms Ong did not respond when ST tried to contact him.\nA check on the Building and Construction Authority’s (BCA) website shows a guide for strata management, which is intended to “help subsidiary proprietors, council members and managing agents better manage their estates”.\nThis includes a sample list of common additional by-laws set by MCSTs, including those that outline when wheel-clamping devices would be used.\nSuch devices are commonly employed if an unauthorised vehicle is found on the premises, if a vehicle is parked in a particular parking space that it is unauthorised to be in, or if it is found to be parked indiscriminately.\nIn response to queries, a BCA spokesperson said these by-laws are made by MCSTs.\n“Such by-laws may include where and how vehicles should be parked in the common areas of the development, and the actions that would be taken by the MCST, including the administrative costs that may be recovered by the MCST, if vehicles are parked in breach of the by-laws,” the spokesperson added.", "url": "https://www.straitstimes.com/singapore/shocked-and-frustrated-woman-charged-400-by-building-management-to-have-wheel-clamp-removed"}