{"authors": ["Goh Yan Han"], "date_download": "2024-10-12 14:22:09", "date_modify": "2024-10-12 14:22:09", "date_publish": "2022-10-26 19:53:05", "description": "She cites the complicated geopolitical landscape with big-power rivalry and Ukraine war. Read more at straitstimes.com.", "filename": "singapore_s-pore-m-sia-ties-growing-stronger-must-be-sustained-in-today-s-complex-times-president-halimah_1728742929.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/27/2022102666213092bum9335-01_2.jpg?VersionId=rZWm_0PVIyD1HE1qjU8PKobf_OAtq3z4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-m-sia-ties-growing-stronger-must-be-sustained-in-today-s-complex-times-president-halimah_1728742929.html", "title": "S’pore-M’sia ties growing stronger, must be sustained in today’s complex times: President Halimah", "title_page": "S’pore-M’sia ties growing stronger, must be sustained in today’s complex times: President Halimah | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Cooperation between Singapore and Malaysia has grown from strength to strength, despite unprecedented challenges like the Covid-19 pandemic.\nPresident Halimah Yacob noted this on Wednesday at a banquet she hosted at the Istana in honour of Malaysia’s King, Sultan Abdullah Ahmad Shah, who is in Singapore with his wife, Tunku Azizah Aminah Maimunah Iskandariah, as well as members of the royal family and senior officials.\nThe pandemic saw the Causeway closed from March 2020 for almost two years – the longest period for which the vital link between Singapore and Malaysia had been inaccessible since World War II.\nDespite this, the two sides worked tirelessly to ensure the safe movement of goods, services and people across the border, and remain each other’s second-largest trading partner, said Madam Halimah. “We were all relieved when the borders fully reopened on April 1, and families and loved ones could reunite once again.”\nWhile the worst of the pandemic appears to be over, Madam Halimah said the external environment has become increasingly complex and challenging, with big-power rivalry and the ongoing war in Ukraine.\n“In the face of a complicated geopolitical landscape, it behoves us to continue to strengthen trust and understanding between our two countries, and to work together for mutual benefit for our people,” she said.\nAgreeing, Sultan Abdullah said it is his fervent hope that the comprehensive and symbiotic relationship between Malaysia and Singapore continues to flourish for the benefit of both countries and their peoples.\n“Amid the changing global geopolitics, geo-economics and geostrategic landscape, the need to work together, cooperate and collaborate is more important than ever,” he said in his speech.\nSultan Abdullah is on his first state visit to Singapore since his accession in 2019 – a visit that has been a long time coming, having been delayed first by the pandemic, and then the funeral of Britain’s Queen Elizabeth II in September, said Madam Halimah.\n“This may be Your Majesties’ first state visit to Singapore, but we are certainly not strangers,” she added, noting that the two leaders had a good discussion on bilateral ties on the sidelines while in London.\nEarlier in the day, Prime Minister Lee Hsien Loong and Mrs Lee called on Sultan Abdullah and hosted him to lunch.\nPM Lee later said in a Facebook post that they had reaffirmed the close relationship between Singapore and Malaysia, and he is confident bilateral ties will grow as the two countries deepen their collaboration across sectors.\nAt the state banquet, Madam Halimah noted that Singaporeans and Malaysians alike have wasted no time in revisiting old haunts and forging new collaborations since the Causeway reopened. Leaders from both countries have likewise resumed work, study and official visits.\nPeak daily traveller volume across both land checkpoints and weekly flight services between Singapore and Malaysia have been approaching pre-pandemic numbers since the Causeway reopened.\nThe King’s own experience and that of his family are testament to the friendship and connection between the two countries’ people extending across generations, which have been the foundation of the longstanding and multi-faceted relationship between Singapore and Malaysia, added Madam Halimah.\n“I heard that Your Majesties have a special and personal connection to Singapore, particularly through the Faculty of Arts and Social Sciences in the National University of Singapore (NUS),” she said.\nSultan Abdullah said at the banquet that among his fond memories were “secret” visits to the Republic to see his now-wife, who was studying at NUS, and playing football here.\nThe King’s son, Regent of Pahang Tengku Hassanal Shah, enrolled at NUS’ Lee Kuan Yew School of Public Policy in September.\nThe King and his wife are also fans of Zam Zam murtabak, located in North Bridge Road, and the local goreng pisang (banana fritters), revealed Madam Halimah. “I trust that Your Majesties have had your fill of murtabak last night, but if not, Zam Zam is not too far away!” she said.\nSultan Abdullah’s three-day state visit caps a busy and fruitful year of high-level exchanges between Singapore and Malaysia, and reaffirms the close relationship between the two countries, said Madam Halimah.\nIn May, the Singapore Management University signed a memorandum of understanding with Malaysia’s Universiti Teknologi Petronas to boost exchanges between staff and students, encourage collaborative research and expand internship opportunities.\nIn August, the trade ministries of both countries concluded two separate frameworks of cooperation on the digital economy and green economy.\nThese frameworks were key priorities for Singapore’s chairmanship of the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) in 2022, said Madam Halimah, who thanked Malaysia for its steadfast support during the Republic’s chairmanship.\nMalaysia had also contributed actively in the senior officials’ meetings, and towards developing a process for other economies aspiring to join the CPTPP, she added. The CPTPP is a trade agreement between 11 Asia-Pacific countries.\n“Just as your father, the late Sultan Haji Ahmad Shah, was a staunch supporter of Singapore-Malaysia ties, I am confident that Your Majesty’s leadership and support will also bring Singapore and Malaysia’s relationship to greater heights,” she said.\nSultan Abdullah’s itinerary here includes visits to Pasir Ris Camp, Newater Visitor Centre, the Asian Civilisations Museum, National Library, as well as social enterprise Edible Garden City, which focuses on growing one’s own food.\nThe Malaysian royal couple also had a new orchid hybrid, Dendrobium Queen Azizah of Malaysia, named in their honour at the Istana.", "url": "https://www.straitstimes.com/singapore/s-pore-m-sia-ties-growing-stronger-must-be-sustained-in-today-s-complex-times-president-halimah"}