{"authors": ["Christie Chiu"], "date_download": "2024-10-12 13:35:05", "date_modify": "2024-10-12 13:35:05", "date_publish": "2023-11-01 23:05:00", "description": "The Board has made a police report and has received 12 reported cases so far. Read more at straitstimes.com.", "filename": "singapore_cpf-board-warns-of-e-mail-scam-requesting-employee-wage-information_1728740105.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/01/IMGyaohui-docpf11-881711994A8EM.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_cpf-board-warns-of-e-mail-scam-requesting-employee-wage-information_1728740105.html", "title": "CPF Board warns of e-mail scam requesting employee wage information", "title_page": "CPF Board warns of e-mail scam requesting employee wage information | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Central Provident Fund (CPF) Board has made a police report after it was alerted to a scam variant requesting employee wage information under the guise of an official CPF Board e-mail.\nA CPF Board spokesperson said on Wednesday evening that it was alerted to the scam earlier that day, and that it had received reports of 12 cases so far.\nThe scam e-mail, which mimics CPF Board’s authorised e-mail address in the sender description, is sent to employers with the subject: “Reminder: Requirement to declare wage information”.\nIt contains an attachment asking employers for employee wage information.\nIn an announcement posted on Facebook, the board said: “The e-mail was not sent by CPF Board. Please do not open the attachment and delete the e-mail immediately.”\nIt added that its system had not been compromised, and advised the public to review and update their e-mail security settings to block malicious or spoofed e-mails, or seek assistance from their email service provider.", "url": "https://www.straitstimes.com/singapore/cpf-board-warns-of-e-mail-scam-requesting-employee-wage-information"}