{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 13:54:58", "date_modify": "2024-10-12 13:54:58", "date_publish": "2022-07-21 16:22:00", "description": "Parents should make an effort to communicate with their children in their mother tongue, says the Education Minister. Read more at straitstimes.com.", "filename": "singapore_use-mother-tongues-beyond-schools-education-minister-urges_1728741298.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/22/md_css_22072022.jpg?VersionId=DdCz5Q7Ea201CvM.PAexMhFTwDqxHODS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_use-mother-tongues-beyond-schools-education-minister-urges_1728741298.html", "title": "Use mother tongues beyond schools, Chan Chun Sing urges", "title_page": "Use mother tongues beyond schools, Chan Chun Sing urges | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Schools may actively promote mother tongues like Mandarin, but a conducive bigger environment is important for students to be effectively bilingual.\nParents should make an effort to communicate with their children in their mother tongue so that it is not seen just as an examinable subject but a living and practical language, said Education Minister Chan Chun Sing at the Singapore Chinese Cultural Centre on Thursday (July 21).\nMr Chan was speaking at the Singapore University of Social Sciences' (SUSS) 22nd International Conference on Chinese Language and Culture.\nHe added in Mandarin: \"People who excel in a language are those who continue to use it outside school.\"\nProfessor Eddie Kuo, SUSS' academic adviser, told The Straits Times: \"Singaporeans take our multilingualism for granted. It is part of our DNA and is uniquely Singapore.\"\nThe 82-year-old added: \"However, there is room for improvement for the standards of mother tongues here, and enhancing our bilingual education policy is an ongoing journey.\"\nThe two-day conference, which ends on Friday, seeks to promote research on Chinese language and culture, language and society, and to strengthen collaborations between experts in related fields. The theme of this year's conference is Coexist and Evolve: New Perspectives of Language Policy and Language Diversity.\nMr Chan shared personal observations about his children who picked up some Korean and Spanish, saying that platforms like the Internet and YouTube can help one master a language.\nWith the rise of China now, there is even greater motivation to learn Mandarin as more people see the practical uses of the language, he said.\nBuilding a good foundation and confidence in the language is important too, he added, sharing how he excelled in Mathematics after his confidence in the subject was boosted when a teacher complimented him in Primary 1.\nHe added: \"Singaporeans' multilingualism will give them an edge in this polarised world, navigating between and connecting with different countries.\"\nThe conference, initiated by Beijing Normal University, the National Chinese Association of China and Hanyang University (South Korea), has been held for 21 years in various cities. It has become a major conference for scholars around the world working on various aspects of Chinese language and culture. It is held in Singapore for the first time this year and is hosted by SUSS' School of Humanities and Behavioural Sciences and the Centre for Chinese Studies (CCS).\nThe event also coincides with the CCS' 10th anniversary celebrations. To commemorate the occasion, SUSS launched a Chinese book titled Unity In Diversity: Language And Society In Singapore.\nThe 276-page book is co-authored by Prof Kuo, who also gave the keynote address on language planning and nation-building in Singapore, and Associate Professor Luo Futeng, head of Chinese programme at SUSS.\nIt discusses issues like Singapore's language planning and bilingual education policy.", "url": "https://www.straitstimes.com/singapore/use-mother-tongues-beyond-schools-education-minister-urges"}