{"authors": ["Theresa Tan"], "date_download": "2024-10-12 13:31:23", "date_modify": "2024-10-12 13:31:23", "date_publish": "2024-08-04 17:00:00", "description": "About 200 families with school-going children have received food from the fridge since May 2023. Read more at straitstimes.com.", "filename": "singapore_woman-who-started-community-fridge-i-m-always-looking-out-for-my-neighbours_1728739883.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/04/thmarlina.6690d6fc.Attachment.140035.jpg?VersionId=c7kHiV.QiTfWFQnptel3sSWJHf_IVdJp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_woman-who-started-community-fridge-i-m-always-looking-out-for-my-neighbours_1728739883.html", "title": "Woman who started community fridge: ‘I’m always looking out for my neighbours’", "title_page": "Woman who started community fridge: ‘I’m always looking out for my neighbours’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Mother of five Marlina Yased knows what it is like to go hungry and have no money to put food on the table.\nSo she does not want any of her neighbours living in highly subsidised HDB rental flats in Lengkok Bahru to go to bed hungry.\nThe 46-year-old started a community fridge initiative offering free food, such as vegetables, frozen meat and seafood, to her neighbours in need.\nAbout 200 families with school-going children have received food from the community fridge, which is placed outside her two-room flat, since the initiative started in May 2023.\nFrom linking them up to free medical services and courses to equip mothers with work skills, Madam Marlina has, over the past few years, organised various programmes for her neighbours.\nHer latest initiative: a healthier instant noodle cooking competition that was held on July 13.\nShe said that instant noodles is a staple food for many of her neighbours as it is cheap, filling and easy to prepare, and she wants to encourage those around her to find ways to make the dish healthier.\nMadam Marlina works as a community worker at a social service agency, but is volunteering to help her neighbours, such as through the community fridge project, of her own volition.\n“I’m always looking out for my neighbours. I would feel uneasy if I know my neighbours go to bed hungry,” she said. “My motto is: more we, less me.”\nHer empathy is borne from her darkest days after her divorce more than 15 years ago, when the former factory worker was so broke that she could feed her children only rice with a fried egg drenched in sweet soya sauce on some days.\nShe said: “There were days when I went hungry, so my kids could eat. Or days when my fridge was totally empty, and I could feed my baby only condensed milk mixed with water.”\nShe said her then Member of Parliament and social workers, such as those from Beyond Social Services, helped her through those bleak times, by giving her supermarket vouchers and other forms of help.\nAnd she now wants to pay it forward.\nMadam Marlina has since remarried, to an events coordinator. Her five children are aged between 10 and 27.\nShe said she started the community fridge as her neighbours work in low-wage jobs and many of them would have spent their salaries before their next payday.\n“The community fridge is to give them a buffer until it’s okay for them to survive on their own,” she said.\nMadam Marlina runs the initiative, from buying the groceries to packing and distributing the food, with the help of volunteers.\nIn the morning, children living in her neighbourhood can also collect a free packet of milk from the community fridge and a snack before they go to school.\nAnd if they attend school for five consecutive days, they would get a small reward like biscuits. This is Madam Marlina’s way of motivating them to attend school regularly.\nShe said the idea of giving free milk was inspired by her 10-year-old son, who told her he had bought food for his friends who had no money for recess.\nBeyond Social Services is Madam Marlina’s partner in the community fridge project. The social service agency has referred donors, who sponsor the groceries.\nThe other costs of running the fridge are supported with programme funds under the Movements for Health Fund, which is administered by the MOH Office for Healthcare Transformation and aimed at mobilising communities to adopt healthier living.\nA spokeswoman for Beyond said it found Madam Marlina’s idea of the community fridge to be a “meaningful one that had the potential to meet physical needs, strengthen connections, and encourage interdependence between neighbours”.\nThe spokeswoman added: “We truly believe that members (in the community) are assets – they possess strengths, gifts, strong networks and deep insights about their neighbourhoods.\n“When they come together as a community, they are able to find solutions to meet each other’s needs and concerns, and most importantly, in a way which is dignified and empowering for them. We call it ‘building community from the inside-out, with resources from the outside-in’.”\nMadam Nurul Jannah Jumari, 25, said the free groceries from the community fridge is a lifeline after she and her husband both stopped working recently due to anxiety problems.\nWith five children who are aged from 11 months to seven years old, finances are a big worry, she said.\nMadam Jannah, who has volunteered to help Madam Marlina, said: “I like the bonding among friends when we buy the food and pack the items. We make more friends and get to know more neighbours.”\nMadam Elisa Govindasamy, 38, a Malaysian with two children aged 9 and 11, said she had confided in Madam Marlina about her health woes.\nMadam Govindasamy, who is divorced from her Singaporean husband, said: “I had to go for an operation for the bleeding in my uterus and the operation cost $7,000. At that time, I didn’t even have $70.”\nMadam Marlina linked her up with the Mount Alvernia Hospital Community Outreach Team, which has a programme that supports needy transnational spouses with their healthcare needs. The Mount Alvernia team found a doctor who operated on Madam Govindasamy for free, she said.\nMadam Govindasamy, a part-time cashier, said she is now volunteering to help her neighbours in any way she can, to pay it forward.\nShe said: “Marlina is really extraordinary. She is a super mum and a super woman, and I’m learning a lot from her.”", "url": "https://www.straitstimes.com/singapore/woman-who-started-community-fridge-i-m-always-looking-out-for-my-neighbours"}