{"authors": ["Ng Keng Gene"], "date_download": "2024-10-12 13:29:37", "date_modify": "2024-10-12 13:29:37", "date_publish": "2020-12-30 12:14:59", "description": "This is part of Singapore's ongoing efforts to reduce smoking prevalence. Read more at straitstimes.com.", "filename": "singapore_minimum-legal-age-for-smoking-raised-to-21-from-jan-1_1728739777.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/12/30/nz_smoking_301246.jpg?VersionId=4o8zyg5X6Kos4ZGeyGOWSZi0d8Y8pekd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_minimum-legal-age-for-smoking-raised-to-21-from-jan-1_1728739777.html", "title": "Minimum legal age for smoking raised to 21 from Jan 1", "title_page": "Minimum legal age for smoking raised to 21 from Jan 1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The minimum legal age for the purchase, use, possession, sale and supply of tobacco products will be raised from the current 20 years to 21 on Jan 1, 2021.\nThis is the third and last change to the minimum age requirement under the amendments to the Tobacco (Control of Advertisements and Sale) Act, which were passed in Parliament in November 2017.\nThe minimum legal age was first raised from 18 to 19 years old on Jan 1, 2019, and from 19 to 20 years old on Jan 1, 2020.\nOn Wednesday (Dec 30), the Ministry of Health (MOH) reminded the public of the changes, and said raising the minimum legal age is part of Singapore's ongoing efforts to reduce smoking prevalence.\nOther efforts by the ministry, together with the Health Promotion Board and the Health Sciences Authority (HSA), include public education, taxation, smoking cessation programmes, bans on tobacco advertising, point-of-sale display ban, and standardised packaging of tobacco products.\n\"Tobacco use is one of the highest contributors to ill health and premature death in Singapore. It is associated with cancers, ischaemic heart disease, stroke, lung disease and many other diseases,\" it added.\nThe MOH said the tobacco industry, including retailers, importers and wholesalers, has been reminded of the changes.\nWarning notices, which state that the sale of tobacco to those below the age of 21 is not permitted, have been distributed to retailers for display at their outlets.\nA range of penalties are in place for those found breaking the law.\nUnderage smokers convicted of using, buying or possessing tobacco products face a fine of up to $300.\nRetailers who are guilty of contravening the law and selling any tobacco products to a person below the minimum legal age face a fine of up to $5,000 for the first offence and $10,000 for subsequent offences.\nIn addition, their tobacco retail licences will be suspended for the first offence and revoked for subsequent offences.\nHowever, if any outlet is found selling tobacco products to underage people in school uniform or those below 12 years of age, its tobacco retail licence will be revoked, even at the first offence.\nThose guilty of giving or furnishing tobacco to a person below the minimum legal age face a fine of up to $500 for the first offence and $1,000 for subsequent offences.", "url": "https://www.straitstimes.com/singapore/minimum-legal-age-for-smoking-raised-to-21-from-jan-1"}