{"authors": ["Christine Tan"], "date_download": "2024-10-12 13:28:34", "date_modify": "2024-10-12 13:28:34", "date_publish": "2024-09-10 20:21:41", "description": "With the changes to the Casino Control Act, it will also be a crime to breach family visit limits. Read more at straitstimes.com.", "filename": "singapore_politics_new-and-stricter-laws-for-mbs-rws-casino-gamblers-and-operators_1728739714.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/20200319158460727375891985757324269801422a5mb28zuann.jpg?VersionId=5gxM1m.ss_RktIsRTmR9ujhasIJOKnG8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_new-and-stricter-laws-for-mbs-rws-casino-gamblers-and-operators_1728739714.html", "title": "New and stricter laws for MBS, RWS casino gamblers and operators", "title_page": "New and stricter laws for MBS, RWS casino gamblers and operators | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Gamblers at Singapore’s two casinos must abide by new laws regarding the withdrawal of bets after results have been announced, and the recording of games on the premises.\nWith the passing of the Casino Control (Amendment) Bill on Sept 10, it will also be a crime for people to breach family visit limits when the changes take effect.\nDuring the second reading of the Bill in Parliament, Minister of State for Home Affairs Sun Xueling said casino-related crime remains low in Singapore.\nOnly 0.2 per cent of all crimes reported in 2023 happened at Marina Bay Sands and Resorts World Sentosa.\nThat year, 137 criminal cases were reported at both casinos, said the Ministry of Home Affairs (MHA) in August.\nMHA said the changes to the Casino Control Act, which was last amended in 2012, are part of a regular review to ensure it keeps up with changes in the gambling industry.\nMs Sun said the Bill was drafted after a review by MHA, the Ministry of Social and Family Development and the Ministry of Trade and Industry.\nShe said that, currently, it is only an offence to place a bet after the result is known, but not to withdraw it.\nTen people were investigated for withdrawing their bets between 2010 and 2023, but the police had to use other laws such as theft in dwelling to deal with them.\nAlso, existing laws state only that recording card games is illegal. The changes will criminalise the act of recording non-card games. MHA said patrons have tried to cheat casinos by recording the play patterns of non-card games such as gaming machines.\nAnother issue to be addressed is the breaching of a family visit limit, when patrons visit a casino more times than allowed by their family.\nIt is now not a crime to do so.\nFrom 2010 to 2023, about five people breached their family visit limits annually.\nWhen the amendments take effect, anyone who exceeds the limit can be jailed for up to a year, or fined up to $10,000 for a new offence.\nMSF said previously there were three to 14 applications a year for family visit limits over the last decade.\nThese limits can be applied for as long as the family is affected by the gambler’s habits, such as neglecting his family responsibilities.\nAlso, those under exclusion orders from casinos will face stricter laws. These are people automatically excluded by law as they are undischarged bankrupts or on social assistance programmes, or banned by their families or the National Council on Problem Gambling (NCPG).\nTo prosecute excluded individuals who breach the order, the authorities have to show that they are aware of their exclusion status. This could be hard to prove.\nWith the changes, it will be a crime as long as the excluded person knows, or ought reasonably to know, about his exclusion status.\nFor someone who has maxed out his visit limit and is therefore excluded, claiming he had miscounted his visits will not work.\nAs at the end of December 2023, more than 300,000 people have been barred from entering the casinos, including those who set the ban themselves, according to NCPG data.\nAlso, minors who refuse to give their particulars, or falsify their age to enter the casinos, will face higher maximum fines of $10,000, up from the current $1,000.\nOnly those aged 21 or older can enter Singapore’s casinos.\nMHA said that in the past five years, two to four minors each year tried to enter a casino using false evidence of age.\nThe new law also makes it easier to fight money laundering, by allowing both casinos to share patrons’ information with each other to tackle such crimes.\nThey are currently not allowed to share information without the patrons’ consent.\nBut sharing information might be necessary for the casinos to assess if a patron is linked to money laundering and terrorism financing activities.\nThe Gambling Regulatory Authority facilitates the information exchange, but this is slow and prevents casino operators from taking timely action, said Ms Sun.\nSeven MPs and Nominated MPs spoke in support of the Bill.\nStating her support, Ms Sylvia Lim (Aljunied GRC) highlighted the threshold amount which would trigger the casinos’ customer due diligence.\nCurrently, if a casino pays a patron $10,000, or receives $5,000 from the patron, it would have to do customer due diligence.\nWith the amendments, these amounts will be reduced to $4,000.\nMs Lim said the effectiveness of enhanced anti-money laundering measures lies in their implementation, and casino operators will need to do much work to review their systems and train staff.\nMs Ng Ling Ling (Ang Mo Kio GRC) asked if probation rather than a high fine is more appropriate for minors who try to enter casinos with fake ages. She noted the burden of paying the fines might fall on their family members.\nMs Sun said this is to deter such serious offences.\nShe said if the minor is convicted, the court will consider all available orders, including probation, taking into account the facts and circumstances of the case.\nShe added: “The family is responsible for the minor, and it cannot completely absolve themselves from the minors’ misdemeanours.”", "url": "https://www.straitstimes.com/singapore/politics/new-and-stricter-laws-for-mbs-rws-casino-gamblers-and-operators"}