{"authors": ["Fatimah Mujibah"], "date_download": "2024-10-12 13:45:49", "date_modify": "2024-10-12 13:45:49", "date_publish": "2023-10-31 10:00:00", "description": "Filing a small claim tends to be a simpler, quicker and cheaper solution than starting a lawsuit. Read more at straitstimes.com.", "filename": "singapore_askst-i-m-a-freelancer-what-can-i-do-if-my-client-won-t-pay-me_1728740749.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/31/dw-freelance-231030.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_askst-i-m-a-freelancer-what-can-i-do-if-my-client-won-t-pay-me_1728740749.html", "title": "askST: I’m a freelancer. What can I do if my client won’t pay me?", "title_page": "askST: I’m a freelancer. What can I do if my client won’t pay me? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The deadline has come and gone but still no pay cheque.\nA number of freelance content creators who worked with creative agency GetCraft are still owed their salaries, despite a promise to honour the payments by the end of September.\nFounded in Indonesia and incorporated in Singapore, GetCraft is a creative directory that links businesses vetted content creators. Its chief executive officer Patrick Searle, had told The Straits Times that it was having a cashflow issue due to a third-party investor having difficulty “onshoring” money to Singapore.\nIf you are a freelancer in a similar predicament, what can you do to increase your odds of recovering your payment? Here’s what the experts say.\nQ: My client refuses to pay me long after I have delivered my work. What can I do?\nA: If your client is based in Singapore, you can consider filing a claim at the Small Claims Tribunal, said a spokesperson for the Visual, Audio, Creative Content Professionals Association (Vicpa), which was founded in 2021 to champion the interests of freelancers.\nFiling a small claim tends to be a simpler, quicker and cheaper solution than starting a lawsuit, said Vicpa, which is part of the National Trades Union Congress (NTUC).\nThe filing fees can be as low as $10 if you are claiming up to $5,000 as an individual. The fees will be higher if you are claiming a larger amount, and if you are claiming on behalf of your registered business.\nThe Small Claims Tribunal has a claim limit of $20,000 for registered businesses. The cap can be raised to $30,000, provided that both you and your client agree to sign a memorandum of consent.\nYou should file the claim within two years from the time you are owed payment.\nHowever, you cannot file a small claim if your client is based overseas.\nYou also cannot claim against a bankrupt client or a business that is in liquidation unless you have permission from the High Court.\nIn such cases, you will have to seek legal advice if you wish to pursue the case.\nQ: I want to sue my client, but the legal fee is prohibitive. What can I do?\nA: If you know of other freelancers who are owed payment by the same client, band together with them, said Mr Amolat Singh, managing partner of Amolat & Partners. Getting a common legal counsel to represent all of you will reduce legal costs, he said.\nHowever, if you are alone and have no one to share the costs with you, you may approach the Law Society or the Community Justice Centre for pro bono or low bono legal representation, Mr Singh said.\nVicpa also encourages freelancers to become its member, so they can consult lawyers at NTUC’s legal clinics regarding work or contract-related disputes. The membership fee is $117 per year.\nIf your client is based overseas, as a Vicpa member, you can seek help from the International Institute of Mediators, which can advise regarding cross-border trade disputes.\nShould you decide to pursue legal action, be prepared that the process may take several weeks to months, Mr Singh said.\nEven if the court’s judgment is in your favour, your client may still be unable or unwilling to pay you. And if you need help with the enforcement action, you are likely to have to part with more money.\n“It would take some soul-searching to assess if it is worth throwing good money chasing after bad money,” Mr Singh said.\nSenior associate Joshua Tong from Kalco Law said such lawsuits often end with a settlement. The legal costs would usually add up to more than $500, depending on how long both parties take to reach an agreement.\nQ: How can freelancers be better protected from dodgy clients?\nA: Vicpa says you should always do your due diligence before taking on any gigs.\nYou can search for your prospective client’s business profile in the Accounting and Corporate Regulatory Authority’s (Acra) website. You can also ask others who have worked with the same client about their experiences.\nMr Tong added that if your client refuses to have any terms of service in writing, it is a clear red flag, and you should be careful.\nFreelancers should also note that they cannot always expect the authorities to recover their pay cheques for them.\nMr Singh said: “It is most unlikely that the authorities would be able to help them unless there is clear-cut evidence of fraud or such other criminal wrongdoing.\n“After all, no one can guarantee or underwrite the success of a company.”", "url": "https://www.straitstimes.com/singapore/askst-i-m-a-freelancer-what-can-i-do-if-my-client-won-t-pay-me"}