{"authors": ["Tham Yuen-C"], "date_download": "2024-10-12 13:47:12", "date_modify": "2024-10-12 13:47:12", "date_publish": "2021-01-05 23:58:36", "description": "Much of the data collected will be deleted, said Mr Vivian Balakrishnan. Read more at straitstimes.com.", "filename": "singapore_politics_parliament-tracetogether-programme-to-be-stood-down-after-pandemic_1728740832.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/01/06/nmtoken0601.jpg?VersionId=slTuhIFFxty_qMbTktk93JOMALKXk3Fl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_parliament-tracetogether-programme-to-be-stood-down-after-pandemic_1728740832.html", "title": "Parliament: TraceTogether programme to be stood down after pandemic", "title_page": "Parliament: TraceTogether programme to be stood down after pandemic | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The TraceTogether programme will be stood down when the Covid-19 pandemic ends, and much of the data collected would be deleted, said Minister-in-Charge of the Smart Nation Initiative Vivian Balakrishnan on Tuesday (Jan 5).\nHe added that the Ministry of Health may want to retain epidemiological data for research purposes, but that \"it should be anonymised, it should not be personalised, it should not be individualised\".\nHe gave this assurance as he told Parliament that the purpose of the TraceTogether programme is for contact tracing, so that any chains of transmission of Covid-19 can be quickly broken.\nThe issue of how the data can be used came up for discussion in the House on Tuesday, after a reply to a parliamentary question the day before sparked a furore.\nMinister of State for Home Affairs Desmond Tan had said in a response to a question from Mr Christopher de Souza (Holland-Bukit Timah GRC) that under the Criminal Procedure Code, the police have the power to obtain data for criminal investigations, and TraceTogether data is not exempt.\nSome had asked if this was inconsistent with what Dr Balakrishnan had said before, that the programme was to be used for contact tracing only.\nDr Balakrishnan, who is also Foreign Minister, acknowledged that he had misspoken.\n\"After I realised that the CPC applied to this, I did have sleepless nights wondering: Should I try to persuade my colleagues to change the law?\" he added.\n\"But having thought about it, discussed, consulted people both within and outside this House, I've come to the conclusion that right now we are doing well. We are able to keep Singapore safe, we are able to deal with the current crisis,\" he said.\n\"And so long as this Government is able to maintain our reputation for openness, transparency, reliability, I think we are still on the right track.\"\nSeveral MPs, such as Ms Tin Pei Ling (MacPherson), Mr de Souza, and Workers' Party MP Gerald Giam (Aljunied GRC) had asked on Tuesday how the police would handle the data used for criminal investigations.", "url": "https://www.straitstimes.com/singapore/politics/parliament-tracetogether-programme-to-be-stood-down-after-pandemic"}