{"authors": ["Thian Wen Li"], "date_download": "2024-10-12 14:20:26", "date_modify": "2024-10-12 14:20:26", "date_publish": "2024-05-26 17:00:00", "description": "Many hawkers hope to get something for their years of hard work before passing their recipes to non-family members. Read more at straitstimes.com.", "filename": "singapore_hawkers-succession-scheme-attracts-7-hawkers-in-two-years-hawkers-cite-lack-of-incentives-to-join_1728742826.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/26/KELL216920copy.jpg?VersionId=D_oPc3vJZklbAA5CZKm9Eg9fdyf1lKII", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_hawkers-succession-scheme-attracts-7-hawkers-in-two-years-hawkers-cite-lack-of-incentives-to-join_1728742826.html", "title": "7 hawkers joined succession scheme in two years; others cite lack of incentives to join", "title_page": "7 hawkers joined succession scheme in two years; others cite lack of incentives to join | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Mr Tan Siok Hwee, 71, started helping out at his father’s kway chap stall when he was five years old.\nBut with no successor in sight for his stall at Hong Lim Food Centre, Mr Tan and his wife Teng Soo Ngoh, 69, will soon hang up their aprons after over 60 years in operation.\n“Once we retire, the recipe will just disappear,” said Madam Teng. The couple will consider passing down their recipes only to someone who is willing to pay to help fund their retirement.\nLike the Tans, many veteran hawkers say they hope to get something for their years of hard work before passing their recipes to non-family members.\nSeveral of them told The Straits Times this was one reason why they did not join the Hawker Succession Scheme (HSS), set up in January 2022, to keep the hawker culture alive.\nIn response to a parliamentary question on May 8, Minister for Sustainability and the Environment Grace Fu said seven veteran hawkers have enrolled in the scheme since its launch.\nTwo have transferred their stalls to their successors, while a third is in the process of doing so. Another two have been matched with aspiring successors, and the remaining two are awaiting potential successors, Ms Fu added.\nThe process of matching retiring hawkers and aspiring successors requires time and effort for a relationship to be built, said the National Environment Agency (NEA) in response to queries from ST.\n“In some situations, the runway to retire is shortened due to the veteran hawker’s health or other personal reasons that require them to give up their stalls more urgently, and the HSS may not work out,” said NEA, adding that it regularly reviews the scheme.\nThe HSS caters to retiring veteran cooked-food hawkers who have been operating in NEA-managed hawker centres for at least 15 years.\nIt involves a three-month apprenticeship to ensure the successor can properly replicate the hawker’s signature dish. The successor must also maintain the hawker’s signature dish and stall name for the first three years, among other criteria.\nRetiring hawkers get a monthly stipend of $1,500 during the apprenticeship period. Hawkers paying subsidised rental fees will typically also get a one-off payment of $23,000 when they exit the trade.\nSecond-generation hawker Melvin Chew, who founded Facebook group Hawkers United – Dabao 2020, said veteran hawkers’ desire for a financial payoff before retirement is “fair” and “not greedy”. “They sacrificed so much of their time to build up their brand; it’s not easy,” he added.\nMr Cornelius Tan, who chairs the Chinatown Complex Hawker Association, noted that hawkers may need the money for retirement or medical bills. He estimates that around one to two of the 216 hawkers in the complex retire without successors every year.\nBut succession is also an emotional matter, he added. “It’s a sentimental thing. If there’s somebody who is willing to hand over (their stall), it is not about the money, but whether the person can let the legacy continue.”\nOther barriers to finding a successor often include the perennial industry challenges of long hours, hard work and manpower shortages.\nHigh overheads such as rentals, inflation and the pressure to sell at low prices also decimate the growth and viability of the hawker trade, added food critic K.F. Seetoh.\nST visited eight hawker centres and spoke to 14 hawkers about the trade. While some said they would sell their stalls, others plan to pass their stalls to family or are prepared to retire without a successor.\n“Being a hawker is tough,” said Madam Seow Poh Chio, 63, who runs a prawn noodle stall at Old Airport Road Food Centre with her husband. “I don’t want my children to take over. Why would I want them to come and suffer? Unless they are interested in the trade.”\nShe plans to work for as long as she can, but is not inclined to join the HSS because she believes it is difficult for young people to follow old recipes faithfully, and trends and tastes change over time. She has also made improvements to her grandfather’s recipes over the years.\nMr Phua Soh Huat, who runs a Western food stall at the same food centre, said he joined his friend, who started the business, and paid to learn the ropes before taking over the stall.\nHe believes young people should similarly work hard and pay their dues. The 69-year-old, who plans to retire in 2024, interviewed three potential successors before settling on one.\n“In a business, when you have returning customers who compliment your food, it keeps you going,” he said.\nHis sentiments were echoed by Ms Madeline Chen, 45, who started a braised pork stall six months ago at Chinatown Complex Food Centre.\n“I don’t want to use something that is already out there,” she said, adding that she wants to create food that people can relate to and share with others. “It’s not creating new memories, it’s like going to McDonald’s or Din Tai Fung.”", "url": "https://www.straitstimes.com/singapore/hawkers-succession-scheme-attracts-7-hawkers-in-two-years-hawkers-cite-lack-of-incentives-to-join"}