{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 14:01:08", "date_modify": "2024-10-12 14:01:08", "date_publish": "2021-11-22 23:14:18", "description": "NParks and the Singapore Veterinary Association have launched guidelines for vets on the prudent use of antimicrobials.  Read more at straitstimes.com.", "filename": "singapore_health_new-guidelines-for-vets-pet-owners-to-tackle-silent-epidemic-of-antimicrobial_1728741668.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/11/23/dw-vet-microbe-211123.jpg?VersionId=ju_eGOePjshWmKqzdQvKzJo0UhXG2Glj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_new-guidelines-for-vets-pet-owners-to-tackle-silent-epidemic-of-antimicrobial_1728741668.html", "title": "New guidelines for vets, tips for pet owners to tackle 'silent epidemic' of antimicrobial resistance", "title_page": "New guidelines for vets, tips for pet owners to tackle 'silent epidemic' of antimicrobial resistance | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - While the threat of antibiotic resistance to human health is well known, fewer people are aware of its danger to their animal companions.\nThis might soon change, with new guidelines for vets on the prudent use of antimicrobials for sick pets, along with tips for pet owners.\nThe guidelines were launched on Monday (Nov 22) by the National Parks Board (NParks) and the Singapore Veterinary Association (SVA).\nThe aim is to prevent bacteria from developing resistance against drugs used to treat infections.\nAntimicrobial resistance is a \"silent epidemic\" that is a major global threat to people, animals and the environment, NParks said.\nMicro-organisms that do not die when exposed to antimicrobial drugs develop resistance to them.\nDiagnostic reports from 2014 to 2016, for instance, revealed that almost half of the bacteria isolated from unwell pets in Singapore were resistant to multiple antibiotic drugs.\nThe misuse and overuse of antimicrobial agents has accelerated the spread of resistance over the years, NParks added.\nThe dwindling availability of effective antimicrobials means there are fewer defence mechanisms available to protect humans and animals against microorganisms, it added.\nTo counter this, extensive best practices here have been collated in a 157-page guide for vets.\nAmong the recommendations is that vets conduct bacterial culture and sensitivity testing before prescribing critically important antibiotics, which should be conserved for life-saving treatment.\nPet owners are also urged to use antibiotics appropriately, only when prescribed by a vet.\nOwners should complete the prescribed course of antibiotics even if their pet appears to have recovered as small amounts of remaining bacteria may develop antibiotic resistance, said Dr Suria Fabbri, a vet at NParks' Animal and Veterinary Service (AVS).\n\"The way antibiotics work is concentration- and time-dependent. If your vet says to take it twice a day at certain times of the day, you should do that,\" she added.\nShe also said owners should not feed their pets antibiotics they keep on standby, or antibiotics meant for human consumption.\nPets shed microbes in their saliva and stool, which means that antimicrobial-resistant microbes can be transmitted to their owners.\nFor pets with recurrent infections, vets might recommend sending samples for antimicrobial susceptibility testing, said Dr Brian Loon, principal vet at Amber Vet who is part of the group that developed the guidelines.\nDiagnostic tests at vet clinics help vets determine if there is an infection and guide them in the right direction about what treatment should be used, added Dr Loon.\nNParks also recommends ensuring pets are kept healthy to ward off infections. This includes ensuring they keep up with their regular vaccinations and antiparasitic treatments.\nThe board also tracks patterns of antimicrobial resistance over time, and conducts genome sequencing on any superbugs detected to find the genetic basis for resistance and trace transmission. Superbugs are resistant to multiple antimicrobial drugs.\nAntimicrobial resistance in pets is a problem that needs more attention during the pandemic, said Dr Kelvin Lim, director of veterinary health management at NParks' AVS.\nHumans can pass viruses such as Covid-19 to animals, as shown in the recent case of zookeepers infecting lions at the Singapore Zoo.\nThe guidelines can be found on NParks' website.", "url": "https://www.straitstimes.com/singapore/health/new-guidelines-for-vets-pet-owners-to-tackle-silent-epidemic-of-antimicrobial"}