{"authors": ["Wallace Woon"], "date_download": "2024-10-12 13:47:17", "date_modify": "2024-10-12 13:47:17", "date_publish": "2024-04-11 23:15:00", "description": "The leak was from a NEWater pipeline at a construction site. Read more at straitstimes.com.", "filename": "singapore_wild-wild-wet-pub-investigating-broken-pipe-in-orchard-road-spewing-water-metres-high_1728740837.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/11/imgonline-com-ua-FrameBlurred-OWAYOqgPRu.jpg?VersionId=YvNHDvIwiH7gQMlDdhBghZPSPOORvGwi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_wild-wild-wet-pub-investigating-broken-pipe-in-orchard-road-spewing-water-metres-high_1728740837.html", "title": "‘Wild wild wet’: Broken pipe in Orchard Road spews water metres high, PUB investigating", "title_page": "‘Wild wild wet’: Broken pipe in Orchard Road spews water metres high, PUB investigating | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – National water agency PUB is investigating after a pipe had water gushing out several metres high in Orchard Road on April 11.\nIn a statement, PUB said it was alerted to the leak at 2.15pm, which occurred on a NEWater pipeline at a construction site.\nThe agency said its service crew was deployed and the water supply to the pipe has since been turned off. “Repair works are ongoing. PUB is investigating the cause of the leak,” it added.\nIn a video shared on social media, water can be seen gushing out several metres high from behind construction hoarding. The accompanying text in an SG Road Vigilante Facebook post describes the scene as “wild wild wet”, reference to a water park in Downtown East.\nThe construction site is part of upgrading works for *Scape, which was announced in July 2022 and due to finish in 2024.\nIn response to queries from The Straits Times, a spokesperson for *Scape said renovation works are ongoing at the youth hangout.\n“With regard to the video circulating on social media, a pipe burst occurred at 2pm and was isolated at about 2.30pm. Operations at *Scape and traffic in the area were not affected,” the spokesperson added.", "url": "https://www.straitstimes.com/singapore/wild-wild-wet-pub-investigating-broken-pipe-in-orchard-road-spewing-water-metres-high"}