{"authors": ["Anne Chan Min"], "date_download": "2024-10-12 13:57:23", "date_modify": "2024-10-12 13:57:23", "date_publish": "2023-07-14 19:15:00", "description": "The robots can deliver medicine, guide patients and provide blankets to visitors. Read more at straitstimes.com.", "filename": "singapore_three-robot-musketeers-join-changi-general-hospital-providing-needed-relief-for-nurses_1728741443.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/15/2023071475347357snapseed.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_three-robot-musketeers-join-changi-general-hospital-providing-needed-relief-for-nurses_1728741443.html", "title": "Three robot musketeers join Changi General Hospital, providing needed relief for nurses", "title_page": "Three robot musketeers join Changi General Hospital, providing needed relief for nurses | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Sporting staff badges and an infectious smile, a trio of robots joined the emergency department (ED) at Changi General Hospital (CGH) in April.\nCGH said on Friday that MEDi, EDi and BLANKi – as the robots are called – help with medicine delivery from pharmacists to nurses, guide patients around the ED and distribute blankets to visitors, giving nurses some much-needed assistance with their heavy workload.\nThe autonomous mobile robots (AMR) range from 1m to 1.3m in height, and are part of a trial to measure the increase in efficiency and productivity in the nurses’ workflow in the ED.\nThey are equipped with sensors, speakers and a touchscreen display, allowing them to communicate with patients and weave through the complex ED environment without causing accidents.\nThe hospital follows in the footsteps of other organisations and institutions here who have started using robots to assist with repetitive, manual tasks.\nThe Singapore Police Force recently rolled out patrol robots at Changi Airport Terminal 4, while SIA Engineering has adopted robots to assist technicians in inspecting aircraft.\nRobots that will help clean and inspect Singapore’s rivers are also expected to be deployed in the near future.\nThe three AMRs at CGH are the most recent additions to the hospital’s robotic crew of more than 80 machines.\nMEDi, or Medication Delivery innovation, can deliver up to four baskets of drugs to four different locations in the ED.\nNurses use a tablet to submit medicine requisition forms to the pharmacist, who then places the medicine in the AMR before selecting its target destination on the screen, triggering the bot to navigate to a station near the nurse.\nThe black-and-orange MEDi saves ED nurses a lot of time and walking by completing up to 16 drug retrieval and dispatch rounds daily.\nPreviously, nurses had to walk for about seven minutes between the pharmacy and ED to collect patient prescriptions each time.\n“With MEDi, the ED Pharmacy can better support our nurses as we receive the medication request forms earlier and quicker,” the hospital said on Friday.\nCGH added: “Our ED nurses and porters also no longer need to leave their stations for extended periods of time and can focus on patient care.”", "url": "https://www.straitstimes.com/singapore/three-robot-musketeers-join-changi-general-hospital-providing-needed-relief-for-nurses"}