{"authors": ["Kolette Lim"], "date_download": "2024-10-12 13:43:40", "date_modify": "2024-10-12 13:43:40", "date_publish": "2024-06-04 23:55:00", "description": "The campaign aims to celebrate Mother's and Father's Day in a light-hearted manner. Read more at straitstimes.com.", "filename": "singapore_crystal-jade-s-char-siew-promotion-draws-flak-with-demeaning-cantonese-phrase_1728740620.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/04/hzpork040624.jpg?VersionId=6jyMB4glB6VP0_mBOwPWDmhIMRgAcMJ6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_crystal-jade-s-char-siew-promotion-draws-flak-with-demeaning-cantonese-phrase_1728740620.html", "title": "Crystal Jade’s char siew promotion draws flak with ‘demeaning’ Cantonese phrase", "title_page": "Crystal Jade’s char siew promotion draws flak with ‘demeaning’ Cantonese phrase | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Crystal Jade has expressed regret over what was meant to be a tongue-in-cheek phrase featured in a promotion offering diners a free plate of char siew.\nWorth $15.80, the plate of roasted honey barbecue pork comes with a catch – a parent has to recite a Cantonese phrase, saang gau caa siu hou gwo saang nei, to their child in front of a service staff member.\nThe phrase translates to: “It’s better to give birth to a piece of char siew than to give birth to you.”\nIn the Cantonese promotional video, a mother chides her daughter with the phrase after nagging at her for various reasons such as not spending time at home and not picking up the phone. “At least char siew is nice to eat,” she adds.\nChar siew is soon served, and the daughter places a piece of meat onto her mother’s plate.\nThe video ends with a prominent caption in English: “Be better than char siew.”\nThe promotion, which ran on May 4, 5, 11 and 12, was available at all Crystal Jade Hong Kong Kitchen and La Mian Xiao Long Bao outlets, excluding the branch at Changi Airport Terminal 1.\nOn Facebook group Complaint Singapore, user Michelle Au on June 3 posted a photograph of the promotion, and said the phrase is “a curse” and a way of scolding a child for being useless. “Come on Crystal Jade, it is not fun at all!”\nNetizens also took to Crystal Jade’s Facebook and Instagram accounts to voice their unhappiness.\nUser Kenny Wong described the campaign as “distasteful” as parents had to “recite such demeaning words” to their children.\nDescribing the phrase as “terrible”, another user called li_juan280 said: “It’s so demeaning! Bad advertising!”\nBut for some, the campaign had hit the mark. Instagram user jon.k.12345 said: “It’s super funny. Cantonese families say this all the time, and it doesn’t mean they love their kids any less!”\nIn response to queries from The Straits Times, a spokesperson for the Chinese restaurant chain said on June 4 that the campaign was meant to connect with its Cantonese-speaking audience in a “relatable and humorous manner”.\n“Our intention was to bring a touch of light-heartedness to the Mother’s and Father’s Day weekends with this campaign that references a common Cantonese saying parents use to express exasperation over their children.\n“However, we understand that humour can be subjective, and regret that this particular reference missed the mark and has caused unhappiness among some customers.”\nCrystal Jade will not be halting the promotion, said the spokesperson, adding that it will continue on June 8, 9, 15 and 16.\nDespite the backlash, the “provocative” campaign has succeeded in garnering the public’s attention, said marketing experts.\n“Interesting and memorable ideas are likely to ruffle feathers, and if they do, it typically means they’ve worked,” said Mr Nafe Tong, chief creative officer of brand and creative consulting agency ABrandADay.\n“The out-of-the-box idea may have come across as ‘demeaning’ or ‘rude’, but in fact highlights a humorous part of Cantonese culture that many would’ve experienced growing up and may still be using in their lexicon today,” he added.\n“The saying would have lost its nuance and not have been as amusing had it been translated into English.”\nChief executive of digital marketing agency MediaOne Tom Koh said Cantonese sayings resonate deeply with Singaporeans who speak the dialect, creating a strong cultural connection and making the campaign relatable and engaging.\n“However, more modern and Westernised families might perceive such expressions as aggressive or insulting, leading to potential backlash. Non-Cantonese speakers might not grasp the humour or cultural significance, potentially leading to confusion or misinterpretation,” he added.\nThe campaign might have been effective in attracting fans and customers, said Mr Koh. He pointed out that as at the evening of June 4, Crystal Jade’s Instagram post had accumulated about 770 likes, a number much higher than the usual range of between 30 and 70 likes.\nThe engagement, he said, proves the famous adage that many brands are driven by: Bad publicity is better than no publicity.\nThe council of the Advertising Standards Authority of Singapore (Asas) noted that while the campaign is intended to be “light-hearted”, it is not in line with the general principle of Singapore’s advertising code on family values.\nAsas chairman Ang Peng Hwa said that as advertisements are public-facing, they should not “encourage inconsiderate and disrespectful conduct” or “discredit mutual love, affection and support” among family members.", "url": "https://www.straitstimes.com/singapore/crystal-jade-s-char-siew-promotion-draws-flak-with-demeaning-cantonese-phrase"}