{"authors": ["Christine Tan"], "date_download": "2024-10-12 13:28:33", "date_modify": "2024-10-12 13:28:33", "date_publish": "2024-09-09 13:57:12", "description": "About 2,500 visitors every month are refused entry at Singapore’s checkpoints for various reasons. Read more at straitstimes.com.", "filename": "singapore_politics_higher-percentage-of-travellers-refused-entry-into-singapore-with-automated-lanes_1728739713.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/09/20220913917680525663255a-69b1-4556-ba70-80ff98f9263f.jpg?VersionId=bK3vgm0lhqUtxYzkT2GQ4dSDUmg1pHHN&h=6226e679", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_higher-percentage-of-travellers-refused-entry-into-singapore-with-automated-lanes_1728739713.html", "title": "Higher percentage of travellers refused entry into Singapore with automated lanes", "title_page": "Higher percentage of travellers refused entry into Singapore with automated lanes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Since automated immigration lanes were introduced for all foreigners at Changi Airport in May, a higher percentage of travellers have been refused entry into Singapore.\nWith automated clearance, checks are done earlier and technology can be used more extensively, said Minister of State for Home Affairs Sun Xueling.\nMs Sun was responding to a parliamentary question from Progress Singapore Party Non-Constituency MP Leong Mun Wai on Sept 9.\nMr Leong had asked if the automated lanes for all foreigners at Changi Airport had increased the risk of people who are not genuine travellers entering Singapore.\nMs Sun replied that the new system had led to an increased percentage of travellers who are refused entry into Singapore, but did not give exact numbers.\nEarlier in the day, Minister for Home Affairs K. Shanmugam said in Parliament that every month, about 2,500 visitors are refused entry at Singapore’s checkpoints for various reasons.\nMr Shanmugam was responding to parliamentary questions about border security measures, which were prompted by the case of extremist Bangladeshi preacher Amir Hamza. He had entered Singapore on Aug 9 and preached to migrant workers at a dormitory here without a permit.\nMs Sun said pre-arrival, the Immigration and Checkpoints Authority (ICA) uses advance passenger information to conduct data analytics and a risk assessment of travellers.\nAll arriving travellers are screened against a watch list of persons of interest, and those flagged by ICA to be of higher risk. They are then stopped for more stringent checks.\nICA’s automated lanes also use biometrics, said Ms Sun.\nShe said: “Repeat travellers, including those who had committed crimes in Singapore, who try to enter via a different identity, will be flagged by our biometric database, because we would have captured their biometrics on their previous visit.”\nMr Shanmugam said Amir Hamza was on the Internal Security Department’s watch list, but he applied for a visa to enter Singapore using a passport with a different name. As this was Amir Hamza’s first visit to Singapore, the authorities did not have his biometrics.\nSaid Mr Shanmugam: “If he tries to come back again, regardless of what other passport he uses, he will be picked up because we now have his biometrics.”\nMs Sun said that with more automated processes, more ICA officers can be deployed to spot suspicious travellers at the automated immigration lanes.\nSince May, all foreigners arriving in Singapore, regardless of nationality, can use the automated lanes at Changi Airport to clear immigration.\nICA plans to install about 800 such automated lanes across all of Singapore’s checkpoints by 2026.\nMr Leong also asked if the number and percentage of social visit pass holders from China who have been arrested had increased since the 30-day visa exemption arrangement came into force on Feb 9.\nUnder the arrangement, holders of ordinary passports issued by the People’s Republic of China will be exempted from visa requirements for a stay of up to 30 days in Singapore.\nMs Sun said Mr Leong’s question may have been prompted by the recent burglaries allegedly linked to foreign syndicates involving Chinese nationals. Three have been arrested, while another 14 are at large.\nMs Sun said there has been no increase in the number or percentage of short-term visitors from China getting arrested in Singapore since the new arrangement began.\nShe added that visa regimes are not a foolproof way to keep unwanted characters away; neither would they stop these people from committing crimes here.\nThe only way to stop that would be to close our borders to foreigners, but this would destroy the country’s economy, she said.", "url": "https://www.straitstimes.com/singapore/politics/higher-percentage-of-travellers-refused-entry-into-singapore-with-automated-lanes"}