{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 13:59:20", "date_modify": "2024-10-12 13:59:20", "date_publish": "2023-05-22 05:00:00", "description": "A programme the woman attended gave her the tools to help her manage and understand her emotions. Read more at straitstimes.com.", "filename": "singapore_i-worried-if-i-would-be-normal-again-breast-cancer-at-25-made-new-mother-rethink-life_1728741560.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/31/sv-chemp-190523.jpg?VersionId=8n5R2..dC032mxGzIrfFd9Skkw_d25hU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_i-worried-if-i-would-be-normal-again-breast-cancer-at-25-made-new-mother-rethink-life_1728741560.html", "title": "‘I worried if I would be normal again’: Breast cancer at 25 made new mother rethink life", "title_page": "‘I worried if I would be normal again’: Breast cancer at 25 made new mother rethink life | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – In September 2021, Ms Kwa Lay Teng, then 25, was nursing her four-day-old baby girl during confinement in her mother’s home when she got a call from her doctor.\n“He told me: ‘Hi, Lay Teng, I’m so sorry, it is breast cancer. You need to stop breastfeeding now.’ I couldn’t stop crying. My husband was beside me. I didn’t even have to tell him what happened; he knew it was bad. He called my mum who came and took the baby away from me.”\nShe also had to induce menopause as her hormones fuelled her cancer, a rude shock to her dreams of raising a family of five with her husband. “I was in denial... I worried if I would ever be normal again,” she said.\nAlmost two years on, her cancer is in remission but her fear – now of relapse – remains.\nIn October 2022, Ms Kwa joined a four-session emotional well-being programme that her oncologist, Dr Karmen Wong, started a year earlier for breast cancer survivors, where she learnt to manage her fears. The Zoom sessions are facilitated by breast cancer survivors and have helped 85 women in three runs since the programme was launched.\nDr Wong, who has worked with breast cancer patients for 30 years, said: “They are willing to go through a lot of treatment and lose their breasts and hair to live longer. After diagnosis, they say they are not the same as before, physically, emotionally and mentally... If you don’t deal with it, you will spiral down.”\nBreast cancer is the most common cancer among women in Singapore: One in 13 will get the disease in their lifetime. Most of those diagnosed are above the age of 40.\nAt least 30 per cent to 40 per cent of early breast cancer cases face a high risk of relapse, according to Professor Lee Soo Chin from National University Cancer Institute, Singapore.\nThe course that Dr Wong started teaches breast cancer survivors exercises to help them process their fear and grief, improve self-esteem and set habits to move forward in life. Its lead facilitator, Ms Wendy Chua, who is trained in psychology, said she holds focus group sessions with the women, and introduces processes to help them open up and tell their stories, as well as acknowledge and reframe negative thoughts.\nTo some, like Ms Kwa, sharing what they have been through has not just helped them cope, but also given them the satisfaction of giving other survivors strength.\nAt first, Ms Kwa struggled to accept the fact that she had stage 2B cancer.\nShe found lumps in her breast when she was 38 weeks pregnant and went for an ultrasound scan, but thought this was due to clogged milk ducts.\n“I was resentful and afraid. I resented the fact that I have cancer... I was afraid that I might not wake up from closing my eyes. I was afraid that I’ll very soon not be there for my baby girl,” she shared on social media in March about how she felt when she heard the diagnosis in September 2021.\nAbout a week after receiving the diagnosis, she was thrust into eight months of chemotherapy, radiotherapy and surgery.\nChemotherapy left her exhausted and unable to take a walk or carry her baby for more than 10 minutes at a time. She experienced bouts of nausea; her hair fell out and her fingernails turned black.\nShe hid her condition from her co-workers till her friend accidentally shared a photo of her bald head on social media during Christmas. “The last thing I wanted was sympathy,” she said.\n“I had a lot of doubt in my mind. Everyone said I can do it, medicine is very advanced, I’m still young, it’ll be alright... but I doubted if I’ll be able to survive this journey, if I am as strong as what others think,” she wrote in the post.\n“I know that I am strong but at that point in time, I couldn’t help but feel weak and small,” she added.\n“When going through treatment I didn’t acknowledge my feelings, and kept telling myself it’s no big deal,” she said.\n“But my closest friend told me it was a big deal.”\nThe friend suggested she could use her story to spread awareness.\n“Now, it’s about how much fun I’m having in a day, how free I feel to do what I love... not to feel like I have to be in control of everything.”\nMs Lim, 41, left her job and started Strong Bold Grateful Inc in October 2021, a company to share stories in firms and at events on overcoming adversities such as the loss of a child.\n“Friends and family should allow people the space to talk about (their struggle with disease) and not treat it as a taboo and avoid the topic... It is important to articulate how we actually feel,” she said.\nReflecting on the treatment process, Ms Kwa said: “If I were to go back in time, I would take more pictures and post them online to let other people know what I was going through. I would try to embrace the process and not be beaten down by the journey.”", "url": "https://www.straitstimes.com/singapore/i-worried-if-i-would-be-normal-again-breast-cancer-at-25-made-new-mother-rethink-life"}