{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:55:39", "date_modify": "2024-10-12 13:55:39", "date_publish": "2024-01-31 13:52:37", "description": "SPCA investigated 915 cases of animal cruelty and welfare issues in 2023. Read more at straitstimes.com.", "filename": "singapore_animal-cruelty-and-welfare-cases-surge-79-in-2023-highest-in-11-years-spca_1728741339.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/31/midogg130921.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_animal-cruelty-and-welfare-cases-surge-79-in-2023-highest-in-11-years-spca_1728741339.html", "title": "Animal cruelty and welfare cases surge 79% in 2023, highest in 11 years: SPCA", "title_page": "Animal cruelty and welfare cases surge 79% in 2023, highest in 11 years: SPCA | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - There was a 79 per cent increase in reported cases of animal cruelty and welfare issues in 2023 – the highest in 11 years. The Society for the Prevention of Cruelty to Animals (SPCA), in a report on Jan 31, said it investigated a total of 915 cases in 2023.\nIn 2022, it investigated 511 such cases.\nInstances of welfare and neglect made up 61.2 per cent or 558 cases – out of which two-thirds were linked to unsatisfactory living conditions.\nCases of abuse and cruelty formed the remaining 38.8 per cent and included six instances involving young people.\nIn 2023, SPCA dealt with 137 abandonment cases involving 285 animals, twice that in 2022. The number of animals abandoned in previous years was about 70 on average.\nCats made up the largest group, comprising 45 per cent of the animals abandoned, while hamsters came in second at 27 per cent.\nHalf of the abandonment cases involved small animals, such as hamsters and rabbits. For instance, guinea pigs were left inside thermal food bags, rabbits were found in cramped and unhygienic conditions, and hamsters were abandoned without food or water.\nThere were 31 cases of abuse involving pet businesses, such as pony rides at the 2023 Geylang Serai Ramadan Bazaar, which drew complaints from people. Another case involved a dog trainer who repeatedly hit and threatened a dog.\nAccidents involving pets falling from windows or balconies – which SPCA said were due to a lack of proper safety measures like gates and mesh – happened four to six times a week on average.\n“More often than not, these cases are preventable,” said SPCA.\nThe organisation also dealt with 30 hoarding cases, which involved about 480 animals. In the first half of 2023 alone, rescuers dealt with more than 400 cats linked to pet hoarding.\n“Beyond safeguarding animal welfare, SPCA also recognises that behind every needy animal could be a struggling human. If you can no longer care for your pets, please seek help immediately,” the report said.\nAnyone who witnesses animal abuse or neglect can lodge a report by calling the SPCA hotline on 6287-5355 (ext 9) or by going online to www.spca.org.sg/report\n“While SCPA does not have enforcement powers, we will collate all the evidence and follow up closely with the authorities,” the report added.", "url": "https://www.straitstimes.com/singapore/animal-cruelty-and-welfare-cases-surge-79-in-2023-highest-in-11-years-spca"}