{"authors": ["Lynda Hong"], "date_download": "2024-10-12 13:48:37", "date_modify": "2024-10-12 13:48:37", "date_publish": "2023-12-15 18:05:00", "description": "The public sector emitted 3.7 million tonnes of carbon in FY2022. Read more at straitstimes.com.", "filename": "singapore_environment_phasing-out-single-use-items-a-priority-in-public-sector-s-first-environmental-sustainability-report_1728740917.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/15/btbottle20231215.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_phasing-out-single-use-items-a-priority-in-public-sector-s-first-environmental-sustainability-report_1728740917.html", "title": "Reducing single-use items a priority in public sector’s first environmental sustainability report", "title_page": "Reducing single-use items a priority in public sector’s first environmental sustainability report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The public sector is prioritising reducing single-use items such as bottled water for meetings and disposables for dine-in meals, and seeking to replace potable water with non-potable water for irrigation, general washing and cooling.\nThese are some of the moves the public sector is employing to improve environmental sustainability, according to the inaugural GreenGov.SG report, which detailed carbon emissions, as well as water and electricity usage by the public sector and its assets, such as office buildings, healthcare facilities, schools, public utilities installations, public transport infrastructure and vehicles.\nGovernment agencies are also reducing the number of lifts operating at non-peak hours, and installing more energy-efficient lighting and air-conditioners.\nLaunching the report on Dec 15 at Singapore Polytechnic, Senior Parliamentary Secretary for Sustainability and the Environment Baey Yam Keng said it publicly tracks the progress in the use of electricity and water, as well as emissions that would chart towards net-zero ambitions around 2045 – five years ahead of the national target.\nThe report published by the Ministry of Sustainability and the Environment, the first such report in South-east Asia, showed that the public sector accounted for 7.2 per cent of total carbon emissions produced in Singapore in FY2021, going by the latest figure provided by the National Climate Change Secretariat.\nIn FY2022, the public sector emitted less carbon – 3.7 million tonnes, 5.3 per cent less than FY2020 – mainly due to the closure of the Tuas Incineration Plant in 2022. Collection of this data started in 2020.\nEmissions are expected to peak around 2025 as more activities resume post-pandemic, and more new major public infrastructure projects for transport, healthcare and utilities are completed in the coming years.\nThe sources of emissions in the report come from Scope 1 and 2 emissions. Scope 1 refers to direct emissions – such as emissions from facilities or vehicles that run on fossil fuels like natural gas, petrol and diesel. Waste incineration as part of waste management services is also a form of direct emission.\nIn FY2022, Scope 1 emissions were at 1.37 million tonnes, while Scope 2 emissions were at 2.3 million tonnes.\nThe use of electricity comes under Scope 2 emissions. Over 90 per cent of electricity in Singapore is generated using natural gas.\nThe report said the public sector used 5,591 gigawatt hours of electricity and 32.9 billion litres of water in FY2022. Both were benchmarked against the average of 2018 to 2020 to better reflect hybrid working arrangements post-pandemic.\nWater usage rose 1.2 per cent, mainly due to a gradual re-opening of the economy post-pandemic and an increase in activities. The increase of 1.7 per cent in electricity usage was attributed to the expansion of the public transport network and healthcare facilities.\nSaid Mr Baey: “By tracking how much it has consumed, the public sector will be motivated to identify gaps and opportunities to reduce its footprint further.”", "url": "https://www.straitstimes.com/singapore/environment/phasing-out-single-use-items-a-priority-in-public-sector-s-first-environmental-sustainability-report"}