{"authors": ["Carmen Sin"], "date_download": "2024-10-12 13:44:21", "date_modify": "2024-10-12 13:44:21", "date_publish": "2023-10-17 14:10:00", "description": "The national carrier said it is offering the discounts as part of its upcoming Time To Fly travel fair. Read more at straitstimes.com.", "filename": "singapore_over-170000-discounted-sia-tickets-to-go-on-sale-in-november_1728740661.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/17/20230615109350971img4331.jpg?h=3b20dc02", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_over-170000-discounted-sia-tickets-to-go-on-sale-in-november_1728740661.html", "title": "Some 370,000 discounted SIA, Scoot tickets to go on sale in November", "title_page": "Some 370,000 discounted SIA, Scoot tickets to go on sale in November | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – More than 170,000 discounted Singapore Airlines (SIA) tickets and some 200,000 discounted Scoot tickets will go on sale on Nov 3.\nIn a statement on Tuesday, the national carrier said it is offering the discounts as part of its upcoming Time To Fly travel fair.\nThe fair, in its third run, is the largest to date, with the most number of discounted air tickets, destinations and travel partners involved, an SIA spokesman told The Straits Times.\nThe discounted tickets can be purchased at SIA’s physical event from Nov 3 to 5 at Suntec Singapore Convention and Exhibition Centre Halls 405 and 406. They will also be available online between Nov 3 and 16 on the SIA and Scoot websites, the SIA mobile app, and through SIA-appointed travel agents, said the airline.\nSIA will offer discounts on more than 170,000 round-trip tickets across the business, premium economy and economy classes, from Singapore to 71 destinations – nearly its entire travel network.\nThe discounts are applicable to flights between January and September 2024.\nThe 200,000 discounted Scoot tickets, meanwhile, are available only for one-way flights, said the budget subsidiary of SIA in a statement on Tuesday.\nScoot will offer discounted rates to more than 50 destinations for travel between November 2023 and October 2024. Airfares, the budget carrier said, start from $68 to Kuala Lumpur and $140 to Taipei. More details will be announced on its website on Oct 31.\nSIA chief commercial officer Lee Lik Hsin said: “SIA and Scoot are pleased to offer our customers greater options and value as they make their travel and holiday plans for 2024, and as we return to pre-pandemic levels of operations.”\nThe three-day physical travel fair also includes a lucky draw, where participants stand to win a pair of business class round-trip tickets to Bali, the Maldives, Osaka and Phuket.\nFrequent fliers said they welcome the discounts. “This is good news for me,” said Ms Judy Tan, 57, a retired advertising director who has been to 10 countries this year. “Airfares have gone up so much since the pandemic.”\nMs Quinn Tan, who has been travelling for the last two months while on a sabbatical, said she was “sceptical” about the discounts but might be persuaded to travel more if they are significant.\n“I’m eyeing Japan, Norway and London,” said the 33-year-old banker. “But my plans will depend on how big the discounts are.”", "url": "https://www.straitstimes.com/singapore/over-170000-discounted-sia-tickets-to-go-on-sale-in-november"}