{"authors": ["Theresa Tan"], "date_download": "2024-10-12 13:28:54", "date_modify": "2024-10-12 13:28:54", "date_publish": "2024-09-02 05:00:00", "description": "Public health experts described this figure as low. Read more at straitstimes.com.", "filename": "singapore_2102-people-in-s-pore-have-died-from-covid-19-since-start-of-pandemic-to-june-2024-moh_1728739734.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/yaohui-yhsgh-9808.jpg?VersionId=ymg2YF1O5tNiW7zAPiXaUImnXf5fjNI9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_2102-people-in-s-pore-have-died-from-covid-19-since-start-of-pandemic-to-june-2024-moh_1728739734.html", "title": "2,102 people in S’pore have died from Covid-19 since start of pandemic to June 2024: MOH", "title_page": "2,102 people in S’pore have died from Covid-19 since start of pandemic to June 2024: MOH | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - There have been 2,102 Covid-19 deaths here since the start of the pandemic in 2020 to June 2024, the Ministry of Health (MOH) told The Straits Times – a figure that public health experts describe as low.\nWhile the experts say Singapore has done well in the fight against Covid-19, the pandemic nevertheless pushed up the age-standardised death rate – an indicator that allows for a fair comparison of mortality rates over time as it removes the effect of a rapidly ageing population.\nSingapore’s age-standardised death rate rose to a high of 5.9 per 1,000 resident population in 2022, up from 5.2 in 2020 and 5.6 in 2021. In 2023, it went back down to 5.6.\nThe MOH gave ST data on Covid-19 deaths in response to questions on the sharp increases in the total number of deaths over the past few years.\nA total of 26,888 people died last year, just 0.01 per cent lower than the 26,891 deaths in 2022, based on the Report on Registration of Births and Deaths 2023 published by the Immigration and Checkpoints Authority in July.\nThe 2023 figure was 10.7 per cent higher than the 24,292 deaths in 2021. In 2020, 22,054 people died.\nAn MOH spokeswoman said: “To observe mortality trends over time, age-standardised death rates are used instead of absolute numbers of deaths, as they remove the effect of changing population structure, such as that caused by an ageing population.”\nFrom 2013 to 2020, the age-standardised death rates fell despite the absolute number of deaths increasing due to Singapore’s ageing population, the spokeswoman said. For example, the age-standardised death rate was 6.1 per 1,000 resident population in 2013, but fell almost year on year to 5.2 per 1,000 resident population in 2020.\nMeanwhile, the absolute number of deaths rose steadily year on year from 18,938 deaths in 2013 to 22,054 deaths in 2020.\nThe MOH spokeswoman said the falling age-standardised death rates were likely due to “our preventive health efforts, earlier diagnosis and better treatment of diseases”.\nBut from 2020 to 2022, the age-standardised death rates increased as they were “driven by the Covid-19 pandemic”, she added.\nShe said that while Singapore had one of the lowest mortality rates in the world during the pandemic, more people still died during that time.\nThe increase in the age-standardised death rates in 2021 was mainly due to the Delta wave in the last few months of that year. Before the Delta wave, there were few Covid-19 deaths, the MOH spokeswoman added.\nThe top causes of deaths in Singapore in the past five years were cancer, ischaemic heart diseases, pneumonia and cerebrovascular diseases, which are conditions that affect blood flow to the brain, such as stroke.\nAssociate Professor Alex Cook, vice-dean of research at the National University of Singapore (NUS) Saw Swee Hock School of Public Health, said it is unfair to compare the total number of deaths today with the past as Singapore’s population is rapidly ageing. With a larger pool of seniors, more deaths are to be expected.\nHence, the age-standardised death rate is used to enable a fair comparison, either between countries with different age profiles of its populations or between two or more points in time for a particular country, he said.\nConsidering the impact of the Covid-19 pandemic, Singapore’s age-standardised death rates look “very favourable” compared with other high-income countries, Prof Cook said.\nIn September 2022, the MOH released a report that estimated that there were 2,490 excess deaths during the Covid-19 pandemic from January 2020 to June 2022.\nExcess deaths refer to the difference between the number of deaths from all causes since the pandemic started and the expected number of deaths in the absence of Covid-19.\nOf the excess deaths, 1,403 Singapore residents, or Singapore citizens and permanent residents, died of Covid-19.\nThe remainder died of other illnesses within 90 days of being infected with Covid-19. The report said that Covid-19 aggravated existing illnesses, resulting in death.\nAnd among those who died of Covid-19 in 2021 and the first half of 2022, those who were not fully vaccinated were over-represented.\nThe report said: “This highlights the importance of the elderly getting vaccinated and boosted to protect them from Covid-19 and its complications.”\nOf the 2,102 people who died of Covid-19 since the start of the pandemic in 2020 until June 2024, 2,035 were Singapore residents, said the MOH spokeswoman. The remainder were non-residents.\nProfessor Teo Yik Ying, dean of the NUS Saw Swee Hock School of Public Health, said: “It is important to understand that the increase in age-standardised death rate from 2020 to 2022 is not simply because of increased deaths due to Covid-19 infections, but also there were people who passed on because they were unable to seek timely medical attention for their pre-existing chronic conditions.”\nAt that time, many elective medical procedures were deferred to prevent hospitals from being overwhelmed and to minimise the possibility of patients being infected with Covid-19 while hospitalised, he said.\nHe added: “While this ensured the health system was able to tend to the most urgent cases, this may also mean some cases were only identified at a later stage of disease progression, and thus experiencing a poorer survival rate.”\nPublic health specialist Jeremy Lim said that Singapore has done well in tackling the Covid-19 pandemic.\n“About 2,000 deaths directly attributed to Covid-19 is perhaps surprising for it being low. In many other countries, total mortality due to Covid-19 is much higher,” he said.\n“Singapore has done well in addressing Covid-19... but even then, some deaths are inevitable.”", "url": "https://www.straitstimes.com/singapore/2102-people-in-s-pore-have-died-from-covid-19-since-start-of-pandemic-to-june-2024-moh"}