{"authors": ["Justin Ong‍"], "date_download": "2024-10-12 13:31:06", "date_modify": "2024-10-12 13:31:06", "date_publish": "2021-05-31 16:19:04", "description": "Vaccination for the final group of people - adults aged 39 and below - should start around mid-June. Read more at straitstimes.com.", "filename": "singapore_politics_covid-19-vaccination-exercise-for-spore-students-to-begin-june-1-those-39-and_1728739866.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/05/31/hzstudents0531.jpg?VersionId=JvPiFir7wluDsApaYrIdeSAL4bAKKMT.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_covid-19-vaccination-exercise-for-spore-students-to-begin-june-1-those-39-and_1728739866.html", "title": "Covid-19 vaccination exercise for S'pore students to begin June 1; those 39 and below can register from mid-June", "title_page": "Covid-19 vaccination exercise for S'pore students to begin June 1; those 39 and below can register from mid-June | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Students will be able to book appointments to receive the Covid-19 vaccine from Tuesday (June 1), Prime Minister Lee Hsien Loong announced on Monday.\nIn a virtual address to the nation giving an update on the pandemic situation, PM Lee said that after students, the next group to be vaccinated will be those aged 39 and below, with Singaporeans given precedence.\nPM Lee noted that there have been more cases of children getting infected in schools and tuition centres in Singapore's latest outbreak - which has left parents \"naturally worried\" although no serious illnesses have been recorded.\n\"Therefore, we will take full advantage of the June holidays to vaccinate students,\" he said.\nPriority will be given to students sitting for their O-, N- and A-level examinations, as well as special needs students.\nNext, students 12 years and above will take their turn, including those in institutions of higher learning, said PM Lee.\nHealth Minister Ong Ye Kung had previously announced on May 18 that the green light had been given for those aged 12 to 15 to receive the Pfizer-BioNTech vaccine.\nVaccination of those aged 39 and below should start around mid-June, PM Lee added on Monday.\nNoting that this group is \"quite large\", he said Singaporeans will be given a two-week priority window to book their appointments ahead of the rest who wish to be vaccinated.\nMr Lee also said that nearly four in 10 residents have had at least one jab.\nStill, he stressed the need to vaccinate more people, and faster, as part of Singapore's fight against the coronavirus.\n\"We've made good progress since vaccinations started in December,\" he said.\n\"Our healthcare and front-line workers, and the majority of those 45 and above, have already received at least their first dose. These are the ones more at risk from Covid-19.\"", "url": "https://www.straitstimes.com/singapore/politics/covid-19-vaccination-exercise-for-spore-students-to-begin-june-1-those-39-and"}