{"authors": ["Goh Yan Han"], "date_download": "2024-10-12 13:40:07", "date_modify": "2024-10-12 13:40:07", "date_publish": "2024-09-09 23:20:29", "description": "The issue was raised by MP Gerald Giam during the debate on the Platform Workers Bill. Read more at straitstimes.com.", "filename": "singapore_politics_pap-and-wp-mps-clash-over-ruling-party-s-close-ties-with-ntuc_1728740407.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/Azmi-pixgeneric-2.JPG?VersionId=CNBWwTf6Eqm.C5h364gJEcfeQUjq8eaS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_pap-and-wp-mps-clash-over-ruling-party-s-close-ties-with-ntuc_1728740407.html", "title": "PAP and WP MPs clash over ruling party’s close ties with NTUC", "title_page": "PAP and WP MPs clash over ruling party’s close ties with NTUC | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Whether the close relationship between the People’s Action Party (PAP) and the National Trades Union Congress (NTUC) is good for workers here was the subject of a 30-minute exchange in Parliament on Sept 9 when the House discussed a Bill to strengthen protections for platform workers.\nPAP MPs argued that this alliance has ensured that the views and needs of workers have been conveyed to the political leadership and prioritised, and that this is reflected in the ruling party’s track record since it has been in government.\nThe issue was raised by Mr Gerald Giam (Aljunied GRC) during the debate on the Platform Workers Bill.\nWhile acknowledging the union leaders’ hard work, the Workers’ Party (WP) MP questioned if they could fully advocate workers’ interests if they were also PAP members.\nHe noted that many PAP MPs and branch chairpersons serve as advisers to NTUC-affiliated unions.\nShould workers’ interests conflict with government policies or party agenda, these leaders may feel pressured to support such policies even if they feel that doing so compromises workers’ needs, said Mr Giam.\n“Furthermore, an overly close relationship between the PAP and unions risks creating groupthink, where union leaders are less inclined to challenge prevailing policies or explore alternative solutions,” he added.\nHe also suggested that if the PAP were to lose power, unions aligned with the PAP might struggle to work with the new government, or lose the support of workers who voted for the new administration, potentially weakening their effectiveness.\nMidway through his speech, Mr Christopher de Souza (Holland-Bukit Timah GRC) raised a point of order that Mr Giam had not referenced any provision in the Bill, and what he said was instead “predominantly an attack against the NTUC”.\n“We cannot, Mr Speaker, be using Parliament and legislation to craft political speeches that go well beyond the ambit and the scope of the legislation that we are debating,” said Mr de Souza, addressing Speaker of Parliament Seah Kian Peng.\nMr Giam replied that the first part of his speech was a preamble relevant to the points he wanted to make. Among them was that the WP supports tripartite dialogue between employers, unions and the government of the day, but not an explicit alignment between the unions and any political party.\nIn this regard, NTUC-affiliated Platform Work Associations – which would be given legal mandate under the new Bill – could restrict workers’ choices in joining or forming an association that best represents their interests. He proposed that they be able to form alternative associations not affiliated with NTUC, so as to have representation that is “not beholden to any political party or the government”.\nAfter Mr Giam concluded his speech, Mr Seah pointed him to Section 50 of the Standing Orders of Parliament, which, among other things, instructs MPs to keep their speeches relevant to the subject being discussed.\nLeader of the Opposition Pritam Singh then joined the debate, where he questioned the relevance of Mr de Souza’s 2022 Budget speech, which was focused not on government spending but instead urged the PAP to make a decision on the 4G (fourth-generation) leadership.\n“It cannot be just accusations made at the opposition, but I think some PAP members ought to reflect on themselves,” said the WP chief.\nMr de Souza replied that at a Budget debate, members have free rein to discuss what they want in addition to the Budget, such as the objectives, values and future they want to see for Singapore.\n“I was concerned for the country that we needed leadership. I stood here and gave one of the most difficult speeches of my political career, which is that... without key leadership, budgets are nothing,” he said.\nOn the other hand, Mr Giam’s speech attacking NTUC, during a debate on a Bill to advance platform workers’ welfare, was political opportunism, Mr de Souza said.\nSenior Minister of State for Defence Heng Chee How, who has been with the labour movement for close to 30 years, weighed in, saying that the PAP’s decades-long track record shows that the close partnership has served workers well.\nHe noted that alliances between political parties and trade unions are not uncommon in many countries, including Britain, the United States and Canada, which Leader of the House Indranee Rajah had earlier cited.\n“They don’t do this out of stupidity,” said Mr Heng. “They do this because it serves the interest of the constituents that they represent concurrently.”\nHe asked that Mr Giam “deal with the facts”, and give due respect to union leaders here. “They are not stooges. Their hearts are in the right place. They do all this for their fellow workers,” he said.\nMr Heng then questioned if Mr Giam’s proposals would make it more or less likely for tripartite partners to come to a sensible agreement that can be implemented for the good of workers.\n“Be fair to our unions. Be fair to the NTUC. NTUC is not expecting the Workers’ Party to support us, but at least be fair,” he said.\nSenior Minister of State for Manpower Koh Poh Koon also waded into the discussion. He recalled that when the left wing of the PAP split off to form the Barisan Sosialis, the Singapore Trades Union Congress also split into two rival bodies – NTUC and the Singapore Association of Trade Unions (Satu).\n“Satu aligned with the Barisan Sosialis, and the Barisan Sosialis in 1988 folded into the Workers’ Party,” said Dr Koh.\n“So I think maybe the Workers’ Party should think about changing its name, because if you feel so averse about being associated with workers, you might want to think about something else.”\nMr Giam then asked the PAP MPs if, based on their statements, one can assume that NTUC would become “an instrument of opposition against the new government”, if the PAP were to ever lose power.\nIn response, Ms Indranee said that she could not speak on behalf of NTUC, though it would be entirely up to the workers and NTUC to decide whether to support any political party.\nThis is as trade unions elect their own leaders, and will act in ways that they think is best for their unions and their workers, she said.\n“What I can say is that the PAP would do its very utmost not to have to give them a reason to think that we would never support them, or that, as a government, we would not do our very best for the workers and the NTUC,” she said.", "url": "https://www.straitstimes.com/singapore/politics/pap-and-wp-mps-clash-over-ruling-party-s-close-ties-with-ntuc"}