{"authors": ["Nadine Chua"], "date_download": "2024-10-12 13:32:38", "date_modify": "2024-10-12 13:32:38", "date_publish": "2023-04-09 05:00:00", "description": "Narcotics abuse not only impacts individuals, but also their families and kids, says CNB. Read more at straitstimes.com.", "filename": "singapore_10-young-children-including-two-month-old-infant-rescued-during-drug-raids-over-last-3-years_1728739958.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/09/lwxabuse16031986_1.jpg?VersionId=p7n9JdJVz2YfJJfV36ORIcnf8FKRRqPx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_10-young-children-including-two-month-old-infant-rescued-during-drug-raids-over-last-3-years_1728739958.html", "title": "10 young children, including two-month-old infant, rescued during drug raids over last 3 years", "title_page": "10 young children, including two-month-old infant, rescued during drug raids over last 3 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – When officers from the Central Narcotics Bureau (CNB) raided a suspected drug den in Sembawang Drive in February, they found heroin and methamphetamine, or Ice – and a two-month-old infant.\nThe mother – a 32-year-old known drug user – had been under investigation for drug offences since 2022.\nStation Inspector Marlina Djumadi, a CNB officer who was involved in the raid, said the woman may have continued using drugs while she was pregnant, possibly endangering the health of her child.\nShe added: “Drug abuse is not a victimless crime – it has dire consequences on families and innocent children.\n“I hope that the woman will be able to get the help that she needs so that she will be able to better care, protect and provide for her child.”\nBased on reported cases over the past three years, CNB officers had to rescue at least 10 children during drug raids at residential units. Many of them were just infants. They included a six-month-old who was found in a unit in Geylang in July 2021.\nIn a separate raid that same year, CNB officers arrested 104 suspected drug offenders and brought to safety three young children, including a 10-month-old girl.\nA CNB officer had to prepare milk for the child.\nA spokesman for the bureau said: “Drug abuse affects not only the individual, but the families and children of abusers as well. In particular, children may be exposed to harmful drugs or drug utensils lying around the home, or to drug-taking behaviours.”\nIn the raids, the women were arrested for drug-related offences.\nA spokesman for the Ministry of Social and Family Development said the ministry has established procedures with law enforcement agencies to ensure that any vulnerable individual in such situations can receive timely assistance.\nHe added: “Depending on the severity, CNB officers may alert the social service offices, family service centres, the Child Protective Service (CPS) or the Adult Protective Service for assistance.\n“CPS will assess the family’s circumstances and ability to provide safe care for the child. If the child cannot remain safe at home or there are no other suitable kin carers, CPS will place the child in alternative care.”\nThis can include foster care or a children’s home. In several instances, family members stepped in to care for the children after the women were arrested.\nThe ministry said that, if necessary, CPS will ensure the vulnerable individual receives counselling, therapy and financial assistance.\nIn some cases, pregnant women have also put their unborn children at risk.\nIn an incident in 2022, a woman who was seven months’ pregnant tried to evade arrest by climbing out of the window of the 11th-floor unit she was in.\nShe had to be rescued by Singapore Civil Defence Force officers. After CNB officers gained entry into her unit, they found drug paraphernalia and her seven-year-old son.\nIn a more recent case, a 26-year-old pregnant woman was arrested in a Bedok North Road unit in March for drug consumption. With her was her nine-month-old baby.\nKK Women’s and Children’s Hospital (KKH) said it conducted two studies on pregnant drug users – from March 1, 2021, to Aug 31, 2022 – after the CNB contacted the hospital to better understand the impact of drug abuse on pregnant abusers and their developing foetuses or children.\nDr Ryan Lee, a consultant in the department of maternal foetal medicine at the hospital who was involved in both studies, said: “One of the two studies that KKH conducted involved 20 local pregnant women who abused drugs from 2010 to 2020.\n“It showed that the prevalence of drug abuse among local pregnant women was low at one in 5,590, and this is a strong testimony to Singapore’s strong efforts to reduce drug abuse.”\nWhile numbers are low, observers are concerned by recent developments. The number of women convicted of drug-related offences in Singapore has been increasing, from 371 in 2019 to 471 in 2020.\nAbout three in four women in prison here were locked up for drug offences, with many having started abusing drugs because of their partners.\nWomen who abuse drugs also face a higher risk of pregnancy complications, including miscarriages and pre-term births.\nMs Lim Kae Shin, principal pharmacist at KKH, said: “When women abuse drugs during pregnancy, the substances of abuse can reach the foetus through the placenta and have both short-term and long-term effects, depending on the type of drugs abused.”\nFor instance, Ice can cause the woman’s blood vessels to narrow, restricting the amount of nutrients delivered to the baby, she added.\nIn the long run, this can lead to a higher risk of long-term developmental issues for the child.\nDr Nirmal Visruthan Kavalloor, senior consultant in the department of neonatology at KKH, said babies of women who abuse drugs during their pregnancy are at risk of developing neonatal opioid withdrawal syndrome, or drug withdrawal.\n“These babies can be irritable, have sleeping or feeding difficulties, or even diarrhoea. Sometimes, they can be seriously unwell with fever, have fast breathing and seizures,” he added.\n“Our care team will monitor the babies’ vital signs and symptoms closely, swaddle or wrap them in a blanket to bring them comfort, monitor their growth and give small frequent feeds to bring them relief.”\nHe said medical treatment may be required for babies with serious symptoms.\nDr Nirmal added that mothers who require assistance with housing, financial, counselling and caregiving support will be assessed and supported by KKH’s medical social workers.", "url": "https://www.straitstimes.com/singapore/10-young-children-including-two-month-old-infant-rescued-during-drug-raids-over-last-3-years"}