{"authors": ["Josiah Teo"], "date_download": "2024-10-12 13:54:57", "date_modify": "2024-10-12 13:54:57", "date_publish": "2023-03-16 20:56:17", "description": "The team’s discovery could lead to the development of new drugs to treat Alzheimer’s. Read more at straitstimes.com.", "filename": "singapore_ntu-scientists-discover-how-brain-powers-the-clearing-of-waste-linked-to-alzheimer-s-disease-paving-way-for-possible-treatment_1728741297.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/17/Image201.jpg?VersionId=zmHgmc_Juea06iLLUs33y30K.8PFV1cf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_ntu-scientists-discover-how-brain-powers-the-clearing-of-waste-linked-to-alzheimer-s-disease-paving-way-for-possible-treatment_1728741297.html", "title": "NTU scientists discover how brain generates energy to clear waste linked to Alzheimer’s", "title_page": "NTU scientists discover how brain generates energy to clear waste linked to Alzheimer’s | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A team of 12 researchers from Nanyang Technological University (NTU) has shed light on how immune cells in the brain produce energy to clear toxic waste which would otherwise build up to cause Alzheimer’s disease.\nThe team’s discovery, which was published in the journal Proceedings Of The National Academy Of Sciences on Feb 14, could lead to the development of new drugs to treat Alzheimer’s, for which there is no cure yet and which accounts for 60 to 70 per cent of dementia cases, according to the World Health Organisation.\nIn Singapore, there were 82,000 people living with dementia in 2018 and this number is expected to increase to 152,000 by 2030.\nOne key indicator of the disease is the build-up of protein plaques between nerve cells in the brain.\nLed by Nanyang Assistant Professor Anna Barron from NTU’s Lee Kong Chian School of Medicine, the team found that there are two ways microglia cells in the brain generate energy to clear the protein plaques.\nThe first way is through a specific protein known as the translocator protein. Found in the power-generating parts of cells known as mitochondrion, the study showed that this protein is critical for the microglia to generate their own energy to clear the toxic waste.\nIn mice with Alzheimer’s disease that had the protein genetically removed, the microglia could not produce enough energy to clear the toxic waste, resulting in the disease worsening.\n“We found that microglia lacking the translocator protein resembled damaged microglia observed in ageing and Alzheimer’s disease,” said Prof Barron.\nIn the absence of the translocator protein, the microglia cells produce energy through a second method, using an enzyme known as hexokinase-2. This enzyme binds onto the mitochondrion in the microglia cells. It then converts sugars into energy that can be used for clearing the brain’s waste.\nBut this method was found to be inefficient and prevented the microglia from clearing the waste effectively. The researchers also discovered that this second method was activated when microglia cells were exposed to more toxic forms of brain waste, just as it happens in Alzheimer’s disease.\nThe team said this could help explain how microglia fail in patients with Alzheimer’s and when people age.\nThe researchers then tried to find a way to stop the microglia from using hexokinase-2 to produce energy. They suspected it had something to do with the hexokinase-2’s ability to stick to the microglia cells’ mitochondrion, which they sought to “switch off”.\nTo “switch on and off” this sticking ability easily, the scientists genetically modified microglia cells extracted from mice so that when blue light was shone on them, the hexokinase-2’s sticking ability was turned off.\nThe scientists found that when the enzyme lost its ability to stick to the mitochondrion, the microglia cells were forced to stop using the inefficient method of energy production, improving their ability to clear the waste by nearly 20 per cent.", "url": "https://www.straitstimes.com/singapore/ntu-scientists-discover-how-brain-powers-the-clearing-of-waste-linked-to-alzheimer-s-disease-paving-way-for-possible-treatment"}