{"authors": ["Rei Kurohi"], "date_download": "2024-10-12 13:48:58", "date_modify": "2024-10-12 13:48:58", "date_publish": "2021-10-05 19:55:00", "description": "Fica empowers the authorities to deal with covert attempts by hostile foreign entities to interfere in domestic politics. Read more at straitstimes.com.", "filename": "singapore_politics_5-things-to-know-about-fica-the-law-to-counter-foreign-interference_1728740938.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/10/05/fica-illo.jpg?VersionId=IijBJYseA5Wb_n4wtTyopFxGuQkuhlXv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_5-things-to-know-about-fica-the-law-to-counter-foreign-interference_1728740938.html", "title": "5 things to know about Fica, the law to counter foreign interference", "title_page": "5 things to know about Fica, the law to counter foreign interference | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Parliament passed the Foreign Interference (Countermeasures) Act (Fica) on Monday (Oct 4) after a 10-hour debate.\nHere are five things to know about the law to counter foreign interference.\n1. What is Fica?\nFica is a law to empower the authorities to deal with covert attempts by hostile foreign entities to interfere in domestic politics.\nExamples of such actions include artificially amplifying certain views to manipulate public opinion on hot-button issues, stir up discord and unrest, or undermine confidence in institutions.\n2. Why was it introduced?\nThe Ministry of Home Affairs (MHA) has said foreign interference poses a serious threat to Singapore's sovereignty and national security.\nMany instances of hostile information campaigns being carried out against other countries have been uncovered in the past few years.\nThe need for a law to counter these campaigns was mooted by the 2018 Select Committee on Deliberate Online Falsehoods.\n3. What and who does it target?\nFica targets foreign entities believed to be carrying out hostile information campaigns here, including state actors.\nIt does not target Singaporeans or other local entities that express their views, unless they are being used by foreign entities as proxies for interference, said MHA.\n4. What is the process like?\nFirst, the authorities identify a suspected hostile information campaign believed to be of foreign origin.\nIf they determine that the campaign is directed at a political end and it is in the public interest to take countermeasures, meaning it is necessary or expedient to do so, they can issue directions to stem the spread of disinformation.\nThird parties like online platforms, Internet service providers and website operators can then be compelled to block certain accounts or content in Singapore.\nIdentified culprits can be arrested and prosecuted, but cannot be detained without trial.\nThe Act also sets requirements for certain individuals and entities defined as \"politically significant persons\" (PSPs), including political parties, political office holders, MPs, election candidates and their election agents.\nOthers can also be designated as PSPs if their activities are directed towards a political end, and it is in the public interest for the authorities to apply countermeasures.\nPSPs can be directed to disclose information about donations received, leadership or membership of organisations, and affiliations with foreign entities. Their activities can also be restricted where necessary. Targeted entities can appeal against directions issued under Fica to the Minister of Home Affairs or an independent reviewing tribunal headed by a Supreme Court judge.\n5. What concerns have been raised and what were the responses?\nSome have expressed concern that Fica could have a chilling effect on legitimate entities such as academics studying controversial issues and foreigners expressing opinions on Singapore politics.\nIn response, MHA has said the law will not be applied against most academic activities including collaborating with others overseas, writing for international journals and receiving international funding.\nFica is also not intended to target foreigners who comment on local matters in an open and transparent fashion, the ministry said.\nThe Workers' Party (WP) and other commentators have argued that the broad language of Fica opens up the possibility of abuse, including by a future government.\nSpeaking in Parliament, Law and Home Affairs Minister K. Shanmugam said there are indeed trade-offs between the need to enable the Government to act effectively when necessary and to have checks against abuse.\nHe noted that equivalent laws in other countries like Australia and the United States have even broader definitions, and that such laws must enable governments to deal with a wide range of threats.\nAt the same time, there are clear conditions that need to be met before Fica can be applied.\n\"(Fica) represents the best balance that we can find between dealing with the risks and providing checks against abuse,\" he said.\nThe WP also said the Act restrains judicial oversight as it is not possible to challenge directions through a judicial review.\nBut Mr Shanmugam said the court process is unsuitable for dealing with foreign interference, given that the process may involve highly sensitive intelligence and that any leaks could have serious consequences.\nAnother concern is that Fica has been rushed through Parliament without being subjected to public consultation or scrutiny by a Select Committee.\nTo this, Mr Shanmugam said the issue of foreign interference has been discussed extensively for more than three years in Parliament, public forums and the media. Most people agree that the threat is serious and something needs to be done, he said.", "url": "https://www.straitstimes.com/singapore/politics/5-things-to-know-about-fica-the-law-to-counter-foreign-interference"}