{"authors": ["Natasha Ann Zachariah"], "date_download": "2024-10-12 14:20:02", "date_modify": "2024-10-12 14:20:02", "date_publish": "2023-09-29 22:32:03", "description": "The move, which comes as price hikes add to cost pressures, is designed to cushion the impact Read more at straitstimes.com.", "filename": "singapore_timely-targeted-support-package-that-will-provide-some-relief-to-those-in-need-experts_1728742802.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/29/2023080884209904048a1617.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_timely-targeted-support-package-that-will-provide-some-relief-to-those-in-need-experts_1728742802.html", "title": "Timely, targeted $1.1b support package will provide some relief to those in need: Experts", "title_page": "Timely, targeted $1.1b support package will provide some relief to those in need: Experts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The $1.1 billion support package announced on Thursday is a timely move, given the latest price hikes that add to cost of living pressures, and it is designed to cushion the impact for those in need, said economists and analysts.\nThe Cost-of-Living Support Package includes an additional cash payout of up to $200 for 2.5 million Singaporeans, and an extra $200 in Community Development Council vouchers for every Singaporean household. There are also rebates for service and conservancy charges and public transport vouchers.\nThis financial relief will benefit lower- and middle-income families in particular as costs continue rising, the experts said.\nOver the past two weeks, price hikes to public transport fares, water, and electricity and gas have been announced.\nThese come alongside rising food and energy prices, and inflation globally. The goods and services tax (GST) will also be raised to 9 per cent next year, after going up from 7 per cent to 8 per cent this year.\nMs Yun Liu, Asean economist at HSBC, said the package was a swift response to recent upward pressures to inflation, and targeted at pensioners, lower-income families and eligible HDB households.\n“For the ad-hoc fiscal packages in (the 2022 and 2023 financial years), the Government seeks to provide some fiscal relief, but (it’s) mostly targeted in nature to offset the rising cost of living for those in greater need, while at the same time allowing Singapore to remain firmly on track of its fiscal consolidation path.”\nMs Nydia Ngiow, managing director of policy advisory firm BowerGroupAsia’s Singapore office, said the announcement shows how the Government can “react nimbly to situations that are not planned for, while it continues to stand firm on increasing the GST next year”.\nShe anticipates that MPs will continue questioning the Government in Parliament on what else it intends to do to deal with the rising cost of living in a more sustainable manner.\nMr Song Seng Wun, Singapore economic adviser at CGS-CIMB Securities Singapore, was surprised that a support package was announced now, given the next Budget is around the corner in February 2024.\nHe said it suggests that the Government is confident of funding the package due to better-than-expected revenue collected, so much so that it is able to announce this halfway through its fiscal year.\n“From a political standpoint, it shows that the overall fiscal position of the Government is strong enough to be able to give some back a bit earlier, before the Budget.”\nDeputy Prime Minister and Minister for Finance Lawrence Wong, who announced the measures on Thursday, said there was no need to dip into past reserves for this package.\nSingapore University of Social Sciences associate professor Walter Theseira noted that the Government’s practice has been to provide grants to offset the rising cost of living when it is able to do so. He added that he does not expect such relief packages to be handed out as often as they have been in the past few years if the economy is fairly stable and inflation has been tamed.\n“Singapore has had an extremely benign inflation environment for quite a while, so nobody has recent memory of what happens to the economy and prices during high inflation,” said Prof Theseira, who teaches economics.\n“We are now living through a period of very large price changes. Because of the difficulties people are having coping, expectations are high that the Government needs to step in.”\nDr Mustafa Izzuddin, a senior international affairs analyst at Solaris Strategies Singapore, said the country may have to brace itself for a difficult period, given the global state of affairs, including the ongoing war in Ukraine and geopolitical contestations between the United States and China. As such, it is “imperative for the Government to prepare society early enough through targeted assistance in order to offset potential increases in the domestic cost of living,” he said.\nDr Mustafa believes that these ad-hoc packages will likely be rolled out again as it avoids turning Singapore into a welfare state while, at the same time, helping those in need.\nHe also pointed out that the Government has been looking out for the well-being of Singaporeans in a prudent manner.\n“This is being done through targeted financial packages that balance self-reliance, couched in terms of personal responsibility, with trampoline safety nets to boost social mobility.”", "url": "https://www.straitstimes.com/singapore/timely-targeted-support-package-that-will-provide-some-relief-to-those-in-need-experts"}