{"authors": ["Wallace Woon"], "date_download": "2024-10-12 13:28:58", "date_modify": "2024-10-12 13:28:58", "date_publish": "2023-03-09 16:42:58", "description": "Both men were arrested for offences that include fighting in a public place. Read more at straitstimes.com.", "filename": "singapore_two-men-arrested-after-bloody-brawl-in-geylang-coffee-shop_1728739738.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/09/aigeylang0903.JPG?VersionId=PIQkzhYuKPnlH3RIsl6ppyruzW6mgNm5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_two-men-arrested-after-bloody-brawl-in-geylang-coffee-shop_1728739738.html", "title": "Two men arrested after bloody brawl in Geylang coffee shop", "title_page": "Two men arrested after bloody brawl in Geylang coffee shop | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Two men who got into a brawl that left a trail of blood in a Geylang coffee shop on Wednesday morning have been arrested.\nOne of them, a 32-year-old, was taken to Tan Tock Seng Hospital, said a Singapore Civil Defence Force spokesman.\nThe man was later arrested for offences that included fighting in a public place and suspected drug-related offences.\nIn response to queries, the police said the second man, aged 37, was also arrested for affray, or fighting in a public place, and disturbing the peace.\nThe police said they were alerted at 8.10am to the incident in Lorong 17 Geylang.\nThe fight took place before businesses in the area were open, reported Chinese-language news outlet Shin Min Daily News.\nA worker at a nearby bak kwa (barbecued meat) store, who declined to be identified, said he saw many police officers gathered in the area when he reached the shop at 9am, the Shin Min report added.\nBlood could be seen on tables, the floor and a sink in the coffee shop, Shin Min reported.\nPolice investigations are ongoing.", "url": "https://www.straitstimes.com/singapore/two-men-arrested-after-bloody-brawl-in-geylang-coffee-shop"}