{"authors": [], "date_download": "2024-10-12 13:45:01", "date_modify": "2024-10-12 13:45:01", "date_publish": "2019-03-05 12:05:06", "description": "MOE will start full subject-based banding in about 25 schools in 2020 and progressively apply it to all secondary schools. We answer some key questions. Read more at straitstimes.com.", "filename": "singapore_education_will-there-still-be-secondary-five-and-other-questions-answere-as-streaming-is_1728740701.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/03/05/jtedu050319.jpg?VersionId=dnI5n9bRnk_kXmd2BnfxWVpvvQtt5Kfc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_education_will-there-still-be-secondary-five-and-other-questions-answere-as-streaming-is_1728740701.html", "title": "Streaming into Normal and Express in secondary schools to stop in 2024: 8 things to know", "title_page": "Streaming into Normal and Express in secondary schools to stop in 2024: 8 things to know | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Ministry of Education (MOE) will do away with the Normal (Technical), Normal (Academic) and Express streams in secondary schools by 2024.\nInstead, there will be full subject-based banding, in which students will take up subjects at higher or lower levels, based on their strengths.\nThe ministry will start full subject-based banding in about 25 schools next year and progressively apply it to all secondary schools, Education Minister Ong Ye Kung said in Parliament on Tuesday (March 5) during the debate on the ministry's budget.\nHere is what you need to know:\n1. Will schools continue to organise students into form classes based on academic bands?\nWith full subject-based banding, students will take each subject at a level suited to their ability. The ministry said it expects to see more students taking combinations of subjects at different levels, unlike today where most students take subjects at the level of their \"stream\". This gives schools a chance to reconstitute their form classes in different ways.\nDoing so will allow students of different backgrounds to grow and learn together, form deeper friendships and work well together. The pilot schools will be trying out new ways of organising students in both form and subject classes. Best practices can be adopted by more schools later on.\n2. If my child is doing well academically, will he or she be disadvantaged now that the form class has students of different abilities?\nStudents doing well academically will not be disadvantaged, said MOE.\nFor each subject, students will be taught in subject classes based on their ability levels. Students in the same subject class are already assessed to be able to study that subject at the same level, whether G1, G2 or G3 - so there will not be a major gap in learning abilities.\nWithin the same class, teachers will also further differentiate their teaching to meet the needs of the class, which is no different from today. Each student will still be challenged to learn based on his or her individual pace.\n3. How will the secondary school posting system change?\nMr Ong said MOE has decided that it is better not to disrupt the current posting system. This means that secondary schools should continue to admit students across three PSLE scoring bands, even though the streams have been merged.\n\"PSLE still serves as a useful initial gauge of the subject bands that each student is most suited for at the beginning of Sec 1. So students admitted in the first PSLE scoring band will initially take mostly G1 subjects, those in the second PSLE scoring band will take mostly G2 subjects, and those in the third take mostly G3 subjects. Admitting students across three PSLE score bands will allow schools to offer subjects of all bands,\" said Mr Ong.\nOnce they enter secondary school, the students can discover and further develop their strengths and interests, and full subject-based banding will allow them to take a combination of subjects across different bands.\nThere is also an important social consideration, he explained.\n\"Admitting students from different PSLE scoring bands into the same secondary school will ensure that our students get to make friends from diverse backgrounds. Indeed, one of the key objectives of education is forging a cohesive society.\"\n4. If students can customise their education under full subject-based banding, why do we still need to post students into secondary schools across three scoring bands, which seems similar to streaming?\nThe transition from Primary 6 to Sec 1 is significant for all students. Thus, it is important to ensure that students learn successfully by taking subjects suited to their learning pace and needs, said MOE.\nStudents' PSLE scores still serve as a useful gauge of the pace of learning that students are most suited for at the beginning of Sec 1. But this is just at the point of admission to Sec 1 to match the suite of subjects to the students' ability then.\nBeyond Sec 1, with full subject-based banding, students will be able to take more subjects at a different or more demanding level, depending on how well they do for those subjects. It will also give students more opportunities to interact and forge friendships with peers from different backgrounds.\n5. Will there still be Sec 5?\nBy 2024, all students enrolling into Sec 1 will go through a four-year curriculum for all subject bands.\n\"At the end of Sec 4, in 2027, these students will attain the common certificate with various subject permutations - six G3 subjects and one G2 subject, or five G3 and two G2, or two G3, three G2 and one G1, and so on,\" said Mr Ong.\n\"This will require us to undertake a review of our post-secondary posting system, so that students taking a combination of G1, G2 and G3 subjects can be fairly considered for ITE, polytechnics and JCs. Our review will recognise students' particular strengths that make them suitable for specific post-secondary courses.\"\nAs 2024 is a few years away, Mr Ong said the ministry will use this time to undertake this review.\nMOE will also explore other alternatives to a fifth year in secondary schools, which may be like the Polytechnic Foundation Programme that helps students who have completed their secondary school education enter polytechnics or JCs.\n6. Are teachers able to manage the teaching load and give every student the attention he or she needs?\nWhile the introduction of subject-based banding has led to a slight increase in the overall teaching load, schools have successfully piloted new measures to implement the banding system in a way that is both effective and sustainable.\nFor example, schools may band classes for timetabling together, so that subject-based banding students can join subject classes at the more demanding level.\nSchools also leverage the Student Learning Space to provide bridging support to subject-based banding students. This ensures teachers do not work significantly longer hours and can perform at their best.\nStill, teachers may have to use different teaching styles to engage the students from different scoring bands. Teachers are trained to handle diversity within their classes and to bring out the best in every child.\nMOE will continue to support teachers by providing them with resources and additional professional development to help them manage the wider range of students with full subject-based banding.\n7. How will admission to post-secondary education institutions change under full subject-based banding?\nAdmission to these institutions already recognises the efforts of students who take out-of-stream subjects.\nMOE will conduct a longer-term study on how admission to these institutions should be adjusted to complement the roll-out of full subject-based banding, to achieve the best educational outcomes for students. Refinements to the admission criteria for JCs, polytechnics and the ITE will be announced separately later.\n8. What will happen to specialised schools like Spectra and Crest?\nSpectra and Crest currently take in only N(T) students.\nSchools with specialised programmes, such as NUS High School, the School of Science and Technology, and Integrated Programme schools, take in only Express students.\nWill MOE mandate that they take in students across three PSLE bands? Mr Ong said there is value in having certain schools with specialised programmes.\n\"Every education system in the world will have schools that cater specifically to different segments of learners, such as those with high academic ability, strengths in specific areas, or who prefer a more technical education,\" he said.\nBut he admitted that the downside is the lack of mixing in these more specialised schools.\nHe said they must make a special effort to recruit students from all backgrounds, including through Direct School Admissions.\n\"They will have to ensure that students participate actively in inter-school mixing opportunities, such as combined schools CCAs, Outward Bound School camps, and Values-in-Action projects. I can see many of the principals from the specialised schools working very hard to do better in this aspect.\"\nAt the same time, there is also scope for these specialised schools to offer more subject options. Spectra and Crest, he said, should offer more N(A) compared to today, and could possibly also offer a few Express-level subjects.\n\"Similarly, in time, it will also make sense for the schools that take in only Express students to offer some subjects at the N(A) or N(T) level,\" said Mr Ong. \"After all, customisation of education, and catering more flexibly to the varied interests and abilities of students, will benefit them.\"", "url": "https://www.straitstimes.com/singapore/education/will-there-still-be-secondary-five-and-other-questions-answere-as-streaming-is"}