{"authors": ["Elaine Lee"], "date_download": "2024-10-12 13:29:10", "date_modify": "2024-10-12 13:29:10", "date_publish": "2023-10-26 18:26:00", "description": "Those who have fallen for the scam are advised to make a police report. Read more at straitstimes.com.", "filename": "singapore_beware-of-phishing-e-mails-asking-taxpayers-to-view-property-tax-notices-via-wetransfer-iras_1728739750.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/26/yuirasscam.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_beware-of-phishing-e-mails-asking-taxpayers-to-view-property-tax-notices-via-wetransfer-iras_1728739750.html", "title": "Beware of phishing e-mails asking taxpayers to view property tax notices via WeTransfer: Iras", "title_page": "Beware of phishing e-mails asking taxpayers to view property tax notices via WeTransfer: Iras | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Do not click on a URL link purportedly from the Inland Revenue Authority of Singapore (Iras) claiming that your property tax notice is ready for viewing via WeTransfer, the government agency said in an advisory on Thursday.\n“This is a new phishing scam where fraudsters spoof Iras’ identity to trick users into clicking a suspicious URL link,” said Iras, adding that it does not send any notices to taxpayers through WeTransfer via unsecured e-mails.\n“All tax transactions and notices are deposited on mytax.iras.gov.sg. myTax Portal is a secured and personalised portal for you to view and manage your tax transactions with Iras. SingPass authentication is also required before you can perform any transactions.”\nIn the e-mail, a recipient’s company site and tax reference number are indicated and one is required to view the property tax notice on the fake myTax Portal link sent via WeTransfer.\nThe tax authority advised the public to ignore the e-mails and not click on any suspicious URL link. It also urged the public not to provide any personal, credit card or bank account details to make payments or follow any instructions in the e-mail.\nThose who have fallen for the scam are advised to make a police report.", "url": "https://www.straitstimes.com/singapore/beware-of-phishing-e-mails-asking-taxpayers-to-view-property-tax-notices-via-wetransfer-iras"}