{"authors": ["Kok Yufeng", "Esther Loi"], "date_download": "2024-10-12 13:53:13", "date_modify": "2024-10-12 13:53:13", "date_publish": "2024-09-04 23:30:00", "description": "The code will spell out what ride-hail and delivery platforms should do to improve worker safety and health. Read more at straitstimes.com.", "filename": "singapore_public-feedback-sought-on-proposed-safety-code-for-platform-workers_1728741193.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/20210911516797130e4a2856.jpg?VersionId=HUDzUz2nTFJPhmPAFFeejt_LuNszNavi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_public-feedback-sought-on-proposed-safety-code-for-platform-workers_1728741193.html", "title": "Public feedback sought on proposed safety code for platform workers", "title_page": "Public feedback sought on proposed safety code for platform workers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Ride-hailing and delivery platforms that impose time limits on workers for reaching pick-up points or completing deliveries of food or goods will soon be expected to cease such practices.\nThese online platforms should also remind workers to take safety precautions during bad weather and not penalise them for it, under a proposed industry code of practice that aims to set safety and health standards for platform workers and operators.\nThe draft code, which provides practical legal guidance, has been put up for public feedback from Sept 4 to 30 by the Workplace Safety and Health (WSH) Council, a statutory body under the Ministry of Manpower (MOM).\nPlatform workers are defined as delivery workers, private-hire car drivers and taxi drivers who use online matching platforms, like Grab, foodpanda and Lalamove, to provide transport and delivery services.\nThe draft code also sets out the responsibilities that such workers have in ensuring their own health and safety, stating that platform workers should also not forsake safety for monetary incentives.\nFor instance, they should ask for help to split loads that are unmanageable. Should the workers decline to take up loads that are too heavy, platforms would be expected to compensate them for the time they spend travelling to the pick-up location.\nMOM said the new code of practice will account for the unique features of platform work, addressing specific risks like fatigue, vehicle safety and the carrying of excessive loads, while also covering standard workplace safety and health requirements, such as risk assessment and risk management.\nAfter the public consultation to gather feedback, the code will be finalised and gazetted. The draft code can be found on the WSH Council’s website.\nThe move comes as Parliament prepares to debate a new Bill next week that will strengthen protection for platform workers and designate them as a separate category of workers under the law, distinct from employees and the self-employed.\nAccording to MOM’s latest labour force report released in January, there were 70,500 platform workers in Singapore in 2023.\nThe WSH Council said platform operators and platform workers both have a duty under the Workplace Safety and Health Act to take reasonably practicable measures to ensure worker safety and health.\nThe new code of practice aims to provide clarity and strengthen ownership over these legal responsibilities, it said.\nUnder the Workplace Safety and Health Act, failing to observe an approved code of practice does not constitute a criminal offence in itself. But prosecutors can use the code to prove whether a workplace safety and health violation has been committed.\nGiven the time that platform workers spend on the road and the physical nature of their jobs, they are at a higher risk of injury.\nA 2022 poll found that a third of food delivery workers here have been in at least one accident that required medical attention.\nDelivery riders interviewed by The Straits Times had mixed reactions to the code of practice.\nMr Jayler Ang, 25, a part-time delivery rider who completes orders on a bicycle, said carrying heavy loads can be very dangerous for cyclists and motorcycle riders, which is why he welcomed measures allowing such loads to be split across multiple trips or multiple riders.\nHowever, full-time delivery worker Peter Yeo, 52, said this would help only if riders are properly compensated.\nThe proposed code also encourages platform operators to establish fatigue management measures to ensure platform workers remain alert while on the job. These include sending rest reminders to platform workers to take breaks if they drive beyond a certain duration.\nMr Ang said pop-up notifications reminding them to take a break would be useful to some extent, as delivery work can be physically and mentally exhausting, with riders spending at least eight hours on the roads each day, always racing against time.\nMr Yeo, however, doubts the effectiveness of such reminders, suggesting instead that delivery workers be forced to rest for an hour before they are allowed to resume their shifts if they have been online for four hours or more.\nHe said it would also be good if platforms gave riders more time to complete deliveries under bad weather conditions, and suggested that operators go a step further by temporarily pausing orders when there is heavy rain or severe lightning risk.", "url": "https://www.straitstimes.com/singapore/public-feedback-sought-on-proposed-safety-code-for-platform-workers"}