{"authors": ["Andrew Wong"], "date_download": "2024-10-12 13:28:57", "date_modify": "2024-10-12 13:28:57", "date_publish": "2024-03-01 12:39:43", "description": "The collective impact hub, which will be named The Foundry, will be housed in the three-storey building by the end of 2024. Read more at straitstimes.com.", "filename": "singapore_politics_former-elections-department-building-to-become-social-enterprises-hub_1728739737.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/01/2024030182508257gin9918.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_former-elections-department-building-to-become-social-enterprises-hub_1728739737.html", "title": "Former Elections Department building to become social impact hub", "title_page": "Former Elections Department building to become social impact hub | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Non-profit organisations and social enterprises will have a common space to work together and encourage civic participation in Singapore by the end of 2024.\nThe collective impact hub, which will be named The Foundry, was set up in partnership with registered charity The Majurity Trust (TMT), Tote Board and the Singapore Government Partnerships Office.\nSpeaking in Parliament on March 1, Senior Parliamentary Secretary for Law Rahayu Mahzam said the Singapore Land Authority (SLA) plays a key role in helping to optimise land resources, and not just for economic development.\nShe said: “We also recognise that spaces play an important role in forging social cohesion and promoting social good in our community.”\nMs Rahayu was responding to questions raised during the debate on the Ministry of Law’s budget.\nSLA manages around 11,000ha of state land and 2,600 properties.\nLocated at 11 Prinsep Link, The Foundry will be housed in the three-storey building that served as the Elections Department office building for nearly 25 years, until 2019.\nThe Prinsep Street site was where the Returning Officer, whose duties included overseeing the conduct of polls and directing election officials, announced the results of each election since 1994.\nThe last result announced at the site was the 2017 presidential election, where Madam Halimah Yacob ran unopposed.\nThe building, which spans over 17,000 sq ft, is currently being used to host an immersive exhibition on the life of Singapore’s founding prime minister Lee Kuan Yew.\nMs Rahayu said the building will be repurposed to become the base for social organisations, which can help facilitate the gathering of non-profit start-ups and social sector partners.\nShe said: “Bringing these partners together in a common space will create strong synergies to encourage civic participation.”\nShe added that SLA has launched a tender at the former Kampong Chai Chee Community Centre for the creation of a new space for social activities and interaction among communities.\nTMT chief executive Martin Tan told The Straits Times that non-profit organisations and social enterprises often face complex and multifaceted community issues.\nHe said: “Yet, many struggle on their own. They are often siloed, under-resourced and lack proximity access to critical support needed to succeed.”", "url": "https://www.straitstimes.com/singapore/politics/former-elections-department-building-to-become-social-enterprises-hub"}