{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:29:19", "date_modify": "2024-10-12 13:29:19", "date_publish": "2024-07-12 16:21:20", "description": "The Health Ministry is also working to increase cohort sizes in local nursing schools. Read more at straitstimes.com.", "filename": "singapore_nursing-education-boosted-to-create-opportunities-for-nurses-in-their-career-ong-ye-kung_1728739759.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/Azmi-junurse12-5.JPG?VersionId=FPGhjopd4AoyN3soEUP7iO0j0QTEiA2B", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_nursing-education-boosted-to-create-opportunities-for-nurses-in-their-career-ong-ye-kung_1728739759.html", "title": "New tertiary courses to help boost skills of nurses throughout their careers: Ong Ye Kung", "title_page": "New tertiary courses to help boost skills of nurses throughout their careers: Ong Ye Kung | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Local tertiary institutions are launching new courses in 2024 to improve the education and training of nurses, even as the Ministry of Health (MOH) is working with them to create opportunities for nurses to enhance their skills and continue learning throughout their career.\nHealth Minister Ong Ye Kung announced this at the 2024 Nurses’ Merit Award ceremony on July 12.\nThe ministry is also working to increase cohort sizes in the nursing schools at the Institute of Technical Education (ITE), polytechnics and universities, he said.\n“It cannot be a big jump, but it should be an addition that helps fulfil the wishes of our students who want to become nurses. Even so, it will continue to be an attractive and competitive course of study,” he said.\nThe National University of Singapore will be launching two new postgraduate programmes in August.\nThe graduate certificates in Integrated Health and Critical Care Nursing are work-study programmes, which could take between 1½ years and 4½ years to complete. They give nurses the opportunity to develop their professional competencies through on-the-job training at the workplace, while concurrently advancing their professional development.\nTo nurture a practice-ready nursing workforce, the Singapore Institute of Technology is starting in September a new five-year integrated Bachelor of Science in Nursing – Master of Science in Nursing programme.\nGraduates will have to go through a three-year bachelor’s-level study followed by a two-year master’s-level study to prepare them for specialist nursing roles and groom them to be future nursing leaders.\nThey can go for further training in one of four specialisations: medical or surgical; high acuity care, which is short-term care provided to patients who need special supervision while recovering from a serious illness or injury; perioperative nursing; and community care nursing.\nIn October, a three-year work-study diploma in nursing will begin at ITE, giving enrolled nurses who are working the opportunity to obtain a nationally recognised diploma and take on more complex nursing tasks as registered nurses.\nITE has already replaced its two-year National ITE Certification (Nitec) in Nursing programme with a three-year Higher Nitec, which enhances the capabilities and knowledge of enrolled nurses to undertake an expanded scope of practice.\nMr Ong told healthcare professionals at the ceremony to never believe the assertion that nobody wants to join nursing.\nHe said about one in 25 students will end up studying nursing, and every year during application season, he and other MPs get numerous appeals from Singaporeans who want to get into nursing but could not.\n“Last year, we set a national target to hire 4,000 new nurses, after experiencing high attrition in 2021 and 2022 due to Covid-19 (when) many of our nurses were poached. We have since turned the tide.”\nPCN is a network of GPs supported by nurses and care coordinators, which provides holistic and coordinated care to patients with chronic conditions such as diabetes, hypertension and high cholesterol. This team-based care approach ensures patients are better cared for in the community.\nA nurse by training, Ms Chioh, 62, was seconded from AIC in 2012 to work with general practitioners in private practice on the PCN concept.\nShe helped to develop the training frameworks and competency roadmaps that empowered nurses with the necessary skills and knowledge to adapt to the evolving demands of primary care.\n“I (worked) for 12 years to understand the challenges faced by both the GPs and nurses before we could build a team successfully for PCN. Many of the nurses hailed from different parts of hospitals – emergency departments, operating rooms and wards,” she told The Straits Times.\n“The challenges they face in primary care would then be different from what they know. To help them, we built training frameworks and SOPs (standard operating procedures) for them (to) understand the fundamentals when managing chronic diseases such as diabetes, high cholesterol and high blood pressure,” she said.\nToday, there are 10 PCNs that duplicate what Ms Chioh started with nine Frontier GP clinics.\nAnother recipient who played a critical role in educating the next generation of nurses was Ms Maslinna Abdul Rahman, 39, a nurse clinician at the Singapore General Hospital.\nAs a faculty and module lead, she was instrumental in establishing the Master of Health Sciences – Organ Transplant Nursing, which was originally a renal transplant nursing course at the hospital. It has evolved into a master’s programme for nursing students specialising in solid organ transplant nursing.\n“This award serves as a tangible symbol of success. I still feel I have so much more to work on in the aspects of advancing clinical nursing and also in education to novice nurses,” she said.\nMs Chioh and Ms Maslinna were among the 150 nurses from various care settings spanning the community care sectors who received the Nurses’ Merit Award from Mr Ong.\nStarted in 1976, the award is presented to nurses who have displayed noteworthy and exceptional performance, participated in professional development, and contributed to raising the nursing profession.\nThe nurses are nominated for the award by their healthcare institutions and selected by a panel set up by MOH.\nCorrection note: This story has been edited for clarity.", "url": "https://www.straitstimes.com/singapore/nursing-education-boosted-to-create-opportunities-for-nurses-in-their-career-ong-ye-kung"}