{"authors": ["Sarah Koh"], "date_download": "2024-10-12 14:21:22", "date_modify": "2024-10-12 14:21:22", "date_publish": "2023-04-22 17:17:22", "description": "This visit is the latest in a series of exchanges between Singapore and Johor since borders reopened in April 2022. Read more at straitstimes.com.", "filename": "singapore_grace-fu-tan-see-leng-attend-johor-sultan-s-hari-raya-open-house-after-3-year-break-caused-by-covid-19-pandemic_1728742882.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/25/MFA06305.JPG?VersionId=b.18YBSos4WlHmfYg6pKKBWAlq3Yiudt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_grace-fu-tan-see-leng-attend-johor-sultan-s-hari-raya-open-house-after-3-year-break-caused-by-covid-19-pandemic_1728742882.html", "title": "S’pore ministers attend Johor Sultan’s Hari Raya open house after 3-year break due to Covid-19", "title_page": "S’pore ministers attend Johor Sultan’s Hari Raya open house after 3-year break due to Covid-19 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore leaders on Saturday resumed the annual tradition of attending the Hari Raya open house hosted by Johor Sultan Ibrahim Iskandar after a three-year break due to the Covid-19 pandemic.\nMinister for Sustainability and the Environment Grace Fu and Manpower Minister and Second Minister for Trade and Industry Tan See Leng attended the open house at Istana Bukit Serene in Johor Bahru, the residence of Sultan Ibrahim.\nThe two Cabinet ministers had an audience with the Sultan, after which they had lunch with him, Johor Queen Raja Zarith Sofiah and members of the royal family.\nIn a statement on Saturday, the Ministry of Foreign Affairs (MFA) said the visit is a reaffirmation of the longstanding and warm ties between Singapore and Johor, and the latest in a series of high-level exchanges between both sides since the border reopened in April 2022.\nMs Fu and Dr Tan were accompanied by officials from MFA, the Ministry of Trade and Industry, and the Ministry of Sustainability and the Environment.", "url": "https://www.straitstimes.com/singapore/grace-fu-tan-see-leng-attend-johor-sultan-s-hari-raya-open-house-after-3-year-break-caused-by-covid-19-pandemic"}