{"authors": ["Wallace Woon"], "date_download": "2024-10-12 14:17:18", "date_modify": "2024-10-12 14:17:18", "date_publish": "2022-11-25 19:09:13", "description": "About 100 shoppers were seen queueing outside the Courts flagship store before doors opened. Read more at straitstimes.com.", "filename": "singapore_consumer_black-friday-deals-draw-shoppers-looking-to-save-money-amid-inflation-looming-gst-hike_1728742638.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/25/markfriday20_6.JPG?VersionId=KQwqe_hmK7s.wQ90RMk4oNFP9OhuBSMJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_consumer_black-friday-deals-draw-shoppers-looking-to-save-money-amid-inflation-looming-gst-hike_1728742638.html", "title": "Black Friday deals draw shoppers looking to save money amid inflation, looming GST hike", "title_page": "Black Friday deals draw shoppers looking to save money amid inflation, looming GST hike | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Shoppers were out in full force on Black Friday to snap up deals at department stores, in order to better stretch their dollar amid inflation and the impending hike in goods and services tax (GST) in 2023.\nLeaving the Metro Paragon outlet with two bags of bedsheets and towels was retiree Annie Lim, 70, who said: ”Things are not cheap now, so I want to save where I can. It cost me $25 for a set of five towels. The quality is pretty good, and I’ll be giving them away to my siblings for Christmas.”\nMadam Lim, who used to work in the service industry, added: “I’m buying the bedsheets for myself. I have a bed in my daughter’s home, so these new ones will be going there.”\nThe Straits Times visited the Metro Paragon outlet, Courts Nojima at The Heeren and Tangs at Tang Plaza on Friday.\nBlack Friday is the day after the United States holiday of Thanksgiving, which is typically celebrated on the fourth Thursday of November. It is regarded as the first day of the Christmas shopping season, when retailers make many special offers.\nLured by vouchers, gifts and cash rebates of up to $2,500, around 100 shoppers were spotted queueing outside the Courts flagship store before doors opened at 11am on Friday.\nNear the front of the queue was Mrs Teo Bee Leng, 53, who said she had reached the store around 10.15am with her two sons in tow. She was attracted by a 43-inch HD television set on sale for $299, around half of its original retail price.\n“Where else can you find such a good deal? I tried looking online during the 11.11 sales, but I don’t remember seeing anything like this,” said the housewife.\nForking out around $14,000 on a mattress, fridge, washer, dryer, dishwasher and speakers for her new home was 34-year-old educator Natalie Quah.\nMrs Quah said: “The mattress is usually about $8,000, but we paid less than $6,000. On top of the discount, we got quite a few freebies such as pillows, mattress protectors and a big air purifier and other brand vouchers, which I will use for groceries. I think, in total, we saved at least $5,000.”\nShe added that she and her husband had decided to take advantage of the Black Friday sales in order to avoid the upcoming GST hike and because of the store’s policy of allowing the items to be delivered at a later date.\n“Even if there’s a better price online, we can’t take delivery now, and online stores don’t offer gifts or extended warranties,” said Mrs Quah. “We also have more assurance about where our product was manufactured by buying in-store.”\nOver at the Tangs department store, shoppers crowded the basement level, which stocks cookware and kitchen appliances.\nIT professional Ernest Neo, 42, who was browsing for cast iron cookware, said he was attracted by the heavy discounts on some of the items on sale.\n“I enjoy cooking but, even then, I normally would not think of buying one of these pots... because they are too expensive. But I might consider getting one now because it’s around $300 cheaper,” he said.\nResponding to queries from The Straits Times, Mr Erwin Wuysang-Oei, head of marketing and e-commerce at Metro, said: “As a retailer, we are fully aware of macroeconomic uncertainties surrounding the global outlook, with inflation, rising electricity prices and uncertainty as a result of the prolonged war in Ukraine.\n“And on the domestic front, we are faced with high inflation and an upcoming increase next year in GST.”\nA spokesman for Courts Nojima said the store has focused on providing promotions on products such as home appliances, IT equipment and furniture, which it believes consumers will gravitate towards in the light of the upcoming GST increase.", "url": "https://www.straitstimes.com/singapore/consumer/black-friday-deals-draw-shoppers-looking-to-save-money-amid-inflation-looming-gst-hike"}