{"authors": ["Salma Khalik"], "date_download": "2024-10-12 13:56:09", "date_modify": "2024-10-12 13:56:09", "date_publish": "2023-12-22 18:30:00", "description": "The health minister also added that a mask mandate was not needed. Read more at straitstimes.com.", "filename": "singapore_covid-19-wave-probably-peaked-but-slight-surge-possible-ong-ye-kung_1728741369.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/22/IMGyaohui-pixcovid28-88110R64CHR.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_covid-19-wave-probably-peaked-but-slight-surge-possible-ong-ye-kung_1728741369.html", "title": "Covid-19 wave probably peaked, but slight surge possible: Ong Ye Kung", "title_page": "Covid-19 wave probably peaked, but slight surge possible: Ong Ye Kung | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The current Covid-19 wave may have peaked, said Health Minister Ong Ye Kung, as the latest data shows three straight days of falling infection numbers.\nWhile having 600 to 700 hospital beds now occupied by Covid-19 patients has put a strain on Singapore’s 10,000-bed-strong healthcare system, there is no need to mandate mask wearing, he said at the opening of Woodlands Health, a facility that has both acute and community hospitals sharing the same building.\nWhile the seven-day moving average showed 6,060 infections on Dec 20, down from a high of 7,870 on Dec 12, the number of people who were seriously ill after being infected with the virus continued to rise.\nThis has resulted in a record number of hospital and intensive care unit (ICU) admissions for Covid-19 infections for the year.\nIn the week ending Dec 16, another 965 people were admitted to hospital with Covid-19, up from 763 the previous week.\nPatients who were admitted to ICU also rose from 23 the previous week to 32 last week.\nBoth types of admissions were the highest recorded weekly numbers for the year – and almost double the high during the infection wave in April.\nThe lowest for 2023 was 53 hospital admissions and zero ICU admissions in a week.\nFor the latest week, an average of 560 people were in hospital on any one day, including some children aged 11 years and younger.\nIn the past month, no child needed ICU care because of Covid-19.\nExperts say hospitalisation and the need for intensive care always lag infections, which have been rising for four weeks running – from 10,726 infections in the week of Nov 12-18, to 58,300 in the week of Dec 10-16.\nAssociate Professor Alex Cook of the National University of Singapore’s Saw Swee Hock School of Public Health warned: “We have to remember that severe cases will typically peak after the mild cases peak, so even if the peak cases have already come, we may need to wait a while before the impact on the healthcare system starts to get better.”\nHe also said that greater mixing and mingling over the Christmas and New Year weekends may see the number of infections going up.\n“Just because the cases dipped does not yet mean the wave has peaked, and the wave isn’t over until cases have come down again.”\nWhile Mr Ong also warned of a possible “slight surge” with the coming year-end festivities, he is confident that this wave is now under control.\nHe said many people have asked him to reinstate the mandate to wear masks, especially on public transport.\nIf it is necessary to do so, Singapore will mandate it, he said, but for this wave, “we can withstand this without additional safe-distancing measures”.\nHe added: “But we appeal to everyone, when you are sick, do wear a mask, do stay at home.\n“If you have to come into contact with someone, then wear a mask.”\nMr Ong again stressed the importance of being up to date with Covid-19 vaccination, “at least once a year, especially if you are senior, and have underlying conditions”.\nHe said this is necessary because the effect of the vaccine wears off in about one to 1½ years.\nTo make it easier for people to get their vaccine, he said the strategy needs to change since few people would want to go to a dedicated centre for their jabs, now that Covid-19 is endemic.\nInstead, he plans to get more general practitioners to provide the vaccine.\nHe wants as many seniors as possible to keep up to date with their vaccination, “so that next year, if we have another wave – and we will – we will be much more prepared”.\nMr Ong also touched on the Covid-19 Resilience Medals given to over 110,000 pandemic heroes.\n“Unfortunately, we hear of people selling their medals. I think it’s a small, small minority.\n“I would say it is wrong to sell. It is with great appreciation and respect that we selected the names and confirmed the medals for these deserving people,” he said, adding that he hopes recipients would “respect and cherish the medals”.", "url": "https://www.straitstimes.com/singapore/covid-19-wave-probably-peaked-but-slight-surge-possible-ong-ye-kung"}