{"authors": ["Gabrielle Chan"], "date_download": "2024-10-12 13:51:26", "date_modify": "2024-10-12 13:51:26", "date_publish": "2023-10-16 18:23:00", "description": "Concerns surfaced after a restaurant owner said she was asked if she would like to pay to be featured on a blog. Read more at straitstimes.com.", "filename": "singapore_paid-restaurant-reviews-standard-practice-but-being-transparent-is-key-say-food-bloggers_1728741086.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/16/aigcgood1610.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_paid-restaurant-reviews-standard-practice-but-being-transparent-is-key-say-food-bloggers_1728741086.html", "title": "Paid restaurant reviews ‘standard practice’ but being transparent is key, say food bloggers", "title_page": "Paid restaurant reviews ‘standard practice’ but being transparent is key, say food bloggers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – It is common practice for food bloggers to get paid for restaurant reviews, but they should be transparent and declare publicly that these are advertisements, said industry players.\nEatbook editor Beatrice Bowers said that the blog has been selling advertising spots since 2016, and that for most major media houses, these paid advertorials – ads written in the form of editorials – are standard practice as they help to generate revenue.\nShe said Eatbook is transparent about the nature of its food reviews by clearly indicating whether each review is independent, an invited session for members of the press to dine at the eatery, or a paid review.\nShe added that one out of 10 to 15 articles on the Eatbook website contains paid content, and that advertisements are always tagged “#sp” or “#ad” across all its platforms.\nThe hashtag “sp” stands for sponsored post, and the hashtag “ad” indicates that it is an advertisement.\nThere have been concerns about the authenticity of food reviews after Singaporean restaurant owner Charlene Yan, 34, on Oct 4 said she was given the option of being featured on popular food blog Sethlui.com if she forked out $2,300.\nMs Yan, who owns an eatery in Everton Park in the Tanjong Pagar area, said one of Mr Seth Lui’s employees offered her a spot on a list with an option to be placed in first, second or third spot for an additional $400 to $600.\nIn response to Ms Yan’s claims, a spokesman for Mr Lui said the business does not accept payment for reviews, and all articles sponsored by advertisers come with “a disclaimer for branded or sponsored content” at the end.\nThe Advertising Standards Authority of Singapore, on its website, spells out that it should be clear that “anyone who looks at the advertisement is able to see, without reading it closely, that it is an advertisement and not editorial matter”.\nIt added that advertisements should not abuse the trust of consumers or exploit their lack of experience, expertise or knowledge, and should not mislead in any way by “inaccuracy, ambiguity, exaggeration, omission, or otherwise”.\nFood bloggers The Straits Times spoke to said their main aim is to remain honest while sharing a love for food.\nDaniel Food Diary (DFD), a popular local food blog, said in response to queries that it offers paid reviews, which are all categorised and clearly marked as “advertorials” or “SP” to indicate that they are sponsored posts.\nDFD said it will “unreservedly decline” proposals from establishments that offer financial perks for the top spot in ranking lists. Instead, it makes editorial integrity a key priority, it added.\n“We believe that many food bloggers and influencers maintain a similar perspective, placing passion for their work and service to their readers above financial gains,” DFD said.\nDescribing its methodology, DFD said its lists – written after its writers make anonymous visits – are “fundamentally impartial”. It added that Google reviews and customer feedback also help decide if an eatery is featured.\nWhen approached by businesses like malls and hotels to put together food guides featuring their tenants, the team from DFD will work with the client and ensure that the food is reviewed in person.\nDFD, however, said it has declined tie-ups with clients when the food or other aspects do not meet its criteria.\nIt said: “Our aim is to share our love for food while maintaining unyielding integrity and providing our readers with honest, unbiased content.”\nSimilarly, freelance content creator Irene Kuok, who owns the blog FoodWanderers, said she does not sell spots in articles for ads for now. But if her blog becomes a business entity in the future, sponsored posts will have clear disclaimers to ensure it remains transparent and honest with its readers, she said.\n“This will also help me to ensure that the content is based on my own eating and taste opinions rather than those of the customer’s or brand’s belief,” she added.\nMs Kuok, 35, said diverse income streams are crucial for those who rely on blog traffic and content creation to keep their blogs going.\nShe added that she is open to exploring the option to sell spots for advertisements if the opportunity arises.\nOn her website, Ms Kuok has a page that states her methodology behind her food reviews and ratings, which aim to help new readers relate to her reviews, she said.\n“All the posts I’ve shared so far have been motivated by my desire to share valuable content with people,” she said.\nLocal food blog NUS Fat Club, which posts food reviews on social media platform Instagram, said it does not sell spots for adverts nor does it attend media events or invited tastings.\n“We always tell people to just try those foods themselves and form their own judgement – we simply try to convey whatever emotions and feelings we experienced through the reviews,” an NUS Fat Club spokesman said.\nHe added that the blog has no plans to accept payment for advertisements in the future as well.\nHowever, the practice is common in the food blogging industry, especially if the blog is run as a business, he added.\nThe spokesman said: “It’s fair game for any business to charge for a service – in this case, for food blogs to charge for advertisements.\n“It just has to be transparent to the readers that it is a paid advertisement and not an editorial, so readers can make their own judgment accordingly.”\nAssociate Professor Seshan Ramaswami, who teaches marketing education at the Singapore Management University, said although the line between editorials and adverts is often blurred by the practices of marketers and influencers on social media, the ethical decision is clear.\nThat means any compensation that a food blogger receives, even a free drink or dessert, for instance, should be clearly disclosed to the reader or viewer, he added.\nSaid Prof Ramaswami: “When an editorial decision – the cafes to feature on a list, in this case – is compromised by payment for being featured, that is no longer an editorial decision. It is an advertisement, and the fact of that payment must be clearly stated on that list.”\nIf not, the credibility of that list would be completely lost, he added.", "url": "https://www.straitstimes.com/singapore/paid-restaurant-reviews-standard-practice-but-being-transparent-is-key-say-food-bloggers"}