{"authors": ["Lynda Hong"], "date_download": "2024-10-12 13:32:23", "date_modify": "2024-10-12 13:32:23", "date_publish": "2023-11-23 23:05:00", "description": "Building has solar cells integrated into glass panels that make up shelter of rooftop garden. Read more at straitstimes.com.", "filename": "singapore_environment_fire-safety-codes-updated-to-keep-up-with-novel-solar-panel-installation-at-new-school-building_1728739943.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/24/2023112346061508lyn0327.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_fire-safety-codes-updated-to-keep-up-with-novel-solar-panel-installation-at-new-school-building_1728739943.html", "title": "New solar panel installation at Dulwich College maximises use of limited rooftop space", "title_page": "New solar panel installation at Dulwich College maximises use of limited rooftop space | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – An international school in Bukit Batok has discovered a novel way of installing solar panels on its buildings to maximise limited rooftop space.\nDulwich College (Singapore) integrated electricity-generating solar photovoltaic cells into glass panels to create a structure to shelter a rooftop garden in its new building called The Greenhouse, which officially opened on Nov 23.\nDP Architects director Loh Hai Yew, who designed The Greenhouse, noted that in conventional installation, solar panels take up all the floor space on roofs.\nBy incorporating solar photovoltaic cells in a trellis-like structure, the space beneath the solar panels can be used.\nThe trellis-like structure acts as a shelter for the rooftop garden so that adequate natural light can come through while keeping the rain away.\nTogether with solar panels that extend to the north facade of the building, the structure is known as eco-envelope and covers 1,300 sq m of the building.\nMr Loh said that dialogues with the Singapore Civil Defence Force, Urban Redevelopment Authority, and Building and Construction Authority (BCA) took place for 1½ years to discuss compliance in mitigating fire hazards in the new solar panel set-up.\nMr Loh noted that fire compartmentation – or a space to escape from the fire – has to be provided for from rooftop to facade. Fire sprinklers are also installed as another layer of protection.\nSolar panels on the new building will be able to generate 210 megawatt-hour of renewable energy annually – equivalent to powering 48 four-room Housing Board flats.\nCertified Green Mark Platinum Zero Energy under the latest Green Mark 2021 scheme, the building also comes with features to teach students environmental sustainability. These include rainwater harvesting for plants at the rooftop garden, as well as kinetic floor tiles for students to generate energy when they step on the tiles.\nData on the amount of rainwater harvested, the energy consumed by the building and the energy produced by the solar panels are put out on a dashboard, which students can view and is also used to teach maths and physics.\nMs Karen Yung, founder and chief collaboration officer of Education in Motion, which runs Dulwich College (Singapore), said that future-proofing students in sustainability is key as many jobs in 2030 are forecast to require sustainability skill sets.\n“We must walk the talk by not just building… according to Singapore building codes.”\nMs Yung added: “We have to challenge ourselves to create a building that represents our collective vision and commitment to create a sustainable and innovative learning environment.”\nThe opening ceremony of The Greenhouse was also attended by Minister for National Development Desmond Lee and British High Commissioner Kara Owen.\nSpeaking at the event, Mr Lee said that he hopes more organisations will push the boundaries in energy efficiency, as Singapore looks to green buildings to achieve its net-zero goals.\nHe added: “This will not only allow companies to develop a competitive edge, but it also helps to align them with the growing environmental consciousness of investors and building users.”", "url": "https://www.straitstimes.com/singapore/environment/fire-safety-codes-updated-to-keep-up-with-novel-solar-panel-installation-at-new-school-building"}