{"authors": [], "date_download": "2024-10-12 13:32:01", "date_modify": "2024-10-12 13:32:01", "date_publish": "2024-05-01 05:00:00", "description": "This is the first time public healthcare professionals are involved in a Synapxe call-for-innovation using GenAI. Read more at straitstimes.com.", "filename": "singapore_healthcare-professionals-explore-ways-to-tap-artificial-intelligence-in-patient-care_1728739921.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/01/SynapxeGenAIus20ChallengeIdeation20WorkshopAWS20group20photo.jpg?VersionId=5eN1oCxonJcBkA818adTHNrLm.Qc7Tkz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_healthcare-professionals-explore-ways-to-tap-artificial-intelligence-in-patient-care_1728739921.html", "title": "Singapore healthcare professionals explore ways to tap AI in patient care", "title_page": "Singapore healthcare professionals explore ways to tap AI in patient care | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Doctors at the Singapore General Hospital (SGH) found that it sometimes took them about an hour or more to review and summarise patient medical records, but with artificial intelligence (AI), it took less than a minute.\nAt workshops organised by national healthtech agency Synapxe between April 8 and 23, about 160 Singapore healthcare professionals tried their hand at developing AI tools to improve patient care.\nOther ideas being explored as part of the project include, for instance, using AI tools to create a messaging application that can send out timely updates to a patient’s next of kin, said Synapxe in a statement on April 25.\nThere were also non-clinical submissions, like healthcare subsidy assistants and call-centre chatbots to help officers provide personalised real-time responses to queries.\nAlthough it is still in the early stages, shortlisted ideas will undergo a design and development stage, and could get rolled out in hospitals and healthcare institutions, the statement said.\nSo far, about 70 cases have been submitted for further evaluation.\nFor the first time, public healthcare professionals were asked to take part in the Synapxe “call-for-innovation” project using GenAI, in what is dubbed the GenAIus Challenge, a spokesman said.\nSGH senior consultant Aaron Lee, 47, who specialises in anaesthesiology, was among those who attended the workshop sessions.\nHe said: “The involvement of healthcare workers is definitely something that I hope to see more of. If we are involved from the ideation process... the tech folks can help us to get what we want, and that can help us to get better products.\n“While tech experts may have ideas, they may not know the best way that a product can fit into the clinician’s workload.”\nDuring the workshop, participants were guided by experts from Synapxe technology partners like Amazon Web Services (AWS), Avanade and Microsoft or Google Cloud to develop their ideas.\nDr Lee and his team, who are all anaesthesiologists, sought to use AI tools to sort through documents – including those from the National Electronic Health Record, surgeon notes, patient X-rays and laboratory test results – and quickly summarise each case and identify key points.\n“There are so many places to go to, to check for information,” said Dr Lee.\nBy the end of the workshop, Dr Lee and his team were pleasantly surprised by what the AI tool was able to achieve. He said: “When we tried out the case on a sample data set, we found that even without training or complex prompt engineering, we were able to get 50 per cent of what we wanted.”\nHe said his team is still in touch with Synapxe and AWS to work towards creating a product that can be used in hospitals. He added that before any product can be put into clinical use, it must reach a very high standard.\nIf an AI product is selected for clinical use, it will be deployed in phases, such as starting with pilot programmes in selected healthcare facilities, said the Synapxe spokesman.\nHe said: “After rigorous testing, feedback and iteration, the product can be considered for scale-up to more public healthcare institutions once it has proven safe and effective in the pilot programmes.”\nThe aim is to harness AI, and free up healthcare professionals from administrative and repetitive tasks and allow them to focus on delivering care to patients.\nThe spokesman said: “With the secure and safe use of GenAI, we could, for example, generate condensed patient information from clinical notes, saving time and effort and enabling healthcare professionals to focus on more complex tasks and patient care.”", "url": "https://www.straitstimes.com/singapore/healthcare-professionals-explore-ways-to-tap-artificial-intelligence-in-patient-care"}