{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:50:35", "date_modify": "2024-10-12 13:50:35", "date_publish": "2024-05-26 12:00:00", "description": "I.F.F.I’s holding company, precision engineering firm TranZPlus Engineering, has entered into liquidation. Read more at straitstimes.com.", "filename": "singapore_mega-indoor-veggie-farm-iffi-shuts-down-in-latest-blow-to-local-food-production_1728741035.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/26/btclose20240527.JPG?VersionId=dCp5_UI8E6QVSgMT1ZZDWWvMpZoowTrO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_mega-indoor-veggie-farm-iffi-shuts-down-in-latest-blow-to-local-food-production_1728741035.html", "title": "Mega indoor veggie farm I.F.F.I shuts down in latest blow to local food production", "title_page": "Mega indoor veggie farm I.F.F.I shuts down in latest blow to local food production | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Another casualty has emerged in Singapore’s high-tech farming sector, The Straits Times has learnt, in yet another sign of the teething challenges plaguing the nascent industry.\nLocal indoor farm I.F.F.I, said to have the ability to produce some 300 tonnes of leafy greens a year, has shuttered its mega 38,000 sq m facility in Tuas.\nI.F.F.I’s holding company, precision engineering firm TranZPlus Engineering, has entered into liquidation, with court documents showing that it filed for insolvency in November 2023.\nThe company produced a range of crops from arugula and kale to green lettuce and red bok choy, selling its vegetables under the brand name, Next Farmers. The produce was previously available at FairPrice supermarkets.\nI.F.F.I vacated its farm – which was located at the Space@Tuas – and returned the units to JTC Corporation in April 2024. ST understands that all its equipment was left behind.\nJTC did not respond to queries on whether it is owed rent by the company.\nI.F.F.I was a recipient of Singapore Food Agency’s (SFA) 30 by 30 express grant in 2020 – which gave nine farms a total of $39.4 million to help them ramp up production amid the Covid-19 pandemic.\nSFA did not respond to queries on how much grant funding was disbursed to the farm, but according to I.F.F.I’s 2021 financial statement, it would have received at least $2.9 million in cash grants from SFA for the farm’s construction.\nAccording to SFA’s media statement on its 30 by 30 express grant in 2020, I.F.F.I received funding to build a mega high-tech indoor farm in a fully controlled and pesticide-free environment.\nThe farm is said to have leveraged technology such as artificial intelligence farming systems and an advanced environmental control system to achieve optimum growing conditions all year round. It had also employed an innovative water treatment system to reduce bacteria count, improve its yield rate, and extend the shelf life of its produce.\nI.F.F.I did not respond to repeated requests for comment.\nNews of I.F.F.I’s closure comes as local vegetable production in 2023 declined by around 15 per cent, accounting for only 3.2 per cent of local consumption, as opposed to 3.9 per cent in 2022, according to the SFA’s food statistics report released on May 20.\nST had previously reported on plans made by other local vegetable farms that had fallen through. For example, ST reported in April on VertiVegies’ decision to scrap plans to construct its indoor farm in Lim Chu Kang, after it ran into issues with its joint venture partner, Chinese farming company SananBio, which supplied the farm with its production hardware. VertiVegies had withdrawn its application for the SFA grant before the disbursements were made.\nMeanwhile, ST understands that local farm Sky Greens, which had touted its patented vertical farming systems as being an innovative and environmentally friendly way of growing vegetables, is scaling down its operations.\nWhile the company declined to respond to queries from ST, a visit to the farm’s 5ha plot in Lim Chu Kang earlier in May showed that many of its greenhouses had been torn down.\nPrevious media reports said that the farm was capable of producing one tonne of vegetables a day, such as xiao bai cai and cai xin, which were sold at FairPrice.\nKnown as the A-Go-Gro technology, each glass building houses A-shaped rotating metal towers of up to 9m in height, which would allow all of its plants to get a uniform amount of sunlight.\nIt also allows the farm to do away with the use of LED lights, which would incur additional electricity costs.\nThe towers operate via a water-pulley system, and the water used to rotate the towers is also used for growing the crops.\nIn 2021, Sky Greens’ holding company, Sky Urban Solutions, told the media that the firm was exporting its vertical farming system to six countries, including Thailand and Canada.\nChecks by ST found that a company known as Sky Greens Canada is using and selling the patented A-Go-Gro technology there.\nThe farming system has been used to grow fodder to feed farm animals like horses and pigs, as well as to grow strawberries year-round in Alberta, Canada.\nWhen asked if it was surprising that high-tech farms in Singapore are beginning to shutter, agritech consultant Lee Eng Keat said that it was expected as a number of farms have not been able to turn a profit, or were unable to raise new funds to continue operating.\nWith investors becoming more selective and conservative, funding is becoming harder to come by, forcing many farms to be as prudent as possible, as they bid to make returns on their investments, he said.\nBut this might be more difficult as they grapple with increased energy costs and relatively high labour costs, he added.\nAs a large part of the 30 by 30 goal involves ensuring that local farms are able to produce 30 per cent of Singapore’s nutritional needs locally by 2030, many will need to ensure that they find suitable customers who are willing to purchase their products, and drive down their business costs, said Mr Lee.\nThis would mean seeking out customers who can appreciate the benefits that locally grown produce have over imported ones, and better yet, be willing to pay a small premium for it, he added.\nBut managing costs would be the more challenging feat, and many farms will benefit from some support, by co-sharing the costs of some of their innovation efforts, or through allocation of cheaper agricultural land, for instance.\nHowever, careful scrutiny will be needed to ensure that only deserving players, which have sound financials and a viable business model, receive the requisite support, said Mr Lee.\nTo alleviate the high costs of production, Mr Edwin Ong, founder of urban farming solutions provider Arianetech, said that farms should be encouraged to adopt solutions that promise lower cost production, shifting the focus away from novel equipment.\nGrants can also be qualified based on the effective costs of production and energy consumption per kilogram of produce to ensure that local farms are able to compete with vegetable imports, he added.\nCorrection note: This article has been edited for clarity.", "url": "https://www.straitstimes.com/singapore/mega-indoor-veggie-farm-iffi-shuts-down-in-latest-blow-to-local-food-production"}