{"authors": ["Goh Yan Han"], "date_download": "2024-10-12 13:29:36", "date_modify": "2024-10-12 13:29:36", "date_publish": "2021-01-03 05:00:00", "description": "SINGAPORE - The minimum legal age for the purchase, use, possession, sale and supply of tobacco products was raised from 20 years to 21 on Friday (Jan 1). Read more at straitstimes.com.", "filename": "singapore_smoking-controls-in-singapore-over-the-years_1728739776.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/01/03/rk_smoking_030121.jpg?VersionId=DaYMOc9nSOYVpPZ4WgeFBRKWjz.ldSjy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_smoking-controls-in-singapore-over-the-years_1728739776.html", "title": "Smoking controls in Singapore over the years", "title_page": "Smoking controls in Singapore over the years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The minimum legal age for the purchase, use, possession, sale and supply of tobacco products was raised from 20 years to 21 on Friday (Jan 1).\nThis is the third and last change to the minimum age requirement under the amendments to the Tobacco (Control of Advertisements and Sale) Act, which were passed in Parliament in November 2017.\nThe minimum legal age was first raised from 18 to 19 years old on Jan 1, 2019, and from 19 to 20 years old on Jan 1, 2020.\nHere's a timeline of smoking controls implemented in Singapore:\n1970: Smoking is banned in all cinemas and on buses.\n1971: All tobacco advertising is banned.\n1986: National Smoking Control Programme launched with the theme Towards a Nation of Non-Smokers.\n1987: Smoking is banned on the new MRT.\n1992: Smoking (Prohibition in Certain Places) Act integrates previous smoking bans.\n1993: Tobacco (Control of Advertisements and Sale of Tobacco) Act is introduced - now known as Tobacco (Control of Advertisements and Sale) Act.\n1994: Smoking is banned in all air-conditioned private offices and factories.\n1997: Smoking is banned on the compounds of all educational institutions - schools, junior colleges, polytechnics and covered buildings in universities.\n2004: Graphic warnings on the dangers of smoking are required to be displayed on cigarette packs. Singapore ratifies the World Health Organisation Framework Convention on Tobacco Control, the first evidence-based global health treaty which came into force in 2005.\n2007: Smoking is banned in all entertainment outlets including pubs, bars, dance clubs, lounges and nightclubs and their outdoor refreshment areas.\nHospitals provide free inpatient smoking cessation counselling.\n2009: All Singapore duty-paid cigarettes (SDPCs) have to be labelled with SDPC marks and vertical bars on individual sticks.\n2010: Smoking cessation counselling offered in schools, with full-time nurses stationed to counsel students in secondary schools, colleges and polytechnics.\n2011: Ban on sale of tobacco products in shops that sell health-related products and those that offer youth-centric products or services such as game arcades, confectioners, candy, comic and toy stores.\nNational anti-smoking social movement I Quit launched by Health Promotion Board (HPB). It adopts a community-based personalised approach to build a network of support for smokers to quit.\n2012: Blue Ribbon initiative launched by HPB to encourage and mobilise businesses and organisations like markets, food centres and hotels to support smoke-free environments given the harm of second-hand and third-hand smoke.\n2013: Smoke-free places expanded to include public areas in residential areas including common areas of residential buildings (common corridors, void decks, staircases, stairwells and multi-purpose halls), covered walkways and linkways, pedestrian overhead bridges, a 5m radius from the edge of bus shelters, and hospital outdoor compounds.\n2018: Ban on e-cigarettes and vaporisers; 10 per cent increase in excise duty for all tobacco products, including clove cigarettes, and other cigarettes containing tobacco and tobacco substitutes, which are now subjected to excise duty of 42.7 cents for every gram or part thereof of each cigarette, up from 38.8 cents previously. This came after cigarette and manufactured tobacco levies went up by 10 per cent in 2014.\n2019: Smoking in all public areas within Orchard Road precinct prohibited, but there are more than 50 designated smoking areas.", "url": "https://www.straitstimes.com/singapore/smoking-controls-in-singapore-over-the-years"}