{"authors": ["Salma Khalik"], "date_download": "2024-10-12 13:58:35", "date_modify": "2024-10-12 13:58:35", "date_publish": "2022-10-20 12:36:57", "description": "The measures include activating inpatient teams at emergency departments so that treatment can start expeditiously. Read more at straitstimes.com.", "filename": "singapore_hospitals-activating-measures-to-mitigate-crunch-at-emergency-departments-moh_1728741515.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/20/yaohui-yhsgh-0347a2028129_6.jpg?VersionId=xE9dKgIKogD5pO2ZGjvBvxqxnHbc8fF6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_hospitals-activating-measures-to-mitigate-crunch-at-emergency-departments-moh_1728741515.html", "title": "Hospitals activating measures to mitigate crunch at emergency departments: MOH", "title_page": "Hospitals activating measures to mitigate crunch at emergency departments: MOH | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Ministry of Health (MOH) said it is aware of the crowded situation in public hospital emergency departments (EDs) for the past few months. It said the situation has been exacerbated by the Covid-19 pandemic.\nIts spokesman said hospitals will activate measures to mitigate the peak periods of congestion at EDs.\n“These measures include activating inpatient teams to tend to patients at the EDs so that treatment can start expeditiously; creating additional beds in the wards and holding spaces in the EDs; and transferring patients to the wards as soon as possible for the ward’s team to extend care,” said the spokesman.\nIt added that to free up beds for the influx of patients from the ED, wards expedite the discharge of patients who no longer require acute care.\nSome of these patients are discharged to step-down facilities such as community hospitals or nursing homes.\nThe spokesman added: “Those who no longer need acute care but still require some time to arrange for their post-discharge care may be transferred to transitional care facilities (TCFs).”\nHealth Minister Ong Ye Kung had said in August: “We are progressively converting Connect@Changi Hall 10 from a Covid-19 treatment facility to a transitional care facility, making a total of 364 TCF beds by end-September.”\nMr Ong said TCFs can be used by patients, including those who might be staying in the hospital and waiting for nursing home places.\nBut the MOH spokesman added: “Despite these measures in place, there will be instances where specific hospitals find it challenging to cope due to an unexpected large surge of patients.\n“MOH will then assess if there is available capacity in other public hospitals and activate Singapore Civil Defence Force ambulance diversions to balance the load across the hospitals.”\nAn SCDF spokesman said: “SCDF works closely with the Ministry of Health to manage diversion cases. Should there be a need to divert cases away from certain hospitals, MOH promptly alerts the SCDF Operations Centre.”\nHe added that the SCDF is monitoring the situation closely and prioritises critical life-threatening medical emergencies while refusing to convey non-emergency cases to hospital.", "url": "https://www.straitstimes.com/singapore/hospitals-activating-measures-to-mitigate-crunch-at-emergency-departments-moh"}