{"authors": ["Elisha Tushara"], "date_download": "2024-10-12 13:44:33", "date_modify": "2024-10-12 13:44:33", "date_publish": "2023-10-21 21:35:00", "description": "Students can take subjects they could not under streaming, and interact with peers of different strengths and interests Read more at straitstimes.com.", "filename": "singapore_full-sbb-boosts-diversity-allows-personalised-learning-journeys-principals-students-in-pilot_1728740673.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/21/2023102132987897ga33341.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_full-sbb-boosts-diversity-allows-personalised-learning-journeys-principals-students-in-pilot_1728740673.html", "title": "Full SBB boosts diversity, allows personalised learning journeys: Principals, students in pilot", "title_page": "Full SBB boosts diversity, allows personalised learning journeys: Principals, students in pilot | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Full subject-based banding (SBB) has allowed students to access opportunities throughout their education journey and interact with peers of different strengths and interests, principals told parents at a forum on Saturday.\nFrom 2024, Secondary 1 students in 120 schools will get to take subjects at different levels of difficulty under full SBB.\nAlthough they will be initially banded based on their Primary School Leaving Examination results, students will have the flexibility over the course of their secondary school education to study more subjects at different levels that suit their interests, aptitude and learning needs.\nStudents will also be placed in mixed form classes, where they can learn with peers with different academic abilities.\nOn Saturday, parents attending The Straits Times Smart Parenting Post-PSLE Forum heard from the principals and students from five secondary schools that have trialled full SBB for at least two years under a pilot, about how this has impacted students.\nAmong parents’ concerns were whether there were any benefits to no longer being separated into the Express, Normal (Academic) and Normal (Technical) streams.\nMs Tan Po Chin, principal of Anderson Secondary School, told parents at the forum held in the SPH News Centre auditorium that full SBB has increased the school’s awareness of the need to appreciate diversity.\nNoting that students of mixed abilities in a form class will attend common curriculum subjects like physical education and music together, she added: “The teachers are very conscious of the need to group them deliberately, so they have increased opportunities for mixing within these lessons as well.”\nMr Loh Chih Hui, principal of Bowen Secondary School, said that at the lower secondary level, all the classes contained a mixed profile of students across genders, ethnicities and academic aptitudes.\nHe said: “We want to ensure that they are able to interact and socialise with a very broad range of people, and to also gain different perspectives and recognise each other’s strengths as well.”\nSt Andrew’s Secondary School principal Lee Han Hwa said the school prides itself on being a “band of brothers”.\nHe said he had asked the current Sec 1 students undergoing full SBB if they would like to move to Sec 2 in the same form class. “Most of the boys will say they want to be together in the same class, regardless of whether they are in the Express, N(A) or N(T). They want to progress together to the next level.”\nKranji Secondary School principal Goh Soon Hoe said schools have the autonomy to design the implementation of full SBB based on the profile of their students.\n“We are no longer just requiring our students to know about academic subjects. We want them to be connected to the realities of what this world means, and then prepare them for the future,” he said.\nAt Holy Innocents’ High School, all Sec 1 students will study literature as part of the common curriculum. Principal Rebecca Chew said this was done to expose students to the literary nuances in prose, poetry and drama, which they would not have encountered if they were in the N(T) stream.\n“This is one of the good things about full SBB – we can do away with the national curriculum combination and students can have access to other kinds of subjects,” she said.\nEthan Chiow, who is in Sec 1 at the school, was recently given the opportunity to take mathematics at a more demanding level in Term 3 this year. He also takes science and English at a higher level.", "url": "https://www.straitstimes.com/singapore/full-sbb-boosts-diversity-allows-personalised-learning-journeys-principals-students-in-pilot"}