{"authors": ["Samuel Devaraj"], "date_download": "2024-10-12 13:27:01", "date_modify": "2024-10-12 13:27:01", "date_publish": "2024-10-11 20:11:57", "description": "Both the Singapore Prison Service and AGC have since taken steps to remedy the situation. Read more at straitstimes.com.", "filename": "singapore_courts-crime_agc-prisons-acted-unlawfully-breached-confidence-over-death-row-inmates-letters-court-of-appeal_1728739621.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/20240318104906360gin4605.jpg?VersionId=FNawoN3V9ND_n7In8Kid5d6p.NszrMoN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_agc-prisons-acted-unlawfully-breached-confidence-over-death-row-inmates-letters-court-of-appeal_1728739621.html", "title": "Prisons, AGC acted unlawfully, in breach of confidence over death-row inmates’ letters: Court of Appeal", "title_page": "Prisons, AGC acted unlawfully, in breach of confidence over death-row inmates’ letters: Court of Appeal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Court of Appeal found that the Attorney-General’s Chambers (AGC) and Singapore Prison Service (SPS) were in breach of confidence and acted unlawfully over the exchange of a number of letters belonging to 13 death-row inmates.\nThe court, comprising Chief Justice Sundaresh Menon, Senior Judge Judith Prakash and Justice Steven Chong, affirmed on Oct 11 the importance of a prisoner’s ownership over his correspondence and his right, within the bounds of the law, to maintain the confidentiality and privacy of his communications.\nIn a written judgment, the court noted that the AGC and the SPS, which is under the Ministry of Home Affairs (MHA), have since taken steps to remedy the situation.\nThe letters were written by 13 prisoners on death row who were seeking damages for unlawful practice, breach of confidence and copyright infringement.\nThey had filed a civil case against the AGC in July 2021.\nThe prisoners were mostly drug offenders, but also included former policeman Iskandar Rahmat, who was convicted of the 2013 Kovan double murders of a businessman and his son.\nThe inmates had sent correspondence to various parties, including the Singapore Police Force and their lawyers.\nThe Court of Appeal said almost all the documents concerned past, pending or contemplated proceedings arising from the inmates’ convictions and sentences, and the dismissal of their appeals.\nThe documents included complaints against former counsel, requests for legal assistance, or were related to correspondence over clemency applications.\nIn an affidavit, Deputy Attorney-General Tai Wei Shyong said that at the time when the documents were shared, the SPS and MHA would generally keep the AGC – as the Government’s legal adviser – informed of developments regarding inmates awaiting capital punishment.\nThey would also seek the AGC’s advice on whether there were any relevant pending proceedings, or issues which could give rise to such proceedings, that would require the capital punishment to be temporarily suspended.\n“Given that the SPS and the MHA officers handling such matters were not legally trained, if they came across any document that appeared to be legal in nature, they would send it to the AGC for advice,” said Mr Tai.\nAlmost all the 68 documents sent by the SPS to the AGC were for this reason, the judges noted.\nThe practice led to a wholesale passing of the inmates’ correspondence to the AGC without either party assessing if anything in the correspondence even required the AGC to give the SPS legal advice.\nThe judges noted that the law allows prison officers to read all correspondence from or to prisoners and make copies of the letters, unless they are to or from the prisoner’s legal adviser.\nHowever, this does not extend to permitting the SPS to make copies of letters to or from lawyers, or to give copies of any letters at all to anyone, including the AGC.\nThe judges said they recognised the possibility that the contents of the prisoners’ correspondence read by the SPS might require it to obtain legal or other advice to ensure the safety and good order of the prison or the public.\nHowever, the SPS and AGC did not say the letters belonging to the 13 inmates required advice of such a nature.\nThe court said that in urgent matters, the SPS must make it clear to the AGC that the disclosure was only for the purpose of obtaining urgent advice.\nSaid the judges: “The AGC, for its part, would have to have systems in place to maintain the confidentiality of any documents disclosed for this purpose so that such documents are only disclosed to the officers tasked with providing the necessary advice to the SPS.”\nThe court accepted that although the AGC had not properly considered the importance of prisoners’ confidentiality when it obtained correspondence from the SPS, this was an oversight and not an attempt to seek an advantage in court proceedings.\n“The AGC had also promptly destroyed its copies of the correspondence upon being informed of the proper procedure it ought to adopt in relation to correspondence from or to prisoners,” the judges added.\nThe judges upheld $10 nominal damages to three prisoners granted earlier by the High Court for breach of copyright. No damages were awarded to the 13 prisoners for breach of confidence.", "url": "https://www.straitstimes.com/singapore/courts-crime/agc-prisons-acted-unlawfully-breached-confidence-over-death-row-inmates-letters-court-of-appeal"}