{"authors": ["Vihanya Rakshika"], "date_download": "2024-10-12 13:32:33", "date_modify": "2024-10-12 13:32:33", "date_publish": "2023-09-29 09:52:38", "description": "The seized drugs are estimated to be worth about $71,000. Read more at straitstimes.com.", "filename": "singapore_three-teens-among-5-arrested-for-suspected-drug-activities-on-telegram_1728739953.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/29/drugs.PNG?h=d876d083", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_three-teens-among-5-arrested-for-suspected-drug-activities-on-telegram_1728739953.html", "title": "Three teens among 5 arrested for suspected drug activities on Telegram", "title_page": "Three teens among 5 arrested for suspected drug activities on Telegram | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Five Singaporeans, including three teenagers, have been arrested for alleged involvement in drug trafficking activities conducted on chat app Telegram.\nThe Central Narcotics Bureau (CNB) carried out operations last Wednesday at various locations, seizing weapons, a total of about 204g of Ice, 143g of cannabis, 12 Ecstasy pills, 12g of ketamine, one bottle of liquid substance believed to be controlled drugs, cash amounting to $3,600 and drug paraphernalia.\nThe seized drugs are estimated to be worth about $71,000.\nOn Wednesday afternoon, a 20-year-old man and a 19-year-old girl were arrested at a residential unit in Boon Lay Drive. Officers had to forcibly enter the unit after the suspects refused to open the door.\nThe man’s vehicle in a nearby open-air carpark was found to have a knuckle duster and knife, and about 83g of Ice, 48g of cannabis, 12g of ketamine and nine Ecstasy pills.\nIn the evening, an 18-year-old boy was arrested at a residential unit in Boon Lay Avenue. His luxury car, in a nearby multi-storey carpark, had about 121g of Ice, 95g of cannabis, three Ecstasy pills, one bottle of liquid substance believed to be controlled drugs, a digital weighing scale and drug paraphernalia.\nOn the same evening, in Jurong West Street 93, a 21-year-old man and a 17-year-old girl were arrested at a residential unit, where several weapons were seized. The officers forcibly entered the unit after the suspects refused to open the door.", "url": "https://www.straitstimes.com/singapore/three-teens-among-5-arrested-for-suspected-drug-activities-on-telegram"}