{"authors": ["Christie Chiu"], "date_download": "2024-10-12 13:55:25", "date_modify": "2024-10-12 13:55:25", "date_publish": "2024-02-27 13:40:00", "description": "Footage shows the helper beating the dog's head with a makeshift rod, and hanging it on the balcony railing. Read more at straitstimes.com.", "filename": "singapore_maid-under-probe-for-allegedly-beating-employer-s-dog-to-death-spca_1728741325.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/27/Screenshot202024-02-2720134137.png", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_maid-under-probe-for-allegedly-beating-employer-s-dog-to-death-spca_1728741325.html", "title": "Maid under probe for allegedly beating employer’s dog to death", "title_page": "Maid under probe for allegedly beating employer’s dog to death | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A maid is under investigation for allegedly beating her employer’s dog to death in January, after the abuse was caught on closed-circuit television (CCTV) camera footage.\nThe employer, Jason (not his real name), told The Straits Times that the maid had been hired in mid-December to care for his home and look after his 13-year-old pet poodle, Boyboy.\nHe said he had found the dog abandoned along Rochor Road in 2015 after it had almost been hit by a bus, and decided to take it home after spending almost two hours rescuing it.\nDespite what it had been through, Jason said: “He was a happy dog, a very brave dog. All my friends just loved him.”\nOn Jan 22, Jason left home for work and had planned to celebrate his 43rd birthday with his then girlfriend in the evening.\nInstead, he had to rush to a pet crematorium after his girlfriend – who was at home at the time of the alleged incident but was napping – informed him about his dog’s sudden death.\nDuring the cremation process, Jason noticed that his dog died in a stiffened posture, and later saw a crack in the remains of its skull.\nHe then reviewed his home’s CCTV footage, which showed the final moments before the dog died. The CCTV was previously installed to monitor the dog when Jason was working and had yet to hire help.\nJason subsequently made a police report and said the matter was escalated to the Animal and Veterinary Service (AVS) for investigation.\nDetails and footage of the incident were first posted on Facebook by veteran animal activist and rescuer Derrick Tan, who is a friend of Jason’s.\nIn the clips, the maid is seen beating the whimpering dog’s head with her hands and a thick rod made up of rolled up pet food packaging.\nShe can be heard saying: “Wait, I said wait, wait. You know, wait?” as she delivers each blow to its head.\nShe is also seen hanging the dog on the balcony railing using a leash while she fills a bucket with water.\nAlthough still breathing, the dog appears limp and is barely moving.\nAfter watching the CCTV footage, Jason said he immediately confronted the helper as she had not been honest with him and sent her back to her employment agency, World Asia Employment.\n“I didn’t want to see her at all. I just wanted to get rid of her,” he said.\nShe had previously told Jason that the dog had been vomiting in the morning of the day it died, for “no reason”.\nMr Tan said: “The helper was employed with the primary task of caring for Boyboy, and it is horrifying that she would resort to treating a helpless animal in such a way.”\nHolding back tears, Jason said his fondest memory of the dog was the way it would always look at him.\n“The way he would look at me, it was like I was his entire world.”\nThe maid’s employment agency said it does not condone abuse of any kind.\nA spokesman for World Asia Employment clarified that the maid’s employer was Jason’s ex-girlfriend, and that the maid, whose nationality has not been revealed, has not been sent back to her home country.\nThe maid is currently staying at a shelter run by the Centre for Domestic Employees run by the National Trades Union Congress, and is assisting with investigations.\nIn response to queries, the Society for the Prevention of Cruelty to Animals (SPCA) called the helper’s alleged actions “brutal” and “appalling”.\nSPCA executive director Aarthi Sankar said the SPCA is actively involved in gathering evidence for the case and will continue to monitor its progress and offer support and guidance to Jason.\nAnimal cruelty is illegal in Singapore. First-time offenders can be fined up to $15,000, jailed for up to 18 months, or both.\nRepeat offenders may be fined up to $30,000, jailed for up to three years, or both.\n“The SPCA hopes that the authorities will pursue the maximum possible penalty for those responsible for this heinous act,” Ms Sankar said.\nShe added that there have been growing concerns about the well-being of pets when their care is outsourced to domestic helpers, trainers, groomers and pet boarding businesses.\nIn 2023, SPCA saw 12 instances of domestic helpers being investigated in relation to animal cruelty or welfare cases, which include both active abuse and passive neglect.\nAVS group director Jessica Kwok said the agency was alerted to the incident on Jan 25 and has been investigating it ever since.\n“Safeguarding animal welfare is a shared social responsibility,” she said.\nShe urged members of the public to play their part by promptly reporting suspected cases of animal cruelty or injuries via the AVS website or by calling its Animal Response Centre on 1800-476-1600.\nMs Sankar said: “As pet owners, we are our pets’ best and perhaps only advocate.\n“We urge all pet owners to remain proactive and cautious in ensuring the safety and well-being of their animal companions. This is especially so when entrusting the care of their pets to someone else.”", "url": "https://www.straitstimes.com/singapore/maid-under-probe-for-allegedly-beating-employer-s-dog-to-death-spca"}