{"authors": ["Christine Tan"], "date_download": "2024-10-12 14:01:20", "date_modify": "2024-10-12 14:01:20", "date_publish": "2024-06-03 21:35:00", "description": "The boyfriend has been charged and his case will be heard later in June. Read more at straitstimes.com.", "filename": "singapore_courts-crime_clinic-nurse-gets-jail-for-helping-boyfriend-to-buy-cough-syrup-under-multiple-patients-names_1728741680.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/03/courts-and-crime_0.jpg?VersionId=Z9Gij31TKjDlNquCl56xRQh1FPT9pk4j", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_clinic-nurse-gets-jail-for-helping-boyfriend-to-buy-cough-syrup-under-multiple-patients-names_1728741680.html", "title": "Clinic nurse gets jail for helping boyfriend to buy cough syrup under patients’ names", "title_page": "Clinic nurse gets jail for helping boyfriend to buy cough syrup under patients’ names | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – To help her boyfriend get more cough syrup to abuse, a clinic nurse helped him to buy the substance under other patients’ names in 2021.\nWhen one of the patients discovered her identity had been misused, the clinic hired a private investigator to look into the matter and found out what the nurse had done.\nClinic nurse Tan Tong Lin, 42, was sentenced to five months’ jail on June 3 after she pleaded guilty to two charges under the Computer Misuse Act and one count of engaging in a conspiracy to cheat.\nAt the time of the offences, Tan worked at the Dr Helen Tan Clinic in Jurong East. Court documents did not state when she started working there.\nDeputy Public Prosecutor Yap Jia Jun told the court that the clinic sold cough syrup over the counter without consultation and required patients to provide only their names and NRIC.\nHowever, it had a rule that only 240ml of cough syrup could be sold to a patient over a period of nine days.\nSometime around May 2021, Tan’s boyfriend Ng Kai Loon, 36, asked her to help him buy cough syrup under other patients’ names, so he could circumvent the rule.\nTan logged into the clinic’s patient information system and obtained the details of 65 “inactive” patients who had not returned to the clinic for some time. She then shared this list with Ng.\nIn the next eight months, Tan reactivated the patients’ statuses on at least 25 occasions and recorded Ng’s purchases of cough syrup – two 120ml bottles each time – under their names.\nThe offences were discovered in February 2022 when a patient complained that the clinic allowed others to collect her medication with her identity.\nIt cost the clinic $12,000 to hire the private investigator, who discovered Tan’s misdeeds.\nOn June 3, the court heard that Tan had committed theft and drug offences previously, and had been sent for drug rehabilitation twice.\nHer lawyer, Mr Kalaithasan Karuppaya of Regent Law, said she was remorseful and asked for the court’s leniency.\nIn handing down the sentence, District Judge Terence Tay said Tan’s act of retrieving the NRIC numbers of 65 patients was identity theft, and may have resulted in dire consequences for the victims.\nFor engaging in a conspiracy to cheat, Tan could have been jailed for up to 10 years and fined.\nHer two offences under the Computer Misuse Act carry a maximum fine of $5,000 and $10,000 respectively, or a maximum jail term of two years and three years respectively.\nNg has been charged with two offences under the Computer Misuse Act and one count of engaging in a conspiracy to cheat.\nHe has been remanded for more than two months and has yet to enter a plea. His case will be heard in court later in June.", "url": "https://www.straitstimes.com/singapore/courts-crime/clinic-nurse-gets-jail-for-helping-boyfriend-to-buy-cough-syrup-under-multiple-patients-names"}