{"authors": ["Fatimah Mujibah", "Sherlyn Sim"], "date_download": "2024-10-12 13:33:26", "date_modify": "2024-10-12 13:33:26", "date_publish": "2023-10-18 14:10:00", "description": "The fire involved the contents of the living room and kitchen, said SCDF. Read more at straitstimes.com.", "filename": "singapore_20-people-evacuated-after-fire-engulfs-little-india-flat_1728740006.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/18/aafire18102023.png?h=b9a2002e", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_20-people-evacuated-after-fire-engulfs-little-india-flat_1728740006.html", "title": "20 people evacuated after fire engulfs Little India flat", "title_page": "20 people evacuated after fire engulfs Little India flat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Some 20 people were evacuated from their homes after a fire broke out in a Housing Board flat in Little India on Tuesday night.\nIn a Facebook post, the Singapore Civil Defence Force (SCDF) said it was alerted to a fire in a third-floor flat at Block 662 Buffalo Road, at around 8pm.\n“Before SCDF’s arrival, a man who was inside one of the bedrooms in the affected unit was rescued by police officers and members of the public, through the bedroom window that was facing the corridor,” said SCDF, noting that the man was taken to Tan Tock Seng Hospital.\n“The fire, which involved the contents of the living room and kitchen, was extinguished by SCDF using two water jets. As a result of the fire, the rest of the unit sustained heat and soot damage.”\nIn a TikTok video of the incident circulating online, the inside of a flat can be seen engulfed in flames as black columns of smoke rise from one of the flat’s windows. Shouts and an ambulance siren can be heard in the video.\nWhen The Straits Times arrived at the scene at around 8.45pm, the blaze had been put out, but there was a crowd of up to 50 bystanders opposite the block, watching as the firefighters made their way into the affected flat to inspect it.\nThree fire trucks, two ambulances, five police cars and an SCDF van could be seen near Little India MRT station.\nA cordon that was put up around the block stretched as far as Tekka Centre. A few police officers and firefighters were heard advising the public to stay behind the cordon for their safety.\nPolice officers also directed people to walk over the grass patches instead of using the sheltered area, which had been cordoned off.\nOne bystander, Ms Masitho Sallehuddin, said: “I was walking to the bus stop near Tekka Centre at about 8.30pm, but I stopped after seeing several flashing lights which were (from) the ambulances and SCDF trucks. But the fire was already put out.”\nDespite that, the 26-year-old supervisor at a manpower agency said she remained at the spot for close to an hour to watch the situation unfold.\nA Tekka Centre drink-stall owner, Mr D’Rahman Hassan, said he learnt about the fire from fellow stall owners.\nThe 47-year-old said: “I came to the shop at around 8pm to take money (from the cash box) and I saw that the whole road (near Tekka Market) was blocked, so I asked around to find out what happened.\n“People near my shop said there was a bad fire... Judging by the number of vehicles, it seems like it was very bad and dangerous.”\nThe police and SCDF evacuated about 20 residents from the affected block as a precautionary measure.\nThe cause of the fire is under investigation.", "url": "https://www.straitstimes.com/singapore/20-people-evacuated-after-fire-engulfs-little-india-flat"}