{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:54:35", "date_modify": "2024-10-12 13:54:35", "date_publish": "2024-01-08 05:00:00", "description": "Eye screening may hold the promise of early detection of other diseases too, said an expert. Read more at straitstimes.com.", "filename": "singapore_eyes-can-be-windows-to-early-detection-of-alzheimer-s-disease-singapore-researchers-find_1728741275.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/08/hzeye070124.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_eyes-can-be-windows-to-early-detection-of-alzheimer-s-disease-singapore-researchers-find_1728741275.html", "title": "Eyes can be windows to early detection of Alzheimer’s disease, Singapore researchers find", "title_page": "Eyes can be windows to early detection of Alzheimer’s disease, Singapore researchers find | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The eyes are said to be windows to the soul. Now, they are also peepholes into brain health, researchers at the Singapore Eye Research Institute (Seri) found.\nUsing non-invasive eye scans, the researchers have linked changes in the retina to what happens in the brains of patients with Alzheimer’s disease. Such changes can be detected in the early stages of the disease, when a patient is showing signs of mild cognitive impairment.\nBy studying the differences in the thickness of the nerves and density of blood vessels in the eye, researchers are able to predict and detect early signs of Alzheimer’s disease, the most common type of dementia.\nThe eye is an organ directly connected to the brain, and they share similarities in their nerves and blood vessels. Therefore, when one of these organs gets sick, the other can change in telltale ways, said Seri clinician scientist Jacqueline Chua.\n“The eye is the only place in the body that we can actually visualise both the neurons and the blood vessels without cutting a person up,” she said, adding that the gold standard diagnosis for Alzheimer’s disease is through brain imaging and a lumbar puncture.\nWhile an older study carried out at the Cedars Sinai Medical Centre in the United States used cadavers and tissue samples from human donors to examine potential biomarkers in the retina, linking them to known indicators of Alzheimer’s disease, the Seri team studied the retina of live patients.\nThe Singapore study used devices, such as the optical coherence tomography (OCT) and the optical coherence tomography angiography (OCTA), which employ light waves, to take cross-section pictures of the retina of patients.\nThe OCT allows the eye doctor to see the distinctive layers of the retina, so he can map and measure their thickness, while the OCTA takes pictures of the blood vessels in and under the retina.\nIn the first study, the Seri scientists not only looked at the thickness of the optic nerve, but they also looked at the thickness of nerves around the macular region.\n“When we combine the two, we could actually improve the detection much better than just a single approach,” said Dr Chua, who is also an optometrist at the Singapore National Eye Centre.\nIn a second study, the team used OCTA to measure the density of the blood vessels of 90 patients aged 50 and above. They comprised 24 participants with Alzheimer’s disease, 37 with mild cognitive impairment and 29 controls who were not impaired.\nIt found that the eyes of participants with Alzheimer’s showed significantly sparser vessel density compared with the controls.\n“These retinal imaging devices reveal the thinning of the nerve cells and also microvascular changes associated with Alzheimer’s disease. With this knowledge, doctors are able to intervene earlier and offer preventive strategies,” said Dr Chua.\nAbout one in 10 people aged 60 and above in Singapore is affected by Alzheimer’s disease, which has no effective treatment.\nWith increasing life expectancy in Singapore and a rapidly ageing population, this number is expected to rise.\nProfessor Leopold Schmetterer, scientific director and head of ocular imaging at Seri, said it is not feasible to do mass brain scans to check for Alzheimer’s disease as they are too expensive and too time-consuming.\n“We don’t have enough machines in Singapore and these machines are extremely expensive. Can you imagine putting everyone who is above 60 or 65 into an MRI machine to do a 30-minute MRI scan? It is simply not doable,” he added.\n“We know from our diabetic retinopathy screening programme in Singapore that eye imaging is feasible. Thousands of patients have undergone diabetic retinopathy screening.”\nHe believes eye screening, which is readily available and cost-effective, holds the promise of early detection of not only dementia, but also multiple diseases, including kidney disease, diabetes, cardiovascular disease, brain disease and multiple sclerosis.", "url": "https://www.straitstimes.com/singapore/eyes-can-be-windows-to-early-detection-of-alzheimer-s-disease-singapore-researchers-find"}