{"authors": ["Ang Qing"], "date_download": "2024-10-12 13:44:42", "date_modify": "2024-10-12 13:44:42", "date_publish": "2023-03-03 15:42:44", "description": "The airline declined to reveal how much more the new serviceware costs. Read more at straitstimes.com.", "filename": "singapore_sia-to-review-customer-feedback-after-paper-serviceware-trial-sparks-mixed-reactions_1728740682.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/03/Full-tray-set-up-with-red-lid_0.jpg?VersionId=aUM.9PHwiWtzLlBrOGeUBKC1iMxexz7n", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_sia-to-review-customer-feedback-after-paper-serviceware-trial-sparks-mixed-reactions_1728740682.html", "title": "SIA to review customer feedback after paper serviceware trial sparks mixed reactions", "title_page": "SIA to review customer feedback after paper serviceware trial sparks mixed reactions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore Airlines (SIA) has said it will review feedback from customers before deciding to use paper serviceware on its medium- and long-haul flights.\nThis comes after its trial of paperware on selected economy class and premium economy class flights in March drew mixed reactions from passengers since Tuesday, with some dubbing the move as a cost-cutting measure while others felt that it was a boon for the airline’s sustainability.\nResponding to SIA’s announcement, several people said on the airline’s Facebook page that the move will diminish the airline’s image, rendering it equivalent to a budget airline.\nUser Christine Lim said: “I think what is worse is that this will be served on premium economy flights. Where is the differentiation other than the hardware between economy and premium economy?”\nBut another user Guo Huiling called the decision a great move for sustainability as long as the serviceware serves its intended purpose.\nResponding to queries, an SIA spokesman said it will consolidate all feedback at the end of the trial and review how the airline can further improve its onboard dining experience.\nHe added: “As this new serviceware replaces the casserole dish, it will reduce the amount of single-use plastics on board SIA’s medium- and long-haul flights.\n“We would like to assure all customers that there is no change in the quantity of food in the new serviceware, as compared to the current casserole dish.”\nThe new serviceware is made of Forest Stewardship Council-certified paper and will replace the current disposable plastic casserole dish that is covered with an aluminium foil. The council is a non-governmental organisation promoting responsible management of the world’s forests.\nThe trial was first implemented on selected flights to and from Hong Kong in February, before being expanded to 11 more destinations including London, Seoul and Sydney, until March 25.\nSIA senior vice-president for customer experience Yeoh Phee Teik said: “We have spent many months and invested resources in developing this new serviceware.\n“While it costs more than the current serviceware, it allows us to act on customer feedback by improving and expanding our in-flight meal offerings in premium economy class and economy class on medium- and long-haul flights.”\nThe airline declined to reveal how much more the new serviceware costs.\nIn a separate statement to the media, SIA said the new and improved serviceware also has a secure lid, which means it is better able to retain heat and moisture while enhancing the taste and texture of its main courses.\n“The lid also allows SIA to offer our customers soupy and gravy-based dishes, which were previously not available in premium economy class and economy class on medium- and long-haul flights,” it said.\nMr Andrew Yeo, associate director of outreach at Zero Waste SG, suggested that SIA could find other ways to fulfil environmental obligations.\nHe said: “Based on the pictures, some passengers are unhappy about the prestige of SIA through their serviceware, which appears to be lacklustre compared to the pre-Covid era.”\nSingle-use paperware can also create more wastage, he noted.\nSaid Mr Yeo: “What would be good to drive a more substantial sustainable practice is to encourage passengers to make their food choices early and pre-book their meals for the flight.\n“Not only would that result in lower food waste, but the aircraft’s load would also be significantly lighter, thereby allowing for better efficiency for the flight.”", "url": "https://www.straitstimes.com/singapore/sia-to-review-customer-feedback-after-paper-serviceware-trial-sparks-mixed-reactions"}