{"authors": ["Amanda Lee"], "date_download": "2024-10-12 14:21:20", "date_modify": "2024-10-12 14:21:20", "date_publish": "2023-10-11 17:20:00", "description": "Singapore and Malaysia in July had also agreed to set up a task force to work out a possible special economic zone. Read more at straitstimes.com.", "filename": "singapore_singapore-johor-relations-have-grown-under-johor-sultan-s-leadership-pm-lee_1728742880.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/11/yumcipmlee1110.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-johor-relations-have-grown-under-johor-sultan-s-leadership-pm-lee_1728742880.html", "title": "Singapore-Johor relations have grown under Johor Sultan’s leadership: PM Lee", "title_page": "Singapore-Johor relations have grown under Johor Sultan’s leadership: PM Lee | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Prime Minister Lee Hsien Loong said the relationship between Singapore and Johor has grown under Sultan Ibrahim Iskandar’s “wise leadership”, after he hosted the Johor ruler and other royals for dinner at the Istana on Tuesday.\n“We have launched ambitious projects to improve trade and connectivity, including the RTS Link (Johor Bahru-Singapore Rapid Transit System), and look forward to commencing discussions on a Johor-Singapore special economic zone,” PM Lee wrote in a Facebook post on Wednesday.\nThe RTS Link is a 4km-long cross-border rail shuttle service built to alleviate congestion on the Causeway.\nWhen it starts operating, likely by end-2026, people will be able to commute from Bukit Chagar in Johor Bahru to Woodlands North in Singapore, and vice versa, in about five minutes.\nSingapore and Malaysia in July had also agreed to set up a task force to work out the terms of reference and broad areas of collaboration for a possible Johor-Singapore special economic zone. The project will likely be discussed at the Singapore-Malaysia Leaders’ Retreat in October.\n“Johor is Singapore’s gateway to Malaysia,” PM Lee said. “More than neighbours, Singapore and Johor are partners linked by generations of friendship and kinship.”\nSultan Iskandar also noted in his Facebook post on Tuesday evening that Johor and Singapore, which are bound by geography and a shared history, could work together to “produce win-win outcomes with tangible benefits for their people and businesses”.\nAlso present at Tuesday’s dinner at the Istana were PM Lee’s wife, Mrs Lee, Johor Queen Raja Zarith Sofiah, Johor Crown Prince Tunku Ismail Ibrahim and his wife, Che’ Puan Besar Khaleeda, as well as Law and Home Affairs Minister K. Shanmugam and his wife, Dr Seetha Shanmugam.\nPM Lee also said that Sultan Ibrahim served him a very “sedap” (delicious) nasi ulam that he had requested during his last visit to Johor. Nasi ulam is a traditional Malay herb rice salad.\n“I reciprocated his gracious hospitality by serving him crab curry along with some of his other favourite local dishes,” PM Lee wrote, adding that they also met at the Formula 1 Singapore Grand Prix in September.", "url": "https://www.straitstimes.com/singapore/singapore-johor-relations-have-grown-under-johor-sultan-s-leadership-pm-lee"}