{"authors": ["Justin Ong"], "date_download": "2024-10-12 13:46:32", "date_modify": "2024-10-12 13:46:32", "date_publish": "2022-05-07 17:40:31", "description": "It also organised a bazaar to support underprivileged women, and issued a call to honour and recognise caregivers. Read more at straitstimes.com.", "filename": "singapore_community_pap-marks-mothers-day-by-raising-50000-for-charity-and-honouring-caregivers_1728740792.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/07/wgt-papmothersday-070522.jpg?VersionId=QW3JMF99YfkInk0IM1i6jVWP6C1Aa08E", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_community_pap-marks-mothers-day-by-raising-50000-for-charity-and-honouring-caregivers_1728740792.html", "title": "PAP marks Mother's Day by raising $50,000 for charity and honouring caregivers", "title_page": "PAP marks Mother's Day by raising $50,000 for charity and honouring caregivers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The People's Action Party (PAP) on Saturday (May 7) marked Mother's Day by raising $50,000 for charity, organising a bazaar to support underprivileged women, and issuing a call to honour and recognise caregivers.\nSpeaking at a physical event at NTUC Centre in Marina Boulevard, Communications and Information Minister Josephine Teo, who chairs the PAP Women's Wing, said this year's event was special because it is coming on the heels of \"a major milestone for all Singaporean women\": a White Paper on Singapore Women's Development that was endorsed by Parliament last month.\n\"It is the first time in Singapore's history that there's been such a White Paper. This fact alone is significant,\" Mrs Teo told an audience of around 200 PAP MPs, activists, union members and partners. \"While women's development will always be a journey without end, we appreciate the Government's commitment to this major milestone.\"\nThe Paper lays out a 10-year road map to ensure all women here have greater access to opportunities and more equal partnerships with men, among other recommendations.\nMrs Teo said it was part of the PAP Women's Wing's tradition for Mother's Day - held on May 8 annually - to raise funds to help the vulnerable in society.\nSaid Tanjong Pagar GRC MP and organising chair of the event Joan Pereira: \"We hope fellow Singaporeans will do likewise to help the vulnerable in our midst.\"\nShe announced that the PAP's Women's Wing and Community Foundation had jointly raised $50,000 for five charities located within the Central Singapore District: the Dyslexia Association of Singapore, Homeless Hearts of Singapore, Home Nursing Foundation Senior Activity Centre, Montfort Care-Kreta Ayer Family Services and Reach Family Service Centre (Bishan).\nThe event was also attended by Minister in the Prime Minister's Office Indranee Rajah, Minister of State for Education and Manpower Gan Siow Huang, and other PAP MPs.\nIt included a bazaar with six social enterprises - Green Cube, Sewing Mums, the Singapore Council of Women's Organisations, Singapore Fashion Runway, United Women Singapore and the Young Women's Christian Association - selling products to raise funds for the underprivileged.\nMs Pereira and Mrs Teo also noted in their speeches that a key focus area of the Women's White Paper was better recognition and support for caregivers - the majority of whom are still women.\n\"We know of many caregivers around us who continue to juggle multiple roles in the family and in the workplace, and they all need our support, whether from the Government, from companies or from each of us in society,\" said Ms Pereira.\nThis was the case for Ms Ann Chong, a 52-year-old mother of two, who took to the stage to share how her employer allowed her to bring her 18-year-old son with special needs to work with her, and how he had a teacher who helped nurture his artistic talent.\nHomemaker Yasmin Nisha, 31, also spoke of the challenges in looking after her 69-year-old wheelchair-bound grandmother, on top of her own four children aged from three months to nine years old.\nMs Yasmin had to leave her job as a clinic assistant to focus on her caregiving duties, but gets a hand from her eldest daughter. The girl helps her younger sister - who is in Primary 1 - with homework and by accompanying her to various activities.", "url": "https://www.straitstimes.com/singapore/community/pap-marks-mothers-day-by-raising-50000-for-charity-and-honouring-caregivers"}