{"authors": ["Sarah Koh"], "date_download": "2024-10-12 13:55:56", "date_modify": "2024-10-12 13:55:56", "date_publish": "2024-04-01 13:20:00", "description": "Dr Tang Kong Choong helped set up the hospital's intensive care unit headquarters during the pandemic. Read more at straitstimes.com.", "filename": "singapore_health_tan-tock-seng-hospital-appoints-saf-s-former-chief-of-medical-corps-as-new-ceo-from-april-1_1728741356.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/01/aittsh010424.png?VersionId=QK6FJA948SnLjuPvtTaBOrQ5QVjHkjUa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_tan-tock-seng-hospital-appoints-saf-s-former-chief-of-medical-corps-as-new-ceo-from-april-1_1728741356.html", "title": "Tan Tock Seng Hospital appoints SAF’s former chief of medical corps as new CEO from April 1", "title_page": "Tan Tock Seng Hospital appoints SAF’s former chief of medical corps as new CEO from April 1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Dr Tang Kong Choong, the former chief of the Singapore Armed Forces (SAF) Medical Corps, took over as the new chief executive of Tan Tock Seng Hospital (TTSH) on April 1.\nDr Tang succeeds Professor Eugene Fidelis Soh, who has been in the role since 2015, the hospital said in a statement on the same day. Dr Tang joined TTSH in 2020 and served as a senior consultant in the Department of Anaesthesiology, Intensive Care and Pain Medicine.\nThe statement said he had “crucially contributed” to the setting-up of TTSH’s intensive care unit headquarters, emergency planning, and operations command during the Covid-19 pandemic.\nHe assumed the role of assistant chief executive of the hospital from April 2021, and subsequently became deputy chief executive in April 2022.\nWhen he was at the SAF Medical Corps, where he was its chief between 2015 and 2019, he was responsible for the planning of naval medical support after the 2004 Indian Ocean tsunami when assistance was deployed to Indonesia.\nHe also did a three-week stint in Afghanistan in 2008 to prepare for SAF’s first medical team deployment to that country.\n“Dr Tang brings with him a wealth of experience in leadership, resource planning, crisis management and operational readiness,” said TTSH in the statement.\n“As the new chief executive of TTSH, (he) will lead the hospital in advancing tertiary care for patients and developing a robust academic mission for the future.”\nProf Soh took on a new role at the National Healthcare Group (NHG) on April 1 as the deputy group chief executive of population health. He will help with strategies to “build a healthy and engaged population” in the central and northern parts of Singapore, said the statement.\nIt added that Prof Soh “brought TTSH to a new level” during his tenure, as the hospital grew in size and capabilities with the setting-up of the National Centre for Infectious Diseases and TTSH Integrated Care Hub. “He was a calm and steady hand in leading the hospital’s response to Covid-19 during the prolonged pandemic,” TTSH said.\nProf Soh has also been appointed as executive director of the Centre for Healthcare Innovation (CHI) and continues in his role as chairman of CHI’s co-learning networks. He will be leading CHI in expanding its efforts to support healthcare innovation at NHG’s campuses.", "url": "https://www.straitstimes.com/singapore/health/tan-tock-seng-hospital-appoints-saf-s-former-chief-of-medical-corps-as-new-ceo-from-april-1"}