{"authors": ["Zhaki Abdullah"], "date_download": "2024-10-12 13:54:45", "date_modify": "2024-10-12 13:54:45", "date_publish": "2024-04-08 05:00:00", "description": "The NEA advises those who are outdoors to apply sunscreen of at least SPF 30 and reapply it every two hours. Read more at straitstimes.com.", "filename": "singapore_health_extreme-uv-index-levels-what-you-should-know-about-applying-sunscreen_1728741285.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/08/iStock-1164728767.jpg?VersionId=yctZiPZMnP63519jTKYdcQ5sXcYM0.y8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_extreme-uv-index-levels-what-you-should-know-about-applying-sunscreen_1728741285.html", "title": "Extreme UV index levels? What you should know about applying sunscreen", "title_page": "Extreme UV index levels? What you should know about applying sunscreen | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - “Wear sunscreen. If I could offer you only one tip for the future, sunscreen would be it,” goes the 1997 hit spoken word song Everybody’s Free (To Wear Sunscreen) written by Australian film-maker Baz Luhrmann.\nThe National Environment Agency (NEA) dished out the same advice, after the ultraviolet (UV) index hit extreme levels in late March.\nThe UV index – which describes the level of solar UV radiation on the earth’s surface on a scale of zero to 15 – hit 12 at about 12.45pm on March 27.\nUV index readings of 11 and above are considered extreme, while those between eight and 10 are considered very high. When UV index readings are in either band, the NEA advises extra protection against sunburn.\nAccording to the NEA, it is common for the UV index to reach very high and extreme levels between 11am and 3pm on a day with little cloud cover.\nThe months of February, March, April and September usually experience the highest UV radiation.\n“Overexposure to UV radiation can cause damage to the skin and eyes, and suppress the immune system,” said dermatologist Heng Jun Khee from DermAlly Specialist Skin Clinic and Surgery.\nResearch shows that between five and 30 minutes of sun exposure twice a week can be healthy as it allows the skin to produce vitamin D, which the body needs to absorb calcium and maintain its bone structure.\nBut excessive exposure to UV radiation can cause acute effects such as sunburn, as well as phototoxic and photoallergic reactions, while the chronic effects of excessive UV radiation include skin cancers such as melanoma and eye conditions such as cataracts.\nNEA advises those who are outdoors to take protective measures to guard against UV exposure by using umbrellas and wearing hats and sunglasses, as well as applying sunscreen of at least SPF 30 and reapplying it every two hours.\nRegarding the type of sunscreen to use, Dr Heng said: “The higher the SPF, the better protection it will offer against UVB radiation.”\nDr Tan Kian Teo, a dermatologist with Skin Physicians, recommends getting a sunscreen with broad spectrum protection against UVA and UVB radiation, in addition to blue light if possible.\nUVB radiation causes sunburn as well as melanoma and other types of skin cancer, while UVA radiation – together with blue light, which is part of the visible light spectrum – is more closely associated with skin ageing.\nDr Heng said the sunscreen should also be water-resistant, to ensure it remains on wet or sweaty skin for some time before it needs to be reapplied.\nDr Tan said the amount of protection provided by sunscreen does not increase significantly beyond SPF 30.\n“The protection from SPF 30 is about 97 per cent, whereas that from SPF 50 is only slightly more, at 98 per cent,” he said.\nHowever, Dr Heng said many dermatologists recommend using a sunscreen of SPF 50 or greater to provide better protection against UV radiation, as not many people apply the correct amount of sunscreen or reapply it when needed.\n“To achieve the SPF labelled on a sunscreen bottle, you need to apply two to three finger lengths’ worth, which is equivalent to half a teaspoon, to the face and neck,” she said.\nSunscreen should be generously applied to all exposed skin at least 15 minutes before going outdoors, she said.\nIt should also be reapplied every two hours in a setting of ongoing sun exposure or immediately after swimming or sweating.\nSaid Dr Heng: “Sunscreen is a topical product containing chemicals that are first absorbed by the skin, and then it absorbs UV radiation by converting it into heat, preventing it from damaging the skin.”\nChemical sunscreen typically contains one or more chemicals such as oxybenzone – an organic compound which absorbs UVA rays – or octocrylene, which absorbs UVB and short-wave UVA radiation.\nThe difference between sunscreen and sunblock is that while the former absorbs UV rays, the latter reflects UV rays.\nDr Heng said that since 2011, the US Food and Drug Administration has banned the use of the term “sunblock”, in addition to other descriptions such as “waterproof” and “sweatproof”, claiming that such terms overstate the effectiveness of such products.\nHence, sunblock is now commonly referred to as physical or mineral sunscreen.\nThese physical or mineral sunscreens typically contain zinc oxide and titanium dioxide – naturally occurring minerals which provide broad spectrum protection and which sit on the surface of the skin, rather than get absorbed by the skin – that reflect UV radiation away from the body.\nDr Heng said: “If you have sensitive skin, choose a physical sunscreen, as it is less irritating than chemical sunscreen.”\nThe US-based Centre for Surgical Dermatology suggests that chemical sunscreen may provide more complete UV protection than physical sunscreen, adding that it is more effective at resisting water and sweat.\nIt is a misconception that those with darker complexions do not require sunscreen, the experts said.\n“While skin cancer is less common among people with darker skin, studies have shown that they tend to be diagnosed later and at a worse stage, which is more challenging to treat,” said Dr Heng.\nShe also advised that people check the UV index to help plan outdoor activities to prevent sun overexposure.\nDr Tan said that beyond applying sunscreen, people should avoid outdoor activities between 10am and 4pm, when the sun is at its strongest.\n“Apart from using a sunscreen, one can consider wearing hats with broad brims and clothes that provide a physical barrier against the sun,” he added.\nSimply Science is a new fortnightly series looking at the science behind everyday questions.", "url": "https://www.straitstimes.com/singapore/health/extreme-uv-index-levels-what-you-should-know-about-applying-sunscreen"}