{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 14:20:12", "date_modify": "2024-10-12 14:20:12", "date_publish": "2023-02-27 13:34:07", "description": "The funding for events included networking sessions, forums, webinars and festive celebrations. Read more at straitstimes.com.", "filename": "singapore_politics_programme-to-engage-overseas-singaporeans-has-disbursed-570000-for-close-to-300-events_1728742812.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/27/aisg2702_5.jpg?VersionId=eG_hdbJ7p1Z7EP_lyxzuvd0gh.at1bkD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_programme-to-engage-overseas-singaporeans-has-disbursed-570000-for-close-to-300-events_1728742812.html", "title": "Programme to engage overseas Singaporeans has disbursed $570,000 for close to 300 events", "title_page": "Programme to engage overseas Singaporeans has disbursed $570,000 for close to 300 events | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Singapore Global Network Funding Programme, which helps engage overseas Singaporeans, disbursed about $570,000 and supported close to 300 events between Aug 2020 and Dec 2022, said Minister of State for Trade and Industry Low Yen Ling.\nThe funding for events included networking sessions, forums, webinars, festive celebrations, and partnerships on digital content creation.\nAbout two-thirds of applications for the programme were successful, she added.\nThese efforts help in the “broadening and deepening our overseas ties and network with family, friends and fans of Singapore”, Ms Low said in response to a question raised by Workers’ Party MP Gerald Giam (Aljunied GRC).\nThe programme has reached out to around 25,000 participants in more than 20 countries such as Australia, China, the United Kingdom and the United States, where many overseas Singaporeans, including students, are based.\nThe Singapore Global Network (SGN) was set up in June 2019 for an overseas community of professionals and friends seeking to deepen connections in Singapore and across the globe.\nThe Singapore Global Network Funding Programme was then launched in August 2020 to help support the network’s goals and activities.\nMs Low said the aim of the SGN is to promote networking and collaboration amongst Singaporeans and friends of Singapore.\n“Especially during the height of Covid-19, it was so important to make sure that they remain connected to Singapore,” she added.\nAnd despite the pandemic, during which organising events was difficult, the network now has more than 100,000 members around the world, including 15,000 C-suite executives, and close to 300 partners that it collaborates with on various partnerships and initiatives, said Ms Low.\n“The SGN team is also open to working with overseas Singaporeans who are exploring to come back to Singapore to work or to have them come back because of their kids’ education.”", "url": "https://www.straitstimes.com/singapore/politics/programme-to-engage-overseas-singaporeans-has-disbursed-570000-for-close-to-300-events"}