{"authors": ["Kolette Lim"], "date_download": "2024-10-12 14:21:04", "date_modify": "2024-10-12 14:21:04", "date_publish": "2024-04-10 18:29:03", "description": "His Royal Highness Tunku Ismail and the ministers reaffirmed the strong ties between Singapore and Johor. Read more at straitstimes.com.", "filename": "singapore_s-pore-ministers-attend-johor-royal-family-s-hari-raya-open-house_1728742864.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/10/HZJOHOR100424.jpg?VersionId=7VnhDyGvKw4qjGFWmA_lMxTXDVjLXxFL&h=8b3aad8b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-ministers-attend-johor-royal-family-s-hari-raya-open-house_1728742864.html", "title": "Singapore ministers attend Johor royal family’s Hari Raya Open House", "title_page": "Singapore ministers attend Johor royal family’s Hari Raya Open House | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Two Cabinet ministers continued an annual tradition when they attended the Johor royal family’s Hari Raya Open House on April 10.\nDuring their visit, Health Minister Ong Ye Kung and Transport Minister Chee Hong Tat were hosted to lunch by the Regent of Johor Tunku Ismail at Istana Bukit Serene.\nOver lunch, Tunku Ismail and the ministers reaffirmed the strong and historic ties between Singapore and Johor, said the Ministry of Foreign Affairs in an April 10 statement.\nThe ministers also conveyed their Hari Raya greetings to the Malaysian King, Sultan Ibrahim Iskandar, and Queen Raja Zarith Sofiah.\nThe visit reflects the enduring relations between Singapore and Johor, added the statement.\nIn a Facebook post on April 10, Mr Ong thanked the royal family for its hospitality.\nHe said: “Singapore values our ties with our Johorean friends. We will continue to work on various projects, such as the Johor-Singapore Special Economic Zone, that are beneficial to both sides, and further strengthen the people-to-people and economic ties between us.”", "url": "https://www.straitstimes.com/singapore/s-pore-ministers-attend-johor-royal-family-s-hari-raya-open-house"}