{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 13:43:09", "date_modify": "2024-10-12 13:43:09", "date_publish": "2024-06-30 05:00:00", "description": "By April 2026, departing passengers will pay $55 in aviation and airport charges, up from $29 now. Read more at straitstimes.com.", "filename": "singapore_transport_higher-fees-at-seletar-airport-for-passengers-aircraft-operators-from-july_1728740589.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/30/s1.jpg?VersionId=hcLBUJ3O6BAFBc8Jz3zR.RAbLTW8dDMe&h=ec2fd788", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_higher-fees-at-seletar-airport-for-passengers-aircraft-operators-from-july_1728740589.html", "title": "Higher fees at Seletar Airport for passengers, aircraft operators from July", "title_page": "Higher fees at Seletar Airport for passengers, aircraft operators from July | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Travellers flying out of Seletar Airport and those operating flights there will have to pay higher fees and levies from July 1 to cover rising operation and regulatory costs, said the Civil Aviation Authority of Singapore (CAAS) and airport operator Changi Airport Group (CAG).\nThe passenger service and security fee (PSSF), which goes to CAG, will go up from $25.90 to $41 in July. It will rise again to $44 from April 2025, and then to $47 from April 2026, The Straits Times has learnt.\nThese changes will bring the fee at Seletar Airport roughly in line with the $46.40 PSSF that CAG currently charges departing passengers at Changi Airport. CAG has said that the fee helps fund its operations and also goes towards infrastructure upgrading.\nAt the same time, the aviation levy by CAAS that departing passengers also have to pay will go up at Seletar Airport from $3.10 to $8, which is the same as what the authority is charging departing passengers at Changi.\nThe levy helps fund the authority’s air hub development and regulatory functions. According to its latest annual report, CAAS collected $89.8 million in aviation levies in the financial year ended March 31, 2023, making it the authority’s second-largest source of income that year.\nThe PSSF and the aviation levy are charged when passengers buy an air ticket, and these are on top of the airfare. They apply to paying travellers departing on commercial airlines, as well as those on private jets and some chartered flights, depending on the flight’s purpose.\nWith these hikes, passengers departing Seletar will pay a total of $49 in aviation and airport charges from July, up from a total of $29 now. This will go up to $52 from April 2025, and $55 from April 2026.\nAircraft operators like aircraft charter companies, flying schools and Malaysian budget carrier Firefly, which flies turboprop planes between Seletar and Subang near Kuala Lumpur, have not been spared either.\nFrom July, aircraft landing and parking charges at the airport will go up, and these charges will continue to rise in 2025 and 2026.\nA new minimum departure flight charge levied on aircraft operators will also be introduced, and it will be set at $1,100 per flight.\nCAAS director for airport economic regulation Charmaine Peck and Seletar Airport general manager Chua Ching Hock said the fee revisions will allow Seletar Airport to better recover the cost of operations, and the new minimum charge better reflects the use of facilities and services there.\nThey said Seletar Airport’s fees and charges have not changed since 2018 despite inflationary pressures pushing costs up. The aviation levy for Seletar has also remained unchanged for 13 years.\nPlans to raise fees at Seletar Airport in early 2020 were shelved due to the impact of the Covid-19 pandemic, they added.\nWith the recovery of the aviation sector, CAG conducted a review of the airport’s fees in January and took in industry feedback. The new charges were approved and finalised in March.\nTraffic at Seletar Airport has surpassed pre-Covid-19 levels and as at November 2023, runway utilisation was also near capacity, according to a written parliamentary reply.\nSeletar Airport mainly handles business and general aviation activities, including pilot training flights and flights for maintenance, overhaul and repairs. It also has a small proportion of scheduled commercial flights, like those by Firefly.\nPurdue University’s associate professor of aviation management Volodymyr Bilotkach said he does not foresee Firefly having major issues filling up flights despite the higher passenger charges, though it may sell fewer seats at its lowest price points.\nMr Shukor Yusof, founder of aviation consultancy Endau Analytics, on the other hand, said Firefly will have to reconsider its presence at Seletar.\nIt will have to think about whether it may be better to deploy larger aircraft and fly from Changi Airport, or to stop flying to Singapore altogether, he added. Currently, Firefly operates six daily flights from Seletar to Subang.\nMr Abbas Ismail, course chair of the diploma in aviation management at Temasek Polytechnic, said that compared with the fees Firefly used to pay when it operated from Changi Airport, the revised charges at Seletar are still lower. He added that the impact of the higher airport fees on Firefly may be recovered from passengers through higher ticket prices.\nIn response to queries, Firefly said the upcoming increases to airport charges and levies are expected to impact operational and travel costs.\n“We are actively reviewing our cost structures and operational efficiencies to minimise any potential impact on our customers. Additionally, we are exploring strategic initiatives aimed at enhancing revenue streams and maintaining competitive pricing,” the airline added, without providing details.\n“Given the uncertainties in the current economic and travel landscape, we are mindful of consumers’ price sensitivity and remain dedicated to providing stability and ensuring a seamless travel experience,” Firefly said.\nPublic relations executive Au Yeong Siew Pheng, 45, who takes Firefly flights from Seletar Airport once or twice a year to visit her parents in Petaling Jaya in Malaysia, said she will still fly with the budget carrier even with the higher passenger fees, as it is more convenient and saves her time.\nShe said Subang Airport is about 20 minutes away from her parents’ home, while the alternative, Kuala Lumpur International Airport, is an hour away. Furthermore, at Subang and Seletar, she needs to check in only about an hour before the flight.\nShe added: “If I travelled weekly to Kuala Lumpur for work, maybe the impact of the higher fees would be bigger, and I may have to reconsider the frequency or mode of travel.”\nMs Phung Siyen, who in her late 30s and moved from Malaysia to Singapore for her work in the energy sector, also said she will continue to travel with Firefly as her considerations are similar to Ms Au Yeong’s.\n“With inflation and rising prices for fuel, it is a reasonable fee hike. The airport needs to be maintained somehow,” she said.\nAviation analysts said a revision of Seletar Airport’s fees is justified, given the higher-than-usual inflation during and after the pandemic. The airport is also not alone in raising its fees.\nIn March, the Malaysian Aviation Commission announced a move to increase the service charge for passengers flying out of Malaysian airports to other Asean countries from June.\nFees and levies at Changi Airport were also raised in 2022, with the total departure fee for passengers – which includes an airport development levy – going up from $52.30 then to $65.20 now.\nMr Shantanu Gangakhedkar, aerospace and defence senior consultant at research and consulting firm Frost & Sullivan, said airports globally are looking at increasing their charges as the costs of labour, fuel and other utilities have gone up.\nCharging higher fees will also allow airport operators to improve the travel experience, he said.\nNoting that Seletar Airport was upgraded with an $80 million passenger terminal in 2018, Temasek Polytechnic’s Mr Abbas said fee revisions were necessary but withheld because of Covid-19.\n“Now that air traffic has recovered, the revision is therefore timely,” he added.\nMr Shukor said the higher fees are unlikely to deter visitors, especially since Seletar is a niche airport used mostly by the wealthy, and Singapore remains an attractive destination.\nProf Bilotkach said the increase in demand at Seletar may be another reason why the charges are being raised. He said the higher fees may help to ensure the airport grows sustainably, without creating a capacity crunch.\n“In particular, the minimum charge may be aimed at pricing out small planes, which use up runway capacity in about the same way as the larger ones,” he added.", "url": "https://www.straitstimes.com/singapore/transport/higher-fees-at-seletar-airport-for-passengers-aircraft-operators-from-july"}