{"authors": ["Joyce Teo"], "date_download": "2024-10-12 14:20:51", "date_modify": "2024-10-12 14:20:51", "date_publish": "2024-06-16 16:20:00", "description": "The Father's Day event highlights the bigger parenting role that fathers now play. Read more at straitstimes.com.", "filename": "singapore_baby-wearing-dads-celebrate-fathers-day-with-record-breaking-walk-in-s-pore_1728742851.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/16/2024061641837940gin2466.jpg?VersionId=UWTsgevcr9uX5URZ3yQipcvrL4B_.cbn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_baby-wearing-dads-celebrate-fathers-day-with-record-breaking-walk-in-s-pore_1728742851.html", "title": "Baby-wearing dads celebrate Father’s Day with record-breaking walk in S’pore", "title_page": "Baby-wearing dads celebrate Father’s Day with record-breaking walk in S’pore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Thirty-eight fathers, wearing their babies, celebrated Father’s Day on June 16 by taking part in a noon-time 1km walk at the Singapore Sports Hub, setting a record for the “Most Number of Dads in a Baby-wearing Walk” in the Singapore Book of Records.\nThe first-ever baby-wearing walk was held as part of 2024’s Dad’s Day Out, the culminating point of the Celebrating Fathers event, which encourages fathers to embrace play as an integral part of the bonding process in their parenting journey. It was held at OCBC Square, just outside Kallang Wave Mall.\nFathers strapped their babies and toddlers – ranging from three months old to three years old – to their chests with slings or baby carriers. Two fathers even wore two children each – one strapped to the front, and the other strapped to the back.\nMr Mark Barnabas Lee, 45, who wore his one-year-old daughter Makayla for the walk, said the event was a good opportunity for fathers to cultivate a love for physical activity and the outdoors in their children.\nThe sports event organiser added that he takes regular walks in the parks with his child and wife Caterin, 37.\nHe took his daughter to the pool recently and is already making plans to take her cycling when she is older, emphasising the importance of letting children play outdoors.\nMr Lee said he spends all his recreational time with his child, and is very much involved in parenting.\nThe couple share parenting duties to ensure his wife gets time off from caring for the baby. For instance, when he takes over caring for Makayla from 5am to 7am on a weekend morning, she gets her me-time in the gym.\nMinister for Transport Chee Hong Tat, who flagged off the walk, said he was heartened to see many fathers there who are involved in family life, sharing the responsibility of bringing up the children and spending quality time with them.\n“We know it is not easy to be able to manage the demands of work and family life, but I’m sure all the fathers here, everyone here, will agree that coming home to the delightful faces of our children is one of the most magical experiences we can have. (It’s) something very special,” he added.\nMr Chee has a 24-year-old son and three daughters, aged 21, 18 and 13, with his wife, a former teacher.\n“Families are the cornerstone and bedrock of Singapore society and our government policies will continue to strengthen the role of families and help everyone, help all families to be able to realise their hopes and dreams,” he said.\n“In recent years, we have enhanced the caregivers grant. We’re putting more investment in pre-schools. We’ve increased support for young couples buying their first HDB flat, and many more. We will continue to review and update our policies to address the changing needs and aspirations of our families.”\nCelebrating Fathers is jointly organised by non-profit organisation Centre for Fathering, the Dads for Life and Mums for Life movements, and broadcaster Mediacorp, in partnership with the Families for Life movement. It was first launched in 2016.", "url": "https://www.straitstimes.com/singapore/baby-wearing-dads-celebrate-fathers-day-with-record-breaking-walk-in-s-pore"}