{"authors": ["Clara Chong"], "date_download": "2024-10-12 13:31:15", "date_modify": "2024-10-12 13:31:15", "date_publish": "2021-06-10 19:47:47", "description": "Only after the local situation is stable will Singapore have space to think about how its borders can be relaxed. Read more at straitstimes.com.", "filename": "singapore_restarting-local-economy-a-priority-before-adjusting-border-controls-gan_1728739875.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/06/10/hzairport100621.jpg?VersionId=qRl9dOTeAG2f9AQG7qJJyx0x9t2d8xUy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_restarting-local-economy-a-priority-before-adjusting-border-controls-gan_1728739875.html", "title": "Restarting Singapore economy a priority before adjusting border controls: Gan Kim Yong", "title_page": "Restarting Singapore economy a priority before adjusting border controls: Gan Kim Yong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Reopening Singapore's local community and restarting the economy in a safe manner is the Government's immediate priority before border measures can be eased.\nOnly after the local situation is stable will Singapore have space and capacity to think about how its borders can be relaxed, Trade and Industry Minister Gan Kim Yong, who co-chairs the multi-ministry task force tackling the Covid-19 pandemic, said in a virtual press conference on Thursday (June 10).\nWhen asked if expatriates who have called Singapore their home but currently live outside the country will have a chance to return, Mr Gan said: \"We are very conscious that there are expats who are coming back to Singapore, they have been staying here and working from Singapore for many years... we are constantly reviewing our border control measures.\"\n\"In the immediate future, or the next couple of weeks, our focus is... opening up our local community and restarting our economy, allowing more people to gather and allowing dining in to commence.\"\nSingapore is also ramping up its vaccination programme to protect the local population, as well as stepping up its testing and contact-tracing capabilities.\nWith these enhanced capabilities, it will allow the nation to relook its border control measures.\nThe Government has also put in place stringent protocols at the airports to minimise the risk of transmissions.\nOnce all these are in place, Singapore will be able to adjust its border controls.\nMr Gan noted that many Singaporeans and expats are still overseas and planning to return.\n\"But the priority now is to ensure that the local situation is stable and we are able to proceed with this phase three (heightened alert) opening in a safe way. And then after that, then we will have more capacity to talk about adjusting our border measures.\"", "url": "https://www.straitstimes.com/singapore/restarting-local-economy-a-priority-before-adjusting-border-controls-gan"}