{"authors": ["Jessie Lim"], "date_download": "2024-10-12 13:31:31", "date_modify": "2024-10-12 13:31:31", "date_publish": "2022-06-26 05:00:00", "description": "ST's journalist tries out the various facilities designed to measure front-liners' fitness. Read more at straitstimes.com.", "filename": "singapore_new-high-tech-research-and-training-lab-by-scdf-htx-helps-officers-keep-fit_1728739891.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/R7bJOBp7LdreOE4PT2ttfmkHMlDKjXXnD35eMUsvSe0.jpg?VersionId=TBuWgrMoiNS6gfS8eMO47V5L7SCNQFkX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_new-high-tech-research-and-training-lab-by-scdf-htx-helps-officers-keep-fit_1728739891.html", "title": "New, high-tech research and training lab by SCDF, HTX helps officers keep fit", "title_page": "New, high-tech research and training lab by SCDF, HTX helps officers keep fit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - On June 10, the Singapore Civil Defence Force (SCDF) launched a new research and training facility in collaboration with the Home Team Science and Technology Agency (HTX).\nIt provides data-driven insights into how emergency responders across the Home Team can improve operational performance.\nOn Thursday (June 23), this reporter tried out various facilities at the new Emergency Responders’ Fitness Conditioning and Enhancement Lab (Excel) that measures how front-liners fare in attributes such as agility and lower limb strength.\nOccupying an area more than 1,200 sq m, Excel also has high-tech equipment such as a temperature-controlled chamber, driving simulators and mixed reality systems to help train SCDF officers to handle situations from road accidents to fires.\nStrength, Conditioning and Rehabilitation in Virtual Environment (Strive)\nAt Strive, the Excel team analyses the gait patterns of emergency responders to predict their risk of injury and fatigue rate.\nI saw how a motion capture system and dual-belt treadmill work in tandem with sensors to detect muscle activation patterns and joint movements of users while they walk.\nAfter running on the treadmill for 3½ minutes, the team analysed my results and found that both my ankles are pronated, or roll inwards, slightly.\nThis is because I am flat-footed, and it means I may be more prone to ankle injuries.\nNow I understood why I have repeatedly twisted my left ankle over the years.\nStrive can also simulate certain challenging working environments to condition front-liners for uneven terrain. For instance, responders in marine units can experience what it is like to be navigating through rough seas.\nFitness Evaluation Lab\nVarious components of physical fitness are measured in the Fitness Evaluation Lab, which was my next destination.\nHTX senior scientist Leong Hin Fong gave me a dynamometer - which assesses muscular strength - and instructed me to grip it as hard as I can.\nAlthough I tried my best, the device measured my grip strength as only 30kg.\nIn overseas studies, the average grip strength of firefighters is 50kg to 55kg.\nGrip strength measures how strong your forearm is and is important as firefighters often carry heavy equipment, such as hoses, which weigh up to 12kg.\nCognitive Lab\nAt the Cognitive Lab, I tried out an eye-tracking system, which detects where my gaze focuses on and how long I look at each point.\nTo do so, I watched a video of a fire rescue operation and I found myself drawn to the bright orange flames which rapidly engulf the building.\nLieutenant-Colonel (LTC) Lee Soon Huat, head of the Responder Performance Centre, which oversees Excel, noted how an untrained person's attention will be fixed on the fire.\nLTC Lee added: \"(But) a trained firefighter's gaze will constantly be scanning the environment for elements such as persons at risk and potential hazards to make an informed decision.\"\nFrom this experience, I learnt how important it is for front-liners to have good situational awareness.\nDigital Learning Lab\nThe highlight of my four-hour visit to Excel was learning how to drive a fire ambulance.\nThis was possible, although I do not have a driving licence, because I was using a simulator in the Digital Learning Lab.\nStanding behind me, Major Angelene Thia Siew Teng, a course commander in the Frontline Operation Training Centre, gave instructions on how to brake, accelerate and activate the ambulance's siren.\nStomping down on the accelerator with my right foot, I thought: \"How difficult can it be? Ambulances have the right of way when responding to an emergency.\"\nThe vehicle \"moved\" forward to my delight. But quickly, I saw on the screen how the ambulance veered off the road, crashing into a nearby grass patch before I collided with a vehicle.\nAfter my failed attempt, Major Thia told me the driving simulators are intended to help SCDF officers pick up safe driving habits.\n\"The use of a simulator allows us to present road hazards and other challenging road conditions in a safe and controlled environment. This is especially useful as SCDF front-line officers are not simply driving, they are responding to a time critical fire or medical emergency.\"\nI also saw how the lab uses mixed reality to train SCDF officers to rescue casualties of a road accident safely.\nAfter a crash, a vehicle's doors can be so impacted that they can no longer be opened normally.\nWearing a virtual reality headset and holding the simulated hydraulic rescue equipment, I twisted its knob anti-clockwise to open the jaws. Using it to pinch the door frame of the passenger seat, I successfully created a gap in the door.\nSCDF said: \"The training simulators will boost training productivity and efficiency, saving time and resources involved in the set-up of physical training environments.\" As for me, I am definitely relieved that I had crashed an ambulance in a virtual setting and not in real life.\nAfter experiencing how our emergency responders train, I know now it takes both physical and mental prowess to perform on the job.\nBut with the help of the various facilities in Excel, I have faith that our front-liners will do just fine.", "url": "https://www.straitstimes.com/singapore/new-high-tech-research-and-training-lab-by-scdf-htx-helps-officers-keep-fit"}