{"authors": ["Yeo Shu Hui"], "date_download": "2024-10-12 13:30:12", "date_modify": "2024-10-12 13:30:12", "date_publish": "2021-04-14 17:10:36", "description": "SINGAPORE - Authorities seized a truck and 8,580 cartons of duty-unpaid cigarettes hidden in 12 concrete blocks last Thursday (April 8). Read more at straitstimes.com.", "filename": "singapore_six-arrested-8580-cartons-of-duty-unpaid-cigarettes-seized-in-joint-customs-ica-operation_1728739812.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/04/14/rk_cartonboxes-collage_140421.jpg?VersionId=Lb7smSW.1sD7ucxHy6kknjRx4c0KvUge", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_six-arrested-8580-cartons-of-duty-unpaid-cigarettes-seized-in-joint-customs-ica-operation_1728739812.html", "title": "Six arrested, 8,580 cartons of duty-unpaid cigarettes seized in joint Customs-ICA operation", "title_page": "Six arrested, 8,580 cartons of duty-unpaid cigarettes seized in joint Customs-ICA operation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The authorities seized a truck and 8,580 cartons of duty-unpaid cigarettes hidden in 12 concrete blocks last Thursday (April 8).\nSix men - five Malaysians and one Indonesian - aged between 22 and 37 were arrested in a joint operation between Singapore Customs and the Immigration and Checkpoints Authority (ICA).\nIn a statement on Wednesday (April 14), Singapore Customs said that their officers launched an operation on the evening of April 8 at a storage yard in Penjuru Walk.\nThey saw several men entering the yard and dismantling concrete slabs with sledgehammers to retrieve what were suspected to be cartons of duty-unpaid cigarettes from a hollow compartment of the smashed slabs.\nAs the men loaded the cartons onto a Singapore-registered truck, officers moved in to raid the premises and arrested them. The truck was also seized.\nThe total duty and goods and services tax (GST) evaded on the cartons amounted to about $732,730 and $58,780 respectively.\nCourt proceedings against the six men are ongoing, said Singapore Customs.\nUnder the Customs Act and the GST Act, it is an offence to buy, sell, convey, deliver, store, keep, have in possession or deal with duty-unpaid goods.\nOffenders can be fined up to 40 times the amount of duty and GST evaded and/or jailed for up to six years. Vehicles used in committing such offences may be forfeited.\nAnyone with information on smuggling activities or evasion of Customs duty or GST can call the Singapore Customs hotline on 1800-233-0000 or e-mail customs_intelligence@customs.gov.sg to report these illegal activities.", "url": "https://www.straitstimes.com/singapore/six-arrested-8580-cartons-of-duty-unpaid-cigarettes-seized-in-joint-customs-ica-operation"}