{"authors": ["Esther Loi"], "date_download": "2024-10-12 14:22:06", "date_modify": "2024-10-12 14:22:06", "date_publish": "2024-06-30 05:00:00", "description": "It's common practice in the maritime industry to file claims against the polluting vessel. Read more at straitstimes.com.", "filename": "singapore_transport_st-explains-why-does-stationary-vessel-have-to-shoulder-claims-for-recent-oil-spill_1728742926.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/30/yaohui-pixmpa17-1165.jpg?VersionId=1g3aPEsrOmBM9N4d73dAW8GB3VWEJ0ti&h=859742e3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_st-explains-why-does-stationary-vessel-have-to-shoulder-claims-for-recent-oil-spill_1728742926.html", "title": "ST Explains: Why stationary vessel will have to shoulder all claims for recent S’pore oil spill", "title_page": "ST Explains: Why stationary vessel will have to shoulder all claims for recent S’pore oil spill | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A bunker vessel which spilled oil when it was hit by a dredging boat on June 14 will have to bear the costs arising from the spill, despite it being stationary when it was hit.\nSome from the public have asked why the stationary vessel – instead of the moving dredging boat – is the party that has to shoulder all the claims.\nOn June 14, the Vox Maxima, a Netherlands-flagged dredger, suffered a sudden loss of engine and steering control and hit the Singapore-flagged vessel Marine Honour.\nThe allision damaged an oil tank on the bunker vessel and caused 400 tonnes of oil to leak into the sea.\nThe Sunday Times speaks to maritime lawyers for a closer look at claims for maritime oil spills.\nQ: What is the “polluter pays” principle, and how does it apply to maritime incidents?\nUnder the Merchant Shipping (Civil Liability and Compensation for Oil Pollution) Act 1998, the owner of a vessel from which oil is discharged is liable for all damage caused, regardless of whether the vessel is at fault.\nMr John Sze, managing partner of law firm Joseph Tan Jude Benny, noted that the “polluter pays” principle ensures that potential claimants do not need to wait for a legal resolution between the vessels involved in an incident, to determine their responsibility, before knowing where they can seek compensation.\nHe added that such investigations and potential legal proceedings could take years to complete, leaving those who have suffered losses unable to get compensation quickly. This would not be ideal.\nMr Prakaash Silvam, head of shipping at law firm Oon and Bazul, said the polluter pays principle is based on the fact that it is unfair to place the costs of pollution on society, and those who caused environmental harm should be held accountable for the damage.\nMr Joseph Tan, managing director and senior accredited specialist of maritime and shipping at law firm JLex, said there are exceptions to the Act, if the oil pollution is due to: a war or an exceptional natural phenomenon, something done by a third party with the intention of causing damage, or the negligence of a government or authority to maintain lights or navigational aids.\nWhile it is common practice to file claims against the polluting vessel, he noted that third-party claimants can also consider filing claims in court against the owners of the moving boat Vox Maxima if, for instance, they are of the view that negligence had led to a sudden loss in engine and steering control.\nHowever, it can be challenging for claimants to get access to the relevant evidence to prove their case.\nMr Tan said it is technically possible for third parties suffering damage to file claims against the original equipment manufacturer of Vox Maxima, but getting evidence would be difficult.\nMr Barry Stimpson, managing partner of the Singapore office and Asia-Pacific lead of the commodities and shipping group at law firm Squire Patton Boggs Singapore, agreed it would be unlikely for third parties to succeed in claims against the original equipment manufacturer of Vox Maxima, as it would be tough to establish any relationship between the loss in engine and steering control and the manufacturer.\nQ: Can the polluting vessel choose to make claims against other parties?\nFor this oil spill incident, Mr Loh Wai Yue, joint managing director and senior accredited specialist of maritime and shipping at law practice Incisive Law, said that while the stationary vessel Marine Honour has to shoulder liability for third-party claims from parties affected by the oil spill at first, it still has the right to seek monetary contributions from the dredger, to the extent of how much the latter is to blame for the crash.\nIf investigations prove that Vox Maxima was fully responsible for the incident, Marine Honour will be compensated by the former for the cleanup costs and claims that the stationary vessel had to pay, he added.\nThe Maritime and Port Authority of Singapore (MPA) told ST on June 26 that Singapore did not draw a cash advance from the Revolving Fund – set up by the three littoral states of Singapore, Malaysia and Indonesia – for the cleanup of the oil spill.\nThe Revolving Fund Committee allows the three states to request support for oil spills and cleanup operations in the Strait of Malacca and Singapore. The amount drawn needs to be repaid to the Revolving Fund once the state recovers the cleanup costs.\nMPA added that the authorities will seek compensation from the owner of Marine Honour for the costs of all measures taken to contain and clean up the spill, including for damaged infrastructure, after the cleanup operations are completed.\nQ: What would have happened if two vessels in an accident sustained damaged oil tanks and leaked oil from both vessels?\nMr Silvam said the general rule in such cases is that liability will be divided according to the degree of fault borne by each vessel.\nMr Loh noted that an investigation must be done to find out the extent of oil spilled and each vessel’s contributions to claimants’ losses, involving experts’ analysis of evidence.\nHe added that this would be significantly easier if the oil escaping from both vessels were of different grades or types, but the investigation would become more difficult if the oil was of the same grade or type.", "url": "https://www.straitstimes.com/singapore/transport/st-explains-why-does-stationary-vessel-have-to-shoulder-claims-for-recent-oil-spill"}