{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 13:44:05", "date_modify": "2024-10-12 13:44:05", "date_publish": "2023-11-28 20:36:33", "description": "Overall passenger figures in Oct recovered to 90.7 per cent of 2019 levels, the highest since Covid-19 struck. Read more at straitstimes.com.", "filename": "singapore_transport_fuelled-by-s-korea-growth-changi-airport-traffic-crosses-90-of-pre-covid-19-levels-for-first-time_1728740645.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/28/IMG7561.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_fuelled-by-s-korea-growth-changi-airport-traffic-crosses-90-of-pre-covid-19-levels-for-first-time_1728740645.html", "title": "Changi Airport traffic crosses 90% of pre-pandemic levels for first time, fuelled by S. Korea travel", "title_page": "Changi Airport traffic crosses 90% of pre-pandemic levels for first time, fuelled by S. Korea travel | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Passenger traffic between Singapore and South Korea eclipsed pre-pandemic levels by 36 per cent in October. This makes South Korea the fastest-growing market for Changi Airport in 2023, the airport’s operator said on Nov 28.\nThis growth has, in turn, helped to drive the airport’s post-pandemic rebound, with overall passenger figures in October recovering to 90.7 per cent of 2019 levels, the highest percentage since Covid-19 struck.\nThis is also the first time monthly passenger traffic has crossed 90 per cent of pre-pandemic levels, said Changi Airport Group (CAG).\nThe previous peak was in May, when the recovery stood at 89.5 per cent.\nSince then, the recovery rate has been hovering below 90 per cent, due to the number of visitor arrivals to Singapore, CAG said.\nIn October, 5.12 million travellers passed through the airport, compared with 5.65 million in October 2019, according to data released by CAG and the Civil Aviation Authority of Singapore.\nAbout 28,700 commercial flights took off from or landed at Changi, amounting to 89.8 per cent of the flights in October 2019.\nCAG said the South Korean market has seen the strongest recovery so far in 2023 among the airport’s top 10 markets. Behind it are India, which is at 102 per cent of pre-pandemic levels compared with 2019, and Australia, at 94 per cent.\nAbout 209,000 passengers travelled between Singapore and South Korea in October, compared with 153,000 in October 2019. In the first 10 months of 2023, 1.8 million passengers travelled between the two countries, compared with 1.32 million over the same period in 2019.\nFor comparison, Changi Airport’s top market in October was Indonesia, with 605,876 passenger movements. Markets with similar passenger traffic numbers as South Korea in October include the Philippines (210,878) and Vietnam (195,346).\nCAG said passenger traffic between South Korea and Singapore had recovered to above 2019 levels since January, outperforming pre-Covid-19 numbers by at least 25 per cent each month.\nIt attributed this to the growth in traffic between the Republic and the South Korean cities of Seoul and Busan, as well as low-cost carrier Scoot’s launch of flights to and from Jeju island in June 2022.\nCAG said Seoul is now Changi Airport’s sixth-largest city link by passenger traffic. It was 12th in 2019. In October 2023, 186,000 passengers travelled between Changi Airport and Seoul’s Incheon Airport, compared with 142,000 in October 2019.\nAnother factor behind the growing demand has been a corresponding increase in flight capacity by airlines.\nIn May 2022, T’way Air became the first South Korean low-cost carrier to operate between Singapore and Seoul, with two flights a week. It now runs daily services.\nMeanwhile, Scoot flies between Singapore and Seoul seven times a week, compared with thrice a week in January 2020.\nPassenger traffic between the port city of Busan and Singapore has grown the fastest, said CAG, with passenger movements in October 2023 more than double that of January.\nCAG noted Jeju Air’s reinstatement of flights between Singapore and Busan in June 2022. The frequency has also risen from twice-weekly to six times a week.\nSingapore Airlines, too, resumed flights to the city in August.\nCAG said there are now six airlines operating flights between Singapore and South Korea, compared with five before the pandemic.\nAs at November, there are 92 weekly one-way flights to South Korea, compared with 84 in January, it added.\nMr Lim Ching Kiat, CAG’s executive vice-president for air hub and cargo development, said the injection of flight capacity and services by low-cost carriers, such as T’way Air and Jeju Air, has improved accessibility to South Korea and increased options for consumers, especially younger travellers who are more price-sensitive.\n“With the option of connecting to Busan and Seoul in a single itinerary, travellers now have more ways to experience South Korea,” he added.\nMs Chung Tak Ing, assistant general manager of tour agency ASA Holidays, said the company observed a 30 per cent to 40 per cent increase in Singaporeans signing up for its tour packages to South Korea in the last quarter of 2023, compared with the same period in 2022.\nOctober is a peak travel period to South Korea. Ms Chung said some people could have travelled there to see the autumn foliage. South Korea is among the agency’s top holiday destinations in 2023, along with Japan, Europe and China, she added.\nShe said many Singaporeans pick South Korea as they like shopping there, eating Korean food and experiencing Korean culture. She predicts travel demand to South Korea will remain strong, with more families travelling during the year-end school holidays.\nAdditional reporting by Esther Loi", "url": "https://www.straitstimes.com/singapore/transport/fuelled-by-s-korea-growth-changi-airport-traffic-crosses-90-of-pre-covid-19-levels-for-first-time"}