{"authors": ["David Sun"], "date_download": "2024-10-12 13:29:24", "date_modify": "2024-10-12 13:29:24", "date_publish": "2024-02-18 15:50:00", "description": "He said the prospect of Russia’s aggression in Ukraine being rewarded kept him up at night. Read more at straitstimes.com.", "filename": "singapore_conflict-in-asia-must-be-avoided-at-all-costs-ng-eng-hen_1728739764.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/18/407752432.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_conflict-in-asia-must-be-avoided-at-all-costs-ng-eng-hen_1728739764.html", "title": "Conflict in Asia must be avoided at all costs: Ng Eng Hen", "title_page": "Conflict in Asia must be avoided at all costs: Ng Eng Hen | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The world cannot afford a conflict in Asia and it should be avoided at all costs, said Minister for Defence Ng Eng Hen.\nHe added that it will be in multilateral forums and via diplomatic solutions that such conflicts are pre-empted.\nDr Ng was speaking on Feb 17 at the 60th Munich Security Conference in Germany, an annual high-level security conference that brings together heads of government, defence and foreign ministers, parliamentarians, military leaders and security experts from around the world.\nHe was part of the main panel discussion titled Connecting Hemispheres: Aligning Strategic Priorities In A Multi-Crisis Era, alongside German Federal Minister of Defence Boris Pistorius and Tanzanian Minister of Defence and National Service Stergomena Tax. CNBC senior correspondent Silvia Amaro moderated the panel.\nWhen asked about the large sums of defence spending in the Indo-Pacific and whether there is an arms race, Dr Ng said countries cannot be stopped from deciding they are going to spend to protect their interests.\nHe noted that by 2030, the United States will spend about US$1 trillion (S$1.35 trillion) on defence each year while China will spend about US$500 billion.\nDr Ng also made the point that no one had predicted the Israel-Hamas conflict several years ago.\n“The lessons for this are very clear. We should avoid conflict in Asia at all costs,” he said. “Nothing justifies it, in my mind.”\nDr Ng added that the world “cannot have three simultaneous theatres of instability” – referring to the war between Russia and Ukraine, the Israel-Hamas conflict, and the looming spectre of conflict between the US and China.\n“If indeed there is a conflict for whatever reason between the US and China, I think we will have blighted our futures for the next, well, 10, 20, 30 years.”\nDr Ng added that he found it reassuring when Chinese President Xi Jinping met American President Joe Biden in San Francisco during the Asia-Pacific Economic Cooperation conference in November 2023.\n“Right noises were made,” he said.\nEven with Taiwan electing its new president William Lai Ching-te, who is known to be pro-independence, Dr Ng said he thought it reassuring that one of Mr Biden’s first statements was that he does not support Taiwanese independence.\n“If you look at what the PLA (People’s Liberation Army) did in response to William Lai’s election, it was not much. And that was reassuring.”\nAsked what keeps him up at night, Dr Ng said it was the prospect of Russia’s aggression being rewarded if political support from either Western Europe or the US for Ukraine wavers as the war drags on.\n“That keeps me up at night, because if that’s the established rule, then there is no future for small countries like Singapore and that’s the reason why we protested very early the Russian invasion in Ukraine,” he added.\n“Countries will have to step up to protect their beliefs and their way of life.”\nOn how to boost cooperation, Dr Ng said military-to-military engagement was crucial, especially if there are potential aggression risks.\n“So, in Asean... we are stepping up, for example, military-to-military engagement, about 18 nations, and we have to just keep working at it.”", "url": "https://www.straitstimes.com/singapore/conflict-in-asia-must-be-avoided-at-all-costs-ng-eng-hen"}