{"authors": ["Michelle Ng"], "date_download": "2024-10-12 13:38:13", "date_modify": "2024-10-12 13:38:13", "date_publish": "2024-05-31 22:55:00", "description": "Manila and Beijing have had heated stand-offs over their competing claims in the South China Sea. Read more at straitstimes.com.", "filename": "singapore_any-wilful-act-in-maritime-spat-that-causes-a-filipino-death-is-close-to-act-of-war-ferdinand-marcos_1728740293.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/01/B12196D8-A862-486D-9BFF-ED11EECAC495.jpeg?VersionId=GE_ocgY6CfLPI2JAB5SfbfPcXimY7cEE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_any-wilful-act-in-maritime-spat-that-causes-a-filipino-death-is-close-to-act-of-war-ferdinand-marcos_1728740293.html", "title": "Marcos sets ‘red line’ with Beijing over South China Sea", "title_page": "Marcos sets ‘red line’ with Beijing over South China Sea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE — Any Filipino serviceman or citizen killed by a wilful act in the South China Sea comes very close to what the Philippines defines as “an act of war” – to which his country will respond accordingly, said Philippine President Ferdinand Marcos Jr on May 31.\n“We had already suffered injury, but thank God, we have not yet gotten to the point where any of our participants, civilian or otherwise, have been killed,” said Mr Marcos, using the most strongly worded language to date in reference to an escalating maritime row with China in the South China Sea.\n“But once we get to that point, certainly we would have crossed the Rubicon. Is that a red line? Almost certainly it’s going to be a red line,” he added, in response to a question from the floor after his keynote speech at the 21st Shangri-La Dialogue held in Singapore.\nMr Marcos had in April said that any Filipino death in the event of aggression by a “foreign power” in the South China Sea could invoke a defence treaty between the Philippines and the US.\nIn his keynote speech, Mr Marcos once again referred to the defence treaty with the US, saying: “Our treaty partner, I believe, also holds that same standard for when the joint actions will be undertaken in support of any such kind of incident in the Philippines.”\nIn March, China’s coast guard fired a water cannon on a Philippine vessel, which the Philippines said resulted in injury and property damage.\nResponding to Mr Marcos’ speech, Chinese Lieutenant-General He Lei, former vice-president of the Academy of Military Sciences, told reporters: “If the death of one person in one accidental clash is enough to trigger a war, then I think this country is belligerent.”\nIn the past year, Manila and Beijing have been embroiled in heated stand-offs over their longstanding competing claims in the South China Sea. Earlier in May, the Philippines accused China of building “an artificial island” in a disputed area and deployed a ship “to monitor the supposed illegal activities”, with two other vessels in rotational deployment in the area.\nBeijing claims jurisdiction over most of the South China Sea, where more than US$3 trillion (S$4 trillion) of global trade passes through annually, including parts claimed by the Philippines, Brunei, Malaysia, Taiwan and Vietnam.\nSince assuming office in 2022, Mr Marcos has taken a tougher line than his predecessor towards China’s actions, while backed by the US, as well as Japan and Australia.\nWhile Mr Marcos did not explicitly name China in his keynote speech, he called out the “assertive actions that aim to propagate excessive and baseless claims through force, intimidation and deception”.\nCiting a 2016 international arbitral tribunal that ruled that China’s claims had no basis under international law, Mr Marcos said: “The lines we draw on our waters are derived not from imagination, but from international law.”\nBut he also noted that China’s influence over the security situation and the economic evolution of South-east Asia is “a permanent fact” – one to be balanced by the US’ “stabilising influence”.\nAsean nations, he said, need to “resoundingly reject misguided interpretations” that paint the region as a “mere theatre of geopolitical rivalries”. It is not a mere bystander to unfolding world events, but main characters in the collective story, he added.\nDuring the question and answer segment, a Chinese delegate asked Mr Marcos whether the Philippines was weakening the concept of Asean centrality and previous commitments to resolve regional disputes within the bloc.\nMr Marcos, he said, was not considering other parties’ “comfort levels and risks ruining the region’s long-earned long-lasting peace”. To that, the Philippine leader said the South China Sea is now a world issue as much of global trade passes through it.\nMr Marcos’ speech marks the first time a Philippine head of state delivered the keynote address at the annual defence summit, and comes as Singapore and the Philippines mark 55 years of diplomatic ties.\nEarlier in the day, Mr Marcos met President Tharman Shanmugaratnam, Prime Minister Lawrence Wong and Senior Minister Lee Hsien Loong.\nIt also marks the opening of the three-day regional security forum, organised by the International Institute for Strategic Studies and held from May 31 to June 2 at the Shangri-La Hotel. The summit is attended by defence ministers from around the world, including the US and China.", "url": "https://www.straitstimes.com/singapore/any-wilful-act-in-maritime-spat-that-causes-a-filipino-death-is-close-to-act-of-war-ferdinand-marcos"}