{"authors": ["Ariel Yu"], "date_download": "2024-10-12 13:58:10", "date_modify": "2024-10-12 13:58:10", "date_publish": "2024-08-06 21:25:00", "description": "The 800,000 specimens in the database come from regions including South-east Asia, New Guinea and East Asia. Read more at straitstimes.com.", "filename": "singapore_world-of-plants-a-click-away-s-pore-to-launch-s-e-asia-s-largest-digital-plant-database-around-2027_1728741490.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/06/hzspecimen060824.jpg?VersionId=QyhrTF_so.slKVVA30aZbM8_WTIkTUJi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_world-of-plants-a-click-away-s-pore-to-launch-s-e-asia-s-largest-digital-plant-database-around-2027_1728741490.html", "title": "World of plants a click away: S’pore to boast S-E Asia’s largest digital plant database around 2027", "title_page": "World of plants a click away: S’pore to boast S-E Asia’s largest digital plant database around 2027 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A Singapore-based digital database of 800,000 plants from South-east Asia and elsewhere will be ready by around 2027 for researchers, students and plant enthusiasts across the world to study and access.\nThe Singapore Botanic Gardens will be building the database on top of its current digital collection of around 10,000 local specimens, which is called the Singapore Herbarium Online.\nWork on the wider database is slated to begin in early 2025 and conclude around two years after that. The 800,000 specimens come from regions including South-east Asia, New Guinea, East Asia and the South-west Pacific.\nThe database will be the largest of its kind in South-east Asia to date and people from around the world can access it.\nThe initiative was announced on Aug 6 at the 8th Global Botanic Gardens Congress, which is held for the first time in South-east Asia.\n“Not only will the integrated database make it easier for researchers to undertake botanical studies, but (it will) also help preserve botanical history, and facilitate global knowledge sharing and collaborations,” said Mr Tan Kiat How, Senior Minister of State for Digital Development and Information as well as National Development. He spoke on Aug 6 at the opening ceremony of the congress.\nThe Singapore Botanic Gardens Herbarium currently houses the 800,000 preserved plant specimens. In 2003 and 2013, the herbarium digitised about 10,000 of these type specimens.\nA type specimen is a preserved specimen designated as the primary reference for a newly described species, genus, or other taxonomic group.\nThe digital database will give the public access to high-resolution images of 2D plant specimens and a searchable database categorised by plant name, country, date and taxonomic information.\nCommending the initiative, Dr Shawn Lum, a senior lecturer at Nanyang Technological University’s Asian School of the Environment, said: “Digitalising a collection allows anyone, from anywhere, to study plant specimens and to learn about biodiversity, land-use change, ecology and even history.”\nHe added: “The process will make the priceless collection accessible; it will protect the specimens as they can be studied without being handled, and it will enhance and promote the study of plant diversity.”\nResearchers who want to access the herbarium’s plant collection for examination in person have to make arrangements to visit before travelling there to do their work.\nDr Lum said the digitalisation project could not happen at a more critical time as there are fewer people around to teach plant diversity in local universities and schools.\nThe next few decades may be Singapore’s last realistic chance to document, study and protect the world’s last great pockets of biodiversity.\nWhile the Asean region makes up only 3 per cent of the world’s total land area, it is home to over 25 per cent of known plant and animal species in the world.\nAnother initiative announced at the congress was the launch of a collaborative network of botanic gardens across South-east Asia.\nFormed together with the South-east Asia Botanic Gardens Network and Botanic Gardens Conservation International, the South-east Asia Plant Phenology Network aims to monitor and collect long-term phenology data on specific tree species to help researchers in the region better understand how these plants respond to environmental changes.\nPhenology is the study of how environmental factors influence the timing of biological events such as leaf growth, flowering and fruit production in plants.\nThe long-term data collected on tropical plants across South-east Asia will be shared with members of the network, enabling researchers in the region to study how climate change affects plant life cycles.\nDr Lum said there has been concern raised by some researchers that climate change may hinder the general flowering phenomenon, the regeneration of our forests and the productivity of valuable crops and fruit harvests.\nLauding the launch of the regional network, the botanist added: “To adequately answer this important question, the monitoring of flowering at a regional scale must be done. The proposed phenology network could not have happened at a better time.”\nTen botanic gardens, including those from Indonesia, Malaysia, the Philippines, China and Singapore, have expressed interest in joining the network.\nThe Global Botanic Gardens Congress, which takes place every three to four years, brings together experts, researchers and practitioners from around the world to share knowledge, best practices and innovations in plant conservation, education and research.\nThe 2024 edition is taking place at the Suntec Singapore Convention & Exhibition Centre from Aug 6 to 9, held concurrently with the Singapore Garden Festival. Around 900 delegates from 73 countries are expected to attend.", "url": "https://www.straitstimes.com/singapore/world-of-plants-a-click-away-s-pore-to-launch-s-e-asia-s-largest-digital-plant-database-around-2027"}