{"authors": ["Jean Iau"], "date_download": "2024-10-12 14:20:21", "date_modify": "2024-10-12 14:20:21", "date_publish": "2023-11-08 00:03:53", "description": "The Great Budget Meal Hunt allows people to submit information about meals priced between $3 and $3.50 to CrowdTaskSG. Read more at straitstimes.com.", "filename": "singapore_politics_new-scheme-to-get-public-to-hunt-for-cheap-coffee-shop-meals_1728742821.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/08/HZBUDGET081123.jpg?h=ca390a9b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_new-scheme-to-get-public-to-hunt-for-cheap-coffee-shop-meals_1728742821.html", "title": "New scheme to get public to hunt for cheap coffee shop meals", "title_page": "New scheme to get public to hunt for cheap coffee shop meals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A new programme to help Singaporeans find and share details of cheap coffee shop eats has garnered more than 200 recommendations since its launch in October.\nSenior Minister of State for National Development and Foreign Affairs Sim Ann told Parliament on Tuesday that the Government rolled out the pilot scheme to increase the availability of affordable food options in Housing Board estates, especially for those who need them.\nThe campaign, called the Great Budget Meal Hunt, allows people to submit information about meals priced between $3 and $3.50 to CrowdTaskSG, a government crowdsourcing Web portal. Users can also verify the accuracy of existing submissions, with contributions earning them virtual stars that allow them to unlock new challenges and unique badges.\nCitizens and PRs who are above 18 and have a Singpass account can participate in the Great Budget Meal Hunt. Submissions should be full meals and not side dishes, snacks, children’s meals or half-portion meals.\nMs Sim said that over the past 1½ weeks, the Government had received 245 recommendations for affordable meals and 319 verifications across 91 coffee shops through the portal.\n“In the spirit of partnering Singaporeans under ForwardSG, we soft-launched an effort last month to crowdsource the public’s recommendations and verification of budget meals in coffee shops across the island,” she added, referring to the nationwide engagement exercise that culminated in a report released in end-October.\nMs Sim was speaking during a motion put forth by Workers’ Party MPs Pritam Singh and Louis Chua, calling on the Government to review its policies to lower the cost-of-living pressures on Singaporeans and their families.\nShe said that currently, some 114 HDB rental eating houses offer budget meals and drinks, and by 2026, budget meals will be offered at all 374 HDB rental coffee shops.\nThe budget meal initiative applies only to coffee shops rented out by HDB.\nMs Yeo Wan Ling (Pasir Ris-Punggol GRC) had earlier told Parliament that the Punggol Shore Merchants’ Association had worked with residents to ensure that all Punggol Shore foodcourt stalls offer $3 budget meals.\nShe asked if the Government would consider getting privately owned coffee shops to offer such meals, perhaps through merchant associations.\nMs Sim said HDB is studying regulatory options to require budget meals to be provided at such coffee shops. For example, these coffee shops may eventually have to provide budget meals in order for them to continue to be allowed to use nearby outdoor seating areas.\n“We will continue to work with coffee shop operators to find sustainable ways to offer affordable food options to residents,” she added.\nSeveral MPs had raised concerns over the rising cost of cooked food and groceries, including Ms Tin Pei Ling (MacPherson), Mr Xie Yao Quan (Jurong GRC) and Ms He Ting Ru (Sengkang GRC).\nFor example, Mr Xie said egg and chicken prices had climbed by almost 40 per cent since July 2021.\nNon-Constituency MP Leong Mun Wai called out Singapore’s largest supermarket chain, saying: “Food prices have surged because NTUC FairPrice stood by instead of doing more.”\nThe Progress Singapore Party secretary-general added that FairPrice’s prices today are not the lowest in the market.\nMs He also asked if more could be done to improve the availability and accessibility of healthier food and drink options islandwide.\n“It is also harder to address rising food costs when many do not have access to a microwave or fridge at work, which makes it more difficult to bring healthier meals from home,” she said.\nActing Transport Minister Chee Hong Tat, who is also Senior Minister of State for Finance, said food and energy prices have risen significantly, due to disruptions following Russia’s invasion of Ukraine and extreme weather patterns.\nThese disruptions have fazed many other countries too, Mr Chee said, citing India as an example.\nThere, prices have spiked for various food items, including rice and vegetables, and from June to August 2023, tomato prices surged by 1,400 per cent at some wholesale markets.\n“We have experienced price increases in Singapore too, but thankfully not at such magnitudes. But we have to acknowledge that inflation has affected all Singaporeans. Families need to spend more when they go to the market to buy groceries, or when they have their meals in hawker centres and coffee shops,” said Mr Chee.\nHe added that in September, the Government announced a $1.1 billion Cost-of-Living Support Package in which every Singaporean household will receive an additional $200 in Community Development Council (CDC) vouchers in 2024, bringing the total amount of CDC vouchers for each Singaporean household to $500 in 2024.\nMr Chee noted that Singapore cannot fully insulate itself from these global forces, meaning that prices of goods and services will rise to reflect higher costs.\n“If we do what is politically convenient and prevent prices from rising, I am afraid we will create more problems,” he said, raising the possibility of a fiscal deficit to be passed on to future generations.\nMr Chee reiterated that the Government has considerably moderated the impact of inflation on Singaporeans, especially for lower- and middle-income groups. It has also done so on a sustainable basis, spending within its means and helping as many people as possible, he added.\n“We will continue to monitor the need for more targeted support if inflation or the economic outlook worsens. We will do so while maintaining discipline in ensuring that our interventions are fair, sustainable and effective,” he said.", "url": "https://www.straitstimes.com/singapore/politics/new-scheme-to-get-public-to-hunt-for-cheap-coffee-shop-meals"}