{"authors": ["Jean Iau"], "date_download": "2024-10-12 14:21:17", "date_modify": "2024-10-12 14:21:17", "date_publish": "2020-05-11 13:28:30", "description": "The selected areas include the multi-storey carpark and Car Park B at the racecourse, as well as the sheltered arena at STC Riding Centre. Read more at straitstimes.com.", "filename": "singapore_health_coronavirus-areas-of-singapore-racecourse-to-be-converted-into-community-recovery_1728742877.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/05/11/ab_turbclub_110520.jpg?VersionId=ASbw0WffwAsagGQy8wXjX1ygiJvjA6R4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_coronavirus-areas-of-singapore-racecourse-to-be-converted-into-community-recovery_1728742877.html", "title": "Coronavirus: Areas of Singapore Racecourse to be converted into community recovery facilities", "title_page": "Coronavirus: Areas of Singapore Racecourse to be converted into community recovery facilities | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Some areas of the Singapore Racecourse at Kranji will be converted into community recovery facilities (CRFs) to house foreign workers who test positive for Covid-19.\nThe Singapore Turf Club (STC) said in a statement on Monday (May 11) that the selected areas include the multi-storey carpark and Car Park B at the racecourse, as well as the sheltered arena at STC Riding Centre.\nSTC and Tote Board are working with the Government to prepare the facilities, which are expected to be ready by the end of May.\nThe works will be carried out based on approved protocols and procedures by government agencies to ensure the safety and health of the workers and the equine facilities, STC said.\nSTC closed its Singapore races to the public from March 26. All races were then suspended from April 4.\nCRFs are meant for patients who remain well at the end of their 14th day of illness and who do not require further medical care.\nOther facilities include those at Singapore Armed Forces (SAF) camps - Amoy Quee, Bedok, Jurong, Guillemard, Lim Chu Kang and Tanjong Gul - which started taking in patients on April 28.\nThe authorities had announced on April 28 that more than 10,000 bed spaces will be available at such facilities by the end of June.\nSuch facilities are part of a strategy to provide differentiated care to Covid-19 patients with different needs, alongside hospitals and community care facilities (CCFs). CCFs are for those with mild symptoms and lower risk factors.", "url": "https://www.straitstimes.com/singapore/health/coronavirus-areas-of-singapore-racecourse-to-be-converted-into-community-recovery"}