{"authors": ["Isabelle Liew"], "date_download": "2024-10-12 13:28:50", "date_modify": "2024-10-12 13:28:50", "date_publish": "2024-06-04 13:15:00", "description": "Study seeks to understand how different housing types influence seniors’ quality of living. Read more at straitstimes.com.", "filename": "singapore_29m-study-on-housing-types-for-future-seniors-undertaken-by-nus_1728739730.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/04/IMG4302.JPG?VersionId=W_zqejTCKECSpFM3wodkg3ECGbriV.JT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_29m-study-on-housing-types-for-future-seniors-undertaken-by-nus_1728739730.html", "title": "$2.9m study on future housing types for seniors undertaken by NUS", "title_page": "$2.9m study on future housing types for seniors undertaken by NUS | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A project that aims to shape how homes for senior citizens will look in the future has been awarded to the National University of Singapore (NUS).\nThe $2.9 million project, granted by the Urban Redevelopment Authority (URA) in March, seeks to understand how different housing types influence seniors’ quality of life. Findings from this three-year study, led by NUS researchers, will guide the planning and design of future senior housing types.\nThe study will take into account the diverse needs, evolving preferences and changing aspirations of future seniors who may be living alone or with their families, said Senior Minister of State for National Development Sim Ann on June 4.\nSpeaking at the World Cities Summit held at the Suntec Singapore Convention and Exhibition Centre, Ms Sim noted that the authorities have introduced several new housing types for seniors in recent years.\nThese include community care apartments, which pair senior-friendly housing design with on-site care services, and the Kampung Admiralty project in Woodlands, the first Housing Board project to co-locate childcare and senior centres in one integrated development. These developments are part of the study.\n“As we continue to explore new ways to support our seniors, we will need continued research to inform our decisions,” she said.\nThe Ministry of National Development said the project, which comes under the Cities of Tomorrow programme, will develop a framework to provide a baseline measurement and comparison of seniors’ quality of living across the different housing types.\nIt will also analyse the strengths and weaknesses of each housing type, and establish “minimum” standards.\nThe Cities of Tomorrow programme aims to address challenges that impact Singapore’s ability to have a liveable, inclusive and green living environment.\nIn a panel discussion at the summit on June 4, panellists – who included representatives from Vienna and the United Nations Human Settlements Programme (UN-Habitat), as well as HDB, URA and Woha Architects – were asked about the challenges cities will face in rejuvenating.\nMr Ernst Woller, president of Vienna’s Provincial Parliament, said that as Vienna is a more than 2,000-year-old historical city, there are restrictions in developing certain areas with heritage sites. Therefore, the capital of Austria has to be “very careful” with its land use.\nHe added that a quarter of its population, or 500,000 people, live in 220,000 subsidised rental flats owned by the city.\n“If we sell them, it would reduce the number of flats in our city, and we need them for the next generations,” he said, adding that rent is controlled and tenants are protected by strong tenancy laws.\nMr Rafael Tuts, director of the UN-Habitat Global Solutions Division, said a downside of urban development is that it can lead to gentrification and the displacement of existing residents and businesses, especially in low-income areas.\n“So, it’s very important to manage the social impacts and ensure affordable housing,” he said.\nMr Lee Wai Kin, URA’s group director of the Strategic Planning Group, said that building trust is a challenge that cities must overcome for long-term and large-scale rejuvenation.\n“What we’re selling is a long-term vision, but what the community and stakeholders are experiencing on a day-to-day basis throughout the very long process (of rejuvenation) are inconveniences and disruptions, which they must live through before enjoying the benefits,” he added.\nThe moderator, Mr Fong Chun Wah, adviser to HDB, also asked how rejuvenation would look in Singapore.\nMr Choo Chin Hua, HDB’s group director of design development, said the oldest HDB blocks are around 50 to 60 years old, and most of them have gone through an upgrading initiative.\nNoting that all HDB flats will be upgraded twice over their lifespan, he added: “One major challenge is to come up with a better way of upgrading them, and how to do this on an extensive scale in the years to come.”\nURA’s Mr Lee said it is important to preserve heritage and nature, so the authority will redevelop brownfield sites and “try to delay or slow down the need to open up greenfield sites”.\nBrownfield sites are land plots with previous developments on them, while greenfield sites are places that have not been previously built on.\n“We can’t promise that we will leave a piece of land untouched in Singapore, but as far as possible, we try to make sure that we recycle our existing brownfield sites first and make good use of (them),” he said.", "url": "https://www.straitstimes.com/singapore/29m-study-on-housing-types-for-future-seniors-undertaken-by-nus"}