{"authors": ["Cheow Sue-Ann"], "date_download": "2024-10-12 13:53:13", "date_modify": "2024-10-12 13:53:13", "date_publish": "2024-04-23 12:00:17", "description": "What flexi-work requests must employers fairly consider under the new rules? Read more at straitstimes.com.", "filename": "singapore_need-more-flexibility-at-work-new-guidelines-might-help-you-get-it_1728741193.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/24/Untitled%20design%20%2858%29.png?VersionId=_SyWm3E.0nEw_jRxNgw_X.ma0JqHNIb_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_need-more-flexibility-at-work-new-guidelines-might-help-you-get-it_1728741193.html", "title": "ST HeadSTart: Need more flexibility at work? New guidelines might help you get it", "title_page": "ST HeadSTart: Need more flexibility at work? New guidelines might help you get it | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Welcome to the latest edition of ST HeadSTart, bringing you the best of The Straits Times’ career and personal finance coverage every Tuesday noon. Sign up here to get weekly tips right into your inbox.\nHi there, Sue-Ann here!\nGetting older often means more responsibilities, whether it is getting the afternoon off to visit a parent in the hospital or having the flexibility to work from home on days the plumber or the air-con serviceman visits.\nGrowing demands on our time and more responsibilities may mean that for many of us, the need for flexible working arrangements may be more pressing now than ever. Last week, a new set of guidelines were released to help ensure that employers fairly consider such needs. My colleague Tay Hong Yi dived deeper into the types of arrangements available to find out what employers must now consider.\nThis week, I also wanted to look a bit deeper to see how AI can also help us be super-charged, and help increase productivity so we can have more time to do more value-add work. Speaking of AI, you can watch me face-off against an AI bot to find out if the technology can really replace humans.\nWhat types of flexible work arrangements would be most helpful to you? Tell me more at headstart@sph.com.sg\nAlso, if you haven’t already, check out our We Try First series here.\nHave a good week ahead!", "url": "https://www.straitstimes.com/singapore/need-more-flexibility-at-work-new-guidelines-might-help-you-get-it"}