{"authors": [], "date_download": "2024-10-12 14:22:09", "date_modify": "2024-10-12 14:22:09", "date_publish": "2022-11-25 14:52:17", "description": "“I look forward to working with him and the new government to further strengthen our bilateral relationship,” he said. Read more at straitstimes.com.", "filename": "singapore_pm-lee-speaks-to-malaysian-prime-minister-anwar-ibrahim-invites-him-to-visit-s-pore-soon_1728742929.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/25/dw-pmlee-anwar-221125_7.jpg?VersionId=GJQlBK5d2b1ovJSdf67pUmFDBUhvJxTR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_pm-lee-speaks-to-malaysian-prime-minister-anwar-ibrahim-invites-him-to-visit-s-pore-soon_1728742929.html", "title": "PM Lee speaks to Malaysia Prime Minister Anwar Ibrahim, invites him to visit S’pore soon", "title_page": "PM Lee speaks to Malaysia Prime Minister Anwar Ibrahim, invites him to visit S’pore soon | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Prime Minister Lee Hsien Loong spoke with newly sworn-in Malaysian Prime Minister Anwar Ibrahim on Friday, and invited the leader to visit Singapore soon.\n“I look forward to working with him and the new government to further strengthen our bilateral relationship,” said PM Lee in a Facebook post.\nDatuk Seri Anwar was appointed Malaysia’s 10th prime minister on Thursday.\nPM Lee added that he has known Mr Anwar for several decades and had last met him in 2018, when he delivered a lecture at the Singapore Summit on the importance of bilateral relations between Singapore and Malaysia.\n“Singapore and Malaysia are close partners. Our countries share a longstanding friendship, underpinned by strong historical, cultural, and interpersonal ties. There is more that we can do to enhance our bilateral relationship for mutual benefit,” said PM Lee.\nReplying to PM Lee on social media, Mr Anwar on Friday afternoon thanked him for the phone call and warm wishes.\nMr Anwar said in a tweet: “As close neighbours and partners in Asean, Malaysia and Singapore also share many commonalities, intertwined history and very close and active people-to-people connections.\n“I look forward to meeting you at the earliest opportunity and working together to further elevate Malaysia-Singapore bilateral relations.”\nMr Anwar, 75, was sworn in after most parties agreed to a call by the Malaysian King, Sultan Abdullah Ahmad Shah, for a unity government in the wake of last Saturday’s general election resulting in Malaysia’s first-ever hung Parliament.\nIn a letter to Mr Anwar on Thursday, PM Lee congratulated the Malaysian Prime Minister and his Pakatan Harapan alliance on its strong performance at the country’s general election.\nIn his letter, PM Lee said both neighbouring countries supported each other during the Covid-19 pandemic.\nClose coordination between the governments had allowed for the flow of essential goods and workers, and the reopening of borders swiftly and effectively.\nHe also noted that the two bilateral framework agreements on green and digital economies will create new opportunities for businesses and people.", "url": "https://www.straitstimes.com/singapore/pm-lee-speaks-to-malaysian-prime-minister-anwar-ibrahim-invites-him-to-visit-s-pore-soon"}