{"authors": ["Aqil Hamzah"], "date_download": "2024-10-12 13:57:32", "date_modify": "2024-10-12 13:57:32", "date_publish": "2023-09-23 12:00:00", "description": "The size provides the opportunity for the SAF to run a whole gamut of integrated sense and strike missions. Read more at straitstimes.com.", "filename": "singapore_large-training-area-allows-greater-scope-of-integrated-sense-and-strike-operations-for-saf_1728741452.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/23/2023092131325118129c3d08-8c32-493d-9518-1a6b37351092.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_large-training-area-allows-greater-scope-of-integrated-sense-and-strike-operations-for-saf_1728741452.html", "title": "Large training area allows greater scope of integrated sense and strike operations for SAF", "title_page": "Large training area allows greater scope of integrated sense and strike operations for SAF | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOUNTAIN HOME, Idaho - It is 8am, and despite the very low temperature and strong winds, Second Lieutenant Aloysius Chua is already en route to his observation post to detect enemies.\nThe full-time national serviceman (NSF) from the 1st Commando Battalion is representing the elite unit as its detachment commander at Exercise Forging Sabre held in the United States, and his role is to call for both air and land strikes against threats.\nWorking in tandem with troops from the strike observer mission (Storm) team, he conducts lasing operations and identifies the coordinates of targets from the ground, allowing the assets from the Singapore Army and the Republic of Singapore Air Force to take them down.\nAfter a live-firing demonstration on Wednesday, about an hour’s drive away from Mountain Home Air Force Base in Idaho, the 20-year-old said it was a “once-in-a-lifetime opportunity” to witness missile strikes happen at areas pinpointed by his team.\n“As of now, I’m pretty sure I’m one of the few NSFs who have actually experienced an actual live drop regarding the air assets and High Mobility Artillery Rocket System (Himars).\n“From what I learnt here through the live firing, I can impart some knowledge (to my peers),” he said, adding that such operations are not possible in Singapore.\nSuch training experiences cannot be replicated in the Republic due to space constraints, but can be conducted in the US training area, which has an airspace 20 times the size of the island.\nThat size provides the opportunity for the Singapore Armed Forces (SAF) to run a whole gamut of integrated sense and strike missions as part of Exercise Forging Sabre, incorporating assets from across its services.\nThe exercise runs until Sept 30, and one of the assets involved is the Heron 1 UAV (unmanned aerial vehicle), which provides the SAF with eyes in the sky.\nThrough her role in operating the drone to provide surveillance, Major Ooi Li Wen said that commanders are able to make better-informed decisions after reviewing the video footage sent back to the command post.\nThe 29-year-old also plays an additional role – making use of the Heron 1’s laser to designate targets on the field, resulting in the SAF being able to mount successive strikes as threats are identified.\nCaptain Isaac Chia, 28, a weapons system officer on board the F-15SG fighter jet, said incorporating such sense assets not only allows him to take down multiple targets back to back, but also functions as a backup in case of emergencies.\nAlthough the jet is able to carry large quantities of munitions, he is able to lase – or guide bombs using a laser – only a single target at any point in time.\nWith information relayed by the Heron 1, however, he can act against different threats in quick succession.\nHe added: “In the event that my on-board sensors are unable to effectively lase bombs onto targets, I’m able to enlist the help of the Heron 1 to lase my bombs.”\nOn-the-ground troops like the commandos and Storm team also complement fighter jets when they are needed to mount attacks on highly populated urban areas.\n“Fighters can definitely shape the battlefield by delivering calibrated and precise firepower when requested by our counterparts in the battlefield,” said Capt Chia, who added that participating in the exercise gave him the opportunity to fire live munitions at moving targets – a career first.\nHe said: “It was definitely a huge confidence booster for me. I’m now extremely confident that the rigorous training I’ve undergone as an air crew member has prepared me well and equipped me with the necessary skill sets.”\nThat was the same feeling Corporal Aide Alfian Abdul Rahman, 20, had after participating in the exercise.\nThe Himars operator said he was apprehensive about the live firing in the US, since he had not experienced one involving rocket launchers before.\nBut upon completing it, the NSF realised that he had no reason to worry, with the experience cementing his “full faith” in his battery mates, with whom he had trained hard in Singapore for months prior to the live firing.\n“Being here has made me feel a lot more grateful for the peace that we enjoy in Singapore,” he said.\n“Moving forward, I intend to work harder... in (my) everyday life, because you never know if (what we have) could change.”", "url": "https://www.straitstimes.com/singapore/large-training-area-allows-greater-scope-of-integrated-sense-and-strike-operations-for-saf"}