{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 14:01:05", "date_modify": "2024-10-12 14:01:05", "date_publish": "2024-01-11 16:45:00", "description": "Organisers hope to see more than one million visitors to this year’s River Hongbao. Read more at straitstimes.com.", "filename": "singapore_firecrackers-digital-avatar-and-a-suspended-dragon-to-greet-visitors-at-river-hongbao_1728741665.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/11/hzriver110124.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_firecrackers-digital-avatar-and-a-suspended-dragon-to-greet-visitors-at-river-hongbao_1728741665.html", "title": "A 140m-long dragon, firecrackers and a digital avatar will greet visitors at River Hongbao 2024", "title_page": "A 140m-long dragon, firecrackers and a digital avatar will greet visitors at River Hongbao 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A 140m-long dragon lantern set suspended across two Supertrees at Gardens by the Bay will ring in the Year of the Dragon at the River Hongbao, one of Singapore’s largest and longest-running Chinese New Year (CNY) celebrations.\nA God of Fortune figurine, a crowd favourite, will also feature at the Supertree Grove.\nRiver Hongbao 2024, held at Gardens by the Bay for the fourth consecutive year, will run from Feb 8 to 17. It will start at 6.30pm for the first two days, and at 2.30pm for the rest of the event period.\nAdmission is free.\nFor the first time in more than 10 years, the annual event, which has been held since 1987, will have a dazzling display of 30 firecrackers, totalling 18m in length. They will be lit on the first three nights.\nBarricades and other safety measures will be in place for visitors, who will be about 15m from the firecrackers.\nRiver Hongbao is organised by the Singapore Federation of Chinese Clan Associations (SFCCA), Singapore Chinese Chamber of Commerce & Industry, SPH Media Trust’s Chinese Media Group, Singapore Tourism Board and People’s Association.\nMr Thomas Chua, chairman of the River Hongbao organising committee and president of SFCCA, said at a media conference on Jan 11 that the organisers are constantly looking for new highlights to draw crowds, even as the event continues to promote Chinese tradition and culture.\n“We welcome not just the Chinese but other races to join in to promote racial harmony and national unity,” he said, at SFCCA’s Toa Payoh building.\nTo move with the times, the organisers have enhanced the event’s digital content, including creating a virtual River Hongbao and interactive metaverse. They will be on the River Hongbao website at riverhongbao.sg. Xiao He, a character designed by artificial intelligence, will make her debut at the event. She will be featured across various social and digital content.\nMs Loh Woon Yen, managing editor of SPH Media Trust’s Chinese Media Group, said: “We hope the digital avatar and interactive metaverse will attract young people and those who are overseas to the online, or even physical, event.”\nComplementing River Hongbao is Dahlia Dreams, Gardens by the Bay’s signature CNY floral display at the Flower Dome.\nBesides over 1,000 dahlias of more than 40 varieties, there will be different iterations of dragons, including a 7m-tall, 15m-long dragon centrepiece representing the upcoming Year of the Wood Dragon.\nThe “dragon scales” are made of fresh and preserved blooms in yellow and red, a joint effort by the Gardens’ horticulturists and beneficiaries of Dementia Singapore.\nThe four finalists of the Mapletree-SCCCI River Hongbao Hackathon 2023, which took place on Dec 28, will also be at the event. Launched in 2019, the competition has youth teams proposing business ideas for the annual River Hongbao event.\nThe four teams will sell their wares and services, such as sustainable kitchen utensils for the visually impaired and a Singapore-themed board game.\nMore information on the various activities and their timings can be found on riverhongbao.sg\nPOSB will put up an exclusive dragon filter on its Facebook, Instagram and Tiktok pages that netizens can use on photos of themselves and their CNY celebrations and post on their own social media accounts. The bank will donate $8 to the POSB PAssion Kids Fund, which supports low-income families and children in need, for every post or story featuring the filter.\nThe organisers hope to attract more than one million visitors, the same as in the years before the pandemic.\n“We hope the weather holds,” said Mr Perng Peck Seng, the event’s programme chairman. “However, our seats for the performances were filled up despite the rain last year. This shows that our programme is good, and that our visitors are not deterred by bad weather.”", "url": "https://www.straitstimes.com/singapore/firecrackers-digital-avatar-and-a-suspended-dragon-to-greet-visitors-at-river-hongbao"}