{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 13:28:46", "date_modify": "2024-10-12 13:28:46", "date_publish": "2024-09-15 17:00:00", "description": "More kids aged six and below are being diagnosed with developmental needs, like behavioural problems. Read more at straitstimes.com.", "filename": "singapore_we-thought-he-was-just-naughty-over-1-in-100-kids-in-singapore-have-autism_1728739726.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/16/helen.jpg?VersionId=fRpco6qKpI2jGpWemGXmE9ArpPTu2YTe&h=9a025950", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_we-thought-he-was-just-naughty-over-1-in-100-kids-in-singapore-have-autism_1728739726.html", "title": "‘We thought he was just naughty’: Over 1 in 100 children in Singapore have autism", "title_page": "‘We thought he was just naughty’: Over 1 in 100 children in Singapore have autism | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - More than one in 100 children at the age of 18 months here have autism – the age when kids can be screened for the condition.\nA local study published in 2023 by the National University Hospital (NUH) and National University Polyclinics found that among 5,336 children aged around 18 months, the prevalence of autism here was 1.1 per cent, or roughly just over one in 100 children.\nThe prevalence of autism – a neuro-developmental condition – here was estimated at one in 150 children in 2016.\nOverall, the number of children aged six and below with developmental needs, which include speech and language delay and behavioural problems, has increased by 32 per cent from 5,300 in 2019, to 7,000 in 2023.\nAmong those diagnosed with such needs, about 20 per cent have autism.\nThe Ministry of Health (MOH) released these figures in response to queries from The Straits Times, providing the latest data from the Child Development Programme at KK Women’s and Children’s Hospital (KKH) and NUH.\nDoctors say the rise largely stems from increased awareness and screening.\nAn MOH spokesman said: “The overall better early detection can be attributed to various efforts to encourage parents to take their children for Childhood Developmental Screening at appropriate touchpoints, so that children who may need interventions are identified early.”\nFor instance, developmental checks on personal-social and motor skills, as well as language, are conducted together with the recommended childhood vaccinations to make it more convenient for families.\nAssociate Professor Lourdes Mary Daniel, head and senior consultant at the Department of Child Development at KKH, said there is improved awareness of autism symptoms.\nOther factors associated with increased likelihood of autism include mothers being over 40 years of age at the child’s birth, and birth prematurity of less than 35 weeks of gestation, or birth weight under 2.5kg, she said.\nProf Daniel said antenatal screening during pregnancy can help identify maternal, placental and fetal conditions and environmental risk factors for developmental concerns in the foetus. These include birth defects and structural abnormalities, as well as blood flow to the fetal brain.\nDr Aishworiya Ramkumar, senior consultant at NUH’s Khoo Teck Puat – National University Children’s Medical Institute, said excessive screen time also has cognitive implications.\nA 2024 NUH study found that children referred for developmental, behavioural or emotional issues had been exposed to more than two hours of screen time a day on average when they were aged two and under, against international guidelines, which advise no screen time for children in this group.\nExcessive screen use among infants and toddlers can lead to attention, language and social skills difficulties as well as aggressive behaviour in later childhood, said paediatricians.\nIs Singapore ready to support the growing numbers?\nCurrently, there are 25 special education schools for students aged seven to 18 in Singapore.\nThree more will be set up by 2032 to meet the growing demand of students with moderate needs who have autism and can access the national curriculum, said the Ministry of Education (MOE). Pathlight School and St Andrew’s Mission School are currently the only government-funded schools serving this group.\nThe upcoming schools are: Pathlight School 2 run by Autism Resource Centre (Singapore) (ARC) in Tampines in 2025; a new school by Methodist Welfare Services in partnership with Anglo-Chinese School, to start operations in 2026 and to relocate to Tengah in 2031; and Pathlight School 3 in Punggol in 2032.\nWhen completed, the upcoming schools will provide about 1,500 primary and 1,050 post-primary school places, MOE said.\nParents told ST that getting an autism diagnosis allowed them to get their children into schools to get the support needed.\nPre-school teachers told consultant Hellen Yong that her daughter could not interact well with other children and was more difficult to handle. For instance, she became so attached to the playground swing that she would refuse to return to class.\nMs Yong, 42, wasted no time in taking her daughter to the doctor, where she was diagnosed with autism at the age of four. The girl, now eight, is a happy Primary 2 pupil at Pathlight School.\nShe was given the option to transfer to a mainstream school, but Ms Yong decided that the support from Pathlight’s teachers and peers there would suit her daughter better.\n“I’m thankful we didn’t delay treatment. Now she’s doing well, and I’m happy seeing her improvement every day,” she said.\nGetting adequate support\nRachel (not her real name) said a polyclinic doctor referred her son to KKH for review after finding that he could not say “mummy” at his two-year-old milestone check. The boy was diagnosed with autism at the age of four.\n“I was in denial. At first, I felt guilty. What have I done wrong that my son is like this? Then it turned to anger, then regret, and the negative feelings went on,” said the 44-year-old housewife who declined to be named.\n“Some parents are stronger, and they accepted their fate earlier. For me, it took quite a while.”\nHer son, now six and still non-verbal, did not attend pre-school as no centre wanted to take him in. Instead, he attended six hours a week of the Early Childhood Development Agency’s Early Intervention Programme for Infants and Children (Eipic), which supports children with developmental needs in a group setting.\n“For Level 3 autism, which is considered severe, this is definitely not enough. My son’s improvement is not obvious compared with high-functioning kids,” said Rachel.\nDr Nah Yong Hwee, an educational psychologist who specialises in the detection of autism, noted that Eipic also has to support other children without autism and faces manpower and space constraints. Hence, some children with autism may not get the intensive support needed, with general research recommending at least 10 hours of intervention a week.\nAnother parent, Mr Dylan Lau, 43, said his son showed a deep interest in fans and trains from a young age, and would have meltdowns triggered by loud sounds from the blender, vacuum cleaner and hair clippers.\n“As he is our firstborn, we thought he was just a bit naughty,” he said.\nIt was only later when one of his son’s taekwondo classmates suggested that his son might have attention deficit hyperactivity disorder that Mr Lau took him to KKH.\nThere, the boy was diagnosed with moderate autism, and a doctor promptly wrote a letter for his primary school studies to be deferred and for him to enrol in Eipic.\n“It was a relief as we finally understood why he was the way he was, and we could now help him improve himself. Getting that diagnosis was a big turning point for us,” said Mr Lau.\nThe Eipic classes improved the boy’s social skills, and he even discovered a talent for music. His parents signed him up for piano classes, which helped him regulate himself better.\nThey also engaged a private child psychologist to help him adapt and interact with his peers.\nMr Lau, a software engineer, took a year off work to take his son to playgrounds every day to practise interacting with others.\nNow 11, the boy is a Primary 4 pupil at Pathlight.\n“I wouldn’t say he is ‘cured’, but he doesn’t wander off as much now,” Mr Lau said. “It is a regret on our side that we didn’t catch this earlier. We missed out on those precious years of development.”", "url": "https://www.straitstimes.com/singapore/we-thought-he-was-just-naughty-over-1-in-100-kids-in-singapore-have-autism"}