{"authors": ["Aqil Hamzah"], "date_download": "2024-10-12 13:56:21", "date_modify": "2024-10-12 13:56:21", "date_publish": "2023-10-12 16:45:00", "description": "She faces multiple charges for offences, including the alleged use of abusive language on a public servant. Read more at straitstimes.com.", "filename": "singapore_woman-questioned-by-police-in-viral-video-refused-to-don-mask-and-abused-staff-sgh_1728741381.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/12/IMG5743.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_woman-questioned-by-police-in-viral-video-refused-to-don-mask-and-abused-staff-sgh_1728741381.html", "title": "Woman questioned by police in viral video over SGH fracas to be charged in court", "title_page": "Woman questioned by police in viral video over SGH fracas to be charged in court | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A 29-year-old woman will be charged in court on Friday with multiple offences that include the use of abusive language on a public servant.\nShe had garnered public attention after she claimed that she was refused treatment at a hospital here because she is not a Singapore citizen, although this was refuted by the hospital on Thursday.\nThe incident went viral on social media after a video was posted on Chinese social media platform Douyin on Tuesday, which showed the police interviewing her. Law enforcement officers were called in following complaints that she had been verbally abusive to hospital staff.\nThe police said they received a call for assistance at Singapore General Hospital (SGH) on Tuesday at about 2.35am. A woman seeking treatment for her injured foot was allegedly shouting and had verbally abused a nurse.\nShe alleged in the video that she had waited for three hours at the hospital’s emergency department without being attended to by a doctor after being hit by a car, and claimed that a nurse told her she would not receive treatment because she was not a Singaporean.\nHowever, Associate Professor Kenneth Tan, head and senior consultant for the department of emergency medicine at SGH, told The Straits Times that she was discharged from the emergency department about two hours following her arrival “after being thoroughly reviewed by our clinical team”.\n“We would like to reiterate that everyone who presents at our emergency department will receive the care required,” he added.\nAccording to Prof Tan, the woman had turned hostile towards hospital employees after she refused to put on a face mask.\nHe said: “During the triage process at the entry to our emergency department, the patient was handed a mask after a staff member noticed that she was not wearing one.\n“She refused to put it on and became abusive when our staff reminded her about the ministry’s guidelines on mask-wearing in hospitals.”\nMask-wearing, which was mandatory during the Covid-19 pandemic, was stood down in most settings earlier this year, though the Ministry of Health has retained this requirement in certain settings, such as in private and public hospitals.\n“Masking is required in all clinical areas in the hospital to protect our patients and our colleagues. This is particularly important in the emergency department, where there are many ill and vulnerable patients,” Prof Tan said.\nHe said that the hospital has a protocol for employees who deal with abusive or aggressive patients or family members.\nNearby colleagues or supervisors would first step in to help the affected employee, and the hospital’s security and the police may be called if the abusive person could not be calmed or reasoned with, or if the safety of the hospital’s employees are at risk.\nProf Tan added that the hospital has regular courses to teach its employees how to de-escalate and manage such situations.\nHowever, despite efforts by both medical and security staff, the woman continued to behave aggressively on Tuesday, resulting in the police being called in, he added. “Her behaviour was disruptive to the operations as the hospital had to deploy more manpower to attend to the case at the expense of other emergency patients who were waiting to be seen,” he said.\nHealth Minister Ong Ye Kung said in a Facebook post on Friday that he was disturbed by the incident.\nEarlier this year, the government had announced a zero-tolerance policy against the abuse of healthcare workers.\nMr Ong pointed out that the actions of the woman, how she allegedly harassed healthcare workers, “are exactly what we need to protect healthcare workers against”.\n“I thank the police officers at the scene for being firm and calm, and being there when our healthcare workers needed them. I am very glad that SGH has put out a clear statement very quickly,” he said.”\n“We need to take a clear stand: healthcare workers deserve to be treated with respect. This must be a consistent stand by all of us.”\nThe woman had put up two videos on Douyin, with more than 11 minutes of footage in total.", "url": "https://www.straitstimes.com/singapore/woman-questioned-by-police-in-viral-video-refused-to-don-mask-and-abused-staff-sgh"}