{"authors": ["Rosalind Ang"], "date_download": "2024-10-12 13:38:08", "date_modify": "2024-10-12 13:38:08", "date_publish": "2022-10-22 18:57:39", "description": "Many in the audience shared their sustainable practices. Read more at straitstimes.com.", "filename": "singapore_environment_efforts-towards-net-zero-goal-start-from-individual-actions-dialogue-panellists_1728740288.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/22/alfchern-recycling-4366_4.jpg?VersionId=ljeyzUDMoMOSiFO2ApkJnQLQdmhgZCwQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_efforts-towards-net-zero-goal-start-from-individual-actions-dialogue-panellists_1728740288.html", "title": "Efforts towards net-zero goal start from individual actions: Dialogue panellists", "title_page": "Efforts towards net-zero goal start from individual actions: Dialogue panellists | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Recycling is no longer limited to the efforts of a karung guni (rag-and-bone) man who collects used items, but is now a way of life for everyone, given the current climate crisis.\nThis was a point driven by Minister for Sustainability and the Environment Grace Fu and three other panellists at an outreach dialogue on sustainability at the HDB Hub in Toa Payoh on Saturday.\nShe was joined by Ms Carine Ang, senior programme director of 96.3 Hao FM, who was the master of ceremonies for the event; Mr Adrian Yeap, chief executive of Yeap Transport; and Ms Susan Tan, environmental sustainability manager for Buddhist Compassion Relief Tzu-Chi Foundation (Singapore).\nThe event was organised by government feedback unit Reach and Chinese-language evening daily Shin Min Daily News.\nMs Fu said the concept of net-zero is like a bank account.\n“Just like how your bank account will empty out if you keep making withdrawals, the earth will suffer if we keep emitting greenhouse gases without any efforts at sustainability.\n“These gases are invisible and colourless, but their effects are very visible – over the past 40 years, Singapore’s temperature has risen by 1 deg C,” she said.\n“Recycling is not just a trend for younger people – the older generation is actually very interested in sustainable living as well,” added Ms Fu, noting that the practice can also help to lower costs, such as using more energy efficient air conditioners.\nThe dialogue aimed to gather Singaporeans’ perspectives on sustainability issues, and was organised in support of Forward SG, said a Reach spokesman.\nForward SG is a year-long national exercise launched in June which aims to harness the views of Singaporeans to shape the nation’s future and renew its social compact.\nMs Tan said that recycling is “not one large effort, but consists of many small actions”. Her habits include bringing reusable takeaway boxes when she buys food, shopping for clothes only when necessary, and eating less meat to reduce methane emissions.\nMore than 200 people were at the dialogue, which was the third of a three-part series. The first was on women’s development and the second was on the challenges faced by vulnerable groups in society.\nMany in the audience of mainly Mandarin-speaking elderly Singaporeans shared their sustainable practices, such as growing vegetables and using reusable tote bags for grocery runs.", "url": "https://www.straitstimes.com/singapore/environment/efforts-towards-net-zero-goal-start-from-individual-actions-dialogue-panellists"}