{"authors": ["Anjali Raguraman", "Zaihan Mohamed Yusof"], "date_download": "2024-10-12 13:30:29", "date_modify": "2024-10-12 13:30:29", "date_publish": "2024-05-04 15:30:00", "description": "He will probably not return to Sengkang GRC, where he lost in GE2020, they said. Read more at straitstimes.com.", "filename": "singapore_politics_ng-chee-meng-likely-to-run-in-pap-stronghold-as-candidate-in-next-general-election-observers_1728739829.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/04/2024050459070280gin7145.jpg?VersionId=HdI0GoAto8cIeHGRRSsOviqHEMAXd_XH&h=0aa86779", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_ng-chee-meng-likely-to-run-in-pap-stronghold-as-candidate-in-next-general-election-observers_1728739829.html", "title": "Ng Chee Meng likely to run in PAP stronghold as candidate in next general election: Observers", "title_page": "Ng Chee Meng likely to run in PAP stronghold as candidate in next general election: Observers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Labour chief Ng Chee Meng is likely to run for the next general election, but in constituencies such as Jurong GRC or Ang Mo Kio GRC, said political observers.\nThey added that he will probably not return to Sengkang GRC, where a four-man People’s Action Party team led by Mr Ng lost to the Workers’ Party during the 2020 General Election with 47.88 per cent of the votes.\nSpeculation on Mr Ng making a comeback during the next general election intensified when he made an appearance at a Hari Raya Aidilfitri event organised by the FairPrice Group in Bukit Batok on April 21. Bukit Batok’s sitting MP, Mr Murali Pillai from the PAP, was also at the event.\nHowever, Mr Ng told reporters on April 25 that people should not “read too much” into the event, and that such appearances are part of NTUC’s regular groundwork.\nA Cabinet minister has traditionally held the post of NTUC secretary-general. The practice began with Mr Lim Chee Onn, who was the first labour chief to be appointed minister in the Prime Minister’s Office in 1980.\nMr Ng – who has been NTUC secretary-general since 2018 – is the first labour chief in decades who is not also a sitting MP.\n“Despite not being a current PAP MP, his continuing as NTUC secretary-general in the past four years indicates that the ruling party leadership has significant plans for him should he be elected,” said Singapore Management University associate professor of law Eugene Tan.\n“The symbiotic relationship between the PAP and NTUC makes it imperative for Mr Ng to be elected if he is to continue as the labour chief.”\nProf Tan added: “There are options for the PAP as to where he could be fielded, but it is unlikely he will be fielded in an SMC and even more unlikely to be fielded again in Sengkang GRC.”\nObservers suggested that Mr Ng is likely to be fielded in a PAP stronghold instead.\nDr Mustafa Izzuddin, a senior international affairs analyst at Solaris Strategies Singapore, said that as Mr Ng is seen as being a member of the 4G team, there is a high likelihood that he may be fielded in one of the safer GRCs for the coming election.\nWith Mr Ng being spotted in Bukit Batok, one possibility is that he may lead the Jurong GRC team, which is without an anchor minister after Mr Tharman Shanmugaratnam stepped down in June 2023 to contest, and subsequently win, the presidential election.\nWhile they are separate constituencies, both Bukit Batok and the five-member Jurong GRC come under Jurong-Clementi Town Council, together with the single seat of Yuhua.\nIn the 2020 General Election, a PAP team led by Mr Tharman secured almost 75 per cent of the vote in Jurong GRC – the highest of any electoral constituency.\nIn contrast, in Bukit Batok SMC, Mr Murali scraped a win with 54.8 per cent of the votes.\nBased on the 2020 General Election results, Pasir Ris-Punggol GRC, Ang Mo Kio GRC and Bishan-Toa Payoh GRC are also relatively safe seats for the PAP, noted Prof Tan.\nThe PAP secured 64.16 per cent of the vote in Pasir Ris-Punggol, 67.23 per cent in Bishan-Toa Payoh, and 71.91 per cent in Ang Mo Kio, where Prime Minister Lee Hsien Loong is anchor minister.\nProf Tan added: “Mr Ng was an MP in Pasir Ris-Punggol between 2015 and 2020, so he would still be fairly familiar to voters there. He could also be regarded as the possible successor to PM Lee in Ang Mo Kio GRC... (otherwise he could be) portrayed as the new anchor in Bishan-Toa Payoh GRC should Defence Minister Ng Eng Hen not contest or relinquish his anchor role.”\nThis week, when The Straits Times visited some of the constituencies where Mr Ng could be fielded, residents said it will be an uphill task for the NTUC secretary-general to replace former or current MPs who have served the community for a long time.\nResidents and merchants at shops and eateries in Bukit Batok spoke effusively of how Mr Murali – who has been serving the single seat ward since the 2016 by-election – is a consistent presence and a friendly one.\nAmong them was actor Ebi Shankara, 36, who lived in Bukit Batok for most of his life and still visits family in the area on a regular basis.\nHe described Mr Murali as “mild-mannered, amiable and someone who is always in touch with the people”, whether or not it is election season.\nA resident who wanted to be known only as Mr Lim, 66, said: “He comes around (the neighbourhood) quite a lot, so I appreciate it, because I have been staying here for over 30 years.”\nOther Bukit Batok residents, like a retiree who wanted to be known only as Mr Tang, 65, welcomed the idea of a new face like Mr Ng.\n“I think the Government needs him (to run) because he is a workhorse. They need people to do the work, and it’s not just about managing the estate,” said Mr Tang.\n“He is probably someone up and coming, and (the PAP) needs people, because the older ministers are tired after Covid-19,” he added.\nIn Jurong GRC’s Taman Jurong ward, where President Tharman was formerly MP, residents and stallholders were happy for Mr Tharman’s success in the presidential election, but believe his successor will have big shoes to fill.\nMadam Fatimah Begum Sikander, 50, said Mr Tharman came by the three-storey Taman Jurong Market and Food Centre, where she has had a briyani stall since 2009, almost every week.\n“He took note of everything and cared for us... I’m a single parent as well, so he always asked: ‘What help do you need?’” said Madam Fatimah.\n“It feels empty now that he doesn’t come by,” she lamented.\nIt was a sentiment mirrored by Ms Ryn Hashim, 38, who owns Malay food stall Sinar Rezeki. She has run the stall for 13 years.\n“I don’t think anybody can replace him,” she said.\nOn May 4, Mr Ng made another appearance in Serangoon North Avenue 3 at a FairPrice Group May Day block party that was also attended by PAP MP Ng Ling Ling.\nMs Ng is the representative for Jalan Kayu, which comes under Ang Mo Kio GRC.\nAt the event, Ms Ng said the labour chief had described residents in the area as “very warm” and welcoming.", "url": "https://www.straitstimes.com/singapore/politics/ng-chee-meng-likely-to-run-in-pap-stronghold-as-candidate-in-next-general-election-observers"}