{"authors": ["Lee Nian Tjoe"], "date_download": "2024-10-12 14:18:44", "date_modify": "2024-10-12 14:18:44", "date_publish": "2023-10-18 16:26:48", "description": "Open category premium soars to $158,004. Small car COE price rose to $106,000, while that for larger cars went up to $150,001. Read more at straitstimes.com.", "filename": "singapore_transport_records-set-in-three-coe-categories-open-category-coe-soars-to-158004_1728742724.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/18/aicoe1810.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_records-set-in-three-coe-categories-open-category-coe-soars-to-158004_1728742724.html", "title": "COE premiums continue rising; higher Nov-Jan quota unlikely to cool car demand, say dealers", "title_page": "COE premiums continue rising; higher Nov-Jan quota unlikely to cool car demand, say dealers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Certificate of entitlement (COE) premiums reached new highs for the two car categories and the Open category at the latest tender exercise on Wednesday.\nThe COE premium for larger cars with engines above 1,600cc or 130bhp and electric vehicles (EVs) above 110kW ended at $150,001, a 2.74 per cent increase over the $146,002 posted in the previous tender.\nThe premium for the Open category – which can be used for any vehicle type except motorcycles, but ends up being used mostly for bigger cars – ended at $158,004, up 3.95 per cent over the $152,000 record set two weeks ago.\nThis is the sixth consecutive time that records were broken for both the large car and Open COE categories.\nThe COE premium for smaller cars and EVs climbed 1.92 per cent to $106,000, from $104,000 set two weeks ago. The previous record of $105,000 was set just two tender exercises ago, in September.\nSome motor traders said the demand for smaller car COEs was partly fuelled by The Car Expo event held last weekend. Organised by SPH Media, which publishes The Straits Times, the event had a stronger focus on smaller and less powerful car models than other types of new cars.\nBy the end of the tender exercise on Wednesday, there were 1,028 bids for such COEs. This is only the second time since October 2021 that the number of bids for a COE category broke into four digits.\nThe motorcycle COE premium rose 3.18 per cent to end at $11,201, from $10,856.\nThe commercial vehicle COE premium ended at $84,790, 1.29 per cent below the $85,900 from two weeks ago. This is the only COE category that did not see an increase in price.\nThis is the last tender exercise before the next three-month quota period from November to January, when the COE supply will increase by 12.9 per cent.\nHowever, none of the motor dealers ST contacted believes that the increased quota for the next three months will be able to bring down COE premiums significantly.\nMs Sabrina Sng, managing director in charge of EV brand Polestar and sports carmaker Lotus at multi-franchise motor group Wearnes Automotive, said the COE supply is still too limited to address demand.\nAn average of 828 COEs for smaller cars and EVs will be available at each tender exercise for the next three months. This is nearly 14.6 per cent below the average of 969 such COEs for the same period in 2021. The premium for smaller car COEs then was between $35,990 and $43,501.\nKomoco Motor’s commercial director, Mr Ng Choon Wee, expects the COE supply beyond January 2024 to remain relatively low, based on the number of vehicle deregistrations expected over the next few months.\nThe average scrapping rate in the previous four quarters is the main determinant of the upcoming COE supply.\nMr Ng believes that premiums will come down only towards the end of 2024, when the COE quota increases significantly.\nBMW Eurokars Auto’s managing director, Mr Jason Lim, said the Singapore Motorshow happening in January and the Chinese New Year in February would continue to fuel demand for COEs in the new year.\nIn the immediate term, Mr Ron Lim, head of sales at Nissan agent Tan Chong Motor, said the three-week gap to the first tender exercise in November – which is one more week than the two-week norm – will give dealers more time to collect orders. This would make it unlikely for COE prices to fall.\nHe also expects buyers to continue snapping up cars till the end of 2023 before rebates offered under the vehicular emissions scheme (VES) are reduced next year.\nCar models that are banded “A2” under the scheme currently get a $15,000 rebate. This incentive will be reduced to $5,000 in the new year.\n“A lot also hinges on the number of VES A2 stock in the market. Be it customers snapping them up for fear of the $10,000 reduction in incentives or dealers wanting to pare down their inventory, any drop in COE premium might be minimal,” Mr Lim said.", "url": "https://www.straitstimes.com/singapore/transport/records-set-in-three-coe-categories-open-category-coe-soars-to-158004"}