{"authors": ["Selina Lum"], "date_download": "2024-10-12 13:53:44", "date_modify": "2024-10-12 13:53:44", "date_publish": "2022-01-12 19:07:47", "description": "Safeguards will be introduced to protect clients from the risk of potential abuse by lawyers. Read more at straitstimes.com.", "filename": "singapore_law-amended-to-allow-no-win-no-fee-agreements-between-lawyers-and-clients_1728741224.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/01/12/mi_supremecourt_120122.jpg?VersionId=Og38uxy5G6ZvP7FzX6qG4.LeDgeNgklC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_law-amended-to-allow-no-win-no-fee-agreements-between-lawyers-and-clients_1728741224.html", "title": "Law amended to allow 'no win, no fee' agreements between lawyers and clients for certain proceedings", "title_page": "Law amended to allow 'no win, no fee' agreements between lawyers and clients for certain proceedings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Lawyers and clients in certain cases can now come to an arrangement where the clients do not have to pay legal fees if they do not win the case.\n\"No win, no fee\" and other forms of conditional fee agreements, which were prohibited in Singapore, will now be allowed after the law was amended on Wednesday (Jan 12).\nFor a start, such agreements will be permitted only for international and domestic arbitration proceedings, certain proceedings in the Singapore International Commercial Court, and related court and mediation proceedings.\nThese proceedings typically involve high-value commercial disputes.\nSecond Minister for Law Edwin Tong told Parliament that allowing conditional fee agreements helps to level the playing field for Singapore lawyers in certain practice areas in relation to foreign lawyers who can offer such agreements.\nA conditional fee agreement, or CFA, is an arrangement where a lawyer is paid his legal fees only in specified circumstances.\nIt may take the form of a \"no win, no fee\" or \"no win, less fee\" agreement.\nA lawyer can also charge an additional amount, known as an \"uplift\", if the claim is successful.\nMr Tong noted that other jurisdictions have moved away from the traditional prohibitions against such agreements.\nEngland and Wales abolished the prohibition in the 1990s, and together with the United States, Australia and Canada, allow conditional fee agreements in various forms today, he said.\nAllowing such agreements can also enhance access to justice, said Mr Tong.\n\"Businesses with legitimate claims but (are) themselves facing cash-flow problems may not be able to fork out full legal fees at the outset,\" he said.\n\"CFAs will help provide such claimants with an alternative method of funding meritorious claims, which they may otherwise not be able to pursue.\"\nMr Tong said the ministry is studying the feasibility of extending such agreements but will consider it carefully as domestic proceedings may involve more vulnerable litigants.\nHe stressed that a conditional fee agreement is essentially a contract between the lawyer and the client. He also made it clear that such agreements are not intended to replace traditional fee structures.\nSafeguards will be introduced to protect clients from the risk of potential abuse by lawyers, he added.\nFor instance, such agreements must be in writing and signed by the client.\nContingency fee agreements, a different type of arrangement where a lawyer is paid a proportion of the damages awarded, will continue to be prohibited.\nMPs spoke in support of the changes, but also raised concerns ranging from potential conflict of interest to the prospect of raised litigation costs and increased frivolous litigation.\nMr Murali Pillai (Bukit Batok), Mr Lim Biow Chuan (Mountbatten) and Nominated MP Raj Joshua Thomas had concerns that a lawyer may advise his client to take a settlement because this will guarantee his fee, even though a settlement may not be in the client's best interest.\nMr Zhulkarnain Abdul Rahim (Chua Chu Kang GRC) suggested that a cap be mandated on the uplift amount to prevent legal costs from spiralling upwards.\nMr Tong said the introduction of fee agreements are unlikely to lead to an increase in frivolous cases as remuneration of lawyers depends on a successful outcome.\nHe said even with such a fee agreement, a lawyer remains obliged to advise his client that there is a prospect of recovering a higher sum of money through litigation compared with a settlement.\nHe also noted that existing professional rules against overcharging continue to apply.\n\"We believe that legal costs will continue to be moderated and also adjusted by the market itself. If a client finds that a lawyer's fees are too high, they're free to engage another lawyer,\" he said.\nMr Tong said limits on uplift fees are typically found in jurisdictions where such fee arrangements extend to indigent litigants.\nIn Singapore's case, the fee agreements do not apply to such litigants and hence, there is no need for any limit.\n\"If we expand our framework into other types of cases, this will be a fresh consideration that we will review at the appropriate time,\" he said.", "url": "https://www.straitstimes.com/singapore/law-amended-to-allow-no-win-no-fee-agreements-between-lawyers-and-clients"}