{"authors": ["Christie Chiu"], "date_download": "2024-10-12 13:57:22", "date_modify": "2024-10-12 13:57:22", "date_publish": "2019-04-16 17:49:05", "description": "SINGAPORE -Distribution of meals at The Salvation Army's Peacehaven Nursing Home used to be a strenous task for senior staff nurse Thomas Jeena and her colleagues. Read more at straitstimes.com.", "filename": "singapore_peacehaven-nursing-home-automates-distribution-of-meals-saves-time-and-money_1728741442.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/04/16/colin-nh-16.jpg?VersionId=2Lk5mXfz_tC.lSXFPjP3FdXWboO9P7KX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_peacehaven-nursing-home-automates-distribution-of-meals-saves-time-and-money_1728741442.html", "title": "Peacehaven Nursing Home automates distribution of meals, saves time and money", "title_page": "Peacehaven Nursing Home automates distribution of meals, saves time and money | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Distribution of meals at The Salvation Army's Peacehaven Nursing Home used to be a strenuous task for senior staff nurse Thomas Jeena and her colleagues.\nThey spent about 80 minutes a day collecting meals at the kitchen and manoeuvring heavy trolleys over uneven floors before food could reach the 380 residents.\nBut all that changed one year ago when the home bought two Automated Guided Vehicles (AGVs) to distribute meals in a safer and more efficient manner.\n\"Food can be served earlier to the residents and we can spend more time with them\" said Ms Jeena, 44.\nThe AGVs have also replaced some of Peacehaven's outsourced manpower for kitchen tasks, enabling the home to save about $12,000 a month on salaries alone.\nThe vehicles were officially launched on Tuesday (April 16) after the one-year trial, as part of a national drive to get nursing homes to automate and use technology more effectively.\nPeacehaven is currently the only nursing home in Singapore that uses such technology.\nEach AGV, which has a trolley, is wirelessly operated by a tablet control panel.\nThe vehicle has built-in sensors and 3D cameras allowing it to detect its programmed route via magnetic strips installed across the three-storey home. It uses this system to detect its destinations, where it stops for staff to load or unload the trolleys.\nAccording to Peacehaven, the machines automatically route around obstacles and can brake firmly even on slopes. Should a Wi-Fi breakdown occur, trolleys can be detached from the AGVs and manually manoeuvred without disrupting meal schedules.\nBesides the four meal distributions each day, the home will also be using the AGVs - each with a high load capacity of 300kg - to transport logistical supplies once a week.\nThe two AGVs cost $220,000, which was heavily funded by the Healthcare Productivity Fund and Community Silver Trust, administered by the Agency for Integrated Care (AIC).\nMr Tan Kwang Cheak, chief executive officer of AIC, attended the launch as the guest of honour.\nMadam Low Mui Lang, executive director of Peacehaven Nursing Home, said: \"When we adopt a system, we have to adopt a system that is safe and follows regulations.\"\nShe hopes to minimise the occurrence of workplace incidents and injuries, adding that the technology \"will also benefit the nursing home's efforts in recruiting and retaining older staff\".\nWith the time saved, staff will be able to provide more personalised care for the residents, improving their quality of life, she added.\nCorrection note: The story was edited for accuracy.", "url": "https://www.straitstimes.com/singapore/peacehaven-nursing-home-automates-distribution-of-meals-saves-time-and-money"}