{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:29:02", "date_modify": "2024-10-12 13:29:02", "date_publish": "2024-08-15 20:50:00", "description": "WHO declared mpox a global public health emergency on Aug 14, the second time in two years. Read more at straitstimes.com.", "filename": "singapore_s-pore-had-10-milder-mpox-cases-since-january-moh-says-low-risk-of-severe-variant-spreading-here_1728739742.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/15/IMG2800.JPG?VersionId=FYyzgV.yyGqsnHci7TioLgIDzjGEakmQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-had-10-milder-mpox-cases-since-january-moh-says-low-risk-of-severe-variant-spreading-here_1728739742.html", "title": "MOH says low risk of severe mpox variant spreading to S’pore", "title_page": "MOH says low risk of severe mpox variant spreading to S’pore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Despite the World Health Organisation (WHO) declaring mpox a global public health emergency on Aug 14, the Ministry of Health (MOH) said the immediate public health risk of the outbreak in Africa to Singapore is assessed to be low.\n“While there is cross-border spread of a potentially more severe mpox clade I in parts of Central and East Africa, the outbreak has thus far remained within the African continent, with no reported cases of clade I exported out of the African continent,” the ministry said on Aug 15.\nSingapore has had 10 cases of mpox since January 2024, which MOH confirmed were all from the milder form of the virus, known as clade II.\nMpox, formerly known as monkeypox, causes flu-like symptoms and pus-filled lesions on the body.\nThere were 32 cases here in 2023, and 19 cases in 2022 from the time reporting of the disease started at the end of June that year.\nTo date, all infections detected in Singapore have been the milder clade II infections, mostly coming during the 2022-2023 global outbreak.\nThe new, deadlier Ib sub-variant of the more virulent clade I strain has alarmed global health experts due to its ability to spread easily through routine close contact, including sexual contact.\nIt led the WHO to declare mpox a global public health emergency on Aug 14 for the second time in two years.\nAccording to the organisation’s multi-country outbreak of mpox report, there had been an unprecedented increase in the number of countries in the WHO African region reporting mpox cases and outbreaks in recent weeks.\nWhile almost all mpox cases are in the Democratic Republic of the Congo (DRC), the outbreak threatens bordering countries.\nBurundi, Kenya, Rwanda and Uganda have reported their first mpox cases, caused by clade Ib.\nChildren made up more than 70 per cent of mpox cases and 85 per cent of deaths in the DRC, where high rates of malnourishment leave children vulnerable to infections.\nAn emergency committee met on Aug 14 to advise WHO director-general Tedros Adhanom Ghebreyesus on whether the outbreak constitutes a public health emergency of international concern (PHEIC).\nA PHEIC declaration – WHO’s highest level of alert – can accelerate research, funding and international public health measures and cooperation to contain a disease.\nThe 2020-2023 Covid-19 pandemic was the last PHEIC-level outbreak before the 2022–2023 mpox outbreak.\nAccording to professor of medicine Dale Fisher from the NUS Yong Loo Lin School of Medicine, there is no significant movement of people between the DRC and Singapore for business or tourism, so the risk remains low at this stage. However, there should still be increased vigilance to prevent the spread of clade I and Ib here.\n“We should continue to maintain current practice, such as presenting for medical care if you have skin vesicles and getting them swabbed,” said Prof Fisher, who is also director of the NUS Centre for Infectious Disease Emergency Response. “Infection prevention measures are also important to stop the spread.”\nMOH said Singapore’s healthcare system has the capability to effectively diagnose and manage mpox infections, and the ministry has informed all medical practitioners and healthcare institutions to be vigilant in detecting and reporting all mpox cases, including those suspected to be clade I infections.\n“To aid in early detection of cases at our borders, we require all travellers to report mpox-related symptoms, such as fever or rash, and travel history through the SG Arrival Card. Should suspected clade I cases be detected, they will be isolated in hospitals,” it said.\nTo reduce spread, close contacts of confirmed cases will be quarantined and monitored for up to 21 days from the date of last exposure.\nDr Leong Hoe Nam, an infectious diseases doctor from Rophi Clinic, said that in contrast to the earlier clade, which spread primarily through sexual contact, “we are now seeing a lot of children getting infected”.\n“You can infer that contact is no longer among adult sexual partners but frequent contact. Healthcare workers should wear and take barrier precautions during consultation, and we need to watch for both (clades),” he said.\nThe first case of mpox in Singapore was diagnosed in 2019 when a business traveller from Nigeria had fever, chills, muscle pain and pus-filled bumps all over the body. The infection was attributed to the consumption of contaminated bushmeat two weeks before, and his close contacts were quarantined and vaccinated with smallpox live vaccine.\nThere was no local transmission in Singapore then, and there were no further local cases of mpox until the 2022 outbreak.\nSingapore made the viral disease reportable in mid-2022 following a global outbreak when the disease appeared in many countries – including the US, Australia and in Europe – where it is not endemic.", "url": "https://www.straitstimes.com/singapore/s-pore-had-10-milder-mpox-cases-since-january-moh-says-low-risk-of-severe-variant-spreading-here"}