{"authors": ["Elaine Lee", "Vihanya Rakshika"], "date_download": "2024-10-12 13:34:01", "date_modify": "2024-10-12 13:34:01", "date_publish": "2023-12-28 20:50:00", "description": "It was raining heavily when the bus crashed in the early hours of Dec 27. Read more at straitstimes.com.", "filename": "singapore_the-roads-were-pitch-black-and-it-was-raining-3-injured-after-s-pore-tour-bus-on-ns-highway-crashes_1728740041.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/29/wgt-cityline-291223.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_the-roads-were-pitch-black-and-it-was-raining-3-injured-after-s-pore-tour-bus-on-ns-highway-crashes_1728740041.html", "title": "‘Pitch black and raining’: 3 hurt after S’pore tour bus skids off Malaysia highway", "title_page": "‘Pitch black and raining’: 3 hurt after S’pore tour bus skids off Malaysia highway | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - In the early hours of Dec 27, Mr Jeremy Chua awoke to pain from a severely injured kneecap, in a coach that had turned turtle on the North-South Expressway in Malaysia.\nThe 27-year-old Singaporean and his girlfriend Sandar Tun, 26, were in a tour bus headed from Singapore to Kuala Lumpur when the vehicle skidded off the highway in Johor and crashed onto a grass patch. It was 3.54am at the time.\n“Most of the passengers were asleep when the crash happened,” said Mr Chua, who had booked the coach ride through a third-party booking website. “The pain was bearable, but I was in shock for a moment because I was also sleeping then.”\nHe added that his girlfriend bumped her head in the crash.\nAccording to Mr Chua, a financial consultant, the coach had cleared the Malaysian checkpoint at around 3am on Dec 27, and the accident happened about an hour later near Kulai, at the 41.3km mark of the highway.\nIt was raining very heavily when the bus crashed, and he saw the driver helping passengers out of the vehicle, he added.\n“I was seated at the first seat behind the driver,” he said. “I was very shocked to see the glass (of the windscreen) crack.”\nIn response to queries from The Straits Times, Renggam Fire and Rescue Department station chief Mohd Nizar Ma’mun said the fire brigade extricated two victims – including Mr Chua – from the bus. A passenger helped the third victim out of the vehicle.\nAccording to the Fire and Rescue Department of Malaysia’s Facebook post on this accident, there were 37 people on the bus, including four children.\nThree passengers – including Mr Chua – required medical assistance after the accident. The other two – both women – suffered a broken neck and unspecified minor injuries, respectively. At least one of the women is Singaporean, according to Mr Nizar.\nThe Facebook post was accompanied by photos of the accident that showed the bus had a Singapore vehicle registration plate.\nOne photo showed the bus on its side, with the word “Cityline” emblazoned on its rear windscreen.\nST’s checks online show that at least one travel agency here goes by that name. ST has contacted the company for more information.\nThe Kulai police department said in a statement on Dec 28 that it was notified about the accident at around 4.15am on Dec 27.\nThe driver had lost control of the bus due to heavy rain, and the coach skidded towards the left of the road and crashed, it added.\nChinese news outlet Shin Min Daily News reported that Malaysian police are investigating the 29-year-old driver for speeding.\nThe injured passengers were taken to a hospital in Kluang, Johor, by ambulance, Kulai police said.\nAfter they were informed about the accident, Mr Chua’s family arranged for another ambulance to bring him and his girlfriend back to Singapore. They arrived at the Singapore General Hospital at around 8am on Dec 28, and Mr Chua was scheduled for surgery the same day.\nHe said that his “kneecap had cracked into two” and was told by doctors that he may not fully recover from his injury.\n“I regret booking an overnight coach ride. The roads were pitch black, and it was raining,” added Mr Chua.", "url": "https://www.straitstimes.com/singapore/the-roads-were-pitch-black-and-it-was-raining-3-injured-after-s-pore-tour-bus-on-ns-highway-crashes"}