{"authors": ["Lee Li Ying"], "date_download": "2024-10-12 14:19:39", "date_modify": "2024-10-12 14:19:39", "date_publish": "2024-01-10 19:35:40", "description": "The initiative is meant to build online trust and safety. Read more at straitstimes.com.", "filename": "singapore_politics_new-20m-initiative-in-s-pore-to-develop-tools-to-detect-deepfakes-and-misinformation_1728742779.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/10/Kel1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_new-20m-initiative-in-s-pore-to-develop-tools-to-detect-deepfakes-and-misinformation_1728742779.html", "title": "New $20m initiative in S’pore to develop tools to detect deepfakes and misinformation", "title_page": "New $20m initiative in S’pore to develop tools to detect deepfakes and misinformation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Deepfakes circulating here could be watermarked in the future to alert viewers. Similarly, the same watermarking technology could be used to label trusted content.\nThis is among a new arsenal of detection tools Singapore is developing to tackle the rising scourge of deepfakes and misinformation. The tools will be designed under a new $20 million initiative to build online trust and safety.\nAnnouncing the efforts in Parliament on Jan 10, Minister for Communications and Information Josephine Teo said Singapore needs to grow new capabilities to keep pace with scammers and online risks. The most worrisome is the misuse of deepfakes to create compelling pitches.\n“Our digital way of life has exposed us to new risks. Cyber attacks, scams and harmful content pose a growing threat to our safety and security. As many MPs have noted, trust in society, so crucial for normal human interactions, could be undermined,” she said.\nAnd even though the Government has taken bold steps to counter these risks, including enacting new laws, more of the right things could be done continuously, said Mrs Teo.\nShe was responding to a motion, of which she expressed support, filed by five members of the Government Parliamentary Committee (GPC) for Communications and Information and five other MPs.\nTitled Building An Inclusive And Safe Digital Society, the motion contains 13 recommendations to better safeguard online transactions, detect deepfakes and scams, and educate the whole of society to take part in digital activities safely.\nThe GPC members who filed the motion are chairwoman Tin Pei Ling, deputy chairman Alex Yam and members Sharael Taha, Hany Soh and Jessica Tan. The five People’s Action Party MPs involved in the motion are Mr Darryl David, Ms Mariam Jaafar, Ms Nadia Ahmad Samdin, Mr Yip Hon Weng and Dr Wan Rizal.\nThe recommendations include having the Government take the lead in setting up information-sharing platforms to help the public better detect scams, ensuring that device makers and digital platforms provide stronger safeguards against malware, and holding social media services accountable for harmful content and malicious ads.\nParliamentarians unanimously supported the motion and spoke widely, covering areas from deepfakes manipulating public opinion to online scams to helping vulnerable groups navigate the digital space.\nDr Tan Wu Meng (Jurong GRC) said the issue of deepfakes is a serious matter for all democracies, and called on the Government to look at ways of electronically watermarking content as proof that it is real.\n“If we can no longer discern easily what is real and not real, you can’t even have a functioning democracy. No government, regardless of which political party they come from, will be able to govern in any country without that fundamental basis for deliberative democratic discussion,” he said.\nDr Tan raised the example of Prime Minister Lee Hsien Loong, who was recently a target of malicious actors, as he had his likeness used in scam videos to promote investment products.\n“That’s just deepfake 1.0. Project that forward, three, five or 10 years with more computing power, you can imagine how authentic those deepfakes are going to be,” he said.\nAs generative artificial intelligence (AI) becomes mainstream, it has become easier to create and spread deepfakes and misinformation.\nIn a year of record elections where at least 40 countries and territories are heading to the polls, that has given rise to concerns on how such manipulated content can influence voters.\nSingaporeans could head to the ballot box in 2024 too, as a leadership transition is set to take place by November.\nMrs Teo said a Centre for Advanced Technologies in Online Safety (Catos) will be set up to hone Singapore’s expertise in detecting deepfakes and online misinformation.\nThe centre comes under the Online Trust and Safety (OTS) Research Programme led by the Ministry of Communications and Information. Running from 2023 to 2028, the OTS receives $20 million funding under the Smart Nation and Digital Economy domain of Singapore’s Research, Innovation and Enterprise 2025 plan. These funds will be used to boost the research capabilities of Catos.\nCatos will be hosted by the Agency for Science, Technology and Research and will focus on building and customising tools to detect harmful content such as deepfakes and non-factual claims, and test technologies such as watermarking and content authentication.\nThe centre will also identify societal vulnerabilities and develop potential interventions, like flagging or correcting misinformation, that could reduce Internet users’ susceptibility to harmful online content.\n“These research efforts will also help inform new legislation or regulations that we may need for issues like deepfakes and which we are studying,” said Mrs Teo.\nCatos will be officially launched at an inaugural online trust and safety forum in the first half of 2024. The event will feature international experts and showcase the first version of technology solutions by Catos for trial and adoption.\nIn the lead-up to its official launch, Catos has started conversations with local researchers, technology developers and industry to raise awareness of the challenges and opportunities in online trust and safety since April 2023.\nThrough its various workshops and seminar events, Catos has built a professional online trust and safety community network, with over 100 participants from academia, industry and public agencies.\nTo date, more than 30 professionals are involved in Catos’ work, including scientists, engineers, operations staff and adjunct members. Catos draws on the multidisciplinary research capabilities of academic experts from local and global research institutes to strengthen research collaboration and knowledge exchange.\nMrs Teo also said that Singapore recently refreshed its AI strategy, with the launch of its second National AI Strategy (NAIS 2.0) in December 2023.\nThe Republic will soon update its recommendations on dealing with AI risks, and the Model AI Governance Framework 2.0 will be released for public consultation later in January.\n“For example, we are very concerned about the misuse of generative AI to spread misinformation and carry out targeted scams. Mitigating biasness and enhancing the explainability of AI models are also crucial to developing and deploying them responsibly,” she said.", "url": "https://www.straitstimes.com/singapore/politics/new-20m-initiative-in-s-pore-to-develop-tools-to-detect-deepfakes-and-misinformation"}