{"authors": ["Ovais Subhani"], "date_download": "2024-10-12 14:20:10", "date_modify": "2024-10-12 14:20:10", "date_publish": "2023-02-28 13:37:16", "description": "SINGAPORE - Even as the economic landscape becomes more challenging, Singapore will spare no effort to remain a competitive global business hub, said Minister for Trade and Industry Gan Kim Yong on Tuesday. Read more at straitstimes.com.", "filename": "singapore_politics_singapore-vows-to-keep-economy-competitive-despite-global-headwinds_1728742810.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/28/rrsgeconomy2802_11.jpg?VersionId=MXIqI6b1kI3wmw.l6ump78BRZXVlY7Mi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_singapore-vows-to-keep-economy-competitive-despite-global-headwinds_1728742810.html", "title": "Singapore vows to keep economy competitive despite global headwinds", "title_page": "Singapore vows to keep economy competitive despite global headwinds | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Even as the economic landscape becomes more challenging, Singapore will spare no effort to remain a competitive global business hub, said Minister for Trade and Industry Gan Kim Yong on Tuesday.\nIt will continue moves to raise productivity and launch a renewed focus on the professional and financial services, among others.\nIn a speech on his ministry’s spending plan for 2023, Mr Gan said this will likely not be an easy year for businesses, and the Government will not hesitate to provide targeted support where needed. Economic growth is also likely to slow down in 2023, while higher wages have been adding to business costs.\nTo ensure Singapore continues to punch above its weight on the global stage, businesses and workers must continue to improve efficiency and raise productivity, he said on Tuesday.\nThey must be ready for transformation if Singapore is to achieve the goals spelt out over the longer term in the Singapore Economy 2030 vision, said Mr Gan.\n“In the face of rising costs, biting resource constraints and a more challenging international environment, this is the only viable path to long-term growth and success,” he said.\nHe pointed out, for example, that in 2022, the nominal median gross monthly income for resident full-time workers grew by 8.3 per cent. And even after taking into account inflation, the real median income was up 2 per cent.\n“While higher wages add to the costs for businesses, the key is to ensure that productivity increases to support higher wages. In this way, both businesses and workers will benefit.”\nMore challenges in 2023\nWhile the economy grew 3.6 per cent in 2022, the business outlook for 2023 is expected to be more challenging, with economic growth likely slowing to a pace of 0.5 to 2.5 per cent, amid possible recession in major economies.\nThere are also major longer-term structural shifts that will create both opportunities and challenges for Singapore, he said.\nWhile geopolitical tensions put the open trading system under pressure, new technologies, such as artificial intelligence, are disrupting industries and business models, Mr Gan said.\nAdditionally, the transition to net-zero emissions will affect almost every industry, from energy to manufacturing, and from transport to financial services, he noted.\nMr Gan said that during the Budget debate, several MPs spoke about one of Singapore’s persistent manpower constraints. The population is ageing, slowing local workforce growth and increasing the need for foreign workers, he said.\nMr Gan said: “If we are to keep our economy vibrant, we must continue to deepen our skills and accommodate new arrivals to complement our local workforce and allow our companies to grow. This will require difficult trade-offs to be made, not just at the company level, but also as a society.”\nHowever, the minister said that even as these trends may seem daunting, Singapore’s economy is moving forward from a strong position, given its robust fundamentals such as an efficient infrastructure, connectivity, a highly skilled workforce, and its nimble and enabling policy environment.\nEye on service sector\nTo further consolidate the economic fundamentals, Mr Gan announced the launch of the Services 2030 vision, to tap growth opportunities in digitalisation and sustainability.\nHe said the focus will be on the modern services cluster, which includes professional, financial, and ICT and media services.\n“Within this decade, we aim to grow the value added from the modern services cluster by at least 50 per cent, and create more than 100,000 additional jobs in the same period,” he said.\nMr Gan also launched the Professional Services Industry Transformation Map 2025, or ITM 2025, which he said will play a key part in strengthening Singapore’s role as a leading business hub.\nThe professional services sector includes company headquarters, and professional services firms providing consulting, legal and accounting services, and the new ITM is among the 23 that support industry transformation.\n“Even as we press on with the transformation of our industries, we cannot let up on our efforts to ensure Singapore remains a strong global hub for businesses, investors, innovation and talent,” Mr Gan said.\nHowever, Singapore will have to work even harder to secure its hub status as the international tax landscape goes through a fundamental change with the introduction of Base Erosion and Profit Shifting 2.0, or BEPS 2.0 – a global scheme to discourage large multinational companies from evading tax due to their home countries.\nTo sustain Singapore as a competitive hub, Mr Gan said his ministry would use non-tax incentives such as the enhanced National Productivity Fund.\n“We will continue to ensure that funds are used judiciously to enhance our productivity and deliver tangible benefits to our businesses and workers.”\nIncentives and help\nSeveral incentive schemes are being extended for an additional five years to promote investment.\nMr Gan said that besides companies, Singapore will also want to attract high-calibre investors who bring with them valuable capital that supports the growth of local businesses and creates good jobs for more Singaporeans.\nThe Global Investor Programme will be enhanced to bring in greater contributions from investors, and to capture more value from a wider pool of investors.\nSingapore will continue to nurture innovative local enterprises, especially ones that find success beyond the domestic market. There will be enhanced grants to back such firms and the scope of other schemes to help them with financing and loans will be broadened.\nMr Gan said efforts to help businesses can bear fruit only if Singapore has a high-quality workforce with industry-relevant skill sets and capabilities.\nA Green Skills Committee will be set up to help impart training and green skills to the local workforce that are relevant to industry needs.\nHe added that with hard work and, in some cases, sacrifices from different stakeholders – including employers, unions, workers and the Government – Singapore could continue to punch above its weight on the global stage and build a strong economy for the future.", "url": "https://www.straitstimes.com/singapore/politics/singapore-vows-to-keep-economy-competitive-despite-global-headwinds"}