{"authors": ["Shabana Begum"], "date_download": "2024-10-12 14:00:06", "date_modify": "2024-10-12 14:00:06", "date_publish": "2022-06-13 16:38:21", "description": "Liver cancer is tricky to tackle as it does not respond well to conventional treatments such as chemotherapy. Read more at straitstimes.com.", "filename": "singapore_health_spore-dedicates-25m-to-liver-cancer-research-to-find-targeted-treatments_1728741606.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/13/sv_research_130622.jpg?VersionId=DNt5tDGd2id8OBhvAJPadjFY1DfpMzNq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_spore-dedicates-25m-to-liver-cancer-research-to-find-targeted-treatments_1728741606.html", "title": "S'pore dedicates $25m to liver cancer research to find targeted treatments", "title_page": "S'pore dedicates $25m to liver cancer research to find targeted treatments | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore is dedicating $25 million to liver cancer research in a new five-year programme led by the National Cancer Centre Singapore (NCCS) that aims to find the best treatments for the disease.\nThe team, comprising researchers from various institutions, will work to uncover biomarkers produced by the body or tumour so that specific therapies can be created to combat the most common type of liver cancer known as hepatocellular carcinoma (HCC).\nThe research programme and the $25 million grant for it were announced in a media briefing on Monday (June 13).\nLiver cancer is tricky to tackle compared with other common cancers. Conventional treatments such as chemotherapy are less effective on liver cancer.\nHence, the research aims to bring about biomarker-driven clinical trials that will pave the way for more effective tailored treatments for liver cancer patients, said Professor Pierce Chow, senior consultant at Singapore General Hospital and NCCS' division of surgery and surgical oncology, who is leading the programme.\nEarlier this month, the Ministry of Health's National Medical Research Council awarded the $25 million grant to the researchers, who are from NCCS, the Agency for Science, Technology and Research's Genome Institute of Singapore and Institute of Molecular and Cell Biology, the Cancer Science Institute of Singapore and Duke-NUS Medical School.\nIn Singapore, liver cancer is the third most common cause of cancer deaths in men and the fifth most common one in women.\nIt is difficult to diagnose the disease at early stages because the liver is an internal organ and once symptoms emerge, the cancer has already advanced, said Prof Chow.\nThe chances of the disease recurring are high. After removing the tumour in early-stage patients, there are no available therapies to prevent the tumour from returning.\n\"This inability to prevent the tumour from coming back even when diagnosed early (and with surgery) is the reason why the survival of patients with early liver cancer is not as good as those with early-stage breast, colorectal or lung cancer,\" noted Prof Chow.\nThe programme, called Precision Medicine In Liver Cancer Across An Asia-Pacific Network (PLANet 2.0), will involve two clinical studies.\nIn the first one, at least 30 liver cancer patients will undergo immunotherapy after surgery to reduce the chance of the tumour returning. Immunotherapy is a type of biological therapy that helps the immune system fight cancer better. The treatment is mainly given intravenously and orally.\nThe second study will involve 176 intermediate- and advanced-stage liver cancer patients who will receive internal radiation therapy. This treatment involves injecting tiny radioactive beads into the body so that the radiation from the beads can destroy the cancer cells.\nHalf of the 176 patients will then receive a type of immunotherapy while the other half will be placed in a placebo group. This will help researchers determine if patients do better with a combination of the novel radiation therapy and immunotherapy.\nThe researchers will take scans and collect blood and urine samples from the patients before, during and after the clinical studies.\n\"We will analyse the data deeply to understand why some patients respond to treatment and why some don't, so that we can identify biomarkers which in the future will allow us to choose the best therapy for a particular group of HCC patients,\" said Prof Chow.\nMr Goh Kheng Hock, 65, is one of the few who were fortunate enough to have his liver cancer detected early during a pre-employment health screening last year. In April 2021, he underwent surgery to remove a tumour.\nHe is currently taking medication to help fight a hepatitis B infection and slow the damage the infection is inflicting on his liver.\nMr Goh, who works as a patient concierge at a public hospital here, was part of an earlier clinical study under Prof Chow which aimed to test the effectiveness of a new MRI system in monitoring liver cancer patients' response to treatment.\n\"I participated in the study and underwent a few MRI scans because the research would eventually lead to better treatments and diagnoses for future liver cancer patients,\" said Mr Goh in Mandarin.\nIt is patients like Mr Goh that the new research hopes to benefit, so that their clinical outcomes will look up, added Prof Chow.", "url": "https://www.straitstimes.com/singapore/health/spore-dedicates-25m-to-liver-cancer-research-to-find-targeted-treatments"}