{"authors": ["Joyce Teo"], "date_download": "2024-10-12 13:47:56", "date_modify": "2024-10-12 13:47:56", "date_publish": "2022-12-21 17:41:46", "description": "SINGAPORE - Men aged 50 to 59 were most likely to drink alcohol at least five days a week, while young adults in the 18-29 age group were most likely to binge drink or have several alcoholic drinks in one sitting, an annual population health survey has found. Read more at straitstimes.com.", "filename": "singapore_health_regular-alcohol-use-most-common-in-older-men-binge-drinking-in-young-adults-survey_1728740876.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/23/nfdrink211222.jpg?VersionId=w11v_mg95mlzaq28g9Waa_VCsizJowUn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_regular-alcohol-use-most-common-in-older-men-binge-drinking-in-young-adults-survey_1728740876.html", "title": "Regular alcohol use most common in older men, binge drinking in young adults: Survey", "title_page": "Regular alcohol use most common in older men, binge drinking in young adults: Survey | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Men aged 50 to 59 were most likely to drink alcohol at least five days a week, while young adults in the 18-29 age group were most likely to binge drink or have several alcoholic drinks in one sitting, an annual population health survey has found.\nThe prevalence of regular and binge drinking in Singapore remained stable between 2019 and 2021, though this has been on an upward trend over the past decade, said the Ministry of Health (MOH), which released the latest National Population Health Survey results on Tuesday.\nThe survey was conducted between July 2020 and June 2021, making it the first set of survey results to be impacted by the Covid-19 pandemic. Singapore residents aged 18 to 74 were polled.\nThe results showed that in 2021, 2.8 per cent of Singapore residents consumed alcohol regularly, 11.3 per cent frequently, 30.7 per cent occasionally and 55.2 per cent were non-drinkers. More men than women consumed alcohol regularly.\nRegular drinkers are those who drink at least five days a week, frequent drinkers are those who drink one to four days a week, and occasional drinkers are those who do so three days a month or less.\nOver the past decade, there has been a significant rise in the prevalence of regular drinking observed mainly among adults aged 30 to 49, those who are male, and among the Chinese as well as those with post-secondary education, said MOH.\nThe prevalence of binge drinking stayed stable at 9.6 per cent in 2021, and such drinking was more prevalent among men (13.8 per cent) than women (5.6 per cent), the survey found.\nBoth genders in the 18 to 29 age group had the highest proportion of binge drinkers – males at 20.4 per cent and females at 10.7 per cent.\nBinge drinking is defined as consumption of at least five alcoholic drinks for men or at least four alcoholic drinks for women in any single drinking session in the month preceding the survey.\nThe upward trend in binge drinking between 2007 and 2021 was observed in all age groups, except those aged 60 to 74, in both genders, among Chinese and Indians, and those with post-secondary education, the survey said.\nSeveral diseases, such as liver and pancreas disease, neuropsychiatric disease, cardiovascular diseases and certain cancers, are entirely or partially caused by alcohol consumption, it said.\nIn a statement on the survey, MOH said that to target binge drinking, it will continue its educational efforts in mainstream schools and institutes of higher learning, and through information on the harmful effects of alcohol consumption on HealthHub, a one-stop health portal.", "url": "https://www.straitstimes.com/singapore/health/regular-alcohol-use-most-common-in-older-men-binge-drinking-in-young-adults-survey"}