{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:36:53", "date_modify": "2024-10-12 13:36:53", "date_publish": "2024-05-18 16:30:00", "description": "The RSAF’s F-15SG fighters and the army’s Veloce 15 mini-Unmanned Aerial Vehicles participated for the first time. Read more at straitstimes.com.", "filename": "singapore_670-army-servicemen-from-singapore-us-participate-in-exercise-tiger-balm-in-washington_1728740213.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/18/Photo205.jpeg?VersionId=_W3O4jNdsLRq.eK5XJgYVNUP1zk81NS4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_670-army-servicemen-from-singapore-us-participate-in-exercise-tiger-balm-in-washington_1728740213.html", "title": "670 army servicemen from Singapore, US take part in Exercise Tiger Balm in Washington", "title_page": "670 army servicemen from Singapore, US take part in Exercise Tiger Balm in Washington | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – About 670 servicemen from the US and Singapore armies participated in an annual exercise from May 6 to 17 in Washington state.\nThe Ministry of Defence (Mindef) said on May 18 that the 43rd Exercise Tiger Balm was held at the Joint Base Lewis-McChord and Yakima Training Centre.\nThe personnel involved were from Headquarters 6th Singapore Division/Headquarters Sense & Strike (6 Div/HQ SS), Headquarters 76th Singapore Infantry Brigade, the Republic of Singapore Air Force’s (RSAF) Peace Carvin V Detachment, as well as the US Army’s Hawaii Army National Guard, the 29th Infantry Brigade Combat Team and the 16th Combat Aviation Brigade.\nThe combined arms live firing component of the exercise involved personnel from the Singapore Army’s Strike Observer Mission team, 11th Command, Control, Communications, Computers and Intelligence Battalion, the RSAF’s Peace Carvin V Detachment, and the US Army’s Fire Support Team and Field Artillery unit.\nThe RSAF’s F-15SG fighters and Singapore Army’s Veloce 15 mini-Unmanned Aerial Vehicles took part in the exercise for the first time.\nThis enabled the participants to strengthen air-land integration across both services.\nExercise Tiger Balm included a combined arms live firing component, as well as simulation system integration that linked command posts at the Joint Base Lewis-McChord with the Singapore Armed Forces Wargame Centre at the Pasir Laba Camp in Singapore to coordinate planning and execution between both brigades.\nBoth armies conducted subject matter expert exchanges on the counter-improvised explosive device, as well as chemical, biological and radiological defence operations.\nSaid Colonel Anand Sathi Kumar, commander of 6 Div/HQ SS: “The successful conduct of the complex scenarios within the exercise is a demonstration of the competence and commitment of both forces.”\nFirst conducted in 1981, Exercise Tiger Balm is the longest-running bilateral exercise between the Singapore and United States armies.\n“This annual exercise allows both armies to collaborate and share tactics, techniques and procedures, and is the hallmark of the excellent and longstanding ties between both armed forces,” said Mindef.\n“Both armies also interact extensively through professional exchange programmes, cross-attendance of courses, and other bilateral and multilateral exercises,” it said.\n“These regular interactions have fostered and enhanced the professionalism, friendships and mutual understanding among personnel from both armies,” the ministry added.", "url": "https://www.straitstimes.com/singapore/670-army-servicemen-from-singapore-us-participate-in-exercise-tiger-balm-in-washington"}