{"authors": ["Elaine Lee"], "date_download": "2024-10-12 13:56:07", "date_modify": "2024-10-12 13:56:07", "date_publish": "2024-06-15 18:52:00", "description": "A 24-year-old pedestrian who was also involved in the accident was taken to the hospital unconscious. Read more at straitstimes.com.", "filename": "singapore_male-cyclist-killed-after-accident-with-lorry-in-woodlands-driver-arrested_1728741367.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/15/image2028929.jpg?VersionId=d8YN_6tQy_nTSqHxzrSr75fSdkYsUGv2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_male-cyclist-killed-after-accident-with-lorry-in-woodlands-driver-arrested_1728741367.html", "title": "Male cyclist killed after accident with lorry in Woodlands; driver arrested", "title_page": "Male cyclist killed after accident with lorry in Woodlands; driver arrested | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A male cyclist died after an accident involving a lorry and a pedestrian in Woodlands on the morning of June 11.\nThe authorities said the accident happened at 6.35am near Woodlands Avenue 9.\nA 24-year-old female pedestrian and a 53-year-old male cyclist were taken unconscious to Khoo Teck Puat hospital, where police said the man later died.\nThe daughter of the cyclist, who gave her name as Ms Ong, told Shin Min Daily News that her parents worked at the same food factory.\nThe 28-year-old said the accident happened just 10 minutes from her home, the Chinese evening daily reported.\nShe also said that her father would cycle to work every day, and would do so an hour earlier than her mother.\nWhen her mother left the house that day at around 8am, she passed the site of the accident and found a bicycle that looked like her father’s, Ms Ong, an interior designer, told Shin Min.\nWhen her mother called his mobile number, staff from the hospital told her about the accident and said he was in critical condition, she said.\nMs Ong told Shin Min that her mother called her afterward, and the duo rushed down to the hospital together, but her father died before they arrived.\nA 69-year-old male lorry driver was arrested for causing death through dangerous driving.\nPolice investigations are ongoing.", "url": "https://www.straitstimes.com/singapore/male-cyclist-killed-after-accident-with-lorry-in-woodlands-driver-arrested"}