{"authors": ["Vihanya Rakshika"], "date_download": "2024-10-12 13:54:24", "date_modify": "2024-10-12 13:54:24", "date_publish": "2024-05-03 21:10:00", "description": "The 49-year-old Singaporean initially resisted the idea of joining the family trade. Read more at straitstimes.com.", "filename": "singapore_i-am-not-giving-up-thambi-magazine-store-owner-strives-to-continue-family-business-despite-closure_1728741264.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/03/ST15599.jpg?VersionId=fBeQjTC35VeppvbI95uVDMaizBoFNNN9&h=859742e3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_i-am-not-giving-up-thambi-magazine-store-owner-strives-to-continue-family-business-despite-closure_1728741264.html", "title": "‘I am not giving up’: Thambi Magazine Store owner seeking new Holland Village site after closure", "title_page": "‘I am not giving up’: Thambi Magazine Store owner seeking new Holland Village site after closure | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Mr Periathambi Senthil Murugan, better known as Sam, was a marine engineering student in the 1990s when circumstances led him to take over the family-run Thambi Magazine Store.\nHe has since become the backbone of the business, which will see its last day of operation at Holland Road Shopping Centre on May 5.\nThe 49-year-old Singaporean, who is the elder of two siblings, initially resisted the idea of joining the family trade.\n“Before all that, when I was younger, I wanted to run away... from my father’s business and live a life of my own somewhere else,” Sam shared with The Straits Times.\nDespite his initial reluctance, he eventually embraced the role of running the store and found himself passionate about it soon after.\n“It is very sad for me that I have to close the store after all this while,” he lamented.\nThe eight-decade-old family business began as a newspaper distribution service started by his late grandfather, Mr P. Govindasamy, in the 1940s.\nSam made significant changes to the business after taking over from his father in the 1990s.\nOne notable move was displaying magazines openly on shelves along the walkway outside the store, inviting passers-by to browse.\n“I believe that letting people touch, open and browse the copies would allow interest to form and encourage potential customers to make purchases,” he explained.\nPlans to revamp the area influenced his decision to close shop, with requests being made to remove the outdoor shelves and confine business activities to the shop interior being the main impetus.\nSam declined to say who will put those plans into action but said it is “not the government bodies”.\n“Nobody comes into the store to make purchases. They usually only walk past the walkway and see what’s on the shelf before deciding to buy,” he said.\nSam has expressed a strong desire to preserve the neighbourhood’s heritage. He had structured his store to resemble a “mamak shop” (Indian-run provision store) from the 1970s.\nThe decision to close was not easy, especially as he has been living in Holland Village since his childhood. He now lives in a three-room Housing Board flat there with his wife and two children.\nThe store has been operating at a loss for the past five months, with profits falling by about 20 to 30 per cent from those of the past five to 10 years.\nAfter the store’s last day of business, Sam plans to continue distributing local newspapers to homes as a vendor.\nSince news of the impending closure, the store has seen more customers, some there solely to take photos with Sam.\nSeveral customers said they will miss him and the store.\nMr Rajoo Maniam, 53, a regular, said “it’s a waste the store has to go”.\n“Some years back, I used to bring my children here and get them to browse through the science magazines before buying them.\n“My two children, who are now in secondary school, have developed a keen interest in the sciences thanks to the store.”\nMadam Nirmala Devi, a 72-year-old retired teacher, said: “Sam is always friendly and all smiles when I am at his store. His store is like a time capsule, and the only place I feel a sense of familiarity of the good old days.”\nSam’s dedication to the store has come at some personal cost, including having less time with his family.\nHis two children, both in their early 20s and waiting to start university, have often felt the absence of their father. His store, which is jointly run by his wife, sister and her family, opens at 7am and closes only at 8pm.\nDespite the challenges, Sam’s passion for the business and the heritage of Holland Village remains undiminished.\n“I’m still lost. I find it hard to accept that I cannot continue to run the store here because we have been here for so long.\n“I am not giving up. I still have the grit to keep the Holland Village heritage alive,” he affirmed.\nHe aims to keep up his search for a suitable location within Holland Village to reopen Thambi Magazine Store.", "url": "https://www.straitstimes.com/singapore/i-am-not-giving-up-thambi-magazine-store-owner-strives-to-continue-family-business-despite-closure"}