{"authors": ["Esther Loi"], "date_download": "2024-10-12 13:43:55", "date_modify": "2024-10-12 13:43:55", "date_publish": "2023-12-16 20:55:00", "description": "Before the Covid-19 pandemic, the airline’s fleet consisted of 19 A380s; seven of them were retired in November 2020. Read more at straitstimes.com.", "filename": "singapore_transport_all-12-sia-a380s-back-in-the-skies-amid-post-pandemic-travel-rebound_1728740635.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/16/yaohui-pixgeneric-9761.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_all-12-sia-a380s-back-in-the-skies-amid-post-pandemic-travel-rebound_1728740635.html", "title": "All 12 SIA A380s back in the skies amid post-pandemic travel rebound", "title_page": "All 12 SIA A380s back in the skies amid post-pandemic travel rebound | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – All 12 of Singapore Airlines’ (SIA) Airbus A380s have returned to the skies in the midst of a surge in demand for air travel.\nBefore the Covid-19 pandemic, the national carrier’s fleet consisted of 19 A380s. However, following a review of its long-term network of routes, SIA retired seven of these jumbo jets in November 2020, bringing its A380 fleet size down to just 12.\nThese double-deck planes had undergone work that involved the introduction of SIA’s latest long-haul suites, business class, premium economy class and economy class cabins.\nThe 12th A380, with the aircraft registration 9V-SKP, was the latest to resume flight operations on Dec 7, SIA confirmed to The Straits Times on Dec 14. This came after three years and nine months of not ferrying passengers.\nThe airline said that putting all of its existing A380s back into service is part of its fleet management strategy, ensuring that the airline remains “nimble”, “flexible” and ready to deploy flights with maximum capacity to markets with high demand.\nEach A380 has a total of 471 seats – six suites, 78 business class seats, 44 premium economy class seats and 343 economy class seats.\nSuites that come complete with a sliding door for privacy and a full-flat bed are exclusive to SIA’s jumbo jets.\nSIA currently operates A380s on services to seven destinations: Auckland, Hong Kong, London, Mumbai, New Delhi, Sydney, and Tokyo’s Narita airport.\nAsked if it would broaden the network of cities its A380s serve, SIA said it will continue monitoring developments and adjust its network and capacity accordingly.\nNoting the popularity of its flagship A380 fleet among its customers, the airline said that these superjumbos will continue playing an important role in its fleet, especially on flights to airports with fewer landing slots.\nThis is because the A380s have higher passenger capacities compared with other aircraft, so deploying them on these routes will allow SIA to maximise its revenue.\nMs Mabel Kwan, a managing director at aviation consultancy Alton, said the full resumption of its A380 operations is an indication of the airline’s continued confidence in the rebound in post-Covid air travel.\nShe noted that SIA will need increased capacity to capitalise on growing air traffic demand, especially due to the delays in delivery of the Boeing 787-10 as well as 777-9 aircraft, which are scheduled to arrive from 2025.\nMs Kwan said that the retrofitting of all 12 A380s demonstrates the airline’s intent to keep these aircraft around for the medium term of five to eight years, given the significant investment involved.\nThe refurbishment would allow SIA to maximise its slots at congested airports, through the jumbo jets’ higher passenger capacities, enabling the airline to maintain or grow its market share on busy routes, noted Ms Kwan.\nSIA is not the only airline which has resumed its operation of A380s, added Ms Kwan, with British Airways, Qatar Airways and Australia’s Qantas also doing so.\nMr Mohshin Aziz, director of Pangolin Aviation Recovery Fund, which invests in aviation businesses, noted that these A380s can operate only on high-capacity routes, as many smaller airports do not have the necessary infrastructure – wide runways and larger terminals – to support these jumbo jets.\nIt is therefore likely that SIA will resume A380 services at important aviation hubs, including Melbourne and Beijing, said Mr Aziz.\nHowever, independent analyst Brendan Sobie noted that SIA’s current fleet of 12 A380s is still much smaller than before the pandemic.\nThe resumption of the airline’s 12th A380 has not resulted in any additional capacity for the year-end holiday season as there is another A380 that is currently undergoing maintenance, he added.\nMr Sobie said the 12th jet will have a “very modest” impact on increasing capacity when SIA resumes its A380 flights to Shanghai from Feb 2, 2024. The number of A380 flights will increase to 10 return flights per day from Feb 2, up from nine now.\n“So the reinstatement of A380 services isn’t about capturing rising travel demand, but about finally getting at least some of the fleet back into service. It is also about finally completing the retrofits – which have taken an unusually long time for a small number of aircraft – given that it was initially announced so many years ago,” said Mr Sobie.", "url": "https://www.straitstimes.com/singapore/transport/all-12-sia-a380s-back-in-the-skies-amid-post-pandemic-travel-rebound"}