{"authors": ["David Fogarty"], "date_download": "2024-10-12 13:37:56", "date_modify": "2024-10-12 13:37:56", "date_publish": "2022-10-25 09:47:09", "description": "Its greenhouse gas emissions will reach about 60 million tonnes in 2030, from previous target of 65 million tonnes. Read more at straitstimes.com.", "filename": "singapore_singapore-boosts-un-climate-targets-confirms-net-zero-by-2050_1728740276.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/25/2021071528590673eb3b6113-54fa-4fba-b86a-50bf9680d751_28.jpg?VersionId=HCPdp55e2WlP9HvazR4CrN9eogkD4M6r", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-boosts-un-climate-targets-confirms-net-zero-by-2050_1728740276.html", "title": "Singapore boosts UN climate targets, confirms net zero by 2050", "title_page": "Singapore boosts UN climate targets, confirms net zero by 2050 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore will reach net-zero greenhouse gas emissions by 2050, Deputy Prime Minister Lawrence Wong said on Tuesday, while also announcing a stronger 2030 target as part of the nation’s efforts to fight climate change and meet its international obligations.\nThe Government, which had previously said it was considering reaching net-zero emissions by 2050, has confirmed it is on track to achieve the target.\nMr Wong said the nation’s greenhouse gas emissions will reach about 60 million tonnes in 2030 after peaking earlier.\n“We had previously committed to peak our emissions in 2030 at 65 million tonnes of CO2 (carbon dioxide) equivalent,” he said at the opening of Singapore International Energy Week, a major annual regional energy conference.\n“We will now aim to peak our emissions earlier, and reduce our emissions to around 60 million tonnes of CO2 equivalent in 2030. This five-million tonne improvement is significant. It is equivalent to reducing our current transport emissions by two-thirds.”\nHe also said the public sector will commit to achieving net-zero emissions around 2045, while new developments within the Jurong Lake District will reach net-zero emissions around 2045 too.\nSingapore International Energy Week is one of the region’s largest energy conferences, bringing together governments, industry, investors and academia. This year’s event, the 15th time it has been held, is dominated by the global energy crisis and the need to speed up the transition to a greener and more secure energy future.\nMr Wong said Singapore has progressively cut its greenhouse gas emissions, achieving a reduction of 32 per cent below business-as-usual levels by 2020 to 52.8 million tonnes. This was double the 16 per cent reduction pledged in 2009, giving the Government the confidence to raise its climate ambition. He said achieving net-zero emissions by 2050 will be a stretch target but a necessary one, and would involve electricity imports, solar energy, carbon offsets and other steps, such as hydrogen.\nHe also announced Singapore’s ambitious programme to scale up low-carbon hydrogen investment and deployment, and said this will be a key part of meeting the nation’s mid-century net-zero target.\nHe said that to enhance Singapore’s energy security, “we must redouble efforts to green our energy sources because climate change is happening at an even faster pace”.\n“The energy crisis and the climate crisis have become a vicious cycle. And the world cannot afford to choose between an energy crisis and a climate crisis,” he said. “To have energy security, we will need to resolve the climate crisis too.”\nBut global success meant international collaboration under the 2015 United Nations Paris climate agreement. “The transition to net zero demands ambitious and collective action,” he said in his opening address.\nThe revisions to Singapore’s climate targets come two weeks before the start of the COP27 United Nations climate talks in Egypt. The annual talks bring together nearly 200 nations as well as business leaders and civil society, and are the main negotiating session for global climate diplomacy.\nAt last year’s COP26 talks in Glasgow in Scotland, nations were asked to revisit and strengthen their 2030 targets by the end of this year. This was in recognition that collective global efforts to cut greenhouse gas emissions are still not enough to limit global warming to 1.5 deg C above pre-industrial levels, a level climate scientists say should not be breached.\nThe world has already warmed 1.2 deg C since the mid-19th century.\nThe UN’s climate science panel, the Intergovernmental Panel on Climate Change, says limiting warming to around 1.5 deg C requires global greenhouse gas emissions to peak before 2025 at the latest, and be reduced by 43 per cent by 2030. Last year, global emissions of CO2, the main greenhouse gas, reached another peak.\nWhile Singapore is strengthening its 2030 target, its emissions will still grow before starting to fall towards the end of this decade to reach net zero by 2050. Net zero means any residual emissions from hard-to-abate sectors, such as aviation or some industrial processes, will be removed by buying carbon offsets or using technology that removes CO2 from the atmosphere.\nIn response to questions, A National Climate Change Secretariat spokesman noted Singapore’s emissions were still growing, but said: “Unlike other cities or countries that have abundant access to alternative energy sources like wind, nuclear and hydropower, Singapore’s geography and small land area hamper our ability to harness alternative energy.”\n“In addition, Singapore also has a significant industry sector that many Singaporeans are employed in, which contributes significantly to Singapore’s economy. An abrupt transition will be disruptive to the economy and to citizens.”\nThe spokesman said And many of Singapore’s decarbonisation options this decade, such as carbon capture, utilisation and storage and electricity imports, were contingent on technological maturity and effective international cooperation.\nThe spokesman added that Singapore is committed to bending its emissions curve this decade.\nAmong the steps to cut Singapore’s emissions are solar panels on roofs and reservoirs, setting a zero-growth policy for cars and motorcycles, and raising the carbon tax progressively from the current $5 a tonne to around $50 to $80 a tonne by 2030.\nProfessor Koh Lian Pin, a Nominated MP and director of the National University of Singapore’s Centre for Nature-based Climate Solutions, said: “This announcement is timely, given that Parliament will (in November) be debating the changes to the law on carbon pricing in Singapore, which is a key way to get large emitters here to reduce their emissions.\n“It is also heartening to know that Singapore is interested in tapping carbon markets to achieve our climate goals. With deforestation being a major contributor to greenhouse gas emissions, conserving nature through high-quality carbon projects can help to turn off the tap of emissions while helping to draw down the amount of carbon dioxide in the atmosphere.”\nMs Melissa Low, a research fellow at the centre, said the Republic is one of only about 20 countries, including COP27 host Egypt, as well as Australia, Indonesia and India, to have updated their 2030 climate targets since the Glasgow gathering.\nShe called the decision commendable but expressed some concern because Singapore’s emissions are still growing.\n“Considering that the Singapore Parliament has declared climate change to be a global emergency, an increase in emissions trajectory to peak earlier, is still worrying.”", "url": "https://www.straitstimes.com/singapore/singapore-boosts-un-climate-targets-confirms-net-zero-by-2050"}