{"authors": ["Yong Li Xuan"], "date_download": "2024-10-12 13:58:07", "date_modify": "2024-10-12 13:58:07", "date_publish": "2024-06-22 22:46:39", "description": "The Pope will make his maiden visit to Singapore from Sept 11 to 13. Read more at straitstimes.com.", "filename": "singapore_president-tharman-meets-pope-francis-in-rome_1728741487.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/22/44877683610230506191773985103843365599367954n.jpg?VersionId=zxCe0G_lOrKFQlLQOs3O8wFUGR67FW8t", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_president-tharman-meets-pope-francis-in-rome_1728741487.html", "title": "President Tharman meets Pope Francis in Rome", "title_page": "President Tharman meets Pope Francis in Rome | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - President Tharman Shanmugaratnam met Pope Francis at the Holy See in Rome on June 22.\nMr Tharman is in the Italian capital for a Group of 30 plenary hosted by the Banca d’Italia, and will co-chair a meeting of the Global Commission on the Economics of Water from June 20 to 23.\nFrom June 24 to 26, he will be on official visits to Italy and Estonia.\nIn a Facebook post on June 22, Mr Tharman said: “It was a privilege for me to have a private audience with His Holiness Pope Francis, together with my wife this morning at the Holy See, during my visit to Rome.”\nHe said the Pope spoke of the need to “bring an end to a world at war and conflict, and the immense human suffering it continues to inflict”.\nThey also discussed inter-faith harmony, which is “more important than ever”, Mr Tharman said.\nHe added: “I shared Singapore’s continuous efforts to preserve harmony between our many faiths, both through leadership engagements and activities on the ground.\n“We are looking forward very much to welcoming Pope Francis during his state visit to Singapore in September this year.”\nPope Francis will make his maiden visit to the Republic from Sept 11 to 13.\nThe 87-year-old pontiff will celebrate mass – Singapore’s first papal mass in close to 40 years – on Sept 12.\nMore than 40,000 tickets will be available to the public through an online ballot that is open to anyone in Singapore with a valid account on the myCatholicSG portal. Registration will be open between June 24 and July 31.\nDuring the visit at the Holy See, Mr Tharman and Pope Francis also exchanged gifts.\nMr Tharman said: “In the traditional exchange of gifts, Pope Francis gave me a bronze cast depicting two hands shaking, a woman with a child, and a migrant ship, against the backdrop of St Peter’s colonnade in the Vatican City.\n“With a simple and profound description: ‘Let’s fill our hands with other hands.’”", "url": "https://www.straitstimes.com/singapore/president-tharman-meets-pope-francis-in-rome"}