{"authors": ["Tay Hong Yi"], "date_download": "2024-10-12 13:51:54", "date_modify": "2024-10-12 13:51:54", "date_publish": "2023-09-07 19:04:00", "description": "The guidelines will be launched in 2024 to ensure that flexi-work requests are fairly and properly considered. Read more at straitstimes.com.", "filename": "singapore_jobs_government-unions-employer-groups-start-work-on-guidelines-on-flexible-work-arrangements_1728741114.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/07/yaohui-pixgeneric-5064.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_jobs_government-unions-employer-groups-start-work-on-guidelines-on-flexible-work-arrangements_1728741114.html", "title": "Government, unions, employer groups start work on guidelines on flexible work arrangements", "title_page": "Government, unions, employer groups start work on guidelines on flexible work arrangements | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A new tripartite workgroup formed to develop a set of guidelines on flexible work arrangements (FWAs) met for the first time on Thursday, to set out the areas it will focus on and the results it aims to achieve.\nThe group comprises representatives from the Government, the National Trades Union Congress (NTUC), the Singapore National Employers Federation (SNEF), as well as various union, employer, workplace fairness and professional bodies.\nIt will craft the Tripartite Guidelines on Flexible Work Arrangements, which will be launched in 2024.\nThe guidelines are set to ensure that FWA requests are fairly and properly considered in a practical manner, taking into account both workers’ and businesses’ needs, the Ministry of Manpower (MOM) said in a statement on Thursday.\nThe workgroup will also develop a strategy to support employers and employees in following the guidelines, and recommend ways to promote effective and sustainable provision and use of FWAs.\nCurrently, employers can voluntarily adopt the Tripartite Standard on FWAs, which sets out best practices in offering flexi-work and handling requests for such arrangements. The guidelines will build on these, MOM noted.\nThe guidelines, which will be compulsory for employers to follow, were mooted for the first time in the White Paper on Singapore Women’s Development submitted to Parliament in March 2022.\nThe ministry said that FWAs help employees achieve better work-life harmony and promote a more engaged and productive workforce, which, in turn, benefits employers.\nIt also said employers who offer flexi-work also benefit from better talent attraction and retention.\n“As Singapore is fast becoming a ‘super-aged’ society with growing caregiver needs and tight labour supply, FWAs have also become increasingly important to enable more employees to continue working or re-enter the workforce while managing their caregiving commitments,” MOM said.\nThe guidelines seek to build mutual understanding and trust between employers and employees as they discuss suitable arrangements that support both business and employee needs, it added.\n“The tripartite partners also recognise that it is important to take a calibrated and enabling approach so that FWAs are implemented effectively and used responsibly,” said the ministry.\nThe 11-member workgroup is jointly chaired by Ms Gan Siow Huang, Minister of State for Manpower and Education; Ms Yeo Wan Ling, director of NTUC’s women and family unit and its small-and-medium enterprise unit; and Mr Edwin Ng, SNEF’s honorary secretary.\nA smaller group within the main workgroup will develop a resource package – such as templates, best practices and training – to help employees and employers.\nCo-chairing this sub-group are Ms Faith Li, general manager of the Tripartite Alliance for Fair and Progressive Employment Practices, and Mr Aslam Sardar, chief executive of the Institute for Human Resource Professionals.\nMs Yeo said NTUC has gathered strong feedback about the increasing load and anxieties that workers are facing from balancing caregiving responsibilities and work aspirations.\nThe guidelines will address this by making it acceptable and easier for workers to request FWAs, she said.\n“Such progress highlights the important role employers play in helping employees thrive in the workplace and at home,” she said, noting that the labour movement also invited union leaders to join the workgroup to ensure workers’ concerns are adequately represented.\nMr Ng said employees need to appreciate that their employers have to ensure that business needs are met so that the company will continue to do well, even as more employers have implemented FWAs to meet employee needs.", "url": "https://www.straitstimes.com/singapore/jobs/government-unions-employer-groups-start-work-on-guidelines-on-flexible-work-arrangements"}