{"authors": ["Thian Wen Li"], "date_download": "2024-10-12 13:29:56", "date_modify": "2024-10-12 13:29:56", "date_publish": "2024-04-19 20:45:00", "description": "Confronted by worrying trends years ago, community leaders did not rely on easy solutions, he said. Read more at straitstimes.com.", "filename": "singapore_hard-work-togetherness-has-lifted-the-malaymuslim-community-masagos_1728739796.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/19/2024041937014333dsc9151.jpg?VersionId=UPa.WtG.axpmBLSbOK3uOrP3Q0VRhsqy&h=2fd7ce42", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_hard-work-togetherness-has-lifted-the-malaymuslim-community-masagos_1728739796.html", "title": "Hard work and togetherness have lifted the Malay/Muslim community: Masagos", "title_page": "Hard work and togetherness have lifted the Malay/Muslim community: Masagos | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore’s Malay/Muslim community is on a good footing today because it has had the courage to face key challenges head-on while staying united in solving them, said Minister-in-charge of Muslim Affairs Masagos Zulkifli.\nGoing forward, the community needs to plan for its future and growing needs, such as to renew land leases for mosques here, Mr Masagos said at the annual Minister’s Hari Raya Get-Together on April 19.\nAt the event, Mr Masagos said Muslims here have played a significant role in Singapore society by addressing community and national challenges with pragmatic approaches rooted in Islamic principles.\nWhen confronted by worrying trends in education outcomes more than 40 years ago, community leaders were courageous in accepting reality, and self-help group Mendaki was formed to work on the issue, he said.\n“They acknowledged Singapore’s system of meritocracy and that we cannot fall on quotas or affirmative action as an easy solution,” said Mr Masagos, who is also Minister for Social and Family Development.\n“We have to work hard to achieve progress and to attain the appropriate qualifications and recognition.”\nThrough this approach, the community was able to resolve these trends in a comprehensive manner, he added. For instance, the community’s university graduates have doubled in number between 2010 and 2020, and with more Malays holding professional, managerial, executive and technical jobs, median household income per capita has risen year after year.\nIt was in this spirit of empowering the community to act collectively to solve problems and inspire success that M3 was formed, added Mr Masagos.\nM3 is a tie-up between Mendaki, the Islamic Religious Council of Singapore (Muis) and the People’s Association Malay Activity Executive Committees Council. The collaboration will mark its fifth anniversary later in 2024.\nBesides youth mentorship, marriage and former offender support programmes, M3 launched an initiative in 2021 called Project Dian@M3 to support families in achieving self-reliance and greater social mobility.\nVolunteers include Madam Maisya Abdul Karim, 47, who is from the pioneer batch of Dian ambassadors who have been befriending families living in rental blocks in Bedok.\nThe medical trainer became interested in volunteering as a little girl when she followed her parents on their community activities, and now involves her own children with the hope of inculcating in them the value of giving back.\nEven with what has already been put in place, she feels that Project Dian@M3 has the potential to grow and help more families, she told The Straits Times.\nIn his speech, Mr Masagos gave an update on the community’s new endowment fund, Wakaf Masyarakat Singapura (WMS).\nIn February, amendments to the Administration of Muslim Law Act were passed by Parliament that provide the legal foundation for the WMS, among other things.\nAnnounced in 2020, the WMS will finance the renewal of mosque leases and mosque maintenance, the development of religious teachers and scholars, and other community programmes.\nMr Masagos said Mr Bahren Shaari, 62, will chair the pro tem committee to establish the WMS. He was the chief executive of the Bank of Singapore from 2015 to 2022.\nChua Chu Kang MP and lawyer Zhulkarnain Abdul Rahim, 44, will head the Islamic Legacy Planning Workgroup, he added.\nTo encourage the practice of legacy planning, such as leaving a will behind, Muis will designate August as Wakaf month to raise the community’s understanding of this effort.\nQuoting an Islamic saying that a believer is like a date palm tree, which benefits others in many ways, Mr Masagos said a confident, resilient and empowered Muslim provides protection for others and contributes meaningfully to the world.\n“In fact, our community is like a date farm,” he said. “Our collective strength is well directed when we become a valued partner in various aspects, to build trust with other communities and the Government.”", "url": "https://www.straitstimes.com/singapore/hard-work-togetherness-has-lifted-the-malaymuslim-community-masagos"}