{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 13:49:44", "date_modify": "2024-10-12 13:49:44", "date_publish": "2023-12-07 18:05:00", "description": "Two Teochew groups ended their spat over the Teochew Building, which will be redeveloped Read more at straitstimes.com.", "filename": "singapore_brothers-again-rival-teochew-groups-reconcile-after-six-years_1728740984.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/07/photo6309590030984788434y.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_brothers-again-rival-teochew-groups-reconcile-after-six-years_1728740984.html", "title": "Brothers again: Rival Teochew groups reconcile after six years", "title_page": "Brothers again: Rival Teochew groups reconcile after six years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Two prominent Teochew associations embroiled in a long-drawn and high-profile legal tussle have finally shaken hands and made peace, about six years after they first crossed swords.\nThe Teochew Poit Ip Huay Kuan and the Ngee Ann Kongsi had been at loggerheads over the historic Teochew Building at 97 Tank Road, which both organisations had jointly occupied for 55 years.\nOn Dec 7, both announced at the Teochew Building that they have entered into an amicable global settlement agreement to end their dispute relating to the building. The redevelopment plans for the Teochew Building, which have been delayed as a result of the feud, will also continue, with a special redevelopment committee to be formed.\nThe rear of the existing building will be demolished and a new building built in its place, with over 80 per cent of its layout being for community-purpose use. The iconic original building with the Chinese roof facade will be conserved.\nBoth groups expressed their gratitude to Minister for Culture, Community and Youth and Second Minister For Law Edwin Tong, who was the guest of honour at the ceremony to sign the agreement. Mr Tong is also the chairman of the Chinese Community Liaison Group, which strengthens the Government’s relationship with Chinese community organisations. They said that his invaluable advice and discussions with both groups was instrumental to both arriving at an amicable, full and final settlement of the dispute.\n“Both organisations are confident that the settlement will promote the interests and welfare of the Teochew community in Singapore and preserve the Teochew culture and heritage in Singapore,” they said in a media statement.\nAs part of the settlement agreement, both parties agreed to keep terms strictly confidential.\nMr Tong said in his address that both parties approached the discussions in a very fair and open-minded spirit, conscious of the larger responsibilities they have in fostering current as well as future relations.\n“I was very honoured to be able to play a part in facilitating the settlement of the dispute and to have the opportunity to work hand in hand with both parties here,” he said. “Most importantly, both sides also agreed to work together in the future, and continue to build good relations, and this will serve the Teochew as well as the broader Chinese community very well.”\nThe Teochew Building holds special historical meaning for the Teochew community in Singapore. Many Teochew families have memories of attending school and community events held at the Teochew Building since 1963. It was also there that Ngee Ann Polytechnic was founded, back then, as Ngee Ann College.\nThe building is 60 years old and is in need of redevelopment in order to better serve the interests and welfare of the Teochew community in Singapore, the statement said.\nMr Lie Kee Pong, (first) vice-president of Ngee Ann Kongsi, said: “Together with the rest of the Teochew community, we are relieved that the matter is finally amicably resolved and that we have reached a mutually beneficial settlement agreement where both parties will henceforth achieve complete operational and financial independence. We remain committed to continue to strengthen and expand our philanthropic support to benefit all Teochews and Singaporeans.”\nHe added: “We can finally continue the delayed redevelopment of the Teochew Building – continuing the legacy of our forefathers.”\nHuay Kuan president Derek Goh said: “This settlement will enable us to continue with our mission in keeping Teochew arts, culture and heritage alive for this generation and subsequent generations of Singaporeans. This settlement is a tribute to the relentless efforts of the Huay Kuan’s dedicated negotiation team, many well-intentioned people and the political leadership, and the sincerity of both parties wanting to move forward to cooperate with each other again in upholding Teochew arts, culture and heritage.”\nHe added: “We look forward to a new relationship with Ngee Ann Kongsi moving forward, to carry on our forefathers’ vision and mission by leveraging on the foundation they have built for us, to strengthen and to pass on to future generations of Teochews to make Singapore stronger and even more successful.”\nThe public spat between the two organisations started in 2017.\nAfter negotiations broke down, the two groups launched lawsuits against each other. In December 2018, Ngee Ann Kongsi served an originating summons on the Huay Kuan to vacate the 183.5 sq m office space it occupies in the building.\nThe Huay Kuan countered the case, saying that it owns the land, which is being held in trust by Ngee Ann Kongsi. It sought a declaration that it was entitled to continue to occupy the Teochew Building, and applied to the court to convert the originating summons into a writ of summons hearing, which resulted in a civil trial in open court.\nAfter years of litigation in court, the two groups expressed their desire to resolve their differences out of court. Leaders from both organisations met multiple times to negotiate in the hope of ending the feud, but talks broke down repeatedly.\nNgee Ann Kongsi was formed in 1845 as a religious observance and social welfare organisation by Teochew pioneer Seah Eu Chin and other merchants. It raised funds to acquire land for temples and burial grounds.\nIn 1927, rubber and pineapple magnate Lim Nee Soon and other Teochew leaders led a petition to stop Seah’s family from dominating the Kongsi’s presidency and management. After mediation, both parties came to an agreement. Lim and other leaders established the Huay Kuan in 1929 to foster ties and promote Teochew culture and traditions through a diverse array of social, economic and educational avenues such as its iconic “Teochew Festival”. It has over 6,000 members today.\nIn 1930, Ngee Ann Kongsi was restructured into a trustees’ organisation, providing education and financial aid to the Teochew community. In 1933, it was formally incorporated as a charitable organisation.\nThe “twin brothers” moved into the newly built Teochew Building, constructed at a cost of about $1 million, in 1963.\nThere are an estimated 500,000 Teochews in Singapore, who form the second-largest Chinese sub-group after the Hokkiens. The Teochews, originally from eight counties in China’s southern Chaoshan region, first arrived in Singapore in the early 1800s.\nMembers of the Teochew community are pleased that the Teochew-versus-Teochew spat has finally ended amicably.\nSaid taekwondo and muay thai instructor Mike Teo, 53, who is a Teochew: “I’m just glad that this whole saga is behind us. As the Teochew saying goes, Teochew nang, kaki nang (Teochew person, one of us). Why fight among ourselves?”", "url": "https://www.straitstimes.com/singapore/brothers-again-rival-teochew-groups-reconcile-after-six-years"}