{"authors": ["Anjali Raguraman"], "date_download": "2024-10-12 13:30:05", "date_modify": "2024-10-12 13:30:05", "date_publish": "2021-09-06 10:28:57", "description": "Customs officers saw boxes being transferred into a truck at the loading bay of a Woodlands industrial building. Read more at straitstimes.com.", "filename": "singapore_courts-crime_5-arrested-more-than-6000-cartons-of-duty-unpaid-cigarettes-seized-by_1728739805.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/09/06/rk_duty-unpaid-cigarettes-1_060921.jpg?VersionId=svXTqvnQJqRMN0ZTPUov57tllJWzns50", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_5-arrested-more-than-6000-cartons-of-duty-unpaid-cigarettes-seized-by_1728739805.html", "title": "5 arrested, more than 6,000 cartons of duty-unpaid cigarettes seized by Singapore Customs", "title_page": "5 arrested, more than 6,000 cartons of duty-unpaid cigarettes seized by Singapore Customs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - More than 6,000 cartons of duty-unpaid cigarettes were seized by Singapore Customs officers who observed activity at the loading and unloading bay of an industrial building in Woodlands Industrial Park.\nFour men - three Singaporeans and a Malaysian - as well as one Malaysian woman, all between 21 and 54 years old, were arrested last Thursday, Singapore Customs said in a statement on Monday (Sept 6).\nCustoms officers had observed boxes being transferred into a Singapore-registered truck at the loading and unloading bay of the industrial building and suspected that they contained duty-unpaid cigarettes.\nThey found 1,120 cartons of such cigarettes in the truck and arrested the Malaysian woman and three Singaporean men.\nFurther checks uncovered another 4,928 cartons in another Singapore-registered truck in the vicinity, making it a haul of 6,048 cartons in all.\nSubsequently, the driver of a Malaysia-registered lorry that was suspected to be used to deliver the cigarettes was arrested at Tuas Checkpoint when he attempted to leave Singapore.\nThe duty evaded amounted to $516,490 and the goods and services tax (GST) evaded was $41,430. All three vehicles were seized.\nThe agency said investigations are ongoing.\n\"We would like to seek the cooperation of owners of industrial premises to be alert and look out for suspicious persons and activities to prevent their premises from being misused,\" said, Mr Yeo Sew Meng, assistant director-general of intelligence and investigation at Singapore Customs.\nThe agency warned that buying, selling, conveying, delivering or storing duty-unpaid goods are serious offences under the Customs Act and GST Act.\nOffenders can be fined up to 40 times the amount of duty and GST evaded, jailed up to six years, or both.\nVehicles used in the commission of such offences are also liable to be forfeited, added the agency.", "url": "https://www.straitstimes.com/singapore/courts-crime/5-arrested-more-than-6000-cartons-of-duty-unpaid-cigarettes-seized-by"}