{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:49:19", "date_modify": "2024-10-12 13:49:19", "date_publish": "2023-04-21 15:10:00", "description": "PUB is stipulating the implementation of a safety corridor adjacent to both existing and new dam structures and other coastal protection measures. Read more at straitstimes.com.", "filename": "singapore_pub-to-set-standards-for-coastal-protection-infrastructure-against-rising-sea-levels_1728740959.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/21/yaohui-pixgeneric-8284_9.jpg?VersionId=eahbESo784Fv27Y5fn1kPwFJojwVIrCn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_pub-to-set-standards-for-coastal-protection-infrastructure-against-rising-sea-levels_1728740959.html", "title": "PUB to set standards for coastal protection infrastructure against rising sea levels", "title_page": "PUB to set standards for coastal protection infrastructure against rising sea levels | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – National water agency PUB is conducting a study to develop a set of common design standards and requirements for all new coastal protection infrastructure, which Singapore needs to guard against rising sea levels and the impact of climate change.\nThe code of practice will apply to all new coastal protection structures, such as concrete sea walls, new tidal gates and pumping stations, which drain out excess stormwater during heavy rainfall to prevent inland flooding, PUB told The Straits Times.\nThe operation and maintenance of this infrastructure will also be standardised, according to a tender document seen by ST calling for an external consultant to work on this with PUB.\nIn addition, PUB is looking to implement a safety corridor – similar to a railway safety zone – next to existing and new dam structures and other coastal protection measures.\nThis is to prevent certain activities such as tunnelling and excavation works from compromising the functionality of these structures.\nThe study will determine activities that may pose such a risk, and PUB will work with the external consultant to determine whether a safety corridor is needed for different scenarios, said the agency.\nThe authorities have begun three site-specific coastal protection studies – in Jurong Island, the city-East Coast area, and the first half of the north-western coast from Tuas Checkpoint to Lim Chu Kang jetty.\nThese studies will later determine the type of coastal protection infrastructure needed around the island.\nThe next study for a section of the north-west coast, which includes Lim Chu Kang, Sungei Kadut and Woodlands, will start in the second half of 2023.\nWhen the site-specific studies move into the next phases, such as detailed design and construction, the code of practice will guide the appointed engineer and the developer, said PUB.\nSea-level rise in Singapore is expected to reach 1m by 2100, but this could go up to 5m during heavy rainfall and storm surges, when there is an abnormal rise of water.\nAsked who will maintain the coastal infrastructure, and whether there will be any legal framework for enforcement, PUB said that it is formulating the policy and regulatory framework.\nThe code of practice will also include the best practices of implementing multifunctional measures, similar to Marina Barrage, which is a source of water supply, and for flood control and lifestyle activities.\nThe study will take place over two years, and the consultant must be familiar with international design standards for coastal protection, and be able to apply them to Singapore.\nIn its tender document, PUB said the coastal protection structures must be able to withstand extreme weather events – such as heat or other unforeseen circumstances, such as debris hitting against these structures due to storm surges or large waves, or accidental collision between vessels and these structures.\nThe consultant must study the possible impacts of these events, estimate their probability and develop design criteria to ensure these measures can remain structurally stable and withstand these impacts.", "url": "https://www.straitstimes.com/singapore/pub-to-set-standards-for-coastal-protection-infrastructure-against-rising-sea-levels"}