{"authors": [], "date_download": "2024-10-12 13:59:12", "date_modify": "2024-10-12 13:59:12", "date_publish": "2022-10-11 22:09:11", "description": "MOH is initiating Pofma action against those spreading rumours of a rapid rise in severe illness due to XBB strain. Read more at straitstimes.com.", "filename": "singapore_health_new-covid-19-cases-more-than-double-from-previous-day-but-severe-cases-remain-low_1728741552.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/11/ads-masks-111022.jpg?VersionId=I5zO2uC3TQ3ynNGjyO9.QMJq2Z_F07vo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_new-covid-19-cases-more-than-double-from-previous-day-but-severe-cases-remain-low_1728741552.html", "title": "11,732 new Covid-19 cases in S'pore; spike driven by XBB variant but severe cases remain low", "title_page": "11,732 new Covid-19 cases in S'pore; spike driven by XBB variant but severe cases remain low | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - There were 11,732 new Covid-19 infections on Tuesday, more than doubling from the 4,719 new cases the day before.\nThe spike, while largely driven by the XBB variant, another Omicron subvariant, is seeing low severe cases, said the Ministry of Health (MOH).\nMOH is also initiating Pofma (Protection from Online Falsehoods and Manipulation Act) action against rumours circulating via WhatsApp that Singapore is having a rapid and large increase in cases with severe illness and deaths due to the circulating XBB strain.\nWhile the post-weekend spike today is driven by the XBB strain, MOH said that \"the number of severe cases has remained relatively low. This is very likely due to the resilience built up through vaccination and previous waves of infection\".\nThe large majority of patients continue to report mild symptoms such as sore throat or slight fever, especially if they have been vaccinated, MOH added.\nThere were 11 intensive care unit (ICU) cases and 50 who need oxygen supplementation - a figure MOH said is \"just slightly higher than the level observed in the past few months\".\nIn comparison, at the peak of the previous Delta wave, 171 were warded and 308 needed oxygen supplementation, while during the height of the Omicron wave, 54 were warded in ICU and 242 needed oxygen supplementation.", "url": "https://www.straitstimes.com/singapore/health/new-covid-19-cases-more-than-double-from-previous-day-but-severe-cases-remain-low"}