{"authors": ["David Sun"], "date_download": "2024-10-12 13:32:47", "date_modify": "2024-10-12 13:32:47", "date_publish": "2023-03-21 20:18:55", "description": "The amendments also increase the penalties for drug possession. Read more at straitstimes.com.", "filename": "singapore_politics_s-pore-changes-laws-to-tackle-new-psychoactive-substances-increases-penalties-for-drug-possession_1728739967.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/21/2021031883816107faa0bb51-68ca-4fad-add4-142235ce7948_3.jpg?VersionId=uuJiLrqcI3F6Ll2nOAuFDrNnEFbmF0SQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_s-pore-changes-laws-to-tackle-new-psychoactive-substances-increases-penalties-for-drug-possession_1728739967.html", "title": "S’pore changes laws to tackle new psychoactive substances, increases penalties for drug possession", "title_page": "S’pore changes laws to tackle new psychoactive substances, increases penalties for drug possession | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Any substance that is abused for a high will be defined as a psychoactive substance under Singapore’s new drug laws.\nThis, however, will exclude substances such as alcohol, caffeine, tobacco, food additives and health products.\nAmendments to the Misuse of Drugs Act and the Constitution passed in Parliament on Tuesday introduced a new legislative framework for psychoactive substances, by criminalising the trafficking, manufacture, import, export, possession and consumption of such substances.\nThe amendments also increase the penalties for drug possession, introducing a tiered framework with the maximum jail sentence set at 30 years – three times the previous maximum of 10 years’ jail for possession of a controlled drug.\nIn his speech introducing the amendments, Minister of State for Home Affairs Muhammad Faishal Ibrahim said Singapore must continue to review and refine its laws to keep pace with the evolving drug landscape and local trends.\n“Drugs cause great harm to individuals, families and the society,” he added.\n“Many countries around the world have given up on this fight, because drug trafficking and use have become so prevalent and they cannot stem the tide. For these countries, the only practical approach is to reduce the harm.”\nHe noted that the drug threat globally and locally is rising, with the proliferation of new psychoactive substances (NPS) and exceptionally large drug seizures in recent years.\nDr Faishal said that Singapore will continue to take a tough stance to keep drugs at bay.\nNPS, which mimic the effects of the more traditionally controlled drugs such as cannabis, heroin and cocaine, emerged as an issue only in the past decade.\nThese are typically artificial substances made to bypass drug laws by having a modified chemical structure, thus evading the current legal definitions of controlled drugs.\nBetween 2014 and 2017, just 11 NPS abusers were caught in total, making the yearly average fewer than three people in that period.\nBut the number has gone up sharply, averaging 235 NPS abusers a year since 2018.\nThere have also been at least four NPS-related deaths here since 2016.\nDr Faishal said that the authorities previously could not prosecute NPS abusers until the substance was listed in the First Schedule, which took up to a year.\nThis meant a disadvantage to the authorities, who were constantly made to play catch-up with the syndicates.\nHe added: “The ease in modifying the molecular structure of NPS to create new variants means that traffickers can easily overcome our laws by switching to new unlisted NPS. In fact, drug suppliers are known to tailor the molecular structure of NPS according to what is not yet controlled through legislation.”\nUnder the new laws, substances will be controlled based on their capacity to produce a psychoactive effect, rather than their chemical structure.\nThe new laws also provide defences that can be invoked by an accused person, such as whether the psychoactive substance is intended to be used for a legitimate purpose, and not for human consumption.\nThe amendments also make it such that offenders previously convicted of trafficking a controlled drug and who are then later convicted of trafficking a psychoactive substance will be considered repeat traffickers and subject to enhanced punishments.\nThere will also be enhanced punishments, including caning, for the possession of selected drugs above certain weight thresholds.\nThese selected drugs include cannabis, methamphetamine, cocaine, morphine, diamorphine and opium.\nSeveral MPs raised questions during the debate, but all stood in support of the Bills.\nWorkers’ Party chairman Sylvia Lim (Aljunied GRC) raised questions regarding the possible defences, asking how a legitimate use of a substance would be determined.\nMr Zhulkarnain Abdul Rahim (Chua Chu Kang GRC) similarly asked about defences, seeking clarification on what due diligence is expected of parties like landlords.\nMr Derrick Goh (Nee Soon GRC) asked whether the new saliva test kits for drugs deployed since February at checkpoints and roadblocks were able to pick up NPS.\nDr Faishal thanked the members for their questions, and assured them that the authorities will work closely with the Health Sciences Authority and the Home Team Science and Technology Agency to conduct rigorous testing to determine if a substance has any legitimate purpose.\nHe added that cases will be individually assessed based on their facts, and that defences can easily be made out by innocent persons.\nHe also clarified that the amendments are not meant to target legitimate substances or activities, and are instead aimed at NPS made specifically to be abused.\nAs for the new saliva test kits, he said they are currently unable to detect NPS.", "url": "https://www.straitstimes.com/singapore/politics/s-pore-changes-laws-to-tackle-new-psychoactive-substances-increases-penalties-for-drug-possession"}