{"authors": ["Jean Iau"], "date_download": "2024-10-12 13:31:28", "date_modify": "2024-10-12 13:31:28", "date_publish": "2022-05-22 18:00:00", "description": "Hitting a moving target with a Taser is not easy, so I'll leave the police work to fully trained officers. Read more at straitstimes.com.", "filename": "singapore_courts-crime_fumbling-with-a-taser-after-a-crash-course-in-police-training_1728739888.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/20/ads-hometeam-20052022.jpg?VersionId=20xkJYttREvmMGS8cvGS8IAv5rj1jBj0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_fumbling-with-a-taser-after-a-crash-course-in-police-training_1728739888.html", "title": "Fumbling with a Taser, after a crash course in police training", "title_page": "Fumbling with a Taser, after a crash course in police training | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - He paced around for a couple of minutes about 8m away from me, refusing to stand down.\nWithin a split second, the \"assailant\" suddenly charged, shouting and brandishing a rubber pole.\nI reached for my Taser, but in the heat of the moment, I fumbled with the holster and chose flight instead of fight, moving quickly away from the \"armed\" man.\nInexplicably, he stopped, giving me time to draw the weapon before he charged again, and this time, I forgot to switch off the safety mode of the Taser and failed to subdue him.\nFollowing recent incidents in which police officers have had to rely on firearms and Tasers to subdue suspects, the media was invited to the Home Team Academy in Choa Chu Kang on Thursday (May 19) to undergo a crash course on the arms and techniques officers here are equipped with to safely carry out operations.\nTraining began in a classroom where we were taught how to hold, rack and fire simulation rounds using the Glock19 Gen 5 simulation pistol.\nWe got to test our skills from 5m at a shooting range.\nWhile officers are trained to react quickly and fire at the centre of the body to stop moving targets, I took several seconds to steady my shaking hands and managed to hit the stationary target once in the arm.\nLater, we fired at a moving live target in the form of padded-up trainers charging towards us in an outdoor training area.\nI managed to shoot the trainer in the arm and body despite being visibly flustered.\nTraining continued at the dojo where we were taught contact tactics and how to use a baton.\nThe contact drills where we put each other in locks and holds were exhausting, but when the instructor mentioned \"Taser\", my energy picked up.\nWe lined up to try firing the Taser X26P at a cut-out target, aiming for the centre of the body.\nAfter a full day of training, we were given a role-play exercise to put all we had learnt to the test.", "url": "https://www.straitstimes.com/singapore/courts-crime/fumbling-with-a-taser-after-a-crash-course-in-police-training"}