{"authors": ["Selina Lum"], "date_download": "2024-10-12 13:29:12", "date_modify": "2024-10-12 13:29:12", "date_publish": "2023-11-08 16:10:00", "description": "He had repeatedly accused Justice Audrey Lim of being 'biased', interrupted her, and told not to be rude. Read more at straitstimes.com.", "filename": "singapore_courts-crime_suspended-lawyer-m-ravi-jailed-21-days-for-acts-of-contempt-before-two-different-judges_1728739752.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/08/btravi20231108.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_suspended-lawyer-m-ravi-jailed-21-days-for-acts-of-contempt-before-two-different-judges_1728739752.html", "title": "Suspended lawyer M. Ravi jailed 21 days for acts of contempt before two different judges", "title_page": "Suspended lawyer M. Ravi jailed 21 days for acts of contempt before two different judges | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Suspended lawyer M. Ravi was sentenced to 21 days’ jail on Wednesday for a series of acts of contempt before two different judges in separate courtroom incidents in November 2021.\nHe had repeatedly accused Justice Audrey Lim of being “biased”, interrupted her, and told her not to be rude. This took place while he was acting for former SBS Transit bus driver Chua Qwong Meng in a High Court suit against the public transport operator.\nHe had also accused District Judge Chay Yuen Fatt of being biased after an exchange over why Ravi had been scheduled for two trials in the same morning. This happened during a criminal case in the State Courts involving Magendran Muniandy, a Malaysian, who was accused of forging various documents.\nOn March 31, 2023, Justice Hoo Sheau Peng had found Ravi liable for nine instances of contempt.\nHis main defence was that he was suffering a relapse of his bipolar disorder at the time. He admitted that he had forgotten “to take medications on some days”.\nIn sentencing him on Wednesday, Justice Hoo said the relapse did not significantly impair his ability to exercise self-control and restraint, and she therefore gave only moderate mitigating weight to his condition.\nThe judge said it was “highly reprehensible” that Ravi committed the long string of contemptuous acts while acting for clients in two sets of proceedings.\n“Despite being aware of his mental condition, Mr Ravi did little to guard against or manage the effects of his bipolar disorder while discharging his duties and responsibilities as a lawyer. In particular, Mr Ravi was non-compliant with his medication regime,” she said.\nJustice Hoo said it was clear that the sanctions previously imposed on Ravi for similar misconduct in the courtroom in past disciplinary proceedings have not deterred him.\n“Unfortunately, Mr Ravi has not learnt from the previous chances accorded to him, and he has not shown remorse for his actions, giving rise to these proceedings.”\nHe started serving the sentence immediately. This was his first time being charged with and convicted of contempt of court, although he has previously been suspended or ordered to pay financial penalties in disciplinary proceedings for misconduct towards judges.\nOn Nov 8, 2021, Ravi appeared before Judge Chay to take over from Magendran’s previous lawyer, and told the judge that the trial could start the next day as scheduled.\nShortly after, Ravi appeared before another judge for an unrelated criminal case and confirmed that he was representing one of the accused persons for that trial.\nOn the morning of Nov 9, 2021, he did not turn up before Judge Chay, and instead appeared before the other judge. He appeared before Judge Chay later in the morning and applied to adjourn Magendran’s case.\nAfter an exchange on why the lawyer had been “double fixed” for two trials, Ravi accused Judge Chay of being “biased” against him. He also interrupted Judge Chay when the judge was speaking to Magendran. The matter was adjourned to the next day.\nOn Nov 10, Judge Chay dismissed Ravi’s application for the case to be referred to the High Court. Ravi then alleged that the judge was “in contempt of court”, left the courtroom and did not return.\nMagendran told the judge he was prepared to represent himself.\nOn Nov 22, Ravi appeared before Justice Lim as Mr Chua’s lawyer on the first day of trial, while Senior Counsel Davinder Singh acted for SBS.\nJustice Lim gave directions on the arrangements for the cross-examination of Mr Chua, who was to testify remotely from Ravi’s office.\nRavi then accused her of being “biased” and alleged that she was siding with Mr Singh.\nHe applied for Justice Lim to disqualify herself, but she rejected the application.\nDuring the hearing, he stated that Justice Lim was an “interrogator”, alleged that the judge’s directions in relation to the cross-examination were “against the international human rights law”, and told her “don’t be rude”.\nHe also interrupted the judge when she was trying to have the court interpreter explain to Mr Chua what was going on. Ravi then told the judge that both he and Mr Chua would no longer participate in the proceedings.\nThat afternoon, the court registry received a letter from Mr Chua stating that he was discharging Ravi as his counsel and wanted to hire a new lawyer to continue with the case before Justice Lim.\nIn March 2023, Ravi was handed the maximum suspension of five years for making “baseless and grave” allegations against the Attorney-General, prosecutors and the Law Society.", "url": "https://www.straitstimes.com/singapore/courts-crime/suspended-lawyer-m-ravi-jailed-21-days-for-acts-of-contempt-before-two-different-judges"}