{"authors": ["Gladys Wee"], "date_download": "2024-10-12 13:28:17", "date_modify": "2024-10-12 13:28:17", "date_publish": "2024-07-05 18:05:46", "description": "NUS has partnered with StarHub for secure 5G access on and off campus, eliminating VPN hassle. Read more at straitstimes.com.", "filename": "singapore_nus-starhub-to-trial-enterprise-grade-5g-network-to-support-connectivity-needs-of-all-students-staff_1728739697.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/05/5g.jpg?VersionId=9AA.TOj1zRhphocgq7sl2nfabiBOjwhs&h=96f6d849", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_nus-starhub-to-trial-enterprise-grade-5g-network-to-support-connectivity-needs-of-all-students-staff_1728739697.html", "title": "NUS, StarHub to trial enterprise-grade 5G network to support connectivity needs of all students, staff", "title_page": "NUS, StarHub to trial enterprise-grade 5G network to support connectivity needs of all students, staff | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A trial is under way to pave the way for all 40,000 students and 12,000 staff of the National University of Singapore (NUS) to get enterprise-grade 5G connectivity throughout Singapore for coursework and research.\nOn July 5, StarHub and NUS signed a memorandum of understanding to deploy such a high-grade 5G network on campus, the first for an educational institution in Singapore.\nStaff and students will be issued with an eSIM card on their mobile device of choice, be it a smartphone or a laptop, under a trial in the fourth quarter of 2024.\nThis eSIM card will authenticate every user securely for access to the university’s intranet and confidential information resources, even if users are not on campus.\nWith enterprise-grade 5G connectivity, users, typically staff and student workers, also will not need to use virtual private network (VPN) services to secure their remote access like they currently need to when using their home or public Wi-Fi connection.\n“We can securely access NUS resources and the internet from any part of Singapore without the need for VPN or clumsy login procedures,” said Ms Tan Shui-Min, NUS’ chief information technology officer, on July 5.\nAfter the trial ends in the middle of 2025, both organisations will explore expanding the service to all 40,000 students and 12,000 staff.\nThere are also plans to extend the service to overseas NUS students and staff.\nNUS and StarHub declined to reveal the financial details, including whether students and staff need to pay for their 5G connectivity.\nIn 2021, Singapore was among the first countries in the world to roll out 5G services based on the latest dedicated 5G gear. The 5G is said to be secure and ready for mission-critical applications such as telemedicine and research, and for connecting a large number of devices without any transmission lag.\nBesides allowing users to download 4K movies in under 100 seconds, enterprise-grade 5G networks can also support mission-critical applications such as engineering research collaborations, augmented-reality video conferencing and e-learning.\nWhen these applications run on Wi-Fi networks, they can become congested when multiple students try to access online resources simultaneously, leading to slowdowns.\nDuring the trial, StarHub will conduct speed and latency tests on the 5G network for video streaming, conferencing and gaming, said Mr Tan Kit Yong, StarHub’s head of enterprise business group.\n“This partnership enables us to develop new use cases in teaching and research,” said Mr Tan.", "url": "https://www.straitstimes.com/singapore/nus-starhub-to-trial-enterprise-grade-5g-network-to-support-connectivity-needs-of-all-students-staff"}