{"authors": ["Salma Khalik"], "date_download": "2024-10-12 13:30:22", "date_modify": "2024-10-12 13:30:22", "date_publish": "2021-07-03 05:00:00", "description": "Most restrictions in Singapore are expected to be lifted before the year ends. Is the timing right? Read more at straitstimes.com.", "filename": "singapore_health_moving-from-covid-19-pandemic-to-endemic_1728739822.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/07/03/ST_20210703_SKCOVID03A_6663212.jpg?VersionId=d9wTwd4sioVYzYO9tqB_fY5oyb4JzwPt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_moving-from-covid-19-pandemic-to-endemic_1728739822.html", "title": "Moving from Covid-19 pandemic to endemic: Singapore's strategy and how it can unfold", "title_page": "Moving from Covid-19 pandemic to endemic: Singapore's strategy and how it can unfold | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore has started its journey towards living with Covid-19, with most restrictions expected to be lifted before the year ends.\nWhat is behind this decision? What will the new normal look like? Is the timing right? Here is a look at Singapore's strategy to deal with the pandemic and how it could unfold.\nReopening with care\nThe restrictions are hurting the economy, said Professor Euston Quah, an economics guru at the Nanyang Technological University.\nAnd Singaporeans are battle-weary, Health Minister Ong Ye Kung said.\nEveryone agrees on the need to open up, and that this must be done when the safety of people is assured.\nThe key lies in getting the majority of people vaccinated so they are protected against severe illness and death.\nWith the highly transmissible Delta variant in play, experts say that at least 80 per cent of the population need to be vaccinated for herd immunity to kick in.\nBut that might be difficult to attain this year.\nThere is currently no vaccine for children below the age of 12 - and there are about 500,000 of them here, or almost 10 per cent of the population.\nAmong those aged 70 years and above, more than one in four have yet to get vaccinated.\nSo if Singapore does not reach the 80 per cent figure, is it still safe to relax measures?\nProfessor Teo Yik Ying, dean of the National University of Singapore's (NUS) Saw Swee Hock School of Public Health, said at least 70 per cent of the population need to be fully vaccinated before any major relaxation can be considered, provided that the vaccines continue to remain effective.\nProfessor Paul Tambyah, a senior infectious diseases consultant at the National University Hospital (NUH), was more sanguine. He cited New York and California as places that had dropped all measures when vaccination rates crossed the 70 per cent mark.\nThat has \"not resulted in the feared spike in cases. There is a good chance that we can do the same\", he said.\nAssociate Professor David Lye, who heads infectious disease research at the National Centre for Infectious Diseases, said another important factor is that not too many people get very sick, so the healthcare system does not get overwhelmed.\nThus far, vaccines have been effective in protecting against the virus and ensuring that even those who contract it do not fall severely ill. The signs are promising as half the population will be fully vaccinated by the middle of this month, and everyone eligible and willing would have received at least their first jab by next month.\nThe experts all agree that Singapore should not follow Australia and New Zealand, which face lockdowns every time a cluster emerges.\nSuch clusters will emerge, said Prof Tambyah, adding: \"As long as the borders are open, there will be imported cases and occasional breaches or leaks.\"\nProfessor Dale Fisher, an infectious diseases expert at NUH, said the goal is not to eradicate the virus, which is no longer possible given how widely it has spread, but rather, learning to live with it.\nThat said, they agreed that some safety measures may remain in place for a long time.\nMeasures still needed\nProf Fisher said measures are still needed in settings with vulnerable people such as hospitals and nursing homes. But \"mass testing, contact tracing and quarantine will eventually stop and travel without quarantine will be reinstated\".\nHowever, Associate Professor Hsu Li Yang, an infectious diseases expert at the NUS Saw Swee Hock School of Public Health, expects some measures to stay in place at least till the end of next year. This is because cases may continue to be imported.\nProf Teo wants people to continue wearing masks in crowded places and maintaining hand hygiene, as these also provide protection against influenza. It is no coincidence that Singapore has not had a single laboratory-confirmed case of flu since May last year.\nDr Asok Kurup, who chairs the Academy of Medicine's Chapter of Infectious Disease Physicians, said masking in enclosed places and social distancing should be around for a while, but masks need not be worn outdoors.\nTesting for Covid-19 will still be needed, but likely only in a clinical setting to check if someone who is sick has the disease.\nBut there will be no need to test in the community setting, or to trace and quarantine close contacts of those infected.\nProf Lye said testing at the borders will continue, but be more selective, depending on the country the traveller is coming from.\nProf Tambyah sees no need to test, so long as the visitor has been vaccinated.\nUnderstanding 'endemic'\nA disease that is endemic is one that remains permanently in the community, such as dengue and influenza.\nBut endemic diseases can still be countered and suppressed.\nDengue has been endemic in Singapore for decades. Yet every year, Singapore spends tens of millions of dollars keeping the mosquito population down. When a cluster appears, the National Environment Agency kicks into action to try to contain the spread.\nThe same approach may hold for Covid-19.\nProf Tambyah said: \"We need to learn to live with it, protect the vulnerable, put public health measures in place and ensure appropriate vaccination, diagnostics and therapeutics are in place.\"\nProf Hsu said living with Covid-19 \"means that policies and interventions will be directed towards minimising the risk of death and disability\".\nThis could mean including Covid-19 vaccination in both national childhood and adult immunisation schedules.\nAssociate Professor Alex Cook, who specialises in infectious diseases modelling, said accepting Covid-19 as an endemic disease \"would mean many more infections than we currently see, but because of vaccination, few would die and those deaths would primarily be in the unvaccinated\".\nHe added: \"Occasional outbreaks are likely, as with influenza or dengue, and sometimes these could be severe, like last year's dengue outbreak.\"\nPeople who have not been vaccinated may find themselves at a disadvantage.\nBut there is no good reason for them to avoid the vaccine.\nAmong adults, Prof Hsu said, very few - perhaps less than 1 per cent - may be medically unfit for the Covid-19 vaccine.\nProf Fisher added that even those medically unsuited to mRNA vaccines could avail themselves of Sinovac, while Novavax is also on the horizon.\nThe vaccines may be less effective on patients being treated for cancer, he said, but even they were better off being vaccinated.\nMeanwhile, a vaccine for children under the age of 12 could be approved soon, possibly before the end of the year.\nThose who avoid getting vaccinated may also be kept away from certain activities.\n\"Vaccine discrimination is never a good thing,\" said Prof Teo, but may be necessary in order to permit some of the riskiest activities to continue. \"Otherwise it becomes irresponsible if we knowingly allow unprotected people to be exposed to the risk.\"\nProf Lye suggested that those who have not been vaccinated should be tested before entering restaurants or cinemas.\nSaid Prof Fisher: \"People will ultimately be deciding on whether to get Covid-19 or the Covid-19 vaccine.\"\nMr Ong expects leisure travel to resume by the end of the year with countries where vaccination rates are high and infection rates dipping.\nVaccinated people may find it easier to travel.\nThose who are not may face quarantines and higher travel insurance fees. Some countries may even deny them entry.\nSaid Prof Cook: \"I can imagine in the short term that it will be quite challenging to travel without being vaccinated. In the longer term, it's unclear how many countries will require a vaccine certificate to travel.\"\nProf Teo said if the vaccine provides good protection against infection, he expects people \"will be allowed to travel and return freely, even to countries where infection rates are high\".\nBut Prof Lye disagreed: \"While vaccination is highly effective, it (does not provide) 100 per cent protection against severe Covid-19. It is also when there is a rampant outbreak that new variants can emerge which may be less well controlled by vaccination.\"\nProf Quah said that if people insist on travelling to countries where infection rates are high, they should be made to bear the cost of their treatment.\nHe said: \"Should people choose to ignore the facts by travelling to countries with high risks and then catching infection, then we would not want a situation where society bears all these costs.\"\nIn travel, as in other aspects of living with Covid-19, getting vaccinated and acting responsibly remain the key.", "url": "https://www.straitstimes.com/singapore/health/moving-from-covid-19-pandemic-to-endemic"}