{"authors": ["Genevieve Chan", "Content STudio"], "date_download": "2024-10-12 13:57:13", "date_modify": "2024-10-12 13:57:13", "date_publish": "2024-04-23 04:00:00", "description": "Domestic violence can leave lasting scars. Play therapy offers a safe space for children and teenagers to express themselves and heal. Read more at straitstimes.com.", "filename": "singapore_playful-healing-how-play-therapy-can-help-children-and-teenagers-cope-with-trauma_1728741433.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/18/Sandtray.jpg?VersionId=z06q_HW18S9O2jslc5iOPT5OOzTDVkdt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_playful-healing-how-play-therapy-can-help-children-and-teenagers-cope-with-trauma_1728741433.html", "title": "Playful healing: How play therapy can help children and teenagers cope with trauma", "title_page": "Playful healing: How play therapy can help children and teenagers cope with trauma | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "His parents described him as rude, angry and messy. His teachers reported that he was unmotivated in his studies, and constantly getting into trouble.\nPunishment – both at home and in school – did nothing to improve the upper primary school pupil’s behaviour. His parents, who are divorced, and his teachers were at a loss.\nJohn (not his real name) was referred to therapy.\n“In the initial sessions, he was quiet and unwilling to explore his family issues,” says Ms Ng Sook Wai, lead counsellor at Heart@Fei Yue, a child protection specialist centre run by Fei Yue Family Service Centre. John had witnessed domestic violence at home, says Ms Ng, and was also neglected.\n“It was important to create a safe space for him to express himself.” So she encouraged John to play.\nPlay therapy helps them open up and process their feelings “without the need to confront the difficulties verbally”, says Ms Ng, who has 18 years of experience working with children and at-risk youth. She has been trained in play therapy since 2012.\nThis indirect expression takes many forms. The centre’s therapy room is stocked with toys and art supplies, from dolls and cooking sets to building blocks and a sand tray. Children and teenagers can also choose to take a walk in the garden during the one-hour sessions.\nThe sessions typically last for about six months to a year.\nThrough their choices and actions during playtime, children reveal their inner world. Ms Ng connects with them in therapy, and notices any recurring themes, changes in how they interact with others, their energy levels, moods, and what they choose to focus on. “It tells us about how they see themselves, the world, and the people who are significant in their lives.\n“I have (seen) little children who can’t talk about their daddy and mummy fighting, but once they play you can see the connecting themes.” For example, she says, they would repeatedly use the stronger dinosaurs to bite the smaller ones.\nThese symbolic actions can also help them process difficult experiences by expressing pent-up emotions and feelings they might struggle to articulate verbally, says Ms Ng.\nFinding their voice\nPlay therapy goes beyond processing emotions. Ms Ng emphasises another key goal: Empowering children to find their voice – to garner the courage to speak to their network of safe adults and express their needs.\nThe sessions can begin with seemingly small steps. Therapists create a space where children have choices, from where to sit, to the activities they prefer.\nSome children are unsure of themselves when they enter the therapy room, and constantly seek permission. “They have limited autonomy in their lives but when we work with them, they begin to experience having choices in the sessions,” she says.\nThese choices may seem insignificant but over time, “something changes in them”, she says. “They make meaning of who they are and what they’re capable of through our interactions.”\nTherapists prioritise active listening and validating these expressions in play and in the relationship. “My colleagues and I are conscious of ensuring that the child’s voice is heard and not dismissed,” she says. “Children and teenagers often do not speak up or speak of the ‘bad things’ that happened.\n“When they struggle to understand their own behaviours and concerns, or when adults dismiss their emotions, they shut down.”\nPlay itself also fosters connection and openness. Children are less guarded when they’re playing, making them more likely to express their true feelings, explains Ms Ng.\nThis approach proved successful for John. Initially withdrawn, he gradually opened up about his frustrations at home after about six months.\nJohn had an honest conversation about his feelings with his father, Ms Ng shares, and realised their bond remained strong despite the break-up of the family.\nThis newfound understanding helped alleviate his anxieties.\nHe stopped throwing tantrums at home and in school. His father and teachers also reported significant improvements in his behaviour and mood.\nMs Ng finds immense joy in seeing such transformations, and in helping children like John find their voice and discover their sense of self. “It’s very empowering for children and teenagers, because we’re not sitting here and teaching them; They are experiencing it for themselves.”\nThis journey of self-discovery is the foundation for healing. “Once the sense of self emerges, and we have addressed, to some extent, the negative impact of trauma, they can grow from there,” says Ms Ng.\nLong shadow of violence\nDomestic violence can have a long-term impact on children and teenagers, says Ms Ng Sook Wai, lead counsellor and play therapist at Heart@Fei Yue.\n“When violence happens at home and the people who threaten and harm us are our own family members, it causes constant worry and fear,” she says. Children never know when the next episode might erupt, and they often live in fear for their parents’ safety.\nDomestic violence refers to patterns of violent, threatening, abusive or controlling behaviours that leave victims feeling unsafe and fearful. It can take on many forms including physical, sexual, emotional and psychological abuse, and neglect.\nDomestic violence can occur in families, households, current or past intimate relationships.\nMs Ng observes that the emotional wounds can manifest in various ways:\nFight: This can include physical or verbal aggression, rudeness, and defiance. Younger children might express this through hitting others or tantrums.\nFlight: Some children may fear going home, withdraw from school and social activities, experience mood swings, depression, anxiety, or become addicted to the computer. Younger children might exhibit this through bedwetting, nightmares, or clinginess.\nFreeze: Children may become withdrawn, unresponsive, or unable to express themselves verbally. They might appear zoned out or they may shut down emotionally.\nThe behaviours may not be consistent across environments, she explains. A child who appears well-adjusted at school might display aggression at home.\nThe emotional toll can also lead to the development of mental health issues and unhealthy coping mechanisms. The danger lies in internalising these coping strategies, she warns.\n“They could carry these (self-limiting) beliefs or labels into adulthood, and cannot get out of the anxious or the depressed state.”\nThey may also find it difficult to focus and learn, pursue interests, develop positive friendships, and acquire the skills and experiences crucial for their well-being and developmental growth.\nWhile therapy can help children address their difficult feelings, Ms Ng emphasises the importance of addressing the underlying environment: “Part of the work with families is to provide parents or caregivers with knowledge on the developmental, emotional, and relational needs of their children.”\nThe challenging behaviours children exhibit are often a cry for help – a way to express unmet basic needs such as safety, connection, and protection, she explains.\nBut family involvement is not always possible. That’s where caseworkers become that “important bridge”, helping families understand their children’s needs and connecting them with necessary resources.\nSays Ms Ng: “Given their development phase, children will continue to require substantial support and understanding from their caregivers and schools to navigate primary school life and challenging teenage years.”", "url": "https://www.straitstimes.com/singapore/playful-healing-how-play-therapy-can-help-children-and-teenagers-cope-with-trauma"}