{"authors": ["Thian Wen Li"], "date_download": "2024-10-12 13:29:22", "date_modify": "2024-10-12 13:29:22", "date_publish": "2023-11-01 17:50:00", "description": "The police advised the public to be careful ahead of popular sales events such as Black Friday. Read more at straitstimes.com.", "filename": "singapore_at-least-25-people-lost-38000-since-october-through-parcel-delivery-scams-police_1728739762.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/01/IMG9024scamalertA.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_at-least-25-people-lost-38000-since-october-through-parcel-delivery-scams-police_1728739762.html", "title": "At least 25 people lost $38,000 in October due to parcel delivery scams: Police", "title_page": "At least 25 people lost $38,000 in October due to parcel delivery scams: Police | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - At least 25 people have lost no less than $38,000 in total to parcel delivery scams for the month of October, said the police on Wednesday.\nThey added that they have noticed a trend of such scams, where scammers would get the victim’s personal details by pretending to ask for delivery payment of supposedly purchased items.\n“With the upcoming festive period and major online shopping events, members of the public are advised to be more cautious of such scams,” the police said, referring to popular events such as 11.11, 12.12, Black Friday and Cyber Monday sales.\nVictims would receive text or e-mail messages containing phishing links that ask for additional payment for the delivery of their purchases.\nThese messages are designed to look as though they are sent by postal or e-commerce companies, such as Singapore Post.\nThe police advised members of the public to look out for signs of phishing and to never disclose personal details and one-time passwords to anyone.\nDelivery fees are usually charged upfront when purchases are made, they added.\n“SingPost will never send you a text message or e-mail requesting additional payment through an embedded link that demands that you give SingPost your personal or banking information,” said the police. “Any payment to SingPost can be done only via the SingPost mobile app, at SAM machines, or any post office.”\nFor more information on scams, members of the public can visit www.scamalert.sg or call the Anti-Scam Helpline on 1800-722-6688.", "url": "https://www.straitstimes.com/singapore/at-least-25-people-lost-38000-since-october-through-parcel-delivery-scams-police"}