{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 13:57:10", "date_modify": "2024-10-12 13:57:10", "date_publish": "2024-05-10 18:00:00", "description": "PM Lee touched on a range of issues, including national identity and racism. Read more at straitstimes.com.", "filename": "singapore_politics_these-issues-are-forever-sensitive-pm-lee-on-handling-of-tudung-wearing-section-377a_1728741430.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/11/20230809693293033abe4253-4e44-4806-ab2e-757fb7bd3646.jpg?VersionId=bdAmg0vE2f47FropfGCrlRjwJwatVGmz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_these-issues-are-forever-sensitive-pm-lee-on-handling-of-tudung-wearing-section-377a_1728741430.html", "title": "‘These issues are forever sensitive’: PM Lee on handling of tudung wearing, Section 377A", "title_page": "‘These issues are forever sensitive’: PM Lee on handling of tudung wearing, Section 377A | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore has dealt with sensitive issues such as tudung wearing and decriminalising sex between men in a way that enabled people to better understand each other, accept their differences and work out practical arrangements, said Prime Minister Lee Hsien Loong.\nHe spoke on the Government’s handling of such issues and other topics such as racism and social safety nets in two wide-ranging media interviews at the Istana on April 26 and 28, ahead of his handover to Deputy Prime Minister Lawrence Wong on May 15.\nHere are some key takeaways from the interviews:\nDealing with sensitive topics\nBesides allowing nurses to wear the tudung with their uniforms and repealing Section 377A of the Penal Code, PM Lee cited the terrorism threat posed by the Jemaah Islamiyah group after the Sept 11, 2001 attacks as another sensitive issue that the Government dealt with.\n“New York was far away, but it took place in our region, in Bali, in Jakarta subsequently, and how do we react?” said PM Lee. “We are multiracial. We have Muslims, we have non-Muslims. Do we trust each other or not?”\nHe said the Government worked with the Malay/Muslim community, religious teachers and community groups to talk openly about the issue, and guard against people becoming radicalised.\nIt is fortunate that no terrorist attack has taken place in Singapore so far, he said, adding that going through the experience of handling the terror threat “has helped to bring us closer together”.\n“But to say after this, we can fly solo – the Government does not need to watch, can take hands off the steering wheel or the controls, and it will look after itself – I do not think so. Never,” said PM Lee.\n“It is not possible, because these issues are forever sensitive ones, and you need to have limits to the discussion; you need to have the tone set by the Government.”\nIf the Government does not make major moves, for instance on the tudung for nurses or decriminalising sex between men, “it is not going to happen, or it is going to happen in a very chaotic and very contentious way”, he added.\nPM Lee said the most difficult issue, and a long-term challenge, is managing the inherent tensions between wanting social cohesion among Singaporeans and being open to immigrants and foreign workers.\n“If we want Singapore to grow, then we have no choice but to work very hard to find ways we can have our cake and eat most of it. And that is a continuing, long-term challenge.”\nStronger national identity\nPM Lee said he has “no doubt” Singapore’s national identity is stronger today after 20 more years of nation-building.\nThe country has weathered crises such as the global financial crisis and the Covid-19 pandemic in that time, he noted.\nHowever, strengthening national identity is always hard work because the macro environment will pull different ethnic groups in different directions from time to time.\n“There have been these challenges in the last 20 years, and there will definitely be similar challenges in the future,” he said.\nSocial safety nets\nAsked what is to stop Singapore from moving towards a welfare state as it seeks to become more inclusive, PM Lee said this would entail the Government spending about 45 per cent of the gross domestic product (GDP) and raising about 40 per cent of that via taxes, like some European countries.\n“In Singapore, we do not collect 40 per cent of taxes in GDP, we do not spend 45 per cent of GDP on social and other government programmes,” he said, noting that the Republic collects about 15 per cent of GDP in tax and spends between 18 per cent and 19 per cent.\nPM Lee said Singapore’s goods and services tax (GST), at 9 per cent, is very low compared with the 20 per cent or 25 per cent that is imposed in other developed countries and welfare states, plus other taxes on income, wealth and goods like petrol.\n“So for us, the constraint is that if you cannot afford it, and if you are not prepared to pay for it, then we cannot have it.”\nIf social benefits or coverage are to be improved, then adjustments have to be made from time to time to raise revenue, he added.\n“We have to be able to afford it to spend it,” he said, noting that the GST had to be raised from 7 per cent to 9 per cent to pay for steadily rising healthcare expenditure.\nWhile the opposition may make calls to “just take a bit more” from the reserves, PM Lee said the amount of spending required for a welfare state model means that “the reserves, however ample, will be gone very soon and that will not do”.\nIn the absence of a constituency or political party in Singapore that calls for lower taxes and less welfare, the Government has to judge which social safety nets are necessary and wise to have, he said.\nHe noted that Singapore has moved very far towards better social safety nets in the past 20 years, citing schemes such as ComCare, Workfare and the Progressive Wage Model.\n“It is very considerable. Of course, people will always say ‘please do more’ and we will keep on improving.”\nHowever, doing too much will weaken Singapore’s competitiveness and economic viability, he said.\nSingaporeans should work hard and be prudent. If things turn out well, everybody can enjoy the upside, he added.\nSingapore’s communities\nSingapore’s ethnic Chinese have never been a unified collective, said PM Lee.\nThe Chinese community is diverse, also comprising Peranakans and new immigrants, he noted.\nCommunity organisations must move with the times, to cater to the needs of the era, he said.\nIn the past, Chinese clan associations set up schools and helped new immigrants settle in Singapore and find jobs. Today, they can help promote culture, education, or build trade ties with China.\nPM Lee noted that the Singapore Chinese Chamber of Commerce and Industry has attracted new directors every term, including young people and those who are not from traditional companies.\n“That’s why I see the Chinese community keeping pace with the times,” he said as he urged the community to work together to create opportunities for Singapore.\nOn the Malay/Muslim community, he noted that 80 per cent of Malay students go on to post-secondary education today, and about 20 per cent graduate from university. This is a big improvement from 20 years ago, and will continue to improve, he added.\nThe proportion of Malay professionals, managers, executives and technicians has also risen. “These are wins which happen quietly, year by year, bit by bit, and you may not notice it, but I think we should be proud of it,” he said.\nHe noted that the community still has issues with incarceration rates, drug abuse numbers and dysfunctional families, which are being addressed via programmes like ComLink+. Groups like Mendaki and AMP Singapore will help the community to progress further, he added.\nTurning to the Indian community, he said it has been doing well too. Groups like Sinda have some very active and passionate volunteers who are making a big difference to families who need help, he said.\nOne issue he flagged is between Indians who are Singaporeans and newly arrived Indians, some of whom naturalise while others do not.\n“You are not the same, and therefore you have to find ways to bridge that gap with each other. And that is something which is continuing work,” he said.\nOutside of India, Singapore has the biggest concentration of graduates from the top institutions in India – the Indian Institutes of Technology and the Indian Institutes of Management.\nSingaporeans notice the influx because the numbers are not small, but these are talented people who are a tremendous plus to Singapore, he said.\n“I think we should welcome them, as we manage the flow,” he added.\nIsrael-Hamas conflict\nPM Lee said he completely understands why Muslims in Singapore have become very distressed about the conflict in Gaza.\n“It is unconscionable, it is inhuman, really... but there is also a religious element to this feeling,” he said.\nBut rather than do something performative, such as holding a demonstration or burning flags, there are practical ways to help, he added.\nSingapore has raised donations, with the Singapore Red Cross going to Egypt to help to deliver the contributions. It also collected and purchased food and medical necessities, and air-dropped them from a Republic of Singapore Air Force C-130 plane, flying from Jordan over Gaza.\nRacism\nSingapore started off with the founding ideal to be one people, regardless of race, language or religion.\nThe country has gone very far in that direction – racism is less seen here than in most other countries, said PM Lee. “We will work to make it better.”\nBut to make prejudice disappear completely between different human groups who are going to remain different, while keeping alive cultures, heritages and religions will be very hard, he added.\nPM Lee said the Government will take more steps to reduce racism, citing the workplace discrimination legislation it is working on.\nOnce in a while, there will be incidents where someone says something outrageous that riles up everyone, and action must be taken.\n“You have to react – either punishment must follow according to the law, or at least stern disapproval must be expressed, and the leaders must take a stand,” he said.\nBut these are things that require judgment and perspective, as overreacting to a small incident would be unwise as it risks getting everyone hyped up.\nSocial media\nSocial media is one way of fostering interest in politics among the youth, said PM Lee, who has a Facebook account and an Instagram account.\nOn how social media helps him connect with the people, he said it reaches a different audience.\n“People who follow my posts like my pictures, know when I jalan-jalan (go on walks), may not read my speeches or listen to my rallies, but it is an audience. And then when I post something else, hopefully it will turn up on that feed and they may take notice and maybe read it.”\nIn a crisis, people pay attention to social media posts, he added, recounting how his posts were very well followed during the Covid-19 pandemic as people were anxious and wanted to know what was happening.\nHe said he will continue to update his social media accounts after stepping down as prime minister.\n“I hope the new leaders and PM will grow their following on social media,” he said.\nReferring to his successor, DPM Wong, PM Lee said: “He may not be into photography, but his guitar-playing skills are not bad.”\nPM Lee noted that DPM Wong and ministers such as Mr Chan Chun Sing, Mr Desmond Lee and Mr Ong Ye Kung have TikTok accounts. He considered but decided against starting one, as he felt there was nothing he could not already convey on his existing accounts.\n“I think TikTok would be for the next generation of ministers. At least, it interests the people in the personalities, maybe a little bit in the content and hopefully encourages them to think more deeply about what this is about,” he said.", "url": "https://www.straitstimes.com/singapore/politics/these-issues-are-forever-sensitive-pm-lee-on-handling-of-tudung-wearing-section-377a"}