{"authors": ["Timothy Goh", "Cheryl Tan"], "date_download": "2024-10-12 14:20:41", "date_modify": "2024-10-12 14:20:41", "date_publish": "2024-03-01 16:10:00", "description": "Singapore also keeping a close watch on nuclear fusion technology as a potential clean energy source. Read more at straitstimes.com.", "filename": "singapore_politics_bukit-gombak-tampines-west-town-centres-to-be-revamped-grant-for-heartland-merchants-to-host-events_1728742841.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/01/2024030167535247img7400.jpg.JPEG?h=8061e730", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_bukit-gombak-tampines-west-town-centres-to-be-revamped-grant-for-heartland-merchants-to-host-events_1728742841.html", "title": "Bukit Gombak, Tampines West town centres to be revamped; grant for heartland merchants to host events", "title_page": "Bukit Gombak, Tampines West town centres to be revamped; grant for heartland merchants to host events | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Projects to revitalise Bukit Gombak and Tampines West will be introduced as part of efforts to help heartland enterprises innovate and seize new opportunities.\nA new Heartland Enterprise Placemaking Grant will also be launched to encourage heartland merchants to host activities such as community engagement events and thematic festivals, said Minister of State for Trade and Industry Low Yen Ling on March 1.\nThis comes amid the rapid evolution of the retail industry led by the growth of technology, e-commerce and fast-changing consumer preferences, said Ms Low during the debate on her ministry’s budget.\nShe added that the Government is committed to supporting Singapore’s retail sector as well as businesses in the heartland.\nUnder the pilot rejuvenation projects, Bukit Gombak Neighbourhood Centre will be transformed into a Modern Heritage Heartland Hub, while Tampines West Neighbourhood Centre will be revamped into a Heartlands Events Hub, said Ms Low.\nShe was responding to Mr Shawn Huang (Jurong GRC), Ms Foo Mee Har (West Coast GRC) and Mr Saktiandi Supaat (Bishan-Toa Payoh GRC), who had asked for updates on the Our Heartlands 2025 Programme, which was introduced in 2022.\nOne of the first activities organised by the Modern Heritage Heartland Hub will be Rasa Gombak Day Out, a first-of-its-kind festival from April 5 to April 7 that showcases the history and heritage of the popular neighbourhood centre.\nMeanwhile, the placemaking grant will cover up to 50 per cent of eligible costs for selected activities organised by heartland merchants, with a maximum of $10,000 per project being defrayed. Placemaking refers to proactively managing a place to make it better.\nAreas of support include third-party consultancy, equipment, software, marketing, and professional services like event management and audit.\nOperational costs and commonly found placemaking activities like festive light-ups, bazaars and traditional night markets are not supported.\nEligible merchants must be registered or incorporated in Singapore, have a minimum of 30 per cent local shareholding, and have a group annual turnover of not more than $100 million or group employment of not more than 200 employees. They must also have a physical storefront operating in the heartland.\nMs Low also noted that the Government has ramped up its efforts to transform and revitalise the heartland in the last three years.\nFor example, it supported the Federation of Merchants’ Associations Singapore and Heartland Enterprise Centre Singapore in holding more than 60 placemaking activities, including three successful Heartlands festivals.\n“Through these campaigns, businesses have reported a one-third increase in footfall and a 20 per cent rise in sales,” Ms Low said.\n“Collectively, these initiatives strengthen each precinct’s identity and allow businesses to differentiate their products and enhance their value proposition.”\nThese are other initiatives announced on March 1 to develop Singapore’s economy and businesses:\n1. Pushing ahead with clean energy\nSingapore is keeping a close watch on nuclear fusion technology as a potential clean energy source, said Second Minister for Trade and Industry Tan See Leng. Fusion is touted as much safer than the current nuclear fission used by several countries for power, but is not yet commercially available.\nThe Republic is also studying the latest nuclear fission technologies.\nDr Tan was responding to comments by Mr Xie Yao Quan (Jurong GRC) on the potential of nuclear fusion, where two light nuclei merge to form a single heavier nucleus, producing energy. Unlike traditional nuclear fission technology, where the uranium atom splits into two to produce heat and radiation, fusion does not produce long-lived radioactive waste.\n“While there have been significant breakthroughs in the fusion energy space, there still remains significant engineering challenges,” Dr Tan noted.\n“Beyond the fact that there are no demonstrator plants today that can generate electricity, there are also other challenges, including the low global supply of tritium, which is an important fuel for fusion,” he added.\nThere is also a big difference in opinions among experts on when nuclear fusion can be commercialised, Dr Tan said.\nSingapore is therefore keeping a close watch on the development of fusion energy, and is collaborating with overseas research institutes to build capabilities in this field, while looking into how the nation can play a role in the fusion supply chain, he added.\nSingapore is also diversifying its energy into low-carbon alternatives, placing its stake in a range of options including hydrogen, geothermal and renewable electricity imports. It is also exploring carbon capture and storage solutions to help cut emissions.\nTo fund key infrastructure, the Future Energy Fund will be established by the end of 2024, with an initial $5 billion in funding from the Government.\nSuch infrastructure could include developing new hydrogen terminals and pipelines if Singapore decides to adopt and scale up the use of hydrogen.\nIn response to a question posed by Mr Edward Chia (Holland-Bukit Timah GRC) on whether the fund will be topped up, Dr Tan said that the Government will do so when its spending ability allows for it, and depending on its development plans for the energy transition.\nTo decarbonise industrial processes, the Government is developing carbon capture and storage technologies – where emissions from sources like chemical or power plants will be captured, transported and stored deep underground, he added.\nThe Government is working with S Hub, an industry consortium comprising ExxonMobil and Shell, to study the viability of a cross-border project capturing emissions from Singapore for storage in other countries.\nIt is therefore studying the feasibility of aggregating emissions from Singapore, and will work with regional partners to find potential carbon dioxide storage sites, said Dr Tan.\nSingapore and Indonesia will set up a work group to advance carbon capture and storage cooperation between the two countries.\nTo further research technologies that can help Singapore import and use hydrogen safely and economically, six research projects will be awarded $43 million in funding, said Dr Tan.\n“These projects collectively seek to address challenges that Singapore faces in deploying hydrogen, in areas such as energy efficiency, durability and safety,” he added.\nAnother 10 research projects, which span a range of low-carbon technology pathways like energy harvesting, will be awarded $12 million in total as part of the inaugural Emerging Technology Grant Call.\n2. Sustainability skills and talent\nAs the world embraces sustainability goals and practices, customers and investors will increasingly expect businesses to be more transparent about their carbon footprint, said Ms Low on March 1.\nTo that end, climate-related disclosures will be mandated for large companies in Singapore in the coming years, she noted.\nClimate disclosures are documents that organisations publish about the carbon footprint of their activities and their exposures to climate risks. They reveal how much an organisation’s activities affect, and are affected by, climate change.\nFrom the 2025 financial year, all listed companies will need to make climate-related disclosures based on local reporting standards that are aligned with the International Sustainability Standards Board, a global accounting standards body, as announced on Feb 28 during the debate on the Ministry of Finance’s budget.\nThis requirement will also apply to large non-listed companies from FY2027. These companies are defined as those having annual revenues of at least $1 billion and total assets of at least $500 million.\nBusinesses will need capabilities and resources to track and report their carbon footprint, said Ms Low. Funding support of up to 30 per cent will therefore be provided to large companies to help kick-start their sustainability reporting journey.\n“While smaller companies will not be affected by the new regulations, sustainability reporting will help them to stay relevant as disclosure of carbon footprint data becomes commonplace,” Ms Low added.\nThis is significant as it is increasingly becoming a requirement for large corporations and multinational companies to assess their suppliers’ sustainability performance.\nThe Government will work closely with carbon service providers – which provide services to help businesses decarbonise – to give them funding support of up to 70 per cent to offer a basic sustainability reporting package for small businesses, she said.\nWorkers will also be equipped with the relevant skills to seize green opportunities, with a particular focus on sustainability reporting and the energy sector.\nSalary support will be provided to sustainability reporting service providers to train interns, and a training programme will be launched for the clean energy sector to address skill gaps, as identified by the industry, Ms Low added.\nThe Economic Development Board and Enterprise Singapore are also working with the National University of Singapore and Nanyang Technological University to develop training programmes in carbon management, services and trading.\n3. More support for R&D in deep tech\nInvestments in deep tech would enable Singapore to diversify its economy and generate new economic opportunities, said Dr Tan.\nHe said new research and development (R&D) translation platforms will be set up to support commercialisation of research in four areas: semiconductors, robotics, nucleic acid therapeutics and medical technology.\nThe $180 million National Semiconductor Translation and Innovation Centre will assist companies and researchers in overcoming high barriers to entry into the semiconductor sector, including high investment costs and expensive equipment.\nMeanwhile, the Nucleic Acid Therapeutics Initiative (NATi) will speed up the development of ribonucleic acid (RNA) drugs and vaccines and grow Singapore’s RNA manufacturing capabilities.\nOne role of RNA, which has been used in vaccine technology, is to carry instructions from DNA for controlling the synthesis of proteins.\nDr Tan said: “We currently have at least 10 local (small and medium-sized enterprises) across the value chain for RNA therapeutics, and NATi will support and grow more local SMEs and start-ups, and attract more companies here.”\nThe Agency for Science, Technology and Research (A*Star) will also launch MedTech Catapult, a $38 million initiative to accelerate the development of novel life science tools and medical devices here by working with companies and product owners to translate their research into commercial products.\nFinally, Dr Tan said an additional $60 million will be provided to the National Robotics Programme. The programme will bring together public-sector researchers, end users and robotics companies, to step up translation of Singapore’s robotics R&D capabilities, particularly in sectors such as manufacturing, logistics and healthcare.\n4. Helping businesses become more competitive\nA new Alliance for Action on Business Competitiveness set up by the Ministry of Trade and Industry and the Singapore Business Federation was announced by Ms Low on March 1.\nThe private-public partnership comprises 18 representatives from the Government, industry, trade associations and chambers and trade unions, and is co-chaired by Ms Low and Nominated MP Mark Lee.\nAmong other things, the group will propose recommendations to improve competitiveness, innovation and fairness in the business environment, while identifying solutions for trade associations and chambers to collaborate with businesses.\nThe partnership will also encourage the co-creation of recommendations in areas such as strengthening manpower, land and regulatory competitiveness.\n5. Developing local business leaders\nThe Global Business Leaders Programme (GBLP) will be launched by the first half of 2024 to support companies in enhancing the capabilities of their local corporate leaders.\nThrough the programme, the Economic Development Board will help Singaporean middle to senior managers who are nominated by their companies to access opportunities that will prepare them for regional or global corporate leadership roles.\nThese include funding support for participants to take on critical overseas work assignments for training and exposure, and co-funding for executive management programmes.\nParticipants in the GBLP will also join the recently launched Singapore Leaders Network Fellowship programme, which is a nine-month scheme with mentorship and networking opportunities.\nMinister for Trade and Industry Gan Kim Yong said: “The GBLP will support companies in their regionalisation efforts and in growing a pipeline of Singaporean corporate leaders who can take their businesses to new heights.\n“This will complement (the Ministry of Manpower’s) local workforce development efforts to support career resilience, better career health and longer career trajectories for all levels of workers.”", "url": "https://www.straitstimes.com/singapore/politics/bukit-gombak-tampines-west-town-centres-to-be-revamped-grant-for-heartland-merchants-to-host-events"}