{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 14:21:31", "date_modify": "2024-10-12 14:21:31", "date_publish": "2023-01-30 15:04:25", "description": "When both work constructively together, they produce win-win outcomes with tangible benefits for their people and businesses, said PM Lee. Read more at straitstimes.com.", "filename": "singapore_destinies-of-singapore-and-malaysia-intertwined-pm-lee_1728742891.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/31/yaohui-sfanwar30-3265.jpg?VersionId=7SPb8oN79reR3pPUNuUKzj75HEo2QrCv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_destinies-of-singapore-and-malaysia-intertwined-pm-lee_1728742891.html", "title": "Destinies of Singapore and Malaysia intertwined: PM Lee", "title_page": "Destinies of Singapore and Malaysia intertwined: PM Lee | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - As close friends and neighbours, the destinies of Singapore and Malaysia are intertwined: When both work constructively together, they produce win-win outcomes with tangible benefits for their people and businesses, Prime Minister Lee Hsien Loong said on Monday.\nGiven this relationship, he is happy that both countries continue to work closely to advance bilateral relations, PM Lee said at an official lunch he hosted for Malaysian Prime Minister Anwar Ibrahim.\nIn response, PM Anwar said there are no bilateral issues that should stay unresolved, and that the two countries are great neighbours capable of doing much more together to benefit their peoples.\nDatuk Seri Anwar, who was in Singapore for his first official visit since he took office in November, had together with PM Lee witnessed the signing of three memorandums of understanding aimed at promoting cooperation in new and emerging areas, specifically on green and digital economies, and cyber security.\nPM Lee said both leaders had a fruitful discussion when they met in the morning, and discussed how they can make progress on outstanding bilateral issues.\n“I am confident that with Prime Minister Anwar’s support, Singapore-Malaysia relations can reach greater heights,” he said.\nIn his speech, PM Lee said Singapore and Malaysia share a relationship “quite unlike any other”. Both countries are bound by geography and a shared history, and their people have deep family and cultural ties.\nHe noted that the Causeway and Second Link are among the busiest border crossing points in the world. Over the years, both countries have also broadened cooperation in almost every domain, including in health, education, culture, supply chain and connectivity.\nBoth are each other’s second largest trading partners. Singapore is also the largest foreign investor in Malaysia, with over $56 billion in direct investments.\n“This reflects our confidence in the Malaysian economy, including the ‘can-do’ spirit and enterprise of many young and digitally savvy Malaysians,” he said.\nThe partnership between both countries stood up to the test during the Covid-19 pandemic, with ministers and officials keeping in close touch to exchange notes, support one another, and coordinate plans. Even as supply chains across the world were disrupted, people and goods continued to flow safely and smoothly between both countries, he added.\nWith the borders fully reopened, friends and families on both sides of the Causeway can now visit one another freely, and businesses can plan and operate more predictably. And when the Johor Bahru Singapore Rapid Transit System (RTS) Link is completed in 2026, travel between both countries will be even easier, he added.\nPM Lee also alluded to the long relationship he has with PM Anwar. The two men first met when they were ministers and have stayed in touch since, he said.\nThe two leaders last met at the Singapore Summit in 2018, where PM Anwar said that if and when he assumed the premiership, Singapore would be one of the first countries he would visit.\nPM Lee said he was therefore glad that he was welcoming PM Anwar to Singapore, and that he looks forward to welcoming him to the Republic again later this year for the annual Leaders’ Retreat.\nPM Anwar, who spoke in English and Malay, called PM Lee a “dear friend” whom he has worked with for decades, and that he is of the view that “no issues should be left unresolved”.\n“I alluded to the fact that the discussions were meaningful – not normal diplomatic cliches,” he said. “There were, of course, some more contentious outstanding issues, and I am glad to say that both of us feel that bilateral relations must be enhanced.”\nWhile his administration is very new, PM Anwar said he and his Cabinet team have a clear position when it comes to ties with Singapore.\n“Not only (do) we want to continue the relation, but we want both Singaporeans and Malaysians to understand we are two great countries and two great neighbours (and) that we can do so much more for the benefit of our people,” he said.\nNoting that both countries are still celebrating Chinese New Year, PM Anwar gamely offered greetings in Mandarin, wishing both countries “nian nian hao (good fortune year after year)”.\nHe also said he was pleased that President Halimah Yacob will visit Malaysia soon, a clear signal that bilateral relations are vibrant. Madam Halimah will make a state visit to Malaysia in March, the Ministry of Foreign Affairs said on Monday.", "url": "https://www.straitstimes.com/singapore/destinies-of-singapore-and-malaysia-intertwined-pm-lee"}