{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 13:49:02", "date_modify": "2024-10-12 13:49:02", "date_publish": "2024-03-23 05:00:00", "description": "The 304-page English book offers insights into the quiet resilience of the businessman and his descendants. Read more at straitstimes.com.", "filename": "singapore_singapore-pioneer-tan-kah-kee-s-story-retold-by-granddaughter-in-new-book_1728740942.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/23/PIX5380.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-pioneer-tan-kah-kee-s-story-retold-by-granddaughter-in-new-book_1728740942.html", "title": "Singapore pioneer Tan Kah Kee’s story retold by granddaughter in new book", "title_page": "Singapore pioneer Tan Kah Kee’s story retold by granddaughter in new book | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A successful entrepreneur, a philanthropist who built schools in South-east Asia and China and a Chinese community leader – this is how Singapore pioneer Tan Kah Kee is remembered by most.\nBut few people would know that domestic squabbles between the families of his second and third wives sometimes drove him to make Ee Hoe Hean Club in Chinatown, an exclusive club for Chinese businessmen, his home away from home.\nHe lost all his assets when the Great Depression hit in the late 1920s. In the early 1930s, when the banks were calling in their massive loans to his businesses, family members were cast out into the streets from their mortgaged homes.\nDuring the Japanese invasion in 1942, his open resistance to the Japanese Occupation in China forced him into hiding in Java, with the Japanese placing a ransom of a million Dutch guilders on his head.\nHis family broke into two groups and fled to China and India. Some unmarried sons were left behind in Singapore to fend for themselves.\nA new book by his granddaughter, Ms Peggy Tan, now gives intimate insights into the quiet resilience of the businessman, his family and descendants.\nTitled Descendants Of Tan Kah Kee And Their Stories, it was launched at Ee Hoe Hean Club on March 22.\nThe 304-page English publication includes chapters on Tan’s famous and powerful in-laws, such as businessmen Lee Kong Chian and Lim Nee Soon, as well as those who moved in his world, including businessman Tan Lark Sye and physician Lim Boon Keng. These Singapore pioneers were also philanthropists.\nIt also features essays contributed by several of his grandchildren and great-grandchildren.\nBorn in 1874 in a fishing village in Fujian, China, Tan sailed to Singapore around 1890 to help his father, who owned a rice trading business in Singapore.\nIn 1903, after his father’s business collapsed, Tan started his own company and built a multifaceted business empire that included rubber plantations, manufacturing, pineapple canneries and shipping.\nHe was known for his passion for eliminating poverty among the masses by establishing schools, including Xiamen University in China and The Chinese High School in Singapore. He also donated to Tao Nan Primary School and Anglo-Chinese School.\nHe died in 1961 in Beijing, aged 86.\nHis granddaughter, Ms Tan, who was born in 1949 in Singapore, is the daughter of Mr Tan Guan Kai, the sixth son of Tan Kah Kee and the first son of his second wife Goh Shiok-Neo. She never met her grandfather, as he had left Singapore for China by the time she was born.\nThis is the 74-year-old’s first book, and it took the retired managing director of an advertising company about four years to complete, after her retirement.\n“I should have embarked on this project 15 to 20 years ago, when more of my cousins were alive... and my book would be thicker by 100 pages,” she said.\n“I honestly felt that I could qualify for a detective’s certificate after this book was done.”", "url": "https://www.straitstimes.com/singapore/singapore-pioneer-tan-kah-kee-s-story-retold-by-granddaughter-in-new-book"}