{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 13:54:44", "date_modify": "2024-10-12 13:54:44", "date_publish": "2024-03-16 18:45:00", "description": "Other areas are Toa Payoh West-Thomson, Kampong Chai Chee and Boon Lay. Read more at straitstimes.com.", "filename": "singapore_caregiver-support-network-expands-to-5-areas-including-eunos-and-chong-pang_1728741284.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/16/Azmi-smcare16-3.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_caregiver-support-network-expands-to-5-areas-including-eunos-and-chong-pang_1728741284.html", "title": "Caregiver support network expands to five new areas including Eunos and Chong Pang", "title_page": "Caregiver support network expands to five new areas including Eunos and Chong Pang | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A support network which connects and assists caregivers will be expanded to five areas – Toa Payoh West-Thomson, Eunos, Chong Pang, Kampong Chai Chee and Boon Lay – from June.\nSet up by the People’s Association Women’s Integration Network (WIN) Council, the WIN Caregivers Network was piloted from April 2022 to July 2023 with about 300 caregivers, including 50 men. It was run in Henderson-Dawson, Tampines Central, Nee Soon East, Fengshan, Bukit Gombak and Hong Kah North.\nUnder the programme, caregivers attend an eight-week course at community clubs or via Zoom on identifying and understanding dementia and various mental health conditions, as well as handling meltdowns and improving communication with their loved ones.\nAnnouncing the expansion of the network at Jewel Changi Airport on March 16, Senior Minister of State for National Development Sim Ann said: “I think caregivers play a very important but underrated role in our society... But they cannot remain underrated because we are an ageing society.\n“More and more of us are going to be giving care, supporting someone who gives care, need care ourselves – or all three.”\nCaregivers in the network will also get to go for free or subsidised health screenings and talks, under new tie-ups between the council and healthcare providers.\nAnnouncing the care package called Better Me Better Us (BMBU) Plus, Ms Sim said: “Caregivers often allow themselves to be so consumed by caregiving duties that they neglect their own health.”\nBMBU Plus is an enhancement of the original BMBU programme that equips women on how to care for themselves and their families. Focusing on health, it includes screenings for breast and cervical cancer, workshops on nutrition and weight management, as well as talks on bone health and mental wellness.\nThe pilot found that caregivers are often reluctant to ask for help because they are too overwhelmed or uncomfortable to share about their family situation, and tend to be slow to trust and open themselves up to others, Ms Sim said.\n“It is important… to reach out, be patient and engage the caregivers with empathy and sincerity,” she said. “For those of us that want to help, the onus is on us to remain accessible to them so that they can reach out to us when they need.”\nIn a survey of 300 caregivers who attended non-profit organisation Caregivers Alliance’s Caregiver-to-Caregiver (C2C) programmes during the pilot, all of them said the programmes helped them understand and manage their loved ones, Ms Sim said.\n“By joining the Caregiver-for-Caregiver support group, the caregivers made new friends and found comfort in one another.”\nOne such caregiver is Mr Terence Tan, 62, whose wife, Madam Tan Sze Hian, was diagnosed with dementia seven years ago.\nThough he had a helper, he found his wife’s behaviour difficult to manage – even getting her into the shower every day was a struggle. But Mr Tan, who works as a senior associate director for research in a university, was hesitant to seek help.\nIt was only after an incident where Madam Tan, 75, refused to shower, left the house and landed in the Institute of Mental Health (IMH), that he decided to give the C2C programme on dementia a shot.\nHe has learnt to give her more independence and dignity by letting her shower behind a shower screen, and stepping in when she needs help. He also bought all-in-one shampoo, which is easier for her to manage in the shower.", "url": "https://www.straitstimes.com/singapore/caregiver-support-network-expands-to-5-areas-including-eunos-and-chong-pang"}