{"authors": ["Yuen Sin"], "date_download": "2024-10-12 13:30:12", "date_modify": "2024-10-12 13:30:12", "date_publish": "2021-07-06 20:43:18", "description": "PSP's Mr Leong Mun Wai said what the party is concerned about is \"what price we are paying\" for the FTAs. Read more at straitstimes.com.", "filename": "singapore_politics_psp-fully-supports-ftas-but-disagrees-that-ceca-offers-net-benefits-to-sporeans_1728739812.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/07/06/hzleong060721.jpg?VersionId=QhH1cJrHIrQvHM_odCzrviMwH85XEwVR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_psp-fully-supports-ftas-but-disagrees-that-ceca-offers-net-benefits-to-sporeans_1728739812.html", "title": "PSP 'fully supports' FTAs, but disagrees that Ceca offers net benefits to S'poreans", "title_page": "PSP 'fully supports' FTAs, but disagrees that Ceca offers net benefits to S'poreans | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Progress Singapore Party (PSP) fully supports free trade agreements (FTAs) and is reassured to know that Singaporean interests are taken care of when they are negotiated, but disagrees that the Singapore-India Comprehensive Economic Cooperation Agreement (Ceca) offers net benefits to Singapore at this stage, Non-Constituency MP Leong Mun Wai said.\nSetting out his party's position after a protracted debate with Health Minister Ong Ye Kung in Parliament on Tuesday (July 7), Mr Leong said the PSP will have to further explore \"whether Ceca has contributed to the influx of some of the PMETs into Singapore in relation to our overall foreign talent policy\".\nThe NCMP was speaking after ministerial statements on FTAs and foreign manpower by Health Minister Ong Ye Kung, a former trade negotiator, and Manpower Minister Tan See Leng.\nFollowing the speeches, Mr Ong had repeatedly sought to pin the PSP MPs down on whether they agreed that FTAs are fundamental to Singapore's economic survival, and that Ceca does not allow a free flow of Indian professionals, managers and executives (PMEs) into Singapore.\nTo this, Mr Leong said his party is not against FTAs. \"We know the importance of the FTAs for Singapore as an open economy and especially as a small city state. However, what we are concerned about is what price we are paying,\" he said.\nFor instance, he had read about how Singapore does not have many bargaining chips when it comes to negotiations - \"so the implication is that we may have to be a bit more relaxed with the movement of people\".\nHe then asked if the movement of people, referred to in Chapter 9 of Ceca, is used as a bargaining chip when Singapore is negotiating FTAs.\nResponding, Mr Ong said he had earlier explained why the allegation that Singapore has used the freedom of movement of people as a bargaining chip and was \"giving away our rights for immigration\" is untrue, and pressed Mr Leong on whether he and his party agreed with this.\n\"After all the explanation, (if) you still come to that conclusion, then I say this: Number one - PSP, you're against globalisation, you're against FTAs, even though I've gone to great lengths to explain that this is the bedrock of Singapore's economic survival.\n\"Number two - you are really not taking back the falsehoods and the allegations... you do feel that the FTAs and Ceca, despite our explanation, let in Indian professionals freely into Singapore,\" he said, calling on the PSP to prove him wrong otherwise.\nAmong other things, Mr Ong had said in his speech that nothing in Ceca states that Singapore must unconditionally let in PMEs from India.\nIf the PSP agrees on the importance of FTAs and Ceca, and withdraws their allegations about Ceca, the People's Action Party government and the PSP can have a \"meaningful debate\" when the PSP tables a motion on FTAs and Ceca in a future parliamentary sitting, Mr Ong added.\nTo this, Mr Leong said that the two statements - on FTAs being fundamental to Singapore's survival, and Ceca not allowing the free movement of people - require more debate and study by him and his fellow NCMP Hazel Poa.\n\"Hazel and I, we are for FTAs. And having heard that the jobs and livelihoods of people are not being used as a bargaining chip, we are very reassured that... Singaporeans' interests are being taken care of,\" said Mr Leong.\n\"However, whether Ceca has contributed to the overall influx of nationals from that country , I think we need to study a bit more,\" he added.\nHis party will have to examine the figures provided by Dr Tan and Mr Ong to look at the share of Indian PMETs in the overall PMET workforce, among other things, before it can make a final conclusion on whether Ceca is truly beneficial for Singapore, he said.\nMr Ong thanked Mr Leong for agreeing that FTAs - including Ceca - are fundamental to Singapore's economic survival. \"At least that is a common ground that we have established.\"\nHe also said he understands that the PSP agrees that Chapter 9 is not being used as a bargaining chip, and called on it to withdraw its allegations that Ceca has led to the unfettered flow of Indian professionals into Singapore.\nMr Leong said that his remarks had been misinterpreted.\n\"What I've said is that we fully support FTAs, we know that that's important for Singapore, and we appreciate the point that we are not using the movement of people as a bargaining chip in the negotiation of the FTAs.\n\"But as to whether Ceca has contributed to the influx of some of the PMETs into Singapore in relation to our overall foreign talent policy, we have to explore that. And we don't agree that Ceca is net beneficial to Singapore at this stage.\"", "url": "https://www.straitstimes.com/singapore/politics/psp-fully-supports-ftas-but-disagrees-that-ceca-offers-net-benefits-to-sporeans"}