{"authors": ["Selina Lum"], "date_download": "2024-10-12 13:53:45", "date_modify": "2024-10-12 13:53:45", "date_publish": "2021-03-10 19:46:54", "description": "The Singapore International Commercial Court offered advantages over international arbitration in resolving such disputes. Read more at straitstimes.com.", "filename": "singapore_courts-crime_infrastructure-and-cross-border-insolvency-poised-to-be-dispute-hotspots_1728741225.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/03/10/ak_sgsc_1003.jpg?VersionId=oprpeVMmdtvo74nLCmE54YOZY8JQG_fT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_infrastructure-and-cross-border-insolvency-poised-to-be-dispute-hotspots_1728741225.html", "title": "Infrastructure and cross-border insolvency poised to be 'dispute hot spots': Chief Justice", "title_page": "Infrastructure and cross-border insolvency poised to be 'dispute hot spots': Chief Justice | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The economic impact of Covid-19 is poised to result in a spike in infrastructure sector squabbles and cross-border insolvencies, \"dispute hot spots\" which may land in the Singapore International Commercial Court (SICC).\nChief Justice Sundaresh Menon on Wednesday (March 10) said the SICC is well positioned to deal with cross-border insolvencies, which are expected to surge by as much as 26 per cent due to the economic effect of the pandemic.\nBut he added it is also timely to think how it can better address the needs of parties in high-stakes infrastructure disputes, which tend to involve multiple parties from different jurisdictions.\nThe Chief Justice was addressing about 300 participants, including judges and local and international experts, at a virtual symposium to discuss the latest trends and developments in international commercial litigation.\nIn his opening remarks, Chief Justice Menon touched on two areas - infrastructure disputes and cross-border insolvencies - which he said seemed poised for significant expansion.\nThe Chief Justice noted that the Asian Development Bank estimated that Asia will need some US$26 trillion (S$35 trillion) in infrastructure investment up to 2030.\nChina's Belt and Road Initiative, which now involves more than 2,000 projects valued at over US$2.4 trillion, will account for some of this, he said.\n\"While we might reasonably expect a lull in enthusiasm for new projects in the immediate aftermath of the pandemic, the crisis seems certain to drive a spike in disputes arising from existing projects as construction programmes are delayed, suspended, renegotiated or even terminated,\" he added.\nHe said international commercial courts like the SICC, which was set up in 2015, offered advantages over international arbitration in resolving infrastructure disputes.\nFor one, such courts boast specialised benches of internationally renowned jurists for those who want to avoid potential concerns associated with party-appointed arbitrators, he said.\n\"We should build on these advantages, and think about new ways in which the SICC can better address the needs of users in this sector,\" he said.\nOne issue that could be discussed further is the development of specialised procedural rules tailored to the specific needs of infrastructure and construction disputes.\nAs for cross-border insolvencies, he noted that Singapore's restructuring and insolvency legislation was consolidated under the Insolvency, Restructuring and Dissolution Act last year, in what he described as a \"game changer\".\nHe said the SICC is also well suited to handling restructurings involving debts governed by foreign laws.\n\"SICC judges hail from a spectrum of jurisdictions and legal traditions, which is a particular advantage in Asean, which itself features a diverse range of legal cultures,\" added the Chief Justice.", "url": "https://www.straitstimes.com/singapore/courts-crime/infrastructure-and-cross-border-insolvency-poised-to-be-dispute-hotspots"}