{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:57:20", "date_modify": "2024-10-12 13:57:20", "date_publish": "2024-03-25 05:00:00", "description": "Prof Lim Wei Shen was awarded the title of Knight Commander of the Most Excellent Order of the British Empire. Read more at straitstimes.com.", "filename": "singapore_singaporean-doctor-in-britain-receives-honorary-knighthood-for-role-in-fight-against-covid-19_1728741440.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/25/photo2024-03-2422-24-34.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singaporean-doctor-in-britain-receives-honorary-knighthood-for-role-in-fight-against-covid-19_1728741440.html", "title": "Singaporean doctor in Britain receives honorary knighthood for role in fight against Covid-19", "title_page": "Singaporean doctor in Britain receives honorary knighthood for role in fight against Covid-19 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A Singaporean doctor based in Britain has received an honorary knighthood for his contributions in the fight against Covid-19 there.\nProfessor Lim Wei Shen, 56, was awarded the title of Knight Commander of the Most Excellent Order of the British Empire (KBE), according to an update on the British government’s website on March 21.\nThe title was awarded for Prof Lim’s role as the chair of Covid-19 Immunisation on the Joint Committee on Vaccination and Immunisation. He also acted as an independent adviser to the British government regarding the Covid-19 vaccine programme during the pandemic.\nIn early December 2020, Britain was the first Western country to start vaccinating its general population, in what was hailed as a watershed in defeating the coronavirus.\nA KBE is awarded for pre-eminent contribution in any field of activity or in a capacity which will be recognised by peer groups as inspirational and significant nationally and demonstrates sustained commitment. It is the highest honour that can be bestowed on a foreign citizen in Britain. However, recipients cannot use the honorifics “Sir” or “Dame”, but can use the initials KBE after their names.\nProf Lim told The Straits Times that receiving the honorary KBE was an “amazing honour”.\n“It is only by grace and the support of so many others, especially my wife, that the darkest days of the pandemic were passable. I am truly thankful for my colleagues, friends and family,” he said.\nAs a consultant respiratory physician with Nottingham University Hospitals NHS Trust since 2003, and an honorary professor of medicine with the University of Nottingham, Prof Lim has received multiple awards from medical institutes.\nHis speciality lies in respiratory infections, including pneumonia, influenza and Covid-19.\nProf Lim remembered how in early 2020, Singapore had experienced some of the impact of Covid-19 before Britain. “I learnt a lot from discussing with Singapore colleagues at the time regarding this novel virus,” he said.\n“Throughout the pandemic, there was, and continues to be, excellent cooperation and collaboration between the many countries globally where good, strong and transparent science is conducted, whether in Singapore, South Africa or Britain.”\nProf Lim wanted to contribute towards medicine from a young age – he credited his parents as well as an “outstanding family doctor” as influences on his journey.\nAfter graduating from Anglo-Chinese Junior College, he applied to study medicine at National University of Singapore, but did not get in.\n“I was therefore very fortunate that my parents generously and sacrificially supported my medical studies at the University of Nottingham instead,” he said. Prof Lim graduated in 1991.\nHe then worked for a few years at Tan Tock Seng Hospital and Singapore General Hospital before completing higher specialist training, including clinical research, at the Nottingham University Hospitals NHS Trust and the University of Nottingham.\n“The most memorable moments for me as a doctor are those many occasions when the courage and fortitude of patients and clinical colleagues battling together against illness and disease has been most evident,” he said.", "url": "https://www.straitstimes.com/singapore/singaporean-doctor-in-britain-receives-honorary-knighthood-for-role-in-fight-against-covid-19"}