{"authors": ["Elaine Lee"], "date_download": "2024-10-12 13:32:23", "date_modify": "2024-10-12 13:32:23", "date_publish": "2023-12-14 18:32:01", "description": "His team distributed drugs, including cannabis and meth, in the form of jellies, candies and vapes overseas. Read more at straitstimes.com.", "filename": "singapore_singaporean-man-arrested-and-jailed-in-seoul-for-operating-international-drug-ring-from-s-korea_1728739943.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/14/yuelcnbdrugs1412.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singaporean-man-arrested-and-jailed-in-seoul-for-operating-international-drug-ring-from-s-korea_1728739943.html", "title": "Singaporean man gets seven years’ jail for operating international drug ring from South Korea", "title_page": "Singaporean man gets seven years’ jail for operating international drug ring from South Korea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A 37-year-old Singaporean man wanted for drug trafficking in Singapore was arrested by the Seoul Metropolitan Police Agency (SMPA) for drug-related offences in South Korea on April 9, along with three female associates.\nTwo of the associates are Singaporean while the third is of a foreign nationality, the Central Narcotics Bureau (CNB) said in a statement on Dec 14.\nCNB said the man, who is suspected to be involved in coordinating and supplying drugs to associates in Singapore for their subsequent trafficking and sale using encrypted chat applications, and his foreign associate were charged and sentenced to jail in South Korea.\nThe man was sentenced to seven years’ jail while his associate was sentenced to three years, said CNB.\nThe bureau added that it will work with South Korean authorities to facilitate the repatriation of the man to Singapore upon the completion of his jail sentence in the country.\nFurther investigations will then be conducted into his suspected acts of coordination and supply of drugs to associates in Singapore.\nImmigration records showed that the man had left Singapore since Nov 12, 2021.\nCNB said its intelligence indicated that the man had set up his base in South Korea to traffic drugs.\nThe bureau then reached out to South Korea’s National Intelligence Service (NIS) and the SMPA for joint investigations into his activities.\nAccording to South Korea’s Yonhap news agency, the man was the head of an international drug sales organisation that promoted the sale of drugs through Telegram.\nHe and his team, which had been based in South Korea from September 2022 to July 2023, distributed drugs, including cannabis and meth, in the form of jellies, candies and e-cigarettes or vapes overseas, earning them a profit of 250 million won (S$256,000).\nDaily newspaper Chosun Ilbo reported that the Singaporean man was among 100 people arrested for drug-related offences between April and November. Out of those nabbed, 69 were South Korean and 31 were of Central and South-east Asian nationalities.\nDeputy director of CNB for operations Leon Chan noted that drug trafficking is a cross-border issue that affects many countries.\n“Traffickers increasingly use encrypted chat applications to advertise the sale of drugs to new clients and to arrange for the delivery of the drugs,” he said.\nSenior Assistant Commissioner Chan added that the successful arrest is testament to the good relationship and close cooperation between agencies in Singapore and South Korea in tackling the transnational nature of drug trafficking.\n“For drug syndicate leaders and members who choose to feed their greed by bringing harm to our people in Singapore, CNB will spare no efforts to bring them to face justice in Singapore.”", "url": "https://www.straitstimes.com/singapore/singaporean-man-arrested-and-jailed-in-seoul-for-operating-international-drug-ring-from-s-korea"}