{"authors": ["Claire Huang", "Osmond Chia"], "date_download": "2024-10-12 14:19:25", "date_modify": "2024-10-12 14:19:25", "date_publish": "2024-02-16 16:03:45", "description": "Companies can get up to 50% of support on each qualifying expenditure category under the scheme. Read more at straitstimes.com.", "filename": "singapore_budget-2024-new-tax-credit-to-support-firms-innovation-and-green-transition_1728742765.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/16/hzgreen160224.JPEG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_budget-2024-new-tax-credit-to-support-firms-innovation-and-green-transition_1728742765.html", "title": "Budget 2024: New tax credit to support firms’ innovation and green transition", "title_page": "Budget 2024: New tax credit to support firms’ innovation and green transition | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Amid the global race to attract quality investments, Singapore will introduce a new tax credit scheme that aims to support high-value and substantive economic activities.\nThe new refundable investment credit (RIC) scheme comes with a refundable cash feature.\nActivities in support of the green transition and those to do with new innovation and research and development are some of the investments eligible for the scheme, as is the setting up or expansion of manufacturing facilities.\nThe RIC will be awarded by the Singapore Economic Development Board and Enterprise Singapore, and is based on the qualifying expenditures incurred by a firm.\nExpenditure categories that qualify include manpower costs, professional fees, materials and consumables, freight and logistics costs, and capital expenditure.\nCompanies can get up to 50 per cent of support on each qualifying expenditure category.\nThe amount of RIC a firm can get depends on its different qualifying expenditure categories. For each RIC award, each category will have a predetermined support rate, which is tied to economic outcomes.\nEach RIC award will have a qualifying period of up to 10 years.\nThe credits are to be offset against corporate income tax payable. Any unutilised credits will be refunded to the firm in cash within four years from when the firm satisfies the conditions for receiving the credits.\nDeputy Prime Minister Lawrence Wong, who is also Finance Minister, announced this on Feb 16 during his Budget speech.\nHe noted that economic growth is tied to Singaporeans’ living standards, which are in turn linked to the Republic’s ability to attract high-quality and high-value investments that create good jobs for people here.\nHe said: “To be clear, we are not going for growth at all costs. There is a limit to how fast we can grow due to tighter constraints we face in land, labour and carbon.\n“But by focusing on productivity and innovation, we can push the frontier and grow at an average of about 2 per cent to 3 per cent each year over the next decade.”\nThe Government will also be topping up the National Productivity Fund by $2 billion in 2024.\nTo reinforce Singapore’s competitive lead, he said he will top up the Financial Sector Development Fund by $2 billion.\nThis is to give the Monetary Authority of Singapore more resources to extend the lead in the financial services sector.\nThe funding is not to do more just in core areas of banking, capital markets, asset management and insurance, but also to grow new areas such as fintech, as well as green and transition finance.\nMore funds will be set aside for R&D, with the Government investing an additional $3 billion in the Research, Innovation and Enterprise 2025 plan.\nThe plan, launched in 2020 with a commitment of $25 billion, will keep investments in these areas at about 1 per cent of Singapore’s gross domestic product.\nThe additional resources will go into research in national priorities like advanced manufacturing, sustainability, the digital economy and healthcare.\nDPM Wong noted that these investments will take time to translate into concrete economic outcomes but are needed to develop capabilities, ideas and talent. This will then sharpen Singapore’s edge as a knowledge-based and innovation-driven economy.\nS’pore to pump over $1b into AI development, upgrade broadband network to 10Gbps\nSingapore will pour more than $1 billion into artificial intelligence (AI) development over the next five years, said DPM Wong.\nThe fund aims to grow the AI talent pool and secure access to advanced chips that support the growing use of AI. Singapore’s broadband speeds will also be improved to hit 10Gbps in the second half of the decade.\nDPM Wong said AI is key to driving further economic growth.\nHe added: “Al is not just about ChatGPT or large language models; it is a general-purpose technology like electricity, the internal combustion engine, the computer or the Internet.\n“It has the potential to transform a wide range of industries, and to enhance productivity across many existing processes, from drug discovery, to organising warehouses and driving vehicles.”\nTo facilitate the growth of network-intensive AI and other technology, the Government will also upgrade Singapore’s nationwide broadband network to speeds of up to 10Gbps by 2030.\n“This is 10 times faster than the broadband speed in most homes today,” said DPM Wong.\n“This also ensures that our connectivity infrastructure will be able to support technologies like AI and immersive media as they become more pervasive in the future.”\nSingapore will work with leading companies globally to establish bases here, to encourage collaboration and innovation across the whole economy, he added.\nThe moves come after Singapore announced its revamped National AI Strategy in December 2023.\nDPM Wong said then that the new approach focuses on tripling the number of AI practitioners here to 15,000 by training locals and hiring from overseas, and backing the AI sector with world-leading infrastructure and research.\nHe added that AI has become an essential subject that people must know about and no longer something good to have if Singapore is to remain globally competitive.", "url": "https://www.straitstimes.com/singapore/budget-2024-new-tax-credit-to-support-firms-innovation-and-green-transition"}