{"authors": ["Wallace Woon"], "date_download": "2024-10-12 13:55:40", "date_modify": "2024-10-12 13:55:40", "date_publish": "2024-01-16 17:10:00", "description": "The company's owner said the behaviour seen in videos online were \"disgustingly inappropriate\". Read more at straitstimes.com.", "filename": "singapore_dog-trainers-suspend-pair-after-disgustingly-inappropriate-behaviour-pushing-hitting-animals-avs-investigating_1728741340.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/16/aidogs160124.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_dog-trainers-suspend-pair-after-disgustingly-inappropriate-behaviour-pushing-hitting-animals-avs-investigating_1728741340.html", "title": "Dog training firm suspends 2 employees for pushing, hitting animals; AVS investigating", "title_page": "Dog training firm suspends 2 employees for pushing, hitting animals; AVS investigating | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Dog training firm Xavian and Pack has suspended two of its employees after videos showing the pair pushing and hitting dogs were widely shared on social media.\nThe videos, which were posted by user monkey_bear2 on Jan 15, show two individuals in navy blue tops bearing the company’s name with a group of six dogs. The caption says that they are arranging the dogs for a “photo op”.\nIn one of the videos, one of the men pushes down on a dog’s back to get it to sit.\nWhen the dog stands back up, the man uses both his arms to shove the dog down again and it eventually sits.\nThe other employee drags another dog, before appearing to hit it on its body and head to get it to stay in place.\nIn a statement on his company’s Instagram page posted late on Jan 15, the firm’s owner Xavian Mar said he was aware of the videos and that these displayed “disgustingly inappropriate behaviour” towards the animals in its care.\nHe said: “This is definitely not what Xavian and Pack stands for and will not condone any of such behaviours.\n“As a dog parent myself, I would definitely not want my dogs to be treated that way.”\nMr Mar also clarified that he was “not present in the video”.\nHe added that the two employees in the video had been “suspended with immediate effect and will not be part of Xavian and Pack”, and also vowed to conduct a review.\n“We will be scrutinising all aspects of our services moving forward to avoid such events from happening.”\nMr Joshua Teoh, director of the Animal and Veterinary Service (AVS), said that it was aware of the videos and is investigating the matter.\nMr Teoh also said that safeguarding animal welfare is a “shared social responsibility” and urged members of the public to report suspected cases of animal cruelty to AVS via its website at www.avs.gov.sg/feedback or through its Animal Response Centre on 1800-476-1600.\nInformation shared with AVS is kept strictly confidential, he added.\nMs Aarthi Sankar, executive director at the Society for the Prevention of Cruelty to Animals (SPCA), said that the society is against the use of “aversive training methods”, which include the use of tools such as shock, choke or prong collars.\n“Force should never be used on animals. They are sentient beings, capable of expressing their preferences and feelings,” she said.\n“It is essential to understand and respect their behavioural cues.”\nMs Sankar said that the trainer’s attempt to manipulate the dog into a sitting position against its wishes or forcing dogs to take part in activities they are not comfortable with can cause unnecessary distress and even injuries.\nShe said there were nine cases of dog abuse involving trainers in 2023, and added that animal training providers should have stringent recruitment processes, regular training and auditing of staff, and a code of conduct for employees to adhere to.\n“All staff should also go through proper assessment and obtain the relevant certification from governing bodies before they are allowed to handle animals without supervision,” she said.\nUnder the Animals and Birds Act, any person who is found guilty of animal cruelty in the course of an animal-related business can be fined up to $40,000, jailed for up to two years, or both. A disqualification order of up to 12 months may also be considered.\nFirst-time offenders caught abusing an animal may be charged under the same Act, and can be fined up to $15,000, jailed for up to 18 months, or both.", "url": "https://www.straitstimes.com/singapore/dog-trainers-suspend-pair-after-disgustingly-inappropriate-behaviour-pushing-hitting-animals-avs-investigating"}