{"authors": ["Tham Yuen-C"], "date_download": "2024-10-12 13:45:42", "date_modify": "2024-10-12 13:45:42", "date_publish": "2024-04-15 16:01:38", "description": "He is leader of the PAP’s 4G team and will be Singapore's fourth prime minister. Read more at straitstimes.com.", "filename": "singapore_politics_dpm-lawrence-wong-to-take-over-from-pm-lee-on-may-15_1728740742.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/15/yaohui-pix4g-5522-B.jpg?VersionId=Olm5FsCQKmkhjgBg3denWMM0cv80tMpS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_dpm-lawrence-wong-to-take-over-from-pm-lee-on-may-15_1728740742.html", "title": "DPM Lawrence Wong to take over from PM Lee on May 15", "title_page": "DPM Lawrence Wong to take over from PM Lee on May 15 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore will have a new prime minister on May 15, with Deputy Prime Minister Lawrence Wong set to take over from Prime Minister Lee Hsien Loong on that day.\nThe date for the handover was announced in a statement from the Prime Minister’s Office (PMO) on April 15, a key detail in Singapore’s long-planned leadership transition from the third-generation to the fourth-generation (4G) political team.\nWhen he is sworn in at 8pm on May 15 at the Istana, DPM Wong, who entered politics 13 years ago, will be Singapore’s fourth prime minister.\nIn a video message put up shortly after the announcement, DPM Wong said he had never expected to be asked to serve as prime minister one day when he first agreed to enter politics in 2011.\n“I accept this responsibility with humility and a deep sense of duty. I pledge to give my all in this undertaking,” he said.\n“Every ounce of my energy shall be devoted to the service of our country and our people. Your dreams will inspire my actions, your concerns will guide my decisions.”\nPM Lee said on his social media pages that leadership transition is a significant moment for any country.\n“Lawrence and the 4G team have worked hard to gain the people’s trust, notably during the pandemic,” he said. “Through the Forward Singapore exercise, they have worked with many Singaporeans to refresh our social compact and develop the national agenda for a new generation.”\nPM Lee said the 4G team is committed to keeping Singapore working well and moving ahead, and asked that Singaporeans give DPM Wong and his team their full support to jointly create a brighter future.\nDPM Wong, who is 51, had been the presumptive next prime minister since April 2022, when he was picked by his peers as the leader of the People’s Action Party’s (PAP) 4G team.\nBefore DPM Wong, who is also Finance Minister, emerged as leader, former minister Khaw Boon Wan had spoken individually to the 4G leaders and other members of the Cabinet to move along the process of finding a successor for PM Lee. Mr Khaw revealed that 15 out of the 19 he had spoken to had put DPM Wong as their top choice.\nIt capped a period of uncertainty in Singapore’s leadership succession.\nA year before, in April 2021, Deputy Prime Minister Heng Swee Keat – originally earmarked for the job by his 4G peers in November 2018 – had stepped aside to pave the way for a younger person to lead the country. He was going to turn 60, and the Covid-19 pandemic, which began in 2020, had shortened his runway as the next prime minister, he had explained.\nThe pandemic, meanwhile, was also what helped DPM Wong come into prominence, pundits had said.\nAs co-chair of the multi-ministry task force on Covid-19, DPM Wong had been front and centre in Singapore’s fight against the pandemic, along with Health Minister Ong Ye Kung and Trade and Industry Minister Gan Kim Yong.\nHis assured manner during the task force’s many media conferences and ability to break down issues simply had gained him admirers.\nThe usually business-like minister also showed a gentler side, choking back tears as he thanked healthcare and other front-line workers during a speech in Parliament at the height of the crisis.\nPM Lee, 72, later said that his younger colleague and the 4G team had “earned their spurs” during the pandemic. The baptism of fire they went through put paid to worries that the team would have only a short time to forge bonds and learn to work together before having to take over.\nSince then, DPM Wong and his team had gone on to take on more responsibilities, chief among them spearheading the Forward Singapore exercise to forge a new social compact with Singaporeans.\nThe team’s report, put out in October 2023, set the public agenda for the years ahead. It called on Singaporeans to partner the Government in developing a fair, caring and inclusive society with people progressing together.\nWhile the Forward Singapore report has been described as a continuation of the work of the Government, there are signs that the new team will go further than their predecessors, as signalled by policy shifts such as the forthcoming introduction of unemployment assistance.\nThe coming into power of the 4G team also happens at a more troubled time for the world, with wars raging in Europe and the Middle East, and uncertainty in the global economy.\nAmid this, Singapore is restructuring its economy for the future.\nWhile there have been positive signs that Singapore’s economy will do better in 2024 than it did last year, more layoffs are expected due to rising costs and greater automation. Overall growth for 2024 is projected to be between 1 per cent and 3 per cent.\nIn many developed countries, rising inequality and slowing mobility have also divided people, and a key plank of the 4G team’s agenda has to do with strengthening bonds between people through sports, the arts and philanthropy in order to build national resilience.\nWith DPM Wong taking over before August, he will have the National Day Rally to lay out his plans for the year ahead. He also has his work cut out as he prepares his party for the next general election (GE).\nAt the biennial PAP convention held at the Singapore Expo in November 2023, PM Lee, who has been prime minister for 20 years, made his intention clear that he wanted to hand over to DPM Wong before the next general election, due by November 2025.\nDPM Wong, on his part, signalled his readiness for the task. Speaking to a hall full of his party’s members, he said: “I am ready for my next assignment.”", "url": "https://www.straitstimes.com/singapore/politics/dpm-lawrence-wong-to-take-over-from-pm-lee-on-may-15"}