{"authors": [], "date_download": "2024-10-12 13:34:40", "date_modify": "2024-10-12 13:34:40", "date_publish": "2024-10-09 17:45:00", "description": "Her topics ranged from personal reflections growing up to her work as director of the National Neuroscience Institute. Read more at straitstimes.com.", "filename": "singapore_on-life-loss-lessons-learnt-from-patients-and-a-sweaty-obsession-5-columns-by-lee-wei-ling_1728740080.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/09/lwl002.jpg?VersionId=AD8w1ulEbdEhJnHhPCP18H9MvQLW.sqo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_on-life-loss-lessons-learnt-from-patients-and-a-sweaty-obsession-5-columns-by-lee-wei-ling_1728740080.html", "title": "On life, loss, lessons learnt from patients, and a sweaty obsession: 5 columns by Lee Wei Ling", "title_page": "On life, loss, lessons learnt from patients, and a sweaty obsession: 5 columns by Lee Wei Ling | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "1. My patients, my teachers\nPublished on Dec 21, 2008\nIn 1983, I was training as a neurology resident at Massachusetts General Hospital, the premier Harvard-affiliated hospital that some termed “Man’s Greatest Hospital”.\nThis was where the rich and powerful came to seek medical treatment. It was where Dr Henry Kissinger, for instance, had the triple heart bypass that saved his life.\nI was doing a six-month posting in the neurophysiology laboratory. By sending small electric shocks down nerves and inserting needles into muscles, we could try to figure out the health of the nerve cells supplying various muscles as well as of the muscles themselves.\nMy patient one morning in summer was a businessman who owned a shoe factory in New Hampshire. He came with a note from his neurologist that said he had “progressive bulbar palsy”, a variant of Lou Gehrig’s disease in which the first and dominant symptoms relate to weakness of the muscles of the jaw, face, tongue, pharynx and larynx.\nThe tests of the nerves and muscles in the rest of his body were fine, and the final test was to put a fine needle in his tongue. I had never done this before, so I asked a senior colleague to supervise me.\nThe electrical activity picked up by the needle confirmed the dreaded diagnosis.\nI told the patient that a report would be sent to his neurologist. Then, as he changed from the hospital gown into his street clothing, he asked me where I was from. I replied that I was Dr Lee and that I was from Singapore.\n“You are Lee Kuan Yew’s daughter,” he said.\nI was dumbfounded and asked: “How do you know?”\n“I didn’t know,” he replied. “I have heard of Singapore and of Lee Kuan Yew and meant it as a joke. So you are Lee Kuan Yew’s daughter! I am Jo.”\nIt turned out that Jo’s daughter was considering studying political science at the National University of Singapore (NUS) and was in correspondence with the NUS admissions office. Jo invited me to his home in rural New Hampshire. I accepted because I intuitively trusted this man, who I knew would soon be told of his death sentence.\nDuring autumn two months later, when New Hampshire’s fall colours would be at their peak of loveliness, he drove down to Boston to pick me up for the four-hour drive to his home.\nBy now, he knew what he was facing. There was calm acceptance and he was putting his business in order so that his family would be financially secure when he passed on.\nHis speech was slurred and I had to concentrate to make out what he was saying. He had to make an effort to try to pronounce his words as clearly as he could.\nWe went hiking on the hills near his home. I won’t even try to describe the magnificent scenery of the autumn foliage. It has been captured on many canvases as well as calendars.\nOnce, we came upon a paddock where someone probably kept his horse(s) during summers. Jo told me a joke attributed to Ronald Reagan about how two people reacted when they found a paddock empty with only horse dung in it. The first said: “Dammit! The horse has escaped.” The second said: “The horse dung is still wet, the horse must still be close by.”\nJo did not say more than that, but tacitly I knew he was taking the second attitude. He would face his predicament as positively as he could. I respected him for his courage.\nThe next time he invited me was in winter when we went cross-country skiing. Although his speech was even more slurred on this occasion, his body was still strong and he out-skied me because he was a more experienced skier. On Sunday morning, the family was going to church and asked me to go along. I did not have any appropriate attire for church, but Jo told me: “God does not care how you are dressed.”\nSo there I was, a scruffy non-believer, attending mass with the Catholic family that I was spending a weekend with. I wondered whether Jo drew his strength from his religion, but speaking was such an effort for him now that I did not ask.\nThe last time I saw him was when he was admitted for an operation to put a tube through the abdominal wall into his stomach. He could neither speak nor swallow on this occasion. He looked emaciated but he was still alert and cheerful when I visited him.\nSoon after, I returned to Singapore after undergoing three years of training in neurology. A few months later, I received a card from Jo’s daughter informing me of her father’s demise.\nMany of the most important lessons that I have learnt about life and how to live it have come from my patients. Jo was my first teacher in a subject that cannot be taught through lectures, tutorials and textbooks.\nI may have no choice in the misfortunes that life chooses to inflict on me. But I do have a choice in responding to those misfortunes positively or negatively. To a certain degree, my happiness is within my control.\nThat is an easy lesson to preach but difficult to practise. More than once over the last 25 years, I have been faced with nasty circumstances beyond my control. Twenty-five years on, I am better at accepting adversity and trying my best despite them. I am still trying to do so every day.\nPerhaps if this philosophy of life had more believers, we would have less of the whining that Singaporeans are prone to, less misery and a more positive outlook towards all of life’s situations no matter how adverse they may be.\nFinally, learning should not be too tightly linked to formal academic institutions. Instead, it is a lifelong process that occurs in all spheres of life. Every encounter, positive or negative, is a possible lesson if we analyse it deeply.\nJo taught me something that “Man’s Greatest Hospital” didn’t.\n2. Why I choose to remain single\nPublished on April 5, 2009\nMy father became prime minister in 1959, when I was just four years old. Inevitably, most people know me as Lee Kuan Yew’s daughter.\nMy every move, every word, is scrutinised and sometimes subject to criticism. One friend said I lived in a glass house. After my father’s recent comment on my lack of culinary skills, another observed: “You live in a house without any walls.”\nFortunately, I am not easily embarrassed. As long as my conscience is clear, what other people say of me does not bother me. Indeed, I am open about my life since the more I try to conceal from the public, the wilder the speculation becomes.\nMy father said of my mother two weeks ago: “My wife was ... not a traditional wife. She was educated, a professional woman... We had amahs, reliable, professional, dependable. (My wife) came back every lunchtime to have lunch with the children.”\nActually, my mother was a traditional wife and mother. She was not traditional only in one respect: She was also a professional woman and, for many years, the family’s main breadwinner.\nOne of my mother’s proudest possessions is a gold pendant that my father commissioned for her. He had a calligrapher engrave on the pendant the following characters: “xian neng nei zhu” and “xiu zhou lan ya” which together mean a “virtuous wife and capable mother nurturing outstanding offspring”.\nMy mother lived her life around my father and, while we were young, around her children. I remember my mother protesting gently once about something my father had asked her to do.“It is a partnership, dear,” my father urged. “But it is not an equal partnership,” my mother replied.\nThe partnership may not have been exactly equal at particular points in time. But over the years, especially after my mother’s health deteriorated after she suffered a stroke, my father was the one who took care of her. She clearly indicated she preferred my father’s care to that of the doctors’, in itself a revelation of the quality of his care.\nHe remembers her complicated regime of medications. Because she cannot see on the left side of her visual field, he sits on her left during meals. He prompts her to eat the food on the left side of her plate and picks up whatever food her left hand drops on the table.\nI have always admired my father for his dedication to Singapore, his determination to do what is right, his courage in standing up to foreigners who try to tell us how to run our country. But my father was also the eldest son in a typical Peranakan family. He cannot even crack a soft-boiled egg – such things not being expected of men, especially eldest sons, in Peranakan families.\nBut when my mother’s health deteriorated, he readily adjusted his lifestyle to accommodate her, took care of her medications and lived his life around her. I knew how much effort it took him to do all this, and I was surprised that he was able to make the effort.\nIf my parents have such a loving relationship, why then did I decide to remain single?\nFirstly, my mother set the bar too high for me. I could not envisage being the kind of wife and mother she had been. Secondly, I am temperamentally similar to my father. Indeed, he once said to me: “You have all my traits – but to such an exaggerated degree that they become a disadvantage in you.”\nWhen my father made that pendant for my mother, he also commissioned one for me. But the words he chose for me were very different from those he chose for my mother. On one side of my pendant was engraved “yang jing xu rui”, which means to conserve energy and build up strength. On the other side was engraved “chu lei ba cui”, which means to stand out and excel. The latter was added just for completion.\nHis main message was in the first phrase, telling me, in effect, not to be so intense about so many things in life.\nI knew I could not live my life around a husband; nor would I want a husband to live his life around me. Of course, there are any number of variations in marital relationships between those extremes. But there is always a need for spouses to change their behaviour or habits to suit each other. I have always been set in my ways and did not fancy changing my behaviour or lifestyle.\nI had my first date when I was 21 years old. He was a doctor in the hospital ward I was posted to. We went out to a dinner party. I noted that the other guests were all rich socialites. I dropped him like a hot potato.\nIn 2005, while on an African safari with a small group of friends, one of them, Professor C.N. Lee, listed the men who had tried to woo me. There were three besides the first. Two were converted into friends and another, like the first, was dropped.\nI am now 54 years old and happily single. In addition to my nuclear family, I have a close circle of friends. Most of my friends are men. But my reputation is such that their female partners would never consider me a threat.\nMore than 10 years ago, when there was still a slim chance I might have got married, my father told me: “Your mother and I could be selfish and feel happy that you remain single and can look after us in our old age. But you will be lonely.”\nI was not convinced. Better one person feeling lonely than two people miserable because they cannot adapt to each other, I figured.\nI do not regret my choice. But I want to end with a warning to young men and women: What works for me may not work for others.\nMany years ago, a young single woman asked me about training in neurology in a top US hospital. I advised her to “grab the opportunity”. She did and stayed away for eight years. She returned to Singapore in her late 30s and now worries that she may have missed her chance to get married.\nFertility in women drops dramatically with age, and older mothers run the risk of having offspring with congenital abnormalities. Recent studies show also that advanced paternal age is associated with an increased risk of neurodevelopmental disorders in offspring, such as autism and schizophrenia, not to mention dyslexia and a subtle reduction in intelligence. Men can also suffer from diminished fertility with age although there is wide individual variation.\nI would advise young men and women not to delay getting married and having children. I say this not to be politically correct. I say it in all sincerity because I have enjoyed a happy family life as a daughter and a sister, and I see both my brothers enjoying their own families.\n3. Subsidised or not, treat all patients equally\nPublished on Dec 16, 2009\nThose who have been reading my columns regularly will know that my health has been uncertain. Perhaps for that very reason, I feel keenly the ill fortunes as well as triumphs of my patients.\nToday, as I write this, I feel like a “104-year-old”, a term that my friends would understand. It means I feel 50 years older than I really am. But I have patients to see.\nMany among them would have taken leave or made special arrangements to be accompanied by a parent or caregiver in order to see me. I could, of course, get another doctor in my department to see them, for most of my patients are subsidised and thus not allowed to choose their own doctors. But I treat my subsidised (B2 and C class) patients no differently from my full-paying (A and B1 class) patients, and provide all with the same quality of care.\nI also insist that all the doctors at the National Neuroscience Institute (NNI) do the same. This ethos of caring for patients regardless of whether they are subsidised or not is sometimes absent in our hospitals, even in cases of subsidised patients with complex problems. Sometimes such patients are assigned to junior doctors.\nRecently, a friend telephoned me one evening, very distressed. Her husband had had a severe head injury. I asked her who was the doctor in charge. She said she did not know. I told her to write down my name and mobile number on a piece of paper and pass it to the most senior doctor there and ask him to call me.\nThe moment the doctor saw the note, he telephoned his head of department. My friend had never seen or heard of the head of department before that. Other doctors in the hospital asked my friend: “Who are you and how are you related to Professor Lee Wei Ling?”\nAn hour later, the head of department called me to give me the medical details, sounding as though he had been in charge all along. The next day, a bouquet of flowers from the hospital appeared in the room of my friend’s husband. A senior doctor took care of my friend’s husband and performed every operation on him personally.\nMy friend’s husband had been admitted as a subsidised patient because all emergency admissions are categorised as “subsidised”. Our system must find an effective way of ensuring that senior doctors also treat subsidised patients. At present, it is in the economic interests of senior doctors to focus on paying patients rather than subsidised patients – and it is not always the case that doctors look beyond their economic interests. Thus we get incidents like the one I have just described. My friend’s husband should have been treated by a senior doctor as a matter of course, without my intervention.\nAt NNI, a subsidised patient with a complex medical problem would be seen by a senior doctor, or at least a junior doctor under a senior doctor’s supervision. My doctors know that I would come down on them like a tonne of bricks if I found they were not providing the same quality of care to subsidised patients as they were to paying ones.\nBack to today: I had four glasses of ice-cold kopi-o and made it to the clinic to see my patients. I have just finished seeing all my patients and decided that doing so was the best medicine I could possibly have.\nTwo of my patients were young men who had been under my care for about 20 years each. One was an engineering graduate of the National University of Singapore, and the other, a polytechnic graduate; both are now gainfully employed.\nTwo other patients were severely handicapped, and seeing them reminded me that I had no right to whine about my fate. Another patient came with her mother. She continues to have seizures but less frequently now compared with her previous visit.\nThree patients did not come. Instead, their elderly parents came and I asked the parents how the patients were doing. I knew all three well and their parents knew me well. I understood the difficulty of elderly parents having to take their handicapped adult children to the hospital by public transport.\nMy best reward of the day was a lady with epilepsy who has been under my care for 12 years. I casually asked her whether she was still employed. “Yes,” she replied, “I am in the same company I was working for when I first saw you. Don’t you remember, when the person in charge of me asked for a medical report from you, you said that she could contact you personally? She never did, perhaps because she was frightened of you, so I am still working in the same company. During the recent retrenchment exercise, she lost her job and I have been promoted to take over her duties.”\nIf that superior had contacted me and the patient had granted me permission to release her medical information, I would have done so. Since her seizures had been brought under control within six months of her coming under my care, and since there is still much social stigma attached to epilepsy, I would have told the superior that the seizures were well controlled and would not affect my patient’s ability to carry out her duties.\nWhen I walked out of my clinic after attending to all my patients, I felt psychologically like a 44-year-old, 10 years younger than my actual age. Which medicine can make you feel 60 years younger? More importantly, I felt I had contributed, in a small way, to human welfare.\nToday was worth living though it had started badly and I am still stiff and tired. I will do my best, though at times my best is not good enough, for my patients’ medical conditions are too severe for current medical science to cure.\n4. Difficult to accept a loved one’s suffering\nPublished on Aug 29, 2010\nI awoke with a start, a while ago, from a dream.\nI looked at my watch. It was 4am. It was a dream worth remembering, so I decided to write it down immediately. If I had not done so, I would not have been able to remember it later.\nIn my dream, I seemed to be simultaneously at home and outdoors at some unfamiliar place. Suddenly, a monster appeared and attacked me. I struggled with the monster but it matched me strength for strength. I did not utter a sound, nor was I frightened. Instead, I wrestled silently with it.\nSuddenly my mother appeared. She walked towards us, but did not say anything either. Instead, she made a dismissive gesture and the monster turned tail and ran away. That would be Mama’s way of tackling problems, I thought: no need for unnecessary words or actions; just do things quietly and effectively.\nAt that point, I woke up. I got up from the floor where I was sleeping and went into my mother’s room to see how she was doing. She was sleeping peacefully. I am now back in my room recording what I can still remember of my dream – for a “dream” indeed it was, as it cannot be classified as a nightmare.\nFor two years and three months already, my mother has been too weak to get out of bed. But in that brief moment in my dream, I saw her again as she had been – physically normal. I wished I could have dreamt on, and after some time, together with Mama, vanquished the monster in the dream and then walked off together.\nIn dreams, everything seems possible. That my mother appeared magically in my dream did not surprise me – either while I was dreaming or when I awoke. This is because between Mama and me, there was always some form of telepathy.\nOnce, when I was staying with my brother Hsien Loong, my toothbrush was worn out and needed to be replaced. I hardly ever shop, so I did what I had always done before: I told Mama I needed a new toothbrush.\nSince we were in different houses and I did not want to wake her if she was sleeping by calling her on the telephone, I e-mailed her: “Ma, I need a toothbrush.” She e-mailed back: “I am telepathic. I just got a toothbrush for you. But one day, the commissariat will not be around. If you don’t know the word ‘commissariat’, go look it up in the dictionary.”\nShe was correct: I did not know what the word meant. And since I did not know where the dictionary was kept in my brother’s house, that evening at dinner, I asked him what the word meant. He knew, of course. “Commissariat”, he explained, is a department in the army charged with providing provisions to soldiers.\nNow Mama is no longer in a position to be my commissariat. Worse yet, she is bed-bound and no longer able to read –a favourite activity of hers.\nMama had wide interests. She knew things that even many highly educated people would not know or be interested in, as would be obvious if one rummaged through her bookshelves, as I did recently.\nThere were several books on the flora and fauna of Singapore. There was a hardcover book of children’s nursery rhymes, which she had used to read to her grandchildren. Of all her grandchildren, my albino nephew enjoyed reading the nursery rhymes with her the most.\nThere were several books on Buddhism and Hinduism. There was a King James version of the Bible printed in a large font so that she could read it even without her reading glasses. There were many books on the Indian caste system, and a book describing the ancient city of Harappa in the Indus valley. The city dates back about 4,600 years ago, and was an important trade centre in the ancient world.\nMama was interested in the Silk Route long before it became a fashionable subject of interest. She had a book chronicling the travels of a Victorian lady on the Silk Route. There were six Malay kamus, or dictionaries. There was a book on Chinese customs and symbols. And of course, there were many books of poetry, including a collection of Rudyard Kipling’s poems.\nThere were also books relating to the early days of Singapore, including The Battle For Merger, a collection of radio talks my father delivered in 1961, detailing the early history of the People’s Action Party’s struggles with the communists. It is now out of print. There were many books, too, written by others about my father, including Lee Kuan Yew In His Own Words, excerpts of his speeches from 1959 to 1970, edited by S.J. Rodringuez.\nMama also had the kinds of books one would expect to find on the bookshelves of someone so cultured: among other things, The Tale Of Genji, Ruth Benedict’s The Chrysanthemum And The Sword, Etsu Inagaki Sugimoto’s The Daughter Of A Samurai, the novels of Jane Austen, and a book I enjoyed tremendously as a child, Anne Of Green Gables. Mama didn’t just collect these books, she read them.\nIt is now 5.30am. I popped into her room again a while ago and she was still sleeping. I comforted myself that at least when she was sleeping, she was unaware of her unfortunate situation.\nMany people who know me, even casual acquaintances, often conclude that I am eccentric.\nOne prominent feature of my eccentricity is my addiction to exercising, which can be described as obsessive compulsive.\nExercise, especially aerobics exercise, has been part of my daily routine since I was 13, after I did well in a cross-country race without preparation. At about the same time, I took up swimming.\nI am an endurance athlete, and have never been good at short sprints, whether on land or in the pool. The longer the distance, the greater the likelihood that I would win. I have never figured out whether it was natural stamina or sheer will that allowed me to prevail over rivals.\nCertainly, I am dogged.\nOften, when I am swimming or running a long-distance race, Kipling’s poem “If” comes to mind:\nIf you can force your heart and nerve and sinew\nTo serve your turn long after they are gone,\nAnd so hold on when there is nothing in you\nExcept the Will which says to them: ‘Hold on!’\nKipling’s words reflect my attitude. Between Secondary 1 and 4, I also learnt karate and achieved a first dan black belt. My mother stopped me from training in karate in pre-university after I fractured my hand blocking a kick in training.\nExercise has been my anti-depressant as well as my tranquilliser. If I miss my exercise, I am irritable and out of sorts compared with the days when I have done my full quota of exercise.\nI have varied my exercise regimen to accommodate study and work demands. During a New England winter when I was undergoing a three-month stint in neurosurgery training, which was part of the requirement to be a paediatric neurologist at the Harvard-affiliated Massachusetts General Hospital, I would wake up by 4 am to get my run and swim done before heading to work, starting ward rounds at 6.30am with the senior resident in neurosurgery.\nAt that time, I was also studying on the fly for a further degree for specialisation in paediatrics. To fulfil the competing demands of study and exercise, I would “fill the unforgiving minute with sixty seconds’ worth of distance run” (to further quote Kipling’s “If”), by recording myself reading aloud from textbooks and listening to myself on a Sony Walkman as I ran. To sustain this regimen for three months, which was the duration of my neurosurgical posting, I was in bed by 9pm so that I could wake up at 4 am to run and swim.\nMy daily exercise regimen from my teenage years until the age of 35 included a 10km to 15km run, followed by a 2km swim before heading in to start my work day. After work, I swam another 2km before heading home.\nI maintained a similar intensity even when I had to travel. When travelling, running was replaced by two hours of stepping on and off the step aerobic set at 10 inches, (two inches higher than what is recommended), holding a 2kg dumbbell in one hand.\nI always travel with my step aerobic board in a canvas bag. When queried at the airport check-in counter, I would unzip the canvas bag and reveal the plastic boards. I would then request for stickers to indicate that the bag’s contents are fragile and, for good measure, ask that it be treated as a golf bag.\nPeople sometimes ask me how I occupy my mind during the three to four stretches of exercising each day. When I am exercising, I do not focus on any particular thing; I let random thoughts pass in and out of my mind, without following them, as though the thoughts are like monkeys swinging from tree to tree, which then pass out of my mind. That is one way that novices learning meditation can use to quiet their minds. By the time I have completed my workout, I am at peace with myself and ready to face the world.\nOccasionally, a “eureka” moment occurs when the solution to some problem I was working on and then left on the back burner while I exercised, suddenly appears, and it seems so obvious that I wonder why I had not thought of it much earlier.\nI changed my exercise regimen ever since the 20m corridor in my home was thickly carpeted to prevent or minimise the risk of serious injury arising from a fall. All I need to do now is to step out of my room in running shorts and singlet, and I can walk and/or run barefoot back and forth in the corridor. I usually do 15km per day, which means 375 times back and forth in two to three hours. On weekends, I may do 20km, as well as strength and balancing exercises.\nFor those who wonder how I find the time to do so much exercise, I waste no time in getting to the exercise venue – I’m in bed by seven to eight in the evening, and my exercise begins at a little after 4am on weekdays. I usually decline social functions.\nThe amount of exercise I do is more than what is required for physical health. I do it because I feel good after doing so. Not only am I at peace with myself, but I feel confident that I can handle whatever problems occur later that day.\nI also think better and faster.\nFriends who are familiar with me can tell whether I have finished my quota of exercise for the day by my cheerful smile and my jaunty gait. On days when I have not achieved my quota of exercise, I can be grumpy.\nI am not advocating that everyone should follow my exercise regimen. Many will not be able to and will not enjoy doing so. Repetitive injuries are par for the course and I not infrequently suffer from over-use injuries. I have learnt how to adjust my exercise regimen so that I can continue to exercise in spite of them. Nor is it necessary to exercise this hard for better health. For some, it may even be detrimental.\nI am a mortal who chooses not to obey mortal rules. When I am punished for breaking the rules, I have no right to complain.", "url": "https://www.straitstimes.com/singapore/on-life-loss-lessons-learnt-from-patients-and-a-sweaty-obsession-5-columns-by-lee-wei-ling"}