{"authors": ["Chin Hui Shan"], "date_download": "2024-10-12 13:32:45", "date_modify": "2024-10-12 13:32:45", "date_publish": "2023-09-10 18:35:00", "description": "The authorities conducted enforcement operations at nightspots in the Joo Chiat, Marina Bay and Bugis areas. Read more at straitstimes.com.", "filename": "singapore_teen-among-four-arrested-for-drug-related-offences-cnb_1728739965.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/10/NR20-20photo20420gl.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_teen-among-four-arrested-for-drug-related-offences-cnb_1728739965.html", "title": "Teen among four arrested for drug-related offences", "title_page": "Teen among four arrested for drug-related offences | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Four people, including a 19-year-old, were arrested for suspected drug-related offences during a series of enforcement operations by the Central Narcotics Bureau (CNB) and the Singapore Police Force (SPF).\nDuring the operations from Thursday to Sunday at nightspots in Joo Chiat, Marina Bay and Bugis areas, about 3g of Ice, 98g of ketamine, 46g of Ecstasy tablets and 60g of a powdery substance believed to be controlled drugs were seized, CNB said on Sunday.\nThree male Singaporeans including the teenager and one female foreign national were arrested.\nOn Thursday night, about 20 people at a nightspot in Joo Chiat Road were checked by officers from CNB and SPF.\nA CNB officer spotted a 29-year-old female foreigner who had earlier left the nightspot. She was arrested in a nearby carpark after about 1g of ketamine was found on her.\nIn follow-up operations on the same night, a 26-year-old Singaporean man was arrested in Dunman Road after about 3g of Ice, 46g of Ecstasy tablets, 90g of Ketamine and 60g of a powdery substance believed to contain controlled drugs were seized from the vehicle he was in.\nA 53-year-old Singaporean man was also arrested in Petain Road after about 7g of ketamine were recovered from him.\nDuring an overnight operation on Saturday and Sunday, more than 90 people at four nightlife establishments in the Marina Bay and Bugis areas were checked. The 19-year-old was arrested for suspected drug-related offences.\nSuperintendent Lim Sze Yuk, commanding officer of Enforcement A and E Division, said: “CNB’s enforcement actions are necessary so that members of the public can enjoy Singapore’s nightlife safely without fear of being harmed by fellow partygoers or motorists under the influence of drugs.\n“Our advice is clear – stay away from drugs. CNB will not hesitate to take firm action against drug offenders.”\nUnder the Misuse of Drugs Act, the importation and exportation, possession, sale and consumption of controlled drugs or products containing controlled drugs is an offence.\nMembers of the public who would like to report suspicious drug-related activities may submit the information at https://www.eservices.cnb.gov.sg/feedback, or by calling the CNB hotline on 1800-325-6666.", "url": "https://www.straitstimes.com/singapore/teen-among-four-arrested-for-drug-related-offences-cnb"}