{"authors": ["Grace Leong"], "date_download": "2024-10-12 14:21:02", "date_modify": "2024-10-12 14:21:02", "date_publish": "2024-04-25 19:36:40", "description": "Some 16.5 million passengers passed through the airport in the first three months of the year. Read more at straitstimes.com.", "filename": "singapore_changi-airport-s-passenger-traffic-exceeds-pre-pandemic-levels-in-q1-2024_1728742862.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/25/yaohui-pixgeneric-7032.jpg?VersionId=KyBJfz4KHReS8Vuuhh4tNW.uwI.o0SfQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_changi-airport-s-passenger-traffic-exceeds-pre-pandemic-levels-in-q1-2024_1728742862.html", "title": "Changi Airport’s passenger traffic for Q1 2024 exceeds pre-pandemic levels", "title_page": "Changi Airport’s passenger traffic for Q1 2024 exceeds pre-pandemic levels | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Some 16.5 million passengers passed through Changi Airport in the first quarter of 2024, surpassing pre-Covid-19 levels on a quarterly basis for the first time, as China became the airport’s top market for the quarter.\nThis was a 0.5 per cent increase from what the airport handled in the first quarter of 2019, airport operator Changi Airport Group (CAG) said in a statement on April 25.\nThe airport handled 5.43 million passenger movements in January 2024 (96 per cent of the levels seen in January 2019), 5.35 million movements in February 2024 (104.3 per cent of that seen in February 2019), and 5.73 million movements in March 2024 (101.7 per cent of that registered in March 2019).\nIn the first quarter of 2023, 13 million passengers passed through the airport.\nChangi Airport’s top five markets for the first quarter of 2024 were China, Indonesia, Malaysia, Australia and Thailand. In 2023, these were Indonesia, Malaysia, Australia, Thailand and India, with China in sixth place.\nCAG said the roll-out on Feb 9 of a mutual 30-day visa-exemption arrangement between Singapore and China boosted travel between both countries, propelling China to the top spot for the quarter.\nFor the first three months of 2024, Denpasar (Bali), Manila, Taipei, Seoul and Shanghai were among the top 10 cities that outperformed the first quarter of 2019 by more than 10 per cent.\nFor the quarter, 89,400 flights departed or arrived at the airport – 94 per cent of the movements in the first quarter of 2019.\nIn comparison, there were 74,200 aircraft movements in the same quarter a year ago.\nBetween January and March, traffic to and from most regions recovered to or surpassed 2019 levels, with North America emerging as the strongest performer, with traffic exceeding pre-pandemic levels by 25 per cent for the quarter.\nFrom January to March, airfreight throughput, or air cargo movements, totalled 475,000 tonnes, up 14 per cent from the same period in 2023, marking the first quarter of year-on-year growth after seven straight quarters of decline.\nThis was due largely to strong transshipment performance, especially for air cargo flows with China.\nSpeaking at the annual Changi Airline Awards on April 25 at The Fullerton Hotel Singapore, Transport Minister Chee Hong Tat said Changi’s passenger traffic in the first quarter of 2024 was a significant milestone for Singapore’s aviation industry.\n“We look forward to the continued growth of passenger traffic at Changi, and will work towards our goal of exceeding pre-Covid passenger traffic levels for the full year.\n“We have seen through the worst of the pandemic and emerged stronger together,” he said at the award ceremony, which honoured the airport’s airline partners for their contribution to Changi Airport’s growth as a global air hub.\nMr Chee outlined several areas to position Changi Airport for future growth, reiterating that construction on the upcoming Terminal 5 is on track to begin in 2025.\nThe terminal is set to be operational in the mid-2030s.\nAviation workers, he said, will also need to pick up new and relevant skills, and jobs may be redesigned, as the airport taps technology such as automation and assistive tools to augment the human workforce and raise productivity of labour-intensive roles.\nSpeaking at the ceremony, CAG chief executive Lee Seow Hiang said a shortage of manpower will be a major challenge for Changi Airport in the mid to long term.\n“We have done deep automation in the last few years, and we are now on the cusp of a new phase with the impending launch of document-free travel by the end of this year.\n“Using your biometrics... as the key to identity verification, we can reduce the need for passengers to repeatedly present travel documents... at many touchpoints,” he said.\nThe improvement will be transformational, Mr Lee said.\n“By challenging the conventional norms in our business, we hope to take a step closer to our vision of an airport of the future well before T5 opens,” he added.\nMr Lee also gave more details about a planned new hotel at Terminal 2, the third landside hotel at the airport. Landside refers to areas of the airport that are before immigration clearance and accessible to the public.\nHe said the hotel – billed as Singapore’s first zero-energy hotel – will be ready in 2028 and have more than 250 rooms, and will be positioned to appeal to the younger set. It will be directly accessible from the terminal’s departure hall via a linkway.\nMr Chee thanked Mr Lee, who will step down on July 1 after 15 years at the helm of CAG, for spearheading Changi Airport’s growth and development.\n“Seow Hiang’s vision and steadfast leadership has transformed Changi into a leading global air hub, and taken the airport through the darkest days of Covid-19, and seen through Changi’s recovery after the pandemic,” he said.\nMr Yam Kum Weng, CAG’s executive vice-president for airport development, who has been leading the Changi East project, where T5 will be sited, will succeed Mr Lee.\nMr Lee declined comment when asked by The Straits Times about his post-CAG plans, at the award ceremony.\nAt the event, CAG named Shanghai-based China Eastern Airlines its partner of the year for the carrier’s significant efforts in expanding Changi Airport’s connectivity to China.\nThe 2023 winner for this category was Singapore Airlines, for its role in driving Changi Airport’s passenger traffic recovery in 2022 as the world rebounded from the Covid-19 pandemic.\nIn 2023, China Eastern Airlines launched four new links, including a new route from Beijing Daxing International Airport, making Changi Airport its first South-east Asia point. The other new direct links for the airline are to Hefei, Nanjing and Hangzhou.\nWith the increased services, China Eastern Airlines operated a total of 52 weekly services between Singapore and China as at December 2023.", "url": "https://www.straitstimes.com/singapore/changi-airport-s-passenger-traffic-exceeds-pre-pandemic-levels-in-q1-2024"}