{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:57:16", "date_modify": "2024-10-12 13:57:16", "date_publish": "2023-10-09 23:20:00", "description": "The government and medical sector also need to 'walk the talk' to foster trust and mitigate vaccine hesitancy. Read more at straitstimes.com.", "filename": "singapore_s-pore-s-covid-19-jabs-success-sets-stage-for-broader-vaccine-acceptance-roundtable-panellists_1728741436.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/09/202310095614999807e74452-6521-40c9-8cf4-13a544f55086.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-s-covid-19-jabs-success-sets-stage-for-broader-vaccine-acceptance-roundtable-panellists_1728741436.html", "title": "S’pore’s Covid-19 jabs success sets stage for broader vaccine acceptance: Roundtable panellists", "title_page": "S’pore’s Covid-19 jabs success sets stage for broader vaccine acceptance: Roundtable panellists | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Covid-19 vaccines were shown to reduce the risk of severe disease and death, enabling most people to return to normality, and this success could catalyse broader vaccine acceptance in Singapore against various diseases, panellists at a roundtable discussion suggested.\nVaccination is still key to staying well, and this includes getting inoculated against influenza, shingles and pneumococcal diseases, asserted the experts at Monday’s event, titled Navigating Covid-19 in the Endemic Era and Beyond – Forging a Collaborative Future to Strengthen Trust in Science.\nBut they noted that while Singaporeans accept childhood vaccines, many still find it hard to trust those for adults.\n“(The elderly say,) ‘Why do I need it when I survived more than 60 years without vaccinations,’” said infectious disease doctor Leong Hoe Nam.\nThe uptake of vaccines against human papillomavirus (HPV) in Malaysia and shingles in South Korea has been life-changing, he said. HPV is a sexually transmitted infection that causes cervical cancer.\nBut the decision ultimately lies with the individual, Dr Leong said, quoting a Cantonese proverb about how one can lead the cow to water but cannot force it to drink.\nEpidemiologist Vincent Pang from Duke-NUS Medical School said studies have shown that people are still hesitant about getting vaccinated when there are new policies, when vaccines are being rolled out, or when new safety risks have been reported in the media.\nAdding that this may be temporary, “vaccine hesitancy can potentially lead to vaccine refusal if there are no mitigation measures such as (letting people know) the benefits of having the vaccines over the risks”.\nProfessor Leo Yee Sin, a public health and infectious disease specialist and senior consultant at the Ministry of Health, said building trust can mitigate vaccine hesitancy. To do this, government and healthcare personnel need to lead by example and “walk the talk”.\n“During Covid-19, when the vaccine (first) became available, 40 healthcare workers were the first group of individuals to receive the vaccine. This is the best testament that you can give to the community,” she said.\nAcademics and clinicians believe in the science and understand the usefulness of the vaccine, she said. “It has become our responsibility to engage the different sectors, including the community.”\nShe acknowledged that much of Covid-19 vaccine hesitancy was due to how quickly the jabs were developed, which led to suspicions that shortcuts were taken and that they were not safe.\nBut while the speed of developing the Covid-19 vaccine was unprecedented, the potential for another pandemic has accelerated the need for global health preparedness and drastically reduced the timeline to plan and react. “What is ahead of us in terms of future development of preparedness is no longer just 50 months, we are now looking at 100 days,” Prof Leo said.\nMaking the vaccine accessible to the people helped Singapore attain the lowest mortality in the world, she added.\n“We have put in good effort in terms of public health to contain the disease as early as possible, using science to guide policy decision-making, and bringing the information (directly) to the people.”\nShe said that while more than 90 per cent in Singapore completed their primary jabs against Covid-19, there are “a lot of other very useful vaccines” that have not garnered the same level of uptake. “This is where we can use Covid-19 as a learning point to build up this kind of vaccine achievement for the entire population.”\nFor instance, pneumococcal vaccines that protect against bacterial infections such as pneumonia and meningitis, and flu jabs “can protect individuals as well as protect the entire population”, she said.\nDr Leong said Healthier SG, Singapore’s national preventative care programme, and the family physicians involved could remind Singaporeans to get boosters – a ground-up rather than a top-down initiative.\nAlso on the panel was Pfizer’s country medical director for Singapore Aditya Pathak. The session was moderated by visiting professor Tikki Pangestu of the Yong Loo Lin School of Medicine at the National University of Singapore.", "url": "https://www.straitstimes.com/singapore/s-pore-s-covid-19-jabs-success-sets-stage-for-broader-vaccine-acceptance-roundtable-panellists"}