{"authors": ["Varun Karthik"], "date_download": "2024-10-12 13:47:00", "date_modify": "2024-10-12 13:47:00", "date_publish": "2022-04-30 05:00:00", "description": "Mr Victor Seow is chairman of Silver Horizon Travel Co-operative, a social enterprise to encourage active ageing through travel. Read more at straitstimes.com.", "filename": "singapore_its-time-seniors-get-out-of-the-cage-syndrome_1728740820.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/30/yu_victor_seow2904a.jpg?VersionId=CAP4MJMe8jGLHzwitism_DmHut6.2RbR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_its-time-seniors-get-out-of-the-cage-syndrome_1728740820.html", "title": "'It's time seniors get out of the cage syndrome': Senior wants to encourage others to travel", "title_page": "'It's time seniors get out of the cage syndrome': Senior wants to encourage others to travel | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Mr Victor Seow, 64, is a retired general manager of a co-operative. He is chairman of Silver Horizon Travel Co-operative, a volunteer-run social enterprise for and by seniors to encourage active ageing through travel. It organises tours.\nSilver Horizon was organising a tour to South Korea in 2020 when the circuit breaker kicked in and travel restrictions were imposed by various countries. All our plans had to be scrubbed.\nFor our members, who were looking forward to travelling, it was a difficult time.\nIt was especially tough because we were cooped up at home. We were not meeting people and we were worried about contracting the virus. All those played on our minds. It affected our mental and physical well-being.\nThe safe management measures dried up our opportunities to travel, even local travel. Physical meetings were not quite possible until the measures were relaxed towards the end of last year.\nWhen that happened, we had a get-together for lunch at the Grand Hyatt hotel in December. We also organised a trip to the southern islands in January and a tour of Chinatown for Chinese New Year.\nI have become more active on the Internet. Even if I could not travel, I read up about other countries and looked at pictures of beautiful scenery overseas.\nI have definitely become a lot more tech-savvy since the Covid-19 pandemic began. Video-conferencing tools like Zoom, for instance, are an important part of my life now. I even picked up video-editing skills.\nMy biggest takeaway from the pandemic is that we need to take care of our mental and physical well-being, whether it is by travelling, reading or other means.\nWe have to look at the positive side of life and see how we can cope and not bring ourselves to such a level where we become so incapacitated. This is especially important for seniors.\nNow that the measures have been relaxed, it is the time to encourage our members to get out of what we call the \"cage syndrome\". We have locked ourselves in a cage and become so reclusive or stressed out.\nIn the next season of our lives, when we have the opportunity to travel, we should do so, and create lasting memories for ourselves. For seniors, our timeline is short, so we should make the most of things before we leave.", "url": "https://www.straitstimes.com/singapore/its-time-seniors-get-out-of-the-cage-syndrome"}