{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:30:30", "date_modify": "2024-10-12 13:30:30", "date_publish": "2024-07-31 11:13:00", "description": "The woman was accused of committing the offence in April. Read more at straitstimes.com.", "filename": "singapore_courts-crime_former-pre-school-teacher-charged-after-allegedly-kicking-4-year-old-girl_1728739830.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/courts-and-crime.jpg?VersionId=ZHefKevG3glqX9A_JCdftX9v2sygRSJ_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_former-pre-school-teacher-charged-after-allegedly-kicking-4-year-old-girl_1728739830.html", "title": "Former pre-school teacher charged after allegedly kicking 4-year-old girl", "title_page": "Former pre-school teacher charged after allegedly kicking 4-year-old girl | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A former pre-school teacher was charged on July 31 with one count of ill-treating a child, after she allegedly kicked a four-year-old girl’s right shin shortly before noon on April 2.\nDetails about the 56-year-old Singaporean woman and her former workplace have been redacted from court documents.\nThis case first made the headlines in June when The Straits Times reported that a pre-school teacher was initially suspended after an investigation found she had allegedly kicked a girl to make her sit properly.\nOn June 5, a spokesperson for the Early Childhood Development Agency (ECDA) told ST that it was alerted to the incident on April 3.\nECDA said the childcare centre suspended the teacher from pre-school duties after conducting its investigations.\nWithout revealing details, the agency also said at the time that it had taken regulatory action against the pre-school operator and the woman involved.\nThe ECDA spokesperson added: “The errant teacher subsequently resigned and to date, she has not been working in the pre-school sector.”\nThe woman’s case has been adjourned to Sept 10.\nThose convicted of ill-treating a child can be jailed for up to eight years and fined up to $8,000.", "url": "https://www.straitstimes.com/singapore/courts-crime/former-pre-school-teacher-charged-after-allegedly-kicking-4-year-old-girl"}