{"authors": ["Zhaki Abdullah"], "date_download": "2024-10-12 13:55:28", "date_modify": "2024-10-12 13:55:28", "date_publish": "2023-09-29 19:30:00", "description": "Leveraging telemedicine will help meet rising demand for healthcare, said Health Minister Ong Ye Kung. Read more at straitstimes.com.", "filename": "singapore_health_singhealth-to-introduce-telemedicine-hub-launches-new-polyclinic-in-tampines-north_1728741328.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/29/yaohui-tgeunos-6822.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_singhealth-to-introduce-telemedicine-hub-launches-new-polyclinic-in-tampines-north_1728741328.html", "title": "SingHealth to set up centralised telehealth hub at Eunos Polyclinic", "title_page": "SingHealth to set up centralised telehealth hub at Eunos Polyclinic | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – As part of efforts to bolster its telemedicine services, healthcare group SingHealth will be setting up a centralised telehealth hub at Eunos Polyclinic.\nIt will bring together clinical and administrative staff involved in telehealth under one roof, and be equipped with soundproof pods for consultations.\nThis was announced by Health Minister Ong Ye Kung during the opening of the new Tampines North Polyclinic on Friday.\n“It will be a more conducive facility for telehealth, and will be able to reap efficiencies of scale,” he said of the hub. It is not known when it will become operational.\nLeveraging telemedicine will help meet the rising demand for healthcare, Mr Ong said, noting that video consultations are suitable for a range of primary care cases as well as follow-up consultations for those with chronic conditions.\nFriday’s announcement comes after SingHealth Polyclinics began trialling its Acute-On-Demand TeleHealth service at Eunos Polyclinic in January.\nThe service, which is available to all patients, is meant for those who want to consult doctors for general medical conditions like acute respiratory illness or gastroenteritis.\nPlans are under way to bring other video consultation services, such as physiotherapy, to Tampines North Polyclinic.\nThese include the Primary Tech-Enhanced Care home blood pressure monitoring programme, which allows patients with high blood pressure to better manage their condition using technology and teleconsultations.\nSingHealth Polyclinics chief executive David Ng said that as at April 2023, it has conducted more than 36,000 video-consultations.\n“As we expand our (video-consultation) services and tap technology to empower our patients in self-monitoring of their blood pressure and blood glucose level, we will increase our efforts to enable those who are less digitally savvy, or unable to afford telemedicine services, through community partnerships,” he added.\nHe noted that the TeleHealth Service for Seniors, available at the Bedok and Marine Parade polyclinics, will be expanded to the rest of the group’s polyclinics, benefiting more elderly patients.\nTampines North Polyclinic is Singapore’s 24th polyclinic and the 10th under SingHealth.", "url": "https://www.straitstimes.com/singapore/health/singhealth-to-introduce-telemedicine-hub-launches-new-polyclinic-in-tampines-north"}