{"authors": ["Christine Tan"], "date_download": "2024-10-12 13:56:36", "date_modify": "2024-10-12 13:56:36", "date_publish": "2023-09-27 12:25:00", "description": "His wife also faces charges, including one charge of being a public nuisance. Read more at straitstimes.com.", "filename": "singapore_courts-crime_fine-for-briton-who-refused-to-wear-mask-at-mbs-called-mask-wearing-in-s-pore-oppressive_1728741396.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/27/202309277239373820230927105025cyq2191-01.jpg?h=75bb7093", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_fine-for-briton-who-refused-to-wear-mask-at-mbs-called-mask-wearing-in-s-pore-oppressive_1728741396.html", "title": "Fine for Briton who refused to wear mask at MBS, called mask-wearing in S’pore ‘oppressive’", "title_page": "Fine for Briton who refused to wear mask at MBS, called mask-wearing in S’pore ‘oppressive’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A British man refused to put on his mask when told to do so by a social distancing ambassador (SDA) in 2021 during the pandemic, and questioned the need to wear a mask in Singapore, calling it “oppressive”.\nOn Wednesday, Clive Ainsley Griffin, 56, was fined $1,200 by a district court after he pleaded guilty to an offence under the Covid-19 (Temporary Measures) Act.\nAnother charge of being a public nuisance was taken into consideration during sentencing.\nThe incident of the man and his wife confronting SDAs in Marina Bay Sands in September 2021 was captured in a series of videos circulating on social media.\nAt one point in the videos, Griffin’s wife was seen pulling down an SDA’s mask. His wife, Clariel Griffin, 48, who used to be known as Wong Pei Ling, faces one charge each of being a public nuisance and using criminal force on a public servant, and has also been charged with an offence under the Covid-19 (Temporary Measures) Act.\nHer case is scheduled for a pre-trial conference on Nov 3.\nDeputy Public Prosecutor (DPP) Nicholas Wuan said the couple and three of their friends were having dinner and alcoholic drinks at the Dallas bar in Marina Bay Sands on the evening of Sept 11, 2021.\nAt around 10.15pm, a group of SDAs was patrolling the food and beverage outlets in Marina Bay Sands to ensure that sales and consumption of alcohol ceased by 10.30pm, in accordance with the regulations then. The bar owner repeatedly reminded the group of customers to finish their drinks by 10.30pm, according to court documents. At 10.28pm, the owner told the SDAs that the bar staff were still trying to clear the drinks from Griffin’s table. After the staff cleared the drinks, Griffin and his wife exited the bar and spoke to the SDAs.\nWhile continuing with their rounds, the SDAs saw Griffin and his wife again at the promenade area of Marina Bay Sands at 10.39pm. The pair were not wearing masks. The SDAs advised them to put on their masks, but they refused to do so. One SDA took out her mobile phone to record the incident.\nDPP Wuan said: “During this time, the accused, who still was not wearing a mask, questioned the need to wear a mask in Singapore, considering it to be oppressive.”\nGriffin committed the offence of being a public nuisance by shouting and gesturing, according to court documents. One of the SDAs tried to calm him down and explained the need to wear a mask. At 10.44pm, Griffin and his wife walked away. The SDAs returned to their rest area and informed their supervisor about the incident. One of the SDAs reported the matter to the police the next day.\nGriffin was represented by Mr Josephus Tan, Mr Cory Wong and Mr Silas Siew of Invictus Law.\nThe lawyers said in their mitigation plea that Griffin’s actions caused “minimal to no harm” as he was already vaccinated at the time of the incident, and there was no evidence that he had tested positive for Covid-19.\nAsking for a fine of not more than $1,000, his lawyers said Griffin had learnt from this experience and would not flout any laws in the future.", "url": "https://www.straitstimes.com/singapore/courts-crime/fine-for-briton-who-refused-to-wear-mask-at-mbs-called-mask-wearing-in-s-pore-oppressive"}