{"authors": ["Samuel Devaraj"], "date_download": "2024-10-12 13:31:52", "date_modify": "2024-10-12 13:31:52", "date_publish": "2022-11-13 00:00:00", "description": "Travellers are advised to check for cannabis labels and ask what is in the dishes they order. Read more at straitstimes.com.", "filename": "singapore_courts-crime_cnb-beefing-up-its-officers-presence-at-checkpoints_1728739912.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/13/IMG2884_1.JPG?VersionId=x.egVsoDmfqd0mM1esxx8uM7WEmPgmiO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_cnb-beefing-up-its-officers-presence-at-checkpoints_1728739912.html", "title": "CNB beefing up its officers’ presence at checkpoints", "title_page": "CNB beefing up its officers’ presence at checkpoints | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The presence of Central Narcotics Bureau (CNB) officers at various checkpoints around Singapore is being stepped up, according to its new director.\nWhen asked how CNB is responding to the fact that drugs are becoming more easily available in some countries during an interview with the media on Friday, Mr Sam Tee said officers work closely with the checkpoint authorities and airports, and provide deterrence to would-be drug traffickers.\n“We work closely with them... to educate and remind people that it is against the law to bring drugs back to Singapore.\n“In fact, we are now doubling down on putting up more signage, messages at the checkpoints so that our people, when they go overseas, or travellers when they are at the departure area, they will see all these reminders. And when they come back, they will also see signs (that are) prominent,” added Mr Tee, 52, who became CNB’s director-designate on Aug 15 and director on Nov 6.\nThere have been reports of accidental consumption of cannabis overseas.\nMr Tee, formerly senior director of the Joint Operations Group in the Ministry of Home Affairs, advised travellers to assume responsibility for checking for cannabis labels and asking what is in the dishes they order.\n“If you consume it intentionally, then we have our ways to profile, observe upon your arrival. And then we may subject you to some form of test,” he said, adding that the detection and arrest of returning travellers happen daily.\nMr Tee, who is also a former commander of the Airport Police Division and Traffic Police, said the liberalisation of drugs around the world is making people in Singapore think about what it should be like here.\n“Domestically it is also a concern, because our people are getting more liberal, especially the youth. And in their mind, (they think) this is just soft drugs. ‘I watch Netflix and I see people taking drugs and it looks okay, it looks cool.’\n“And it doesn’t help that our people also go overseas for exchanges and holidays. And those drugs are widely available, particularly cannabis,” he said.\nBased on preliminary statistics for the first nine months of 2022, Mr Tee said there are signs that cannabis abuse is quickly returning to its pre-Covid-19 level, with the number of abusers, particularly those younger than 20, and the volume of the drug seized having already outstripped 2021 figures.\nHe cited a recent case where five teenagers aged 14 to 16 were arrested for suspected trafficking of cannabis, and said it is “madness” that teenagers are not only consuming but also selling drugs.\nHe highlighted another case of a 17-year-old who was recently charged in court, together with an 18-year-old and a 22-year-old, for trafficking more than 4kg of cannabis that had a street value of at least $120,000.", "url": "https://www.straitstimes.com/singapore/courts-crime/cnb-beefing-up-its-officers-presence-at-checkpoints"}