{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 13:57:33", "date_modify": "2024-10-12 13:57:33", "date_publish": "2024-04-21 20:50:00", "description": "About 8,000 people visited the President’s official residence on April 21. Read more at straitstimes.com.", "filename": "singapore_open-house-to-mark-hari-raya-aidilfitri-labour-day-draws-thousands-to-istana_1728741453.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/21/2024042128109715img5715.jpg?VersionId=nVDOg85gmFQDZ5pWxcDyClFyjhIoF8q0&h=ea19b765", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_open-house-to-mark-hari-raya-aidilfitri-labour-day-draws-thousands-to-istana_1728741453.html", "title": "Open house to mark Hari Raya Aidilfitri, Labour Day draws thousands to Istana", "title_page": "Open house to mark Hari Raya Aidilfitri, Labour Day draws thousands to Istana | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – About 8,000 people thronged the Istana on April 21 as the President’s official residence was opened to the public for the second time in 2024 to mark Hari Raya Aidilfitri and Labour Day.\nThe open house was held from 8.30am to 6pm, and visitors were treated to a series of multicultural dances and musical performances – featuring instruments such as the angklung, kulintang and gamelan – that were put on by students from nine schools.\nMany visitors also went on tours of the Istana grounds, and later met and took photos with President Tharman Shanmugaratnam and his wife, Ms Jane Ittogi, who arrived at about 3.45pm.\nFinancial adviser Muhammad Syahmi, 29, and his wife, Ms Fazirah Arzimi, 26, were among those who enjoyed a mostly sunny day out on the lawns.\nDressed in their Hari Raya best to match the occasion, the couple were at the Istana for the first time. They had decided to visit it after Ms Fazirah learnt about the open house on TikTok.\nThe strategy analyst said: “It is a rare opportunity because the Istana is not open to the public all the time. It is our first time entering the main building as well, so it was interesting to see all the art pieces gifted to Singapore from other states.”\nThe Istana is typically open to the public four to five times a year.\nAdding a splash of colour to the crowd on April 21 were a group of six dressed in hanfu – the traditional clothing worn by the Han Chinese, which has had a revival in recent years.\nLooking like she came straight out of a Chinese period drama, business development manager Crystal Lin said it was the first time the group from the Singapore Han Cultural Society had visited the Istana dressed in the attire.\nMs Lin, who declined to give her age, said they were hoping to use the opportunity to draw attention and promote traditional Chinese culture. She added: “There were a lot of cultural performances and activities today, and we thought we would add to the vibrancy.”", "url": "https://www.straitstimes.com/singapore/open-house-to-mark-hari-raya-aidilfitri-labour-day-draws-thousands-to-istana"}