{"authors": ["Vihanya Rakshika"], "date_download": "2024-10-12 14:21:11", "date_modify": "2024-10-12 14:21:11", "date_publish": "2023-10-16 19:10:00", "description": "Furniture giant expects to reduce costs of more than 60 other items by April 2024. Read more at straitstimes.com.", "filename": "singapore_as-part-of-global-move-ikea-s-pore-lowers-prices-of-over-140-products_1728742871.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/16/Ikea20Alexandra899.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_as-part-of-global-move-ikea-s-pore-lowers-prices-of-over-140-products_1728742871.html", "title": "As part of global move, Ikea S’pore lowers prices of over 140 products", "title_page": "As part of global move, Ikea S’pore lowers prices of over 140 products | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Ikea Singapore lowered prices of 144 products in September, and expects to reduce costs of over 60 more by April 2024, the furniture giant told The Straits Times on Monday.\nThis comes on the back of an announcement last Friday that Ikea would be cutting the prices of some of its products globally.\n“I think 2023 was the year when we turned the corner on prices and started lowering them again,” said chief executive Jon Abrahamsson Ring of Inter Ikea Group, the worldwide franchiser for the brand.\nHe cited an ongoing global cost-of-living crisis, as well as an ease on the pressure of costs to its supply chain as “raw material prices, transportation costs are going in the right direction”, having soared at the beginning of the year.\nIkea’s retail sales hit a record at €47.6 billion (S$68.7 billion) for the 2023 fiscal year, thanks to price increases from the previous year.\nIkano Retail, the franchisee that brings Ikea to Singapore, Malaysia, Thailand, Mexico and the Philippines, posted €1.08 billion in turnover. Its three Singapore stores yielded $384.2 million in sales.\nIn response to ST queries, an Ikea spokesman explained that the Inter Ikea Group is responsible for the range and supply for 12 Ikea franchisees around the world.\nMr Ring’s comments refer to a projection of wholesale prices – not retail ones – that will be charged to retailers, such as Ikea Singapore, but the final in-store prices will vary from market to market.\nIn Singapore, this has resulted in a reduction of up to 20 per cent in prices of items like Malm drawers, Ikea Singapore retail director Gerard Jansen said.\nFor example, a Malm chest of six drawers is now priced at $199, down from $249, while the Kallax shelving unit is now priced at $89, down from $109.\nA check on Ikea’s website shows that some items are listed with the tag “we lower prices where we can” in red, along with their previous price.\nMr Jansen said that Ikea’s 2022 Life At Home report revealed that 74 per cent of the 1,000 Singaporeans surveyed worry about their household finances.\n“That’s why we work hard to keep prices as low as possible on essential and best-selling items, so these savings count for the many Singaporeans looking to get the most for their home,” he added.\nThe survey was carried out by global public opinion and data company YouGov and collated responses from 37,405 respondents in 37 countries.\n“The Ikea vision is to create a better everyday life for many people by offering a wide range of well-designed, functional home furnishing products at prices so low that as many people as possible will be able to afford them,” said Mr Jansen.\n“We stand by our promise to be the most affordable, accessible and sustainable home furnishing retailer in the country.”\nDespite slashing the prices of its furniture, Ikea said the wholesale price projections do not touch on the prices of food products and its restaurants’ food. Still, some customers welcome the price reduction in Ikea’s home furnishing and storage products.\nMr Desmond Wang, who is in his 30s, said he was “super happy” when he found that he could fit more items into his budget when he went to Ikea about two weeks ago to purchase some furniture for his home. He had originally planned to make two visits, so he could set aside more to spend.\nAnother customer, Ms Susanna DeCruz, was also pleasantly surprised when she noticed that some of the furniture items she was interested in were cheaper than before. She told ST that she purchased the items immediately, despite visiting the Ikea outlet at Alexandra last weekend just for “window-shopping” at first.", "url": "https://www.straitstimes.com/singapore/as-part-of-global-move-ikea-s-pore-lowers-prices-of-over-140-products"}