{"authors": ["Lee Nian Tjoe", "Zaihan Mohamed Yusof"], "date_download": "2024-10-12 13:30:39", "date_modify": "2024-10-12 13:30:39", "date_publish": "2024-01-07 21:28:00", "description": "Showrooms overcrowded with interested buyers as COE premiums drop in first COE tender for 2024. Read more at straitstimes.com.", "filename": "singapore_busy-showroom-traffic-as-car-coe-premiums-tumble_1728739839.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/07/2024010652382262img0777.jpg.JPEG?h=862cf5b1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_busy-showroom-traffic-as-car-coe-premiums-tumble_1728739839.html", "title": "Busy showroom traffic as car COE premiums tumble", "title_page": "Busy showroom traffic as car COE premiums tumble | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Despite the persistent rain, many car showrooms in Leng Kee Road and Alexandra Road saw a surge in the number of visitors this past weekend.\nThe renewed interest in buying a new car was the result of a significant drop in certificate of entitlement (COE) premiums in the first bidding exercise of 2024.\nSales staff and managers were kept busy attending to customers and taking them on test drives beyond closing hours.\nMr Gary Quek, senior sales manager for Kah Motor, Honda’s distributor, told The Straits Times: “The number of visitors is definitely much better... at least three times more compared with a typical weekend in 2023.”\nMr Quek said that customers are timing their entry to buy a new car at the right price, especially before the Chinese New Year.\nAt the Toyota showroom in Leng Kee Road, there was a wait list just to speak to a car salesperson.\nThe Kia showroom across the road was just as busy, with a 45-minute wait for a 10-minute test drive.\nThe heavy showroom turnout was “not unexpected”, said Mr Ron Lim, head of sales for Tan Chong Motor, which distributes Nissan vehicles.\nWhat caught car dealers by surprise was the sizeable drop in COE premiums in the bidding held on Jan 4.\nThe premium for Category A cars – 1,600cc and below with horsepower not exceeding 130bhp – closed at $65,010, down 23.5 per cent from $85,000 in the prior exercise. This is the lowest figure since February 2022.\nThe premium for Category B, for larger cars, dropped by 22.7 per cent from $110,001 to $85,010 – falling below the $100,000 mark for the first time since October 2022.\nMr Lim said: “Most of the car dealers are seeing quite significant improvements in the number of sales being done. Even prior to the motor show taking place, I think that’s a very strong encouragement... People have been waiting for COE premiums to correct for quite a while.”\nThe Singapore Motorshow 2024 will be held from Jan 11 to 14 at Suntec Singapore. Typically, good deals and discounts are available at the show.\nMr Ramasamy Letchumanan, however, will not risk waiting longer for fear that COE premiums will rebound in the next exercise less than two weeks from now.\nAt the Toyota showroom on Jan 7, he told ST that the COE for his two-litre Mitsubishi ASX will expire in 2025.\nHe has decided to downsize to a smaller vehicle and has so far visited three different showrooms. He said Toyota was willing to give him $27,000 if he traded in his Mitsubishi.\nMr Ramasamy, 66, a warehouse supervisor with a logistics company, said: “If I wait, there’s no guarantee that COE premiums will remain low. Anyway, I do not need a big car because it is just my wife and me.\n“I’m interested in the Toyota Yaris Cross because the price is competitive, and most cars are still over my budget.”\nA prospective car buyer at the Kia showroom said his Honda Vezel had less than 18 months remaining on its COE.\nMr Goh, who declined to give his full name, said he is still waiting to see if COE premiums will drop further with the expected increase in COE supply.\nIn November 2023, the Land Transport Authority (LTA) said the COE supply for cars and commercial vehicles would be raised over the next three months with an injection of an extra 1,614 certificates.\nThis is on top of the 1,895 COEs for smaller and larger cars that were earlier reallocated in October for the period between November and January, which came from guaranteed deregistrations in the next projected supply peak.\nActing Transport Minister Chee Hong Tat has said COE supply will increase further in 2024 until the peak supply years in 2026 and 2027, using this “cut and fill” method.\nMr Goh, 48, a business development manager, said: “What is important for me now is to narrow down the right car for my young family. I’m in no hurry. I will take my time to test more cars and press the calculator more in the meantime.”\nMr Goh said he was keen on the Kia Niro Hybrid because his West-to-East daily commute to work is roughly more than 100km.\nThe competition to get more potential buyers into the showroom is keen, with dealers offering promotions such as six months of free road tax, $500 off insurance premiums and free solar film protection for windows.\nBut will the robust demand and low COE premiums last?\nMr Lim said: “The expectation is definitely for COE premiums to go up in the next tender. But after that, a lot will depend on the number of new quota being rolled out.\n“What is assuring for the market is LTA has hinted very strongly that more quota would be released every quarter running up to 2026, 2027... Hopefully this would contain the magnitude of the (COE) rise.”", "url": "https://www.straitstimes.com/singapore/busy-showroom-traffic-as-car-coe-premiums-tumble"}