{"authors": ["Sarah Koh"], "date_download": "2024-10-12 13:32:41", "date_modify": "2024-10-12 13:32:41", "date_publish": "2024-07-15 15:15:00", "description": "He was taken to the National University Hospital for further examination and treatment. Read more at straitstimes.com.", "filename": "singapore_boy-9-suffers-foot-injury-after-rubber-shoe-gets-stuck-in-escalator-at-jurong-point_1728739961.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/15/tcsafoot.jpg?VersionId=.RqwrhgDA03RZTQbFtIqn66wo3qtnOnT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_boy-9-suffers-foot-injury-after-rubber-shoe-gets-stuck-in-escalator-at-jurong-point_1728739961.html", "title": "Boy suffers foot injury after rubber shoe gets stuck in escalator at Jurong Point mall", "title_page": "Boy suffers foot injury after rubber shoe gets stuck in escalator at Jurong Point mall | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A nine-year-old boy was injured and taken to the hospital after the rubber shoe he was wearing got trapped in an escalator at the Jurong Point shopping mall on July 14.\nA netizen who claimed to have witnessed the incident, which happened at around 7.50pm, posted about it on social media platform Reddit, and said that the boy was stuck for around 40 minutes. Photos shared by the netizen showed several firefighters and paramedics at the scene, while passers-by looked on.\nIn response to queries from The Straits Times, the Singapore Civil Defence Force (SCDF) said it used rescue equipment to free the boy, before taking him to the National University Hospital for further examination and treatment.\nThe boy suffered a foot injury after the rubber shoe that he was wearing got trapped between the escalator steps, a spokesman for Link Asset Management, which manages Jurong Point, told ST.\n“We are in touch with the boy’s family, and will continue to render support and assistance to them as he recovers from this unfortunate incident,” said the spokesman.\n“We are working closely with the Building and Construction Authority (BCA) and Otis Elevator Company to conduct investigations on the incident.”\nVisitors are urged to be mindful of their own safety by taking the necessary precautions when riding the escalator, especially when they are with children, added the spokesman.\nIn January, a three-year-old boy fell and had his finger caught in an escalator at City Plaza mall in Geylang.\nA total of 632 escalator incidents were reported from January to October 2023, and 97 per cent of these were due to user behaviour, said the BCA in 2023.\nPeople struggling with large, heavy items such as prams, luggage and shopping trolleys were the top cause of these incidents, accounting for about 17 per cent of all cases.\nOther top causes of incidents include users moving on the escalator or not holding the handrail (16 per cent), the physical health conditions of users, for example, users feeling dizzy (12 per cent), and people not paying attention while on the escalator (11 per cent), including due to the use of mobile phones.\nAnother top cause was shoes or body parts getting trapped, particularly among young children (9 per cent).", "url": "https://www.straitstimes.com/singapore/boy-9-suffers-foot-injury-after-rubber-shoe-gets-stuck-in-escalator-at-jurong-point"}