{"authors": ["Elisa Chia"], "date_download": "2024-10-12 13:30:09", "date_modify": "2024-10-12 13:30:09", "date_publish": "2024-07-28 15:00:00", "description": "Make family time all the more special with these ideas and activities. Read more at straitstimes.com.", "filename": "singapore_parenting-education_fun-with-kids-free-sport-workshops-fairy-tales-retold_1728739809.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/28/sport1.jpg?VersionId=FZ09kzzrR7sb5jJV1eLLrqszPyF0HE_a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_parenting-education_fun-with-kids-free-sport-workshops-fairy-tales-retold_1728739809.html", "title": "Fun With Kids: Free sport workshops, fairy tales retold", "title_page": "Fun With Kids: Free sport workshops, fairy tales retold | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Make family time all the more special with these ideas and activities.\nSports festival for youth\nIf your teenager wants to pick up skateboarding, register for a free 90-minute workshop under the new Youth@Play festival on Aug 6.\nOrganised by Sport Singapore, the line-up includes classes in dragon boating and street dancing, and is open to those aged 16 to 27.\nThere are multiple classes for each sport, from noon to 9pm, at the Singapore Sports Hub. All activities are free and available for sign-ups on a first-come, first-served basis.\nParticipants also stand to receive a $10 eCapitaVoucher and win admission tickets to Universal Studios Singapore. Find out more at str.sg/kPtT\nOnce Upon A Green World book series\nThe next time your kids ask you to read The Emperor’s New Clothes again, introduce them to The Emperor’s Gazillion New Toys. Or regale them with the story of Sustain-erella instead of Cinderella.\nThese are two of the four familiar fairy tales retold with an environmental twist in the Once Upon A Green World children’s book series.\nThe other titles are The Little Mermaid Saves Our Seas, inspired by The Little Mermaid; and Three Little Sheep Build A Better Future, fashioned after The Three Little Pigs.\nSarah Ang, 43, who wrote Three Little Sheep, says: “I love the storyline of Three Little Pigs, of them not listening to advice and paying the consequence of their houses being destroyed. It’s such a well-loved moral tale with a lot of famous lines to play with.”\nHer story sees the sheep building eco-friendly homes in their effort to fight climate change.\nShe adds: “I hope that children can come up with creative solutions to reduce our waste and energy use.”\nLianne Ong, 48, and Janice Khoo, 49, co-wrote The Emperor’s Gazillion New Toys to raise awareness about over-consumption.\nOng says: “We kept key elements from the original story such as the Emperor’s desire for more or ‘better’, and the peddler characters selling their wares. The fractured fairy tale’s familiarity lends humour to the story.”\nKids can learn to be more mindful of their decisions’ impact on the environment, says Khoo, adding: “We believe it is possible to start with small steps. For example, by asking, do I really need that new toy?”\nPauline Loh’s version of The Little Mermaid sees the protagonist protesting sea pollution at a parliamentary meeting.\n“When we talk about marine consciousness, the obvious ambassador would be The Little Mermaid,” says Loh, who is in her 50s. “As I researched more into how humans were polluting the sea, I felt guilty.”\nThe four Singapore authors worked with illustrator Yee Wearn and Charlotte Barkla, an Australian writer and teacher.\nBarkla, who wrote the story Sustain-erella, says: “I thought it would be fun to play with the idea of Cinderella being a sustainability enthusiast.”\nThe 36-year-old, who teaches mathematics and science to secondary school students in Brisbane, adds: “We have only one planet, so it’s important we look after it as best we can and preserve it for future generations.”\nPublished by WS Education, the paperback books retail for $12.87 each and $32 as a set of four on Lazada at str.sg/iosfx", "url": "https://www.straitstimes.com/singapore/parenting-education/fun-with-kids-free-sport-workshops-fairy-tales-retold"}