{"authors": ["Selina Lum"], "date_download": "2024-10-12 13:29:13", "date_modify": "2024-10-12 13:29:13", "date_publish": "2024-05-31 18:35:00", "description": "The court said the seriousness of misconduct in relation to the two matters warranted a striking-off. Read more at straitstimes.com.", "filename": "singapore_courts-crime_m-ravi-disbarred-for-false-claims-against-president-over-pm-appointments-rude-behaviour-to-judge_1728739753.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/31/airavi310524.jpg?VersionId=UFx7cLswO4Ujipr5vPAvFcdsCzmxht5q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_m-ravi-disbarred-for-false-claims-against-president-over-pm-appointments-rude-behaviour-to-judge_1728739753.html", "title": "M. Ravi disbarred for false claims against then President Halimah, rude behaviour to judge", "title_page": "M. Ravi disbarred for false claims against then President Halimah, rude behaviour to judge | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Suspended lawyer M. Ravi, who has a long history of disciplinary proceedings for various incidents of improper conduct, has been struck off the rolls by the Court of Three Judges over two separate matters.\nThe first matter was making “false and unwarranted attacks” on both his Facebook pages in August 2020 against then President Halimah Yacob, as well as then Prime Minister Lee Hsien Loong and former PM Goh Chok Tong.\nMr Ravi had falsely alleged that the appointments of Mr Lee and Mr Goh as prime ministers were unconstitutional due to “racial considerations”, and falsely accused Madam Halimah of acting unconstitutionally in respect of the appointments.\nThe second matter arose of out of Mr Ravi’s disruptive behaviour in November 2021 when he was in court to represent a former SBS Transit bus driver who had sued the transport operator.\nMr Ravi had continually interrupted High Court Judge Audrey Lim and accused her of being biased. He also falsely claimed to the judge that his client wanted to discontinue the suit.\nDespite being discharged by the client later that day, Mr Ravi got a paralegal from his firm to write to the court, indicating that the client wanted him to continue to act for him in the suit.\nThe Law Society of Singapore had brought disciplinary charges against Mr Ravi over the two matters, and two disciplinary tribunals were appointed, one to investigate each case.\nBoth tribunals found the cases serious enough for Mr Ravi to face disciplinary sanction by the court, which has the power to suspend lawyers or strike them off the rolls.\nThe court, comprising Chief Justice Sundaresh Menon, Justice Tay Yong Kwang and Justice Steven Chong, heard arguments on May 9, 2024.\nThe Law Society was represented by Mr William Ong, while Mr Ravi was represented by Mr Eugene Thuraisingam.\nIn a judgment issued on May 31, the court said the seriousness of Mr Ravi’s misconduct in relation to the two matters warranted a striking-off.\nMr Ravi’s false and misleading allegations against the President and two PMs were “gravely irresponsible, wholly improper, and completely unacceptable”, said the court.\n“The respondent’s conduct of making the statements was very serious because it involved the publishing of false statements about key public offices. The false and unwarranted attack on the President, as well as PM Lee and PM Goh, went towards undermining these offices.”\nThe court said Mr Ravi’s disruptive and rude behaviour to Justice Lim, as well as his baseless allegation that she was biased, was also “wholly unacceptable and grave”.\nMr Ravi’s conduct showed an overall disregard and disrespect for the judge and, by extension, the judiciary, said the court.\nThe court noted that Mr Ravi’s conduct was not just a simple slip of the tongue; he kept up his barrage of interruptions and allegations even though the judge told him to let her finish speaking first.\n“Rude and disrespectful behaviour by advocates and solicitors, especially when such conduct is sustained, is completely unacceptable and undermines the administration of justice by his efforts to turn the courtroom into a circus,” said the court.\nThe court noted that Mr Ravi, who has been practising for more than 25 years, was “no stranger to disciplinary proceedings”.\nHis past incidents of improper conduct ranged from making baseless allegations with respect to key legal institutions and being disruptive in the courtroom, to improper handling of clients.\nOver the past two decades, he has been handed sanctions ranging from monetary penalties to suspensions from practice on two previous occasions.\nHe is currently serving a five-year suspension – the maximum under the law – for making baseless allegations against the Attorney-General’s Chambers and the Law Society.\nThe court said that, unlike the past cases, which did not involve dishonesty, his conduct in the trial involving the former bus driver had “crossed the line” and he was found to be dishonest.\nMr Ravi had falsely represented to the judge that his client wanted to withdraw the suit and drop the case, which was contrary to his client’s interest and intention to pursue the action, said the court.\nHe subsequently falsely represented to the judge that he had instructions from the client to continue acting for the client in the suit, when the client had already informed him earlier that he was to be discharged.\n“In our judgment, since the respondent’s conduct of acting without his client’s instructions, and against them, strikes at the heart of the solicitor-client relationship, and by extension, the administration of justice, this warrants an order of striking off,” said the court.\nThe court noted that in many of the past cases, Mr Ravi’s bipolar disorder was a mitigating factor.\nHowever, this was no longer a factor that weighed in his favour as the medical reports did not establish that his mental illness contributed to his misconduct in the current cases.", "url": "https://www.straitstimes.com/singapore/courts-crime/m-ravi-disbarred-for-false-claims-against-president-over-pm-appointments-rude-behaviour-to-judge"}