{"authors": ["Sherlyn Sim"], "date_download": "2024-10-12 13:38:17", "date_modify": "2024-10-12 13:38:17", "date_publish": "2023-08-28 14:45:00", "description": "Eating seafood from Japan as part of a balanced diet should not pose a significant risk to Singaporeans. Read more at straitstimes.com.", "filename": "singapore_askst-is-seafood-from-japan-safe-to-eat-can-salt-protect-against-radiation_1728740297.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/28/202107189885973920e9081f-635b-40a6-b336-a800828cbdd9.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_askst-is-seafood-from-japan-safe-to-eat-can-salt-protect-against-radiation_1728740297.html", "title": "askST: Is seafood from Japan safe to eat? Can salt protect against radiation?", "title_page": "askST: Is seafood from Japan safe to eat? Can salt protect against radiation? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Since Japan started releasing treated water from the wrecked Fukushima nuclear power plant last Thursday, countries in the region have seen panic buying of salt amid fears of radioactive contamination.\nChinese government officials have urged anxious consumers not to hoard salt. Beijing has also announced a ban on all Japanese seafood imports.\nThe Singapore Food Agency (SFA) has said there will be no immediate ban on seafood from Japan following the release of the treated water.\nThe Straits Times spoke to health and environment experts to understand if salt is an antidote for radiation, and whether it is still safe to consume seafood and salt from Japan.\nQ: Are table salt and sea salt an antidote for radiation?\nA: No, table salt and sea salt have no known radioactive-blocking activity, said health experts.\nProfessor William Chen, director of Singapore’s Future Ready Food Safety Hub, a research hub formed jointly by Nanyang Technological University (NTU), the SFA and the Agency for Science, Technology and Research, said the only salt reported to be able to block radioactivity is potassium iodide.\nBut potassium iodide blocks the absorption of radioactive iodine, and this is not relevant amid Japan’s discharge of treated water as the radioactive element present is tritium, said Prof Chen.\nQ: Is it still safe to eat salt and seafood from Japan?\nA: Experts said eating seafood and salt from Japan as part of a balanced diet should not pose a significant risk to Singaporeans, but the long-term impact needs to be monitored.\nProf Chen said Japan’s discharged treated water is at a much lower radioactive level due to its treatment before release, and also the vast dilution from seawater upon release.\nDr Choo Bok Ai, a senior consultant in radiation oncology at the Singapore-based Icon Cancer Centre, said the best way to quantify the risk is to conduct random sample testing of radioactivity in seafood from Japan.\nThe SFA has maintained its position on the safety of food from Japan, saying its surveillance results, including for radiation, have been satisfactory.\nThe agency added that it will continue to monitor food imports from Japan closely to ensure that they comply with Singapore’s food safety requirements.\nDr Choo added that the level of risk in consuming seafood and salt from Japan is dependent on three factors.\nThe first is the amount of seafood and salt one consumes.\nThe second is the distance between the source of the treated water and where the seafood is caught. Seafood caught closer to coastal Japan will have higher radioactivity than seafood caught in Singapore waters and the South China Sea.\nThe last factor is the type of radioactive compound one consumes. This is because the half-life, or the length of time it takes for half of the radioactive atoms of a specific radionuclide to decay, differs. Tritium, which is present in the treated water, has a half-life of 12 years.\nAn earlier ST report had highlighted that Tokyo Electric Power Company, the operator of the Fukushima nuclear plant, has been diluting the wastewater beyond what is necessary.\nThe water to be pumped out will contain tritium levels at one-seventh that of World Health Organisation drinking water standards, and 1/40th of Japan’s more stringent regulations.\nAs a result, the Fukushima tritium levels are far lower than those in the discharge from nuclear plants worldwide, with the International Atomic Energy Agency vouching that there is “negligible radiological impact to people and the environment”.\nAssociate Professor Nigel Marks, a physicist from Curtin University in Australia, said the ocean discharge was the “only practical option”.\n“For scale, the Pacific Ocean contains 8,400g of pure tritium, while Japan will release 0.06g of tritium every year. The minuscule amount won’t make the tiniest jot of difference,” he said.\n“A lifetime’s worth of seafood caught a few kilometres from the ocean outlet will have the tritium radiation equivalent of one bite of a banana.”", "url": "https://www.straitstimes.com/singapore/askst-is-seafood-from-japan-safe-to-eat-can-salt-protect-against-radiation"}