{"authors": ["Toh Ting Wei"], "date_download": "2024-10-12 13:48:16", "date_modify": "2024-10-12 13:48:16", "date_publish": "2022-03-24 11:43:52", "description": "The pre-departure test two days before departure will remain in place for now. Read more at straitstimes.com.", "filename": "singapore_transport_all-vaccinated-travellers-to-be-allowed-to-enter-spore-without-quarantine-no-more-need-for-designated-flights-vtls-replaced_1728740896.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/24/fhtravel240322.jpg?VersionId=MWYPgpQgsJvOzTQzEMQuvingGDg5kkSk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_all-vaccinated-travellers-to-be-allowed-to-enter-spore-without-quarantine-no-more-need-for-designated-flights-vtls-replaced_1728740896.html", "title": "All vaccinated travellers can enter Singapore without quarantine from April 1, no need for VTL flights", "title_page": "All vaccinated travellers can enter Singapore without quarantine from April 1, no need for VTL flights | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - All travellers vaccinated against Covid-19 and children aged 12 and below will be able to enter Singapore with just a pre-departure Covid-19 test from 11.59pm on March 31.\nIn Singapore's most significant move to reopen its borders, travellers will no longer be required to take only designated flights to enter Singapore quarantine-free, and will not have to take a Covid-19 antigen rapid test (ART) within 24 hours of arrival.\nThere will also be no more quotas on the number of daily arrivals and no entry approvals needed for all vaccinated travellers.\nThe new border policies will make the travel experience almost like that before the pandemic.\nThe new travel scheme, named the Vaccinated Travel Framework, will replace the existing Vaccinated Travel Lane (VTL) scheme.\nThe Ministry of Health (MOH) said on Thursday (March 24) that the pre-departure test two days before departure will, however, remain in place for now.\n\"We will continue to monitor the local and global Covid-19 situations and consider removing the pre-departure test requirement in the coming weeks,\" said MOH.\nNon-fully vaccinated long-term pass holders and short-term visitors aged 13 and above are generally not allowed to enter Singapore.\nBut exemptions will be made for long-term pass holders medically ineligible for vaccines, long-term pass holders aged 13 to 17, and long-term pass holders and short-term visitors with other valid entry approvals.\nThese visitors are required to take a pre-departure test within two days before departure for Singapore, undergo a seven-day stay-home notice (SHN), and take a polymerase chain reaction test at the end of their SHN period.\nTransport Minister S. Iswaran said at a press conference held by the multi-ministry task force on Covid-19 that there will be several other changes with the reopening to all vaccinated travellers.\nAir crew can resume normal activities in Singapore or overseas. They will be subject to similar testing requirements as vaccinated travellers.\nAirport workers only need to put on surgical masks, except for those in higher-risk roles who will be required to wear a face shield and gloves. They will no longer be required to undergo regular Covid-19 testings.\nThe airport will no longer be segregated into zones, thus allowing all travellers to move around freely in the transit area.\nBut Mr Iswaran cautioned that Singapore must be prepared to quickly re-establish public health protocols if the Covid-19 situation changes suddenly.\nHe added: “This shift to the Vaccinated Travel Framework is a decisive step for Singapore and an important signal to the world – that Singapore has fully reopened its borders, that we are reconnecting with the world, and reclaiming Changi’s status as an international aviation hub.”\nPrime Minister Lee Hsien Loong said in a televised speech on Thursday morning that the move to reopen to vaccinated travellers will give a much-needed boost to businesses, particularly those in the tourism sector, and help Singapore reclaim its position as a business and aviation hub.\nThe Government had earlier announced a target to restore air travel to 50 per cent of the levels before the Covid-19 pandemic this year.\nThe total number of passenger movements through Changi in February this year was 13.7 per cent of the levels in February 2019 prior to the pandemic.\nMOH on Thursday also updated its policy for billing travellers infected with Covid-19 for treatment, with immediate effect.\nUnder the old system, Singapore citizens, permanent residents and long-term pass holders were required to pay for Covid-19 treatment at hospitals and Covid-19 treatment and recovery facilities, if they tested positive for Covid-19 within 14 days of their return to Singapore.\nBut this policy has now been changed, with the new Vaccinated Travel Framework, said MOH.\nThe International Air Transport Association (Iata) regional vice-president for Asia-Pacific Philip Goh said the reopening will enable airlines to ramp up their services. He added that the removal of pre-departure testing in time to come will also boost the aviation sector’s journey towards a full recovery.\n“We have seen other significant moves in the region to reopen borders recently, including Indonesia, Malaysia, Thailand and Vietnam,” said Mr Goh.\n“This means many key markets in Asia will become more accessible to each other, restoring crucial air connectivity to the rest of the world.”\nRead next: What you need to know about Singapore's latest Covid-19 rules", "url": "https://www.straitstimes.com/singapore/transport/all-vaccinated-travellers-to-be-allowed-to-enter-spore-without-quarantine-no-more-need-for-designated-flights-vtls-replaced"}