{"authors": ["Zaihan Mohamed Yusof"], "date_download": "2024-10-12 13:31:18", "date_modify": "2024-10-12 13:31:18", "date_publish": "2022-12-19 19:00:00", "description": "SINGAPORE - When the Home Team Simulation System (HTS2) was first introduced in 2018, only two government bodies – the Singapore Police Force and the Singapore Civil Defence Force (SCDF) – used the software to train their personnel. Read more at straitstimes.com.", "filename": "singapore_more-home-team-officers-undergo-simulation-based-learning-to-add-more-realism-in-training_1728739878.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/19/shta17kelvinchng8794_4.jpg?VersionId=uDK072NxkFRXwjNXvJF.Rk9F_TxqCMmi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_more-home-team-officers-undergo-simulation-based-learning-to-add-more-realism-in-training_1728739878.html", "title": "More Home Team officers undergo simulation-based learning to add more realism in training", "title_page": "More Home Team officers undergo simulation-based learning to add more realism in training | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - When the Home Team Simulation System (HTS2) was first introduced in 2018, only two government bodies – the Singapore Police Force and the Singapore Civil Defence Force (SCDF) – used the software to train their personnel.\nThe simulation-based learning uses virtual reality, wide TV monitors and real-time scenarios to give trainees more realism when dealing with emergencies and the consequences of their actions.\nToday, the HTS2 system, “dubbed a first of its kind”, is being used by all Home Team departments and is capable of injecting more than 50 different scenarios for the 5,000 personnel who have gone through the training.\nThe technology behind simulation learning is growing so quickly that software developers are looking at the next level, said Dr Amanda Davies, a researcher in simulation-based learning.\nDr Davies, 64, an education executive and researcher from Rabdan Academy in the United Arab Emirates, said: “When using a desktop simulation, for example, you’re not going to get any touch and feel because it’s just on a computer... But there are other types of simulation where they have already been embedded to some extent where you can wear goggles, you can carry a weapon and you’re just on a carpeted floor. Because of the technology, you feel that you’re in a room, that you’re opening a door. So this has already begun.“\nAdding sound and smell also adds realism to a simulated scenario, such as an explosion or a terror-related incident, said Dr Davies, who is also a Home Team Academy (HTA) distinguished visiting fellow.\nTactile simulation has been used by the SCDF in its fire investigation training in 2020. Trainees put on virtual reality goggles to simulate what they see when they enter a room ravaged by a fire.\nThe cost behind high-tech simulation software can vary between US$500,000 (S$678,000) and several million dollars, depending on the type of simulation-based environment required, said Dr Davies.\nShe said the military and aviation industries were the first to use simulation-based learning 20 years ago.\nSimulation-based learning is gaining popularity worldwide due to its cost and time savings, and realism. The Covid-19 pandemic and its restrictions have forced global law enforcement agencies to adapt and adopt new training regimes using simulation, said the Australia-based Dr Davies.\nThe HTA uses HTS2 to train entry-level officers to senior Home Team leaders. The simulation is also used to improve command, control and coordination in incident management.\nTrainees may go through public security incidents such as bomb blasts, chemical attacks in Housing Board estates and shootings in shopping centres, as well as prison riots, fires, checkpoints security incidents and drug raids.\nHTA chief executive Anwar Abdullah said that in a landscape of constantly evolving security challenges, simulation-based learning is indispensable in providing training for varied scenarios under conditions and environments that mirror real life.\n“Simulation-based learning provides a safe environment for our officers to hone their skills and make mistakes. In particular, it gives our officers the ability to develop and exercise their decision-making skills, and hence have more confidence when faced with an actual situation,” he said.\nAdding to Mr Anwar’s perspective, Dr Davies said trainees must understand and learn that there are consequences to any decision they make.\nShe said: “It is all part of building the preparedness so that they know the ultimate outcome is greater safety and security for the community that they’re going to serve.”\nHTS2 also enhances training by drawing other law enforcement units into the same “operation” room.\nAdded Dr Davies: “This is still a very new approach within the policing area. The Home Team Academy has already done this quite successfully in terms of bringing in those satellite areas so that they don’t need everybody all in the one place, in the one room, to conduct that simulation exercise.”", "url": "https://www.straitstimes.com/singapore/more-home-team-officers-undergo-simulation-based-learning-to-add-more-realism-in-training"}