{"authors": ["Yuen Sin"], "date_download": "2024-10-12 13:30:26", "date_modify": "2024-10-12 13:30:26", "date_publish": "2021-06-21 15:56:08", "description": "The support is part of a $4.28 million package by the NTUC. Read more at straitstimes.com.", "filename": "singapore_up-to-13000-drivers-and-riders-to-get-200-650-cash-payout-from-ntuc-amid-covid-19_1728739826.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/06/21/af_pies_2106.jpg?VersionId=A2n5ZrQ5UOPa1xdS8gF406i65KH4pt9B", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_up-to-13000-drivers-and-riders-to-get-200-650-cash-payout-from-ntuc-amid-covid-19_1728739826.html", "title": "Up to 13,000 drivers and riders to get $200-$650 cash payout from NTUC amid Covid-19", "title_page": "Up to 13,000 drivers and riders to get $200-$650 cash payout from NTUC amid Covid-19 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Limousine, combi-bus drivers as well as delivery drivers and riders who are members of National Trades Union Congress (NTUC)-affiliated associations will be getting a one-off payout of up to $650 as part of a relief package that is being offered amid the slow recovery of the economy.\nThe support, which will be offered to members of the National Private Hire Vehicles Association (NPHVA) and the National Delivery Champions Association (NDCA), is part of a $4.28 million package by the NTUC and can benefit as many as 13,000 drivers and riders.\nIt is being provided to drivers of combi-buses that can seat up to 13 people and limousines in view of the significant decline in bookings during the course of the pandemic, and to delivery drivers and riders to cushion the impact of the recent petrol duty increase, said the NTUC in a press release on Monday (June 21).\nTo qualify for the grant, combi-bus and limousine drivers have to be paid-up NPHVA members and hold a valid vocational licence.\nDelivery drivers and riders must also be paid-up NDCA members and must be using a petrol-based vehicle.\nThey should also be making most of their income from their work as freelance combi-bus, limousine or delivery drivers and riders before March 31 , and should not be recipients of the Covid-19 Driver Relief Fund.\nThey are also required to provide supporting documents such as proof of trade income, proof of vehicle type and proof of work activity and self-employed status.\nThose who are eligible can apply for the payout online from June 21 to July 16 at this website. They can also do so in person at a pop-up centre located at Begonia Terrace in Downtown East by booking an appointment slot before heading down.\nThe scheme will be administered by the NTUC's Freelancers and Self-Employed Unit.\nApplicants will be notified of the outcome of their application in four to six weeks, NTUC said. Successful applicants will receive their cash relief in two to four weeks after receiving notification of application approval.\nDrivers and riders who meet the eligibility criteria but are not members of the associations can also apply for the scheme by signing up to be members of the NPHVA or NDCA. They can apply for the scheme after they have successfully become members.\nCombi-bus and limousine drivers will each get $650, delivery drivers using petrol or hybrid vehicles will each get $400, while delivery riders using motorcycles will each get $250. They must have joined the associations on or before March 1 this year.\nCombi-bus and limousine drivers who joined the associations after March 1 will each get $600, delivery drivers $350 each and delivery riders $200 each.\nMr Mohamad Azan Salleh, president of the NPHVA, said the association has received feedback from drivers that their incomes have been severely impacted by Covid-19. Though Covid-19 restrictions are easing, business volumes will not increase drastically immediately, he added.\n\"I'm grateful for the timely support,\" said Mr Azan.", "url": "https://www.straitstimes.com/singapore/up-to-13000-drivers-and-riders-to-get-200-650-cash-payout-from-ntuc-amid-covid-19"}