{"authors": ["Fatimah Mujibah"], "date_download": "2024-10-12 13:31:35", "date_modify": "2024-10-12 13:31:35", "date_publish": "2024-05-21 12:10:00", "description": "The large amount of cannabis and Ice seized can feed the addiction of 1,730 abusers for a week. Read more at straitstimes.com.", "filename": "singapore_man-nabbed-by-cnb-after-drugs-worth-over-707k-were-seized_1728739895.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/21/Drug.JPG?VersionId=kAXfbJcuo7yCz7ezKyY1RUwT53g9m6y4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_man-nabbed-by-cnb-after-drugs-worth-over-707k-were-seized_1728739895.html", "title": "Man nabbed by CNB, drugs worth over $707k seized", "title_page": "Man nabbed by CNB, drugs worth over $707k seized | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A 32-year-old man was arrested, following a bust by the Central Narcotics Bureau (CNB) on May 18 that yielded a large haul of drugs.\nThe drugs, estimated to be worth over $707,000, included about 5.8kg of cannabis and 1,582g of “Ice” or methamphetamine.\nThe amount of cannabis and Ice seized can feed the addiction of 1,730 abusers for a week, said CNB on May 21.\nOfficers arrested the Singaporean on the ground floor of a residential block around Jurong West Street 81 on the afternoon of May 18.\nThe bag he was carrying was found to have about 135g of Ecstasy, 756g of cannabis, 1,065g of Ice, 37 LSD (lysergic acid diethylamide) stamps, 365 Erimin-5 tablets and 84 vape pods which were suspected to contain tetrahydrocannabinol (THC).\nHe was escorted to his rental car at a multi-storey carpark nearby, where officers found an additional 5,052g of cannabis and about 517g of Ice.\nDeputy assistant commissioner Aaron Tang, director of CNB’s intelligence division, said: “The estimated worth of this large haul of drugs... shows very clearly that drug traffickers’ only concern is to make as much profit as is possible, regardless of how many lives drugs may destroy, be it that of the abusers or their families and loved ones.\n“Drug trafficking is all about profiting from the misery it inflicts on others.”\nHe added that CNB will continue to take out syndicates and traffickers.\nFigures released by CNB on Feb 14 showed that the number of drug abusers arrested in 2023 spiked by 10 per cent to 3,101, compared with 2,826 in 2022. Among those arrested in 2023, 944 were new abusers – an 18 per cent increase from 802 in 2022.\nThe number of cannabis users arrested was also the highest in a decade, jumping 17 per cent to 277 in 2023, from 236 in 2022.\nThose found guilty of trafficking more than 250g of methamphetamine or 500g of cannabis may face the mandatory death penalty.", "url": "https://www.straitstimes.com/singapore/man-nabbed-by-cnb-after-drugs-worth-over-707k-were-seized"}