{"authors": ["Goh Yan Han"], "date_download": "2024-10-12 14:19:54", "date_modify": "2024-10-12 14:19:54", "date_publish": "2023-11-08 23:19:03", "description": "At the same time, S'pore must try to avoid having the Government be the sole solution to all problems, he added. Read more at straitstimes.com.", "filename": "singapore_s-pore-must-be-rigorous-in-helping-those-not-catching-up-says-pm-lee_1728742794.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/08/2023110824900097img5594.jpg?h=862cf5b1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-must-be-rigorous-in-helping-those-not-catching-up-says-pm-lee_1728742794.html", "title": "S’pore must be rigorous in helping those not catching up, says PM Lee", "title_page": "S’pore must be rigorous in helping those not catching up, says PM Lee | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - As the economy grows, Singapore needs to be rigorous in how it helps those who are not catching up, said Prime Minister Lee Hsien Loong on Wednesday evening.\nThe nation is in a phase where everyone has to do more together, help each other, and the Government has to be there for the people.\nBut at the same time, Singapore must try very hard to avoid having the Government be the sole solution to all problems.\nOn supporting those left behind, PM Lee said that while previously they were spurred on with some incentives, the field has since spread out as the race went on.\nOthers face disruption when the world changes, and they may go from first to last.\n“Do you say, that’s just the way the world is? Or is there something I can do to help them get back into the race again, and be contributing again,” said PM Lee.\nHe was responding to a question from Bloomberg News editor-in-chief John Micklethwait on whether the Government is drifting towards the left with the announcement of various support packages.\nThe 45-minute dialogue, moderated by Mr Micklethwait, was held during the gala dinner of the sixth edition of the Bloomberg New Economy Forum, which runs from Wednesday to Friday.\nThe dinner was also attended by founder of Bloomberg and former mayor of New York Michael Bloomberg.\nApart from domestic issues, PM Lee was also asked about the Israel-Hamas war, Russia-Ukraine war and the tensions between the United States and China.\nOn the situation in the Middle East, he reiterated that a two-state solution is the only long-term solution to the conflict.\nOn the local front, he said Singapore has kept its system very lean and has to continue to keep it so.\nHe pointed out that the Government spends about less than 20 per cent of Singapore’s gross domestic product, which is about the same percentage of GDP that some European countries spend on state pensions.\nThe pressures of the ageing population and the costs of healthcare and social needs are pushing up gradually, and the challenge is in funding these expenses, he noted.\n“How do we allow that to happen where necessary, without (it) just blowing up out of control? And that means from time to time uttering the forbidden word – taxes,” he said.\nPM Lee cited the example of the increase in the goods and services tax rate that will see the next step up to 9 per cent on Jan 1, 2024.\nAt the same time, the Government has been providing generous subsidies to the lower two-thirds of the population.\nThe objective of the tax increase is to create more revenue, but at the same time the Government has moved to defer the impact on households for quite some time, he said.\nWhen asked about it being a slightly tougher year, given the billion-dollar money laundering case and a probe into one of his ministers, PM Lee said: “We just want to maintain high standards. And when the standards fall short, we have to deal with it.\n“And once in a while, you will find that one of your own did not quite live up to what he should have done or appears to have done something not quite right. And well, we have to do the right thing and we will have to be seen that the right thing is done, which is currently under way.”\nHe added that the money laundering case – which has seen 10 foreigners arrested and more than $2.8 billion worth of assets seized – is not in any way a scandal for Singapore.\nIt’s a criminal case, he stressed.\nThe authorities investigated and did what they needed to do, and those involved have now been charged in court where they will have to prove they did not do anything wrong, he said.\nOn whether he would become senior minister and work in an office above the Cabinet room as the late Mr Lee Kuan Yew used to do, PM Lee said it was a very delicate thing to be overwatching but not overbearing.\n“And to be able to give advice and a helpful nudge, and just the right, wise words and not cramp the style of your successor,” he added.\n“I’m at the disposal of my successor. I’ve already said, whatever he wants me to do, I will do to help him succeed,” he said.\nHe added that it “worked quite well” holding Cabinet meetings with his two predecessors – the late Mr Lee and now Emeritus Senior Minister Goh Chok Tong – in the room.\nAs he closed the dialogue, Mr Micklethwait said he hoped to see PM Lee again at the next forum.\nPM Lee responded: “I shall be in the audience listening!”", "url": "https://www.straitstimes.com/singapore/s-pore-must-be-rigorous-in-helping-those-not-catching-up-says-pm-lee"}