{"authors": ["Lim Min Zhang"], "date_download": "2024-10-12 13:31:15", "date_modify": "2024-10-12 13:31:15", "date_publish": "2021-06-11 05:00:00", "description": "Singapore is aiming for half its residents to be fully vaccinated by August, and at least 75 per cent by October. Read more at straitstimes.com.", "filename": "singapore_target-for-three-in-four-to-be-fully-vaccinated-by-october-wong_1728739875.html", "image_url": "https://www.straitstimes.com/themes/custom/straitstimes/images/st-subscribe-placeholder.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_target-for-three-in-four-to-be-fully-vaccinated-by-october-wong_1728739875.html", "title": "Target for three in four to be fully vaccinated by October: Wong", "title_page": "Target for three in four to be fully vaccinated by October: Wong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Singapore is aiming for half its residents to be fully vaccinated by August, and at least 75 per cent by October.\nAs at Monday, more than 1.8 million people, or about 30 per cent of the population, have been fully vaccinated.\nFinance Minister Lawrence Wong gave the projection at a news conference yesterday, as he noted that the United States saw infection rates steadily come down - from a peak in January this year - when about half the population developed immunity to the coronavirus which causes Covid-19.\nHe added that more than 40 per cent of people in the US are fully vaccinated, and about 10 per cent have been infected with the virus.\nSingapore has not reached that level of immunity yet, but \"we will get there soon\", said Mr Wong.\nIn his national address on May 31, Prime Minister Lee Hsien Loong said the country's target is for everyone who is eligible for a vaccination and wants one to get at least their first jab by National Day on Aug 9.\nWith a higher vaccination rate, compliance with social distancing and safe management measures, regular testing, and faster and more comprehensive contact tracing, Singapore will ease restrictions and gradually restore \"our normal lives, both within Singapore and at our borders\", said Mr Wong, who is co-chair of the multi-ministry task force tackling Covid-19.\nFor now, phase two (heightened alert) measures will be rolled back from Monday in a cautious and controlled manner, while maintaining strict controls at borders.\nThe maximum group size for social gatherings will increase from two people to five, among other relaxation of rules. The second stage of the reopening will happen from June 21, when dining in at eateries may be allowed, with a maximum group size of five.\nSuch restrictions are needed in phase three (heightened alert) until Singapore's vaccination rate is higher, said Mr Wong.\n\"It is not quite the full phase three, we call this phase three (heightened alert) because there are still these restrictions in place.\"", "url": "https://www.straitstimes.com/singapore/target-for-three-in-four-to-be-fully-vaccinated-by-october-wong"}