{"authors": ["Nicholas Yong", "Brand Newsroom"], "date_download": "2024-10-12 13:27:10", "date_modify": "2024-10-12 13:27:10", "date_publish": "2024-10-04 04:00:00", "description": "Challenges include cost of living and inflation concerns, and a preference for low-risk investment tools, notes a recent survey. Read more at straitstimes.com.", "filename": "singapore_millennials-want-to-retire-by-60-but-are-they-making-the-right-money-moves-to-get-there_1728739630.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/Etiqa_main.jpg?VersionId=1ChFo5fBMeK3XU9m3Oc8d7WMcqKmxvaL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_millennials-want-to-retire-by-60-but-are-they-making-the-right-money-moves-to-get-there_1728739630.html", "title": "Millennials want to retire by 60, but are they making the right money moves to get there?", "title_page": "Millennials want to retire by 60, but are they making the right money moves to get there? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "When Ms Sarah Ong started planning for her retirement in her late 20s, the goal was to retire by 60.\nShe was working in a bank then, running CSR (corporate social responsibility) programmes on financial literacy for lower-income individuals. “The exposure made me more aware of the need to plan for the future,” recalls Ms Ong.\nNow 35, Ms Ong is married and lives in an executive Housing Board flat. She juggles caring for two young children, aged one and four, and ageing parents – all while coping with rising costs.\nHer priorities have evolved: She and her husband are now actively planning to pay off their mortgage, fund their children’s education and ultimately, have enough savings for retirement.\nTo reach these goals, Ms Ong, who works on government and regulatory affairs at a multinational tech firm, has worked with a wealth planner for close to a decade.\n“My challenge is to better grow my savings so that I can beat inflation and retire comfortably,” she says.\nMs Ong still aims to retire at 60, and stay active in her golden years. “I would still want (the means) to take on new skills and remain purposeful through part-time work” and personal interests like volunteering, she says.\nWhat worries them\nMs Ong’s sentiments mirror those of her peers. Over half of millennials (defined as those aged 29 to 43) want to retire between 50 and 60 years old, revealed the Retirement Insights Report 2024 by Etiqa Insurance Singapore.\nHowever, rising costs of living and inflation (35 per cent), healthcare costs (30 per cent) and having insufficient savings (28 per cent), are among their top retirement concerns.\nCore inflation in Singapore, which excludes private transport and accommodation costs, has eased from a high of 5.5 per cent in January 2023. It hovered at 3.1 per cent between March and May, before falling to 2.9 per cent in June and 2.5 per cent in July. It rose to 2.7 per cent in August.\nConducted in June by data and analytics firm Kantar Profiles, the survey polled over 1,000 respondents in Singapore aged 18 and older on their retirement views.\n“Millennials and Gen Zs (aged 18 to 28) are expected to live longer than previous generations due to advancements in healthcare and lifestyle improvements,” notes Mr Raymond Ong, chief executive officer of Etiqa Insurance Singapore.\nIn 2023, the average life expectancy of Singapore residents at birth was 83 years, according to the Department of Statistics.\nLiving longer means having to plan for a longer retirement, says Mr Ong. “A lack of planning can have significant long-term consequences, including financial hardship, reduced quality of life and limited healthcare options.”", "url": "https://www.straitstimes.com/singapore/millennials-want-to-retire-by-60-but-are-they-making-the-right-money-moves-to-get-there"}