{"authors": ["Lynda Hong"], "date_download": "2024-10-12 14:17:16", "date_modify": "2024-10-12 14:17:16", "date_publish": "2023-04-12 05:00:00", "description": "About 40 per cent of the reusable packaging was returned through a SingPost letter box or post office. Read more at straitstimes.com.", "filename": "singapore_environment_1-in-3-online-shoppers-opt-for-reusable-packaging-wwf-survey_1728742636.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/14/unnamed2028729.jpg?VersionId=2bfc1tfnmN1Dri24zbxbmTU1di8RCilg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_1-in-3-online-shoppers-opt-for-reusable-packaging-wwf-survey_1728742636.html", "title": "1 in 3 online shoppers in Singapore opting for reusable packaging: Study", "title_page": "1 in 3 online shoppers in Singapore opting for reusable packaging: Study | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - One in three consumers here opted for reusable packaging for their e-commerce purchases in a pilot study conducted by World Wide Fund for Nature Singapore (WWF-Singapore).\nOver a six-month period from April to September 2022, online shoppers asked for reusable packaging for about 5,000 parcels out of 15,000 transactions tracked by the study. WWF-Singapore said the number of repeat customers was minimal.\nTwelve retailers participated in the study by offering customers the option of reusable packaging. The firms deal in a wide range of products, from healthcare items to shoes and bottled toiletries.\nAbout 40 per cent of the reusable packaging was returned through a Singapore Post (SingPost) letter box or post office. On average, it took customers 16 days to return the packaging, with the slowest being three months.\nThe study found that consumers preferred convenience to incentives for returning the packaging. A few customers chose to keep the packaging for their own use.\nFor the study, WWF-Singapore partnered UOB, DHL Consulting, SingPost and Better Packaging Co.\nWWF-Singapore chief executive R. Raghunathan said the study aimed to gauge consumer behaviour and sentiment on reusable packaging, and to demonstrate to retailers that the concept was viable if scaled up.\nAmong consumers who opted for the reusable packaging, about eight in 10 surveyed said they did so as it was a sustainable choice.\nIn a speech at an event to announce the study results on Tuesday at Capital Tower, Mr Raghunathan said: “We are heartened by the findings from the pilot as it demonstrates Singaporeans’ willingness to do more for the environment while emphasising the pivotal role of retailers and industry players to create a new, sustainable e-commerce ecosystem that appeals to the public.”\nSpeaking at a panel discussion during the event, Ms Neo Su Yin, CEO of SingPost in Singapore, said: “People have different interpretations of what convenience means. We think SingPost’s network of 800 letter boxes and 56 post offices already makes it fairly convenient to return packaging. But sometimes even that’s not convenient enough.”\nShe added that convenience should be improved, such as by allowing consumers to drop off reusable packaging on their way to work or home.\nAn earlier survey by WWF-Singapore found that a total of 200,000 e-commerce parcels are delivered across Singapore every day, and this number is projected to grow by almost 50 per cent by 2025.\nIn the pilot study, 90 per cent of the participating retailers said the use of reusable packaging improved packing efficiency, as the sealing method of using Velcro was fast and simple.\nRetailers estimated they could get cost savings and there would be an environmental benefit when the packaging is reused at least four to six times, or has a return rate of between 75 per cent and 83 per cent. This would effectively reduce resources for production and transportation of single-use packaging.\nBut the process may be harder for larger online retailers, noted Ms Pritha Saraf, project manager of DHL Consulting, which was the research partner in the survey.\n“A major consideration for many of the bigger companies in embarking on a pilot project is whether they are confident of scaling it.\n“It’s not just a small experiment for them. When these bigger companies have machines to pack the parcels, compatibility with the packaging and whether the parcels can move efficiently on the belt are major considerations,” she said.\nDr Yvonne Lin, materials experts at WWF-Singapore, noted that reusing, which uses the original item again without changing it, should be prioritised as more sustainable over recycling, which breaks down the original item into raw materials that can be made into something new.\n“Sometimes the argument is that it’s okay because the carton boxes are recyclable – some people even equate that to a circular economy. But actually, the circular economy is not just about recycling,” she said.\n“Recycling is always the last resort. Not generating waste in the first place is the most important. So in the circular economy, we should always look for ways where we can reduce, if not reuse or recycle.“", "url": "https://www.straitstimes.com/singapore/environment/1-in-3-online-shoppers-opt-for-reusable-packaging-wwf-survey"}