{"authors": ["Lee Nian Tjoe"], "date_download": "2024-10-12 14:17:45", "date_modify": "2024-10-12 14:17:45", "date_publish": "2023-01-22 05:00:00", "description": "Polestar, a Swedish brand owned by Chinese auto group Geely, also put up a good performance in its first full year of business here. Read more at straitstimes.com.", "filename": "singapore_transport_tesla-top-ev-brand-in-singapore-again-in-2022-but-byd-closing-gap_1728742665.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/06/2022031129389813aeca677e-d385-45d2-8340-506d053430a7.jpg?VersionId=zzUGvixUVTerUw__LSKFDw6N.ADdjcIr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_tesla-top-ev-brand-in-singapore-again-in-2022-but-byd-closing-gap_1728742665.html", "title": "Tesla top EV brand in Singapore again in 2022, but BYD closing gap", "title_page": "Tesla top EV brand in Singapore again in 2022, but BYD closing gap | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Tesla continues to lead the pack in electric vehicles (EVs) registered here as sales shoot up for a second year, although other brands are closing in on the American icon.\nAt 3,634 units, EVs made up 11.7 per cent of all cars registered in 2022. This is a big leap from the 1,740 units, or 3.8 per cent of total registrations, in 2021. In 2020, just 0.2 per cent, or 100 EVs, were on the road.\nWhile it has maintained its No. 1 spot from 2021, when the American EV brand became officially available in Singapore, Tesla’s lead has been eroded from 53.1 per cent of all EVs registered in 2021 to 24.1 per cent in 2022.\nThe biggest gainer in terms of registration figures was BYD – it was just 89 units behind Tesla in 2022. Its 786 registrations translate to 21.6 per cent of all EVs delivered in the year. The brand’s market share in 2021 was 5.1 per cent.\nFrom May 2022, to encourage the adoption of more mass market EVs, those with 110 kilowatts (kW) of power were grouped in the smaller car category in the auctions for certificates of entitlement (COEs), where the premium tends to be lower. The threshold was previously at 97kW and applied to all cars, EVs or otherwise.\nRated at 70kW, the BYD e6 was among rate models of EVs to have always been in the cheaper category of COE even before the recategorisation.\nPolestar, a Swedish brand owned by Chinese auto group Geely, also put up a good performance in its first full year of business here, albeit in the more premium end of the market.\nUnlike the other brands on 2022’s top 10 list which offered multiple models, the brand’s seventh position was powered solely on the Polestar 2.\nAssociate professor of economics Walter Theseira at the Singapore University of Social Sciences, who owns a Tesla, believes that while the American EV brand had appealed to buyers here with its mix of good performance, space and overall efficiency, other EV makers are catching up on the technology front.\nMr William Fletcher, 55, is on his third EV, a new BYD Atto 3 he bought in late 2022. The vice-president of sales at a commercial kitchen said he has no regrets with his latest purchase as the car is energy-efficient, comfortable to ride in and has a great sound system to boot.\nHe said his next car would most likely still be an EV, even though he said that there are days when he misses the sound of an engine and of the shifting of gears.", "url": "https://www.straitstimes.com/singapore/transport/tesla-top-ev-brand-in-singapore-again-in-2022-but-byd-closing-gap"}