{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:56:51", "date_modify": "2024-10-12 13:56:51", "date_publish": "2023-10-12 20:00:00", "description": "For the first time since 2004, the Healthcare Humanity Award was given to teams. Read more at straitstimes.com.", "filename": "singapore_70-healthcare-personnel-and-caregivers-25-teams-receive-healthcare-humanity-awards_1728741411.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/12/20231012362094771f2e4698-eeab-4305-9b74-2e5adbceae59.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_70-healthcare-personnel-and-caregivers-25-teams-receive-healthcare-humanity-awards_1728741411.html", "title": "70 healthcare personnel and caregivers, 25 teams receive Healthcare Humanity Awards", "title_page": "70 healthcare personnel and caregivers, 25 teams receive Healthcare Humanity Awards | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - During the height of the Covid-19 pandemic in April 2020, assistant nurse clinician at Mount Elizabeth Hospital Evangeline Reyes Balboa not only donned full personal protective equipment and N95 masks to take swabs at the migrant workers’ dormitories in the sweltering heat, but she also, on her own initiative, bought and delivered food to seniors living alone.\n“I had just returned from a short vacation when there was a call for volunteers to do swabbing. I volunteered, not realising how dangerous it was,” said the 52-year-old mother of two children who live in the Philippines.\n“It was not easy (for me), especially when I saw so many migrant workers confined to the dormitories, not being able to remit money home and worrying about the health and safety of their families in their home countries.”\nMs Balboa’s voice broke as she recounted how she was worried about her elderly mother who was alone at home in the Philippines while her two children were away at different university campuses.\n“I cried whenever I thought of them. We would video call each other every day to make sure we were all okay and free of the infection,” she said.\nIt was the thought of her mother being alone that drove Ms Balboa to buy and deliver food to seniors living alone in Sembawang and Yishun.\nToday, her son is a doctor at one of the top hospitals in the Philippines, her daughter is in her final year of reading radiology and her mother is “hale and hearty, living her life to the fullest”. All three are proud of Ms Balboa’s achievements.\nFor her efforts during the pandemic, Ms Balboa was among 70 individuals who received the Healthcare Humanity Awards from President Tharman Shanmugaratnam on Thursday at the Conrad Centennial Singapore.\nThe award started in 2004, a year after Singapore faced the severe acute respiratory syndrome crisis (Sars), and is a continuing legacy of the Courage Awards that was first given out in 2003 to healthcare workers for their courageous fight against Sars.\nAnother award winner who went beyond the call of duty was Dr Louisa Sun, an infectious diseases doctor from Alexandra Hospital.\nShe was working at the medical posts in the migrant worker dormitories when she realised that – apart from medical care – what was needed was accurate information to allay panic and fear among the residents.\n“Language was a significant barrier. They were in lockdown. The sense of panic and fear spread quickly, exacerbated by misinformation,” she said.\nTo ensure the migrant workers at the dormitories were receiving the right information, Dr Sun produced various print and audio materials and got friends and colleagues to translate them into seven different languages.\nFor instance, they curated a pictorial, multilingual health booklet aimed at orientating incoming patients at community care facilities. The booklet, developed to provide culturally sensitive information and advice, was translated into Bengali, Tamil, Hindi, Mandarin, Burmese, Thai and Telugu.\nDr Sun’s work with like-minded doctors from other hospitals led to the formation of a network of migrant worker-related organisations, My Brother SG, which “continues with on-ground engagements to empower our migrant workers to be informed about their own health”, she said.\nMadam Tracy Lee, 62, a senior officer at Touch Community Services, feared catching Covid-19, as she was initially an unvaccinated senior “due to certain medical allergies”.\n“I had to confront my own fear and uncertainty, because there were so many who needed help as there was a spike in Covid-19 cases in Ang Mo Kio. I chose to turn to my faith and be courageous, especially (for) those who were anxious, depressed and suicidal,” said the award winner and grandmother of one.", "url": "https://www.straitstimes.com/singapore/70-healthcare-personnel-and-caregivers-25-teams-receive-healthcare-humanity-awards"}