{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 13:53:36", "date_modify": "2024-10-12 13:53:36", "date_publish": "2024-06-24 12:13:00", "description": "Passengers taking a cab from the airport will continue to pay up to $8 extra. Read more at straitstimes.com.", "filename": "singapore_transport_higher-surcharges-for-taxi-rides-from-changi-airport-mandai-attractions-to-be-made-permanent_1728741216.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/24/2024062479367994f24be47a-1de8-4c24-94f1-3eeba9e9ad09.jpg?VersionId=Eu_O2RRucUR_IBOfdaovd79Q4y1_2qri", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_higher-surcharges-for-taxi-rides-from-changi-airport-mandai-attractions-to-be-made-permanent_1728741216.html", "title": "Higher surcharges for taxi rides from Changi Airport, Mandai attractions to be made permanent", "title_page": "Higher surcharges for taxi rides from Changi Airport, Mandai attractions to be made permanent | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Location surcharge hikes introduced on a temporary basis in 2022 for taxi rides starting from Changi Airport, as well as attractions at Mandai Wildlife Reserve, will be made permanent from July 1.\nThis means that passengers taking a taxi from Changi Airport, Changi Airfreight Centre, Airport Police Station and the Airport Logistics Park of Singapore will continue to pay an additional $8 between 5pm and 11.59pm, or an additional $6 during other times.\nFor taxi rides starting from the Singapore Zoo, Night Safari, River Wonders and Bird Paradise, passengers will still pay a surcharge if they are picked up between 1pm and 11.59pm, and the cost has been increased to $5.\nCurrently, passengers pay a $3 surcharge for pickup at the Mandai Wildlife Reserve attractions during those hours.\nThe permanent fare hikes were announced on June 24 on Facebook by Singapore’s largest taxi operator, ComfortDelGro, and taxi firm Strides Premier. The other two taxi operators, Trans-Cab and Prime, announced the changes in notices published in the Business Times on June 24.\nIn response to queries, a ComfortDelGro spokesperson said taxi location surcharges are determined in consultation with premise owners, and taxi operators lodge the surcharges or changes with the Public Transport Council and the Land Transport Authority upon receiving the requests. “This mechanism aims to increase the supply of taxis at underserved areas by incentivising drivers,” the spokesperson added.\nThe Straits Times has contacted Changi Airport Group for comment.\nMandai Wildlife Group said the average waiting time for taxis at Mandai Wildlife Reserve remains at 30 to 60 minutes. This is even after the initial temporary $3 location surcharge was introduced in August 2022.\n“With the latest revision, we hope to encourage more taxi drivers to keep the Mandai Wildlife Reserve top of mind as a preferred pickup destination, and reduce waiting times for our guests,” said a spokeswoman.\n“There are no plans in the near future to further revise the surcharge rate,” she added, noting that there are other transport options for guests, including public bus service 138 to and from Springleaf MRT station and a $3 loop shuttle service that goes to Khatib station.\nIntroduced in May 2022, the increase in the location surcharge for taxi rides from Changi Airport came amid reluctance from cabbies to go to the airport to pick up passengers.\nThis was despite a revival in international air travel post-pandemic.\nBefore the fare hike, the surcharge was $5 on Fridays, Saturdays and Sundays from 5pm to 11.59pm, and $3 at other times.\nAt the time, taxi drivers said more money could be made in the Central Business District and at night, and with the high fuel costs then, they found no reason to go all the way to the airport, where they risked long periods of waiting with their taxi engines switched on.\nThe hope was that by raising the location surcharge by $3, it would attract more cabbies to go to Changi.\nInitially, the increase in the surcharge was supposed to last for only six weeks.\nHowever, this temporary hike was extended multiple times, with the latest extension slated to end on June 30.\nSeparately, on the ride-hailing front, a temporary fee introduced by Grab, Gojek and Tada in 2022 to help private-hire drivers cope with rising costs will remain in place for another six months until Dec 31.\nThis temporary “driver fee” was set to end on June 30, before the latest extension on June 24.\nGrab will continue to charge passengers a temporary fee of 50 cents per trip, which applies to all of its transportation services except the standard taxi service.\nSimilarly, Gojek will continue to impose a temporary fee of 50 cents for trips less than 10km, and 80 cents for trips 10km and above.\nFor Tada, the fee is 50 cents for rides with fares $18 and below, and 80 cents for rides that cost $18.10 and above.\nThe three ride-hailing platforms have said the money will go directly to drivers. In Grab and Gojek’s case, it will not be subject to commission. Tada does not charge a commission on fares.\nGrab said fuel costs remain high, and the fee will help drivers manage this.\nSimilarly, Gojek said the fee is part of its efforts to help drivers cope with the rising cost of living and higher operational costs.\n“We will monitor the situation closely and will continue to review the driver fee on an ongoing basis,” Gojek added.\nTada said easing inflation has not translated to a significant decrease in cost for drivers.\n“Pump prices remain at levels similar to when this fee was first implemented,” it added.\nFuel prices here reached new highs in 2022, with a litre of the most popular 95-octane petrol priced at around $3 in March that year, before going up to around $3.40 in late June.\nSince then, prices have eased, with a litre of 95-octane fuel now costing between $2.86 and $2.90.\nIn a joint statement on June 24, the Land Transport Authority (LTA) and Public Transport Council (PTC) said they do not intervene in the setting of taxi and ride-hail fares.\nThey said operators here must state and publish all fares clearly, including any additional charges, and operators must provide commuters with at least seven days’ notice before implementing any changes.\n“LTA and PTC will continue to monitor the industry to ensure that the licensed operators abide by these regulatory obligations,” they added.\nCorrection note: An earlier version of the story quoted a ComfortDelGro spokesperson as saying the location surcharges for taxis are imposed by the organisations managing those areas, and it is these organisations who have to inform LTA about any changes. The spokesperson has since clarified that the surcharges are determined in consultation with premise owners, and it is the taxi operators who lodge any surcharges or changes with the LTA and PTC.", "url": "https://www.straitstimes.com/singapore/transport/higher-surcharges-for-taxi-rides-from-changi-airport-mandai-attractions-to-be-made-permanent"}