{"authors": ["Rachel Au-Yong"], "date_download": "2024-10-12 13:29:50", "date_modify": "2024-10-12 13:29:50", "date_publish": "2018-02-19 15:36:58", "description": "Amid Singapore's strong position riding on a global upturn last year, Finance Minister Heng Swee Keat outlined in his Budget speech three major shifts in the coming decade: a greater economic emphasis on Asia, the emergence of new technologies and an ageing population. Read more at straitstimes.com.", "filename": "singapore_singapore-budget-2018-gearing-economy-up-for-greater-emphasis-on-asia-new-tech-ageing_1728739790.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/brightcove-thumbnails/8oBVp-AFWogkHPgw2dWtnpxKzTG-DxJPI0-0gK8hKEI.jpg?VersionId=..FaUcLD1veqUwIuATwIe.T0pL3VNTeE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-budget-2018-gearing-economy-up-for-greater-emphasis-on-asia-new-tech-ageing_1728739790.html", "title": "Singapore Budget 2018: Gearing economy up for greater emphasis on Asia, new tech, ageing population", "title_page": "Singapore Budget 2018: Gearing economy up for greater emphasis on Asia, new tech, ageing population | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Amid Singapore's strong position riding on a global upturn last year, Finance Minister Heng Swee Keat outlined in his Budget speech on Monday (Feb 19) three major shifts in the coming decade: a greater economic emphasis on Asia, the emergence of new technologies and an ageing population.\nBudget 2018 is meant to be a strategic and integrated plan to help Singapore prepare for these changes.\nGREATER EMPHASIS ON ASIA\nWith several advanced economies turning their attention inwards due to domestic pressures - such as Brexit in Britain and the United States' recent tax changes and review of trade pacts - Asia will play a larger role in global trade and investment flows, Mr Heng said.\nChina setting out a regional infrastructure bank for its bold plans under the Belt and Road initiative, and a rapidly growing middle-class population in Asean countries are just some of the significant opportunities for Singapore firms, Mr Heng added.\nBut he also warned about potential threats to the stability of the region, in the form of tensions in the Korean peninsula and the South China Sea, as well as terrorism concerns.\nNEW TECHNOLOGIES\nNew technologies, such as robotics and digital innovations, are reshaping the economy and jobs, Mr Heng said.\nSoon, firms will compete less on physical assets, but more on intangible ones such as intellectual property, data and user networks, said Mr Heng, adding that \"first-mover advantage and time to market will be key\".\nAGEING POPULATION\nWith an ageing population, there will be more spent on healthcare and other social expenditure, which, in turn, places greater demands on families and the Government, said Mr Heng.\nIt also means that the resident workforce will shrink, tightening the labour market and slowing economic growth further, unless people change the way they work to be more productive, and supplement the workforce with a calibrated inflow of foreigners, Mr Heng added.\nNoting that there are other forces that can also strain the social fabric, such as income inequality and social mobility, Mr Heng said the Government will continue to invest in education and skills upgrading, and promote sports, arts and volunteerism to build common interests and shared activities.\nThese three shifts will interact, to bring new opportunities - such as technology to help older workers stay productive - but also new challenges - such as the risk of cyber attacks and online radicalisation, said Mr Heng. But Singapore is in a good position to guard against such challenges and capture the opportunities, he added.\n- Extending the Wage Credit Scheme, which subsidises wage increases for Singaporean employees earning up to $4,000 monthly, for another three years, though this will taper off over the years.\n- Doubling the corporate tax rebate to 40 per cent of tax payable and capped at $15,000, up from $10,000 previously.\n- Leaving levy rates for foreign workers unchanged for all sectors.\n- Introducing the new Productive Solutions Grant, which will fund up to 70 per cent of qualifying costs for small and medium-sized enterprises seeking to adopt off-the-shelf technologies.\n- Setting up a new Infrastructure Office to bring together local and international firms to develop, finance and execute infrastructure projects, and enable local companies to tap opportunities in the region.\nBUILDING A SMART, GREEN AND LIVEABLE CITY\nThe authorities will continue to improve the living environment here by implementing Smart Nation initiatives, such as better adoption of e-payments, and developing next-generation grid architectures that can respond quickly and reliably to changes in energy demand and supply, said Mr Heng.\nBut one of the most pressing challenges is that of climate change, where Singapore is particularly vulnerable to rising sea levels.\nTo that end, the authorities are:\n- Implementing a carbon tax of $5 per tonne of greenhouse gas emissions for facilities producing 25,000 tonnes or more from 2019 to 2023, with plans to increase this to between $10 and $15 per tonne by 2030.\n- Providing an additional U-Save rebate of $20 a year for three years, to help HDB households cover the expected increase in electricity and gas expenses.\nFOSTERING A CARING AND COHESIVE SOCIETY\nMr Heng emphasised the need to have a united people with a common purpose, and said he will support individuals and families in preparing for the future and caring for one another, strengthen partnerships between the Government and the community to support the elderly and the needy, and encourage a spirit of giving.\nHere are some of the measures:\n- Extending the Proximity Housing Grant to singles who buy resale flats near their parents, and increasing the grant by 50 per cent for singles or families who buy resale flats to live in with their parents or married children.\n- Giving another year of service and conservancy charge rebates ranging from 1½ to 3½ months, depending on the size of the HDB flat.\n- Increasing foreign domestic worker levies, including raising the monthly levy for the first maid employed without a concession to $300 from the current $265 from April 1, 2019, to avoid an overdependence on such workers.\n- Consolidating social and health-related services for seniors by transferring similar functions currently under the Ministry of Social and Family Development to the Health Ministry.\nPLANNING FOR A FINANCIALLY SUSTAINABLE AND SECURE FUTURE\nWhile Singapore has enough resources to meet its spending needs till 2020, thanks to careful and prudent planning, Mr Heng warned that there will not be enough revenue to meet its growing needs in the next decade if the authorities do not take steps early.\nMore spending on healthcare, infrastructure, security and education can be expected, he said.\nFor Financial Year 2018, the ministries are expected to spend $80 billion, 8.3 per cent higher than in FY2017.\nOn the whole, the Government expects a slight overall budget deficit of $600 million, or 0.1 per cent of gross domestic product (GDP), Mr Heng said.\nTo strengthen the country's fiscal footing, the Government will:\n- Raise the top marginal buyers' stamp duty rate from 3 per cent to 4 per cent for residential properties worth more than $1 million.\n- Implement a 10 per cent increase in tobacco excise duties.\n- Further moderate the pace of ministries' budget growth by reducing their growth rate from 0.4 times of GDP growth to 0.3 times.\n- Save in preparation for \"lumpy\" infrastructure investments, such as through a new Rail Infrastructure Fund for major rail lines which will start with an injection of $5 billion.\n- Consider providing guarantees to long-term borrowing by statutory boards and government-owned companies for critical national infrastructure.\n- Raise the goods and services tax (GST) from 7 per cent to 9 per cent, some time between 2021 and 2025, to ensure there is enough for every generation to pay its share of social spending such as healthcare and security.\n- Introduce GST on imported services such as consultancy and marketing, and digital goods such as apps and music, from Jan 1, 2020.", "url": "https://www.straitstimes.com/singapore/singapore-budget-2018-gearing-economy-up-for-greater-emphasis-on-asia-new-tech-ageing"}