{"authors": [], "date_download": "2024-10-12 13:58:05", "date_modify": "2024-10-12 13:58:05", "date_publish": "2024-06-10 20:01:43", "description": "Those interested in the Sept 12 event may register for such seats with their respective parishes. Read more at straitstimes.com.", "filename": "singapore_pope-francis-visit-elderly-wheelchair-users-attending-papal-mass-can-apply-for-special-tickets_1728741485.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/10/LYNXMPEK540QM-2.jpg?VersionId=TEFDhi3c8FDA3WcCVe2uSNexhdqtg.4V", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_pope-francis-visit-elderly-wheelchair-users-attending-papal-mass-can-apply-for-special-tickets_1728741485.html", "title": "Pope Francis visit: Elderly folk, wheelchair users attending papal mass can apply for special tickets", "title_page": "Pope Francis visit: Elderly folk, wheelchair users attending papal mass can apply for special tickets | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Elderly folk and wheelchair users planning to attend Pope Francis’ first mass in Singapore on Sept 12 will be able to make special ticketing arrangements by registering with their parish.\nThe Archdiocese of Singapore, in a notice on the website dedicated to the event, said each parish has been allocated a limited number of seats for both the elderly and wheelchair users with a valid Person-with-Disability (PWD) card.\nThose who do not have a PWD card can still register for the tickets by providing relevant documentation, such as a certificate from a medical practitioner confirming their disabilities.\nOne caregiver is also allowed to accompany each ticket holder.\nCaregivers must be able to provide necessary care, such as manoeuvring the wheelchair when it is necessary, and they should also be with their charges at all times.\nParishes will make the final decision on who receives the allocated seats, the archdiocese said.\nThe archdiocese added that the age limit for the elderly – defined by the parishes – is usually 85 and above.\nElderly participants should be able-bodied and mobile enough to move without constant assistance, it said.\nAll issued tickets are named and are not transferable.\nShould there be a change in the registered caregiver due to illness or emergency, ticket holders can notify their parish-in-charge of the change and provide the replacement caregiver’s particulars.\nThe archdiocese said the papal mass programme can last about six hours.\n“Please consider this when registering, especially regarding any medical needs for such a duration,” it said, adding that all attendees are requested to remain seated during the duration of the mass.\n“Anyone who leaves the papal mass venue after the Pope’s arrival will be considered to have left the venue and will not be allowed back into the mass area.”\nSuccessful applicants will not need to participate in the open public balloting system for tickets.\nChartered buses will be available for all participating elderly folk and their caregivers, which will take them from the parishes to the mass venue and back.\nHowever, wheelchair users and their caregivers will need to arrange their own transport to the venue.\nThey will be directly informed on accessible entrances, drop-offs and parking.", "url": "https://www.straitstimes.com/singapore/pope-francis-visit-elderly-wheelchair-users-attending-papal-mass-can-apply-for-special-tickets"}