{"authors": ["Isabelle Liew"], "date_download": "2024-10-12 13:29:21", "date_modify": "2024-10-12 13:29:21", "date_publish": "2023-06-28 10:37:00", "description": "ABSD is not payable for tenancy agreements, Iras said. Read more at straitstimes.com.", "filename": "singapore_iras-warns-of-scam-e-mails-claiming-absd-from-tenants_1728739761.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/28/imgonline-com-ua-FrameBlurred-w3T2OOZBsNG_4.jpg?VersionId=jFOFKRI1eTJwG8oBFkk8mI_emVnUPPRg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_iras-warns-of-scam-e-mails-claiming-absd-from-tenants_1728739761.html", "title": "Iras warns of scam e-mails seeking payment for ABSD from tenants", "title_page": "Iras warns of scam e-mails seeking payment for ABSD from tenants | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Inland Revenue Authority of Singapore (Iras) has warned of fraudulent e-mails purportedly from the Monetary Authority of Singapore that seek payment for additional buyer’s stamp duty (ABSD) from tenants.\nThe e-mails, which have a fake certificate of stamp duty attached, claim that the recipient’s endorsement has to be “validated” as payment for ABSD is outstanding, Iras said in an advisory on its website on Tuesday.\nThe fake certificate states that the tenant owes $4,536 in stamp duty based on a rate of 4 per cent of a 36-month tenure. It claims that the ABSD will be refunded when the tenant’s lease expires.\nIt also includes a website address for the tenant to check whether the stamp certificate is genuine. As at Wednesday, the website could not be accessed.\nIras said ABSD is not payable for tenancy agreements.\nThe tax authority advised the public to ignore the e-mails and not provide any personal, credit card or bank account details, make payments or follow any instructions in the e-mails. It also urged the public to verify the authenticity of stamp certificates on the Iras website.\nThose who have fallen for the scam are advised to make a police report.\nIras said that liable buyers of residential properties are required to pay ABSD on top of the buyer’s stamp duty. In April, the Government raised ABSD rates in a move to cool the property market.\nSingapore citizens buying their second residential property are subject to a rate of 20 per cent of the purchase price, and it is 30 per cent of the purchase price for those buying their third or subsequent property. First-time buyers do not pay ABSD.\nFor Singapore permanent residents buying their first residential property, the ABSD is 5 per cent. It is 30 per cent for their second property and 35 per cent for their third or subsequent property.", "url": "https://www.straitstimes.com/singapore/iras-warns-of-scam-e-mails-claiming-absd-from-tenants"}