{"authors": ["Joyce ZK Lim"], "date_download": "2024-10-12 13:32:20", "date_modify": "2024-10-12 13:32:20", "date_publish": "2023-11-27 22:09:14", "description": "He says at event recognising Home Team that officers also face challenges including scams and online criminal harms. Read more at straitstimes.com.", "filename": "singapore_increase-in-anti-s-pore-sentiments-on-social-media-calls-for-rocket-and-bomb-attacks-shanmugam_1728739940.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/27/2023112799598975img6537.jpg?h=a3ac3c1e", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_increase-in-anti-s-pore-sentiments-on-social-media-calls-for-rocket-and-bomb-attacks-shanmugam_1728739940.html", "title": "Increase in anti-S’pore sentiments on social media; calls for rocket and bomb attacks: Shanmugam", "title_page": "Increase in anti-S’pore sentiments on social media; calls for rocket and bomb attacks: Shanmugam | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - There has been a noticeable increase in anti-Singapore sentiments on social media from around the region since the Oct 7 attack by Hamas in Israel and the retaliatory military action by Israel in Gaza.\nHome Affairs and Law Minister K. Shanmugam said on Nov 27 that the comments have come from those who see Singapore as being pro-West or pro-Israel.\n“Some have said that Singapore is Tanah Melayu, on Malay Lands – as a parallel, they say, to Israel being on Palestinian land. There have also been calls online for Singapore to be targeted using ‘rockets’ and ‘bombs’,” said Mr Shanmugam, who was speaking at a National Day Awards event to recognise Home Team officers.\nHe said global terrorist groups such as Al-Qaeda and the Islamic State in Iraq and Syria, as well as their supporters, have also used the current conflict to renew their calls for attacks.\n“The threat is there, and it has gotten higher,” he added.\nThe war started on Oct 7, when Hamas militants killed 1,200 people, mostly civilians, and took 240 hostages. The Israeli strikes in Gaza have killed more than 12,000 people, including 5,000 children.\nA temporary ceasefire took hold in the Gaza Strip on Nov 24 after 48 days of conflict, but both sides have said the war is not over.\nMr Shanmugam noted that the attack by Hamas involved a high level of tactical planning and coordination, but was done with relatively low-tech equipment and weapons.\nIt caught Israel, a high-tech society, completely by surprise, he said, adding that from a security perspective, there are lessons to learn.\n“An attack, like what happened to Israel, could happen anywhere, including here, and there will be people who will be encouraged to do copycat attacks,” said the minister.\nHe said Singaporeans can and should sympathise with the civilians who are suffering, call for and pray for an end to the violence, and contribute to trusted humanitarian drives.\n“But we have to be careful not to let what is happening in the Middle East undermine the peace and harmony we have in Singapore,” he said, adding that there are reports of both Islamophobia and anti-Semitism increasing in many countries.\nThe minister noted that most Singaporeans see Singapore’s religious diversity as something that makes the country a better place to live in. This has to be protected, he said.\nGrowing up in such an environment takes its toll, he said. He recalls arresting a teenage boy for drug-taking; the boy’s father had also been a drug abuser, and was rarely at home.\nTwo years later, he chanced upon the boy, who had been arrested for an unrelated offence, again.\nThe teen, who had previously told ASP Liang that he was impervious to addiction, then admitted that he had gone down his father’s drug-taking path.\n“I told him that it’s never too late to change, and to use this chance to get back on his feet,” ASP Liang recalled, hoping that the teen had taken his advice to heart.\nToday, the 18-year veteran is in charge of CNB’s training curriculum, using his experiences on the ground to train officers to perform their duties safely and effectively.\nHe was one of 896 award recipients honoured at the annual Ministry of Home Affairs event.\nAnother award recipient was Assistant Superintendent of Prisons Ponnarasi Gopal Chandra.\nThe 40-year-old is a team leader at work release centre Institution S2, which helps offenders reintegrate into society towards the end of their sentences.\nThe process is not always smooth sailing. Once, an offender under her charge absconded from a halfway house for five days, fearing that his debtors would track him down.\nASP Ponnarasi spoke with him on the phone daily, and got him to confide his problems. He was stressed about his elderly and sick parents, and had issues with his girlfriend.\nShe told him that running away was not a solution, and that channels existed for his parents to receive assistance. She also enlisted his parents’ help to convince him to return. He finally did, and she welcomed him back via video call.\nThe 20-year veteran of the prison service says she sometimes receives updates from her former charges, telling her that they are doing well.\n“This kind of thing keeps me going,” she said.\nStation Inspector (SI) S. Santha Ponnusamy, 47, was also recognised for her 25 years of service with the Singapore Police Force.\nThe community policing officer at the Ang Mo Kio North Neighbourhood Police Centre has followed up on numerous 999 calls over her career.\nOne memorable case was of a 16-year-old girl who had posted on social media her intention to commit suicide. Alerted to the situation by the girl’s friend, SI Santha called the girl to calm her down, while sending help her way.\nInitially reticent, the girl then opened up to SI Santha – a motherly voice who had a son of the same age. The girl disclosed that she was stressed because of her studies, had nobody to open up to, and had swallowed about 20 pills.\nSI Santha talked the girl into informing her parents of the situation, and stayed on the line until the police and an ambulance arrived at the girl’s home. “I felt relieved afterwards,” she said.\nAsked what drives her, she said: “The thrill of receiving reports of incidents on the ground, and helping to manage these, keeps me going.”", "url": "https://www.straitstimes.com/singapore/increase-in-anti-s-pore-sentiments-on-social-media-calls-for-rocket-and-bomb-attacks-shanmugam"}