{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 13:53:10", "date_modify": "2024-10-12 13:53:10", "date_publish": "2023-05-25 12:30:00", "description": "Youth panels will be set up in 2023, for youth to co-develop policy recommendations with the Government. Read more at straitstimes.com.", "filename": "singapore_youths-to-get-a-say-in-policy-making-with-2-3-panels-to-be-set-up-this-year_1728741190.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/27/des-smyouth001.jpg?VersionId=aSjuAUj.Sc9mJIcJEPfAimsildRnzVbH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_youths-to-get-a-say-in-policy-making-with-2-3-panels-to-be-set-up-this-year_1728741190.html", "title": "Young people to get a greater say in policymaking with 2-3 panels to be set up in 2023", "title_page": "Young people to get a greater say in policymaking with 2-3 panels to be set up in 2023 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Young people in Singapore will soon have a greater say in shaping policies here, particularly on issues that matter to them.\nMinister for Culture, Community and Youth (MCCY) Edwin Tong said on Wednesday that his ministry is looking to set up two to three youth panels in 2023, to co-develop policy recommendations with the Government.\nEach panel will comprise 20 to 30 young people, who will work on a topic or issue that resonates with the youth of today. Young people can suggest such topics, and MCCY will announce in the next two or three months the policy issues that these panels will look at.\nAddressing an audience of over 90 young people at the National Youth Dialogue, Mr Tong said: “As part of Forward SG, we want to provide more opportunities for youth to be involved in this policy co-creation. So that you can have a direct stake and have a direct say, in shaping the future of our nation.\n“And in doing so, I would like all of you to also be able to appreciate the complexities and the trade-offs of our policies.”\nHe first announced the panels for young people aged 15 to 35 in April, during the debate on the President’s Address.\nThe panels are aimed at helping young people better understand policymaking, provide them with opportunities to engage diverse stakeholders on policy issues, and support them in submitting their recommendations to the Government, possibly leading to a response in Parliament, where appropriate.\nSeveral youth participants at the dialogue, which was held at the National Gallery, said they were treated as naive, or not taken seriously, when they presented their ideas at previous government dialogues. They wanted a safe space to share their ideas.\nOne of the panellists, sustainability consultant Woo Qiyun, said: “How many people write to their MPs? How many people write to ministers to participate in some of these (dialogues)? And I’ve some friends who say... I care about this issue, but I don’t know enough.”\nShe stressed that young people should have their ideas taken seriously, and be able to feel that their suggestions are valued.\nAnother panellist, Institute of Policy Studies senior research fellow Carol Soon, said it is crucial to create a space where people will not be “cancelled” or ostracised for sharing ideas that are not in the mainstream.\nSinda Youth Club chairman Yuvan Mohan, who attended the dialogue, said: “It’s important to bring together not just like-minded people but also people who disagree, to learn how to disagree.”\nBoth the Government and the young can benefit from sharing their perspectives through the panels, said Mr Tong. Young people will feel more invested in the process, while the government agencies will be able to share with them the challenges they see, including on budget, manpower and sustainability, as well as how different groups of people and future generations will be affected by a policy.\n“No policy will simply affect one stakeholder group to the exclusion of others, which is why it is important for policymakers to understand the interests of diverse stakeholders,” he said.\nHe noted that cost of living, and jobs and the economy remain high on the list of concerns for young people. Other top-line issues include inclusivity, the role of technology, and environmental sustainability.", "url": "https://www.straitstimes.com/singapore/youths-to-get-a-say-in-policy-making-with-2-3-panels-to-be-set-up-this-year"}