{"authors": ["Samuel Devaraj"], "date_download": "2024-10-12 13:59:26", "date_modify": "2024-10-12 13:59:26", "date_publish": "2022-10-09 15:07:44", "description": "Vaccination-differentiated measures will be fully lifted on Monday. Read more at straitstimes.com.", "filename": "singapore_health_spore-ready-to-step-up-covid-19-measures-if-needed-as-vds-restrictions-are-lifted_1728741566.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/09/sv_maskwearing_091022.jpg?VersionId=NFZy9crEWPRx7Ke7Eo6XDBPmASw8pSqU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_spore-ready-to-step-up-covid-19-measures-if-needed-as-vds-restrictions-are-lifted_1728741566.html", "title": "Those above 50 urged to keep up with vaccine shots as vaccination-differentiated measures are lifted", "title_page": "Those above 50 urged to keep up with vaccine shots as vaccination-differentiated measures are lifted | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - As Singapore prepares to remove Covid-19 restrictions for those who are not fully vaccinated, Health Minister Ong Ye Kung on Sunday appealed to people above 50 to keep up to date with their Covid-19 vaccine shots.\nMr Ong was responding to a question on whether there was any concern that the full lifting of the vaccination-differentiated measures (VDS) on Monday would result in those above 50 not getting their fourth booster shot.\nSpeaking to the media at a Sembawang Community Club event, he said he does not think that it is in their consideration given that VDS is currently not extensive before making his appeal to people in that age bracket.\n“When you are fully vaccinated and up to date, your chances of being infected and leading to a very bad outcome is much lower, much lower. Do it to protect yourself and don’t listen too much to the rumours circulating outside,” he added.\nMr Ong, an MP for Sembawang GRC, said some seniors had asked him about rumours regarding serious reactions caused by vaccines when he spoke to residents at the Sembawang Central Community Garden Gala - One Community Fiesta event.\nMore than 250 residents attended the event organised by Sembawang Central Grassroots Organisations and the People’s Association Integration Council.\nMr Ong also said Singapore is ready to step up Covid-19 measures when necessary to lower infection rates and protect the unvaccinated.\nHe added that while such restrictions as the VDS, which was aimed at protecting the unvaccinated in crowded areas, had pushed many to get vaccinated, it is better to step down the VDS as it is now not as extensive.\n“Today VDS is very light and in restaurants is pretty much an honesty system with random sporadic enforcement,” said Mr Ong.\n\"It's not that VDS doesn't work. In its current form, which is light, I think it doesn't work as well. So we might as well step it down with the understanding that we can step up to an appropriate level when we really need it.\"\nThe Ministry of Health (MOH) announced on Oct 7 that VDS will no longer be required for events with more than 500 participants, nightlife establishments where there is dancing, and dining at food and beverage establishments, including hawker centres.\nMr Ong said: “Come December, we don’t know what kind of variant will come up or what kind of variant will arrive in Singapore. If it’s something dangerous, we don’t want to be caught off guard.\n“So now, while we have the time and the space, get ourselves properly vaccinated with the bivalent vaccines. It is the best protection for us for whatever may come in December.”\nThe use of the bivalent vaccine to replace the current formulation has been recommended by the Expert Committee on Covid-19 Vaccination, MOH said on Oct 7.\nThe ministry added that it will replace the original Moderna/Spikevax vaccine with the updated bivalent version from Oct 17, and this will be for all adults aged 18 and above.\nMr Ong also said the Government has been transparent about the reactions caused by vaccines, with the Health Sciences Authority (HSA) publishing the severe adverse reaction incidents every three months.\nHe added that such cases mostly recover by themselves and that while there are risks to every type of vaccination, this has to be weighed against the cost of remaining unvaccinated.", "url": "https://www.straitstimes.com/singapore/health/spore-ready-to-step-up-covid-19-measures-if-needed-as-vds-restrictions-are-lifted"}