{"authors": ["Zhaki Abdullah"], "date_download": "2024-10-12 14:01:04", "date_modify": "2024-10-12 14:01:04", "date_publish": "2024-01-08 23:05:00", "description": "New model aims to provide more options for S'poreans seeking care in private healthcare sector: MOH. Read more at straitstimes.com.", "filename": "singapore_health_new-not-for-profit-acute-hospital-model-to-be-introduced-in-singapore_1728741664.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/08/adhy-savala-zbpgmGe27p8-unsplash.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_new-not-for-profit-acute-hospital-model-to-be-introduced-in-singapore_1728741664.html", "title": "New not-for-profit acute hospital model to be introduced in Singapore", "title_page": "New not-for-profit acute hospital model to be introduced in Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Ministry of Health (MOH) intends to introduce a new not-for-profit private acute hospital model, with private healthcare operators here invited to participate in an industry consultation for such a model.\n“The new not-for-profit private acute hospital model is meant to provide more options for Singaporeans who wish to seek care in the private healthcare sector,” MOH said in a media statement on Jan 8.\nIt pointed to a need to increase Singapore’s acute hospital bed capacity in both the public and private healthcare sectors, amid rising demand for healthcare services due to the country’s ageing population.\nUnder the new model, profits are not distributed to shareholders and are instead reinvested in the hospital, or used for charitable and other not-for-profit activities.\nThe model also aims to provide patients with appropriate and affordable care – with an emphasis on cost-efficiency and value – as well as focus mainly on serving Singapore residents, in addition to providing some subsidised acute bed capacity.\n“Participants of the industry consultation will be invited to provide feedback on the proposed acute hospital requirements and suggest ideas on how the key objectives for the new hospital model can be achieved,” MOH said, adding that more details will be provided to participants upon successful registration.\nThe consultation will be held from January to April, with registration closing on Jan 21. Interested private healthcare operators can register their interest at go.gov.sg/ptehospconsult\nMOH data shows that demand for hospital beds here remains high, with the daily occupancy rate at public hospitals ranging between 72.5 per cent and 100 per cent in the last week of December.\nAs at 2022, Singapore had 19 acute hospitals – which focus on treatment and surgery – of which 10 are public and nine private.\nMount Alvernia Hospital is currently Singapore’s only private not-for-profit acute hospital. Its annual surplus goes towards developing and upgrading the hospital, supporting the Assisi Hospice as well as its community outreach activities.\nPublic health specialist Jeremy Lim noted that Mount Alvernia Hospital has been successful in not only bringing additional capacity into the healthcare system, but also introducing elements such as pastoral care into healthcare.\nThe 62-year-old hospital would be a useful reference point for new initiatives, said Associate Professor Lim, author of the 2013 book Myth Or Magic: The Singapore Healthcare System.\nHe added that a new hospital operating under such a system could provide a springboard to launch novel business models.\nHowever, the terms provided by MOH for the new model could be challenging for private healthcare operators, said Prof Lim.\nLarger not-for-profit providers here could step forward to operate an acute hospital, he suggested.\nBeyond an increase in hospital bed capacity, the implications for patients will depend on factors such as the financing of such a model and the nature of the operator, he added.\nNoting that the state focus on factors such as cost-efficiency suggests MOH is “acutely aware” of the potential pitfalls associated with such a model, Prof Lim said the ministry will have to design, implement and monitor the programme very carefully.\n“Mount Alvernia wanting to operate a second not-for-profit hospital would be very different from Raffles Medical trying to set up a not-for-profit model within a for-profit entity.”", "url": "https://www.straitstimes.com/singapore/health/new-not-for-profit-acute-hospital-model-to-be-introduced-in-singapore"}