{"authors": ["Sherlyn Sim"], "date_download": "2024-10-12 13:58:10", "date_modify": "2024-10-12 13:58:10", "date_publish": "2023-11-27 19:55:00", "description": "No injuries were reported during the incident. Read more at straitstimes.com.", "filename": "singapore_carpark-at-botanic-gardens-closed-after-car-catches-fire-no-injuries-reported_1728741490.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/27/photo1701068403.jpeg?h=a490f381", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_carpark-at-botanic-gardens-closed-after-car-catches-fire-no-injuries-reported_1728741490.html", "title": "Botanic Gardens carpark reopens 2 days after being closed due to a car fire", "title_page": "Botanic Gardens carpark reopens 2 days after being closed due to a car fire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A carpark at the Singapore Botanic Gardens has reopened, two days after a car caught fire at its entrance on the afternoon of Nov 27.\nThe Gardens announced on its website that the carpark at the Botany Centre’s Tanglin Entrance, which had been closed for safety reasons, resumed operations at 5am on Nov 29. It thanked the public for their patience as it carried out repairs.\nWhen contacted on the day of the fire, the Singapore Civil Defence Force (SCDF) said it had been alerted to the incident near 1 Cluny Road at about 2.15pm. No injuries were reported.\nThe fire was extinguished by SCDF officers using a water jet and a compressed air foam jet.\nThe cause of the fire is under investigation, it added.\nDr Tan Puay Yok, group director of the Gardens, had said the entrance to the Botany Centre carpark would be reopened once it was safe to do so. Vehicles that had been parked there on the day of the fire were still able to exit.", "url": "https://www.straitstimes.com/singapore/carpark-at-botanic-gardens-closed-after-car-catches-fire-no-injuries-reported"}