{"authors": ["Lee Nian Tjoe"], "date_download": "2024-10-12 14:17:31", "date_modify": "2024-10-12 14:17:31", "date_publish": "2023-09-29 17:59:28", "description": "The reallocation is to meet anticipated demand from car buyers following changes to the VES. Read more at straitstimes.com.", "filename": "singapore_transport_lta-reallocates-300-more-coes-for-smaller-cars-in-oct-to-meet-anticipated-demand_1728742651.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/29/yuntcoe2909.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_lta-reallocates-300-more-coes-for-smaller-cars-in-oct-to-meet-anticipated-demand_1728742651.html", "title": "LTA reallocates 300 more COEs in Oct to meet anticipated demand for smaller cars", "title_page": "LTA reallocates 300 more COEs in Oct to meet anticipated demand for smaller cars | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The number of certificates of entitlement (COEs) for smaller cars will be increased by 300 in October, spread across the two tender exercises.\nThis means that there will be 780 such COEs available at the next two tenders, a 23.8 per cent increase from the average of 630 COEs for cars with engines up to 1,600cc and 130bhp, as well as electric vehicles (EVs) up to 110 kilowatts, seen in the exercises held between August and September.\nAnnouncing the move on Friday, the Land Transport Authority (LTA) said the reallocation was made to “meet anticipated demand from car buyers following the September announcement of changes to the Vehicular Emissions Scheme (VES)”.\nOn Sept 22, LTA announced that the incentives given out under VES would be revised from Jan 1, 2024. Cars that fall under Band A2 will get $5,000 in rebates instead of the current $15,000.\nThis banding applies to most hybrid cars as well as some high-powered EVs. The $10,000 reduction in incentives means that such vehicles will be harder to sell after the switchover.\nObservers expect that motor dealers with affected models will try to sell these cars within 2023 rather than risk being stuck with them in the new year. This, in turn, would push up demand for COEs during this period.\nThe move to reallocate more COEs for smaller and less powerful cars and EVs also comes at a time when the price of such COEs is at a record high. At the most recent tender exercise that closed on Sept 20, premiums climbed to $105,000.\nThe COE supply is determined on a three-month basis, with the number of deregistrations in the previous period being the main determinant of the supply.\nIn May, LTA said it will be gradually reallocating a total of 6,000 COEs from cars with five-year non-extendable COEs that would have to be deregistered in the future over several quarters, to “reduce the volatility of supply in COE quota” for the two categories of car COEs.\nFor the current quota period from August to October, LTA had brought forward 700 COEs and boosted the supply of COEs for smaller and less powerful cars and EVs. The category for larger and more powerful cars and EVs also received a reallocation of 325 COEs for the period.\nLarger car COEs are not affected by the latest announcement.\nDealers had mixed views on how the move would impact the market.\nKomoco Motors commercial director Ng Choon Wee said it will probably not temper demand for small car COEs,, given how strong bidding went in the previous few tenders.\nOver the past four tender exercises between August and September, there were more than 260 unsuccessful bids at each round on average, compared with about 200 at tenders held between June and July. This reflects stronger demand for cars than previously.\n“I expect demand to continue as buyers may rush in to enjoy the current rebate of $15,000 for cars banded in A2 under VES,” Mr Ng added.\nMr Neo Nam Heng, chairman of diversified motor group Prime, does not expect the latest increase to have a significant impact on bringing down premiums, as the overall supply is still too small to meet demand.\n“We will have to monitor the effect of this move as well as look at what the quota will be like in the next three months,” he said.\nMr Vincent Tan, founder of multi-brand dealership Vincar, was more sanguine.\n“Whatever extra COEs will help us better transit into the new VES. We also look forward to more COEs to be injected into the next quota from November,” he said, noting that additional COEs for larger cars would help address the issue of soaring COE premiums.\nMr Anthony Teo, managing director of Vantage Automotive which represents BYD and Peugeot, said the bump in small car COEs will help ease the pressure for dealers who are rushing to clear their stock of cars within 2023.\nThe next three-month quota period starts in November.\nIndustry watchers said that in addition to the effect of the VES announcement, many dealers would also be rushing to hit their annual sales targets. This is expected to keep the COE premium in both car categories high for the rest of 2023.", "url": "https://www.straitstimes.com/singapore/transport/lta-reallocates-300-more-coes-for-smaller-cars-in-oct-to-meet-anticipated-demand"}