{"authors": ["Sarah Koh"], "date_download": "2024-10-12 13:32:42", "date_modify": "2024-10-12 13:32:42", "date_publish": "2024-07-17 18:40:00", "description": "The affected area was deep cleaned and sanitised, a spokeswoman for Far East Organization said. Read more at straitstimes.com.", "filename": "singapore_sfa-investigating-after-rat-found-on-table-at-orchard-central-don-don-donki_1728739962.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/17/01a.jpg?VersionId=FQukWiVfdU7IvX5zcYCj2cu6yUOvT9sw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_sfa-investigating-after-rat-found-on-table-at-orchard-central-don-don-donki_1728739962.html", "title": "SFA investigating after rat found on table at Orchard Central Don Don Donki", "title_page": "SFA investigating after rat found on table at Orchard Central Don Don Donki | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Singapore Food Agency (SFA) is investigating after a rat was seen on a table at Don Don Donki at Orchard Central on the afternoon of July 14.\nEyewitness Fion Khoo told The Straits Times that she and her husband were strolling past the dining area of the Japanese grocery store at around 1.30pm when they noticed a group of people crowding around a table.\nThey walked towards the crowd and saw a rat sitting very still on top of the table.\n“A few people around us thought it was a toy at first,” the 40-year-old administration executive said. “I felt slightly disgusted looking at it, since it’s on a table meant for eating at.”\nShe proceeded to inform employees of the store about the rat, before leaving the scene.\n“When we passed by again around 30 minutes later, there were customers dining at the table,” Ms Khoo said.\nIn response to queries from ST, the director of retail business group at Far East Organization, Ms Deborah Tan, said the mall was notified by employees on duty about the rat in a tenanted area at Basement 2 at around 2.20pm on July 14.\n“Action was taken immediately to ensure the affected area was deep cleaned and sanitised,” Ms Tan said.\n“We will continue to work closely with all tenants in the mall to reinforce the importance of concerted effort and regular pest control.”\nFar East Organization did not confirm if the rat was caught or if it ran away. ST has contacted Don Don Donki for more information.\nSFA told ST on July 17 that it is looking into the matter.\nThe agency said that while it puts in place and enforces regulatory measures, food operators must also adhere to good food hygiene and preparation practices and ensure that its premises are clean and well maintained.\nAnyone who comes across potentially errant food operators should report it via SFA’s online feedback form, the agency said.", "url": "https://www.straitstimes.com/singapore/sfa-investigating-after-rat-found-on-table-at-orchard-central-don-don-donki"}