{"authors": ["Samuel Devaraj"], "date_download": "2024-10-12 13:31:54", "date_modify": "2024-10-12 13:31:54", "date_publish": "2024-01-30 14:01:00", "description": "Denmark topped the overall 2023 index, followed by Finland, New Zealand and Norway. Read more at straitstimes.com.", "filename": "singapore_courts-crime_global-anti-graft-watchdog-places-singapore-as-5th-least-corrupt-country-in-world-index_1728739914.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/30/aiindex300124.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_global-anti-graft-watchdog-places-singapore-as-5th-least-corrupt-country-in-world-index_1728739914.html", "title": "Global anti-graft watchdog places Singapore as 5th least corrupt country in world index", "title_page": "Global anti-graft watchdog places Singapore as 5th least corrupt country in world index | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Global anti-graft watchdog Transparency International has ranked Singapore as the fifth least corrupt country in the world, with a score that also places the Republic as the least corrupt nation in Asia.\nSingapore scored 83 out of a possible 100 on the group’s 2023 Corruption Perceptions Index (CPI), on a scale with zero for highly corrupt and 100 for very clean.\nThe Republic achieved the same result and rank in 2022.\nThe highest score it recorded was 87 in 2012, when the metric was revamped by Transparency International.\nThe CPI surveys experts and business people, and scores 180 countries and territories on a scale of 0 to 100 by their perceived levels of public-sector corruption.\nDenmark, with a score of 90, topped the overall 2023 index, maintaining its position for the sixth consecutive year, and was followed by Finland (87), New Zealand (85) and Norway (84).\nTransparency International, which released its report on Jan 30, said two in three jurisdictions scored below 50 in 2023.\nIt noted that scores had improved in only 28 jurisdictions, and worsened in 34 countries and territories, despite progress in criminalising corruption and establishing specialised anti-corruption institutions around the world.\n“This limited progress is hardly surprising, considering the chronic weaknesses of justice systems meant to detect, investigate, prosecute and adjudicate corruption cases,” said the anti-graft organisation.\nThe top-scoring region was Western Europe and the European Union, but Transparency International noted that its average score – 65 out of 100 – had dropped for the first time in a decade.\nAmong the 31 countries assessed in the region, only six had improved scores, while eight showed declines.\nSeveral high-ranking democracies, including Sweden (82), the Netherlands (79), Iceland (72) and Britain (71), recorded their lowest scores in the index, with Britain experiencing an overall six-point decrease over the past five years.\nTransparency International said the region’s “robust anti-corruption measures continue to be undermined by the weakening of checks and balances”, and that the “erosion of political integrity contributes to diminishing public trust in countries’ ability to tackle the region’s ongoing challenges”.\nThe top five territories in the Asia-Pacific region were New Zealand, Singapore, Australia (75), Hong Kong (75) and Japan (73).\nTransparency International said the latest index reveals another year of little to no meaningful progress towards curbing corruption in the Asia-Pacific region.\n“For five years in a row, the average CPI score for the region stagnates stubbornly at 45 out of a possible 100.\n“Very few countries show sustained turnarounds that indicate significant changes in corruption levels,” said the group of the Asia-Pacific.", "url": "https://www.straitstimes.com/singapore/courts-crime/global-anti-graft-watchdog-places-singapore-as-5th-least-corrupt-country-in-world-index"}