{"authors": ["Yong Li Xuan"], "date_download": "2024-10-12 13:49:28", "date_modify": "2024-10-12 13:49:28", "date_publish": "2024-02-07 16:33:00", "description": "Going into the New Year with debts is said to be inauspicious. Read more at straitstimes.com.", "filename": "singapore_better-not-do-the-laundry-chinese-new-year-practices-you-might-not-know-about_1728740968.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/07/yaohui-stpixdragon-6116.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_better-not-do-the-laundry-chinese-new-year-practices-you-might-not-know-about_1728740968.html", "title": "Better not do the laundry: Chinese New Year practices you might not know about", "title_page": "Better not do the laundry: Chinese New Year practices you might not know about | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "When sounds of crashing cymbals and lilting flutes play endlessly in malls and supermarkets, you know Chinese New Year is just around the corner.\nChinese Singaporeans are stocking up on mandarin oranges and packing hongbao as they prepare for the Year of the Dragon – part of many rituals for ringing in a new year.\nHere are some other festive practices and beliefs for the season that you might not know about.\n1. Depositing money on Li Chun\nThe term “Li Chun” translates to the start of spring. It is the first of 24 terms in the Chinese solar calendar.\nLi Chun falls on Feb 4 on most years, give or take a day or two, when the sun is at the celestial longitude of 315 deg.\nTraditionally, this is when Chinese farmers pray for a bountiful harvest year.\nThese days, snaking queues are seen at banks as people wait in line to deposit cash into their bank accounts on that day.\nMany believe that doing so will boost their wealth and bring them good luck. Some also wear the lucky colour red, or prepare amounts associated with prosperity like $88.\n2. Paying your debts before the start of Chinese New Year\nGoing into the new year with debts is said to be inauspicious.\nThis customary Chinese practice reflects a symbolic wish to start the year on a clean slate.\nThose who are superstitious believe that not closing your books before the start of the first day of Chinese New Year will cause you to be in debt all year long, or even for the rest of your life.\n3. Hide sharp objects and brooms\nFind another way to open that bag of chips, because sharp objects such as scissors, needles, nail clippers and knives are seen as ominous and inauspicious objects.\nThese objects are said to “cut away” good luck or cause fights.\nOther items that belong in the taboo closet include brooms – to avoid sweeping luck and wealth out the door.\n4. Avoid washing your clothes or your hair\nDo not do your laundry during the first two days of the Chinese New Year. According to folklore, these two days are said to be the birthday of the god of water, who may get offended by a rinse and spin.\nThere are also those who go as far as to avoid washing their hair on the first day.\nThe Chinese words for “hair” and “prosper” sound similar, so keep your tresses away from water to avoid washing away any good luck.\n5. Seven vegetables on the seventh day\nAccording to Chinese mythology, the female goddess Nu Wa created human beings on the seventh day of the creation of the world, which is why it is marked as the birthday of humankind in Chinese culture.\nKnown as “renri”, people celebrate the seventh day of the Chinese New Year by eating auspicious dishes, such as soup, congee or stir-fry, with seven vegetables.\nThe dishes tend to feature vegetables such as Chinese leek, Chinese celery, Chinese mustard greens, coriander, spring onion, napa cabbage, chives, chard and spinach.\nEach of these vegetables is packed with symbolism.\nFor example, the Chinese words for “spring onion” and “intellect” sound similar, so those who eat spring onions are blessed with intelligence and wit.\n6. Keeping vigil on Chinese New Year’s Eve\nMany children look forward to the eve of Chinese New Year because it is the one night they are encouraged to stay up late.\nIt is said that the longer children stay awake, the more long-lived their parents will be.\nAccording to Chinese folklore, villagers would keep a look out for a mythical beast on the night of the eve of the Spring Festival. This practice is still known as “shousui”.\nAfter the vigil comes the first day of Chinese New Year, when children receive blessings and red packets from their parents and elders.", "url": "https://www.straitstimes.com/singapore/better-not-do-the-laundry-chinese-new-year-practices-you-might-not-know-about"}