{"authors": ["Isabelle Liew"], "date_download": "2024-10-12 13:53:21", "date_modify": "2024-10-12 13:53:21", "date_publish": "2022-03-08 17:57:17", "description": "It aims to define a set of community norms to address noise concerns among residents. Read more at straitstimes.com.", "filename": "singapore_politics_budget-debate-panel-to-be-set-up-to-tackle-neighbourhood-noise-disputes_1728741201.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/08/wgt-ilnoise-080322.jpg?VersionId=BJ1pP.pbnO3EfCEh3ZNVxjoqzQjDXKS2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_budget-debate-panel-to-be-set-up-to-tackle-neighbourhood-noise-disputes_1728741201.html", "title": "Budget debate: Panel to be set up to tackle neighbourhood noise disputes", "title_page": "Budget debate: Panel to be set up to tackle neighbourhood noise disputes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A community advisory panel will be set up to tackle the thorny issue of neighbourhood noise disputes, and gather public feedback to establish what are unacceptable noise disturbances.\nAnnouncing the panel on Tuesday (March 8), Senior Minister of State for National Development Sim Ann said it aims to define a set of community norms to address noise concerns among residents.\n\"(The panel will) look at defining what is deemed as unacceptable noise disturbances, as well as what constitutes good civic norms that residents should observe to reduce noise disturbances to their neighbours,\" she said.\nThe Government will refer to these norms for its public advisories and when facilitating mediation at the Community Disputes Resolution Tribunal (CDRT).\nCommunity representatives who have the relevant experience and expertise in managing municipal issues will be part of the panel to be set up by the Municipal Services Office (MSO) and the Ministry of Culture, Community and Youth.\nThe Housing Board currently advises those having disputes with their neighbours to try and settle the matter privately before seeking mediation services through the Community Mediation Centre or CDRT.\nMr Baey Yam Keng (Tampines GRC) and Ms Cheryl Chan (East Coast GRC) raised this issue during the debate on the Ministry of National Development's spending plans.\nMr Lim Biow Chuan (Mountbatten) had also asked how to resolve noise disputes before it gets escalated to the CDRT.\nIn response, Ms Sim said the aim is for the panel to submit recommendations by the end of year.\nHDB has seen an uptick in feedback relating to noise from residents' activities, including renovation noise.\nSuch cases went up by about 25 per cent to 3,200 cases a month in 2021, compared with 2,500 cases a month in 2020. There were about 400 cases per month in 2019.\nThis is likely due to work-from-home arrangements, coupled with the resumption of renovation activity in June 2020, said National Development Minister Desmond Lee last month.\nMs Sim also told the House that the People's Association and HDB will be leading an Alliance for Action, under the Singapore Together movement, to study practical solutions to better facilitate group-buy activities in HDB estates.\nShe said such activities support small businesses and promote interaction among residents, but could lead to inconveniences such as cluttering of goods at the common corridor when large amounts of goods are delivered to an estate and redistributed to individual buyers.", "url": "https://www.straitstimes.com/singapore/politics/budget-debate-panel-to-be-set-up-to-tackle-neighbourhood-noise-disputes"}