{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:38:49", "date_modify": "2024-10-12 13:38:49", "date_publish": "2024-04-03 15:20:00", "description": "The Republic is building up its capabilities to understand and assess advanced nuclear energy tech. Read more at straitstimes.com.", "filename": "singapore_politics_no-plans-to-stockpile-uranium-but-use-of-nuclear-energy-in-s-pore-is-not-off-the-table-tan-see-leng_1728740329.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/03/2024-02-20T130255Z377805807RC2C66AOCSBNRTRMADP3URANIUM-TRADING.JPG?VersionId=WuTT7swseE5461rN.oC9ETQXEhtALDeI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_no-plans-to-stockpile-uranium-but-use-of-nuclear-energy-in-s-pore-is-not-off-the-table-tan-see-leng_1728740329.html", "title": "No plans to stockpile uranium, but use of nuclear energy in S’pore not off the table: Tan See Leng", "title_page": "No plans to stockpile uranium, but use of nuclear energy in S’pore not off the table: Tan See Leng | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore currently has no plans to stockpile uranium – a heavy metal used in nuclear energy generation – but it is building up its capabilities to understand and assess advanced nuclear energy technologies.\nSecond Minister for Trade and Industry Tan See Leng told Parliament on April 3 that any decision made by the Government to deploy nuclear energy will require “detailed studies of the safety, reliability, affordability, and environmental sustainability of nuclear energy in our local context”.\nHe was responding to a question from Workers’ Party MP Gerald Giam (Aljunied GRC) on whether Singapore has plans to stockpile uranium to secure energy sources ahead of other countries shifting towards nuclear energy; and what preparations are being made to prepare a core of local talent to enter this industry.\nUranium is a naturally occurring radioactive element that is a key fuel used in nuclear fission reactors to produce electricity. In 2023, 22 countries, including France, Britain and the United States, backed a pact to triple nuclear energy capacity by 2050, in a bid to cut carbon emissions to net zero by the same year.\nThere are two types of nuclear reactors. Most operational nuclear plants are based on fission technology, which works by using neutrons to split uranium atoms in two, releasing a large amount of energy in the form of heat and radiation.\nNuclear fusion technology, which is still nascent, involves the merging of two light nuclei to form a single heavier nucleus, producing energy in a way similar to how the sun produces light and heat.\nDr Tan said on April 3 that fusion technology is still “at least a decade away” from deployment in Singapore, as the net energy input needed for the fusion reaction to occur is “far more” than the amount of energy that can be harnessed from the reaction.\nBut small modular reactors based on fission technology could potentially suit Singapore’s needs, he added.\nConventional nuclear fission reactors typically require large buffer zones, which would be beyond Singapore’s radius. Small modular reactors are reactors with a lower power capacity that can be scaled up like Lego bricks.\nDr Tan said: “For nuclear fission, there are small modular reactors, also Generation IV thermal reactors, which potentially could suit our needs.”\nGeneration IV thermal reactors are known to use fuel more efficiently, producing more energy while minimising the production of nuclear waste, and are also considered to be safer.\n“We have teams studying those technologies very closely, very intently. But today... there isn’t a commercialised small nuclear modular reactor, or a (Generation) IV thermal reactor, for us to be able to learn from,” said Dr Tan, who is also Manpower Minister. “So we watch the space very closely in our broad approach. As I’ve said before, nothing is off the table. We continue to keep our options open to all kinds of low-carbon energy, including, of course, nuclear energy, both fission and fusion.”\nHe reiterated that Singapore has not yet made a decision on whether to go nuclear, but it is building up capabilities in this area by learning from international experts in the field and training new talent.\nFor instance, Singapore has sent people to the US to study a developmental fusion project using a smaller-scale tokamak reactor, and to understand how the technology is going to evolve.\nKnown as Sparc, a collaboration between the Massachusetts Institute of Technology’s Plasma Science and Fusion Centre and private fusion start-up Commonwealth Fusion Systems, the compact reactor is predicted to produce between 50MW and 100MW of fusion power.\nDr Tan said on April 3 that SNRSI, which was set up in 2014 to focus on research and capability development in nuclear safety, science and engineering, has already awarded 30 scholarships for postgraduate studies in areas related to nuclear science and engineering.\nSNRSI has also developed a pipeline of about 40 researchers specialising in radiobiology, radiochemistry and nuclear safety, with the goal of building a pool of about 100 experts in the medium to long term, said Dr Tan.\nSingapore is working to understand the safety profile of nuclear technology before making a decision on whether nuclear energy could be part of the country’s energy mix, he said.\nBut the Republic recognises that various aspects of nuclear energy – ranging from radiological safety to the understanding of operational capabilities and the engineering science behind it – are important and relevant to the country, he added.\n“Hence, we have not stopped training our local pipeline of talent, sending them overseas, attaching them to institutions all over, collaborating with them to learn and to adapt that expertise and imbibe the knowledge, so that at some point in time when we have finally made the decision we will then bring them back here,” Dr Tan said.", "url": "https://www.straitstimes.com/singapore/politics/no-plans-to-stockpile-uranium-but-use-of-nuclear-energy-in-s-pore-is-not-off-the-table-tan-see-leng"}