{"authors": ["Lim Min Zhang"], "date_download": "2024-10-12 13:31:04", "date_modify": "2024-10-12 13:31:04", "date_publish": "2021-06-11 05:00:00", "description": "Those with more than six months since their infection will get priority for a single-dose of the vaccine. Read more at straitstimes.com.", "filename": "singapore_recovered-covid-19-patients-to-get-one-vaccine-dose-to-boost-immunity-0_1728739864.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/06/11/nz_vax_110644.jpg?VersionId=vyYwPOewbiphUpCfBEfWpj.vO7FtS3EY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_recovered-covid-19-patients-to-get-one-vaccine-dose-to-boost-immunity-0_1728739864.html", "title": "Recovered Covid-19 patients to get one vaccine dose to boost immunity", "title_page": "Recovered Covid-19 patients to get one vaccine dose to boost immunity | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - People who have recovered from Covid-19 and with more than six months since their infection will get priority for a single-dose of the vaccine.\nThis is because they are likely to still have a strong immune response within the first six months of infection, the Ministry of Health said in a statement on Thursday (June 10).\nHealth Minister Ong Ye Kung said on Thursday that experts have recommended that those who have recovered should receive a single dose of vaccine to further boost their immunity against Covid-19.\nSuch recovered people will be able to register from today if they are part of a population group that is already eligible for vaccination.\nSingapore has recorded more than 62,200 Covid-19 cases as at Thursday, including more than 54,500 dormitory residents, and 34 have died from complications due to Covid-19 infection.\nSeveral studies have reportedly indicated that people who have had Covid-19 generate an extremely strong response to the first dose of an mRNA vaccine, with apparently little further boost from the second dose.\nA paper by the Cedars-Sinai hospital in Los Angeles in the United States published in April said that a single dose of the Pfizer-BioNTech vaccine for individuals who previously had Covid-19 generates an immunologic response similar to that of individuals receiving two doses.", "url": "https://www.straitstimes.com/singapore/recovered-covid-19-patients-to-get-one-vaccine-dose-to-boost-immunity-0"}