{"authors": ["Tham Yuen-C", "Wong Pei Ting"], "date_download": "2024-10-12 13:57:28", "date_modify": "2024-10-12 13:57:28", "date_publish": "2024-09-12 10:34:47", "description": "Cabinet ministers, MPs, government officials and members of the diplomatic corps were also present. Read more at straitstimes.com.", "filename": "singapore_pope-francis-calls-on-president-tharman-meets-pm-wong-after-ceremonial-welcome_1728741448.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/wgt-popefrancistharman-120924.jpg?VersionId=Q.OeShgeM5TvLc5WBDPpGJHzdexPGI.x", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_pope-francis-calls-on-president-tharman-meets-pm-wong-after-ceremonial-welcome_1728741448.html", "title": "Pope Francis calls on President Tharman, meets PM Wong after ceremonial welcome", "title_page": "Pope Francis calls on President Tharman, meets PM Wong after ceremonial welcome | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The visiting Pope Francis began his second day in Singapore with a ceremonial welcome held at Parliament House.\nA spell of rain at night had given way to clear skies and sunshine, and some people lined North Bridge Road to catch a glimpse of him.\nThe Pope waved at them through the windows of the Hyundai Ioniq 5 – a made-in-Singapore electric car – that he was being driven in as he arrived at his destination.\nThe ceremony was an indoor affair, held at the entrance hall of the home of Singapore’s Parliament.\nA ramp was added for the 87-year-old Argentinian, who first started using a wheelchair in public in 2022 due to knee problems.\nCeremonial guards standing at attention saluted him as he sat alongside President Tharman Shanmugaratnam at the landing of the sweeping granite staircases that lead to the chamber.\nBetween them, placed on a low table, was a large pot of white orchids named in the pontiff’s honour.\nDescribed by the National Parks Board as a new hybrid exuding “a serene and pure beauty”, the Dendrobium His Holiness Pope Francis has flowers about 8cm wide, with sepals and petals that are ivory white, and a lip with the barest tinge of pink.\nSigning the visitor’s book, the pontiff wrote in Italian a message that translates to: “Like the star that guided the Magi, so let the light of wisdom always guide Singapore in building a united society capable of conveying hope.”\nHe was referring to the Bible story about the Christmas Star of Bethlehem that guided the three wise men, or Magi, to the birth of Jesus Christ.\nCabinet ministers, MPs, government officials and members of the diplomatic corps were also present at the welcome ceremony.\nThe Pope, who is the head of state of Vatican City, later called on President Tharman, and also met Prime Minister Lawrence Wong.\nDuring the courtesy call and the meeting, the Pope discussed with Singapore’s leaders the importance of fostering interfaith harmony and protecting the environment against climate change.\nIn a Facebook post after the Pope’s courtesy call, President Tharman said both Singapore and the Vatican were committed to these causes.\nHe added that they discussed the importance of open minds and respect among people of different creeds and faiths as the basis for cohesive societies.\nMr Tharman said it was a joy to host Pope Francis on his first visit to Singapore, and that the pontiff has been a powerful and inspiring voice for peace and the shared humanity of all peoples.\n“I am confident that ties between Singapore and the Holy See, as friends and partners, will deepen in the years ahead.”\nIn a separate Facebook post, PM Wong said Singapore and the Vatican enjoy good people-to-people ties, with a history of engagement that dates back to the early 1800s, when the first Catholic mass was celebrated here.\n“Since then, Catholic institutions have contributed much to our society – in education, healthcare and across many social areas,” said PM Wong.\n“We are grateful for their many contributions in our multiracial and multi-religious society.”\nFollowing his official programme, Pope Francis also received Senior Minister Lee Hsien Loong for a private meeting in the afternoon.\nSM Lee said on Facebook that they had an insightful discussion on Singapore, and how it has kept its multicultural and multi-religious communities thriving.\n“Our multiracial, multi-religious society enables the major faiths here not just to live and worship together, but also to work together to build a more tolerant and resilient society,” he said.\n“I hope that the Pope’s visit has encouraged and inspired not only Catholics, but everyone who has heard his message of hope and moral fortitude.”\nIn the first three countries he visited during his 12-day tour, Pope Francis had met members of the clergy in cathedrals or churches.\nWhile this was not originally part of his Singapore itinerary, Cardinal William Goh, Archbishop of the Roman Catholic Archdiocese of Singapore, told The Straits Times on Sept 12 that such a meeting had been inserted into the programme for the morning of the Pope’s return to Rome.\nAt 8.30am on Sept 13, the Pope will meet about 150 bishops and priests from Singapore and the region. This will take place just before he visits a group of elderly and sick people at St Theresa’s Home, a Catholic welfare nursing home in Upper Thomson.\nCardinal Goh expressed his hope that the pontiff will inspire his audience to be more zealous and in line with his vision and mission, and also for them to encounter Christ through him.\n“We learn after him to be good shepherds,” he added.\nOn how the Pope’s visit might impact the wider Singapore society, Cardinal Goh said: “I think the Holy Father has come to bring the people closer together.”\nThe pontiff’s messages have always been for “all of humanity”, Cardinal Goh added, noting that he expects themes of interreligious harmony, respect for others, and care for the poor, suffering and marginalised to define the visit.\nAs for the faithful, Cardinal Goh said the Pope has come to be their shepherd, and that the Pope knows the realities in Singapore.\n“He knows, but coming here is to see the realities, that is even more important.”\nThe head of the world’s Catholics had arrived in Singapore a day earlier, to a welcome party that included about 1,000 Catholics who had a hand in organising his visit.\nLining the Jurassic Mile along Airport Boulevard, they chanted “Viva, viva, Papa Francesco”, or “Long live, Pope Francis” in Italian, as he cruised down in a buggy.\nHe was then whisked off for his private programme, which included a meeting with members of the Society of Jesus, or Jesuits, a Roman Catholic religious order, at the St Francis Xavier Retreat Centre in Punggol.\nThe last time a pope visited Singapore was in 1986, when the late Pope John Paul II made a brief stopover for five hours during a tour of the region that included stops in Bangladesh, Fiji, New Zealand, Australia and the Seychelles.", "url": "https://www.straitstimes.com/singapore/pope-francis-calls-on-president-tharman-meets-pm-wong-after-ceremonial-welcome"}