{"authors": ["Leow Wen Xuan"], "date_download": "2024-10-12 13:52:50", "date_modify": "2024-10-12 13:52:50", "date_publish": "2024-04-08 05:00:00", "description": "If the hornbill population is reduced further, plant diversity may face dire consequences. Read more at straitstimes.com.", "filename": "singapore_hornbills-fit-bill-to-help-promote-plant-diversity-with-ability-to-swallow-big-seeds_1728741170.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/08/155A8922-Enhanced-NR.jpg?VersionId=H5JQa184HF5D.Xhd.TpCdNQaYqJ06KVW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_hornbills-fit-bill-to-help-promote-plant-diversity-with-ability-to-swallow-big-seeds_1728741170.html", "title": "Hornbills, dubbed ‘farmers of the forest’, crucial for plant diversity: NUS study", "title_page": "Hornbills, dubbed ‘farmers of the forest’, crucial for plant diversity: NUS study | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Hornbills are indispensable gardeners of large fruits, thanks to their uniquely large beaks that help them to eat the fruits, whose seeds are then dispersed in areas more suited for growth, a study has shown.\nThis means that if the hornbill population is reduced further, plant diversity may face dire consequences.\nThe study of Asian and New Guinean hornbills by NUS found that a significant proportion of fruits or seeds commonly consumed by the birds was “far larger” than the beak sizes of other fruit-eating birds in tropical Asia, such as barbets and bulbuls.\nThis strongly suggests that large seeds are highly dependent on hornbills for their dispersal, said the co-lead and senior author of the study, Assistant Professor Lim Jun Ying of the university’s Department of Biological Sciences.\nAmong all fruit-eating bird groups, Asian hornbills have the widest beak width of about 22.5mm to 56.9mm. They can easily swallow entire fruits without damaging the seeds, unlike birds with smaller beaks that may peck on the pulp and damage the seed.\nThe hornbills also defecate the seeds after a significant duration. Larger-bodied species, such as the great and wreathed hornbills, take about two hours to digest and defecate the seeds of some fruits, said lead author Liang Hanci, who is a first-year PhD student in the Department of Biological Sciences.\nBy then, they would have flown a considerable distance from the parent trees where seedling predators such as rodents and insects are concentrated, allowing the seeds to grow in an area with a higher chance of survival.\nUsing more than 2,000 hornbill dietary records, the research team compiled a database and analysed the sizes of fruits and seeds that the hornbills fed on and compared them with the beak sizes of hornbills and other fruit-eating birds from around 2022 to 2023.\nHornbills, dubbed farmers of the forest, disperse the seeds of hundreds of fruit tree species, contributing to lush tropical forests and maintaining the health of these fragile ecosystems.\nFor example, the wreathed hornbill, which is listed as vulnerable to extinction, has been recorded to either consume or disperse fruits or seeds from 162 plant species, according to the study.\nOut of the 62 hornbill species in the world, 26 are listed as globally threatened or near threatened with extinction due to habitat destruction and poaching.\nIf the hornbills and other key seed dispersers continue to be lost, the ability of the world’s tropical forests to regenerate themselves will be weakened, said Prof Lim.\nThis presents a setback in humanity’s efforts to tackle climate change, as forests reduce carbon emissions by capturing and storing carbon.\n“We hope that by being able to characterise their functional roles in tropical forests, we have shed the spotlight on why it is so crucial that we conserve them,” added Prof Lim.\nFurthermore, hornbills disperse seeds from threatened tree species, such as those from the Myristicaceae or nutmeg family, which have big seeds.\nThis group of plant species is one of the most cited examples of “hornbill fruit”, due to its large seeds and heavy dependence on the birds for seed dispersal. And many species of Myristicaceae are threatened, including in Singapore, said Prof Lim.", "url": "https://www.straitstimes.com/singapore/hornbills-fit-bill-to-help-promote-plant-diversity-with-ability-to-swallow-big-seeds"}