{"authors": ["Elaine Lee"], "date_download": "2024-10-12 14:05:04", "date_modify": "2024-10-12 14:05:04", "date_publish": "2024-05-02 14:40:00", "description": "Diners here can look forward to menu items that are exclusive to Singapore. Read more at straitstimes.com.", "filename": "singapore_popular-malaysian-coffee-shop-chain-oriental-kopi-to-open-in-singapore-by-september_1728741904.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/02/Oriental20KopiGroup20Food20Shot.JPG?VersionId=XnJxdZNnDvsCR1Bwbdf0ld2B3OX.JEOr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_popular-malaysian-coffee-shop-chain-oriental-kopi-to-open-in-singapore-by-september_1728741904.html", "title": "Popular Malaysian coffee shop chain Oriental Kopi to open in Singapore by September", "title_page": "Popular Malaysian coffee shop chain Oriental Kopi to open in Singapore by September | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Popular Malaysian coffee shop chain Oriental Kopi is set to open its first outlet in Singapore by September.\nThe location has not been revealed, but it will be in a “prime area”, Paradise Group said on May 2.\n“A total of eight outlets are planned to open over a span of three years,” it added.\nThis will be the chain’s first overseas foray, in partnership with Singapore’s Paradise Group, which has brands such as Beauty In The Pot and Paradise Dynasty under its belt.\nThe partnership will also be Paradise Group’s first joint venture.\nParadise Group’s chief operating officer Edlan Chua said that with the joint venture, both groups can propagate the culinary traditions of Nanyang cuisine in Singapore and beyond.\nOriental Kopi, which started as a single coffee shop in 2021, is famous for fare such as traditional brewed coffee, egg tarts, nasi lemak and polo bun. It now has 14 outlets and two merchandise stores in Johor Bahru, Kuala Lumpur and Selangor.\nIts group managing director Calvin Chan said he is excited about the partnership. “We are confident that Paradise Group’s proven track record, robust business capabilities and unwavering dedication to culinary excellence in Singapore’s F&B industry will propel Oriental Kopi to greater success,” he added.\nMust-order signatures include Oriental Kopi, a full-bodied Nanyang-style brew made from a “golden ratio” of top quality Arabica, Robusta and Liberica beans. Diners here can also look forward to menu items that are exclusive to Singapore.", "url": "https://www.straitstimes.com/singapore/popular-malaysian-coffee-shop-chain-oriental-kopi-to-open-in-singapore-by-september"}