{"authors": ["Elisha Tushara"], "date_download": "2024-10-12 13:30:07", "date_modify": "2024-10-12 13:30:07", "date_publish": "2023-10-27 15:30:00", "description": "This is an addition to the six days that preschools have to close their centres for staff development. Read more at straitstimes.com.", "filename": "singapore_teachers-day-children-s-day-to-be-pre-school-holidays-from-2024_1728739807.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/27/2023092628060482img5418.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_teachers-day-children-s-day-to-be-pre-school-holidays-from-2024_1728739807.html", "title": "Teachers’ Day, Children’s Day to be pre-school holidays from 2024", "title_page": "Teachers’ Day, Children’s Day to be pre-school holidays from 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – From 2024, pre-schools will have two additional holidays – Teachers’ Day and Children’s Day.\nThis is on top of the six days that pre-schools are currently allowed to close each year for organisational activities, such as curriculum planning and staff training.\nAnnouncing this move on Friday, Minister for Social and Family Development Masagos Zulkifli said the Government is committed to supporting the well-being and development of early childhood educators.\nThe existing six days of closure each year will be known as Development Days, he said, for educators to have time to focus on their individual and team development. Pre-schools can use these days for training, curriculum planning and staff retreats, for instance.\nSpeaking at the Early Childhood Celebrations and Conference, Mr Masagos said that the Early Childhood Development Agency (ECDA) will no longer stipulate that pre-schools be closed for half a day on the eve of any three of these five public holidays – New Year’s Day, Chinese New Year, Hari Raya Aidilfitri, Deepavali and Christmas Day. This is to allow more flexibility with their operating hours.\nPre-school operators will have the flexibility to engage their staff and parents to adjust their centres’ operating hours on the eve of public holidays, based on the caregiving needs of parents and other considerations.\nFor instance, Muslim staff can be granted half a day off on the eve of Hari Raya. Pre-schools can also close earlier on the eve of Chinese New Year if all parents and guardians confirm that they do not require childcare services beyond a certain time.\nSpeaking at the conference at Suntec Singapore Convention and Exhibition Centre, Mr Masagos urged operators and centre leaders to ensure that educators are free from teaching and caregiving duties when they are on their breaks so that they can have meals, rest and recharge before resuming work.\n“Such provision is already in line with the Employment Act,” he said. “Our pre-school teachers are empowered to do their best to support our children when they have regular breaks for personal and professional development throughout the year, and daily.”\nMs Farhana Mohamed Hassan, 37, a senior infant educator at PCF Sparkletots Preschool at Pioneer in Jurong West, was thrilled when she found out that pre-schools will get to enjoy the Teachers’ Day and Children’s Day holidays. She said it was an affirmation of early childhood educators’ efforts.\n“As an educator, I believe that after we recharge, we will be more motivated to work better. And when we work better, we can provide children with a more nurturing learning environment,” said Ms Farhana, adding that it is already a common practice at her pre-school not to disturb teachers during their breaks.\nTo further support educators catering to children aged three years and below, ECDA launched on Friday the updated Early Years Development Framework 2023, which was introduced in 2011.", "url": "https://www.straitstimes.com/singapore/teachers-day-children-s-day-to-be-pre-school-holidays-from-2024"}