{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:55:55", "date_modify": "2024-10-12 13:55:55", "date_publish": "2024-03-28 13:10:00", "description": "Associate Professor Dan Yock Young will assume the role from April 1. Read more at straitstimes.com.", "filename": "singapore_ng-teng-fong-general-hospital-jurong-community-hospital-appoint-new-ceo_1728741355.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/28/photo2024-03-2811-59-41.jpg?VersionId=x9sr_6SG7aNnekrv2MnU6jlv3T54VYtG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_ng-teng-fong-general-hospital-jurong-community-hospital-appoint-new-ceo_1728741355.html", "title": "Ng Teng Fong General Hospital, Jurong Community Hospital appoint new CEO", "title_page": "Ng Teng Fong General Hospital, Jurong Community Hospital appoint new CEO | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Ng Teng Fong General Hospital (NTFGH) and Jurong Community Hospital (JCH) have appointed a new chief executive.\nIn a statement on March 28, NTFGH announced that Associate Professor Dan Yock Young will take over on April 1 from Dr Quek Lit Sin, who has been the CEO since 2021.\n“We would like to express our appreciation to Dr Quek for his contributions in the past three years. Under his leadership, the healthcare team at the integrated NTFGH and JCH not only augmented national efforts against Covid-19, but also pressed on with various community partnerships to strengthen care for the residents,” said Professor Yeoh Khay Guan, chief executive of the National University Health System (NUHS).\nNUHS is one of three public healthcare clusters in Singapore. It is an integrated system overseeing a range of hospitals, national speciality centres, polyclinics, a medical centre and academic health science institutions.\nNTFGH, JCH, Alexandra Hospital and the National University Hospital are all under NUHS.\nNTFGH said in its statement that in his new role, Prof Dan will further advance clinical excellence and outcomes, as well as provide seamless and patient-centred care for the patients.\nA gastroenterologist by training, Prof Dan has also authored more than 150 publications and review articles in the Gastroenterology and Hepatology journals. He was formerly deputy director-general of health at the Ministry of Health, where he oversaw areas such as the organisation and provision of healthcare services, and integration with community partners.\nProf Dan was also previously a medical board deputy chairman, and the university medicine cluster chair and head of department of medicine, at the National University Hospital, where he led the largest clinical and academic department in the hospital.\nHis accolades include the A*Star International Fellowship to research on liver stem cells and liver regeneration, as well as numerous awards at both local and international conferences.\nProf Dan said: “NTFGH and JCH will leverage our strong integration within the community to transform and advance healthcare, to meet the needs of both our staff and residents.”", "url": "https://www.straitstimes.com/singapore/ng-teng-fong-general-hospital-jurong-community-hospital-appoint-new-ceo"}