{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:29:30", "date_modify": "2024-10-12 13:29:30", "date_publish": "2024-06-16 13:05:00", "description": "He is expected to be sentenced in August after pleading guilty. Read more at straitstimes.com.", "filename": "singapore_courts-crime_doctor-submitted-116-false-claims-to-govt-scheme-duping-moh-into-disbursing-7600_1728739770.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/16/courts-and-crime.jpg?VersionId=jTzEPmp80naTIIQCsNmMSxswqhNtf05z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_doctor-submitted-116-false-claims-to-govt-scheme-duping-moh-into-disbursing-7600_1728739770.html", "title": "Doctor submitted 116 false Chas claims, duping MOH into disbursing $7,600", "title_page": "Doctor submitted 116 false Chas claims, duping MOH into disbursing $7,600 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A doctor submitted 116 false claims linked to a government initiative known as the Community Health Assist Scheme (Chas), and the Ministry of Health (MOH) later disbursed $7,627 to one of his clinics in Bedok.\nWong Choo Wai, the owner of Bedok Day & Night Clinic and Jurong Day & Night Clinic at the time of the offences, pleaded guilty to two cheating charges on June 14.\nThe 53-year-old Singaporean also pleaded guilty to one count of making false entries in his patients’ clinical records.\nHe committed the offences in 2015 and 2016. Five other charges for similar offences will be considered when he is sentenced in August.\nIn 2000, MOH rolled out Chas to help lower-income patients receive subsidies for medical and dental treatments at participating clinics.\nTwo polyclinic groups – SingHealth Polyclinics and National Healthcare Group Polyclinics – administered Chas on the ministry’s behalf.\nOn behalf of his Bedok clinic, Wong signed an agreement with SingHealth Polyclinics on Feb 15, 2012, to be part of Chas.\nOn June 15 that year, he also signed a similar agreement with the National Healthcare Group Polyclinics on behalf of his Jurong clinic.\nDeputy public prosecutors Ng Jean Ting and Louis Ngia stated in court documents that under Chas, Wong’s clinics had to provide the subsidies to the patients upfront during their visits.\nThe clinics would then claim the subsidies on a reimbursement basis from MOH. The subsidies were disbursed through the polyclinic groups.\nAs part of the initiative, participating clinics must submit their claims through an online portal known as eChas within a month from a patient’s visit.\nThe clinics must also submit the clinical and financial details of the claims.\nThese included information such as the patients’ personal data, the dates of visit, the types of conditions treated and the cost breakdown of the claims.\nThe prosecution told the court that medical facilities did not have to submit case notes, receipts and patient consent forms when they submitted their claims.\nHowever, clinics that took part in Chas had to maintain accurate and complete clinical as well as financial records as supporting documents.\nThese would be presented to MOH Holdings (MOHH) – the appointed auditor by MOH for Chas claims – when MOHH performed audits of the claims that the clinics had submitted.\nThe prosecutors said: “(Wong) understood the permissible scope of Chas claims. He was the only person in (his Jurong and Bedok clinics) to submit all the claims on behalf of the clinics in 2015 and 2016.”\nOn at least 40 occasions in 2015, he used the eChas portal to submit false claims to MOH, which was duped into disbursing $1,755 to his Bedok clinic.\nHe had falsely claimed to have treated certain patients.\nWong committed similar offences on at least 76 occasions in 2016, and MOH was deceived into delivering $5,872.\nOn at least 21 occasions between August and December 2016, he also made false entries in his patients’ clinical records, falsely recording that they had consulted him for certain medical ailments when, in fact, they had not.\nThe prosecutors said: “The accused... falsified these clinical records in order to conceal some of the false Chas claims he had submitted.\n“The accused knew that he was obliged to maintain complete and accurate records, including patient clinic records, and financial records, and that he would be required to furnish these documents during MOHH’s audits.”\nWong’s offences came to light following MOHH audits in or around February 2017 and an MOH officer alerted the police the following month.", "url": "https://www.straitstimes.com/singapore/courts-crime/doctor-submitted-116-false-claims-to-govt-scheme-duping-moh-into-disbursing-7600"}