{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 13:53:30", "date_modify": "2024-10-12 13:53:30", "date_publish": "2024-02-07 14:45:00", "description": "More than 80 per cent of them remained in employment for at least six months. Read more at straitstimes.com.", "filename": "singapore_politics_900-jobseekers-with-disabilities-helped-by-sg-enable-each-year-about-500-placed-in-jobs-gan-siow-huang_1728741210.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/07/2023121370979483img2772.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_900-jobseekers-with-disabilities-helped-by-sg-enable-each-year-about-500-placed-in-jobs-gan-siow-huang_1728741210.html", "title": "900 job seekers with disabilities helped by SG Enable each year, about 500 placed in jobs: Gan Siow Huang", "title_page": "900 job seekers with disabilities helped by SG Enable each year, about 500 placed in jobs: Gan Siow Huang | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Between 2018 and 2022, a yearly average of around 900 job seekers with disabilities were assisted by SG Enable’s job placement and job support partners.\nOf this group, about 500 people with disabilities were successfully placed into jobs each year, and more than 80 per cent of them, or 400 people, remained in employment for at least six months, said Minister of State for Manpower Gan Siow Huang.\nMs Gan was responding in Parliament to a question from Mr Darryl David (Ang Mo Kio GRC) on how many persons with disabilities have applied for jobs through the Employment and Employability Institute (e2i), and how many stayed in their jobs for more than six months. She noted that Workforce Singapore and NTUC’s e2i do not track whether job seekers assisted have disabilities.\nUnder disability agency SG Enable’s Open Door Programme, SG Enable works with job placement and job support partners such as Autism Resource Centre, Movement for the Intellectually Disabled of Singapore and SPD, she said. Under the scheme, people with disabilities can receive up to one year of job matching and employment support from trained job coaches.\nThese partners provide coaches trained to help persons with disabilities with their job search and provide on-site support to help these job seekers adjust to their new roles, said Ms Gan. The job coaches also advise employers on adapting job tasks and the work environment to better suit the needs of employees with disabilities.\nMr David also asked if a more permanent or dedicated department can be set up to cater to the job needs of people with disabilities, which relies on Singapore’s tripartite model of working with unions, employers and the Government.\nMs Gan said: “Indeed, we’ll be very willing to work together to support employment, and upskilling of persons with disabilities.”\nShe also cited the first Enabling Business Hub, which opened in December and provides customised job support to people with various disabilities to help them sustain employment, and equips employers with inclusive practices to hire and integrate persons with disabilities.\nSet up by SG Enable, the hub rents out office space to inclusive employers such as Bizlink Centre and Superduper, and has a realistic e-commerce and logistics fulfilment environment set up to prepare persons with disabilities to work in the logistics sector.\n“Now, this is a new structure. It is a new institution if you like, a one-stop shop for employers, social support agencies, persons with disabilities, tripartite partners, and the whole of society to come together to support persons with disabilities in finding jobs, and also to help them (stay) employed,” she said. Ms Gan also noted Singapore’s aspirational goal of having 40 per cent of persons with disabilities employed by 2030.\n“We encourage employers to approach SG Enable, and to tap the Open Door Programme as well as other employment support services to hire, train and integrate persons with disabilities into their organisations.”", "url": "https://www.straitstimes.com/singapore/politics/900-jobseekers-with-disabilities-helped-by-sg-enable-each-year-about-500-placed-in-jobs-gan-siow-huang"}