{"authors": ["Andrew Wong"], "date_download": "2024-10-12 13:57:42", "date_modify": "2024-10-12 13:57:42", "date_publish": "2023-05-04 07:30:00", "description": "RSN has been an early adopter of automation on its vessels amid Singapore's shrinking population. Read more at straitstimes.com.", "filename": "singapore_s-pore-navy-will-leverage-technology-to-respond-to-wide-range-of-threats-rsn-chief_1728741462.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/04/Photo204_2.jpg?VersionId=QZUtyMeOPjrfOrlmQ0LzLvoluqiZsmkE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-navy-will-leverage-technology-to-respond-to-wide-range-of-threats-rsn-chief_1728741462.html", "title": "S’pore navy will leverage technology to respond to wide range of threats: RSN chief", "title_page": "S’pore navy will leverage technology to respond to wide range of threats: RSN chief | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – With the nature of conflict having evolved over the last decade, the Republic of Singapore Navy (RSN) will need to be ready to respond to a wide range of traditional and non-traditional threats, said Chief of Navy Sean Wat Jianwen.\n“Beyond military-to-military conflicts, we see non-military actors conducting operations in non-traditional and non-military domains, utilising novel tactics and capabilities that may threaten Singapore’s interests,” Rear-Admiral Wat, 39, said in a written interview on Tuesday.\nIn the maritime domain, these threats can range from sea robberies to contestations over territorial boundaries and resources to supply chain disruptions, he added.\nOne challenge in particular hits closer to home – Singapore’s shrinking manpower resources. The nation’s resident total fertility rate hit a record low of 1.05 in 2022, dipping below the previous record of 1.1 in 2020.\nThis means that the RSN cannot operate its fleet with the same amount of manpower as its foreign counterparts, said RADM Wat.\nThe navy, therefore, has been an early adopter of automation on its vessels. This has led to the RSN being able to operate ships with one-third to half the crew, compared with crew strength on similar-sized vessels in other established navies.\n“In building the navy’s capabilities for the future, we have looked at how we can design work processes to be more efficient, so as to allow us to do more with less,” RADM Wat said.\nThis will take place as the RSN leverages unmanned technology to continue to expand its “operational envelope” without levying a heavy manpower cost, he added.\nMaritime security unmanned surface vessels will soon operate alongside the navy’s manned vessels, such as the littoral mission vessels, to patrol Singapore waters.\nThe upcoming multi-role combat vessel will operate as a “mothership”, capable of taking charge and coordinating the actions of multiple unmanned platforms at sea.\nThe navy also taps artificial intelligence (AI) and data analytics. For example, it has incorporated AI in its daily front-line operations to more efficiently identify potential intruders from land and sea via its surveillance systems.\nOn board ships, the RSN has also been experimenting with data analytics to help with predictive maintenance, and to help its engineers maintain the operational readiness of its platforms.\n“From enhancing our situational awareness at sea to accelerating decision-making in operations and improving the operational readiness of our ships, the incorporation of AI and data analytics will be a key force enabler for our navy,” RADM Wat said.\nHe acknowledged that unmanned technology cannot entirely replace core human functions that involve leadership, command and complex decision-making.\n“Therefore, the fleet of the future will likely be one of manned-unmanned pairing, which will allow us to reap the efficiencies of both manned and unmanned operations,” he added.\nElaborating on the importance of training sailors realistically and safely, RADM Wat said simulation technology has allowed the navy to shift a greater proportion of training ashore without compromising on realism and rigour.\nSimulators, he added, also provide sailors with a safe environment to experiment without putting the crew in real danger.\nHe said: “We will gradually operationalise our new platforms, both manned and unmanned, and build up our capabilities to ensure that we continue to maintain a professional and competent navy that is able to defend Singapore’s interests.”", "url": "https://www.straitstimes.com/singapore/s-pore-navy-will-leverage-technology-to-respond-to-wide-range-of-threats-rsn-chief"}