{"authors": ["Toh Ting Wei"], "date_download": "2024-10-12 13:47:26", "date_modify": "2024-10-12 13:47:26", "date_publish": "2020-01-30 12:19:14", "description": "The returning Singaporeans will undergo medical screening upon arrival at Changi Airport. Read more at straitstimes.com.", "filename": "singapore_some-singaporeans-with-symptoms-of-virus-staying-behind-in-wuhan-even-as-92-are-evacuated_1728740846.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/01/30/ycevac300120.jpg?VersionId=5zKWOk0UhOPfwMdWvF4kKvhsXl81noKv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_some-singaporeans-with-symptoms-of-virus-staying-behind-in-wuhan-even-as-92-are-evacuated_1728740846.html", "title": "Some Singaporeans with symptoms of virus staying behind in Wuhan even as 92 are evacuated", "title_page": "Some Singaporeans with symptoms of virus staying behind in Wuhan even as 92 are evacuated | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Some Singaporeans having symptoms of the Wuhan virus remain stranded in Wuhan, even as 92 Singaporeans touched down at Changi Airport on Thursday morning (Jan 30).\nNational Development Minister Lawrence Wong, who is co-chair of the multi-ministry committee overseeing the Wuhan virus crisis, said on Thursday that a small number of people displayed symptoms, although he did not immediately have the specific figures.\n\"It is probably not safe for them to come back on the same plane,\" he said, noting that some of them might have to stay quarantined in China.\n\"Our embassy is in touch with them to ensure their welfare.\"\nIn a statement, the Ministry of Foreign Affairs said the Singaporeans who have returned will undergo medical screening upon arrival at Changi Airport.\nThe statement said: \"MFA consular officers accompanied the Scoot flight to facilitate the ground operations at Wuhan.\n\"In a telephone call with PRC State Councillor and Foreign Minister Wang Yi yesterday, Foreign Minister Dr Vivian Balakrishnan expressed the Singapore Government's appreciation to the PRC government, Hubei provincial government, Wuhan city government, and the PRC Embassy in Singapore for facilitating the safe return of these Singaporeans.\"\nThe MFA added: \"Those with fever or respiratory symptoms will be taken to designated hospitals for further examination, while the remaining passengers, including the MFA Consular Officers who facilitated the return of these Singaporeans from Wuhan, will be quarantined for 14 days.\"\nThe evacuation of the Singaporeans comes after a specially arranged Scoot flight took off from Changi Airport on Wednesday night with Wuhan residents who had been stranded in Singapore.\nScoot said in a statement that the plane landed in Singapore at about 11.40am.\nThe flight, TR121, had departed Wuhan for Singapore at about 7am on Thursday.\nIt was the return flight for TR120, which had departed for Wuhan on Wednesday evening with Wuhan residents.\nA Scoot spokesman said that measures were taken to ensure the safety of both passengers and crew on the four-hour-40-minute flight.\nScoot said temperature screening was conducted at check-in and before boarding, and any passengers found to have fever were not allowed to board.\n\"Surgical masks were provided to all passengers, and all operating crew were required to wear N95 masks and surgical gloves on board the flights,\" said Scoot.\n\"The flight operated with limited in-flight service, where there was no distribution of food and beverages or sale of duty-free products.\nThe budget carrier had on Jan 23 cancelled all flights to the city in Hubei province.\nThe suspension is expected to last till late-March, when it will be reviewed.\nIn a Facebook post thanking the Scoot crew which had volunteered for the flight, National Trades Union Congress secretary-general Ng Chee Meng praised them for stepping up.\n\"I couldn't be more proud of our Scoot staff union leaders and members for stepping forward to serve our fellow Singaporeans without hesitation,\" said Mr Ng.\nChina's National Health Commission said on Thursday that the total number of confirmed deaths from the coronavirus in the country has risen by 38 to 170 as of end-Wednesday. The number of infected patients rose by more than 1,700.", "url": "https://www.straitstimes.com/singapore/some-singaporeans-with-symptoms-of-virus-staying-behind-in-wuhan-even-as-92-are-evacuated"}