{"authors": ["Anjali Raguraman"], "date_download": "2024-10-12 13:44:59", "date_modify": "2024-10-12 13:44:59", "date_publish": "2023-02-24 16:03:58", "description": "Those who wish to take part must be a Cathay Pacific member and answer three questions correctly. Read more at straitstimes.com.", "filename": "singapore_consumer_12500-free-cathay-pacific-tickets-to-hong-kong-for-singapore-residents-up-for-grabs-from-march-2-to-8_1728740699.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/25/AC1I441120copy_1.jpg?VersionId=LWsfkb_uKEWTMSeY.WA.u_0mCTwKhSj7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_consumer_12500-free-cathay-pacific-tickets-to-hong-kong-for-singapore-residents-up-for-grabs-from-march-2-to-8_1728740699.html", "title": "12,500 free Cathay Pacific tickets to Hong Kong for Singapore residents up for grabs from March 2 to 8", "title_page": "12,500 free Cathay Pacific tickets to Hong Kong for Singapore residents up for grabs from March 2 to 8 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Cathay Pacific is giving away 12,500 round-trip air tickets for tourists from Singapore from March 2 to 8, as part of Hong Kong’s efforts to save its embattled tourism industry.\nThe giveaway is part of a promotion campaign by Hong Kong that will include 500,000 free tickets to woo back visitors, businesses and investors to the city after more than three years of tough Covid-19 curbs.\nThe “Hello, Hong Kong” campaign was first announced by the city’s Chief Executive John Lee in early February.\nThe Hong Kong Tourism Board said on Friday that at least one million Hong Kong Goodies consumption vouchers will be given out to visitors for use at more than 16,000 outlets across the city.\nThis includes getting a complimentary welcome drink at participating bars, restaurants and hotels; or a cash voucher that can be redeemed for transportation, culinary and retail experiences, as well as attractions.\nThe campaign runs from noon on March 2, to 11.59pm on March 8.\nThose who wish to participate in the giveaway must be a Cathay Pacific member. Three questions must be answered correctly on the campaign website.\nOnly one entry can be submitted, and the prize will be awarded to the first 12,500 entrants with correct answers.\nThe winners will be announced on the campaign website on March 20, following which they will receive an e-mail with details on how to redeem their prize, which does not include airport taxes and surcharges.\nHong Kong saw approximately half a million visitors a year from Singapore between 2018 and 2019, according to the Hong Kong Tourism Board.\nDespite rolling out campaigns to show that Hong Kong has emerged from the shadow of Covid-19, it announced on Wednesday that it was extending mandatory mask-wearing in public places to March 8.\nHong Kong has dropped most of its other curbs such as limits on public gatherings, and it no longer requires proof of vaccination for entry to some venues.", "url": "https://www.straitstimes.com/singapore/consumer/12500-free-cathay-pacific-tickets-to-hong-kong-for-singapore-residents-up-for-grabs-from-march-2-to-8"}