{"authors": ["David Sun"], "date_download": "2024-10-12 13:29:14", "date_modify": "2024-10-12 13:29:14", "date_publish": "2024-06-11 19:30:00", "description": "Tan Kai Wen, 24, was sentenced to 28 months' jail on June 11 Read more at straitstimes.com.", "filename": "singapore_jail-for-man-who-kept-scamming-victims-even-after-being-arrested-and-released-on-bail-three-times_1728739754.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/11/YINH5965.JPG?VersionId=hxHFJtZA1Bh98T8rNIh7v2H7lW_aD51a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_jail-for-man-who-kept-scamming-victims-even-after-being-arrested-and-released-on-bail-three-times_1728739754.html", "title": "Jail for man who kept scamming victims even while out on bail", "title_page": "Jail for man who kept scamming victims even while out on bail | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A man ran a series of renovation and rental scams, cheating almost 70 people of about $78,000 which he then used for personal expenses like a hotel stay and alcohol.\nTan Kai Wen, 24, had been arrested and released on bail three times, but kept scamming victims until he was finally kept in remand.\nOn June 11, he was jailed for 28 months after he pleaded guilty to four cheating charges. Another eight cheating charges were taken into consideration for sentencing.\nThe court heard that he has used up all the money he cheated people of and has made no restitution.\nTan, a Malaysian, was previously working as a salesman at a renovation company here in late 2021.\nHe was facing financial difficulties at the time, and came up with a plan to cheat clients by having them make payments to his bank account instead of the company’s, for tabletops and other renovation work.\nTan began cheating clients from November 2021, getting four of them to transfer more than $11,000 in total to him.\nThe ruse involved excuses such as the company’s account being closed on Saturdays and that he was able to offer discounts.\nPolice reports were made against Tan, and he was arrested on July 18, 2022, before being charged in court a week later and released on bail.\nBut he continued with his cheating spree, tricking 14 victims of another $16,300 through renovation scams up till January 2023.\nDuring that time, Tan had been arrested again twice on Nov 13, 2022, and Jan 20, 2023, and released on bail each time.\nThe renovation company had lodged a police report against him in August 2022, but he then created a Carousell account to continue running the scams.\nTan failed to turn up in court for a hearing on Jan 25, 2023, and a warrant of arrest was issued against him.\nWhile on the run, he switched up his scam type, cheating a total of 49 victims of about $51,000 in a series of rental scams on Facebook using multiple identities.\nTan’s crime spree came to an end after he was arrested on March 15, 2023, and kept in remand.", "url": "https://www.straitstimes.com/singapore/jail-for-man-who-kept-scamming-victims-even-after-being-arrested-and-released-on-bail-three-times"}