{"authors": ["Jean Iau"], "date_download": "2024-10-12 13:31:41", "date_modify": "2024-10-12 13:31:41", "date_publish": "2022-03-23 22:27:42", "description": "Police officers fired 3 taser shots at the 64-year-old man after he refused to drop the knife. Read more at straitstimes.com.", "filename": "singapore_courts-crime_knife-wielding-man-shot-dead-by-police-at-bendemeer-road-hdb-block_1728739901.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/23/nf-bendemeer-230322.jpg?VersionId=2fjvDcr6Pv.SVLMGjsQhJNVM38gvcU3i", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_knife-wielding-man-shot-dead-by-police-at-bendemeer-road-hdb-block_1728739901.html", "title": "Knife-wielding man shot dead by police at Bendemeer Road HDB block", "title_page": "Knife-wielding man shot dead by police at Bendemeer Road HDB block | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A man wielding a knife was shot dead during a confrontation with police officers at Block 33 Bendemeer Road on Wednesday (March 23).\nThe police said during a press conference on Wednesday night that 64-year-old Ng Eng Kui, a drug offender, was walking around the foot of the HDB block shouting and brandishing a knife at around 4pm.\nWhen officers arrived at the scene, he came out of a sixth-floor unit. They told him to drop the weapon but he refused, and advanced towards them.\nThe police officers fired three Taser shots at Ng and retreated, but he continued to advance towards them.\n\"As there was imminent threat to the safety of the officers, one of the officers fired a shot from his pistol at the man, and the man fell to the ground,\" said the police.\nThe officers performed cardiopulmonary resuscitation (CPR) on Ng, who had a gunshot wound in his chest.\nHe was unconscious when taken to hospital, where he was pronounced dead at 5.13pm.\nThe police said that officers are trained to fire at the centre of the body if they have to stop an imminent threat of grievous hurt or death as this offers a higher probability of hitting and stopping the subject.\nIt also reduces the risk of injury to bystanders from stray bullets.\nThe police added that Tasers are not always able to fully incapacitate an individual, as responses vary from person to person, and the effectiveness of a Taser depends on where its probes land.\nPreliminary investigations showed that Ng had been pacing up and down the block with the knife and had approached a student in uniform.\nThe student was able to walk away.\nNg was wanted by the Central Narcotics Bureau, and drug apparatus was found in his flat.\nThe police said they will be investigating if he was on drugs during the incident.\nHe was also being investigated for offences including committing a rash act and voluntarily causing hurt to deter a public servant from discharging his duty.", "url": "https://www.straitstimes.com/singapore/courts-crime/knife-wielding-man-shot-dead-by-police-at-bendemeer-road-hdb-block"}