{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:35:31", "date_modify": "2024-10-12 13:35:31", "date_publish": "2021-10-05 12:56:05", "description": "The minor, who was between 14 and 15, gave birth to a baby girl on May 15 last year. Read more at straitstimes.com.", "filename": "singapore_courts-crime_man-admits-impregnating-girlfriends-underage-daughter-who-later-gave-birth_1728740131.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/08/20/rrcourt.jpg?VersionId=aF08y1WVooNTQhch1cDSN_yH1y4JWfDk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_man-admits-impregnating-girlfriends-underage-daughter-who-later-gave-birth_1728740131.html", "title": "Man admits impregnating girlfriend's underage daughter, who later gave birth", "title_page": "Man admits impregnating girlfriend's underage daughter, who later gave birth | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The daughter treated her mother's boyfriend as \"daddy\" but he ended up impregnating her. The minor, who was between 14 and 15 then, gave birth to a baby girl on May 15 last year.\nOn Tuesday (Oct 5), the 29-year-old Singaporean man admitted to three counts of having sex with the minor. He cannot be named due to a gag order to protect her identity.\nThe court heard that prior to this incident, she had been sexually abused by another family member when she was between 10 and 12.\nHer child guidance clinic report dated Oct 21 last year stated that she now has passive suicidal wishes owing to the repeated sexual abuse she had experienced.\nDeputy public prosecutors Jaime Pang and Teo Siu Ming stated in court documents that the girl also felt worried that her child might hate her later upon finding out she had been born out of wedlock.\nThe man met the victim's mother in 2015 and they moved in together in May 2016. The girl stayed with them later that year.\nHe eventually gained the victim's trust and became her father figure.\nThe prosecutors said: \"The accused would shower (her) with affection through gestures like spending relatively large sums of money to celebrate her birthday and taking her out to enjoy her favourite activities like ice skating... He would also care for (the girl) when she fell ill and guide her when she needed assistance with her homework.\"\nThrough these gestures, the girl and the unemployed man grew closer - developing ties akin to a father and daughter relationship. She also referred to him as \"daddy\".\nThe prosecutors added: \"The way the accused treated (the girl) made her feel secure, and he provided her with the love and affection that she yearned for but was unable to get from her biological father, who was incarcerated at the material time.\"\nThe pair's relationship, however, turned sexual in late 2018.\nThey had unprotected sex regularly in their home when the girl's mother - the household's sole breadwinner - was out at work.\nThe court heard that she initially did not give any details about the offender on the infant's birth certificate.\nHis offences came to light after she reported to the Immigration and Checkpoints Authority 11 days later to register the birth.", "url": "https://www.straitstimes.com/singapore/courts-crime/man-admits-impregnating-girlfriends-underage-daughter-who-later-gave-birth"}