{"authors": ["Sarah Koh"], "date_download": "2024-10-12 13:32:24", "date_modify": "2024-10-12 13:32:24", "date_publish": "2023-11-25 16:05:00", "description": "The SCDF reminds the public not to leave any cooking unattended to prevent fires. Read more at straitstimes.com.", "filename": "singapore_two-people-taken-to-hospital-after-fire-breaks-out-at-bendemeer-market-and-food-centre_1728739944.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/25/hzfire2511.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_two-people-taken-to-hospital-after-fire-breaks-out-at-bendemeer-market-and-food-centre_1728739944.html", "title": "Two people taken to hospital after fire breaks out at Bendemeer Market and Food Centre", "title_page": "Two people taken to hospital after fire breaks out at Bendemeer Market and Food Centre | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Two people were taken to the hospital after a fire broke out in the early hours of Nov 25 at Bendemeer Market and Food Centre.\nThe Singapore Civil Defence Force (SCDF) said it was alerted to the fire, involving the contents of a food stall, at around 5.40am.\nFirefighters extinguished the fire using a compressed air foam trolley and a water jet, said the SCDF.\nIt added that one person was taken to Tan Tock Seng Hospital, and another was taken to Singapore General Hospital.\nShin Min Daily News reported that a drinks stall vendor had suffered cuts on his hands, while a noodle stall assistant sustained burns on her hands and face attempting to put out the fire. The Chinese-language daily said the fire had broken out at a vegetarian food stall.\nAn eyewitness told Shin Min that most stall workers were still preparing their stalls for the day ahead, when he heard cries for help.\nHe said: “More than 20 people rushed over to help... one uncle from the drinks stall brought a fire extinguisher over to help put out the fire, some helped to contact SCDF, while others helped to put out the fire by using buckets of water.”\nThe SCDF reminded the public not to leave any cooking unattended to prevent fires from breaking out.\nThe kitchen hood and surrounding surfaces should be kept clean, and flammable items should be kept away from heat sources, the SCDF said.\nIt added that in the event of an oil fire, any gas supplies should be turned off immediately, and woks or any cookware should be covered with a lid or wet cloth.", "url": "https://www.straitstimes.com/singapore/two-people-taken-to-hospital-after-fire-breaks-out-at-bendemeer-market-and-food-centre"}