{"authors": ["Lynda Hong"], "date_download": "2024-10-12 13:58:32", "date_modify": "2024-10-12 13:58:32", "date_publish": "2023-09-03 10:19:15", "description": "The Government has been investing more in the arts over the years, he noted. Read more at straitstimes.com.", "filename": "singapore_s-pore-to-keep-investing-in-arts-education-to-meet-needs-of-creative-professionals-lawrence-wong_1728741512.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/03/wgt-lawwong-030923.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-to-keep-investing-in-arts-education-to-meet-needs-of-creative-professionals-lawrence-wong_1728741512.html", "title": "S’pore to keep investing in arts education to meet needs of creative professionals: Lawrence Wong", "title_page": "S’pore to keep investing in arts education to meet needs of creative professionals: Lawrence Wong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Investments in arts education will continue, in order to meet the growing needs of creative professionals in the economy and provide diverse pathways for people to excel based on their aspirations and abilities.\nSpeaking at a fund-raising dinner on Saturday to mark the Nanyang Academy of Fine Arts’ (Nafa) 85th anniversary, Deputy Prime Minister Lawrence Wong noted that the Government has been investing more in the arts over the years.\nFor instance, the University of the Arts Singapore, a government-supported private university formed by an alliance between Lasalle College of the Arts and Nafa, will open its doors in August 2024.\nCandidates can start applying from the third quarter of 2023.\nMr Wong said he was involved in the deliberations over Singapore’s first university that focuses on the arts when he was minister for education.\nHe added that the leadership in both institutions saw the merits of coming together, and believed in the shared vision – to develop a distinctively Singaporean arts education.\n“We will continue to study more ways to strengthen the arts in Singapore, including enhancing access to the arts and providing better support for Singaporean artists,” Mr Wong said, adding that the arts and cultural scene now has a distinctive Singaporean culture and identity.\n“Our artists help give expression to this Singaporean culture.\n“For example, when the Singapore Chinese Orchestra performs, people can immediately tell that it’s not the same as an orchestra from China.\n“There is something distinctive about its style and musical arrangement,” he said.\nAt the event held at Capella Singapore attended by 300 guests, Mr Wong said Nafa has played a key role in showcasing Singapore and South-east Asian art to the world through its many international partnerships and collaborations.\nIt had also launched the Living Archive of Contemporary Asian Art, a platform for research, academia and practice.\nIn 2024, it will offer sponsored artist residencies for Singaporean and South-east Asian artists at its studios in Paris, allowing them to network and exchange ideas with the global arts community.\n“Without Nafa, the arts and culture scene in Singapore would not be the same today,” said Mr Wong.", "url": "https://www.straitstimes.com/singapore/s-pore-to-keep-investing-in-arts-education-to-meet-needs-of-creative-professionals-lawrence-wong"}