{"authors": ["Chin Soo Fang"], "date_download": "2024-10-12 13:54:50", "date_modify": "2024-10-12 13:54:50", "date_publish": "2024-02-25 05:00:00", "description": "K1 children at the Hougang and Elias Park kindergartens will get an extra half hour of MTL activities daily. Read more at straitstimes.com.", "filename": "singapore_more-mother-tongue-language-learning-for-children-at-two-new-moe-run-pre-schools-from-2025_1728741290.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/25/20240220501953611c792a85-41e2-446e-9af9-df75f8c6da5a.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_more-mother-tongue-language-learning-for-children-at-two-new-moe-run-pre-schools-from-2025_1728741290.html", "title": "More mother tongue language learning for children at two new MOE-run pre-schools from 2025", "title_page": "More mother tongue language learning for children at two new MOE-run pre-schools from 2025 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A small-scale pilot will be launched at two new pre-schools by the Ministry of Education (MOE) to study the impact on young children when they have more exposure to mother tongue language (MTL) activities.\nFrom 2025, Kindergarten 1 children attending the upcoming MOE Kindergarten @ Hougang and MOE Kindergarten @ Elias Park will have an extra 30 minutes of Chinese, Malay or Tamil learning each day.\nCurrently, MOE kindergarten children spend one hour on MTL activities daily. With the pilot, the daily MTL curriculum duration at the two centres will go up to 1½ hours. The extra 30 minutes will increase the overall schooling hours, rather than be implemented at the expense of other subjects, MOE said.\n“The pilot aims to build a strong MTL foundation for our children from a young age, and nurture their interest to learn MTL,” said a spokesperson for MOE in response to queries from The Straits Times.\nThe ministry will evaluate the impact of the pilot to see if it should be expanded to more MOE kindergartens.\nMs Ariel Ng, 41, whose four-year-old son Aden Lim is in MOE Kindergarten @ Mayflower, said having more MTL exposure would be beneficial.\n“One hour of MTL (a day) is definitely not enough, and I was thinking of sending him to a Chinese enrichment class,” said the quality specialist, who speaks a mix of English and Mandarin to her son at home.\nSome other pre-schools also conduct about one hour of MTL lessons daily for their students. Their operators say there is no intention at the moment to increase the curriculum.\nAt PAP Community Foundation’s (PCF) 354 Sparkletots centres, children in K1 and K2 (aged five to six) get an hour of formal MTL lessons daily, while those in N1 and N2 (aged three to four) have 20 to 30 minutes.\nMTL educators also communicate with children in their mother tongue languages during other activities, such as during play, bath and mealtimes.\nMs Angela Yang, PCF’s director of professional and education development, said parents play a huge role in a child’s MTL journey. Hence, PCF has developed resources such as e-books and an upcoming Home Learning Portal online to help parents engage their children with home-learning activities, including MTL resources.\nNTUC First Campus, which runs 20 Little Skool-House (LSH) centres and 158 My First Skool (MFS) centres, said its centres conduct about seven to eight hours of MTL lessons per week on average.\nMs Thian Ai Ling, MFS’ general manager, said it also offers reading and learning content through its microsite so that children can learn the languages at home, with parental support.\nSome pre-school operators already offer their students significantly more exposure to Chinese.\nMulberry Learning’s 17 bilingual pre-schools typically expose children to the Chinese language around four hours a day. It also has a Chinese-immersion pre-school called Mulberry Learning @ Fusionopolis that exposes children to Chinese around seven hours a day.\nMr Peh Yi Han, chief operating officer of Global EduHub, the educational group which runs Mulberry Learning, said the Chinese-immersion pre-school, which was opened in 2020, currently has about 70 children, including non-Chinese.\nThe national census data in 2020 showed that 48.3 per cent of Singapore’s resident population aged five and above speaks English most frequently at home, up from 23 per cent in 2000.\nSpeaking at the Mother Tongue Languages Symposium in August 2023, Education Minister Chan Chun Sing said that remaining proficient in mother tongue languages has been a challenge as Singapore has seen a shift to English as the language most frequently spoken at home in the past decade.\nAt the event, Mr Chan had announced a refreshed curriculum in mother tongue lessons for Primary 1 pupils from 2024. The new curriculum places a greater emphasis on helping pupils learn and use their mother tongue languages in and outside of the classroom.\nAssociate Professor Sin Joo Ee, who heads the Master of Early Childhood Education (Chinese​) programme at Singapore University of Social Sciences, said it is a good move to increase the exposure to MTLs among pre-schoolers as the early years are a critical time for language development in children.\n“Furthermore, it’s important to ensure that pre-school teachers have sufficient language proficiency and teaching resources, and that they use a variety of activities and teaching methods to stimulate children’s interest and enthusiasm for learning their mother tongue,” she said.\nParents can also promote children’s proficiency and interest in their mother tongue through activities such as reading, singing nursery rhymes, language games, and daily communication, she added.\nDr Sun He, senior education research scientist with National Institute of Education, said that studies have linked the total amount of language input received at school – usually measured by the length of time that children stay at school and the number of hours of language instruction per week – to the second-language vocabulary development of bilingual children.\nIn her own 2020 journal article involving 457 Singaporean pre-schoolers, she found that external factors such as family and pre-school environments played a more significant role than inherent child traits in fostering bilingual children’s MTL vocabulary development.\n“Notably, the amount of MTL input children received at school significantly predicted their MTL vocabulary growth,” she said.", "url": "https://www.straitstimes.com/singapore/more-mother-tongue-language-learning-for-children-at-two-new-moe-run-pre-schools-from-2025"}