{"authors": ["David Sun"], "date_download": "2024-10-12 13:29:23", "date_modify": "2024-10-12 13:29:23", "date_publish": "2024-02-16 13:27:23", "description": "The vaping situation in Singapore has worsened, with 1,656 cases in Dec 2023 alone. Read more at straitstimes.com.", "filename": "singapore_vape-users-in-hpb-smoking-cessation-programme-can-be-prosecuted-if-caught-using-vape-products_1728739763.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/16/2023072352175098snapseed.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_vape-users-in-hpb-smoking-cessation-programme-can-be-prosecuted-if-caught-using-vape-products_1728739763.html", "title": "Participants of HPB smoking cessation programme can be prosecuted if caught using vape products", "title_page": "Participants of HPB smoking cessation programme can be prosecuted if caught using vape products | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Participants in the I Quit programme, designed to help them quit smoking, need not worry about being fined or prosecuted as it does not presume they have or use vaping products.\nBut if they are caught using or possessing such products, then they will not be immune from criminal prosecution.\nSenior Minister of State for Health Janil Puthucheary said this on Feb 16 in Parliament when responding to a question from Associate Professor Jamus Lim (Sengkang GRC).\nProf Lim had asked whether participants in I Quit, the smoking cessation programme by the Health Promotion Board, were offered immunity from prosecution.\nHe also asked how many have benefited from the programme, and what happens if these users are caught using vapes again.\nDr Janil said the programme does not presume that participants possess or use vaping products.\nBut if they are caught, they are subject to the same enforcement actions as other offenders.\nDr Janil said a total of 112,000 participants have joined the I Quit programme since May 2014, and it does not keep track of which participants are smokers or vapers.\nProf Lim then asked if the absence of immunity from prosecution might deter people from joining the programme.\nDr Janil said the Ministry of Health (MOH) will continue to study ways to improve the programme.\nVaping has been banned in Singapore since 2018. It is illegal to buy, use or own an electronic vaporiser or vape here.\nIn a joint statement in December 2023, the Health Sciences Authority (HSA) and MOH said enforcement and education efforts against vaping would be stepped up to prevent it from gaining a foothold in Singapore.\nThe statement came as more users here were caught buying vapes online and from overseas despite the ban on such products.\nIn 2022, 4,916 people were caught for the offence, compared with 1,266 in 2020 and 4,697 in 2021.\nThe Ministry of Education told The Straits Times in October 2023 that it had referred about 800 students, including those from primary schools, to HSA in 2022. Some were issued fines.\nThe vaping situation in Singapore has been worsening steadily, with 1,656 e-vaporiser-related cases reported in December 2023 alone.\nThe scourge is a global problem, with Britain’s government in October proposing banning younger generations from ever buying cigarettes and Prime Minister Rishi Sunak saying it also needed to act on youth vaping.\nOn Dec 14, the World Health Organisation urged governments to treat e-cigarettes in a similar way to tobacco and ban all flavours, threatening the bets tobacco companies have made on smoking alternatives.\nBuying, owning or using a vaporiser in Singapore can result in fines of up to $2,000.\nFirst-time offenders who import, distribute, sell or offer for sale e-vaporisers and their components can be fined up to $10,000, jailed for up to six months, or both.\nThose who have information on the illegal possession, use, purchase, import, distribution, sale or offer for sale of e-vaporisers can call the Tobacco Regulation Branch on 6684-2036 or 6684-2037 during office hours.", "url": "https://www.straitstimes.com/singapore/vape-users-in-hpb-smoking-cessation-programme-can-be-prosecuted-if-caught-using-vape-products"}