{"authors": ["Ang Qing"], "date_download": "2024-10-12 13:29:17", "date_modify": "2024-10-12 13:29:17", "date_publish": "2024-04-09 19:25:00", "description": "More than 2,200 people have been caught for possessing or using vapes. Read more at straitstimes.com.", "filename": "singapore_health_more-than-7-million-worth-of-vaping-components-vapes-seized-in-first-quarter-of-2024_1728739757.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/09/hzvape090424.jpg?VersionId=FbVS1Omx_7usI3GxATzbwTsoGoHaxdh7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_more-than-7-million-worth-of-vaping-components-vapes-seized-in-first-quarter-of-2024_1728739757.html", "title": "More than $7 million worth of vaping components, vapes seized in first quarter of 2024", "title_page": "More than $7 million worth of vaping components, vapes seized in first quarter of 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – More than $7 million worth of vapes and components were seized from distribution networks between January and March as the authorities stepped up efforts to clamp down on vaping.\nDuring the same period, more than 2,200 people were caught for possessing or using vapes, the Health Ministry and Health Sciences Authority (HSA) said in a joint statement on April 9.\nThis included about 250 cases of people caught for these offences in schools and institutes of higher learning.\nSome 1,950 people were nabbed through intensified patrols in public areas such as the Central Business District, entertainment outlets and around shopping centres.\nSince March, all offenders, including first-time offenders in schools and institutes of higher learning, who are caught buying, using or possessing vapes face a fine of up to $2,000.\nDuring the first quarter of 2024, 40 vape-related cases were detected at the borders during joint operations. Of these, 10 people were caught for smuggling vapes into Singapore, while another 30 were found to be in possession of vapes.\nMeanwhile, the authorities said 16 social media services and e-commerce platforms have been warned for hosting vaping-related content.\nThey said each platform was issued a letter of notice on March 11 to remind them that hosting such content runs afoul of tobacco control rules.\nThey added: “The onus is on social media services and e-commerce platforms to exercise due diligence and proactively remove vaping-related content.\n“Enforcement actions may be taken against the platforms that are found with inadequate processes to detect and remove vaping-related contents.”\nThose convicted of importing, distributing, selling or offering vapes and their components for sale can face a fine of up to $10,000, or imprisonment of up to six months, or both for the first offence.\nFor the second or subsequent offence, they face a fine of up to $20,000, or imprisonment of up to 12 months, or both.\nMembers of the public who have information on the illegal possession, use, purchase, import, distribution, sale or offer for sale of e-vaporisers can contact HSA’s Tobacco Regulation Branch on 6684-2036 or 6684-2037.\nIn the coming months, HSA and the Immigration and Checkpoints Authority will continue to conduct more inter-agency operations at Singapore’s checkpoints, the joint statement said.\nTeen among five linked to vape bust\nOn Jan 17, HSA found two people peddling vapes at Northpoint City in Yishun.\nThis led to a raid of a warehouse at 31 Woodlands Close, where more than 81,000 vapes and related components valued at over $1.1 million were seized.\nFive people aged between 19 and 39 are assisting with investigations.\nLongest jail sentence for vape-related offences so far\nSee Hong Jian, 22, was sentenced on Feb 1 to a consolidated jail term of 10 months and fined $16,000 for the sale of vapes and related components.\nSee was apprehended in 2023 for his involvement in the sale of e-vaporisers.\nUpon further investigation, HSA officers identified and raided a warehouse unit, which led to a haul of over 140,000 vapes and components worth more than $3 million.\nSo far, five people, including See, linked to the operation have been convicted.\nOver $6m record seizure of vaping products\nOn March 19, following a roadblock by the police at St Andrew’s Road, two men were discovered to be transporting two packages of vapes in their car.\nHSA subsequently raided two warehouse units and found more than 400,000 e-vaporisers and components with a record street value of over $6 million.\nThis was the largest seizure of e-vaporiser products by HSA to date, exceeding the 2023 case, where more than $3 million worth of vapes and related components were seized.\nFive people aged 21 to 37 are currently assisting in the investigation.\nAnother four people, aged 22 to 38, were apprehended and referred to the police for attempting to break into the warehouse on March 23 and March 26 to try to steal the vapes and related components.", "url": "https://www.straitstimes.com/singapore/health/more-than-7-million-worth-of-vaping-components-vapes-seized-in-first-quarter-of-2024"}