{"authors": ["Aqil Hamzah"], "date_download": "2024-10-12 13:32:40", "date_modify": "2024-10-12 13:32:40", "date_publish": "2024-07-04 22:43:13", "description": "She sustained minor injuries and was taken to Tan Tock Seng Hospital. Read more at straitstimes.com.", "filename": "singapore_ion-orchard-shopper-hit-by-falling-ceiling-panel_1728739960.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/04/pageEFBC92.jpg?VersionId=Iw.7cqmPKw6waj1D.NV2BEZ3S.hBxMAK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_ion-orchard-shopper-hit-by-falling-ceiling-panel_1728739960.html", "title": "Ion Orchard shopper hit by falling ceiling panel", "title_page": "Ion Orchard shopper hit by falling ceiling panel | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A ceiling panel in the basement of Ion Orchard fell on the evening of July 3, hitting a shopper on the head and causing her to sustain minor injuries.\nIn response to queries, a spokesperson for the mall said the incident took place at about 7.50pm at Basement 2.\nA staff member attended to the shopper, identified as a 24-year-old woman by Chinese-language newspaper Lianhe Zaobao.\nShe was taken to Tan Tock Seng Hospital, said the Singapore Civil Defence Force. The woman is recuperating at home, added the Ion Orchard spokesperson.\nThe spokesperson said: “We are currently in touch with the individual... and will continue to render our assistance as necessary.”\nMeanwhile, the affected area has been cordoned off so that checks and repair work can be done.\nIon Orchard is investigating the cause of the incident and will take “proactive steps” to ensure shoppers’ safety and prevent such incidents from recurring, the spokesperson said.\nIn response to queries from The Straits Times, the Building and Construction Authority (BCA) on July 6 said its engineers had inspected the site and advised Ion’s owner to cordon off the affected area for repairs and to ensure all other ceiling panels in the building are secure.\nThe authority added that the maintenance of buildings is the responsibility of its owners. In particular, BCA does not regulate the maintenance of interior fittings like ceiling panels.", "url": "https://www.straitstimes.com/singapore/ion-orchard-shopper-hit-by-falling-ceiling-panel"}