{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:28:02", "date_modify": "2024-10-12 13:28:02", "date_publish": "2024-09-04 05:00:00", "description": "It was detected in April 2023 after a patient at SGH tested positive for Candida auris. Read more at straitstimes.com.", "filename": "singapore_singapore-researchers-discover-new-variant-of-highly-infectious-hospital-acquired-fungus_1728739682.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/jufungus03a.jpg?VersionId=UCy7jyXHHyWrEwC0gzVwtFZzPGy6PGi.&h=af8bac72", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-researchers-discover-new-variant-of-highly-infectious-hospital-acquired-fungus_1728739682.html", "title": "Singapore researchers discover new variant of highly infectious hospital-acquired fungus", "title_page": "Singapore researchers discover new variant of highly infectious hospital-acquired fungus | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Researchers in Singapore have discovered a new strain of Candida auris (C. auris), a highly resistant and easily transmissible fungus normally found in hospitals.\nBy uncovering the new strain early, not only will surveillance strategies be improved to keep a close watch on its emergence and contain the spread, but doctors can also sidestep an infection that could potentially close hospital wards and cause serious infections in vulnerable patients.\nThis discovery – by a team from the Singapore General Hospital (SGH), the Genome Institute of Singapore (GIS) at the Agency for Science, Technology and Research, and the National University of Singapore’s Yong Loo Lin School of Medicine – has brought the total number of C. auris clades, or groupings, known globally to six.\nThe new strain was detected in April 2023 after a patient at SGH tested positive for C. auris, which is commonly associated with overseas travel.\nBut the Singaporean had not been overseas for two years before he was admitted to the hospital.\nDr Karrie Ko, a consultant at the Department of Microbiology at SGH, told The Straits Times that the lack of travel history was among the points of interest that led to the investigation into this case.\n“We initially hypothesised that the fungus was from the East Asian clade II, but a culture of the fungus from this case grew at 42 deg C, which suggests it does not belong to this strain,” she said.\n“We then performed further biochemical testing, and the results did not fit with any existing clades (I to V). Hence, we proceeded to further investigations to determine if the genome was unique,” added Dr Ko.\nShe is also the genomics director of the Pathology Academic Clinical Programme under SingHealth and Duke-NUS Medical School.\nAfter finding out that the patient’s C. auris belonged to a clade that was genetically different from the existing five, the team looked through the hospital’s archive and found two other cases.\nOne was an Indonesian patient who had been shuttling between the healthcare systems of Singapore and Indonesia.\nThe other was a Bangladeshi patient who had since returned to his country.\nDr Ko added that no treatment was needed for the Singaporean patient as he had no known infection and was asymptomatic.\nTheir discovery was published in peer-reviewed medical journal The Lancet Microbe in July 2024.\nC. auris is a fungus that is highly transmissible and hard to get rid of.\nIt affects mostly patients with severe underlying medical conditions.\nThose with invasive medical devices, such as breathing or feeding tubes and catheters, tend to be at higher risk of getting C. auris and developing a range of infections, from superficial to more severe, life-threatening ones.", "url": "https://www.straitstimes.com/singapore/singapore-researchers-discover-new-variant-of-highly-infectious-hospital-acquired-fungus"}