{"authors": ["Andrew Wong"], "date_download": "2024-10-12 14:20:07", "date_modify": "2024-10-12 14:20:07", "date_publish": "2023-11-08 22:50:00", "description": "Religious leaders can also help to foster acceptance, peace and common humanity across religions in Singapore. Read more at straitstimes.com.", "filename": "singapore_important-for-religious-leaders-to-weigh-in-on-matters-that-concern-communities-shanmugam_1728742807.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/08/2023110860016913snapseed.jpg?h=87d0b679", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_important-for-religious-leaders-to-weigh-in-on-matters-that-concern-communities-shanmugam_1728742807.html", "title": "Important for religious leaders to weigh in on matters that concern communities: Shanmugam", "title_page": "Important for religious leaders to weigh in on matters that concern communities: Shanmugam | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Religious leaders can help to calm tension within their communities to maintain the inter-religious harmony that is unique to Singapore, Law and Home Affairs Minister K. Shanmugam said.\nThis comes amid the ongoing conflict in Gaza which began on Oct 7, when Hamas fighters launched an attack in Israel, killing around 1,400 people there.\nIsrael retaliated by bombing Gaza, with the Hamas-run health ministry saying that more than 10,000 have died so far, including more than 4,000 children.\nMr Shanmugam said the harmony in Singapore is precious, and everyone will have to play a part to uphold the peace.\nThis despite some comments made recently that religious leaders should not be involved in such issues, he said.\nSaid Mr Shanmugam: “I am at a loss to understand why some think this. This is not how we have the peace and harmony that we have today in Singapore.”\nHe was speaking to about 100 guests and members of the Inter-Religious Organisation (IRO), and religious leaders, at the screening of a locally produced film, Technologies Of The Soul, at One Raffles Quay on Wednesday. It is a documentary about religion and tradition within Singapore’s evolving technological society.\nMr Shanmugam pointed out that after the 9/11 attacks in the United States in 2001, the then Mufti of Singapore, Mr Syed Isa Semait, condemned the act and emphasised that suicide bombings are against the teachings of Islam.\nIn 2014, Singapore Archbishop William Goh issued guidance on how to pray for victims of the escalating violence in Gaza, as well as how to help with financial aid.\nThat year, Israel invaded Gaza over a period of 50 days. More than 2,200 Palestinians, 66 Israeli soldiers and five Israeli civilians were killed.\n“So it’s quite usual, and indeed important, for religious leaders to weigh in on matters that concern people in their communities,” Mr Shanmugam said.\nReligious leaders can also help foster acceptance, peace and common humanity across religions in Singapore.\nHe said: “We draw the line between religion and politics, but it’s important that religious leaders give guidance to their communities on prayer, on assisting, on how they can help others in distress.”\nThis has been one of the key reasons the situation in Singapore has managed to remain calm, he pointed out.\nJust a week after the Israel-Hamas war started, Chief Rabbi Mordechai Abergel and the Mufti of Singapore, Dr Nazirudin Mohd Nasir, exchanged letters to affirm the friendship between Jews and Muslims in Singapore.\nMr Shanmugam said: “We have also seen how rhetoric by religious leaders can inflame, rather than reduce tensions.”\nHe added: “People in the region say, that if you’re not a Muslim, it is difficult to be of that country’s nationality – in Malaysia or Indonesia; or if you are not a Buddhist, it is difficult for you to be accepted as a Thai, and so on.\n“But in Singapore, people say it doesn’t matter what religion you are, you can be a Singaporean.”\nDeputy Prime Minister Lawrence Wong said in Parliament on Monday that eight police reports of offensive remarks or actions targeted at the Jewish and Muslim communities here were lodged in October, about the same as the number of cases reported between January and September.\nRegional Internet traffic on extremist sites has gone up threefold since the conflict started on Oct 7, he added.\nIn comparison, more than 1,000 anti-Semitic acts have been reported in France since Oct 7, and there has been a 10-fold increase in anti-Muslim sentiment in Australia since the start of the conflict, Mr Shanmugam said.\nThe Government has also seen more anti-Singapore rhetoric, including violent threats against Singapore by regional extremist elements online, Mr Wong said in Parliament.", "url": "https://www.straitstimes.com/singapore/important-for-religious-leaders-to-weigh-in-on-matters-that-concern-communities-shanmugam"}