{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:38:07", "date_modify": "2024-10-12 13:38:07", "date_publish": "2022-10-25 09:58:11", "description": "Low-carbon hydrogen is regarded as an increasingly promising solution to fight climate change and boost energy security. Read more at straitstimes.com.", "filename": "singapore_low-carbon-hydrogen-could-supply-singapore-s-energy-needs-by-2050_1728740287.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/26/2021122855617740f074dc42-5647-4716-9fb6-bdfaffe9833f_0.jpg?VersionId=sfuWYQ9GPQDVHaFZAe45RcsPcd6I70rz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_low-carbon-hydrogen-could-supply-singapore-s-energy-needs-by-2050_1728740287.html", "title": "Low-carbon hydrogen could supply Singapore’s energy needs by 2050", "title_page": "Low-carbon hydrogen could supply Singapore’s energy needs by 2050 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Low-carbon hydrogen could supply up to half of Singapore’s power needs by 2050, and play a key role in helping the Republic achieve net-zero emissions by mid-century.\nHydrogen can be used as a low-carbon fuel or feedstock, releasing little to no greenhouse gas when burned. When produced through the electrolysis of water using renewable energy, hydrogen could have close to zero emissions.\nDelivering the Singapore Energy Lecture at the start of the Singapore International Energy Week on Tuesday, Deputy Prime Minister Lawrence Wong said that low-carbon hydrogen is being seen as an increasingly promising solution.\n“While the technology and supply chains are still nascent, momentum has picked up substantially in recent years. Global investment in low-carbon hydrogen has increased exponentially, backed by policies from countries around the world to accelerate its production and usage,” Mr Wong said.\nThere is now a growing pipeline of production projects worldwide, and key technologies being trialled are expected to become commercially available in the coming years, he noted.\nAs a result, these developments have given the authorities confidence that low-carbon hydrogen can be the “next frontier” in domestic efforts to reduce Singapore’s emissions, alongside other renewable energy sources domestically, such as solar power, and electricity imports.\nThis comes as Singapore has raised its climate ambition, committing to net-zero emissions by 2050, the Government said on Tuesday. Singapore’s greenhouse gas emissions will also reach 60 million tonnes by 2030 after peaking earlier this decade. Emissions were previously forecast to peak at around 65 million tonnes by 2030.\nThe power sector accounts for about 40 per cent of Singapore’s emissions. While a report released by the Energy Market Authority in March had low-carbon hydrogen as a potential solution to helping Singapore achieve net-zero emissions by 2050, this would require strong global cooperation, and for energy and digital technologies to develop rapidly enough.\nWith land constraints and limited resources, the bulk of low-carbon hydrogen would likely have to come from imports.\nMr Wong noted that low-carbon hydrogen could also decarbonise sectors that cannot be easily electrified – for instance, hydrogen could be used as a feedstock in semiconductor plants and petrochemical processes.\n“Besides lowering emissions, it also allows companies to produce sustainable products that could fetch a green premium,” he added.\nIn addition, hydrogen could also be used to produce low-carbon fuels in the maritime and aviation sectors.\nTo prepare for the deployment of hydrogen domestically and to build a hydrogen supply chain in Asia, Singapore will experiment with advanced hydrogen technologies that could soon be commercially ready.\nIn this regard, an expression of interest for a small-scale commercial project using low-carbon ammonia for power generation will be launched. Ammonia can be produced from green hydrogen and is regarded as a potential fuel source for power generation and transport, particularly in the maritime sector.\n“With this, Singaporeans may start to have access to electricity generated from low-carbon hydrogen from 2027. Through this project, we also hope to catalyse the development of ammonia supply chains for marine bunkering needs,” said Mr Wong.\nThese projects will allow the authorities to assess the viability of ammonia – both as a hydrogen carrier and as a direct fuel – to develop regulations and an ecosystem to support it, said the Ministry of Trade and Industry in a statement on Tuesday.\nAn MTI spokesman told The Straits Times that the key proposition for ammonia is the relative maturity of technologies to store and transport it, as well as its potential to be used directly in both the power and maritime sectors.\n“Ammonia cracking will require energy input, as with the reconversion of other carriers back to hydrogen. The Government will work closely with industry to co-develop safety and industry regulations for the use of ammonia,” the spokesman added.\nStringent safety protocols will need to be adhered to when handling ammonia, as it produces nitrogen oxide – a poisonous gas and also a powerful greenhouse gas – when burned.\nMethods of transportation include liquefying hydrogen, for instance, which is known to be energy-intensive, and the technology for the large-scale shipping of liquefied hydrogen is still relatively nascent.\nMTI said that it is closely monitoring developments in this area, and will work with its industry and research community to see which areas of research Singapore can engage in to help advance the technology.\nOn the other hand, liquid organic hydrogen carriers (LOHCs) allow hydrogen to be stored and transported in ambient conditions. However, the process required to release hydrogen from LOHCs at its destination can be land- and energy-intensive.\nThe ministry will continue to monitor the “readiness and industry uptake” of other hydrogen transportation methods, and assess the relevance to Singapore’s projects and, where appropriate, launch projects to experiment with these methods.\nResearch and development work will be furthered to advance these hydrogen technologies – with hydrogen as a key focal area of phase two of the Low-Carbon Energy Research Programme, said Mr Wong.\nIn October last year, $55 million in projects were awarded for research in low-carbon technologies, ranging from carbon capture and utilisation technology to hydrogen.\nA further $129 million will be set aside for phase two of the programme, which will unlock key technological bottlenecks so that Singapore is able to import, handle and utilise low-carbon hydrogen safely and at scale.\nThe Republic will also be developing new infrastructure to import, store and transform hydrogen into power. The relevant land and infrastructure plants will be developed and implemented accordingly, said MTI.\nThe ministry will also be working with industry partners and the education sector to support workforce training – to provide opportunities along the hydrogen supply chain, from financing to trading and the storage and deployment of hydrogen.", "url": "https://www.straitstimes.com/singapore/low-carbon-hydrogen-could-supply-singapore-s-energy-needs-by-2050"}