{"authors": ["Tham Yuen-C"], "date_download": "2024-10-12 14:21:30", "date_modify": "2024-10-12 14:21:30", "date_publish": "2023-07-14 18:00:00", "description": "A special task force will be established to draw up the terms of reference and broad areas of cooperation. Read more at straitstimes.com.", "filename": "singapore_politics_singapore-johor-discuss-setting-up-special-economic-zone_1728742890.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/14/2023071468459495img0081_3.jpg?VersionId=DbKL_2q82F_9vquaqunwFKoqujN1iEvT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_singapore-johor-discuss-setting-up-special-economic-zone_1728742890.html", "title": "Singapore and Malaysia discuss setting up Johor-Singapore special economic zone", "title_page": "Singapore and Malaysia discuss setting up Johor-Singapore special economic zone | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore and Malaysia are in talks to establish a special economic zone in Johor and the Republic to drive growth and strengthen connectivity and collaboration, said Minister for National Development Desmond Lee on Friday.\nA special task force will be set up under the Malaysia-Singapore Joint Ministerial Committee for Iskandar Malaysia (JMCIM) to study the Johor-Singapore Special Economic Zone, he added.\nThe task force, led by Singapore’s Ministry of Trade and Industry and Malaysia’s Ministry of Economy, will work out the terms of reference and broad areas of collaboration for the zone.\nIt will report its progress to Prime Minister Lee Hsien Loong and his Malaysian counterpart Anwar Ibrahim at the Singapore-Malaysia Leaders’ Retreat in October, Mr Desmond Lee and Malaysian Minister of Economy Rafizi Ramli said at a joint press conference in Shangri-La hotel. They made the announcement on the sidelines of the JMCIM meeting, an annual event for the two countries to review cooperation in the South Johor economic zone of Iskandar.\nFriday’s meeting, the 16th so far, was co-chaired by Mr Lee and Mr Rafizi. Also present were Acting Minister for Transport Chee Hong Tat and Johor Menteri Besar Onn Hafiz Ghazi.\nThe special economic zone will build on the strong growth of Johor and significant investments in the region by Singapore, said the JMCIM in a press statement.\nJohor recorded RM70.6 billion (S$20.6 billion) worth of foreign investments in 2022 alone, across various sectors including electrical and electronics, medical equipment, food manufacturing and data centres, with Singapore being the second-largest foreign investor.\nThe Republic contributed around 70 per cent of Johor’s total foreign direct investment in the manufacturing sector, said the JMCIM.\nMr Lee said the special economic zone, which both sides strongly support, will build on the strengths and attractiveness of both Johor and Singapore and bring tangible benefits in terms of jobs and livelihoods for people on both sides.\nHe added that the areas of cooperation will follow from what has been done under the JMCIM, such as in transport connectivity, innovation, business ecosystem, environment, tourism, and technical and skills training.\nMr Rafizi, who has long pushed for the setting up of an economic region between Singapore and Johor, said investors and businesses will “understand the value proposition” of the economic zone. He added that work will be done to harmonise immigration and Customs processes to allow for “much better movement of people and goods”.\nIn May, Mr Rafizi indicated that renewable energy could be an area of cooperation in the upcoming special economic zone.\nJohor has the potential to be the biggest beneficiary of Malaysia’s focus on the energy sector’s shift from fossil fuels to renewables, given its proximity to Singapore, he said. This is supported by Malaysia’s announcement that month that it would lift its export ban on renewable energy, added Mr Rafizi, according to a Bernama news agency report.\nOn Friday, officials from both sides also discussed launching an additional ferry service between Johor and Singapore to improve transport links. This comes after ferry services were rolled out between Singapore and Tanjung Pengelih in December 2022, and between Singapore and Desaru in July 2022.\nThe JMCIM said both ferry services have been well received by travellers, and commercial operators in Singapore and Malaysia will be starting discussions to assess the viability of a potential new service between Puteri Harbour and Tuas.\nMeanwhile, the committee’s transportation links work group has agreed in principle to increase the frequency of the KTM Tebrau Shuttle between Johor Bahru and Woodlands.\nThe train service now runs 31 trips daily, and this will go up to 36 after agencies from both sides work out further details, said the JMCIM.\nIt also noted the good progress of works on the Johor Bahru-Singapore Rapid Transit System Link on both sides.\nOn the tourism front, the committee’s tourism work group is exploring potential collaboration on cultural trails and joint events to leverage the shared heritage between Singapore and Johor.", "url": "https://www.straitstimes.com/singapore/politics/singapore-johor-discuss-setting-up-special-economic-zone"}