{"authors": ["Sandra Davie"], "date_download": "2024-10-12 13:45:05", "date_modify": "2024-10-12 13:45:05", "date_publish": "2019-03-05 11:39:15", "description": "MOE will start full subject-based banding in about 25 schools next year and progressively apply it to all secondary schools. Read more at straitstimes.com.", "filename": "singapore_education_streaming-into-normal-and-express-in-secondary-schools-to-stop-in-2024-to-be_1728740705.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/03/05/asboonlay0503.jpg?VersionId=FjtFZP7KDgsyWlSH4iVPW7taudbxNh1r", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_education_streaming-into-normal-and-express-in-secondary-schools-to-stop-in-2024-to-be_1728740705.html", "title": "Streaming into Normal and Express in secondary schools to stop in 2024; to be replaced by full subject-based banding", "title_page": "Streaming into Normal and Express in secondary schools to stop in 2024; to be replaced by full subject-based banding | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Forty years after streaming was introduced in secondary schools, the Education Ministry has taken the momentous step to do away with the Normal (Technical), Normal (Academic) and Express streams.\nInstead, there will be full subject-based banding, in which students will take up subjects at higher or lower levels, based on their strengths.\nThe ministry will start full subject-based banding in about 25 schools next year and progressively apply it to all secondary schools, with streaming to end in 2024.\nInstead, all Sec 1 students in the 2024 batch - the Primary Two cohort this year - will take subjects based on their ability and strengths. Subjects such as mathematics will be taught at three levels - G1, G2 and G3, with G standing for \"General\". G1 will roughly correspond to today's N(T) standard, G2 to N(A) standard, and G3 to Express standard.\nWhen they reach Sec 4 in 2027, the students will take a common national examination and graduate with a common secondary school certificate, Education Minister Ong Ye Kung said in Parliament on Tuesday (March 5) during the debate on the ministry's budget.\n\"It will list the subjects completed and the standard band of each subject,\" he added. \"Singapore and Cambridge will co-brand this new certificate, as both are strong international brand names in education, which will enhance the recognition and value of the certificate.\"\nTo the audible approval from the House, he said: \"With full subject-based banding implemented, form classes reorganised across the board, and a combined secondary education certificate, we would have effectively merged Express, N(A) and N(T) streams into a single course. The Express, N(A) and N(T) streams, and their labels, will therefore be phased out.\n\"So from three education streams, we will now have 'One secondary education, many subject bands'. We will no longer have fishes swimming down three separate streams, but one broad river, with each fish negotiating its own journey.\"\nWith students taking up subjects of varying combinations, the ministry hopes that schools will use the opportunity to group students in different ways and not according to their abilities. This will bring about more social mixing and encourage students to help one another. He cited Boon Lay Secondary, which organises its form classes according to Co-Curricular Activities rather than academic streams, and Edgefield Secondary, where classes include students from all three streams.\nExplaining why the ministry was doing away with the Normal and Express streams, Mr Ong said streaming was introduced 40 years ago during an \"efficiency-driven phase\" to cut down on student dropout rates. Attrition rates have come down from about a third of every cohort in the 1970s, to less than 1 per cent now.\nMany parents and students have also begun to see the benefit of students learning at a pace and rigour suited to their abilities.\nBut the ministry recognises that there are downsides to streaming, said Minister Ong.\nHe said there is always \"some margin of error\", especially if streaming is done at a young age.\nAlso, streaming assumes that students need a certain pace of learning in all their subjects, whereas many students have uneven strengths in different subjects.\n\"More importantly, entering a stream that is considered 'lower' can carry a certain stigma or be self-limiting. Students can develop a mindset where they tell themselves, 'I am only a Normal stream student, so this is as good as I can be',\" he said, noting that over the years, several MPs have brought up these pernicious effects of streaming.\nMr Ong said that with the change to full subject-based banding, the ministry wants to help students to continue \"benefitting from a differentiated curriculum, while minimising the unintended consequences of labelling and the stigmatisation associated with streaming\".\nHe said the emphasis of the education system has evolved over the years, from an efficiency-driven system to one that develops the varied abilities of students.\nIn the digital era, the focus has to change, as knowledge has become very accessible and skills carry a premium and \"inoculate us from being replaced by computers and robots\".\nBut skills take a lifetime to acquire and hone, and one must be driven by passion to do so. Hence the thrust now to \"learn for life\". The \"one secondary school education, many subject bands\" is another step in this direction.\nHe said the move to do away with streams is not the culling of a sacred cow, but rather an incremental move.\nThe Education Ministry started a form of subject-based banding more than a decade ago, allowing students in the N(A) and N(T) streams to take up to two subjects at a higher level starting from Sec 3, if they had done well in those subjects in their first two years.\nOver the years, subject-based banding was gradually extended.\nIt was piloted in 12 schools in 2014, and Mr Ong said the results have been encouraging. About half of the N(A) students in the pilot schools took up subjects at the Express level - a quarter took one subject, another 11 per cent took two subjects, and more than 10 per cent took three subjects, or were laterally transferred to the Express stream, he explained.\n\"If we had included mother tongue, the numbers would be even higher. The numbers for N(T) students taking N(A) level subjects were quite similar.\"\nAnd the two batches of students who took higher-level subjects have performed comparably to their Express counterparts, Mr Ong revealed.\n\"To illustrate, for the national examinations in 2018, 25 per cent of Sec 4 N(A) students who took O-level English got A1 or A2, compared to 24 per cent for Express students. For O-level maths, 26 per cent of N(A) students got A1 or A2, compared to 50 per cent for Express students. For O-level combined science, it was 33 per cent for N(A), compared to 34 per cent for Express students.\n\"The Normal stream students have held their own.\"\nGiven the positive outcomes, it is time to expand subject-based banding to all secondary schools.\nMr Ong said: \"We have been grappling with this trade-off - between customisation and stigmatisation. This has to be our attitude when it comes to education - never complacent, always anticipating the future, figuring out what needs to change next, planning it out, and implementing at a pace that takes into account the trade-offs, complexities, and the immense impact any changes will have on students.\n\"We should never stay frozen for a long period, only to make sudden big changes years later. So any change analogous to the slaughtering of any animal is most likely a bad idea.\"\nHe ended his speech by saying that in making this change, the ministry is developing a child with the knowledge that the pace of his or her learning changes over time, all the way to adulthood, and acting on the conviction that students benefit most when there is diversity across schools and within schools.\n\"Above all, we are guided by our belief that no child's fate is fixed, and in an environment that encourages growth and development, and promotes holistic education, they will fulfil their potential to be sons and daughters of Singapore whom we are proud of.\"", "url": "https://www.straitstimes.com/singapore/education/streaming-into-normal-and-express-in-secondary-schools-to-stop-in-2024-to-be"}