{"authors": ["Lester Wong"], "date_download": "2024-10-12 13:46:15", "date_modify": "2024-10-12 13:46:15", "date_publish": "2020-03-18 22:23:38", "description": "SINGAPORE - There are plans to convert normal wards into isolation wards, and quarantine facilities could be converted into care centres for Covid-19 patients with less severe symptom, if the number of cases here continue to rise, said Health Minister Gan Kim Yong said on Wednesday (March 18). Read more at straitstimes.com.", "filename": "singapore_coronavirus-plans-to-convert-normal-wards-to-isolation-wards-turn-quarantine-facilities_1728740775.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/03/18/md-ward-1803.jpg?VersionId=Yd2RoJJLQIYgqhQrEiHI8n.Ff3C4jHYM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_coronavirus-plans-to-convert-normal-wards-to-isolation-wards-turn-quarantine-facilities_1728740775.html", "title": "Coronavirus: Plans in place to turn normal wards into isolation wards, quarantine facilities into care centres for patients, says Gan Kim Yong", "title_page": "Coronavirus: Plans in place to turn normal wards into isolation wards, quarantine facilities into care centres for patients, says Gan Kim Yong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - There are plans to convert normal wards into isolation wards, and quarantine facilities could be converted into care centres for Covid-19 patients with less severe symptoms if the number of cases here continue to rise, said Health Minister Gan Kim Yong said on Wednesday (March 18).\nNon-Covid patients could also be transferred to private hospitals to free up capacity at public hospitals, he said.\n\"There are various plans for us to expand the capacity. Today I visited Tan Tock Seng Hospital and the National Centre for Infectious Diseases. They have contingency plans to turn normal wards into isolation wards,\" Mr Gan said.\nThere are also plans \"to convert some of our quarantine facilities for the less severe cases, including those recovering from Covid 19. We just want to make sure they are safe\", he said.\nSingapore announced 47 new cases on Wednesday, an record single-day high here that brings the total number of cases to 313.\nMr Gan outlined the plans when asked, during a press conference, if Singapore's healthcare system was close to hitting the limit of its capacity.\nThe co-chair of a government task force to fight the coronavirus, Mr Gan said that Singapore still had sufficient buffer to cope with the increase in the number of new patients.\nHe emphasised that any adjustments made to Singapore's strategy to deal with the virus would have to be progressive and gradual.\nHe said: \"We have a few options. Currently, close to 80 per cent of the cases we see that do not need much support or medical attention are kept in hospitals for various reasons such as for isolation purposes... the bulk of these can be housed elsewhere.\"\n\"One possibility is to look at some long-term care facilities that come with sufficient safeguards because they are medical facilities, or converting quarantine facilities that can provide minimal medical care, including swabs and some attention to medical needs,\" Mr Gan said.\nHe added that arrangements can be made to move patients back to hospitals nearby if their conditions worsen.\nMr Gan said there is also collaboration with private hospitals \"to see if we can send some non-Covid patients to them\".\nHe added: \"We already have ongoing collaborations. Some of these can be stepped up so that we can preserve capacity in our public hospitals. Some private hospitals also are equipped to handle Covid patients....We must underline emphasis on one healthcare system.\"\nEven as various options are being considered, Singapore must not be complacent, the Health Minister stressed.\nMr Gan said: \"I still need to emphasise that although we have a buffer and there are plans to expand this buffer, we must do all we can to reduce the number of new cases and flatten the curve.\"", "url": "https://www.straitstimes.com/singapore/coronavirus-plans-to-convert-normal-wards-to-isolation-wards-turn-quarantine-facilities"}