{"authors": ["Anne Chan Min"], "date_download": "2024-10-12 13:57:44", "date_modify": "2024-10-12 13:57:44", "date_publish": "2023-06-19 10:50:00", "description": "One project takes stock of Singapore's blue carbon and the other is on building coral reef resilience. Read more at straitstimes.com.", "filename": "singapore_two-new-marine-climate-projects-awarded-grants-under-25m-research-programme_1728741464.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/19/rrdesmond1906_3.jpg?VersionId=ulCn2qpM7iCDAact02n7UBEwmzjfj.XI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_two-new-marine-climate-projects-awarded-grants-under-25m-research-programme_1728741464.html", "title": "Two new marine climate projects awarded grants under $25m research programme", "title_page": "Two new marine climate projects awarded grants under $25m research programme | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A study taking stock of the carbon dioxide stored in Singapore’s coastal and marine ecosystems, and another on building coral reef resilience, are the first projects to be awarded grants under a $25 million marine climate research programme.\nThis was announced by National Development Minister Desmond Lee on Monday at the opening of the fifth Asia-Pacific Coral Reef Symposium.\nSupported under the Marine Climate Change Science (MCCS) programme launched by the National Parks Board (NParks) in 2021, these research projects “will enhance our capacity to safeguard critical marine habitats, and to tap nature-based solutions to adapt to climate change”, said the minister.\nThe first project focuses on accounting for Singapore’s blue carbon, which is the carbon dioxide captured by oceans and coastal ecosystems including mangroves, seagrasses and salt marshes.\nIt will create a database of where the country’s blue carbon ecosystems are, how much blue carbon can be stored, and how blue carbon ecosystems have changed over the years.\nAssistant Professor Tang Hao of the National University of Singapore (NUS) hopes to use the data collected to show the potential of blue carbon in contributing to Singapore’s greenhouse gas reporting and national targets for climate change mitigation.\nBlue carbon sinks are able to remove large amounts of greenhouse gases from the atmosphere at a rate up to 10 times that of terrestrial forests – making them powerhouses in tackling global warming.\nFurthermore, they provide protection for threatened coastal vegetation, thereby playing a critical role in biodiversity conservation.\nProf Tang noted that Singapore’s blue carbon ecosystem holds latent potential in developing a carbon economy.\n“We will be able to explore the possibility of seeing carbon credits creation,” he said, adding that further discussions with government agencies and industry partners are required.\nThe second project given the MCCS grant aims to build the resilience of coral reefs to climate change.\nLed by NUS Associate Professor Huang Danwei, the study involves developing more efficient coral-culturing methods to produce corals maximised for survival by increasing their tolerance to fluctuating environmental conditions.\nThese bioengineered corals hosting beneficial microbes will then be transplanted into native reefs to restore degraded marine habitats.\nThis is especially important given that Singapore’s waters are home to around 250 – or 32 per cent – of the 800 species of corals worldwide.\nProf Huang’s research will contribute to NParks’ Species Recovery Programme, which aims to conserve threatened native species through habitat protection and enhancement.", "url": "https://www.straitstimes.com/singapore/two-new-marine-climate-projects-awarded-grants-under-25m-research-programme"}