{"authors": ["Yong Li Xuan"], "date_download": "2024-10-12 13:47:30", "date_modify": "2024-10-12 13:47:30", "date_publish": "2023-11-28 13:00:00", "description": "A regular at the mall said the water seemed to be “very dirty” with bubbles and “mud-like particles”. Read more at straitstimes.com.", "filename": "singapore_faulty-pipe-caused-water-leakage-and-very-bad-odour-at-jem-mall_1728740850.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/28/rrjem2811.jpg?h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_faulty-pipe-caused-water-leakage-and-very-bad-odour-at-jem-mall_1728740850.html", "title": "Faulty pipe caused water leakage and ‘very bad odour’ at Jem mall", "title_page": "Faulty pipe caused water leakage and ‘very bad odour’ at Jem mall | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A “faulty F&B pipe” caused water to rain down from the ceiling and pool outside some shops at Jem mall in Jurong East on Nov 25.\nA spokesperson from Lendlease, which manages the mall, told The Straits Times that “immediate action was taken to identify the source of the issue”.\nRepair works were completed by the afternoon of Nov 26, the spokesperson said, and affected tenants are being assisted.\n“Of the tenants affected, only one is unable to resume trading. We are working closely with and rendering assistance to the tenant,” the spokesperson said on Nov 27, but did not respond to queries about how many tenants were affected by this incident and what an F&B pipe is.\nMr Herman Teo, 37, said he and his wife had left the cinema at Jem at about 10.40pm when his wife remarked that it sounded like it was raining.\nWalking towards an exit on the first floor, they were surprised to see that the sound came from water falling from the ceiling in the shopping mall.\nMr Teo said the water had a “very bad, faecal odour” and seemed to be “very dirty”, with bubbles and “mud-like particles”.\nHis wife was afraid of getting rained on, he added.\nThe public servant, who works in the office tower at Jem and lives next to the mall, said he observed the situation for about 20 minutes before leaving because he often eats at the mall and it is like a “second home”.\n“The volume was large enough to cause water to flow towards Scoop Wholefoods on one side and Chicha San Chen on the other,” he added.\nVideos of the incident show water pooling outside several shops including 4Fingers, Scoop Wholefoods Singapore, Awfully Chocolate, Chicha San Chen and Tempura Makino.\nMr Teo said most shops were closed by then, but he saw some employees moving electronics such as television screens away from the water, while others used mops to clear the water out of the store.", "url": "https://www.straitstimes.com/singapore/faulty-pipe-caused-water-leakage-and-very-bad-odour-at-jem-mall"}