{"authors": ["Nirmal Ghosh"], "date_download": "2024-10-12 13:46:48", "date_modify": "2024-10-12 13:46:48", "date_publish": "2024-06-02 18:00:00", "description": "Local solutions are critical for vulnerable millions as the scorching heat rapidly melts snow and ice across the fragile \"third pole\". Read more at straitstimes.com.", "filename": "singapore_environment_why-the-warming-himalayas-are-a-water-crisis-for-half-of-asia_utm_campaign=ST_Newsletter_ASIANINSIDER_1728740808.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/02/IMGCUEGPEP124.jpg?VersionId=B9Qng_FkPMDsfT82yi0XbMoCDsaPxQU3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_why-the-warming-himalayas-are-a-water-crisis-for-half-of-asia_utm_campaign=ST_Newsletter_ASIANINSIDER_1728740808.html", "title": "Why the warming Himalayas are a water crisis for half of Asia", "title_page": "Why the warming Himalayas are a water crisis for half of Asia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The meltdown is expanding existing glacial lakes and forming new lakes. In April, the Indian Space Research Organisation (ISRO) revealed long-term satellite imagery showing that glacial lakes have significantly expanded since the mid-1980s.\nIn the fragile and unstable ecosystem - the Himalayas are among other things seismically active - these lakes are prone to bursting their banks and unleashing deadly floods downstream.\nOne such glacial lake outburst flood in the northern Indian state of Sikkim in October 2023, destroyed a dam and 33 bridges downstream, killing scores of people.\nBut such disasters are only part of growing problems in the Himalayas, where water crises are also driving migration.\nWater crisis\n“It’s all about water” Kathmandu-based Kunda Dixit - publisher of Nepali Times and visiting faculty at NYU in Abu Dhabi where he lectures on climate - told ST’s Green Pulse podcast.\n“And it’s not as if there’s not enough water,” he said. “There’s plenty of water, it’s just that it’s not where it’s needed.”\nThe media tends to focus on snow and ice because it is more visible and easily measured, Mr Dixit said. But springs from underground aquifers are running dry, contributing to migration from the mountains as agriculture becomes no longer tenable. Some districts in Nepal have seen a 30 per cent reduction in population.\nThis is in some cases good for the mountain ecology; it enables forests to recover. Conversely however, more forests mean more fuel for forest fires. And migration also means new social challenges for those forced to migrate to survive.\nGiven the complexities and the water stress, local solutions are becoming more critical for vulnerable populations, said Dr Bandana Shakya - also based in Kathmandu - who coordinates the Landscapes portfolio at the International Centre for Integrated Mountain Development (ICIMOD).\nThese solutions include simple techniques for construction of trenches, terraces and check dams to slow down water run-off, and store and recharge underground water, she told Green Pulse, speaking alongside Mr Dixit.\nIt remains important not to impose solutions from the outside, but to co-design them together with communities that have traditionally always adapted to the harsh environment.\nBetter media focus\nThat large parts of the Himalayas are in a food deficit situation - contributing to migration - is largely a failure of governance, with climate change often a convenient excuse.\n“We tend to blame everything on climate change... even stuff that’s not really related to the climate crisis,” Mr Dixit warned. “It’s a very convenient excuse for governments to say, that’s because of the climate.”\nFarmers are thus left building resilience by themselves, with a little bit of help from outside. Meanwhile, Nepal and other Himalayan states remain ill-prepared for what is in store as the so-called “third pole” heats up.\nThis makes it incumbent on the media as well, to tread carefully and help highlight solutions instead of just focusing on climate anxiety.\n“Mountain people are resilient, they have always been resilient, they have traditional know-how, and they have been trying different measures to cope with change,” Dr Shakya said.\n“There is hope, there is always hope. This is the support that we seek from media.”\n---\nProduced by: Nirmal Ghosh (nirmal@sph.com.sg) and Fa’izah Sani\nEdited by: Fa’izah Sani", "url": "https://www.straitstimes.com/singapore/environment/why-the-warming-himalayas-are-a-water-crisis-for-half-of-asia?utm_campaign=ST_Newsletter_ASIANINSIDER"}