{"authors": ["Christie Chiu"], "date_download": "2024-10-12 13:32:34", "date_modify": "2024-10-12 13:32:34", "date_publish": "2023-10-07 11:25:00", "description": "The amount of heroin seized is enough to feed the addiction of about 1,170 abusers for a week. Read more at straitstimes.com.", "filename": "singapore_three-arrested-for-alleged-drug-offences-over-259k-worth-of-heroin-seized_1728739954.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/07/aadrugs07102023.jpg?h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_three-arrested-for-alleged-drug-offences-over-259k-worth-of-heroin-seized_1728739954.html", "title": "Three arrested for alleged drug offences, more than $259k worth of heroin seized", "title_page": "Three arrested for alleged drug offences, more than $259k worth of heroin seized | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Three individuals have been arrested for suspected drug offences, with heroin valued at more than $259,000 seized.\nThe amount of heroin seized is enough to feed the addiction of about 1,170 abusers for a week, the Central Narcotics Bureau (CNB) said in a statement on Saturday.\nOn Thursday evening, CNB officers arrested a 47-year-old Singaporean man at the void deck of a residential block near Bedok North Street 3 for suspected drug trafficking offences.\nThe man was then escorted to a unit of a nearby residential block.\nAfter entering the unit, officers arrested a 57-year-old Singaporean man and 31-year-old foreign woman for suspected drug trafficking offences.\nThe police subsequently conducted a search and seized a total of about 2,464g of heroin and drug utensils in the unit.\nA person found guilty of trafficking more than 15g of pure heroin may face the mandatory death penalty, the statement said.\nIn 2022, drugs with a total estimated street value of $14.04 million were seized. These included 67.17kg of heroin and 26.75kg of Ice, or methamphetamine. In 2021, CNB seized 95.43kg of heroin and 49.95kg of Ice.\nThe number of new drug abusers nabbed in 2022 decreased by 15 per cent to 797, compared with 936 in 2021.\nNonetheless, CNB director Sam Tee called for a clear zero-tolerance stand against drug abuse, saying people should speak out against it.\n“Singapore’s focus is on building a drug-free society, not a drug-tolerant one,” he said.\n“As a small nation, we can ill afford the societal devastation that can be caused by widespread drug addiction as witnessed in other countries.”\nInvestigations are ongoing.", "url": "https://www.straitstimes.com/singapore/three-arrested-for-alleged-drug-offences-over-259k-worth-of-heroin-seized"}