{"authors": ["Shintaro Tay"], "date_download": "2024-10-12 13:31:44", "date_modify": "2024-10-12 13:31:44", "date_publish": "2024-06-27 05:00:00", "description": "Over 50 places were lit up in support of the International Day Against Drug Abuse and Illicit Trafficking. Read more at straitstimes.com.", "filename": "singapore_green-lighting-across-singapore-to-mark-a-drug-free-world_1728739904.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/27/2024062632258349369b05dc-2a4a-4431-b2f5-099b85b917b3.jpg?VersionId=b9IkfMun9E3DxUaXJ0se11rJAvfe0rqw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_green-lighting-across-singapore-to-mark-a-drug-free-world_1728739904.html", "title": "Singapore lights up in green to mark drug-free world", "title_page": "Singapore lights up in green to mark drug-free world | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Iconic landmarks around the island were illuminated in green and white – the colours of the anti-drug cause – in a show of solidarity with DrugFreeSG Light-Up 2024 on June 26.\nMore than 50 places islandwide were lit up between 7.30pm and midnight in support of the International Day Against Drug Abuse and Illicit Trafficking, which falls on June 26 every year.\nThis is the seventh edition of the event, organised by the Central Narcotics Bureau (CNB) to demonstrate the community’s support for a drug-free world.\nSix new locations were added in 2024, such as the headquarters of the Ministry of Communications and Information, Ministry of Education and People’s Association, as well as Ngee Ann City, Wisma Atria and the NTUC Centre.\nGreen and white are the colours on the Anti-Drug Ribbon to symbolise health, vitality and strength. The ribbon was first launched in the 1996 National Anti-Drug Abuse Campaign, organised under the banner of the National Council Against Drug Abuse.\nMembers of the public also participated in the DrugFreeSG Light-Up by festooning their windows with green fairy lights given out at the inaugural Drug Victims Remembrance Day roving exhibitions held between May and July.\nIn 2023, the number of drug abusers arrested in 2023 rose by 10 per cent to 3,122, from 2,826 in 2022. Of those arrested in 2023, 952 were new drug abusers, a 19 per cent increase from the 802 in 2022, according to updated figures from CNB.\nMore than half of the new abusers arrested were below the age of 30. Among them were six 14-year-olds, who were the youngest abusers to be arrested.\nMs Nur Azlinda Zulkifli, 37, a former offender who is now an anti-drug advocate for CNB, lit up her home with green fairy lights to commemorate the occasion.\n“I felt that I should take this chance to remember all those who are affected by drug abuse, especially family members who became the victims,” said Ms Azlinda.\nShe added: “Always consider the choice and think of the consequences of how it will affect your family and people around you. Drugs destroy your health and life, and prevention is better than cure.”", "url": "https://www.straitstimes.com/singapore/green-lighting-across-singapore-to-mark-a-drug-free-world"}