{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:33:25", "date_modify": "2024-10-12 13:33:25", "date_publish": "2023-09-15 17:35:00", "description": "It was the second reported case of a burning car on the roads here in two days. Read more at straitstimes.com.", "filename": "singapore_man-assisting-police-investigations-after-car-catches-fire-in-accident-near-woodlands-causeway_1728740005.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/15/WhatsApp20Image202023-09-1520at2007.01B_0.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_man-assisting-police-investigations-after-car-catches-fire-in-accident-near-woodlands-causeway_1728740005.html", "title": "Man assisting police investigations after car catches fire in accident near Woodlands Causeway", "title_page": "Man assisting police investigations after car catches fire in accident near Woodlands Causeway | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A 48-year-old male driver is assisting the police with investigations after a car caught fire following an accident involving another car on Friday.\nThe police said they were alerted to the accident along the Woodlands Centre slip road into the Bukit Timah Expressway, towards the Pan-Island Expressway (PIE), at 6am.\nChinese-language newspaper Shin Min Daily News, citing an eyewitness account, reported a black car in flames on the left of the expressway. A red car was parked in front of it, with a dented boot and its hazard lights on. The metal railing at the side of the expressway was almost broken.\nThe Singapore Civil Defence Force (SCDF), which was also alerted to the accident at 6am, said it extinguished the fire using two water jets. It assessed one person for minor injuries, but the person declined to be taken to the hospital.\nInvestigations by both the police and the SCDF are ongoing.\nThis is the second reported case of a burning car on the roads here in two days.\nOn Thursday, a grey car caught fire along the PIE towards Tuas, near the Central Expressway exit.\nAccording to Shin Min, the fire caused traffic to slow down on the expressway in both directions, with an eyewitness saying that he saw two fire engines stuck in a traffic jam for more than 10 minutes.\nSCDF said it was alerted to the fire at about 2.10pm on Thursday.", "url": "https://www.straitstimes.com/singapore/man-assisting-police-investigations-after-car-catches-fire-in-accident-near-woodlands-causeway"}