{"authors": ["Joyce Teo"], "date_download": "2024-10-12 13:28:54", "date_modify": "2024-10-12 13:28:54", "date_publish": "2024-09-01 05:00:00", "description": "Pre-packed salt, sauces and seasonings, instant noodles and cooking oils, and will be graded A to D. Read more at straitstimes.com.", "filename": "singapore_health_askst-new-grading-labels-will-make-it-easier-to-choose-items-with-less-salt-and-saturated-fat_1728739734.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/01/IMG9812.jpg?VersionId=FGSJToW7fnHFw7302Z9lkThsjx8TKa2_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_askst-new-grading-labels-will-make-it-easier-to-choose-items-with-less-salt-and-saturated-fat_1728739734.html", "title": "askST: Why do salt, saturated fat need Nutri-Grade labels when there’s Healthier Choice symbol?", "title_page": "askST: Why do salt, saturated fat need Nutri-Grade labels when there’s Healthier Choice symbol? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – To make it easier for people to pick out healthier options in the supermarkets or shops, the Ministry of Health will soon make it mandatory for some items to carry Nutri-Grade labels that offer an at-a-glance summary of the products’ sodium and saturated fat content.\nThey include pre-packed salt, sauces and seasonings, instant noodles and cooking oils, and will be graded A to D – with D marking the least healthy choices.\nPackaged drinks as well as freshly prepared beverages such as coffee, bubble tea and smoothies sold at larger establishments or chain stores already use Nutri-Grade labels as a gauge of how much sugar and saturated fat they contain.\nHere is the lowdown on salt and saturated fat and why the labels may help you to eat more healthily.\nQ. Why do we need labels for pre-packed salt, sauces and seasonings, instant noodles and cooking oils?\nA: Many Singaporeans consume these food items, which tend to be high in sodium and/or saturated fat. This puts them at risk of serious health issues such as heart attack and stroke.\nAccording to the National Nutrition Survey 2022, nine in 10 Singapore residents exceed the recommended sodium limit of 2,000mg a day and consume about twice the daily limit, an average of 3,620mg a day.\nAlso, the saturated fat they eat constitutes 36 per cent of total fat, which exceeds the recommendation of no more than 30 per cent.\nQ. How does sodium harm our health?\nHigh blood pressure is linked to high sodium intake.\n“First, when we take too much salt, our bodies will try to retain more water. That is why we feel thirsty. We always blame it on MSG (monosodium glutamate), but it is actually caused by more sodium in our bodies,” said Health Minister Ong Ye Kung in a speech at the Association of Catering Professionals Singapore’s gala dinner in April 2024.\n“When we retain more water, the volume of blood flowing in our body increases, and our heart will have to work harder to pump blood, resulting in higher blood pressure. Over time, this further strains our blood vessels, kidney and heart, and increases the risk of stroke, kidney failure and heart attacks.”\nEvery day, 60 Singaporeans suffer either a heart attack or stroke, mostly due to the progression of chronic illnesses like high blood pressure, Mr Ong added. “Some die from it, some recover quickly, others become immobile or need long periods of rehabilitation.”\nQ. Why do we need Nutri-Grade labels for salt and saturated fat when we already have the Healthier Choice symbol?\nA: Healthier Choice symbol labels are voluntary, but the labelling of Nutri-Grade C and D drinks, which contain a substantial level of sugar and saturated fat, is mandatory. The labelling of Nutri-Grade A and B drinks, which have minimal or low levels of sugar and saturated fat, is optional.\nQ. What are saturated and unsaturated fats?\nA: These are the two main kinds of dietary fat. Most foods have a mix of both, with some having high levels of unhealthy saturated fats.\nSaturated fats are typically solid at room temperature. Most foods high in saturated fats come from animals – such as marbled meat, full-fat dairy products and eggs – but they can also come from plants, such as oils from coconuts, palm fruit or palm kernels.\nToo much saturated fat in your diet raises the level of bad cholesterol in the blood, which can lead to heart disease and other health problems.\nUnsaturated fats are the more beneficial type of fat. They are usually liquid at room temperature and found in vegetable oils like olive or sunflower, and from nuts and fish. The two types of unsaturated fats are monounsaturated and polyunsaturated fats.\nQ. Coconut oil has been touted as good for health. Is it true?\nA: Coconut oil contains a type of medium-chain saturated fat called lauric acid that research shows raises levels of HDL, or “good” cholesterol, which may lower overall heart disease risk. Lauric acid makes up about 50 per cent of coconut oil.\nThere have also been some claims that coconut oil could be used as a treatment for Alzheimer’s disease, but there is a lack of evidence to back this up.\nAs coconut oil is around 90 per cent saturated fat, it raises cholesterol levels in a similar way to animal fats like butter and lard (palm oil is around 50 per cent saturated fat).\n“When you take coconut oil, you are not only just eating the medium-chain (saturated fat), you are eating in totality a saturated fat,” said Dr Kalpana.\nQ. There are various types of blended vegetable oils. How do we know what is in them?\nLook at the ingredient list, as the first ingredient on the list typically makes up the bulk of the oil, said Dr Kalpana.\nConsumers can find out the saturated fat content of an oil from the nutrient information panel on the product, she said.", "url": "https://www.straitstimes.com/singapore/health/askst-new-grading-labels-will-make-it-easier-to-choose-items-with-less-salt-and-saturated-fat"}