{"authors": ["Esther Loi"], "date_download": "2024-10-12 14:16:38", "date_modify": "2024-10-12 14:16:38", "date_publish": "2024-04-11 19:30:00", "description": "Taking up 17,000 sq m in floor area, the show will have 41 brands on display and 34 booths. Read more at straitstimes.com.", "filename": "singapore_transport_biggest-post-covid-19-edition-of-the-car-expo-returns-on-april-13-and-14_1728742598.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/11/btexpo20240411.jpg?VersionId=3KkrVJ0SNCdCkFbAprqeq3KWRaALwcal", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_biggest-post-covid-19-edition-of-the-car-expo-returns-on-april-13-and-14_1728742598.html", "title": "Biggest post-Covid-19 edition of The Car Expo returns on April 13 and 14", "title_page": "Biggest post-Covid-19 edition of The Car Expo returns on April 13 and 14 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Car Expo will be back on April 13 and 14 with 41 brands and 34 booths, making this edition the biggest one since the Covid-19 pandemic struck in 2020.\nOccupying 17,000 sq m, it will also be its biggest post-pandemic show in terms of floor area – 2,000 sq m bigger than its previous edition in October 2023.\nThe event will be held from 10am to 8pm at Singapore Expo halls 4 and 5, said organiser SPH Media, which publishes The Straits Times.\nThe participating brands include 21 authorised distributors, 10 pre-owned car dealerships, and 10 car accessory and service companies.\nChinese electric vehicle (EV) brand GAC Aion will participate in The Car Expo for the first time, launching three new models.\nOnly the Aion Y Plus – an electric crossover sport utility vehicle – will be available for sale, while the Aion ES – a compact sedan with a light-sensing panoramic roof – and the Aion Hyper HT – a mid-sized SUV with falcon wing doors that open upwards, similar to those on a Tesla Model X – will be at the show only for display.\nIt is among 10 brands, dealerships and firms that are new to the show.\nThe others are pre-owned car dealerships GOwheeler, Horizon Motoring, Inchcape Certified Pre-Owned and OneShift by Carousell, as well as car accessory and service specialists Lylo, Moomoo SG, MotorCheckUp, Dolphin and Yuen Thong.\nThe first 50 daily visitors who spend at least $80 on car accessories in a single receipt will each receive a $10 SPC cash voucher.\nIn the latest tender exercise on April 3, the certificate of entitlement (COE) premium for larger cars stood at $101,334, while that for the Open category – which can be used for any vehicle type except motorcycles, but is used mostly for bigger cars – closed at $101,002. The price of COEs for smaller, less powerful cars was $89,000.\nThe certificates give one the right to own and use a vehicle in Singapore.\nCorrection note: This article has been edited for accuracy.", "url": "https://www.straitstimes.com/singapore/transport/biggest-post-covid-19-edition-of-the-car-expo-returns-on-april-13-and-14"}