{"authors": ["David Sun"], "date_download": "2024-10-12 13:29:25", "date_modify": "2024-10-12 13:29:25", "date_publish": "2024-02-29 17:54:23", "description": "Every third Friday of May will be designated as Drug Victims Remembrance Day Read more at straitstimes.com.", "filename": "singapore_politics_singapore-to-mark-drug-victims-remembrance-day-every-may-to-remember-drug-abuse-victims-shanmugam_1728739765.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/29/Screenshot202815129.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_singapore-to-mark-drug-victims-remembrance-day-every-may-to-remember-drug-abuse-victims-shanmugam_1728739765.html", "title": "S’pore to mark Drug Victims Remembrance Day every May", "title_page": "S’pore to mark Drug Victims Remembrance Day every May | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Drug abusers, their families and loved ones are victims of drug traffickers and the lucrative drug trade.\nIt is for this reason that, from 2024, Singapore will designate every third Friday of May as Drug Victims Remembrance Day, said Minister for Home Affairs K. Shanmugam on Feb 29.\nThe first one will fall on May 17.\nHe was speaking in Parliament during the debate on the Ministry of Home Affairs’ (MHA) budget.\nMr Shanmugam said the day will be to remember victims of drug abuse, and the Government, schools, and institutes of higher learning will be organising various activities that day.\nHe said: “Activism usually focuses on drug traffickers and the penalties they face. But there are thousands of others whom we should think about.\n“These others are the victims of the drug traffickers and the lucrative drug trade – the abusers who suffer, their families, their loved ones. They are forgotten in activism.\n“But we must remember them and we must remember the suffering that they have gone through and the harm that drugs have done to them and their families.”\nThe initiative was planned by the Inter-Ministry Committee on Drug Prevention for Youths, which was formed in 2023 and is chaired by Mr Shanmugam.\nThe committee involves the ministries of Education; Social and Family Development; Culture, Community and Youth; Defence; Communications and Information; and Health, as well as the People’s Association. It focuses on drug preventive education.\nAccording to the latest annual figures from the Central Narcotics Bureau (CNB) for 2023, there has been a rise in the number of young people and women arrested for drug abuse. More than half of 944 new drug abusers arrested were below the age of 30.\nMr Shanmugam said cannabis was of particular concern, as arrests of cannabis abusers here have been the highest in a decade.\nThe number in 2023 jumped by 17 per cent to 277, from 236 in 2022.\nMinister of State for Home Affairs Muhammad Faishal Ibrahim, who also spoke during the debate, announced improvements to the drug rehabilitation and reintegration journey.\nHe said that in 2024, the Singapore Prison Service (SPS) will embark on Corrections 2030 – an initiative to strengthen the families of inmates, maximise career opportunities of ex-offenders, and mobilise community partners to better support rehabilitation and reintegration.\nThe SPS said there was an increase in the two-year recidivism rate for the 2021 release cohort, largely due to an increase in the recidivism rate of repeat drug abusers.\nAccording to 2023 statistics released by SPS on Feb 14, there are 3,981 drug rehabilitation centre (DRC) inmates – the highest number since 2008.\nDrug abusers in DRCs currently go through programmes that help them recognise their drug triggers and reflect on the harm of drugs on their loved ones.\nAfter leaving the rehabilitation centres, they take part in community-based programmes with support from career coaches to help reduce the risk of relapse.\nOnce they have completed these programmes, they are placed under the supervision of CNB, which monitors them for up to five years through regular urine or hair tests to ensure they stay clean.\nBut this monitoring means significant disruption and stigma for those being supervised.\nTo better curb long-term relapse, Dr Faishal said CNB will enhance its approach under a new Supervision 2.0 regime to better support the supervisees’ reintegration journey through more efficient monitoring.\nHe said: “A key move is CNB’s plans to generally replace urine testing with hair testing as the default drug detection method during supervision.\n“CNB is piloting this and will study the results before full implementation.”\nAnother announcement during the debate was the plan to introduce a Maintenance of Racial Harmony Bill.\nMr Shanmugam said MHA has been developing proposals for the Bill and will introduce them in Parliament in 2024.\nThe authorities have prosecuted those who have threatened racial harmony in Singapore, but have relied on different pieces of legislation such as the Penal Code and Protection from Harassment Act.\nIn December 2022, a former Ngee Ann Polytechnic lecturer was jailed for five weeks for making racist remarks to an inter-ethnic couple.\nIn September 2023, local rapper Subhas Nair was jailed for six weeks for trying to promote feelings of ill will between different racial and religious groups in Singapore.\nMr Shanmugam said: “This Bill will consolidate the Government’s powers to deal with racial issues, and strengthen our suite of powers to preserve racial harmony.\n“We will also introduce softer reparative measures, which would seek to help the aggrieved community take a more reconciliatory view towards an offender and strengthen mutual understanding between races.”", "url": "https://www.straitstimes.com/singapore/politics/singapore-to-mark-drug-victims-remembrance-day-every-may-to-remember-drug-abuse-victims-shanmugam"}