{"authors": ["Ang Qing"], "date_download": "2024-10-12 14:16:49", "date_modify": "2024-10-12 14:16:49", "date_publish": "2024-03-07 19:30:00", "description": "Case said it was not right for the organiser to proceed with the event without giving consumers prior notice. Read more at straitstimes.com.", "filename": "singapore_consumer_police-investigating-sentosa-sky-lantern-festival-case-says-attendees-should-get-full-refund_1728742609.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/07/jq0A1A0485.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_consumer_police-investigating-sentosa-sky-lantern-festival-case-says-attendees-should-get-full-refund_1728742609.html", "title": "Police investigating Sentosa sky lantern festival; Case says attendees should get full refund", "title_page": "Police investigating Sentosa sky lantern festival; Case says attendees should get full refund | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The police are looking into the Singapore Sky Lantern Festival amid calls by attendees to be fully refunded for the botched event.\nAt least one police report has been filed against the event’s organisers. The police confirmed that investigations are ongoing.\nHundreds of attendees, who each paid $50, made their way to Sentosa for the festival on Feb 21, only to learn on arrival that there was no food, nor were there lanterns taking off that night – both of which had been promised.\nFollowing that, one of the organisers said in a since-deleted Facebook post that the event would be rescheduled to early April, without providing further details.\nResponding to queries from The Straits Times, Consumers Association of Singapore (Case) president Melvin Yong said on March 7 that attendees should be entitled to a full refund given the circumstances.\nMr Yong said it was not right for the event organiser, Asian Couture and Boutique, to proceed with the event without giving consumers prior notice that the sky lantern release segment was cancelled, given that consumers had bought tickets mainly because of the release segment.\nThe firm had also failed to obtain the necessary licences and permit approvals to carry out the release of sky lanterns.\n“There is also no clarity on the replacement event suggested by the company,” he added.\nTo date, Case has received 32 consumer complaints against Asian Couture and Boutique regarding the Singapore Sky Lantern Festival at Palawan Beach.\nMr Yong urged all affected consumers to contact Case for help by calling 6277-5100 or through its website.\nCase provides free advice to those who reach the association on its hotline, by e-mail or by walking into its office.\nPeople who pay a fee to join Case as a member can file a case with the non-profit, which will engage the retailer on their behalf.\nShould the matter reach a stalemate, an officer from Case will advise consumers on their options, which include mediation and escalating the case to the Small Claims Tribunals.", "url": "https://www.straitstimes.com/singapore/consumer/police-investigating-sentosa-sky-lantern-festival-case-says-attendees-should-get-full-refund"}