{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:48:52", "date_modify": "2024-10-12 13:48:52", "date_publish": "2023-12-11 16:35:00", "description": "To receive money from the fund, countries need to submit plans and feasibility studies, which S'pore could help with. Read more at straitstimes.com.", "filename": "singapore_s-pore-won-t-claim-from-climate-loss-damage-fund-will-help-other-countries-access-money-from-it-grace-fu_1728740932.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/11/2023-12-11T063239Z440321759.JPG?h=0878246f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_s-pore-won-t-claim-from-climate-loss-damage-fund-will-help-other-countries-access-money-from-it-grace-fu_1728740932.html", "title": "S’pore won’t claim from climate fund, but will help others access it: Grace Fu", "title_page": "S’pore won’t claim from climate fund, but will help others access it: Grace Fu | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI – Singapore will not be claiming from a fund that compensates countries for the loss and damage that they face arising from climate change.\nInstead, it will support fellow countries from the Alliance of Small Island States (Aosis) to help them receive money from the fund, Minister for Sustainability and the Environment Grace Fu said on Dec 11.\nSpeaking to reporters outside the Singapore Pavilion at the United Nations COP28 climate talks, Ms Fu said the Republic will not claim from the fund despite investing heavily in coastal protection measures. Singapore has estimated that at least $100 billion will be needed in the long term to fight against rising sea levels.\n“What we really want to see is help (given) to our fellow islanders, our brothers and sisters in Aosis, to help (them) tap these funds, as many face difficulties doing so due to a lack of technical capacity,” she added.\nAt least US$790 million (S$1.06 billion) has been pledged to the historic loss and damage fund, which sees developed countries that have contributed largely to climate change paying developing countries for the climate-induced damages they are experiencing.\nThe fund will be hosted through the World Bank for the first four years.\nSingapore is part of the Aosis negotiating bloc, which includes many small island states such as the Pacific island nations, which have already suffered from climate change acutely through the loss of land and property damage due to sea-level rise. Some communities have also been forced to relocate.\nTo receive money from the fund, countries must submit plans and feasibility studies. The lack of technical capability to provide such information is often what is holding them back from submission, Ms Fu said.\nSingapore could help countries that are developing their national adaptation plan, which needs details on how they deal with food and water security.\n“So, I think Singapore plays a useful role in getting capability building, technical assistance, working with other countries that have the ability to do so, the resources to do so, to help our fellow island states to get better access (to the fund) to help them recover faster from disaster,” Ms Fu added.\nThe World Bank being the host of the fund was a sticking point for developing countries.\nThey were worried that it was not truly an independent fund as it is based in the United States, and the administrative processes required of them would hence make it difficult to access the money.\nIn February, Ms Fu said in Parliament that Singapore, classified as a developing country in international negotiations, is an eligible recipient of the loss and damage fund.\nShe added at the time that Singapore had not decided if it would contribute to the fund, or claim from it, a position that drew the ire of youth climate groups here.\nThe groups felt it would be unjust for the Republic to take from the fund as it could deprive other climate-wrought countries from getting the compensation that they needed.\nAsked by The Straits Times at COP28 on whether Singapore will be contributing to other sources of finance, such as adaptation or climate finance in general, Ms Fu said: “We see our role really as galvanising finance...\n“The idea is that from the little resources that we have in Singapore, how (we) can lever up... like a fulcrum. From $1 that we are putting on the table, we are able to get $7, $8, $9 of funding.\n“We have put in some money to start that funding arrangement, and we are very optimistic that the amount that we have on blended finance, the amount that we put into the seed companies, for example, will see scaling effects in the years to come.”\nThe Financing Asia’s Transition Partnership’s US$5 billion blended finance initiative is meant to channel finance to projects that would otherwise not be profitable, such as those in clean energy, nature-based solutions, and waste and water management.\nThis initiative involves Singapore’s central bank and other partners like the International Finance Corporation and Temasek.\nMs Fu and Norway’s Foreign Minister Espen Barth Eide are facilitating negotiations on mitigation at COP28, which is a key prong of the Paris Agreement as it entails reducing greenhouse gas emissions to limit global warming to 1.5 deg C.\nWhen asked if countries are going to agree on a term like the “phase-out” of fossil fuels, or whether there might be other options that come up later on, she said: “The issue about energy transition is a significant one.\n“The presidency has really made this the core issue. What we have found over the last few days is that there’s a great convergence over the need to move to 1.5 deg C and for (greater climate) ambition.”\nHowever, countries are divided on how to get there, especially as they all have many concerns and expectations, she added.\nOne of the hotly debated points of COP28 is the language around the “phase-out” of fossil fuels, and whether it will be a complete phase-out, or only the phase-out of “unabated” fossil fuels. Abated fossil fuels refer to the use of carbon capture technologies to ensure emissions are less intensive.\nMs Fu said: “So we will have to work through the language to find possible landing zones... I think the intention is to have a good energy transition message, and I think that is still a work in progress.”\nAs for Singapore’s position on fossil fuels, she said that Singapore is still reliant on these, given the limited natural energy and renewable energy sources here. Singapore is powered by around 95 per cent natural gas.\n“We’re also talking about the possibility of importing renewable energy from the region, which is really going out of our comfort zone, if you think about issues with energy security, but we felt that it is an important part for us to decarbonise our energy sector,” she added.\nSingapore is also looking at new technologies like green hydrogen, which is not cost-effective at the moment but crucial for the Republic to explore to play its role in energy decarbonisation.\n“We are also accountable to our own people for the economic livelihoods... so we have to strike a balance in accelerating our decarbonisation journey and also making sure that the transition is an orderly, reasonable one that gives us affordable and accessible energy,” Ms Fu added.", "url": "https://www.straitstimes.com/singapore/s-pore-won-t-claim-from-climate-loss-damage-fund-will-help-other-countries-access-money-from-it-grace-fu"}