{"authors": ["Christie Chiu", "Gabrielle Andres"], "date_download": "2024-10-12 13:32:10", "date_modify": "2024-10-12 13:32:10", "date_publish": "2024-08-31 14:33:07", "description": "About 45 people were evacuated from the premises. Read more at straitstimes.com.", "filename": "singapore_fire-breaks-out-at-golden-mile-tower-cars-at-rooftop-carpark-seen-engulfed-in-flames_1728739930.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/31/6239838001161159038.jpg?VersionId=Ua4YXTbskK5fcaas1ZQlNkpb38PQ3MNn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_fire-breaks-out-at-golden-mile-tower-cars-at-rooftop-carpark-seen-engulfed-in-flames_1728739930.html", "title": "Multiple vehicles catch fire at Golden Mile Tower; initial findings show blaze didn’t involve EVs", "title_page": "Multiple vehicles catch fire at Golden Mile Tower; initial findings show blaze didn’t involve EVs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Multiple vehicles at a rooftop carpark at Golden Mile Tower caught fire on Aug 31, sending thick plumes of smoke billowing from the building in Beach Road.\nInitial findings showed that the vehicles involved in the fire were not electric vehicles (EVs), the Singapore Civil Defence Force (SCDF) said.\n“The fire, which involved multiple cars at the carpark, was extinguished by SCDF using two water jets,” it said.\nIt added that it was alerted to a fire on the rooftop of a multi-storey carpark at 6001 Beach Road just before 1pm. The address corresponds to Golden Mile Tower.\nA video posted by The Projector cinema – one of the building’s tenants – on its Instagram page shows three vehicles at the carpark engulfed in flames.\nIn the video, an explosion sound can be heard as one of the vehicles sparks.\nAbout 45 people were evacuated from the premises, while three people were assessed for smoke inhalation. However, they declined to be taken to hospital, SCDF said.\nWhen The Straits Times arrived at the scene, several charred vehicles were seen at the building’s open-air carpark.\nLoud explosions heard\nMs Robin Rheaume, who lives at Pebble Bay condominium in Tanjong Rhu, said she could hear the sounds of explosion from across the Kallang Basin.\nShe was having lunch when she started hearing what she described as “popping” sounds.\nWhen the sounds did not stop, she decided to take a closer look from her balcony and saw dark grey smoke rushing from Golden Mile Tower.\nAbout six fire engines and six police cars were at the site at about 3pm. Two SCDF cars and an ambulance were also present.\nAbout 50 people – mostly tenants and those working in the building who were evacuated – were outside the building.\nThe affected carpark is linked to The Projector. The cinema’s venue hire executive Jacob Chio said he learnt of the fire after a morning event at the cinema.\nA friend who was leaving the building at about 1.05pm told him that she had heard some explosion sounds in the area.\nHe went to the ground floor outside the building to check out the situation, and saw that the police and SCDF had already started to stream in.\n“From where we stood below, we thought the fire was coming from the hotel next door, so we thought we weren’t affected and went back up to resume operations,” said Mr Chio, adding that the building’s fire alarm did not go off.\nTo be safe, he decided to check the carpark and was faced with the blazing cars. “It was scary,” he said, adding that he was shocked by the surreal sight.\nHe recognised the flaming cars as a fleet belonging to a rental car company operating out of Golden Mile Tower, but said he was not sure if the firm was still in operation.\nThe team was also waiting outside the building for updates on whether the venue and equipment were affected.\nThe Projector at Golden Mile Tower cancelled all movie showings for Aug 31, but aims to resume operations on Sept 1.\nService at its Cineleisure outlet remains normal.\nMadam Anirut, who works at a food stall on the first level, was preparing dishes when her husband informed her of the fire.\n“I was shocked when a lot of people around our shop were saying there’s a fire so we rushed out,” the 56-year-old told ST. “I told my customers to just leave, there’s no need to pay. Just get to safety first.”\nMs Chen Hong Xiu, who is the landlord of three units at Golden Mile Tower and lives in a Housing Board flat across the road, said she was suddenly woken up by the sounds of explosion.\n“I was so shocked, I thought it was an earthquake,” she said, adding that she later saw the smoke and realised a fire had broken out.\nGripped with fear that people would get hurt, the 62-year-old quickly ran towards the building to help alert those inside.\nSpeaking to ST in Mandarin, she said: “I couldn’t think, I didn’t even know what time it was. I ran over so quickly that I even forgot to put on my shoes.”\nShe then dashed into the building, going to each unit one by one, shouting for everyone to evacuate.\nShe added that an ambulance was already on site when she arrived at the scene.\nThe police at the scene told ST that only levels one to five had been reopened as at 4.25pm. The other levels – six and above – had not been cleared yet. The carpark is located on level six.\nFlooding was also seen on the basement floor, with cleaners clearing away the water from the aftermath of firefighting efforts.\nGolden Mile Tower, a 24-storey building, was completed in 1974. The building once housed the largest cinema in Singapore – the 1,500-seater Golden Theatre.\nAdditional reporting by Shintaro Tay", "url": "https://www.straitstimes.com/singapore/fire-breaks-out-at-golden-mile-tower-cars-at-rooftop-carpark-seen-engulfed-in-flames"}