{"authors": ["Elisa Chia"], "date_download": "2024-10-12 13:30:32", "date_modify": "2024-10-12 13:30:32", "date_publish": "2024-07-07 15:00:00", "description": "Whether your children are two or eight years old, there is a theatre show to catch with them in July. Read more at straitstimes.com.", "filename": "singapore_parenting-education_fun-with-kids-two-theatre-shows-for-toddlers-and-children-in-july_1728739832.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/07/White3.jpg?VersionId=qOaZJ4taz69.ZVykkyaFsdRZIhP9ySSL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_parenting-education_fun-with-kids-two-theatre-shows-for-toddlers-and-children-in-july_1728739832.html", "title": "Fun With Kids: Two theatre shows for toddlers and children in July", "title_page": "Fun With Kids: Two theatre shows for toddlers and children in July | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Two theatre shows in July offer children experiences suitable for their ages. Toddlers between the ages of two and four can be immersed in a world of colours in White, while older kids between five and eight can learn about friendship in The Invisible Pangolin.\nFor kids aged two to four\nFrom the moment you and your little ones enter the space, you will be transported into the world of White, where Cotton and Wrinkle live.\nThe two friends work hard daily to maintain the whiteness of their space and ensure that the eggs in the birdhouses stay safe.\nBut high up in the trees, colours start sneaking in. First green, then red, then yellow. Suddenly, the world’s not monochrome anymore.\nDesigned to engage kids aged two to four, White is a 45-minute performance that promises to be a playful, highly visual experience. As the characters learn to love their new colourful space, parents can teach their kids what it means to embrace changes, say co-directors Gill Robertson and Ian Loy.\nThe show runs from July 20 to 28 at The Artground’s WhiteBox at Goodman Arts Centre.\nRobertson says: “White has been created to provide a warm and welcoming environment for toddlers and their families. Everything in the show has been considered so you and your child feel comfortable. From the seating to the music to the gentle performers, you will be immersed in this world.”\nWhite is the Singapore version presented by The Artground, based on an original production by Catherine Wheels Theatre Company in Scotland.\nExplore the topics of friendship and inclusivity with your kids through a theatre performance, which also introduces animals that are native to Singapore.\nThe Invisible Pangolin is an hour-long production which aims to nurture empathy, understanding and resilience in children aged five to eight.\nThe story follows Penny the Sunda pangolin, who navigates her anxiety in school and fear of being seen by others.\nPlaywright Jaisilan Sathiasilan says: “Some of us make friends easily and some of us struggle. It’s important that we teach the young audience to look out for quiet friends who struggle to be seen and want to feel included.”\nAn endangered species of mammal that is naturally shy and solitary, the Sunda pangolin is a parallel to those who are introverts.", "url": "https://www.straitstimes.com/singapore/parenting-education/fun-with-kids-two-theatre-shows-for-toddlers-and-children-in-july"}