{"authors": ["Michelle Zhu"], "date_download": "2024-10-12 13:27:13", "date_modify": "2024-10-12 13:27:13", "date_publish": "2024-10-07 14:13:00", "description": "Prices for mature estates grew 2.3% on the month, while those in non-mature estates rose 1%. Read more at straitstimes.com.", "filename": "singapore_housing_hdb-resale-price-growth-remains-strong-even-as-volumes-fall-srx-99co_1728739633.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/07/PIXGENERIC.59414368.Attachment.112400.jpg?VersionId=qvelvdRVhAw23V.PSgyjijd_WX3NDPwV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_housing_hdb-resale-price-growth-remains-strong-even-as-volumes-fall-srx-99co_1728739633.html", "title": "HDB resale price growth remains strong even as volume falls in September", "title_page": "HDB resale price growth remains strong even as volume falls in September | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Resale prices in the public housing market continued to climb despite a drop in the September 2024 volume, flash data from SRX and 99.co showed.\nBased on the latest report on Oct 7, Housing Board flat resale prices for September grew 1.8 per cent from August 2024’s level, though the volume plunged 14.9 per cent.\nThe price increase mirrors that of June 2024, which 99.co data analyst Joel Lim sees as a continuation of “very high” demand for resale flats due to low supply.\nCiting SRX’s historical data, PropNex Realty’s head of research and content Wong Siew Ying observed that September 2024 marked a year of monthly consecutive price increases in the resale flat segment since October 2023.\n“Anecdotal observations suggest that the demand for HDB resale flats remains healthy, including from some buyers who may feel that they are priced out of purchasing a private condo of comparable size in the same area,” said Ms Wong.\nResale prices for mature estates grew by 2.3 per cent on the month, while prices in non-mature estates increased by 1 per cent.\nBoth three- and four-room units registered a 2.3 per cent price growth month on month, followed by a 1.3 per cent increase for five-room flats and 0.3 per cent for executive units.\nYear on year, resale prices grew 10 per cent from September 2023 levels, with a 9.2 per cent increase for mature estates, and 10.3 per cent for non-mature estates.\nThis was driven largely by an on-the-year surge in resale prices for four-roomers (11 per cent), followed by three-room flats (9.7 per cent), five-room flats (8.6 per cent) and executive units (8.2 per cent).\nA total of 2,217 resale flats were transacted in September 2024 – 11.6 per cent higher than the previous year’s volume.\nThe majority of September 2024’s transacted volume comprised four-room flats (43.1 per cent), with the least coming from executive units at 6.6 per cent. Three-room unit resale transactions came in slightly higher at 25.8 per cent compared with five-room units, which constituted 24.5 per cent of the month’s volume.\nMr Lim attributed the 14.9 per cent month-on-month resale volume decrease “in a small part” to the latest cooling measures that saw the loan-to-value ratio for HDB loans lowered by 5 percentage points from Aug 20.\nOrangeTee Group’s chief researcher and strategist Christine Sun said the resale housing market will continue to face competition in October 2024 as a “substantial” number of flats will be put up for sale in HDB’s upcoming Build-To-Order (BTO) launch.\n“Many prospective buyers are likely to be drawn to the new BTO flats, especially since this will be the inaugural launch of the Plus flats, and singles can purchase new BTO flats outside non-mature estates,” she noted.\nMs Sun is also of the view that the new flats – particularly those that come with shorter waiting times – will provide individuals “in urgent need of housing” with an alternative option to relying exclusively on completed flats available in the secondary market.\n“If more such flats with shorter waiting times continue to be released in future BTO launches, resale demand and prices may be impacted. Resale price growth may also slow down in the longer term,” she added.\nHuttons Asia chief executive Mark Yip, however, said the latest cooling measures were unlikely to be the reason as he estimates it takes around two months for the measures’ submission to “reach acceptance” in HDB’s system.\n“The lower volume is probably due to lower supply of homes for sale. With supply constrained, transaction volume is lower. Sellers were aware of their stronger bargaining power and held on to their asking prices. In the process, buyers had to pay higher prices and HDB resale prices in September 2024 increased at a faster pace of 1.8 per cent,” he said.\nHe expects demand to remain strong for the year due to lower interest rates, which would, in his view, lower borrowing costs and translate to a higher loan quantum.\n“This may afford buyers the ability to look at HDB resale flats in better locations. Prices may increase as a result in the coming months,” added Mr Yip.\nHuttons is now forecasting the HDB resale volume for 2024 to range between 29,000 and 30,000, up from its earlier estimate of 26,000 to 28,000. The real estate agency is expecting resale price growth for the year to come in at between 8 per cent and 10 per cent.\nThere were 106 HDB flats resold for at least $1 million in September 2024, compared with the prior month’s 105.\nThe number of million-dollar flats sold comprised 4.8 per cent of the total resale volume for the month, with 20 such units recorded in Kallang Whampoa alone.\nOther notable areas with million-dollar transactions included Queenstown (13 units), Bukit Merah and Toa Payoh (12 units each).\nMs Wong highlighted that the proportion of sales ranging from $800,000 to $1 million “seemed to have stabilised” during the month, in contrast to the uptick in proportion of sales from the $600,000-$700,000 and $700,000-$800,000 price bands.\nMr Yip said: “With three more months to go in 2024, the number of million-dollar flats is likely to exceed 1,000 and reach 3 per cent to 4 per cent of total market volume.”\nLikewise, Mogul.sg’s chief research officer Nicholas Mak estimates about 990 to 1,000 million-dollar flats could be sold in 2024 to set a new record for the public housing resale market.\nMr Mak said: “Some of the buyers of these million-dollar flats feel that with a budget of $1 million to $1.5 million, they could get more value for their money by buying HDB resale flats that are larger and located on higher floors than condominium units at that price range.” THE BUSINESS TIMES", "url": "https://www.straitstimes.com/singapore/housing/hdb-resale-price-growth-remains-strong-even-as-volumes-fall-srx-99co"}