{"authors": ["Zaihan Mohamed Yusof"], "date_download": "2024-10-12 13:30:53", "date_modify": "2024-10-12 13:30:53", "date_publish": "2023-07-22 23:34:00", "description": "The former senior minister fielded questions from the youth in a dialogue as part of the HarmonyWorks! Conference 2023. Read more at straitstimes.com.", "filename": "singapore_hold-to-the-idea-of-multiculturalism-even-without-common-ground-tharman-tells-youth_1728739853.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/22/A52Y6044.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_hold-to-the-idea-of-multiculturalism-even-without-common-ground-tharman-tells-youth_1728739853.html", "title": "Hold to the idea of multiculturalism even without common ground, Tharman tells youth", "title_page": "Hold to the idea of multiculturalism even without common ground, Tharman tells youth | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - It takes work to learn to listen to people with differing views, but even if no common ground can be reached, Singaporeans can still hold to the idea of multiculturalism and accept that they live in a diverse society.\nThe important thing is to ensure that a pluralistic society does not become a divided society, former senior minister Tharman Shanmugaratnam told a young audience on Saturday as he fielded their questions on race, religion and threats to Singapore’s multiculturalism.\nMore than 200 young people attended the hour-long dialogue at the ITE College East auditorium, held as part of the HarmonyWorks! Conference 2023 organised by OnePeople.sg.\nEarlier, they had broken into smaller groups to discuss issues such as casual racism, woke culture on social media and strengthening of local and migrant relations.\nMr Tharman, who recently resigned from politics to run in the presidential election later in 2023, said today’s Singapore faces social and economic issues in a world that is more pluralistic, and that are amplified by social media.\n“And some people have very strong views on issues which are different from other people,” said Mr Tharman. “This is inevitable, (the) question is how we deal with it. How do we ensure that a more pluralistic society, a society with more diverse views, does not become a more divided society?”\nHe said the answer begins with early education, developing the ability to have civic discourse, to listen to each other, understand each other’s differences, and try to find common ground.\nHe added: “...when you can’t find common ground because you really have different views that are not so easily reconciled, accepting those differences but remaining Singaporean together, a diverse group of Singaporeans with so much that is still in common that we believe in multiracialism.”\nA discussion group on the challenges faced by migrant workers in trying to integrate in Singapore raised language, particularly the use of English, as a barrier.\nBrent Matthew, 17, a student ambassador from ITE College East, said: “One of the things my group agreed on was that in order to further integrate our migrant workers, (we should) form bonds and relationships with them.”\nMr Tharman welcomed the idea of having English language courses for migrants that can be conducted at the community clubs.\nHe challenged Singaporeans to not only step out of their comfort zones, but also to extend their comfort zones.\n“People (come) from different walks of life, and very different education levels, different income levels,” said Mr Tharman. “We need to have that ease of interaction, ease of friendship and make that a much broader comfort zone that makes us Singaporeans.”\nAsked by a student if a racial divide still exists in Singapore, Mr Tharman replied that “race was in the air” in the old days, even if people were not unfriendly.\n“It was a daily occurrence when I took the bus,” he added. “As the only one at the bus stop, the bus did not stop for me quite often. That was normal. That was the type of society we were in.”\nBut it is different today, as such “microaggression” can be confronted and stamped out, he said.\nSingapore has made some progress in schools where some activities and sports are traditionally mono-ethnic, said Mr Tharman, who is versed in Chinese calligraphy and regards his passion for the art form as part of his identity.\n“We just stuck with the idea that certain games are for certain ethnic groups, and that’s just become a norm,” he said. In the international sporting arena, however, games are played against different nationalities. “It can be changed. And I’ve seen schools that are deliberately changing.”\n“But we should be quite deliberate, not in a quota-based fashion, but in an encouraging way,” added Mr Tharman. “To make sure that those who are not normally associated with a sport or dance... bring them in and bring them in from young. They will do just as well.”", "url": "https://www.straitstimes.com/singapore/hold-to-the-idea-of-multiculturalism-even-without-common-ground-tharman-tells-youth"}