{"authors": ["Gabrielle Chan"], "date_download": "2024-10-12 13:56:42", "date_modify": "2024-10-12 13:56:42", "date_publish": "2023-12-02 14:42:07", "description": "From Nov 19 to 25, local Covid-19 infections doubled to 22,094 from 10,726 in previous week. Read more at straitstimes.com.", "filename": "singapore_public-should-remain-vigilant-amid-doubling-of-local-covid-19-cases_1728741402.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/02/20231202381364380416574c-b945-4d65-9dfe-b1f3beb8bf50.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_public-should-remain-vigilant-amid-doubling-of-local-covid-19-cases_1728741402.html", "title": "Covid-19 cases in S’pore double, MOH advises public to stay vigilant", "title_page": "Covid-19 cases in S’pore double, MOH advises public to stay vigilant | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Ministry of Health (MOH) has advised the public to remain vigilant amid the doubling of local Covid-19 cases and a rise in respiratory illnesses in temperate regions.\nIn the week of Nov 19 to 25, the estimated number of local Covid-19 infections doubled to 22,094 from 10,726 in the previous week, MOH said in a statement on Dec 2.\nIt added that the average daily Covid-19 hospitalisations and intensive care unit cases have remained stable.\nAs at Nov 27, virus variant EG.5 and its sub-lineage HK.3 are the predominant sub-variants locally, accounting for more than 70 per cent of the cases.\nThe increase could be due to many factors, said MOH, including the year-end travelling season and waning population immunity.\n“Currently, there is no indication that the predominant sub-variants are more transmissible or cause more severe disease compared with other circulating variants,” MOH said.\nWhile countries in the temperate regions have experienced an increase in cases of respiratory illness, MOH said overall cases of respiratory illnesses in Singapore have remained stable.\nLocally, there has been no indication of increases in severe respiratory illness, including in children, the ministry added.\nThe World Health Organisation (WHO) reported an increase in respiratory virus activity, including influenza and respiratory syncytial virus (RSV), in parts of the Northern Hemisphere, said MOH.\nIt added that some temperate countries have reported or are anticipating rising numbers of respiratory illness during the months of winter.\nIn China, there has been an increase in cases of respiratory illness among children and adolescents.\nChina on Nov 24 called for vigilance as a surge of these illnesses hit its schools and hospitals, a likely result of circulating respiratory pathogens.\nAccording to the WHO, these pathogens are not unusual, and include influenza, RSV, Mycoplasma pneumoniae and adenovirus. The global health body also noted that the increasing trend is not unexpected because of the onset of winter.\nMOH advised the public to keep up to date with their Covid-19 vaccinations.\n“An additional dose at around one year after their last vaccine dose is recommended for those aged 60 years and above, medically vulnerable persons, and residents of aged-care facilities,” said the ministry.", "url": "https://www.straitstimes.com/singapore/public-should-remain-vigilant-amid-doubling-of-local-covid-19-cases"}