{"authors": ["Lee Li Ying"], "date_download": "2024-10-12 13:52:56", "date_modify": "2024-10-12 13:52:56", "date_publish": "2024-10-01 17:35:00", "description": "They will be a resource for employers to help workers facing or recovering from mental health conditions. Read more at straitstimes.com.", "filename": "singapore_mental-health-guidelines-for-employers-open-for-public-consultation-to-be-launched-in-2025_1728741176.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/01/lysilver01.71207d20.Attachment.034844.jpg?VersionId=MRs5xFs77DlSPNq7yHHEUgp0.frMylqb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_mental-health-guidelines-for-employers-open-for-public-consultation-to-be-launched-in-2025_1728741176.html", "title": "Mental health guidelines for employers to be launched in 2025, now open for public consultation", "title_page": "Mental health guidelines for employers to be launched in 2025, now open for public consultation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Employers who are unsure about how to support staff with mental health challenges will be able to tap advice from a set of guidelines being developed by the Workplace Safety and Health (WSH) Council. It will be launched by the first quarter of 2025.\nMinister of State for Education and Manpower Gan Siow Huang announced the guidelines at an awards ceremony held by mental health non-profit organisation Silver Ribbon on Oct 1 at PSB Academy’s City Campus.\nPointing out that the document will be a useful resource for employers to help workers facing or recovering from mental health conditions, she said the guidelines can be distilled into three Rs: recognise, refer and reintegrate.\nShe said employees need to be educated on mental well-being and health to recognise the signs of such conditions, so the issue can be demystified and they can recognise that ups and downs are a part of life.\nEmployees should be aware of the early signs of mental health issues and initiate discussion with their supervisors to seek help. At the same time, supervisors should treat these discussions with sensitivity and maintain confidentiality, said Ms Gan.\n“Even so, not every employee may be aware of or comfortable with discussing their personal struggles. In such cases, having trained supervisors and peer supporters in the workplace can help in spotting early signs of distress or deviation from normal behaviours, before the situation escalates,” she added.\nNoting that employees who need more assistance should be referred to professionals, she said: “Employers can subscribe to an employee assistance programme, which provides professional assistance to employees with personal or work-related issues that may adversely impact their physical health, work performance, and mental and psychological well-being.”\nEmployees who are ready can be reintegrated back to work. While work can help in the recovery journey by giving employees confidence and a sense of purpose, reintegration should be done with care and sensitivity, she said.\n“Employers can help by having an early discussion with the returning employee. Together, the employer and employee can also explore if any adjustment is needed, such as managing workload, to enable the individual to work productively and healthily,” she added.\nThe first draft of the guidelines by WSH Council’s Mental Well-being Workgroup, which comprises about 20 representatives from tripartite partners, social service agencies and voluntary welfare organisations, is ready for public consultation.\nThe draft includes a section on frequently asked questions like how to approach performance appraisal for employees with mental health conditions and how to terminate underperforming employees with mental health conditions without being accused of discrimination.\nThe lead of the Mental Well-being Workgroup, Mr Paul Fong, said these issues were included in the guidelines to help employers navigate difficult conversations.\nHe said: “We want to encourage employers not to jump to conclusions or pre-judgments just because someone has a mental health issue. Some people may not be performing temporarily, but when they overcome their mental health issues, they become fantastic employees.\n“Employers have to take some time to assess and have a conversation with the affected employee and take appropriate action to help him or her.”", "url": "https://www.straitstimes.com/singapore/mental-health-guidelines-for-employers-open-for-public-consultation-to-be-launched-in-2025"}