{"authors": ["Tay Hong Yi"], "date_download": "2024-10-12 13:31:22", "date_modify": "2024-10-12 13:31:22", "date_publish": "2024-10-10 17:46:00", "description": "Employers who have done well should offer these workers at least $100 to $120 more. Read more at straitstimes.com.", "filename": "singapore_jobs_at-least-55-pay-rise-for-lower-wage-workers-among-latest-national-wages-council-guidelines_1728739882.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/10/ctblair.df3d845f.Attachment.070411.jpg?VersionId=paZWCvy3fE.4fwQ3xwxE5KrbaB7sNz5U", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_jobs_at-least-55-pay-rise-for-lower-wage-workers-among-latest-national-wages-council-guidelines_1728739882.html", "title": "National Wages Council recommends pay rise of 5.5% to 7.5% for lower-wage workers in new guidelines", "title_page": "National Wages Council recommends pay rise of 5.5% to 7.5% for lower-wage workers in new guidelines | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Employers of lower-wage workers earning up to $2,500 in gross monthly wage should give salary increases of 5.5 per cent to 7.5 per cent to these workers, said the National Wages Council (NWC).\nEmployers who have done well should offer these workers a raise of at least $100 to $120, even if it is higher than the percentage range stipulated, the NWC said on Oct 10 in its annual guidelines on pay and employment issues.\nAs for employers who have not done well, the council recommended providing lower-wage workers a built-in wage increase at the lower end of the stipulated percentage range, but that they should consider further wage increases if business prospects improve.\nFor workers at large, the council recommended that employers who have done well reward their employees with wage increases and variable payments such as bonuses or one-off payments tied to employers’ performance and employees’ contributions.\nThe guidelines, which were accepted by the Government but are not mandatory, cover the period from Dec 1, 2024, to Nov 30, 2025.\nThey apply to all employees in unionised and non-unionised firms in both the public and private sectors.\nThe guidelines come amid an expected moderation in inflation, an improved economic outlook and sustained productivity growth over the longer term.\nHowever, there is still the risk of intensified geopolitical conflicts and financial conditions remaining tighter for longer, the council added.\nCore inflation in Singapore eased to 3.1 per cent year on year for the first half of 2024, down from the 4.2 per cent recorded in 2023.\nThe latest recommendation for lower-wage workers mirrors the percentage range in the guidelines for the previous year, but the minimum amount suggested is higher.\nThe council also renewed its call for larger increases to be given to those lower-wage workers who earn less, in order to close the income gap.\nMeanwhile, it advised employers facing uncertain business prospects to implement the flexible wage system (FWS) comprising annual and monthly variable components to reward employees while maintaining wage flexibility.\n“The FWS enables employers to make quick adjustments during downturns to sustain their businesses by cutting costs rather than jobs,” said the NWC, adding that it also allows quick wage adjustments to retain talent when the economic situation is looking up.\nIt also said employers who have not done well may exercise wage restraint, with management leading by example.\nHowever, the council also cautioned that labour costs have risen more than labour productivity has in the first half of 2024.\nIt encouraged employers, particularly those with economic difficulties or lower productivity, to improve business processes and productivity, especially through investing in upskilling.\nThe council, which consists of government, employer and labour movement representatives, convened on Aug 29 to begin deliberations on the guidelines.\nIn his opening remarks at a news conference held on Oct 10 at the Ministry of Manpower (MOM), NWC chairman Peter Seah said the council has adopted a more positive tone that balances caution and optimism amid lingering macroeconomic uncertainties.\n“This leads us to call on employers to share the gains from labour productivity improvements to enable a fair and sustainable wage increase,” Mr Seah said.\nUnlike the previous edition, the latest guidelines did not call for all employers to consider giving a one-off special lump sum payment to employees to help them deal with rising living costs, in a reflection of the brighter outlook.\nHowever, National Trades Union Congress president K. Thanaletchimi noted that the latest guidelines still call for employers who have done well to reward their employees with variable payments, including one-off payments, in line with how employers and employees have performed.\nAsked if the recommendations supersede mandatory increases to the Progressive Wage Model, Permanent Secretary for Manpower Ng Chee Khern said the new guidelines for lower-wage workers are set to outpace the growth of the median wage.\nThe model refers to wage ladders that spell out wage rises in tandem with productivity and skill improvements.\n“What happens from here is that the NWC recommendations will inform the progressive wage negotiations that will take place in the coming year,” Mr Ng said.\nHe added that in 2023, 62.3 per cent of companies that did well and had positive business prospects gave employees both wage increases and an annual variable component, according to a poll by MOM.\nOver 73 per cent of those that did well but faced uncertain business prospects also provided an annual variable component.\nAsked whether businesses facing financial difficulties should strive to meet the guidelines or instead invest in processes and workers’ upskilling, and fall short of the guidelines, labour MP Patrick Tay said it was possible to do both by tapping support schemes, including grants from the labour movement and the Government.\n“We really urge then to leverage all those so that, instead of spending their own money, tap some of these grants to support them in their journey, (and) at the same time plough back savings they have to (invest) in training, transformation and job redesign.”\nMr Goh Jia Yong, partner in people consulting at Ernst and Young Advisory, told The Straits Times that the guidelines offer help for employers to establish competitive and fair wage practices to adopt.\nEven companies that are not doing well financially may still wish to strive to meet the lower end of the NWC guidelines to retain talent, he said.\nNonetheless, he suggested that more can still be done to guide employers on how to tap existing support schemes.\n“Providing tailored advice to individual employers on planning and managing such transformation efforts can optimise returns on investment.”", "url": "https://www.straitstimes.com/singapore/jobs/at-least-55-pay-rise-for-lower-wage-workers-among-latest-national-wages-council-guidelines"}