{"authors": ["Shermaine Ang", "Jordan Loo", "Taryn Ng"], "date_download": "2024-10-12 14:21:26", "date_modify": "2024-10-12 14:21:26", "date_publish": "2024-05-26 19:15:00", "description": "While some cost pressures have since eased, this may not translate to cheaper eats. Read more at straitstimes.com.", "filename": "singapore_hawker-food-prices-rose-by-61-in-2023-but-cost-pressure-easing_1728742886.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/26/KELL215520copy.jpg?VersionId=t3bxKfeyfWVHRtjm9Ze6Ygh_NyJLoWfc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_hawker-food-prices-rose-by-61-in-2023-but-cost-pressure-easing_1728742886.html", "title": "Hawker food prices rose by 6.1% in 2023, but cost pressures easing", "title_page": "Hawker food prices rose by 6.1% in 2023, but cost pressures easing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Hawker food prices rose by 6.1 per cent in 2023, the highest since 2008, a new study by the Singapore Department of Statistics (SingStat) found.\nFor example, the average cost of a plate of chicken rice in 2023 was $4.15, up from $3.40 in 2019, while that of a bowl of mee rebus went up from $3.26 to $3.79 in the same time period.\nWhile some cost pressures have since eased – with hawker food inflation falling to 4.1 per cent in December 2023 after peaking at 8.3 per cent in February 2023 – this may not translate to cheaper eats.\nPrice increases were driven partly by factors such as pricier raw food ingredients due to supply chain disruptions triggered by the Covid-19 pandemic and compounded by other events such as the Russia-Ukraine war, the study found.\nThey have since moderated because global energy and food commodity prices fell significantly between February and December 2023, said the Ministry of Trade and Industry, pointing out that the Singapore dollar nominal effective exchange rate also appreciated.\n“This abated cost pressures faced by F&B (food and beverage) service providers, including hawkers, in terms of imported raw ingredients, electricity and gas,” it said.\nIt expects hawker food inflation to ease further in 2024 if cost conditions stay favourable.\nGlobal prices of most food commodities such as cereals, meat and dairy are likely to continue falling due to favourable global supply conditions, and the Singapore dollar trade-weighted exchange rate is gradually strengthening, it said.\nThe study, published on May 6, compared the 6.1 per cent jump in overall hawker food prices in 2023 with the average price increase of 2.2 per cent per year observed from 2012 to 2022.\nIt compared prices of food across hawker centres, coffee shops and foodcourts, using the consumer price index for hawker food, which measures the average price changes across more than 100 hawker food items from 1,700 stalls. A total of 16 commonly sold food items and beverages were analysed.\nIn response to queries, SingStat said price increases were also observed at restaurants, which saw a 5.9 per cent increase, and in fast food, which was up 7.7 per cent.\nSingStat’s study also found that at hawker centres, drinks saw the largest price increase of 6.9 per cent, while at coffee shops and foodcourts, prices of noodle and rice items recorded the largest increases of 8 per cent and 6.5 per cent, respectively.\nCGS International economic adviser Song Seng Wun said prices of ingredients are affected by global trends such as climate change and war, which drove up prices of cooking oil, chicken, sugar and cocoa, among other ingredients.\nThe price spike in 2023 could also have been because some hawkers chose to raise prices at one go, rather than have incremental increases every year, said Dr Teo Kay Key, a research fellow at the Institute of Policy Studies. This finding was similar to results from her 2023 study on food prices called the Makan Index project.\n“Stall owners might have waited for the cost increases in different areas, such as utilities, rent, GST (goods and services tax), ingredients, and delivery, logistics or supply chain, to stabilise somewhat before deciding on the exact price increase, and to do a larger increase at one go.”\nMulling over keeping prices low\nHokkien mee hawker Mitchell Ong, 26, who has a stall at Golden Mile Food Centre, said ingredient and electricity costs are the key challenges he faces in keeping prices low.\nThe cost of 1kg of lime rose from $4 to $6 after the GST hike, and electricity prices went up from about $1,000 to $1,800 a month.\nThis drove him to raise prices for a plate of hokkien mee by $1, to $5, $6 and $7 currently, depending on the portion size.\nWhen asked how he keeps costs low, he said: “I cut down on my own expenses, cutting down on my meals from three to two a day. I also work longer hours now... (previously I worked) from 11.30am to 8pm, (now I work) from 10.30am to 9pm, or even 10pm.”\nMr Fadzil Mohd Alip, 28, a hawker at a halal Western food store in Golden Mile Food Centre, said: “Generally, protein prices increased the most during the GST hike. Increasing costs of oil, electricity and dried goods are more manageable.”\nHe raised the price of his chicken chop from $7.50 to $8.50 in February, but added two side dishes, baked beans and garlic bread, on top of the original fries and coleslaw.\nThe increase in prices of hawker food has not gone unnoticed among diners The Straits Times spoke to.\nMs Esther Tay, a diner at Koufu Toa Payoh Central, orders a cup of kopi-o every lunch break. The 49-year-old real estate agent noted that although kopi-o is already the cheapest option, its price has increased by 20 per cent at some places.\n“There’s a place at Clementi that sold a cup of kopi-o for $1.10, but when I went back after about two or three weeks, the price had increased to $1.40. I have to buy it, even though it’s expensive, because I need it.”\nMs Jackie Wong, 70, a retired clerk, said that she will turn to cheaper alternatives to a prawn mee stall she frequents if the price of the dish – which has gone up from $4 to $5 in the past two years – increases too much. But she is willing to pay more for higher-quality food and drinks, such as coffee from a stall called Kopi More at Golden Mile Food Centre.\n“The first time I came here, it was only $1.80, but it slowly increased to $2.50 as of late,” she said.\n“Kopi More coffee is made by the cup (not in bulk) and has better coffee beans than others. Nowadays, coffee already costs $1.50 to $1.60; I find it worth it to top up for a tastier cup of coffee.”", "url": "https://www.straitstimes.com/singapore/hawker-food-prices-rose-by-61-in-2023-but-cost-pressure-easing"}