{"authors": ["Salma Khalik"], "date_download": "2024-10-12 13:32:58", "date_modify": "2024-10-12 13:32:58", "date_publish": "2024-06-03 05:00:00", "description": "It is normal, and the condition goes away on its own after puberty in 90% of cases. Read more at straitstimes.com.", "filename": "singapore_one-in-six-boys-develops-breasts-during-puberty_1728739978.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/03/iStock-187045069.jpg?VersionId=bkthGc2xyKJu95gnd3tR5ccHQNrNtXx4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_one-in-six-boys-develops-breasts-during-puberty_1728739978.html", "title": "One in six boys develops breasts during puberty", "title_page": "One in six boys develops breasts during puberty | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – If you are in your early teens and start developing breasts or suffer from breast pain, do not worry. It is a normal part of puberty – yes, even for boys.\nAround 17 per cent of boys around the age of 13 develop “male boobs”, or gynaecomastia, according to Dr Chin Xinyi, a senior endocrinologist at KK Women’s and Children’s Hospital (KKH).\nIt is caused by a hormonal imbalance during puberty, when a boy gains sexual maturity.\nGynaecomastia also occurs in an estimated 60 per cent to 90 per cent of newborns, caused by oestrogen, the female hormone that babies receive from their mothers. Seventy per cent of men develop the condition from around the age of 60, as they produce less testosterone, the male hormone.\nIn most infants, the condition appears a few days after birth and disappears within weeks, said Dr Chin.\nWhen it manifests during puberty, the boy will feel an achy pain made worse when touched.\nDr Chin will verify that the swelling in the chest is caused by puberty and not some other underlying medical reasons, such as a cancer tumour. If it is due to hormonal changes during puberty, both the child and his parents often need only reassurance that the condition is normal. Obesity increases the incidence of gynaecomastia.\nIn 90 per cent of the cases, the condition will go away on its own after puberty, which usually takes two to four years, Dr Chin said.\nFor a minority, the condition may be permanent.\nRegarding treatment of the condition, Dr Chin said: “We have to take a very individual approach. It also depends on whether it is a mild case, or if it is more serious and affects the boy’s quality of life.”\nWhen the problem is serious, the size of the breasts can be 10cm to 15cm in diameter and they can droop, making them physically obvious.\nMore has to be done if the boy is bullied because of the condition and has lost his self-confidence, said Dr Chin. Parents can turn to school counsellors, and this has proven helpful in some cases.\nUsing chest binders or wearing loose tops also helps to hide the problem.\nFor the few who want treatment – around 10 a year – Dr Chin said there are several drugs that can be used to suppress the action of the oestrogen. The boy would be put on the drugs for a few months to see if the treatment is effective.\nIf medication does not work and if the boy’s self-confidence and quality of life is affected, surgery to reduce or remove the breasts is also an option. Dr Chin said plastic surgeons at KKH do one to two such cases a year. But surgery can be offered only after puberty.\nAt Singapore General Hospital, the treatment options lean towards surgery rather than drugs. SGH sees 250 to 300 gynaecomastia patients a year. They are roughly divided into two age groups: those who are 20 to 35 years old, and those aged between 60 and 75.\nDr Lim Sue Zann, a consultant in the department of breast surgery at SGH, said: “Around 100 to 150 patients will have some form of surgical intervention, which is tailored to the severity of their condition.”\nThere are various forms of surgery, from shaving off cartilage and liposuction, where fat is removed from the breast for milder cases, to mastectomy, where the entire breast is removed through a 4cm incision.\nSaid Dr Lim: “This provides a good cosmetic outcome for the patient.”", "url": "https://www.straitstimes.com/singapore/one-in-six-boys-develops-breasts-during-puberty"}