{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:33:25", "date_modify": "2024-10-12 13:33:25", "date_publish": "2024-09-16 05:00:00", "description": "French bulldog Wangcai suffered from a slew of health issues throughout his four-year lifespan. Read more at straitstimes.com.", "filename": "singapore_couple-spent-over-60k-on-vet-bills-but-dog-died-anyway-and-they-had-to-sell-flat-to-settle-debt_1728740005.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/16/jupets15a.jpg?VersionId=4HFj6xCKWmfKwqFnlj2K6kRrZuS5Lat9&h=fbb4307a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_couple-spent-over-60k-on-vet-bills-but-dog-died-anyway-and-they-had-to-sell-flat-to-settle-debt_1728740005.html", "title": "Even after $60k in vet bills and going into debt, S’pore couple couldn’t save their dog", "title_page": "Even after $60k in vet bills and going into debt, S’pore couple couldn’t save their dog | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – French bulldog Wangcai started life with a slew of chronic health issues.\nFirst-time dog owners Jackie See and Judyvein Cheng bought the male dog as a four-month-old puppy in 2018 for $4,800 from a local backyard breeder.\nSoon the married couple discovered Wangcai had mites, stomach issues, a yeast infection and rashes.\n“As first-time pet owners, we felt anxious and helpless. We kept going to the vet to find out what was wrong and constantly switched from premium kibbles to a hypoallergenic diet from the clinic. We spent between $2,000 and $3,000 (on the vet visits and food), but his condition did not improve,” Ms Cheng, an event organiser, told The Straits Times.\nWangcai was also given cytopoint, an antibody used to treat atopic dermatitis, a chronic condition he was diagnosed with which causes dry, itchy and inflamed skin, but his condition worsened.\n“He was scratching more and that led to some open sores and bleeding every day. He also developed hives, redness in his groin, ‘armpit’ area and between his toes, rashes on his belly, fur loss and scabs and dandruff-like flakes,” Ms Cheng said.\n“We realised we were treating the symptoms, not going to the root of the skin issue. The medication was affecting his immune system, and realising what we had put our baby through, I cried,” she added.\nAfter the vet said that Wangcai had to go back once every two weeks for the cytopoint injection, which cost around $400 each, and would be on antihistamine for the next six months, she and her event emcee husband felt that Wangcai had had enough medication.\nThey looked into changing his diet instead. After six months of trial and error, the couple settled on a diet that seemed to suit him.\nWhen Wangcai was around two years old, his health turned around – he stopped scratching incessantly and “became a normal dog”. And the couple was $10,000 poorer.\n“We went through 1½ years of craziness. It was a steep learning curve providing care to Wangcai. That was when we started researching and learning as much as we could about pet health, lifestyles, supplementation, nutrition and many other factors that would impact our pets’ quality of life,” Ms Cheng said, adding that it was also why the couple went on to open a holistic pet store.\nWhen Wangcai grew older, other health issues surfaced – he was found to have an enlarged prostate and joint issues.\nAnimals like Wangcai that are sold by backyard breeders may cost less, but they often have birth or genetic defects and infectious diseases, according to experts.\nAnimal welfare groups and the authorities have warned against buying pets from these breeders, as pet ownership here hit an all-time high and more illegal breeders are selling animals through online platforms such as Facebook groups and Telegram.\nAccording to a Euromonitor International report, the pet dog population in Singapore was around 114,000 in 2023, up by almost 3 per cent from 2019. The pet cat population hovers around 94,000 in 2024, a jump of almost 10 per cent from 2019.\nTo deal with Wangcai’s enlarged prostate, Mr See and Ms Cheng tried herbal remedies instead of neutering him. Four to six months later, the prostate did not shrink, but it was not giving Wangcai any urinary problems, either.\n“To understand his joint issues, we sent him for an X-ray but the issues did not show up on the film. That was when we turned to chiropractic and swimming sessions for his joint problems. They provided relief but did not fix the problem,” Ms Cheng said.\nBy then, Singapore was in the throes of the Covid-19 pandemic and the lockdown affected the entertainment industry. The couple were struggling financially but Wangcai’s health issues did not dissipate.\n“We had just started our holistic pet store... and were trying to make ends meet. (So) we held back on dealing with Wangcai’s health head-on. Till this day, I regret the decision,” Ms Cheng said, her voice breaking.\n“We could not keep doing MRI (magnetic resonance imaging) to monitor his joints. Each MRI cost $5,000 and we were strapped for cash,” she said.\nA young, active dog, Wangcai loved to jump, dash and lunge. One day, the behaviour led to a tear in his cranial cruciate ligament (CCL), a common cause of hind limb lameness and pain.\nThe CCL tear spiralled into intervertebral disc disease (IVDD) – a common source of back pain in dogs. The condition is more common in French bulldogs and can cause excruciating pain, incontinence and paralysis in serious cases.\n“It happened overnight. He was walking funnily when we woke up in the morning. Jackie suspected it was IVDD and the only thing that could correct it was surgery,” Ms Cheng said.\nAt the veterinary hospital they were referred to, Ms Cheng was told that the CT scan would cost $9,000 and the surgery alone $25,000.\n“My mind went blank. I took Wangcai home and started calling other animal hospitals to see if their charges were lower, much lower,” Ms Cheng said.\nThat same night in December 2022, Wangcai’s pain became unbearable and he was thrashing about and went into seizures, making the situation worse. Ms Cheng took him to another hospital. Unfortunately, the surgeon’s schedule was full.\n“I practically begged him before he agreed to free up his appointments to help. Then came the financial crisis. There was not enough credit on my cards to pay for the surgery and the surgeon would not start unless a deposit had been made. Fortunately, a friend had accompanied me there and she forked out the difference,” she said.\nWangcai was discharged from the animal hospital after the surgery, relieved of pain but paralysed. Four days later, things went south and Wangcai was rushed back to the hospital.\n“The team managed to stabilise him, but I noticed he was having difficulty breathing. In front of me, he suffered a seizure, and I was immediately pushed out of the room before the nurses called ‘code blue’ (which means a patient has gone into cardiac or respiratory arrest). The vet and nurses tried to resuscitate him for two to three minutes but Wangcai died,” Ms Cheng recalled.\n“Did we kill him by wanting the best for him? He went through so much pain in his short four years of life,” Ms Cheng said, sobbing from the memory.\nFor all the treatments, the couple emptied their savings. Not only that, they also sold their Housing Board flat in August 2023 to clear the credit card loans they took for Wangcai’s medical bills.\nNot wanting to give up on Wangcai’s memory, they used some of the proceeds from the sale of the flat to continue their holistic pet food business “as part of Wangcai’s legacy and hopefully to help the pet community using alternative solutions”.\nThe tragic experience did not stop the couple from loving another dog.\nAfter a year of grieving, they adopted another French bulldog on Christmas 2023 – Bean Bean, a former breeding dog from animal welfare group Voices for Animals.\n“Having been through the experience with Wangcai, we believe we will be able to care for Bean Bean better,” Ms Cheng said.", "url": "https://www.straitstimes.com/singapore/couple-spent-over-60k-on-vet-bills-but-dog-died-anyway-and-they-had-to-sell-flat-to-settle-debt"}