{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:49:20", "date_modify": "2024-10-12 13:49:20", "date_publish": "2023-09-11 05:00:00", "description": "SINGAPORE – To address rising sea levels due to climate change, a new research institute has been launched to develop innovative, multi-functional coastal protection and flood management solutions for Singapore’s coastlines and to build local expertise. Read more at straitstimes.com.", "filename": "singapore_climate-proofing-singapore-s-coastlines-some-coastal-protection-projects_1728740960.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/11/yaohui-pixtide-3191.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_climate-proofing-singapore-s-coastlines-some-coastal-protection-projects_1728740960.html", "title": "Climate-proofing Singapore’s coastlines: Some coastal protection projects", "title_page": "Climate-proofing Singapore’s coastlines: Some coastal protection projects | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – To address rising sea levels due to climate change, a new research institute has been launched to develop innovative, multi-functional coastal protection and flood management solutions for Singapore’s coastlines and to build local expertise.\nThe Straits Times looks at the goals of the new Coastal Protection and Flood Resilience Institute (CFI) Singapore and some of the projects that the centre will embark on.\nGoals of CFI Singapore\nConduct coastal science research\nTo study the impact of climate change on coastal process such as wind waves, storm surge levels and astronomical tides, and on coastal protection structures.\nMonitor and predict the coastal environment\nEnhance prediction systems for coastal processes, rainfall and water run-off.\nIntegrate nature-based solutions\nThis includes mangroves, seagrasses and corals, with various man-made structures like sea walls to shore up coastal protection.\nDevelop innovative engineering solutions\nCreate multi-functional solutions for Singapore’s coastal environment. For example, the Marina Barrage not only serves as a dam for flood control but is also a source of fresh water and a recreational space.\nCFI has begun its work on nine projects so far, here’s a look at some of the projects\nRetrofit existing coastal protection structures\nModular, watertight units can be added on top of existing coastal protection structures such as seawalls to better guard against sea level rise.\nPUB is working with Delta Marine Consultants to explore the use of modular blocks known as XblocPlus along Singapore’s coastlines.\nFlexible sea walls\nSeawalls are designed to protect land and infrastructure from erosion caused by waves and tides.\nA flexible sea wall with adjustable height can be installed to address uncertainties in sea level rise.\nTesting existing hybrid protection solutions\nMangroves and rock revetments\nNatural ecosystems like mangroves can be harnessed to keep pace with rising sea levels as their tangled roots can trap sediments brought in by the tides.\nThey can therefore supplement man-made structures like rock revetments to prevent coastal erosion and reduce the force of waves.\nIf found to be effective, these hybrid solutions can reduce the extent of infrastructure needed.\nPerched beach\nA submerged breakwater, comprising rock bunds and sand is constructed to create a beach.\nThe underwater structure can reduce wave energy on the beach, while seagrass habitats can help to trap sediment on the seafloor, thus preventing coastal erosion.\nThe perched beach also helps to disperse water and control erosion.\nMangrove planters\nA study conducted jointly by researchers at the University of Melbourne and NUS found that planting pods placed at the Chek Jawa Wetlands on Pulau Ubin were able to increase the survival rates of mangrove seedlings.\nThese planters can protect mangrove seedlings from strong currents.\nThe planters can be reused once the mangroves have established a strong root system.\nSite-specific studies\nSingapore’s coastlines have been divided into eight different segments for site-specific studies of coastal protection measures. Here’s a look at the progress:\nThe research findings by the CFI will help guide the coastal protection solutions that Singapore could implement. This will be done in phases, from around 2030, starting with the City-East Coast area.\nCorrection note: In a previous version of the story, it was stated that the mean sea level in Tanjong Pagar in 2022 was 7.23m. The relevant authorities have highlighted that the figure, which is taken from the Permanent Service for Mean Sea Level website, is not accurate. It should be about 0.2m instead.", "url": "https://www.straitstimes.com/singapore/climate-proofing-singapore-s-coastlines-some-coastal-protection-projects"}