{"authors": ["Nadine Chua"], "date_download": "2024-10-12 13:27:24", "date_modify": "2024-10-12 13:27:24", "date_publish": "2024-03-17 05:00:00", "description": "Most of the scam victims who made reports relating to the singer‘s concert tickets were females aged 30 and below. Read more at straitstimes.com.", "filename": "singapore_at-least-960-in-singapore-lost-over-538k-in-10-weeks-to-taylor-swift-concert-ticket-scams_1728739644.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/17/WTY7256ts.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_at-least-960-in-singapore-lost-over-538k-in-10-weeks-to-taylor-swift-concert-ticket-scams_1728739644.html", "title": "At least 960 in Singapore lost over $538k in 10 weeks to Taylor Swift concert ticket scams", "title_page": "At least 960 in Singapore lost over $538k in 10 weeks to Taylor Swift concert ticket scams | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The sixth and last concert American pop star Taylor Swift held in Singapore was on March 9, but police reports of e-commerce scams involving tickets to The Eras Tour are still coming in.\nAssistant Commissioner of Police Aileen Yap, who is also assistant director of the police’s Anti-Scam Command (ASCom), said this in an exclusive interview with The Straits Times on March 11.\nAC Yap said the reports lodged include some from victims who bought tickets from resellers and went to the National Stadium, only to discover that the tickets were fake and they could not enter the venue.\nIn other cases, scammers became uncontactable after receiving money from victims.\nAC Yap said: “Within the first few days of Taylor Swift arriving in Singapore, the number of reports relating to concert ticket scams just shot up.”\nThe police said that between Jan 1 and March 12, at least 1,551 victims had fallen prey to e-commerce scams involving concert tickets, with total losses amounting to at least $737,000.\nAt least 960 of these victims had fallen for scams involving tickets to Swift’s concerts, and more than $538,000 was lost.\nAC Yap said: “With more acts coming to Singapore, I’m worried the number of e-commerce scams will increase. If I were to make an assessment, I think e-commerce scams will be the top scam in the first half of 2024 if this trend continues.”\nIn 2023, the most common ruse victims fell prey to was job scams. E-commerce scams were the second most common scam that year, with 9,783 cases reported and at least $13.9 million lost.\nAC Yap added that most of the e-commerce scam victims who made reports relating to tickets to Swift’s concerts were women aged 30 and below.\nOptimism bias – the belief that one is less likely to experience a negative event compared with others – and overconfidence bias – the tendency to overestimate one’s knowledge – are among several factors that could have led some victims to be deceived, explained AC Yap.\n“The issue of concert ticket scams is a challenge for us because there isn’t a straightforward way to totally combat it,” she said.\n“Perhaps scalping can be regulated, because there are people who make thousands of dollars every time there is a major concert here by buying tickets in bulk and selling them at much higher prices. Others design bots just to purchase tickets at a fast rate.”\nAC Yap commended online marketplace Carousell for suspending the sale of tickets to Swift’s concerts on its platform between Feb 23 and March 9 to prevent users from being scammed.\nCarousell’s chief of staff Tan Su Lin said on March 13 that amid the rush for tickets, users were not catching on to scam indicators, such as sellers’ ratings that show if other buyers had found them to be reliable.\nScammers also targeted victims on other platforms such as Facebook, X, Telegram and Xiaohongshu, said AC Yap.\nShe added: “I’m concerned because as Singapore looks to host more concerts, we may have to anticipate more of such scams. Scammers can take advantage of these major concerts to proliferate their business.”\nNational University of Singapore business professor Lawrence Loh said: “Singapore’s standing as a cultural hub is because of our infrastructure, facilities, connectivity and overall landscape. Scams should be closely watched, but I believe it will not affect the reputation we have for holding events well.”\nIn fact, enforcement efforts by the authorities to clamp down on concert ticket scammers show foreigners that Singapore does not take scams lightly, he added.\nProf Loh noted the arrest of a 29-year-old woman who allegedly cheated victims of more than $24,000 on the pretext of selling tickets to Swift’s concerts.\nAnother growing scam of concern here in the past year is that relating to malware, said AC Yap.\nIt was the sixth most common scam in 2023. There were 1,899 such cases reported, with $34.1 million lost.\nAC Yap recounted a case in which a 50-year-old widow with two sons, aged 10 and 12, almost lost $110,000 to a malware scam.\nMost of the money in her bank account was from the life insurance payout of her husband, who died in 2022.\nSaid AC Yap: “She downloaded a file on Facebook thinking she could use it to pay for groceries. But after she keyed in her banking details, her phone was compromised and money was transferred out of her DBS account.”\nDBS Bank informed ASCom, whose officers tracked the funds to another bank and asked that the money be held there. Meanwhile, another officer called the victim to tell her she had fallen for a scam.\nBut the victim did not believe the officer was legitimate, said AC Yap.\nShe said: “When we tried to call her again, she blocked the number on her phone, and we couldn’t get through to her.”\nThe officer went to her home, but she was not in. Ironically, she had gone to make a police report.\nAC Yap said: “Because of the swift intervention of the officers, we managed to prevent her from losing her life savings and the insurance payout.”\nStaff from six banks – DBS, OCBC, UOB, Standard Chartered, HSBC and CIMB – and the Government Technology Agency have been deployed at ASCom to tackle scam incidents more quickly.\nCarousell’s staff joined them on Jan 30.", "url": "https://www.straitstimes.com/singapore/at-least-960-in-singapore-lost-over-538k-in-10-weeks-to-taylor-swift-concert-ticket-scams"}