{"authors": ["Carmen Sin"], "date_download": "2024-10-12 13:27:51", "date_modify": "2024-10-12 13:27:51", "date_publish": "2024-01-04 17:40:00", "description": "Other themed offerings include a stamp booklet, minipane and a stamp folder with decorative stamp sheet. Read more at straitstimes.com.", "filename": "singapore_singpost-marks-year-of-the-dragon-with-stamps-postcards-collector-s-sheet_1728739671.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/04/Media20Release20-20Ring20in20202420with20Zodiac20Dragon20stamps-16.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singpost-marks-year-of-the-dragon-with-stamps-postcards-collector-s-sheet_1728739671.html", "title": "SingPost marks Year of the Dragon with stamps, postcards and collector’s sheet", "title_page": "SingPost marks Year of the Dragon with stamps, postcards and collector’s sheet | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A dragon-themed stamp set, a special collector’s sheet and postcards featuring the mythical beast are among the memorabilia SingPost is launching to mark the Year of the Dragon in the Chinese calendar.\nThe dragon-themed stamp set will go on sale from Jan 5 and is the fifth instalment in SingPost’s Chinese zodiac series, said SingPost on Jan 4.\nArtist Lim An-Ling designed the entire series, which began in 2020 with the Year of the Rat.\nThere are two stamps in the 2024 stamp set: a first local stamp of a blue dragon set against a white backdrop (52 cents) and a pricier blue stamp with a white dragon centrepiece ($2).\nEnvelopes affixed with both stamps and cancelled with a special zodiac dragon postmark will be sold at $4.05, while a presentation pack containing both stamps can be bought for $5.10.\nCollectors can pick up the special collector’s sheet for $19.15 to receive a $10 stamp framed by four intertwined dragons, in a riff on traditional Chinese paper cuttings. The sheet, designed by Mr Andy Koh, also comes with a set of eight red packets.", "url": "https://www.straitstimes.com/singapore/singpost-marks-year-of-the-dragon-with-stamps-postcards-collector-s-sheet"}