{"authors": ["Elisa Chia"], "date_download": "2024-10-12 13:44:12", "date_modify": "2024-10-12 13:44:12", "date_publish": "2024-03-10 15:00:00", "description": "It is important to find out why kids procrastinate or are reluctant to hit the books. Read more at straitstimes.com.", "filename": "singapore_parenting-education_your-kids-aren-t-lazy-they-just-don-t-know-how-to-revise-independently_1728740652.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/10/iStock-1192996952.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_parenting-education_your-kids-aren-t-lazy-they-just-don-t-know-how-to-revise-independently_1728740652.html", "title": "Your kids aren’t lazy; they just don’t know how to revise independently", "title_page": "Your kids aren’t lazy; they just don’t know how to revise independently | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Your children’s weighted assessment results are back.\nThey could have done better, you tell them, had they not been lazy and revised their school work consistently.\nYou are not alone in grumbling about your kids’ laziness when it comes to studying.\nSome mums and dads are also frustrated that their children are not ramping up revision in their Primary School Leaving Examination (PSLE) year.\nThese were common refrains that Dr Wong Hwei Ming heard from parents when she was a teacher at Singapore Chinese Girls’ Primary School.\nDr Wong was also a part-time pro bono counsellor at a primary school for 18 years and an educational psychologist at the Ministry of Education. She is now an assistant centre director and senior education research scientist at the Centre for Research in Pedagogy and Practice in National Institute of Education (NIE).\nWhat she understands from some pupils is that they put off revision because they struggled to get started or felt unsure about what to practise at home.\nAnother former teacher, Dr Lee Ai Noi, who has more than 20 years of teaching experience at primary and secondary schools, adds: “There are no inherently ‘lazy’ kids.”\nDr Lee, who is now a senior lecturer in Psychology and Child and Human Development at NIE, notes that some kids may lack the drive to study and become disengaged.\n“But adults often label unmotivated kids as ‘lazy’, incorrectly implying a flaw in their character,” she says.\nDr Yeap Ban Har, a former NIE lecturer in mathematics education for 11 years and maths textbook author, points out that it is about teaching children to be independent learners.\nKids who are used to having things planned for them lose their ability to take the initiative.\nDo not make the parenting mistake of micromanaging them, adds Dr Yeap, who will be speaking at the ST Smart Parenting PSLE Prep Forum on April 6.\nHe is now the director of curriculum and professional development at Pathlight School in Singapore as well as Anglo Singapore International School in Thailand.\nIt is also important for you to find out why your kids procrastinate or are reluctant to hit the books.\n“Understanding why kids may appear ‘lazy’ is crucial to providing the appropriate guidance for them to excel,” Dr Lee says.\nDr Wong adds: “Every child is unique, so it may take some trial and error for families to find the strategies that work best.”\nSo, hear your kids out. Here are nine common gripes from children and how you can support them better – without nagging. These strategies can be applied to upper-primary school pupils, although teens can also benefit from them.\n1. ‘Why revise? I know these topics already.’\nMake connections to your children’s personal interests, Dr Wong suggests.\nFor instance, you can tell them: “You enjoy playing football and you practise to get better at it.”\nExplain to them that revisiting topics multiple times helps reinforce what they have learnt in class, Dr Lee adds.\nThey will remember important concepts and are better prepared when assessments and exams roll around.\n2. ‘What’s the point? I will never score AL3 or better.’\nSome kids carry the burden of unrealistic expectations, whether self-imposed or from their parents.\nWhen they have low self-esteem and lack confidence in their abilities, they may give up on revising altogether.\nDr Lee suggests fostering a growth mindset in them. When children feel that the goal is unattainable, they can feel even more demoralised.\nSet achievable targets and break them down further into manageable milestones.\n“Provide constructive feedback and praise their effort, rather than focus on outcomes,” she says.\nYour affirmation can boost their morale, Dr Wong adds, and help them develop a positive attitude towards learning.\n3. ‘So many topics, so little time.’\nSome pupils may struggle to allocate time effectively for revision, leading to last-minute cramming or avoiding their books, Dr Lee observes.\nGuide your children to set study goals and teach them time-management techniques, such as breaking tasks into smaller ones and setting deadlines, she adds.\nDr Wong says that daily practice can be beneficial for reinforcing learning and building good study habits, but vary the schedule according to your kids’ needs.\nUltimately, give them independence in planning a consistent routine that works for them.\n“It allows them to take ownership of their learning,” she says.\n4. ‘I don’t know how to do this.’\nEncourage your children to identify and place tasks under the broad categories of “I can do this” and “I need help”, Dr Yeap suggests.\nGuide them on the difficult ones, but do not attempt to cover too many.\n“They may get overwhelmed,” he says. “Tell them, ‘Let’s work on this today; we will handle the rest another time.’\n“It is even better if they pick the one that they want to deal with.”\nFor maths, you can teach your kids to organise the questions by difficulty levels: the basic, the familiar and, finally, the challenging ones.\n“Make it explicit that their goal is to master the first two types. The third kind? We try our best. Sometimes we succeed, often we don’t – and that’s okay.”\nAt some point, let them choose if they want you or their teachers to help them.\nSeeking help from their teachers takes confidence. Many kids see this as a weakness and an embarrassing act.\n“Try not to let this mindset take root,” he says. “I do not know any teacher who will not help a kid who asks for help.\n“As a teacher, I am always impressed by such children.”\n5. ‘I’m not sure where to start, what to study.’\nIf you usually sit with your children to supervise them while they study, consider cutting down on the habit, Dr Wong says.\nMeanwhile, do not use your phone when you are at their study space as that will be distracting to them. Do your own work or reading.\nThe age that your kids can be left to revise alone depends on their personalities, levels of maturity and academic abilities.\nTake on a supportive role instead to facilitate the process, such as providing a distraction-free learning environment, offering encouragement and being there if they have questions.\n“Ultimately, your goal is to help your children develop the skills and confidence to study independently as they advance in their education,” she says.\nIf your kids feel insecure about not having you by their side, try telling them: “When studying on your own and figuring out certain things, it is like completing a level on your favourite game. You feel proud of yourself and become more confident in what you can do.”\n6. ‘I don’t understand why we have to learn this.’\nLearning will be more meaningful if children see the relevance and value of the subject or topic, says Dr Lee.\nFor instance, let them know how important English is in their everyday communication with others, particularly in a multiracial society like Singapore’s.\nMastering the language also opens doors to future academic pursuits and career opportunities such as journalism, teaching and law.\n7. ‘Wait, I need to check my phone first.’\nWould you rather scroll socials on your phone than be stuck with mundane tasks? The answer is clear for your kids too.\nHelp them stay focused by removing gadgets and other distractions from their study space, which should ideally be quiet and well-lit, Dr Wong says.\nDiscuss with your children and set rules for when they are allowed to use their devices. Work this into their revision plan.\n8. ‘But I’m very tired.’\nYour kids’ well-being and childhood should not be sacrificed even when it comes to high-stakes exams like the PSLE.\nTheir daily routine should include breaks, so they can do things they enjoy and also rest.\nHaving regular exercise, sufficient sleep and balanced meals is also important as these help children to concentrate and study effectively, Dr Wong says.\nDr Lee adds that you can teach them relaxation techniques, such as deep-breathing exercises and listening to calming music, to manage anxiety.\n9. ‘No matter how hard I try, I can’t remember the formulas or focus.’\nTeach your kids study habits such as organising information, note-taking and summarising, says Dr Wong.\nWhen they are stressed, it can also impact their ability to acquire and retain information. Be supportive and let your kids feel comfortable expressing themselves and asking for help.\nKids with learning disabilities, such as attention-deficit hyperactivity disorder or dyslexia, may find it harder to stay on task.\nIf you notice persistent challenges that hinder your children’s ability to study independently, consult their teachers, school counsellors or educational psychologists, who can offer strategies and intervention.\nGet experts’ tips on PSLE preparation at ST parenting forum\nThe popular ST Smart Parenting PSLE Prep Forum is back.\nIf you want expert tips on helping your child in his or her PSLE journey, sign up for the two-hour event which takes place at SPH Media Auditorium on April 6 at 10am.\nHear from Mr Ong Kong Hong, the Ministry of Education’s divisional director from Curriculum Planning and Development Division 1, who will share what you can do to better support your child for the PSLE journey and in secondary school.\nST senior education correspondent Sandra Davie will moderate the session.\nNext, learn how you can help your child excel in PSLE mathematics from Dr Yeap Ban Har, a former NIE lecturer and maths textbook author.\nRegister for the event at str.sg/psle2024 by March 31. The fees are $15 each for ST subscribers and $35 for non-subscribers. For inquiries, e-mail stevents@sph.com.sg\nRunning concurrently with the forum is a 75-minute English workshop for pupils, so reserve a seat for your Primary 6 child.\nThey will learn to write impactful compositions using current affairs, with a focus on descriptive and narrative writing techniques.\nThe workshop, at $40 a child, will be conducted by ST News-in-Education specialist Debra Ann Francisco, a former English and literature teacher.", "url": "https://www.straitstimes.com/singapore/parenting-education/your-kids-aren-t-lazy-they-just-don-t-know-how-to-revise-independently"}