{"authors": ["Lim Yan Liang"], "date_download": "2024-10-12 13:33:19", "date_modify": "2024-10-12 13:33:19", "date_publish": "2022-03-27 00:40:29", "description": "It published false account of a pregnant patient who had allegedly suffered a miscarriage after waiting four hours to see a doctor. Read more at straitstimes.com.", "filename": "singapore_wake-up-singapore-issued-pofma-correction-direction-for-falsehoods-about-kkh_1728739999.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/27/yu_wakeupsg.jpg?VersionId=h4TxKTjADMznYXFf4XlQkn1lgFCoBgHp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_wake-up-singapore-issued-pofma-correction-direction-for-falsehoods-about-kkh_1728739999.html", "title": "Wake Up, Singapore issued Pofma correction direction for falsehoods about KKH", "title_page": "Wake Up, Singapore issued Pofma correction direction for falsehoods about KKH | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Alternative news site Wake Up, Singapore (WUSG) has been issued a correction direction by the Pofma Office over falsehoods it had published about KK Women's and Children's Hospital (KKH).\nIn a statement shortly after midnight on Sunday (March 27), the Ministry of Health (MOH) said it instructed the Protection from Online Falsehoods and Manipulation Act (Pofma) Office to issue a correction direction to the news site for publishing a false account of a 20-weeks pregnant patient who had allegedly suffered a miscarriage after waiting four hours to see a doctor at KKH.\nInvestigations by KKH confirmed that the patient had been seen by a doctor within an hour of her arrival at the hospital in February, and that she did not suffer any miscarriage, said MOH.\nKKH had identified the patient in question based on a screenshot of a hospital bill accompanying WUSG’s posts, which contained discrepancies with the patient’s account of events, added the ministry.\nMOH noted that WUSG had on Friday published further posts on its Facebook and Instagram pages stating that it had been lied to by the patient and that her recollection was false, and that the news site had apologised to KKH for publishing these allegations.\nWUSG’s apology came after KKH made a police report earlier that day and put out a statement that the claim by the pregnant woman was “incorrect”.\nProfessor Alex Sia, chief executive of KKH, said in a statement then: “KKH would like to clarify that the online report on the incident at the Urgent Obstetrics and Gynaecology Centre is incorrect.”\nHe added: “We can definitively say that there is no such scenario. We have since made a police report.”\nMOH said that, notwithstanding its apology, the allegations published by WUSG are serious and have been circulated to various other platforms. “This could lead to the erosion of public trust in the credibility and professionalism of our healthcare system and institutions.”\nUnder the correction direction, WUSG is required to publish correction notices as specified by the Pofma Office for each webpage and social media post containing the falsehoods.\nWUSG published the correction notices shortly after MOH’s statement was put out, at 12.24am on Facebook and subsequently on Instagram.\nOn Saturday afternoon, WUSG sought to provide an account of how it had come to publish the allegations, and published more than 50 screenshots that it said documented its exchanges with the pregnant woman.\n“We are sorry to our readers and the good people of KKH. We will face the consequences of our actions and take responsibility,” it said. “As mentioned yesterday, we will co-operate with investigations and do what is necessary.”\nMOH said: “The Government takes a serious view of these falsehoods, which appear to have been fabricated. The matter has been referred to the relevant authorities for investigation.”", "url": "https://www.straitstimes.com/singapore/wake-up-singapore-issued-pofma-correction-direction-for-falsehoods-about-kkh"}