{"authors": ["Salma Khalik"], "date_download": "2024-10-12 14:00:51", "date_modify": "2024-10-12 14:00:51", "date_publish": "2023-02-27 15:54:53", "description": "They stress importance of developing new drugs. Read more at straitstimes.com.", "filename": "singapore_new-drugs-needed-or-antimicrobial-resistance-could-kill-more-people-than-cancer-by-2050_1728741651.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/27/svmeds270223_6.jpg?VersionId=ZppvMg__Wg3Xplx.Ga5NIsXJh3uL0gA5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_new-drugs-needed-or-antimicrobial-resistance-could-kill-more-people-than-cancer-by-2050_1728741651.html", "title": "Antimicrobial resistance could kill more people than cancer by 2050, experts say", "title_page": "Antimicrobial resistance could kill more people than cancer by 2050, experts say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Antimicrobial resistance (AMR) is one of the biggest threats facing healthcare, and is projected to kill more people by 2050 than cancer, say experts.\nIn lower- to middle-income countries during the Covid-19 pandemic, one in four deaths among seriously ill patients who had been in the intensive care unit (ICU) for five days or more was caused by AMR, said Professor David Paterson of the NUS Saw Swee Hock School of Public Health.\nThe problem also exists in rich countries but to a lesser extent.\nSaid Prof Paterson: “When carbapenems (a class of strong antibiotics reserved for use in multi-drug-resistant bacterial infections) don’t work, we’re in a really difficult situation.”\nHe is the director of a new network called Advance-ID, which brings together more than 60 hospitals from 15 countries and hopes to be the “go to” place when pharmaceutical companies want to evaluate new antimicrobials and new diagnostic or preventive strategies.\nThe network’s mission is to run “high-quality clinical trials that have a global impact on the management of infections”.\nDr Timothy Jinks, head of infectious disease interventions at Britain’s charitable foundation Wellcome Trust, said at the two-day Advance-ID Launch Symposium that it is important to focus on communities “most vulnerable to the impacts of infectious diseases”. He added: “So we’re focusing resources on sources of drivers of infectious disease.”\nWellcome Trust is supporting the network with more than $10 million. Five institutes here – the NUS Saw Swee Hock School of Public Health, NUS Yong Loo Lin School of Medicine, Duke-NUS Medical School, Lee Kong Chian School of Medicine at Nanyang Technological University, and the National Centre for Infectious Diseases – have each contributed $500,000, adding another $2.5 million. This money is for the 2022 to 2024 period, after which more funding is expected.\nProf Paterson said it makes sense to have clinical trials for new antibiotics or preventive strategies carried out in Asia, as almost half of the five million AMR deaths in 2019 were in this region. Hospitals that participate in the trials have the opportunity to gain access to new drugs.\nProfessor Kenneth Mak, Singapore’s director of medical services, who gave the opening address at the symposium on Monday, described AMR as “a slow-burn pandemic”.\nHe said: “Its impact on our healthcare systems and communities can be profound. Pathogens resistant to the already limited antibiotic options we have today can lead to poorer patient outcomes and greater difficulty in treatment. This could result in a longer hospital stay and higher overall healthcare costs.”\nProf Mak said the Covid-19 pandemic has shown that infectious diseases, including the threat of AMR, “easily transcend borders in today’s highly connected world”.\nInfectious pathogens can emerge in one place and ride on humans, animals and other vectors such as food and surfaces, ending up in a vastly distant location compared with its original source, he added.\n“An outbreak can be seeded in such a manner, and where scientific developments have not caught up with a new and emerging pathogen, this is when epidemics and pandemics can occur.”\nProf Paterson said that at some hospitals in the new network, half of the bacterial infections in patients in the ICU are resistant to carbapenem. Such resistance is also found here but accounts for less than 10 per cent of those infected, he added.\nWhen that happens, doctors have to fall back on a very old antibiotic called colistin, which infectious diseases doctors have stopped using for about 40 years because of its high toxicity that commonly causes kidney and neurological problems.\nBacteria have no resistance to colistin because it has not been in use for decades. But its toxicity makes it a drug of last resort that doctors would prefer not to use.\nThat is why it is so important to develop new antibiotics, which have to be tested. This is what the network hopes to facilitate.\n“We desperately need alternatives. That’s our No. 1 priority for trials of alternatives to colistin,” said Prof Paterson. “Already, we’ve got such a pipeline of people wanting to do projects with us. It’s quite amazing.”\nThe great interest in the network is fuelled by the war in Ukraine. Prof Paterson said: “Companies used to do a lot of their trial work in Ukraine and Russia, and they now need new venues for their trials. I know it’s a horrible circumstance to have this opportunity. But it is a huge opportunity for us to take.”\nThe network will pick two or three out of the dozen potential drugs to test, with the first multi-hospital trial expected to start later in 2023.", "url": "https://www.straitstimes.com/singapore/new-drugs-needed-or-antimicrobial-resistance-could-kill-more-people-than-cancer-by-2050"}