{"authors": ["Grace Ho"], "date_download": "2024-10-12 13:46:22", "date_modify": "2024-10-12 13:46:22", "date_publish": "2021-04-08 18:00:00", "description": "He added that while the Govt's immediate focus is on the health and economic crisis, succession remains an urgent task. Read more at straitstimes.com.", "filename": "singapore_politics_pm-lee-to-stay-on-as-prime-minister-until-new-4g-leader-is-chosen-and-ready-to_1728740782.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/04/08/photo_2021-04-08_17-48-22.jpg?VersionId=vki8LEyRCThc6IFEpb5n_ekz.D4WtSp3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_pm-lee-to-stay-on-as-prime-minister-until-new-4g-leader-is-chosen-and-ready-to_1728740782.html", "title": "PM Lee Hsien Loong to stay on until new 4G leader is chosen to replace DPM Heng Swee Keat", "title_page": "PM Lee Hsien Loong to stay on until new 4G leader is chosen to replace DPM Heng Swee Keat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - With Deputy Prime Minister Heng Swee Keat stepping down as the fourth-generation leader, Mr Lee Hsien Loong will stay on as prime minister until the 4G team chooses a new chief.\nAt the press conference announcing the move on Thursday (April 8), PM Lee called Mr Heng's decision to stand aside a \"selfless\" one.\n\"His actions are made with the best interests of Singapore in mind, and they are fully in keeping with the spirit of public service and sense of duty that motivated him to step forward and stand for election when I asked him to do so in 2011,\" he said.\n\"Nevertheless, as the 4G statement acknowledges, this is a significant setback to our succession plans.\"\nIn a statement issued on Thursday, the 4G team called the unexpected turn of events \"a setback for our succession planning\".\nMr Heng was managing director of the Monetary Authority of Singapore from 2005 until 2011, when he stepped down to contest in the general election that year. On May 18, 2011, Mr Lee appointed him to the Cabinet as the education minister.\nNoting that the 4G team want to give themselves more time to work out new succession arrangements, Mr Lee said he had therefore agreed to stay on \"until such time as the new 4G leader is chosen and ready to take over\".\nHe added that while the Government's immediate focus is on the health and economic crisis, succession remains an urgent task and cannot be put off indefinitely.\n\"I think (the 4G team will) take longer than a few months, but I hope that they will reach a consensus and identify a new leader before the next general elections. I have no intention of staying on longer than necessary.\"\nMr Lee previously said that he hopes to step down before his 70th birthday, which would be in February 2022.\nBut after the pandemic hit, he pledged to see Singapore through the Covid-19 crisis before handing over the reins of the country to the next generation of leaders.\n\"You have my word: Together with my older colleagues like Teo Chee Hean and Tharman Shanmugaratnam, as well as our younger fourth-generation (4G) ministers, I will see this through. I am determined to hand over Singapore intact and in good working order to the next team,\" he said in an online rally in July 2020.\nOn Thursday, he stressed that choosing a leader is not just about ranking people and saying who is going to be the best choice.\n\"It's really about team-building and developing the team, and developing the relationships amongst the team members - so that over time, from that balance and that chemistry, you're able to identify who amongst the people can most maximise the performance of the team, make all the pieces fit together, and end up with more than the sum of its parts.\"\nHe called the next general election a reasonable timeframe to work towards, and this timeframe was also the reason why the team decided to come out with this issue now rather than wait until a new leader is identified - \"because the neatest thing to do would be one person steps aside while another person immediately steps into place, and it's seamless\".\nHe added: \"And if it was something which you could do within a few days or weeks, or even a couple of months, I think it's something which we would have seriously considered - in that case let's finish a process, line up everything neatly and go then go out with one announcement.\n\"But if we are talking about a process which is likely to take a few years, then once the first development has taken place - that you know that the minister is stepping aside - I think that is important material information which is our responsibility to tell our stakeholders. They have to know, the ministers have to know, the public has to know.\n\"And amongst the ministers, amongst the team, knowing this, you will have to re-shape and reconfigure the relationships and responsibilities in order that a new balance will be struck, and a new person can emerge and not be frozen into an old position which is no longer reflective of what is actually going to happen.\"\nThe public also has to know what the real status is, he said, in order to know what progress is being made and where they stand.\nThis is akin to a listed company, he added, which would have clear obligations to make such information public within a quick time, which is what the Government has done.", "url": "https://www.straitstimes.com/singapore/politics/pm-lee-to-stay-on-as-prime-minister-until-new-4g-leader-is-chosen-and-ready-to"}