{"authors": ["Toh Ting Wei"], "date_download": "2024-10-12 13:47:08", "date_modify": "2024-10-12 13:47:08", "date_publish": "2020-02-02 18:19:36", "description": "All new visitors who have been in mainland China within the past 14 days will be barred from entering or transiting in Singapore. Read more at straitstimes.com.", "filename": "singapore_health_wuhan-virus-15-people-refused-entry-into-singapore-following-new-travel_1728740828.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/02/02/kcairport0202.jpg?VersionId=awXpocdtggXyfAauGcD8haV9UP.gEzMd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_wuhan-virus-15-people-refused-entry-into-singapore-following-new-travel_1728740828.html", "title": "Wuhan virus: 15 people refused entry into Singapore following new travel restrictions", "title_page": "Wuhan virus: 15 people refused entry into Singapore following new travel restrictions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Fifteen travellers have been refused entry into Singapore in the thirteen hours since travel restrictions on those who with recent travel history to China kicked in late on Saturday (Feb 1).\nThe restrictions took effect at 11.59pm on Saturday, and the Immigration and Checkpoints Authority (ICA) said that 15 have been rejected as of 1pm on Sunday.\n\"They comprise one Spanish, one British, one Malaysian, two US, five PRC and five Indian passport holders, due to either their travel histories to mainland China in the last 14 days, or suspension of visa facilities,\" the ICA said.\nThe Government had announced on Friday that all travellers arriving from mainland China who had been there in the past 14 days will be barred from entering or transiting in Singapore as the nation ramps up measures to keep the Wuhan coronavirus at bay.\nThe virus, known as 2019-nCov, has infected more than 14,000 and killed more than 300 worldwide as of Sunday.\nSpeaking on the sidelines of a visit to Changi Airport to interact with customs officials and auxiliary police officers on Sunday, Minister for Home Affairs and Law K. Shanmugam said Singapore had to put in place travel restrictions due to the circumstances of the country.\nOne main reason was due to Singapore's small size and its corresponding dense population, he said.\n\"We know that the virus has spread to other parts of China, how much we don't know, so people could come, and if it comes, the spread in Singapore, with such an intense density can be quite substantial,\" said Mr Shanmugam.\n\"I am sure the Chinese government don't want it, and we don't want it. Our primary duty is to make sure Singaporeans are safe and our quarantine facilities are limited, our medical facilities can be easily stretched.\"", "url": "https://www.straitstimes.com/singapore/health/wuhan-virus-15-people-refused-entry-into-singapore-following-new-travel"}