{"authors": ["Li Xueying"], "date_download": "2024-10-12 13:48:35", "date_modify": "2024-10-12 13:48:35", "date_publish": "2023-06-04 21:17:00", "description": "China’s reluctance to come to the table for talks is due to a perception that the US has not kept its word, says the veteran diplomat. Read more at straitstimes.com.", "filename": "singapore_enough-channels-of-communication-but-insufficient-political-will-to-resolve-china-us-conflict-cui-tiankai_1728740915.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/05/2023060430362183img4876_0.jpg?VersionId=n5Tncf8h.O3FGnQYnY9SRQKErDqVd3Rw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_enough-channels-of-communication-but-insufficient-political-will-to-resolve-china-us-conflict-cui-tiankai_1728740915.html", "title": "Enough channels of communication, but insufficient political will to resolve China-US conflict: Cui Tiankai", "title_page": "Enough channels of communication, but insufficient political will to resolve China-US conflict: Cui Tiankai | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - There are concrete steps, big and small, that the United States can take to show goodwill in its call for high-level defence talks to resume with China – such as by halting military deployments to the latter’s “doorstep”, said retired veteran Chinese diplomat Cui Tiankai.\nHe added that China’s reluctance to come to the table for talks, including at the just-concluded Shangri-La Dialogue, boils down to a perception that the Americans have been feckless in keeping their word after past meetings, including the summit between presidents Xi Jinping and Joe Biden in Bali last November.\nIn an interview on the sidelines of the security forum, Mr Cui, who was China’s longest-serving ambassador to the US from 2013 to 2021, said there are adequate channels of communication between both sides, but insufficient political will – on the US’ part – to prevent conflicts.\nHe cited America’s military deployments near China, which he said should be eased. This comes just after an American guided-missile destroyer and a Canadian frigate sailed through the Taiwan Strait, while being tracked closely by China’s navy and air force.\n“Some people are talking about our ships apparently getting too close to their ships and their plane. But the real question is, why are they coming all the way across the ocean, to our doorstep? They’re getting too close to our territories, to our territorial waters. It’s certainly a disrespect of other countries’ sovereignty and territorial integrity.”\nMr Cui also criticised the US’ tendency for unilateral actions, such as the sanctions it imposed on China’s Defence Minister Li Shangfu in 2018 in connection with Chinese purchases of Russian arms.\nChina has cited the maintenance of US sanctions on General Li as the reason he did not meet his American counterpart Lloyd Austin at the security forum, which concluded on Sunday.\nDefence Secretary Austin on Sunday dismissed this as a “false narrative” by China.\n“I’m sure that I’m personally sanctioned in Russia,” he said, before leaving Singapore for India. “But I can, if I want”, still speak with Russia’s Defence Minister, he added.\nAsked about quicker practical steps that the US can take to pave the way for talks, Mr Cui said wryly that “nothing is easy in China-US relations, I can promise you”.\nBut as an “easier” start, more direct flights between the two countries should be restored, to pave the way towards more linkages, he said.\nAmerican airlines have yet to restore the number of flights to pre-Covid-19 pandemic levels, citing the cost and time savings that Chinese carriers accrue by flying over Russian airspace on US routes, and have supported US senators’ urging of the Biden administration to stop them from doing so.\nWeekly flights by airlines on both sides are now in the low tens, down from 300-plus previously.\n“There are too few of them,” said Mr Cui. “Of course, Covid-19 was a problem. But now it’s almost over. We have other obstacles. And the tickets are very expensive. But so many people want to travel. So, at least, we could have more flights. It is for mutual benefit, and I think this should be easier to do.”", "url": "https://www.straitstimes.com/singapore/enough-channels-of-communication-but-insufficient-political-will-to-resolve-china-us-conflict-cui-tiankai"}