{"authors": ["Leow Wen Xuan"], "date_download": "2024-10-12 14:20:42", "date_modify": "2024-10-12 14:20:42", "date_publish": "2024-04-24 05:00:00", "description": "Food exports have grown at a rate of more than 11 per cent each year since 2020. Read more at straitstimes.com.", "filename": "singapore_more-singapore-fb-businesses-expanding-overseas_1728742842.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/24/yaohui-wxfood23-1552.jpg?VersionId=iE7QytXsEgXEgsN2PMQjuhCza0Crl14g", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_more-singapore-fb-businesses-expanding-overseas_1728742842.html", "title": "More Singapore F&B businesses expanding overseas", "title_page": "More Singapore F&B businesses expanding overseas | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Plans are afoot to help more Singapore food and beverage (F&B) businesses expand overseas.\nFood exports have grown at a rate of more than 11 per cent each year since 2020, and they can be found in more than 120 markets worldwide, said Minister of State for Trade and Industry Low Yen Ling, citing figures from Singapore Economic Development Board’s Manufacturing Survey in 2023.\nDue to Singapore’s unique food culture and extensive free trade agreement (FTA) network, F&B companies are able to leapfrog into international markets, Ms Low said at the international food and beverage trade show FHA-Food & Beverage at the Singapore Expo on April 23.\nFor example, Singapore signed an FTA in 2023 with four South American nations – Argentina, Brazil, Paraguay and Uruguay – which helped local firms gain preferential access to their markets.\nThe Mercosur-Singapore FTA also aims to facilitate greater trade flows through lowered tariffs, allowing F&B exporters to pay less to enter these markets.\n“Under our Trade 2030 strategy, we will continue to broaden the geographical coverage of our trade agreements to enable food trade to flow seamlessly to and from Singapore,” Ms Low said.\nThe trade show, which is organised by Informa Markets, is being held from April 23 to 26.\nAt the trade show, food manufacturing companies can exhibit their products to an expected 60,000 local and international visitors, accessing a wide range of international buyers such as supermarkets, distributors and even restaurants or hotels interested in importing their products.\nIt is a stage to “connect buyers and sellers, start-ups and investors”, said Informa Markets’ event director of hospitality, food and beverage for Singapore, Ms Janice Lee.\nShe added that the show has attracted more than 1,600 exhibitors from over 52 countries.\nAltimate Nutrition is a Singapore-based start-up making food products from insects such as crickets, which require less water and space to farm compared with cattle.\nIt is planning to expand into Britain and offer its products, which include cricket protein powder and protein bars, to gyms and health stores, said Mr Hiew Yuen Sheng, director of Altimate Nutrition.\nHe added that it is easier to enter the market in Britain as the culture of eating insects is “building up” in European countries, while there is more resistance to eating them in Singapore due to a lack of such businesses and lack of a culture of eating such alternative protein.\nAt the show, Mr Hiew hopes to connect with food manufacturers such as bakeries and noodle makers who want to incorporate cricket powder into their bread and noodles to increase protein content.\nHe added that Origin Bar, a bar located at the Shangri-La hotel, has reached out to the firm to include crickets in their cocktails as garnishes, but it is awaiting Singapore Food Agency’s approval to manufacture and distribute its products in Singapore.", "url": "https://www.straitstimes.com/singapore/more-singapore-fb-businesses-expanding-overseas"}