{"authors": ["Salma Khalik"], "date_download": "2024-10-12 13:58:33", "date_modify": "2024-10-12 13:58:33", "date_publish": "2022-10-20 13:19:11", "description": "At times, ambulances arriving are unable to discharge patients due to a lack of space, doctors said. Read more at straitstimes.com.", "filename": "singapore_bed-crunch-at-singapore-hospitals-some-patients-are-stuck-in-emergency-departments_1728741513.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/21/acemergency201022.jpg?VersionId=AoZBa8uPORSGdjkm3lGiCEMZDE5eJFG1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_bed-crunch-at-singapore-hospitals-some-patients-are-stuck-in-emergency-departments_1728741513.html", "title": "Bed crunch at Singapore hospitals: Some patients are stuck in emergency departments", "title_page": "Bed crunch at Singapore hospitals: Some patients are stuck in emergency departments | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The bed crunch in public hospitals is so severe that it has spilled over to their emergency departments, many of which stay packed with patients because there is no room to move them elsewhere.\nEmergency department (ED) doctors say there are days when the situation is so bad that an ambulance arriving is unable to discharge the patient for lack of space. Instead, the medical team has to assess the patients while they are on the ambulance trolley.\nThose who are in critical condition are treated immediately. Others might have to wait 15 to 30 minutes for space to be found so that they can be offloaded and the ambulance can leave.\nThis also holds up the ambulance, which might be urgently needed by another critically ill patient.\nThe Singapore Civil Defence Force, which runs the emergency ambulance service, said there has been a 32 per cent increase in calls in the first half of 2022 over the previous year, of which 93 per cent were real emergencies.\nThe Ministry of Health (MOH) says hospitals will mitigate the situation during peak congestion periods through measures such as adding more beds to wards and creating holding spaces in EDs. At least one hospital has converted a consultation room to hold such patients in recliner chairs when it is short of beds.\nThe Straits Times spoke to several ED doctors and nurses, who asked that they and their hospitals not be identified. They say the problem has been around for years, but has become worse this year, partly on account of the surge in Covid-19 cases.\nThey say they are no longer surprised that a patient they had admitted was still around when they return to hospital for their next shift. On some occasions, the patient might still be in the ED for up to four days after being admitted.\n“Patients remaining in the ED for days on end is now the norm,” said an emergency medicine specialist.\nAnother said: “I am no longer as surprised as before but, yes, still surprised when I see the same patient and next of kin a few days later in the ED.”\nMr Anthony Pragasam, 91, was one such patient. He was taken to a public hospital ED at 3pm on Sept 20, and was officially warded at 8pm. But he remained in the ED for two days before he was sent to a ward at 6pm on Sept 22.\nAs he was in the ED, no visitors were allowed. Said his son: “I am quite certain he did not get a shower, but there is just no way to know, as we were not allowed inside.\n“There needs to be a rethink about holding patients in the ED without easy access to family members, especially elderly ones like my dad who have dementia, are unable to communicate clearly and cannot ask for what they need. And to keep family members away from the patient for two days without any of us to see how he is doing, I think that cannot be allowed to happen.”\nAccording to MOH’s published data, for the last two weeks of September, the median wait time for a bed at Ng Teng Fong General Hospital on six of the 14 days was 22 hours, 22.3 hours, 22.7 hours 23.1 hours and 23.7 hours and 24.2 hours. Weekends were generally less crowded and the shortest wait time was 7.6 hours on a Saturday.\nIn August, the longest median wait time for this hospital was 25.4 hours.\nNo data for this month is available yet, but with the current Covid-19 wave, numbers are likely to remain high.\nEDs are not meant to have patients in there for long – only for urgent treatment after which they are either discharged or sent to a ward. Hence, it does not have shower facilities, or even sufficient patient toilets.\nAt Changi General Hospital, some less sick or frail patients sometimes have to wait in recliner chairs when there are no more beds available. Due to lack of space, beds are sometimes so close to each other that just by stretching out a hand, a patient can touch another in the next bed.\nA nurse said that to administer drugs or to take blood pressure, she needs to pull the bed out as there is not enough space between beds for her to squeeze into.\nShe added that it is especially difficult when managing bed-bound patients who require regular nursing care, such as having to be turned frequently on the bed, tube-fed and get their diapers changed.\nBoth doctors and nurses admit to being frustrated.\nSaid a doctor: “There is no privacy. Patients cannot rest properly as the ED is a very busy, noisy place. It is challenging to find patients and to get to the patients to examine them or speak to them with the appropriate dignity and privacy.”\nAn emergency medicine specialist said patients still receive good care, but having too many patients can affect the quality of care given.\nShe said: “ED nurses are assigned to take care of these patients as long as they are physically in the ED. This means fewer ED nurses for other areas of acute care in the ED, which in turn impact our work as doctors in those acute care areas.”\nAnother doctor, whose hospital has converted a consultation room to hold ED patients on recliner chairs, said: “I just had a shift where every nook and corner was stuffed with chairs and trolleys with patients.”\nOne hospital that appears to be managing patients in its ED fairly well is Tan Tock Seng Hospital – in spite of having one of the largest ED intakes and one of the highest bed occupancy rates here.\nOver the last fortnight in September, it had median wait times of five to 12.4 hours in spite of having the highest ED intake of 5,290 patients and its ward occupancy rate hit a high of 101.8 per cent.\nSome years ago, it put in a rule that patients must be moved out of the ED within a certain period, or if the number of patients there crosses a pre-determined number. Patients will be upgraded to higher-class wards and, if necessary, all wards will need to take in extra patients.\nAnd when push comes to shove, it will cancel non-urgent surgery scheduled for the next day – a move that is extremely unpopular with both its doctors and patients – but deemed necessary to cope with the surge of patients.", "url": "https://www.straitstimes.com/singapore/bed-crunch-at-singapore-hospitals-some-patients-are-stuck-in-emergency-departments"}