{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:56:48", "date_modify": "2024-10-12 13:56:48", "date_publish": "2023-08-18 21:10:00", "description": "Tarchandi Tan pleaded guilty to harassment while serving her jail sentence over her earlier conviction. Read more at straitstimes.com.", "filename": "singapore_courts-crime_additional-5-weeks-jail-for-sovereign-woman-who-hurled-insults-at-judge-during-trial_1728741408.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/18/svtan180823.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_additional-5-weeks-jail-for-sovereign-woman-who-hurled-insults-at-judge-during-trial_1728741408.html", "title": "Additional 5 weeks’ jail for ‘sovereign’ woman who hurled insults at judge during trial", "title_page": "Additional 5 weeks’ jail for ‘sovereign’ woman who hurled insults at judge during trial | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A woman who caused a ruckus during a trial in a district court in 2021, and spat at police officers who arrested her a year later, was on Friday given five weeks’ jail for insulting a judge.\nThis is in addition to an eight-week jail sentence meted out on July 25, over the spitting incident and repeatedly failing to obey orders from the authorities even though she was legally bound to do so.\nTarchandi Tan, 53, who is now serving her earlier sentence, appeared in court via video-link on Friday and pleaded guilty to a harassment charge involving District Judge Eddy Tham.\nOne charge under the Miscellaneous Offences (Public Order and Nuisance) Act was considered during sentencing.\nDeputy Public Prosecutor Hidayat Amir told the court that Tan subscribes to a theory that she is a “sovereign” individual over whom the government, including that of Singapore, has no inherent power without her consent.\nThe Singaporean woman, who used to be known as Lee Hui Yin, had attended the 2021 trial of Briton Benjamin Glynn, who had been caught not wearing a mask in public amid the Covid-19 pandemic.\nTan was acquainted with Glynn as a fellow member of a community that shared similar views on being a “sovereign” individual.\nShe was seated in the gallery with at least 18 other people in the midst of his trial when a security officer told her to put her mask on properly, as it was slightly below her nose.\nShe became irate and exclaimed: “This is ridiculous kangaroo court... The kangaroo court requires me to wear a mask... I do not respect the judge.”\nShe also shouted at the security officer and refused to leave the courtroom, but was escorted out around 10 minutes later.\nAs part of subsequent police investigations into this incident, Tan was ordered to turn up for an interview at Central Police Divisional Headquarters on Aug 10, 2022.\nHowever, she did not do so and was also a no-show at the State Courts the following month.\nA group of police officers went to her Bukit Batok home after a warrant of arrest was issued against her on Nov 10, 2022.\nTan was in a police car when she spat at two of the officers’ faces.\nBesides receiving an eight-week jail sentence in July 2023 for these offences, Tan was ordered to pay a fine of $4,200, failing which she will have to spend an additional 21 days behind bars.\nOn Friday, DPP Hidayat said that a doctor from the Institute of Mental Health found that Tan has residual symptoms of schizophrenia.\nThe doctor also stated in his report that her sovereign ideas are not part of a delusion.\nOn Friday, the DPP asked for her to be given between six and eight weeks’ jail, saying: “It is egregious that the victim in question is a district judge... Judicial officers are unique in their roles in going beyond merely enforcing the law to being guardians of the rule of law and arbiters of justice.\n“It follows that they reasonably do and ought to command the highest levels of respect from the ordinary members of public, let alone those physically present in court proceedings.”\nTan, who was not represented by a lawyer, said she had apologised to the judge.\nShe added: “I have a right to free speech... There was no injury... My intention was not to cause hurt... There was no contract for me to wear a mask, or vaccinate, or keep quiet in court.”\nTan also said that she believed that she was standing up for the people.\nSeparately, Glynn, then 40, was jailed for six weeks in 2021. He was later deported and barred from re-entering Singapore.", "url": "https://www.straitstimes.com/singapore/courts-crime/additional-5-weeks-jail-for-sovereign-woman-who-hurled-insults-at-judge-during-trial"}