{"authors": ["Tay Hong Yi"], "date_download": "2024-10-12 13:47:19", "date_modify": "2024-10-12 13:47:19", "date_publish": "2024-09-04 19:55:37", "description": "Over 1,800 vacancies from close to 30 employers are available across two fairs. Read more at straitstimes.com.", "filename": "singapore_jobs_job-fairs-for-staff-affected-by-singapore-turf-club-closure_1728740839.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/NSL6937.jpg?VersionId=w60VY.UO6mWG1M6emEcYNnsyReA04jhZ&h=4d4eb91b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_jobs_job-fairs-for-staff-affected-by-singapore-turf-club-closure_1728740839.html", "title": "Job fairs offer opportunities for staff affected by Singapore Turf Club closure", "title_page": "Job fairs offer opportunities for staff affected by Singapore Turf Club closure | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – It’s been quite a ride for Singapore Turf Club (STC) employee Mohammad Rezuan Husin but the impending end of horse racing here means he must take the reins on a whole new career.\nMr Rezuan, 42, whose grandfather and father also worked with horses, has been employed at the club several times, chalking up more than 10 years in all at the track.\nHis present role, which he has held for two years, is right at the sharp end, ensuring that the horses are situated properly behind barriers that are lifted when the race begins.\nIt will be a wrench to leave when STC finally closes. He said: “I’d always wanted to do this (work with horses) from when I was young. Watching the races, I felt that it was a job I wanted to do.”\nWhatever work comes next will be a new beginning, as Mr Rezuan is one of 350 STC staff to be let go in multiple phases, ahead of the club’s impending closure that will mark the end of horse racing in Singapore.\nMr Rezuan spoke to The Straits Times at a job fair held on Sept 4 for affected staff. Around 1,800 vacancies from 30 or so employers are available across this and another fair to be held on Sept 18.\nBoth fairs are also open to employees of horse trainers, as they are affected by the end of racing as well.\nOther forms of assistance for STC staff were announced in 2023 and include counselling, job placement assistance, personal career guidance and skills training courses.\nDFI Retail Group, Singapore Pools and government shared services provider Vital were among the employers present on Sept 4.\nAround 300 training programmes have been identified for the 90 employees to be let go in the first phase of the job cuts between end-November 2024 and April 2025.\nSTC said 95 per cent of those in the first phase have registered for at least one training programme.\nIt added that it sets aside a training budget amounting to 5 per cent of annual payroll for each employee, above the industry benchmark of 0.8 per cent.\nSTC employees have already clocked up 3,544 training hours, or about 42 hours per employee, it noted.", "url": "https://www.straitstimes.com/singapore/jobs/job-fairs-for-staff-affected-by-singapore-turf-club-closure"}