{"authors": ["Theresa Tan"], "date_download": "2024-10-12 14:00:01", "date_modify": "2024-10-12 14:00:01", "date_publish": "2024-05-16 17:30:00", "description": "Her remarks came as Singapore’s resident total fertility rate fell below 1 for the first time in its history. Read more at straitstimes.com.", "filename": "singapore_falling-fertility-and-ageing-population-place-greater-pressure-on-working-adults-to-support-seniors_1728741601.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/16/2024051612805053e815770c-f556-4b7f-aee1-5c72fd840dcd.jpg?VersionId=vYNyHYo.164kIfqVDO_s_FqQEmeXTtJw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_falling-fertility-and-ageing-population-place-greater-pressure-on-working-adults-to-support-seniors_1728741601.html", "title": "Tech advances can help address needs of ageing population, says Indranee", "title_page": "Tech advances can help address needs of ageing population, says Indranee | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - While Singapore has to grapple with the twin demographic challenges of a falling fertility rate and a rapidly ageing population, there are opportunities to be reaped as well.\nThe Republic can tap technological developments to address the needs of its rapidly ageing population, and longer lives allow seniors – with all their knowledge and expertise – to remain in the workforce longer, said Minister in the Prime Minister’s Office Indranee Rajah.\nShe said at a Population Association of Singapore conference on May 16 that low fertility rates, coupled with longer life expectancies, mean that Singapore has an ageing population without a young base to support it.\n“Our resources will be increasingly stretched, given fewer working-age persons. Working adults will face increasing caregiving pressures... and may find this harder to balance alongside work,” she said. “Rising singlehood means more will eventually grapple with weaker familial networks as they age.”\nThe two-day conference, which ends on May 17, is organised by the National University of Singapore (NUS) Centre for Family and Population Research and the Population Association of Singapore.\nMs Indranee made these remarks in the light of Singapore’s resident total fertility rate (TFR) falling below 1 for the first time in the country’s history.\nThe TFR, which refers to the average number of babies each woman would have during her reproductive years, was 0.97 in 2023.\nThe resident old-age support ratio, which indicates the number of working adults supporting the elderly, is also expected to fall. There are 3.7 residents aged between 20 and 64 supporting each senior aged 65 and older now, and this number is expected to fall to 2.7 in 2030.\nTo tackle these demographic challenges, which will see about one in four citizens aged 65 and older by 2030, the Government will raise the retirement and re-employment age.\nIn 2026, the retirement age will be raised from 63 to 64, while the re-employment age will rise from 68 to 69 to support Singaporeans who want to work for a longer period of time.\nOn April 15, the Government launched the Tripartite Guidelines on Flexible Work Arrangement Requests, where companies have to establish a process for considering and responding to requests from their staff for flexible work arrangements.\nThis will help groups such as working parents and seniors who need more flexible work arrangements juggle family and work commitments, Ms Indranee said.\nWith more seniors living alone and care needs increasing, technology advances can also help in the care of the elderly. For example, machine learning and artificial intelligence can better monitor and interpret data from devices seniors wear.\nSpeaking to researchers and representatives from government and other sectors, Ms Indranee said academics can support the Government’s drive for evidence-based policymaking through their research on Singapore’s population challenges.\nFor example, about half of new fathers do not use their paternity leave entitlements, and researchers could study this issue to tackle the barriers fathers face in doing so.\nShe said: “We understand these are often due to barriers faced at the workplace, from concerns that their absence from work could affect their appraisals, to rather dated perspectives of gender norms among colleagues and supervisors.”\nAnother area the Government is keen to address is work-life balance, which has become increasingly important, she said.\nThis comes as the 2021 Marriage and Parenthood Survey, conducted by the National Population and Talent Division, found that a key concern affecting decisions on starting a family is the difficulty of juggling work and family commitments.\nDuring the conference, a longitudinal study on work-from-home arrangements, or tele-working, and its impact on the well-being of married women was presented. The study was done given the popularity of such remote work arrangements during the Covid-19 pandemic.\nThe study, which tracked 358 working women in their 20s and 30s for four years, found that tele-working led to fewer work hours, significantly better work-life balance and higher life satisfaction.\nWomen who worked only or mostly from home worked about an hour less a day, compared with their peers who spent at least half their time in the office, said Dr Jeremy Lim-Soh, a research fellow at the Centre for Ageing Research and Education at the Duke-NUS Medical School.\nDr Tan Poh Lin, a senior research fellow at the Institute of Policy Studies, is the principal investigator of the study, and Dr Lim-Soh and Australian National University PhD student Jolene Tan are also authors of the study.\nOn the flip side, however, tele-working arrangements worsened workplace relationships.\nDr Lim-Soh said: “Past research showed that being physically close to your colleagues helps to facilitate good relationships with them in general.”", "url": "https://www.straitstimes.com/singapore/falling-fertility-and-ageing-population-place-greater-pressure-on-working-adults-to-support-seniors"}