{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:36:18", "date_modify": "2024-10-12 13:36:18", "date_publish": "2024-06-27 15:20:00", "description": "She is also accused of making video calls to her boyfriend while committing the alleged offences. Read more at straitstimes.com.", "filename": "singapore_courts-crime_woman-charged-after-she-allegedly-performed-sex-acts-on-disabled-man-without-consent_1728740178.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/27/courts-and-crime_0.jpg?VersionId=ulUYzhVUAIbN.Cq1mpsB1Yqdr_Psiwz5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_woman-charged-after-she-allegedly-performed-sex-acts-on-disabled-man-without-consent_1728740178.html", "title": "Woman charged after she allegedly performed sex acts on disabled man without consent", "title_page": "Woman charged after she allegedly performed sex acts on disabled man without consent | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A woman appeared in a district court on June 27, accused of repeatedly performing sexual acts on an intellectually disabled man without his consent in 2022.\nShe is also accused of making video calls to her boyfriend while committing the alleged offences.\nCourt documents did not disclose how the Indonesian woman was linked to the alleged victim.\nThe woman, who was handed three sexual penetration charges, is also accused of two counts of voyeurism.\nThere is a gag order on the man’s identity and the woman is not named as doing so could lead to the identification of the man.\nThe woman was in a Bukit Panjang flat with the intellectually disabled man some time between January and February in 2022 when she allegedly performed oral sex on him without his consent. Around the time, she is also said to have allowed her boyfriend to observe her performing the alleged act through a video call with him on her mobile phone.\nThe woman is accused of committing similar offences involving the alleged victim until August 2022. She is expected to plead guilty on Aug 7.", "url": "https://www.straitstimes.com/singapore/courts-crime/woman-charged-after-she-allegedly-performed-sex-acts-on-disabled-man-without-consent"}