{"authors": ["Joanna Seow"], "date_download": "2024-10-12 13:53:29", "date_modify": "2024-10-12 13:53:29", "date_publish": "2024-01-10 23:12:38", "description": "The proportion of individuals who went for some form of training rose to about 50% in 2022, up from 35% in 2015. Read more at straitstimes.com.", "filename": "singapore_politics_only-small-minority-of-s-poreans-have-used-up-skillsfuture-credit-even-as-more-attend-training_1728741209.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/10/2023080665871251dar7431.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_only-small-minority-of-s-poreans-have-used-up-skillsfuture-credit-even-as-more-attend-training_1728741209.html", "title": "Only ‘small minority’ of S’poreans have used up SkillsFuture credit, even as more attend training", "title_page": "Only ‘small minority’ of S’poreans have used up SkillsFuture credit, even as more attend training | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Few Singaporeans have used up their SkillsFuture Credit but this group can still benefit from government subsidies on course fees, said Minister of State for Education and Manpower Gan Siow Huang on Jan 10.\nMs Gan told Parliament that use of the Credit was higher among younger age groups, with close to 40 per cent of those in their 30s having spent any of it, compared with around 25 per cent of those over 60.\nAround 192,000 Singaporeans used their SkillsFuture Credit in 2022, up on the 156,000 in 2019, before the pandemic.\nMs Gan noted that the proportion of people who went for some form of training, including employer-sponsored training, rose to about 50 per cent in 2022 compared with 35 per cent in 2015, when the SkillsFuture initiative was launched to encourage lifelong learning.\nAll Singaporeans aged 25 or over received a starting $500 in credits in January 2016. A $500 top-up was given in 2020 to Singaporeans aged 25 and above, with an additional $500 specifically to those 40 to 60.\nMature mid-career Singaporeans could receive a “substantial top-up” of SkillsFuture Credit. Ms Gan said more details will be announced later in 2024.\nMs Gan said some Singaporeans have not used their credits due a lack of time as well as the opportunity cost of going for upskilling courses.\nSkillsFuture Singapore (SSG) has improved the mySkillsFuture portal to make it easier for users to find courses that are eligible for SkillsFuture Credit. The claims submission process has also been simplified in response to user feedback.\nSSG works closely with industry partners and regularly analyses data on job vacancies and skills in demand in order to keep the courses relevant to the needs of businesses.", "url": "https://www.straitstimes.com/singapore/politics/only-small-minority-of-s-poreans-have-used-up-skillsfuture-credit-even-as-more-attend-training"}