{"authors": [], "date_download": "2024-10-12 14:20:49", "date_modify": "2024-10-12 14:20:49", "date_publish": "2024-05-02 10:20:16", "description": "Five existing members have also been reappointed to the MAS board. Read more at straitstimes.com.", "filename": "singapore_chee-hong-tat-appointed-to-mas-board_1728742849.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/02/2023053035900580ec55fe59-a978-4d94-bba5-5bba792cd371.jpg?VersionId=_EMK45c1mQw6kNQtGzN8EDRyGhEWuMHN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_chee-hong-tat-appointed-to-mas-board_1728742849.html", "title": "Chee Hong Tat appointed to MAS board", "title_page": "Chee Hong Tat appointed to MAS board | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Transport Minister Chee Hong Tat has been appointed to the Monetary Authority of Singapore (MAS) board of directors for a three-year term starting on June 1, said the central bank in a statement on May 2.\nAlong with the appointment of Mr Chee – who is also Second Minister for Finance – five existing members have been reappointed to the MAS board for a three-year term.\nThey include Deputy Prime Minister and Coordinating Minister for Economic Policies Heng Swee Keat, and Mr Alvin Tan, who is Minister of State for Trade and Industry as well as Culture, Community and Youth.\nProfessor Tan Chorh Chuan, former president of the National University of Singapore, will step down from the board when his term ends on May 31.\nDeputy Prime Minister and Finance Minister Lawrence Wong, who is MAS board chairman, said: “We deeply appreciate Prof Tan’s contributions to the MAS board over the past 12 years.\n“He provided useful inputs that contributed to more robust decisions that enabled MAS to build stronger organisational capabilities in technology and risk management.”\nThe members of the MAS board from June 1 are:\nMr Lawrence Wong, Deputy Prime Minister and Minister for Finance\nMr Gan Kim Yong, Minister for Trade and Industry\nMr Heng Swee Keat, Deputy Prime Minister and Coordinating Minister for Economic Policies\nMr Chee Hong Tat, Minister for Transport and Second Minister for Finance\nMr Alvin Tan, Minister of State for Trade and Industry and for Culture, Community and Youth\nMr Peter Ong, former head of civil service\nMr Chaly Mah, chairman of NetLink NBN Management\nMr Lim Hng Kiang, special adviser, Ministry of Trade and Industry\nMr Lucien Wong, Attorney-General, Attorney-General’s Chambers\nMrs Deborah Ong, retired partner of PricewaterhouseCoopers\nMr Ng Wai King, managing partner, WongPartnership\nMr Chia Der Jiun, managing director of MAS", "url": "https://www.straitstimes.com/singapore/chee-hong-tat-appointed-to-mas-board"}