{"authors": ["Zaihan Mohamed Yusof"], "date_download": "2024-10-12 13:31:10", "date_modify": "2024-10-12 13:31:10", "date_publish": "2023-03-06 05:00:00", "description": "By adding to or modifying a vehicle’s structure, the safety of a driver or pedestrian may be compromised. Read more at straitstimes.com.", "filename": "singapore_2300-summonses-issued-annually-for-commercial-vehicle-modifications-from-2020-to-2022_1728739870.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/06/A52Y4849_0.JPG?VersionId=tg3ROtO_wW085uw6HgIvRWNxEisuvAAB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_2300-summonses-issued-annually-for-commercial-vehicle-modifications-from-2020-to-2022_1728739870.html", "title": "2,300 summonses issued annually for commercial vehicle modifications from 2020 to 2022", "title_page": "2,300 summonses issued annually for commercial vehicle modifications from 2020 to 2022 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The prime mover driver intended to give his heavy vehicle a new look but ran into a roadblock. In January, the Land Transport Authority (LTA) issued him a $240 fine for having tinted windows and installing a spotlight.\nThis case was cited by Mr Teddy Tora, founder of Abam2 Trailer Sg, which has 200 heavy vehicle driver members in Singapore, Malaysia and Indonesia. He noted that the Republic has a group of truck, van and prime mover drivers who try to express their creativity and identity via modifications.\nIt is illegal in Singapore to alter the way a heavy vehicle looks or performs. Figures from the LTA show around 2,300 summonses annually were issued for illegal modifications of commercial vehicles, both light and heavy goods types, from 2020 to 2022.\nThe most common breaches were linked to exhaust systems modified in a bid to improve engine performance, windows that were over-tinted and lighting that could prove distracting to other motorists, LTA told The Straits Times.\nWhile Mr Tora, 35, noted that modifications are frowned upon, “some in Singapore still follow European and Japanese truck designs”.\nIn Japan, the art of modifying a truck’s look is called “dekotora”, or decoration in English. Some of the trucks there have chrome bodywork, fancy neon lights and their clubs’ insignia above the windshield or at the side of doors.\nInside the cabin, seats are adorned with leather trimmings, and mini-chandeliers are used to add some classic style.\nMr Tora hopes truckers here would be allowed some leeway to create their own unique Singapore style. Abam2 Trailer Sg was featured in a short video in HBO Asia’s original series Invisible Stories in 2020 that showcased its activities and charity work.\nAdded Mr Tora: “I recently found out that I can be penalised for being a road distraction if my vehicle is pasted with too many stickers. Aren’t motorists supposed to be focusing on the road and not on other vehicles?”\nModified heavy vehicles were spotted two weeks ago by The Straits Times at driver hangouts in Woodlands and Changi, or at designated heavy vehicle parking areas.\nWhile some decorated their vehicles with stickers, others installed chrome parts that extend beyond the vehicles’ cabin. At a large carpark in Marsiling, four heavy vehicles were seen with metal horns on their roofs and licence plates with protruding frames.\nThe drivers of such vehicles are known to remove the offending parts before vehicle inspections.\nSuch flashy vehicles also made the headlines in April 2022 when a convoy of more than 30 heavy vehicles, vans and tipper trucks caused a stir in Geylang Road.\nThey were decked with bright designs, neon lights, sound systems and chrome bodywork. Some had horns that mimicked tunes from the movie The Godfather and Mexican folk song La Cucaracha (The Cockroach).\nThe police said then that they were investigating the organisers for “conducting an event on the road without a permit”.\nSingapore Road Safety Council chairman Bernard Tay said any illegal modification to a heavy vehicle is “a no go”.\n“This is serious. Today’s vehicles are manufactured in such a way that (their safety designs) are also meant for road users... The front of vehicles is designed to prevent serious injury when a driver knocks into a pedestrian in an accident,” he added.\nBy adding to or modifying a vehicle’s structure, the safety of a driver or pedestrian may be compromised, said Mr Tay.\nIn November 2021, ST reported that the number of road accidents involving heavy vehicles had shown a downward trend since 2018. There were 776 accidents in 2018, 690 in 2019 and 426 in 2020. In the first half of 2021, there were 268.\nApart from regular inspections, LTA said it conducts frequent enforcement operations to detect and deter illegal modifications.\nVehicles that do not meet standards have to undergo rectifications and reinspections.\nAn LTA spokesman said: “Owners of vehicles who fail to pass the inspections will not be allowed to renew their road tax and use their vehicles on our roads.\n“Since July 2021, LTA has also increased the composition sum for first-time offenders who conduct illegal exhaust modifications which have the highest safety risks, from $500 to $1,000.”\nThose involved in more serious cases can be taken to court, even if they are first-time offenders.", "url": "https://www.straitstimes.com/singapore/2300-summonses-issued-annually-for-commercial-vehicle-modifications-from-2020-to-2022"}