{"authors": ["Ang Qing"], "date_download": "2024-10-12 14:16:47", "date_modify": "2024-10-12 14:16:47", "date_publish": "2024-02-29 23:48:22", "description": "At least 15 complaints have been made against the event's organiser, said Case. Read more at straitstimes.com.", "filename": "singapore_i-feel-blindsided-no-refunds-for-sentosa-sky-lantern-festival-as-questions-arise-over-rescheduled-event_1728742607.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/29/jq0A1A1231.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_i-feel-blindsided-no-refunds-for-sentosa-sky-lantern-festival-as-questions-arise-over-rescheduled-event_1728742607.html", "title": "‘I feel blindsided’: No refunds for Sentosa sky lantern festival amid questions over its rescheduling", "title_page": "‘I feel blindsided’: No refunds for Sentosa sky lantern festival amid questions over its rescheduling | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – At least 15 complaints have been made against the Singapore Sky Lantern Festival’s organiser after it refused to refund attendees for the lift-off that never happened.\nThis comes after hundreds of ticket holders made their way to Sentosa for the festival on Feb 21, only to learn upon arrival that there was no food, nor lanterns taking off that night – both of which had been promised.\nDays later, a representative of event organiser Asian Couture and Boutique said on Facebook that unhappy attendees can either resell their tickets, which cost about $50 each, or attend a rescheduled release on another day.\nMs Shiermie Bautista, who founded the firm, said in a Facebook post on Feb 27 that ticket holders can attend the rescheduled event around the first week of April.\nShe added: “For those who can’t attend the next event, you can resell your tickets at (ticketing platform) TicketSwap.”\nHowever, Asian Couture and Boutique’s director Steven Lau said on Feb 29 that a final decision on the event organiser’s next steps has yet to be made, and the firm is still collecting feedback from its customers.\nThere are also question marks over the rescheduled event, with the authorities telling The Straits Times the same day that there has been no information on its date or venue.\nA Singapore Civil Defence Force (SCDF) spokesperson said it is still following up with the organiser on the details and the implementation of the fire safety guidelines, and has yet to give any clearance for the rescheduled event.\nPreviously, SCDF had not allowed the organiser to release sky lanterns, after a site inspection on the day of the festival showed that fire safety guidelines had not been adhered to.\nThe spokesperson said: “They did not provide proper tethers for the sky lanterns, nor fire extinguishers, or safety marshals.\n“Therefore, in the interest of public and aviation safety, SCDF informed the event organiser that they should not use the sky lanterns for the event.\nThe Civil Aviation Authority of Singapore’s director for airspace policy Jean Yee said the authority was aware of the intent to reschedule the event, but as at Feb 28, no details on the date, venue and how the event will be executed have been shared.\nMr Tan had forked out more than $100 for two tickets, hoping the event would be a key part of a Valentine’s Day surprise for his girlfriend, who is a fan of the iconic scene from the Disney film Tangled, where the protagonists share a romantic moment while watching lanterns float up into the sky.\nBut all attendees got that night were grounded lanterns lit by LED lights, as the organiser was not permitted to fly lanterns with open flames.\nAdded Mr Tan: “I feel blindsided. I thought the event would be reliable because it was publicised on multiple news sites, and it was hosted on Sentosa.”\nChecks by ST found that Ms Bautista’s phone number is linked to a cancelled sky lantern festival in Dubai that was meant to take place in 2023. The event, which appeared to have been postponed due to last-minute issues, had also hawked tickets for about $50 each.", "url": "https://www.straitstimes.com/singapore/i-feel-blindsided-no-refunds-for-sentosa-sky-lantern-festival-as-questions-arise-over-rescheduled-event"}