{"authors": [], "date_download": "2024-10-12 13:55:15", "date_modify": "2024-10-12 13:55:15", "date_publish": "2023-05-07 11:58:00", "description": "The first-ever vet clinic to treat pet skin problems and allergic conditions with a laser opened in Seoul in April. Read more at straitstimes.com.", "filename": "singapore_laser-skin-treatments-full-course-meals-luxury-life-of-pets-in-korea_1728741315.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/07/hzdogs070523_4.jpg?VersionId=TYJ2rwtUCyTTKeP5qJtK1blUxp4X95ue", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_laser-skin-treatments-full-course-meals-luxury-life-of-pets-in-korea_1728741315.html", "title": "Laser skin treatments, full-course meals: Luxury life of pets in Korea", "title_page": "Laser skin treatments, full-course meals: Luxury life of pets in Korea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - Treating oneself to a full-course meal and a laser skin treatment at a high-end dermatologist sounds like something out of the life of the super rich.\nIn South Korea, it’s a reality for some of its luckiest pets.\nLa Peau Claire, a skin clinic located in Seoul’s affluent Cheongdam-dong, provides laser treatment services for cats and dogs.\nOpened in April, it is a trailblazer in Korea’s pet dermatology industry, and the first-ever vet clinic to treat pet skin problems and allergic conditions with a laser.\nWhen receiving treatment, cats and dogs wear laser-safe goggles shaped like hearts and flowers to protect their eyes.\nOwners can either watch their pets receiving treatments or wait outside with a cup of free coffee.\nLa Peau Claire’s main treatment is called the “dual laser” treatment, which is used to alleviate allergic reactions.\nIt utilises a laser which is commonly used by dermatologists to treat human skin issues, including acne.\nIt costs 245,000 won ($247) for a package of five sessions. Additional fees may be incurred for private consultations and allergy tests.\nDemand for veterinary laser therapy has been steadily growing in the United States in recent years, according to the American Animal Hospital Association, the only accredited organisation for companion animal hospitals in the US and Canada.\n“Traditionally, dogs and cats would be prescribed with ointments and pills to treat allergic reactions on their skin or for other skin issues,” La Peau Claire CEO and veterinarian Lee Tae-hyun told The Korea Herald.\n“Laser therapy is a relatively new treatment that could replace traditional medicine, with fewer side-effects,” Lee added.\nThat was why the owner of Hero, a 2-year-old Bichon Frise with skin allergies, came to the clinic.\n“Sometimes, these ointments have steroids in them and I want Hero to receive a safer and more risk-free treatment,” said the owner, who did not want to be named.\n“I think pet owners in Korea are willing to spend more money on treatments if they help their pets heal faster.”\nOmakase, a Japanese style of dining where customers leave the selection of dishes entirely up to the chef, is all the rage in Korea. Pet lovers ask why not for dogs?\nPet Dining Mamma in Songpa-gu, eastern Seoul, offers three-course omakase-style meals for furry guests at a starting price of 23,000 won.\nDogs are seated at a table next to their owners. The three-course meal, which was prepared by the chef on the day The Korea Herald reporter visited, comprised of an entree of pumpkin or tomato soup, followed by a well-decorated dish of kangaroo, horse or cow meat, and a blueberry pudding as a dessert.\nAll the ingredients are tested safe for dogs, the chef explained.\nWhile the pets eat, their human companions can do so too. But for them, it’s a single dish meal - mostly Italian - which is generally cheaper than the dog’s full-course dinner.\nIts parent company Woof and Meow’s chief executive Lee Yuni said: “More and more people are coming to the restaurant.\n“We prepare about 40 meals for dogs per week and the number has significantly increased since we opened the restaurant in 2021. People’s perception of providing luxury goods and foods for their pets has rapidly changed in Korea.”\nHigh1 Resort, located in Gangwon province, also serves an omakase for dogs. The five-course meal costs 35,000 won and includes luxury ingredients like abalone.\nPet dermatology and omakase dining are indicative of a growing trend towards the pampering of pets in South Korea.\nThe “luxury market” for pets is expected to grow, with more Koreans interested in providing faster and better services for their animal companions, market insiders said.\nAccording to the state-affiliated Korea Rural Economic Institute, the size of the country’s pet-related industry is currently valued at 4.6 trillion won, but is projected to grow to 6 trillion won by 2027.\nA report released by the Institute for International Trade in 2022 said: “The keyword behind the global pet care market is now ‘pet-humanisation’ which means treating pets like they’re a human member of the family.\n“It has been driving the growth of pet-tech, which utilises the Internet and artificial intelligence in pet care, (as well as) innovative veterinary services that continue to evolve to provide faster diagnosis and treatment.”\nOf the country’s total population of 50 million, 14.48 million people had pets as of the end of 2020. This means that almost one in four Koreans have pets.\nDogs are the most popular pets, taking up 80.7 per cent of pet-owning households, followed by cats at 25.7 per cent. THE KOREA HERALD/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/singapore/laser-skin-treatments-full-course-meals-luxury-life-of-pets-in-korea"}