{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:43:21", "date_modify": "2024-10-12 13:43:21", "date_publish": "2024-08-30 14:41:57", "description": "Sterra made other false and misleading representations on its website. Read more at straitstimes.com.", "filename": "singapore_filtration-device-maker-sterra-apologises-for-false-misleading-claims-about-quality-of-s-pore-tap-water_1728740601.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/30/hzsterra290224.jpg.JPEG?VersionId=SplGRzF_LE.S62U1yrS_MB8tNQSZfM8N&h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_filtration-device-maker-sterra-apologises-for-false-misleading-claims-about-quality-of-s-pore-tap-water_1728740601.html", "title": "Filtration device seller Sterra apologises for false, misleading claims about Singapore tap water quality", "title_page": "Filtration device seller Sterra apologises for false, misleading claims about Singapore tap water quality | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Home-grown firm Sterra, which sells water filtration and other devices, has apologised for making false and misleading claims about the quality of Singapore’s tap water.\nThe Competition and Consumer Commission of Singapore (CCCS) on Aug 30 said the public apology also comes with a promise that Sterra will not make any more false and misleading claims about Singapore’s tap water being unsafe for drinking without the use of its water-purifying filters.\nSterra will also stop making other false claims about its air and water purifiers. If the firm fails to comply, CCCS will take action.\nCCCS, the competition watchdog, initiated a probe under its fair trading laws earlier in 2024 into an online advertisement that suggested that the water in Singapore is not fit for drinking directly from the tap. The ad circulated on social media platforms Instagram and Facebook, and depicted water that teemed with micro-organisms like bacteria and algae.\nIt gained traction after Nanyang Technological University PhD student Clarence Sim debunked claims made by Sterra in an Instagram video on Feb 1 that was widely circulated. The ad was also the subject of several complaints that CCCS received, including from national water agency PUB.\nPUB, in a statement on Aug 30, said it will not condone any false or misleading claims made by companies to promote their products.\nIt said: “Such claims could impact public confidence in Singapore’s drinking water. In Sterra’s case, the company had repeatedly published online content implying that tap water in Singapore is not safe for consumption.\n“Its Facebook advertisement in February 2024 had attempted to mislead the public into thinking that our tap water contains harmful micro-organisms such as bacteria and algae.”\nPUB added that tap water in Singapore is safe to drink, and not only does it comply with Singapore rules, it is also well within World Health Organisation guidelines for drinking water quality.\n“There is no need for any point-of-use water treatment or filtering devices to further treat the water,” said PUB.\nCCCS, a unit under the Trade and Industry Ministry, said Sterra – which also sells air purifiers – made other false and misleading representations on its website between February 2023 and March 2024.\nFirst, it claimed that three of its air purifiers – Sterra Mars, Sterra Moon and Sterra Breeze – are made in Singapore when, in fact, they are made in China.\nSecond, it claimed that two of its water purifiers – Sterra Y Tank Tabletop Hot & Cold Water Purifier and Sterra Y Tank Standing Hot & Cold Water Purifier – are made in South Korea. However, they are made in China and neither are sourced from nor manufactured in South Korea.\nThird, Sterra compared prices before and after discount, but the prices before discount were not genuine, and products were never offered at that price to customers.\nSterra now has pledged to:\nstop its unfair trade practices and put in place an internal compliance policy to ensure that its marketing materials comply with fair trading laws;\nput up a public apology about its advertisement on its website and social media channels for 30 days; and\ncooperate with the Advertising Standards Authority of Singapore (Asas) and Singapore public agencies, including PUB, to resolve all complaints by consumers and publish clarifications about any advertisements that are found to be misleading by Asas or the public agencies.\nCompany directors Lim Liangzhi and Lim Wei Hou have been given a warning, and they have pledged not to engage in any unfair trade practices or facilitate Sterra to do so, CCCS said.\nCCCS chief executive Alvin Koh said the agency takes a firm stance against businesses that make false or misleading claims in their marketing.\nHe said: “Such practices hinder the ability of consumers to make informed decisions, which is essential for well-functioning markets. They also erode consumer trust and undermine the ability of honest businesses to compete on a level playing field.”\nCCCS also lauded Mr Sim’s efforts in debunking the misleading ads. It added that it will continue to monitor the industry but consumers must also remain vigilant and conduct their own research before deciding on what they buy.\nIn a Facebook post on Aug 30, Consumers Association of Singapore (Case) president Melvin Yong said the consumer watchdog received seven complaints against Sterra in 2022, 10 complaints in 2023, and four, so far, in 2024.\nMost of the complaints involved defective products, unsatisfactory service during installation and delays in delivery, said Mr Yong, who is also MP for Radin Mas.\nHe said: “Case will continue to work closely with CCCS to take action against companies that engage in unfair business practices and mislead consumers.”\nConsumers who encounter disputes may contact Case for assistance on 6277-5100 or through its website.", "url": "https://www.straitstimes.com/singapore/filtration-device-maker-sterra-apologises-for-false-misleading-claims-about-quality-of-s-pore-tap-water"}