{"authors": ["Toh Ting Wei"], "date_download": "2024-10-12 13:45:24", "date_modify": "2024-10-12 13:45:24", "date_publish": "2019-03-07 22:39:37", "description": "SINGAPORE - Cyclists and personal mobility device (PMD) users in Geylang and Queenstown will be able to ride directly to the city, and up to six more towns could enjoy such links if the Land Transport Authority (LTA) finds them to be viable. Read more at straitstimes.com.", "filename": "singapore_transport_cycling-routes-to-link-geylang-and-queenstown-to-city-by-next-year_1728740724.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/03/07/yq-cyclingroute-07032010_2x.jpg?VersionId=j_LBnNxw5nbTJk2W2xQPIbva959LiSFR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_cycling-routes-to-link-geylang-and-queenstown-to-city-by-next-year_1728740724.html", "title": "Cycling routes to link Geylang and Queenstown to city by next year", "title_page": "Cycling routes to link Geylang and Queenstown to city by next year | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Cyclists and personal mobility device (PMD) users in Geylang and Queenstown will be able to ride directly to the city, and up to six more towns could enjoy such links if the Land Transport Authority (LTA) finds them to be viable.\nSenior Minister of State for Transport Lam Pin Min announced on Thursday (March 7) that the Geylang-City and the Queenstown-City cycling routes will be completed next year.\nIn his speech about healthy living through active mobility, Dr Lam said these two paths are part of the Government's efforts to expand cycling options through building more infrastructure for it. This is in line with Singapore's goal of having a comprehensive network of off-road cycling paths in every Housing Board town by 2030.\nThe LTA told The Straits Times on Thursday that residents in Chinatown, Farrer Park, Jalan Besar, Kallang, Lavender and Little India may also enjoy a direct cycling connection to the city centre, if its plans bear fruit.\nThe authority said: \"LTA will be rolling out a consultancy tender soon to study in detail the feasibility and implementation of these inter-town cycling routes, as well as connectivity within the central area.\"\nShould these plans be implemented, connectivity for cyclists within the city centre will also be greatly enhanced, and it would make cycling safer and more seamless, the LTA added.\nIn Parliament, Dr Lam also cited a separate area of improvement with the bicycle-sharing industry.\nJust last year, Singapore had more than 100,000 shared bicycles on the street, and indiscriminate parking was an issue.\nHowever, a combination of regulation and provision of parking spaces has helped the government to make \"great strides\" in bringing the situation under control, said Dr Lam.\nProgress has been made towards achieving a goal of 267,000 bicycle parking spaces in Singapore, with more than 220,000 spaces now available islandwide, he said.", "url": "https://www.straitstimes.com/singapore/transport/cycling-routes-to-link-geylang-and-queenstown-to-city-by-next-year"}