{"authors": ["Grace Ho"], "date_download": "2024-10-12 13:46:06", "date_modify": "2024-10-12 13:46:06", "date_publish": "2021-04-08 21:00:00", "description": "S'pore has always managed to institutionalise political succession into an efficient, rational and impersonal process. Read more at straitstimes.com.", "filename": "singapore_politics_political-transitions-in-singapore-a-look-back_1728740766.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/04/08/hzpms040821b.jpg?VersionId=yRl2sDxgtDMhbNNkxiqfinQeqkMSWThb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_political-transitions-in-singapore-a-look-back_1728740766.html", "title": "DPM Heng Swee Keat steps aside as 4G leader: A look at political transitions in Singapore", "title_page": "DPM Heng Swee Keat steps aside as 4G leader: A look at political transitions in Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - In Singapore politics, precedents matter.\nWhich is why Thursday's (April 8) seismic rupture - in the form of designated 4G leader Heng Swee Keat bowing out as successor to Prime Minister Lee Hsien Loong, and throwing the field wide open - was the political equivalent of a massive unexpected earthquake.\nFrom the 1G to the 4G - the \"G\" indicating each generational change in leadership - Singapore has always managed to institutionalise political succession into an efficient, highly rational and impersonal process.\nWhile the timeline for each transition has varied, they were all executed with clinical precision, easing in successors while the incumbent stayed in place for a period so as not to rattle investors and the public.\nOnce a leader-in-waiting was endorsed by his peers, seldom were horses changed mid-stream. Nor were there hints of the kind of jockeying for position, let alone political bloodletting, that has sometimes beset power transitions in other countries.\nThe Straits Times looks at each of the past transitions:\nFrom 1G to 2G\nAt his National Day Rally in 1988, two years before he handed over the reins of leadership, founding Prime Minister Lee Kuan Yew rated key second-generation leaders publicly, providing frank character assessments of Mr Goh Chok Tong, Mr Ong Teng Cheong, Dr Tony Tan and Mr S. Dhanabalan.\nMr Lee even divulged that Mr Goh was not his first choice. He went on to describe Mr Goh as being \"wooden\" when speaking in public or on television. His preference was for Dr Tan, who, however, did not want the job.\nMr Goh later wrote in his biography, Tall Order, that he never doubted that Mr Lee wanted him to succeed: \"If anything, he was exasperated with my lack of public communicative skills.\"\nHe added: \"It was not personal. He was not out to humiliate me for personal reasons, even though I felt humiliated.\"\nSingapore's first political handover got off to an early start, when Mr Goh, then the Defence Minister, was made chairman of the PAP's election committee for the 1984 General Election. The party saw its sharpest dip in votes - 12.7 percentage points - that year.\nBut Mr Lee decided to press on with the task of renewal.\nOn Dec 31, 1984, Mr Goh helmed a press conference at the Istana to announce a new Cabinet line-up.\nHe was to be first deputy prime minister. Mr Ong Teng Cheong would be second deputy prime minister.\nMr Ong said that barring any unforeseen circumstances, Mr Goh would be the next prime minister. Mr Ong and Dr Tony Tan made clear that the decision had the full support of the other ministers and PAP MPs.\nMr Lee was not present at that press conference, but Mr Goh said that Mr Lee remained in charge of the country.\n\"He has planned for this,\" Mr Goh added. \"My colleagues and I will play a prominent role. The Prime Minister will take a back seat but he will not play the role of a back-seat driver. He will play the role of goalkeeper,\" Mr Goh said.\nIt later emerged that earlier, in December, Dr Tan had organised a gathering at his home, attended by Mr Ong, Mr Dhanabalan, Professor S. Jayakumar, Dr Yeo Ning Hong, Dr Ahmad Mattar and Mr Lee Hsien Loong. Several ministers of state were also present. Mr Goh himself joined the meeting later.\nThose gathered decided - unanimously - on Mr Goh as their pick to be the next prime minister.\nDr Tan later told journalists that Mr Goh would be \"the focal point we can rally around and which can act as a focus for public support\".\nMr Lee Kuan Yew had initially wanted to hand over in 1988, when he turned 65.\nBut he told Mr Goh that he did not think he was ready yet, and asked if it would be all right if he carried on for two more years, Mr Goh revealed in his biography.\nMr Goh came to be known for his consultative approach, which stood out from the elder Mr Lee's more paternalistic style.\n2G to 3G\nThis transition, from the 2G to 3G leadership, was the most predictable.\nIn his National Day Rally speech in 2003, a full 10 months before handing over in August 2004, then Prime Minister Goh Chok Tong made it clear to a national audience that his deputy, Mr Lee Hsien Loong, was his successor.\n\"As for the new team leader, I have taken quiet soundings from ministers and MPs on whom they would choose. The clear consensus is Hsien Loong. He is also my choice,\" he said.\nMr Lee Hsien Loong, who entered politics in 1984 and was made second assistant secretary-general of the PAP in 1989 and deputy prime minister in 1990, had a long runway to prepare for the top post. He was also widely regarded among his peers as having performed well as deputy prime minister.\n\"His performance as DPM had been outstanding,\" former deputy prime minister S. Jayakumar wrote in his book Governing: A Singapore Perspective. \"None of us in PM Goh Chok Tong's Cabinet had any doubts that he should succeed Goh Chok Tong as prime minister.\"\nBut Mr Lee's path to the premiership was not always a smooth one.\nHealth issues cropped up, with Mr Lee and Mr Ong Teng Cheong - then both deputy prime ministers - diagnosed with lymphoma at around the same time, in 1992.\nMr Ong did not require treatment then, and Mr Lee had to undergo chemotherapy, which saw him cleared of cancer cells in April 1993.\nHe remained deputy prime minister. But Mr Goh persuaded former minister S. Dhanabalan to return to helm Mr Lee's trade and industry portfolio briefly.\nThe process of selecting Mr Lee was also more inclusive. Unlike in the case of Mr Goh, who was selected by a small group of ministers and members of the PAP Central Executive Committee - the party's highest decision-making body - the endorsement of PAP MPs was also sought for Mr Lee.\nThe idea of involving MPs in the selection and endorsement was mooted by Mr Goh himself. He explained that he was putting in place a new process as the new leader \"must command the confidence of his fellow MPs\".\nThis was a significant step forward for the political system here and set a precedent for the process of leadership succession in future.\nMr Goh and Mr Lee Hsien Loong continued to build the 3G team.\nMr Teo Chee Hean, for instance, was elected in 1992, and has held key roles since, including as DPM, and now as Senior Minister.\nThe 2001 General Election also saw what became known as the \"Super Seven\" junior ministers join the team. Among them were Mr Tharman Shanmugaratnam and Mr Khaw Boon Wan, both key members of the 3G leadership.\n3G to 4G\nSome observers say the process of selecting the 4G leaders, while similar, appeared more protracted.\nIn December 2017, Mr Goh, who was Emeritus Senior Minister, nudged the 4G team to settle the question of leadership early so that Prime Minister Lee Hsien Loong could settle on his successor by the end of 2018.\nHowever, the 4G team did not want to be rushed into a decision. On Jan 4, 2018, 16 ministers from the 4G issued a joint statement saying that they were \"conscious of their responsibility, are working closely together as a team and will settle on a leader from among us in good time\".\nOn Nov 23, 2018, almost 11 months later, 32 ministers and MPs issued a joint statement: \"Now we have a consensus that the team will be led by Swee Keat.\"\nThey also noted that Mr Heng Swee Keat had asked Trade and Industry Minister Chan Chun Sing to be his deputy, and Mr Chan had agreed to this.\nIn their joint statement, they said: \"We endorse and support Swee Keat and Chun Sing as our leaders.\"\nThis ended months of speculation at that time on what some observers had speculated could otherwise have been possible infighting and over who the next prime minister might be.\nOn April 23, 2019, PM Lee appointed Mr Heng as his deputy prime minister with effect from May 1, 2019.\nThe selection of Mr Heng by his peers did not come as a surprise. His career experience and exposure since he entered politics in 2011 put him well ahead of the other 4G leaders.\nIn September 2015, when he was named Finance Minister, PM Lee noted Mr Heng had proven himself in the demanding education portfolio, to which he was appointed in May 2011, just two weeks after being elected.\nPM Lee had said previously that he hoped to step down before his 70th birthday, which will be in February 2022.\nNow that Mr Heng has withdrawn himself from the race - an unprecedented move barely three years after ministers and MPs issued their joint statement of support - the succession question has been blown wide open again.", "url": "https://www.straitstimes.com/singapore/politics/political-transitions-in-singapore-a-look-back"}