{"authors": ["Felicia Choo"], "date_download": "2024-10-12 13:29:37", "date_modify": "2024-10-12 13:29:37", "date_publish": "2018-02-21 20:59:52", "description": "SINGAPORE - Cigarettes have become more expensive here following a 10 per cent increase in excise duty on all tobacco products, but experts are divided on whether this will reduce the number of smokers. Read more at straitstimes.com.", "filename": "singapore_tobacco-tax-hike-will-see-prices-of-cigarettes-go-up-by-about-1-but-experts-say-smokers_1728739777.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/02/21/dw-tobacco-tax-180221.jpg?VersionId=aO.dt2xyB9TXqJgbzdEwEJ9qOFdQykeU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_tobacco-tax-hike-will-see-prices-of-cigarettes-go-up-by-about-1-but-experts-say-smokers_1728739777.html", "title": "Tobacco tax hike will see prices of cigarettes go up by about $1 but experts say smokers may still be undeterred", "title_page": "Tobacco tax hike will see prices of cigarettes go up by about $1 but experts say smokers may still be undeterred | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Cigarettes have become more expensive here following a 10 per cent increase in excise duty on all tobacco products, but experts are divided on whether this will reduce the number of smokers.\nThe increase in tobacco taxes was announced by Finance Minister Heng Swee Keat during his Budget speech on Monday (Feb 19), and took effect the same day.\nPrices of popular cigarette brands are set to increase by at least $1 tomorrow, although some retailers have already raised them.\nAccording to a circular sent to retailers on Tuesday by tobacco company Philip Morris Singapore, which was seen by The Straits Times, a packet of 20 Marlboro White cigarettes will cost $14.10, up from $13. The price of a packet of Sampoerna A Menthol cigarettes will jump from $12.30 to $13.80.\nThe Tobacco Network Traders also sent out a recommended price list to retailers, increasing the cost of rolling tobacco such as Butterfly Yellow by more than $1, to $12.\nDuties for cigarettes and other manufactured tobacco were last increased in 2014, said the Ministry of Finance (MOF). That was also an increase of 10 per cent.\nTax on a typical packet of 20 cigarettes now works out to be around 60 per cent, before goods and services tax, MOF said in response to queries from ST.\nThis means that each cigarette, which weighs about 1g, costs firms about 4 cents more, according to Singapore Customs.\nThe World Health Organisation (WHO) recommends at least a 70 per cent excise tax share in the final consumer price to lower cigarette consumption.\nThe amount of revenue collected by Singapore Customs for tobacco customs and excise duties each year from 2014 to 2017 was slightly above $1 billion.\nThe proportion of smokers aged 18 to 69 here has consistently hovered around 13 per cent since 2013.\n\"High prices can stop young people from taking up smoking and encourage current smokers to quit or smoke less, especially those with limited disposable incomes,\" said Professor Tikki Pang, a visiting professor at the Lee Kuan Yew School of Public Policy at the National University of Singapore.\nHowever, he noted that raising tobacco taxes needs to be combined with other measures such as the continued expansion of smoke-free zones.\n\"At the same time, raising prices of cigarettes may lead to increased smuggling and black market availability, so surveillance may need to be stepped up,\" added Prof Pang, whose areas of research include global health governance.\nAddictions psychotherapist Andrew da Roza is less optimistic.\n\"My view is that a 10 per cent increase in tobacco excise tax is likely to have only a modest effect on decreasing smoking prevalence in Singapore, and the effect is likely to be temporary,\" he said. He felt the increase was too small.\nOne factor is whether incomes increase more than taxes, keeping cigarettes affordable, said Mr da Roza, who works at Promises Healthcare, a mental health and addictions consulting company.\nFor example, as median household real incomes from work, per household member, increased by 20 per cent between 2014 and last year, cigarettes still remained affordable despite the 2014 tobacco tax increase, he said.\nAccording to WHO, on average, a 10 per cent price increase on a pack of cigarettes would be expected to reduce demand for cigarettes by about 4 per cent in high-income countries and by about 5 per cent in low- and middle-income countries.\nFor more Budget coverage, visit the ST microsite at str.sg/budget2018", "url": "https://www.straitstimes.com/singapore/tobacco-tax-hike-will-see-prices-of-cigarettes-go-up-by-about-1-but-experts-say-smokers"}