{"authors": ["Audrey Tan"], "date_download": "2024-10-12 13:38:07", "date_modify": "2024-10-12 13:38:07", "date_publish": "2021-10-25 09:53:55", "description": "The move will allow the Republic to tap sources such as wind energy and hydropower in other countries. Read more at straitstimes.com.", "filename": "singapore_environment_singapore-plans-to-import-30-of-energy-from-low-carbon-sources-by-2035_1728740287.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/10/25/ycwind251021.jpg?VersionId=BdaPClRyAUG4P70Dmld5MqViMNIqfTQ7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_singapore-plans-to-import-30-of-energy-from-low-carbon-sources-by-2035_1728740287.html", "title": "Singapore plans to import 30% of energy from low-carbon sources by 2035", "title_page": "Singapore plans to import 30% of energy from low-carbon sources by 2035 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore plans to further reduce the carbon footprint of its power sector by importing around 30 per cent of its electricity from low-carbon sources, such as renewable energy plants, by 2035.\nThis move will allow the Republic, which lacks access to most renewable energy options other than solar, to tap sources such as wind energy and hydropower in other countries.\nMinister for Trade and Industry Gan Kim Yong said on Monday (Oct 25) at the opening of the Singapore International Energy Week: \"Importing low-carbon energy will be a key needle mover in Singapore's energy transition in the near to medium term.\"\nWith the power sector accounting for almost a quarter of global emissions, decarbonising electricity generation is at the core of the global climate change effort, he said.\nHe added that many countries have already pledged to transition their power sector, reducing reliance on coal and other fossil fuels, and developing more renewable energy sources.\nYet, the energy transition will be challenging and even risky if the transition is not managed well, he said, citing the ongoing global energy crisis that has led to a spike in electricity prices here.\nThe energy crisis is caused by a confluence of factors. Covid-19 pandemic-recovery economic activity and countries entering the cooler seasons are nudging up demand for fuel.\nAs natural gas produces less carbon dioxide when burnt, compared with coal or oil, many countries are switching to this fuel to reduce their carbon emissions. This further increases the demand for gas.\nMr Gan said that when a country replaces large parts of its traditional energy sources with new ones in a short period of time, unanticipated security and reliability risks may arise.\n\"This was evident in several energy markets where a shortage of renewable energy and an increased demand for gas caused electricity prices to rise,\" he said.\nBut he said Singapore will not be abandoning or slowing its energy transition. \"The fate of our planet does not permit that,\" he said.\nHe also noted that the transition to renewable energy, including importing electricity, may not mean cheaper electricity.\nThe Energy Market Authority (EMA) said it plans to issue two requests for proposal for up to a total of 4 gigawatts (GW) of low-carbon electricity imports into Singapore by 2035. This is expected to make up around 30 per cent of Singapore's electricity demand then.\nThe first request for proposal to import up to 1.2GW of electricity will be launched next month and is expected to begin by 2027.\nThe second one for the remaining 2.8GW is expected to be issued in the second quarter of next year and to start by 2035.\nProposals for electricity from coal-fired generation sources will not be accepted, said EMA. Coal is the dirtiest form of fossil fuel.\nEMA chief executive Ngiam Shih Chun said the authority will work with potential importers to ensure that sufficient safeguards are put in place to mitigate any prolonged supply disruptions.\n\"EMA will also look into diversifying the sources of imports to mitigate potential risks,\" he said.\nBy 2035, the remaining supply of Singapore's electricity will continue to come from various sources, including the Republic's current natural gas-fired power plants to solar and waste-to-energy sources.\nWaste-to-energy generation involves burning waste and harnessing this heat in the form of steam to drive turbo-generators to produce electricity. However, electricity from waste-to-energy generation and solar are but a tiny source of the country's fuel mix.\nCurrently, more than 95 per cent of Singapore's electricity is generated from natural gas - the cleanest form of fossil fuel. This fuel is imported into Singapore through pipes from its neighbours or in liquefied form from all over the world.\nThe Republic is also investing in research into emerging low-carbon technologies such as green hydrogen - a fuel that produces no planet-warming carbon dioxide when burnt - as well as carbon capture, utilisation and storage technology that will enable carbon to be locked away from the atmosphere.\nTo prepare for future electricity imports, EMA said it has been working with various partners over the past two years on trials to import electricity. At least three have been announced so far - with Malaysia, Indonesia and Laos.\nEMA added that the trials allow it to assess and refine the technical and regulatory frameworks for importing electricity into Singapore.\nMr Gan said: \"Today, most of our energy depends on supplies which are imported anyway. Instead of importing all of it in molecules, we will import some of it as electrons.\"\nDuring last year's conference, for example, EMA had announced that it would embark on a trial to import 100 megawatts (MW) of electricity from Malaysia, preferably from a low-carbon source. This amount would make up about 1.5 per cent of Singapore's peak electricity demand.\nOn Monday, EMA said it had appointed YTL PowerSeraya for the two-year trial, following a request for proposal process initiated in March this year.\nEMA said YTL PowerSeraya was selected as its proposal was best able to meet the authority's requirements to trial electricity imports via the existing interconnector. This is expected to commence early next year.\nThe imported electricity will be from gas-fired generation, the authority added.\nEMA said it recognises that non-renewable sources may be needed as a start to make the imports commercially viable or available as baseload power - for instance, to smoothen the intermittency of solar generation.\nIt is also embarking on a pilot with a consortium led by power generation company PacificLight Power to import 100MW equivalent of non-intermittent electricity from a solar farm in Pulau Bulan, Indonesia.\nElectricity will be supplied via a new interconnector that directly connects a solar farm in Pulau Bulan to PacificLight's power station in Singapore. The pilot is expected to be commissioned by around 2024, EMA said.\nAs for the Laos pilot, EMA said Singapore is also working on the Lao PDR-Thailand-Malaysia-Singapore Power Integration Project to import up to 100MW of power from Laos to Singapore via Thailand and Malaysia using existing interconnections from next year to 2023.\nCross-border power trade is expected to commence next year.\nHowever, Malaysia's Energy and Natural Resources Ministry said in a statement last Friday that it will allow only non-renewable energy exports to neighbouring Singapore. Power sales to the island through self-developed transmission and interconnection facilities will not be allowed.\nAsked to comment on the latest development, an EMA spokesman said the trial with Malaysia will allow it to assess and refine the technical and regulatory frameworks for importing electricity into Singapore.\n\"This includes testing out imports via the interconnection, connections between the Singapore and Malaysian grid, and the sale of imported electricity on the Singapore wholesale electricity market,\" she said.\n\"The learnings from this trial will enable us to facilitate the development of regional power grids, and tap on low-carbon energy sources from other countries in the region.\"", "url": "https://www.straitstimes.com/singapore/environment/singapore-plans-to-import-30-of-energy-from-low-carbon-sources-by-2035"}