{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 13:44:20", "date_modify": "2024-10-12 13:44:20", "date_publish": "2023-08-07 12:22:43", "description": "The national carrier will also be raising capacity by using larger jets on some routes. Read more at straitstimes.com.", "filename": "singapore_transport_sia-to-step-up-flights-to-key-markets-from-march-to-october-2024-amid-strong-demand_1728740660.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/07/IMGSIA11672SG1B.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_sia-to-step-up-flights-to-key-markets-from-march-to-october-2024-amid-strong-demand_1728740660.html", "title": "SIA to step up flights to key markets from March to October 2024 amid strong demand", "title_page": "SIA to step up flights to key markets from March to October 2024 amid strong demand | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore Airlines (SIA) will significantly increase the frequency of its flights to some key markets from March to October 2024, restoring more of its services – including those to Beijing, Shanghai, Hong Kong and Melbourne – to pre-pandemic levels.\nThe national carrier will also resume direct flights between Singapore and Barcelona, Spain, from June 2, 2024, with a twice-weekly service.\nIn a statement on Monday, SIA said these moves would help it meet the strong demand for air travel to these destinations.\nOn some routes, SIA will raise capacity by using larger jets.\nOn flights to and from Cairns, Australia, starting March 31, 2024, it will replace the single-aisle Boeing 737-8 plane, which has 154 seats, with the Airbus A350-900 medium-haul jet, which can hold 303 passengers.\nThis will be the first time a wide-body plane is deployed on the route in more than two decades, the carrier said.\nMeanwhile, the larger Airbus A380 will replace the smaller A350-900 long-haul jet on one of SIA’s daily services to Frankfurt, Germany, from March 31, 2024. This marks the return of the airline’s superjumbo to continental Europe.\nFrom March 31, SIA will also use A350-900 medium-haul planes on flights between Singapore and Male in the Maldives, instead of the smaller Boeing 737-8.\nWith the increased frequencies, SIA’s services between Singapore and Dubai in the United Arab Emirates will exceed pre-Covid-19 levels, at 11 times weekly, from March 31, 2024.\nOther SIA services that will have frequencies reaching or surpassing pre-Covid-19 levels include flights to and from Tokyo’s Haneda Airport, which will go up to four flights daily from Sept 1, 2024. Flights to and from Da Nang in Vietnam will be raised to 14 times weekly from July 1, 2024.\nThe frequencies of flights to Ahmedabad in India, Darwin and Perth in Australia, Copenhagen in Denmark, and Seattle and Houston in the United States will also be restored to pre-Covid-19 levels.\nFor services between Singapore and Kuala Lumpur – the second-busiest international route worldwide – SIA will crank up its flights from 47 times weekly now to 66 times by August 2024.\nA third daily service will be added between Singapore and Beijing from May 2024, taking the frequency of SIA’s flights to the Chinese capital to pre-pandemic levels.\nFrom August 2024, SIA will fly six times daily to Hong Kong, up from four now. The airline will operate A350-900 long-haul jets on the two extra services.\nMs JoAnn Tan, SIA’s senior vice-president for marketing planning, said: “With the release of SIA’s Northern Summer schedules, our customers can plan ahead and start to make their travel plans for 2024.”\nBetween April and June 2023, SIA and its budget arm Scoot carried 8.4 million passengers, 65.5 per cent more than a year before.\nSIA’s passenger load factor – a measure of the percentage of seats filled – stood at a record 88.1 per cent.\nIn late July, the SIA Group said its capacity was on track to reach an average of about 90 per cent of pre-Covid-19 levels by March 2024.\nWhen asked about the effect of the upcoming frequency changes on capacity, SIA told The Straits Times it would provide more information at a later date on projections for the group’s capacity beyond March 2024.\nThe airline posted a record quarterly net profit of $734 million for the first quarter of its financial year that ended on June 30 in the midst of pent-up demand for air travel.", "url": "https://www.straitstimes.com/singapore/transport/sia-to-step-up-flights-to-key-markets-from-march-to-october-2024-amid-strong-demand"}