{"authors": ["Linette Lai"], "date_download": "2024-10-12 13:46:22", "date_modify": "2024-10-12 13:46:22", "date_publish": "2019-04-23 16:09:58", "description": "Finance Minister Heng Swee Keat will become Deputy Prime Minister from May 1, in a move that cements his standing as Singapore's next prime minister. Read more at straitstimes.com.", "filename": "singapore_heng-swee-keat-to-be-appointed-deputy-prime-minister-dpms-teo-chee-hean-and-tharman_1728740782.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/04/23/hzcab2.jpg?VersionId=Rbmnm3xPrDkmnJchlA46.uWPmrbHaOQ3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_heng-swee-keat-to-be-appointed-deputy-prime-minister-dpms-teo-chee-hean-and-tharman_1728740782.html", "title": "Cabinet reshuffle: Heng Swee Keat to be appointed Deputy Prime Minister; DPMs Teo Chee Hean and Tharman to become Senior Ministers", "title_page": "Cabinet reshuffle: Heng Swee Keat to be appointed Deputy Prime Minister; DPMs Teo Chee Hean and Tharman to become Senior Ministers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Finance Minister Heng Swee Keat will become Deputy Prime Minister from May 1, in a move that cements his standing as Singapore's next prime minister.\nMeanwhile, both existing DPMs - Mr Teo Chee Hean and Mr Tharman Shanmugaratnam - will relinquish their appointments, the Prime Minister's Office (PMO) announced in a statement on Tuesday (April 23).\nThey will be appointed Senior Ministers and remain in Cabinet.\nMr Heng, 57, will remain Finance Minister, and continue chairing the Future Economy Council and National Research Foundation. He will be appointed Acting Prime Minister in Prime Minister Lee Hsien Loong's absence.\nMr Teo, 64, will continue as Coordinating Minister for National Security, while Mr Tharman, 62, will be redesignated as Coordinating Minister for Social Policies. He will continue to advise the Prime Minister on economic policies, said the PMO.\nIn a Facebook post, PM Lee, 67, said the changes are part of the ongoing leadership renewal.\nHe wrote: \"The next generation leadership is taking shape, and progressively taking over from me and my older colleagues. The team is working closely together, building up public trust and confidence in their leadership.\"\n\"I ask all Singaporeans to support them, and work together to secure a bright future for Singapore,\" he added.\nMr Heng, in a statement, said he is deeply honoured by the trust and confidence of PM Lee and his Cabinet colleagues in entrusting him with the appointment.\n\"My colleagues and I are united in our purpose to serve Singaporeans to the best of our abilities. Together with our fellow Members of Parliament and the public service, we will seek to build strong relationships with fellow Singaporeans, work together with all to take Singapore forward, and build a better future for our people.\"\nOn Tuesday, GIC also announced that Mr Tharman, who is now a GIC director, will be appointed deputy chairman from May 1.\nAs deputy chairman, he will assist PM Lee, who is GIC chairman, to lead the board in overseeing GIC's long-term asset allocation and portfolio performance, said the statement. Mr Tharman has been a GIC director and chairman of the Investment Strategies Committee since May 2004 and July 2011 respectively. He is also chairman of the Monetary Authority of Singapore.\nMr Tharman, in a Facebook post, described Mr Heng as \"the best person to move up to become DPM and take over as PM\" during the next term of government. \"He has exceptional ability, mettle and the confidence of the 4G team,\" he said.\nHe added that he looks forward to continuing to serve his constituents in Jurong in the years to come.\nOn the leadership transition, he said: \"We have avoided sudden change. It may be unexciting and predictable, but it works for Singapore.\"\nWhile senior members of the Cabinet will continue to provide support to the 4G team as it takes over, he noted: \"But renewal there must be, not just with a new generation of leaders but with the changing times.\"\nSingaporeans' views and aspirations are changing, and they will be quite different 10 years from now, he said. \"Our 4G leadership will have to keep their ears close to the ground, stay open to new ideas and initiatives, and keep evolving our strategies to keep our society inclusive and vibrant. So that they retain the trust of Singaporeans and lead the country with confidence.\"\nMr Teo, who congratulated Mr Heng on his appointment, said in a statement: \"This is another important step in our leadership renewal.\"\n​He said he hopes to continue to serve Pasir Ris-Punggol GRC residents as their Member of Parliament at the next general election.\n\"I will continue in Cabinet to support PM Lee and DPM Heng in whatever way I can, and work together with them, Mr Chan Chun Sing and other younger leaders for the security, safety and success of our country,\" Mr Teo added.\n\"This is the Singapore way of ensuring smooth leadership transition, continuity and stability. Senior leaders make way in good time for the next generation, share their experience and help the next generation of leaders to succeed.\"\nTrade and Industry Minister Chan Chun Sing also congratulated Mr Heng on his new appointment. \"As one team, we will continue to work closely together to take Singapore forward and to serve all Singaporeans,\" he wrote in a Facebook post.\nMr Heng had been set to be appointed deputy prime minister in the reshuffle, after he was picked in November as the ruling People's Action Party's (PAP) first assistant secretary-general.\nThese changes come a year after a major reshuffle announced last April, which saw the younger ministers taking on heavier responsibilities in 10 out of 16 ministries helmed by fourth-generation ministers.\nAt the same time, four backbenchers became office-holders to bolster the front bench, as three veteran ministers retired from Cabinet. They were Mr Lim Hng Kiang, Mr Lim Swee Say and Dr Yaacob Ibrahim.\nPM Lee had given an indication last December that the Cabinet would be reshuffled some time after this year's Budget debate, which ended last month.\nHe has said that he plans to step down some time after the next general election, which must be held by April 2021.\nThe latest reshuffle is the fourth since the last general election on Sept 11, 2015, and will probably be the last before the next election.", "url": "https://www.straitstimes.com/singapore/heng-swee-keat-to-be-appointed-deputy-prime-minister-dpms-teo-chee-hean-and-tharman"}