{"authors": ["Gabrielle Chan"], "date_download": "2024-10-12 13:51:24", "date_modify": "2024-10-12 13:51:24", "date_publish": "2023-10-06 19:00:00", "description": "He said all sponsored articles come with a note making clear that they are paid reviews. Read more at straitstimes.com.", "filename": "singapore_popular-blog-sethluicom-refutes-claims-it-does-not-disclose-taking-payment-for-food-reviews_1728741084.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/06/svseth061023.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_popular-blog-sethluicom-refutes-claims-it-does-not-disclose-taking-payment-for-food-reviews_1728741084.html", "title": "Popular blog Sethlui.com refutes claims it does not disclose taking payment for food reviews", "title_page": "Popular blog Sethlui.com refutes claims it does not disclose taking payment for food reviews | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Mr Seth Lui, who operates a popular blog site featuring food reviews, has rebutted allegations that the portal does not make clear that it accepts payment for restaurant reviews.\nHe added that all articles sponsored by advertisers come with a note making it clear that they are paid reviews.\nIn response to queries, a spokesman for Mr Lui said on Thursday that the blogger is aware of a post circulating online that accuses the food blog of featuring local eateries in its reviews in return for payment.\n“The allegations are absolutely false,” he added.\nMr Lui, 38, set up the online publication in 2013.\nThe claims were made by Ms Charlene Yan, 34, who owns an eatery in Everton Park in the Tanjong Pagar area. Ms Yan, in a Facebook post on Wednesday, said she was shocked to get an e-mail from one of Mr Lui’s employees asking if she would like to pay for a spot in a list of the best places to eat in Everton Park.\nIn the e-mail – a screenshot of which accompanied the post – the employee calls the offer an “advertising effort”, and said her eatery would be assigned a random position on the list for $2,300.\nShe was also given the choice of opting to be placed in first, second or third spot for an additional $400 to $600. Her eatery would stay in the chosen position on the list for at least one year, the employee added.\nIf she took up the offer, her eatery would get a review of about 150 to 200 words, accompanied by a maximum of two photos, and be promoted on social media. She would also be able to see two drafts of the article and suggest revisions, the employee added.\nThe e-mail provided examples of similar lists the blogger has done in the past, including his Northpoint City food guide, which has chalked up more than 57,000 views.\nIn the post, Ms Yan said the cash-for-review offer was “incredulous”, and questioned the authenticity of Mr Lui’s reviews. She added that she did not contact Mr Lui before she got the offer.\nSpeaking to The Straits Times, Ms Yan said: “I was surprised when Sethlui.com was going to write a new definitive article to say what is good to eat in my neighbourhood without actually trying the food.\n“My gripe is that they were going to write an article for which the main criterion was money, and without full disclosure. And there were so many other articles doing the same thing for eateries in other neighbourhoods.”\nShe added: “I did not want to just ignore the e-mail because I feel that people deserve to know and be more aware of what they read. It is also time for bloggers to have higher standards of integrity.”\nIn response to queries, a spokesman for Mr Lui said he apologised for the confusion and frustration caused by the post. He added that he and his team are committed to being transparent.\nAddressing claims that he took payment from eateries for getting featured, the spokesman said Mr Lui contacts clients with an offer to be featured on his blog only after extensive research by his team.\nHe said: “The misconception from the post is that we randomly pick eateries and send them proposals. That is patently false.”\nPaid collaborations begin with scouring social media platforms and Google restaurant ratings to discover new and trending places, he said.\nMr Lui’s team then decides if an eatery warrants a recommendation to readers. That is when the team contacts the eatery to see if there is potential for a sales tie-up.\nThe spokesman said: “In a client collaboration, one or more members of the team would have visited them, understood more about their story, tried the food, and then written about it.\n“If the food quality is far below average, we would still drop the client so as not to mislead our readers.”\nIf an eatery rejects a collaboration, it is up to Mr Lui’s team to decide if it should still be featured.", "url": "https://www.straitstimes.com/singapore/popular-blog-sethluicom-refutes-claims-it-does-not-disclose-taking-payment-for-food-reviews"}