{"authors": ["Lee Li Ying"], "date_download": "2024-10-12 14:01:05", "date_modify": "2024-10-12 14:01:05", "date_publish": "2023-10-29 05:00:00", "description": "Doctors say the incidence goes up as average maternal age rises and obesity becomes more prevalent. Read more at straitstimes.com.", "filename": "singapore_public-hospitals-in-singapore-see-rise-in-patient-visits-for-high-risk-pregnancy_1728741665.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/29/2023091529673518img5636.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_public-hospitals-in-singapore-see-rise-in-patient-visits-for-high-risk-pregnancy_1728741665.html", "title": "Public hospitals in Singapore see rise in patient visits for high-risk pregnancy", "title_page": "Public hospitals in Singapore see rise in patient visits for high-risk pregnancy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – To Ms Germaine Heng, her third pregnancy in 2021 was as arduous as scaling mountains.\nBesides gestational diabetes, she was diagnosed with pre-eclampsia, a serious blood pressure condition.\nIt increases a patient’s risk of damage to the kidneys, liver, brain and blood systems. It also affects the placenta, and the foetus may not get all the nutrients and oxygen it needs.\n“My blood pressure was so high that I could have had seizures any time,” said Ms Heng, who works in the hospitality industry.\n“Each day was like a mountain to climb, where you hope your readings and... your baby’s heartbeat would be good.”\nDuring the second trimester, she was hospitalised for several days at KK Women’s and Children’s Hospital (KKH) to stabilise her condition.\nAt week 30 of her pregnancy, she was told that the foetus was small, weighing about 1.2kg – below the average weight of 1.5kg.\nAfter a few weeks in hospital, a decision was made to deliver her daughter early via caesarean section. Baby Ylizabeth spent about five weeks in the hospital and was discharged after her weight increased to 1.8kg.\nMs Heng’s experience is becoming increasingly common, as hospitals say they have been seeing more high-risk pregnancies in recent years.\nA pregnancy is described as high risk if there is any condition that increases the likelihood of an adverse outcome for the mother, foetus or both. Women with high-risk pregnancies include older mothers; women with pre-existing illnesses such as cardiac, renal or diabetic conditions; those who have a history of recurrent or late pregnancy losses; and those with foetal abnormalities.\nAll three public hospitals with maternity wards say that the number of patients with high-risk pregnancies has gone up over the years, but they do not have data available to share.\nPrivate institutions that run hospitals with maternity wards – such as IHH Healthcare, which runs Gleneagles Hospital, Mount Elizabeth Hospital, Mount Elizabeth Novena Hospital and Parkway East Hospital, and Raffles Medical Group, which operates Raffles Hospital – also say they do not have such data.\nHowever, in terms of attendance rates, the three public hospitals – KKH, National University Hospital (NUH) and Singapore General Hospital (SGH) – have noted an increase in the number of visits to their specialised centres or clinics for high-risk pregnancies.\nA spokesman for NUH said the hospital saw an estimated 9,400 visits by high-risk pregnancy patients in 2021, and this increased to about 9,900 visits in 2022. In 2023, the number is projected to rise to about 10,400, based on patient numbers so far.\nKKH saw its attendance rates for high-risk pregnancies jump from 1,966 in 2020, to 3,915 in 2022. In the first six months of 2023, there were 1,898 such visits.\nAn Obstetric High Risk Clinic (OHRC) was set up at KKH in 2014. In 2021, to meet the need for tertiary-level obstetric care, the hospital launched the one-STop Obstetric high RisK Centre, or Stork, comprising eight clinics including OHRC, which was subsumed.\nDr Serene Thain, a consultant at KKH’s department of maternal foetal medicine, said the figures are just the tip of the iceberg as Stork manages patients who are the most high-risk. There are other high-risk pregnancies that are managed by general obstetrics clinics, for example.\nSGH’s Centre for High-Risk Pregnancies (Chirp), which has eight clinics, has seen a slight rise in attendance rates over the years. When the centre was first set up in 2020, it saw about 1,000 visits. In 2021 and 2022, there was a slight increase to about 1,100 visits each year. From January till July 2023, there were about 600 visits.\nDoctors say the incidence of higher-risk pregnancies increases as the average maternal age rises and obesity becomes more prevalent.\nDr Thain pointed out that the median age of mothers was 31 in 2021, higher than the 30.5 in 2015. The number of women conceiving in their 40s has doubled over the past three decades in Singapore. Data from the Singapore Department of Statistics showed that in 2021, there were nine births for every 1,000 women aged 40 to 44, compared with 4.5 in 1985, she added.\n“With advanced maternal age, the risks in complications such as gestational diabetes, pre-existing diabetes, pregnancy-induced hypertension and pre-eclampsia in pregnancy increase as well, which contribute to higher-risk pregnancies,” said Dr Thain.\nShe added that obesity also increases the risks of such complications. According to statistics from the National Population Health Survey 2022, the obesity rate of Singaporean women aged between 18 and 74 jumped from 7.8 per cent in 2013, to 10.2 per cent in 2021 to 2022.\nThe use of assisted reproductive techniques such as in-vitro fertilisation has also added to the risks.\nDr Tan Wei Ching, a senior consultant at SGH’s department of obstetrics and gynaecology, said: “With advances in medical technology, some patients deemed not suitable for pregnancy previously are able to (conceive) now with new medications and treatment. With increasing fertility treatment, there are also those with multiple pregnancies like twins or triplets, and that also contributes to high-risk pregnancies.”\nDr Anita Kale, senior consultant at NUH’s division of maternal fetal medicine under its department of obstetrics and gynaecology, said patients with serious organ issues are also better able to conceive nowadays.\n“Complicated medical conditions like kidney or liver failure are now better managed with the availability of organ transplant. As the health of these patients improves after transplant, they are able to plan pregnancy which needs multidisciplinary management,” said Dr Kale.\nBesides the risks to their pregnancies, women also have to grapple with mental health issues.\nDr Claudia Chi, an obstetrician and gynaecologist at Mount Elizabeth Hospital, said: “Mental health problems, particularly depression and anxiety, are becoming more prevalent during pregnancy and post-partum. It is estimated that about 10 per cent to 20 per cent of women experience depression during pregnancy or post-delivery.”\nOne of the most common conditions for high-risk pregnancies over the past few years is gestational diabetes and pre-existing Type 2 diabetes.\nDr Thain said women with pre-existing diabetes should go for pre-conception counselling, as poorly controlled diabetes at the time of conception is associated with a higher risk of adverse pregnancy outcomes, such as increased risk of foetal congenital anomalies, miscarriages and stillbirth.\nAssociate Professor Tan Lay Kok, head and senior consultant of KKH’s department of maternal foetal medicine, gave the same advice to those with pre-existing conditions such as hypertension, heart disease, asthma, kidney conditions, epilepsy and rheumatic conditions.\n“It would be best for these conditions to be in remission or well controlled prior to conceiving. Drugs used would also need to be reviewed to ensure there are no contraindications in the pregnancy, as some drugs can be toxic to the growing foetus,” he said.\nThere should also be effective family planning provided by the obstetrician so that women can avoid getting pregnant while having an uncontrolled disease, he added.\nWomen with a bad obstetric history should have a review to identify risk factors and take preventive measures.\nFor example, those with recurrent miscarriages and very early pre-term births may have a short cervix and would require a cervical suture, a procedure in which the cervix is temporarily closed with stitches to help hold the pregnancy.\nProf Tan emphasised that those who are already in a high-risk pregnancy should be cared for by a multi-disciplinary team, rather than just an obstetrician.\n“For example, a patient with diabetes would also be seen by an endocrinologist, dietician, diabetic nurse and, later on, the anaesthetist closer to the time of delivery. Ideally, the patient sees these different specialists in the same clinic together to ensure clear messaging and communication,” he said.\nFor Ms Heng, the experience may have been daunting, but it was worthwhile. Recalling the day her daughter was finally discharged, she said: “I felt I had overcome many mountains and emerged into a beautiful sunset.”", "url": "https://www.straitstimes.com/singapore/public-hospitals-in-singapore-see-rise-in-patient-visits-for-high-risk-pregnancy"}