{"authors": ["Esther Loi"], "date_download": "2024-10-12 14:20:39", "date_modify": "2024-10-12 14:20:39", "date_publish": "2024-08-28 20:30:00", "description": "Keeping bus services that duplicate MRT lines will mean higher costs and, in turn, higher fares. Read more at straitstimes.com.", "filename": "singapore_trade-offs-between-convenience-affordability-in-public-transport-need-to-be-carefully-managed-chee_1728742839.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/28/pixbuses.868cade3.Attachment.133337.jpg?VersionId=U63T0RKQZCrb3B6sNS.jiNM4pMaLTMs.&h=294175ec", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_trade-offs-between-convenience-affordability-in-public-transport-need-to-be-carefully-managed-chee_1728742839.html", "title": "Trade-offs between convenience, affordability in public transport need to be carefully managed: Chee", "title_page": "Trade-offs between convenience, affordability in public transport need to be carefully managed: Chee | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Even as the Government injects resources into buying more buses and hiring more bus drivers, it needs to carefully manage trade-offs between providing greater convenience for the public and keeping overall costs affordable as resources are finite, Transport Minister Chee Hong Tat said.\nSpeaking at the Economic Society of Singapore’s annual dinner at Orchard Hotel on Aug 28, Mr Chee said that is why the Government needs to continue rationalising bus services as Singapore’s MRT network continues to expand.\nThis is especially so for long trunk bus services that run parallel to MRT lines, as these see a significant drop in ridership when commuters switch to riding the MRT, he added.\n“If we continue with all these bus services, which is certainly the most popular thing to do instead of bus rationalisation, it will translate to higher costs for the entire system and, in turn, higher fares for commuters and a larger burden on taxpayers,” said Mr Chee, who is also Second Finance Minister.\nCalling public transport “a merit good”, where the costs of capital and operating expenditure are not fully recovered, Mr Chee said commuters now enjoy a subsidy of more than $1 per trip.\nHe said that without the Government pumping in large amounts of upfront investments and recurrent subsidies, Singapore would likely have ended up with a less-developed public transport network and higher fares.\nAt present, the authorities shell out more than $2 billion in public transport subsidies yearly.\nAddressing guests from the financial and business community, academia and public sector, Mr Chee laid out three key roles that the Government can play.\nApart from ensuring the adequacy of essential services such as public transport, he said, it has a role in helping Singaporeans adjust to shocks such as the effects of a war or pandemic, and planning ahead of demand.\nOutlining the development of public transport over the years, he noted that buses were seen as “mosquitoes” weaving in and out of traffic in the 1950s, when there were haphazard routes, regular worker strikes and dismal service.\nMr Chee said the Government then took the first step in the 1970s to consolidate the bus industry and tighten regulatory oversight.\nFollowing that, public transport infrastructure continued growing, with more MRT lines built and more buses deployed.\nBut getting the physical infrastructure ready was only the first step, as the ability to keep delivering reliable and high-quality services remains a long-running challenge.\nBy the early 2000s, there were two major public bus operators, with the industry running on a largely privatised model. With concerns about profitability, operators were constrained in upgrading their fleets ahead of demand and plying low-demand routes, he said.\nThat was why the bus contracting model was introduced in 2016, with the Land Transport Authority (LTA) owning bus assets, planning routes and collecting fares, and operators being contracted to run services.\nUnder this hybrid model, private operators are encouraged to deliver high-quality service to compete for contracts and stay profitable.\nThe increased competition spurred operators to improve their efficiency, with average tender prices falling by 15 per cent after five rounds of competitive tendering by LTA, Mr Chee said. This has also translated into improvements in bus service quality and shorter waits for passengers.\nThe Government, as the central planner, has also been able to respond more quickly to evolving needs, he added.\nCiting the launch of the Bus Connectivity Enhancement Programme in July as the latest example, Mr Chee said it will improve access for residential areas that are now less connected and farther from existing transport nodes.\nUnder the programme, up to $900 million will be spent over the next eight years to improve the bus network and support new housing projects launched islandwide.\nMr Chee said that from an economics perspective, it is the correct policy decision to rationalise low-ridership buses that duplicate Singapore’s MRT lines, and reallocate the resources to new estates.\nBut he acknowledged that the Government needs to handle resistance from affected residents who would naturally prefer to have new MRT lines and existing buses if possible.\n“This is why I believe that good economics requires good politics to achieve its desired outcomes,” he said.\nThe Government, he added, needs to have the political courage to “do the right thing”, and the political skill to persuade the majority of voters to support changes so as to roll out “economically sound policies”.\n“And good economic outcomes would, in turn, earn broad-based support for good politics, so we can have a virtuous circle that will benefit our society in the longer run,” he said.", "url": "https://www.straitstimes.com/singapore/trade-offs-between-convenience-affordability-in-public-transport-need-to-be-carefully-managed-chee"}