{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:34:03", "date_modify": "2024-10-12 13:34:03", "date_publish": "2024-08-22 12:00:00", "description": "It will review and raise the standards of the dog training industry in Singapore. Read more at straitstimes.com.", "filename": "singapore_workgroup-set-up-to-look-at-more-humane-ways-of-training-dogs_1728740043.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/22/Dog20on20groundCredit20AVS.jpg?VersionId=4Kso7kehVX5O5PpIz2thZYdq6BVi3RMx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_workgroup-set-up-to-look-at-more-humane-ways-of-training-dogs_1728740043.html", "title": "Workgroup set up to look at more humane ways of training dogs", "title_page": "Workgroup set up to look at more humane ways of training dogs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – There is no need to use physical punishment, intimidation or fear while training a dog to heel.\nInstead, there are more humane ways, for instance, using rewards like food and play to help dogs learn.\nThis and other aspects of training the animals are part of a review to raise the standards of the dog training industry in Singapore by adopting the “least intrusive, minimally aversive”, or Lima, approach.\nThe review will be conducted by a new dog training standard workgroup comprising dog trainers, veterinarians, animal welfare groups and representatives from working dog units.\nThe workgroup is co-chaired by the Animal and Veterinary Service (AVS), which is a cluster of the National Parks Board, and the Society for the Prevention of Cruelty to Animals.\nAmong other aspects, the workgroup will be reviewing the use of various training devices, including shock and prong collars, to develop regulatory frameworks for their uses.\nSpeaking at its launch at the Singapore Botanic Gardens’ Botany Centre on Aug 22, Senior Minister of State for National Development Tan Kiat How told a group of 200 participants, including animal welfare groups, vets and dog trainers, that AVS has identified “no regrets” areas where work has started.\n“For example, we are concerned that aversive training devices like shock and electric collars can be easily purchased online. More worrying is that these devices may not meet recognised international technical standards,” he said.\nIn January 2023, a pet trainer was accused of mishandling a one-year-old golden retriever by using e-collars on the dog.\nThis was after photographs emerged online and on social media of the dog having what looked like bad skin problems. AVS was alerted to a case of alleged dog abuse and carried out investigations.\n“AVS has started engaging pet shops and e-commerce platforms on the sale of such devices and is heartened that some are open to work with us,” said Mr Tan, who is also Senior Minister of State for Digital Development and Information.\nAVS is also reviewing existing scientific research to gain a deeper understanding of the technical aspects of using such training devices, he added.\nSeveral dog trainers, those who use e-collars and those who do not, are included in this workgroup, which will look into the proper use of such devices.\nMs Christine Ho, 38, said she uses an e-collar during her training, but not to instil fear or pain in her canine clients.\n“When I use the collar, it is not to make the dog suffer whenever it misbehaved. The light zap acts like a tap to gain its attention – the same tap when your friend wants to get your attention at a crowded bar,” she added.\nCiting the example of dogs that are sent out to detect alpine bumblebees, Ms Ho said they are sent into wide open spaces to look for the bumblebees that are important pollinators across temperate, alpine and Arctic regions for a range of crops and wild flowers.\n“The e-collar acts as a tap for them to return to base,” she said.\nMs Angie Tan, 48, another dog trainer who is part of the workgroup, however, begged to differ.\n“Those are working dogs,” she said. “For house pets, we should train without visiting pain and fear at all, but with positive reinforcements such as food rewards and play.”\nShe added: “It is similar to parenting styles of old versus parenting styles of today. Today, we no longer use corporal punishment.”\nDr Jim Crosby, a behaviour consultant and professional dog trainer from the United States, said one of the biggest misconceptions when it comes to training dogs is that the trainer or owner has to dominate the dog.\n“Social dominance functions only within a species, so (by) trying to dominate our dogs, they probably perceive that as bullying or threatening with violence. Instead, we want to build a cooperative relationship, and we do not want to compel them to behave,” he said, adding that the dog does not think its owner is “a tall, skinny dog” at all.\nThe first thing on the agenda for the new workgroup is to educate the public on the risks of using aversive training devices to help people make more informed choices about methods of dog training.\nIt will continue with efforts to educate dog trainers, dog owners and the general community on the risks of using such devices, which will help people make more informed choices about their training methods.\nDr Crosby said: “Education, as long as the people are receptive to it, tends to be very successful. But it needs to be coupled with clear communication about the expectations of what people are looking for in the behaviour from their animals.\n“There is the need for regulation to let people know what is proper and what is expected.”", "url": "https://www.straitstimes.com/singapore/workgroup-set-up-to-look-at-more-humane-ways-of-training-dogs"}