{"authors": ["Esther Loi"], "date_download": "2024-10-12 14:20:55", "date_modify": "2024-10-12 14:20:55", "date_publish": "2024-06-24 17:05:43", "description": "It's also \"not feasible\" to lay booms across all of S'pore's waterfronts and coastlines, said the Transport Minister. Read more at straitstimes.com.", "filename": "singapore_transport_booms-around-damaged-vessel-preventive-and-not-to-fence-in-spilt-oil-chee-hong-tat_1728742855.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/24/yaohui-pixoil18-2358.jpg?VersionId=f2NVkNLVyS6MwMCg5Wg3Sr4MRsm84Fea", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_booms-around-damaged-vessel-preventive-and-not-to-fence-in-spilt-oil-chee-hong-tat_1728742855.html", "title": "Booms around damaged vessel ‘preventive’, not meant to fence in spilt oil: Chee Hong Tat", "title_page": "Booms around damaged vessel ‘preventive’, not meant to fence in spilt oil: Chee Hong Tat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The containment booms laid around a damaged vessel at Pasir Panjang Terminal were not intended to “fence in” the oil that had been spilt, but rather were “preventive” in nature against any further spillage from the vessel, said Transport Minister Chee Hong Tat on June 24.\nA cargo tank on Singapore-flagged bunker vessel Marine Honour was damaged after the vessel was hit by Netherlands-flagged dredging boat Vox Maxima, causing 400 tonnes of oil to leak into the sea at about 2.20pm on June 14.\nSpeaking at a press conference on June 24 to give updates on the cleanup, Mr Chee said the response times by the Maritime and Port Authority of Singapore (MPA) and its contractor, T&T Salvage Asia, were in line with international industry practices.\nAfter MPA was alerted to the incident at 2.22pm on June 14, its first patrol craft arrived at the site at 2.33pm.\nMr Chee said the patrol craft sprayed dispersants on the oil sheens after confirming that oil had spilt into the water. Dispersants break down the oil to pave the way for subsequent cleaning operations at sea and on land, before the oil hardens over time and becomes tougher to remove.\nAfter the first patrol craft was deployed, MPA and its contractors sent 11 more vessels to help with spraying dispersants and monitoring oil slicks, Mr Chee added.\nMPA also ensured the crew were safe and no further oil would be spilt after the initial gush, and confirmed the vessel would not sink, added Mr Chee.\nThe authority then activated T&T, whose boss was contacted at 2.55pm, to lay booms around the site.\nThe Straits Times reported on June 22 that it took several hours for T&T to mobilise truckloads of gear from its warehouse in Tuas, send them across to Marina South Pier, and determine if it was safe to lay the booms around the ship.\nNight-time conditions and bad weather were among the reasons cited for why it took longer to deploy the booms.\nEach 3m section of the booms weighed more than 100kg when inflated.\nT&T finished laying 200m of booms around Marine Honour at 5.15am on June 15 – nearly 15 hours after the incident.\nMr Chee said: “During this time, we must expect a significant amount of the oil that has been spilt into the sea to be carried by tidal currents and waves to other locations away from the incident site.\n“This is unavoidable, especially during more serious oil spill incidents, like what we experienced on June 14.”\nThe containment booms, he added, can help to catch some of the oil that remained near the incident site and did not float elsewhere.\n“But this is also not 100 per cent foolproof because the tidal currents and waves can carry the oil... below or above the booms,” said Mr Chee.\nOn why preventive booms were not laid across all of Singapore’s waterfronts and coastlines, Mr Chee said it is “not feasible” to deploy booms across the country’s entire coastline.\nDeploying booms across the entire southern coastline of Singapore from Pasir Panjang to East Coast would require more than 46km of booms, he added.\nMr Chee also noted that booms would require regular maintenance and replacement, as they are subject to weather conditions and wave movements, and can snap.\nReplying to a question on possible improvements to response times, Mr Chee said the immediate priority for MPA’s response was to ensure that the vessel was safe and no further oil leaked from the damaged tank.\nContainment booms are floating devices that create a barrier to trap oil.\nIn all, more than 3,400m of booms have been laid to help contain trapped oil from flowing back into the sea, and prevent oil remnants from being washed ashore and into Singapore’s inland canals.\nFor instance, 1,500m of booms were deployed at the three beaches on Sentosa island, the entrance of Keppel Bay Marina, off Labrador Nature Reserve, East Coast Park and West Coast Park as at June 17.\nOn June 24, ST reported that a captain with nearly 30 years of sailing experience had suggested placing containment booms around ships at anchorages as a preventive measure.\nThis is done at some ports in the United States and Netherlands.\nResponding to a question about the captain’s suggestion, Mr Chee said: “Based on our checks with industry players, they don’t think this is practical or feasible. It is also not practised in other major ports around the world.”\nAs there are 1,000 vessels in Singapore’s port at any time, he noted that it would take a lot of time and money to deploy booms as a pre-emptive measure.\nHe added that these booms have to be kept whenever ships leave the port, or may cause navigational safety concerns to vessel traffic if they snap or float away.\nHence, he said these booms are used only as preventive measures when there are problems such as oil spills.", "url": "https://www.straitstimes.com/singapore/transport/booms-around-damaged-vessel-preventive-and-not-to-fence-in-spilt-oil-chee-hong-tat"}