{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 14:21:21", "date_modify": "2024-10-12 14:21:21", "date_publish": "2023-11-10 20:50:00", "description": "Acting Transport Minister Chee Hong Tat flagged higher costs for airlines and passengers from use of sustainable jet fuel. Read more at straitstimes.com.", "filename": "singapore_transport_asia-pacific-airlines-including-sia-aim-for-cleaner-jet-fuel-to-form-5-of-consumption-by-2030_1728742881.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/11/file7lrb1nhzgcof9n22akl.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_asia-pacific-airlines-including-sia-aim-for-cleaner-jet-fuel-to-form-5-of-consumption-by-2030_1728742881.html", "title": "Asia-Pacific airlines, including SIA, aim for cleaner jet fuel to form 5% of consumption by 2030", "title_page": "Asia-Pacific airlines, including SIA, aim for cleaner jet fuel to form 5% of consumption by 2030 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - For the first time, the leaders of the 14 airlines that form the Association of Asia-Pacific Airlines (AAPA), including Singapore Airlines (SIA), have pledged to strive towards a target of 5 per cent sustainable aviation fuel use by 2030.\nThis is a collective, “aspirational” target, said AAPA director-general Subhas Menon on Friday at a meeting of the association’s senior airline executives, held at the Mandarin Oriental, Singapore.\nThis means that some airlines in the association may end up using a higher mix of sustainable jet fuel than others.\nCathay Pacific, an AAPA member, has set its own target for sustainable jet fuel to make up 10 per cent of its fuel consumption by 2030.\nSIA chief executive Goh Choon Phong was coy about the flag carrier’s plans for using greener fuel. The carrier and its budget arm Scoot recently conducted a 20-month trial, which they said has shown that Singapore is operationally ready to make the switch.\n“In order to meet whatever percentage of (sustainable fuel) the association has committed to, you will need the supply to be there,” Mr Goh said.\n“We would like to see how supply can be encouraged, but we are not making any decision on how we are going to facilitate that. I think it’s premature.”\nCurrently, the supply of sustainable aviation fuel globally is less than 1 per cent of prevailing demand.\nMr Menon said the reason the AAPA is setting this 5 per cent target is to “wake the oil majors from their slumber”.\n“They are telling us that if they do not have an indication of demand, (they) can’t start producing sustainable aviation fuel. So... we are putting it out there,” he added.\nThe AAPA’s target is similar to what others have set. Europe, for instance, has set a target for fuel suppliers to ensure that 6 per cent of jet fuel made available at European airports is sustainable, with this rising gradually to 70 per cent by 2050.\nJapan aims to have airlines replace 10 per cent of the fuel they use at Japanese airports with eco-friendly alternatives by 2030.\nAt the AAPA meeting, Singapore’s Acting Transport Minister Chee Hong Tat said the city-state cannot single-mindedly pursue environmental sustainability within the aviation sector without considering the significant cost impact this will have on the industry.\nBut it is also untenable for airlines to continue as usual without looking for greener ways of operating, he added, outlining the trade-offs that the Government is weighing before it announces its strategy on increasing the use of eco-friendly jet fuels here.\nThis strategy may include making greener fuels, which cost three to five times the price of regular jet fuel, mandatory for flights departing Singapore.\nThe other options include providing incentives for using greener fuel, or a combination of mandates and incentives.\nRight now, most of it is made from materials such as used cooking oil and waste animal fat, but Mr Chee highlighted the need to continue investing in research and development of other methods, like using algae.\nThe airline chiefs spoke about other ways by which they are making their flights more environmentally friendly.\nCathay Pacific chief executive Ronald Lam said there will be higher expectations from passengers on sustainability, and one focus for the airline is reducing single-use plastics.\nThai Airways chief executive Chai Eamsiri said that from December, its crew will dress in attire largely made from recycled plastic. About 80 per cent of the items in the airline’s new amenity kits are biodegradable.\nBut for Air India, the majority of its customers do not place sustainability as their highest priority, said the airline’s chief executive Campbell Wilson.\nHe added: “Not every country is at the same stage of development. Not every country can afford the actions that, for example, Singapore has taken.”", "url": "https://www.straitstimes.com/singapore/transport/asia-pacific-airlines-including-sia-aim-for-cleaner-jet-fuel-to-form-5-of-consumption-by-2030"}