{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 13:53:39", "date_modify": "2024-10-12 13:53:39", "date_publish": "2023-10-04 18:30:00", "description": "Gan Siow Huang says legislation will hurt businesses and workers and other initiatives will support families. Read more at straitstimes.com.", "filename": "singapore_politics_mp-louis-chua-calls-for-flexible-work-arrangements-to-be-enshrined-into-law-gan-siow-huang-cautions-against-rigid-solutions_1728741219.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/04/IMG3583.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_mp-louis-chua-calls-for-flexible-work-arrangements-to-be-enshrined-into-law-gan-siow-huang-cautions-against-rigid-solutions_1728741219.html", "title": "Workers’ Party’s Louis Chua seeks to enshrine flexi-work arrangements into law", "title_page": "Workers’ Party’s Louis Chua seeks to enshrine flexi-work arrangements into law | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Enshrining flexible work arrangements (FWAs) into law and giving all workers the right to such arrangements were some of the proposals Workers’ Party MP Louis Chua (Sengkang GRC) made in an adjournment motion on Wednesday.\nThere is currently no legal imperative for employers to offer FWAs, and going beyond non-binding advisories and guidelines with legislation would protect groups of workers such as parents, caregivers and people with disabilities, said Mr Chua.\n“We cannot expect incremental efforts to result in extraordinary results.\n“We need to take bold and decisive steps and provide greater financial and non-financial support to Singaporean families, recognising that the stresses on families and the TFR (total fertility rate) crisis of generations, if not urgently addressed today, would have significant long-term socio-economic cost to Singapore.”\nHe highlighted the trend of some employers insisting employees return to the office after the Covid-19 pandemic restrictions were lifted despite the popularity of flexi-work.\nHe cited the record-low TFR of 1.04 in 2022, with polls showing that 39 per cent of respondents did not want to have a child as it would affect their career and lifestyle.\nMany respondents also said that job stress and their workload stopped them from having children.\nMr Chua added that six days of childcare leave were insufficient to deal with the scheduled closures of some of his residents’ children’s pre-schools.\nParents also need time off to care for their children when they fall sick.\nHe also pointed to the burden on caregivers of ageing parents.\nA 2023 study has found that the average caregiver holds a full-time job, and spends 6.7 hours per day on caregiving, he said.\nClear action must be taken to prohibit employers from discriminating against employees based on their caregiving and family duties, and for workers’ performance to be assessed fairly, regardless of whether they take up FWAs or not, he added.\n“This would play a big role in helping to address fears of workers, particularly women at this point in time, on the downside they may face in taking up FWAs to take up caregiving responsibilities.”\nFor persons with disabilities (PWDs), the right to flexible work arrangements would help to advance their careers while encouraging more of the 65.7 per cent of PWDs who are not working to do so, he said.\nHe cited jurisdictions such as Britain, Australia, the Philippines and Thailand that have passed legislation governing the right to request FWAs, or provide for a legal framework to support the rights of employees under FWAs.\n“Even if ultimately, the employer decides in a fair and transparent manner that this is simply not possible for various reasons, such circumstances can be addressed through the necessary legislative protections for both employers and especially employees,” he said.\nFor FWAs to be sustainable, the impact on individual and team productivity must also be considered, Ms Gan said, adding that international research found that the impact on productivity differs across sectors and job roles.\n“The key is to make sure that we identify the right forms of flexible work arrangements for different job needs, and ensure that communication between management and employees and within teams remains strong. There’s just no one-size-fits-all approach for this.”\nMs Gan noted that FWAs, if implemented well, can help companies retain and attract workers amid a tight labour market.\nTurning FWAs into something rigid, however, could be detrimental to businesses and even to workers themselves.\nShe added: “Flexible work arrangement on its own is not the silver bullet to achieving the larger goal of work-life harmony.\n“It is merely one aspect of a more supportive ecosystem that we seek to build in helping employees manage both their work and family responsibilities.”\nShe stressed the importance of other initiatives, such as subsidised care services and caregiver support networks.\nMs Gan said tripartite guidelines will be introduced in 2024 on how employees can request FWAs, and how employers can manage such requests properly and fairly.\nThe tripartite workgroup will study international practices and consult employers, human resource practitioners and employees in the next few months as it formulates the guidelines, she said.", "url": "https://www.straitstimes.com/singapore/politics/mp-louis-chua-calls-for-flexible-work-arrangements-to-be-enshrined-into-law-gan-siow-huang-cautions-against-rigid-solutions"}