{"authors": ["Salma Khalik"], "date_download": "2024-10-12 13:54:42", "date_modify": "2024-10-12 13:54:42", "date_publish": "2023-07-17 05:00:00", "description": "Health Sciences Authority says doctors here may apply for use on a named patient basis. Read more at straitstimes.com.", "filename": "singapore_new-us-approved-drug-for-early-stage-alzheimer-s-disease-not-yet-available-here_1728741282.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/17/2023-07-11T071524Z66714237RC2ND1A1JGTPRTRMADP3EISAI-EXECUTIVE_4.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_new-us-approved-drug-for-early-stage-alzheimer-s-disease-not-yet-available-here_1728741282.html", "title": "Doctors can bring in new US-approved drug for early-stage Alzheimer’s disease", "title_page": "Doctors can bring in new US-approved drug for early-stage Alzheimer’s disease | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The United States earlier in July became the first country to approve a new drug called lecanemab, which has shown it can slow the progression of Alzheimer’s disease. It is the first drug to treat Alzheimer’s – a common form of dementia – to gain approval.\nAlthough the drug has yet to be approved by local regulator, the Health Sciences Authority (HSA), its spokesman said doctors may request to bring in the drug, and two have already done so.\nThe US approval for the drug has some experts happy and others concerned.\nSome neurologists hail lecanemab as it is the first drug capable of slowing the disease, giving patients more good years. Others point to the drug’s small gains – it slows but does not even halve the progression of the disease – against its potential risks, including death. Studies showed it slowed the progression of the disease by 27 per cent over 18 months.\nThe HSA told The Straits Times that doctors who want to use it for their patients can bring lecanemab in on a named patient basis.\n“Where there is an unmet medical need, clinicians may exercise professional judgment and apply to the HSA via the special access route to bring in an unregistered therapeutic product for use on patients under their care, if clinically justified,” HSA said. It has already approved two applications by clinicians to bring the drug in via this route.\nLecanemab, which costs about US$26,500 (S$35,200) a year in the US, and is administered as an intravenous infusion every fortnight, carries a “black box” warning highlighting the major risks. It should not be used by patients on blood thinners, those having clotting disorders or seizures, or those who had a stroke.\nAssociate Professor Adeline Ng, a senior neurologist at the National Neuroscience Institute, calls the drug a “positive step forward in the treatment of dementia”, as current treatments are able to treat only the symptoms such as language difficulties, sleep disturbances or poor attention.\nShe said: “Lecanemab removes beta-amyloid plaques from the brain, and this has been shown to reduce cognitive decline in people with mild cognitive impairment (pre-dementia) or in early stages of Alzheimer’s disease with mild symptoms.”\nBeta-amyloid plaques, she explained, are a hallmark of Alzheimer’s disease. They are tangles of protein that form at the junction of nerve cells, thereby disrupting the flow of information in the brain.\nMost dementia patients here are diagnosed at age 65 years and older, with three out of five suffering from Alzheimer’s, one of several forms of dementia. Other forms include vascular dementia and fronto-temporal dementia.\nLecanemab is effective only for those with Alzheimer’s.\nAn estimated 80,000 people here have dementia, with the number expected to increase to 100,000 by 2030. Aside from memory loss, dementia can cause personality changes, poor time management and language problems.\nProf Ng added: “It is a chronic condition that gets worse over time, increasingly affecting a person’s ability to think and function, resulting in loss of independence until they are fully dependent on care.”\nAssociate Professor Christopher Chen, director of the Memory, Ageing and Cognition Centre at the National University Health System, said: “Alzheimer’s disease is devastating for patients and their families, hence a treatment that is effective and safe in delaying progression would be most welcome.”\nHe was involved in the global clinical trial of lecanemab where 1,795 patients were given the drug or a placebo over 18 months. Among them were 13 patients from the National University Hospital (NUH).\nIn a statement by NUH in December 2022, Prof Chen said: “What we want to do for Alzheimer’s patients is to slow or even halt the progression of their disease, so that it is possible for them to enjoy a good quality of life whilst living with Alzheimer’s for many years.”\nDr Tauqeer Ahmad, a neurologist at Gleneagles Hospital, is just as enthusiastic about lecanemab, as there is currently no “definite treatment” for the debilitating disease.\n“Yes, we as neurologists are very excited with the new drug coming in to the market,” he said. The disease can progress quite quickly, he said, in a matter of six to 12 months.", "url": "https://www.straitstimes.com/singapore/new-us-approved-drug-for-early-stage-alzheimer-s-disease-not-yet-available-here"}