{"authors": ["Leow Wen Xuan"], "date_download": "2024-10-12 13:48:36", "date_modify": "2024-10-12 13:48:36", "date_publish": "2024-04-15 23:45:00", "description": "Philanthropy should incentivise states willing to put \"big money\" on solutions, said WEF president Borge Brende. Read more at straitstimes.com.", "filename": "singapore_philanthropy-cannot-be-the-only-key-to-tackling-global-challenges-panel_1728740916.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/2024041542484127dsc7890.jpg?VersionId=_4p3GvJzshsr_D9gbon.bynMNtZtQSHA", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_philanthropy-cannot-be-the-only-key-to-tackling-global-challenges-panel_1728740916.html", "title": "Philanthropy cannot be the only key to tackling global challenges: Panel", "title_page": "Philanthropy cannot be the only key to tackling global challenges: Panel | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Philanthropy alone cannot tackle the world’s challenges, such as a lack of access to quality healthcare and education.\nFor solutions to be scaled up and sustainable, they must be accompanied by the right policies and impact investments, said panellists at the Philanthropy Asia Summit 2024 on April 15.\nPhilanthropic capital works best when it can influence and spur the development of public policies and lead to an increase in responsible and economic growth, said panellist Borge Brende, president of the World Economic Forum.\n“Philanthropy can have a huge impact on how countries implement the right policies for them to double down on investments in education, in health, and also taking care of their nature,” he said.\nThe discussion, moderated by The Straits Times editor Jaime Ho, explored the role of philanthropy in tackling healthcare disparities and a lack of access to quality education.\nDuring the conversation, the five panellists also agreed that philanthropy has to go hand-in-hand with impact investments, which are aimed at generating a positive social and environmental impact alongside a financial return.\nMr Jaime Augusto Zobel de Ayala, chairman of Philippine conglomerate Ayala Corporation, said his company established a philanthropic initiative that leveraged solar power and online learning to provide higher levels of schooling to island communities that often lack access to quality education.\nBut he pointed out that there is a limit to how far philanthropy can go.\n“Philanthropy has a role to play at the learning stage and understanding where the pain points are. But then, I believe, impact investing is needed as a follow-on from that, to be able to create the kind of sustainable financial structure that will then lead to growth,” he said.\nMr Brende said tackling global challenges like the lack of healthcare and education and climate change requires the 4Ps model of public-private-philanthropic partnerships.\nBut philanthropy will not be the biggest investor for health, education and climate change solutions, even though it plays a crucial role by complementing government spending and foreign aid to fund social projects.\nOne example was how the Bill and Melinda Gates Foundation funded the development and production of new treatments and vaccines for Covid-19. And that led governments of developing countries to channel more resources into healthcare.\nMr Brende said that for philanthropy to bring about real change, countries have to allocate resources efficiently. He highlighted how some developing countries allocate a large portion of their budget goes to defence but a very small percentage goes to healthcare.\nPhilanthropic capital will have a larger impact when accompanied by the right policies to ensure that change is effective and sustained, Mr Brende added.\n“We are willing to be a partner with you. But then you have to start to collect taxes (from the well-to-do), you have to get rid of corruption, and you have to use your money on what is very important in your society – your young people, health and what really matters.”\nThe panel – which also included Dr Zhang Ya-Qin, chair professor and dean of the Institute for AI Industry Research in Tsinghua University, and Mr Ashish Dhawan, founder-CEO of Indian philanthropic organisation The Convergence Foundation – agreed that international collaboration is crucial to achieve large-scale impacts.\nDr Regina Dugan, president and chief executive of Wellcome Leap, a charitable foundation focused on health research, said philanthropy tends to be fragmented.\n“If we want some of these catalytic effects, we have to work together effectively”, as global challenges are not going to be solved “within the boundaries of the map of the world”.\nMr Zobel de Ayala added: “Nation states are educated to compete. We’re all trying to gain a competitive advantage for ourselves or our countries.”\nBut when it comes to global issues like climate change and healthcare, he said: “We have to learn a new skill, which is how to build trust with each other and come together at key moments to address issues that are bigger than all of us.”\nMr Brende said that for solutions to climate change, healthcare and education to be scaled up and sustainable, philanthropy capital should incentivise countries and states willing to collaborate and put “big money on it”.\nCorrection note: This article has been updated for accuracy.", "url": "https://www.straitstimes.com/singapore/philanthropy-cannot-be-the-only-key-to-tackling-global-challenges-panel"}