{"authors": ["Osmond Chia"], "date_download": "2024-10-12 13:29:54", "date_modify": "2024-10-12 13:29:54", "date_publish": "2021-12-13 06:00:00", "description": "Some smokers thought they were saving money by buying duty-unpaid cigarettes online or from peddlers, but ended up paying a much higher price when the long arm of the law reached out to knock on their doors. Read more at straitstimes.com.", "filename": "singapore_courts-crime_illegal-cigarette-buyers-caught-red-handed-by-customs-officers-posing-as_1728739794.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/12/11/md_sgofficer1_111221.jpg?VersionId=vF5qIKwpq3n7rDRpYkMk5bg35364ggs7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_illegal-cigarette-buyers-caught-red-handed-by-customs-officers-posing-as_1728739794.html", "title": "Illegal cigarette buyers caught red-handed by Customs officers posing as deliverymen", "title_page": "Illegal cigarette buyers caught red-handed by Customs officers posing as deliverymen | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Some smokers thought they were saving money by buying duty-unpaid cigarettes online or from peddlers, but ended up paying a much higher price when the long arm of the law reached out to knock on their doors.\nOne of these buyers, a security officer, 33, opened the door to his Bukit Batok flat to receive a parcel of contraband cigarettes that he had ordered online.\nBut the Singaporean was stunned to be met by officers from Singapore Customs, who posed as deliverymen to catch such buyers.\nHe is said to have ordered illicit cigarettes several times in the past, but this time, Customs found at his home more than five tins containing 250 sticks in total.\nHe was one of 15 buyers caught red-handed on Dec 7 to 8 during an islandwide crackdown at about 30 locations to catch those who bought duty-unpaid cigarettes through e-commerce platforms or through peddlers at heavy-vehicle carparks.\nTwo of these buyers were arrested, and another 13 Singaporean men, aged between 21 and 59, were fined between $500 and $5,000.\nOn e-commerce platforms, duty-unpaid cigarettes are usually listed at half the price of those legally sold behind the counter.\nThese sellers illegally evade Customs duty that is calculated based on the number and weight of each stick, and taxes.\nCustoms officers seized a total of 4,137 sticks of cigarettes during the sting, translating into almost $2,800 of levies evaded.\nThe Straits Times followed Customs officers to several locations in the West on Tuesday (Dec 7), including the home of the security officer who was arrested and later released on bail.\nBelieved to be from Indonesia, his parcel was detected by the Immigration and Checkpoints Authority and handed over to Customs officers, who posed as deliverymen.\nThe buyer was arrested after accepting the parcel, due to the larger quantity of illicit cigarettes he had purchased.\nAmid the pandemic, smokers have turned to e-commerce platforms and online dealers instead of street peddlers to obtain duty-unpaid cigarettes, said Singapore Customs after the sting.", "url": "https://www.straitstimes.com/singapore/courts-crime/illegal-cigarette-buyers-caught-red-handed-by-customs-officers-posing-as"}