{"authors": ["Sarah Koh"], "date_download": "2024-10-12 13:33:09", "date_modify": "2024-10-12 13:33:09", "date_publish": "2023-05-13 16:20:00", "description": "The fire involved the contents of a car porch on the first floor of a house, said SCDF. Read more at straitstimes.com.", "filename": "singapore_charging-of-buggy-suspected-to-have-led-to-fire-at-sentosa-cove-house_1728739989.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/13/sv-fire-130523_13.jpg?VersionId=QFPM0NezH9MW..uF0XqDEhAWQRbUYMYp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_charging-of-buggy-suspected-to-have-led-to-fire-at-sentosa-cove-house_1728739989.html", "title": "Charging of buggy suspected to have led to fire at Sentosa Cove house", "title_page": "Charging of buggy suspected to have led to fire at Sentosa Cove house | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The car porch of a house in Sentosa Cove was engulfed in flames on Friday evening, with the fire suspected to have started from a buggy that was being charged.\nIn response to queries, the Singapore Civil Defence Force (SCDF) said it was alerted to the fire at 12 Cove Way at about 6.50pm.\nChinese evening daily Shin Min Daily News reported on Saturday that a maid who works in the area said she saw the buggy being charged before it caught fire. The maid declined to be named.\nThe fire then spread to a nearby Porsche sports car.\nA passer-by who gave her name as Ms Lee, 35, said she was walking around the neighbourhood when she heard an explosion and saw smoke and flames coming from the affected house, the Shin Min report said.\nSCDF said the fire was extinguished with two water jets, and added that the fire involved the contents of a car porch on the first floor, outside the unit.\nTwo people managed to get out of the unit before SCDF officers arrived, and there were no reported injuries.\nAn investigation is under way to find out the cause of the fire.", "url": "https://www.straitstimes.com/singapore/charging-of-buggy-suspected-to-have-led-to-fire-at-sentosa-cove-house"}