{"authors": ["Wong Pei Ting"], "date_download": "2024-10-12 13:40:21", "date_modify": "2024-10-12 13:40:21", "date_publish": "2024-06-22 18:00:00", "description": "Observers raised questions about the possible motivations of the party's network of Friends. Read more at straitstimes.com.", "filename": "singapore_influencers-cause-champions-businessmen-the-new-friends-of-the-pap_1728740421.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/22/image002.jpg?VersionId=OTJEdXN0OxNJvnY7yX.8zEf4jXKea9a9&h=1a6a415b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_influencers-cause-champions-businessmen-the-new-friends-of-the-pap_1728740421.html", "title": "Influencers, cause champions, businessmen: The new Friends of the PAP", "title_page": "Influencers, cause champions, businessmen: The new Friends of the PAP | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Call it the star power of their guests. The continuing chatter around the ruling People’s Action Party’s (PAP) Refresh PAP event at the Marina Bay Sands Expo and Convention Centre on June 8 was not about the new blood spotted in its ranks, but the identities of some 140 non-members in the 400-strong crowd.\nAnalysts and observers interpreted the party’s efforts to grow the group, known as the Friends of the PAP, as an extension of its longstanding practice of co-opting like-minded individuals and entities into its cause.\nBut they detected something different this time round – a sense that the PAP is leaning on those Friends, who are social media influencers, as a strategy to reach a wider, decidedly younger audience.\nWhile business owners and people active in community dialogues were also among the group not wearing the party colours of white on white on June 8, it was these content creators that seized the limelight.\nStar-studded cast\nTikTokers seen taking photos and interacting with Prime Minister Lawrence Wong and various ministers included SGAG senior content strategist Amy Ang of “Chinese teacher” fame; Mr Simon Khung, better known as Simonboy; and Mr Tommy Wong, who is known by his online moniker TommyNBCB.\nMs Ang is a 20-year-old bilingual content creator with more than 150,000 followers on TikTok, while Mr Khung is a full-time content creator with close to 200,000 followers on the video sharing platform. Mr Wong, who also founded the Nothing But Cheeseburgers burger chain, has some 96,000 followers on TikTok.\nMr Wong had recently taken part in a Drug Victims Remembrance Day panel discussion, organised as part of the Central Narcotics Bureau’s drug-free campaign.\nAlso at the Refresh PAP event was Mr Royal Pek, the co-founder of food kiosk Xian Dan Chao Ren, who posted an Instagram story saying “Today wear white”.\nTwo former content creators with new media company SGAG, Ms Nadia Ongkowidjaja and Mr Fauzi Azzhar, who have branched out to produce their own content, were also spotted.\nMs Maureen Ow, the food blogger personality who is behind Miss Tam Chiak, was there as well, alongside hawker champion Melvin Chew, who runs Jin Ji Teochew Braised Duck, and former Chinese radio DJ Tan Yan Wei, who is the current face of a YouTube channel called Guai Ka Outcast.\nNoonTalk Media boss Dasmond Koh and one of his artistes, Yang Yan, also made an appearance, along with actresses Ann Kok and Michelle Tay.\nHe said he does not know how his content would change with his association with the PAP, but added: “I will let my creativity flow freely and see where it will take me in future.”\n“PM Wong mentioned he wanted to hear about the voices from the mass audience and also the younger generation, which I think is very important. I find it very relatable and current that he is going to spread the message through social media, which is my trade,” he added.\nThe two Friends put forward by the party to take media interviews on June 8 were Pulse TCM founder Nicholas Poh and Ms Joanna Goy, the founder of Singapore Lactation Bakes.\nPrior to being Friends, Ms Goy spoke as a panellist at the PAP Women’s Wing’s International Women’s Day event this year, while Pulse TCM supported the PAP on its healthcare initiatives with the community.\nIn May, Pulse TCM was seen participating in a free community health screening event in Bukit Gombak.\nEarlier that month, the Women’s Wing had engaged Pulse TCM to conduct a mindful herbal tea making workshop to celebrate Mother’s Day with its members.\nMr Poh said he became a Friend to tap the PAP’s reach to “accelerate” that of his company in the wider community. “It basically accelerates the reach because they are very strong community-wise, so we can go from Gombak to another GRC, (and) to another GRC.”\nMs Goy said she felt a strong connection with the PAP after learning that the party holds many small events targeted at women, including distributing baby products to those in need.\nThe overtones of a profit or business motive prompted observers to raise questions about the possible motivations of PAP’s network of Friends.\nThe last high-profile mention of this network was in 2002, when then Prime Minister and PAP secretary-general Goh Chok Tong announced an intention to widen the Friends circle, which mostly consisted of “establishment figures” from both the public and private sectors, to target Singaporeans below 40 with a scheme called “Young Friends of the PAP”.\nThe move then was meant to improve the “quality” of PAP’s membership as part of a similar bid to “refresh” the party. Since then, however, the network has fallen out of the public consciousness.\nThe party did not respond to other questions about the network, including whether it remains by invite only and what the rules of engagement for Friends are. It noted only that the Friends, together with the party’s partners, contribute time, resources and expertise to its efforts.\nOne issue that the PAP should be careful about is the profit motive, said Associate Professor Eugene Tan of the Singapore Management University, who holds courses on business ethics and corporate governance.\n“If some Friends of the PAP are driven by pecuniary concerns, then that makes them no different from being a paid agent, a hired gun,” he said.\n“If so, that would also raise legitimate questions about what is the ‘common cause’ for the PAP and these individuals or entities.”\nThe Friends of the PAP have been described as a network of people prepared to make “common cause” with the party.\nBut this cause cannot be about a ‘win-win’ proposition because “if there are pecuniary benefits to be gained by the Friends in exchange for their support of the PAP, then this makes the Friends of the PAP a quasi-commercial enterprise”, Prof Tan warned.\nMore than that, it will severely undercut the party’s intent to be “a broader tent” and a “pan-national movement”, he added. “Instead, it could be seen as using its financial wherewithal in political advertising.”\nNew media and digital civics researcher Natalie Pang from the National University of Singapore said that as more influencers are roped in as Friends, the best practice is to make it clear upfront when a certain piece of content has been paid for.\nShe also noted that if influencers enter into a business relationship with a political party, they could subsequently feel obliged to endorse and agree with the party or candidates who have paid them.\nGiven these potential conflicts of interest, she thinks it is good for influencers to be transparent about their political affiliations.\nEven so, influencers’ voluntary disclosure could backfire on them when they touch upon sensitive topics or endorse low-quality products, said Associate Professor Lou Chen of Nanyang Technological University’s Wee Kim Wee School of Communication and Information.\nOn the flip side, a political party’s involvement with influencers could also put it at risk as unforeseen personal scandals could affect its credibility, she added.\nAgreeing, Prof Tan said the PAP will have to be very careful about personalities, content creators or influencers beating the party drum.\n“If their messages are not aligned with that of the PAP, and even if the party distances itself from them, there will be collateral damage to the PAP because the perception would have been that these individuals or messages are representative of the PAP’s position,” he said.\nHe believes that these Friends’ support will go further if there is clarity as to how they are involved with the PAP.\nPerspective of a Friend\nMr Jeremiah Decosta, vice-president of operations at local biotech company Mirxes, reconciled this tension by being well aware of the need to be clear about what role and capacity he acts in.\n“Professional and party – I recognise that these two run in parallel, and it takes some maturity to handle any potential synergies,” he said.\nIt was only three months ago that he first came across the “Friends of the PAP” term, he let on.\nDuring a dialogue session held in March, then Deputy Prime Minister Lawrence Wong broached the concept of being a Friend to dozens of people gathered at the PAP headquarters and asked them to help build Singapore with the ruling party. Mr Decosta signed up as a Friend after this dialogue.\nFast forward to today, Mr Wong is now prime minister while Mr Decosta is in the process of transitioning from Friend to member status, having just handed in his application to join the party on June 10, two days after attending the Refresh PAP event at Marina Bay Sands.\nTo Mr Decosta, 39, a Friend and a member are different in that a Friend supports the PAP as an external party, while a member goes on to develop a personal level of commitment towards party causes “because you believe in something”. With all the paperwork done, he is now waiting to receive his party card.\nMr Decosta said his company, a spin-off from the Agency for Science, Technology and Research, has always maintained a close relationship with the Ministry of Trade and Industry and its statutory boards, being a recipient of various grants under Enterprise Singapore.\nMore than a year ago, Senior Minister of State for Trade and Industry Low Yen Ling, who is also an MP for Chua Chu Kang GRC, invited Mirxes to engage Bukit Gombak residents as part of its corporate social responsibility efforts. The company leapt at the opportunity.\n“The Government helped Mirxes grow, so the company had always been intent on giving back to benefit Singaporeans,” Mr Decosta told ST.\nHis decision to join the party was a personal one, however. “I found that there was perfect synergy between personal, professional and party beliefs,” he said, adding that the alignment did not happen immediately but over time.", "url": "https://www.straitstimes.com/singapore/influencers-cause-champions-businessmen-the-new-friends-of-the-pap"}