{"authors": ["Shabana Begum"], "date_download": "2024-10-12 14:00:03", "date_modify": "2024-10-12 14:00:03", "date_publish": "2024-03-18 16:45:00", "description": "Rising temperatures could further reduce S'pore’s fertility rate, which dipped to below 1 in 2023. Read more at straitstimes.com.", "filename": "singapore_extreme-heat-affects-men-s-fertility-and-birth-outcomes-nus-study_1728741603.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/18/202403186712429387b958a7-1319-41f6-afa7-14a70549c9a4.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_extreme-heat-affects-men-s-fertility-and-birth-outcomes-nus-study_1728741603.html", "title": "Extreme heat affects men’s fertility and birth outcomes: NUS study", "title_page": "Extreme heat affects men’s fertility and birth outcomes: NUS study | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Punishing hot weather affects not only a person’s health or work productivity but also affects couples’ fertility and birth outcomes, a project by the National University of Singapore (NUS) found.\nRising temperatures could further reduce Singapore’s resident total fertility rate, which dipped below 1 – a record low – in 2023. The rate refers to the average number of babies each woman would have during her reproductive years.\nResearchers from the NUS Yong Loo Lin School of Medicine studied sperm samples from 818 men that were already stored at the National University Hospital’s (NUH) andrology section.\nThe scientists then traced the men’s exposure to extreme heat – or when a day’s average temperature exceeds 29.8 deg C – by looking at weather records 90 days before they provided semen samples at NUH.\nThe team found that those who were exposed to extreme heat during the three months had a 46 per cent higher risk of low sperm count, and a 40 per cent increased risk of low sperm concentration. The reproductive cells were also found to be less motile and more sluggish.\nThese findings were more pronounced for men between the ages of 25 and 35, who tend to be at the stage of entering fatherhood, said research fellow Samuel Gunther, one of the researchers in the team.\nThe fertility and heat research is part of Project HeatSafe, which brings together several studies and fieldwork by NUS researchers and partners over 3½ years to investigate how rising temperatures affect the health and productivity of people here and in the region – with a focus on outdoor workers.\n“Conventionally, findings suggest that sperm quality decreases as one ages, but what we found in this study was that it was men in their (prime) reproductive time between 25 and 35 who were the most impacted by heat,” said Dr Gunther at a media briefing on March 18, where Project HeatSafe researchers gave a round-up of their projects.\n“So just because you’re a young male, don’t think you’re invincible, and don’t think you’re not also vulnerable to these impacts. Moving forward, the climate is going to get hotter. And that is also something that we need to bear in mind in family planning.”\nGiven the low fertility rate in Singapore, the researchers advised men who are planning to conceive in one to three months to avoid going outdoors on extremely hot days and to sleep in cooler environments.\nThey should also avoid saunas, hot baths and tight underwear during that period.\nThe 818 sperm samples came from men who had issues with conceiving, and a small portion of them were patients undergoing chemotherapy who wanted to preserve their sperm.\nHeat is known to affect reproductive cells – it can lower sperm count and motility, and affect women’s ovulation cycle and egg quality.\nHowever, the links between extreme heat and fertility have not been well studied in tropical countries such as Singapore, added Dr Gunther.\nWhile some may say the 818 men came from a biased group, the study was about linking sperm quality with heat exposure, said Associate Professor Chan Shiao-Yng from the medical school’s Department of Obstetrics and Gynaecology, who was also involved in the study.\n“We found that at certain periods of the sperm life cycle, heat had a little bit more adverse impact (on it) than others,” she added.\nThe fertility study also scanned the birth records of more than 31,000 women, showing that pregnant women tend to take more protective measures, such as ramping up air-conditioning.\nAvoiding extreme heat during the third trimester of pregnancy was, therefore, associated with a lower risk of premature births.", "url": "https://www.straitstimes.com/singapore/extreme-heat-affects-men-s-fertility-and-birth-outcomes-nus-study"}