{"authors": ["Shermaine Ang"], "date_download": "2024-10-12 13:55:44", "date_modify": "2024-10-12 13:55:44", "date_publish": "2024-05-18 14:45:00", "description": "The hospital will have 430 acute and community hospital beds by end-May. Read more at straitstimes.com.", "filename": "singapore_emergency-department-and-acute-wards-open-at-woodlands-health-hospital_1728741344.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/18/20231222108716824img3295.jpg?VersionId=EKfyXf4fGYjMZIrvLck0pNkPBTTGIO_A", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_emergency-department-and-acute-wards-open-at-woodlands-health-hospital_1728741344.html", "title": "Emergency department and acute wards open at Woodlands Health hospital", "title_page": "Emergency department and acute wards open at Woodlands Health hospital | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Residents living in the northern part of Singapore can now visit the country’s newest integrated acute and community hospital, Woodlands Health, for emergency and acute medical services.\nThe public hospital announced the opening of its emergency department and acute wards on May 17. Located at 17 Woodlands Drive 17, it welcomed its first patients in December 2023 with the opening of its specialist clinics and 40 community hospital beds.\nThe hospital said it will have 430 acute and community hospital beds by end-May. It will eventually have 1,000 acute and community beds, and almost 400 beds in its long-term care tower, with the capacity to expand to 1,800 beds to meet future needs.\nThe new hospital also opened critical care functions such as the intensive care unit, cardiac centre and diagnostic radiology. For speedy patient care, the emergency department is connected to these services and operating theatres via a trauma lift.\nWoodlands Health is a facility with acute and community hospitals sharing the same building, so patients can be seamlessly moved from acute to step-down care, such as medical, nursing and rehabilitation care, with the same doctors in charge.\nWhen patients can be transferred, they would merely cross the corridor to the community hospital wards to continue being cared for, as opposed to moving into a completely different facility.\nAside from the integrated acute and community hospital, the 7.7ha facility also has a medical centre with specialist clinics and a long-term care facility.\nThe medical centre, which is linked to the main hospital building via a bridge, has specialist outpatient clinics, as well as radiology, rehabilitation and pharmacy services.\nThe long-term care tower includes the Ren Ci @ Woodlands nursing home and a senior care centre for 100 clients, and offers home care services.\nHealth Minister Ong Ye Kung was given a tour of the hospital’s emergency department, operating theatres and wards on May 17.\nHe said in a Facebook post: “From my last visit here five months ago, activities have picked up significantly.\n“From just 40 beds in December, almost 400 beds are now in operation. Operating theatre teams have performed surgeries on 50 patients. The laboratories are busy. Food outlets are opened.\n“Very importantly, the Emergency Department is operational, and has started to accept walk-in patients,” he said, reminding people to visit the emergency departments only when necessary.", "url": "https://www.straitstimes.com/singapore/emergency-department-and-acute-wards-open-at-woodlands-health-hospital"}