{"authors": ["Sarah Koh", "Syarafana Shafeeq"], "date_download": "2024-10-12 14:22:07", "date_modify": "2024-10-12 14:22:07", "date_publish": "2024-06-15 11:33:00", "description": "Swimming and sea activities in and along the waters are not allowed, said Sentosa. Read more at straitstimes.com.", "filename": "singapore_environment_clean-up-operation-underway-in-sentosa-after-oil-washes-up-coast-of-tanjong-beach_1728742927.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/15/saoil1506oilslick.jpeg?VersionId=VAlUsVc9wHi.RwtDYQ_sXQOTxYJzz27t", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_clean-up-operation-underway-in-sentosa-after-oil-washes-up-coast-of-tanjong-beach_1728742927.html", "title": "Cleanup under way after oil slicks hit East Coast, Labrador Park, Keppel Bay, Sentosa and Southern Islands", "title_page": "Cleanup under way after oil slicks hit East Coast, Labrador Park, Keppel Bay, Sentosa and Southern Islands | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Oil slicks stained the coastlines at East Coast Park, Labrador Nature Reserve, Keppel Bay, the Southern Islands and Sentosa on June 15, a day after a damaged cargo tank leaked oil into the sea at Pasir Panjang Terminal.\nVideos sent to The Straits Times on June 15 by readers showed thick, black oil in the waters off Tanjong Beach and East Coast Park, discolouring the sand at the shoreline.\nIn a statement on June 15, the Sentosa Development Corporation (SDC) said it was first alerted to the presence of oil in the waters near Palawan Beach at about 9pm on June 14.\nThe statement said: “Upon detailed assessment this morning at around 7am, the spread has now been observed in waters throughout our beaches at Palawan, Siloso, Tanjong, as well as Sentosa Cove.\n“We have since stopped all beach activities in and along the waters of our beaches, and have commenced a cleanup immediately.”\nIt added that the priority is to minimise impact on the waters and surrounding wildlife. Sentosa Cove residents have volunteered to help with cleanup efforts.\n“During this period, guests can continue to use our beaches, but swimming and sea activities on the beaches will not be allowed,” said the statement. “We will provide subsequent updates on the Sentosa website in due course.”\nSentosa Cove resident Chris Wright, 52, said he awoke to a “strong smell of oil” on June 15.\nHe said: “We got up and looked over our balcony, and saw a long slick of oil visible from the coast of Sentosa, all the way to Lazarus and St John’s Island.\n“There’s a lot of wildlife around here, such as monitor lizards, and there were some photos circulating in resident WhatsApp groups of them covered in oil.”\nWhatsApp groups are also being formed to round up volunteers to help with the cleanup, said Mr Wright, a writer and consultant.\nA message circulating in a Sentosa resident WhatsApp group seen by The Straits Times said volunteers are being recruited to help fill bags with sand stained by oil, and that “any help is welcome”.\nMr Wright said: “The situation is not pleasant for residents, but it’s not the end of the world. I’m more worried about the wildlife, because they are getting doused in oil.”\nMs Sue Ye, founder of conservation group Marine Stewards, said the oil slick had reached Keppel Bay and Lazarus Island as well. She said the group expects to see many dead fish surfacing in the water in the coming days.\n“The oil might smoulder and suffocate birds and fish, marine animals that have to surface for air like turtles and dolphins, and even otters that use our waterways,” she added. The group posted photos on Facebook of a kingfisher bird at Lazarus covered in oil.\n“We can’t try to rescue it, as our boats cannot go out,” Ms Ye said.\nMs Ye, who also works in boat and yacht chartering, said 10 chartered trips scheduled for this coming week have been cancelled and customers are asking for a refund.\n“There’s a lot of forgone income for the chartering companies. We don’t know if we are going to come together to file a claim.”\nShe added that her customers will have the option to reschedule their trips with an open ticket, which they can redeem in the next six months.\nA cyclist who lives about 1km from East Coast Park also said he could smell fumes the moment he woke up.\n“I went to the park at around 10am, and I noticed the smell had become more pungent,” said the cyclist, who works in the marine industry and did not want to be named.\nHe then spotted a large mass of oil in the waters near the Amber Beacon Tower, an observation tower in the park.\n“I saw a few kids still playing there, so I told the parents to pack up and leave. There should be a prompt public announcement for the public to stay away.”\nWhen The Straits Times visited the park at about 2pm, there was a strong smell of oil in the air. Black debris can be seen lining the shore.\nRetired consultant David Loh, 67, was driving past the beach when he decided to make a quick stop for some fresh air. Expecting the sea breeze, he became concerned when the smell of oil hit him instead.\nHe said: “As I walked closer to the shore, I could see the black oil washing up. The smell was very strong.”\nHe decided to go home. “I don’t think smelling this is healthy – I think people should go home.”\nAssistant engineer Zulfadhli Sulaiman, 39, and his brother’s children were playing in the sand when they noticed people leaving the water. “The oil had started to reach us, and everyone was getting out of the water.”\n“My kids had planned to take a dip in the water too, but in the end they couldn’t. I know they’re a bit disappointed.”\nArmed with brooms, shovels and plastic bags, workers from Re Sustainability Cleantech began the cleanup at East Coast Park around 3.30pm, removing debris on the beach further from the waterline to prevent contamination from the rising tide.\nHowever, one worker said they would not be able to clean up the debris contaminated by the oil until Sunday morning, when the tide is low.\nSixteen signboards will be put up across the park to warn visitors to avoid the shoreline.\nIn a Facebook post on June 15, Minister for National Development Desmond Lee said he went to Labrador Nature Reserve, where the National Parks Board has deployed booms to protect the rocky shores from the oil.\nHe also visited West Coast Park, which the slick had not hit yet, as well as East Coast Park.\nOil booms are floating barriers that help to control the spread of oil.\nThe public is advised to stay away due to the strong fumes, said Mr Lee.\n“Many people want to help, and we’ve received many messages of concern. We will put out points of contact shortly so you can contact them, and they will coordinate.”\nMr Lee, who is an MP for West Coast GRC, said while the oil had not reached the West Coast Park area yet, the authorities were keeping a close watch on this.\n“Booms have been emplaced in the canals that feed the mangrove as a precautionary measure,” he added.\nOne°15 Marina in Sentosa Cove and Marina at Keppel Bay have notified patrons that they have temporarily closed their entrances to install an oil boom.\nOne°15 Marina declined to comment, and The Straits Times has asked Marina at Keppel Bay for more details.\nMr Quek Wee Teck, president of the Association of Boat Charter Singapore, said the association is considering a class action lawsuit against the firms that own the vessels involved for loss of income due to trips cancelled and marina closures.\nThe association has about 30 charter firms as members, and they manage a total of about 50 charter boats.\nOn average, members make between 80 and 100 trips out to sea every weekend, said Mr Quek.\nEach trip usually brings in between $1,500 to $2,000 for the company.\n“We are monitoring the situation to see how long the marina closures will last and how that could translate into potential losses,” he said.\nMr Quek added that past oil spill incidents in Singapore did not result in the closures of the marinas, and there had not been prolonged periods when boats could not go out other than during the Covid-19 pandemic.\n“If things drag longer, our damages will be much higher, and we’ll consider the class action suit,” he said.\nCleanup operations are carrying on at Pasir Panjang Terminal after a boat hit another vessel.\nThe incident involved the Netherlands-flagged dredging boat Vox Maxima and the Singapore-flagged bunker vessel Marine Honour, which was stationary.", "url": "https://www.straitstimes.com/singapore/environment/clean-up-operation-underway-in-sentosa-after-oil-washes-up-coast-of-tanjong-beach"}