{"authors": ["Kolette Lim"], "date_download": "2024-10-12 13:47:32", "date_modify": "2024-10-12 13:47:32", "date_publish": "2024-03-12 23:05:35", "description": "The pipe burst sent a huge fountain of water into the air, reaching an estimated height of 5m. Read more at straitstimes.com.", "filename": "singapore_one-lane-of-upper-thomson-road-closed-as-pub-repairs-burst-pipe_1728740852.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/12/photo6307469146069253081y.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_one-lane-of-upper-thomson-road-closed-as-pub-repairs-burst-pipe_1728740852.html", "title": "Lane reopened after PUB repairs burst pipe along Upper Thomson Road", "title_page": "Lane reopened after PUB repairs burst pipe along Upper Thomson Road | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A pipe burst along Upper Thomson Road on the evening of March 12, sending a huge fountain of water into the air, with the water reaching an estimated height of 5m.\nA PUB spokesperson said the national water agency was alerted to the incident, which occurred near the junction of Upper Thomson Road and Sin Ming Avenue, at about 7pm.\nPUB said a public bus had hit a road kerb and a chamber housing an underground water pipe fitting.\nThe impact dislodged the pipe fitting, causing the water spout, the spokesperson added.\nTo facilitate repairs, a short stretch of the leftmost lane along Upper Thomson Road towards Lornie Road was cordoned off from traffic, said the agency.\nThe Straits Times saw that the water, which had reached as estimated height of 5m, stopped gushing into the air at about 8.05pm.\nPolice officers were seen directing traffic on the road. There was no major traffic disruption.\nRepair works were completed at 5.15pm on March 13 and the lane has since been reopened.", "url": "https://www.straitstimes.com/singapore/one-lane-of-upper-thomson-road-closed-as-pub-repairs-burst-pipe"}