{"authors": ["Aqil Hamzah"], "date_download": "2024-10-12 13:32:21", "date_modify": "2024-10-12 13:32:21", "date_publish": "2023-10-23 12:34:44", "description": "They are under investigation for illegal gambling and vice activities, among other things. Read more at straitstimes.com.", "filename": "singapore_50-people-under-investigation-for-various-offences-after-12-day-operation-in-geylang_1728739941.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/23/hzgeylang231023.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_50-people-under-investigation-for-various-offences-after-12-day-operation-in-geylang_1728739941.html", "title": "50 people under investigation for various offences after 11-day operation in Geylang", "title_page": "50 people under investigation for various offences after 11-day operation in Geylang | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Fifty individuals are being investigated for a raft of alleged offences, including illegal gambling and vice activities, after an 11-day multi-agency operation in Geylang.\nThe operation, which was led by Bedok Police Division, involved the Criminal Investigation Department, Central Narcotics Bureau (CNB), Health Sciences Authority (HSA), Immigration and Checkpoints Authority (ICA), Singapore Customs, Land Transport Authority and Singapore Food Agency.\nIt took place between Sept 29 and Oct 9, and aimed to clamp down on illegal activities in the area, said the police on Monday.\nOf the 50 individuals aged 21 to 73 who were rounded up, 47 were men and three were women.\nThe 73-year-old was among 24 men and a woman who were caught for gambling offences on Sept 29, after police and ICA officers raided a unit in an industrial building in Sims Avenue.\nThey seized more than $4,000 in cash, as well as gambling-related paraphernalia.\nAnother two men, aged 29 and 38, are being investigated after officers from HSA, CNB and ICA combed through streets in Geylang between Oct 3 and 5 and found unregistered health products.\nCough syrup and a variety of sexual enhancement products with an estimated value of more than $11,000 were seized.\nThe authorities also conducted enforcement operations against an unlicensed massage establishment, users of non-compliant active mobility devices, and unlawful societies.\nInvestigations into all 50 individuals are ongoing.\nThe police said in a statement that they “take a zero-tolerance approach towards illegal activities and will take firm action against those who blatantly disregard the law”.\nThey added that they “will continue to work closely with other enforcement agencies to clamp down on illegal activities, strengthen community ties and keep our neighbourhood safe and secure”.", "url": "https://www.straitstimes.com/singapore/50-people-under-investigation-for-various-offences-after-12-day-operation-in-geylang"}