{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:59:11", "date_modify": "2024-10-12 13:59:11", "date_publish": "2024-05-09 18:05:00", "description": "On April 30, some customers received an e-mail about the breach, which occurred nearly a week earlier. Read more at straitstimes.com.", "filename": "singapore_personal-details-of-citizen-watches-customers-in-singapore-stolen-in-data-breach-pdpc-investigating_1728741551.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/09/data-breach-generic0905.jpg?VersionId=tNHcCxJq5JVPAFEANLzMYKVjUOTg2Dd0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_personal-details-of-citizen-watches-customers-in-singapore-stolen-in-data-breach-pdpc-investigating_1728741551.html", "title": "Personal details of Citizen Watches customers in Singapore stolen in data breach; PDPC investigating", "title_page": "Personal details of Citizen Watches customers in Singapore stolen in data breach; PDPC investigating | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Personal Data Protection Commission (PDPC) is investigating a data breach in which the personal details of Citizen Watches customers here were stolen.\nOn April 30, some customers of Citizen Watches in Singapore received an e-mail notifying them of a breach that had occurred nearly a week earlier.\nIn that e-mail, the watchmaker told affected customers that their personal information, including name, contact details, e-mail address, password, date of birth, country/region, occupation and income range could have been compromised by the breach.\nCitizen Watches added that it discovered the incident on April 25.\n“We believe the breach occurred on or about April 24, 2024... and involved an unknown third party who had stolen personal data from our remote server,” the watchmaker said.\nCitizen Watches said that it had taken steps to prevent “any potential harm” to its customers, and that it had identified the root cause of the data breach, without elaborating.\nThe watchmaker did not announce news of the breach on its social media platforms or its Singapore website.\nIn response to queries, a Citizen Watches spokesperson said that the watchmaker is currently investigating the incident, and that “all our members are being informed together with police and PDPC”.\nThe watchmaker did not respond to The Straits Times’ questions about the number of customers affected, or any demands made by those who stole the data.\nResponding to queries, the PDPC confirmed that it was currently investigating the breach.\nWhen contacted, the Cyber Security Agency of Singapore said that it is aware of the incident, and has offered its assistance.", "url": "https://www.straitstimes.com/singapore/personal-details-of-citizen-watches-customers-in-singapore-stolen-in-data-breach-pdpc-investigating"}