{"authors": ["Fatimah Mujibah"], "date_download": "2024-10-12 13:32:15", "date_modify": "2024-10-12 13:32:15", "date_publish": "2023-10-13 19:55:00", "description": "Some of the drugs seized could sustain the addiction of about 950 abusers for a week. Read more at straitstimes.com.", "filename": "singapore_47-suspected-drug-traffickers-and-abusers-arrested-for-transactions-conducted-online_1728739935.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/13/dw-cnb-drugs-231013.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_47-suspected-drug-traffickers-and-abusers-arrested-for-transactions-conducted-online_1728739935.html", "title": "47 suspected drug traffickers and abusers arrested for transactions conducted online", "title_page": "47 suspected drug traffickers and abusers arrested for transactions conducted online | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Two brothers were among 47 people arrested in a series of anti-drug operations conducted by the Central Narcotics Bureau (CNB) from Oct 3 to Oct 10.\nThe operations targeted drug transactions conducted through chat applications, CNB said.\nAbout 5,500g of cannabis, 286g of “Ice”, 226g and 21 Ecstasy tablets, 2g of ketamine, 291 Erimin-5 tablets, 104 LSD stamps, and 544g of a powdery substance believed to be controlled drugs were seized.\nThe estimated value of these seized drugs is around $335,000, and the amount of cannabis and Ice seized could sustain the addiction of about 950 abusers for a week.\nThe operation covered several areas, including Balestier, Bedok, Bishan and Sembawang.\nOn Oct 3, a 36-year-old man was arrested for suspected drug trafficking offences in a residential unit near Spooner Road. He refused to open the door, leading the officers to use force to enter the unit.\nAbout 910g of cannabis, 207g of Ice, 28 Erimin-5 tablets, 21 Ecstasy tablets and 544g of a powdery substance believed to be controlled drugs were seized from his unit following a search.\nLater that day, a 23-year-old man was arrested for similar offences near Changi Road. His18-year-old brother was also arrested at a private residence near Kew Drive for similar offences.\nCNB officials seized about 3,400g of cannabis, 165g of Ecstasy, 263 Erimin-5 tablets, and 103 LSD stamps from the residence. An additional 780g of cannabis and 61g of Ecstasy were recovered from the older brother’s car which was parked along Jalan Wakaff.\nOn Oct 10, a 37-year-old man was arrested for suspected drug offences at a residential unit near Bukit Panjang Ring Road. About 77g of cannabis and drug paraphernalia were recovered from the unit and his car parked nearby.\nDAC Aaron Tang, Director of Intelligence Division, stated that the operations successfully disrupted a large supply of drugs distributed by drug syndicates and traffickers through chat applications like Telegram, leading to the arrest of many drug clients.", "url": "https://www.straitstimes.com/singapore/47-suspected-drug-traffickers-and-abusers-arrested-for-transactions-conducted-online"}