{"authors": ["Tay Hong Yi"], "date_download": "2024-10-12 14:10:53", "date_modify": "2024-10-12 14:10:53", "date_publish": "2024-01-17 18:41:10", "description": "86 per cent of over 1,000 Singapore professionals polled are considering a new job in 2024. Read more at straitstimes.com.", "filename": "singapore_jobs_more-s-pore-professionals-seek-to-change-jobs-despite-cooling-labour-market_1728742253.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/17/aijobs170124.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_jobs_more-s-pore-professionals-seek-to-change-jobs-despite-cooling-labour-market_1728742253.html", "title": "More S’pore professionals seeking to change jobs despite cooling labour market: LinkedIn", "title_page": "More S’pore professionals seeking to change jobs despite cooling labour market: LinkedIn | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The labour market is cooling and economic uncertainty abounds, but that has not dented the determination of many Singapore professionals to change careers for improved long-term prospects, higher pay and a better work-life balance.\nData from professional networking platform LinkedIn released on Jan 17 found that 86 per cent of over 1,000 professionals it polled here are considering a new job in 2024, up a striking 15 percentage points from 2023.\nThe survey conducted in November and December 2023 polled respondents aged 18 to 77.\nThe top motivations of those looking to leave were higher wages in a challenging economic environment and a better work-life balance, LinkedIn noted.\n“This signals a shift in attitudes where professionals are no longer willing to stick it out; instead, they’re taking ownership of their careers and want to make up for lost time by focusing on productivity and career growth,” the platform said on Jan 17.\nIt also noted that Gen Z workers – those aged 18 to 26 – and millennials, who are 27 to 32, led the charge among those looking out for new jobs, notching percentages higher than the overall figure.\nAround 70 per cent of respondents also said they would likely choose a different industry or job role for their next career move.\nTheir top motivations for a job switch include a desire to explore other interests, add to their experience and make themselves a more attractive candidate, and to pursue a role or industry with better growth prospects, LinkedIn added.\nDespite taking the risk of leaving a job amid a cooler labour market with slower hiring, 50 per cent of those polled in the latest survey felt confident about their prospects if they were to quit, more so than how they felt in 2023.\nThe increased desire to leave a job was reflected in LinkedIn’s platform in 2023, with search activity increasing by 19 per cent compared with 2022.\nMs Jasmine Liew, founder of Breakthrough Catalyst, an organisational development consultancy, said the results reflect the growing desire among workers for ownership over their career plan.\n“Employees don’t trust their employers to plan their careers for them anymore, and would rather make backup plans for themselves amid the uncertainty,” she added.\nHowever, Ms Liew, who has more than two decades of experience in human resources, noted that switching jobs may not be the best option for everyone: “In some sectors, continually moving may not be helpful to build the depth of skills to progress, and some relationships may also need to be built over time.”\nShe added that employees may be competing for fewer jobs on the market with a global labour pool through remote hires.\nFinalised Ministry of Manpower data for the third quarter of 2023 showed the number of job vacancies at 78,400 in September 2023, which marked a decline for the sixth consecutive quarter from the peak of 126,000 in March 2022.\nMs Liew also said that employee churn is likely to increase past April, following the festive season from Christmas to Chinese New Year, when resignation and hiring activity tends to slow down, as well as the disbursal of company bonuses.\nLinkedIn, which has more than three million users in Singapore, also announced on Jan 17 its latest list of the top 15 fastest-growing jobs in Singapore.\nThe first was quantitative developer, followed by sustainability consultant and security operations centre analyst.\nQuantitative developers build the software used to execute algorithmic trading strategies.\nEight of the 15 roles were related to technology, including cyber-security engineers and data science managers, while the remaining roles mostly pertained to financial and real estate services.\nLinkedIn compiled the list by examining the jobs started by its members from Jan 1, 2019, to July 31, 2023, among other data points, to calculate a growth rate for each job title.\nLinkedIn’s Jobs on the Rise list for Singapore\n1. Quantitative developer\n2. Sustainability consultant\n3. Security operations centre analyst\n4. Real estate agent\n5. Sales development representative\n6. Business development representative\n7. Infrastructure engineer\n8. Cyber-security engineer\n9. Site reliability engineer\n10. Back-end developer\n11. Cloud engineer\n12. Data science manager\n13. Search engine optimisation specialist\n14. Investment specialist\n15. Chief of staff", "url": "https://www.straitstimes.com/singapore/jobs/more-s-pore-professionals-seek-to-change-jobs-despite-cooling-labour-market"}