{"authors": ["Jolene Ang"], "date_download": "2024-10-12 13:29:40", "date_modify": "2024-10-12 13:29:40", "date_publish": "2021-10-25 11:22:33", "description": "The authority said it acted on a tip-off and inspected a storage facility there. Read more at straitstimes.com.", "filename": "singapore_courts-crime_hsa-seizes-biggest-haul-of-over-2m-worth-of-e-vaporisers-and-related_1728739780.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/10/25/fhhaul251021.jpg?VersionId=qAkuJvHnJe4coG3aCxlENZZCs3fsdnvU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_hsa-seizes-biggest-haul-of-over-2m-worth-of-e-vaporisers-and-related_1728739780.html", "title": "HSA seizes biggest haul of over $2m worth of e-vaporisers, related components in Boon Lay", "title_page": "HSA seizes biggest haul of over $2m worth of e-vaporisers, related components in Boon Lay | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Health Sciences Authority (HSA) has seized more than $2 million worth of e-vaporisers and related components after an operation conducted on Oct 11.\nIt is the largest seizure of tobacco products by the HSA, in terms of the volume and street value of the e-vaporisers, the authority added.\nThree persons are assisting HSA in the investigation.\nThe authority said it acted on a tip-off and inspected a storage facility in Boon Lay.\nA total of 10,057 assorted e-vaporisers, 48,822 assorted pods (e-vaporiser components) and 187 e-liquids - worth $2,260,825 in all - were seized.\n\"This successful operation has disrupted the operations of an illegal e-vaporisers supply chain,\" the HSA said in a statement on Monday (Oct 25).\nThe Tobacco (Control of Advertisements and Sale) Act prohibits the import, distribution, sale or offer for sale of imitation tobacco products.\nThese include shisha tobacco; smokeless tobacco; chewing tobacco such as Gutkha, Khaini and Zarda; as well as electronic vaporisers and their accessories.\nIt is illegal to purchase, use and possess e-vaporisers.\nInformation on prohibited tobacco products in Singapore is available on the HSA website.\nAny person convicted of an offence can be fined up to $10,000 or jailed up to six months or both for the first offence, and fined up to $20,000 or jailed up to 12 months or both for a second or subsequent offence.\nAll prohibited tobacco items will be seized and confiscated.", "url": "https://www.straitstimes.com/singapore/courts-crime/hsa-seizes-biggest-haul-of-over-2m-worth-of-e-vaporisers-and-related"}