{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:53:28", "date_modify": "2024-10-12 13:53:28", "date_publish": "2023-12-10 20:16:00", "description": "Online cookbook Flavours In Harmony launched at CDE International Migrants Day 2023 celebrations at Gardens by the Bay. Read more at straitstimes.com.", "filename": "singapore_hakka-abacus-seeds-sushi-balls-rasam-which-dish-won-top-spot-in-migrant-workers-recipe-contest_1728741208.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/10/2023121067934602481f76f9-0bda-4b58-86fc-7ef35cecb8e9.jpg?h=8c622eba", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_hakka-abacus-seeds-sushi-balls-rasam-which-dish-won-top-spot-in-migrant-workers-recipe-contest_1728741208.html", "title": "Hakka abacus seeds, sushi balls, Rasam: Which dish won top spot in migrant workers’ recipe contest?", "title_page": "Hakka abacus seeds, sushi balls, Rasam: Which dish won top spot in migrant workers’ recipe contest? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Indonesian domestic helper Suanah, who goes by one name, 38, has been with her employer and her parents for 1½ years and has already mastered the traditional Hakka dish, abacus seeds.\nTheir Hakka Yam Satay Abacus Seed recipe is among 42 recipes featured in a new online cookbook, Flavours In Harmony. The recipes were entered in a competition organised by the Centre for Domestic Employees (CDE).\nOther recipes include Popo’s Yam Cake, Lemper Ayam (coconut sticky rice with spiced chicken), and Rasam (South Indian soup).\nMs Suanah’s employer, Ms Rebecca Yap, 31, said: “When she came to work for me, she was rather shy and reserved. After taking part in the competition, she started to gain confidence and became more proactive.\n“We now even sit down to discuss our different cultures and how to cook cross-culture dishes.”\nThe recipe that took the top spot was sushi rice balls, contributed by a helper from Myanmar, Ms Soe Thidar.\nThe acting director of Migrant Workers’ Segment at the National Trades Union Congress, Mr Michael Lim, said: “The magic of food is the way it brings people together to share their different cultures, experience a taste of something familiar and comforting, and to try something new. This is what we are hoping to create with this online recipe book.\n“Making it a virtual instead of a physical book will help encourage others to come forward and have their special cross-cultural recipes included.”\nThe book was launched by Minister of State for Manpower and Education Gan Siow Huang at the CDE International Migrants Day 2023 celebrations at Gardens by the Bay on Dec 10. It was attended by more than 1,000 migrant domestic workers (MDWs) from the Philippines, Indonesia, Myanmar, India and Sri Lanka, some with employers in tow.\nFilipino helper Gilda Riona, 48, took part in the fun with her employer’s family.\nMs Riona became the caregiver of her employer’s son David, who has special needs, five years ago after the family’s first domestic helper of 14 years returned home to get married.\nHer employer Clara Toh said: “Before she left, she made sure she picked a person with patience and experience to take care of my son, and she even stayed on for a month to ensure there was a proper handover.”\nThey were joined by Ms Gan for a spot of lunch and festivities.", "url": "https://www.straitstimes.com/singapore/hakka-abacus-seeds-sushi-balls-rasam-which-dish-won-top-spot-in-migrant-workers-recipe-contest"}