{"authors": ["Wallace Woon", "Amanda Lee"], "date_download": "2024-10-12 13:44:55", "date_modify": "2024-10-12 13:44:55", "date_publish": "2023-02-08 21:14:30", "description": "Some of EZ-Link services are still down as of Thursday morning. Read more at straitstimes.com.", "filename": "singapore_microsoft-azure-cloud-service-outage-hits-cpf-ez-link-and-others_1728740695.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/09/cs-generic-29April-22_11.jpg?VersionId=IHJhN2bBqx8apBynosrblDGg90r1Od.6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_microsoft-azure-cloud-service-outage-hits-cpf-ez-link-and-others_1728740695.html", "title": "Microsoft Azure outage: Some websites in S’pore back up, other Web services still disrupted", "title_page": "Microsoft Azure outage: Some websites in S’pore back up, other Web services still disrupted | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Some websites in Singapore are back in service, but other Web services remain inaccessible on Thursday, following disruptions due to Microsoft Azure cloud service’s outage on Wednesday.\nA check by The Straits Times on Thursday afternoon found that the websites of Esplanade and Nanyang Technological University (NTU), which were down on Wednesday, are now accessible.\nOn its website, NTU noted that it had recently recovered from the outage.\n“We are still working to fully restore all functionality, and appreciate your patience and understanding if certain parts of the website are not performing optimally,” it said in a pop-up message on its website.\nThe websites of the CPF Board, EZ-Link, the Esplanade and NTU all pointed to Azure’s outage as the reason for their service interruptions.\nVisitors to the CPF Board’s website on Wednesday were met with the following message: “Microsoft is experiencing a regional outage that is affecting multiple websites. If you have difficulty accessing CPF digital services on our website, please use the CPF Mobile app instead.” It said it would provide updates “in due course”.\nIn an update on its website, CPF said that as of 8.30am on Thursday, its engineers had deployed a workaround. Almost all website visitors could access its digital service since noon on Wednesday.\n“We will update again once Microsoft had fully completed their restoration,” it added.\nEZ-Link posted on Facebook at 2.30pm on Wednesday that its payment service was experiencing connectivity issues because of the disruption in Microsoft’s cloud service.\nIn addition, services related to the SimplyGo ez-link and concession cards as well as the ez-link wallet were affected, including the topping up of cards and checking of one’s transaction history.\nAccording to outage tracking website downdetector.com, problems with the Azure service were first detected at around 7am on Wednesday in Singapore, with 60 per cent of the reports citing issues with their server connection. Thirty per cent reported issues with hosting while the remaining 10 per cent said there were problems with logging in.\nMicrosoft Azure said on its website that a utility power surge in the South-east Asia region at 3.19am on Wednesday had tripped a subset of the cooling units in a data centre and caused them to go offline.\nAzure said it “proactively powered down a small subset of selected compute and storage scale units” to minimise the damage to hardware, but was unable to say when services would be restored, as an extended period would be needed to restore cooling capacity.\nIt said: “Multiple downstream services have been identified as impacted.”\nNearly all of Azure’s services in the South-east Asia region were reporting issues, a check by ST found on Wednesday evening.\nAt 9.36pm, Microsoft Azure said that cooling systems in the impacted areas of the data centre had been successfully restored and that temperatures had returned to normal operating thresholds.\nA structured power-up sequence was being done on the affected compute and storage resources, the statement added.\nThe outage of Microsoft’s Azure cloud service comes one day after its Outlook e-mail service experienced an outage.\nThe mail service was back up and running by 11pm on Tuesday as Microsoft said that service availability was now at 99.9 per cent, with the majority of the impact being “remediated”.", "url": "https://www.straitstimes.com/singapore/microsoft-azure-cloud-service-outage-hits-cpf-ez-link-and-others"}