{"authors": ["Elaine Lee"], "date_download": "2024-10-12 14:21:39", "date_modify": "2024-10-12 14:21:39", "date_publish": "2024-07-06 13:15:00", "description": "Booms will continue to be deployed at Labrador Nature Reserve and West Coast Park as a precaution. Read more at straitstimes.com.", "filename": "singapore_swimming-water-activities-safe-again-at-changi-beach-after-oil-spill-incident-nea_1728742899.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/06/4497542241014413913.jpg?VersionId=jljWVQjZvlu4gq0.kF2kHNKPUBfAA01p", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_swimming-water-activities-safe-again-at-changi-beach-after-oil-spill-incident-nea_1728742899.html", "title": "Oil booms around Coney Island, Chek Jawa removed; Changi beach reopens for water activities", "title_page": "Oil booms around Coney Island, Chek Jawa removed; Changi beach reopens for water activities | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Oil containment booms pre-emptively placed at sensitive biodiversity areas in the north-east of Singapore have been removed after consultation with oil spill consultants, Minister for National Development Desmond Lee said in a Facebook post on July 6.\nThe areas are: Pasir Ris Park, Coney Island Park, and Chek Jawa Wetlands on Pulau Ubin.\nThe booms were placed following a maritime accident at Pasir Panjang Terminal on June 14, in which a damaged cargo tank leaked oil into the sea.\nOil containment booms, which are barriers used to limit the spread of oil, were deployed in various areas to absorb the oil.\nBased on visual surveys, those sites appear to be largely unaffected, said Mr Lee, adding that satellite imagery and drone surveys also show that there is no further oil entering the East Johor Strait.\n“Booms need to be removed once the sites appear unaffected,” he said.\n“Booms are subject to current and tidal forces, so if they are left for too long, they may get damaged or float into these sensitive sites and cause adverse impact.”\nHowever, booms will continue to be deployed as a precaution at Labrador Nature Reserve and West Coast Park, he added.\n“We have been able to mitigate the effects of the oil spill because of community support... I would like to thank all who have come forward to volunteer with us.”\nAside from boom removal, beachgoers are now permitted to return to Changi Beach for swimming and other water activities, the National Environment Agency (NEA) said in a Facebook post on July 6.\nNEA added that Changi Beach has not been directly impacted by the oil spill.\n“Water quality has remained normal and stable in the past week, and the bulk of oil in the sea has been removed,” it added. “As such, NEA will be withdrawing this advisory.”\nAn advisory against such activities was issued on June 17 in response to the oil spill incident.\nOil slicks stained coastlines at East Coast Park, Labrador Nature Reserve, Keppel Bay, the Southern Islands and Sentosa on June 15.\nSome of the oil was also seen off Changi, according to a joint statement by the Maritime and Port Authority of Singapore, NEA, National Parks Board, national water agency PUB, Sentosa Development Corporation and Singapore Food Agency on June 17.\nBased on satellite and drone images, there has been no oil slick observed at East Coast and Changi since June 18, The Straits Times reported on June 25.\nOn June 14, the Netherlands-flagged dredger Vox Maxima hit a stationary Singapore-flagged bunker vessel, Marine Honour, at Pasir Panjang Terminal.\nThe dredger had suffered a sudden loss of engine and steering control.\nThe impact created a rupture in one of the oil tanks of Marine Honour, causing oil to leak into the sea.\nResidents and visitors to the affected areas spoke of a “strong smell of oil” following the incident.", "url": "https://www.straitstimes.com/singapore/swimming-water-activities-safe-again-at-changi-beach-after-oil-spill-incident-nea"}