{"authors": ["Rei Kurohi"], "date_download": "2024-10-12 13:31:42", "date_modify": "2024-10-12 13:31:42", "date_publish": "2021-11-01 14:46:54", "description": "She apologised to the Singapore Police Force and retracted an anecdote she had shared of the alleged incident. Read more at straitstimes.com.", "filename": "singapore_politics_wp-mp-raeesah-khan-referred-to-parliament-privileges-committee-for-lying-about_1728739902.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/9J8AoW1dS7vdZJyA1CwUGsbaUb2L2kmU6jTRLv-5xrk.jpg?VersionId=awJ61S9vIpixTN7Ao1JTUqdHvl1HJ8WL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_wp-mp-raeesah-khan-referred-to-parliament-privileges-committee-for-lying-about_1728739902.html", "title": "WP MP Raeesah Khan referred to committee after admitting she lied to Parliament about sexual assault case", "title_page": "WP MP Raeesah Khan referred to committee after admitting she lied to Parliament about sexual assault case | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Workers' Party (WP) MP Raeesah Khan will have to appear before the Committee of Privileges, after she admitted to lying in Parliament about details of a sexual assault case that she alleged was mishandled by the police.\nOn Monday (Nov 1), she apologised in Parliament to the Singapore Police Force and retracted an anecdote she had shared of the alleged incident.\nIn explaining why she had made up details of that case, Ms Raeesah, 27, said she lacked the courage to admit that she was part of a support group for women, where the story was shared, as she herself had been a victim of sexual assault at the age of 18.\nLeader of the House Indranee Rajah said Ms Raeesah (Sengkang GRC) had lied to Parliament on three occasions, after clarifying details of the matter with the WP MP when she finished her statement.\nShe raised an official complaint against Ms Raeesah for breaching her parliamentary privilege, and asked for the matter to be referred to the Committee of Privileges, which looks into any complaint alleging breaches of parliamentary privilege. Speaker of Parliament Tan Chuan-Jin agreed to do so.\nMs Raeesah had told the House during a debate on empowering women on Aug 3 that she had accompanied a 25-year-old rape victim to a police station to make a police report three years ago, and the police officer who interviewed the victim had allegedly made inappropriate comments about her dressing and the fact that she was drinking.\nOn Monday (Nov 1), she admitted that she had not accompanied the victim to the police station. Instead, she said the victim had shared the account in a support group for women, which Ms Raeesah herself was a part of, and that she did not have the victim's consent to share the story in Parliament.\n\"I did not share that I was a part of the group, as I did not have the courage to publicly admit that I was part of it. I attended the support group because I myself am a survivor of sexual assault,\" she said.\nMs Raeesah said she was sexually assaulted as an 18-year-old while studying abroad. The experience continues to traumatise her to this day, she added.\n\"Unlike the survivor whose anecdote I shared in this House, I did not have the courage to report my own assault. Yet, as a survivor, I wanted so deeply to speak up and also share the account I had heard when speaking on the motion, without revealing my own private experience.\n\"I should not have shared the survivor's anecdote without her consent, nor should I have said that I accompanied her to the police station when I had not. It was wrong of me to do so.\"\nMs Raeesah also apologised to the survivor whose story she had shared, Parliament, her Sengkang constituents and residents, the WP, and her family.\nMs Indranee noted that Ms Raeesah had confirmed that did not have any details of the police case and was thus unable to substantiate her allegation when she made her statement in August.\nHer actions had resulted in \"a cloud hanging over the police\" and caused them to devote time and resources to investigate the alleged incident. It also does a \"great disservice\" to the survivors of sexual assault and rape victims, Ms Indranee added.\nThe late WP chief J.B. Jeyaretnam was referred to the Committee of Privileges four times - once in 1982 and three times in 1986 - for accusing the Government of tampering with the judiciary on multiple occasions, and the police of abusing their powers of detention.\nHe was fined $1,000 for two counts of breach of parliamentary privilege - the maximum fine at that time. Later, he was also fined $25,000 for publishing a distorted report of the committee's proceedings and $1,000 for not declaring a pecuniary interest in a question he raised.\nTimeline of events\nAug 3\nDuring a debate on a motion about empowering women, Ms Raeesah Khan (Sengkang GRC) said she had accompanied a rape survivor to a police station to make a police report three years prior.\nShe said the 25-year-old woman came out of the police station crying, because the police officer had allegedly made comments about her dressing, and the fact that she had been drinking.\nResponding, Minister of State for Home Affairs Desmond Tan said the allegation that the police mishandled a sexual assault case was serious and would need to be investigated. He called on Ms Raeesah to provide more details.\nMs Raeesah declined, saying she did not wish to re-traumatise the victim. She also said she had not been able to contact the woman since the incident happened.\nLeader of the House Indranee Rajah then reminded all MPs to exercise their parliamentary privilege responsibly and be prepared to substantiate any allegations made in the House.\nOct 4\nSpeaking in Parliament, Law and Home Affairs Minister K. Shanmugam pressed Ms Raeesah to provide details of the incident.\nHe said the police had checked their records and found no cases that fit Ms Raeesah's description.\nIn response, Ms Raeesah affirmed that her account was true but repeatedly declined to reveal any further details due to confidentiality concerns.\nMr Shanmugam said the police would continue to investigate the matter and would interview Ms Raeesah about the case.\nOct 20\nThe police said in a statement that it could not identify the case despite an extensive search.\nMs Raeesah had also not responded to two requests to attend an interview, the police added.\nIn response to media queries, Ms Raeesah said she would make a statement on the matter in Parliament on Nov 1.", "url": "https://www.straitstimes.com/singapore/politics/wp-mp-raeesah-khan-referred-to-parliament-privileges-committee-for-lying-about"}