{"authors": ["Samuel Devaraj"], "date_download": "2024-10-12 13:31:45", "date_modify": "2024-10-12 13:31:45", "date_publish": "2022-11-13 00:00:00", "description": "Misinformation about cannabis has spread and CNB needs to work hard to correct it. Read more at straitstimes.com.", "filename": "singapore_courts-crime_cnb-not-enforcement-centric-it-s-focusing-on-education-new-director_1728739905.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/13/0E2A5690.JPG?VersionId=693M2HqHdS8i_4rGJbzCn8xuDbWp0pmu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_cnb-not-enforcement-centric-it-s-focusing-on-education-new-director_1728739905.html", "title": "CNB not enforcement-centric, it’s focusing on education: New director", "title_page": "CNB not enforcement-centric, it’s focusing on education: New director | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - While the Central Narcotics Bureau’s (CNB) enforcement capabilities are important, its new director said it is not enforcement-centric.\nMr Sam Tee told the media on Friday that CNB will be doubling down on educating the public on the harm of drugs.\n“We want to start off by educating the people. In fact, if we can educate our people well and they don’t take drugs, then actually our mission is done,” he said.\n“But after we educate you, remind you, warn you and you still take drugs, we must have the ability to detect and then arrest you. And help you then to rehabilitate so that you stay away from drugs forever.”\nMr Tee added that even if the literature has shown the harmful effects of cannabis, misinformation about the drug has spread and CNB needs to work hard to correct it.\nHe said it will be reaching out to the six local universities in Singapore and international schools to develop partnerships in the fight against drugs.\nCNB will also be increasing its engagement with parents. Mr Tee, who is a father of two, added that during discussions, one of the organisations mentioned as a potential partner with the bureau is Singapore’s nationwide fathering movement – Dads for Life.\n“We do see – whether it’s the dad or mum – playing an even greater role in educating their children against the harm of drugs and watching them, looking out for signs or indicators,” he said.\nCiting a recent case of a 14-year-old, who was accompanied by his father and surrendered about 115g of cannabis at a neighbourhood police post, Mr Tee added that it is a perfect example of what parents should do in that situation.\nDespite the challenges facing Singapore, Mr Tee noted that the drug situation is well under control and that the country is drug-free by and large.\nHe said: “The challenge for us... is we must continue to win the hearts and minds of our people, the majority of our people – that we still want to have a drug-free Singapore. And to do that, we really need to work hard on our young people. You know, because our young people are much more vulnerable, exposed.\n“So education, fight against misinformation, mobilise the community to work together with us and then, lastly, to have a strong enforcement regime.”", "url": "https://www.straitstimes.com/singapore/courts-crime/cnb-not-enforcement-centric-it-s-focusing-on-education-new-director"}