{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:27:03", "date_modify": "2024-10-12 13:27:03", "date_publish": "2024-10-11 21:50:23", "description": "Due to the incident on Oct 8, train service at the station was delayed for about 5 minutes. Read more at straitstimes.com.", "filename": "singapore_woman-rescued-after-getting-leg-stuck-in-platform-gap-at-bugis-mrt-station_1728739623.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/photo2024-10-1118-51-40.jpg?VersionId=Abe2zAuD62RiQzblM0O_14aMtWvB_m4b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_woman-rescued-after-getting-leg-stuck-in-platform-gap-at-bugis-mrt-station_1728739623.html", "title": "Woman rescued after getting leg stuck in platform gap at Bugis MRT station", "title_page": "Woman rescued after getting leg stuck in platform gap at Bugis MRT station | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A woman was taken to hospital after she fell at Bugis MRT station and got her leg stuck in the platform gap.\nA video circulating on social media of the incident, which occurred on Oct 8, shows the woman sitting between a train and the platform. Her left leg, below the knee, appears to be lodged in the gap. Several people can be seen attending to her.\nResponding to queries from The Straits Times, SMRT Trains president Lam Sheau Kai said that the incident occurred after the commuter lost her balance at about 7.30pm.\n“For her safety, the emergency communication button on the train was immediately activated. Our station staff, along with other commuters, quickly assisted and managed to free her leg,” said Mr Lam.\nThe commuter was then taken to KK Women’s and Children’s Hospital by ambulance.\nSMRT has reached out to the commuter, said Mr Lam, adding that the operator hopes for her speedy recovery.\nDue to the incident, train service at Bugis station was delayed for about five minutes.\n“We sincerely thank all commuters on the affected train for their patience and understanding while our staff provided assistance,” said Mr Lam.", "url": "https://www.straitstimes.com/singapore/woman-rescued-after-getting-leg-stuck-in-platform-gap-at-bugis-mrt-station"}