{"authors": ["Toh Yong Chuan"], "date_download": "2024-10-12 14:20:36", "date_modify": "2024-10-12 14:20:36", "date_publish": "2017-06-29 10:00:00", "description": "SINGAPORE - A study by a local non-government organisation (NGO) that helps low-wage foreign workers has found gaps in the Labour Court system. Read more at straitstimes.com.", "filename": "singapore_manpower_ngo-study-finds-gaps-in-the-labour-court-system_1728742836.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2017/06/29/bp290617meal.jpg?VersionId=.M9kTsoATlK1TxhIwMqJnwGTg2i77_Ds", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_manpower_ngo-study-finds-gaps-in-the-labour-court-system_1728742836.html", "title": "NGO study finds gaps in the Labour Court system", "title_page": "NGO study finds gaps in the Labour Court system | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A study by a local non-government organisation (NGO) that helps low-wage foreign workers has found gaps in the Labour Court system.\nIt has led to these workers falling through the cracks in a system meant to protect them, said Transient Workers Count Too (TWC2) at a Singapore Management University (SMU) forum on Thursday (June 29).\nThe Labour Court, part of the Ministry of Manpower (MOM), hears employment-related complaints such as disputes over salary, dismissal and paid leave. The hearings are held behind closed doors and lawyers are not allowed to represent workers or employers. It costs workers $3 to take their complaints to the Labour Court.\nWhile the system is meant to be low-cost and speedy by cutting down paperwork and lawyers, the TWC2 study found \"significant obstacles and uneven enforcement\" that prevent migrant workers from getting justice.\nThe report cited the example of compulsory mediation which takes place before a complaint is formally heard by an assistant commissioner of labour.\nThis mediation process \"fails to take into consideration the unequal bargaining power of workers vis-à-vis employers\". This unequal state can result in migrant workers being coerced by employers to sign documents and accept unfair employment terms.\nThe claims process is also problematic in evidence gathering and enforcement. \"Workers lack access to the evidence required to substantiate their claims, while employers are accused of manipulating evidence to their advantage,\" the report noted.\nErrant employer behaviour includes retaliation and violations of the law during the claim process.\nThey would, among other things, use threats, try blackmail, restrict movements and even forcibly send the workers home, the report added.\nIt suggested several ways to improve the Labour Court system: require employers to hire foreign workers by using a standard employment contract that sets out the minimum labour standards in Singapore; pay workers directly via electronic means so that there is a proper paper trail; and give workers access to more information during the claims process, like opening the ministry's service counters in the evenings and on Sundays.\nAlso, there should be a fund to help workers who remain unpaid because their employers fail to comply with the Labour Court orders, the report said.\nThe 104-page report is based on interviews with 157 migrant workers conducted in soup kitchens and shelters run by NGOs helping foreign workers. All had brought their claims to the Labour Court, mostly for salary arrears and work injury compensation.\nMost of the workers (94 of the 157 interviewed) were from Bangladesh. About two in three of those interviewed were construction workers.\nResponding to the report, MOM said over 90 per cent of the 4,500 salary-related claims from foreign workers in the past three years were resolved via mediation within one month, and 95 per cent are resolved in two months.\nA longer time doesn't help workers, it added, noting that cases that take longer are more complex.\n\"MOM remains concerned on the issues faced by this small group of foreign work permit holders,\" it said, adding it has strengthened safeguards for workers and taken a tough stance on errant employers.\nMOM said it will keep working \"with constructive NGOs and the public\" to better protect workers.\nThe report's key findings were presented at the forum by two of its seven authors. They are: Ms Tamera Fillinger, an adjunct faculty member at SMU's Law Faculty and TWC2 volunteer, and Dr Nicholas Harrigan, an assistant professor at SMU's School of Social Sciences.\nDr Harrigan hopes the report \"will help stimulate policy changes to improve the protection of migrant workers''.\nTheunveiling of the report on Thursday comes about a month after a High Court judge noted that people can be confused by the name and powers of the Labour Court.\n\"The Labour Court is not a court constituted by any statute or subsidiary legislation. Decisions of the 'Labour Court' are more accurately referred to as decisions of the Commissioner (of labour),\" said Justice Woo Bih Li.\nHe made the point on May 23 when he overruled a decision by a ministry's assistant commissioner of labour on an insurance claim, in an appeal case involving work injury compensation.\nSince April this year, employment disputes like salary claims are heard by the new Employment Claims Tribunal which comes under the State Courts.\nBut as with the Labour Court system, claims must go for mediation before going to the tribunal. Mediation is done at the Tripartite Alliance for Dispute Management, a separate body set up by the ministry, National Trades Union Congress and Singapore National Employers Federation.\nMeanwhile, the Labour Court continues to hear work injury compensation claims.", "url": "https://www.straitstimes.com/singapore/manpower/ngo-study-finds-gaps-in-the-labour-court-system"}