{"authors": ["Lee Nian Tjoe"], "date_download": "2024-10-12 14:21:36", "date_modify": "2024-10-12 14:21:36", "date_publish": "2023-03-24 17:21:15", "description": "Construction of 12 foundations for rail viaduct on the S'pore side is expected to be completed by first quarter of 2024. Read more at straitstimes.com.", "filename": "singapore_transport_construction-of-the-johor-bahru-singapore-rts-link-45-completed-on-the-s-pore-side-iswaran_1728742896.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/24/2023032474098355dsc1949-01_6.jpg?VersionId=IYJzcDH9cJWSjuceCPEyl9xC5QnJHY6D", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_construction-of-the-johor-bahru-singapore-rts-link-45-completed-on-the-s-pore-side-iswaran_1728742896.html", "title": "JB-Singapore RTS Link 45% completed on S’pore side, service to start by end-2026: Iswaran", "title_page": "JB-Singapore RTS Link 45% completed on S’pore side, service to start by end-2026: Iswaran | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The construction of the Johor Bahru-Singapore Rapid Transit System (RTS) Link is progressing well, with 45 per cent of the work on the Singapore side completed.\nTransport Minister S. Iswaran provided the update on Friday when he visited the work site in Admiralty Road West.\nHe said: “We are on track to achieve the completion goal so that the system can be operational by the end of 2026, and this is what both sides are working towards.”\nMr Iswaran described the new link as an “important addition” to the existing road connectivities between Singapore and Malaysia as it will also promote “people to people, economic and other linkages as well”.\nWhen the 4km RTS Link shuttle service starts operating, passengers will be able to travel from the Bukit Chagar station in Johor Bahru to the Woodlands North station, or in the reverse direction, in about five minutes.\nThe train service can serve up to 10,000 passengers per hour in each direction.\nPassengers will also be able to transfer from the RTS station to the Thomson-East Coast Line concourse via an underground link, without needing to exit the station.\nThe RTS is expected to help ease congestion on the Causeway.\nIn March 2023, the Immigration and Checkpoints Authority (ICA) in Singapore said that peak-hour traffic volumes through the Woodlands and Tuas checkpoints have returned to pre-Covid-19 levels.\nOn Friday, Mr Iswaran took a boat ride out to the Strait of Johor to view one of the foundations on the Singapore side of the project – the furthest from the island.\nDone in three stages, 5,000 cubic m of concrete – enough to fill 2½ Olympic-size swimming pools – are needed to build just one of the 12 foundations to be used for the 730m-long rail viaduct on the Singapore side of the RTS Link.\nNine of the 12 foundations are located in the Strait of Johor. On average, they reach 30m deep into the seabed. The remaining three are sited on land.\nMr Iswaran said that construction of the 12 foundations is expected to be completed by the first quarter of 2024.", "url": "https://www.straitstimes.com/singapore/transport/construction-of-the-johor-bahru-singapore-rts-link-45-completed-on-the-s-pore-side-iswaran"}