{"authors": ["Kok Yufeng"], "date_download": "2024-10-12 13:43:44", "date_modify": "2024-10-12 13:43:44", "date_publish": "2024-02-21 05:00:00", "description": "Competition is normal in a growing aviation sector and Airbus welcomes it, said its commercial aircraft CEO. Read more at straitstimes.com.", "filename": "singapore_transport_china-s-home-grown-jet-won-t-rock-the-boat-but-future-competition-can-t-be-ignored-airbus_1728740624.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/21/Azmi-pixairshow-44.jpg.JPEG?h=859742e3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_transport_china-s-home-grown-jet-won-t-rock-the-boat-but-future-competition-can-t-be-ignored-airbus_1728740624.html", "title": "China’s home-grown jet won’t rock the boat, but future competition can’t be ignored: Airbus", "title_page": "China’s home-grown jet won’t rock the boat, but future competition can’t be ignored: Airbus | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - It would be a mistake to dismiss the contest brought by Chinese aircraft manufacturer Comac to the aviation sector, even though its C919 passenger jet is not going to rock the boat significantly, said Airbus commercial aircraft chief executive Christian Scherer on Feb 20.\nSpeaking to the media on the sidelines of the opening day of the Singapore Airshow, Mr Scherer said that it is normal to see more competition in a growing aviation industry and Airbus welcomes it as it keeps the company innovating.\n“We certainly don’t want to stick our head in the sand… The cake is growing sufficiently for Comac to want to compete,” he added.\nMr Scherer said that the China-made C919, which made its international debut in Singapore, is a legitimate effort by China to build its own technological and industrial capabilities, and the market is large enough to cater for competition.\nWhile the plane’s initial operations will be with Chinese carriers, Mr Scherer said Comac will make efforts to place the airplane outside of China as well.\n“We fundamentally consider Comac as a competitor in the future,” he added.\nSome in the industry have suggested that the single-aisle jet may pose a challenge to the dominance of Boeing and Airbus, with the two largest jetmakers in the world struggling with backlogs due to supply chain and production issues.\nBoeing, in particular, has come under scrutiny over manufacturing lapses after a cabin panel of an Alaska Airlines Boeing 737 Max blew out mid-flight, following which US regulators grounded similar 737 MAX 9 aircraft temporarily.\nThe Federal Aviation Administration later said it would not allow Boeing to expand production of the planes, limiting it to 38 per month while the company addresses its lapses.\nWhile Boeing chose not to bring any of its commercial planes to Singapore for the 2024 air show, the American company said it is doing its best to capture as many aircraft orders in South-east Asia as it can.\nIt kicked off the biennial aerospace and defence exhibition with two new aircraft deals, including what it said was a landmark deal with Thai Airways for 45 Boeing 787-9 Dreamliners.\nRoyal Brunei Airlines said on Feb 20 that it would also be buying four Boeing 787-9s, with an option for two more.\nAsked about the significance of announcing the two deals on the opening day of the air show here, which is Asia’s largest, Boeing senior vice-president of commercial sales and marketing Brad McMullen said the orders are of strategic importance to the firm.\nHe added that the South-east Asian market is “immense”, with nearly 4,300 planes expected to be delivered here over the next 20 years.\n“We obviously have gone through our challenges recently, but we have every intention of being here to help supply the airplanes that (the region) needs,” Mr McMullen said.\n“We’ll wait and see what Airbus does for the show, but we’re very proud of this one,” he added, referring to the 45 new planes that were bought by Thailand’s national carrier.\n“Large deals like this, frankly, are a good way for an airline to lock up real estate for a period of time to secure their growth plans. So I expect to see more of it, not less,” he said.\nAs for Airbus, Mr Scherer said the Asia-Pacific region is important for the firm, making up about a third of its business activity.\nHe added that demand for passenger and cargo aircraft in the region will continue to grow.\n“We see no reason for it to slow down,” he said.\nOn Singapore specifically, Mr Scherer said Airbus will continue to invest here, especially when it comes to sustainability.\nOn Feb 20, the company signed an agreement with the Economic Development Board to facilitate the establishment of a Sustainable Aviation Hub, which will be hosted on the Airbus Singapore Campus in Seletar Aerospace Park and focus on technology, research and innovation.\nMr Scherer said the Republic is fertile ground for developing sustainable solutions, and Airbus already has some initiatives here with local players.\nThese include a study on the feasibility of using hydrogen as an alternative aviation fuel announced in 2022, which he said is going well.\nGiving his reaction to Singapore’s aviation sustainability plan announced on Feb 19, Mr Scherer said the Government has been one of the strongest endorsers of decarbonisation and Airbus welcomes this.\nHe added: “We’re absolutely determined to play a pivotal role in the transition of this industry towards decarbonised flying. We view it as our social mission, beyond even our commercial mission, and we put our money where our mouth is.”", "url": "https://www.straitstimes.com/singapore/transport/china-s-home-grown-jet-won-t-rock-the-boat-but-future-competition-can-t-be-ignored-airbus"}