{"authors": ["Sherlyn Sim"], "date_download": "2024-10-12 13:29:09", "date_modify": "2024-10-12 13:29:09", "date_publish": "2024-03-25 23:52:13", "description": "Mr Wong’s tenure will be from April 1, 2024, to March 31, 2027. Read more at straitstimes.com.", "filename": "singapore_new-chairman-to-take-over-at-health-promotion-board-in-april_1728739749.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/26/bthphb20240326.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_new-chairman-to-take-over-at-health-promotion-board-in-april_1728739749.html", "title": "New chairman to take over at Health Promotion Board in April", "title_page": "New chairman to take over at Health Promotion Board in April | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Sembcorp Industries group president and chief executive Wong Kim Yin will take over as chairman of the Health Promotion Board (HPB) from April 1.\nHe will succeed Mr Philip Lee, who will retire from the board on March 31, the Ministry of Health (MOH) and HPB said in a joint statement on March 25.\nMr Wong, who has been on the HPB board since Oct 1, 2023, will serve for a three-year term until March 31, 2027.\nThe statement said: “Mr Wong will play a key role in shaping HPB’s strategies in disease prevention, strengthening healthy ecosystems collaboratively with healthcare clusters and other government agencies, and delivering more impactful health initiatives driven by precision public health capabilities.\n“With his experience in business management, Mr Wong will also lend counsel and guidance to HPB in forging more successful partnerships and nurturing a future-ready, agile organisation.”\nIn September 2023, Mr Wong retired from the SkillsFuture Singapore board, where he was chairman. He continues to serve on the boards of the National Research Foundation, the Inland Revenue Authority of Singapore and DSO National Laboratories.\nHe also serves as World Energy Council vice-chairman for Asia until his term ends in 2025.\nThe statement said: “Mr Wong will provide effective leadership to the board and management as the organisation furthers its health promotion efforts, in line with the Healthier SG national initiative.”\nIn a tribute to the outgoing chairman, MOH and HPB said Mr Lee was instrumental in HPB’s progress on many fronts.\nMr Lee first became a member of the HPB board on April 1, 2016, then took over the reins as chairman from April 1, 2017.\nDuring his tenure as chairman, he oversaw HPB’s efforts in supporting the national war on diabetes, which resulted in more Singaporeans being able to get their hands on healthier food and beverage choices, as well as in rolling out the Nutri-Grade system of categorising and grading drinks based on sugar and saturated fat content.\nDuring the Covid-19 pandemic, Mr Lee guided HPB in efforts to support the health and well-being of Singaporeans, while taking on pandemic-related duties involving public health, quarantine, testing and vaccination operations.\nUnder his leadership, “HPB scaled up its use of technology and behavioural insights towards more evidence-based, people-centred interventions”. HPB also beefed up initiatives like the Healthy 365 mobile app during Mr Lee’s term, and fostered new ways to nudge Singaporeans towards a healthy lifestyle by promoting efforts like the National Steps Challenge.\n“Under Mr Lee’s watch, HPB grew its strategic partnership network across the community, schools and workplaces, embedding these healthy living options into the everyday lives of Singaporeans,” the statement said.", "url": "https://www.straitstimes.com/singapore/new-chairman-to-take-over-at-health-promotion-board-in-april"}