{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:38:23", "date_modify": "2024-10-12 13:38:23", "date_publish": "2024-08-02 12:00:00", "description": "Singapore is the fourth South-east Asian nation to sign a bilateral nuclear cooperation pact with the US. Read more at straitstimes.com.", "filename": "singapore_st-explains-what-are-south-east-asia-s-nuclear-ambitions-and-why-should-singapore-care_1728740303.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/nuclear-power-plant-70893150.jpg?VersionId=Gl_Nrs4JIeoUKuoKxM2jOk4juZLdu2TU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_st-explains-what-are-south-east-asia-s-nuclear-ambitions-and-why-should-singapore-care_1728740303.html", "title": "ST Explains: What are South-east Asia’s nuclear ambitions and why should Singapore care?", "title_page": "ST Explains: What are South-east Asia’s nuclear ambitions and why should Singapore care? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Momentum for nuclear energy is picking up globally as countries grapple with the need to safeguard energy security in a low-carbon way, including in South-east Asia.\nOn July 31, Singapore signed the 123 Agreement with the United States, which essentially allows for the transfer of nuclear material, equipment and information between the two countries.\nThis makes Singapore the fourth South-east Asian nation to sign the bilateral nuclear cooperation agreement with the atomic superpower.\nThe other three Asean countries which have signed 123 Agreements with the US are Indonesia (since 1981), Vietnam (since 2014) and the Philippines (since July 2024).\nUS firms are generally not authorised to export nuclear equipment and materials without a bilateral agreement in force, according to the Nuclear Energy Institute, a trade association based in the US.\nAmid this global nuclear renaissance, The Straits Times looks at South-east Asia’s appetite for this energy source.\nQ: Which countries in South-east Asia are currently considering nuclear energy?\nA: Five of the 10 Asean countries – Vietnam, Indonesia, Philippines, Malaysia and Thailand – are either studying the feasibility of advanced nuclear technology to meet their growing energy needs, or already have plans to build new reactors in the coming decades.\nSmall modular reactors (SMR), which occupy less space and generate around a third of the power capacity compared with conventional nuclear plants, are emerging as a popular option.\nThese reactors are considered safer than conventional reactors, and have a much smaller safety radius. This makes them suitable for deployment in population-dense, land-scarce areas.\nHowever, most of the technology relating to SMRs are still in the research phase.\nMany of these countries had prior plans of building their own conventional nuclear power plants in the past, but these were scuppered or delayed due to a variety of reasons, including the 2011 nuclear disaster in Fukushima, Japan.\nLarge conventional nuclear fission plants – mostly fuelled by uranium – are the predominant types in operation currently. Three global nuclear accidents, including the Chernobyl meltdown and the Fukushima disaster, have made these plants controversial.\n- Thailand had intended to build a nuclear reactor by 2020, but eventually decided against it after the Fukushima accident in 2011. It is now studying the viability of integrating SMRs into its energy mix as it accelerates its clean energy push.\n- Vietnam scrapped plans for its first two nuclear power plants in 2016 following the Fukushima disaster and budget constraints. It is now looking to build a second 10MW research reactor.\n- The Philippines has a target of generating 1.2 gigawatts of nuclear reactors by 2032, using a mix of micro modular reactors, SMRs and even conventional-sized ones. Micro modular reactors are small reactors that are compact enough to be transported by truck, and can thus be easily deployed in remote areas.\n- Indonesia, which opened its first research reactor built in 1975, is planning for the testing and operation of its first commercial nuclear power plant, which will likely take place in the early 2030s.\n- Malaysia has indicated its interest in nuclear energy, and it has one existing research reactor from the 1980s, which is still in use.\nLike Singapore, Indonesia and the Philippines have also joined the US’ Foundational Infrastructure for Responsible Use of Small Modular Reactor Technology programme.\nThis initiative aims to build capabilities to better understand SMR and other newer advanced nuclear technologies, as well as key issues such as nuclear safety.\nAmerican company NuScale, which designs SMRs, had in 2023 announced plans to build them in the Philippines and Indonesia.\nNuScale, which was supposed to construct what could have been the US’ first commercial SMR, ended up having its project axed before construction could happen in 2026, due to projected rising costs.\nHowever, in November 2023, its president and chief executive John Hopkins said that the company will continue with its other domestic and international projects to bring the tech to market.\nQ: Why is nuclear power such an attractive clean energy source?\nA: Nuclear power can produce a supply of electricity at close to zero emissions, since nuclear reactions do not release planet-warming emissions in the process.\nIt can also provide a stable supply of electricity, unlike renewable energy options such as solar and wind, which can be intermittent on cloudy days or when wind speeds are low.\nCountries are trying to overcome the intermittencies in renewable energy generation by upgrading their electricity grid infrastructure and investing in costly battery storage technologies.\nIn the interim, nuclear energy can help in scaling up electricity production in a cost-effective way.\nQ: Is nuclear energy safe?\nA: There have been three major global nuclear accidents so far – the Fukushima disaster in 2011, the Chernobyl meltdown in 1986, and the Three Mile Island accident in 1979.\nThese incidents have given conventional nuclear fission plants a bad name.\nHowever, those incidents involved Generation II reactors, which were built up till the 1990s. Since 2012, advanced Generation III reactors have emerged, promising better performance and safety elements.\nSMRs harness fission energy, but they do not require human intervention to shut them down because they rely on natural forces such as circulation, convection and gravity.\nQ: Why should Singapore keep an eye on nuclear developments in the region?\nA: Experts told The Straits Times that there is potential for regional collaboration in the areas of nuclear safety and transparency.\nEven though nuclear technology has evolved to include more safety measures over the decades, Singapore would still need qualified experts in science, engineering, regulation, and many other aspects of nuclear energy, said Dr Victor Nian, who is the chief executive of the Centre for Strategic Energy and Resources, an independent think-tank.\nThis bank of expertise will help to ensure Singapore has sufficient knowledge and credibility when participating in regional dialogues on nuclear safety, he added.\n“We need to be able to evaluate the consequences in the event of a severe nuclear disaster in the region, given the close proximity that countries in the Asean neighbourhood have with each other,” Dr Nian said.\n“We also need to understand the safety implications from the handling and transport of radioactive materials across the Asean region for Singapore.”\nFor example, Indonesia’s state-owned power utility, PLN, had proposed building an SMR in West Kalimantan, using technology supplied by NuScale, which is said to be earthquake-proof.\nThis was, however, challenged, and led to protests by environmental activists who feared that the nuclear reactor would not be best placed in a seismically active region in Indonesian Borneo, environmental news agency Mongabay reported in May.\nAssociate Professor Kei Koga from Nanyang Technological University’s Public Policy and Global Affairs Programme pointed to the importance of transparency among South-east Asian states, and ensuring that regional nuclear developments are closely monitored by the International Atomic Energy Agency.\nThis will send a reassuring signal to people in the region, including Singapore, that nuclear safety is paramount, he said.\n“However, Thailand and the Philippines are prone to natural disasters, particularly tsunamis, similar to the incident in Fukushima,” he added.\n“So the issue involves watching where these nuclear plants will be located and how resilient they are to natural disasters,” said Prof Koga.\nDiscussions would also need to be had in the region to determine if nuclear energy could contribute to the regional electricity grid when it is fully developed, experts said.\nAsked if Singapore could import nuclear energy from its neighbours, should this option prove more cost-effective than constructing its own reactors, a spokesman for the Ministry of Trade and Industry said: “As Singapore has not made any decision on nuclear energy, it is premature to discuss this.”\nDr Nian said that if SMRs can be made small enough, it would be possible for domestic deployment, given Singapore’s land scarcity and the rising cost of infrastructural project development here.\nEither way, regional cooperation is key to ensuring the safe, secure and sustainable use of nuclear energy in Asean, said Dr Nian, and he is hopeful that nuclear energy could quickly become an option for import via the Asean regional grid.\nEither way, regional cooperation is key to ensuring the safe, secure and sustainable use of nuclear energy in Asean, said Dr Nian. “I am hopeful that nuclear energy could quickly become an option for import via the Asean regional grid.”\n“Importing is an option when we are able to secure a strong bilateral arrangement with Asean neighbouring countries. This could go beyond the traditional power import agreement, and possibly involve options such as joint project ownership,” he added.", "url": "https://www.straitstimes.com/singapore/st-explains-what-are-south-east-asia-s-nuclear-ambitions-and-why-should-singapore-care"}