{"authors": ["Amanda Lee", "Chong Xin Wei", "Soon En-Rei"], "date_download": "2024-10-12 13:57:51", "date_modify": "2024-10-12 13:57:51", "date_publish": "2022-07-31 05:00:00", "description": "More people here are signing up for classes to learn how to fly drones safely. Read more at straitstimes.com.", "filename": "singapore_more-drone-users-taking-their-passion-to-the-skies-in-recent-years_1728741471.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/28/sv_drone_280722.jpg?VersionId=Oe3Ws6Wc_wp8BdM0W.RcSKymQyLl.1L2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_more-drone-users-taking-their-passion-to-the-skies-in-recent-years_1728741471.html", "title": "More drone users taking their passion to the skies in recent years", "title_page": "More drone users taking their passion to the skies in recent years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - More people here are signing up for classes to learn how to fly drones safely, amid growing interest in unmanned aircraft for both recreational and commercial purposes.\nDrone enthusiasts can sign up for beginner courses to learn the fundamentals of flying a drone, or more advanced ones to obtain the Unmanned Aircraft Pilot Licence (UAPL), which is needed to fly drones commercially.\nEducational institutions and private academies that offer such courses told The Straits Times their students are mostly males aged from seven to 70.\nDrone Flying Academy founder Richie Lim said about 60 people sign up for his courses every month, triple the number in 2019. About 80 per cent are recreational users and the rest are commercial users seeking the UAPL.\n\"More people are into aerial videography, as it provides a bird's eye view of places. People are also showing these high-view perspectives of buildings like MBS (Marina Bay Sands) on their social media pages, motivating others to learn drone flying,\" said Mr Lim, who started his academy in March 2019.\nRecreational user Edmond Seet, 54, attended a Drone Flying Academy basic course in October 2021, two or three years after buying a drone that he had problems controlling.\n\"After the course, I find it much easier to control my drone and even got to play with some more advanced drones at the academy,\" said the sales director.\nMr Foo Wing Yong, deputy director of engineering services in the School of Engineering at the Institute of Technical Education (ITE) College Central, who oversees drone courses, said there has been an increase in registrations for its courses since 2021.\nITE currently offers nine courses with a range of difficulty levels. Two or three classes for each course are held every quarter, with the number of students ranging from three to 16. The courses are always fully subscribed, said ITE.\nThis is compared with only one or two classes in each course per quarter in early 2021.\nFreelance cartoonist Ang Ting Fang, 33, took three drone courses at ITE between last December and this June, which taught her the basic movements in controlling drones as well as the laws and regulations of using such devices.\n\"I wanted to get a licence to do commercial work, like being a pilot for hire. If companies want to hire pilots to survey rooftops, I will be able to take on those jobs,\" she said.\nMultirotor Association of Singapore secretary Alvin Yeoh said it has more than 7,000 members now, almost a sevenfold increase from 2017 when it was founded.\nThose in the industry expect the growth of drone users to remain healthy, as Covid-19-related restrictions on movement and travel are gradually eased globally.\nMr Vincent Li, director of drone retailer DJI Store Singapore, which has outlets at VivoCity and Funan, said its business had dipped by 30 per cent to 40 per cent from the start of the pandemic until May this year.\nBut sales have since recovered to pre-pandemic levels, which he attributes to more people using drones on their overseas holidays after Singapore reopened its borders in April.\nDrone Flying Academy's Mr Lim said: \"The different and endless applications of drones, like air taxis and drone light shows, could have enticed people to start learning how to fly them. It is possibly the next era of technology.\"", "url": "https://www.straitstimes.com/singapore/more-drone-users-taking-their-passion-to-the-skies-in-recent-years"}