{"authors": ["Salma Khalik"], "date_download": "2024-10-12 13:31:34", "date_modify": "2024-10-12 13:31:34", "date_publish": "2021-05-31 23:03:44", "description": "It's a pity that Singapore has decided to let schoolchildren jump the queue, says Salma Khalik. Read more at straitstimes.com.", "filename": "singapore_health_good-moves-to-protect-singaporeans-but-some-tweaks-may-be-in-order_1728739894.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/06/01/rk_sg-covid_010621.jpg?VersionId=Ilw_nK3xrH9GjrxU.crYsRfncOc8Lkov", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_good-moves-to-protect-singaporeans-but-some-tweaks-may-be-in-order_1728739894.html", "title": "Good moves to protect Singaporeans against Covid-19, but some tweaks may be in order", "title_page": "Good moves to protect Singaporeans against Covid-19, but some tweaks may be in order | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore is not out of the woods yet, but the statistics shared by Health Minister Ong Ye Kung on Monday (May 31) look promising.\nNot only were the absolute infection numbers lower last week than in the previous one - dropping from 182 cases to 136 - but, more importantly, the number of unlinked cases has come down.\nAs Mr Ong said, it is the unlinked cases that are the most worrying, as this suggests there are people out there \"quietly transmitting the virus in the community\".\nThe number of unlinked Covid-19 patients has fallen from 39 in the first week of current stricter measures to 25 in the past week.\nIf the trend continues in the coming week, Singapore will likely return to a more relaxed \"normal\" by the middle of June.\nTwo weeks is regarded as one incubation period, although for the majority, it takes only five to six days between exposure and symptoms. So a fall in the number of cases between the first week and second is a strong indicator that current measures are working.\nNevertheless, the numbers remain higher than is comfortable.\nAs Finance Minister Lawrence Wong, one of three co-chairmen of the multi-ministerial task force on Covid-19, said, even after fires have been put out, so long as embers remain, they could \"easily spark another major flare-up\".\nSo it is important to track down all cases and ring-fence them.\nIn his address to the nation, Prime Minister Lee Hsien Loong stated clearly what needs to be done: testing, contact tracing and vaccination. And they need to be done faster.\nThis is why it is important for people who are even mildly sick to see a doctor and to check if they have Covid-19.\nWhen they are given three days of medical leave, they should stay home and away from others until their test results prove they are free of Covid-19. A medical certificate is not a go-ahead to play and spread the virus.\nThe decision to ask close contacts of someone who is a close contact of a Covid-19 patient - in other words, someone who had not been in contact with an infected person - to isolate themselves until their possible Covid-19 contact is declared free of the disease, is good proactive outbreak management.\nOn the surface, this might appear too kiasu (overcautious). After all, why should people who had not been even in remote contact with a Covid-19 patient need to be isolated?\nBut Singapore's recent experience shows that 70 per cent of linked new cases were caused by transmission within households.\nThis means that waiting till the link person is diagnosed with Covid-19 might be too late to prevent the virus from spreading beyond their family.\nThe third factor that needs to be hastened is vaccination. Mr Ong said that of 93 breakthrough infections - that is, infections among people who had been fully vaccinated - only one became severely ill and needed oxygen. That's just over 1 per cent, compared with around 8 per cent who had not been not vaccinated.\nSo, as more people get vaccinated, the number who will get very sick will fall.\nHowever, it's a pity that Singapore has also decided to let schoolchildren jump the queue - before adults younger than 40 years are vaccinated.\nChildren, if infected, tend to be less sick than older people. While it is true that they could bring the disease home and spread it to older members of their families, so, too, can people in their 20s and 30s.\nThis age group would include pregnant and breastfeeding women who, it's now recommended, should get vaccinated.\nA reader of The Straits Times, who had sought priority for domestic workers caring for the elderly, also has a valid point.\nMr Ong pointed out that most community transmissions \"are not due to dramatic movements, but usually the movement patterns are quite mundane - home, work, grocery shopping and so on\".\nThese unvaccinated domestic workers in their 20s and 30s do the grocery shopping, likely more than once a week. Every time they go out, there is the risk that they might bring the virus home with them, and infect the most vulnerable group of all - seniors with underlying medical conditions.\nTo date, three in four people aged 60 years and older have had at least one jab.\nWhatever the reasons for the rest not getting vaccinated, they need to be protected.\nIt is good that this more vulnerable group can now walk into any vaccination centre, even without a booking, and get vaccinated.\nHopefully, this will result in many more of them getting protected against a virus that is likely to remain among us for years to come, perhaps even forever.\nRead next: 6 key announcements from PM Lee Hsien Loong's address on Covid-19 plans", "url": "https://www.straitstimes.com/singapore/health/good-moves-to-protect-singaporeans-but-some-tweaks-may-be-in-order"}