{"authors": ["Judith Tan"], "date_download": "2024-10-12 13:29:31", "date_modify": "2024-10-12 13:29:31", "date_publish": "2024-06-25 21:46:06", "description": "But this is certainly not the last infection wave, said the health minister. Read more at straitstimes.com.", "filename": "singapore_falling-hospitalisation-numbers-show-covid-19-wave-clearly-on-the-wane-ong-ye-kung_1728739771.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/25/2023121929381424gin0966.jpg?VersionId=1DCwbRNQIZeDj.ZXqNBZO2RHcDbkUlxN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_falling-hospitalisation-numbers-show-covid-19-wave-clearly-on-the-wane-ong-ye-kung_1728739771.html", "title": "Falling hospitalisation numbers show Covid-19 wave ‘clearly on the wane’: Ong Ye Kung", "title_page": "Falling hospitalisation numbers show Covid-19 wave ‘clearly on the wane’: Ong Ye Kung | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Covid-19 wave, driven by sub-variants KP.1 and KP.2, is clearly waning, and the falling number of infected patients admitted to hospitals and intensive care units in the past four weeks is evidence of this.\nHealth Minister Ong Ye Kung said he was “naturally worried” when hospitalisation cases rose rapidly to about 280 in May when the wave first started.\n“We were entering the mid-year travelling season then. If the severe cases double twice, from 280 to 560 to over 1,000, the equivalent of one regional hospital will be occupied by Covid-19 patients with severe illness,” Mr Ong said on Facebook on June 25.\n“This will adversely impact our healthcare system, which is already very busy, and lengthen waiting times further.”\nHe added: “Fortunately, the number of hospitalised cases reached 370, and then started to taper off. The downward trend has persisted for four weeks now.”\nThe number of Covid-19 patients in hospital fell to 136 in the week starting June 16.\nThe estimated number of Covid-19 infections has also fallen for four straight weeks, from 24,800 in the week of May 19 to 25, to 8,760 from June 16 to 22. Infections peaked at 25,900 in the week of May 5 to 11.\nAlthough infections are tapering off, Mr Ong warned that “this will certainly not be the last Covid-19 infection wave”.\n“With each wave, we will worry about excessive patient load at hospitals. This is because the virus will continue to mutate, and our vaccine protection would have waned and weakened further with time,” he said.\n“We will continue to watch the situation closely, and alert the public in good time.”\nGlobally, the predominant Covid-19 variants are KP.1 and KP.2, the sub-lineages of JN.1.\nThe World Health Organisation classified KP.2 as a variant under monitoring on May 3, signalling to the public health authorities that a Covid-19 variant may require prioritised attention and monitoring.", "url": "https://www.straitstimes.com/singapore/falling-hospitalisation-numbers-show-covid-19-wave-clearly-on-the-wane-ong-ye-kung"}