{"authors": ["Tay Hong Yi"], "date_download": "2024-10-12 13:30:58", "date_modify": "2024-10-12 13:30:58", "date_publish": "2024-08-19 22:35:00", "description": "However, details like payout structure and eligibility conditions will determine outcomes, they said. Read more at straitstimes.com.", "filename": "singapore_jobs_up-to-6000-for-singapore-job-seekers-enough-help-to-take-edge-off-job-search-experts_1728739858.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/19/IMG3260.JPG?VersionId=XL.ySQq5dXSHQbi0IK1fKs4nqcDrznWr&h=f3d22bd9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_jobs_up-to-6000-for-singapore-job-seekers-enough-help-to-take-edge-off-job-search-experts_1728739858.html", "title": "Up to $6,000 under new scheme will buy time for Singapore job seekers to find work: Experts", "title_page": "Up to $6,000 under new scheme will buy time for Singapore job seekers to find work: Experts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Interim financial support under a new scheme will provide workers who lose their jobs some reprieve from cost pressures, buying them more time to seek out or train for better jobs, said experts and observers.\nHowever, they raised concerns about the payout amount and duration of the SkillsFuture Jobseeker Support scheme, especially for middle-income workers who may still have to dip into their savings.\nIt also remains to be seen how well the scheme will deal with potential knock-on effects, pending further specifics of its design and implementation, they told The Straits Times.\nPrime Minister Lawrence Wong revealed the maximum duration and maximum payout of the scheme in his maiden National Day Rally speech on Aug 18, and Manpower Minister Tan See Leng will provide more details at an unspecified date.\nThe scheme will pay involuntarily unemployed workers, such as those who are retrenched or whose companies go bust, up to $6,000 over a maximum of six months.\nAssociate Professor Terence Ho of the Lee Kuan Yew School of Public Policy said the $6,000 maximum indicates that the Government aims to strike a balance between providing meaningful support and ensuring sufficient incentive for displaced workers to return to employment when they are ready.\nHe said the support will make a difference for lower-income households but added: “For middle-income households, it will help alleviate financial stress, but they will likely also need to rely on their savings or other sources of cash flow to tide them over.”\nThe quantum of support will need to be adjusted as wages and living costs rise over time, Prof Ho noted.\nHe also said the duration of support may also need to be periodically reviewed in the light of economic conditions and how long it may take for job seekers to find new opportunities.\nThe conditions tied to the support are one as-yet-unannounced detail of the upcoming scheme to look out for, Prof Ho said.\nThese include whether the job seeker is required to take up training, career coaching or job-matching services, as well as the threshold to meet these requirements.\n“This would set the bar for the level of effort and commitment the job seeker needs to demonstrate in seeking to return to employment,” he said.\nAlthough PM Wong said in his rally speech that workers who benefit should go for training, career coaching and job-matching services, he stopped short of saying these would be mandatory requirements.\nHow payouts are structured, such as whether they are fixed or taper off with time, would also affect the scheme’s outcomes.\nAssociate Professor Walter Theseira from the Singapore University of Social Sciences said tapering benefits would, in theory, improve the incentive to take up a job as working becomes comparatively more attractive.\n“However, it would also increase household instability, and may encourage take-up of a lower-quality job which could lead to longer-term unemployment or underemployment,” the labour and transport economist added.\nProf Theseira also said there is empirical evidence that job seeking and matching is heightened towards the end of a payout window.\nIt has thus been argued that workers should continue to be entitled to some payouts even after finding work, provided they have not exhausted their overall claim entitlement, he said.\nThis would ensure that workers are not encouraged to simply wait out their benefit period and then find a job at the end, he noted.\nHowever, a retrenched worker may not be limited to this support scheme, as it is still unclear how the payouts here interact with other support schemes, such as the SkillsFuture Mid-Career Training Allowance.\nThe allowance, slated for launch in early 2025, is meant to partially offset income loss from taking up full-time courses that take longer to complete, as well as defray some expenses for those taking up part-time training.\nProf Theseira said the programmes appear to be distinct, noting: “Not all older PMET (professional, managerial, executive and technical) workers who are retrenched would qualify for, or want to take up, the (allowance), so they may instead want to take up the job seeker support scheme.”\nCompared with support for the unemployed elsewhere, Prof Theseira said, it is common for schemes abroad to be based on a fraction of qualifying earnings, or to have additional allowances for family circumstances, such as for those with dependants.\nHe added: “It is also common for the duration of support to be longer in many countries, although this may also come with increasing requirements for training or engagement in seeking work.\n“Thus, I would say our scheme probably looks less generous than those common in Europe.”\nFor example, he said, such schemes often cover more than 50 per cent of the qualifying income, so a total payout of $6,000 over six months seems to only meet that standard for lower-income workers in Singapore.\nThe median gross monthly income in 2023 was $5,197.\nThe average earnings from work in 2023 by a household among those placed in the bottom 10 per cent by household income were $2,129 a month.\nThis means the maximum quantum available under the scheme comes in at slightly under half of what such a household earns over a six-month period.\nBut Prof Theseira added: “At the same time, more generous unemployment schemes are often funded explicitly by contributions from workers and employers. Our scheme is being paid for through general taxation, and hence does not directly reduce worker earnings.”\nSingapore National Employers Federation executive director Sim Gim Guan welcomed the new scheme.\nHe noted that even as workers may find themselves losing their jobs amid rapid economic transformation, the tight labour market indicates many companies have difficulties finding individuals with the right skills to meet their business needs.\n“This might necessitate these workers taking the time to reskill or upskill, to be able to meet the new job requirements.”\nWhile knock-on negative effects on unemployment and severance payments are not impossible, experts consider the possibility remote.\nProf Ho said: “It may increase the average duration of unemployment slightly, but this may not be a bad thing if it results in better job matches over the long term.”\nProf Theseira noted that those who are in training are not considered unemployed as they are out of the labour force.\nThis means that interim support which is tied to training may not raise the unemployment rate for the duration of training, he said.\nAsked if the payouts could reduce severance payments employers pay, employment lawyer Goh Seow Hui noted that employers obliged to pay retrenchment benefits under a collective bargaining agreement cannot reduce these benefits without the union’s agreement.\nMeanwhile, those that provide these benefits on a goodwill basis tend to adopt market practice or their own global policies, which arise independently of the existence of government support schemes.\nThat aside, retrenchment benefits are not mandated under Singapore law, and it would not be illegal for employers to lower retrenchment benefits, Ms Goh, a partner with Bird & Bird ATMD, said.\nHowever, she added that this would likely be met with objections from employees, the labour movement and the Ministry of Manpower.\n“This is because SkillsFuture Jobseeker Support is very likely intended to enhance, and not dilute, the safety net for retrenched employees.”\nA mid-career manufacturing manager who has been job hunting since his retrenchment about six months ago welcomed the support.\nThe 55-year-old, who is married with one child and wanted to be known only by his surname Koh, has also been attending career coaching sessions.\nMr Koh told ST that the $6,000 maximum translates to about 20 per cent of his last-drawn pay over the same period.\n“Six months of support is not short and would help with transport and living expenses as we search for a new job or reskill... as it takes a long time for those of us who are retrenched and are over 50 years old to get a new job,” he said.\nHe hopes the scheme will provide more coverage to older workers like him, especially those who were retrenched just ahead of its announcement.", "url": "https://www.straitstimes.com/singapore/jobs/up-to-6000-for-singapore-job-seekers-enough-help-to-take-edge-off-job-search-experts"}