{"authors": ["Goh Yan Han"], "date_download": "2024-10-12 13:46:18", "date_modify": "2024-10-12 13:46:18", "date_publish": "2020-03-24 19:28:32", "description": "Singapore residents will also not be able to claim from MediShield Life or Integrated Shield Plans for these treatments. Read more at straitstimes.com.", "filename": "singapore_singapore-residents-who-continue-to-travel-will-pay-full-hospital-charges-if-warded-for_1728740778.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/03/24/hzchangi0324.jpg?VersionId=ssRrD9ltcM0Q2UsVwqyL6CVjoFsrS0c4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_singapore-residents-who-continue-to-travel-will-pay-full-hospital-charges-if-warded-for_1728740778.html", "title": "Singapore residents who continue to travel abroad will pay full hospital charges if warded for coronavirus", "title_page": "Singapore residents who continue to travel abroad will pay full hospital charges if warded for coronavirus | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore residents or long-term pass holders who insist on leaving the country despite the Government's travel advisories will have to pay full hospital charges if admitted for coronavirus-related treatments.\nAbout 1,000 continue to travel daily, risking the health of other Singaporeans and residents when they return, the Ministry of Health (MOH) said on Tuesday (March 24).\nAs such, any Singapore resident or long-term pass holder who leaves Singapore from March 27 (Friday), in disregard of the prevailing travel advisories, will be charged unsubsidised rates for their inpatient stay at public hospitals if they are admitted for suspected Covid-19 and have onset of symptoms within 14 days of returning to Singapore.\nMOH added that Singapore residents will also not be able to claim from MediShield Life or Integrated Shield Plans for these treatments at public and private hospitals.\nOn top of that, work-pass holders or their dependants who leave Singapore from March 27 will be deprioritised for entry approval and could see significant delays before they are allowed to return to Singapore if they persist in travelling abroad and return infected.\nHealth Minister Gan Kim Yong and National Development Minister Lawrence Wong, co-chairs of a government task force to fight the coronavirus, stressed during a press briefing that all Singaporeans and residents must take the measures seriously.", "url": "https://www.straitstimes.com/singapore/singapore-residents-who-continue-to-travel-will-pay-full-hospital-charges-if-warded-for"}