{"authors": ["Therese Soh"], "date_download": "2024-10-12 13:55:45", "date_modify": "2024-10-12 13:55:45", "date_publish": "2024-06-16 12:00:00", "description": "Gleneagles Hospital marks 65 years of history since it first opened its doors in 1959. Read more at straitstimes.com.", "filename": "singapore_gleneagles-little-known-journey-from-hotel-to-nursing-home-to-hospital_1728741345.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/16/JFG1763gleneages.jpg?VersionId=Y_jFvlrBpkcasl3YXTMzaGT2plsNzeLM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_gleneagles-little-known-journey-from-hotel-to-nursing-home-to-hospital_1728741345.html", "title": "Gleneagles’ little-known journey from hotel to nursing home to hospital", "title_page": "Gleneagles’ little-known journey from hotel to nursing home to hospital | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - When Dr See Tho Kai Yin moved his obstetrics and gynaecology practice to Gleneagles Hospital in 1978, the hospital seemed to him like a nursing home. He was not far off.\nIt was not yet a multidisciplinary hospital and had only basic healthcare services and facilities.\n“There were maybe obstetrics, general surgery and a bit of gynaecology. There wasn’t anything for cancers, radiotherapy or anything of that sort,” Dr See Tho, 79, told The Straits Times as the hospital marked its 65th anniversary on June 7.\nAs part of the celebrations, it unveiled its own orchid, the Brassocattleya Gleneagles, a hybrid of the brassavola and cattleya orchids.\nToday, the hospital stands on the site of the former Gleneagles Nursing Home and Gleneagles Hotel. It has 221 beds across three blocks, with more than 500 multidisciplinary specialists and nearly 1,200 full-time staff.\nIt has also expanded abroad, growing to 13 hospitals and two clinics in Malaysia, India, Hong Kong and Brunei.\nIn 1957, it was converted from a hotel, opposite the Singapore Botanic Gardens, into a 45-bed nursing home run by the British.\nTwo years later, it began operation as the first private hospital in the Orchard area.\nOver time, the hospital started offering more specialised services, said Dr See Tho, who retired recently. “As medical practice improved, the hospital also needed to increase its facilities,” he noted.\nHealthcare became more specialised from the 1990s, and the turn of the century saw an influx of specialists into private practice, he added.\nIn 1993, Gleneagles became a tertiary care hospital. A year later, it had 150 specialists.\nIn 2013, Dr See Tho’s daughter, Dr See Tho Ving Yuen, 51, made her foray into private practice, joining the hospital as an anaesthesiologist about three decades after her father.\nThe two have worked together in joint surgical procedures, where she administers anaesthesia for things like caesarean sections and operations to remove ovarian cysts or fibroids.\nFor Dr See Tho Ving Yuen, who has her own clinic, the ease of communication when working with her father helps them work as a team.\nA good rapport between a surgeon and an anaesthetist makes working together easy, her father added. “Of course, it is much easier because she is my daughter.”\nThe hospital has come a long way from its colonial days.\nIt began as a house that occupied the site of Harvestehude, named after a quarter in the German city of Hamburg, which was built in the early 1900s by a German resident called Gustav C. W. Wolber.\nIn the late 1930s, two British women took over the building and converted it into a boarding house. They renamed it Gleneagles after a valley in Scotland.\nThe name Gleneagles is believed to mean “glen of the church”, composed of the word glen, which means valley, and the French word for church, eglise.\nIn the 1950s, a luxury hotel, the Gleneagles Hotel, was built beside the Harvestehude building.\nIt was converted into Gleneagles Nursing Home in 1957, while the former Harvestehude building became staff quarters and was renamed Macauley House in 1958, a year before Gleneagles Hospital was established.\n“I felt (a) sense of joy that a life had been saved,” said Ms Ng.\nPlans to expand and upgrade the hospital are in the pipeline, said chief executive Thomas Wee.\nHe said that the hospital aims to raise its capacity “to improve (its) ability to cater to a higher patient load”.\nOn its plans to increase occupancy, the hospital declined to comment, saying only that planning is in the early stages.\nMaternity care units stationed on different floors, including the maternity ward, labour ward and neonatal intensive care unit, will be relocated to one floor by the early part of the fourth quarter of 2024, said Mr Wee.\nThis will help to streamline maternity services and provide a “one-stop shop for mothers”, he said.\nIn June, the hospital pioneered the use of a system, DermaPace, that treats leg ulcers by stimulating blood flow, and is the first hospital in South-east Asia to do so, he added.", "url": "https://www.straitstimes.com/singapore/gleneagles-little-known-journey-from-hotel-to-nursing-home-to-hospital"}