{"authors": ["Christine Tan"], "date_download": "2024-10-12 13:28:32", "date_modify": "2024-10-12 13:28:32", "date_publish": "2024-09-08 05:00:00", "description": "The doctor and four SMRT staff will each receive a SCDF Community Lifesaver Award. Read more at straitstimes.com.", "filename": "singapore_doctor-on-way-to-work-saves-man-who-suffered-heart-attack-at-yishun-mrt-station-and-had-no-pulse_1728739712.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/08/chdoctor04.d12ae936.Attachment.094333.jpg?VersionId=xOSmsMyuY5UAd9k2a1n77_UbLXF0yNLX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_doctor-on-way-to-work-saves-man-who-suffered-heart-attack-at-yishun-mrt-station-and-had-no-pulse_1728739712.html", "title": "Doctor on way to work saves man who suffered heart attack at Yishun MRT station and had no pulse", "title_page": "Doctor on way to work saves man who suffered heart attack at Yishun MRT station and had no pulse | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A doctor on his way to work at Khoo Teck Puat Hospital saved a heart attack victim, and then took a bus to the accident and emergency (A&E) department where he ended up being the man’s attending physician.\nParamedics who rushed the man to the hospital were not aware Dr Lim Shi Ping was working that day.\nThe 63-year-old man survived the heart attack and was discharged from hospital five days later.\nThe incident happened around 7.30am on Aug 18.\nThe 27-year-old junior doctor told The Straits Times that he had left his car at home to catch the train, from where he lives in Novena, to Yishun because it was a Sunday. At the Yishun MRT station, he noticed a crowd at the bottom of the escalator. A man had collapsed and was gasping for air.\nDr Lim, who has been a doctor for two years, pushed through the crowd and introduced himself as a medical doctor. The man had no pulse by then.\nThe doctor immediately commenced cardiopulmonary resuscitation (CPR), and directed people around him to call for an ambulance.\nSMRT station manager Kelvin Leong jumped in and instructed station staff to get the automated external defibrillator (AED). He also took over CPR while Dr Lim prepared the AED.\nDr Lim said he was stressed because it was outside a controlled hospital environment.\n“In a hospital, there are medical personnel. Everyone is trained, and they know their roles in the resuscitation,” he said.\n“Outside, we have to try to make use of what’s available and get the help of other people,” he added.\nMr Leong kept up the chest compressions before Dr Lim administered the AED. Meanwhile, other station staff ushered the crowd away from the man.\nSoon, the man’s heart started beating again.\nAt about 7.35am, paramedics arrived at the station and took the man to Khoo Teck Puat Hospital.\nDr Lim then hopped on a bus and made it for his 8am shift.\nThe paramedics were surprised to see him again at the A&E department where he works. He had told them he was a doctor at the hospital, but did not mention he was working that day.\n“The paramedics said: ‘I didn’t know you were going to work, we would have given you a ride’,” he said.", "url": "https://www.straitstimes.com/singapore/doctor-on-way-to-work-saves-man-who-suffered-heart-attack-at-yishun-mrt-station-and-had-no-pulse"}