{"authors": ["Joyce Teo"], "date_download": "2024-10-12 13:33:50", "date_modify": "2024-10-12 13:33:50", "date_publish": "2024-09-12 18:50:00", "description": "At 7,600 sq m, it's the second largest on the island, which will have 30 therapeutic gardens by 2030. Read more at straitstimes.com.", "filename": "singapore_therapeutic-garden-opens-in-west-coast-park_1728740030.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/jtparks12.41e2da65.Attachment.033034.jpg?VersionId=tuSmT8X2lSNxIbx70bqVqUFi7J96khQR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_therapeutic-garden-opens-in-west-coast-park_1728740030.html", "title": "Therapeutic garden opens in West Coast Park with seniors’ zone, kids’ play area", "title_page": "Therapeutic garden opens in West Coast Park with seniors’ zone, kids’ play area | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Republic’s second-largest therapeutic garden, featuring fragrant, edible or brightly coloured plants, opened in West Coast Park on Sept 12.\nThe garden, situated near the park’s carpark 2, has wide pathways that wheelchair users can easily navigate and a community space for horticulture programmes, such as leaf collage and scent-bag making, among other features.\nTherapeutic gardens help people interact with nature to improve their well-being, including those with dementia or special needs.\nThe new garden at West Coast Park covers an area of 7,600 sq m, which is slightly larger than a football field. It is split into a zone for seniors, with exercise area and raised planters, and a zone for children, featuring a sand play area and relaxation spots that can serve as quiet hideouts.\nTrees in West Coast Park that have been there for more than 40 years have been incorporated into the design, including a majestic 12m-tall Banyan tree, which separates the zone for seniors and the kids’ play area.\nThe garden is filled with plants, including the lemon sherbert coleus, which has soft, hairy leaves that leave a lemon scent on your hands if you touch them.\nSingapore now has 15 therapeutic gardens, with the largest at Woodlands Health Campus covering 1.5ha (about two football fields). The first was developed in HortPark in 2016.\nBy 2030, there will be 30 therapeutic gardens scattered across the island.\nThis is being planned even as the National Parks Board (NParks) continues to restore various areas to their natural uncultivated state through rewilding.\nNParks also uses multi-tiered planting to recreate habitats similar to those found in forests, from shrubs to small fruit-bearing trees to bigger trees.\nGone are the days when the emphasis was clearly on maintaining manicured gardens, NParks group director for parks Chua Yen Ling told The Straits Times on Sept 12.\nShe said recent research has shown that people are looking for more natural green spaces, and this was something that became apparent during the pandemic, when people visited green spaces that were off the beaten path.\nBefore the end of 2024, another therapeutic garden will open in Punggol Park, said Minister for National Development and Minister-in-charge of Social Services Integration Desmond Lee in a Sept 12 release.\nThese gardens are designed to not just engage the senses but also provide mental relief, he said.\nMr Lee was at the opening of the West Coast Park therapeutic garden to observe therapeutic horticulture programmes involving teenagers from APSN Tanglin Special School and older adults from Sasco Senior Citizens’ Home.", "url": "https://www.straitstimes.com/singapore/therapeutic-garden-opens-in-west-coast-park"}