{"authors": ["Ng Keng Gene"], "date_download": "2024-10-12 13:33:01", "date_modify": "2024-10-12 13:33:01", "date_publish": "2023-10-30 16:30:00", "description": "The mall’s basement is set to house an expanded line-up of F&B and lifestyle stores. Read more at straitstimes.com.", "filename": "singapore_west-mall-s-revamp-to-wrap-up-in-2025-with-bukit-batok-library-to-double-in-size_1728739981.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/30/yuwestmall3010.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_west-mall-s-revamp-to-wrap-up-in-2025-with-bukit-batok-library-to-double-in-size_1728739981.html", "title": "West Mall’s revamp to wrap up in 2025, with Bukit Batok library to double in size", "title_page": "West Mall’s revamp to wrap up in 2025, with Bukit Batok library to double in size | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – West Mall in Bukit Batok is undergoing a makeover slated to be completed in 2025, with the library in the shopping centre set to reopen that year at twice its current size.\nThe National Library Board (NLB) said in a statement on Monday that Bukit Batok Public Library – located in the mall since it opened in 1998 – will be closed temporarily from Dec 31 for upgrading.\nThe 1,279 sq m library’s last day of operations will be on Dec 30 and it is slated to reopen by end-2025.\nNLB said that at twice its current size, the revamped third-storey library will offer “new spaces and experiences in reading, learning and discovery”.\nIt will have a “refreshed look and larger spaces to meet the evolving needs of patrons, with new design and programme concepts”, the board added. It said more details of the revamp will be made public later.\nNLB chief executive Ng Cher Pong said this is being done in tandem with the mall’s upgrading and will allow the library to better serve the larger community of residents in the area.\nMall owner Singapore Land Group (SingLand) said on Monday that West Mall’s refurbishment, which began in the first half of 2023, is slated to be done in 2025. The mall, which is next to Bukit Batok MRT station, will remain fully operational throughout as the work takes place in phases.\nBesides the bigger library, other moves include converting the mall’s open plaza into a sheltered one, which will help to promote social interaction through future programming, SingLand said. Such programmes include community engagement activities and seasonal or festival-themed events.\nThe sheltered plaza will come with new food and beverage spaces.\nThe mall’s basement is set to house an expanded line-up of food and beverage and lifestyle stores, said SingLand.\nThe developer said in its 2022 annual report that the refurbishment exercise will add about 20,000 sq ft of retail space that will help the mall serve residents of the new Tengah town.\nThe six-storey mall, including a basement floor, is on a 99-year lease that began on March 1, 1995, and has a net lettable area of about 183,000 sq ft.\nNLB will set up a nearby 24-hour book dispenser and reservation lockers in 2024 for patrons to pick up reserved items when the library is closed.\nPatrons are also encouraged to visit nearby libraries, tap NLB’s e-resources or have up to four library items delivered to their homes for a fee through the board’s Borrow-n-Deliver service.\nBukit Batok resident Mary Aw, 58, said that compared with nearby malls such as Jem and Westgate in Jurong East, West Mall loses out in size, which may make the impact of any upgrade limited, as the mall cannot compete with the offerings of larger complexes.\n“Perhaps those living nearby will benefit most (from the revamp),” said the human resources manager, noting that the expanded food and beverage offerings may become the mall’s main draw.\nFellow resident Lee Jo May, 38, who visits the library about once a month, said she hopes the expanded space will house a cafe, so that library-goers can have some food as they read.\nThe mother of two, who works in sales, added that more seating in the library’s children’s section would also be welcome.", "url": "https://www.straitstimes.com/singapore/west-mall-s-revamp-to-wrap-up-in-2025-with-bukit-batok-library-to-double-in-size"}