{"authors": ["Zhaki Abdullah"], "date_download": "2024-10-12 14:00:50", "date_modify": "2024-10-12 14:00:50", "date_publish": "2023-05-19 20:30:00", "description": "The study took data from 3.2 million outpatient consultations to find prescription patterns and areas for improvement. Read more at straitstimes.com.", "filename": "singapore_health_overprescription-of-antibiotics-new-study-hopes-to-guide-use-in-primary-care-settings_1728741650.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/24/2023051719193045jon8259.jpg?VersionId=J.W5UfBzzc1CU5MTz3vNiTj9UPBkzDnJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_overprescription-of-antibiotics-new-study-hopes-to-guide-use-in-primary-care-settings_1728741650.html", "title": "Overprescription of antibiotics? New study aims to guide their use in primary care settings", "title_page": "Overprescription of antibiotics? New study aims to guide their use in primary care settings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Prescribing both oral and topical antibiotics for skin conditions during the same visit is discouraged, but a study has discovered an increase in instances of this practice, among other findings.\nThe dual prescription is discouraged due to a possible higher risk of antimicrobial resistance, which occurs when micro-organisms such as bacteria no longer respond to antibiotics, caused in large part by their overuse.\nThe study by National University Polyclinics (NUP), which was published in medical journal Antibiotics in April, aims to help guide the use of antibiotics here.\nIt is part of a bid to fight antimicrobial resistance in primary care settings. In Singapore, primary care is provided in polyclinics and clinics run by general practitioners.\nAntimicrobial resistance has been identified by the World Health Organisation as one of the top 10 global health threats. It is estimated that it could cause up to 10 million deaths worldwide per year by 2050 if not addressed.\nThe study looked at antibiotic prescriptions for adult patients at six NUP polyclinics between 2018 and 2021, drawing data from 3.2 million outpatient consultations during that time to identify prescription patterns and areas for improvement.\nIt found that the most common conditions receiving oral antibiotic prescriptions were those relating to skin and soft tissue, comprising 37.7 per cent of such prescriptions.\nThough prescribing both oral and topical antibiotics for skin conditions during the same visit is discouraged, the study noted a growing number of such dual prescriptions, making up 35.8 per cent of antibiotic prescriptions.\nCases of antibiotics given for respiratory infections, which previously made up the largest number, fell from 40.6 per cent of all antibiotic prescriptions in 2018 to 10.8 per cent in 2021, which was attributed to public health measures introduced to stop the spread of Covid-19.\nThe study also found the percentage of antibiotic prescriptions with undefined diagnoses had increased from 10.8 per cent to 17.2 per cent of all cases.\nOne of the study’s authors, NUP family physician Sky Koh, noted that doctors may not have documented the diagnosis for patients with chronic conditions who are prescribed antibiotics, leading to a gap in information.\n“That may make it difficult for us to determine what the antibiotics are actually prescribed for,” he said, noting that it was thus hard to ascertain the appropriateness of the prescription.\nFollowing the publishing of the findings, NUP will establish an outpatient antimicrobial stewardship programme to oversee the prescription of antibiotics.", "url": "https://www.straitstimes.com/singapore/health/overprescription-of-antibiotics-new-study-hopes-to-guide-use-in-primary-care-settings"}