{"authors": ["Ian Cheng"], "date_download": "2024-10-12 13:27:14", "date_modify": "2024-10-12 13:27:14", "date_publish": "2024-10-04 14:15:00", "description": "They are believed to be involved in more than 1,400 scam cases. Read more at straitstimes.com.", "filename": "singapore_teen-among-nearly-500-suspects-involved-in-scams-where-victims-lost-more-than-12-million_1728739634.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/04/2023102717513135gin1762.jpg.JPEG?VersionId=oOX.EPhdKT5jdveCpbpRPu9qfJuih6AH&h=a2889a54", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_teen-among-nearly-500-suspects-involved-in-scams-where-victims-lost-more-than-12-million_1728739634.html", "title": "Teen among nearly 500 suspects in scams where victims lost over $12 million", "title_page": "Teen among nearly 500 suspects in scams where victims lost over $12 million | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A teenager was among nearly 500 suspects rounded up by the police in a span of nearly three weeks for scams linked to losses of more than $12.2 million.\nA total of 339 men and 143 women, aged between 15 and 76, are assisting in investigations for their suspected involvement in scams as scammers or money mules, following a police operation from Sept 13 to Oct 3.\nThe 482 individuals are being investigated for the alleged offences of cheating, money laundering or providing payment services without a licence.\nThey are believed to be involved in more than 1,400 cases of scams, comprising mainly internet love scams, investment scams, friend impersonation scams, e-commerce scams, job scams and fake buyer scams.\nAnyone found guilty of cheating can be jailed for up to 10 years and fined. Those found guilty of money laundering can be jailed for up to 10 years, fined up to $500,000, or both.\nThe offence of carrying on a business to provide any type of payment service in Singapore without a licence carries a fine of up to $125,000, a jail term of up to three years, or both.\nThe police said they take a serious stance against anyone who may be involved in scams, and that perpetrators will be dealt with in accordance with the law.\nTo avoid being an accomplice to crimes, members of the public should always reject requests by others to use their bank accounts or mobile lines as they will be held accountable if these are linked to crimes, said the police.\nAnyone with information on scams may call the police hotline on 1800-255-0000 or submit information online at www.police.gov.sg/iwitness with the assurance of confidentiality.\nScams in Singapore hit a record high in 2023, with 46,563 reported cases – the highest number of cases since the police started tracking them in 2016. Scam victims in Singapore lost $651.8 million in 2023, bringing the total to more than $2.3 billion since 2019.", "url": "https://www.straitstimes.com/singapore/teen-among-nearly-500-suspects-involved-in-scams-where-victims-lost-more-than-12-million"}