{"authors": ["Goh Yan Han"], "date_download": "2024-10-12 13:53:07", "date_modify": "2024-10-12 13:53:07", "date_publish": "2023-10-07 17:24:00", "description": "The online survey polled more than 1,500 respondents across different age groups. Read more at straitstimes.com.", "filename": "singapore_politics_keeping-s-pore-society-fair-maintaining-country-s-edge-key-challenges-for-4g-leaders-pap-poll_1728741187.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/07/202310074465730963b82210-3d47-4d02-80dd-cb9e49d58ba2.jpg?h=1539ef8d", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_keeping-s-pore-society-fair-maintaining-country-s-edge-key-challenges-for-4g-leaders-pap-poll_1728741187.html", "title": "Keeping Singapore society fair, maintaining country’s edge key challenges for 4G leaders: PAP poll", "title_page": "Keeping Singapore society fair, maintaining country’s edge key challenges for 4G leaders: PAP poll | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singaporeans think that continuing to ensure a fair – but not welfare – society will be a key challenge for the fourth-generation (4G) leadership of the PAP, according to a recent online survey.\nThis challenge and the need to maintain Singapore’s competitive edge over other countries were seen by respondents across all age groups as focus areas for 4G leaders.\nBut in other areas, those polled who were aged 51 and above saw defence against external threats as more pertinent, while those aged 20 and below felt media management would be more of an issue.\nThe survey by the PAP Policy Forum (PPF), which was conducted from Sept 22 to Oct 2, polled more than 1,500 participants across different age groups.\nRespondents were asked to identify three out of eight areas of governance they considered most challenging for the 4G leadership.\nThese areas were identified by late Minister Mentor Lee Kuan Yew in the second volume of his memoirs published in 2000.\nOn Saturday, Minister for Communications and Information Josephine Teo revealed the survey results at a PPF dialogue at the Marina Bay Sands Expo and Convention Centre.\nShe said the same survey found differences in views among age groups. Among those aged 51 and above, the biggest challenges were defending Singapore against threats (58 per cent) and keeping the Government clean and capable (59 per cent).\nOn the other hand, defending Singapore against threats was not even among the top five challenges for those aged 20 and below, with only 24 per cent of respondents in this age group selecting this challenge.\nInstead, most of these young Singaporeans (57 per cent) felt the biggest challenge was to sustain a fair, but not welfare, society.\nAbout 56 per cent of these young respondents also felt that managing the media would be important. In contrast, only 13 per cent of those aged above 51 picked this option.\nThe dialogue was the second in a three-part series by the PPF to engage Singaporeans on the socio-political issues affecting their lives, while commemorating the birth centenary of the late Mr Lee.\nAbout 335 activists, retired MPs and invited members of the public attended the forum.\nMrs Teo said the differences among age groups are an important reminder that each generation has valuable insights, born of their unique conditions and experiences.\n“There’s so much to gain when we make the effort to hear each other out, getting a richer understanding of Singapore to move forward together,” said Mrs Teo, who is adviser to the PPF, in her opening remarks.\nThe session also saw an hour-long panel discussion moderated by Sembawang GRC MP Vikram Nair.\nWhile the discussion was anchored broadly around various topics of governance, the panellists all spoke of the challenges in engaging young people and the need to involve them in policymaking.\nPAP Sengkang GRC branch chairman Elmie Nekmat, an associate professor of communications and new media at the National University of Singapore, acknowledged the differences among different age groups.\nBut he said that in trying to reach out to younger people, one generation cannot try to become like another. He added that making policies more inclusive means people of different generations have to come together to make decisions.\nNanyang Technological University assistant professor of marketing Charlene Chen said that approaching young people in a top-down manner could put them off. Instead, it should be recognised that young people have a sense of agency.\n“Young people can actually achieve a lot, as long as you give them the chance to do that. Give them opportunities, give them the way to shine in whatever role they have, and encourage them and reinforce them,” she said.\nShe added that she had noticed young people’s fear of being associated with the establishment.\n“How are you going to make it look cool to serve society?” she asked. “That is a softer approach rather than talking down (to) them. Empathise with them, empower them, give them a sense of agency.”\nFormer PAP chairman Khaw Boon Wan, who is also chairman of SPH Media, spoke about the threats that Singapore faces – not just on the financial front, but also existential threats such as climate change.\n“We worry about sovereignty, protection and threats. But now, it is the whole planet that is at risk… The planet will be there, but humanity will probably be gone. So, how do we react to all these changes, and it is definitely much more challenging, because it requires cooperation from many parties,” he said.\n“While Singapore has a lot of disadvantages being a tiny red dot, actually within our DNA, there are many elements of survival skills which work for us as a small country, which will increasingly create value going forward into the future,” he added.\nPPF council member Marcus Loh, 40, spoke of the aspirations of his generation to create societal impact and celebrate excellence in diverse fields.\nThat was among the reasons he joined the party eight years ago, he said, starting in the Braddell Heights ward to help now Speaker of Parliament Seah Kian Peng.\nMr Loh is the director and head of strategic communication, public affairs and corporate marketing at digital transformation firm Temus. He has been active in Sengkang GRC, appearing in recent months with members of the PAP team at constituency events.\n“Today, I join my team of comrades in Sengkang, we’re taking the fight to the opposition,” he said.\n“We want to earn the trust of Singaporeans, and most importantly, we want to win the mandate, so we can be in the position to work hard, to serve and to take Singapore forward together.”\nWhen asked by The Straits Times about his current role in the constituency, he said he had been volunteering in Sengkang since July and directed further queries to the party headquarters.", "url": "https://www.straitstimes.com/singapore/politics/keeping-s-pore-society-fair-maintaining-country-s-edge-key-challenges-for-4g-leaders-pap-poll"}