{"authors": ["Ang Qing"], "date_download": "2024-10-12 13:52:50", "date_modify": "2024-10-12 13:52:50", "date_publish": "2024-04-27 05:00:00", "description": "These forest patches are crucial refuges for critically endangered wildlife, they say. Read more at straitstimes.com.", "filename": "singapore_environment_scientists-conservationists-call-for-mandai-tagore-forests-to-be-studied-as-potential-nature-parks_1728741170.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/27/Photo201Sabrina20Jabbar.jpg?VersionId=XY5iBrcbEBWsS0MzvTmW0tSgAM.Gf4Uc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_environment_scientists-conservationists-call-for-mandai-tagore-forests-to-be-studied-as-potential-nature-parks_1728741170.html", "title": "Scientists, conservationists call for Mandai, Tagore forests to be studied as potential nature parks", "title_page": "Scientists, conservationists call for Mandai, Tagore forests to be studied as potential nature parks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Some conservation scientists and nature lovers are renewing the call to protect forest patches in Mandai and Lentor by asking the Government to study the sites as potential nature parks.\nThese forests are crucial refuges for critically endangered wildlife such as the Sunda pangolin and the Raffles’ banded langur, acting as important buffers that shield Singapore’s largest nature reserve, the Central Catchment Nature Reserve, they said.\nTheir clarion call revives efforts to preserve forested land in the area which began as early as the 20th century.\nThis is among recommendations of a book titled Singapore Terrestrial Conservation Plan by nearly 40 scientists and conservationists here, who urged a national review of forested spaces currently zoned for development. The 171-page book assesses the national approach to dealing with nature on land, and will be launched on April 28.\nPrimatologist Andie Ang, who led the project with Herpetological Society of Singapore co-founder Sankar Ananthanarayanan, said Mandai forest and Tagore forest in Lentor were deemed by the conservationists as green spaces that should be prioritised for consideration as nature parks.\nDr Ang, who heads Mandai Nature’s primate conservation and Singapore programmes, said: “If Tagore forest is no more, the Raffles’ banded langur loses a significant portion of its habitat.”\nThe Republic’s population of the shy, leaf-eating monkey plunged to a worrying low of 10 in the 1980s, but has been making a gradual comeback with intervention from the authorities and organisations in Singapore and Malaysia, the only countries it can be found in.\nDespite optimism that the monkey’s numbers will grow to more than 150 here within the next two decades, the loss of unprotected habitat, like Tagore forest, poses the greatest threat to the species’ recovery, researchers found in 2023.\nThe forest is set to make way for future housing, according to the Urban Redevelopment Authority’s (URA) latest master plan that guides Singapore’s development in the medium term.\nSimilarly, part of Mandai forest, which is located next to Singapore’s animal parks, has been earmarked as a potential site for development.\nEcologist Lam Weng Ngai at NTU’s Asian School of the Environment, who co-wrote the book, said the part of Mandai forest dominated by local trees holds high conservation value because its system can absorb large amounts of planet-warming carbon, as well as shelter and feed native animals and plants.\nLeopard cats, sambar deer and pangolins are among such wild animals that have been sighted there.\nWhile the forest has been disturbed in the past by various factors like the construction of kampungs, if the area is left to recover, it can mature and increase in diversity and store more carbon over time, said Dr Lam.\nHe said: “Native species-dominated forest patches like those in the Mandai area are extremely valuable because they are habitats for a diverse array of native plants and animals, have the most promising ecological trajectories and are predicted to store the most carbon in the long run.”\nBird Society of Singapore president Keita Sin, who also contributed to the book, said the forest patches have hosted birds that are reliant on more mature forests in the Central Catchment Nature Reserve and they have also used these habitats to travel.\nIn northern Mandai, for instance, tiny populations of the brown and dusty blue short-tailed babbler have been sighted, he added.\nMr Sin said: “Giving (these sites) a nature park status will protect them from potential developments.”\nHowever, the writers have stopped short of calling for these spaces to be transformed immediately into parks.\nSaid Dr Ang: “Given the various land use needs in Singapore, it would be idealistic to turn all forested areas into nature parks.\n“In order to identify key areas that are potentially important for the preservation of nature and biodiversity in Singapore, we should first study and understand the areas better, before recommending their uplisting as nature reserves.”\nResponding to queries from The Straits Times about the recommendation, the URA and National Parks Board (NParks) said in a joint statement that statutory boards work closely with one another to “prioritise key biodiversity areas and enhance ecological connectivity upfront” in long-term plans.\nThey said NParks takes a science-based approach to strengthening connections used by wildlife to travel across the island based on the ecological profiling exercise, which mapped how vegetated plots around Singapore are linked to one another.\nThe authorities added: “However, given our physical constraints, there will be some greenfield sites (places that have not been previously built on) that we have to develop to meet our land use needs.\n“Any decision to proceed is made only after detailed study of the trade-offs and alternatives, including the assessment of ecological and biodiversity value.”", "url": "https://www.straitstimes.com/singapore/environment/scientists-conservationists-call-for-mandai-tagore-forests-to-be-studied-as-potential-nature-parks"}