{"authors": ["Theresa Tan"], "date_download": "2024-10-12 13:59:03", "date_modify": "2024-10-12 13:59:03", "date_publish": "2024-03-30 17:00:00", "description": "About 200 women have gone for elective egg freezing here since it was allowed in June 2023. Read more at straitstimes.com.", "filename": "singapore_i-don-t-want-to-regret-it-if-i-get-married-at-a-later-age-and-cannot-conceive-woman-who-froze-21-of-her-eggs_1728741543.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/30/2024030645359979img3648.jpg?VersionId=icNJtQn5lfXqq7RysL1dkkTPAZnKHaeC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_i-don-t-want-to-regret-it-if-i-get-married-at-a-later-age-and-cannot-conceive-woman-who-froze-21-of-her-eggs_1728741543.html", "title": "‘I don’t want to regret it if I get married at a later age and cannot conceive’: Woman who froze 21 of her eggs", "title_page": "‘I don’t want to regret it if I get married at a later age and cannot conceive’: Woman who froze 21 of her eggs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Ms Amanda Lin, a 37-year-old single, has 21 eggs banked up as an “insurance” plan of sorts to have children in the future.\nThe vice-president of forex and derivative sales at a bank said: “I don’t want to regret it if I get married at a later age and cannot conceive.\n“It’s good if I can find someone now, but as women get more independent, the role of a husband has also changed. You don’t want to rush into marriage for the sake of having a kid. You want somebody who can be a lifelong partner.”\nIn August 2023, she paid about $10,000 for a cycle of elective egg freezing at Virtus Fertility Centre Singapore and had 21 eggs frozen.\nMs Lin said the process was “pretty smooth sailing” for her, despite daily hormonal injections for eight or nine days to stimulate the production of more eggs.\nShe is among the about 200 women who have undergone elective egg freezing, which is performed for non-medical reasons, since it was allowed in Singapore in June 2023, Minister in the Prime Minister’s Office Indranee Rajah said on Feb 28.\nBefore this landmark move, women could freeze their eggs only for medical reasons, such as when they have to undergo chemotherapy, which could adversely affect their fertility.\nA woman is born with a finite number of eggs, with the number and quality of eggs declining as she ages. As such, the chances of a woman getting pregnant decreases as she ages, doctors say.\nEgg freezing preserves fertility as the age of the eggs remains unchanged from the moment they are frozen.\nThe move to allow elective egg freezing was announced in 2022 during the White Paper on Singapore Women’s Development. Minister of State for Social and Family Development Sun Xueling said then: “We recognise that there may be women who are not able to find a suitable partner when they are younger, but they still wish to be able to preserve the likelihood of conceiving when they marry later.”\nMinister for Communications and Information Josephine Teo has also said previously that the move to allow elective egg freezing is not about raising the total fertility rate (TFR), but “empowering women with choice”.\nThe resident TFR fell to below 1 for the first time in Singapore’s history in 2023, with preliminary estimates pegging it at 0.97.\nAt Thomson Fertility Centre, more than 100 women have undergone elective egg freezing since July 2023, said its in-vitro fertilisation (IVF) specialist Janice Tung.\nAt the KK Women’s and Children’s Hospital (KKH), up to four women a month, on average, undergo the procedure, and interest in it has not slowed down in 2024, said Associate Professor Sadhana Nadarajah, head of the KKH’s department of reproductive medicine.\nIn Singapore, women aged between 21 and 37 are allowed to undergo the procedure, though doctors interviewed say most of the women who do so are in their 30s.\nMost of these women are single, and working in professional jobs, they add.\nMr Tim Kwan, managing director for Asia at Virtus Health, said: “Most single women who freeze their eggs do so as an insurance policy, for when they eventually find a partner and decide to start a family, they would be able to utilise their eggs if natural conception does not occur.”\nVirtus Health is the parent company of Virtus Fertility Centre Singapore.\nDr Tung said some unmarried women choose to freeze their eggs as they are unsure if they want to have children, or they want to have children in a few years’ time, but they are concerned about their fertility declining with age.\nWhile in the minority, there are also married women who have gone for elective egg freezing here, doctors say.\nSome of these married women say they are not ready to have children yet, or they want to pursue further education or have career commitments as reasons for going through the procedure, Prof Sadhana said.\nOne of them is Ms Patrina Tan, who wed at the age of 28.\nNow 34, the product manager has tried to conceive unsuccessfully in the past three years – even after having surgery to deal with endometriosis, a condition that makes it harder for her to get pregnant.\nSo in August 2023, she froze her eggs to buy some time before she starts the IVF process.\nMs Tan said: “The trying for a baby was very trying. All the stresses and disappointment of not getting pregnant.\n“I feel I have to take a mental and emotional break before taking the next step.”\nShe had 12 eggs frozen and hopes to have two children.\nShe added: “Knowing that I have eggs in the bank helps me to feel more relaxed, instead of feeling the (biological) clock ticking. So now, we are planning when we want to do the IVF.”\nThe procedure is a costly one.\nFor example, a cycle of elective egg freezing costs about $10,000 to $11,000 at the National University Hospital (NUH) and between $15,000 and $18,000 at Thomson Fertility Centre.\nIt also costs at least $500 a year to store the eggs, depending on the fertility centre.\nWhile there is no age limit for when a woman must use her frozen eggs, Virtus Fertility Centre Singapore recommends storing the eggs for not more than 15 years as older women have a higher risk of age-related pregnancy complications, said Mr Kwan.\nDoctors also caution that the procedure is an invasive one that comes with surgical risks. Besides, freezing one’s eggs is no guarantee that the woman will be successful if she uses her eggs to try for a child, doctors add.\nFor one thing, medical research overseas has found that a very small proportion of women – less than 10 per cent – use their frozen eggs in the end.\nThese studies also found that the chance of a frozen egg leading to a baby being born is about 2 per cent to 12 per cent, Ms Sun has previously said.\nProfessor P.C. Wong, head of the NUH’s Division of Reproductive Endocrinology and Infertility, said: “A woman deliberately delaying child-bearing by using birth control methods cannot negate the effects of ageing on the quantity and quality of eggs.\n“We advise women to consider their fertility options early, and would caution against delaying decisions based solely on the availability of egg freezing.”", "url": "https://www.straitstimes.com/singapore/i-don-t-want-to-regret-it-if-i-get-married-at-a-later-age-and-cannot-conceive-woman-who-froze-21-of-her-eggs"}