{"authors": ["Kolette Lim"], "date_download": "2024-10-12 13:57:42", "date_modify": "2024-10-12 13:57:42", "date_publish": "2023-11-08 18:10:00", "description": "This will be the first open house under President Tharman Shanmugaratnam. Read more at straitstimes.com.", "filename": "singapore_istana-open-house-on-nov-12-to-celebrate-deepavali_1728741462.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/08/DJI0234.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_istana-open-house-on-nov-12-to-celebrate-deepavali_1728741462.html", "title": "Istana open house on Nov 12 to celebrate Deepavali", "title_page": "Istana open house on Nov 12 to celebrate Deepavali | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Istana will be opened to the public from 8.30am to 6pm on Sunday in celebration of Deepavali.\nVisitors can look forward to enjoying instrument, dance and band performances by students from the Nanyang Academy of Fine Arts, St Margaret’s School, Yishun Secondary School and Bukit Timah Primary School.\nThe Singapore Indian Fine Arts Society and Team Fusion, a band, will also be performing. Local award-winning flautists Ghanavenothan Retnam and Tan Qing Lun will showcase a fusion of Indian and Chinese classical music.\nVisitors will be able to participate in activities such as henna art, candle making and balloon sculpting. There will be food stalls, a food truck and merchandise booths with limited-edition souvenirs.\nVisitors can also join guided tours of the main building, where they will be able to view selected rooms and take a closer look at state gifts presented to Singapore leaders, from 9.30am to 5pm.\nGuided tours of the grounds showcasing Istana’s flora and fauna will be conducted from 10am to 4pm. Visitors can opt to wander and take in the scenic views on their own.\nThis will be the first open house at the Istana under President Tharman Shanmugaratnam.\nEntry is free for Singapore citizens and permanent residents.\nOther visiting adults will be required to pay an entrance fee of $10 per person. Children aged four to 12 will be charged $2 to enter. Tickets can be purchased at the entrance on the day of the event.\nAll proceeds from entry tickets, tours and booths will go towards charities supported by the President’s Challenge. Only cashless payments via credit and debit card or QR code will be accepted.\nEntry may be restricted due to bad weather or capacity.\nThe public can enter the Istana grounds via its main gate in Orchard Road, with Dhoby Ghaut being the nearest MRT station.", "url": "https://www.straitstimes.com/singapore/istana-open-house-on-nov-12-to-celebrate-deepavali"}