{"authors": ["Tay Hong Yi"], "date_download": "2024-10-12 13:53:04", "date_modify": "2024-10-12 13:53:04", "date_publish": "2024-04-23 17:10:00", "description": "Members of the work group and industry bodies were addressing concerns raised over the rules. Read more at straitstimes.com.", "filename": "singapore_jobs_aim-is-to-draw-more-people-into-workforce-says-workgroup-behind-new-rules-on-flexi-work-requests_1728741184.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/23/aiflexiwork230424.jpg?VersionId=Nbm1D0M8xCrMr1BKkG0PBZe63zKCQa7E", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_jobs_aim-is-to-draw-more-people-into-workforce-says-workgroup-behind-new-rules-on-flexi-work-requests_1728741184.html", "title": "Aim of new rules on flexi-work requests is to draw more people into workforce, says work group", "title_page": "Aim of new rules on flexi-work requests is to draw more people into workforce, says work group | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – New rules that say employers must fairly consider employee requests for flexible work arrangements are aimed at drawing in and retaining people who would otherwise not work, according to the work group behind the rules.\nThe Tripartite Guidelines on Flexible Work Arrangement Requests will help to unlock the potential of the local workforce, said a panel comprising members of the work group and industry bodies on April 23.\n“The guidelines are not meant to cast aside the strong work ethic that we have as a country that has got us where we are, and is, in fact, quite the opposite,” said Mr Edwin Ng, Singapore National Employers Federation (SNEF) honorary secretary and one of three co-chairs of the 11-strong work group.\nHe was responding, as part of the panel, to questions from the media alongside fellow co-chair, Minister of State for Manpower Gan Siow Huang, at the Ministry of Manpower headquarters in Havelock Road.\nMr Ang Yuit, president of the Association of Small and Medium Enterprises, and Mr Sim Gim Guan, SNEF’s executive director, rounded off the panel, which sought to address concerns raised after the announcement of the guidelines on April 15.\nThese include the risk of promoting offshoring of local jobs, ways to foster restraint and responsibility among both employers and employees, and the range of arrangements the guidelines cover.\n“I hope people will calm down and have a care to read the (tripartite guidelines),” said Ms Gan, who is also Minister of State for Education.\nOn offshoring, Mr Ng said businesses decide on their workforce profile based on where business needs lie, and where the required skilled talents are located, and not because of the existence of such guidelines.\nHe added that the work group preferred to let businesses decide what is best for their business.\nMr Ang expressed hope that the guidelines will expand the talent pool for roles small and medium-sized enterprises struggle to hire locally for, as well as improving manpower deployment, even as businesses offshore roles to manage costs and expand their reach.\nMs Gan said the productivity, skills and work ethic of local talent remain competitive, and that in-person interaction is also needed to foster teamwork, which keeps jobs in Singapore.\nOn worries that employers would be overwhelmed by requests that they must respond to come Dec 1, 2024, when the rules kick in, Mr Sim suggested employers put in place a thorough policy that communicates and clarifies job expectations.\nFor instance, if employees need to be physically present at certain shift timings to perform their role, employers could state upfront that the job is only available for those who can work during these shift timings, he said.\n“I think that will certainly clarify expectations, and to a large extent, will therefore manage some of these requests that actually cannot be accommodated.”\nMs Gan said the work group would work with the National Trades Union Congress on workshops and briefings to advise the labour movement’s members on what the guidelines are about and manage worker expectations.\nShe added that worries about workers misconceiving that flexible work arrangements necessarily mean working from home, or that it means working less, or that all workplaces must accede to these requests, could be what underpin employer concerns of a deluge.\nThe work group also clarified that the three categories of flexible work arrangements – flexi-place, flexi-time and flexi-load arrangements – as defined in the guidelines that employers must consider are not exhaustive.\nThis means that employers must respond within two months to all requests employees send in accordance with the rules.\nMs Gan said: “Actually if you just put them all in a combination type, or hybrid type, you can get many permutations of workplace flexibility. We maintain that we do not prescribe any form of flexible working arrangements, because it really doesn’t help in opening up the space for employers and employees to push boundaries and discuss what works for themselves and the business.”\nMr Ng said: “When employers accommodate flexibility, employees have to be flexible too, as businesses evolve, and sometimes some of the flexible work that’s accorded may not be a permanent feature.”\nMr Sim said: “Even for the same job role, it may not be the case that every individual gets the same kind of flexibility, partly because the moment one staff member is given a certain flexibility, the constraints that the employer now faces is different.”\nOne example of an arrangement that does not neatly fit into the three categories is a four-day work week with shorter total work hours but no reduction in pay, which the panellists urged caution on.\nMs Gan said workers seeking such an arrangement need to consider if net output from the employer would be affected if more people were not hired.\nShe added: “If there’s no negative impact, then, if the employer wants to accommodate that kind of flexibility, carry on. If there’s no drop in the productivity, the remuneration should also not be affected.\n“But if that form of four-day work week some people are asking for results in the employer having to go hire more people, (with an) increase in business costs, then, surely, the remuneration package will have to be reviewed for the person who wants to go on that form of four-day work week.”\nMr Sim said of the guidelines: “It is meant to maximise our workforce potential and not to try to reduce our overall capacity.”", "url": "https://www.straitstimes.com/singapore/jobs/aim-is-to-draw-more-people-into-workforce-says-workgroup-behind-new-rules-on-flexi-work-requests"}