{"authors": ["Mah Xiao Yu"], "date_download": "2024-10-12 13:56:37", "date_modify": "2024-10-12 13:56:37", "date_publish": "2023-12-07 23:45:00", "description": "Covid-19 cases doubled to 22,094 in the week of Nov 19 to 25 from the week before, MOH estimates. Read more at straitstimes.com.", "filename": "singapore_some-shops-run-out-of-art-kits-as-number-of-covid-19-cases-rises_1728741397.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/07/2023120772199264img9943.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_some-shops-run-out-of-art-kits-as-number-of-covid-19-cases-rises_1728741397.html", "title": "Some shops run out of ART kits as number of Covid-19 cases rises", "title_page": "Some shops run out of ART kits as number of Covid-19 cases rises | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Some pharmacies and stores have run out of antigen rapid test (ART) kits in the wake of rising Covid-19 cases here.\nA check at on Dec 6 found that a few outlets had run out of ART kits, and not all had been restocked when The Straits Times visited a day later.\nCovid-19 infections and hospitalisations are increasing. In the week ended Dec 2, 32,035 people were diagnosed with the virus – the highest number of infections recorded this year.\nThe Ministry of Health said that the increase in cases could be due to a number of factors, including waning population immunity and increased travel and community interactions during the year-end travel and festive season.\nFairPrice Group, which owns FairPrice supermarkets and Unity pharmacies, said it saw demand for ART kits more than double from October to November.\n“We are working closely with suppliers to ensure that there are sufficient ART kits available in our stores for all who need them,” it said.\nGuardian also said it had observed a “surge in demand” for ART kits over the past week, but assured customers that it has sufficient stock available. It said it has “swiftly scheduled regular restocks across all Guardian stores” to ensure their stores are well stocked.\nStore staff at the Guardian outlet in Junction 8 said their store had been out of ART kits for a few days. While they were expecting new stock, they were not sure when it would arrive.\nOne 7-Eleven outlet said the shop had run out of ART kits on Dec 6 and there was no restock scheduled on its system, while another at Braddell nearby had received a small restock of 10 boxes, each with two ART kits, on Dec 7. A staff member said customers would usually buy a few boxes at a time.\nTwo Watsons outlets each received a small restock of ART kits on Dec 7 as well. The kits are sold in boxes of 10, and a staff member said she expected the boxes to be sold out within a week.\nMeanwhile, Covid ART kits were also available at online shopping sites.", "url": "https://www.straitstimes.com/singapore/some-shops-run-out-of-art-kits-as-number-of-covid-19-cases-rises"}