{"authors": ["Amelia Teng"], "date_download": "2024-10-12 13:30:17", "date_modify": "2024-10-12 13:30:17", "date_publish": "2022-07-13 14:30:00", "description": "Since 2016, a total of 2,735 educators have taken part in the three-year programme. Read more at straitstimes.com.", "filename": "singapore_parenting-education_more-than-13-million-invested-in-training-early-childhood-educators-sun-xueling_1728739817.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/13/ac_preschool_130722.jpg?VersionId=Z.MVjbxNUotsSzh6SgQfx1OkDh9zhZEF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_parenting-education_more-than-13-million-invested-in-training-early-childhood-educators-sun-xueling_1728739817.html", "title": "Over $13 million invested in training early childhood educators: Sun Xueling", "title_page": "Over $13 million invested in training early childhood educators: Sun Xueling | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Early Childhood Development Agency (ECDA) has invested more than $13 million in the past six years to train more than 2,200 early childhood educators, said Ms Sun Xueling, Minister of State for Social and Family Development, on Wednesday (July 13).\nShe was speaking at ECDA's annual appointment ceremony, where 456 educators were appointed under its Professional Development Programme (PDP).\nSince 2016, a total of 2,735 educators - including those appointed during Wednesday's virtual event - have taken part in the three-year programme, which aims to help them progress in their careers and take on larger roles.\nAs at July, about 650 educators - including teachers and leaders - have completed the programme.\nMs Sun said that almost half of the pre-school teachers who have completed the PDP have taken on larger and more complex job roles by the end of the programme.\nThese include mentoring other educators and leading centre-wide initiatives.\nThere are three PDPs - for pre-school teachers, pre-school leaders and educarers, or staff who care for younger children up to the age of three.\nParticipants spend 180 hours over three years on courses and projects that will deepen their professional and leadership skills, and prepare them for more responsibilities at their workplace.\nCash rewards are given upon meeting certain milestones over the three years, totalling $12,000 for pre-school teachers and early years educators, and $15,000 for centre leaders.\nMs Sun said that developing early childhood professionals is a top priority for the Government, and it has recently launched several initiatives to guide educators and leaders in honing their craft.\nThis includes the Skills Framework for Early Childhood, which spells out the career pathways and competencies required for various job roles in the sector, and the Early Childhood Learning Communities for seasoned pre-school teachers to share know-how and experiences with their peers.\n“Raising the quality of early childhood professionals and programmes achieves two key objectives,” she said.\nThe first is ensuring that children receive early guidance and instruction that will help them to learn for life, as well as developing social and emotional competencies.\nThe second aim is “ensuring that our early childhood professionals have a rewarding career – both in terms of skills development and competencies, and also career and wage progression”, said Ms Sun.\n\"It is never easy juggling work and one's professional development at the same time. That's why I am heartened to see PDP participants not only committed to the three-year journey, but also intent on applying acquired skills and competencies to your work,\" she added.\nMadam Noorlinda Buang, 55, who finished the PDP for leaders last year, said she enjoyed her overseas study trip to Taiwan in 2019 as part of the programme.\n\"I was very inspired by the leaders of the pre-schools there, which took in children with special needs,\" said the centre principal of a PAP Community Foundation (PCF) Sparkletots centre in Jurong West.\n\"I felt more confident and inspired to support kids and their parents,\" she said. Her centre now has five children with special needs, and an assistant teacher who has mild intellectual disability.\nMadam Noorlinda joined the early childhood sector in 2004 after her warehouse supervisor husband was retrenched and she was looking for work. She had previously stopped working in the retail sector to take care of her four children.\nVolunteering with Mendaki was the first time she worked with young children.\n\"I was helping them with reading, preparing for Primary 1, knocking on doors to get children to go to school,\" she said.\nShe has since taken up several early childhood qualifications including two diplomas and a degree from private providers while working across several pre-schools in the last two decades.\nOne of her daughters, aged 24, is also working in PCF as an educarer.\n\"Being in this sector gives me a sense of satisfaction and pride, seeing the changes in the children,\" said Madam Noorlinda, who hopes to take up a course next year to learn more about children up to three years of age.\n\"It's also important to keep up with the times and be well-informed and resourceful. It makes you more worthwhile in the market and you can impart new things to the children.\"", "url": "https://www.straitstimes.com/singapore/parenting-education/more-than-13-million-invested-in-training-early-childhood-educators-sun-xueling"}