{"authors": ["Aqil Hamzah"], "date_download": "2024-10-12 13:57:32", "date_modify": "2024-10-12 13:57:32", "date_publish": "2023-09-24 09:00:00", "description": "These range from enhancements to the F-16 fighter jet, to a new automatic air-to-air refuelling system used by the A330 Multi-Role Tanker Transport. Read more at straitstimes.com.", "filename": "singapore_rsaf-unveils-upgraded-f-16-tanker-aircraft-at-us-exercise_1728741452.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/24/9B4A720820copy.jpg?h=99e1be77", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_rsaf-unveils-upgraded-f-16-tanker-aircraft-at-us-exercise_1728741452.html", "title": "RSAF unveils upgraded F-16, tanker aircraft at US exercise", "title_page": "RSAF unveils upgraded F-16, tanker aircraft at US exercise | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOUNTAIN HOME, Idaho – With a turn of their heads towards enemy targets, pilots commanding Singapore’s upgraded F-16 fighter jets can have their weapons point in the same direction.\nNo longer will they have to steer their aircraft towards threats in order to take aim, nor will they have to glance at their cockpits for vital information, as their helmets provide the necessary data.\nThis is made possible by an advanced display mounted on their headgear – one of several enhancements to the ageing F-16 platform, which first entered the Republic of Singapore Air Force’s (RSAF) service in 1998.\nSporting a longer-range radar system that allows pilots to detect and engage faraway targets, as well as a suite of modern-day weaponry including the Python-5 missile, which boasts a range of up to 20km, the upgraded F-16s made their debut at the unilateral Exercise Forging Sabre being held between Sept 11 and 30 in Idaho, in the United States.\nSpeaking to the media at Mountain Home Air Force Base last Thursday, Lieutenant-Colonel Tan Yong Chin, 37, said the upgraded fighter jet has improved integration with F-15SG fighters when conducting missions.\nF-16s previously lacked a data link, which the F-15SGs had, necessitating manual communication between the jets’ pilots.\nBut passing on a message too many times carries the risk of miscommunication, added the commander of the RSAF’s longest-running overseas detachment, Peace Carvin II.\nThrough a new data link capability, F-16 pilots are now able to share target information with other aircraft and ground forces and “effectively look at the same picture”, LTC Tan said.\n“But this time round, we can see a common picture, and a picture paints a thousand words.”\nLTC Tan, who has been an F-16 pilot since 2008, also highlighted a new central display panel in the plane’s cockpit, as a pilot demonstrated the upgraded jet’s capabilities on a prototype simulator developed by manufacturer Lockheed Martin.\nThis supplements two smaller panels located on either side, which pilots previously had to toggle between to view different screens. The larger third screen allows them greater flexibility to view information they need.\nBoosting the capability of RSAF jets is a new automated air-to-air refuelling system being used by the A330 Multi-Role Tanker Transport (MRTT).\nThe plane plays a crucial role in extending the endurance of friendly aircraft by refuelling them in the air, and this capability is further enhanced by the automated system, which Singapore is the first to adopt.\nCameras on the MRTT detect incoming aircraft seeking to refuel, with image processors helping to identify the receiver aircraft.\n“It’s very similar to your facial recognition,” said air refuelling operator, Second Sergeant Vikneshvar Vijayandhran, of the RSAF’s 112 Squadron, which operates the tanker.\nPrior to this, air refuelling operators had to manually connect the refuelling boom to the receptacle of another aircraft that has positioned itself behind the MRTT.\nSingapore media got a first-hand look at the automatic refuelling of F-16 fighter jets on board the MRTT last Thursday afternoon.\nLTC Daryl Yeo, 39, the squadron’s commanding officer, said the automated system is more precise and speeds up the refuelling process, as “computers can do things much faster than a human being”.\n2SG Vikneshvar, 25, said the precision of the automated system allows operators like himself to focus on other essential tasks, such as facilitating the flow of aircraft awaiting their turn to refuel, as well as reduces fatigue.\nDespite the tangible benefits of the system, having a human on hand to step in remains a necessity, he added.\n“There are certain things that we cannot instil within machines, such as safety instincts.\n“So even if the automatic air-to-air refuelling system is in play, the operator will always be on standby to monitor... just in case there are external factors, so that they can do a timely takeover.”", "url": "https://www.straitstimes.com/singapore/rsaf-unveils-upgraded-f-16-tanker-aircraft-at-us-exercise"}