{"authors": ["Lim Min Zhang"], "date_download": "2024-10-12 13:32:55", "date_modify": "2024-10-12 13:32:55", "date_publish": "2022-09-15 11:50:59", "description": "Vast majority of Singaporeans understand drugs are bad for society, says minister. Read more at straitstimes.com.", "filename": "singapore_spores-drug-policy-not-determined-by-external-parties-but-the-interest-of-its-citizens-shanmugam_1728739975.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/15/md_cannabis_15092022.jpg?VersionId=WF1dEiyiCockEoYKkdbmkKKzM5VTfbvr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_spores-drug-policy-not-determined-by-external-parties-but-the-interest-of-its-citizens-shanmugam_1728739975.html", "title": "S'pore's drug policy not determined by external parties, but the interest of its citizens: Shanmugam", "title_page": "S'pore's drug policy not determined by external parties, but the interest of its citizens: Shanmugam | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore's drug policy and penalties for drug abuse are determined by what the Republic considers to be the best interests of Singaporeans, and are not made in Kuala Lumpur or Bangkok, Home Affairs and Law Minister K. Shanmugam said on Wednesday.\nNeither are they dictated by anti-death penalty activists, or three or four international newspapers, he said in an interview with Bloomberg.\nMr Shanmugam was asked by Bloomberg Television's Haslinda Amin about the effect evolving stances in regional countries on the use of controlled drugs, such as cannabis, had on Singapore.\nThe greater availability of drugs creates more challenges but a vast majority of Singaporeans understand they are bad for society, he said.\nThailand legalised the consumption of cannabis in June, while Malaysian officials have reportedly been considering its medical use recently.\nMr Shanmugam said: \"There is a small group that thinks it ought to be legalised. And because of the portrayal in popular media, younger people - not the majority - tend to have a slightly different view of cannabis, and these are all challenges we have to deal with.\n\"But you know, (Singapore) government policy doesn't get made in Kuala Lumpur or Bangkok. Nor does it get dictated to by 400 people, or three or four international newspapers.\"\nHe cited negative effects observed in other countries, such as a rise in bombings by drug-linked gangs in Sweden and the opioid crisis in the United States, where deaths from drug overdose spiked in the last decade.\n\"You look at all of this, and you tell me that Thailand has allowed cannabis a couple of months ago, and Malaysia is talking about it. Let's look at the facts,\" said the minister.\nEarlier in the interview, Mr Shanmugam was asked what it would take for Singapore to change its stance on the death penalty.\nMs Haslinda cited human rights groups and British tycoon Richard Branson, who earlier this year urged clemency in the high-profile case of Nagaenthran K. Dharmalingam, a Malaysian who was executed in April for trafficking heroin to Singapore.\nMr Shanmugam replied that there is an assumption that significant discourse and public support against the death penalty exist here.\n\"When activists who are against (the) death penalty organised a protest, they claimed that 400 people turned up,\" he said in apparent reference to one such gathering at Hong Lim Park in April.", "url": "https://www.straitstimes.com/singapore/spores-drug-policy-not-determined-by-external-parties-but-the-interest-of-its-citizens-shanmugam"}