{"authors": ["Clara Chong"], "date_download": "2024-10-12 13:59:25", "date_modify": "2024-10-12 13:59:25", "date_publish": "2022-10-07 19:13:50", "description": "S'pore will move into a new phase of living with Covid-19. Read more at straitstimes.com.", "filename": "singapore_health_covid-19-vaccination-differentiated-measures-to-be-lifted-from-oct-10-as-spore-enters-new-phase-of-normalcy_1728741565.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/07/hzeat071022.jpg?VersionId=l8PGnEwo9KNJmi2L_sLLa5tEoDXhJt_X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_health_covid-19-vaccination-differentiated-measures-to-be-lifted-from-oct-10-as-spore-enters-new-phase-of-normalcy_1728741565.html", "title": "Covid-19 vaccination-differentiated measures to be lifted from Oct 10 as S'pore enters new phase of normalcy", "title_page": "Covid-19 vaccination-differentiated measures to be lifted from Oct 10 as S'pore enters new phase of normalcy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The country will move into a new phase of living with Covid-19 when vaccination-differentiated measures (VDS) are fully lifted from Oct 10.\nThe Ministry of Health (MOH) announced on Friday that VDS will no longer be required for events with more than 500 participants, nightlife establishments where there is dancing and dining at food and beverage establishments, including hawker centres.\nAddressing the latest move in a Facebook post, Health Minister Ong Ye Kung noted: \"This means that vaccination has become our primary defence against the virus.\"\nHe said: \"While the situation remains stable now, new and more dangerous variants may surface in the northern winter. We need to get ourselves properly vaccinated in anticipation of that scenario. Do so early, rather than try our luck and not strengthen our protection when we have the time and space to.\"\nAfter two years of putting up with restrictions to battle the Covid-19 virus, significant easing of safe management measures took place in late August, when masks were no longer required in most indoor settings except in healthcare settings and on public transport.\nAs things return to normalcy, the country will also transition to a new strategy of up-to-date vaccination, instead of counting the number of shots and boosters individuals receive. MOH said it will be similar to influenza vaccinations, where individuals are advised to take them periodically, so as to protect against new strains of the virus as they arise.\nFirst, those aged five and above should complete three mRNA or Novavax/Nuvaxovid doses, or four Sinovac-CoronaVac doses, to achieve minimum protection.\nSecond, after achieving minimum protection, those aged 50 and above should receive an additional booster dose between five months and one year from their last dose.\nIndividuals will be considered to be up to date with their Covid-19 vaccination if they have received at least the minimum protection and their last vaccine dose was received within the past one year.\nThe ministry will roll out vaccination and booster jabs for two groups of children from Oct 25:\n• Primary vaccination for children aged six months to four years. The Moderna vaccine is recommended for those aged six months to five years and the dosage is two doses of 25 micrograms each, spaced eight weeks apart.\nThe vaccine from Pfizer BioNTech/Comirnaty is a three-dose vaccine for children aged six months to four years and has been approved. It should be available by the end of the year.", "url": "https://www.straitstimes.com/singapore/health/covid-19-vaccination-differentiated-measures-to-be-lifted-from-oct-10-as-spore-enters-new-phase-of-normalcy"}