{"authors": ["Tham Yuen-C"], "date_download": "2024-10-12 13:46:57", "date_modify": "2024-10-12 13:46:57", "date_publish": "2021-01-05 18:56:00", "description": "TraceTogether collects only Bluetooth proximity data, not location data. Read more at straitstimes.com.", "filename": "singapore_politics_police-can-access-tracetogether-data-only-through-person-involved-in-criminal_1728740817.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/01/06/nz_tracetgt_060137.jpg?VersionId=g6znFx07KcFZnnEDutsLRU4ZhFCPnZfL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_politics_police-can-access-tracetogether-data-only-through-person-involved-in-criminal_1728740817.html", "title": "Police can access TraceTogether data only through person involved in criminal probe: Vivian Balakrishnan", "title_page": "Police can access TraceTogether data only through person involved in criminal probe: Vivian Balakrishnan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Foreign Minister Vivian Balakrishnan told Parliament on Tuesday (Jan 5) that the police can access TraceTogether data only by requiring a person involved, or assisting, in a criminal investigation to produce his smartphone or his token.\nThe minister said that he had not contemplated the implications of the Criminal Procedure Code (CPC) when he said at a press conference in June that TraceTogether data would be used \"purely for contact tracing, period\".\n\"Frankly, I had not thought of the CPC, when I spoke earlier,\" he said, a day after Minister of State for Home Affairs Desmond Tan affirmed that under this law, police have the power to obtain TraceTogether data for the purposes of a criminal investigation.\nMr Tan's remarks, made in response to a parliamentary question, had sparked criticism among some people, who accused the Government of not being open earlier that the data could be used in such a situation.\nIn online discussions, some netizens had cited a June 8 press conference by the multi-ministry task force on Covid-19, during which Dr Balakrishnan made his remarks on TraceTogether's privacy policy.\nAddressing the issue in the House on Tuesday, Dr Balakrishnan, who is Minister-in-charge of the Smart Nation Initiative, acknowledged that he had \"misspoken\" and said he wanted to discuss the matter openly and transparently.\n\"After I realised that the CPC applied to this, I did have sleepless nights wondering: Should I try to persuade my colleagues to change the law?\" he added.\n\"But having thought about it, discussed, consulted people both within and outside this House, I've come to the conclusion that right now, we are doing well. We are able to keep Singapore safe, we are able to deal with the current crisis,\" he said.\n\"And so long as this Government is able to maintain our reputation for openness, transparency, reliability, I think we are still on the right track.\"\nSection 20 of the CPC empowers the police to order the \"production of any document or other thing\" for the purposes of criminal investigations.\nCiting this, Dr Balakrishnan said the data collected by TraceTogether is not exempt from these provisions.\nHe noted that other forms of sensitive data which may be protected by privacy laws, such as phone or banking records, are similarly subject to these provisions.\n\"The police must be given the tools to bring criminals to justice and protect the safety and security of all Singaporeans,\" he added.\n\"And especially in very serious cases, and where lives are at stake, it is not reasonable for us to say that certain classes of data should be out of reach of the police.\"\nAsked by Non-Constituency MP Leong Mun Wai how many times the police had relied on TraceTogether data in criminal investigations, Dr Balakrishnan said there has been one such instance, in a murder case.\nThe minister also assured Singaporeans that the Government had been conscious of the need to protect the personal privacy of TraceTogether users.\nThis is reflected in the design and the code of TraceTogether, which collects only Bluetooth proximity data as opposed to location data, he said.\nThe data collected is also encrypted and stored on a person's phone, unless it is required for contact tracing, and is automatically purged after 25 days.\n\"It does not collect and I want to emphasise, it does not collect GPS location data, no movement data. So let me reiterate this, the TraceTogether app, and the token, were not designed to allow any government agency to track the user,\" he said.\n\"We have taken efforts, maximum efforts, to protect privacy while enabling contact tracing to be facilitated through digital means.\"\nDr Balakrishnan also said that when the pandemic was over, the TraceTogether programme would be stood down, and much of the data would be deleted. He said the Ministry of Health may retain epidemiological data, but that it would be anonymised and randomised with no identification data.\nHe added the police's powers to access TraceTogether data would be \"exercised judiciously\" and \"with utmost restraint\", and the CPC would only be invoked for such use in serious cases.\nThat 78 per cent of people here have chosen to download the TraceTogether app or use the token \"reflects not only their willingness to play a part in our collective fight against Covid-19, but also their confidence in the Government's commitment to protect the data so collected\", he added.\n\"We do not take the trust of Singaporeans lightly. We cannot prevail in the battle against Covid-19 if Singaporeans did not trust the public health authorities, and the Government of Singapore,\" he said.\n\"I want to again assure Singaporeans that your confidence is not misplaced. We will protect your privacy.\"", "url": "https://www.straitstimes.com/singapore/politics/police-can-access-tracetogether-data-only-through-person-involved-in-criminal"}