{"authors": ["Syarafana Shafeeq"], "date_download": "2024-10-12 13:56:27", "date_modify": "2024-10-12 13:56:27", "date_publish": "2022-12-19 20:35:55", "description": "Many who were involved had gone beyond their call of duty, PM Lee noted. Read more at straitstimes.com.", "filename": "singapore_first-look-at-medal-for-those-who-helped-sg-s-fight-against-covid-19_1728741387.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/20/dw-ssmedal-221219_0.jpg?VersionId=tqQeR.OnFL9OwOSAG6sACpUzSI2JXBMo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_first-look-at-medal-for-those-who-helped-sg-s-fight-against-covid-19_1728741387.html", "title": "First look at medal for those who helped Singapore’s fight against Covid-19", "title_page": "First look at medal for those who helped Singapore’s fight against Covid-19 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Details about a new special state award to be given to those who helped in the fight against Covid-19 have been announced, including a first look at its design.\nThe Covid-19 Resilience Certificate and Medal was announced by Prime Minister Lee Hsien Loong in his National Day Rally (NDR) speech in August.\nThe certificate may be awarded to a group that has collectively contributed to Singapore’s fight against the pandemic, while the medal may be awarded to an individual.\nA first look at its design was posted on the Government Gazette on Monday.\nThe medal is a silver disc encircled by eight arrows pointing towards its centre. Its front side bears a crescent and five stars, with the words “Covid-19” and “Resilience Medal”, while its reverse side holds the state crest encircled by the words “SG United” and “Stronger Together”.\nThose who made exceptional contributions will receive existing state awards such as the Commendation Medal, the Public Service Medal and the Public Administration Medal. These will be modified, with the word “Covid-19” added.\nAll medals awarded for Covid-19 contributions will have a ribbon that has a thin red line at its centre, flanked on each side by a strip of white, light turquoise and dark turquoise.\nIn his rally speech, PM Lee had jokingly suggested having two red lines on the ribbon to represent the lines of a positive antigen rapid test result.\nHe also noted that many involved in the fight against Covid-19 had gone beyond their call of duty, including healthcare workers, public officers, non-governmental organisations and countless individuals from all walks of life.\nHe paid tribute to individuals who had gone the extra mile, such as retiree Alice Chua, who volunteered at vaccination centres and took fellow seniors to their appointments, and Dr Norhisham Main from Ng Teng Fong General Hospital, who would regularly interact with the community to explain the Covid-19 situation and dispel fears and concerns about the virus.\nPM Lee said award recipients would be announced at the end of the year, with award ceremonies held in 2023.", "url": "https://www.straitstimes.com/singapore/first-look-at-medal-for-those-who-helped-sg-s-fight-against-covid-19"}