{"authors": ["Salma Khalik"], "date_download": "2024-10-12 13:28:46", "date_modify": "2024-10-12 13:28:46", "date_publish": "2024-09-17 16:45:00", "description": "The limit of 30 units is less than 10% of the roughly 400 a month the private cord blood bank used to get. Read more at straitstimes.com.", "filename": "singapore_cordlife-resumes-services-with-prices-reduced-20-25-but-intake-capped-by-moh-at-30-units-a-month_1728739726.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/skcord.0d3e218e.Attachment.051555.jpg?VersionId=tJ.xDGV_ZY0oOy4t4lVX53tE4fqFZ2ei", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_cordlife-resumes-services-with-prices-reduced-20-25-but-intake-capped-by-moh-at-30-units-a-month_1728739726.html", "title": "Cordlife resumes services with prices reduced 20-25%, but intake capped by MOH at 30 units a month", "title_page": "Cordlife resumes services with prices reduced 20-25%, but intake capped by MOH at 30 units a month | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Cordlife resumed its cord blood banking services on Sept 15 after a hiatus of 9½ months, during which it overhauled its facilities and operations to meet the standards required by the Ministry of Health (MOH).\nThe green light it has received from the ministry comes with caveats, including being allowed to receive no more than 30 new cord blood units (CBUs) a month for the first six months. This is less than 10 per cent of the roughly 400 units a month that it used to get.\nThe majority of parents sign up to bank their babies’ cord blood in the third trimester of pregnancy, so it will likely be a month or so before Cordlife starts receiving new CBUs when the babies are born.\nMOH shut down the firm’s operations on Nov 30, 2023, after finding that seven of its 22 storage tanks had been exposed to temperatures above minus 150 deg C, which could result in damage to the stem cells in the cord blood, making them non-viable.\nCord blood contains stem cells that may be used to treat blood diseases and some cancers, such as leukaemia and lymphoma, should the baby develop these illnesses later in life.\nOf the 35 units withdrawn from Cordlife since it was set up in 2001 as the first cord blood bank in Singapore, 15 were taken out as the parents wanted to use the cord blood to treat the child’s autism, while 11 units were used for cerebral palsy and five for leukaemia. The other four were for neuroblastoma, aplastic anaemia, global development delay and hypoxic-ischaemic encephalopathy.\nGroup executive director Chen Xiaoling said the company has already received a few new customers, who signed up on Sept 16.\nCordlife has reduced its pricing by about 20 per cent to 25 per cent compared with what it was charging in 2023 before the troubles surfaced. Now, the cost of storing CBU for 21 years is $4,399 if the customer pays in full, compared with $5,600 charged in 2023. Prices exclude GST.\nOutlining measures the firm has taken to rectify the problems, group chief executive Ivan Yiu said: “We did a full investigation to understand the root cause of the incident. This was done together with the MOH. We found there were certain shortcomings within the organisation, with regard to the technical expertise. We also strengthened our internal processes and implemented protocols.”\nMOH had found that seven storage tanks and a dry shipper meant for short-term storage while cord blood units are being transported might have been compromised.\nInitial audits found that the 2,200 CBUs in one of the tanks had been damaged, and were unlikely to be suitable for stem cell transplant purposes.\nAfter further investigations, MOH deemed that about 5,300 CBUs stored in another tank and the dry shipper were also “non-viable as they are unlikely to be suitable for stem cell transplant purposes”. It found that eight out of 12 samples from the tank and five out of 12 samples from the dry shipper had failed tests.\nMOH added in a statement in April: “The remaining five tanks have been assessed to be at low risk of being adversely affected by the temperature warming events. MOH’s experts have recommended that Cordlife test a larger number of CBUs in these five tanks to obtain a more statistically significant result and further ascertain the status of the CBUs stored in these tanks.”\nThe company has contacted all its affected clients. It has come to an agreement with about half, and is still in discussion with the rest.\nMr Yiu said all the CBUs in the affected tanks are still being stored, unless requested otherwise by the client, as some CBUs may still be viable. This will be known only when they are withdrawn for use and tested.\nShould such CBUs not be suitable for use, there is a warranty clause where the company will source a compatible CBU for the client.", "url": "https://www.straitstimes.com/singapore/cordlife-resumes-services-with-prices-reduced-20-25-but-intake-capped-by-moh-at-30-units-a-month"}