{"authors": [], "date_download": "2024-10-12 13:32:36", "date_modify": "2024-10-12 13:32:36", "date_publish": "2023-01-21 20:07:07", "description": "He was expected in court in October 2022 for a pre-trial conference, but did not turn up for the hearing. Read more at straitstimes.com.", "filename": "singapore_courts-crime_singaporean-nabbed-in-thailand-wanted-for-cheating-and-drug-related-offences-police_1728739956.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/21/accourt_0.jpg?VersionId=iKRpeGuIa3hElfSVAdBpaYzNDWdku_8I", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_singaporean-nabbed-in-thailand-wanted-for-cheating-and-drug-related-offences-police_1728739956.html", "title": "Singaporean nabbed in Thailand wanted for cheating and drug-related offences", "title_page": "Singaporean nabbed in Thailand wanted for cheating and drug-related offences | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A man arrested in Thailand for immigration offences is wanted in Singapore and left the Republic illegally while facing charges for cheating and separate drug-related offences.\nIn a statement on Jan 21, the police said Ong Jian Zhen was charged on October 8, 2021 with being involved in a case of cheating.\nOng’s passport was impounded and he was released on bail on October 15, 2021.\nHe was expected back in court on October 8, 2022 for a pre-trial conference for the cheating case as well as separate drug-related offences but he did not turn up for the hearing.\nA warrant for his arrest was issued the next day, the statement said.\nThe police, who had been looking for Ong to help in investigations involving several other cases, were informed of his arrest in Thailand for immigration offences in November 2022.\nSince then, the police have been working with the Thai authorities as part of their investigations involving Ong, the statement added.\nThe police said Ong is believed to have left Singapore illegally, and investigations into his alleged illegal departure are ongoing.\nOng was arrested at a condominium in the Huai Kwang district of Bangkok on Jan 12.\nAccording to the Bangkok Post, he was arrested for using a fake passport to enter Thailand on October 26, 2022. But he escaped after he was released on bail. An arrest warrant was issued for him on Dec 19.\nA 28-year-old Thai woman was arrested with Ong at the condominium unit, with officers also seizing drugs that included a sachet of crystal methamphetamine and two sachets of ketamine.", "url": "https://www.straitstimes.com/singapore/courts-crime/singaporean-nabbed-in-thailand-wanted-for-cheating-and-drug-related-offences-police"}