{"authors": ["Shaffiq Alkhatib"], "date_download": "2024-10-12 13:34:35", "date_modify": "2024-10-12 13:34:35", "date_publish": "2024-09-30 16:30:00", "description": "The men allegedly committed the offences on Sept 22. Read more at straitstimes.com.", "filename": "singapore_courts-crime_little-india-fatal-brawl-3-men-accused-of-rioting-handed-assault-charges_1728740075.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/30/aimurdercol3009242028129.jpg?VersionId=SAGzxVPAW69n63L1XvNSUCOa_jAad7xu&h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/singapore_courts-crime_little-india-fatal-brawl-3-men-accused-of-rioting-handed-assault-charges_1728740075.html", "title": "Little India fatal brawl: 3 men accused of rioting handed assault charges", "title_page": "Little India fatal brawl: 3 men accused of rioting handed assault charges | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Two men, said to be involved in a fatal brawl in Little India, are now accused of assaulting a man who was later killed by their alleged accomplice.\nPradave Shashi Kumar, 20, and Kirrthik Roshan Prem Ananth, 22, who were earlier charged with rioting, were handed assault charges on Sept 30.\nThe pair and Muhammad Sajid Saleem, 22, who faces a murder charge, are accused of using a chair to hit Mr Dhinessh Vasie, 25, at Kim Sam Leng Eating House in Verdun Road at around 4am on Sept 22.\nCourt documents did not disclose what happened next but Sajid is the only one accused of murdering Mr Dhinessh.\nAnother man, Satish Jason Prabahas, 23, who was earlier charged with rioting, was also handed an assault charge on Sept 30.\nSatish, Sajid and Kirrthik allegedly used a chair to hit another man, 24, at a back alley in nearby Sam Leong Road that morning.\nSatish and Pradave now face two charges each. They are accused of one count each of rioting and assault.\nKirrthik currently faces two counts of assault and one count of rioting.\nThe men and two 24-year-old women – Nur Diyana Harun Al Rasheed and Kasthuri Kallidas Marimuthu – are accused of rioting in the vicinity of Verdun Road on the day of Mr Dhinessh’s murder.\nEach woman was offered bail of $30,000 on Sept 30 and their cases have been adjourned to Oct 28.\nThe four men were not offered bail and their cases will be mentioned again in court on Oct 4.\nFor each count of assault, an offender can be jailed for up to seven years, fined, caned or receive any combination of such punishments.\nThose convicted of rioting while armed with deadly weapons can face up to 10 years’ jail and caning. Women, however, are exempted from caning.\nIf convicted of murder, Sajid will face the death penalty.", "url": "https://www.straitstimes.com/singapore/courts-crime/little-india-fatal-brawl-3-men-accused-of-rioting-handed-assault-charges"}