{"authors": [], "date_download": "2024-10-12 13:27:08", "date_modify": "2024-10-12 13:27:08", "date_publish": "2024-08-17 06:02:30", "description": "Fortnite-maker's store allows users to bypass the app stores run by Apple and Google. Read more at straitstimes.com.", "filename": "tech_tech-news_epic-launches-own-app-store-fortnite-is-back-for-iphones-in-europe_1728739628.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/17/2024-07-05T112604Z226336102RC2YO8APQKDRRTRMADP3EPIC-GAMES-APPLE.JPG?VersionId=JXcSfXnfcEiXnP1btiDH9qOAWfx.6N1O", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_tech-news_epic-launches-own-app-store-fortnite-is-back-for-iphones-in-europe_1728739628.html", "title": "Epic launches own app store, Fortnite is back for iPhones in Europe", "title_page": "Epic launches own app store, Fortnite is back for iPhones in Europe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Fortnite-creator Epic Games launched its own app store on Aug 16 that allows users to bypass the stores run by Apple and Google after waging a years-long battle to directly offer its games to smartphone users.\nThe Epic Games Store is available to users of Android phones worldwide and for iPhone and iPad users in Europe.\nThe launch of the store comes after Epic waged legal battles and lobbied regulators to loosen the grip of Apple and Google on the sale of apps for phones running their operating systems.\n“We’re very happy to be on the verge of launching our games on iOS and Android, enabled by Europe’s new DMA law,” Epic’s chief executive Tim Sweeney told journalists, from the company’s office in Sweden.\nThe EU’s new law, known as the Digital Markets Act (DMA), has forced Apple to make the opening to app developers in Europe, but the US firm is not doing so elsewhere.\n“The DMA required us to enable new capabilities for developers in the EU, and we have worked to make them as easy as possible for users while also trying to protect their privacy and security,” Apple said on Aug 16.\nThe EU’s internal market commissioner Thierry Breton posted on X that “Yes, gamers, Europe means more #FREEDOM & choice!”\nFortnite is also making a return to iPhones and iPads after having been banned in 2020 for seeking to circumvent Apple’s payment systems.\nEpic in 2020 launched a case aimed at breaking Apple’s grip on the App Store, accusing the iPhone maker of operating a monopoly in its shop for digital services.\nBut it lost its challenge to Apple taking a cut of as much as 30 percent on all financial transactions in its app shop in a US federal court. In January the US Supreme Court declined to hear the case, effectively ending the legal saga.\nApple has justified the fees as helping ensure dangerous apps are weeded out and the operating system is secure.\n‘Friction’\nEpic is the first major video game publisher to open its own app store for Android and Apple devices.\nIn order to attract app developers to its store, Epic is offering them better revenue-sharing terms than Apple or Google.\nBut Epic said Apple wasn’t making it easy, with a long and untransparent procedure to install their app store and disadvantageous conditions for developers to cooperate with them.\nWhen announcing last week that it would comply with the new EU regulations Apple said it would implement a new fee structure for developers who send customers out of an app for offers and content.\nEpic has set a goal of 100 million installs of its app store on Android and iOS devices by the end of the year.\n“The only thing standing in our way is going to be the friction that Apple and Google put in front of us, and it’s pretty significant,” said Mr Steve Allison, head of the Epic Games Store.\nIn addition to Fortnite, Rocket League Sideswipe is also available on the store, as is Fall Guys, which is making its first appearance on mobile.\n“This is just the beginning of a long effort to bring our games back to all these platforms worldwide, and the fight’s not over until Fortnite is back on iOS everywhere and free of Apple’s taxes,” said Sweeney. AFP", "url": "https://www.straitstimes.com/tech/tech-news/epic-launches-own-app-store-fortnite-is-back-for-iphones-in-europe"}