{"authors": [], "date_download": "2024-10-12 13:27:06", "date_modify": "2024-10-12 13:27:06", "date_publish": "2024-09-19 11:39:00", "description": "Palworld is still in development but an “early access version” costs US$29.99 (S$38.88). Read more at straitstimes.com.", "filename": "tech_tech-news_nintendo-sues-pokemon-with-guns-maker-for-patent-infringement_1728739626.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/19/US-JAPAN-INTERNET-GAMES-TECHNOLOGY-023200.jpg?VersionId=iKNNVlIfp3N0a_JoCt.06aFHbUuuehpW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_tech-news_nintendo-sues-pokemon-with-guns-maker-for-patent-infringement_1728739626.html", "title": "Nintendo sues ‘Pokemon with guns’ maker for patent infringement", "title_page": "Nintendo sues ‘Pokemon with guns’ maker for patent infringement | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Japan’s Nintendo said on Sept 19 it has filed a lawsuit accusing the developer of a video game jokingly dubbed “Pokemon with guns” of patent infringement.\nNintendo and The Pokemon Company are suing Pocketpair, the Japan-based studio behind the Palworld game that became a viral hit when its prototype was released in January.\nPalworld – which sold more than five million copies in just three days – features weapons-wielding player avatars and monsters that look similar to the creatures of Nintendo’s wildly popular Pokemon franchise.\nA Nintendo statement said the companies “filed a patent infringement lawsuit in the Tokyo District Court against Pocketpair” on Sept 18.\n“This lawsuit seeks an injunction against infringement and compensation for damages on the grounds that Palworld… infringes multiple patent rights,” it said.\nThe statement did not specify how much compensation was being sought.\nNintendo added it would “take necessary actions against any infringement of its intellectual property rights” to protect what it has “worked hard to establish over the years”.\nPalworld is still in development, but an “early access version” costs US$29.99 (S$38.88) for American customers on the online Steam platform.\n“Fight, farm, build and work alongside mysterious creatures called ‘Pals’ in this completely new multiplayer, open world survival and crafting game,” according to its description.\nInitial reviews of the game were positive, although many pointed out the eerie resemblance of the Pals to Pokemon characters, with critics and users nicknaming it “Pokemon with guns”.\n“Most people, myself included, thought this game was going to be a meme,” the account of game developer Pirate Software said in one review left on Steam.\n“It’s actually insanely detailed, extremely well optimised and compelling as hell.”\nPokemon has been a global hit since it was launched as a role-playing game in 1996 for Nintendo’s Game Boy console.\nThe franchise, whose slogan is “Gotta Catch ’Em All”, also includes movies and a hugely popular animated TV show. AFP", "url": "https://www.straitstimes.com/tech/tech-news/nintendo-sues-pokemon-with-guns-maker-for-patent-infringement"}