{"authors": [], "date_download": "2024-10-12 13:27:41", "date_modify": "2024-10-12 13:27:41", "date_publish": "2023-10-04 04:45:01", "description": "Subscribers could pay €10 (S$14) a month for Instagram or Facebook on desktops. Read more at straitstimes.com.", "filename": "tech_tech-news_meta-plans-to-charge-europeans-for-ad-free-facebook-and-instagram-says-source_1728739661.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/04/2023-08-18T175001Z1863327036RC2GQ2APTPIARTRMADP3CANADA-WILDFIRES-META.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_tech-news_meta-plans-to-charge-europeans-for-ad-free-facebook-and-instagram-says-source_1728739661.html", "title": "Meta plans to charge Europeans for ad free Facebook and Instagram, says source", "title_page": "Meta plans to charge Europeans for ad free Facebook and Instagram, says source | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Meta is proposing to offer European users a subscription-based version of Instagram and Facebook if they would rather not be tracked for ads, a source said on Tuesday.\nThe idea, first reported by the Wall Street Journal, comes as the social media giant seeks to comply with a growing list of EU regulations designed to curb the power of US big tech.\nThe company founded by Mark Zuckerberg makes its billions of dollars in profit by offering advertisers highly individualised data on users, but new European regulations and EU court decisions have made that harder.\nThe proposal has been put to EU regulators and is another example of big tech companies having to adapt long-held practices to meet oncoming EU rules.\nThe source close to the matter said subscribers in Europe could pay €10 (S$14) a month for a desktop version of Instagram or Facebook, or €13 a month for Instagram on their phones.\nSocial media platforms have increasingly floated the idea of charging users for access to their sites, whether to comply with data privacy regulations or better guarantee the identity of users.\nBut the practice would be a major shift for the social media industry that grew exponentially over the past decade on an advertising model that made the site free for users in return for being tracked and ads seen highly personalised.\nThe proposal could help meet several regulations including the Digital Markets Act that imposes a list of do’s and don’ts on big tech companies in Europe, including a ban on tracking users when they surf other sites if their consent hasn’t been clearly granted.\nIt also follows the recommendation of the EU’s highest court, which in a July decision said that Meta platform users who declined to be tracked should be offered an ad free alternative “for an appropriate fee.”\nThat ruling echoed many previous rulings against Meta and other big tech firms in which the court ruled that the US company must ask for permission to collect large amounts of personal data, striking down various workarounds that Meta had offered.\nMeta declined to comment directly on the Wall Street Journal report, but said in a statement that it still “believes in the value of free services which are supported by personalised ads.”\n“However, we continue to explore options to ensure we comply with evolving regulatory requirements.”\nMeta reported second-quarter revenues of US$32 billion, of which US$31.5 billion came from advertising. Some US$7.2 billion of that came from Europe. AFP", "url": "https://www.straitstimes.com/tech/tech-news/meta-plans-to-charge-europeans-for-ad-free-facebook-and-instagram-says-source"}