{"authors": [], "date_download": "2024-10-12 13:27:11", "date_modify": "2024-10-12 13:27:11", "date_publish": "2024-07-06 09:15:00", "description": "To “Zuck-ologists”, the clip was yet another example of the Meta CEO’s attempt to remake his image. Read more at straitstimes.com.", "filename": "tech_tech-news_mark-zuckerberg-s-surf-video-gets-lots-of-likes-but-not-from-elon-musk_1728739631.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/06/wgt-marksurf-060724.jpg?VersionId=wgXTAboM.yCxdPJr_l6Z5XolesJLeoxQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_tech-news_mark-zuckerberg-s-surf-video-gets-lots-of-likes-but-not-from-elon-musk_1728739631.html", "title": "Mark Zuckerberg’s surf video gets lots of likes (but not from Elon Musk)", "title_page": "Mark Zuckerberg’s surf video gets lots of likes (but not from Elon Musk) | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "As Fourth of July celebrations commenced across the US, Meta chief executive officer Mark Zuckerberg dropped a video on his Instagram account that immediately generated hundreds of thousands of views. Indeed, the clip seemed designed for warp speed virality.\nBehind a fast-moving boat, Mr Zuckerberg wakeboards while wearing a tuxedo and sunglasses as he sips a drink. The clip is set to singer Bruce Springsteen’s 1984 anthem Born In The USA. For its half-minute duration, the multi-billionaire shows off his surf technique.\n“Amazing!” commented Ms Lauren Sanchez, the fiancee of Amazon CEO Jeff Bezos.\nA gaming influencer, @StoneMountain64, wrote: “Now that’s content.”\nMr Zuckerberg replied: “Just doing my part.”\nTo “Zuck-ologists”, the clip was yet another example of the 40-year-old executive’s attempt to remake his image.\nIn recent years, he has gone from a flip-flop-and-hoodie-wearing tech entrepreneur to a sleeker, British billionaire Richard Branson-esque figure, one who wears Brunello Cucinelli T-shirts and a silver chain, and he has immersed himself in mixed martial arts.\nAs one commenter on the social platform X put it: “The PR team rehabbing Zuck continues their undefeated streak.”\nThe video was a sequel of sorts to the one Mr Zuckerberg posted on July 4, 2021. That one showed him aboard a moving hydrofoil while carrying an American flag to the soundtrack of singer John Denver’s 1971 hit Take Me Home, Country Roads.\nIn 2022, he posted a picture of himself wearing an American flag cowboy hat as he grilled sausages. “Smoking these meats,” he wrote in a caption. “Happy 4th!”\nThe 2023 post featured a candid shot of Mr Zuckerberg and his family.\nIf social media experts help Mr Zuckerberg craft his posts, then not much is known about them. Meta representatives have suggested that he does not depend on image consultants. A representative for Meta did not immediately respond to a request to comment.\nIf the intent behind Mr Zuckerberg’s patriotic content drops has been to render him more relatable to the American public, despite his approximately US$181 billion (S$244 billion) net worth, according to Bloomberg, they appear to have helped.\nThe online response to the 2024 Fourth of July post was largely upbeat, markedly different from the satirical memes that roasted his 2021 hydrofoil post.\nBut some online observers pointed out an off-note in the clip: its use of Born In The USA. Often misinterpreted as a rah-rah anthem, the song tells the story of a Vietnam War veteran who returns home to a lonely welcome and dire circumstances.\nCEO of Ultimate Fighting Championship Dana White, who has long tried to set up a cage match between Mr Zuckerberg and his tech rival Elon Musk, reacted to the video with a positive comment: “’MERICA!!!!!”\nMr Musk had a different take, writing on X, which he owns: “May he continue to have fun on his yachts. I prefer to work.” NYTIMES", "url": "https://www.straitstimes.com/tech/tech-news/mark-zuckerberg-s-surf-video-gets-lots-of-likes-but-not-from-elon-musk"}