{"authors": [], "date_download": "2024-10-12 14:18:02", "date_modify": "2024-10-12 14:18:02", "date_publish": "2024-04-12 19:21:00", "description": "Buyers can register to receive information about a new phone, possibly the P70. Read more at straitstimes.com.", "filename": "tech_huawei-teases-launch-of-new-smartphone-high-end-model-anticipated_1728742682.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/12/2024-03-08T024029Z1007845284RC24Z5AY8Y92RTRMADP3USA-CHINA-CHIPS.JPG?VersionId=LL_F1xvKy3VvnjX8PLO0YcwyWhL40oBY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_huawei-teases-launch-of-new-smartphone-high-end-model-anticipated_1728742682.html", "title": "Huawei teases launch of new smartphone; high-end model anticipated", "title_page": "Huawei teases launch of new smartphone; high-end model anticipated | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – Chinese tech giant Huawei has started allowing customers to register their interest in an upcoming smartphone model it has yet to describe, stoking anticipation that the latest version of its high-end P series phones is on its way.\nThe company jumped back into the premium smartphone market in 2023 with its Mate 60 series, a launch celebrated by state media as a triumph over American sanctions on the firm. The launch has also been blamed for a steep decline in Apple’s iPhone sales in China.\nSpeculation has built up in recent months that Huawei will soon launch the P70, which is expected to, like the Mate 60, contain an advanced China-made chip.\nHuawei’s P series has advanced cameras and is known for its sleek design, while the Mate series, also high end, emphasises performance and business features.\nA product launch on April 11 for a smart car model and laptop did not mention phones, disappointing legions of fans who complained online. But on April 12, checks made by Reuters at three Huawei stores in Beijing found that interested buyers could register to receive information about a phone without making a deposit.\nRegistered customers will be notified about the phone’s specs and colours in due course, sales staff said.\nHuawei did not immediately respond to a request for comment.\nThe Mate 60, notably launched during a trip by US Commerce Secretary Gina Raimondo to China, did not involve any prior advertising or disclosure of specifications, prompting some users and companies to tear down the phones as they sought to work out its capabilities.\n“Huawei kills two birds with one stone,” Mr Will Wong, an analyst with research firm IDC, said of this tactic. He noted that the firm could maintain a lower profile amid US-Sino trade tensions while generating an air of mystery and excitement over the launches.\nMr Archie Zhang, a smartphone analyst at Counterpoint Research, noted that the availability of stock has been a significant constraint for the Mate 60 and would likely be so for the P70 as well.\nHuawei has had to slow production for Mate 60 phones due to production constraints and the need to prioritise manufacturing of artificial intelligence chips, sources have said. REUTERS", "url": "https://www.straitstimes.com/tech/huawei-teases-launch-of-new-smartphone-high-end-model-anticipated"}