{"authors": ["Dominic Low"], "date_download": "2024-10-12 13:28:27", "date_modify": "2024-10-12 13:28:27", "date_publish": "2022-08-30 18:00:00", "description": "Network - to be provided by local telco M1 - will be rolled out progressively across Singapore's port waters. Read more at straitstimes.com.", "filename": "tech_tech-news_spore-to-have-dedicated-5g-network-over-port-waters-by-mid-2025_1728739707.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/30/sv-sgport-300822.jpg?VersionId=XBJnG8yUZWane0HIeP0tXc9bxo4oiR.2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_tech-news_spore-to-have-dedicated-5g-network-over-port-waters-by-mid-2025_1728739707.html", "title": "S'pore to have dedicated 5G network over port waters by mid-2025", "title_page": "S'pore to have dedicated 5G network over port waters by mid-2025 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Singapore is one step closer to having remote-controlled ships and self-driving vessels in its port waters, with its plans to set up a dedicated 5G network over the area.\n\"Our aim is to achieve full maritime 5G coverage in our anchorages, fairways, terminals, and boarding grounds by the middle of 2025,\" said Senior Minister of State for Transport and Finance Chee Hong Tat on Tuesday (Aug 30).\nThe network - which will be provided by local telco M1 - will be rolled out progressively across Singapore's port waters, added Mr Chee, who was speaking at this year's International Safety@Sea Conference at Sands Expo and Convention Centre.\nA 5G dedicated network is said to be 10 times faster than 4G, and can allow more devices to be connected to it.\nIts low latency - the time lag between data transmission - allows users to conduct mission-critical operations where real-time communication is needed, such as autonomous vehicle navigation.\nMr Chee said the network over Singapore's port waters will also serve as a test bed for maritime technological innovations.\n\"We will be able to accelerate marine tech research and development, and test new applications that can improve maritime and navigational safety,\" he added.\nIn a statement on Tuesday, the Infocomm Media Development Authority (IMDA) said Singapore will be the first country in the world to extend dedicated 5G coverage to the sea.\nThe 5G test bed at sea will also be the world's first and largest for maritime technology, said the agency.\nAs a start, initial projects for the test bed will focus on the remote guiding of ships within Singapore's waters by qualified professionals known as harbour pilots, added IMDA.\nNow, ships with a gross tonnage of 300 and above entering the Port of Singapore are required to have harbour pilots physically present to help them navigate.\nThe pilots typically will have to take a boat from land and climb a series of vertical ladders to board the ships.\nBut with real-time video streaming of the vessels supported through the 5G network, the pilots will be able to guide the ships remotely from a control centre on land instead, said IMDA.\nMr Chee, who mentioned the remote guidance in his speech, said: \"This not only enhances efficiency and productivity, but it also reduces the risks involved when a pilot transfers between vessels.\"\nThe minister also said the test bed can be used to trial maritime autonomous surface ships - vessels having automated systems which may be remotely controlled or are fully self-driving. Such ships are still being developed by various countries.\nThese ships will allow firms to create and test new systems that enable operations such as autonomous ship manoeuvres and remote control of vessels.\n\"We anticipate that sensors onboard (the ships) will generate a vast amount of critical data for activities such as collision avoidance and docking,\" said Mr Chee.\nIMDA said that other potential projects include delivery drones that can quickly transport critical components to ships in need of repairs.", "url": "https://www.straitstimes.com/tech/tech-news/spore-to-have-dedicated-5g-network-over-port-waters-by-mid-2025"}