{"authors": ["Osmond Chia"], "date_download": "2024-10-12 14:17:35", "date_modify": "2024-10-12 14:17:35", "date_publish": "2023-01-05 18:49:57", "description": "The four-door electric sedan can talk to you, tell you how it feels and change colour at will. Read more at straitstimes.com.", "filename": "tech_ces-2023-bmw-s-colour-shifting-talking-concept-car-lg-s-wireless-tv-among-innovations-unveiled_1728742655.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/06/wgt-ces2023-050123_0.jpg?VersionId=Ac7iFS0WAyliEij1GrDwTsghkf8bp6KE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_ces-2023-bmw-s-colour-shifting-talking-concept-car-lg-s-wireless-tv-among-innovations-unveiled_1728742655.html", "title": "CES 2023: BMW’s colour-shifting, talking concept car, LG’s wireless TV among innovations unveiled", "title_page": "CES 2023: BMW’s colour-shifting, talking concept car, LG’s wireless TV among innovations unveiled | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LAS VEGAS - The car of the future, according to BMW, is one that can talk to you, tell you how it feels through an emoting front grille, and darken its windows to turn the car into an outright lounge, with its windscreen as a display.\nThe car also changes colour at will.\nThe BMW i Vision Dee is one of the many announcements on “day zero” of the Consumer Electronics Show 2023 held in Las Vegas on Wednesday. Brands such as Samsung, LG and Sony also made keynote announcements ahead of the main convention that starts on Thursday.\nThe Straits Times looks at some highlights from Wednesday’s press conferences and product reveals.\nBMW i Vision Dee\nBMW’s i Vision series has always showcased the German automobile manufacturer’s boldest concepts, and its latest BMW i Vision Dee, which stands for Digital Emotion Experience, may be its wildest idea yet, marrying the metaverse with cars.\nThe four-door electric sedan, which was unveiled with the help of Terminator actor Arnold Schwarzenegger in a surprise appearance on stage, is visually a departure from cars today as it appears minimalist inside and out.\nThe Dee does not come with a typical dashboard, but information is shown on an augmented reality (AR) heads-up display built into the windscreen.\nUsing a five-step “mixed reality slider”, drivers can choose to display data such as vehicle speed, diagnostics and social media updates. Users can fade the windows to black and turn the windscreen into a display that immerses them in a digital world.\nWhile it is not clear which of the Dee’s ideas will see the light of day, BMW chief executive Oliver Zipse said in his keynote speech that elements of the Dee will be rolled out soon, specifically for BMW’s range of Neue Klasse cars from 2025.\nBMW unveiled the concept to an audience of thousands of journalists, analysts and tech industry players as the Dee transformed its exterior into 32 different colours. It is the latest evolution of the E-Ink colour-shifting technology that debuted in CES 2021.\nSony and Honda launch new car brand Afeela\nBMW was not the only carmaker rolling out new concepts. Japanese manufacturers Sony and Honda have collaborated to develop a new brand of electric cars, called Afeela.\nTheir first prototype, unveiled by Sony Honda Mobility chief executive Yasuhide Mizuno, is a mid-size sedan with sensors to track the condition of the car and driver, and make recommendations when necessary.\nIts front grille – the “media bar” – is a screen that can display to people outside the car information such as the battery level of the electric car while it is charging. Passengers inside can access a host of entertainment features, including a PlayStation 5 gaming system that can be used on the go.\nThe joint venture is working with Unreal Engine graphics technology from Epic Games – the company behind multiplayer video game Fortnite – to design interfaces for the vehicle.\nSony Honda Mobility’s first car will be available for orders in 2025.\nLG’s wireless Oled TV\nLG’s Signature Oled releases are usually eye-catching televisions worthy of being the living room centrepiece, and 2023’s iteration is no different. The Signature Oled M, one of a slew of products that LG announced to the media in the lead-up to CES 2023, stands tall with its enormous 97-inch 4K screen, and minus a tangle of wires. This means the TV can be placed anywhere in a room, without having to be fixed on a wall, as long as there is a power socket.\nThe magic lies in a shoebox-size box that beams audio and visuals to the screen from less than 10m away. The Zero Connect console comes with multiple ports for plugging in HDMI devices and cables, and can connect with a soundbar.\nLG did not provide any details on latency speed – how fast data is sent to the TV – but said that the box is powered by its own algorithm that instantly adjusts to the best path of transmission to the screen.\nLike most Signature screens, the Oled M will likely be priced beyond most consumers’ reach, but it showcases how TVs can be built in the future.\nPlayStation’s new VR headset\nThere is good news for owners of a PlayStation 5 (PS5) and racing simulator game Gran Turismo 7. Sony is releasing a free upgrade that allows users to play the game on the latest PlayStation VR2 (PSVR2) headset.\nLaunching on Feb 22 at US$549.99 (S$737), the headset is a major upgrade of the first version of the virtual reality goggles. It now comes with a sharper Oled screen, a 110-degree field of view and frame rates of up to 120Hz.\nIt also comes with upgraded Sense controllers that detect subtle finger movements and, like the PS5’s controllers, come with haptic motors and adaptive triggers that require more effort to depress when, for example, firing an arrow in a video game.\nThe PSVR2 is not compatible with older PlayStation VR titles.", "url": "https://www.straitstimes.com/tech/ces-2023-bmw-s-colour-shifting-talking-concept-car-lg-s-wireless-tv-among-innovations-unveiled"}