{"authors": [], "date_download": "2024-10-12 13:27:40", "date_modify": "2024-10-12 13:27:40", "date_publish": "2023-10-01 05:00:38", "description": "Hundreds of users have complained on social media and to Apple about the issue. Read more at straitstimes.com.", "filename": "tech_tech-news_apple-says-software-apps-behind-iphone-overheating-fix-coming_1728739660.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/01/2023-09-22T031359Z73408RC2BD3A36BLURTRMADP3APPLE-CHINA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_tech-news_apple-says-software-apps-behind-iphone-overheating-fix-coming_1728739660.html", "title": "Apple says software, apps behind iPhone overheating; fix coming", "title_page": "Apple says software, apps behind iPhone overheating; fix coming | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAN FRANCISCO - Apple on Saturday said that recent claims of new iPhones getting too hot to the touch are due to software and app-related bugs and that fixes are coming soon.\nThe company said the device can get warm in the first few days as the device works overtime to get set up and restore a user’s data, due to a bug in the latest iOS 17 software, and because of some third-party apps overloading the system.\nBloomberg News reported on the issue last week.\n“The device may feel warmer during the first few days after setting up or restoring the device because of increased background activity,” Apple said in a statement.\n“We have also found a bug in iOS 17 that is impacting some users and will be addressed in a software update.”\nApple told Bloomberg it is working with developers behind the apps causing the iPhone to overheat and that fixes are in the process of being released.\nA spokesman said that Instagram from Meta Platforms, Uber Technologies’s app and the game Asphalt 9 have caused the device to run warmer than normal.\nInstagram already mitigated the problem with its app on Sept 27, Apple said.\nThe latest high-end device includes a titanium frame, a first for the iPhone, as well as an A17 Pro chip with enhanced graphics component for improved gaming.\nSome researchers said those hardware changes could have contributed to the issue.\nBut Apple denied that the problem is related to the hardware of the iPhone 15 Pro line, saying that the new design results in improved heat dissipation compared to prior stainless steel devices.\nIt also said that the upcoming software fix will not involve slowing down the processor of the latest models.", "url": "https://www.straitstimes.com/tech/tech-news/apple-says-software-apps-behind-iphone-overheating-fix-coming"}