{"authors": ["Osmond Chia", "Anne Chan Min"], "date_download": "2024-10-12 13:57:49", "date_modify": "2024-10-12 13:57:49", "date_publish": "2023-06-06 20:00:00", "description": "The network will help defend data that is currently protected with standard encryption. Read more at straitstimes.com.", "filename": "tech_s-pore-to-build-nationwide-network-to-protect-banks-hospitals-against-future-quantum-threats_1728741469.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/06/2023060610655663064b452db-b31b-4e07-b7a9-00e4213ce537_4.jpg?VersionId=vPAIwu3GarrktwgWmAdWy0RD9K1cKRWZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_s-pore-to-build-nationwide-network-to-protect-banks-hospitals-against-future-quantum-threats_1728741469.html", "title": "S’pore to build nationwide network to protect banks, hospitals against future quantum threats", "title_page": "S’pore to build nationwide network to protect banks, hospitals against future quantum threats | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Telcos will soon revamp existing fibre networks so that they will be able to fend off attacks by quantum computers in the future, as part of a new partnership with the Infocomm Media Development Authority (IMDA).\nQuantum computers, or the next generation of computers, use the properties of light to solve problems too complex for traditional computers.\nQuantum hopefuls believe this will lead to new breakthroughs in medicine, materials and better artificial intelligence.\nBut in the wrong hands, quantum computers will be able to crack passwords and today’s encryption technology in seconds, posing a risk to hospitals, banks and organisations that run essential services.\nTo ensure that institutions are prepared for such threats within the next decade, the authorities announced the partnership with network operators to build a quantum-resistant network in Singapore, the region’s first such system.\nIt will help defend data that is currently protected with standard encryption, which is based on mathematical codes, and has become easy for hackers to crack – let alone quantum computers.\nUnder the newly launched National Quantum-Safe Network Plus (NQSN+) programme, approved operators will each build a nationwide quantum-safe network that can protect businesses that are connected to it, said IMDA.\nIt is evaluating proposals from Singtel and a separate joint local partnership between network provider SPTel and quantum communication systems developer SpeQtral.\nOne way that the network protects data shared is through quantum key distribution, a new type of digital encryption for the quantum age, which exchanges secret keys to access data between intended users, Singtel managing director Lim Seng Kong told The Straits Times.\nThese keys cannot be hijacked as any attempt to intercept it will disrupt transmission, introducing errors.\nCritical information infrastructure such as hospitals and banks will soon be able to use this system, saving them the trouble of building their own infrastructure to support quantum-safe communications.\nThe telcos’ networks will be interoperable, allowing users to communicate seamlessly, said IMDA.\nDeputy Prime Minister Heng Swee Keat, who announced the launch during the Asia Tech x Singapore conference on Tuesday, said that the potential of quantum technologies has prompted Singapore to invest more than $250 million in quantum research since 2007.\nBut the nascent technology also presents cyber-security risks, he said.\n“Having choices is important for businesses, and NQSN+ will support more than one local network operator to develop interoperable quantum-safe networks,” said Mr Heng.\n“With these networks, businesses can explore different use cases, such as securing sensitive financial or medical data.”\nWhen ready, Singapore’s quantum-safe networks will be integrated with other cities worldwide, ensuring data shared across borders is safe, said IMDA, which signed an agreement with South Korea on Tuesday to collaborate in this field.\nIn 2022, Singapore established the similarly named National Quantum-Safe Network – a collaboration among industry players to conduct nationwide trials for quantum-safe communication technologies.\nMr Lim said that if approved, Singtel plans to eventually roll out quantum-safe network deals to the Government, banks and hospitals, protecting them from possible quantum attacks.\nThe telco has partnered with quantum cyber-security firm ID Quantique.\nDetails about how the deals will be packaged are still in the works, said Mr Lim. He did not reveal how much the upgrading process will cost.\nAs tech companies race to develop quantum computers, it is crucial for companies to future-proof sensitive data now as upgrades, too, will take time to build, said ID Quantique chief executive Gregoire Ribordy.\nGoogle’s quantum computer, created in 2019, can perform a computation in 200 seconds that would have taken the world’s fastest supercomputers about 10,000 years.\nIBM, one of the front runners in the quantum race, is set to release a more advanced processor in 2023 that will surpass these figures.", "url": "https://www.straitstimes.com/tech/s-pore-to-build-nationwide-network-to-protect-banks-hospitals-against-future-quantum-threats"}