{"authors": ["Anne Chan Min"], "date_download": "2024-10-12 13:57:45", "date_modify": "2024-10-12 13:57:45", "date_publish": "2023-06-08 05:00:00", "description": "The lab is a tie-up between NTU and Taiwan-based tech company Delta Electronics. Read more at straitstimes.com.", "filename": "tech_24-million-laboratory-launched-for-advanced-robotics-research_1728741465.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/09/BrianTeo-3.jpg?VersionId=DfpHIJpBtip58uGz0iHuhwYyKxbQEBYa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_24-million-laboratory-launched-for-advanced-robotics-research_1728741465.html", "title": "$24 million laboratory launched for advanced robotics research", "title_page": "$24 million laboratory launched for advanced robotics research | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A robot with two arms that can hold odd-shaped objects – a human-like quality with applications in industries such as logistics and healthcare – is among the highlights of a tie-up between Nanyang Technological University (NTU) and Taiwan-based tech company Delta Electronics.\nBoasting a significantly wider range of motion and functionality than existing devices on the market, the two-armed robot will continue its development at the Delta-NTU Corporate Lab for Advanced Robotics, a $24 million laboratory to drive research and development into next-generation robotics technology.\nThe lab was launched on Wednesday at a ceremony attended by Minister of State for Trade and Industry Alvin Tan, NTU president Ho Teck Hua and Delta Electronics chairman Yancey Hai.\nThe joint venture, which is currently in its second phase, is supported by the Government as part of Research, Innovation and Enterprise 2025 plan. Announced in 2020, the plan sets the direction for Singapore’s research and development priorities to focus on renewing the country’s commitment to research while scaling up tech innovation capabilities for businesses.\nThe Phase 1 Delta-NTU partnership yielded impressive results that led to about 15 patents and innovative solutions, such as a universal smart navigation system for automated guided vehicles used to transport goods in factories, said Professor Lam Khin Yong, vice-president for industry at NTU.\nThe second phase of research aims to refine and redefine existing robotic capabilities.\nOne area of focus will be to improve the dexterity and flexibility of robots, so that they mimic human movements, and integrate this into each part of the robotic system.\nThis could significantly improve automation within the warehousing, healthcare and service industries.\nFor example, one of the robot grippers integrates touch and force sensors that are flexible, which allows the robot to pick up small and delicate objects, something conventional grippers are still unable to do.\nAnother new device is a robot arm that can be controlled remotely, which could prove useful in unpredictable events with severe consequences, such as the Covid-19 pandemic.\nIt could also increase workplace safety, with workers packing heavy goods by controlling the robot arm from a distance.\nSuch improvements are made possible with novel machine learning methods.", "url": "https://www.straitstimes.com/tech/24-million-laboratory-launched-for-advanced-robotics-research"}