{"authors": [], "date_download": "2024-10-12 13:27:07", "date_modify": "2024-10-12 13:27:07", "date_publish": "2024-08-06 07:03:05", "description": "The ruling paves the way for a second trial to determine potential fixes, possibly including a break-up of Alphabet. Read more at straitstimes.com.", "filename": "tech_tech-news_google-has-an-illegal-monopoly-on-search-us-judge-finds_1728739627.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/06/2024-07-26T153202Z1869234922RC2U29API0A3RTRMADP3EL-SALVADOR-GOOGLE.JPG?VersionId=doeH0dzQ6sZPIpEL_MYdy6rfXEEcFaoo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_tech-news_google-has-an-illegal-monopoly-on-search-us-judge-finds_1728739627.html", "title": "Google has an illegal monopoly on search, US judge finds", "title_page": "Google has an illegal monopoly on search, US judge finds | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Alphabet’s Google broke the law with an illegal monopoly on online search, a federal judge ruled on Aug 5, the first big win for the United States antitrust authorities, who have filed several lawsuits challenging Big Tech’s market dominance.\nThe ruling paves the way for a second trial to determine potential fixes, possibly including a break-up of Alphabet, that would change the landscape of the online advertising world that Google has dominated for years.\nIt is also a green light to aggressive US antitrust enforcers prosecuting Big Tech, which faces criticism from across the political spectrum.\n“The court reaches the following conclusion: Google is a monopolist, and it has acted as one to maintain its monopoly,” District Judge Amit Mehta wrote. The search engine giant controls about 90 per cent of the online search market, and 95 per cent on smartphones.\nThe “remedy” phase could be lengthy, followed by potential appeals to the DC Circuit and US Supreme Court.\nThe legal wrangling could play out into 2025, or even 2026.\nShares of Google parent Alphabet fell 4.3 per cent on Aug 5 as part of a broad tech share decline. Google advertising was 77 per cent of Alphabet’s total sales in 2023.\nAlphabet said it plans to appeal against Judge Mehta’s ruling.\n“This decision recognises that Google offers the best search engine, but concludes that we shouldn’t be allowed to make it easily available,” Google said in a statement.\nUS Attorney-General Merrick Garland called the ruling “a historic win for the American people”, adding that “no company – no matter how large or influential – is above the law”.\nWhite House press secretary Karine Jean-Pierre said the “pro-competition ruling is a victory for the American people”, adding that “Americans deserve an internet that is free, fair and open for competition”.\nBillions paid\nJudge Mehta noted that Google had paid US$26.3 billion (S$34.8 billion) in 2021 alone to ensure that its search engine is the default on smartphones and browsers, and to keep its dominant market share.\n“The default is extremely valuable real estate... Even if a new entrant were positioned from a quality standpoint to bid for the default when an agreement expires, such a firm could compete only if it were prepared to pay partners upwards of billions of dollars in revenue share and make them whole for any revenue shortfalls resulting from the change,” the judge wrote.\nHe noted: “Google, of course, recognises that losing defaults would dramatically impact its bottom line. For instance, Google has projected that losing the Safari default would result in a significant drop in queries and billions of dollars in lost revenues.”\nThe ruling is the first major decision in a series of cases taking on alleged monopolies in Big Tech. This case, filed by the Trump administration, went before a judge from September to November in 2023.\n“A forced divestiture of the search business would sever Alphabet from its largest source of revenue. But even losing its capacity to strike exclusive default agreements could be detrimental for Google,” said Emarketer senior analyst Evelyn Mitchell-Wolf, who noted a drawn-out legal process will delay any immediate effects for consumers.", "url": "https://www.straitstimes.com/tech/tech-news/google-has-an-illegal-monopoly-on-search-us-judge-finds"}