{"authors": [], "date_download": "2024-10-12 13:27:24", "date_modify": "2024-10-12 13:27:24", "date_publish": "2023-12-06 19:32:00", "description": "Network fees in Korea are still 10 times more expensive than in most other countries, Twitch's CEO said. Read more at straitstimes.com.", "filename": "tech_tech-news_twitch-to-shut-down-in-south-korea-due-to-high-costs_1728739644.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/06/11013031.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/tech_tech-news_twitch-to-shut-down-in-south-korea-due-to-high-costs_1728739644.html", "title": "Twitch to shut down in South Korea due to high costs", "title_page": "Twitch to shut down in South Korea due to high costs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - Amazon’s streaming unit Twitch on Dec 5 said it will shut down operations in South Korea in February 2024 due to high operating costs and network fees.\n“Twitch has been operating in Korea at a significant loss, and unfortunately there is no pathway forward for our business to run more sustainably in that country,” chief executive Dan Clancy said in a blog post.\nNetwork fees in Korea are still 10 times more expensive than in most other countries, he said, adding that the company spent significant effort working to reduce operating costs to remain in business.\nSouth Korea’s Ministry of Science and ICT (Information and Communication Technology) said in a statement that network usage fees were being reviewed as “a comprehensive matter that requires consideration of the sustainable development of the internet network, the content industry and user convenience”.\nThe ministry did not comment directly on Twitch’s decision to end its operations.\nThe debate over who should foot the bill for increased traffic usage has seen global technology giants clash with local internet providers in South Korea.\nEarlier in 2023, Netflix and South Korean Internet service provider SK Broadband withdrew lawsuits against each other over network usage fees.\nIn 2022, Twitch limited video resolution in South Korea, a country with a booming esports scene and use of online video games, citing growing operating costs.\nShares of Afreeca TV, a South Korean streaming platform and competitor, closed up nearly 30 per cent on Dec 6 following the announcement.\nTwitch had laid off more than 400 employees in March after its user and revenue growth did not meet expectations. REUTERS", "url": "https://www.straitstimes.com/tech/tech-news/twitch-to-shut-down-in-south-korea-due-to-high-costs"}