{"authors": [], "date_download": "2024-10-12 14:07:18", "date_modify": "2024-10-12 14:07:18", "date_publish": "2024-08-29 18:46:00", "description": "The 1MDB board said Tarek Obaid and Patrick Mahony are set to face additional civil and criminal charges in Malaysia. Read more at straitstimes.com.", "filename": "world_1mdb-hails-major-victory-in-234-billion-fraud-case-after-swiss-court-convictions_1728742038.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/COMBO-SWITZERLAND-MALAYSIA-SAUDI-CORRUPTION-TRIAL-132759.jpg?VersionId=gJjR5fhDBHDaTmUnp4wVECBK4AHZDhWJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_1mdb-hails-major-victory-in-234-billion-fraud-case-after-swiss-court-convictions_1728742038.html", "title": "1MDB hails ‘major victory’ in $2.34 billion fraud case after Swiss court convictions", "title_page": "1MDB hails ‘major victory’ in $2.34 billion fraud case after Swiss court convictions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PETALING JAYA - The 1Malaysia Development Berhad (1MDB) board has lauded a significant victory in its ongoing effort to recover embezzled funds.\nIn a statement on Aug 29, the board said the conviction in a Swiss court of two men for embezzling US$1.8 billion (S$2.34 billion) from the former sovereign wealth fund was “a further step towards recovering the harm done to the people of Malaysia”.\n“We welcome the verdict in Switzerland’s Federal Criminal Court, which means that Patrick Mahony and Tarek Obaid will face justice for their role in embezzling and defrauding the people of Malaysia,” the statement added.\n“Throughout this process, we have worked to support the Swiss federal prosecutors as attached parties to the prosecution, to ensure the recovery of assets to Malaysia.\n“This included filing criminal complaints on behalf of 1MDB, supporting the investigation, appearing at the trial, providing statements and cross-examination, and ultimately ensuring the frozen assets will be returned to Malaysia.\n“We thank the Swiss authorities for their thorough investigation, which has secured this conviction.”\nThe board also lauded the order for forfeiture and restitution of monies and assets.\n“This significant recovery has been achieved as part of our multi-disciplinary recovery strategy to support and supplement the ongoing criminal forfeiture.\n“We continue to bring enforcement actions against the parties involved in fraudulent misappropriation of Malaysian state funds around the world.\n“We will continue to pursue those responsible for the looting of 1MDB and recover our nation’s rightful assets, wherever they may be.”\nThe 1MDB board also said that both Obaid and Mahony are set to face additional civil and criminal charges in Malaysia related to their involvement in the creation of a fraudulent joint venture between 1MDB and PetroSaudi International in 2009.\nOn Aug 28, the Swiss court convicted and sentenced Swiss-British businessman Mahony and Saudi-Swiss businessman Obaid for multiple crimes, including their roles in the 1MDB scandal.\nThey were convicted in Switzerland’s most senior criminal court in Bellinzona of fraud, money laundering and aggravated misuse of funds.\nAccording to the indictment, the two executives defrauded the wealth fund of US$1.8 billion to enrich themselves, with Obaid getting at least US$805 million and Mahony at least US$37 million.\nThe court sentenced Obaid to seven years’ imprisonment and Mahony to six years.\nThe court also ordered that their assets, including real estate in Switzerland and the UK, and amounts held in numerous bank accounts totalling more than US$240 million, be confiscated and restored to 1MDB. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/world/1mdb-hails-major-victory-in-234-billion-fraud-case-after-swiss-court-convictions"}