{"authors": [], "date_download": "2024-10-12 14:18:16", "date_modify": "2024-10-12 14:18:16", "date_publish": "2024-05-15 19:48:44", "description": "Images of Mr Blinken’s performance sparked an angry backlash on social media. Read more at straitstimes.com.", "filename": "world_europe_guitar-playing-blinken-sparks-criticism-in-ukraine_1728742696.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/15/2024-05-15T115111Z582705026RC2ZQ7AASZNCRTRMADP3UKRAINE-CRISIS-USA-BLINKEN.JPG?VersionId=cSXOrkbtYfXIg0bx4Sm0nig6VHZgnz3I", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_guitar-playing-blinken-sparks-criticism-in-ukraine_1728742696.html", "title": "Guitar-playing US Secretary of State Blinken sparks criticism in Ukraine", "title_page": "Guitar-playing US Secretary of State Blinken sparks criticism in Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – US Secretary of State Antony Blinken was trying to send a message of defiance and hope when he took to the stage of a Kyiv bar on the night of May 14 for a guitar performance of Rockin’ in the Free World.\nBut some Ukrainians have reacted angrily, chastising Washington’s top diplomat for an ill-judged jam session in the capital while Ukrainian troops are fighting in trenches, struggling to hold back a Russian advance amid a shortage of weapons.\n“One word is enough to describe US Secretary of State Antony Blinken’s evening in Kyiv yesterday: inappropriate,” said Ms Svitlana Matviyenko, head of the Agency for Legislative Initiatives NGO.\nMr Blinken is on a surprise trip to Kyiv, just weeks after Washington approved a US$61 billion (S$82.29 billion) package of aid for the country following months of delays in Congress.\nIn a speech earlier on May 14, he said the United States would back Ukraine until its security was “guaranteed”.\nA guitar player who has launched a musical diplomacy initiative at the State Department, Mr Blinken later joined Ukrainian musicians at a famed Kyiv bar, Barman Dictat, for a rendition of Neil Young’s 1989 hit, Rockin’ in the Free World.\n“I know this is a really, really difficult time. Your soldiers, your citizens, particularly in the northeast in Kharkiv, are suffering tremendously,” he said on stage, holding a red electric guitar.\n“But they need to know, you need to know, the United States is with you... They’re fighting not just for a free Ukraine, but for the free world,” he added.", "url": "https://www.straitstimes.com/world/europe/guitar-playing-blinken-sparks-criticism-in-ukraine"}