{"authors": [], "date_download": "2024-10-12 13:45:57", "date_modify": "2024-10-12 13:45:57", "date_publish": "2022-08-09 09:10:25", "description": "It is possibly connected to a US Justice Department probe of Trump's removal of official records. Read more at straitstimes.com.", "filename": "world_united-states_trump-says-fbi-raided-his-florida-home-broke-into-his-safe_1728740757.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/09/ac_floridahome_090822.jpg?VersionId=U2owHM9bsI2TiyBnKVj.TylkoZ3x3VKX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_trump-says-fbi-raided-his-florida-home-broke-into-his-safe_1728740757.html", "title": "Trump says FBI raided his Florida home, broke into his safe", "title_page": "Trump says FBI raided his Florida home, broke into his safe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - Former president Donald Trump said FBI agents raided his Mar-a-Lago estate on Monday (Aug 8) and broke into his safe, possibly connected to a US Justice Department investigation of Trump's removal of official presidential records to the Florida resort.\nThe unprecedented search of a former president's home would mark a significant escalation into the records investigation.\nIt is one of several probes Trump is facing from his time in office and in private business.\nIn a statement, Trump said the raid involved a \"large group of FBI agents\".\nThe Justice Department declined to comment.\nThe FBI's headquarters in Washington and its field office in Miami both declined comment as well.\nThe search appeared to concern boxes of documents that Trump brought with him from the White House to the Florida club, the New York Times reported, citing two unnamed people familiar with the investigation.\nTrump said the estate \"is currently under siege, raided, and occupied\". He did not say why the raid took place.\n\"After working and cooperating with the relevant government agencies, this unannounced raid on my home was not necessary or appropriate,\" Trump said, adding: \"They even broke into my safe!\"\nLater on Monday, Trump did not mention the raid during a brief tele-rally for Leora Levy, whom he has endorsed for the Republican nomination for US senator from Connecticut.\nCNN reported that Trump was not at the estate at the time of the raid and that the FBI had executed a search warrant to enter the premises. CNN also said the search was tied to classified documents, citing unnamed sources.\nTrump, who has made his club in Palm Beach his home since leaving the White House in January 2021, has generally spent summers at his golf club in Bedminster, New Jersey, because Mar-a-Lago typically closes in May for the summer.\nThe Justice Department launched an early-stage investigation into Trump's removal of records to the Florida estate, a source familiar with the matter said in April.\nThe investigation comes after the US National Archives and Records Administration in February notified Congress that it had recovered about 15 boxes of White House documents from Trump's Florida home, some of which contained classified materials.\nThe US House of Representatives Oversight Committee at that time announced it was expanding an investigation into Trump's actions and asked the Archives to turn over additional information.\nTrump previously confirmed that he had agreed to return certain records to the Archives, calling it \"an ordinary and routine process\".\nOther investigations into Trump\nBesides the presidential records case, Trump is under investigation on a number of other fronts, including a congressional probe into the January 6, 2021, assault by Trump supporters on the US Capitol and accusations that Trump tried to influence Georgia's 2020 election results.\nIn addition, the US Attorney in Washington, D.C., is probing a scheme by Trump's allies to submit slates of fake electors in a failed bid to overturn the 2020 presidential election.\nUnder the leadership of Matthew Graves, the US Attorney in Washington, D.C., who was sworn in last autumn, the Justice Department has started issuing grand jury subpoenas to electors in battleground states, including some electors who signed bogus certificates certifying the election for Trump.\nAccording to several subpoenas seen by Reuters, prosecutors are seeking communications between electors and federal employees, \"any member, employee or agent of Donald J. Trump\", as well as with certain individuals in Trump's inner circle including attorneys John Eastman, Jenna Ellis and Rudy Giuliani.\nIn an interview in July with NBC News, Attorney General Merrick Garland was asked whether the Justice Department would indict Trump over the events of Jan 6 if evidence supported such an action.\nGarland replied, \"We intend to hold everyone, anyone who was criminally responsible for the events surrounding Jan 6, for any attempt to interfere with the lawful transfer of power from one administration to another, accountable. That's what we do.\nWe don't pay any attention to other issues with respect to that.\"\nIn Georgia, a special grand jury was selected in May to consider evidence in a Georgia prosecutor's inquiry into Trump's alleged efforts to influence the state's 2020 election results.\nThe investigation focuses in part on a phone call Trump made to Georgia Secretary of State Brad Raffensperger, a Republican, on January 2, 2021.\nTrump asked Raffensperger to \"find\" the votes needed to overturn Trump's election loss, according to an audio recording obtained by the Washington Post.\nNew York state Attorney General Letitia James is conducting a civil investigation examining whether the Trump Organisation inflated real estate values. Two of Trump's adult children, Donald Trump Jr. and Ivanka Trump, have testified in the probe, and Trump has agreed to testify.\nTrump has denied wrongdoing and called the investigation politically motivated. James is a Democrat.", "url": "https://www.straitstimes.com/world/united-states/trump-says-fbi-raided-his-florida-home-broke-into-his-safe"}