{"authors": [], "date_download": "2024-10-12 14:08:08", "date_modify": "2024-10-12 14:08:08", "date_publish": "2022-07-23 04:35:21", "description": "Russia's chain of command is struggling, a senior US defence official said. Read more at straitstimes.com.", "filename": "world_europe_russia-taking-hundreds-of-casualties-daily-in-ukraine-war-says-us-official_1728742088.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/23/2022-07-22T141005Z_594632382_RC2ZGV97GVMO_RTRMADP_3_UKRAINE-CRISIS-TANK-GARDEN.JPG?VersionId=YotYzCKCRY.g.n.wxXTxoMPEPp6ACa5F", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-taking-hundreds-of-casualties-daily-in-ukraine-war-says-us-official_1728742088.html", "title": "Russia taking hundreds of casualties daily in Ukraine war, says US official", "title_page": "Russia taking hundreds of casualties daily in Ukraine war, says US official | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - The United States believes Russia's military is suffering hundreds of casualties a day in its war in Ukraine, and with the loss so far of thousands of lieutenants and captains, its chain of command is struggling, a senior US defence official said on Friday (July 22).\nNearly five months since President Vladimir Putin ordered an invasion of Russia's neighbour, its forces are grinding through the Donbas region of eastern Ukraine and occupy around a fifth of the country.\nThe United States estimates that Russian casualties in Ukraine have reached around 15,000 killed and perhaps 45,000 wounded, CIA director William Burns said on Wednesday, adding that Ukraine has also endured significant casualties.\nThe official, speaking on the condition of anonymity, said that in addition to the lieutenants and captains killed, hundreds of colonels and \"many\" Russian generals had been killed as well.\n\"The chain of command is still struggling,\" the official said.\nRussia classifies military deaths as state secrets even in times of peace and has not updated its official casualty figures frequently during the war. On March 25 it said 1,351 Russian soldiers had been killed.\nThe Kyiv government said in June that 100 to 200 Ukrainian troops were being killed per day.\nThe United States also believes that Ukraine had destroyed more than 100 \"high-value\" Russian targets inside Ukraine, including command posts, ammunition depots and air-defence sites, the US official said.\nThe United States has provided US$8.2 billion (S$11.4 billion) in security assistance since the war began.\nEarlier this week, the Pentagon said it would provide Ukraine with four additional high mobility artillery rocket systems (Himars) in the latest weapons package.\nOn Friday, the White House said that package would be worth US$270 million in military aid for Ukraine, including about US$100 million for Phoenix \"ghost\" drones.\nThe drones were designed mainly for striking targets, but little else is known about them, including their range and precise capabilities.\nRussia says it is waging a \"special operation\" to demilitarise its neighbour and rid it of dangerous nationalists.\nKyiv and the West say Russia is mounting an imperialist campaign to reconquer a pro-Western neighbour that broke free of Moscow's rule when the Soviet Union collapsed in 1991.", "url": "https://www.straitstimes.com/world/europe/russia-taking-hundreds-of-casualties-daily-in-ukraine-war-says-us-official"}