{"authors": [], "date_download": "2024-10-12 13:27:48", "date_modify": "2024-10-12 13:27:48", "date_publish": "2024-07-18 20:50:00", "description": "Britain recorded over 230,000 deaths from Covid-19, one of the world’s highest number of fatalities. Read more at straitstimes.com.", "filename": "world_europe_british-public-were-failed-by-flawed-planning-for-covid-19-pandemic-inquiry-finds_1728739668.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/18/FILES-BRITAIN-HEALTH-VIRUS-INQUIRY-121803.jpg?VersionId=8a3S0ekIJdCUEwoxSKcOrz5qHu_jrq5D", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_british-public-were-failed-by-flawed-planning-for-covid-19-pandemic-inquiry-finds_1728739668.html", "title": "British public were failed by flawed planning for Covid-19 pandemic, inquiry finds", "title_page": "British public were failed by flawed planning for Covid-19 pandemic, inquiry finds | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Britain let down its citizens by leaving the nation ill-prepared for the Covid-19 pandemic because of significantly flawed planning and failures by ministers and scientific experts, a public inquiry concluded in a scathing report on July 18.\nBritain recorded one of the world’s highest number of fatalities from Covid-19 with more than 230,000 deaths reported by December 2023, while the nation’s finances are still suffering from the economic consequences.\nFormer prime minister Boris Johnson ordered an inquiry in May 2021, and its first report, which examined the nation’s preparedness for an outbreak, was damning.\n“Had the UK been better prepared for and more resilient to the pandemic, some of the financial and human cost may have been avoided,” said the report by the inquiry chair, former judge Heather Hallett.\n“The inquiry has no hesitation in concluding that the processes, planning and policy of the civil contingency structures within the UK government and devolved administrations and civil service failed their citizens.”\nThe inquiry found there was a “lack of adequate leadership”, with “groupthink” clouding expert advice.\nMinisters were not given a broad enough range of opinions, and then failed to sufficiently challenge what they did receive.\nA flawed 2011 strategy, which underpinned the nation’s preparations for such an emergency, prepared for only one type of pandemic – influenza.\nIt was outdated, focused on dealing with the impact of an outbreak rather than trying to prevent its spread and did not take into account the economic and social impact, the report said. That strategy was virtually abandoned on its first encounter with Covid-19.\n“The secretaries of state for health... who adhered to the strategy, the experts and officials who advised them to do so and the governments of the devolved nations that adopted it, all bear responsibility for failing to have these flaws examined and rectified,” the report said.\nMs Hallett made 10 recommendations, saying preparation for a civil emergency should be treated the same way as a threat from a hostile state.\n“There must be radical reform. Never again can a disease be allowed to lead to so many deaths and so much suffering,” she said in her introduction to the report.\nHer inquiry’s first module has examined only Britain’s preparedness, and later reports will provide assessments of the more politically charged issues of decision-making during the pandemic against a backdrop of widespread accusations of government incompetence.\nMr Johnson himself was forced from office in July 2022, with revelations of parties during Covid-19 lockdowns among the many scandals that ended his premiership. A parliamentary committee later concluded that he misled lawmakers over the parties.\nMr Rishi Sunak, the finance minister during the pandemic who later became prime minister, was also fined for breaking lockdown rules at the time.\nMs Brenda Doherty, on behalf of the campaign group Covid-19 Bereaved Families for Justice UK ahead of the report’s release, said: “We know that for lives to be saved in the future, lessons must be learnt from the mistakes of the past.\n“Sadly, nobody knows the true cost of the government’s failure to prepare as we do.” REUTERS", "url": "https://www.straitstimes.com/world/europe/british-public-were-failed-by-flawed-planning-for-covid-19-pandemic-inquiry-finds"}