{"authors": [], "date_download": "2024-10-12 13:41:12", "date_modify": "2024-10-12 13:41:12", "date_publish": "2024-07-30 03:39:16", "description": "JERUSALEM - Israel's foreign minister urged NATO to expel Turkey on Monday after its President Tayyip Erdogan threatened his country might enter Israel as it had entered Libya and Nagorno-Karabakh in the past. Read more at straitstimes.com.", "filename": "world_israel-foreign-minister-urges-nato-expel-turkey-over-threat-to-enter-israel_1728740472.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/30/LYNXMPEK6S0SK-1.jpg?VersionId=t72D2TvKOJifEqUTlMTFsicaGkqIj_fd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_israel-foreign-minister-urges-nato-expel-turkey-over-threat-to-enter-israel_1728740472.html", "title": "Israel foreign minister urges NATO expel Turkey over threat to enter Israel", "title_page": "Israel foreign minister urges NATO expel Turkey over threat to enter Israel | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - Israel's foreign minister urged NATO to expel Turkey on Monday after its President Tayyip Erdogan threatened his country might enter Israel as it had entered Libya and Nagorno-Karabakh in the past.\n\"In light of Turkish President Erdogan's threats to invade Israel and his dangerous rhetoric, Foreign Minister Israel Katz instructed diplomats ... to urgently engage with all NATO members, calling for the condemnation of Turkey and demanding its expulsion from the regional alliance,\" the ministry said.\nErdogan, a fierce critic of Israel's war against Hamas in Gaza, said in a speech on Sunday: \"We must be very strong so that Israel can't do these ridiculous things to Palestine. Just like we entered Karabakh, just like we entered Libya, we might do similar to them.\"\nHe did not spell out what sort of intervention he was suggesting.\n\"Erdogan is following in the footsteps of Saddam Hussein and threatening to attack Israel. He should remember what happened there and how it ended,\" Katz said in the statement.\n\"Turkey, which hosts the Hamas headquarters responsible for terrorist attacks against Israel, has become a member of the Iranian axis of evil, alongside Hamas, Hezbollah, and the Houthis in Yemen,\" he said.\nOnce close regional allies, relations between Israel and Turkey have been deteriorating for more than a decade.\nBilateral trade weathered many diplomatic storms, reaching billions of dollars a year, but Turkey this month said they would halt all bilateral trade with Israel until the war ends and aid can flow unhindered into Gaza. REUTERS", "url": "https://www.straitstimes.com/world/israel-foreign-minister-urges-nato-expel-turkey-over-threat-to-enter-israel"}