{"authors": [], "date_download": "2024-10-12 14:08:35", "date_modify": "2024-10-12 14:08:35", "date_publish": "2022-06-03 09:57:50", "description": "Shooter among those killed. Read more at straitstimes.com.", "filename": "world_united-states_shooting-at-wisconsin-cemetery-leaves-multiple-victims_1728742115.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/03/aashooting0306.jpg?VersionId=5e1WT.wlNGG6WemoJ7fhC7Kao09cSSnY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_shooting-at-wisconsin-cemetery-leaves-multiple-victims_1728742115.html", "title": "3 people dead after shooting at Iowa church parking lot", "title_page": "3 people dead after shooting at Iowa church parking lot | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AMES, IOWA (REUTERS) - A man shot and killed two women in the parking lot of a church in Iowa state on Thursday (June 2) and then turned the gun on himself, police said, adding three more dead to the toll in a series of recent shootings that have rocked the United States.\nThe shooting took place shortly after President Joe Biden delivered a major address on gun violence in the wake of mass shootings in Buffalo, New York; Uvalde, Texas, and Tulsa, Oklahoma, in recent weeks.\nAnother shooting on Thursday wounded two people attending a burial at cemetery in Racine, Wisconsin.\nThe Iowa shooting took place outside Cornerstone Church, a fundamentalist Christian church east of the city of Ames, while a church programme was on inside, said Mr Nicholas Lennie, chief deputy of the Story County Sheriff’s Office.\nWhen deputies arrived on scene they found all three dead, Mr Lennie said, adding that he could not provide identities nor disclose what the relationship between them may have been.\n“This appears to be an isolated, single-shooter incident,” Mr Lennie said.\nMoments before, Mr Biden urged Congress to ban assault weapons, expand background checks and implement other gun control measures to address the mass shootings.\n“Enough, enough!,” he said.\nThe United States has been shaken in recent weeks by the mass shootings that killed 10 Black residents in upstate New York, 19 children and two teachers in Texas, and two doctors, a receptionist and a patient in Oklahoma.\nIn Racine, Wisconsin, on Thursday, multiple gunshots were fired into a crowd of mourners attending an afternoon grave-side funeral, wounding two people, Racine police Sergeant Kristi Wilcox told reporters.\nOne victim was treated at a local hospital and released, the other was flown to a Milwaukee hospital, apparently suffering more serious injuries, Wilcox said. No suspect was taken into custody.\nMilwaukee television station TMJ4 News, citing family members attending the graveside service, said five relatives of the man who was being buried at the time were struck by gunfire.", "url": "https://www.straitstimes.com/world/united-states/shooting-at-wisconsin-cemetery-leaves-multiple-victims"}