{"authors": [], "date_download": "2024-10-12 14:04:05", "date_modify": "2024-10-12 14:04:05", "date_publish": "2023-01-07 04:16:58", "description": "Shelling rains down into the afternoon, despite Russian leader's call for a 36-hour ceasefire. Read more at straitstimes.com.", "filename": "world_europe_no-surprise-in-hard-hit-bakhmut-as-putins-ceasefire-fails_1728741845.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/07/TOPSHOTS-TOPSHOT-UKRAINE-RUSSIA-CONFLICT-WAR-171002_1.jpg?VersionId=z5aPgA_39dmj2zx7W0mz0SYj.Wl6Ot3k", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_no-surprise-in-hard-hit-bakhmut-as-putins-ceasefire-fails_1728741845.html", "title": "No surprise in Ukraine’s hard-hit Bakhmut as Putin’s ceasefire fails", "title_page": "No surprise in Ukraine’s hard-hit Bakhmut as Putin’s ceasefire fails | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BAKHMUT, Ukraine - Like every other day this week, holdout residents of this all-but-destroyed city on Ukraine’s front line flocked to a ground-floor humanitarian aid centre on Friday, desperate for food and Internet access.\nAnd like every other day this week, shelling rained down around Bakhmut into the afternoon, despite President Vladimir Putin’s demand that Russian troops observe a 36-hour ceasefire.\nHad the ceasefire been respected, it would have begun before midday.\nAs they sipped hot tea and slurped noodles around a woodstove, the crowd of mostly elderly civilians said they were not surprised fighting had continued.\nThey were sitting, after all, in the heart of a city that lies in ruins after months of fierce combat, the worst of the 10-month war.\n“There have already been many loud statements from the Russians, but they never kept their promises,” said Ms Tetyana Scherbak, 51, a volunteer at the aid centre.\n“I want to appeal to all Russian mothers,” she added: “Don’t you need your husbands? Don’t you need your sons?\n“Take them away from us! Let them return to their wives, to their children, to their mothers! Let them leave us forever, not just for 36 hours”.\n‘I stay with my city’\nAFP journalists in Bakhmut heard incoming and outgoing artillery fire for more than an hour after the 36-hour ceasefire was due to take effect on Friday, though shelling was lighter than in recent days.\nThe streets of the bombed-out city were mostly empty save for military vehicles.\nSoldier Volodymyr Morozov told AFP he didn’t even know about Mr Putin’s ceasefire call, which coincides with Orthodox Christmas on Saturday.\n“This is the first time I have heard about the ceasefire – from you,” he said.\n“I didn’t watch the news before and I don’t watch it now either. All the news I’m interested in is concerning my comrades.”\nRussia and Ukraine have both suffered heavy casualties in the fight for Bakhmut. Most of the city’s pre-war population of 70,000 have left for safer territory, fleeing the cratered roads and buildings reduced to rubble and twisted metal.\nYet some families remain, a point of frustration for police officer Pavlo Diachenko, who spent Friday distributing leaflets advertising a shelter in Chernivtsi, a city in western Ukraine, which he said would even accommodate pets.\n“Several days ago, a woman left with her daughter, as well as a family with three children and a dog,” he said.\n“Almost no one else wants to go,” he admitted, but he predicted that more would end up leaving as winter temperatures drop further.\nVolodymyr, a 49-year-old municipal worker who came to the aid centre with his 14-year-old daughter, said he had no plans to leave.\n“If there is a ceasefire, then it will be quiet for 36 hours. Nothing else,” he said. “I can’t leave the city – I love it... I stay with my city.”\nA makeshift Christmas\nThe aid centre offers a rare place for Volodymyr and others still in Bakhmut to escape the basement shelters where they spend most days.\n“They are from the neighbourhood, they don’t want to sit in the basement, so they come here to socialise and to communicate, to rest from the constant stress,” said volunteer Denys Murachov.\nOn Friday, the centre organised an impromptu Christmas Eve celebration around what Ms Scherbak, the other volunteer, described as a “symbolic Christmas table” of snacks and sweets.\nIn one corner, a Christmas tree had been dressed with garlands and a single string of flashing lights.\nMs Scherbak lamented that she could not greet visitors with “a glass of homemade vodka” and kutya, a sweet grain pudding, as she would in peacetime.\nNevertheless “we will give people a drop of home warmth... as much as we can now,” she said.\nWith dozens of Bakhmut residents gathered around the table, Ms Scherbak offered a Christmas wish, speaking over artillery booms that reverberated outside.\nBehind her, a muted television showed footage from the battlefield.\n“As you know, Christmas is a time of salvation. We wish you salvation,” she said.\nShe gestured to the table stacked with mandarins, apples and cookies. “We did what we could,” she said. AFP", "url": "https://www.straitstimes.com/world/europe/no-surprise-in-hard-hit-bakhmut-as-putins-ceasefire-fails"}