{"authors": [], "date_download": "2024-10-12 13:35:11", "date_modify": "2024-10-12 13:35:11", "date_publish": "2024-09-11 03:47:37", "description": "TORONTO - A Pakistani man accused of plotting to attack a New York City Jewish center in support of Islamic State was in Canada on a student visa, Canada's immigration minister said on Tuesday. Read more at straitstimes.com.", "filename": "world_man-accused-of-plot-to-attack-new-york-jewish-center-was-in-canada-on-student-visa_1728740111.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/LYNXMPEK890QU-1.jpg?VersionId=HkkFyPBnTI4IUwoZrcpz1kU7fFzDh1Rc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_man-accused-of-plot-to-attack-new-york-jewish-center-was-in-canada-on-student-visa_1728740111.html", "title": "Man accused of plot to attack New York Jewish centre was in Canada on student visa", "title_page": "Man accused of plot to attack New York Jewish centre was in Canada on student visa | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TORONTO - A Pakistani man accused of plotting to attack a New York City Jewish center in support of Islamic State was in Canada on a student visa, Canada's immigration minister said on Tuesday.\nMuhammad Shahzeb Khan, 20, was arrested in Canada last Wednesday as he allegedly tried to enter the U.S. He was charged with attempting to provide material support and resources to a designated foreign terrorist organization, namely Islamic State, or ISIS.\nThe U.S. Department of Justice accused Khan of plotting a mass shooting at a Jewish center in Brooklyn around Oct. 7, 2024, about a year after Hamas' attack in Israel.\nKhan came to Canada on a student visa in June 2023, Canadian Immigration Minister Marc Miller told reporters on Tuesday. The visa was issued the month before.\nAccording to the U.S. Department of Justice, Khan began posting his support for ISIS on an encrypted messaging application in November 2023. He allegedly communicated his attack plans to undercover agents.\nMiller said he had no further comment on Khan's case because criminal charges were pending.\n\"We take any security breach and any entry into Canada very seriously,\" he said. \"Let's not be naive: A determined individual can gain access to this country and that is for the security services inside our country to apprehend this person if they commit a crime or if they're about to commit a crime. And that's exactly what happened.\"\nCanada approved more student visas in May and June 2023 than in any month since at least January 2019, according to data from the immigration department. Approvals have since fallen.\nCanada has been seeking to reduce its ranks of international students, issuing a two-year cap in January.\nKhan is set to appear in court in Montreal on Sept. 13. REUTERS", "url": "https://www.straitstimes.com/world/man-accused-of-plot-to-attack-new-york-jewish-center-was-in-canada-on-student-visa"}