{"authors": [], "date_download": "2024-10-12 14:08:31", "date_modify": "2024-10-12 14:08:31", "date_publish": "2022-07-05 07:01:41", "description": "He said Americans are worried about division within the country and an economy that \"is growing, but not without pain\". Read more at straitstimes.com.", "filename": "world_united-states_biden-urges-unity-on-independence-day-despite-economic-worries-and-deep-divisions-in-us_1728742111.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/05/ac_biden4thjuly_050722.jpg?VersionId=PyWB57GwuW.Kndw805JjPuYe_Tvu.FOz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-urges-unity-on-independence-day-despite-economic-worries-and-deep-divisions-in-us_1728742111.html", "title": "Biden urges unity on Independence Day despite economic worries and deep divisions in US", "title_page": "Biden urges unity on Independence Day despite economic worries and deep divisions in US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (BLOOMBERG) - President Joe Biden celebrated the Fourth of July (Monday) with a cookout at the White House, noting that the nation has made great strides but also taken \"a few steps backward\".\n\"As it's been before in our history, in times of war and division, of growth and change, the Fourth of July comes at a critical moment,\" Mr Biden said in a late-afternoon event on the lawn of the executive mansion, surrounded by members of the armed forces, their families and other guests.\n\"Liberty is under assault, assault both here and abroad. In recent days, there is reason to think that this country is moving backward,\" he said.\nHe said Americans are worried about division within the country and an economy that \"is growing, but not without pain\".\nInflation is running at a rate not seen in decades, prompting the Federal Reserve to raise interest rates to cool off the economy and prompting some economists to predict a recession could result.\n\"The rights we assume were protected are no longer,\" he said, apparently a reference to a recent Supreme Court ruling striking down abortion rights.\n\"The worst of our past has reached out and pulled us back on occasion,\" Mr Biden said. \"But tonight, I want you to know we're going to get through all of this.\"\nHe also noted a shooting that had occurred outside Chicago earlier in the day. A gunman opened fire on an Independence Day parade in suburban Highland Park, killing at least six and injuring scores more.\n\"You all heard what happened today. Each day we're reminded there's nothing guaranteed about our democracy, nothing guaranteed about our way of life,\" he said. \"We have to fight for it, defend it and earn it by voting.\"\nIn a statement issued earlier in the day, Mr Biden said he pledged the assistance of federal law enforcement agencies to track down the killer.\nHe said he and first lady Jill Biden \"are shocked by the senseless gun violence that has yet again brought grief to an American community.\"", "url": "https://www.straitstimes.com/world/united-states/biden-urges-unity-on-independence-day-despite-economic-worries-and-deep-divisions-in-us"}