{"authors": [], "date_download": "2024-10-12 14:07:51", "date_modify": "2024-10-12 14:07:51", "date_publish": "2022-08-26 05:57:36", "description": "The Zaporizhzhia plant had to resort to backup power for the first time, thinning its defences against a meltdown. Read more at straitstimes.com.", "filename": "world_europe_world-avoids-radiation-disaster-says-zelensky-after-power-cut-at-russian-held-nuclear-plant_1728742071.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/25/2022-08-15T141146Z_1917680090_RC2LPV9YITQV_RTRMADP_3_UKRAINE-CRISIS-RUSSIA-NUCLEAR.JPG?VersionId=uoJ5IzDwDSbojFafSvZogrpDQv80xR3p", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_world-avoids-radiation-disaster-says-zelensky-after-power-cut-at-russian-held-nuclear-plant_1728742071.html", "title": "World narrowly avoided 'radiation disaster' after power cut at Ukraine nuclear plant, says Zelensky", "title_page": "World narrowly avoided 'radiation disaster' after power cut at Ukraine nuclear plant, says Zelensky | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (REUTERS) - President Volodymyr Zelensky said the world narrowly avoided a radiation disaster on Thursday (Aug 25) as the last regular line supplying electricity to Ukraine's Russian-held Zaporizhzhia nuclear power plant was restored hours after being cut.\nZelensky blamed shelling by Russia's military for fires in the ash pits of a nearby coal power station that disconnected the reactor complex, Europe's largest such facility, from the power grid.\nHe said back-up diesel generators had started to ensure power supply and keep the plant safe.\n\"If our station staff had not reacted after the blackout, then we would have already been forced to overcome the consequences of a radiation accident,\" he said in an evening address.\n\"Russia has put Ukraine and all Europeans in a situation one step away from a radiation disaster.\"\nInternational Atomic Energy Agency (IAEA) officials should be given access to the site within days, he said, \"before the occupiers take the situation to the point of no return\".\nUkrainian state nuclear company Energoatom said it had been the first complete disconnection in the plant's history.\nElectricity is used for cooling and safety systems.\nRussia, which invaded Ukraine in February, captured the plant in March and has controlled it since, although Ukrainian technicians still operate it.\nRussia and Ukraine have accused each other of shelling the site, fuelling fears of a nuclear disaster.\nNuclear experts have warned of the risk of damage to the plant's spent nuclear fuel pools or its reactors. Cuts in power needed to cool the pools could cause a disastrous meltdown.\nThe United Nations is seeking access to the plant and has called for the area to be demilitarised. IAEA officials are \"very, very close\" to being able to visit Zaporizhzhia, agency director-general Rafael Grossi said on Thursday.\nAs the war entered its seventh month, Russia said its forces had struck a railway station in eastern Ukraine on Wednesday, confirming an attack which Kyiv says killed 25 civilians as the nation marked its Independence Day.\nThe Russian Defence Ministry said an Iskander missile hit a military train at Chaplyne station that was to deliver arms to Ukrainian forces in the eastern Donbas region.\nUkrainian officials said 21 people were killed when the station was hit and five train carriages went up in flames, and that a boy died when a missile struck his home nearby. The death toll rose to 25 on Thursday after three more bodies were retrieved from rubble, the officials said.\nThe Russian defence ministry said 200 Ukrainian military personnel were killed in the attack. Moscow denies targeting civilians and has said rail infrastructure is a legitimate target since it serves to supply Ukraine with Western weapons.\nReuters was unable independently to verify the reports.\nNuclear plant risk\nThe fighting in the area around the Zaporizhzhia nuclear power station has been a source of concern for weeks.\nThe complex supplied more than 20 per cent of Ukraine's electricity needs and its loss would pile new strain on the government.\nRussia's Novosti news agency reported safety systems at Zaporizhzhia were activated on Thursday after power cuts were reported across swathes of Russian-controlled territory.\nRussia's ground campaign has stalled in recent months after its troops were repelled from the capital Kyiv in the early weeks of the invasion.\nRussian forces control a swathe of territory in the south along Ukraine's Black Sea and Sea of Azov coasts, while the conflict has settled into a war of attrition in the Donbas.\nIn its daily briefing, Russia's defence ministry said it had destroyed eight Ukrainian warplanes in strikes at air bases in Ukraine's Poltava and Dnipropetrovsk regions. That would be one of the heaviest losses for Ukraine's air force in recent weeks.\nKyiv has repeatedly called for more, high-grade Western military hardware it says it needs to repel Russian attacks.\nZelensky spoke on Thursday by phone with US President Joe Biden, who reiterated US support for Ukraine against Russia, the White House said.\n\"We discussed Ukraine's further steps on our path to the victory over the aggressor and importance of holding Russia accountable for war crimes,\" Zelensky said in on Twitter.", "url": "https://www.straitstimes.com/world/europe/world-avoids-radiation-disaster-says-zelensky-after-power-cut-at-russian-held-nuclear-plant"}