{"authors": [], "date_download": "2024-10-12 14:05:26", "date_modify": "2024-10-12 14:05:26", "date_publish": "2022-10-13 11:45:22", "description": "Moscow renewed its warning that admitting Ukraine to Nato could trigger World War III. Read more at straitstimes.com.", "filename": "world_europe_ukraine-claims-new-gains-welcomes-western-air-defence-pledge_1728741926.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/13/file7n5n2zjl2ur1asoe75te.jpg?VersionId=qDb36EuJu6JJ6djz72aV9Dnc0ZForsyW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-claims-new-gains-welcomes-western-air-defence-pledge_1728741926.html", "title": "Russia pounds dozens of Ukraine towns, hits Kyiv region with 'kamikaze drones'", "title_page": "Russia pounds dozens of Ukraine towns, hits Kyiv region with 'kamikaze drones' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV/BRUSSELS - Russian missiles pounded more than 40 Ukrainian cities and towns, officials said on Thursday, as Nato allies meeting in Brussels unveiled plans to beef up Europe’s air defences after committing more military aid to Kyiv.\nThe new pledges prompted Moscow to renew warnings that Western states’ help made them “a direct party to the conflict” and that admitting Ukraine to Western military alliance Nato could trigger World War III.\n“Kyiv is well aware that such a step would mean a guaranteed escalation to a World War III,” deputy secretary of Russia’s Security Council, Mr Alexander Venediktov, told the state TASS news agency on Thursday as the United States vowed to defend “every inch” of allied territory.\nMoscow has repeatedly justified the Feb 24 invasion that has killed tens of thousands of people, in what it calls a “special operation”, by saying Ukraine’s ambitions to join the alliance posed a threat to Russia’s security.\nNato is not likely to quickly allow Ukraine to join, not least because its membership during an ongoing war would put the US and allies into direct conflict with Russia.\nEven before the war, Nato had dragged its feet on Ukrainian membership. Shortly after Russia’s invasion in February, Ukrainian President Volodymyr Zelensky signalled he was willing to consider neutrality.\nBut hours after Russian President Vladimir Putin proclaimed partially occupied regions of Donetsk, Luhansk, Kherson and Zaporizhzhia as Russian land on Sept 30, Mr Zelensky made a fast-track bid to join.\nIn the past 24 hours Russian missiles hit more than 40 settlements, while Ukrainian air force carried out 32 strikes on 25 Russian targets, Ukraine’s Armed Forces General Staff said.\nThe southern port city of Mykolaiv came under massive bombardment, local officials said.\n“It is known that a number of civilian objects were hit,” regional governor Vitaly Kim said in a social media post.\nHe said the top two floors of a five-storey residential building were completely destroyed and the rest were under rubble.\n'Kamikaze drones'\nRussia also targeted a settlement in the region of Ukraine’s capital Kyiv, where three drone strikes hit critical infrastructure early on Thursday, the region’s administration said on Telegram.\nGovernor of the Kyiv region, Mr Oleksiy Kuleba, said that based on preliminary information the strikes were caused by Iranian-made loitering munitions, often known as “kamikaze drones”.\nUkraine has reported a spate of Russian attacks with the Shahed-136 drones in recent weeks. Iran denies supplying the drones to Russia, while the Kremlin has not commented.\nMissiles struck about 30 multi-storey buildings and houses, gas pipelines and power lines in the city of Nikopol in the Dnipropetrovsk region, leaving more than 2,000 families without electricity, regional governor Dnipropetrovsk Governor Valentyn Reznichenko wrote on Telegram.\nReuters was not able to immediately verify the reports.\nAs his forces suffered several setbacks since September, Mr Putin has ordered the call-up of hundreds of thousands of reservists, proclaimed the annexation of occupied Ukrainian territory and repeatedly threatened to use nuclear weapons to protect Russia, including regions annexed last month.\nA senior Nato official said on Wednesday a Russian nuclear strike would almost certainly trigger a “physical response” from Ukraine’s allies and potentially Nato and on Thursday the US reaffirmed its commitment to its allies’ defence.\n“We are committed to defending every inch of Nato’s territory – if and when it comes to that,” US Defense Secretary Lloyd Austin said in Brussels ahead of a meeting of defence ministers from the alliance, including close-door talks by its nuclear planning group.\nSeparately, 15 European Nato members announced plans for joint procurement of air defence systems, dubbed “European Sky Shield” to better protect their territory.\nUN condemnation\nIn New York, three-quarters of the 193-member General Assembly – 143 countries – backed on Wednesday a resolution condemning Russia’s “attempted illegal annexation” of the four partially occupied regions in Ukraine.\nOnly Syria, Nicaragua, North Korea and Belarus joined Russia in voting against the resolution, while 35, including Moscow’s strategic partner China, abstained, and the rest did not vote.\nIn Brussels, more than 50 Western countries met on Wednesday to pledge more military aid to Ukraine, especially air defence weapons, after heavy retaliatory strikes this week ordered by Mr Putin in response to an explosion on a bridge in Crimea.\nAmong the pledges were promises of air defence system deliveries from France and Britain, and Canada’s commitment to provide artillery rounds among other supplies.\nAt the meeting, Mr Austin said Russia’s latest attacks laid bare its “malice and cruelty”. At least 26 people have been killed since Monday in Russian missile attacks across Ukraine.\nUkraine had shifted momentum since September with extraordinary gains, but would need more help, he said.\nSince Monday’s attacks, Germany has sent the first of four IRIS-T SLM air defence systems, while Washington said it would speed up delivery of a promised NASAMS air defence system.\n“The more assistance Ukraine gets now, the sooner we’ll come to an end to the Russian war,” Mr Zelensky said by video to a forum during International Monetary Fund and World Bank annual meetings in Washington. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-claims-new-gains-welcomes-western-air-defence-pledge"}