{"authors": ["Raul Dancel"], "date_download": "2024-10-12 13:27:50", "date_modify": "2024-10-12 13:27:50", "date_publish": "2023-11-14 22:25:00", "description": "It is one of 100 stamps misprinted in 1918 with a Curtiss ’Jenny’ biplane flying upside down. Read more at straitstimes.com.", "filename": "world_united-states_inverted-jenny-no-49-a-unicorn-in-stamp-collection-sells-for-27m_1728739670.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/14/rdstamp14b.png?h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_inverted-jenny-no-49-a-unicorn-in-stamp-collection-sells-for-27m_1728739670.html", "title": "‘Inverted Jenny’ No. 49 - a unicorn in stamp collection - sells for $2.7m", "title_page": "‘Inverted Jenny’ No. 49 – a unicorn in stamp collection – sells for $2.7m | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "One of the rarest and most coveted stamps in the world has been sold for US$2 million (S$2.7 million) to a real estate developer who, as a boy, dreamt of building a collection, but had nothing back then but pocket change.\nThe stamp – an “Inverted Jenny” – landed in the hands of 76-year-old stamp collector Charles Hack following an auction on Nov 8 in New York, The Washington Post reported on Monday.\nThe Inverted Jenny – considered the “holy grail of postage” – was a misprint of a stamp created in 1918 to commemorate the start of regular airmail service in the United States.\nPrinters made a sheet of 100 stamps with a Curtiss “Jenny” biplane flying upside down.\nBefore postal officials could destroy the misprinted sheet, a financial clerk named William Robey had already bought it at a post office during his lunch hour, paying US$24.\nHe hustled out of the post office and later dodged postal inspectors, who went looking for him in a frantic effort to get back that single sheet of paper.\nHe sold the sheet for US$15,000, and then bought himself a car that he crashed through a garage.\nThe Inverted Jenny is so well known that it featured in a 1993 episode of The Simpsons.\nIn one scene, Homer rummages through a box at a yard sale and pulls out pieces of history like a parchment copy of the Declaration of Independence, the first comic book featuring Superman, and a Stradivarius violin.\nHe discards them, calling them “junk”.\nHe then pulls out a sheet of Inverted Jenny stamps. “The aeroplane’s upside down,” he says, and throws the sheet away.\nThe sheet of 100 originally purchased by Mr Robey was eventually broken up into several blocks of four stamps and many individual stamps.\nPosition 49\nThe one Mr Hack managed to buy was Position 49 on the sheet of 100 stamps, described by The Washington Post as the “holiest of holy grails”.\nOut of the 100 stamps Mr Robey purchased in 1918, Position 49 had never been seen until it emerged in near-perfect condition in 2018.\nAll those years, it remained inside a safe-deposit box, and the collector’s descendants had left it untouched for decades.\nConfined to the safe-deposit box, the stamp was not exposed to light, nor was it ever affixed to a hinge, which collectors use to put stamps in albums.\nAll of that led to a superior specimen.\n“The colours in the paper are just beautiful and fresh,” Mr Scott Trepel, president of the Robert A. Siegel Auction Galleries, told The Washington Post.\n“There’s nothing better.”\nPosition 49 was put up for auction in 2018 and sold for US$1.6 million.\nMr Hack had a chance to buy it for himself back then, but his bid came up US$50,000 short.\nBy then, he already had another Inverted Jenny – Position 57 – which he had acquired for US$1 million, and was also among the best preserved of the 100 stamps.\n“I already had the other one that was nearly as good, and I just didn’t want to spend that much money,” he said.\nMr Hack has been collecting stamps since he was 11. But all he had back then was pocket change, so he had to settle for stamps few wanted.\nIt was not till after he made a fortune from selling real estate in the early 2000s that he finally managed to buy his first Inverted Jenny for US$300,000.\nWhen Position 49 resurfaced on the auction block on Nov 8, Mr Hack was ready.\n“This is the premium copy,” he told The Washington Post. “It doesn’t get any better than this.”", "url": "https://www.straitstimes.com/world/united-states/inverted-jenny-no-49-a-unicorn-in-stamp-collection-sells-for-27m"}