{"authors": [], "date_download": "2024-10-12 13:51:15", "date_modify": "2024-10-12 13:51:15", "date_publish": "2024-06-05 19:41:55", "description": "Global debt levels hit a record high of US$313 trillion in 2023. Read more at straitstimes.com.", "filename": "world_pope-calls-for-global-push-to-tackle-poor-nations-debt-crises_1728741075.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/05/LYNXMPEK540I4-1.jpg?VersionId=BDnxslXoMP566JhlpST.ZTPwRG25kzRx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_pope-calls-for-global-push-to-tackle-poor-nations-debt-crises_1728741075.html", "title": "Pope Francis calls for global push to tackle poor nations’ debt crises", "title_page": "Pope Francis calls for global push to tackle poor nations’ debt crises | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VATICAN CITY – The world must do more to reduce the debt burden faced by low income countries to avoid them entering a cycle of poverty and despair, Pope Francis said on June 5.\nGlobal debt levels hit a record high of US$313 trillion (S$421 trillion) in 2023, with developing economies scaling a fresh peak for the ratio of debt to their gross domestic product, according to a study released earlier in 2024.\nAddressing a Vatican conference on the debt emergency in the global south, Pope Francis said the problem was causing “misery and distress” for millions of people around the world.\n“In order to try to break the debt-financing cycle, it is necessary to create a multinational mechanism... that takes into account the global nature of the problem and its economic, financial and social implications,” he added.\nIn 2020, the world’s 20 largest economies agreed on a “Common Framework” to smooth the process of debt restructuring and help get poor countries back on their feet, but progress has been slow.\nIt has taken Zambia almost four years to drag itself out of default, leaving some hard lessons for richer nations about how their much-vaunted debt relief plan performed.\nAt present, there is no overarching international law governing international bankruptcies.\n“The absence of such a mechanism favours the mentality of ‘every person for himself or herself’, where the weakest always lose,” said the Pope, who comes from Argentina, a country that has defaulted on its debt three times this century.\n“No government can morally require that its people suffer deprivations incompatible with human dignity,” he added.\nThe Roman Catholic Church is due to hold a Holy Year, or Jubilee, in 2025 – one of the most important times in the Church calendar – and the Pope has already called on wealthy states to mark the event by offering debt relief for poor nations.\nAttending the Vatican conference, Nobel Prize-winning economist Joseph Stiglitz said the Covid-19 pandemic and war in Ukraine have given a major shock to the global economy, pushing the world to the “verge” of new sovereign debt crisis.\n“We need a Jubilee debt restructuring and a re-ordering of our global economic architecture to make sure that it doesn’t happen again,” he added.\nThe global Jubilee 2000 campaign resulted in US$130 billion of debt cancellation for poor countries between 2000 and 2015. REUTERS", "url": "https://www.straitstimes.com/world/pope-calls-for-global-push-to-tackle-poor-nations-debt-crises"}