{"authors": [], "date_download": "2024-10-12 14:19:09", "date_modify": "2024-10-12 14:19:09", "date_publish": "2022-03-09 02:35:17", "description": "Earlier, Shell stopped buying oil from Russia and said it would cut links to the country entirely. Read more at straitstimes.com.", "filename": "world_europe_fast-food-chain-mcdonalds-to-temporarily-close-restaurants-in-russia-as-moscows-isolation-deepens_1728742749.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/Tx-dZ5zwbONVxKDIWAfRdNeoHLP12rFAghYvUFA5bDQ.jpg?VersionId=VO.kzrqG4IvESq7ysmCflMedko4XG8MD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_fast-food-chain-mcdonalds-to-temporarily-close-restaurants-in-russia-as-moscows-isolation-deepens_1728742749.html", "title": "McDonald’s, Starbucks, Coca-Cola hit pause on Russia as isolation deepens", "title_page": "McDonald’s, Starbucks, Coca-Cola hit pause on Russia as isolation deepens | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON (REUTERS) - McDonald’s Corp and Starbucks Corp are temporarily closing hundreds of restaurants in Russia, with Coca-Cola and Pepsi among the latest Western companies to pause operations in the country after it moved troops into Ukraine.\nPepsiCo, the soft-drink and snack maker, will suspend all advertising in Russia and stop the sale of its drinks brands, while rival Coca-Cola said it will suspend its business there.\nFast-food chain McDonald’s said it would go on paying salaries to its 62,000 employees in Russia.\nThe closure of McDonald’s 847 restaurants also carry symbolic importance in Russia, where the first location to open, in central Moscow’s Pushkin Square in 1990, became a symbol of flourishing American capitalism as the Soviet Union fell.\nCoffee chain Starbucks also said on Tuesday it is suspending all business activity in Russia, including shipment of its products and cafes run by a licensee.\nEarlier, Shell stopped buying oil from Russia and said it would cut links to the country entirely while the United States stepped up its campaign to punish Moscow by banning Russian oil and energy imports.\nThe West’s moves to isolate Russia economically for attacking its neighbour have turbocharged global commodity and energy markets, sending prices soaring and threatening to derail the nascent recovery from the Covid-19 pandemic.\nBritain too said it would ban imports of Russian oil but only by gradually phasing them out during 2022 to give businesses time to find alternative sources of supply.\nThe surge in metal prices since Russia attacked Ukraine is starting to hurt some players caught on the wrong side of the market, as well as end consumers such as carmakers.\nThe London Metal Exchange (LME) halted trade in nickel on Tuesday after prices of the metal, a key component in electric vehicle batteries, doubled to more than US$100,000 (S$136,000) a tonne.\nShell’s decision to abandon Russia comes days after it faced a hail of criticism for buying Russian oil – a transaction that two weeks ago would have been routine – underlining how Moscow’s pariah status is growing even in a market it used to dominate.\n“We are acutely aware that our decision last week to purchase a cargo of Russian crude oil to be refined into products like petrol and diesel – despite being made with security of supplies at the forefront of our thinking – was not the right one, and we are sorry,” chief executive Ben van Beurden said.\nAlthough no sanctions have yet forced such divestments, Shell and rivals BP and Exxon Mobil have all announced plans to sell holdings in Russia and exit the country, leaving France’s TotalEnergies relatively isolated in hanging onto its investments there.\nHybrid delays\nDozens of companies have shut down activity in Russia since its invasion of Ukraine, which Moscow has termed a “special military operation” aimed not at occupying territory but at destroying Ukraine’s military capabilities.\nGerman sportswear maker Adidas, cosmetics firm Estee Lauder, and Calvin Klein and Tommy Hilfiger owner PVH Corp are among the latest brands to announce the suspension of activities there.\nIt has also driven a surge in commodity prices, which mining group BHP warned could spill over into already skyrocketing inflation and potentially affect global growth.\nNickel prices soared when China’s Tsingshan Holding Group, one of the world’s top nickel and stainless steel producers, bought large amounts of nickel to reduce its bets that prices would fall, three sources familiar with the matter said.\nTsingshan and the LME declined to comment.", "url": "https://www.straitstimes.com/world/europe/fast-food-chain-mcdonalds-to-temporarily-close-restaurants-in-russia-as-moscows-isolation-deepens"}