{"authors": [], "date_download": "2024-10-12 14:02:07", "date_modify": "2024-10-12 14:02:07", "date_publish": "2023-05-23 00:44:14", "description": "The regime gives special powers to security services and enforces of a number of curbs and measures. Read more at straitstimes.com.", "filename": "world_europe_anti-terror-regime-in-russian-region-after-cross-border-incursion-governor_1728741727.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/23/btbelrogod2020523_0.jpg?VersionId=yPsrox.UTNBoNUnwGl7sPa8TQryb03.L", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_anti-terror-regime-in-russian-region-after-cross-border-incursion-governor_1728741727.html", "title": "‘Anti-terror regime’ introduced in Russian region after cross-border incursion, says governor", "title_page": "‘Anti-terror regime’ introduced in Russian region after cross-border incursion, says governor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW – The Russian authorities on Monday introduced an “anti-terror regime” in the southern region of Belgorod after Moscow accused a “sabotage” group of crossing over from Ukraine.\n“In order to ensure the safety of citizens in the Belgorod region, the legal counter-terror regime has been introduced today,” Governor Vyacheslav Gladkov said in a statement.\nThe regime gives special powers to security services and entails the enforcement of a number of restrictions and measures, including beefed-up security, identity verification and communications surveillance.\nThe authorities can also displace people living in an affected area.\nAn “anti-terror regime” was in force in Chechnya between 1999 and 2009 when the Russian authorities battled insurgents during Moscow’s second military campaign in the mountainous region.\nThe authorities also periodically introduce such legal regimes for short periods of time, usually in the volatile North Caucasus.\nEarlier on Monday, Moscow said its troops battled a Ukrainian “sabotage” group that infiltrated the region of Belgorod.\nKyiv denied involvement, but members of the anti-Kremlin Freedom of Russia Legion claimed responsibility for the attack. AFP", "url": "https://www.straitstimes.com/world/europe/anti-terror-regime-in-russian-region-after-cross-border-incursion-governor"}