{"authors": [], "date_download": "2024-10-12 13:36:08", "date_modify": "2024-10-12 13:36:08", "date_publish": "2024-09-10 19:07:44", "description": "NEWRY, Northern Ireland - Jeffrey Donaldson, the former leader of Northern Ireland's Democratic Unionist Party (DUP), pleaded not guilty on Tuesday to 18 charges related to historical sex offences, including one count of rape. Read more at straitstimes.com.", "filename": "world_europe_northern-irelands-donaldson-pleads-not-guilty-to-historical-sex-offences_1728740168.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/LYNXMPEK890DU-1.jpg?VersionId=mToT5C7QKZsJnBT74qyg4l9eVBVJRvhG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_northern-irelands-donaldson-pleads-not-guilty-to-historical-sex-offences_1728740168.html", "title": "Northern Ireland's Donaldson pleads not guilty to historical sex offences", "title_page": "Northern Ireland's Donaldson pleads not guilty to historical sex offences | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEWRY, Northern Ireland - Jeffrey Donaldson, the former leader of Northern Ireland's Democratic Unionist Party (DUP), pleaded not guilty on Tuesday to 18 charges related to historical sex offences, including one count of rape.\nHis trial will begin on March 24, Newry Crown Court heard.\nDonaldson, one of Northern Ireland's best-known politicians, stepped down suddenly as head of the British region's largest unionist party in March after the DUP said he had been charged with allegations of an historical nature.\nThe charges include 13 counts of indecent assault on a female child and four counts of gross indecency towards a child. The charges relate to two complainants and the events allegedly took place between 1985 and 2008.\nDonaldson's wife Eleanor pleaded not guilty to three charges, including aiding and abetting rape, during Tuesday's hearing. REUTERS", "url": "https://www.straitstimes.com/world/europe/northern-irelands-donaldson-pleads-not-guilty-to-historical-sex-offences"}