{"authors": [], "date_download": "2024-10-12 13:37:22", "date_modify": "2024-10-12 13:37:22", "date_publish": "2024-09-16 09:31:04", "description": "The PCG's vessel, Teresa Magbanua, was deployed to Sabina Shoal in April. Read more at straitstimes.com.", "filename": "world_philippines-to-continue-to-deploy-vessels-in-contested-south-china-sea-shoal_1728740242.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/16/2024-09-12T062918Z1616586550RC2TY9APSWC4RTRMADP3SOUTHCHINASEA-PHILIPPINES.JPG?VersionId=SdzQ.ZWZ8xkLIUCKQGlscwOlsWkkgphr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_philippines-to-continue-to-deploy-vessels-in-contested-south-china-sea-shoal_1728740242.html", "title": "Philippines to continue to deploy vessels in contested South China Sea shoal", "title_page": "Philippines to continue to deploy vessels in contested South China Sea shoal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA - The Philippines will continuously deploy vessels in the contested Sabina Shoal in the South China Sea, its coast guard said on Sept 16 after a Philippine ship returned to port after a five-month deployment there.\n“We will sustain presence over these waters,” Philippine Coast Guard (PCG) spokesperson Jay Tarriela told a press conference.\nThe PCG’s vessel, Teresa Magbanua, was deployed to Sabina Shoal in April to monitor what Manila suspects to be China’s small-scale land reclamation activities in the area. It returned to port on Sept 15.\nMr Tarriela said the ship's return was not related to China's demand for Manila to withdraw its vessel, instead it was so it could be repaired and to attend to the crew's medical needs.\nSabina Shoal, which China refers to as Xianbin Reef and the Philippines as the Escoda Shoal, lies west of the Philippine province of Palawan, within the country's exclusive economic zone.\n\"Regardless of what size of vessel, regardless of how many vessels, the main objective and the commitment of the (PCG) commandant… is to make sure that at any one time, there will be a coast guard presence in the shoal,\" Mr Tarriela said.\nChina's coast guard said on Sept 15 that it would continue to carry out law enforcement activities in the waters under Beijing's jurisdiction in accordance with the law and safeguard its territorial sovereignty and maritime rights and interests.\nChina claims sovereignty over most of the South China Sea, overlapping into maritime zones of Brunei, Indonesia, Malaysia, the Philippines and Vietnam.\nIn 2016, the Hague arbitration tribunal voided China's expansive and historical claims, a decision Beijing rejects. REUTERS", "url": "https://www.straitstimes.com/world/philippines-to-continue-to-deploy-vessels-in-contested-south-china-sea-shoal"}