{"authors": [], "date_download": "2024-10-12 14:02:25", "date_modify": "2024-10-12 14:02:25", "date_publish": "2023-05-09 09:28:00", "description": "Ukraine has recently said destroying infrastructure is preparation for a planned ground assault. Read more at straitstimes.com.", "filename": "world_europe_ukraine-shells-russias-border-region-says-belgorod-governor_1728741745.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/09/RUSSIA-UKRAINE-CONFLICT-EXPLOSION-211427_0.jpg?VersionId=aItVyft1ZQ0UWaOpJC2wFnorE3iGfVbT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-shells-russias-border-region-says-belgorod-governor_1728741745.html", "title": "Ukraine shells Russia's border region, says Belgorod governor", "title_page": "Ukraine shells Russia's border region, says Belgorod governor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Ukrainian forces shelled the Belgorod region along Russia’s border with Ukraine on Monday, injuring at least five people and damaging houses and power lines, the region’s governor said.\nThe town of Shebekino in southern Belgorod was shelled three times and five people were injured, governor Vyacheslav Gladkov said on his Telegram messaging channel.\nAt least five other settlements also came under fire, he added.\nLate on Monday, Russia’s air defence systems shot down a drone over the town of Valuyki, Mr Gladkov said. There was no immediate information on casualties and destruction, but emergency services were working on the site.\nMr Gladkov said that the shelling damaged a number of private houses, a farm, infrastructure and power lines.\nBoth sides deny targeting civilians in the 14-month-old Russian invasion of Ukraine that started on Feb 24, 2022.\nUkraine almost never publicly claims responsibility for attacks inside Russia and on Russian-controlled territory in Ukraine.\nBut it has said recently that destroying infrastructure is preparation for a planned ground assault. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-shells-russias-border-region-says-belgorod-governor"}