{"authors": [], "date_download": "2024-10-12 13:41:27", "date_modify": "2024-10-12 13:41:27", "date_publish": "2024-07-21 04:58:54", "description": "ATHENS - A Greek border guard was treated in hospital after suffering an injury from shots fired by unidentified people at police on patrol close to Greece's northern border with Turkey, Greek police said. Read more at straitstimes.com.", "filename": "world_europe_greek-border-guard-injured-by-shots-near-northern-border-with-turkey-police-say_1728740487.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/21/ST-logo-placeholder_6.jpg?VersionId=7JPosxS9rLQBzH5JRdwDo5YLrrLL1iLc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_greek-border-guard-injured-by-shots-near-northern-border-with-turkey-police-say_1728740487.html", "title": "Greek border guard injured by shots near northern border with Turkey, police say", "title_page": "Greek border guard injured by shots near northern border with Turkey, police say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ATHENS - A Greek border guard was treated in hospital after suffering an injury from shots fired by unidentified people at police on patrol close to Greece's northern border with Turkey, Greek police said.\nThe shots were fired from the Turkish territory as Greek border guards tried to prevent migrants from illegally crossing from Turkey to an area close to the Evros river on the Greek side, the police said in a statement.\n\"The incident is being investigated by the relevant Greek authorities,\" the statement said.\nGreece, which has numerous differences with Turkey, has been a gateway to Europe for thousands of migrants who crossed through land near the Evros river - which marks the Greek-Turkish border - or the Mediterranean Sea. REUTERS", "url": "https://www.straitstimes.com/world/europe/greek-border-guard-injured-by-shots-near-northern-border-with-turkey-police-say"}