{"authors": [], "date_download": "2024-10-12 14:00:47", "date_modify": "2024-10-12 14:00:47", "date_publish": "2023-07-03 18:30:00", "description": "Russian media reported that security has been stepped up in Crimea. Read more at straitstimes.com.", "filename": "world_europe_russia-says-it-thwarted-ukrainian-plot-to-kill-top-moscow-backed-official-in-crimea_1728741647.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/03/dw-crimea-aksyonov-230703_2.JPG?VersionId=Yz8Ih_SE_RWOd429pNRUJQi.m7Z7KIsc&h=b973101f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-says-it-thwarted-ukrainian-plot-to-kill-top-moscow-backed-official-in-crimea_1728741647.html", "title": "Russia says it thwarted Ukrainian plot to kill top Moscow-backed official in Crimea", "title_page": "Russia says it thwarted Ukrainian plot to kill top Moscow-backed official in Crimea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW – Russia’s FSB security service said on Monday it had thwarted a Ukrainian assassination attempt on Mr Sergei Aksyonov, the Russian-backed head of Crimea, arresting an agent before he was able to blow up Mr Aksyonov’s car.\nThere was no immediate comment from Ukraine.\nRussian media have reported that security has been stepped up in Crimea, the Black Sea peninsula that Russia annexed from Ukraine in 2014, and that additional checks are being made on crossings from Russia’s southern Krasnodar region into Crimea.\nThe FSB said in a statement that it had arrested a Russian national recruited by Ukraine’s SBU intelligence agency who had undergone explosives, reconnaissance and sabotage training in Ukraine.\nHis plan, it said, had been to blow up Mr Aksyonov’s car, but he had been detained as he tried to retrieve an explosive device from a hiding place.\nFootage broadcast on state TV showed masked FSB operatives detaining a man in a tracksuit as he walked into a wooded area. A green sack was shown containing what were described as elements of an explosive device.\nThe detainee was then shown with his face blurred out confessing that he was a Ukrainian agent and had planned to place the explosives in a car parked on the route used by Mr Aksyonov’s cortege in the city of Simferopol.\nIt was unclear whether the man was speaking under duress, and Reuters was unable to verify the footage.\nThe FSB did not name the man, who it said was in his mid-30s and had entered Crimea in June.\nMr Aksyonov thanked the FSB and said he was sure that the individuals who ordered the assassination would be found and punished.\nThe FSB said in May it had arrested seven people connected with Ukrainian intelligence on suspicion of plotting attacks against Mr Aksyonov and other Russian-backed officials.\nUkraine has pledged to retake full control of Crimea, the headquarters of Russia’s Black Sea Fleet, as well as large areas of eastern and southern Ukraine that Russia has captured since launching what it calls its “special military operation” in 2022, something Kyiv and the West call a brutal war of conquest.\nRussia’s Izvestia newspaper reported on Monday that a 13km long traffic jam had formed at the entrance in Russia’s southern Krasnodar region to the bridge to Crimea.\nIt said that Crimean transport officials had increased the number of checkpoints around the bridge on Sunday. REUTERS", "url": "https://www.straitstimes.com/world/europe/russia-says-it-thwarted-ukrainian-plot-to-kill-top-moscow-backed-official-in-crimea"}