{"authors": [], "date_download": "2024-10-12 14:08:07", "date_modify": "2024-10-12 14:08:07", "date_publish": "2022-06-24 16:14:26", "description": "The press service of the city's civilian and military administration told TASS news agency this was a \"targeted assassination\". Read more at straitstimes.com.", "filename": "world_europe_moscow-installed-official-killed-in-ukraines-kherson_1728742087.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/24/AK_rusl_240622.jpg?VersionId=R.wo94UYrf6rkZhGGlmseevZZJiiFeJw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_moscow-installed-official-killed-in-ukraines-kherson_1728742087.html", "title": "Moscow-installed official killed in Ukraine's Kherson", "title_page": "Moscow-installed official killed in Ukraine's Kherson | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW (AFP) - A Moscow-appointed official in Ukraine's southern Kherson region was killed in an explosion, Russian news agencies reported on Friday (June 24), the latest in a string of attacks on pro-Kremlin officials in Ukrainian regions under Russian control.\n\"According to preliminary data, he died. An explosive device was planted in his car,\" a representative of the Kherson region administration told Interfax, confirmed by other news agencies.\nThe Moscow-appointed deputy leader of Kherson region, Mr Kirill Stremousov, confirmed to the RIA Novosti news agency the identity of the victim.\n\"Yes, one of my employees died. Dmitry Savluchenko, the head of the department of youth and sport,\" Mr Stremousov said.\nThe press service of the city's civilian and military administration told TASS news agency this was a \"targeted assassination\", adding that the official was the only victim in the blast.\nThere have been an increased number of attacks against pro-Kremlin officials in Ukrainian regions that have come under Moscow control since late February.\nOn Wednesday, a pro-Russian official in the village of Chornobaivka survived the explosion of a bomb planted in his car, while the head of the prison services of Kherson region was injured in a bomb attack on June 18.\nIn late May, the mayor of Enerhodar in the southern Zaporizhzhia region, who was appointed after Russian troops took control of the city, was wounded in an explosion that Moscow blamed on Ukrainian nationalists.", "url": "https://www.straitstimes.com/world/europe/moscow-installed-official-killed-in-ukraines-kherson"}