{"authors": [], "date_download": "2024-10-12 13:49:52", "date_modify": "2024-10-12 13:49:52", "date_publish": "2024-09-05 22:56:04", "description": "New French Prime Minister Mr Barnier must run a country riven by deep political faultlines. Read more at straitstimes.com.", "filename": "world_europe_after-negotiating-brexit-michel-barnier-tasked-with-propping-up-macron_1728740992.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/FILES-FRANCE-POLITICS-GOVERNMENT-115005.jpg?VersionId=gcoXiwZ5qekCxfRGuXaOPTXE_bpOs0VP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_after-negotiating-brexit-michel-barnier-tasked-with-propping-up-macron_1728740992.html", "title": "After negotiating Brexit, Michel Barnier tasked with propping up Macron", "title_page": "After negotiating Brexit, Michel Barnier tasked with propping up Macron | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - After making his name negotiating Brexit, one of the messiest muddles Brussels has faced in recent years, French Prime Minister Michel Barnier now faces an equally daunting task: running a country riven by deep political faultlines.\nPresident Emmanuel Macron named Barnier, 73, his prime minister on Sept 5, capping a weeks-long search following his ill-fated decision to call a snap legislative election that delivered an unruly hung parliament.\nIt was a choice he couldn't afford to get wrong, with growing questions about whether he would see out his second and final term until 2027.\nMr Barnier, a veteran conservative French politico who was the European Union's negotiator during divorce talks with Britain, faces an unenviable in-tray, including having to push imminent budget legislation with bruising spending cuts through a deeply divided parliament.\nThe choice appeared to please investors, with government borrowing costs falling slightly and the euro up.\nMr Barnier's appointment reflects Mr Macron's view that the election delivered a parliament with a centre-right lean, even though a leftist alliance, hastily assembled to block the far-right from power, came first. The left called the appointment a \"democratic coup\" and announced street protests.\nCrucially, though, Mr Barnier secured tentative support from Ms Marine Le Pen's far-right National Rally (RN), though with strings attached that mean Mr Barnier will likely find himself under pressure from all sides.\n\"We will plead for the major emergencies of the French - the cost of living crisis, security, immigration - to finally be addressed, and we reserve all political means of action if this is not the case in the coming weeks,\" the RN's party president, Mr Jordan Bardella, tweeted.\nBorn in 1951 near the French Alpine city of Grenoble, Mr Barnier first became a lawmaker aged 27, and later starred in several French governments, including as foreign minister and agriculture minister.\nHe has long held senior EU jobs, including regional policy commissioner and internal market commissioner.\nDuring Brexit negotiations, he became a bogeyman for Britain's anti-EU camp, who cast him as the personification of Brussels' obsession with enforcing its rules. Veteran UK Brexit campaigner Nigel Farage greeted the Sept 5 announcement by branding Mr Barnier \"an EU fanatic\".\nAn older, taller Macron?\nAfter Brexit, Mr Barnier turned his attention back to French politics, failing in a 2021 attempt to become the presidential candidate of the centre-right Republicans, despite hardening his views on issues such as immigration.\nMr Barnier's relations with Mr Macron will come under the microscope. Mr Macron aides stressed the president wanted a prime minister with at least the semblance of an adversarial relationship, but he is also desperate to preserve his legislative achievements, including a hard-won pension reform and billions in tax cuts for households and firms.\nSome commentators were sceptical Mr Barnier would push back much against the president. Communist Party spokesman Ian Brossat said on BFM TV that Mr Barnier was little more than a slightly older, slightly taller version of Mr Macron.\nMr Barnier may also find himself having to row back some of his previously held beliefs.\nIn an interview earlier this year, Mr Barnier said it was only \"political opportunism\" that prevented Ms Le Pen from cheering more loudly for Brexit, adding that there should be \"no complacency, no weakness\" against the \"anti-European theses\" of the far right: \"Never, never, never,\" he said.\nMeanwhile, he was forthright about Mr Macron's political future, saying in a 2022 interview with Le Figaro that \"Macronism... is set to disappear in 2027.\"\nBy appointing Mr Barnier, Mr Macron will be hoping it doesn't happen sooner. REUTERS", "url": "https://www.straitstimes.com/world/europe/after-negotiating-brexit-michel-barnier-tasked-with-propping-up-macron"}