{"authors": [], "date_download": "2024-10-12 13:35:27", "date_modify": "2024-10-12 13:35:27", "date_publish": "2023-11-14 18:50:50", "description": "JERUSALEM/ When Hamas gunmen stormed southern Israel on Oct. 7 and rocket sirens pierced the early morning quiet across the country, Israel's premier museums went into war mode, rushing to protect their most precious artwork and artefacts. Read more at straitstimes.com.", "filename": "world_middle-east_israels-museums-enact-war-protocol-to-protect-most-precious-treasures_1728740127.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/14/LYNXMPEJAD0EA-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israels-museums-enact-war-protocol-to-protect-most-precious-treasures_1728740127.html", "title": "Israel's museums enact war protocol to protect most precious treasures", "title_page": "Israel's museums enact war protocol to protect most precious treasures | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM/TEL AVIV - When Hamas gunmen stormed southern Israel on Oct. 7 and rocket sirens pierced the early morning quiet across the country, Israel's premier museums went into war mode, rushing to protect their most precious artwork and artefacts.\nThe Dead Sea Scrolls. Ancient dedication plaques on loan from the Louvre. A 1916 masterpiece by Austrian painter Gustav Klimt. These and other treasures were quickly taken off display and brought to special bunkers to ensure they are not damaged during the war.\n\"To take off an exhibition is something that usually is not done because we trust the building, we trust the safety of the showcases. But this is a different situation so we have to act accordingly,\" said Hagit Maoz, curator of the Shrine of the Book at Jerusalem's Israel Museum.\nThe iconic building, shaped like the lids of the jars in which the Dead Sea Scrolls were found, is usually packed with visitors eager to glimpse the collection of ancient religious texts. Today the eight display cases lining the walls have paper notes saying \"temporarily removed\".\nThe last time the museum removed the display, Maoz said, was during the 1991 Gulf War when Iraq fired missiles at Israel.\nThe Hamas attack over a month ago sparked the war in Gaza, where Israel has since carried out a devastating bombardment and ground offensive. Thousands of rockets have been fired at Israel.\nNurith Goshen, curator of Chalcolithic and Bronze Age archaeology, was cleaning up broken glass from a rocket strike near her home outside Jerusalem on Oct. 7 when the museum called announcing the war protocol and asking to confirm her list.\n\"You really have to choose the finest or the most fragile artefacts,\" she said.\nHer list included items on loan from the Louvre and the British Museum, and she said they got permission from those museums before taking them down.\n\"You really understand the meaning of what we are holding here, and what we have under our custodianship for Israel, but also for the world,\" said Goshen.\nThe Tel Aviv Museum of Art took similar precautions.\nGustav Kimt's Portrait of Friedericke Maria Beer, painted two years before his death, is now stored on a rack in a fortified underground bunker with other works. The paintings left behind blank spaces on the gallery's wall.\n\"These works of art have experienced war, some of them survived World War Two,\" said museum director Tania Coen-Uzzielli. \"We are custodians for a short time, and we needed to protect them. To protect them for posterity and for history.\" REUTERS", "url": "https://www.straitstimes.com/world/middle-east/israels-museums-enact-war-protocol-to-protect-most-precious-treasures"}