{"authors": [], "date_download": "2024-10-12 14:00:45", "date_modify": "2024-10-12 14:00:45", "date_publish": "2024-02-01 19:09:00", "description": "The leaders unanimously agree to extend S$72 billion in aid to Ukraine. Read more at straitstimes.com.", "filename": "world_europe_eu-summit-agrees-on-ukraine-aid-overcoming-hungary-objections_1728741645.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/01/BELGIUM-EU-POLITICS-SUMMIT-DIPLOMACY-104612.jpg.JPEG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_eu-summit-agrees-on-ukraine-aid-overcoming-hungary-objections_1728741645.html", "title": "EU summit agrees on Ukraine aid as Hungary falls in line", "title_page": "EU summit agrees on Ukraine aid as Hungary falls in line | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS – European Union leaders unanimously agreed on Feb 1 to extend €50 billion (S$72 billion) in aid to Ukraine, the chairman of the summit said, overcoming weeks of resistance from Hungary and winning praise from Kyiv.\nBefore the summit started, EU leaders had piled pressure on Hungary to lift its block, telling Hungarian Prime Minister Viktor Orban to pick sides in what several saw as an existential challenge posed by Russia’s war in Ukraine, the biggest conflict in Europe since World War II.\n“We have a deal. Unity,” said European Council president Charles Michel in a post on X. “All 27 leaders agreed on an additional €50 billion support package for Ukraine within the EU budget.”\nUkrainian President Volodymyr Zelensky welcomed the agreement, saying the aid would strengthen the long-term economic and financial stability of his country as the war with Russia approaches its third year.\nUkraine's dollar bonds gained on the news. Kyiv, which relies heavily on Western aid as it fights Moscow, said it expected to receive the first tranche of €4.5 billion (S$6.53 billion) from the EU in March.\nThe agreement comes after weeks of wrangling with Mr Orban, who vetoed the aid package in December 2023. There was no comment from Hungary on the deal.\nDiplomats told Reuters that, in exchange for Hungary’s green light for the Ukraine aid, the bloc did not commit to releasing any of the billions of euros of EU funds intended for Hungary but frozen by Brussels over widespread concerns about human rights and the rule of law in the country.\nThey said the aid deal included a yearly discussion of the package and the option to review it in two years “if needed”, but no clear veto right for Budapest.\nWith an agreement on budget support done, the leaders were next discussing military aid for Kyiv.\nThe bloc is seen falling short of its target of sending artillery shells to Ukraine, while a stand-off between Germany – the EU’s paymaster – and other member states casts uncertainty over the future of a military aid fund that has bankrolled billions of euros in arms for Ukraine.\nBefore the summit began, leaders of Germany, Poland, Belgium and Finland were among others to say on Feb 1 that it was crucial the 27-nation bloc agreed as one to offer aid to Kyiv from their joint budget through 2027.\nMr Orban, who has cultivated close ties with Moscow, has stepped up criticism of the EU’s strategy to prop up Ukraine with financial and military aid.\nOn Feb 1, he posted pictures of himself on social media walking around tractors ahead of a farmers’ protest in Brussels.\nHe and an aide to Mr Michel posted pictures of groups of leaders seemingly discussing a draft agreement in separate huddles before they all met behind closed doors.\nGerman Chancellor Olaf Scholz had made clear what the expectation of the other 26 EU countries was on Feb 1, saying the EU is “a community in which all stand in solidarity”.\nPolish Prime Minister Donald Tusk said the time for Mr Orban’s “games” was over: “He has to consider if he is in, or out.”", "url": "https://www.straitstimes.com/world/europe/eu-summit-agrees-on-ukraine-aid-overcoming-hungary-objections"}