{"authors": ["Nirmal Ghosh"], "date_download": "2024-10-12 13:45:29", "date_modify": "2024-10-12 13:45:29", "date_publish": "2023-09-30 11:00:00", "description": "US State Dept’s official readout of meeting made no mention of Sikh separatist's murder in Canada. Read more at straitstimes.com.", "filename": "world_united-states_india-us-work-around-canada-tensions_1728740729.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/30/2023-09-28T193011Z1721646009RC2QH3AHZPS4RTRMADP3USA-INDIA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_india-us-work-around-canada-tensions_1728740729.html", "title": "India, US work around Canada tensions", "title_page": "India, US work around Canada tensions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Even as tension between India and Canada hung over his visit to Washington this week, Indian Foreign Minister Subrahmanyam Jaishankar projected an air of confident nonchalance – signalling that the issue over Sikh separatists, while awkward, will not affect the burgeoning US-India relationship.\nRelations between India and Canada have plunged since Canada’s Prime Minister Justin Trudeau on Sept 18 cited “credible allegations” that Indian agents were responsible for killing Canadian citizen Hardeep Singh Nijjar – who was wanted in India on terrorism charges – in Surrey, British Columbia, in June. India called the allegation “absurd”.\nCanada is the United States’ closest ally and is part of the Five Eyes intelligence-sharing alliance alongside the US, Australia, New Zealand and Britain – thus raising uncomfortable questions.\nThe US had earlier made clear that it expected the Indian government to work with Canada on efforts to investigate the possible involvement of Delhi agents in Mr Nijjar’s murder.\nBut while the matter was discussed in Dr Jaishankar’s meetings in Washington, it was clearly done so quietly.\nUS Secretary of State Antony Blinken, after meeting the minister on Thursday, said he hoped India and Canada would work together to resolve the matter, and that those responsible for the June 18 killing should be held accountable.\nBut the US State Department’s official readout of their meeting made no mention of the issue. Instead, it said they had “discussed a full range of issues, including key outcomes of India’s G-20 presidency… (and) emphasised the continued importance of cooperation… in particular in the areas of defence, space, and clean energy”.\nAt a talk and discussion at the conservative think-tank Hudson Institute on Friday, Dr Jaishankar said the US side had shared its “assessment of the... situation”.\n“I explained to them, at some length, the summary of the concerns which I had,” he said. “Hopefully, we both came out of those meetings better informed.”\nIndia maintains that Canada has for too long tolerated the activities of what analysts say is a small minority among the country’s around 770,000 Sikh population, who advocate Khalistan, a separate homeland for Sikhs carved out of India’s Punjab state.\nMr Jeff Smith, director of the Asian Studies Centre at conservative think-tank The Heritage Foundation, told The Straits Times that the minister’s visit was a sign of the maturity and growth of the US-India relationship.\n“Issues that might have once caused considerable diplomatic friction are being dealt with responsibly behind closed doors without hindering momentum in practical cooperation across multiple domains,” Mr Smith said.\nThe success of the Sept 9 to 10 Group of 20 summit in New Delhi, and the launch of the much-talked-about India-Middle East-Europe Economic Corridor initiative, are cementing India’s growing leadership of the Global South, said Dr Aparna Pande, director of the Hudson Institute’s Initiative on the Future of India and South Asia.\n“The US government has gone out of its way to emphasise the criticality of the partnership with India,” Dr Pande told ST. “The partnership is on an upward trajectory.”\nAt the Hudson Institute, Dr Jaishankar made the point that India is now “working with” the US. “In the past, we have always dealt with each other, sometimes not entirely happily,” he said.\n“Working with each other is really uncharted territory – a territory which we have both entered in the last few years. And it has required both of us really to overcome what (Indian Prime Minister Narendra Modi) called the hesitations of history.”\nDr Jaishankar’s visit to Washington, on the heels of the United Nations General Assembly in New York, was an opportunity to demonstrate that US-India ties remain strong, and also to begin to find a path out of the crisis with Canada, said Ms Lisa Curtis, a former deputy assistant to the US president and the National Security Council’s senior director for South and Central Asia from 2017 to 2021.\n“India’s critical role in the Quad and in dealing with the China challenge means the Biden administration will seek to compartmentalise this incident from the broader strategic relationship,” said Ms Curtis, now a senior fellow and director of the Indo-Pacific Security Programme at the Centre for a New American Security, a Washington think-tank.\nThe Quad, or Quadrilateral Security Dialogue, comprises India, Australia, Japan and the US in a loose, largely maritime coalition, focused on commitment to a free and open as well as stable Indo-Pacific. India is due to host a Quad summit in 2024.\n“Six or seven years ago, there might have been more churn in the US system over (Canada’s) allegations,” Ms Curtis told ST.\n“But now that US-China competition is the No. 1 foreign policy issue for the United States, Washington will do everything it can to avoid disrupting the positive trajectory in its ties with India, while also upholding fundamental principles regarding human rights and law and order,” she said.", "url": "https://www.straitstimes.com/world/united-states/india-us-work-around-canada-tensions"}