{"authors": [], "date_download": "2024-10-12 13:44:30", "date_modify": "2024-10-12 13:44:30", "date_publish": "2023-12-16 20:58:01", "description": "Sheikh Meshal al-Ahmad al-Sabah was named as Kuwait's new emir on Saturday after the death of his brother Sheikh Nawaf al-Ahmad al-Sabah aged 86. Read more at straitstimes.com.", "filename": "world_for-kuwaits-new-emir-saudi-ties-are-seen-as-key_1728740670.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/16/LYNXMPEJBF032-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_for-kuwaits-new-emir-saudi-ties-are-seen-as-key_1728740670.html", "title": "For Kuwait's new emir, Saudi ties are seen as key", "title_page": "For Kuwait's new emir, Saudi ties are seen as key | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUWAIT - Sheikh Meshal al-Ahmad al-Sabah was named as Kuwait's new emir on Saturday after the death of his brother Sheikh Nawaf al-Ahmad al-Sabah aged 86.\nSheikh Meshal, 83, spent much of his career helping build the Gulf state's security and defence apparatus before stepping into the public eye when he became crown prince three years ago.\nHe was thrust further into the spotlight when he was handed most of the frail Emir Sheikh Nawaf's duties in November, 2021.\nSheikh Meshal becomes Kuwait's third emir in just over three years. Until 2020, the post had been held for 14 years by Sheikh Sabah al-Ahmad, a prominent figure in the Arab world known for helping lead Kuwait out of the ruins of Iraq's 1990 invasion.\nAs he takes the helm of the OPEC oil producer, Sheikh Mehshal is expected to preserve key Kuwaiti foreign policies including support for Gulf Arab unity, Western alliances, and good ties to Riyadh - a relationship seen as a top priority to him.\nHe may also look to expand ties to China as it seeks a bigger role in the region, especially after Beijing sponsored a deal that normalised ties between Iran and Saudi Arabia in March.\nSheikh Meshal signed several economic agreements during a visit to China in September, when he attended the opening ceremony of the Asian Games.\n\"He desires stability, and stresses the importance of Kuwait's relationship with Saudi Arabia in particular,\" a Kuwaiti source said, adding that Sheikh Meshal was concerned about the regional situation and afraid of wars in the region.\nA Western diplomat described Sheikh Meshal as an early riser with a methodical work style. \"He pays attention to details, sometimes to the very small details,\" the diplomat said. While Sheikh Sabah had been closer to diplomatic work, Sheikh Meshal was closer to the military, the diplomat said.\nSheikh Meshal was deputy chief of the National Guard from 2004-2020 and head of State Security for 13 years after joining the interior ministry in the 1960s. He had been offered several senior roles in the past but declined them, experts say.\nHe attended Britain's Hendon Police College and was credited with helping to reform the National Guard.\nSheikh Meshal is the seventh son of former ruler Ahmed Al-Jaber, and a brother of three former rulers, Sheikh Jaber Al-Ahmad, Sheikh Sabah Al-Ahmad, and Sheikh Nawaf Al-Ahmad. He is married and has five sons and seven daughters.\nSome believe he may move to further align Kuwait with Riyadh. His first calls after taking on Sheikh Nawaf's duties were with King Salman and Crown Prince Mohammed bin Salman, and his first trip outside the Kuwait was to Saudi Arabia, which he has visited more than any other country.\nAs emir, he will have to grapple with long-running strains between the ruling family and its critics in the perpetually deadlocked and fractious parliament that critics say have hindered fiscal and economic reform.\nKuwait's legislature wields more influence than similar bodies in other Gulf monarchies. The resulting political deadlock has for decades led to cabinet reshuffles and dissolutions of parliament.\nThe first two years of Sheikh Nawaf's rule were buffeted by political turbulence with eight governments formed and three parliamentary elections held.\nIn 2022, Sheikh Meshal intervened in a protracted dispute between the government and parliament. He dissolved parliament, decreed new elections and replaced the prime minister but declared no intention to interfere in the vote or the selection of parliament speaker.\nHis move was widely welcomed by the opposition.\nHe also pledged to adhere to the constitution and not to amend, revise, or suspend it, in a speech delivered on behalf of the emir in June 2022. Parliamentarians and analysts considered this historic.\nAlthough the 2022 elections were annulled by the Constitutional Court in March 2023, the subsequent vote - won by a majority of lawmakers who declare themselves \"reformists\" - led to a rare consensus between parliament and the government. REUTERS", "url": "https://www.straitstimes.com/world/for-kuwaits-new-emir-saudi-ties-are-seen-as-key"}