{"authors": [], "date_download": "2024-10-12 14:16:49", "date_modify": "2024-10-12 14:16:49", "date_publish": "2022-03-12 10:30:53", "description": "Measures announced by the EU, the United States and other G7 allies amount to a fourth set of sanctions against Russia.  Read more at straitstimes.com.", "filename": "world_us-european-allies-intensify-economic-pressure-on-russia_1728742609.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/12/aarussia1203.jpg?VersionId=r2lWpbOo8SGJS_.GgL6b0K7YjEvXC6_C", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_us-european-allies-intensify-economic-pressure-on-russia_1728742609.html", "title": "US, European allies intensify economic pressure on Russia", "title_page": "US, European allies intensify economic pressure on Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON/BRUSSELS (REUTERS) - The United States, European Union and other allies on Friday (March 11) escalated their economic pressure on Russia, moving to strip Moscow of privileged trade and economic treatment among other steps to punish it for its invasion of Ukraine.\nUS President Joe Biden said the new actions collectively will further hobble a Russian economy already weighed down by previously announced international sanctions that have cratered the rouble and forced the stock market to close.\nReferring to ending normal trade relations, Biden said: \"Doing it in unison with other nations that make up half of the global economy will be another crushing blow to the Russian economy that's already suffering very badly from our sanctions.\"\nThe measures announced by the EU, the United States and other G7 allies amount to a fourth set of sanctions against Russia over the Feb 24 invasion.\nThey include efforts seeking to end Moscow's \"most-favoured nation\" trade status, opening the door to banning or imposing punitive tariffs on Russian goods and putting Russia on a par with North Korea or Iran.\nThey will also ban luxury goods from being exported from their countries to Russia, designed as a blow to Russian elites.\nAs a first step, the EU will prohibit imports of iron and steel sector goods from Russia. European Commission President Ursula von der Leyen said the EU was also working to suspend Russia's membership rights of leading multilateral institutions, including the International Monetary Fund and the World Bank, and crack down on its use of crypto-assets.\nA US ban on luxury exports to Russia and its ally Belarus - including high-end watches, vehicles, clothes, alcohol and jewellery - takes effect immediately, the Commerce Department said.\nThe US Congress would need to pass legislation to revoke Russia's trade status, and lawmakers have been moving in that direction. The United States also moved to shut down development funds while announcing a ban on imports of Russian seafood, vodka and diamonds, too. The White House said Biden would ban US investment in Russia beyond the energy sector.\nTop US imports from Russia included mineral fuels, precious metal and stone, iron and steel, fertilisers and inorganic chemicals, all goods that could face higher tariffs once Congress acts to revoke Russia's favoured nation trade status.\nThe United States also imposed sanctions on more Russian oligarchs, leaders and elites, targeting members of the lower house of parliament and billionaire Viktor Vekselberg, among others. Those hit with the new sanctions include 10 people comprising VTB Bank's board, 12 members of the Duma and family members of Kremlin spokesman Dmitry Peskov, the US Treasury Department said.\nRussian forces invaded Ukraine last month in the biggest assault on a European state since World War Two. Russia calls the action a \"special operation\".\n\"Russia cannot grossly violate international law and expect to benefit from being part of the international economic order,\" the White House said in a statement.\nThe United States also imposed fresh North Korea-related sanctions, targeting Russian individuals and companies after US and South Korean officials said Pyongyang had used its largest intercontinental ballistic missile system in two recent launches.", "url": "https://www.straitstimes.com/world/us-european-allies-intensify-economic-pressure-on-russia"}