{"authors": [], "date_download": "2024-10-12 13:38:05", "date_modify": "2024-10-12 13:38:05", "date_publish": "2024-09-18 17:36:43", "description": "Norway measures \"very low\" levels of radioactive caesium at Svanhovd and Viksjoefjell near the Arctic border with Russia. Read more at straitstimes.com.", "filename": "world_russia-has-not-issued-any-alerts-on-elevated-radiation-in-atmosphere-kremlin-says_1728740285.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/19/2024-03-17T092438Z156908184MT1ANADL000W7OXF2RTRMADP3ANADOLUPIC.JPG?VersionId=BWHGhO0GOyu0z16oj94oNy6DP_sjtvSz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_russia-has-not-issued-any-alerts-on-elevated-radiation-in-atmosphere-kremlin-says_1728740285.html", "title": "Norway says elevated radiation levels near Arctic border due to Chernobyl forest fire", "title_page": "Norway says elevated radiation levels near Arctic border due to Chernobyl forest fire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "OSLO - Norway said on Sept 18 that elevated levels of radioactive caesium (Cs-137) it had detected near the Arctic border with Russia were likely due to a forest fire near Chernobyl in Ukraine, the site of the world's worst nuclear accident.\nThe Norwegian Radiation and Nuclear Safety Authority (DSA) said in a statement on Sept 17 that it had measured \"very low\" levels of radioactive caesium at Svanhovd and Viksjoefjell near the Arctic border with Russia.\nThe authority detected elevated levels of radioactive caesium at Svanhovd from Sept 9-16 and at Viksjoefjell from Sept 5-12, but the levels didn't pose a risk to humans or the environment, it added.\n\"DSA always finds caesium at all air filter stations in Norway, and this often comes from stirred-up dust from old fallout from the Chernobyl accident,\" it said in an update on Sept 18.\n\"This time it is most likely that the forest fire around Chernobyl is to blame.\"\nFinland's radiation and nuclear authority also said that slightly higher levels of caesium had been detected at all eight of its collection stations.\n\"The detected amounts are very small,\" it said.\nThe highest observed result now has been 11 microbecquerels per cubic meter while normal readings at the stations are less than one microbecquerel per cubic metre, it said, adding that such readings were still very small.\nIt said that the average radon concentration in Finnish homes was 90 becquerels per cubic metre - over a million times higher.\n\"So these are really minuscule amounts,\" it said.\nOn April 26, 1986, Reactor No. Four of the Soviet Union's Chernobyl nuclear power plant went out of control, leading to an explosion and fire that demolished the reactor building and released large amounts of radiation into the atmosphere.\nThe accident spread Iodine-131, Caesium-134 and Caesium-137 across parts of northern Ukraine, Belarus, Russia, northern and central Europe.\nOn Sept 9, Ukraine's State Emergencies Service (DSNS) said 399 firefighters were involved in putting out a fire on open territory in Kyiv region.\nThat statement said that experts had conducted an assessment and found that the levels of radiation were within the norm. The statement did not specify where the fire was, but a spokesperson for the DSNS later confirmed to Ukrainska Pravda, a Ukrainian media outlet, that the fire was in the Chernobyl exclusion zone.\n\"We have speculated that the emissions could possibly originate from forest fires in the Ukraine area, which might have lifted radioactivity into the air,\" Finland's nuclear authority said, adding that air currents had been coming from the direction of Chernobyl.\nWhen asked about the elevated radiation readings on Sept 18, the Kremlin said that Russian services had not issued any alerts on higher levels of radiation in the atmosphere.\n\"There were no warnings from our relevant services about an increased level of certain isotopes in the atmosphere, there were no warnings about threats to human health either,\" Kremlin spokesman Dmitry Peskov told reporters. REUTERS", "url": "https://www.straitstimes.com/world/russia-has-not-issued-any-alerts-on-elevated-radiation-in-atmosphere-kremlin-says"}