{"authors": [], "date_download": "2024-10-12 14:05:01", "date_modify": "2024-10-12 14:05:01", "date_publish": "2023-12-16 06:17:53", "description": "Drowning and heart disease were found to be contributing factors to his death. Read more at straitstimes.com.", "filename": "world_actor-matthew-perry-died-from-acute-effects-of-ketamine_1728741901.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/17/FILES-US-ENTERTAINMENT-TELEVISION-FRIENDS-PERRY-215926.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_actor-matthew-perry-died-from-acute-effects-of-ketamine_1728741901.html", "title": "Actor Matthew Perry died of accidental ketamine overdose: Medical examiner", "title_page": "Actor Matthew Perry died of accidental ketamine overdose: Medical examiner | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Friends actor Matthew Perry died from an accidental ketamine overdose, medical examiners said on Dec 15, concluding their investigation into the death of the beloved but troubled television star.\nThe American-Canadian actor, who played Chandler Bing on the hit TV sitcom from 1994 to 2004, died at the age of 54, having been found unconscious in a hot tub at his house in Los Angeles in October.\nHe had struggled for decades with addiction to drugs, including ketamine, and related serious health issues, but had reportedly been clean for 19 months prior to his passing.\n“Matthew Perry’s cause of death is determined to be from the acute effects of ketamine,” the Los Angeles County Medical Examiner’s office said in a statement. “Contributory factors in his death include drowning, coronary artery disease and buprenorphine effects. The manner of death is accident.”\nKetamine is illegally used as a recreational drug for its numbing and hallucinogenic effects. It can also be used by doctors as an anaesthetic, and researchers are exploring its use as a mental health treatment.\nPerry wrote in his memoirs of how he had relied on using ketamine daily at points during his battles with addiction. He said the drug eased his pain and helped with depression.\n“Has my name written all over it – they might as well have called it ‘Matty’,” he wrote of ketamine. “Taking K is like being hit in the head with a giant happy shovel. But the hangover was rough and outweighed the shovel.”\nHe attended multiple rehabilitation clinics to combat addiction to painkillers and alcohol. In 2018, he suffered a burst colon, related to drug usage, and underwent multiple operations.\nIn his memoir Friends, Lovers And The Big Terrible Thing, published in 2022, Perry described going through detox dozens of times. He dedicated the book to “all of the sufferers out there”, and wrote in the prologue: “I should be dead.”\n“I have mostly been sober since 2001,” he wrote, “save for about sixty or seventy little mishaps over the years.”\nThe examiner’s report does not specify how or when Perry had consumed the fatal dose of ketamine.\nBut it found that trace amounts were detected in his stomach, and that prescription medications and loose pills were present at his home.\nPerry was undergoing medical treatment involving ketamine, but his most recent known infusion was more than a week before his death, meaning that dose would no longer have been in his system.\nThe examiner’s report says the levels of ketamine in Perry’s blood were comparable with higher-range levels used as general anaesthetic in surgery, and would cause overstimulation of the heart and problems breathing.\nThis could have caused him to lapse into unconsciousness, with drowning then becoming a contributory cause of death.\nPerry’s coronary artery disease, and his use of buprenorphine to treat severe pain, would have made him more vulnerable to the effects of ketamine, the report finds.\nNo alcohol was detected in his system by the autopsy report. Nor were there any traces of other drugs such as cocaine, heroin or fentanyl.\n‘The six of us’\nPerry’s sudden passing in October drew shocked reactions from Hollywood A-listers, his co-stars and fans of Friends worldwide.\n“Oh boy, this one has cut deep,” said American actress Jennifer Aniston, who played Rachel on the show.\n“He was such a part of our DNA. We were always the six of us. This was a chosen family that forever changed the course of who we were and what our path was going to be,” she wrote on Instagram.", "url": "https://www.straitstimes.com/world/actor-matthew-perry-died-from-acute-effects-of-ketamine"}