{"authors": [], "date_download": "2024-10-12 13:35:50", "date_modify": "2024-10-12 13:35:50", "date_publish": "2023-10-12 06:50:00", "description": "Following Hamas' attack on southern Israel on Oct 7, Israel has a wary eye on the threat posed by Hezbollah to the north.  Read more at straitstimes.com.", "filename": "world_middle-east_why-hezbollah-is-a-wild-card-as-israel-takes-aim-at-hamas_1728740150.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/12/ISRAEL-LEBANON-PALESTINIAN-CONFLICT-131728.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_why-hezbollah-is-a-wild-card-as-israel-takes-aim-at-hamas_1728740150.html", "title": "Why Hezbollah is a wild card as Israel takes aim at Hamas", "title_page": "Why Hezbollah is a wild card as Israel takes aim at Hamas | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIRUT – The Lebanese militant group Hezbollah last fought a war with Israel in 2006.\nSince 2013, when it turned its attention to helping Syrian President Bashar al-Assad prevail against rebels, Israeli officials have warned that a day would come when Hezbollah’s fighters would again turn their focus to Israel – this time having gained significant combat experience and better weaponry.\nAs Israel’s military faces off against Hamas militants in the Gaza Strip, following their bloody invasion of southern Israel on Saturday, Israeli leadership has a wary eye on the threat posed by Hezbollah to the north.\n1. What is Hezbollah?\nShiite Muslims in Lebanon formed what would become Hezbollah – “party of God” – in 1982, in reaction to Israel’s occupation of the country’s south.\nThe movement was inspired by the 1979 Islamic Revolution in Shiite-majority Iran, and Hezbollah to some extent became a proxy force for Iran’s elite Revolutionary Guards.\nShiite Muslims and Sunni Muslims each comprise about 30 per cent of Lebanon’s population.\nIran provides Hezbollah with “most of its funding, training, weapons and explosives, as well as political, diplomatic, monetary, and organisational aid”, according to the US State Department, which says the group also gets funding from legal and illegal sources, including “smuggling contraband goods, passport falsification, narcotics trafficking, money laundering and credit card, immigration and bank fraud”.\nBecause it is separate from Lebanon’s military, Hezbollah can attack Israeli and US targets without provoking the reaction such a move by a state would precipitate.\n2. What US targets has Hezbollah attacked?\nThe group is thought to have been behind the 1983 suicide truck bombings of the US Embassy and US Marine barracks in Beirut, the 1984 attack on the US Embassy annex in Beirut and the 1985 hijacking of TWA flight 847.\n3. What is Hezbollah’s role inside Lebanon?\nHezbollah remains a powerful force in Lebanon. It operates a large network of social services for its followers and is politically active, losing a majority in the country’s Parliament just last year.\nHezbollah’s alliance with the Shiite Amal movement, headed by Parliament Speaker Nabih Berri, ensures that together they represent most of the country’s Shiite community.\nHezbollah also has close ties with the Christian party founded by former president Michel Aoun.\nBefore Syria’s civil war began in 2011, Hezbollah had promoted itself as a force dedicated to fighting Israel and defending the oppressed, regardless of their background.\nBut since becoming enmeshed in Syria’s war, it has been viewed by many Sunni Muslims as a Shiite group doing Iran’s bidding in the region.\n4. Why did Hezbollah get involved in Syria?\nSince Lebanon is not connected to Iran, Syria has served as a way for Hezbollah to receive military material from its patron. So it was important for Hezbollah to help President Assad, an ally, maintain his hold on power.\n5. Will Hezbollah join Hamas in fighting Israel?\nHezbollah has expressed solidarity with Hamas and has exchanged fire with Israel since the Saturday Hamas attack.\nAnalysts say it may opt to attack Israel more forcefully, especially if Israeli troops move into Gaza.\nIt is thought to have tens of thousands of missiles.\nIsraeli officials have warned that their country’s military would target all of Lebanon if Hezbollah were to enter the war. BLOOMBERG", "url": "https://www.straitstimes.com/world/middle-east/why-hezbollah-is-a-wild-card-as-israel-takes-aim-at-hamas"}