{"authors": [], "date_download": "2024-10-12 14:00:46", "date_modify": "2024-10-12 14:00:46", "date_publish": "2024-02-01 02:52:22", "description": "Belbek airfield was hit on the southwestern tip of Ukraine's Russia-occupied Crimea Peninsula. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-it-hits-airfield-in-russia-occupied-crimea_1728741646.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/01/crimeahit01.jpg.JPEG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-it-hits-airfield-in-russia-occupied-crimea_1728741646.html", "title": "Ukraine says it hits airfield in Russia-occupied Crimea", "title_page": "Ukraine says it hits airfield in Russia-occupied Crimea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - The Ukrainian military claimed on Jan 31 to have struck a military air base in Russian-occupied Crimea, while Moscow said it had thwarted the attack by shooting down missiles but some debris had hit a military installation.\nIn a post on Telegram, Ukraine’s Air Force commander Mykola Oleshchuk thanked the military for conducting the operation, hitting Belbek airfield on the southwestern tip of the Crimea Peninsula near Russia’s main naval base at Sevastopol.\n“Ukrainian aviators will definitely return to their home airfield,” he said, posting a video from social media of the purported strike.\nAccording to the Russian Defence Ministry, Moscow thwarted an attack on Crimea and shot down 20 Ukrainian missiles - 17 over the Black Sea and three more over the peninsula.\nThe ministry said fragments of Ukrainian missiles fell on the territory of a military unit in Lyubimovka, which is near the Belbek military air base. The incident caused no damage to “aviation equipment”, it said. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-says-it-hits-airfield-in-russia-occupied-crimea"}