{"authors": [], "date_download": "2024-10-12 14:04:53", "date_modify": "2024-10-12 14:04:53", "date_publish": "2022-03-04 18:42:46", "description": "MOSCOW (REUTERS) - Russia's communications watchdog has restricted access to several foreign news organisations'websites including the BBC and Deutsche Welle for spreading what it cast as false information, amid friction about reporting on Ukraine. Read more at straitstimes.com.", "filename": "world_russia-curbs-access-to-bbc-and-other-foreign-news-websites_1728741893.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/04/yq-bbc-04032022.jpg?VersionId=1Va3fvdNeEVHJKPn4ppMrSaRzDUf1Lyh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_russia-curbs-access-to-bbc-and-other-foreign-news-websites_1728741893.html", "title": "Russia curbs access to BBC and other foreign news websites", "title_page": "Russia curbs access to BBC and other foreign news websites | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW (REUTERS) - Russia's communications watchdog has restricted access to several foreign news organisations'websites including the BBC and Deutsche Welle for spreading what it cast as false information, amid friction about reporting on Ukraine.\nRussia has repeatedly complained that Western media organisations offer a partial - and often anti-Russian - view of the world while failing to hold their own leaders to account for devastating foreign wars such as Iraq and corruption.\nThe watchdog said on Friday (March 4) it had blocked the BBC, Voice of America, Radio Free Europe/Radio Liberty, Deutsche Welle and other media outlets, Interfax news agency reported.\nThe BBC said it would not be deterred.\n\"Access to accurate, independent information is a fundamental human right which should not be denied to the people of Russia, millions of whom rely on BBC News every week,\" it said.\n\"We will continue our efforts to make BBC News available in Russia, and across the rest of the world.\"\nSome users in Russia could not access the BBC's website on Friday.\nWestern leaders have for years raised concerns about the dominance of state media in Russia and say the freedoms won when the Soviet Union collapsed in 1991 have been rolled back by President Vladimir Putin.\nRussia's RIA news agency said access to the websites of BBC Russian service as well as Radio Liberty and the Meduza media outlet were being limited, citing the media watchdog's official register.\nAccording to an official notice received on March 3, the Russian communications watchdog said Radio Liberty's Russian service had spread \"obviously fake socially significant information about the alleged Russian attack on Ukrainian territory\".\n\"Such information is wrong,\" Radio Liberty cited the official notice as saying.\nDescribing the situation in Ukraine has become a sensitive issue in Moscow.", "url": "https://www.straitstimes.com/world/russia-curbs-access-to-bbc-and-other-foreign-news-websites"}