{"authors": [], "date_download": "2024-10-12 13:48:59", "date_modify": "2024-10-12 13:48:59", "date_publish": "2023-02-04 06:49:34", "description": "Using high-altitude balloons for spying and other military missions dates to the last century. Read more at straitstimes.com.", "filename": "world_united-states_high-altitude-spy-balloons-old-concept-new-applications_1728740939.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/04/rrspy0402_4.jpg?VersionId=J4Si5_lhwitcEt9FZvj2TvJ_kkoKskkA", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_high-altitude-spy-balloons-old-concept-new-applications_1728740939.html", "title": "High-altitude spy balloons: Old concept, new applications", "title_page": "High-altitude spy balloons: Old concept, new applications | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - US officials said on Thursday that a Chinese “surveillance balloon” has been flying over the United States for several days.\nUsing high-altitude balloons for spying and other military missions is a practice that dates to the middle of the last century. Here is what is known about how they operate and what they can be used for:\n• During World War II, the Japanese military tried to loft incendiary bombs into US territory using balloons designed to float in jet stream air currents. No military targets were damaged, but several civilians were killed when one of the balloons crashed in an Oregon forest.\n• Just after World War II, the US military started exploring the use of high-altitude spy balloons, which led to a large-scale series of missions called Project Genetrix. The project flew photographic balloons over Soviet bloc territory in the 1950s, according to government documents.\n• Such balloons typically operate at around 80,000 to 120,000 feet, well above where commercial air traffic flies – airliners almost never fly higher than 40,000 ft. The highest-performing fighter aircraft typically do not operate above 65,000 ft, although spy planes such as the U-2 have a service ceiling of 80,000 ft or more.\n• The advantages of balloons over satellites include the ability to scan wide swathes of territory from closer in, and to spend more time over a target area, according to a 2009 report to the US Air Force’s Air Command and Staff College.\n• Unlike satellites, which require space launchers that cost hundreds of millions of dollars, balloons can be launched cheaply.\n• The balloons are not directly steered, but can be roughly guided to a target area by changing altitude to catch different wind currents, according to a 2005 study for the air force’s Airpower Research Institute.\n• The US military has tracked other spy balloons in recent years, including before President Joe Biden’s administration, according to a senior US defence official. REUTERS", "url": "https://www.straitstimes.com/world/united-states/high-altitude-spy-balloons-old-concept-new-applications"}