{"authors": [], "date_download": "2024-10-12 14:07:35", "date_modify": "2024-10-12 14:07:35", "date_publish": "2022-08-31 21:20:42", "description": "A 14-strong IAEA team has arrived in the southern city of Zaporizhzhia. Read more at straitstimes.com.", "filename": "world_europe_iaea-aiming-to-prevent-a-nuclear-accident-at-russia-held-ukraine-plant-grossi_1728742055.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/01/UKRAINE-RUSSIA-CONFLICT-WAR-IAEA-UN-NUCLEAR-135803.jpg?VersionId=fcJDHPKgTKjR7169a.ZsTr7fVkIuHDs6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_iaea-aiming-to-prevent-a-nuclear-accident-at-russia-held-ukraine-plant-grossi_1728742055.html", "title": "IAEA wants ‘permanent presence’ at Russia-held nuclear plant", "title_page": "IAEA wants ‘permanent presence’ at Russia-held nuclear plant | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ZAPORIZHZHIA, Ukraine - UN inspectors said on Wednesday they would seek to establish a permanent presence at a Russian-held plant in southern Ukraine to avoid “a nuclear accident” at the facility on the front line of the fighting.\nThe 14-strong team from the International Atomic Energy Agency (IAEA) is expected to arrive at the Zaporizhzhia nuclear plant on Thursday which lies inside Russian-held territory.\n“My mission is.. to prevent a nuclear accident and preserve the largest nuclear power plant in Europe,” IAEA director-general Rafael Grossi told reporters after travelling from Kyiv to the city of Zaporizhzhia.\n“We are preparing for the real work which begins tomorrow,” he said. “We are going to try to establish a permanent presence for the agency.”\nFresh shelling struck the town next to Europe’s largest atomic facility on Wednesday, with the fate of the plant on the banks of the Dnipro River stoking global concern.\n“The Russian army is shelling Energodar,” local military official Evhen Yevtushenko said on Wednesday morning, of the town next to the plant which had a pre-war population of 50,000 people.\nBoth sides have repeatedly traded blame over attacks in the area.\nOne of the shells hit Energodar’s city council, Mayor Dmytro Orlov wrote on Telegram, posting pictures of the damaged building with a hole punched into the side.\n“The Russian occupying forces must stop shelling the corridors to be used by the IAEA mission and not obstruct its activities at the plant,” foreign ministry spokesman Oleg Nikolenko wrote on Facebook.\n‘Explicit safety guarantees’\nAlthough Zaporizhzhia is normally about a two-hour drive from the plant, it was not immediately clear how the IAEA team would reach the site which would involve crossing the front line to enter Russian-held areas.\nBut Grossi said his team had received “explicit” safety guarantees from both sides for their visit which would last “a few days”.\n“These are very complex operations,” he said.\n“We are going into a war zone, we’re going to occupied territory, and this requires explicit guarantees not only from the Russian Federation but also from the Republic of Ukraine and we have been able to secure that.”\nThe plant has been occupied by Russian troops since March and Ukraine has accused Russia of deploying hundreds of soldiers and storing ammunition there.\nKyiv has insisted the team access the plant via Ukrainian-held territory.\n“Sadly, Russia is not stopping its provocations precisely in the direction the mission needs to travel to reach the plant,” President Volodymyr Zelensky said late on Tuesday after meeting Grossi.\nThe situation was “extremely menacing”, he said, accusing the Russians of “continuing bombardments” and calling for “an immediate and total demilitarisation” of the Zaporizhzhia nuclear plant.\nIn Moscow, the Russian defence ministry accused Kyiv of “continued provocations aimed at disrupting the work of the IAEA mission” saying it had shelled the area around the plant on Tuesday hitting a building containing “the solid radioactive waste processing complex”.\nCounteroffensive in the south\nMeanwhile, intensive fighting raged across the nearby southern region of Kherson where Ukraine began a counteroffensive on Monday.\nMost of the region and its provincial capital of the same name were seized by Russian forces at the start of the invasion six months ago.\nWith the war in the eastern Donbas region largely stalled, analysts have said for weeks that combat is likely to shift south to break the stalemate before winter comes.\nIn its morning update, the president’s office in Kyiv said “fighting continued throughout the night” in Kherson, and that one person had been killed and two injured in an overnight bombing in the Mykolaiv area.\nBut the Russian defence ministry said Kyiv’s attempts to advance its counteroffensive had “failed” with Ukrainian forces suffering “significant losses and were driven back by Russian troops”.\nEU foreign ministers on Wednesday agreed to suspend a 2007 visa facilitation deal with Russia, which will make it “more difficult” and “longer” for Russian nationals to get visas, the EU’s foreign policy chief Josep Borrell said.\nHe said ministers had agreed that relations with Moscow “cannot be business as usual” and that the agreement should be “fully suspended”.\nAnd earlier in the day, Russian energy giant Gazprom suspended gas deliveries to Germany, citing maintenance issues in the latest of a series of supply stoppages that have fuelled an energy crisis in Europe.\nThe move comes as European countries have faced soaring energy prices since Russia invaded Ukraine in late February and subsequently curbed its gas deliveries to the region. AFP", "url": "https://www.straitstimes.com/world/europe/iaea-aiming-to-prevent-a-nuclear-accident-at-russia-held-ukraine-plant-grossi"}