{"authors": [], "date_download": "2024-10-12 14:08:17", "date_modify": "2024-10-12 14:08:17", "date_publish": "2023-10-06 07:05:31", "description": "A selection of news stories that happened overnight, Oct 6, 2023. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-oct-6-5_1728742097.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/06/LYNXMPEJ940LF-4_0.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-oct-6-5_1728742097.html", "title": "While You Were Sleeping: 5 stories you might have missed, Oct 6", "title_page": "While You Were Sleeping: 5 stories you might have missed, Oct 6 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Biden to build more US border wall using Trump-era funds\nPresident Joe Biden’s administration said on Thursday it will add sections to a border wall to stave off record migrant crossings from Mexico, carrying forward a signature policy of former president Donald Trump.\nTrump is the frontrunner for the Republican Party nomination to challenge Mr Biden, a Democrat, in the 2024 presidential race. Trump made building border barriers a central tenet of his first campaign for president with the rally chant, “Build That Wall.”\nOne of Mr Biden’s first actions after taking office in January 2021 was to issue a proclamation pledging that “no more American taxpayer dollars be diverted to construct a border wall” as well as a review of all resources that had already been committed.\nThe administration said Thursday’s action did not deviate from Mr Biden’s proclamation because money that was allocated during Trump’s term in 2019 had to be spent now.\nREAD MORE HERE\nRoger Ng to be returned to Malaysia in 1MDB case\nFormer Goldman Sachs banker Roger Ng, facing 10 years in prison after being convicted in New York of helping loot billions of dollars from Malaysia’s 1MDB sovereign wealth fund, will be returned to that country, where he faces related charges.\nChief US District Judge Margo Brodie in Brooklyn on Thursday ordered Ng’s surrender to the US Marshals Service by Friday so he could be turned over to Malaysian law enforcement, who would transport him to their country.\nNg would be required upon returning to the United States to begin his prison term, prosecutors said, in an earlier letter to Judge Brodie.\nREAD MORE HERE\nElon Musk’s Twitter takeover being probed by SEC\nBillionaire Elon Musk is under investigation by the US Securities and Exchange Commission over his US$44 billion (S$60 billion) takeover of social media giant Twitter, according to a Thursday court filing in which the agency sought to compel Mr Musk to testify.\nThe investigation concerns whether Mr Musk broke federal securities laws in 2022 when he bought stock in Twitter, which Mr Musk renamed X, as well as statements and SEC filings he made in relation to the deal.\nThe SEC said it subpoenaed Mr Musk in May 2023, requiring him to provide testimony at the SEC’s San Francisco office, and that Mr Musk had agreed to appear last month.\nREAD MORE HERE\nBrooklyn subway shooter gets life in prison\nThe man who set off smoke bombs on a crowded New York subway train before shooting 10 people in April 2022 was sentenced on Thursday to life in prison over one of the most violent attacks ever seen on the city’s transit system.\nFrank James, 64, was sentenced to 10 life terms plus 10 years by US District Court Judge William Kuntz, during a hearing in Brooklyn federal court.\nJames pleaded guilty in January to 10 counts of terrorism and weapons charges.\nREAD MORE HERE\nSlovenia’s nuclear plant shut down over leak\nSlovenia’s only nuclear power plant began a preventive shutdown on Thursday, because of a leak in the site’s containment building, the operator said in a statement.\n“An increased leak in the primary system within the containment building was detected,” officials at the Krsko plant, around 100km east of the capital Ljubljana, said in a statement sent to AFP.\nIt said the leak had no repercussions on employees or surrounding residents and the environment.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-oct-6-5"}