{"authors": ["Bhagyashree Garekar"], "date_download": "2024-10-12 13:37:26", "date_modify": "2024-10-12 13:37:26", "date_publish": "2024-05-02 09:01:51", "description": "Trust in the Republic will ensure there remains a place for it in any new configurations that emerge, he says. Read more at straitstimes.com.", "filename": "world_united-states_singapore-well-placed-to-weather-global-supply-chain-shake-up-trade-minister-gan-kim-yong_1728740246.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/02/IMG0664gky0205.jpg?VersionId=u4g07w08MLKd5cmzDcE6qfenoptfBdVE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_singapore-well-placed-to-weather-global-supply-chain-shake-up-trade-minister-gan-kim-yong_1728740246.html", "title": "Singapore well placed to weather global supply chain shake-up: Trade Minister Gan Kim Yong", "title_page": "Singapore well placed to weather global supply chain shake-up: Trade Minister Gan Kim Yong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – A shake-up of global supply chains is under way but trust in Singapore will ensure that there remains a place for the Republic in any new configurations that emerge, said Singapore’s Trade and Industry Minister Gan Kim Yong in a media interview.\n“Don’t get me wrong, there will be challenges ahead,” Mr Gan told Singapore’s media in an interview on May 1 at the end of his four-day official visit to Washington, where he participated in events commemorating 20 years of a landmark free trade agreement (FTA) with the United States.\n“The world is very different from when we started with the FTA 20 years ago. But trade will continue to be an important part of the global economy that will allow goods to be transferred and business to be done,” he said, smiting the doom scenario about trade that has gained traction today.\nNeither President Joe Biden nor his Republican rival Donald Trump has displayed much enthusiasm for trade ahead of the US’ Nov 5 presidential election.\n“It may not be the same as 20 years ago; a lot more attention is being paid today to national security, to supply chain resilience,” said Mr Gan, in a reference to the heightened geopolitical rivalries and protectionist policies that have hurt global trade prospects.\n“So, there will be a restructuring and repositioning of the trade and supply chain network. And in the process, there will be opportunities,” he said.\nSingapore, a global hub of trade, tourism, financial services, data flows and many other activities, will not suffer if it manages to leverage its reputation as a predictable and enabling environment for business, said Mr Gan.\n“As the hub, we want to be a key node in the supply chain. And if we are able to find a niche in it, then we can play to our strength in being the trusted partner in the supply chains,” he said.\n“We are discussing with the US, for example, how Singapore can participate in the supply chains of many of its industries,” he added, noting that about 6,000 American companies operate in Singapore.\n“(The companies) are very familiar with the Singapore environment, and they know that Singapore is a trusted partner. There will be opportunities for us to see, in this reorganisation of supply chains, whether Singapore will be able to find a place, play a part,” he said.\nLater in the day, Mr Gan elaborated on the changes transforming the global economic landscape during a dialogue at The Economic Club of Washington moderated by Ms Barbara Humpton, the president and chief executive of Siemens Corp.\nEstablished in 1986, the club helps build ties between the business community in the US capital and the diplomatic community. Currently chaired by Carlyle Group co-founder David Rubenstein, the club has hosted several eminent global leaders, including Prime Minister Lee Hsien Loong in 2017.\nAt the dialogue, Mr Gan noted the shift in attitudes from 2004 – when countries were working to reduce trade barriers – to today, when they are divided by geopolitical tension between the US and China, as well as wars and conflicts in Europe and the Middle East.\nHe cautioned that the current restructuring of the supply chain has to be done right. “In the end, if you don’t do it carefully, it will add cost to the global economic system,” the minister said.\nHe noted that priorities have also changed.\n“Increasingly, national security has been a key consideration; sometimes, it overwrites economic considerations,” he said, adding that the result is “a lot more export controls, import controls and restrictions on technology”.\nSingapore, a small country with an open economy, has to improvise, leveraging its key element of trust, said Mr Gan.\nThe US-Singapore FTA has proved to be a useful base for new initiatives launched in recent years, such as the Partnership for Growth and Innovation (PGI) and the bilateral Climate Partnership, he said.\nPGI is intended to secure inclusive growth through advancing cooperation in areas such as the digital economy and smart cities, advanced manufacturing and healthcare.\n“The FTA is a foundation on which Singapore is building more areas of collaboration,” Mr Gan said.\nThese new platforms open up two new areas of opportunities: sustainability and the digital economy.\nFor instance, green energy ventures could be fuelled at the inaugural IPEF (Indo-Pacific Economic Framework) Clean Economy Investor Forum to be held in Singapore on June 5 and 6, which will bring together investors, financial institutions and political leaders.\nBefore heading off to Canada for the next leg of his trip, Mr Gan had met senior officials of the Biden Cabinet, members of the US Congress and corporate chieftains over the previous three days.\n“Through these meetings and discussions, I can sense that the US is very keen to continue to do business with Singapore and explore different areas of collaboration,” he said.\nGiven the American leadership in artificial intelligence (AI), Singapore is keen to work with the US to get access to advanced chips and hardware, attract the best brains in AI and train workers to make them AI-capable.\n“These are the areas under discussion, and we are making good progress,” he said.", "url": "https://www.straitstimes.com/world/united-states/singapore-well-placed-to-weather-global-supply-chain-shake-up-trade-minister-gan-kim-yong"}