{"authors": [], "date_download": "2024-10-12 13:36:14", "date_modify": "2024-10-12 13:36:14", "date_publish": "2023-10-15 09:45:00", "description": "The Israeli military did not immediately respond to the claims made by Lebanon. Read more at straitstimes.com.", "filename": "world_middle-east_lebanon-army-blames-israel-for-journalists-killing-reuters-urges-israeli-probe_1728740174.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/15/LYNXMPEJ9D02Z-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_lebanon-army-blames-israel-for-journalists-killing-reuters-urges-israeli-probe_1728740174.html", "title": "Lebanon army blames Israel for journalist’s killing; Reuters urges Israeli probe", "title_page": "Lebanon army blames Israel for journalist’s killing; Reuters urges Israeli probe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIRUT - The Lebanese army said on Saturday that Israel had fired a missile that killed a Reuters journalist in southern Lebanon, with a Lebanese military source saying the country had conducted a technical on-the-ground assessment after the attack that supported its claim.\nIsrael’s military said it used tank and artillery fire in the area to prevent an infiltration from Lebanon around the time of Mr Issam Abdallah’s death. It said its actions followed Hezbollah fire along the Israel-Lebanon border, and that the incident was under review.\nThe Lebanese military source said the army had concluded the shell that killed Mr Abdallah was fired by Israel, based on observation by Lebanese army patrols in the area at the time of the incident. The source was not authorised to speak to the media and spoke to Reuters on condition of anonymity.\n“The Israeli enemy launched a missile which hit a civilian car belonging to a media group which led to the martyrdom of the videographer Issam Abdallah,” the Lebanese army high command said in a statement posted on its website.\nReuters, in a statement signed by president Paul Bascobert and editor-in-chief Alessandra Galloni, said: \"We call on the Israel Defense Forces to conduct a thorough, swift and transparent investigation. It is critically important for journalists to be able to report freely and safely.\"\nReuters video journalist Abdallah was killed while working with other journalists near the village of Alma al-Shaab, close to the Israeli border, where the Israeli military and Lebanese militia Hezbollah have been trading fire.\nResponding to a request for comment on Reuters’ call for an investigation, Israel’s military said Hezbollah had fired at a number of border locations, “including the firing of an anti-tank missile that hit the Israel security fence”.\nThe military said it suspected an infiltration into Israeli territory immediately after the anti-tank missile launch, and that troops used tank and artillery fire to prevent the infiltration.\n“A number of hours later, a report was received that during the incident, journalists were injured in the area. The incident is under review,” the military added.\nThe Israeli military did not immediately respond to the claims made by Lebanon.\nIsraeli army spokesman Lieutenant-Colonel Richard Hecht earlier told a regular briefing that it was looking into the incident, adding: “We already have visuals. We’re doing cross-examination. It’s a tragic thing.”\nA Reuters witness at the scene said Mr Abdallah, a Lebanese national, was struck by missiles fired from the direction of Israel.\nMr Nazeh and Mr Al-Sudani were both injured in the incident but were later released from hospital. Agence France-Presse and Al Jazeera each said two of their journalists were wounded in the incident.\nMr Nazeh said they were filming missile fire coming from the direction of Israel when one struck Mr Abdallah as he was sitting on a low stone wall near the rest of the group. Seconds later, another missile hit a car being used by the group, setting it aflame, he said.\nThe UN peacekeeping force in southern Lebanon said it could not say with certainty at this stage how the group of journalists was hit. However, it said it knew that Israel had struck a position 2.5km outside Alma al-Shaab at 5.20pm.\nThe Reuters statement said it had requested Israeli assurances that Reuters journalists and offices in the Gaza Strip would not be targeted in Israeli military operations there.\nIsraeli forces are massing tanks and troops on the border with the southern enclave in preparation for a possible ground invasion. They are fighting a war with Gaza’s Hamas militants who launched a deadly assault on Israeli civilians and soldiers a week ago. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/lebanon-army-blames-israel-for-journalists-killing-reuters-urges-israeli-probe"}