{"authors": [], "date_download": "2024-10-12 14:09:02", "date_modify": "2024-10-12 14:09:02", "date_publish": "2022-05-19 23:38:26", "description": "A potential in-person meeting could take place while Mr Biden is overseas next month. Read more at straitstimes.com.", "filename": "world_united-states_biden-saudi-crown-prince-may-meet-for-first-time-as-soon-as-next-month_1728742142.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/19/bidenmbs20.jpg?VersionId=ptDEZwSKvVRL2hV2xBkM4vSdTChUy5UN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-saudi-crown-prince-may-meet-for-first-time-as-soon-as-next-month_1728742142.html", "title": "Biden, Saudi crown prince may meet for first time as soon as next month", "title_page": "Biden, Saudi crown prince may meet for first time as soon as next month | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - US President Joe Biden and Saudi Arabian Crown Prince Mohammed bin Salman could meet for the first time as soon as next month, CNN reported on Thursday (May 19), citing multiple sources.\nBiden administration officials are in talks with the Saudis about arranging a potential in-person meeting while Mr Biden is overseas next month, the report added.\nThe White House and the Saudi government's media office did not immediately respond to requests for comment.\nUS-Saudi ties have been strained by Mr Biden's decisions last year to curtail US support for the Saudi-led military campaign in Yemen and to publish intelligence that the crown prince, who is the kingdom's de facto ruler, approved an operation to capture or kill journalist Jamal Khashoggi, who was murdered in Turkey in 2018.\nThe Saudi government has denied any involvement by the crown prince, who is known as MBS, in the murder of Mr Khashoggi.\nThe journalist, a US resident who wrote opinion columns for the Washington Post critical of the crown prince, was killed and dismembered by a team of operatives linked to the crown prince in the Saudi consulate in Istanbul.\nRelations between the United States and the world's largest oil exporter have also been frayed by Mr Biden's efforts to revive the 2015 Iran nuclear deal, which US allies in the Gulf argue does too little to prevent Teheran from getting an atomic bomb.\nWashington has also been trying, so far without success, to persuade Saudi Arabia to pump more oil beyond the small increase it has agreed within the Opec+ production group to offset potential losses in Russian supplies after Moscow was sanctioned by the West over its invasion of Ukraine.\nSaudi Arabia has refused to take sides in the Russia-Ukraine conflict.", "url": "https://www.straitstimes.com/world/united-states/biden-saudi-crown-prince-may-meet-for-first-time-as-soon-as-next-month"}