{"authors": [], "date_download": "2024-10-12 14:05:43", "date_modify": "2024-10-12 14:05:43", "date_publish": "2022-10-12 18:18:11", "description": "France has delivered Caesar howitzers, portable air defence systems and heavy armoured vehicles primarily. Read more at straitstimes.com.", "filename": "world_europe_ukraine-asks-france-to-prove-its-love-with-weapons_1728741943.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/12/hzfrance121022%20%281%29.jpg?VersionId=fP7NvaI9uq5m38gKL81KSnTpzcSWT1CN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-asks-france-to-prove-its-love-with-weapons_1728741943.html", "title": "Ukraine asks France to prove its love with weapons", "title_page": "Ukraine asks France to prove its love with weapons | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Romantic gestures take many forms... well on Wednesday Ukraine's defence ministry posted a video on social media aimed at giving France a gentle nudge to show its love through weapons' supplies after repeated criticism that Paris has not been doing enough.\nThe 41-second clip on Twitter comes hours after a French security cabinet meeting held by President Emmanuel Macron decided that France had taken new decisions to \"support Ukraine militarily\" after speaking to Ukrainian President Volodymyr Zelensky.\nFrance has delivered Caesar howitzers, portable air defence systems and heavy armoured vehicles primarily.\nHowever, a wave of attacks on Ukrainian cities has raised the stakes, with Kyiv demanding its partners provide more supplies, including air defence systems - something Paris has been unwilling to do so far.\nWednesday's clip made clear to France that it wanted more than just words and promises.\n\"Romantic gestures take many forms,\" images on the video read as the classic \"Je t'aime moi non plus\" (I love you ... me neither), the suggestive and once-censored song that Serge Gainsbourg recorded with then-lover Jane Birkin, played in the background.\nThe images intertwine lovers holding hands in Paris, chocolates, roses and Mr Macron smiling with Mr Zelensky. All with the French-made howitzer cannons in full action on the battlefield.\n\"But if you really want to win our hearts... nothing beats 155mm heavy self-propelled artillery ... Many thanks France.\nPlease send us more!\" France's defence ministry announced on Tuesday that it was boosting its support on Nato's eastern flak by sending more tanks to Romania, Rafale fighter jets to Lithuania and infantry to Estonia. It said nothing about Ukraine.\nMr Macron is due to be interviewed on national television on Wednesday evening, during which diplomatic sources have said he may outline details of his proposed new support.\nFrance does have the SAMP/T (Mamba) surface-to-air defence system, although quite how many it could provide is unclear. It deployed one such system to Romania in May.\n\"We have not had any answers from France to our requests on this,\" Mr Vadym Omelchenko, Ukraine's ambassador to France, told reporters on Monday. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-asks-france-to-prove-its-love-with-weapons"}