{"authors": [], "date_download": "2024-10-12 13:35:15", "date_modify": "2024-10-12 13:35:15", "date_publish": "2024-10-04 10:36:10", "description": "The US President said that such a war can be avoided, but more needed to be done to ensure that. Read more at straitstimes.com.", "filename": "world_middle-east_biden-says-he-does-not-believe-there-will-be-all-out-war-in-middle-east_1728740115.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/04/2024-10-03T230615Z1685182368RC2BDAAEGS28RTRMADP3STORM-HELENE-BIDEN.JPG?VersionId=a5A01X.Qich56ZwPxJElX8emtgE8HJWE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_biden-says-he-does-not-believe-there-will-be-all-out-war-in-middle-east_1728740115.html", "title": "Biden does not believe there will be ‘all-out war’ in the Middle East", "title_page": "Biden does not believe there will be ‘all-out war’ in the Middle East | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - US President Joe Biden said he did not believe there is going to be an “all-out war” in the Middle East, as Israel weighs options for retaliation after Tehran’s largest-ever assault on its arch-enemy.\nHowever, Mr Biden said more needed to be done to avoid a Middle East war, as Israel’s military hit Beirut with new air strikes in its battle against Lebanese armed group Hezbollah.\nAsked by reporters in Washington on Oct 3 how confident he was that such a war could be averted, Mr Biden said, “How confident are you it’s not going to rain? Look, I don’t believe there is going to be an all-out war. I think we can avoid it.\n“But there is a lot to do yet, a lot to do yet.”\nWhile the United States, the European Union, and other allies have called for an immediate 21-day ceasefire in the Israel-Lebanon conflict, Mr Biden said the US was discussing with Israel its options for responding to Tehran’s assault, which included Israel striking Iran’s oil facilities.\n“We’re discussing that,” Mr Biden told reporters.\nHis comments contributed to a surge in global oil prices, and rising Middle East tension has made traders worry about potential supply disruptions.\nHowever, Mr Biden added: “There is nothing going to happen today.”\nAsked later if he was urging Israel not to attack Iran’s oil installations, Mr Biden said he would not negotiate in public.\nOn Oct 2, the President said he would not support any Israeli strike on Iran’s nuclear sites.\nOn Oct 3, Israel’s ambassador to the United Nations, Mr Danny Danon, told CNN his country had “a lot of options” for retaliation and would show Tehran its strength “soon”.\nA US official said Washington did not believe Israel had decided yet how to respond to Iran.\nBeirut’s southern suburb of Dahiye, a stronghold of the Iran-backed Hezbollah, came under renewed strikes near midnight on Oct 3 after Israel ordered people to leave their homes in some areas, residents and security sources said.\nThe air raids targeted Hezbollah official Hashem Safieddine, rumoured successor to its assassinated leader Hassan Nasrallah, in an underground bunker, Axios reporter Barak Ravid said on X, citing three Israeli officials.\nMr Safieddine’s fate was not clear, he said.\nIsrael’s military declined comment.\nIsrael said Hezbollah launched about 230 rockets from Lebanon towards Israel on Oct 3.\nHezbollah said it targeted what it called Israel’s “Sakhnin base” for military industries in Haifa Bay on the Mediterranean coast of northern Israel with a salvo of rockets.\nLate on Oct 3, Hezbollah said it also targeted Israel’s “Nesher base” in Haifa with a salvo of Fadi 2 rockets.\nG-7 calls for restraint\nIsraeli Prime Minister Benjamin Netanyahu has vowed Iran will pay for Oct 1’s missile attack, and Washington said it would work with its longtime ally to ensure Iran faced “severe consequences.”\nIranian President Masoud Pezeshkian, speaking in Doha, said on Oct 3 that Tehran would be ready to respond.\n“Any type of military attack, terrorist act or crossing our red lines will be met with a decisive response by our armed forces,” he said.\nIsrael, which has been fighting Hamas in the Palestinian territory of Gaza for almost a year, sent troops into southern Lebanon on Oct 1 after two weeks of intense airstrikes in a worsening conflict that has drawn in Iran and risks involving the United States.\nThe Group of Seven nations, which includes the US, Britain and allies, on Oct 3 condemned Iran’s Oct 1 missile attack and reaffirmed their commitment to Israel’s security.\nBut the group also called for restraint, a ceasefire in Gaza and halt to hostilities in Lebanon.\n“A dangerous cycle of attacks and retaliation risks fuelling uncontrollable escalation in the Middle East, which is in no one’s interest,” it said in a statement.\nQatar’s emir, Sheikh Tamim bin Hamad Al-Thani, also urged serious ceasefire efforts to stop what he called Israel’s aggression.\nThe chairman of the US House of Representatives Foreign Affairs Committee urged the US President on Oct 3 to speed up weapons shipments to Israel, including 907kg bombs held up for months over human rights concerns.\nOne bomb can rip through thick concrete and metal, creating a wide blast radius.\nRepresentative Michael McCaul said in a letter sent to Mr Biden and seen by Reuters that such large bombs were operationally necessary as Hamas and Hezbollah were using deeply buried subterranean bunkers and tunnels.\nHezbollah says it killed 17 Israeli troops\nIsrael says its operations in Lebanon seek to allow tens of thousands of its citizens to return home after Hezbollah bombardments during the Gaza war forced them to evacuate from its north.\nMore than 1.2 million Lebanese have been displaced by Israeli attacks, and nearly 2,000 people have been killed since the start of the Israeli attacks on Lebanon over the last year, most of them in the past two weeks, the Lebanese authorities said.\nEarly on Oct 4, Lebanon’s Health Ministry said 27 people were killed and 151 wounded over the prior day.\nHezbollah says it has repelled several land operations by Israeli troops, with measures such as ambushes and direct clashes.\nThe group said it killed 17 Israeli military personnel in combat in southern Lebanon on Oct 3, citing its field and security sources. Israeli forces did not comment on the claim.\nAn Israeli strike killed at least 18 people on Oct 3 in the Tulkarm refugee camp in the occupied West Bank, the Palestinian Health Ministry said, and Israel said it killed a Hamas official in Tulkarm. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/biden-says-he-does-not-believe-there-will-be-all-out-war-in-middle-east"}