{"authors": [], "date_download": "2024-10-12 14:01:29", "date_modify": "2024-10-12 14:01:29", "date_publish": "2024-04-21 23:40:00", "description": "Gaza’s civil defence agency, which is exhuming the bodies, said the victims appear to have been tortured. Read more at straitstimes.com.", "filename": "world_middle-east_israel-vows-to-increase-military-pressure-on-hamas-in-coming-days_1728741689.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/22/2024-04-21T205412Z576377780RC2XA7AKBLOKRTRMADP3ISRAEL-PALESTINIANS.JPG?VersionId=UaUtTmpaw0np9X5_jS.iAZXa3fBLeeJc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israel-vows-to-increase-military-pressure-on-hamas-in-coming-days_1728741689.html", "title": "Bodies found in mass grave at Gaza hospital as Israel vows to ‘increase pressure’ on Hamas", "title_page": "Bodies found in mass grave at Gaza hospital as Israel vows to ‘increase pressure’ on Hamas | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM – Gaza’s civil defence said on April 21 that dozens of bodies were found buried at a hospital complex previously raided by Israel, as Prime Minister Benjamin Netanyahu vowed to ramp up military pressure on Hamas.\nMr Netanyahu, who threatened action “in the coming days” without elaborating, has repeatedly said Israel will launch a ground assault on Rafah, despite international concern for civilians who have taken refuge in the southern Gaza city.\nThe Prime Minister’s latest remarks came a day after US lawmakers approved US$13 billion (S$17.7 billion) in new military aid to close ally Israel, even as global criticism mounts over the dire humanitarian crisis in the besieged Gaza Strip.\nThe Palestinian militant group Hamas, whose Oct 7 attack triggered the Gaza war, called the US aid a “green light” for Israel to “continue the brutal aggression against our people”.\nGaza’s civil defence agency said its teams had discovered 50 bodies since April 20 buried in the courtyard of the Nasser Medical Complex in Gaza’s main southern city of Khan Younis.\n“We... are waiting for all graves to be exhumed in order to give a final number of martyrs,” said Mr Mahmud Bassal, spokesman for the civil defence agency.\n“There were no clothes on some bodies, which certainly indicates (the victims) faced torture and abuse,” he added.\nIsrael’s military said it was checking the reports.\nHamas said in a statement that the 50 bodies were exhumed from what it called a “mass grave” in the hospital’s courtyard.\nIsrael pulled its ground forces from Khan Younis on April 7 after carrying out what it called a “precise and limited operation” at the hospital, one of Gaza’s biggest.\nHospitals in Gaza have faced the brunt of the Israeli assault, with the military accusing Hamas of using them as command centres and to hold hostages abducted on Oct 7, claims denied by the militants.\nOn April 21, an AFP photographer saw civil defence crews exhuming human remains from the courtyard, while grieving relatives collected bodies wrapped in white.\nResident Umm Mohammed al-Harazeen went to the hospital area, hoping for news of her husband. He has been missing since Israeli forces entered Khan Younis, she said, “and we have been searching for him, but to no avail”.\n‘Woke up to a nightmare’\nMr Netanyahu, in a video statement on the eve of the Jewish holiday of Passover, said Israel “will deliver additional and painful blows” to Hamas.\n“In the coming days, we will increase the military and political pressure on Hamas because this is the only way to free our hostages,” he added.\nIsrael estimates that 129 captives remain in Gaza after the Oct 7 Hamas attack, including 34 who the military says are dead.\nThe army has said at least some of the hostages are held in Rafah, which has so far been spared an Israeli invasion and where most of Gaza’s 2.4 million people have sought shelter.\nIsraeli military spokesman Daniel Hagari said in a televised statement that “the chief of staff has approved the next steps for the war”, without offering details.\n“On Passover, it will be 200 days of captivity for the hostages... We will fight until you return home to us,” he said.\nLast week, the Group of Seven developed economies said they opposed a “full-scale military operation” in Rafah, fearing “catastrophic consequences” for civilians.\nIsraeli forces have already carried out regular air strikes on the city.\nThe civil defence agency said Israeli strikes hit two homes in Rafah overnight, killing at least 16 people, mostly children.\nResident Umm Hassan Kloub, 35, said her children screamed when they “woke up to a nightmare of an explosion”.\n“Every second we live in terror. Even the sound of Israeli aircraft doesn’t stop,” she said.\nHamas’ attack that triggered the war resulted in the deaths of 1,170 people, mostly civilians, according to an AFP tally based on Israeli official figures.\nIsrael’s retaliatory offensive has killed at least 34,097 people in Gaza, mostly women and children, according to the Hamas-run territory’s Health Ministry.\nUS boosts Israeli defences\nViolence has also flared in the Israeli-occupied West Bank, where a two-year surge in clashes has further escalated since the Gaza war broke out.\nThe Palestinian Red Crescent said on April 20 that at least 14 people were killed during a 40-hour Israeli raid on the Nur Shams refugee camp in the northern West Bank.\nOn April 21, two Palestinians were killed during an Israeli raid near Hebron, and another at a northern West Bank checkpoint, the Palestinian Health Ministry said. The military said all three had tried to attack troops.\nMeanwhile, Hamas’ military wing said its militants in southern Lebanon fired 20 rockets at a northern Israeli military base, the latest in cross-border exchanges of fire that have usually involved Hamas ally Hezbollah.\nThe Israeli army announced on April 21 the death of a soldier wounded in a Hezbollah strike on April 17 near the Lebanese border.\nMuch of the new military assistance approved by the US House of Representatives on April 20 was expected to be used to reinforce Israel’s air defences.\nIt comes after almost all of the hundreds of missiles and drones that Iran launched towards the country a week ago were intercepted, according to the Israeli military, with the help of Israel’s allies.\nIran’s first-ever direct attack on Israel was itself retaliation for a deadly April 1 strike on Tehran’s embassy consular annex in Damascus.\nIsrael’s response appeared to come on April 19 when explosions were reported in the central Iranian province of Isfahan, though fears of a wider war eased after Iran appeared to downplay the situation.\nIsraeli officials have made no public comment, while Iranian Foreign Minister Hossein Amir-Abdollahian said Tehran would not respond unless there was a further Israeli attack.\nOn April 21, Iran’s Supreme Leader Ayatollah Ali Khamenei praised the “success in recent events” of his country’s armed forces, in his first comments since the drone and missile attacks on Israel. AFP", "url": "https://www.straitstimes.com/world/middle-east/israel-vows-to-increase-military-pressure-on-hamas-in-coming-days"}