{"authors": [], "date_download": "2024-10-12 14:05:50", "date_modify": "2024-10-12 14:05:50", "date_publish": "2022-05-15 10:37:03", "description": "Sweden and Finland are now actively exploring ascension to the military alliance forged in the Cold War. Read more at straitstimes.com.", "filename": "world_europe_for-putin-a-nordic-nightmare-is-springing-to-life-with-nato-on-the-brink-of-expansion_1728741950.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/15/wgt-finlandnato-150522.jpg?VersionId=.1zWZyJ00n.4XHCbgvdWEKMTQL97dBqQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_for-putin-a-nordic-nightmare-is-springing-to-life-with-nato-on-the-brink-of-expansion_1728741950.html", "title": "For Putin, a Nordic nightmare is springing to life with Nato on the brink of expansion", "title_page": "For Putin, a Nordic nightmare is springing to life with Nato on the brink of expansion | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK (NYTIMES) - For years, President Vladimir Putin of Russia has viewed the expansion of Nato as an existential threat that would leave Russia hemmed in with Western missiles on its doorstep.\nNow, Moscow's invasion of Ukraine seems to be bringing the Russian leader's nightmare to life, with the North Atlantic Treaty Organisation on the brink of starting its largest potential expansion in nearly two decades.\nAfter navigating the postwar era in nonalignment and neutrality, Sweden and Finland are now actively exploring ascension to the military alliance forged in the Cold War, with officials from both countries set to meet with their Nato counterparts on Saturday.\nRussia lashed out immediately, halting exports of electricity to Finland and promising an unspecified \"military-technical\" response after warning that the move would pose a clear threat to its own national security.\nSome analysts were concerned that Russia was laying the groundwork to threaten the deployment of nuclear weapons near the border with Finland.\nBut officials in both Sweden and Finland played down that threat, noting that with the Russian enclave of Kaliningrad only 320km away, Moscow already has nuclear-capable missiles in easy range.\nAn acceptance of Sweden and Finland into Nato, a process that could take up to a year to finalise, would bring the Western military alliance right to Russia's 1,300km-long border with Finland and would mark another profound shift to Europe's strategic landscape brought on by Russia's war in Ukraine.\nAt the same time, the Pentagon is rotating new troops into Europe to bolster the alliance's eastern flank, signalling that the temporary troop buildup is likely to become permanent.\nAs Western powers buckled down for what Ukraine's defence minister called a \"new, long phase\" in the war, developments on the ground bore out the idea that Ukraine was still fighting Russia doggedly in the east and reporting that it was gaining ground.\nIn recent days, Ukrainian forces have begun consolidating control over the major city of Kharkiv after months of Russian attacks and heavy shelling. In a seeming replay of the Russian retreat from Kyiv, its battered battalions are withdrawing in order to protect critical supply lines to the east and to reinforce struggling units elsewhere in the Donbas in the country's east, Ukrainian officials said.\nThe head of Kharkiv's regional military administration said on Saturday that Ukrainian forces had started a counteroffensive against Russian forces around the northeastern city of Izium, which Russia captured last month and had hoped to use as a base for a drive south into other major cities.\nIn a flurry of US diplomacy, Republican Senator Mitch McConnell, the minority leader, made a surprise visit on Saturday to Ukraine to meet with President Volodymyr Zelensky. The accompanying delegation of US lawmakers was just the latest to travel to the country as the US deepens its commitment to Kyiv's fight against the Russian invasion.\nThe US Secretary of State Antony Blinken was scheduled to travel to Germany on Saturday, to meet with Nato counterparts before discussions with Sweden and Finland.\nIn a phone call on Saturday, President Sauli Niinisto of Finland said he told Mr Putin that his country is seeking to join Nato because Moscow's invasion of Ukraine had \"fundamentally\" altered Finland's security environment.\nMr Putin warned the Finnish leader it was a \"mistake\" to abandon Finland's long-standing policy of military neutrality, the Kremlin said in a statement.\n\"By joining Nato, Finland strengthens its own security and assumes its responsibility,\" the Finnish president said in a statement, adding that Finland wants \"to take care of the practical questions arising from being a neighbour of Russia in a correct and professional manner.\".\nThere was initial alarm as Turkey, a long-time Nato member, signalled this week that it might seek to block the Nordic countries' joining the alliance. But on Saturday, a spokesman for President Recep Tayyip Erdogan of Turkey walked back any potential challenge, saying that Turkey was merely trying to ensure that all alliance members' security concerns were heeded.\nThe potential growth of Nato added to a mounting list of setbacks for Mr Putin. Russia's military offensive in eastern Ukraine remains stalled, and The Institute for the Study of War, a Washington think-tank, said in its latest assessment that the Ukrainians had now won the battle for Kharkiv.\nHaving failed in its initial campaign to take the Ukrainian capital and oust the government, the Kremlin can ill afford to accept another defeat in the east.\nIn an interview with Britain's Sky News on Saturday, the country's military intelligence chief, Major General Kyrylo Budanov said the months ahead would be decisive.\n\"The breaking point will be in the second part of August,\" he said. \"Most of the active combat actions will have finished by the end of this year.\"\nBut as Moscow's forces around Kharkiv are driven back towards the Russian border, they are expected to fight hard to keep open critical supply routes running through the region. Russia also controls a wide swath of land across south-eastern Ukraine, where it is increasingly fortifying its position. The military campaign, analysts say, will continue to devolve into a protracted slog characterised by heavy casualties on both sides and devastating long-range bombardment.\nUkraine's Defence Minister, Mr Oleksii Reznikov, warned of \"extremely tough weeks\" ahead.\n\"No one can say for sure how many of them there will be,\" he said in a statement.\nMr Zelensky acknowledged that the fight to regain control of Russian-occupied territories would be long and hard, but he vowed that they would not be abandoned.\n\"The gradual liberation of the Kharkiv region proves that we will not leave anyone to the enemy,\" he said.\nThe impact of the battlefield clashes continue to ripple around the world.\nThe war has interrupted wheat production in Ukraine and Russia, both major suppliers, while fighting and blockades in the Black Sea have disrupted transport of the grain. And poor harvests in China, along with a heat wave in India and drought in other countries, have further snarled global supply.", "url": "https://www.straitstimes.com/world/europe/for-putin-a-nordic-nightmare-is-springing-to-life-with-nato-on-the-brink-of-expansion"}