{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:53:46", "date_modify": "2024-10-12 13:53:46", "date_publish": "2024-03-30 15:50:00", "description": "Muji Europe Holdings said the move is part of its “planned strategic restructuring” of its business. Read more at straitstimes.com.", "filename": "world_europe_muji-europe-to-go-into-administration-in-another-blow-to-uk-s-struggling-high-street_1728741226.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/30/11248400.jpg?VersionId=7u0eiVqYHWbn6iP5Eex4tkx0Pjr6I._V", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_muji-europe-to-go-into-administration-in-another-blow-to-uk-s-struggling-high-street_1728741226.html", "title": "Muji Europe to go into administration in another blow to UK’s struggling high street", "title_page": "Muji Europe to go into administration in another blow to UK’s struggling high street | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The European arm of Japanese clothing and homeware retailer Muji has announced that it will appoint administrators, in another troubling sign of Britain’s high-street decline.\nMuji Europe Holdings said the move is part of its “planned strategic restructuring” of its business, and that it expects to conclude a deal shortly.\nIn a statement to fashion platform FashionUnited, the retailer – which has six stores in London and one in Birmingham – said the day-to-day operations are unaffected.\n“For Muji’s colleagues and customers in Europe, it is business as usual – all stores and e-commerce will continue to operate as before, and all new and outstanding orders will be fulfilled.”\nIn Britain, Muji’s accounts are more than six months overdue, according to a filing to the Companies House, and in its most recent published accounts – from 2020 to August 2021 – it chalked up a £15 million (S$25.5 million) loss.\nLaunched in Japan in 1980, Muji is well known for its minimalist and functional designs across its range of products which includes beauty items, clothes, homeware, stationery and food.\nIts first international store was opened in London in 1991, and it now has over 550 stores in Europe, United States, Asia and the Middle East.\nMuji is the latest among high-street shops that are struggling to stay afloat.\nThe British arm of cosmetics and skincare brand The Body Shop collapsed into administration in February, and announced that it was closing half of its 198 stores in Britain.\nBritish fashion retailer Ted Baker also went into administration in March across Europe due to outstanding debt and a difficult retail environment.\nMajor British political parties have proposed solutions to revive the country’s high streets, which in the past epitomised the historic and economic vibrancy of the economy.\nThe ruling Conservatives in 2023 announced a £1.1 billion package to regenerate high streets and towns that have been “overlooked and taken for granted”.\nThe opposition Labour Party has a five-point plan to “reverse 13 years of decline and revitalise local high streets” and has pledged to crack down on “dodgy” candy stores – allegedly a hotbed of illegal and counterfeit goods – if it wins the next election.", "url": "https://www.straitstimes.com/world/europe/muji-europe-to-go-into-administration-in-another-blow-to-uk-s-struggling-high-street"}