{"authors": [], "date_download": "2024-10-12 14:02:04", "date_modify": "2024-10-12 14:02:04", "date_publish": "2023-05-19 23:40:00", "description": "Mr Biden told US allies that he would allow Ukrainian pilots to be trained on F-16 fighter jets. Read more at straitstimes.com.", "filename": "world_united-states_us-will-back-training-ukrainian-pilots-on-f-16s-biden-tells-g-7-leaders_1728741724.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/20/UKRAINEWARPLANES1_4.jpg?VersionId=PZvVpZXFtppu4m9ZBjWu2rD.6T8R_oCQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-will-back-training-ukrainian-pilots-on-f-16s-biden-tells-g-7-leaders_1728741724.html", "title": "In a sharp reversal, Biden opens a path for Ukraine to get fighter jets", "title_page": "In a sharp reversal, Biden opens a path for Ukraine to get fighter jets | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HIROSHIMA – President Joe Biden told United States allies on Friday that he would allow Ukrainian pilots to be trained on American-made F-16 fighter jets, several US officials said.\nThey added that the American President is also prepared to let other countries give F-16s to Ukraine – a major upgrade of the Ukrainian military and a sharp reversal.\nSince Russia launched its full-scale invasion of Ukraine 15 months ago, officials in Kyiv have pleaded for advanced warplanes to overcome Russian air superiority.\nBut Mr Biden has resisted, concerned that the jets could be used to hit targets deep inside Russia, and prompt the Kremlin to escalate the conflict.\nPentagon officials have said that other weapons, especially air defences, were needed more urgently.\nBut several European countries that belong to the Nato alliance and have F-16s in their arsenals have called for an international effort to provide the training and transfer of their jets to Ukraine.\nDoing so would require American permission, because the weapons were first sold to them by the US.\nMr Biden told other leaders of the Group of Seven (G-7) nations – the world’s wealthiest democracies – of his decision on pilot training at their summit meeting in Hiroshima, Japan, according to several officials who requested anonymity to speak candidly about sensitive deliberations. The decision opens a path to supplying Ukraine with the fighter jets.\nThe officials said the US and its allies would discuss in the coming months how to supply Kyiv with the jets, and one senior administration official said the White House was prepared to approve that step.\nThe US is not expected, at least under current plans, to send its own F-16s.\n“I welcome the historic decision of the United States... to support an international fighter jet coalition. This will greatly enhance our army in the sky,” Ukrainian President Volodymyr Zelensky, who is expected to address the G-7 this weekend, wrote on Twitter.", "url": "https://www.straitstimes.com/world/united-states/us-will-back-training-ukrainian-pilots-on-f-16s-biden-tells-g-7-leaders"}