{"authors": [], "date_download": "2024-10-12 13:33:58", "date_modify": "2024-10-12 13:33:58", "date_publish": "2024-10-01 23:30:00", "description": "He is the fifth senior member of the Adams administration to step down or announce plans to leave within the past month. Read more at straitstimes.com.", "filename": "world_united-states_new-york-mayor-eric-adams-loses-another-top-adviser_1728740038.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/01/NYADAMSLEGAL3.JPG?VersionId=svX_dILfBtg2gOS9vI4M.s6Q8kiVqq.I", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_new-york-mayor-eric-adams-loses-another-top-adviser_1728740038.html", "title": "New York Mayor Eric Adams loses another top adviser - close friend, controversial aide Pearson", "title_page": "New York Mayor Eric Adams loses another top adviser – close friend, controversial aide Pearson | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – New York City Mayor Eric Adams’ inner circle is getting even smaller.\nMr Tim Pearson, a controversial senior adviser to the first-term mayor, said late on Sept 30 that he would resign, becoming the fifth senior member of the administration to step down or announce plans to leave within the past month.\nMr Pearson’s announcement comes less than a week after Adams became the first sitting mayor of New York to be indicted since the modern city was incorporated in 1898.\nAnd it is less than a month after Mr Pearson and other senior City Hall aides had their phones seized or homes searched by US federal agents as part of multiple criminal investigations. He has not been accused of any wrongdoing.\nMr Pearson, whose vast portfolio included overseeing issues related to the more than 200,000 migrants who have arrived in the city in the past two years, said in a letter to Adams that he wanted to focus on “family, self-care and new endeavours”. His resignation takes effect on Oct 4.\n“During my tenure, I played a critical role in ensuring quality assurance for migrant services and security issues, with particular oversight of shelter sites and migrant contracts, with a focus on keeping costs down for the City,” Mr Pearson said in the letter.\nIn a statement, Adams cited Mr Pearson’s “long career in both the public and private sectors, where he has spent over 30 years keeping New Yorkers safe”. He added: “We appreciate Tim’s decades of service to this city and wish him well.”\nMr Pearson, who has a close friendship with Adams, has been a controversial member of the administration since the day he started in 2022.\nWhen he was appointed, he was also working for Resorts World casino in Queens, The New York Times reported. That arrangement was a potential conflict of interest as casinos began bidding for licences to build full-scale gaming facilities in New York City and its suburbs. Mr Pearson ultimately resigned from the casino company.\nMr Pearson has also been the subject of four sexual harassment lawsuits filed by former subordinates, whose claims he has denied. BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/new-york-mayor-eric-adams-loses-another-top-adviser"}