{"authors": [], "date_download": "2024-10-12 14:06:22", "date_modify": "2024-10-12 14:06:22", "date_publish": "2022-10-11 00:12:10", "description": "Any transport away from Ukraine's eastern frontline will serve, for some, as a lifeline to the most basic necessities. Read more at straitstimes.com.", "filename": "world_europe_defiant-ukraine-reopens-eastern-rail-link-despite-missiles_1728741982.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/11/btizyum20221010.jpg?VersionId=9aqeMlEe5IQif4twaukgwSrFMQCfdTH_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_defiant-ukraine-reopens-eastern-rail-link-despite-missiles_1728741982.html", "title": "Defiant Ukraine reopens eastern rail link despite missiles", "title_page": "Defiant Ukraine reopens eastern rail link despite missiles | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "IZYUM, Ukraine - As Russia launched a huge wave of missile strikes against Ukrainian cities on Monday, defiant rail workers in the east of the country managed to restore a severed rail link.\nAngered by a truck bombing that damaged a bridge carrying Russia's main road and rail link to the occupied Ukrainian region of Crimea, Moscow has stepped up strikes on civilian targets.\nBut, despite the savage bombardment, the passenger rail service between recently-occupied Izyum and Ukraine's second-largest city of Kharkiv restarted after Russia's Feb 24 invasion forced a seven-month closure.\n\"The trains will be running twice a day, every day,\" said Izyum railway manager Andrei Gadyatskiy, standing in the rain in front of the boarded up windows of his partially burned station.\nAny transport away from Ukraine's eastern frontline will serve, for some, as a lifeline to the most basic necessities.\n\"It will allow them to go to Kharkiv, to use their bank cards,\" Mr Gadyatskiy said.\nMs Raisa Starovoytova came to the station on Monday because she could barely believe rumours that the train had returned.\n\"I came to find out about the train because I will need to get back to Kharkiv,\" she told AFP, relieved to confirm that she would be able to leave later in the week.\nThe 65-year-old retired teacher had returned to Izyum after the Russian retreat, to see what had happened to her home.\n\"They took everything they could... mattresses, bedding... I came to take the bedding at least, but it wasn't there,\" she said.\nFormer airport shuttle\nThere is no electricity to power the electric locomotives that once served the eastern network, and Russian missile attacks still regularly hit the marshalling yards in Kharkiv.\nBut a Ukrainian DPKr-3 diesel that once shuttled air travellers between the capital Kyiv and Boryspil international airport has been pressed into service, 600 kilometres east of its home.\nIn the early stages of the war, Izyum came under intense Russian shelling and the invading army occupied the city from early April until its liberation last month by Ukrainian forces.\nAfter the Russian retreat, the discovery of a mass burial site and the corpses of torture victims made Izyum a byword for the alleged atrocities committed under Russian occupation.\nNow the town once again has a link to the regional capital, Kharkiv, by the rail line, along with stops in former frontline towns like Savyntsi, Tsyganska and Balakliya along the way.\nMs Mariya Tymofiyenko had not been to Balakliya since the start of the war.\n\"I'm 73 years old and I still have to ride a bicycle because the buses are not running. It's too far to walk,\" she told AFP on board the train as it wound its way through low wooded hills under leaden grey skies.\nShe hopes that Balakliya, where she has relatives, will prove a respite from the ruined town left behind by the Russian occupation of Izyum.\n'Tortured, beaten'\n\"I have no hope. If it's like Izyum, I don't know - here they broke into my flat, my garage. They stole everything. They ate all my preserves. They took all the tools,\" she told AFP, blinking back tears.\n\"So many people died under the rubble. Apartments were destroyed, the schools. It was terrifying,\" she said, wrapped up well against the first damp, chilly days of autumn.\n\"So many people were tortured, taken away, beaten. One man, my neighbour from one street over, was hanged,\" she continued.\n\"Yesterday, my granddaughter called me and said, 'Grandma, I checked on the internet and the train to Balakliya will start again tomorrow.' And I said, 'OK, OK I will take it.'\" AFP", "url": "https://www.straitstimes.com/world/europe/defiant-ukraine-reopens-eastern-rail-link-despite-missiles"}