{"authors": [], "date_download": "2024-10-12 13:37:03", "date_modify": "2024-10-12 13:37:03", "date_publish": "2024-09-10 21:07:37", "description": "Russia will likely use the weapons in Ukraine within weeks, the US Secretary of State says in London. Read more at straitstimes.com.", "filename": "world_europe_blinken-says-russia-received-missiles-from-iran-warns-of-threat-to-european-security_1728740223.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/2024-09-10T123551Z207769536RC2NX9AJ5RPFRTRMADP3USA-BLINKEN-BRITAIN.JPG?VersionId=sycYBxgLZzlTW6yoF7wuO1BCd9zPemBF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_blinken-says-russia-received-missiles-from-iran-warns-of-threat-to-european-security_1728740223.html", "title": "US says Russia received missiles from Iran, piles on sanctions", "title_page": "US says Russia received missiles from Iran, piles on sanctions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Russia has received ballistic missiles from Iran for its war in Ukraine, the United States said on Sept 10, as it imposed fresh sanctions on ships and companies it said were involved in supplying Moscow with Iranian weapons.\nAt a news conference in London ahead of a visit to Kyiv that he and Britain’s Foreign Secretary David Lammy will make, Secretary of State Antony Blinken said Washington had privately warned Iran that providing ballistic missiles to Russia would be “a dramatic escalation.”\n“Russia has now received shipments with these ballistic missiles, and will likely use them within weeks in Ukraine, against Ukraine,” Mr Blinken said, citing intelligence that he said has been shared with US allies and partners around the world.\nThe US later identified nine Russian-flagged vessels it said were involved in the delivery of weapons from Iran to Russia, designating them as “blocked property” under Washington’s sanctions regime, according to the Treasury Department’s website.\nIt also imposed additional measures on previously sanctioned airline Iran Air, as well as companies and individuals involved in the two countries’ military cooperation, the department said in a statement.\nMr Blinken said Iran has trained dozens of Russian military personnel to use its Fath-360 close-range ballistic missile system, which has a maximum range of 120km.\nRussian defence ministry representatives are believed to have signed a contract in December with Iranian officials for the Fath-360 and another Iranian ballistic missile system, Reuters reported in August.\nIran has previously supplied Shahed drones used by Russia in Ukraine, but has denied that it is supplying Russia with ballistic missiles.\nForeign Ministry spokesperson Nasser Kanaani on Sept 10 said on X that Iran views the reports as “ugly propaganda” to conceal Western military support to Israel.\nKremlin spokesman Dmitry Peskov on Sept 9 declined to confirm the reports but told reporters Russia was cooperating with Iran including on “the most sensitive” areas.\nAfter two and a half years of war, Ukrainian forces now find themselves stretched, fending off a steady Russian advance in Ukraine’s east. In August, Kyiv sent troops into Russia on their first large-scale cross-border incursion.\nThe Iranian missiles can be used on closer targets, allowing Russia to use more of its own arsenal for targets that are further from the front line, Mr Blinken said.\nRussia, which previously signed up to United Nations restrictions on Iran, was also sharing technology sought by Tehran, he added.\n“This is a two-way street, including on nuclear issues as well as some space information,” Mr Blinken said.\nCaspian voyages\nThe Treasury and the State Department imposed sanctions on 10 individuals and nine entities based in Iran and Russia, the Treasury said.\nThe sanctions freeze any US assets held by those targeted, denying them access, and generally bars Americans from dealing with them.\nIncluded in the Sept 10 sanctions were ships that regularly bring cargo across the Caspian Sea between Iran and Russia, including the Port Olya-3, a vessel owned by Russia-based company MG-FLOT that was used to transport close-range ballistic missiles, the Treasury said.\nThe vessel made a series of voyages between the Russian Caspian port of Olya and Iran’s Amirabad port between May and August 2024, according to ship tracking data.\nThe State Department also said Iran Air was further targeted because it was used to procure sensitive Western-origin goods and transport materials for Iran’s drone programme.\nFrance, Germany and Britain said they were cancelling air services agreements with Iran and pledged to impose sanctions on Iran Air and those involved in Iran’s ballistic missile programme and providing arms to Russia.\nBritain announced seven new sanctions designations under its Iran sanctions regime and three under its Russia regime.\nThe European Union also vowed a “strong response.”\nMr David Albright, head of the Institute for Science and International Security research group, said he doubted the new sanctions would have any impact on halting Iran’s cooperation with Russia because Tehran sees stronger ties with Moscow - and Beijing - in its best economic and political interests.\n“They will have some impact on shipping companies and vessels, but others can move in,” said Mr Albright, a former UN nuclear inspector.\nBlinken visit\nUkraine, which said it could cut diplomatic ties with Tehran if Russia uses Iranian-supplied missiles, welcomed the sanctions but said they were not sufficient.\nPresidential chief of staff Andriy Yermak reiterated that Kyiv was seeking Washington’s permission to use US-supplied weapons deeper inside Russia.\nThe Pentagon has said that Ukraine can use US weapons to return fire coming from Russia, a policy that in theory could allow Ukrainian forces to strike Iranian missiles being prepared for launch.\nMr Blinken said he would use his visit to Ukraine on Sept 11 to hear directly from Ukraine’s leadership what their current needs and objectives are and what the US can do to help.\nMr Blinken and Mr Lammy will visit together in a bid to show united Western support for Kyiv.\nMr Blinken will also visit Poland on Sept 12, the State Department said. REUTERS", "url": "https://www.straitstimes.com/world/europe/blinken-says-russia-received-missiles-from-iran-warns-of-threat-to-european-security"}