{"authors": [], "date_download": "2024-10-12 13:45:56", "date_modify": "2024-10-12 13:45:56", "date_publish": "2024-09-25 09:25:00", "description": "His planned incentives are for foreign firms that relocated manufacturing to the US and hired American workers. Read more at straitstimes.com.", "filename": "world_united-states_trump-pledges-to-take-jobs-and-factories-from-allies-china_1728740756.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/25/LYNXMPEK8O00Q-1_0.jpg?VersionId=gyWFC3ZAQQRKLQxlau9nTzIgTHfTrjQJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_trump-pledges-to-take-jobs-and-factories-from-allies-china_1728740756.html", "title": "Trump pledges to take jobs, factories from allies and China", "title_page": "Trump pledges to take jobs, factories from allies and China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Donald Trump said on Sept 24 that he would seek to “take” manufacturing jobs from foreign countries, including US allies, if he wins the Nov 5 election, by offering incentives to encourage companies to relocate to the United States.\nTrump promised a “manufacturing renaissance” as the centerpiece of his economic plan and said he would offer foreign companies low taxes and little regulation to entice them.\n“We will take other countries’ jobs,” Trump said during a speech to supporters in Savannah, Georgia, which has one of the largest ports in the US and is a car manufacturing hub. “We’re going to take their factories.”\nThe Republican presidential candidate said a vote for him would result in a “mass exodus” of manufacturing companies from US allies South Korea and Germany, as well as economic rival China.\nTrump’s speech, his second major address on the economy this month, comes as he and Vice-President Kamala Harris, his Democratic opponent, vie to convince voters in battleground states like Georgia that they will be the best stewards of the US economy.\nThe high cost of living and jobs are the top issues for Americans, according to opinion polls. Ms Harris has blunted Trump’s advantage on economic issues, based on a Reuters/Ipsos poll published on Sept 24.\nAsked which candidate had the better approach to the “economy, unemployment and jobs”, some 43 per cent of voters picked Trump and 41 per cent selected Ms Harris. Trump held an 11-point lead over Ms Harris on the economy in late July.\nMs Harris is set to make a major economic speech in the battleground state of Pennsylvania on Sept 25. Some of her proposals will also be broadly aimed at helping Americans build and maintain wealth, Reuters reported.\n‘Substantial tariff’\nTrump said during his speech that his planned incentives would be offered only to foreign companies that relocated manufacturing to the US and hired American workers.\n“I want German car companies to become American car companies. I want them to build their plants here,” Trump said.\nCompanies that did not make their goods in the US, however, would face “a very substantial tariff” when sending their products into the US, he added.\nOn Sept 23, Trump said he would slap a 200 per cent tariff on John Deere’s imports into the US if the agricultural equipment company moved production to Mexico as planned.\nPreserving and creating American manufacturing jobs by imposing expansive tariffs on friends and foes alike has become a central theme of Trump’s economic message.\nWhile Trump and his allies say trade barriers are necessary to protect US industry, many economists say his proposals would boost inflation.\nTrump stated he would reward US-based manufacturers with tax breaks for research and development costs and the ability to write off the costs of heavy machinery in the first year.\nHe repeated his promise to slash the corporate tax rate from 21 per cent to 15 per cent for companies that make their products in the US.\nTrump also pledged to appoint a global manufacturing ambassador to convince foreign companies to move to the US. He also said he would create special low tax, low regulatory zones on federal lands for American-based manufacturers.\nIt is unclear what federal lands would be offered to foreign companies under Trump’s plan, or how such an arrangement would work. If land remains in federal hands while foreign companies operate on it, those companies could in theory be exempt from property tax.\nTrump has been announcing new economic policies in recent months that his team believes are attractive to working and middle-class voters, including ending the federal taxation of tips and overtime.\nMany economists warn that ending such taxes will lower government revenues and explode the federal deficit. REUTERS", "url": "https://www.straitstimes.com/world/united-states/trump-pledges-to-take-jobs-and-factories-from-allies-china"}