{"authors": ["Cheryl Tan"], "date_download": "2024-10-12 13:50:46", "date_modify": "2024-10-12 13:50:46", "date_publish": "2022-11-20 20:01:00", "description": "Climate finance refers to funds that go towards steps to cut greenhouse gas emissions, among other things. Read more at straitstimes.com.", "filename": "world_middle-east_expanding-singapore-s-climate-finance-contributions-to-be-negotiated-grace-fu_1728741046.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/21/IMG8646.jpg?VersionId=ORQKqASLtEhGct9Wz2FdU3P2Ushtjk.m", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_expanding-singapore-s-climate-finance-contributions-to-be-negotiated-grace-fu_1728741046.html", "title": "Expanding Singapore’s climate finance contributions to be negotiated: Grace Fu", "title_page": "Expanding Singapore’s climate finance contributions to be negotiated: Grace Fu | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHARM EL-SHEIKH, Egypt - The possibility of Singapore contributing to a donor base for climate finance is still to be negotiated, though the Republic has played a role in helping countries to decarbonise through building capacity and facilitating carbon markets, said Minister for Sustainability and the Environment Grace Fu on Sunday.\nClimate finance refers to funds that go towards efforts to cut greenhouse gas emissions or to help nations adapt to climate impacts and green their economies. This can come from public or private institutions.\nAt the COP27 climate conference, developed countries have been calling for an increasing donor base for climate finance, specifically looking at high-income countries that are still classified as developing countries, such as Singapore, South Korea and Qatar.\nA report by the Overseas Development Institute released in 2022 identified countries that have high per capita income and high cumulative emissions, which make them increasingly qualified to pay for climate finance. This puts countries including Singapore and Qatar on the radar.\nMs Fu told reporters at a COP27 update on Sunday the 2015 Paris Agreement states that all countries have a common responsibility to address climate change, but their responsibility differs according to their emissions, financial position and historical contributions to global warming.\nShe noted that Singapore already provides financial support via the South-east Asia Disaster Risk Insurance Facility for Asean member states in climate and disaster risk financing.\nAnother way for Singapore to contribute would be to buy carbon credits from countries with renewable resources and which have the potential to facilitate such a trade.\nAbout 5 per cent of the sale of carbon credits – as stipulated in the Paris Agreement – will go towards adaptation funding, she noted.\n“So, in a way, we are contributing already, but whether it’ll be as an Annex 1 (developed) country, we have to consider in the greater context what it means for our status (as a developing country),” she added.\nMs Fu also gave an update on discussions on Article 6 of the Paris Agreement on carbon markets, which she is co-facilitating with her counterpart, Norway’s Climate and Environment Minister Espen Barth Eide.\nWhile Article 6 negotiations have come to a close, and will provide more clarity to countries that want to participate in carbon markets, a few sticking points remain, such as the issue of confidentiality.\nUnder the Article 6 text agreed at COP27, countries are allowed to keep confidential the information submitted for reporting to the United Nations, though this will be subject to third-party review.\nObservers and experts fear this could undermine the integrity and transparency of carbon markets.", "url": "https://www.straitstimes.com/world/middle-east/expanding-singapore-s-climate-finance-contributions-to-be-negotiated-grace-fu"}