{"authors": [], "date_download": "2024-10-12 13:48:36", "date_modify": "2024-10-12 13:48:36", "date_publish": "2023-12-05 15:33:00", "description": "Sore point is EU tax that sets price on imported goods based on emissions involved in creating them. Read more at straitstimes.com.", "filename": "world_middle-east_unintended-consequences-friction-at-cop28-over-green-trade_1728740916.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/05/file7t4dwvlz082hlks03do.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_unintended-consequences-friction-at-cop28-over-green-trade_1728740916.html", "title": "‘Unintended consequences’: Friction at COP28 over green trade", "title_page": "‘Unintended consequences’: Friction at COP28 over green trade | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI – Inside the negotiating rooms and on the sidelines of the COP28 climate talks, simmering tensions over wealthy countries’ “green trade” policies have been bubbling to the surface, with developing nations fearful they will be penalised.\nA particularly sore point has been the European Union’s new carbon border tax, which sets a price on imported goods based on the emissions involved in creating them.\nWhile the EU considers the tax necessary to ensure everything entering the bloc meets its climate goals, powerful emerging economies at COP28 have labelled such policies as protectionist, saying they disadvantage poorer trading partners.\nConcerns have also been raised that climate policies of this kind may – even though they cut emissions from one country – make it harder for another nation to sell its goods or access clean energy technology.\n“Trade regulations can have unintended consequences, and we should be a little thoughtful about that,” World Bank president Ajay Banga told a side event packed with prime ministers, business executives, trade bosses and diplomats at the talks in Dubai.\nNations are divided over where best to handle a rising number of climate-related trade disputes, a matter that has never been discussed at COP gatherings.\nThe World Trade Organisation (WTO) has received about 18,000 complaints over green policies, yet trade was still often overlooked by climate policymakers, WTO director-general Ngozi Okonjo-Iweala said.\nBrazil, China, India and South Africa applied to have “concerns with unilateral and coercive climate change-related measures” added to the COP28 agenda, but their call was not taken up.\nHowever, the subject still forced its way into discussions at the 2023 talks, which on Dec 4 hosted the first-ever “trade day” held at the climate negotiations.\nThe friction over green trade has spotlighted what experts say could evolve into a major sticking point in future climate negotiations if left unchecked.\n“This is becoming a very heated issue,” Mr Alden Meyer of the think-tank E3G said after a panel discussion on the subject in Dubai.\n‘Don’t discriminate’\nComplaints over “protectionist” climate policies have accompanied calls for the nearly 200 nations at COP28 to reconsider trade rules as they relate to the global race to decarbonise economies and meet emissions targets.\nObservers say the impact of the EU’s carbon border tax on poorer countries, particularly in Africa, has been a particular focus.\nChina has been vocally critical of the scheme and in Dubai called for globally agreed trade standards to be set.\n“For products that meet these standards, we must allow them to go into the market, and to be traded freely, and not set any barriers,” China’s climate envoy Xie Zhenhua told the same high-profile event attended by Mr Banga and other policy heavyweights this week.\nSome developing nations want this regulatory rift addressed at COP conferences because they pertain to domestic climate policies.\nWealthy nations, meanwhile, believe the United Nations climate talks are inappropriate for such deliberations and the WTO is more suitable.\nLeft unchecked, this friction risks “percolating and bubbling over in different settings”, said Mr Trevor Sutton, research director of the Yale Centre for Environmental Law and Policy.\n‘Not a trade-off’\nObservers said the perception that wealthy countries were protecting their own industries at the expense of everyone else risked eroding trust – a critical ingredient at COPs, where decisions are made by consensus.\n“If there is a trust deficit, many of the countries just think this is for protectionist measures... an obstacle for their development,” UN trade chief Rebeca Grynspan told an audience in a palatial theatre in the sprawling COP28 venue on Monday.", "url": "https://www.straitstimes.com/world/middle-east/unintended-consequences-friction-at-cop28-over-green-trade"}