{"authors": [], "date_download": "2024-10-12 14:07:49", "date_modify": "2024-10-12 14:07:49", "date_publish": "2022-09-07 15:01:18", "description": "Russian Foreign Minister Sergei Lavrov said report contains a number of issues. Read more at straitstimes.com.", "filename": "world_europe_moscow-wants-clarifications-on-uns-ukraine-nuclear-plant-report_1728742069.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/07/AK_np_070922.jpg?VersionId=EzvI1G_HiU8VgiH6Mos15U6yY5CcRa0K", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_moscow-wants-clarifications-on-uns-ukraine-nuclear-plant-report_1728742069.html", "title": "Moscow wants 'clarifications' on UN's Ukraine nuclear plant report", "title_page": "Moscow wants 'clarifications' on UN's Ukraine nuclear plant report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russia has requested \"clarifications\" from the United Nations (UN) nuclear watchdog over its report on the Zaporizhzhia nuclear power plant in Ukraine, Foreign Minister Sergei Lavrov said on Wednesday.\nIn a report released on Tuesday, the International Atomic Energy Agency (IAEA) called for a demilitarised zone to be set up outside the plant, which has come under shelling in recent weeks.\nMoscow and Kyiv have blamed each other for the attacks on the plant, which have raised fears of an accident at Europe's largest atomic power station.\n\"There is a need to get additional clarifications because the report contains a number of issues. I will not list them but we requested these clarifications from the IAEA Director General\", Mr Lavrov told Interfax.\nOn Tuesday, Russia's ambassador to the UN Vasily Nebenzya said Moscow \"regrets\" that the report did not blame Kyiv for shelling the plant, which Russian forces have occupied since March.\nMr Lavrov's spokesman on Wednesday blamed the West for putting \"pressure\" on the UN atomic agency.\n\"It is obvious that the West was always putting pressure (on the IAEA) and that it hasn't stopped,\" she was quoted as saying by the RIA Novosti news agency.\nLast week, a 14-strong team from the IAEA visited Zaporizhzhia, with the UN nuclear watchdog's chief Rafael Grossi saying the site had been damaged in fighting.\nAt least two members of the team were to remain there on a permanent basis to ensure the facility's safety.\nThe head of Russia's state nuclear energy agency Rosatom, Dr Alexei Likhachev, said Wednesday that Moscow would \"do our best to ensure the safe operation of the plant exclusively in contact with the IAEA\". AFP", "url": "https://www.straitstimes.com/world/europe/moscow-wants-clarifications-on-uns-ukraine-nuclear-plant-report"}