{"authors": [], "date_download": "2024-10-12 14:09:16", "date_modify": "2024-10-12 14:09:16", "date_publish": "2022-04-10 17:21:22", "description": "Iran and the US have engaged in indirect talks over the past year to revive the nuclear agreement. Read more at straitstimes.com.", "filename": "world_middle-east_iran-wants-us-to-show-goodwill-by-lifting-some-sanctions-prior-to-nuclear-deal_1728742156.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/10/mi_iranflag_100422.jpg?VersionId=yNowUIS7WMop5r06A.gkTpoWUJKs2IU4&h=239762fb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_iran-wants-us-to-show-goodwill-by-lifting-some-sanctions-prior-to-nuclear-deal_1728742156.html", "title": "Iran MPs set conditions for reviving 2015 nuclear deal amid stalled talks", "title_page": "Iran MPs set conditions for reviving 2015 nuclear deal amid stalled talks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI (REUTERS) - Iranian lawmakers have set conditions for the revival of a 2015 nuclear pact, including legal guarantees approved by the United States Congress that Washington would not quit it, Iranian state media reported on Sunday (April 10).\nIran and the US have engaged in indirect talks in Vienna over the past year to revive the 2015 nuclear agreement between Teheran and world powers which then-US president Donald Trump left in 2018 and Iran subsequently violated by ramping up its nuclear programme.\nNegotiations have now stalled as Teheran and Washington blame each other for failing to take the necessary political decisions to settle remaining issues.\nImposing such conditions at a crucial time could endanger a final agreement by restricting negotiators’ room for manoeuvre in the talks.\n“The United States should give legal guarantees, approved by its...Congress, that it will not exit the pact again,” the semi-official Tasnim news agency quoted a statement signed by 250 lawmakers out of a total of 290.\nThe letter also said that under a revived pact, the US should not be able to “use pretexts to trigger the snapback mechanism”, under which sanctions on Iran would be immediately reinstated, the Tasnim news agency reported.\nThe lawmakers also said that “sanctions lifted under the reinstated pact should not be reimposed and Iran should not be hit by new sanctions”.\nIran’s Foreign Minister Hossein Amirabdollahian said on Sunday that US President Joe Biden should issue executive orders to lift some sanctions on Iran to show his goodwill towards reviving the nuclear pact.", "url": "https://www.straitstimes.com/world/middle-east/iran-wants-us-to-show-goodwill-by-lifting-some-sanctions-prior-to-nuclear-deal"}