{"authors": [], "date_download": "2024-10-12 14:00:26", "date_modify": "2024-10-12 14:00:26", "date_publish": "2024-07-03 02:20:41", "description": "Mr Blinken has said Ukraine will become a member of Nato. Read more at straitstimes.com.", "filename": "world_europe_blinken-and-top-zelenskiy-aide-discuss-bringing-ukraine-closer-to-nato_1728741626.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/03/11449448.jpg?VersionId=gLBXydnqyaCxFe5p5YZ0vj_RUmDq6Nqo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_blinken-and-top-zelenskiy-aide-discuss-bringing-ukraine-closer-to-nato_1728741626.html", "title": "Blinken and top Zelensky aide discuss bringing Ukraine closer to Nato", "title_page": "Blinken and top Zelensky aide discuss bringing Ukraine closer to Nato | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - US Secretary of State Antony Blinken and the Ukrainian president’s chief of staff, Mr Andriy Yermak, on July 2 discussed Nato members’ intention to bring Ukraine closer to the alliance, State Department deputy spokesperson Vedant Patel said.\nTheir meeting in Washington came before a Nato summit in the US capital next week, at which Ukraine hopes to secure more assurances from the alliance on its membership bid.\nMr Blinken has said Ukraine will become a member of Nato, and that the summit will “help build a bridge” to that outcome.\n“They spoke about a number of issues, including the upcoming Washington Nato Summit and allies’ intention to bring Ukraine closer to Nato membership and helping to strengthen Ukraine’s ability to defend against Russian aggression,” Mr Patel told reporters at a regular press briefing.\nOn July 2, Mr Blinken and Mr Yermak also discussed efforts led by the Group of Seven nations to “enhance the resiliency” of Ukraine’s energy grid, which has come under Russian attack in recent months, Mr Patel said.\nRussia launched a full-scale invasion of Ukraine in 2022, igniting the bloodiest conflict in Europe since World War II. REUTERS", "url": "https://www.straitstimes.com/world/europe/blinken-and-top-zelenskiy-aide-discuss-bringing-ukraine-closer-to-nato"}