{"authors": [], "date_download": "2024-10-12 13:44:16", "date_modify": "2024-10-12 13:44:16", "date_publish": "2024-05-24 22:52:00", "description": "An earlier report found a “disconnect” between senior management and employees involved in safety. Read more at straitstimes.com.", "filename": "world_united-states_boeing-sees-sixfold-rise-in-employee-concerns-on-product-safety-quality_1728740656.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/24/2024-05-23T121628Z613449322RC2OFV994P16RTRMADP3USA-BOEING-SAFETY.JPG?VersionId=GJ3Y_nQEsstPO3iFsMlYlJWEHXOn9x7j", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_boeing-sees-sixfold-rise-in-employee-concerns-on-product-safety-quality_1728740656.html", "title": "Boeing sees sixfold rise in employee concerns on product safety, quality", "title_page": "Boeing sees sixfold rise in employee concerns on product safety, quality | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Boeing saw a sixfold increase in submissions from its employees raising concerns related to the safety of products and services during the first two months of 2024, compared with the same period in 2023, the planemaker said on May 24.\nThe dramatic rise in these reports occurred after an incident on Jan 5 involving a midair cabin panel blowout on a newly minted Alaska Airlines 737 Max 9 jet, Boeing said in its annual safety report.\nIn February, an expert panel reviewing Boeing’s safety management processes found a “disconnect” between the planemaker’s senior management and employees involved in its safety culture.\n“Our actions are focused on making further improvements to ensure safety, compliance and conformance of our products and services, without compromise,” said Mr Mike Delaney, Boeing’s chief aerospace safety officer.\nThe Jan 5 incident has put Boeing under heightened scrutiny and has prompted US regulators to curb production levels of the company’s best-selling 737 Max jets until it starts to address safety issues. REUTERS", "url": "https://www.straitstimes.com/world/united-states/boeing-sees-sixfold-rise-in-employee-concerns-on-product-safety-quality"}