{"authors": [], "date_download": "2024-10-12 13:52:30", "date_modify": "2024-10-12 13:52:30", "date_publish": "2024-03-26 03:25:30", "description": "The FSB has said March 22’s concert hall attack was “painstakingly” planned. Read more at straitstimes.com.", "filename": "world_europe_moscow-shooting-poses-awkward-questions-for-russias-intelligence-agencies_1728741150.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/26/LYNXNPEK2O0P7-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_moscow-shooting-poses-awkward-questions-for-russias-intelligence-agencies_1728741150.html", "title": "Moscow shooting poses awkward questions for Russia’s intelligence agencies", "title_page": "Moscow shooting poses awkward questions for Russia’s intelligence agencies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Russia’s security state has been ruthlessly effective at detaining President Vladimir Putin’s opponents but was caught off guard by a mass shooting near Moscow, raising questions about its priorities, resources and intelligence-gathering.\nCharged with hunting down Ukrainian saboteurs inside Russia, keeping anti-Kremlin activists in check and disrupting the operations of hostile foreign intelligence agencies, the FSB, the main successor agency to the Soviet-era KGB, has its hands full.\nThat, say former United States intelligence officials and Western security analysts, helps explain why it may have overlooked other threats, including that posed by Islamist militants such as ISIS-K, which claimed responsibility for the attack.\n“You can’t do everything,” said former senior Central Intelligence Agency (CIA) operations officer Daniel Hoffman, who served as the agency’s Moscow station chief.\n“You dial up the pressure on the locals and sometimes you don’t get the intelligence you need on a potential terrorist attack. That’s where they failed.\n“It’s possible they’re overextended dealing with the war in Ukraine and dealing with political opposition. This one slipped through the cracks.”\nThe FSB has said March 22’s concert hall attack was “painstakingly” planned and that the gunmen had carefully hidden their weapons.\nMr Putin on March 25 said radical Islamists were the ones who had carried out the attack, but added that Russia still wanted to understand who had ordered it and that there were many questions for Ukraine to answer.\nUkraine denies any involvement.\nWhen asked on March 25 if the assault represented an intelligence service failure, the Kremlin said Russia’s stand-off with the West meant intelligence-sharing was not happening in the way it used to.\n“Unfortunately, our world shows that no city, no country can be completely immune from the threat of terrorism,” Kremlin spokesman Dmitry Peskov said. Russia’s intelligence services worked tirelessly to defend the country, he added.\nStill, the shooting on March 22, in which at least 139 people were killed and 180 injured, has undermined one of Mr Putin’s longstanding pledges to the Russian people: to ensure stability and security.\nIt has also shaken some residents of the Russian capital, who have largely been insulated from the violence of the Ukraine war despite occasional drone strikes.\nWhether the men were tasked by ISIS, as the militant group and the West assert, or whether there may have been some kind of Ukrainian connection as Mr Putin has hinted – and Kyiv has flatly denied – there were warning signs which do not appear to have been heeded.\nSecurity analysts said the manner in which the attack and escape was carried out was evidence of extensive reconnaissance of the venue beforehand and Russian media published closed-circuit television footage of one of the gunmen visiting at an earlier date.\nOn March 7, the US Embassy in Moscow issued a security alert to Americans, telling them it was “monitoring reports that extremists have imminent plans to target large gatherings in Moscow, to include concerts”.\nOn March 19, three days before the killing spree, Mr Putin delivered a speech to FSB chiefs in which he dismissed what he said were “provocative” Western warnings about a terrorist act.\n“All these actions resemble outright blackmail and the intention to intimidate and destabilise our society,” said Mr Putin.\nProfessor of international affairs Nina Khrushcheva of The New School in New York said the FSB appeared to have had ISIS, also known as Islamic State in Iraq and Syria, on its radar. But she said Mr Putin’s view that Russia was locked in an existential struggle with a US-led West would have made it difficult for Moscow to take at face value a security warning from the US.\n“There’s a lot of mistrust. It’s not like America isn’t involved in misinformation,” she said.\n“In Putin’s world, where it is an existential battle between Russia and the West that wants to undermine Russia and demolish it, of course he wouldn’t believe it because how does he know from his own KGB background that America is not creating its own false flag (operation)?”\nA false flag operation is an act committed with the intent of disguising the source of responsibility and pin blame on another party.\nMr John Sipher, who served a stint in Russia during his career in the CIA’s National Clandestine Service, said he believed the FSB may have dropped the ball because it was too busy focusing on political and other threats to Mr Putin and his government.\n“The (security services) are more about protecting the Kremlin than they are about protecting the people,” said Mr Sipher, who predicted that Mr Putin would now use the attack to justify some new action against the West and Ukraine.\nAnother warning came on March 2 in southern Russia when FSB special forces killed six gunmen whom they identified as members of ISIS.\nThree of the men were on a federal wanted list, and the militants had killed three policemen the previous year. The FSB found a weapons stash.\nOn March 7, the FSB said it had prevented an attack on a synagogue in Moscow that had been plotted by an ISIS cell and that the attackers had been killed in a shoot-out.\nMr Riccardo Valle, a researcher on militant movements, said the March 2 incident should have sent warning signals.\n“I think the fact the security forces discovered that there is a network of (ISIS) in Russia, and a strong one capable of acquiring weapons and putting up strong resistance against special forces – this should have raised the alarm in Moscow security agencies,” Mr Valle said in a phone interview.\n“Maybe it did but they were not able to prevent the attack in time,” said the director of research at The Khorasan Diary, a research and news platform based in Islamabad.\nHe said it was also clear from previous statements and attacks by ISIS-K, including on Russia’s embassy in the Afghan capital Kabul in 2022, that the group had Russia in its sights. REUTERS", "url": "https://www.straitstimes.com/world/europe/moscow-shooting-poses-awkward-questions-for-russias-intelligence-agencies"}