{"authors": [], "date_download": "2024-10-12 13:47:44", "date_modify": "2024-10-12 13:47:44", "date_publish": "2024-10-10 08:11:00", "description": "Mr Biden said the administration was doing everything it could to help impacted communities. Read more at straitstimes.com.", "filename": "world_united-states_biden-says-trump-spreading-outright-lies-as-hurricane-milton-nears_1728740864.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/10/2024-10-09T215957Z215606522RC25HAAHP4I1RTRMADP3STORM-MILTON.JPG?VersionId=uClGXt2U6Ajr1jb.d8C5tTWQ_t2WoOda", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-says-trump-spreading-outright-lies-as-hurricane-milton-nears_1728740864.html", "title": "Biden says Trump spreading ‘outright lies’ as Hurricane Milton nears", "title_page": "Biden says Trump spreading ‘outright lies’ as Hurricane Milton nears | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – US President Joe Biden criticised Donald Trump and his Republican allies for what he said were “outright lies” about the federal response to back-to-back hurricanes, saying the administration was doing everything it could to help impacted communities.\n“There’s been a reckless, irresponsible and relentless promotion of disinformation and outright lies that are disturbing people,” Mr Biden said on Oct 9, as he received a briefing on Hurricane Milton, which is barrelling toward Florida, and the recovery work from Hurricane Helene, which hit the US in September.\n“It’s harmful to those who need help the most. There’s simply no place for this to happen,” Mr Biden said. “Former president Trump has led the onslaught of lies.”\nAt a subsequent address on Oct 9 evening, Mr Biden repeated the criticism, calling misinformation “un-American” and describing claims by Republicans as “beyond ridiculous”.\n“It’s so stupid, it’s got to stop,” Mr Biden said.\nVice-President Kamala Harris, Trump’s general election rival, joined the earlier briefing remotely from New York City and warned businesses against price-gouging – something she has targeted in her campaign’s economic agenda.\n“To any company or individual that might use this crisis to exploit people who are desperate for help through illegal fraud or price gouging, whether it be at the gas pump, the airport, or the hotel counter, know that we are monitoring these behaviours,” Ms Harris said. “Anyone taking advantage of consumers will be held accountable.”\nThe remarks from Mr Biden and Ms Harris reinforced how the hurricanes have become a major political issue in a presidential race that has Trump and the vice-president running neck-and-neck in key swing states.\nTrump has accused the administration of not doing enough to help communities impacted by Helene and the former president has spread unfounded claims about how much aid was being offered to victims and that funding for relief had been “stolen” to aid undocumented migrants, apparently conflating emergency funds with a separate programme.\n“Assertions have been made that property is being confiscated. That’s simply not true,” Mr Biden said. “You’re saying people impacted by these storms who received US$750 (S$980) in cash and no more. That’s simply not true.”\nMr Biden also seized on a social media post by Ms Marjorie Taylor Greene, a Georgia congresswoman, suggesting the federal government controlled the weather, calling the comment “bizarre”.\nMs Harris previously accused Trump and Republican critics of playing “political games” and warning – along with Mr Biden – that misinformation about the hurricane response threatens to undercut efforts to bring aid to affected areas, but the Oct 9 comments from the president and vice-president were their most forceful to date.\nMilton is rushing toward Florida as a potentially deadly Category 3 storm that is expected to cause once-in-a-century flooding and bring winds that can tear apart homes, with landfall expected late Oct 9 or early Oct 10.\nThe hurricane is currently on track to hit south of the Tampa Bay region, home to more than 3 million people, a major military base and Florida’s largest port.\nCampaign fallout\nMr Biden and the two presidential candidates have all altered their schedules in recent days, cutting short campaign trips and travelling to states hit hard by Helene to see the devastation first hand.\nOn Oct 8, Mr Biden said he would postpone a trip to Germany and Angola that had been slated for Oct 10-15 to instead focus on preparations for Milton, warning that it could be the worst storm to hit Florida in over a century.\nDespite Trump’s criticism, Republican governors and state officials in the aftermath of Helene said the administration was working with them to bring relief to communities ravaged by that storm.\nFederal Emergency Management Agency (Fema) administrator Deanne Criswell said that so far, she had not seen evidence of leaders spreading disinformation related to evacuation orders urging those on Florida’s west coast to flee the path of the storm.\nMr Biden on Oct 9 said his “team has done everything possible to prepare for” Milton and that he had spoken to Florida Governor Ron DeSantis and Tampa Mayor Jane Castor and urged them to contact him directly for anything they needed. He urged residents in the storm’s path to listen to local officials.\n“I know it’s really tough leaving behind your home, your belongings, everything you own. But I urge everyone in Hurricane Milton’s path to follow all safety instructions as we head in the next 24 hours,” Mr Biden said. “It’s a matter of – literally a matter of life and death.” BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/biden-says-trump-spreading-outright-lies-as-hurricane-milton-nears"}