{"authors": [], "date_download": "2024-10-12 13:27:25", "date_modify": "2024-10-12 13:27:25", "date_publish": "2024-08-15 13:51:39", "description": "The tool’s shutdown ahead of the US presidential election has drawn concerns from lawmakers, journalists and researchers. Read more at straitstimes.com.", "filename": "world_united-states_meta-shuts-down-crowdtangle-tool-used-for-tracking-online-misinformation_1728739645.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/15/FILES-FRANCE-US-TECHNOLOGY-META-MISINFORMATION-215730.jpg?VersionId=ORs62PJpTSIRe9u_vagRO9n49ohSmRBr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_meta-shuts-down-crowdtangle-tool-used-for-tracking-online-misinformation_1728739645.html", "title": "Meta shuts down CrowdTangle tool used by some groups to track online misinformation", "title_page": "Meta shuts down CrowdTangle tool used by some groups to track online misinformation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAN FRANCISCO – Meta Platforms on Aug 14 shuttered CrowdTangle, a popular social media analysis tool that journalists, civic groups and researchers used to monitor trending posts on platforms like Facebook and Instagram in real time.\nThe timing of the tool’s shutdown, months ahead of a major US presidential election, has drawn concern from groups that relied on CrowdTangle to track the flow of information on social media, including viral falsehoods that have led to real-world harm.\nUsing CrowdTangle, journalists and researchers could show how many users engaged with a piece of content, which groups supercharged the spread of a post and just how often political and medical misinformation went viral on Facebook and Instagram.\nIn July, a bipartisan group of lawmakers sent Meta chief executive officer Mark Zuckerberg a letter asking to delay the discontinuation of CrowdTangle for six months, stating that the company “has a responsibility to ensure that the public, independent researchers, journalists, and policymakers can study and address the impact that platforms and their algorithms are having”.\nIn a response to that letter earlier this week, Meta said it was continuing with CrowdTangle’s shutdown because the tool has been “hard to maintain” and “does not provide a representative picture of what is happening on our platforms”.\nThe company said it still plans to replace CrowdTangle with the Meta Content Library, a new tool that Meta has argued would include more expansive data, like the ability to analyse comments.\nResearchers associated with non-profit institutions must apply through a third party and Meta partner, the Inter-university Consortium for Political and Social Research at the University of Michigan, for access to the library.\nBut news publishers and other groups with commercial interests won’t be eligible to use the tool, which has been criticised for being an inadequate replacement for CrowdTangle.\nAn analysis from Proof News cited 11 features, including the ability to see social media metrics over time and dashboard sharing, that Meta Content Library lacked compared with CrowdTangle when used for research.\nAsked for comment on CrowdTangle’s shutdown, a Meta spokesperson pointed to a November blog post the company wrote to announce the new Meta Content Library tool.\nIn separate statements, Senator Chris Coons, a Delaware Democrat, called Meta’s response “disappointing,” and Republican Senator Bill Cassidy of Louisiana said it “only highlights the need for more oversight and scrutiny of Big Tech”.\nCrowdTangle was founded in 2011 and quickly gained popularity among media clients like BuzzFeed, CNN, Vox and NBC for its ability to track trending posts on social media platforms. Five years later, Meta acquired the tool, making it free and expanding its access for others across media. Soon, reporters and researchers were using the tool to investigate topics as diverse as Russian influence operations, misinformation about the Covid-19 pandemic and the QAnon conspiracy movement.\nJournalists’ use of the tool also shed light on Facebook and Instagram users’ high engagement levels with inflammatory conspiracies.\nIn 2021, Meta executives clashed over the issue of data transparency and how much the social network should reveal about popular content on its platform. That July, the New York Times reported that the CrowdTangle team within Meta was being broken up.\nMeta also rescinded other initiatives, including a US$40,000 (S$52,700) grant that aimed to help research partners use CrowdTangle data to understand public discussion around the Covid-19 pandemic.\nUntil CrowdTangle’s closure, Meta maintained a list of dozens of case studies showing how researchers used the tool to, for instance, identify Russia-linked influence operations in Africa or track Covid-19 vaccine misinformation.\nIn 2022, Bloomberg reported that Meta had started an official internal process to shutter CrowdTangle. Though the company’s executives have recently framed the shutdown of the tool as necessary because it is “degrading”, the company had already been devoting dwindling resources to the product, Bloomberg reported. In mid-2022, fewer than five engineers on Facebook’s London integrity team were tasked with keeping CrowdTangle afloat.\nIn their letter to Meta, lawmakers noted that the Meta Content Library provides a view of the platform only at the time a search is conducted, which would make it difficult for researchers to reproduce a search or a study conducted by another. The lawmakers also noted that the constraint “limits and complicates the ability of researchers to study what occurred on the platform”.\nThat could make it harder for researchers to investigate, for instance, the origin and spread of election-related misinformation on Facebook and Instagram over time.\nDr Fabio Giglietto, an associate professor of internet studies at the University of Urbino Carlo Bo in Italy, said that he anticipated many researchers would voice their disappointment over the end of CrowdTangle.\n“The alternative is not yet fully ready,” Dr Giglietto said, citing difficulties with running queries on the tool using the virtual environment it requires. “This is particularly frustrating for those who successfully navigated the overly complex application process and cumbersome set-up,” he said.\nMeta’s move to sunset CrowdTangle also comes amid relaxed content moderation policies and information integrity efforts across social media platforms.", "url": "https://www.straitstimes.com/world/united-states/meta-shuts-down-crowdtangle-tool-used-for-tracking-online-misinformation"}