{"authors": [], "date_download": "2024-10-12 13:42:22", "date_modify": "2024-10-12 13:42:22", "date_publish": "2024-07-01 02:33:26", "description": "The plane was allowed to make an emergency landing to evacuate a sick passenger. Read more at straitstimes.com.", "filename": "world_middle-east_israel-carrier-says-turkish-workers-refused-to-refuel-plane_1728740542.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/01/btairline20240630.jpg?VersionId=lFGky9U5hKQjCq85s22.YprOYOlWSxfx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israel-carrier-says-turkish-workers-refused-to-refuel-plane_1728740542.html", "title": "Israel carrier says Turkish workers refused to refuel plane", "title_page": "Israel carrier says Turkish workers refused to refuel plane | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM – Israel’s national carrier El Al said on June 30 that its Warsaw to Tel Aviv flight was not allowed to refuel at Antalya Airport after making an emergency landing to evacuate a passenger for medical reasons.\nTurkish workers at Antalya Airport refused to refuel Flight LY5102 before it could take off for Israel, El Al said in a statement.\n“Local workers refused to refuel the company’s plane even though it was a medical case,” it said, adding that the passenger was evacuated.\nThe plane then took off to Rhodes in Greece, where “it will refuel before taking off to Israel”, the airline said.\nRelations between Turkey and Israel have deteriorated since the war in Gaza broke out on Oct 7, with all direct flights between the two countries cancelled since.\nTurkish diplomatic sources confirmed that the plane was allowed to make an emergency landing to evacuate a sick passenger.\n“Fuel was to be provided to the plane due to humanitarian considerations, but as the relevant procedure was about to be completed, the captain decided to leave of his own accord,” a Turkish diplomatic source said.\nIsraeli newspaper The Times of Israel said the plane was on the tarmac at Antalya for several hours before it took off for Rhodes.\nTurkish President Recep Tayyip Erdogan has been a vocal critic of Israel’s blistering military campaign in Gaza, and has often expressed support for the Palestinian militant group Hamas as defenders of their homeland.\nHamas is classed as a terrorist organisation by Israel, the US and European Union, amongst others.\nThe Israel-Hamas war broke out after Hamas’ Oct 7 attack on southern Israel that resulted in the deaths of 1,195 people, mostly civilians, according to an AFP tally based on official Israeli figures.\nIsrael’s retaliatory military offensive has killed at least 37,877 people in Gaza, also mostly civilians, according to the Health Ministry in the Hamas-run territory. AFP", "url": "https://www.straitstimes.com/world/middle-east/israel-carrier-says-turkish-workers-refused-to-refuel-plane"}