{"authors": [], "date_download": "2024-10-12 14:06:46", "date_modify": "2024-10-12 14:06:46", "date_publish": "2022-04-10 11:36:56", "description": "Russia's invasion of Ukraine has seen public support for joining Nato double from 30% to 60%. Read more at straitstimes.com.", "filename": "world_europe_finland-gears-up-for-historic-nato-decision_1728742006.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/10/rrfinlandnato1004.jpg?VersionId=YZaOO0q8oLCzLoRaDi7S43Lq2j1gEjx0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_finland-gears-up-for-historic-nato-decision_1728742006.html", "title": "Finland gears up for historic Nato decision", "title_page": "Finland gears up for historic Nato decision | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HELSINKI (AFP) - Finland is preparing for a potentially historic decision \"before midsummer\" on whether to apply to join the North Atlantic Treaty Organisation as a deterrent against Russian aggression.\nThe Nordic nation of 5.5 million people has traditionally been militarily non-aligned, in part to avoid provoking its eastern neighbour, with which it shares a 1,300km border.\nBut Russia's invasion of Ukraine on Feb 24 saw public support for joining Nato double from 30 per cent to 60 per cent, according to a series of polls.\n\"Never underestimate the capacity of Finns to take rapid decisions when the world changes,\" former Finnish prime minister Alexander Stubb told AFP.\nHimself a long-time Nato advocate, Dr Stubb now believes Finland making a membership application is \"a foregone conclusion\" as Finns re-evaluate their relationship with their neighbour.\nThis week a government-commissioned national security review will be delivered to Parliament, the Eduskunta, to help Finnish MPs make up their own minds, before it is put to a vote.\n\"We will have very careful discussions but not taking any more time than we have to,\" Prime Minister Sanna Marin told a news conference on Friday (April 8).\n\"I think we will end the discussion before midsummer,\" she added.\n\"My guess is that the application will be filed sometime during the month of May\" in time for the June Nato summit in Madrid, Dr Stubb said.\nChange of heart\nFinland declared independence in 1917 after 150 years of Russian rule, only for its vastly outnumbered army to fight off an attempted Soviet invasion during the Second World War inflicting heavy losses on the Red Army.\nHostilities ended in a peace deal that saw Finland ceding several border areas to the Soviet Union.\nFinnish leaders agreed to remain neutral during the Cold War in exchange for guarantees from Moscow that it would not invade.\nThe country's forced neutrality to appease its stronger neighbour coined the term \"Finlandisation\".\nFinland has remained outside the transatlantic military alliance, and despite some cuts after the Cold War it has focused on maintaining well-funded defence and preparedness capabilities.\n\"We're able to mobilise 280,000 to 300,000 men and women within a matter of days,\" Dr Stubb said, adding that 900,000 reserves could also be called up.\nLast week Finland's government agreed a 40 per cent hike in defence spending by 2026, to further strengthen the country's position.\n\"We have walked a long way when it comes to our security policies, and they have worked so far,\" said Centre Party MP Joonas Kontta.\nLike the majority of his parliamentary colleagues, the 32-year-old used to think that Nato membership was \"something that we don't need at the moment\".\nBut Russia's invasion \"changed something in Europe in a way that can't be changed back\", he told AFP, and Kontta recently announced that he now believes it is time to seek to join the alliance.\nA number of MPs have also recently announced similar changes of heart regarding Finland's \"Nato question\" - although many more are keeping their positions to themselves awaiting more detailed discussions.\nAnti-Nato minority\nOnly six of Finland's 200 MPs in a recent poll by public broadcaster Yle openly voiced anti-Nato views, including Mr Markus Mustajarvi from the Left Alliance party Finland and Sweden's non-alignment \"has brought stability to the whole of Northern Europe\", the Lapland MP told AFP.\nMustajarvi questions whether Nato's Article 5 commitment to mutual defence would provide genuine protection in case of an attack.\nInstead he cites Finland's own defence capabilities which are \"so strong that they would force Russia to think what price it would pay for attacking\".\nDespite receiving \"all sorts of feedback\" from the public and his fellow MPs over his stance, Mustajarvi insists he has \"thought this through to the end and so far I don't see a reason to change my position\".\nGrey zone\nSince Russia's attack, Finland's leadership has undertaken an intensive series of talks to canvass opinion from other Nato states about a possible membership bid.\nAlong with neighbouring Sweden, Finland has received public assurances from secretary general Jens Stoltenberg that the alliance's door remains open, as well as expressions of support from numerous members including the United States, Britain, Germany, France and Turkey.\nBut attempting to join Nato would likely be seen as a provocation by the Kremlin, for whom the expansion of the US-led alliance on its borders has been a prime security grievance.\nFinland's president Sauli Niinisto has warned that Russia's response could be \"on the brash side\", including airspace, territorial violations and hybrid attacks.\nThe Kremlin has pledged to \"rebalance the situation\" in the event of Finland joining Nato.\nMeanwhile, Foreign Minister Pekka Haavisto has acknowledged that Russia could seek to destabilise a membership bid during the \"grey zone\" between an application and its ratification by all 30 Nato states, which could take four months to a year.\n\"Finland has always tried to stay away from the grey zone,\" Dr Stubb said, but he believes that Finland has the resilience to withstand potential Russian aggression or hybrid attacks.", "url": "https://www.straitstimes.com/world/europe/finland-gears-up-for-historic-nato-decision"}