{"authors": [], "date_download": "2024-10-12 14:01:17", "date_modify": "2024-10-12 14:01:17", "date_publish": "2023-06-04 04:57:10", "description": "Seventeen people were being treated in hospital after the attack on a residential area. Read more at straitstimes.com.", "filename": "world_europe_thirteen-injured-others-trapped-in-blast-near-ukrainian-city-of-dnipro_1728741677.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/04/10671674_4.jpg?VersionId=4xKPzrwy2BkaIY4ATr5P7wTc_n2Kid02", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_thirteen-injured-others-trapped-in-blast-near-ukrainian-city-of-dnipro_1728741677.html", "title": "Russian missile attack on Dnipro kills 2-year-old, injures 22, says governor", "title_page": "Russian missile attack on Dnipro kills 2-year-old, injures 22, says governor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – A two-year-old girl was killed and 22 people injured, including five children, when a Russian missile struck near the central Ukrainian city of Dnipro, the regional governor said on Sunday.\n“Overnight, the body of a girl who had just turned two was pulled from under the rubble of a house,” Mr Serhiy Lysak wrote on the Telegram messaging channel.\nSeventeen people were being treated in hospital after the attack on a residential area by Iskander short-range cruise missiles, Mr Lysak said.\nReuters could not independently verify the report. There was no immediate reaction from Moscow.\nMr Mykola Lukashuk, head of the Dnipropetrovsk region council, said 17 children have died in the region since Russia launched its full-scale invasion of Ukraine in February 2022.\n“No words can soothe the pain of parents who have lost the most precious thing in their lives,” he said.\nThe war has killed at least 485 children in Ukraine and injured nearly 1,500, the country’s Office of the Prosecutor-General said on Sunday on Telegram.\nThe missile hit a spot between two two-storey residential buildings in the Pidhorodnenska community, partially destroying them and damaging a number of houses and cars as well as infrastructure, Mr Lysak said.\n“Once again, Russia proves it is a terrorist state,” Ukraine’s President Volodymyr Zelensky wrote on Saturday after the first reports of the explosions.\nMoscow and Kyiv deny their military forces target civilians.\nPictures posted on social media showed rescue teams working at a shattered, smouldering building amid piles of twisted building materials.\nFollowing the attack in Dnipro, Russia launched a new wave of overnight air strikes on Ukraine. The Ukrainian air force said on Sunday that it destroyed more than half of the air targets.\nFour of the six cruise missiles and three of the five Iranian-made Shahed drones launched by Russia were downed, the air force said on Telegram.\nKyiv’s city military administration earlier said all Russia-launched targets approaching the capital had been intercepted. But it said an airfield in a central region was struck.\nRussia has repeatedly attacked Ukraine’s capital since May, chiefly at night, ahead of a long-expected Ukrainian counter-offensive to reclaim territory. Ukrainian officials say the Russian strikes are an attempt to inflict psychological distress on civilians. REUTERS", "url": "https://www.straitstimes.com/world/europe/thirteen-injured-others-trapped-in-blast-near-ukrainian-city-of-dnipro"}