{"authors": [], "date_download": "2024-10-12 13:55:02", "date_modify": "2024-10-12 13:55:02", "date_publish": "2024-06-12 12:20:00", "description": "Social media users are now joking that dogs seem to be humans trapped in dog bodies. Read more at straitstimes.com.", "filename": "world_is-that-dog-actually-a-human_1728741302.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/12/puppy-4985873150.jpg?VersionId=P0bo6thCJH253PMAMFaBoDjYYTJ4L1YO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_is-that-dog-actually-a-human_1728741302.html", "title": "Is that dog actually a … human?", "title_page": "Is that dog actually a … human? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - He sits forlornly on a floating staircase, his body slightly slumped and his limbs in his lap, gazing out floor-to-ceiling windows into the summer foliage beyond.\nHe seems to be contemplating something – perhaps the meaning of life itself – as the camera shifts around to the front to reveal his true condition. He’s not a man; he’s a goldendoodle.\nThis video, taken by the dog’s owner Mr Lawrence Skutelsky, is captioned “Trying to find the zipper on my goldendoodle after this”, and it has been viewed on TikTok more than 87 million times.\nPosted on May 24, it joined a pantheon of similar videos from other goldendoodle owners documenting the humanlike behaviour of their pets – and prompted a host of new additions to the genre.\nBack in 2020, a woman named Molly Dolan, who lives in Charleston, South Carolina, posted a video of her goldendoodle walking upright on two hind legs across the entire street – and it has been viewed about 6.5 million times to date.\nMr Skutelsky, a 22-year-old New Yorker who works for his family’s flooring business, said he took the video of his 1-year-old goldendoodle, Brady, when he was visiting his parents’ house in the suburbs. It was the first time he’d ever seen Brady sit like that, he said in an interview, but it wasn’t the first time he’d noticed the dog acting like a human.\n“I came home the other day from the office and he was, like, literally laying in my bed, under the covers,” Mr Skutelsky said.\nMs Corrine Gearhart, a 43-year-old professional dog trainer who specialises in doodle breeds, described goldendoodles as “uniquely sensitive”.\n“They can read us so well and that, in part, comes from the poodle side, which is really sensitive and intelligent,” said Ms Gearhart, whose business, the Doodle Pro, is based in Denver. The golden side is “just friendliness”, she added.\nShe said she thought these goldendoodle personality traits might make it easier for their owners to anthropomorphise (or attribute human traits to) them, even more so than owners of other breeds do.\nWhen we notice aspects of dogs that remind us of ourselves, she said, “I think that helps us have compassion for them.”\nMany commenters on TikTok say it’s not just the doodles’ body language that reads as human; it’s their eyes. Doodle eyes tend to look similar to ours, with large irises and expressive eyebrows.\n“Does your dog have normal eyes or does your dog have strangely human eyes that make you think he’s trapped the soul of a human person inside of his body?” asked one TikTok user named Nolan in a sound that went viral. Upon seeing a compilation of doodles with abnormally expressive eyes, another commenter joked, “Yep … I’m getting a cat.”\n“Yeah, their eyes are freakishly human for sure,” Mr Skutelsky acknowledged. “When I look at him, sometimes, I don’t know, it’s like he’s trying to say something.”\nAfter training hundreds of goldendoodles, Ms Gearhart said, she has found them to be very expressive with their faces.\n“I can’t tell you the scientific reasons, but I can tell you just anecdotally, they’re more prone to connected eye contact with us when communicating,” she said.\nIn 2019, scientists studied the eyebrow muscles and movements of dogs and compared them with those of wolves. They found that “domestication transformed the facial muscle anatomy of dogs specifically for facial communication with humans”, perhaps giving them a more recognisably “human” set of facial expressions.\nTikTok users are a rapt audience for animals (and human babies) displaying the sentience of adult humans. In addition to the influx of goldendoodles acting like people, there was the “fully conscious” baby, a one-year-old named Kate with an enthusiasm for the Four Seasons Orlando who many thought was far beyond her years.\n“Everyone was saying, ‘Brady’s the Four Seasons Orlando Dog’,” Mr Skutelsky said.\nThough she acknowledged goldendoodles’ humanlike traits, Ms Gearhart said owners and fans of the breed shouldn’t get carried away, as they might risk misinterpreting what their dogs are really trying to tell them.\nFor example, she said, a dog may pull his lips back and show his teeth in what may look like a smile, but such behaviour is more typically an expression of fear or aggression.\n“It’s important for us to still understand dog body language and not completely apply our human behaviours and expectations to them,” she said.", "url": "https://www.straitstimes.com/world/is-that-dog-actually-a-human"}