{"authors": [], "date_download": "2024-10-12 13:42:58", "date_modify": "2024-10-12 13:42:58", "date_publish": "2024-10-11 21:06:11", "description": "SAO PAULO - Brazilian President Luiz Inacio Lula da Silva said on Friday it made \\\"no sense\\\" for the U.S. Department of Justice to request information from Saab over Brazil's purchase of the Swedish firm's Gripen fighter jets in 2014. Read more at straitstimes.com.", "filename": "world_europe_lula-slams-us-request-for-information-on-brazils-fighter-jet-purchase_1728740578.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/LYNXMPEK9A0HV-1.jpg?VersionId=BpbK36wRmaTsahYor8dcmTIQnhCf8xBe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_lula-slams-us-request-for-information-on-brazils-fighter-jet-purchase_1728740578.html", "title": "Lula slams US request for information on Brazil fighter jet deal", "title_page": "Lula slams US request for information on Brazil fighter jet deal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAO PAULO - Brazilian President Luiz Inacio Lula da Silva said on Friday it made \"no sense\" for the U.S. Department of Justice to request information from Saab over Brazil's purchase of the Swedish firm's Gripen fighter jets in 2014.\nSaab revealed the U.S. request on Thursday and said it intended to comply, without providing further details, sending its shares sliding.\n\"I think this is the U.S. meddling in another country's affairs,\" Lula told a radio interview.\nLula is in the middle of his third non-consecutive term, having previously served as president between 2003 and 2010.\nThe deal with Saab, which beat U.S. planemaker Boeing and France's Dassault to secure the contract, was inked under Lula's handpicked successor, former President Dilma Rousseff.\nBrazilian prosecutors in 2016 formally accused Lula of using his influence to help Saab win the tender for the 36 fighter jets worth $5.4 billion. The case was tossed out by Brazil's Supreme Court in 2022.\nSaab said in its Thursday statement that Brazilian and Swedish investigations into the procurement process had been closed without indicating any wrongdoing by the firm.\nLula noted he initially intended to buy Dassault's Rafale fighter, but left the decision to Rousseff as he only had a few months left in his second term. He suggested the United States was unhappy with Brazil's \"sovereign\" choice.\n\"They didn't like it when I said I was going to buy the Rafale and certainly didn't like it when Dilma bought the Swedish aircraft, as they wanted us to buy the U.S. plane,\" the president said.\nThe agreement with Saab allowed Gripens to be produced in Brazil. Last year, Saab and Embraer launched a production line for the fighter at the Brazilian planemaker's Gaviao Peixoto plant.\nNEW PRESIDENTIAL PLANE\nLula also said he plans to buy a new presidential aircraft after his 20-year-old Airbus A319 jet faced an undisclosed technical problem this month during a flight from Mexico City to Brasilia.\nThe plane encountered issues after departing the Mexican capital and was forced to circle the area for hours to burn off fuel before landing safely at the airport it had just departed.\nLula said one of the engines had issues and passengers felt unusual vibrations.\n\"I have asked my defense minister to gather a proposal. We will buy a presidential airplane and also some other aircraft for ministers to travel on,\" he said. REUTERS", "url": "https://www.straitstimes.com/world/europe/lula-slams-us-request-for-information-on-brazils-fighter-jet-purchase"}