{"authors": [], "date_download": "2024-10-12 14:03:27", "date_modify": "2024-10-12 14:03:27", "date_publish": "2023-05-01 05:52:58", "description": "Group escapes without casualties after being targeted with cluster munitions. Read more at straitstimes.com.", "filename": "world_europe_trench-digging-ukrainian-troops-targeted-by-russian-strikes_1728741807.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/01/UKRAINE-RUSSIA-CONFLICT-WAR-131047_1.jpg?VersionId=BvwGFh8OKBPMGSZrkLId7ILgAC0J7M8q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_trench-digging-ukrainian-troops-targeted-by-russian-strikes_1728741807.html", "title": "Trench-digging Ukrainian troops targeted by Russian strikes", "title_page": "Trench-digging Ukrainian troops targeted by Russian strikes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEAR BAKHMUT, Ukraine - Shovels in hand and helmets on heads, Ukrainian soldiers jumped out of a military truck and prepare to dig a trench near Bakhmut, in the conflict-hit east of the country.\nThe team leader gave instructions to the 30 or so diggers: “You have to dig from there to there,” he said, pointing to a few dozen metres of green grass damp from the night’s rain.\nThe chosen spot is between a small road and some woods, about 6km from the Russian front line.\nRussia invaded Ukraine in February last year. These days, most of the fighting is in the east, for control of Ukraine’s industrial Donbas region, in particular the city of Bakhmut, which has been almost completely destroyed.\nThe group leader continues: “Half of you dig, half of you can smoke, and then you change over. You dig until 2.30pm and then we get out of here,” he said, mid-morning on Sunday.\n“That’s Bakhmut, that’s the front,” he adds, pointing to all sides.\nThe soldiers on the first digging duty put their rifles in the grass and, shovels in hand, lined up along the designated stretch of ground. The others stand slightly back.\nBut the trench-diggers didn’t even have time to start before the shrill sound of a rocket ripped through the air, exploding less than 50m away.\nSome soldiers dived to the ground, others ran to lie down at the edge of the adjacent wood.\nTwenty or so explosions in a row followed, close by or more distant.\nThe detonations followed one another for about 20 seconds. Then silence returned.\nA few soldiers stood up, but quickly fall back when two more explosions sounded.\nObservation drone\nWhen calm eventually returned, the team leader ordered the soldiers to run back towards the truck, parked about 50m away under cover of trees.\n“Go, go!” he shouted, relieved that there were no casualties.\nThe soldiers ran to the vehicle, some with shovels still in hand.\nOnce they were all in the truck they sped off, away from the immediate danger.", "url": "https://www.straitstimes.com/world/europe/trench-digging-ukrainian-troops-targeted-by-russian-strikes"}