{"authors": [], "date_download": "2024-10-12 14:01:02", "date_modify": "2024-10-12 14:01:02", "date_publish": "2023-06-04 05:17:07", "description": "Ukrainian partisans are working to undermine their Russian occupiers. Read more at straitstimes.com.", "filename": "world_europe_car-bombing-in-russian-occupied-ukraine-shows-reach-of-war_1728741662.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/04/carbomb04_0.jpg?VersionId=EqGmrDhW6Nzpi5aZeMfPqhmirE74CVIp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_car-bombing-in-russian-occupied-ukraine-shows-reach-of-war_1728741662.html", "title": "Car bombing in Russian-occupied Ukraine shows reach of war", "title_page": "Car bombing in Russian-occupied Ukraine shows reach of war | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – A car bomb killed at least one person on Friday night in Russian-occupied southern Ukraine, according to Ukrainian and Russian officials, highlighting the war’s reach far beyond the front lines as Ukrainian partisans aim to undermine their occupiers.\nThe blast occurred in Mykhailivka, a town in Ukraine’s Zaporizhzhia region. The vehicle targeted was carrying “four supporters of the Kremlin”, said Mr Ivan Fedorov, the Ukrainian mayor in exile of the Russian-occupied city of Melitopol, about 40km south.\nMr Vladimir Rogov, a Russian occupation official in the Zaporizhzhia region, confirmed the attack, saying the bomb killed a “local businessman” named Sergei Didovoduk and injured two others. On Saturday, he said the authorities had opened an investigation.\nThe attack comes as Ukrainian forces are preparing for a highly anticipated counter-offensive that analysts believe will take place in southern Ukraine. Ukraine’s troops will probably aim to sever the land routes that connect Russia to Crimea, which Moscow illegally annexed in 2014, according to analysts and Western officials.\nMuch is riding on the coming counter-offensive, especially on the heels of Russia’s recent capture of the eastern Ukrainian city of Bakhmut.\nIn the meantime, partisan attacks like the one on Friday night have become a staple in occupied areas as Ukrainian insurgents target the Russian military and so-called Russian collaborators.\nMr Didovoduk was registered to compete for Russia’s governing party in upcoming local elections, Mr Rogov said. The Kremlin has pushed forward with plans to stage local elections in September in four Ukrainian regions that Russia illegally annexed in 2022, an attempt to legitimise the moves despite the constantly changing frontiers of the territory under Russian control.\nUkraine has denounced the elections in the annexed regions – Zaporizhzhia, Kherson, Luhansk and Donetsk – as a sham.\nThe killing of Mr Didovoduk also raises questions about the legality of partisan attacks under the internationally recognised law of war, including whether partisans are considered combatants.\nUkrainian partisans say they are civilians and the legal basis for their activity is regulated under Ukrainian law, not the laws of war that include prohibitions on a soldier targeting a civilian official.\nBut under international laws, civilians become combatants when they start taking part in hostilities. NYTIMES", "url": "https://www.straitstimes.com/world/europe/car-bombing-in-russian-occupied-ukraine-shows-reach-of-war"}