{"authors": [], "date_download": "2024-10-12 13:54:28", "date_modify": "2024-10-12 13:54:28", "date_publish": "2024-03-07 09:30:00", "description": "NTSB said earlier that Boeing had failed to supply the names and some key records sought in the ongoing investigation. Read more at straitstimes.com.", "filename": "world_united-states_boeing-discloses-names-of-737-max-employees-after-transport-safety-board-chair-faults-cooperation_1728741268.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/07/2024-03-05T232603Z741334596RC2RD5ATB19CRTRMADP3USA-AVIATION-SAFETY.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_boeing-discloses-names-of-737-max-employees-after-transport-safety-board-chair-faults-cooperation_1728741268.html", "title": "Boeing discloses names of 737 Max employees after transport safety board chair faults cooperation", "title_page": "Boeing discloses names of 737 Max employees after transport safety board chair faults cooperation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Boeing on March 6 provided US regulators with the names of employees on its 737 Max door team after lawmakers and a federal safety official sharply criticised the planemaker’s failure to do so at a Senate hearing.\nNational Transportation Safety Board (NTSB) chair Jennifer Homendy said earlier on March 6 that Boeing had failed to supply the employee names and some key records sought in the agency’s ongoing investigation into the Jan 5 Alaska Airlines 737 Max 9 mid-air cabin door plug emergency.\nMs Homendy said at the Senate Commerce Committee hearing that investigators sought the names of the 25 people who work on door plugs at a Boeing facility in Renton, Washington, and had begun a week of interviews on March 3.\n“It is absurd that two months later, we don’t have it,” she said.\nBoeing said on March 6 that soon after the incident, it had provided the NTSB with the names of some of its employees, including door specialists it believed would have relevant information.\nAfter Ms Homendy’s comments on March 6, Boeing provided the employee list, an NTSB spokesperson said.\n“We have now provided the full list of individuals on the 737 door team, in response to a recent request,” the planemaker said in a statement, adding that “if the door plug removal was undocumented, there would be no documentation to share”.\n“We will continue to cooperate fully and transparently with the NTSB’s investigation,” it said.\nBefore Boeing issued its statement on March 6, Senate Commerce Committee chair Maria Cantwell fired off a letter to the company’s chief executive, Mr Dave Calhoun, telling him to give the NTSB those employee names within 48 hours.\nSenator Cantwell on March 6 reiterated that she planned to call Mr Calhoun to testify at a future hearing.\n“It’s beyond disappointing,” Ms Cantwell said. “We have an entire economy that depends on people getting this right.”\nSeeking more information\nMs Homendy said the NTSB sought documentation related to the opening and closing of the door plug and the removal of key bolts that were missing, and had requested documentation related to the door plug “numerous times over the past few months”. She also said the NTSB had been unable to interview the door team’s manager, who was on medical leave.\nSeparately, she told Reuters the NTSB planned to hold a multiple-day investigative hearing into the Max 9, likely in late summer, which will include testimony from staff at Boeing and fuselage manufacturer Spirit AeroSystems.\nMs Homendy confirmed that inspections of all other Max 9 planes in service found no other missing bolts.\nThe planemaker has scrambled to explain and strengthen safety procedures since the January mid-air incident that led to the Federal Aviation Administration (FAA) grounding the Max 9 for several weeks. The company has been the subject of increased scrutiny from regulators and airlines concerned about the quality of jet production.\nMs Homendy said the NTSB did not know which employees removed the bolts and failed to reinstall them.\n“The NTSB needs to interview the employees,” she said. “We are not about blame at the NTSB. This is the only way we ensure safety... find out what happened, what was done, what was not done, what policies are in place.”\nShe said she was not suggesting any malfeasance on Boeing’s part. “What I’m saying is we’ve requested the information. We don’t have the information.”\nSenator Ted Cruz, the top Republican on the Commerce Committee, called it “utterly unacceptable” that the NTSB was not receiving full cooperation from Boeing and asked for an update from Ms Homendy within a week.\nMs Homendy also confirmed that the Max 9 door plug had moved during prior flights, citing markings on the door.\nThere were 154 prior flights by the Alaska Airlines Max 9 jet before the Jan 5 incident.\n“There were very small movements until it eventually came out,” Ms Homendy said, adding that testing showed “you could see a bit of a gap towards the end” but that it was not clear how noticeable it was.\nFAA administrator Mike Whitaker said last week Boeing must develop a comprehensive plan to address “systemic quality control issues” within 90 days, following an all-day meeting with Mr Calhoun on Feb 27.\nAn FAA audit of 737 production found “non-compliance issues in Boeing’s manufacturing process control, parts handling and storage, and product control”, the agency said on March 4. REUTERS", "url": "https://www.straitstimes.com/world/united-states/boeing-discloses-names-of-737-max-employees-after-transport-safety-board-chair-faults-cooperation"}