{"authors": [], "date_download": "2024-10-12 14:16:22", "date_modify": "2024-10-12 14:16:22", "date_publish": "2022-03-13 17:24:07", "description": "The UN warns that already-record global food costs could surge another 22%. Read more at straitstimes.com.", "filename": "world_how-russias-invasion-of-ukraine-is-tearing-apart-the-global-food-system_1728742582.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/13/mi_russiainflation_130322.jpg?VersionId=1BCXpuad.gmC1NXIqfKk_dV9ngxD8meN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_how-russias-invasion-of-ukraine-is-tearing-apart-the-global-food-system_1728742582.html", "title": "How Russia's invasion of Ukraine is tearing apart the global food system", "title_page": "How Russia's invasion of Ukraine is tearing apart the global food system | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON (BLOOMBERG) - The global food system is under threat as Russia's invasion of Ukraine puts one of the world's major bread baskets in jeopardy.\nHere are the latest developments and their far-reaching impacts:\nFood inflation\nThe Ukraine war threatens staple crops from Europe's key grain-growing regions, which means escalating food prices that have already been plaguing consumers around the world could get worse, raising the threat of a full-blown hunger crisis. The United Nations warned that already-record global food costs could surge another 22 per cent as war stifles trade and slashes future harvests.\nGrains are the staples that feed the world, with wheat, corn and rice accounting for more than 40 per cent of all calories consumed.\nHigher shipping costs, energy inflation, extreme weather and labour shortages have made it harder to produce food. And supply is shrinking: grain stockpiles are poised for a fifth straight annual decline, according to the International Grains Council. The war in Ukraine stands to only push prices up further, sending hunger to unprecedented levels.\nGlobal food prices are at all-time highs, with a benchmark UN index soaring more than 40 per cent over the past two years. Food insecurity has doubled in that period, and 45 million people are estimated to be on the brink of famine. Agricultural markets are also soaring. Wheat hit an all-time record in Chicago last Tuesday (March 8). Corn and soybeans are trading near multiyear highs.\nFood protectionism\nGovernments are taking steps to keep food supplies closer to home, a move likely to prolong food inflation. Hungary, Indonesia and Argentina are among a cluster of countries that have imposed trade barriers on agricultural exports ranging from wheat to cooking oil in an attempt to suppress domestic prices and safeguard local food supplies after Russia's invasion led to widespread panic about shortages.\nRussia added to this spate of protectionism when it signalled plans to restrict trade of some raw materials. A major Ukraine food exporter, MHP SE, pivoted to supplying the Ukrainian army and civilians in bombed-out cities.\nTrade restrictions could cause international prices to rise even higher due to tightening global supplies, according to Mr Steve Mathews, head of strategy at Gro Intelligence. \"It adds greatly to the inflationary concerns,\" he said.\nOther global suppliers might take strides to fill stockpile shortfalls. India, for example, has increased wheat shipments in recent years and could boost exports to a record seven million tonnes if the conflict drags on.\nBut many nations that could typically offset shortages are themselves facing production problems. In Brazil, a major supplier of corn and soybeans, crippling drought has parched crops. Dry weather also wilted fields in Canada and parts of the United States last year. North American farmers could see current prices as a reason to plant more in the coming weeks, but it will be months before those acres get harvested.\nEverything that goes into growing food is getting pricier. Russia, a big supplier of every major type of crop nutrient, urged domestic fertiliser producers to cut exports earlier this month, stoking fears of shortages of crop inputs that are vital to growers.\nRussia's move adds uncertainty to the global market when farmers in Brazil - the world's largest fertiliser importer - are already having trouble getting nutrients for crops. Russian President Vladimir Putin said his country will supply fertilisers to nations that have \"friendly relations\" with Russia, though it first needs to guarantee fertiliser supplies for the domestic market.\nFertiliser prices have been soaring worldwide amid supply snags and production woes. In Europe, soaring prices for natural gas - a key input for the production of nitrogen fertilisers - has already forced some facilities to curtail production. The price of fuel, used by farmers to heat barns and run equipment used to produce food, is also skyrocketing. Adding to the stress are sanctions against Russia, a major energy supplier to the world, with the US and Britain moving to ban imports of Russian crude and other oil products.\n\"In the current high-priced environment, farmers will face difficulties paying for and/or acquiring the credit they need to purchase inputs,\" Mr Alexis Maxwell, an analyst for Bloomberg's Green Markets, said. \"Any scarcity risks curbing grain yields and quality, adding pressure to crop prices.\"\nBlack Sea supplies", "url": "https://www.straitstimes.com/world/how-russias-invasion-of-ukraine-is-tearing-apart-the-global-food-system"}