{"authors": [], "date_download": "2024-10-12 13:38:11", "date_modify": "2024-10-12 13:38:11", "date_publish": "2024-08-22 15:52:46", "description": "Ukraine is preparing to mark 33 years since its independence from the Soviet Union on Aug 24. Read more at straitstimes.com.", "filename": "world_us-embassy-warns-of-possible-russian-attacks-around-ukraines-independence-day_1728740291.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/22/LYNXMPEK7L06M-1.jpg?VersionId=ujhRF11yCgFbXsmIapPPWOv0X58fOxcY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_us-embassy-warns-of-possible-russian-attacks-around-ukraines-independence-day_1728740291.html", "title": "US embassy warns of possible Russian attacks around Ukraine’s Independence Day", "title_page": "US embassy warns of possible Russian attacks around Ukraine’s Independence Day | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - The US embassy in Kyiv said there was a heightened risk of Russian missile and drone attacks throughout Ukraine in the coming days as the country prepares to mark 33 years since its independence from the Soviet Union on Aug 24.\nUkraine’s top commander Oleksandr Syrskyi said earlier this week that Russia had launched 9,600 missiles and 14,000 drones during strikes on Ukraine since it launched its full-scale invasion in February 2022.\n“The US embassy in Kyiv assesses that during the next several days and through the weekend there is an increased risk of... Russian drone and missile attacks throughout Ukraine in connection with Ukraine’s Independence Day on Aug 24,” it said.\nThe statement was posted on the embassy’s website late on Aug 21.\nFor Ukrainians, Independence Day has taken on greater significance since Russia’s invasion, which has stirred patriotic feelings among many people.\nIn 2024, the date comes more than two weeks after Ukraine launched a surprise cross-border incursion into Russia’s Kursk region, even as Russian troops inch forward steadily in the east of Ukraine.\nRussian President Vladimir Putin has said Moscow will deliver a “worthy response” to the incursion which he has described as a major provocation. REUTERS", "url": "https://www.straitstimes.com/world/us-embassy-warns-of-possible-russian-attacks-around-ukraines-independence-day"}