{"authors": [], "date_download": "2024-10-12 13:39:26", "date_modify": "2024-10-12 13:39:26", "date_publish": "2024-08-10 07:38:18", "description": "The king thanked police and emergency services for their efforts to restore peace. Read more at straitstimes.com.", "filename": "world_europe_king-charles-calls-for-unity-and-understanding-after-riots-in-britain_1728740366.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/10/2024-08-09T094732Z1450839015RC2299A2SKXWRTRMADP3BRITAIN-RIOTS.JPG?VersionId=mumDBlMPmciLi4H.GPu_royG.B62SOf_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_king-charles-calls-for-unity-and-understanding-after-riots-in-britain_1728740366.html", "title": "King Charles calls for unity and understanding after riots in Britain", "title_page": "King Charles calls for unity and understanding after riots in Britain | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - King Charles called for mutual respect and understanding after racist riots that targeted Muslims and migrants in Britain, a Buckingham Palace spokesperson said on Aug 9, marking the first intervention by the monarch since the unrest began last week.\nThe king thanked police and emergency services for their efforts to restore peace and welcomed the way that community groups had countered “the aggression and criminality from a few”, the spokesperson said.\n“It remains His Majesty’s hope that shared values of mutual respect and understanding will continue to strengthen and unite the nation,” the spokesperson said after King Charles talked on the telephone with Prime Minister Keir Starmer and police chiefs.\nKing Charles set up a charity, the Princes Trust, in the 1970s which has helped a million young people to find work or create community projects, and it has continued to operate – including in locations hit by the riots – since his coronation.\nThousands of specialised police officers are due to remain on duty this weekend in case the rioting resumes after three days of calm.\nThe riots broke out after online posts falsely identified the suspected killer of three young girls in a knife attack on July 29 in Southport, north-west England, as an Islamist migrant.\nThe government is considering tougher regulations for social media companies.\nAfter days of rioting that targeted Muslims and hotels housing migrants, Mr Starmer said extra police numbers and swift justice had deterred people he referred to as “far-right thugs”.\nFor a third day in a row, anti-racist demonstrators far outnumbered anti-immigrant protesters in several locations.\n“I work with people of different origins and they have only been kind to me – we are all equals,” said Ms Emilia Finch, 22, speaking outside a hotel in Crawley, southern England, where asylum seekers are housed.\n“There is no reason why anyone should be treated any different for their skin colour.”\nMr Starmer said “significant sentences” issued on a fast-track basis by courts had been effective.\n“That is a very important part of the message to anybody who is thinking about getting involved in further disorder,” he told reporters during a visit to a police command centre in London.\nBy Aug 9 evening, 741 arrests had been made since the riots broke out and 302 people had been charged.\nTwo of those given sentences were jailed for stirring up racial hatred in messages on social media. Police said arrests would continue for months.\nThe National Police Chiefs' Council (NPCC) said more than 6,000 public order-trained officers would be on duty over the weekend.\n“It’s probably one of the strongest national policing responses that we’ve ever done, certainly in my career history,” said Mr Gavin Stephens, the NPCC’s chairman.\nWhile police said it was not clear how many, if any, anti-migrant demonstrations might be held, about 40 counterprotests were due to take place on Aug 10, according to a group called Stand Up To Racism.\nTurning point?\nMr Stephens said tough action and the strong message by communities against the riots represented “potentially the start of a turning point”.\nThe first soccer matches of the season this weekend could pose problems, although there was no specific intelligence about such risks.\nCharges have also been brought against some people involved in counterprotests.\nA local councillor who was suspended by Mr Starmer’s Labour Party after footage emerged of him calling for people to cut the throats of “disgusting Nazi fascists” was charged with encouraging violent disorder.\nCabinet Office minister Nick Thomas-Symonds told Sky News the government would revisit the framework of legislation that regulates the responsibilities of social media companies regarding content inciting violence or hate.\n\"We stand ready to make changes if necessary,\" he said of the Online Safety Act, passed in October but not due to come into effect until 2025 due to a consultation process. REUTERS", "url": "https://www.straitstimes.com/world/europe/king-charles-calls-for-unity-and-understanding-after-riots-in-britain"}