{"authors": [], "date_download": "2024-10-12 13:57:57", "date_modify": "2024-10-12 13:57:57", "date_publish": "2023-04-03 20:36:00", "description": "A race against time to preserve crucial ice records. Read more at straitstimes.com.", "filename": "world_europe_arctic-scientists-race-to-preserve-ice-memory_1728741477.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/05/FILES-ARCTIC-SVALBARD-SCIENCE-ENVIRONMENT-CLIMATE-113158.jpg?VersionId=rdSAX5G3Lgf68RMJ3QLBbVLEHeRfTXXV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_arctic-scientists-race-to-preserve-ice-memory_1728741477.html", "title": "Arctic scientists race to preserve 'ice memory'", "title_page": "Arctic scientists race to preserve 'ice memory' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Arctic scientists are set to start drilling to save samples of ancient ice for analysis before the frozen layers melt away due to climate change, mission organisers said on Monday.\nItalian, French and Norwegian researchers have set up camp in Norway’s Svalbard archipelago in what they called a race against time to preserve crucial ice records for analysing past environmental conditions.\nThey will extract ice in a series of tubes from as far as 125m below the surface, containing frozen geochemical traces dating back three centuries.\nAnalysis of chemicals in deep “ice cores” provides scientists with valuable data about past environmental conditions.\nBut experts warn that water from melting ice is leaking down and altering the geochemical records preserved in ancient ice beneath.\nPresident of the Ice Memory foundation, Mr Jerome Chappellaz, who is also running the operation, told AFP that ice scientists “are seeing their primary material disappear forever from the surface of the planet”.\n“It is our responsibility as glaciologists of this generation to make sure a bit of it is preserved,” he said.\nHuman-caused carbon emissions have warmed the planet by 1.1 deg C since the 19th century. Studies indicate that the Arctic is warming between two and four times faster than the global average.\nOne set of ice tubes will be used for immediate analysis while a second set will be sent to Antarctica for storage in an “ice memory sanctuary” under the snow, where the samples will be preserved for future generations of scientists.\nThe eight specialists on the mission have set up camp at an altitude of 1,100m on the crevasse-ridden Holtedahlfonna ice field and plan to start drilling on Tuesday, Ice Memory said.\nThey will work for three weeks in temperatures as low as minus 25 deg C, cutting and pulling out a series of cylinders of ice, each one meter long and 10cm wide.\nThe €700,000 (S$1 million) mission, partly funded by the Italian research ministry, follows a series of earlier ice core extractions by the foundation, including operations in the Alps and the Andes. AFP", "url": "https://www.straitstimes.com/world/europe/arctic-scientists-race-to-preserve-ice-memory"}