{"authors": [], "date_download": "2024-10-12 13:47:18", "date_modify": "2024-10-12 13:47:18", "date_publish": "2024-03-22 17:08:36", "description": "Spain’s Mediterranean region of Catalonia, which includes Barcelona, is enduring its worst drought on record. Read more at straitstimes.com.", "filename": "world_europe_ahead-of-easter-rush-officials-say-drought-must-not-put-off-barcelona-tourists_1728740838.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/22/LYNXNPEK2L09L-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ahead-of-easter-rush-officials-say-drought-must-not-put-off-barcelona-tourists_1728740838.html", "title": "Ahead of Easter rush, officials say drought must not put off Barcelona tourists", "title_page": "Ahead of Easter rush, officials say drought must not put off Barcelona tourists | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BARCELONA – Tourists arriving at Barcelona’s airport or gazing at its iconic Sagrada Familia Basilica this Easter holiday will see large signs in English that read: “Drought alert. During your stay, save water”.\nAs the impact of climate change intensifies across southern Europe, Spain’s Mediterranean region of Catalonia, which includes Barcelona, is enduring its worst drought on record.\nReservoir levels are around only 15 per cent of their capacity, prompting curbs on water use by residents, visitors, agriculture and industry.\nBeach showers are shut and swimming pools cannot be filled with tap water, among other restrictions.\nCatalan officials have appealed for tourists to act responsibly, but are also adamant the drought should not put them off from coming to the Spanish city and region most visited by foreigners, where tourism accounts for 14.5 per cent of the local economy.\n“The message from Catalonia’s tourism agency and business department to campsites and hotels is one of calm: (People) can enjoy their holidays here as usual,” said Mr David Mascort, the regional government’s environmental chief.\nBarcelona’s hotel association warned in February that the city could not afford to project an image abroad of hotels with empty pools.\nHotels’ lobbying prompted the authorities to relax a total ban on filling pools, allowing desalinated water to be used instead.\n“Tourists are not scared by the drought and are not aware of it (before arriving),” said hotel association director Manel Casals.\n“If we are not careful, the image of Barcelona will be impacted (by the drought restrictions) but we are not aware of any negative impact so far. Tourists are still coming.”\nTourists visiting Catalan architect Antoni Gaudi’s Sagrada Familia confirmed they had known nothing of the water restrictions before seeing the billboards.\n“Of course, tourists can expend less water if they are aware of the situation,” Finnish traveller Johan Saltin said.\nBarcelona’s hotels have halved their water use since 2016, according to a recent hotel association study, though five-star hotels still used the most – 242 litres of water per day on average in 2022 – and all hotels represented 9 per cent of the city’s consumption.\nCurrent water restrictions order residents to use 200 litres only per day.\nTourism over-saturation is prompting protests by some Barcelona residents, and the drought may exacerbate the issue.\nEnvironmental activists held a protest on March 20 at Barcelona’s tourism agency, demanding restrictions for the sector, holding signs that read: “Let’s close the tap to tourism” and “Rivers and aquifers without water, hotels’ pools full”.\n“With the situation we are living, it is indecent that the concern is to (avoid) sending an image of alarm to tourists, when the real problem we have is that our territory is drying up,” said protester Josep Sabate. REUTERS", "url": "https://www.straitstimes.com/world/europe/ahead-of-easter-rush-officials-say-drought-must-not-put-off-barcelona-tourists"}