{"authors": [], "date_download": "2024-10-12 13:39:07", "date_modify": "2024-10-12 13:39:07", "date_publish": "2024-09-19 15:47:16", "description": "ATHENS - When a wildfire tore down a hillside towards Athens last month, its southernmost flank halted in a treeless area burned by fire two years before. A few miles west, however, the blaze found fresh fuel: woods and scrub that offered a path towards the city's suburbs. Read more at straitstimes.com.", "filename": "world_europe_as-wildfires-wipe-out-forests-greeks-debate-to-replant-or-not_1728740347.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/19/LYNXMPEK8I0KH-1.jpg?VersionId=S823.fTOAygrIRWfSK2jPZMuQKlpdBOV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_as-wildfires-wipe-out-forests-greeks-debate-to-replant-or-not_1728740347.html", "title": "As wildfires wipe out forests, Greeks debate: to replant, or not?", "title_page": "As wildfires wipe out forests, Greeks debate: to replant, or not? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ATHENS - When a wildfire tore down a hillside towards Athens last month, its southernmost flank halted in a treeless area burned by fire two years before. A few miles west, however, the blaze found fresh fuel: woods and scrub that offered a path towards the city's suburbs.\nIn its way stood the leafy village of Penteli, where Marlena Kaloudi has lived since the 1970s. The fire swept through her house. But what hurt most when she returned was the sight of her pine trees, some over 100 years old, charred to an autumnal brown.\n\"The biggest disaster...is not our house - this can be restored,\" said Kaloudi, sitting by her gutted back deck. \"It's those trees that were here before us and we hoped and prayed would be here after us.\"\nThe devastation is a familiar sight in Greece and across the Mediterranean region where fires have become more frequent and fierce, driven by higher temperatures and drier conditions that scientists link to climate change.\nIn the Attica region surrounding Athens, blazes have destroyed 37% of its forests and grasslands since 2017, according to data released in August by the National Observatory of Athens, a government-funded research centre. More than 60% of broad-leafed forest and 41% of coniferous forest has been burned and has not fully regrown.\nThe loss raises the risk of flash floods from rains on denuded grounds no longer protected by tree canopies and root systems, as well as higher air temperatures caused by the heating of unshaded ground, desertification and poorer air quality, four experts said.\nIt has also ignited a debate about what the government response should be: continue with a program of replanting trees that could provide fuel for future fires, or, as some scientists urge, look for new ways to adapt.\nFor Kaloudi, it's an obvious choice. After the last fire, which went on to smother the city's northern suburbs, her neighbours asked her to cut down the remaining trees in her garden. She refused.\n\"The loss of this forest terrifies me,\" she said. \"What scares me is the fact that there are people who want to cut the trees that are left.\"\nPLANT MORE TREES?\nWildfires have drastically altered Attica's landscape, satellite images show. Hillsides, forested a few years ago, have become bald and rocky. Areas where forests do resprout are often reburned. Bird song has vanished with the trees.\nData from Global Forest Watch, an initiative that uses satellites to track deforestation, shows that of all the fire-related forest loss in Attica since 2000, 74% has occurred since 2017.\nGreece is not alone. The U.N.'s Intergovernmental Panel on Climate Change (IPCC) has highlighted the Mediterranean region as a 'global climate hotspot', with an increase in surface temperatures of 1.5C from pre-industrial levels already driving an increased risk of wildfires and drought.\nWildfires are also a growing threat in the United States, Canada, Australia, and even the rainy United Kingdom. With that threat has come a debate about what to do with a forest once it has burned.\nSome want to replant trees to restore root systems and to recover lost carbon sinks. Others say forests and fire zones do not mix.\nSo far, there is no clear evidence of which side is correct, and local factors determine what is best, the four experts said. Still, some say a rethink is needed, especially in areas where the same areas are being repeatedly burned.\n\"There is no great consensus on what to do,\" said Camille Stevens-Rumann, associate professor of fire ecology at Colorado State University. \"People often want places to look like how they did before, but that might not be suitable in a new fire regime.\"\nGreece wants its forests back. With the help of 450 million euros from the EU, the government has adopted a national fire prevention plan that also includes planting 1 million trees in Attica.\n\"The increase of greenery and its preservation is not only a goal of the government but of the entire European Union,\" said Efstathios Stathopoulos, Greece's General Secretary of Forestry.\nThe EU has a plan to replant 3 billion trees across the bloc by 2030, although the plan is not focused on replanting after fires.\nNot everyone thinks resowing forests after fires works.\nTheodore Giannaros, a fire meteorologist at the National Observatory of Athens, surveilled a hillside outside Athens blackened by last month's fire.\nNext year, he said, the ground there, already baking in summer, will be even hotter for the lack of shade. The loss of tree root systems will make the soil looser, increasing the risk of floods or landslides, he said. There will be more dust.\nLess flammable vegetation like some kinds of grasses or agricultural land is the answer, not trees, he said.\n\"We have to seriously focus on how to restore the landscape, not just planting trees and forests, but in a way that will be...more resilient against natural disasters.\"\nFernando Pulido, professor of forestry science at the University of Extremadura in Spain, recommended planting crops or creating other barriers between dense forests in the Mediterranean region.\n\"This involves a change in mentality ... but it's the only way to guarantee that there won't be another fire at the same place after eight or 10 years,\" he said.\nTHE FALLOUT\nMeanwhile, areas previously unaffected by fires are being hit.\nThodoris Arvanitis has been an organic farmer on a 100-acre plot in a wooded area north of Athens for 35 years. He had a school for aspiring farmers, living quarters for workers, and rows of polytunnels for his fruit and vegetables.\nLast month, most of what he built - up to 1 million euros of equipment and crops - was burned by the fire. Now, the sheet metal of a gutted farmhouse clatters in the wind. A line of newly planted fig trees is obliterated; piles of charred potatoes have been left to rot.\nNot all the crops were lost, and Arvanitis plans to rebuild. On a recent afternoon, staff bagged up aubergines, french beans and melons for delivery to customers.\nBut he struggled to contain his emotions when he talked about the blaze, which was carried towards his house on the surrounding trees. With no support from the fire brigade, he relied on other residents to help that day.\n\"We were putting out fires here and there. But new ones kept breaking out. At some point we couldn't do anything more. The fire was right outside our farm.\" REUTERS", "url": "https://www.straitstimes.com/world/europe/as-wildfires-wipe-out-forests-greeks-debate-to-replant-or-not"}