{"authors": [], "date_download": "2024-10-12 14:06:43", "date_modify": "2024-10-12 14:06:43", "date_publish": "2022-04-13 22:04:08", "description": "Move signals shift in security perspectives since Russia's invasion of Ukraine. Read more at straitstimes.com.", "filename": "world_europe_finland-to-make-decision-on-nato-entry-in-coming-weeks-not-months_1728742003.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/13/mi_sannamarin_130422.jpg?VersionId=R44k78d58xeFfFrB2Ze0Eh6rByhFVDvs&h=09b2944e", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_finland-to-make-decision-on-nato-entry-in-coming-weeks-not-months_1728742003.html", "title": "Finland to make decision on Nato entry in coming weeks, not months", "title_page": "Finland to make decision on Nato entry in coming weeks, not months | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "STOCKHOLM/HELSINKI (REUTERS) - Finland will make a decision about whether to apply to join the US-led Nato alliance in the next few weeks, Prime Minister Sanna Marin said on Wednesday (April 13), underlining a shift in security perspectives since Russia's invasion of Ukraine.\nFinland and fellow Nordic state and neighbour Sweden are close partners with Nato but have shied away from joining the 30-member alliance, founded in 1949 to counter the Soviet Union during the Cold War.\n\"We have to be prepared for all kinds of actions from Russia,\" Ms Marin told reporters at a joint news conference in Stockholm with her Swedish counterpart.\nShe said the option to join Nato had to be carefully analysed but that everything had changed when Russian forces invaded Ukraine in late February.\n\"The difference between being a partner and being a member is very clear and will remain so. There is no other way to have security guarantees than under Nato's deterrence and common defence as guaranteed by Nato's Article 5,\" she said.\n\"I won't give any kind of timetable when we will make our decisions, but I think it will happen quite fast - within weeks, not within months,\" said Ms Marin, whose country shares a 1,300km-long border with Russia to the east.\nShe said it was important to reach consensus in Finland, which fought Soviet invaders during World War II and has been militarily non-aligned since then, and that political parties would have internal talks and in Parliament in the coming weeks.\nPublic opinion in Finland has taken a U-turn on Nato, with the most recent poll by private broadcaster MTV showing 68 per cent of respondents in favour of joining, with only 12 per cent against.\n\"Yeah, I used to be against joining Nato. But today I think it's a reasonable choice,\" Mr Ville Pohjonen, chief creative officer for a media firm, told Reuters in Helsinki.\nStudent Antti Laulaja said: \"Yes, definitely, I think Russia has shown its true face, so I think we should join Nato.\"\nA Finnish government White Paper update of its foreign and security policy, published on Wednesday, said Russia's invasion had profoundly changed the security situation, but made no recommendation regarding joining Nato.\nFinland and Sweden, which is also reviewing its security policy with conclusions expected towards the end of May, both take part in Nato exercises and crisis management initiatives as well as exchange intelligence with the alliance.\nBut until recently, the two Nordic neighbours felt peace was best kept by not publicly choosing sides.", "url": "https://www.straitstimes.com/world/europe/finland-to-make-decision-on-nato-entry-in-coming-weeks-not-months"}