{"authors": [], "date_download": "2024-10-12 14:04:50", "date_modify": "2024-10-12 14:04:50", "date_publish": "2023-07-28 04:49:33", "description": "“Our relations are strong,” Ms Meloni told Mr Biden in the Oval Office. Read more at straitstimes.com.", "filename": "world_united-states_china-tops-agenda-as-biden-meets-italys-meloni-in-washington_1728741890.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/28/10772306.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_china-tops-agenda-as-biden-meets-italys-meloni-in-washington_1728741890.html", "title": "China tops agenda as Biden meets Italy's Meloni in Washington", "title_page": "China tops agenda as Biden meets Italy's Meloni in Washington | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON/ROME - US President Joe Biden met Italian Prime Minister Giorgia Meloni at the White House on Thursday, vowing to deepen economic ties and strengthen cooperation on challenges posed by China, but skirted differences over LGTBQ rights.\nItaly’s first woman prime minister came to power last October and is staking out an assertive role abroad as she plans the upcoming Italian presidency of the Group of 7 (G-7) nations in 2024.\nMs Meloni and her right-wing coalition have staked out positions on abortion and LGBTQ rights sharply at odds with those of Mr Biden, a Democrat who used last year’s Italian election results as an occasion to warn fellow liberals about dangers facing the world’s democracies.\nOn Thursday, Mr Biden welcomed Ms Meloni and said they had “become friends”.\nMs Meloni later told reporters that she had a clear preference for Republicans, but that would not stop her from having “a great relationship” with Mr Biden.\nShe said the two leaders discussed Italy’s participation in China’s Belt and Road Initiative (BRI), but Washington’s approach was not to dictate Italy’s policy on China. No one asked her about LGBTQ rights, she said.\n“Our relations are strong,” Ms Meloni said at the start of the Oval Office meeting with Mr Biden. “They cross governments and remain solid regardless of their political colours. We know who our friends are in times that are tough.”\nMs Meloni also used her first trip to Washington to spend some time on Capitol Hill, where her meetings included a visit with Republican House of Representatives Speaker Kevin McCarthy, who previously has said he could consider an impeachment inquiry into Mr Biden.\nRome and Washington both emphasised the trip as an opportunity to reaffirm a strong partnership between the countries, including over the billions of dollars in military and other aid the West has provided Ukraine in its grinding war against Russia since 2022.\nDuring a small portion of the meeting open to reporters, Mr Biden complimented Italy on its strong stance in Ukraine and Ms Meloni said she was proud that Italy defended international law in supporting Ukraine.\nWashington hopes that the West’s alliance against Russia’s Ukraine invasion will help deter China from changing the status quo in Taiwan and the broader Pacific.\nMs Meloni faces a decision over whether to maintain Italy’s membership in Beijing’s Belt and Road Initiative (BRI) infrastructure plan, a programme that Washington has been working to counter.\nItaly in 2019 became the first and so far only G-7 nation to join China’s major infrastructure initiative, with critics saying the partnership would enable China to gain control of sensitive technologies and vital infrastructure.\nItaly is seen as highly unlikely to renew the deal with China when it expires in March 2024, and Ms Meloni said in May it was possible to have good relations with Beijing without being part of the pact.\nThe G-7 formally launched an alternative to Belt and Road, the Partnership for Global Infrastructure and Investment, last year. The countries said in May at their last leaders’ summit in Japan, that they were trying to “reduce excessive dependencies” on other countries but “not decoupling or turning inwards.”\nThe Biden-Meloni meeting takes place less than a week after she hosted an international conference on migration in Rome, as Italy tries to cope with a high volume of migrants arriving by boat from North Africa.\nItaly was planning to discuss with the US how to support the development and stability of Africa, Ms Meloni’s office said, which will also be among the main topics of Italy’s G-7 presidency. REUTERS", "url": "https://www.straitstimes.com/world/united-states/china-tops-agenda-as-biden-meets-italys-meloni-in-washington"}