{"authors": [], "date_download": "2024-10-12 13:29:23", "date_modify": "2024-10-12 13:29:23", "date_publish": "2024-09-30 22:55:33", "description": "MAAYSRAH, Lebanon - The Amro family household in Lebanon's lush Keserwan mountains had become a refuge for families who wanted to stay outside the line of fire of creeping war in the country's south. Read more at straitstimes.com.", "filename": "world_middle-east_deadly-israeli-strikes-hit-lebanons-war-displaced_1728739763.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/30/LYNXMPEK8T0JK-1.jpg?VersionId=NRbo_QiEkTRmD5fuoh6fH501FaJud9dy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_deadly-israeli-strikes-hit-lebanons-war-displaced_1728739763.html", "title": "Deadly Israeli strikes hit Lebanon's war displaced", "title_page": "Deadly Israeli strikes hit Lebanon's war displaced | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MAAYSRAH, Lebanon - The Amro family household in Lebanon's lush Keserwan mountains had become a refuge for families who wanted to stay outside the line of fire of creeping war in the country's south.\nBy Sept. 25, more than 50 people from three families had gathered in two buildings at the centre of Maaysrah, a Shi'ite Muslim village in the heart of the Christian mountains never attacked by Israel throughout its wars with Lebanon and therefore thought to be safe.\nOn that day, just after 11 a.m., Israeli warplanes struck the location, killing 16 people - two men and 14 women and children - according to family members, local officials and medical sources.\nMore than 30 people were wounded, about half of them children.\nThe buildings included the residence of a Hezbollah fighter who was killed in battle in August, and a former fighter who had lost a leg in battle was there at the time, but no active combatants were present, local officials said.\nThe attack is part of a broader pattern of Israeli airstrikes that have resulted in growing civilian casualties amid an expanding scope of operations, according to Lebanese health ministry figures.\nOfficials close to Hezbollah claim these attacks amount to collective punishment aimed at turning the group's Shi'ite Muslim support base against them.\nResponding to inquiries, the Israeli military said in a statement it operates \"in strict accordance with international law [and] takes all feasible precautions in order to mitigate harm to civilians\".\nIt said that Hezbollah embeds military infrastructure in civilian areas and that Israel attempts to evacuate civilians before attacks. The statement did not specifically address the Maaysrah strike.\nHezbollah denies placing rockets in civilian areas.\nRecent strikes have resulted in high civilian casualties, including one on Ain Delb near southern Sidon on Sunday that killed 45 people, many of whom were displaced from other areas, according to the Lebanese health ministry and local officials.\nIsraeli strikes across Lebanon have killed more than 1,640 people in just under a year of fighting, the majority in the past two weeks, including 104 children and 194 women, according to government figures.\nAbout 50 Israel soldiers and civilians have been killed in the same time in Israel, according to Israeli officials.\nLebanon does not provide a breakdown of civilians and combatants.\nFIRE AND SCREAMING\nMany of those gathered in Maaysrah had fled months back, leaving the southern bordertown of Houla to stay with their relatives amid an expansion of the second front opened by Hezbollah against Israel on Oct. 8, the day after the Hamas attack that triggered the Gaza war.\nOthers had arrived in the hours before the attack, fleeing areas where they had first sought refuge as the conflict turned to war and Israel struck Lebanon with an unprecedented ferocity.\nAli Koteich was in fitful sleep in one of the rooms when he heard a whistle and felt a huge blast.\n\"I got up and opened the door and there was nothing anymore, the walls were on the floor and there was fire and people and screaming,\" the teenager, who sought refuge there months back, told Reuters.\n\"There were more than 12 kids, and we started to remove pieces, some other pieces, some were whole, some had parts missing. Some burned,\" he said at Maritime Hospital in coastal Jbeil where relatives were being treated.\nHis grandmother and niece died, his parents and siblings were wounded.\nMaaysrah Mayor Zuhair Amro said the buildings with six apartments included the residence of Ali Amro, the Hezbollah fighter killed in Houla in August.\nTuesday's strike killed his widow and two of his young children, Zuhair Amro said.\n\"The aim is to wipe the family off of the civil registry,\" he said, denying Hezbollah had any military infrastructure that posed a threat to Israel in the area. \"They want to destroy families like they did in Gaza,\" he said.\nIsrael did not comment on this assertion.\nWORST SCENARIO\nIn the paediatrics section of the Jbeil hospital, 4-year-old Qassem Hussein lay in a bed with cuts and burns on his arms and face and a fractured thigh.\nHe will need surgery, doctors said. His father was killed. His mother was in the intensive care unit.\n\"I have no words,\" said an aunt sitting by his side, hard eyes trained on the child. \"We can't take this anymore.\"\nSeveral people remain in critical condition, including an 11-year-old child \"who arrived with his brain coming out of his head,\" doctor Dany Kattar said.\n\"It's the worst scenario I saw in my life... I saw tears in the eyes of my staff,\" Kattar said. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/deadly-israeli-strikes-hit-lebanons-war-displaced"}