{"authors": [], "date_download": "2024-10-12 13:59:19", "date_modify": "2024-10-12 13:59:19", "date_publish": "2023-12-16 23:48:05", "description": "Angelo Becciu was one of 10 accused of crimes including fraud, abuse of office and money laundering. Read more at straitstimes.com.", "filename": "world_europe_vatican-court-convicts-cardinal-of-embezzlement-in-corruption-trial_1728741559.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/17/FILES-VATICAN-TRIAL-JUSTICE-PROPERTY-BRITAIN-154513.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_vatican-court-convicts-cardinal-of-embezzlement-in-corruption-trial_1728741559.html", "title": "Senior cardinal convicted of embezzlement in Vatican corruption trial", "title_page": "Senior cardinal convicted of embezzlement in Vatican corruption trial | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VATICAN CITY - Cardinal Angelo Becciu, the most senior Catholic Church official ever to stand trial before a Vatican criminal court, was convicted on Dec 16 of embezzlement and sentenced to 5½ years in jail.\nThe Italian prelate’s lawyer, Mr Fabio Viglione, told reporters in the courtroom that he would appeal, saying his client was innocent.\nBecciu, who lives at the Vatican, was expected to remain free for the time being.\nIn all, 10 defendants were accused of crimes including fraud, abuse of office and money laundering.\nAll had denied wrongdoing.\nIt took court president Giuseppe Pignatone 25 minutes to read out all the verdicts and sentences.\nBecciu, like most of the other defendants, was convicted on some counts and acquitted of others.\nOnly one was acquitted of all charges.\nThe trial, which exposed infighting and intrigue in the highest echelons of the Vatican, lasted for 86 sessions over 2½ years.\nIt revolved mostly around the messy purchase of a building in London by the Secretariat of State, the Vatican’s key administrative and diplomatic department.\nBecciu held the No. 2 position there in 2014, when it began investing in a fund managed by Italian financier Raffaele Mincione, securing about 45 per cent of the building at 60 Sloane Avenue, in an upmarket district.\nMincione was also found guilty of embezzlement and given the same sentence as Becciu.\nIn 2018, with Becciu in another Vatican job, the Secretariat of State felt it was being deceived by Mincione and turned to another financier, Gianluigi Torzi, for help in squeezing Mincione out and buying the rest of the building.\nTorzi also fleeced the Vatican, according to prosecutors. He was found guilty of fraud and extortion and sentenced to six years’ jail.\nThe Vatican sold the building in 2022 under a cloud of embarrassment, taking an estimated loss of about €140 million (S$203 million).\nBecciu, who was fired by Pope Francis from his next job in 2020 for alleged nepotism, but remains a cardinal, was also found guilty of one count of embezzlement for funnelling money and contracts to companies or charities controlled by his brothers on their native island of Sardinia.\nAnother accusation involved his hiring of Cecilia Marogna, a self-styled security analyst, also from Sardinia, as part of a secret project to help win freedom for a nun who had been kidnapped in Mali.\nMarogna, 46, received €575,000 from the Secretariat of State from 2018 to 2019. The money was sent to a company she had set up in Slovenia, and she received some in cash, prosecutors told the court.\nItalian police said Marogna spent much of the money on luxury clothing and health spas. Both she and Becciu were found guilty of charges related to the transfer of money.\nThe other six defendants included the former president and director of the Vatican’s Financial Intelligence unit, the cardinal’s former secretary, Father Mauro Carlino, and three former Vatican employees. REUTERS", "url": "https://www.straitstimes.com/world/europe/vatican-court-convicts-cardinal-of-embezzlement-in-corruption-trial"}