{"authors": [], "date_download": "2024-10-12 13:40:11", "date_modify": "2024-10-12 13:40:11", "date_publish": "2024-04-09 00:44:36", "description": "The gelatinous creatures thrive in harsh conditions and need little oxygen. Read more at straitstimes.com.", "filename": "world_jellyfish-invade-venezuelan-waters-worrying-fishermen_1728740411.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/09/btjelly20240408.jpg?VersionId=K2b1c4USgcWBQu5dJyC3RSdSJUhRy_Kf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_jellyfish-invade-venezuelan-waters-worrying-fishermen_1728740411.html", "title": "Jellyfish invade Venezuelan waters, worrying fishermen", "title_page": "Jellyfish invade Venezuelan waters, worrying fishermen | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CHORONI - A thick bloom of varying hues drifts in the turquoise waters of Aragua in Venezuela, a surreal vision attributed to climate change that has decimated fishing stocks.\n“It is like there are flowers in the sea. This has never happened before,” said Elvis Morillo, 59, a fisherman in the northern village of Chuao, where verdant mountains hug the Caribbean coast.\nThe invasive cannonball jellyfish is filling fishermen’s nets, in a surge the environment ministry attributes to warming waters from climate change and a decline in jellyfish predators such as sharks and sea turtles.\nAt the same time, “sardines and other species that serve as fishing bait have disappeared. Fishing is at its lowest level in years,” said Gustavo Carrasquel, of the NGO Azul Ambientalistas, who lives in Choroni, a town neighboring Chuao.\nGlobally, jellyfish populations have soared. Researchers have warned of a tipping point in which the oceans could go from being dominated by fish populations, to jellyfish – mostly as a result of overfishing.\nThe gelatinous creatures, which do not have a heart, brain or complex organs, thrive in harsh conditions and need little oxygen.\nThis is an “atypical event, completely abnormal,” said Joxmer Scott-Frias, a researcher at the Institute of Zoology and Tropical Ecology at the Central University of Venezuela.\n“A few individuals had been observed in recent years, but the increase in the population this year exceeded previous estimates,” he said while collecting samples of the jellyfish for study.\nScott-Frias said the reasons for the surge were not yet clear.\nThe jellyfish bloom and the presence of the invasive coral Unomia stolonifera, which smothers native corals, have become a headache for local fishermen.\n“It has been almost nine months without fish production,” said Fernando Mayora, head of the fishermen’s council in Choroni.\n“With the problem of jellyfish and invasive corals, we don’t know what to do. The fish have disappeared,” he said.\nIn Chuao, fishermen who would bring in between 3,000 and 5,000 kilograms a week have seen their yields drop to between 500 and 1,000 kilograms, said Douglas Martinez, 44, a fisherman.\nMayora said that Venezuela should draw inspiration from countries such as Mexico, which exploits jellyfish commercially, exporting it to Asian countries where it is used in gastronomy or the pharmaceutical industry.\n“We need to know if we can take advantage of this in Venezuela,” he said. AFP", "url": "https://www.straitstimes.com/world/jellyfish-invade-venezuelan-waters-worrying-fishermen"}