{"authors": [], "date_download": "2024-10-12 13:38:55", "date_modify": "2024-10-12 13:38:55", "date_publish": "2024-07-10 20:25:47", "description": "Defence Minister Gallant said the military was “determined” to meet its goals of eradicating Hamas. Read more at straitstimes.com.", "filename": "world_middle-east_israel-defence-minister-important-to-seize-chance-for-gaza-deal_1728740335.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/10/2024-07-10T140933Z1356646292RC2DS8AV1NHTRTRMADP3ISRAEL-PALESTINIANS.JPG?VersionId=g7KNIObdrMV9GTdq9jAF2F7NzrlRRF3k", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israel-defence-minister-important-to-seize-chance-for-gaza-deal_1728740335.html", "title": "Israel Defence Minister says ‘60 per cent’ of Hamas dead or wounded", "title_page": "Israel Defence Minister says ‘60 per cent’ of Hamas dead or wounded | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - Israel’s Defence Minister Yoav Gallant said on July 10 that 60 per cent of Hamas fighters had been “eliminated or wounded” in the Gaza war since the militant group’s Oct 7 attacks.\nIn a statement to Parliament on the first nine months of the conflict, Mr Gallant said that the military was “determined” to meet its goals of eradicating Hamas and bringing all hostages back from Gaza.\nThe minister praised Israeli soldiers for “performing their work with dedication, sacrifice and success” and said “the achievements are many”.\nIsrael has launched major new offensives in Gaza City in the north and around Rafah and Khan Younis in the south, even as it embarks on contacts with international mediators on conditions for negotiating a truce with Hamas.\n“We have eliminated or wounded 60 per cent of the Hamas terrorists” and “dismantled” most of the Palestinian group’s 24 battalions, Mr Gallant said.\nThe minister did not give figures for the casualties and the Israeli military said it did not immediately have statistics.\nThe Israeli prime minister’s office said on July 10 that “14,000 terrorists have been eliminated” since the beginning of the war.\nIsrael’s army chief, Lieutenant-General Herzi Halevi, told soldiers in central Gaza on July 9 that the Israeli strategy was to “apply military pressure in various ways”.\n“In the end, we go on missions to destroy as much infrastructure as possible, to eliminate as many Hamas operatives as possible, to eliminate as many commanders as possible,” Lt-Gen Halevi said, in a speech shared by the army on Telegram on July 10.\n“In the end, it reduces Hamas’ capabilities,” he added.\nThe Oct 7 attack on southern Israel resulted in the deaths of 1,195 people, mostly civilians, according to an AFP tally based on Israeli figures.\nThe militants also seized 251 hostages, 116 of whom remain in Gaza, including 42 the military says are dead.\nIsrael’s military retaliation has killed at least 38,295 people in Gaza, also mostly civilians, according to figures from the Hamas-run territory’s Health Ministry.\nWhile many countries expressed solidarity with Israel after the Oct 7 attacks, the government has since faced a wave of criticism for its handling of the war, which has devastated Gaza.\nMr Gallant insisted Israel would stick to its aims.\n“We have returned half of the hostages and we are determined to return the rest,” he said.\n“The security establishment, and myself heading it, are determined to achieve the goals of the war and complete them.” AFP", "url": "https://www.straitstimes.com/world/middle-east/israel-defence-minister-important-to-seize-chance-for-gaza-deal"}