{"authors": [], "date_download": "2024-10-12 13:39:06", "date_modify": "2024-10-12 13:39:06", "date_publish": "2024-09-20 08:37:12", "description": "LIMA - Peruvian authorities scrambled to roll out a plan to fight fires raging out of control across the nation, razing crops, damaging archaeological treasures and leaving several regions in a state of disaster on Thursday. Read more at straitstimes.com.", "filename": "world_fires-burn-out-of-control-in-peru-hitting-crops-and-archaeological-sites_1728740346.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/ST-logo-placeholder_0.jpg?VersionId=OccDx24QU94RFfIrO2egUFaqw_Di3Dcb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_fires-burn-out-of-control-in-peru-hitting-crops-and-archaeological-sites_1728740346.html", "title": "Fires burn out of control in Peru, hitting crops and archaeological sites", "title_page": "Fires burn out of control in Peru, hitting crops and archaeological sites | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LIMA - Peruvian authorities scrambled to roll out a plan to fight fires raging out of control across the nation, razing crops, damaging archaeological treasures and leaving several regions in a state of disaster on Thursday.\nFirefighters said battling the blazes has grown increasingly difficult.\n\"We're tired,\" said a volunteer firefighter in the forests of the northern Amazonas region who declined to give his name. \"We put the fire out, it lights back up. We put it out, the fire breaks out again.\"\nFirefighters in the area retreated from the flames on Thursday.\n\"They're out of control,\" said Arturo Morales, another volunteer firefighter. \"We need help.\"\nPresident Dina Boluarte on Wednesday declared a 60-day state of emergency in the San Martin, Amazonas and Ucayali regions, allocating extra resources to stop the fires from spreading.\n\"We're rolling out everything we have,\" Boluarte said in a speech. She called on farmers to stop burning grasslands, which she said caused flames to spread out of control.\nForest fires in Peru are frequent from August to November, either caused by farmers or those who are looking to illegally take over land, according to the government.\nAround 240 fires have broken out this season in 22 of the country's 25 regions, though more than 80% had been controlled by Wednesday.\nSome, however, are threatening to spark up again with dry weather, winds and their remote locations making them difficult to access.\nThe flames have already reached seven archaeological sites, according to the culture ministry, and are threatening the Indigenous Shipibo-Konibo community in the Amazon.\nIn total, nearly 2,300 hectares (5,680 acres) of farmland have burned and 140 people have been injured, according to official data through Wednesday.\nSouth America is currently being ravaged by fire from Brazil's Amazon rainforest through the world's largest wetlands to dry forests in Bolivia, breaking a previous record for the number of blazes seen in a year. REUTERS", "url": "https://www.straitstimes.com/world/fires-burn-out-of-control-in-peru-hitting-crops-and-archaeological-sites"}