{"authors": [], "date_download": "2024-10-12 13:44:24", "date_modify": "2024-10-12 13:44:24", "date_publish": "2024-01-27 09:56:07", "description": "Scientists theorise that portions of Mars were once covered in water and may have harboured microbial life. Read more at straitstimes.com.", "filename": "world_mars-rover-data-confirms-ancient-lake-sediments-on-mars_1728740664.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/27/b77f7367-26ec-4ea0-8cac-196968a32d07.jpg.JPEG?h=670365ce", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_mars-rover-data-confirms-ancient-lake-sediments-on-mars_1728740664.html", "title": "Mars rover data confirms ancient lake sediments on planet", "title_page": "Mars rover data confirms ancient lake sediments on planet | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – The National Aeronautics and Space Administration’s rover, Perseverance, has gathered data confirming the existence of ancient lake sediments deposited by water that once filled a giant basin on Mars called the Jerezo Crater, according to a study published on Jan 26.\nThe findings from ground-penetrating radar observations conducted by the robotic rover substantiate previous orbital imagery and other data, leading scientists to theorise that portions of Mars were once covered in water and may have harboured microbial life.\nThe research, led by teams from the University of California at Los Angeles (UCLA) and the University of Oslo, was published in the journal Science Advances.\nIt was based on sub-surface scans taken by the car-sized, six-wheeled rover over several months of 2022 as it made its way across the Martian surface from the crater floor onto an adjacent expanse of braided, sedimentary-like features resembling, from orbit, the river deltas found on Earth.\nSoundings from the rover’s radar instrument allowed scientists to peer underground to get a cross-sectional view of rock layers 20m deep, “almost like looking at a road cut”, said UCLA planetary scientist David Paige, the lead author of the paper.\nThose layers provide unmistakable evidence that soil sediments carried by water were deposited at Jerezo Crater and its delta from a river that fed it, just as they are in lakes on Earth. The findings reinforced what previous studies have long suggested – that cold, arid, lifeless Mars was once warm, wet and perhaps habitable.\nScientists look forward to an up-close examination of Jerezo’s sediments – thought to have formed some three billion years ago – in samples collected by Perseverance for future transport to Earth.\nIn the meantime, the latest study is welcome validation that scientists undertook their geo-biological Mars endeavour at the right place on the planet after all.\nRemote analysis of early core samples drilled by Perseverance at four sites close to where it landed in February 2021 surprised researchers by revealing rock that was volcanic in nature, rather than sedimentary as had been expected.\nThe two studies are not contradictory. Even the volcanic rocks bore signs of alteration through exposure to water, and scientists who published those findings in August 2022 reasoned then that sedimentary deposits may have eroded away.\nIndeed, the radar readings reported on Jan 26 found signs of erosion before and after the formation of sedimentary layers identified at the crater’s western edge, evidence of a complex geological history there, Professor Paige said.\n“There were volcanic rocks that we landed on,” Prof Paige said. “The real news here is that now we’ve driven onto the delta and now, we’re seeing evidence of these lake sediments... one of the main reasons we came to this location. So that’s a happy story in that respect.” REUTERS", "url": "https://www.straitstimes.com/world/mars-rover-data-confirms-ancient-lake-sediments-on-mars"}