{"authors": [], "date_download": "2024-10-12 14:06:04", "date_modify": "2024-10-12 14:06:04", "date_publish": "2024-01-25 20:00:46", "description": "Italian Prime Minister Giorgia Meloni is set to introduce a new welfare subsidy for the low-income elderly, according to a draft decree seen by Reuters on Thursday, as part of a broader plan worth more than 1 billion euros ($1.09 billion) over two years. Read more at straitstimes.com.", "filename": "world_europe_italy-eus-oldest-country-plans-more-spending-for-elderly_1728741964.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/25/LYNXMPEK0O0FR-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_italy-eus-oldest-country-plans-more-spending-for-elderly_1728741964.html", "title": "Italy, EU's oldest country, plans more spending for elderly", "title_page": "Italy, EU's oldest country, plans more spending for elderly | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME - Italian Prime Minister Giorgia Meloni is set to introduce a new welfare subsidy for the low-income elderly, according to a draft decree seen by Reuters on Thursday, as part of a broader plan worth more than 1 billion euros ($1.09 billion) over two years.\nAgeing population and low birth rates are a major worry for the euro zone's third-largest economy, leading to falling productivity and higher welfare costs in a country where more than a third of residents are expected to be over 65 by 2050.\nThe government was set to present the package at the end of a cabinet meeting later on Thursday.\nAmong several measures, the scheme envisages a so-called monthly \"universal benefit\" of 1,000 euros to support poor people over 80 with \"very severe welfare needs,\" the draft said.\nThe benefit will be paid starting from Jan. 1 2025, and will remain in place until Dec. 31 2026, the document added.\nWith a median age of 48, Italy is the EU's oldest country, and also has the highest old-age dependency, defined as the ratio of people aged 65 and over to those of working age, according to statistics agency Eurostat.\nPensions already eat up more than 15% of gross domestic product (GDP), and the Treasury expects spending to reach 17% of output in 2042.\nThis makes it harder for Rome to reduce its public debt, which at around 140% of GDP already is the second highest in the EU and drains resources from other areas such as education and childcare.\nIn its 2024 budget, the government earmarked around 1 billion euros for several measures aimed at addressing Italy's demographic crisis. One temporarily removes social contributions paid by working mothers with at least two children. REUTERS", "url": "https://www.straitstimes.com/world/europe/italy-eus-oldest-country-plans-more-spending-for-elderly"}