{"authors": [], "date_download": "2024-10-12 13:47:59", "date_modify": "2024-10-12 13:47:59", "date_publish": "2024-10-02 08:00:00", "description": "Analysts said it was abnormal for a presidential candidate who is not in office to visit a disaster area. Read more at straitstimes.com.", "filename": "world_united-states_in-the-wake-of-a-hurricane-trump-seeks-to-boost-his-presidential-bid_1728740879.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/US-DONALD-TRUMP-VISITS-AREAS-AFFECTED-BY-HURRICANE-HELENE-IN-GEO-192111.jpg?VersionId=1gQS29G3zAmyhSlsJp9d3WjRR.mOQRga", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_in-the-wake-of-a-hurricane-trump-seeks-to-boost-his-presidential-bid_1728740879.html", "title": "In the wake of Hurricane Helene, Trump seeks to boost his presidential bid", "title_page": "In the wake of Hurricane Helene, Trump seeks to boost his presidential bid | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Former US president Donald Trump is using the destruction caused by Hurricane Helene to boost his presidential bid against Ms Kamala Harris, political analysts said on Oct 1, after the Republican candidate spread falsehoods about the federal response during a visit to a storm-hit city.\nHe is leveraging the potential political danger of the hurricane to the presidential campaign of Democrat candidate Harris, his 2024 White House rival, the analysts said.\nTrump visited the city of Valdosta in the battleground state of Georgia on Sept 30 and falsely stated that Democratic President Joe Biden had been unresponsive to the hurricane’s destruction. Ms Harris is also Mr Biden’s vice-president.\nTrump said he brought “truckloads of things” to Georgia, including oil, water and equipment, and that he partnered evangelical Christian leader Franklin Graham’s relief organisation to deliver them.\nNatural disasters have damaged US administrations in the past and Trump is trying to tie Ms Harris to this hurricane, which tore through the US South-east including the battleground states of Georgia and North Carolina, said Professor Andrew Reeves from Washington University in St Louis who has studied how natural disasters affect US politics.\n“If there is a massive screw-up in the response, it could come back to bite her,” Prof Reeves said. “Trump is trying to look presidential and trying to create a media story around his attention to the crisis.”\nGeorgia and North Carolina will play a key role in the outcome of the Nov 5 election between Trump and Ms Harris. North Carolina’s hardest-hit area, Buncombe County, voted for Mr Biden in 2020, while most of the other counties in the western part of the state picked Trump.\nGeorgia’s Lowndes County, where Valdosta is located, voted for Trump in 2020. But even a few thousand votes in each state could decide which presidential candidate wins those states and potentially determine the outcome of the White House race.\nMore than 3,500 federal workers are involved in response efforts in the affected states, according to the White House.\nAnalysts said it was abnormal for a presidential candidate who is not in office to visit a disaster area.\nNatural disasters, especially hurricanes, have shaped US politics in recent years and could alter the course of the race in 2024 as well, said Mr Stuart Rothenberg, a non-partisan political analyst.\n“It gives Donald Trump an opportunity to ride into the rescue as the savior,” he said.\nIt is not the first time Trump has sought to use a disaster for political gain. While visiting the site of a toxic train derailment in Ohio in 2023, he criticised the Biden administration’s response as a “betrayal”.\nPresidents and presidential candidates usually do not visit a storm-hit region immediately because of fears that they will distract from rescue efforts and drain resources from local law enforcement officials and emergency responders.\nMr Biden said he would visit North Carolina on Oct 2, and Georgia and Florida soon after. He may also ask Congress to return to Washington for a special session to pass supplemental aid funding.\nMs Harris is planning a visit to Augusta, Georgia, on Oct 2 and a trip to North Carolina in the coming days, the White House said.\nShe spoke with local leaders by phone and cut short a West Coast campaign swing to participate in a hastily arranged briefing at the Federal Emergency Management Agency headquarters on Sept 30. There, she grimaced and shook her head when a reporter asked whether the crisis was being politicised. The Harris campaign did not immediately respond to a request for comment on Oct 1.\nTrump spokeswoman Karoline Leavitt said in a statement: “While Biden and Harris abandon Americans in times of crisis, President Trump leads.”\nThe storm killed more than 100 people across North Carolina, South Carolina, Georgia, Florida, Tennessee and Virginia, and the death toll is expected to rise.\nSurvivors will be eligible for federal disaster aid, but Trump has also authorised a GoFundMe fund-raising campaign “as an official response for Maga supporters”. The campaign has raised over US$2 million (S$2.58 million) so far. Maga refers to Trump’s “Make America Great Again” campaign slogan.\nMs Leavitt declined to say how the funds will be spent.\nIn 2019, a New York state judge ordered Trump to pay US$2 million for misusing his namesake charitable foundation, resulting in funds being used to advance his 2016 presidential campaign. Trump defended the charity at the time, saying it was an “incredibly effective philanthropy” that had made “some small technical violations”.\nIn Georgia, Trump falsely claimed that Mr Brian Kemp, Georgia’s Republican governor, “was having a hard time” getting Mr Biden on the phone.\nMr Kemp told reporters that the President had called him the evening before and said he was grateful for the federal assistance Mr Biden had offered. Mr Biden said Trump had been lying.\nProf Reeves’ research has found that sitting presidents received a modest bump of half a percentage point when they approved disaster aid close to their re-election.\nDuring Trump’s 2017 visit to San Juan, Puerto Rico, after Hurricane Maria, the then President threw rolls of paper towels into a crowd of local residents impacted by the storm. The move drew criticism from some local officials.\nWhile campaigning for re-election in 2012, President Barack Obama joined Republican Governor Chris Christie to tour parts of New Jersey that were affected by Superstorm Sandy. Mr Christie was at the time a top defender of Mr Obama’s Republican rival, Mr Mitt Romney.\nRepublican President George W. Bush’s approval ratings fell after Hurricane Katrina devastated New Orleans in 2005 and never recovered.\nRepublican pollster Whit Ayres said disasters can be make-or-break events for office-holders, but not necessarily for candidates. “Candidates have no responsibility for handling major disasters,” he said. REUTERS", "url": "https://www.straitstimes.com/world/united-states/in-the-wake-of-a-hurricane-trump-seeks-to-boost-his-presidential-bid"}