{"authors": [], "date_download": "2024-10-12 13:41:22", "date_modify": "2024-10-12 13:41:22", "date_publish": "2024-02-23 07:13:00", "description": "The six-legged robot lander is dubbed Odysseus. Read more at straitstimes.com.", "filename": "world_united-states_us-nears-attempt-at-first-moon-landing-in-half-century-with-private-robot-spacecraft_1728740482.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/23/MOONLANDINGGUIDE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-nears-attempt-at-first-moon-landing-in-half-century-with-private-robot-spacecraft_1728740482.html", "title": "US achieves first Moon landing in over 50 years with private spacecraft", "title_page": "US achieves first Moon landing in over 50 years with private spacecraft | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TEXAS – A spacecraft built and flown by Texas-based company Intuitive Machines landed near the south pole of the Moon on Feb 22, the first US touchdown on the lunar surface in more than half a century and the first achieved entirely by the private sector.\nThe National Aeronautics and Space Administration, with several research instruments aboard the vehicle, hailed the landing as a major achievement in its goal of sending a squad of commercially flown spacecraft on scientific scouting missions to the Moon ahead of a planned return of astronauts there later this decade.\nBut initial communications problems following Feb 22’s landing raised questions about whether the vehicle may have been left impaired or obstructed in some way.\nThe uncrewed six-legged robot lander, dubbed Odysseus, touched down at about 6.23pm Eastern Standard Time (7.23am on Feb 23, Singapore time), the company and Nasa commentators said in a joint webcast of the landing from Intuitive Machines’ mission operations centre in Houston.\nThe landing capped a nail-biting final approach and descent in which a problem surfaced with the spacecraft’s autonomous navigation system that required engineers on the ground to employ an untested work-around at the 11th hour.\nIt also took some time after an anticipated radio blackout to re-establish communications with the spacecraft and determine its fate some 384,000km from Earth.\nWhen contact was finally renewed, the signal was faint, confirming that the lander had touched down but leaving mission control immediately uncertain as to the precise condition and position of the vehicle, according to the webcast.\n“Our equipment is on the surface of the Moon, and we are transmitting, so congratulations IM team,” Intuitive Machines mission director Tim Crain was heard telling the operations centre. “We’ll see what more we can get from that.”\nLater in the evening, the company posted a message on social media platform X that said flight controllers “have confirmed Odysseus is upright and starting to send data”.\nSuch an issue could complicate the lander’s primary mission of deploying its payloads and meeting science objectives, Dr Zurbuchen said.\nAccomplishing the landing is “a major intermediate goal, but the goal of the mission is to do science, and get the pictures back and so forth”, he added.\nNasa administrator Bill Nelson immediately cheered Feb 22’s feat as a “triumph”, saying: “Odysseus has taken the Moon.”\nAs planned, the spacecraft was believed to have come to rest at a crater named Malapert A near the Moon’s south pole, according to the webcast. The spacecraft was not designed to provide live video of the landing, which came one day after it reached lunar orbit and a week after its launch from Florida.\nFeb 22’s landing represented the first controlled descent to the lunar surface by a US spacecraft since Apollo 17 in 1972, when Nasa’s last crewed Moon mission landed there with astronauts Gene Cernan and Harrison Schmitt.\nTo date, spacecraft from just four other countries have ever landed on the Moon – the former Soviet Union, China, India and, mostly recently, just in January, Japan. The United States is the only one ever to have sent humans to the lunar surface.\nOdysseus is carrying a suite of scientific instruments and technology demonstrations, for Nasa and several commercial customers, designed to operate for seven days on solar energy before the sun sets over the polar landing site.\nThe Nasa payload focuses on space weather interactions with the Moon’s surface, radio astronomy and other aspects of the lunar environment for future landing missions.\nOdysseus was sent on its way to the Moon on Feb 15 atop a Falcon 9 rocket launched by billionaire Elon Musk’s company SpaceX from Nasa’s Kennedy Space Centre in Cape Canaveral, Florida.\nDawn of Artemis\nIts arrival marked the first “soft landing” on the Moon by a commercially manufactured and operated vehicle, and the first under Nasa’s Artemis lunar programme, as the US races to return astronauts to Earth’s natural satellite before China lands its own crewed spacecraft there.\nNasa aims to land its first crewed Artemis in late 2026 as part of long-term, sustained lunar exploration and a stepping stone towards eventual human flights to Mars. The initiative focuses on the Moon’s south pole, in part because a presumed bounty of frozen water exists there that can be used for life support and the production of rocket fuel.\nA host of small landers like Odysseus is expected to pave the way under Nasa’s Commercial Lunar Payload Services (CLPS) programme, designed to deliver instruments and hardware to the Moon at lower costs than the US space agency’s traditional method of building and launching those vehicles itself.\nLeaning more heavily on smaller, less experienced private ventures comes with its own risks.\nIn January 2024, the lunar lander of another firm, Astrobotic Technology, suffered a propulsion system leak on its way to the Moon shortly after being placed in orbit on Jan 8 by a United Launch Alliance (ULA) Vulcan rocket.\nThe malfunction of Astrobotic’s Peregrine lander marked the third failure of a private company to achieve a lunar touchdown, following ill-fated efforts by companies from Israel and Japan.\nAlthough Odysseus is the latest star of Nasa’s CLPS programme, the IM-1 flight is considered an Intuitive Machines mission. The company was co-founded in 2013 by Mr Stephen Altemus, former deputy director of Nasa’s Johnson Space Centre in Houston and now the company’s president and chief executive. REUTERS", "url": "https://www.straitstimes.com/world/united-states/us-nears-attempt-at-first-moon-landing-in-half-century-with-private-robot-spacecraft"}