{"authors": [], "date_download": "2024-10-12 13:35:18", "date_modify": "2024-10-12 13:35:18", "date_publish": "2024-01-08 01:56:05", "description": "Israeli ambulance services said she was treated on the scene but pronounced dead. Read more at straitstimes.com.", "filename": "world_middle-east_israeli-police-kill-palestinian-girl-when-responding-to-ramming-attack-emergency-services_1728740118.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/08/LYNXMPEK0608Z-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israeli-police-kill-palestinian-girl-when-responding-to-ramming-attack-emergency-services_1728740118.html", "title": "Israeli police kill Palestinian girl when responding to ramming attack", "title_page": "Israeli police kill Palestinian girl when responding to ramming attack | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM – Israeli police killed a young Palestinian girl in a car at a West Bank crossing on Jan 7 when they opened fire on another car suspected of a ramming attack, Israeli emergency services said.\nThe border police said they hit the girl after firing at a couple in a car whom they said rammed into two Israelis at a crossing in the occupied West Bank just outside Jerusalem.\nIsraeli paramedics gave her age as three, but Palestinian sources told the Wafa official Palestinian news agency that the girl was four.\nThe Israeli ambulance services said she was treated at the scene but pronounced dead, without specifying the cause of death. An Israeli was lightly injured, paramedics said.\nA statement from the Israeli police said a car with a man and a woman pulled up at a crossing near Jerusalem and committed a ramming attack against border police. The police responded with live fire, the statement said.\nIt said the police “neutralised” the two in the car, without providing details. Palestinian sources told Wafa the couple were killed in the shooting. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/israeli-police-kill-palestinian-girl-when-responding-to-ramming-attack-emergency-services"}