{"authors": [], "date_download": "2024-10-12 13:47:30", "date_modify": "2024-10-12 13:47:30", "date_publish": "2023-08-08 21:00:00", "description": "Several heatwaves recorded in Spain and wider Europe this summer have worsened the drought. Read more at straitstimes.com.", "filename": "world_europe_drought-in-spain-empties-reservoirs-forces-limits-on-water-use_1728740850.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/08/SPAIN-ENVIRONMENT-CLIMATE-DROUGHT-171455.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_drought-in-spain-empties-reservoirs-forces-limits-on-water-use_1728740850.html", "title": "Drought in Spain empties reservoirs, forces limits on water use", "title_page": "Drought in Spain empties reservoirs, forces limits on water use | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AGULLANA, Spain - Artur Duran holds his hand out by his waist to show the level of water he remembers two years ago at the Darnius Boadella reservoir in north-eastern Spain.\nThen, it was still deep enough for sailing. Now a long drought has nearly emptied it.\n“We have never seen (it) so low,” the 79-year-old local resident told Reuters at the reservoir, which is only 20 per cent full.\nPeople sunbathed on the reservoir’s newly exposed shore, where a few specks of grass have cropped up. Some visitors tried to paddle-surf.\nCatalonia’s authorities last week imposed new water usage restrictions on 22 villages around the reservoir, near the French border, as the aquifer supplying them is also emptying.\nSpain registered the driest start to a year in the first four months of 2023 since records began in the 1960s, with Catalonia and southern Spain’s Andalusia being the most affected.\nSeveral heatwaves recorded in Spain and wider Europe this summer have worsened the drought, lowering reservoirs’ levels as water evaporation and consumption increased, said Mr Ruben del Campo, spokesman for Spain’s meteorological agency AEMET.\nThe 22 villages, plus two others in southern Catalonia, which account for around 25,000 residents in total, are in a state of water emergency.\nThis means they must lower their consumption to a daily average of 200 litres of water per resident from a prior cap of 230.\nThe authorities are not limiting water for human consumption yet, but watering for agricultural purposes will be largely banned, and water use for industrial and recreational purposes has to drop by 25 per cent.\nThe village of Agullana with 900 residents has been keeping its water usage below the 200-litre cap for several months, but its mayor said further steps will be implemented.\n“We’ll reduce to zero the irrigation of gardens, the football field, the grass by the swimming pool, which we’ll see turning yellow as if burnt,” Mr Josep Jovell said. No water will be used to clean the streets, only dry sweeping, he added. REUTERS", "url": "https://www.straitstimes.com/world/europe/drought-in-spain-empties-reservoirs-forces-limits-on-water-use"}