{"authors": [], "date_download": "2024-10-12 14:01:57", "date_modify": "2024-10-12 14:01:57", "date_publish": "2024-04-07 02:28:34", "description": "He singled out in particular the need for Patriot air defence systems. Read more at straitstimes.com.", "filename": "world_europe_ukraine-may-run-out-of-air-defence-missiles-if-russia-keeps-up-bombardment-zelenskiy-warns_1728741717.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/07/LYNXNPEK3508T-1.jpg?VersionId=XVEJpOxCcRIf9eV598m8R8lK14YKa13W", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-may-run-out-of-air-defence-missiles-if-russia-keeps-up-bombardment-zelenskiy-warns_1728741717.html", "title": "Ukraine may run out of air defence missiles if Russia keeps up bombardment, Zelensky warns", "title_page": "Ukraine may run out of air defence missiles if Russia keeps up bombardment, Zelensky warns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – President Volodymyr Zelensky warned in remarks aired on April 6 that Ukraine could run out of air defence missiles if Russia keeps up its intense long-range bombing campaign.\nThe Ukrainian leader’s starkest warning to date of the deteriorating situation faced by his country’s air defences follows weeks of Russian strikes on the energy system, towns and cities using a vast arsenal of missiles and drones.\n“If they keep hitting (Ukraine) every day the way they have for the last month, we might run out of missiles, and the partners know it,” Mr Zelensky said in an interview that aired on Ukrainian television.\nHe said Ukraine had enough air defence stockpiles to cope for the moment, but that it was already having to make difficult choices about what to protect.\nHe singled out in particular the need for Patriot air defence systems.\nThe sophisticated US air defence system has been vital during Russian attacks with ballistic and hypersonic missiles which can hit targets within a matter of minutes. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-may-run-out-of-air-defence-missiles-if-russia-keeps-up-bombardment-zelenskiy-warns"}