{"authors": [], "date_download": "2024-10-12 14:07:00", "date_modify": "2024-10-12 14:07:00", "date_publish": "2022-04-07 14:25:50", "description": "Foreign Minister Dmytro Kuleba criticised allies that remain reluctant to send so-called \"offensive\" arms. Read more at straitstimes.com.", "filename": "world_europe_ukraine-calls-for-weapons-weapons-weapons-at-nato-talks_1728742020.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/07/AK_ukrsol_070422.jpg?VersionId=KhEaPZoDzuD9pJ9JBiZzbQZx6IwHfWn.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-calls-for-weapons-weapons-weapons-at-nato-talks_1728742020.html", "title": "Ukraine calls for 'weapons, weapons, weapons' at Nato talks", "title_page": "Ukraine calls for 'weapons, weapons, weapons' at Nato talks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS (AFP) - Ukraine's Foreign Minister Dmytro Kuleba on Thursday (April 7) called on Nato members to provide Kyiv with all the weaponry it needs to fight Russia.\n\"My agenda is very simple. It has only three items on it. Its weapons, weapons and weapons,\" Mr Kuleba told journalists ahead of a meeting with Nato foreign ministers in Brussels.\n\"I call on all allies to put aside their hesitations, their reluctance, to provide Ukraine with everything it needs,\" he said.\nUkraine is pushing the West to increase its arms supplies with heavier weaponry, including air defence systems, artillery, tanks and jets as Moscow refocuses its offensive on the east of the country.\nMr Kuleba said economic powerhouse Germany \"can do more\" as he criticised allies that remain reluctant to send so-called \"offensive\" arms.\n\"This distinction between defensive and offensive does not make any sense when it comes to the situation in my country,\" Mr Kuleba said.\n\"Those countries who are saying we will provide Ukraine with defensive weapons, but we are not in a position to provide them with offensive weapons - they are hypocritical; this is simply unfair, unjustified approach.\"\nMr Jens Stoltenberg, chief of the North Atlantic Treaty Organisation, said he was certain that allies would \"address the need for more air defence systems, anti-tank weapons, lighter but also heavier weapons, and many different types of support to Ukraine\".\nGerman Foreign Minister Annalena Baerbock said Berlin was \"looking closely with our partners how we can support Ukraine in the future, more intensively and more coordinated because they have a right of self-defence\".", "url": "https://www.straitstimes.com/world/europe/ukraine-calls-for-weapons-weapons-weapons-at-nato-talks"}