{"authors": [], "date_download": "2024-10-12 13:43:45", "date_modify": "2024-10-12 13:43:45", "date_publish": "2024-08-06 11:35:00", "description": "Over the two-day sessions in Washington, the Transportation Safety Board will hear from about 15 witnesses. Read more at straitstimes.com.", "filename": "world_united-states_hearing-to-probe-alaska-airlines-emergency-on-boeing-jet_1728740625.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/06/2024-06-12T235301Z1996866304RC2OFV985FA1RTRMADP3BOEING-DOJ.JPG?VersionId=x_Y2Xn4e1kBpB61mEkJKdZZkihw7pEab", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_hearing-to-probe-alaska-airlines-emergency-on-boeing-jet_1728740625.html", "title": "Hearing to probe Alaska Airlines emergency on Boeing jet", "title_page": "Hearing to probe Alaska Airlines emergency on Boeing jet | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – US investigators will open a two-day hearing on Aug 6 into a near-catastrophic January incident on a Boeing 737 MAX aircraft operated by Alaska Airlines that required an emergency landing.\nVideo of the episode showed oxygen masks hanging in front of a gaping airplane space from a panel that blew out shortly after take-off, leaving passengers exposed to open air at an altitude of about 4,880m.\nThe hearing in Washington aimed “to determine the facts, circumstances and probable cause of the transportation accident... and to make recommendations to improve transportation safety”, said the National Transportation Safety Board (NTSB), which is overseeing the probe.\nThe plane soon went back to Portland where it safely landed, although there were eight minor injuries.\nThe NTSB immediately launched a probe and after a month said four bolts securing the panel were missing, according to preliminary findings released on Feb 6.\nThe agency has collected written documents and photos showing that Boeing employees removed four bolts from these locations during an inspection at the company’s Renton plant in Washington state prior to delivery of the aircraft in October 2023.\nOver the course of two day-long sessions on Aug 6 and 7 in Washington, the NTSB will hear from about 15 witnesses.\nSpeakers include Ms Elizabeth Lund, senior vice-president for quality at Boeing, among other officials at the company, as well as officials from key supplier Spirit AeroSystems, regulator Federal Aviation Administration and the machinists union.\nThe witness list does not include Alaska Airlines.\nMs Lund came under fire from the NTSB after providing a detailed summary of the incident in June to journalists touring the Renton plant.\nBoeing staff identified five “non-conforming” rivets in the fuselage after the plane arrived in Renton, but the issue “did not create a safety hazard”, Ms Lund told reporters.\nBut when the fuselage panel, known as the door plug, was removed to replace the rivets, Boeing staff failed to file the documentation to make the change on the door plug, Ms Lund said.\n“We believe that plug was opened without the correct paperwork,” Ms Lund told reporters. “There was a non-compliance to our processes at that point.”\nShe also said Boeing was focused on closing a “gap” over the lack of documentation and that determining who did the work “is the responsibility of the NTSB and that investigation is still going on”.\nBoeing sanctioned\nAfter Ms Lund’s comments were published in June, the NTSB announced it was sanctioning the company for sharing details about an ongoing probe that were not supposed to be discussed publicly.\nMs Lund “released non-public investigative information and made unsubstantiated speculations about possible causes of the Jan 5 door plug blow-out, which is directly at issue in the ongoing investigation,” the NTSB said in a June 27 letter to Boeing chief executive Dave Calhoun.\nSome of the information “was either inaccurate or unknown to the NTSB”, the letter added. “This disregard of the federal regulations and rules governing NTSB investigations cannot be tolerated.”\nAs a result, the NTSB said it is blocking Boeing from reviewing information gathered in its investigation and will not permit the company to ask questions of other witnesses at the hearing.\nNTSB chair Jennifer Homendy in March had also sharply criticised Boeing’s handling of the probe, telling a congressional hearing the company was dragging its feet in providing key documentation and witnesses involved in working on the plane.\nThe Aug 6 hearing comes as Boeing faces heavy scrutiny from regulators following the January incident and in the wake of congressional testimony from whistle-blowers who say the company punishes workers who raise safety issues, while moving to cover up problems. AFP", "url": "https://www.straitstimes.com/world/united-states/hearing-to-probe-alaska-airlines-emergency-on-boeing-jet"}