{"authors": [], "date_download": "2024-10-12 14:05:28", "date_modify": "2024-10-12 14:05:28", "date_publish": "2022-10-17 14:31:55", "description": "Two loud explosions echoed through the city on Monday morning. Read more at straitstimes.com.", "filename": "world_europe_kyiv-residents-take-cover-from-kamikaze-drones-a-week-after-round-of-strikes_1728741928.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/Z1EnGBTnnWQ3FbjhUex2w5_hHOvL5sb3vVZU8mv_eGI.jpg?VersionId=ASWGqCqchxdP.75D1IHQBQRMv9pAkQyM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_kyiv-residents-take-cover-from-kamikaze-drones-a-week-after-round-of-strikes_1728741928.html", "title": "Kyiv residents take cover from kamikaze drones, a week after round of strikes", "title_page": "Kyiv residents take cover from kamikaze drones, a week after round of strikes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Ukraine capital Kyiv was hit by drone strikes on Monday morning, a Ukrainian official said, with two loud explosions echoing through the centre of the city, a continuation of the Russian bombardment of Ukrainian cities that intensified last week.\nAn hour and a half after the first round of explosions, more were heard shortly after 8.15am, and a number of air defence shots fired back were audible. Thick white smoke was blanketing parts of central Kyiv.\nThe blasts in Kyiv, the Ukrainian capital, were the most significant since a flurry of strikes on Oct 10. Those attacks were launched after an explosion on a strategic bridge to Crimea, which Russia blamed on Ukraine, and as Ukraine continued to make significant battlefield gains in a counteroffensive in the country’s south.\n“The capital was attacked by kamikaze drones,” the president’s chief of staff Andriy Yermak said on social media.\n“The Russians think it will help them, but it shows their desperation,” he added.\n“We need more air defence systems and as soon as possible. More weapons to defend the sky and destroy the enemy.”\nThe wave of Russian attacks one week ago, which Ukrainian President Volodymyr Zelensky said had intentionally targeted civilians and power infrastructure, was one of the broadest in months. Missiles hit cities across the country, killing at least 19 people.\nThe latest attack on Kyiv came as many people were preparing for work and children were just waking up for their school day, with in-person classes having resumed this autumn. Instead of heading to classrooms, children, some already dressed in their school uniforms, made their way to basement shelters. In the Teatralna metro station in the heart of the city, residents scrolled through their phones looking for updates.\nIn the still of the morning between the blasts, the humming noise of an engine could be heard passing relatively slowly over the city, a telltale sign of a drone. Air raid sirens went off about 10 minutes before the initial attacks.\nIn streets near the site of one strike, acrid smoke wafted about. The upper stories of an office building were burning, and debris, broken glass and documents littered the pavement nearby. The building appeared to have been empty when it was hit shortly after 6am.\n“I woke up from an explosion, went downstairs and saw a building on fire,” said Mr Ihor Stupakov, a programmer who lives about a block from the site of one of the explosions. He said he then heard a buzz overhead and looked up.\n“I saw a Shahed” fly by, he said, referring to the drone. “I saw soldiers shooting at it, with rifles and a missile, and I saw it blow up in the sky.”", "url": "https://www.straitstimes.com/world/europe/kyiv-residents-take-cover-from-kamikaze-drones-a-week-after-round-of-strikes"}