{"authors": [], "date_download": "2024-10-12 14:05:30", "date_modify": "2024-10-12 14:05:30", "date_publish": "2022-05-22 04:44:04", "description": "Some weeks, they knew there was a 90 per cent chance that they would not return, he says in TV interview. Read more at straitstimes.com.", "filename": "world_europe_ukraines-zelensky-praises-helicopter-pilots-who-died-trying-to-fly-aid-into-mariupol_1728741930.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/22/zelenskyheli22.jpg?VersionId=_rLBzP9GCnGbiAj1FLENl4_7h5yawVC1&h=e1bc61e0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraines-zelensky-praises-helicopter-pilots-who-died-trying-to-fly-aid-into-mariupol_1728741930.html", "title": "Ukraine's Zelensky praises helicopter pilots who died trying to fly aid into Azovstal", "title_page": "Ukraine's Zelensky praises helicopter pilots who died trying to fly aid into Azovstal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (NYTIMES) - Ukrainian President Volodymyr Zelensky on Saturday (May 21) praised military pilots who died trying, despite near impossible odds, to deliver aid to fighters who were besieged at a steel plant in Mariupol, a city that Russia claims has finally fallen to its forces after a siege that lasted for months.\n\"Many of our pilots died,\" Zelensky said in an interview with a Ukrainian TV channel to mark the third anniversary of his inauguration as president.\nHe described the pilots as \"absolutely heroic people\" who knew it was \"almost impossible\" to bring medicine, food and water to the Azovstal steel plant, as well as to evacuate the wounded and bring out bodies of those killed, because they would have to run a gauntlet of Russia's air defenses with no established air corridor.\nThe helicopter pilots who set out on their missions knew there was a 90 per cent chance that they would not return, Zelensky said, adding that he had not been able to speak about the contribution of the pilots until now, presumably for security reasons.\nThe Ukrainian military said on Saturday that Russia is demining the port in an attempt to get it running again.\nReopening the port would tighten Moscow's grip on the parts of southern and eastern Ukraine that it controls, as well as increase its economic leverage over the Black Sea, where its navy is dominant.\nHundreds of Ukrainian fighters have surrendered at the steel plant and are in Russian hands, and Russia announced late on Friday that the last of the defenders had laid down their arms.\nZelensky did not comment in his TV interview on whether Moscow controls the entire city.\nOverall, Ukraine has \"broken the backbone of the largest, or one of the strongest, armies in the world,\" he said.\nThe war is entering its fourth month and, while Moscow has been forced to retreat first from outside the capital city, Kyiv, and more recently from the country's second largest city, Kharkiv, neither side is making more than incremental gains.\nAt the same time, negotiations aimed at reaching a cease-fire have stalled.\nZelensky said that Russia had thwarted an initial attempt to end the war through dialogue and that now the conflict was \"very difficult.\"\nHe said the war would be bloody, but that victory would come and \"the end will definitely be in diplomacy.\"", "url": "https://www.straitstimes.com/world/europe/ukraines-zelensky-praises-helicopter-pilots-who-died-trying-to-fly-aid-into-mariupol"}