{"authors": [], "date_download": "2024-10-12 13:39:55", "date_modify": "2024-10-12 13:39:55", "date_publish": "2024-09-29 05:24:40", "description": "CHISINAU - Moldova's state-owned broadcaster said on Saturday that vandals had poured paint across an entrance to its building in the capital, Chisinau, a day after police blamed similar incidents on a group trained in Moscow to destabilise upcoming elections. Read more at straitstimes.com.", "filename": "world_europe_moldovan-broadcasters-building-defaced-in-pre-election-vandalism-wave_1728740395.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/29/LYNXMPEK8R0CI-1.jpg?VersionId=Y5y8KR5AQw.BrOXtQSRbGFYYfmjIhHZ_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_moldovan-broadcasters-building-defaced-in-pre-election-vandalism-wave_1728740395.html", "title": "Moldovan broadcaster's building defaced in pre-election vandalism wave", "title_page": "Moldovan broadcaster's building defaced in pre-election vandalism wave | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CHISINAU - Moldova's state-owned broadcaster said on Saturday that vandals had poured paint across an entrance to its building in the capital, Chisinau, a day after police blamed similar incidents on a group trained in Moscow to destabilise upcoming elections.\n\"We are not afraid of this act of vandalism, as long as we are devoted to society and citizens,\" Teleradio-Moldova's deputy director general, Andrei Zapsa, said, adding that the station had always known it could be targeted by \"radical groups.\"\nPaint was also poured on the Supreme Court building overnight, police said.\nMoldovan authorities have linked such incidents to a group trained in Moscow to provoke instability ahead of a presidential poll next month, in which pro-European incumbent, President Maia Sandu, is favored to beat a field of 10 challengers.\nSandu's opponents are led by Alexander Stoianoglo, who was dismissed from his position as prosecutor general and is backed by pro-Russian opposition parties, and Renato Usatii, who favours good links with both the West and Moscow.\nMoldovan law enforcement agencies said on Friday they had detained two young men following similar incidents overnight in which yellow paint - the color of Sandu's ruling pro-European party - was poured on two other government buildings.\nA 21-year-old man, caught in a park, and his 20-year-old accomplice, apprehended near the parliament, said they were part of a group of 20 who were recruited to commit acts of vandalism to destabilise Moldovan government institutions, police said.\nThe detainees said they were paid 5,000 euros for one attack and trained in Moscow, police said. One detainee said he was responsible for recruiting young people who were then sent to study in Moscow and paid 500 euros a month, police added.\nThe group of 20 flew to Istanbul, where they were met by a Russian citizen, police said. The next day, they received cash and phones at a training ground near Moscow where they learned how to spark and destabilise protests and protect provocateurs, police added.\nFrom there, they returned to Moldova via Antalya, Turkey, police said, adding that authorities had identified 13 members of the group and searched the homes of four of them on Friday, seizing paint, gloves, and bank and ID cards that proved they had traveled to Russia. REUTERS", "url": "https://www.straitstimes.com/world/europe/moldovan-broadcasters-building-defaced-in-pre-election-vandalism-wave"}