{"authors": [], "date_download": "2024-10-12 14:00:30", "date_modify": "2024-10-12 14:00:30", "date_publish": "2024-02-01 22:41:43", "description": "Ukrainian officials named the vessel as the Ivanovets and claimed it was worth up to $94 million. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-destroyed-russian-warship-off-crimea_1728741630.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/01/warshipsunk02.jpg.JPEG?h=b7774fac", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-destroyed-russian-warship-off-crimea_1728741630.html", "title": "Ukraine says it ‘destroyed’ Russian warship off Crimea", "title_page": "Ukraine says it ‘destroyed’ Russian warship off Crimea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine said on Feb 1 it had destroyed a Russian warship in the Black Sea off the occupied Crimean peninsula, which has come under increasing Ukrainian attacks.\nCrimea – which Moscow claimed to have annexed in 2014 and which is home to Russia’s Black Sea Fleet – has been extensively targeted by Ukrainian drones and missiles, putting Russia on the defensive.\n“An enemy missile corvette was destroyed” during the night, Ukraine’s military intelligence agency said in a statement online. Russia made no immediate comment.\nThe Ukraine agency named the vessel as the Ivanovets and claimed the ship was worth up to US$70 million (S$94 million).\nIn a night-vision video it published purporting to show the attack, a small vessel is seen approaching the Russian ship, followed by a large explosion and the warship then appearing to start rolling over and sinking.\nAFP was not able to independently verify the footage or Ukraine’s account of the incident.\nKyiv said it happened near Lake Donuzlav – a lake that flows into the Black Sea on the western coast of Crimea.\nUkraine also claimed a Russian search and rescue operation after the attack was “not successful”.\nWhile Moscow made no immediate statement, a Russian Telegram account with army links said Ukraine had attacked in the area with nine naval drones at night.\n“Four of them were discovered by Russian sailors patroling Lake Donuzlav. They opened fire on them,” it said, adding that one boat was “damaged”.\nOn Jan 31, Russia said it destroyed 20 Ukrainian missiles over the Black Sea and Crimea.\nMoscow annexed Crimea in 2014, and in February 2022 invaded Ukraine from several directions, including from the Black Sea peninsula. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-says-destroyed-russian-warship-off-crimea"}