{"authors": [], "date_download": "2024-10-12 13:31:51", "date_modify": "2024-10-12 13:31:51", "date_publish": "2024-09-30 08:15:00", "description": "FPO risks a hollow triumph if Mr Kickl cannot find a willing coalition partner. Read more at straitstimes.com.", "filename": "world_europe_far-right-wins-austrian-election-boosting-european-right-wing-surge_1728739911.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/30/417455514.jpg?VersionId=pd5D.oFk9wS2fa.Jw._F75lzleFoj_e2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_far-right-wins-austrian-election-boosting-european-right-wing-surge_1728739911.html", "title": "Austrian far-right party seeks path to power through rivals’ blockade", "title_page": "Austrian far-right party seeks path to power through rivals’ blockade | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VIENNA - Austria’s far-right Freedom Party (FPO) faced on Sept 30 the task of clearing a path to power after its historic parliamentary election victory left the anti-establishment outfit needing a partner to form a governing coalition.\nThe triumph of the eurosceptic, Russia-friendly FPO on Sept 29 was another milestone in the recent rise of Europe’s hard-right. But the party immediately suffered a stiff reality check.\nFacing FPO party leader Herbert Kickl in a television studio after the results came in, leaders of the other parties in Parliament dismissed his overtures on forming a coalition.\nThe FPO finished around 2.5 percentage points ahead of Chancellor Karl Nehammer’s conservative People’s Party (OVP) to capture some 29 per cent of the vote – its best result ever – and Mr Kickl accused his rivals of opposing the will of the people.\n“Tomorrow, there will be a blue Monday and then we will set about turning that 29 per cent into a political reality in this country,” Mr Kickl told supporters on Sept 29 evening, playing on the fact that blue is the colour associated with his party.\nMr Kickl, a provocative and polarising figure allied with Hungarian Premier Viktor Orban, offered to negotiate with all other parties in Austria. The FPO’s unexpectedly clear victory risks being hollow if it cannot find a partner.\nPresident Alexander Van der Bellen, a former Greens leader who oversees the formation of governments, urged all parties to hold talks and suggested the process could be drawn out.\nMr Kickl’s win cheered hard-right parties across Europe, where the far-right has made gains in countries including the Netherlands, France and Germany. That growing support could stoke the risk of divisions inside the EU over key policy areas like the defence of Ukraine against Russia.\nThose victories have been no guarantee of power for the far-right, however, with other parties eager to deny them.\nFrance’s far-right National Rally won the first round of elections in June only to be frustrated when more moderate parties stood down candidates in the second round, helping the left win the most seats. In the end, the left lost out too when President Emmanuel Macron named a centre-right prime minister.\nIn the Netherlands, nationalist Geert Wilders had to give up his hopes of being prime minister after coming first in an election there when rivals refused to support a government led by him.\n‘Orbanisation’\nMr Kickl says he wants to be a “Volkskanzler” or “people’s chancellor”, a term Nazis used for Adolf Hitler, though others have also claimed it.\nThe 55-year-old Kickl has embraced conspiracy theories, claiming deworming agent ivermectin is effective against Covid-19, as did former US president Donald Trump. He opposes aid to Ukraine and wants sanctions against Russia withdrawn, arguing they hurt Austria more than Moscow.\nSupporters say the FPO’s “Austria First” policies will curb illegal immigration and lift the economy. Critics worry it could herald a more authoritarian state.\nAn FPO victory means the future of Austria as a democracy is now at stake, said Ms Irene Rubik, a 69-year-old retired civil servant and Greens voter, voicing her concern that the country ran the risk of “Orbanisation”, pointing to Hungary’s Mr Orban.\nThe FPO was founded in the 1950s under the leadership of a former Nazi lawmaker, and the party has worked to moderate its image. Voters were drawn by its pledges to restrict asylum and tackle inflation, though their attachment to Mr Kickl appears limited. Just 2 per cent of FPO voters said he was the main reason for their vote, the lowest of any party leader, a survey by pollster Foresight showed.", "url": "https://www.straitstimes.com/world/europe/far-right-wins-austrian-election-boosting-european-right-wing-surge"}