{"authors": [], "date_download": "2024-10-12 14:06:36", "date_modify": "2024-10-12 14:06:36", "date_publish": "2022-09-21 17:33:04", "description": "Direct flights from Moscow to Istanbul and Yerevan which allow Russians visa-free entry sold out. Read more at straitstimes.com.", "filename": "world_europe_flights-out-of-russia-selling-out-fast-after-putin-orders-partial-call-up_1728741996.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/21/ads-flagrussia-210922.jpg?VersionId=nxXSm4ZFO8GF0g2IzaWz4BHv8bpbB2bw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_flights-out-of-russia-selling-out-fast-after-putin-orders-partial-call-up_1728741996.html", "title": "Flights out of Russia selling out fast after Putin orders partial call-up", "title_page": "Flights out of Russia selling out fast after Putin orders partial call-up | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GDANSK - One-way flights out of Russia were rocketing in price and selling out fast on Wednesday after President Vladimir Putin ordered the immediate call-up of 300,000 reservists.\nMr Putin’s announcement, made in an early-morning television address, raised fears that some men of fighting age would not be allowed to leave the country.\nDefence Minister Sergei Shoigu said the call-up would be limited to those with experience as professional soldiers, and that students and conscripts would not be called up.\nThe Kremlin declined to comment on whether the borders would be closed to those subject to the mobilisation order, and asked people to be patient as the law is clarified.\nMeanwhile, Google Trends data showed a spike in searches for Aviasales, Russia’s most popular flight-booking site.\nDirect flights from Moscow to Istanbul in Turkey and Yerevan in Armenia, both destinations that allow Russians to enter without a visa, were sold out on Wednesday, according to Aviasales data.\nFlights from Moscow to Istanbul via Turkish Airlines were either all booked or unavailable until Sunday, as of 1415 Moscow time (1115 GMT).\nSome routes with stopovers, including those from Moscow to Tbilisi, the capital of Georgia, were also unavailable, while the cheapest flights to Dubai cost more than 300,000 roubles (S$7,000) – about five times the average monthly wage.\nTypical one-way fares to Turkey shot up to almost 70,000 roubles, compared with a little over 22,000 roubles a week ago, Google Flights data shows.\nThe head of Russia’s tourism agency said no restrictions have been imposed on travelling abroad so far.\nAeroflot, the country’s flag-carrying airline, said it was not limiting ticket sales. REUTERS", "url": "https://www.straitstimes.com/world/europe/flights-out-of-russia-selling-out-fast-after-putin-orders-partial-call-up"}