{"authors": [], "date_download": "2024-10-12 13:49:00", "date_modify": "2024-10-12 13:49:00", "date_publish": "2023-02-04 05:13:42", "description": "Governments have used balloons for surveillance and observation, most often during times of war. Read more at straitstimes.com.", "filename": "world_united-states_a-brief-history-of-spying-with-balloons_1728740940.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/OjG6uKrwWQ8JioCwfG_KPMjJqDf-lq9Mvcgb2TwE9yA.jpg?VersionId=E.uyV8FabGE2SW.WtTGojJE91BreXCwW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_a-brief-history-of-spying-with-balloons_1728740940.html", "title": "US-China ‘spy’ balloon incident: A brief history of spying with balloons", "title_page": "US-China ‘spy’ balloon incident: A brief history of spying with balloons | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - A Chinese balloon seen hovering over the US state of Montana this week has been described as an “intelligence-gathering” airship by the Pentagon and a stray civilian research airship by China.\nWhatever its intended use, the balloon offers a reminder of how for more than a century, governments have used balloons for surveillance and observation, most often during times of war.\nMr Thomas Paone, curator for the lighter-than-air collection at the National Air and Space Museum in Washington, which includes balloons, blimps and airships, said that while balloon technology has changed over that time, the mission of observation has been a constant.\nHere’s a look at this history.\nBoth sides deployed them in the US Civil War\nThe Confederate and Union armies used tethered balloons to observe troop movements in what Mr Paone said was the first organised military effort in the US to use balloons for observation.\nThe Union had better balloon resources than the Confederates, including a boat to which a balloon was tethered, in what amounted to an early version of an aircraft carrier. One of the Confederates’ most-used balloons was eventually captured.\n“By mid-war, both sides basically give up on balloons because of the logistical challenges that they posed,” Mr Paone said.\nThose logistical challenges were evidenced during the siege of Yorktown, New York, in April 1862, when Union General Fitz John Porter decided to do some surveillance using only one tether rope, instead of the three or four recommended, according to the National Park Service.\nThe rope snapped. General Porter drifted over Confederate lines with no way to control the balloon. Enemy soldiers took a few unsuccessful shots at him, but the general and his balloon eventually floated back over to the Union side.\nGeneral Porter was close to General George B. McClellan. After the accident, General McClellan wrote to his wife, “You may rest assured of one thing: you won’t catch me in the confounded balloon nor will I allow any other Generals to go up in it!”\nBalloon operators in World War I were early adopters of the parachute\nHydrogen-filled balloons were crucial during World War I to help direct artillery fire, spot troop movements and note enemy positions like depots and trenches.\n“As a result, balloons become a prized target of the enemy,” Mr Paone said. Some of the earliest uses of airplanes were missions to destroy them. “When an observation balloon goes up, now everything that you’ve done or everything you’re trying to hide from the enemy can be seen.” And the launch of one was often quickly followed by artillery fire, he added.\nEnemy fire could cause a balloon to explode, forcing American balloon observers who saw an attack coming to jump out. They were among the early adopters of parachutes.\nSilk parachutes were attached to the side of the balloon basket in cone-shaped devices. After jumping over the side of the basket, the observer’s weight would cause the parachute to come out as they descended, Mr Paone said.\n“There are tales of observers who jumped two or three times in one day,” Mr Paone said. “They would get attacked again; they jumped.”\nJapan sent 9,000 balloons with bombs over the US in World War II\nThe only people to die in an attack on the continental US during World War II were six people who encountered a Japanese balloon bomb, known as a Fu-Go, during a picnic in Oregon in May 1945.\nThe victims, Elsie Mitchell and five children from a Sunday school class, were killed when they found the bomb and it exploded.\nFrom November 1944 to April 1945, Japan launched around 9,000 balloons carrying bombs to travel more than 6,000 miles (9,656km) across the Pacific Ocean to the US, according to the National Museum of the US Air Force. There were 285 balloons found in states, including Michigan, Wyoming and Texas.\nIn Europe, Americans used untethered blimps called K-Ships for observation and in a few cases for attacks.\n“K-Ships become a critical aspect of anti-submarine warfare because they can hover and go slow and you can have a whole bunch of people with binoculars looking in all directions at the sea from a pretty good height,” Mr Paone said. “And they’re able to see periscopes or other changes in the water that can point to a submarine.”\nOn D-Day, the 320th Barrage Balloon Battalion, an African American unit, became the first barrage balloon battalion to land in France.\nBarrage balloons were large, unmanned tethered balloon whose cables created a hazard for aircraft, forcing them to fly higher and reducing the effectiveness of strafing and bombing, according to the National World War II Museum in New Orleans.", "url": "https://www.straitstimes.com/world/united-states/a-brief-history-of-spying-with-balloons"}