{"authors": [], "date_download": "2024-10-12 13:37:45", "date_modify": "2024-10-12 13:37:45", "date_publish": "2024-09-02 19:35:03", "description": "CAIRO/GAZA - Israeli forces killed at least 48 Palestinians in the past 24 hours across the Gaza Strip as they battled Hamas-led militants, Palestinian officials said on Monday, while medics conducted a second day of polio vaccinations for children in the enclave. Read more at straitstimes.com.", "filename": "world_middle-east_israeli-fire-kills-dozens-in-gaza-polio-vaccinations-in-full-swing_1728740265.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/LYNXMPEK810C2-1.jpg?VersionId=zLevrqsSiWXeChf3TyHnC11xm1VPq8hf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israeli-fire-kills-dozens-in-gaza-polio-vaccinations-in-full-swing_1728740265.html", "title": "Israeli fire kills dozens in Gaza, polio vaccinations in full swing", "title_page": "Israeli fire kills dozens in Gaza, polio vaccinations in full swing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CAIRO/GAZA - Israeli forces killed at least 48 Palestinians in the past 24 hours across the Gaza Strip as they battled Hamas-led militants, Palestinian officials said on Monday, while medics conducted a second day of polio vaccinations for children in the enclave.\nPalestinian and UN officials said more than 80,000 children had been vaccinated in central areas of Gaza on Sunday, the first day of the campaign.\nHamas and Israel have agreed to brief pauses in fighting to allow the campaign to vaccinate some 640,000 children to go ahead. No violations have been reported near vaccination facilities.\nSeven Palestinians were killed in two Israeli air strikes on Gaza City, Palestinian officials said on Monday, while two air strikes killed six others in Bureij and Nuseirat, two of the Gaza Strip's eight historic refugee camps.\nThere was no immediate comment from the Israeli military.\nThe armed wings of Hamas and the Islamic Jihad said fighters had confronted Israeli forces in north, south and in some central area of Gaza with anti-tank rockets and mortar fire.\nUNRWA, the U.N. Palestinian refugee agency, repeated its call on Monday for an immediate ceasefire to help ensure a successful and safe polio vaccination campaign.\n\"On 1st day only, @UNRWA teams & partners reached around 87,000 children according to @WHO. Efforts are ongoing to provide children with this key vaccine, but what they need most is a #CeasefireNow,\" it said on the X social media platform.\nIsrael and Hamas have continued to trade blame for the failure to conclude a ceasefire, that would end the war, and see the release of Israeli and foreign hostages held in Gaza and many Palestinians jailed in Israel.\nDEADLY DISEASE\nParents continued bringing their infants to be vaccinated at medical facilities on Monday. The World Health Organization (WHO) says a drop in routine vaccinations in the Occupied Palestinian Territories, including Gaza, has contributed to the re-emergence of polio in the area.\nPolio myelitis is a highly infectious virus that can cause paralysis and death in infants, with under-2s most at risk.\nThe WHO confirmed last month that a baby was partially paralysed by the type 2 polio virus, the first such case in the territory in 25 years.\n\"I am happy that I vaccinated my children against polio so that they don't suffer from anything in the future, God willing. Hopefully all Gazan children get vaccinated not only against polio but against other diseases too,\" said Waffa Abdelhadi after getting her two daughters, aged five months and five years old, vaccinated at a medical facility in Deir Al-Balah.\nShe had to navigate roads devastated by war, with wrecked residential buildings on all sides, to reach the facility.\n\"We don't (only) want vaccinations. We want them to stop the war,\" said Abdelhadi, adding she had been displaced with her family seven times in recent months.\nPalestinians say a key reason for the return of polio is the collapse of the health system and the destruction of most Gaza hospitals. Israel accuses Hamas of using hospitals for military purposes, which the Islamist group denies.\nThe 11-month old war in Gaza was triggered after Hamas militants on Oct. 7 stormed into southern Israel, killing 1,200 people and taking more than 250 hostages by Israeli tallies.\nSince then, an estimated 40,786 Palestinians have been killed and more than 94,000 injured in Gaza, the enclave's health ministry said on Monday.\nIsraeli protesters took to the streets for a second day on Monday and the largest trade union launched a general strike to press the government to reach a deal to return hostages still held by Hamas, after six more captives were found dead in Gaza. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/israeli-fire-kills-dozens-in-gaza-polio-vaccinations-in-full-swing"}