{"authors": ["Toh Wen Li"], "date_download": "2024-10-12 13:44:35", "date_modify": "2024-10-12 13:44:35", "date_publish": "2017-06-01 16:40:00", "description": "President Donald Trump on Thursday (June 1 ) announced the United States' withdrawal from the Paris climate agreement,  a move which would isolate the US in global efforts to curb the warming of the planet. Read more at straitstimes.com.", "filename": "world_trump-set-to-reveal-decision-on-paris-climate-deal-5-things-to-know-about-the-accord_1728740675.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/T8efVoK0J4PDsypWQPRapyF_XJ-lFAPEFp3MNRxHK4s.jpg?VersionId=dLhxAGKgG16sPQfl83JVqCShEHT1oMNN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_trump-set-to-reveal-decision-on-paris-climate-deal-5-things-to-know-about-the-accord_1728740675.html", "title": "Donald Trump withdraws US from Paris climate deal: 5 things to know about the accord", "title_page": "Donald Trump withdraws US from Paris climate deal: 5 things to know about the accord | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "US President Donald Trump on Thursday (June 1 ) announced the United States' withdrawal from the Paris climate agreement, a move which would isolate the US in global efforts to curb the warming of the planet.\nHere are five things to know about the agreement.\n1. What is the Paris climate agreement?\nIt was established during a 2015 United Nations-led talks in the French capital, and legally ratified last year (2016).\nEvery nation signed on except for war-torn Syria and Nicaragua which insists that the deal is not tough enough.\nIn joining the climate accord, the 195 signatories pledged to reduce greenhouse gas emissions. However, they were given ample leeway in how much they planned to cut them by.\n2. Why is the US threatening to leave the agreement?\nMr Trump apparently believes that remaining in the accord would harm the US economy; impair the creation of jobs in areas such as Appalachia and the West, where his strongest supporters live; and undermine his \"America first\" message, the New York Times reported.\n\"We're going to cancel the Paris climate agreement and stop all payments of United States tax dollars to UN global warming programmes,\" Mr Trump promised during a major energy speech in late May 2016.\n\"This agreement gives foreign bureaucrats control over how much energy we use on our land, in our country. No way.\"\n3. How have other nations responded to Mr Trump's expected withdrawal from accord?\nWorld leaders have expressed dismay at the US President's climate stance, following the recent G-7 summit in Sicily.\nAfter the meetings ended, the US refused to sign onto a statement of support for the Paris accord approved by all other G-7 participants.\nGerman Chancellor Angela Merkel said that the climate conversations were unsatisfying.\nLeaders of the other G-7 nations - France, Japan, Canada, Britain and Italy - urged Mr Trump to remain a part of the agreement.\nMr Trump's aides have said that while the President was listening to the other leaders' arguments with an open mind, he did not feel obliged to heed their calls to remain within the pact, CNN reported.\n4. When will Trump announce his decision?\nHe will announce his decision at the White House Rose Garden at 3pm on Thursday (June 1), he tweeted late on Wednesday (May 31).\nOver the past week, he has suggested that he intends to fulfill his campaign promises to withdraw from the agreement.\nYet he has in the past changed his mind on major issues, and was still speaking to opponents of withdrawal even as his team prepares an announcement, CNN reported.\nThe White House was supposed to make a final decision on the climate pact earlier in May, but postponed the decision until the G-7 meeting.\n5. What will happen if the US leaves the agreement?\nThe departure of the US, which is the largest economy and second-largest greenhouse gas emitter in the world, would not dissolve the pact.\nHowever, it could trigger a cascade of events that would have profound effects on the planet. Other countries that were reluctant to join the pact could retract or soften their commitments to reducing planet-warming pollution, CNN reported.\nAlso, a US exit would be a major reversal of the Obama administration's efforts on climate change, and could trigger further efforts to undermine the landmark climate accord.\nFurthermore, the decision to withdraw could undermine the US' international credibility and negotiating power.\nSOURCES: NYTIMES, CNN", "url": "https://www.straitstimes.com/world/trump-set-to-reveal-decision-on-paris-climate-deal-5-things-to-know-about-the-accord"}