{"authors": [], "date_download": "2024-10-12 14:03:23", "date_modify": "2024-10-12 14:03:23", "date_publish": "2023-04-29 22:35:32", "description": "The attack marked a return of a pattern used by Russia to terrorise civilian populations. Read more at straitstimes.com.", "filename": "world_europe_deadliest-russian-attack-in-months-on-ukraine-s-cities-kills-at-least-25_1728741803.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/30/UKRAINERUSSIA16_0.JPG?VersionId=m.54GaUnnOfUdCkn70MFOJe3NNwNv7F7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_deadliest-russian-attack-in-months-on-ukraine-s-cities-kills-at-least-25_1728741803.html", "title": "Deadliest Russian attack in months on Ukraine’s cities kills at least 25", "title_page": "Deadliest Russian attack in months on Ukraine’s cities kills at least 25 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "UMAN, Ukraine – Mr Dmytro raced to the room where two of his children had been sleeping, after a Russian missile thundered into his apartment building in Uman, Ukraine, before dawn on Friday.\nHe forced the door open and stared into oblivion.\n“There was no room behind the door. Just a cloud of fire and smoke,” he said.\nBy the end of the day, he and his wife Inna had found no trace of Kyrylo, 17, or Sophia, 11.\nRussia on Friday launched its first widespread aerial assault in more than a month against Ukrainian civilian targets, killing at least 25 people, said Ukrainian officials.\nIt was the deadliest such attack since January.\nAt least 20 died at that one apartment block in Uman, its front face shorn off by the missile blast.\nThe attack marked a return to a pattern Russia adopted last year after its invasion failed to defeat Ukraine militarily, of launching large-scale barrages of missiles, rockets and drones at cities and towns far from the battlefields in the east and south.\nIt is a campaign intended partly to destroy civilian infrastructure.\nIt also appears aimed at terrorising and demoralising the population, with lethal reminders that no corner of the country is beyond Russia’s reach.\nOn Friday, Russian bombers over the Caspian Sea fired 23 cruise missiles that struck after 4am local time, and Ukrainian forces shot down 21 of them, Mr Valeriy Zaluzhnyi, commander of the Ukrainian military forces, said in a statement.\nThe Russian Defence Ministry said in a statement that it had used “high-precision, long-range” missiles against places where Ukrainian reservists had gathered.\nIt did not specify locations or offer evidence about what was hit. “The goal of the attack has been reached,” it added.\nThe barrage underscored the importance of Ukraine’s air defences, which have been highly effective but not perfect.\nIn Uman, Ms Inna and Mr Dmytro, who asked that their surnames not be used for security reasons, and their six-year-old son were unharmed.\nBut the stricken parents could not quite grasp that their other two children might be gone forever.\nMs Inna stood outside, where charred cars lined the carpark, staring at the wreckage of what had been her home and repeating into the wind that maybe the blast had carried Sophia and Kyrylo away, alive.\n“I did not know what to do,” Mr Dmytro said, recounting those inconceivable first moments.\n“Do I look for my older children or do I help my wife and the little one out of the house? Since I could not see my older children, I ran out.”\nA psychologist on the scene and their neighbours offered words of solace.\nIn addition to those killed on Friday, dozens were wounded and an unknown number unaccounted for. Over 100 people were registered as living in the 46 units of the devastated apartment building in Uman, officials said, but they did not know how many had been at home.\nAs firefighters doused flames rising from the rubble, rescuers uncovered bodies and survivors through the day and into the evening.\nA convoy of dump trucks came one after another to haul away debris so that workers could dig their way to the basement, where they hoped to find more people alive.", "url": "https://www.straitstimes.com/world/europe/deadliest-russian-attack-in-months-on-ukraine-s-cities-kills-at-least-25"}