{"authors": [], "date_download": "2024-10-12 14:18:28", "date_modify": "2024-10-12 14:18:28", "date_publish": "2024-05-21 00:24:09", "description": "The messages provoked outrage from politicians and elected representatives on social media. Read more at straitstimes.com.", "filename": "world_europe_eu-chiefs-express-condolences-over-raisi-death-prompting-outrage_1728742708.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/21/b20traisi202400520.jpg?VersionId=1Y0yUujGdH5p8d7.Hw.StM52hQag5bxA", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_eu-chiefs-express-condolences-over-raisi-death-prompting-outrage_1728742708.html", "title": "EU chiefs express 'condolences' over Raisi death prompting outrage", "title_page": "EU chiefs express 'condolences' over Raisi death prompting outrage | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS - The head of the EU and its foreign policy chief prompted outrage from some European politicians on May 20 after expressing their “condolences” over the death of Iran’s President Ebrahim Raisi.\nRaisi was confirmed dead on May 20 after search and rescue teams found his crashed helicopter in a fog-shrouded western mountain region in the Islamic republic.\n“The EU expresses its sincere condolences for the death of President Raisi and Foreign Minister Abdollahian, as well as other members of their delegation and crew in a helicopter accident. Our thoughts go to the families,” EU Council President Charles Michel said in a statement on X (formally known as Twitter).\nLater, Josep Borrell published a statement on X saying the EU “offers its condolences” after “the tragic helicopter crash on Sunday.”\nThe messages provoked outrage from politicians and elected representatives on social media.\nSwedish MEP David Lega asked Borrell on X: “Can you look the brave women and freedom fighters of Iran in the eye ever again? Can you look Floderus’ or Djalali’s families in the eye ever again? I can. Shame on you.”\nIn 2017, Swede Ahmadreza Djalali was sentenced to death in Iran on espionage charges – which his family say are utterly false.\nIn April 2022, Iran arrested Johan Floderus, a Swede working for the EU’s diplomatic service, as he was returning from a trip to Iran with friends.\nHe faces the death penalty on spying charges.\nBelgium’s former migration minister Theo Francken denounced the “European condolences for the death of a butcher and cruel mass murderer.”\nHe added: “You don’t speak in my name.”\nThe day before, the EU had activated its satellite mapping system to help Iran locate the helicopter.\nJanez Lenarcic, the EU Commissioner for Crisis Management announced on X on Sunday that the system had been activated and received criticism from other European politicians.\nMarie-Agnes Strack-Zimmermann, a member of the German Free Democratic Party said: “What a mockery of the brave fighters for human rights in Iran. I expect an explanation for this.”\nLenarcic said May 20 that the act was “simply an expression of the most basic humanity.”\nThe ultraconservative Raisi had been in office since 2021, during a time that has seen Iran rocked by mass protests, an economic crisis deepened by US sanctions, and armed exchanges with arch-enemy Israel. AFP", "url": "https://www.straitstimes.com/world/europe/eu-chiefs-express-condolences-over-raisi-death-prompting-outrage"}