{"authors": [], "date_download": "2024-10-12 14:17:20", "date_modify": "2024-10-12 14:17:20", "date_publish": "2024-07-25 21:25:50", "description": "The Hong Kong government has said it does not implement unilateral sanctions imposed by other countries. Read more at straitstimes.com.", "filename": "world_ukraine-asks-hong-kong-not-to-let-russia-circumvent-sanctions_1728742640.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/25/LYNXMPEK6O0NC-2.jpg?VersionId=IRZ_23DRI2uF.1PPnYldBlaMxT9Dxp2.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_ukraine-asks-hong-kong-not-to-let-russia-circumvent-sanctions_1728742640.html", "title": "Ukraine asks Hong Kong not to let Russia circumvent sanctions", "title_page": "Ukraine asks Hong Kong not to let Russia circumvent sanctions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - Ukraine's Foreign Minister Dmytro Kuleba on July 25 visited Hong Kong and called on its leader John Lee to prevent Russia from using Hong Kong as a way to circumvent Western sanctions imposed on Moscow for its full-scale war in Ukraine.\nBoth Hong Kong and China are seen by the US government as key routes for Russia to source materials for its military, including semiconductors and drone parts.\n\"Dmytro Kuleba... called on the Hong Kong administration to take measures to deprive Russia and Russian companies of the opportunity to use Hong Kong to circumvent restrictive measures imposed for Russian aggression against Ukraine,\" the Ukrainian ministry said in a statement.\nAccording to previously undisclosed US Commerce Department data reported by Reuters, Hong Kong remains a global sanctions evasion hotspot, although semiconductors and other restricted goods shipped through China and Hong Kong fell by a fifth this year.\nChina, the world's second largest economy, positions itself as neutral on the Ukraine war, but declared a \"no limits\" partnership with Russia days before the 2022 invasion.\nIt has also provided it diplomatic backing and helped keep Russia's wartime economy afloat.\nThe Hong Kong government has said in the past it does not implement unilateral sanctions imposed by other countries, but does enforce vigorously sanctions imposed by the United Nations Security Council, pursuant to the instructions of China's Foreign Ministry.", "url": "https://www.straitstimes.com/world/ukraine-asks-hong-kong-not-to-let-russia-circumvent-sanctions"}