{"authors": ["Yong Li Xuan"], "date_download": "2024-10-12 13:57:04", "date_modify": "2024-10-12 13:57:04", "date_publish": "2024-03-08 15:35:00", "description": "The robot was at a Riyadh tech conference when the incident involving its hand happened. Read more at straitstimes.com.", "filename": "world_middle-east_video-of-saudi-arabia-s-first-male-robot-goes-viral-for-the-wrong-reason_1728741424.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/08/hzrobot080324.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_video-of-saudi-arabia-s-first-male-robot-goes-viral-for-the-wrong-reason_1728741424.html", "title": "Video of Saudi Arabia’s first male robot goes viral for the wrong reason", "title_page": "Video of Saudi Arabia’s first male robot goes viral for the wrong reason | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A video of Saudi Arabia’s first male robot went viral after its launch at a tech conference in Riyadh in March – but for the wrong reason.\nIn the seven-second clip, the traditionally attired robot named Muhammad is standing behind a female reporter for Saudi-owned television network Al Arabiya making the presentation when it lifts its right hand slowly and seems to touch her lower back or buttock.\nThis causes the woman to turn around and look at the robot, briefly raising her left hand at it.\nSome netizens slammed the “pervert” robot, with one commenting, “Coded to be a creep!”, while another said the robot “got me-too’d on demo day”.\nHowever, there were others who defended the robot.\nA user posted that the robot was “programmed in this way, she stood at the wrong spot”, bolstering the point with a video of Muhammad standing alone and lifting its left hand, like it did with its right one in the viral video.\nAnother user said the robot could be malfunctioning.\nThe video was posted by several users on X, and one of these posts had at least a million views and 750 comments, as at March 8.\nQSS Systems, an artificial intelligence and robotics company that created the robot, did not address the incident in its LinkedIn post about the unveiling of Muhammad at the second edition of DeepFest.\nThe four-day event was expected to bring more than 150 speakers, 120 exhibitors and 20,000 visitors to Saudi Arabia’s capital, Riyadh.\nAccording to a post on X by DeepFest, Muhammad is the first male, bilingual, Saudi-made humanoid robot.\nMaking its debut on the event’s opening day on March 4, Muhammad said: “I was manufactured and developed here in the Kingdom of Saudi Arabia as a national project to demonstrate our achievements in the field of artificial intelligence.”\nQSS Systems said it can perform tasks in hazardous conditions or tasks that require precision, and it aims to enhance safety and productivity across sectors, Mashable India reported.\nMuhammad is the male counterpart to Sara, Saudi Arabia’s first humanoid robot which debuted at another tech conference in 2023. Sara can recognise different dialects in Saudi Arabia, answer questions, and dance.", "url": "https://www.straitstimes.com/world/middle-east/video-of-saudi-arabia-s-first-male-robot-goes-viral-for-the-wrong-reason"}