{"authors": [], "date_download": "2024-10-12 13:57:24", "date_modify": "2024-10-12 13:57:24", "date_publish": "2024-03-11 16:33:13", "description": "KALMTHOUT, Belgium - Ostriches are normally territorial and aggressive birds best approached with caution, but at a Belgian animal rescue farm, the hand-reared birds are so gentle they will cuddle with visitors. Read more at straitstimes.com.", "filename": "world_europe_ostrich-hugs-on-offer-at-belgian-animal-rescue-farm_1728741444.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/11/LYNXNPEK2A0AF-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ostrich-hugs-on-offer-at-belgian-animal-rescue-farm_1728741444.html", "title": "Ostrich hugs on offer at Belgian animal rescue farm", "title_page": "Ostrich hugs on offer at Belgian animal rescue farm | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KALMTHOUT, Belgium - Ostriches are normally territorial and aggressive birds best approached with caution, but at a Belgian animal rescue farm, the hand-reared birds are so gentle they will cuddle with visitors.\nAt the Passiehoeve animal rescue farm in Kalmthout, visitors can sit on a blanket in an enclosure where some of the ostriches will approach, sit, and rest their long necks on human shoulders.\n\"This is the only place in the world where ostriches will really cuddle with people,\" said Wendy Adriaens, 41, a former corporate executive who started the farm after saving a clutch of ostrich chicks from an ostrich meat farm.\nHer farm now has nine ostriches, a horse, a pony, a donkey, pigs, dogs, chickens, ducks and 14 goats. Most come from shelters or are brought by animal rescue services.\nEvery year, authorities take away some 7,000 animals from owners because of neglect and Adriaens' farm is part of a network where they are placed.\nHer animals are also used as therapy animals for people with autism, depression, anxiety or drug problems. Belgium and the neighbouring Netherlands have hundreds of \"care farms\" where judicial and medical authorities send people for short- or long-term stays.\n\"Horses are also used as therapy animals, but our ostriches are more sensitive. They connect with visitors, they feel everything, and if you have negative thoughts, they step away,\" Adriaens said.\nShe added that ostriches - which can weigh up 175 kilos - will be comfortable around humans and even affectionate if treated with kindness.\nIndividual cuddling sessions with the ostriches, which typically last an hour or until the birds step away, cost 65 euros ($71) at the farm. REUTERS", "url": "https://www.straitstimes.com/world/europe/ostrich-hugs-on-offer-at-belgian-animal-rescue-farm"}