{"authors": [], "date_download": "2024-10-12 13:42:09", "date_modify": "2024-10-12 13:42:09", "date_publish": "2023-10-14 00:44:00", "description": "It is due to reach the asteroid - 3.5 billion kilometres away - in August 2029. Read more at straitstimes.com.", "filename": "world_united-states_nasa-launches-spacecraft-to-explore-metal-rich-asteroid-psyche_1728740529.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/14/US-SPACE-ASTRONOMY-PSYCHE-152117.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_nasa-launches-spacecraft-to-explore-metal-rich-asteroid-psyche_1728740529.html", "title": "Nasa launches spacecraft to explore metal-rich asteroid Psyche", "title_page": "Nasa launches spacecraft to explore metal-rich asteroid Psyche | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KENNEDY SPACE CENTRE, Florida - Nasa on Friday launched a spacecraft from Florida on a journey to Psyche, the largest of several metal-rich asteroids known in our solar system and believed by scientists to be the remnant core of an ancient protoplanet, offering clues about Earth’s formation.\nThe Psyche probe, folded inside the cargo bay of a SpaceX Falcon Heavy rocket, blasted off under partly cloudy skies from Nasa’s Kennedy Space Centre in Cape Canaveral on a planned journey 3.5 billion km through space. The spacecraft, roughly the size of a small van, is due to reach the asteroid in August 2029.\nThe launch, shown live on Nasa TV, marks the latest in a series of recent Nasa missions seeking insights about the origins of our planet about 4.5 billion years ago by sending robotic spacecraft to explore asteroids – primordial relics from the dawn of the solar system.\nAsteroid Psyche measures roughly 279km across at its widest point and resides on the outer fringes of the main asteroid belt between the planets Mars and Jupiter.\nCargo-faring panels enclosing the spacecraft inside the nose of the rocket’s upper stage were jettisoned about five minutes after the launch, and the probe itself was released into space about an hour later. Nasa said the process for the spacecraft to autonomously unfurl its twin solar panels and to point its communications antennae towards Earth takes around two hours.\nMission controllers at Nasa’s Jet Propulsion Laboratory (JPL) near Los Angeles confirmed detection of the probe’s first radio signals shortly after it was seen on live video floating free from the rocket.\nThe JPL team plans to spend the next three to four months conducting checks of the spacecraft’s systems before sending it on its deep space journey, propelled by solar-electric ion thrusters being used for the first time on an interplanetary mission.\nAfter reaching the asteroid, the spacecraft would then orbit it for 26 months, scanning Psyche with instruments built to measure its gravity, magnetic properties and composition.\nAccording to the leading hypothesis, Psyche is the once-molten, long-frozen inner hulk of a baby planet torn apart by collisions with other celestial bodies in the early solar system. It orbits the Sun about three times farther than Earth, even at its closest to our planet.\n‘Outer space to explore inner space’\nThe first asteroid of its kind chosen for study at close range by spacecraft, Psyche is believed to consist largely of iron, nickel, gold and other metals, with a collective hypothetical monetary value placed at 10 quadrillion dollars.\nBut the mission has nothing to do with space mining, according to scientists. Its objective is to gain greater understanding of the formation of Earth and other rocky planets that are built around cores of molten metal. Earth’s molten centre is too deep and too hot to ever be examined directly.\n“So we say, tongue-in-cheek, that we’re going to outer space to explore inner space,” Professor Lindy Elkins-Tanton, Psyche’s principal investigator for Nasa’s mission partner Arizona State University, told a briefing for reporters on Tuesday.", "url": "https://www.straitstimes.com/world/united-states/nasa-launches-spacecraft-to-explore-metal-rich-asteroid-psyche"}