{"authors": [], "date_download": "2024-10-12 14:02:42", "date_modify": "2024-10-12 14:02:42", "date_publish": "2022-06-15 10:07:38", "description": "Russian forces are contending with a growing insurgency made up of civilians and former soldiers. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-it-is-retaking-territory-in-the-south-near-kherson_1728741762.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/15/AK_ukrsol_150622.jpg?VersionId=jWK3ZOW0Q2UAbx.NqhKVPO7Nqy0wCaNZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-it-is-retaking-territory-in-the-south-near-kherson_1728741762.html", "title": "Ukraine says it is retaking territory in the south near Kherson", "title_page": "Ukraine says it is retaking territory in the south near Kherson | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (NYTIMES) - As its forces struggle against the power of Russia's vast arsenal of heavy artillery in the east, the Ukrainian military claimed on Tuesday (June 14)to be outmanoeuvring Russian forces in the south, steadily reclaiming towns and villages and bringing its forces to within 12 miles (19km) of the Russian-occupied city of Kherson.\nA lack of heavy artillery has slowed the Ukrainian effort in the south and makes it unlikely that Ukraine will launch a broader offensive soon to try to take back the city. But Russian forces are contending not only with the Ukrainian military, but also with a growing insurgency made up of civilians and former soldiers.\n\"The enemy continues to fight, but our units are gradually forcing him to liberate positions and test the strength of the second and third lines of defence, and in some cases to retreat further,\" the Ukrainian southern military command said in a statement.\nThe Russians do not comment on military setbacks and have portrayed the occupied regions as stable and benefiting from Moscow's embrace.\nUnable to advance in the south since the first weeks of the war, the Russians have focused on fortifying their positions and launching long-range strikes against Ukrainian military targets and the civilian population.\nSerhii Khlan, the head of Ukraine's Kherson regional military administration, said the Ukrainians had scored a number of tactical victories that would enable its forces to launch a broader counteroffensive when the time was right.\nHe said that the front in this pocket of fighting stretched over a dozen miles, with the Russians pushed back to \"positions that were inconvenient and not equipped for defence\", and that the battles were being fought between two villages west of the city of Kherson, the only provincial capital taken by Russian forces early in the war.\nWhile both sides have suffered heavy losses and neither seems poised to deliver anything resembling a decisive blow, the fighting remains intense in many places.\nActive fighting has been reported along more than 680 miles of the long and twisting front between Ukrainian and Russian forces, the commander of the Ukrainian Armed Forces, Valeriy Zaluzhny, said this week.\nAs Ukraine's forces press on the city of Kherson from the west, its military said it was also engaging the Russians in the northern reaches of the occupied territory.\nThere has been fighting around Davydiv Brid, an area about 100 miles north of Kherson, over control of a highway that is critical to Russian logistical operations.\nTwo weeks ago, the Ukrainian military reported that the Russians had blown up bridges over the Inhulets River to slow the Ukrainian advance. On Tuesday, the Ukrainian military said it had discovered that much of the riverbank was mined.\nIn Beryslav, a village on the west bank of the Dnieper River about 50 miles north of the city of Kherson, Ukraine said the entire district was under fire.\n\"Retreating, the occupiers resorted to looting and harassment of local residents,\" the Ukrainian military said.", "url": "https://www.straitstimes.com/world/europe/ukraine-says-it-is-retaking-territory-in-the-south-near-kherson"}