{"authors": [], "date_download": "2024-10-12 14:18:22", "date_modify": "2024-10-12 14:18:22", "date_publish": "2024-01-30 09:31:00", "description": "The US had granted sanctions relief for OPEC member Venezuela in October 2023. Read more at straitstimes.com.", "filename": "world_united-states_us-begins-reimposing-sanctions-on-venezuela-oil-may-come-next_1728742702.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/30/11112891.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-begins-reimposing-sanctions-on-venezuela-oil-may-come-next_1728742702.html", "title": "US begins reimposing sanctions on Venezuela, oil may come next", "title_page": "US begins reimposing sanctions on Venezuela, oil may come next | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON/CARACAS – The United States on Jan 29 began reinstating sanctions on Venezuela and a Biden administration source said a roll back of restrictions on the oil industry could be allowed to expire, after the South American country’s top court upheld a ban blocking the candidacy of the leading opposition hopeful in presidential elections.\nThe US had granted sanctions relief for Organisation of Petroleum Exporting Countries member Venezuela in October 2023 in recognition of a deal for elections in 2024.\nBut that relief was conditioned on President Nicolas Maduro’s government freeing certain opposition-linked and American prisoners and making progress towards removing bans on a number of opposition figures.\nThough Venezuela in December 2023 carried out a prisoner swop, the Maduro-allied Supreme Court on Jan 26 kept in place a ban on opposition candidate Maria Corina Machado, upholding prior findings that she had supported the sanctions, was involved in corruption and lost money associated with Venezuela’s foreign assets.\nSeveral opposition members were arrested the same day.\nIn a first reinstatement of sanctions, the Treasury Department said on the evening of Jan 29 that any US entities conducting transactions with Venezuelan state-owned gold mining firm Minerven will have until Feb 13 to wind them down.\nThe move came hours after a Biden administration official said the Treasury licence that broadly restored dealings with Venezuela’s oil industry would be allowed to expire on April 18 if Ms Machado and other opposition figures were not allowed to run.\n“Unless Maduro and his representatives in Venezuela are able to get back on track, specifically with regard to allowing all presidential candidates to compete in this year’s election, we will not be in a position to renew General Licence 44, which provides relief to Venezuela’s oil and gas sector when it comes up for renewal in April,” the White House official said on condition of anonymity.\nThe official said the US was also considering additional, unspecified measures to punish the Venezuelan government.\nWhite House national security spokesman John Kirby said earlier on Jan 29 that US measures would depend on Mr Maduro and his government.\n“They’ve got till the spring to honour their commitments,” he told a daily briefing.\n“They’ve got decisions they have to make before we weigh what decisions we’ll take.”\nMs Machado, a 56-year-old industrial engineer who overwhelmingly won an October opposition primary vote, said on Jan 29 that she would not move aside in favour of a substitute.\n“There is no retreat. We have a mandate, and we will complete it,” Ms Machado told a press conference in Caracas.\nThe ruling was “judicial crime”, she said, adding there will be many obstacles still to overcome, but there will be elections in 2024.\nMr Jorge Rodriguez, a lawmaker who heads Mr Maduro’s team in negotiations with the opposition, said prior to the Treasury decision that if Washington took “any aggressive action”, Venezuela’s response would be “serene, reciprocal and energetic”.\nMr Maduro repeated the same rhetoric during his weekly television show on the evening of Jan 29, without commenting directly on the Minerven decision. REUTERS", "url": "https://www.straitstimes.com/world/united-states/us-begins-reimposing-sanctions-on-venezuela-oil-may-come-next"}