{"authors": [], "date_download": "2024-10-12 13:56:06", "date_modify": "2024-10-12 13:56:06", "date_publish": "2023-12-01 09:01:00", "description": "The penguins might have evolved this trait because of their need to remain constantly vigilant. Read more at straitstimes.com.", "filename": "world_united-states_penguins-snatch-11-hours-of-sleep-through-seconds-long-micronaps_1728741366.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/01/FILES-SCIENCE-ANIMAL-CHINSTRAP-PENGUINS-200310.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_penguins-snatch-11-hours-of-sleep-through-seconds-long-micronaps_1728741366.html", "title": "Penguins snatch 11 hours of sleep through seconds-long micronaps", "title_page": "Penguins snatch 11 hours of sleep through seconds-long micronaps | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - In humans, nodding off for a few seconds is a clear sign of insufficient sleep – and can be dangerous in some situations, such as when driving a car.\nBut a new study, published on Nov 30, finds chinstrap penguins snooze thousands of times per day, accumulating their daily sleep requirement of more than 11 hours in short bursts averaging just four seconds.\nThe flightless birds might have evolved this trait because of their need to remain constantly vigilant, according to the authors of the paper in Science.\nThe researchers argued that the findings show, contrary to prior assumptions, the benefits of sleep can accrue incrementally, at least in some species.\nChinstrap penguins (Pygoscelis antarcticus), named for the thin black band of plumage that extends from ear to ear, may be the most abundant species of penguin.\nTheir current population is estimated at nearly eight million breeding pairs that are found mainly on the Antarctic Peninsula and South Atlantic Ocean islands.\nWhen nesting, single parent penguins have to keep watch over their eggs, guarding them from predatory birds called skuas while their partners are away on foraging trips that last several days.\nThey also have to defend their nests from other penguins that might try to steal nest material. Once a penguin partner finally returns, the couple switch roles.\nA team led by Dr Paul-Antoine Libourel of Lyon Neuroscience Research Centre implanted electrodes on 14 birds at a colony on King George Island in December 2019.\nThey recorded electrical activity in the brain and neck muscles, and they used accelerometers and the Global Positioning System to study body movement and location.\nCombined with video recordings and direct observation over multiple days, they were able to identify numerous peculiarities.\nThe penguins’ sleep occurred while standing or while lying to incubate their eggs, with the average bout lasting 3.91 seconds. In total, they slept more than 10,000 times a day.\nPenguins on the periphery got longer and deeper bouts of sleep than those in the centre – which can be explained by the excess noise and physical bumping that occurs in the middle of a colony, or the heightened risk of nest material theft.\nAlthough the scientists did not directly measure whether the birds were gaining the restorative benefits of sleep, the fact the penguins were successful at breeding led them to believe this was indeed the case, with the moments of neuronal silence providing windows for rest and recovery.\nIn humans, however, conditions that fragment sleep such as sleep apnea have impacts on cognitive function and might even precipitate neurodegenerative disease, such as Alzheimer’s.\n“Thus, what is abnormal in humans could be perfectly normal in birds or other animals, at least under certain conditions,” wrote scientists Christian Harding and Vladyslav Vyazovskiy in a related commentary piece. AFP", "url": "https://www.straitstimes.com/world/united-states/penguins-snatch-11-hours-of-sleep-through-seconds-long-micronaps"}