{"authors": [], "date_download": "2024-10-12 13:49:51", "date_modify": "2024-10-12 13:49:51", "date_publish": "2024-09-05 22:50:55", "description": "He faces an overflowing in-tray on his desk, not least with tricky budget legislation to pass. Read more at straitstimes.com.", "filename": "world_europe_michel-barniers-first-challenges-as-frances-new-pm_1728740991.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/LYNXMPEK840PF-1.jpg?VersionId=On2PbKaXgw4.b_sVgQX0657QVsYt_Xp1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_michel-barniers-first-challenges-as-frances-new-pm_1728740991.html", "title": "Michel Barnier’s first challenges as France’s new prime minister", "title_page": "Michel Barnier’s first challenges as France’s new prime minister | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – French conservative Michel Barnier, named prime minister by President Emmanuel Macron on Sept 5, faces an overflowing in-tray on his desk, not least with tricky budget legislation to pass.\nThe following are the likely next steps for Mr Barnier as he settles into his new office.\nForming a government\nThe political veteran’s first order of business will be to come up with a new government, which has to be signed off on by Mr Macron.\nGiven Mr Macron’s lack of a parliamentary majority, Mr Barnier will need to carefully weigh who gets what ministerial portfolio, as opposition parties will be unforgiving towards any casting errors.\nVote of confidence\nBy tradition, soon after forming a government the new prime minister delivers a speech to the national assembly outlining policy priorities, such as possible reforms.\nIf the new premier does not then seek a vote of confidence in the Lower House of Parliament, opposition parties can seek one instead.\nA vote of no-confidence against Mr Barnier’s government would require 289 votes in favour in the 577-seat Lower House.\nWith leftist parties set to vote against, Mr Barnier’s political survival is likely to hinge on the far-right National Rally abstaining from a vote against him.\nThey have said that they would wait and see what he has to say about immigration and changing France’s voting system.\nBudget\nIf Mr Barnier makes it past that hurdle, the first major policy challenge he faces is drafting the 2025 budget legislation, which must be handed over to lawmakers by Oct 1.\nThat leaves precious little time for Mr Barnier’s team to finish off work already prepared by the outgoing government by mid-September, when the national public finance watchdog is by law due a chance to weigh on whether the numbers stack up.\nThat will be no easy task, with the budget deficit in 2024 already running billions of euros over target, leaving Mr Barnier tough choices about calibrating spending cuts and tax rises.\nOnce the Bill is delivered to Parliament, Mr Barnier’s new finance minister will have to fend off attempts to radically rewrite it amid calls from the left for broad-based tax hikes.\nThe budget Bill’s likely rocky progress through Parliament will probably take the rest of the year, with a final vote usually in the course of December.\nIf opposition parties are not satisfied, they can call a vote of confidence, putting Mr Barnier’s government at risk of being toppled. REUTERS", "url": "https://www.straitstimes.com/world/europe/michel-barniers-first-challenges-as-frances-new-pm"}