{"authors": [], "date_download": "2024-10-12 13:29:32", "date_modify": "2024-10-12 13:29:32", "date_publish": "2024-09-18 03:51:52", "description": "Russian Foreign Minister Sergei Lavrov outlined to the visiting head of the International Committee of the Red Cross on Tuesday what he described as numerous Ukrainian rights violations over the course of the 2-1/2-year old war, his ministry said. Read more at straitstimes.com.", "filename": "world_europe_russias-lavrov-tells-red-cross-of-ukrainian-wartime-rights-violations_1728739772.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/18/LYNXMPEK8G0OS-1.jpg?VersionId=RO9NXo3XLzshu7QrOAOBOIvb_Y9Wgggz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russias-lavrov-tells-red-cross-of-ukrainian-wartime-rights-violations_1728739772.html", "title": "Russia's Lavrov tells Red Cross of Ukrainian wartime rights violations", "title_page": "Russia's Lavrov tells Red Cross of Ukrainian wartime rights violations | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Russian Foreign Minister Sergei Lavrov outlined to the visiting head of the International Committee of the Red Cross on Tuesday what he described as numerous Ukrainian rights violations over the course of the 2-1/2-year old war, his ministry said.\nA ministry statement said Lavrov, in his talks with Mirjana Spoljaric, set out \"the numerous facts of Ukraine's violations of norms of international humanitarian rights, including in the context of treatment of prisoners of war and civilians\".\nThe ICRC, in a statement at the end of Spoljaric's two-day visit, said she restated the need for all states \"to fulfil their obligations under international humanitarian law\", including visits to prisoners of war.\nShe also called for protection of humanitarian workers following the killing of three ICRC staff last week when shelling hit a distribution site on the eastern front.\nThe Russian statement said discussions focused on \"key issues of humanitarian action\" in the Middle East, the Horn of Africa, Sahel countries and Europe and Asia. Both sides, it said, agreed to boost cooperation.\nRussia's Commissioner for Children's Rights, Maria Lvova-Belova, said on Monday that she had met Spoljaric and discussed the reunification of Russian families whose children were elsewhere in Europe.\nLvova-Belova and Russian President Vladimir Putin are sought on a warrant by the International Criminal Court in connection with the deportation of Ukrainian children during the war. Russia dismisses the warrants as meaningless and politically motivated.\nRussia and Ukraine regularly accuse each other of failing to comply with international norms of humanitarian law.\nUkraine said on Monday it had asked the United Nations and the ICRC to join humanitarian efforts in the Kursk region, where its forces remain after staging an incursion last month. REUTERS", "url": "https://www.straitstimes.com/world/europe/russias-lavrov-tells-red-cross-of-ukrainian-wartime-rights-violations"}