{"authors": [], "date_download": "2024-10-12 13:47:29", "date_modify": "2024-10-12 13:47:29", "date_publish": "2023-05-02 23:15:00", "description": "Parts of Spain are the driest in a thousand years, with drought depleting reservoirs to half their normal capacity. Read more at straitstimes.com.", "filename": "world_europe_historic-drought-sees-spaniards-pray-for-rain_1728740849.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/02/aispain0205.JPG?VersionId=xE6BJY22cWTxJwbQD6NYROSpQEFihcAk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_historic-drought-sees-spaniards-pray-for-rain_1728740849.html", "title": "Historic drought sees Spaniards pray for rain", "title_page": "Historic drought sees Spaniards pray for rain | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JAEN, Spain - Drought is so severe in parts of Spain that thousands of people are invoking the heavens, desperate for rain.\nOn Monday, parishioners in the southern city of Jaen held a procession, carrying aloft a statute of Christ called “El Abuelo” to pray for rain for the first time since 1949.\nThousands attended the procession as experts say parts of Spain are the driest in a thousand years, with drought depleting reservoirs to half their normal capacity, figures show.\n“We are in the midst of a persistent drought and the aim of this procession is to invoke the Lord to help us and save us,” Mr Ricardo Cobos, a member of the El Abuelo brotherhood, told AFP.\nOn April 25, Spain asked the European Union for emergency funds to help the country’s farmers grapple with a severe drought threatening crops.\nTwo days later, mainland Spain recorded its hottest temperature ever for April, hitting 38.8 deg C in Cordoba, preliminary data showed.\nWater reservoirs are at half their capacity nationally and the COAG farmers’ union says 60 per cent of farmland is “suffocating” from lack of rainfall.\nSpain is the world’s biggest exporter of olive oil and a key source of Europe’s fruit and vegetables.\n“We are very dependent on olive trees and the cultivation of oil, therefore when the land stops receiving water it is an economic catastrophe,” said Mr Cobos.\nLast year, Spain experienced its hottest year since records began, with United Nations figures suggesting nearly 75 per cent of its land is susceptible to desertification due to climate change.\nBack in Jaen, eyes are on the sky.\n“I have come to see the Lord and I have great faith that he will give us water”, said Ms Antonia Contreras, who came to follow the procession from a neighbouring town. AFP", "url": "https://www.straitstimes.com/world/europe/historic-drought-sees-spaniards-pray-for-rain"}