{"authors": [], "date_download": "2024-10-12 14:07:13", "date_modify": "2024-10-12 14:07:13", "date_publish": "2023-10-31 08:55:54", "description": "Peruvian President Dina Boluarte said on Monday that she would discuss a plan to tackle drug trafficking in an upcoming meeting with her U.S. counterpart, Joe Biden, as she travels to Washington for a regional summit. Read more at straitstimes.com.", "filename": "world_peru-president-to-discuss-drug-trafficking-with-biden_1728742033.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/31/LYNXMPEJ9U01F-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_peru-president-to-discuss-drug-trafficking-with-biden_1728742033.html", "title": "Peru president to discuss drug trafficking with Biden", "title_page": "Peru president to discuss drug trafficking with Biden | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LIMA - Peruvian President Dina Boluarte said on Monday that she would discuss a plan to tackle drug trafficking in an upcoming meeting with her U.S. counterpart, Joe Biden, as she travels to Washington for a regional summit.\nBoluarte will be in the U.S. from Wednesday to Saturday for the inaugural Americas Partnership for Economic Prosperity Leaders summit and an Inter-American Development Bank (IDB) forum.\nShe and Biden will talk about \"the full-frontal fight against drug trafficking, along with the country's efforts to garner larger and better investments,\" Boluarte told journalists.\nPeru is one of the world's largest producers of coca leaf and cocaine, according to the United Nations.\nBoluarte's trip - her fourth abroad as president - comes as Peru limps through an economic recession due to the El Niño climate phenomenon, lower private investment and lingering social conflicts. REUTERS", "url": "https://www.straitstimes.com/world/peru-president-to-discuss-drug-trafficking-with-biden"}