{"authors": [], "date_download": "2024-10-12 13:40:50", "date_modify": "2024-10-12 13:40:50", "date_publish": "2024-08-13 12:08:18", "description": "ISTANBUL - The United States is asking Turkey and other allies that have ties with Iran to persuade it to de-escalate tensions in the Middle East, the U.S. ambassador to Turkey said. Read more at straitstimes.com.", "filename": "world_europe_united-states-asking-turkey-to-prevail-on-iran-to-de-escalate-tensions-envoy-says_1728740450.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/13/LYNXMPEK7C03H-2.jpg?VersionId=NP4p9uQvV6z0TR4GnxtSopLYFtGARv.X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_united-states-asking-turkey-to-prevail-on-iran-to-de-escalate-tensions-envoy-says_1728740450.html", "title": "United States asking Turkey to prevail on Iran to de-escalate tensions, envoy says", "title_page": "United States asking Turkey to prevail on Iran to de-escalate tensions, envoy says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ISTANBUL - The United States is asking Turkey and other allies that have ties with Iran to persuade it to de-escalate tensions in the Middle East, the U.S. ambassador to Turkey said.\nAmbassador Jeff Flake made the comments as the region braces for possible attacks by Iran and its allies after the killing of senior members of Hamas and Hezbollah.\nIsmail Haniyeh, the political leader of Iran-backed Hamas, was assassinated in the Iranian capital Tehran on July 31, triggering threats of revenge by Iran against Israel, which is fighting the Palestinian Islamist group in Gaza. Iran blamed Israel for the killing. Israel has not claimed responsibility.\n\"We ask all of our allies that have any relations with Iran to prevail on them to de-escalate, and that includes Turkey,\" Flake said at a round-table with journalists in Istanbul as he comes to the end of his posting in Turkey.\n\"They're doing what they can to make sure that it doesn't escalate,\" he said of Washington's Turkish interlocutors, adding that they \"seem more confident than we are that it won't escalate\".\nU.S.-Turkey ties have been strained in recent years by the U.S. alliance with Syrian Kurds that Turkey deems terrorists, and over Turkey's purchase of Russian S-400 defences that prompted U.S. sanctions and removal from a F-35 jet programme.\nHowever, Flake said that he thought U.S.-Turkey relations are now \"in a better place than we've been in a while.\"\nHe noted the \"useful role\" that Turkey had played in what was the biggest prisoner exchange between the United States and Russia since the Cold War in Ankara at the start of August.\n\"They weren't involved in the negotiation side, but on the logistics side, they played a significant role,\" he said.\nIn an interview with Reuters in June, Flake had said that Turkey remained firmly anchored in the West and its partnership with the United States has never been stronger.\nBut Flake said on Monday that the Gaza situation had been \"very difficult\", with President Tayyip Erdogan's rhetoric against Israel making it difficult for Turkey to play a role as an interlocutor. He said the divide between Ankara and Washington on Gaza had narrowed after Washington started \"actively calling\" for a ceasefire, but friction remained.\nSeparately, Flake said the United States was still concerned about military-linked hardware going to Russia from Turkey, calling on Ankara to step up cooperation to prevent the exports.\n\"It remains a concern of ours, and we raise it frequently and consistently,\" he said. \"When we talk to our contacts here, what we'll stress is that our goal is to ensure that Russia is denied the ability to wage war.\"\n\"We still see significant items coming through Turkey,\" he said. \"So we're looking for better cooperation there and in many ways we're getting it. I know that Russia is complaining, which is a good sign.\" REUTERS", "url": "https://www.straitstimes.com/world/europe/united-states-asking-turkey-to-prevail-on-iran-to-de-escalate-tensions-envoy-says"}