{"authors": [], "date_download": "2024-10-12 14:08:18", "date_modify": "2024-10-12 14:08:18", "date_publish": "2022-08-26 07:17:35", "description": "Analysts predict Republicans have a solid chance of taking control of the House of Representatives and possibly the Senate. Read more at straitstimes.com.", "filename": "world_united-states_biden-has-harsh-words-for-republicans-says-trump-philosophy-like-semi-fascism_1728742098.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/26/md_biden_26082022.jpg?VersionId=meFOLjHeAGSj9yBBXlrjNkJVlf5FgUMQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-has-harsh-words-for-republicans-says-trump-philosophy-like-semi-fascism_1728742098.html", "title": "Biden lashes out at ‘MAGA’ Republicans, says Trump philosophy like 'semi-fascism'", "title_page": "Biden lashes out at ‘MAGA’ Republicans, says Trump philosophy like 'semi-fascism' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROCKVILLE, MARYLAND (REUTERS) - US President Joe Biden had harsh words to describe Trump-allied Republicans on Thursday (Aug 25) as he held his first political rally in the run-up to November elections, accusing the group of embracing violence and hatred, and saying they edged toward “semi-fascism” at an earlier fund-raising stop.\nMr Biden, kicking off a coast-to-coast tour, is looking to lend his support to Democratic candidates and prevent Republicans from taking control of Congress by touting the sharp differences between the two major US parties.\n“It’s not hyperbole, now you need to vote to literally save democracy again,” Mr Biden told an above-capacity crowd of several thousand at a Democratic National Committee event at Richard Montgomery High School in a Maryland suburb of Washington.\n“America must choose. You must choose. Whether our country will move forward or backward.\n“Trump and the extreme MAGA Republicans have made their choice – to go backwards full of anger, violence, hate and division,” he said, \"while Democrats have chosen to be a nation of unity and hope\".\nThe event was promoted by groups including women's health provider Planned Parenthood and anti-gun violence activists Moms Demand, as Democrats lean on a new gun safety law and Republican-backed abortion bans to improve their midterm prospects.\nMontgomery County voted more than 78 per cent for Mr Biden and Vice-President Kamala Harris in 2020.\nBefore the rally, Mr Biden met Democratic donors for a US$1 million (S$1.39 million) party fundraiser in a backyard in a leafy neighbourhood north of Washington.\nStrolling with a handheld mic, Mr Biden detailed the tumult facing the United States and the world from climate change. He spoke about economic upheaval and the future of China and was strongly critical of the direction of the Republican Party.\n\"We're seeing now either the beginning or the death knell of an extreme MAGA agenda,\" Mr Biden said, referring to former President Donald Trump's 'Make America Great Again' slogan. \"It's not just Trump... It's almost semi-fascism,\" he said.\nRepublicans are hoping to ride voter discontent with inflation to victory in November, and they have history on their side. The party that controls the White House usually loses seats in Congress in a new president's first midterm elections, and political analysts predict Republicans have a solid chance of taking control of the House of Representatives and possibly the Senate.\nDemocrats hold only a thin majority in the House, while the Senate is evenly divided, with the vice president's tie-breaking power giving Democrats control.\nRepublican control of one or both chambers could thwart Mr Biden's legislative agenda for the second half of his four-year term. Heavy losses could also intensify questions about whether Mr Biden, 79, should run for re-election in 2024 or hand over to a younger generation.\nBut Mr Biden and his team are increasingly hopeful that a string of recent legislative successes, and voters' outrage at the Supreme Court's overturning of the 1973 ruling that recognised women's constitutional right to abortion, will generate strong turnout among Democrats.\nDemocrats want Mr Biden's trip to boost the president's poor poll numbers and draw attention to his achievements. But some candidates for Congress worry that campaigning with Mr Biden will hurt them in the Nov 8 election.\nMr Biden, whose latest approval rating is 41 per cent, is polling lower than most, if not all, Democratic candidates in competitive races, often by double digits, Democratic pollsters said.", "url": "https://www.straitstimes.com/world/united-states/biden-has-harsh-words-for-republicans-says-trump-philosophy-like-semi-fascism"}