{"authors": [], "date_download": "2024-10-12 13:48:00", "date_modify": "2024-10-12 13:48:00", "date_publish": "2024-08-01 22:49:42", "description": "BUDAPEST - A group of protesting Hungarian farmers lead two camels through downtown Budapest on Thursday, heading to the farm ministry in a bid to raise awareness of the severe impact of climate change on Hungary's agricultural sector. Read more at straitstimes.com.", "filename": "world_europe_hungarian-farmers-lead-camels-through-budapest-to-highlight-climate-change_1728740880.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/ST-logo-placeholder_25.jpg?VersionId=f5QOmbQaXilFofTdMp0fAYrt5hQWrd7V", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_hungarian-farmers-lead-camels-through-budapest-to-highlight-climate-change_1728740880.html", "title": "Hungarian farmers lead camels through Budapest to highlight climate change", "title_page": "Hungarian farmers lead camels through Budapest to highlight climate change | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BUDAPEST - A group of protesting Hungarian farmers lead two camels through downtown Budapest on Thursday, heading to the farm ministry in a bid to raise awareness of the severe impact of climate change on Hungary's agricultural sector.\n\"The link between camels and the desert is obvious,\" protest organizer Laszlo Kulcsar said. \"That is why we thought of this idea to use camels to highlight the desertification of the country.\"\nClimate change poses an increasing threat to Hungary, especially the central Homokhatsag region, a crucial agricultural zone producing corn, grain and sunflowers, scientists have warned. The sector has suffered billion-dollar losses in recent years due to severe droughts.\nThe protesters, numbering around 60 and accompanied by musicians and performance artists, demanded that the government launch a program to retain excess rainwater and floodwater for irrigation during dry periods.\n\"Right now rivers are constrained between dams, we have strict flood protection, we are protecting ourselves from floods, but instead of that, we should be managing floods,\" farmer Peter Balogh said.\nIn 2022 a \"historic\" drought caused 1000 billion forints ($2.7 billion) of losses for the agricultural sector, according to the farm ministry.\nThis year, Hungary has experienced similar dry spells. A Hungarian Meteorological Service report published on Wednesday said that over 80% of the country's territory is experiencing mid-level to severe drought.\nThis year's drought has already caused a loss of at least 240 billion forints ($655 million) in profits from corn production alone, economist Gyorgy Rasko was quoted as saying by TV channel RTL. REUTERS", "url": "https://www.straitstimes.com/world/europe/hungarian-farmers-lead-camels-through-budapest-to-highlight-climate-change"}