{"authors": [], "date_download": "2024-10-12 13:57:53", "date_modify": "2024-10-12 13:57:53", "date_publish": "2024-07-31 23:34:23", "description": "VATICAN CITY - Pope Francis left the Vatican on Wednesday afternoon for a short trip to the Roman seaside neighborhood of Ostia, where he met a French Catholic nun known for decades of work with the LGBTQ community. Read more at straitstimes.com.", "filename": "world_europe_pope-visits-catholic-nun-who-works-with-lgbtq-community_1728741473.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/LYNXMPEK6U0SN-1.jpg?VersionId=dUHliiCXjfzzSGdbbAgHEpKPE8ogIfn4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_pope-visits-catholic-nun-who-works-with-lgbtq-community_1728741473.html", "title": "Pope visits Catholic nun who works with LGBTQ community", "title_page": "Pope visits Catholic nun who works with LGBTQ community | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VATICAN CITY - Pope Francis left the Vatican on Wednesday afternoon for a short trip to the Roman seaside neighborhood of Ostia, where he met a French Catholic nun known for decades of work with the LGBTQ community.\nThe visit came a few months after the Vatican apologized for the pope's reported use of a vulgar Italian slur about gay people in a closed-door meeting with Italian bishops.\nIn a brief statement, the Vatican said the pope had met with Sr. Genevieve Jeanningros near a popular roller coaster and circus venue called Luna Park.\nJeanningros, a member of the Little Sisters of Jesus congregation, is known for living in a caravan near the park, where she also ministers to the local circus community.\nThe Vatican did not provide further information about the meeting, but did share images showing Francis blessing a religious statue near some of the roller coasters.\nIn a June interview with the Vatican's newspaper, L'Osservatore Romano, Jeanningros said she often comes to the Vatican on Wednesdays to attend the pope's weekly audience. She said she frequently brings members of the LGBTQ community with her, to meet the pontiff as he greets the crowd.\nAsked by the newspaper about the pope's reported use of the gay slur, Jeanningros said that, among her friends, \"at first there was a bit of pain, but looking back they had a laugh and said, really, he's not like that\". REUTERS", "url": "https://www.straitstimes.com/world/europe/pope-visits-catholic-nun-who-works-with-lgbtq-community"}