{"authors": [], "date_download": "2024-10-12 13:44:24", "date_modify": "2024-10-12 13:44:24", "date_publish": "2023-10-18 22:15:16", "description": "Scientists suspected a meteorite impact had caused this marsquake. Read more at straitstimes.com.", "filename": "world_scientists-surprised-by-source-of-largest-quake-detected-on-mars_1728740664.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/18/wgt-mars-181023.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_scientists-surprised-by-source-of-largest-quake-detected-on-mars_1728740664.html", "title": "Scientists surprised by source of largest quake detected on Mars", "title_page": "Scientists surprised by source of largest quake detected on Mars | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – On May 4, 2022, Nasa's InSight lander detected the largest quake yet recorded on Mars, one with a 4.7 magnitude – fairly modest by Earth standards but strong for our planetary neighbour.\nGiven that Mars lacks the geological process called plate tectonics that generates earthquakes on our planet, scientists suspected a meteorite impact had caused this marsquake.\nBut a search for an impact crater came up empty, leading scientists to conclude that this quake was caused by tectonic activity – rumbling in the planet's interior – and giving them a deeper understanding about what makes Mars shake, rattle and roll.\n\"We concluded that the largest marsquake seen by InSight was tectonic, not an impact. This is important as it shows the faults on Mars can host hefty marsquakes,\" said planetary scientist Ben Fernando of the University of Oxford in England, lead author of the research published this week in the journal Geophysical Research Letters.\n\"We really thought that this event might be an impact.\n\"This represents a significant step forward in our understanding of Martian seismic activity and takes us one step closer to better unraveling the planet's tectonic processes,\" added Imperial College London planetary scientist and study co-author Constantinos Charalambous, co-chair of InSight's Geology Working Group.\nNasa retired InSight in 2022 after four years of operations. In all, InSight's seismometer instrument detected 1,319 marsquakes.\nEarth's crust – its outermost layer – is divided into immense plates that continually shift, triggering quakes. The Martian crust is a single solid plate. But that does not mean all is quiet on the Martian front.\n\"There are still faults that are active on Mars. The planet is still slowly shrinking and cooling, and there is still motion within the crust even though there are no active plate tectonic processes going on any more. These faults can trigger quakes,\" Dr Fernando said.\nThe researchers determined that the 4.7 magnitude quake was centred in the Al-Qahira Vallis region in the Martian Southern Hemisphere, roughly 2,000km south-east of InSight's location just north of the equator. They think it originated perhaps a few dozen km below the surface.\n\"Most of the marsquakes we've detected thus far have been associated with a region called Cerberus Fossae, located eastward of InSight. Conversely, the origin of this one left us puzzled as no discernible surface features indicated ongoing tectonic processes as a likely cause, particularly ones that would cause such a powerful quake,\" Dr Charalambous added.\nThe energy it released surpassed the cumulative energy from all the other marsquakes InSight recorded. The researchers initially noted similarities in its seismic signature to two meteorite impacts detected by InSight that gouged craters roughly 150m wide.\nThey enlisted the various space agencies with spacecraft monitoring the Martian surface – the European, US, Chinese, Indian and United Arab Emirates agencies – to check for evidence of an impact on the day of the quake. No luck.\n\"The absence of a crater in our image search for this large marsquake represents a significant milestone in interpreting seismic signals on Mars,\" Dr Charalambous said.", "url": "https://www.straitstimes.com/world/scientists-surprised-by-source-of-largest-quake-detected-on-mars"}