{"authors": [], "date_download": "2024-10-12 13:51:00", "date_modify": "2024-10-12 13:51:00", "date_publish": "2023-10-06 16:14:39", "description": "Declines in the indices for vegetable oils, dairy and meat offset the surge. Read more at straitstimes.com.", "filename": "world_europe_world-food-price-index-little-changed-in-sept-despite-sugar-surge-fao_1728741060.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/06/LYNXMPEJ95093-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_world-food-price-index-little-changed-in-sept-despite-sugar-surge-fao_1728741060.html", "title": "World food price index little changed in Sept despite sugar surge: FAO", "title_page": "World food price index little changed in Sept despite sugar surge: FAO | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME – The Food and Agriculture Organisation’s (FAO) world price index was largely stable in September, as declines in the indices for vegetable oils, dairy and meat offset a surge in sugar and maize prices.\nThe UN food agency’s price index, which tracks the most globally traded food commodities, averaged 121.5 points in September against a revised 121.6 for July, the FAO said on Friday.\nThe August reading was initially given as 121.4.\nThe September figure was 10.7 per cent down year on year and 24 per cent below an all-time high reached in March 2022 in the wake of Russia’s invasion of Ukraine.\nFAO’s cereal index rose 1 per cent from August.\nMaize prices surged 7 per cent, pushed up by strong demand for Brazilian supplies, slower selling in Argentina and increased barge freight rates in the United States.\nInternational wheat prices dropped 1.6 per cent, thanks to strong supplies and good production prospects in Russia.\nRice, which rocketed almost 10 per cent in August, dipped 0.5 per cent in September amid low import demand, the United Nations agency said.\nThe sugar index in September jumped 9.8 per cent from August, hitting its highest level since November 2010.\nThere were growing concerns over a tighter global supply outlook in the upcoming season, tied to worries about the impact of the El Nino weather pattern on production.\nVegetable oil prices fell 3.9 per cent.\nDairy prices dropped 2.3 per cent – the ninth successive monthly fall. Lacklustre global import demand and ample stocks in leading producing regions continued to weigh on the sector.\nMeat prices dipped 1 per cent.\nIn a separate report on cereal supply and demand, the agency forecast world cereal production in 2023 at 2.819 billion tonnes, up slightly from a previous estimate of 2.815 billion and some 0.9 per cent higher than 2022 levels, the FAO said.\nThe higher forecast was almost entirely driven by more positive yield estimates for Russia and Ukraine, owing to continued favourable weather conditions, it added.\nThe agency said its cereal supply and demand brief pegged global wheat output at 785 million tonnes, coarse grain production at 1.511 billion tonnes, up 2.7 per cent from 2022 and world rice output at 523.1 million tonnes. REUTERS", "url": "https://www.straitstimes.com/world/europe/world-food-price-index-little-changed-in-sept-despite-sugar-surge-fao"}