{"authors": [], "date_download": "2024-10-12 14:07:58", "date_modify": "2024-10-12 14:07:58", "date_publish": "2022-05-15 02:20:06", "description": "A phone call between the two men was direct and straightforward and \"conducted without aggravations\". Read more at straitstimes.com.", "filename": "world_europe_finlands-president-informs-russias-putin-of-nato-membership-bid_1728742078.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/15/FILES-FINLAND-UKRAINE-RUSSIA-CONFLICT-NATO-075449.jpg?VersionId=vTDIaljCqfBSuUiqQPFuWZj16F1X0gea&h=e0a22aa5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_finlands-president-informs-russias-putin-of-nato-membership-bid_1728742078.html", "title": "Finland's president informs Russia's Putin of Nato membership bid", "title_page": "Finland's president informs Russia's Putin of Nato membership bid | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HELSINKI (AFP) - Finnish President Sauli Niinisto spoke with his Russian counterpart Vladimir Putin on Saturday (May 14) about the Nordic country's application for Nato membership, expected to be announced this weekend, his office said.\nThe phone call, which was \"initiated by Finland... was direct and straightforward and it was conducted without aggravations. Avoiding tensions was considered important,\" Niinisto was quoted as saying in a statement by his office.\nBut the Kremlin responded by saying that Putin viewed any end to Finland's military neutrality as a \"mistake.\"\n\"Putin stressed that the end of the traditional policy of military neutrality would be a mistake since there is no threat to Finland's security,\" it said in a statement.\n\"Such a change in the country's political orientation can have a negative impact on Russian-Finnish relations developed over years in a spirit of good neighbourliness and cooperation between partners,\" the Kremlin added.\nFinland is expected to officially announce its Nato membership bid on Sunday.\nFinnish Foreign Minister Pekka Haavisto underlined that it was \"very important that we communicate with our neighbour\", even if \"we don't ask any permission for our political steps\".\nThe minister was speaking from Berlin, where he was seeking to remove a potential barrier to his country's accession plans - Turkey.\nUkraine invasion swung opinion\nAccusing Finland and Sweden of harbouring \"terrorist organisations\", Turkish President Recep Tayyip Erdogan had said he did \"not have a positive opinion\" on their membership bids.\nArriving for talks in Berlin with Nato counterparts as well as Haavisto and Sweden's foreign minister, Turkey's Mevlut Cavusoglu reiterated the accusations against the Nordic countries.\nBut he did signal readiness for discussions.\n\"A big majority of the Turkish people are against the membership of those countries who are supporting PKK terrorist organisation... but these are the issues that we need to talk of course with our Nato allies as well as these countries,\" he said.\nOn Saturday, the Finnish grid operator said that Russia suspended electricity supplies to Finland overnight after its energy firm RAO Nordic threatened to cut off supplies over payment arrears.\n\"It is at zero at the moment, and that started from midnight as planned,\" Timo Kaukonen, manager for operational planning at Fingrid, said.\nNevertheless, Finland - which only imports about 10 per cent of its power from Russia - said the shortfall was being made up by imports from Sweden.\nAccording to Helsinki, Niinisto told Putin \"how fundamentally the Russian demands in late 2021 aiming at preventing countries from joining Nato and Russia's massive invasion of Ukraine in February 2022 have altered the security environment of Finland\".\nAlready on Thursday, Niinisto had told Russia: \"You caused this. Look in the mirror.\"", "url": "https://www.straitstimes.com/world/europe/finlands-president-informs-russias-putin-of-nato-membership-bid"}