{"authors": [], "date_download": "2024-10-12 14:06:01", "date_modify": "2024-10-12 14:06:01", "date_publish": "2022-10-11 21:54:57", "description": "Bloc’s leaders also pledge to take Russia’s president to account for deadly missile strikes across Ukraine. Read more at straitstimes.com.", "filename": "world_europe_g-7-to-pledge-support-for-ukraine-for-as-long-as-it-takes_1728741961.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/11/ads-kyivukr-111022.jpg?VersionId=XUB1sjx8yELeDVwIv6e3V56a_xzkxvhN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_g-7-to-pledge-support-for-ukraine-for-as-long-as-it-takes_1728741961.html", "title": "G-7 vows to support Ukraine ‘for as long as it takes’", "title_page": "G-7 vows to support Ukraine ‘for as long as it takes’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Leaders of the Group of Seven (G-7) nations on Tuesday pledged to help Ukraine “for as long as it takes”, as they vowed to hold Russian President Vladimir Putin to account for raining down cruise missiles across Ukraine, killing at least 19 people.\n“We will continue to provide financial, humanitarian, military, diplomatic and legal support and will stand firmly with Ukraine for as long as it takes,” the G-7 leaders said in a joint statement.\nThey said they were “undeterred and steadfast” in this commitment.\nAddressing Russia’s intense aerial assaults on cities in Ukraine, including the capital Kyiv, they said they “condemn these attacks in the strongest possible terms and recall that indiscriminate attacks on innocent civilian populations constitute a war crime”.\n“We will hold President Putin and those responsible to account,” they said.\nJoining them in a virtual meeting, Mr Zelensky asked the G-7 leaders to urgently supply his forces with air defence weapons to neutralise the threat Russia poses.\nHe also sought tough, new sanctions against Russia, and again ruled out talks with Mr Putin.\n“When Ukraine receives a sufficient quantity of modern and effective air defence systems, the key element of Russia’s terror – rocket strikes – will cease to work,” he said, thanking German Chancellor Olaf Scholz for speeding up delivery of the Iris-T air defence system and United States President Joe Biden for his promise to deliver more advanced air defence systems.\nMr Dmitry Peskov, a Kremlin spokesman, said on Tuesday that deploying these weapons systems will only extend the conflict and inflict more pain for Ukraine, and will not change Moscow’s goals in its \"special military operation\" in Ukraine.\nMr Zelensky likewise asked the G-7 to support an international mission to the Ukraine-Belarus border.\nBelarus this week announced its troops would be deployed with Russian forces near Ukraine, signalling a potential further escalation of the war.\nUkraine has no plans to attack Belarus, said Mr Zelensky, but it wants to make sure there is no threat from its northern neighbour.\nHis appeal to the leaders of the world’s most developed nations came just hours after Russia once again launched long-range air strikes on Tuesday, mostly targeting Ukraine’s energy infrastructure.\nUkrainians took shelter underground after air raid sirens blared nationwide, and the country’s Emergency Ministry warned of “a high probability of rocket attacks” throughout the day.\nBy early afternoon, the intensity of the missile strikes did not appear to be as severe as on Monday.\nUkraine claimed to have shot down several of the missiles, but more than 300 of its localities were still without power.\nThere were also reports on Tuesday of Kyiv’s forces striking a substation in the southern region of the Belgorod on the border with Ukraine, leaving some 2,000 people without electricity.\nMass retaliatory strikes hit Ukraine nationwide on Monday, after Moscow blamed Kyiv for a blast on a bridge connecting Russia to Crimea, a peninsula Moscow annexed from Ukraine in 2014.\nThe governor of the southern town of Mykolayiv said Russia seemed to have changed tactics.\n“They launch rockets more than once, so that our people can wait and our air defence can work. But, at intervals, they launch significantly fewer rockets and keep people in shelters. What is this if not terror?” he said on national television.\nIn Zaporizhzhia, Ukraine’s sixth-largest city, apartment blocks have been struck overnight at least three times in the past week, killing civilians while they slept.\nIn an overnight video address from the scene of one of the attacks in Kyiv, Mr Zelensky promised that Ukraine would keep fighting.\n“We will do everything to strengthen our armed forces. We will make the battlefield more painful for the enemy,” he said. REUTERS, NYTIMES", "url": "https://www.straitstimes.com/world/europe/g-7-to-pledge-support-for-ukraine-for-as-long-as-it-takes"}