{"authors": [], "date_download": "2024-10-12 14:01:52", "date_modify": "2024-10-12 14:01:52", "date_publish": "2023-05-25 01:40:24", "description": "He spoke to reporters on the Ukrainian side of the border with Russia. Read more at straitstimes.com.", "filename": "world_europe_leader-of-cross-border-raid-warns-russia-to-expect-more-incursions_1728741712.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/25/10650659_2.jpg?VersionId=VxGrK2WoEltFT1AG51zu4h5gc6B_8y0L", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_leader-of-cross-border-raid-warns-russia-to-expect-more-incursions_1728741712.html", "title": "Leader of cross-border raid warns Russia to expect more incursions", "title_page": "Leader of cross-border raid warns Russia to expect more incursions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEAR THE RUSSIAN BORDER, Ukraine - The Russian commander of a militia that conducted a raid on a Russian border region this week said on Wednesday his group would soon launch more incursions into Russian territory.\nMr Denis Kapustin, who described himself as the commander of the Russian Volunteer Corps (RVC), spoke to reporters on the Ukrainian side of the border with Russia, a day after Moscow said it had repelled the raid on the Belgorod region.\nKyiv has said the attack was carried out by Russian citizens, casting it as home-grown, internal Russian strife.\nTwo groups operating in Ukraine – the Russian Volunteer Corps (RVC) and Freedom of Russia Legion – have claimed responsibility.\nThe Russian military said it had routed the militants, who carried out their attack using armoured vehicles, and pushed those who survived back into Ukraine.\nMr Kapustin said two of his fighters had been “lightly wounded”, and that total losses on his side for the operation were two killed and 10 wounded.\nMoscow claimed it killed over 70 “Ukrainian nationalists”.\nMr Kapustin also said the fighters had taken a Russian armoured vehicle and anti-drone gun as trophies.\n“I think you will see us again on that side,” said Mr Kapustin, who introduced himself by his call-sign White Rex.\n“I cannot reveal those upcoming things, I cannot even reveal the direction. The… border is pretty long. Yet again, there will be a spot where things will get hot.”\nHe was asked repeatedly about Western media reports that his militia had used United States military equipment that was meant to help Ukraine defend itself against Russia’s invasion, but he declined to answer directly.\n“I know exactly where I got my weapons from. Unfortunately, not from the Western partners,” he said.\nHe also suggested that Western military equipment had been captured by Russia in the battle for Bakhmut in eastern Ukraine, and that such equipment could be bought on the black market.\n“I think I explained that the Western military aid unfortunately goes back and forth, being raided. In Bakhmut for instance I know that a lot of armoured vehicles, American armoured vehicles, got raided by the Russian forces,” he said.\nMr Kapustin said Ukraine only supported the RVC with information, petrol, food and medicine.\n“And, of course, the Ukrainian military took our wounded. But anything more than this would make things difficult.”\n“Every decision we make… beyond the state border is our own decision. Obviously, we can ask our (Ukrainian) comrades, friends for their assistance in planning,” he added.", "url": "https://www.straitstimes.com/world/europe/leader-of-cross-border-raid-warns-russia-to-expect-more-incursions"}