{"authors": [], "date_download": "2024-10-12 13:34:35", "date_modify": "2024-10-12 13:34:35", "date_publish": "2024-10-05 09:00:00", "description": "Sabrina Kauldhar, 30, was arrested at a suburban Toronto hotel on Oct 4. Read more at straitstimes.com.", "filename": "world_united-states_serial-killer-charged-with-three-murders-in-three-days-in-canada_1728740075.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/05/ST-logo-placeholder_6.jpg?VersionId=y4BOBnIcXCr9jY25WgFPWWmd.sQv7oFU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_serial-killer-charged-with-three-murders-in-three-days-in-canada_1728740075.html", "title": "‘Serial killer’ charged with three murders in three days in Canada", "title_page": "‘Serial killer’ charged with three murders in three days in Canada | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "OTTAWA – A woman described by the police as a serial killer was arrested and charged on Oct 4 with three murders this week in Toronto, Niagara Falls and another Canadian city.\nThe grisly attacks spanned three days from Oct 1 to Oct 3.\n“She is a serial killer,” Niagara police chief Bill Fordy told reporters when asked if the label was fitting.\nSabrina Kauldhar, 30, was arrested at a suburban Toronto hotel after the police linked the killings, determining the suspect’s description matched in each case.\nShe faces murder charges in the deaths of a 60-year-old woman in her Toronto home, a 47-year-old man in a Niagara Falls park and a 77-year-old man in a Hamilton, Ontario, parking lot.\nThe police chief said the suspect is believed to have randomly targeted her victims in Hamilton and Niagara Falls. Investigators told AFP the first victim in Toronto, who was found with “visible trauma” to the body, was known to her assailant.\nThe police came across the second victim in Niagara Falls after responding to emergency calls about a disturbance. He was pronounced dead at the park.\nThe last victim – a retired school teacher who was followed by the suspect to his vehicle in a Hamilton parking lot – suffered “significant injuries consistent with stab wounds”, the police said in a statement. He later died in hospital. AFP", "url": "https://www.straitstimes.com/world/united-states/serial-killer-charged-with-three-murders-in-three-days-in-canada"}