{"authors": [], "date_download": "2024-10-12 14:01:54", "date_modify": "2024-10-12 14:01:54", "date_publish": "2023-05-23 17:25:00", "description": "The Kremlin blamed a “sabotage” group that entered from Ukraine to mount a terror campaign. Read more at straitstimes.com.", "filename": "world_europe_anti-moscow-partisans-blamed-for-drone-strikes-in-russian-border-region_1728741714.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/23/UKRAINE-RUSSIA-CONFLICT-WAR-104608_1.jpg?VersionId=ndd0c2.IEOhogpaZlPKBvZj.zCG1YKWU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_anti-moscow-partisans-blamed-for-drone-strikes-in-russian-border-region_1728741714.html", "title": "Fighting in Russian border region enters second day after raid from Ukraine", "title_page": "Fighting in Russian border region enters second day after raid from Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW – Drones struck Russia’s border region of Belgorod, where security operations pressed into a second day after a cross-border raid blamed on fighters from Ukraine.\nThe region, which borders Ukraine, has been repeatedly shelled in attacks that have killed dozens since Moscow launched its offensive in 2022.\nSeveral drones struck houses and a government building overnight but did not result in casualties or deaths, Belgorod Governor Vyacheslav Gladkov wrote on Telegram.\nOn Monday, Russia said its troops were battling a “sabotage” group that entered from Ukraine. It said it was introducing an “anti-terror regime” in Belgorod, a first since the start of Moscow’s campaign in Ukraine in February 2022.\nMonday’s incursion, apparently involving armoured vehicles, was the biggest raid into Russia since the war began 15 months ago, though details including the number of fighters involved, their affiliation and the extent of any clashes, could not be independently confirmed.\nMr Gladkov said on Tuesday that the “defence ministry and law enforcement are continuing to clear the area”.\nHe previously said eight people were injured, adding that the authorities were helping people leave the scene of the fighting.\nHe added on Tuesday that it was too soon for residents who had fled to return to their homes, and said the authorities would give the all-clear when it was safe.\nMembers of the anti-Kremlin Freedom of Russia Legion and the Russian Volunteer Corps (RVC) have claimed responsibility for the incursion into Belgorod, but Kyiv has denied any involvement.\nIn a video released by a Telegram channel claiming to represent the group, a camouflaged spokesman, surrounded by armed men in fatigues, said: “Russia will be free!”, a slogan frequently used by Russian opposition activists.\n‘Guerrilla groups’\n“We want our children to grow up in peace and be free,” the spokesman added, with the channel claiming that two settlements, including Graivoron, were attacked.\nThe RVC published video footage late on Monday showing what it said was a fighter inspecting a captured armoured vehicle, putting a sticker with the group’s logo over the “Z” symbol used to identify Russian forces.\nAnother video showed what it said were fighters operating an armoured vehicle on a country road. Other videos posted on Russian and Ukrainian social media channels showed pictures and video of what were described as captured Russian servicemen and their identity documents.\nUkrainian presidential adviser Mikhaylo Podolyak suggested that Russian “guerrilla groups” could be responsible.\n“The only driving political force in a totalitarian country of tightened screws is always an armed guerrilla movement,” he said on Monday.", "url": "https://www.straitstimes.com/world/europe/anti-moscow-partisans-blamed-for-drone-strikes-in-russian-border-region"}