{"authors": [], "date_download": "2024-10-12 14:08:59", "date_modify": "2024-10-12 14:08:59", "date_publish": "2022-01-23 05:00:00", "description": "WASHINGTON • Biden administration officials have been talking with Qatar about possibly supplying Europe with liquefied natural gas (LNG) if a Russian invasion of Ukraine leads to shortages, according to people familiar with the matter. Read more at straitstimes.com.", "filename": "world_united-states_biden-officials-talking-to-qatar-about-supplying-gas-to-europe-0_1728742139.html", "image_url": "https://www.straitstimes.com/themes/custom/straitstimes/images/st-subscribe-placeholder.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-officials-talking-to-qatar-about-supplying-gas-to-europe-0_1728742139.html", "title": "Biden officials talking to Qatar about supplying gas to Europe", "title_page": "Biden officials talking to Qatar about supplying gas to Europe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON • Biden administration officials have been talking with Qatar about possibly supplying Europe with liquefied natural gas (LNG) if a Russian invasion of Ukraine leads to shortages, according to people familiar with the matter.\nPresident Joe Biden plans to ask the Persian Gulf nation's Emir, Sheikh Tamim Hamad Al Thani, to visit the White House, possibly as soon as later this month, two of the people said on Friday.\nThe meeting between Mr Biden and the Emir has been in the works for some time, a White House official said on Friday night.\nSome European nations have expressed fears that punishing Russia with harsh sanctions over the Ukraine crisis could wind up damaging their economies and prompt Russian President Vladimir Putin to cut off or scale back gas supplies in the middle of the winter.\nEurope gets more than 40 per cent of its natural gas from Russia, and about a third of Russian gas flowing to Europe passes through Ukraine.\nQatar is one of the world's biggest producers of LNG, with about three-quarters of the fuel sold to energy-poor Asian countries such as Japan and South Korea. It provides about 5 per cent of Europe's natural gas.\nThe Qatari embassy in Washington did not immediately respond to a request for comment.\nIn Europe, shifting to LNG is critical for countries such as Lithuania and Poland that are looking to escape the pipeline politics involved in buying gas from Russia.\nUS officials want to help ease Europeans' concerns about how they will heat their homes this winter, according to people familiar with the private discussions, who spoke on condition of anonymity.\nThe United States has been stepping up pressure on the Europeans to agree on a package of sanctions, showing signs of frustration at the pace of negotiations with and within the European Union despite weeks of talks.\nMr Putin has denied that he plans to invade Ukraine, but is demanding concessions and security guarantees from the North Atlantic Treaty Organisation (Nato) that the military alliance said it cannot provide.\nMeanwhile, the US on Friday announced large-scale Nato naval exercises in the Mediterranean beginning tomorrow and with the participation of aircraft carrier USS Harry Truman, as tensions flare with Russia, which is to hold its own maritime manoeuvres at the same time.\n\"Neptune strike 22 is going to run through Feb 4 and it's designed to demonstrate Nato's ability to integrate the high-end maritime strike capabilities of an aircraft carrier strike group to support the deterrence and defence of the alliance,\" said Pentagon spokesman John Kirby.\nMr Kirby said preparations for the exercise had begun in 2020 and that it had nothing to do with fears that Russia could invade Ukraine, on whose borders Moscow has massed tens of thousands of troops.\nUnited Nations Secretary-General Antonio Guterres said on Friday that a Russian invasion of Ukraine would be against international law and said he was confident that it would not happen.\n\"There should not be any military intervention. In this context, I think that diplomacy is the way to solve problems,\" Mr Guterres told reporters.\n\"I'm convinced it will not happen and I strongly hope to be right,\" he added.\nGerman Defence Minister Christine Lambrecht said yesterday Germany will send a field hospital to Ukraine, while once again rejecting Kiev's calls for weapons deliveries as fears of a Russian invasion grow.\nBerlin has already delivered respirators to Ukraine and severely injured Ukrainian soldiers are currently being treated in Bundeswehr hospitals, the minister told Welt am Sonntag newspaper.\n\"In February, a complete field hospital will be handed over, including the necessary training, all co-financed by Germany with €5.3 million (S$8 million),\" Ms Lambrecht said.\n\"We are standing on Kiev's side. We must do everything to de-escalate the situation.\n\"Weapons deliveries would not be helpful at the moment, that is the consensus within the government,\" she added.\nBLOOMBERG, AGENCE FRANCE-PRESSE", "url": "https://www.straitstimes.com/world/united-states/biden-officials-talking-to-qatar-about-supplying-gas-to-europe-0"}