{"authors": [], "date_download": "2024-10-12 13:40:20", "date_modify": "2024-10-12 13:40:20", "date_publish": "2024-06-20 16:50:52", "description": "WARSAW - Poland will send 20 soldiers to help secure the Olympic Games in Paris, the head of the Polish National Security Bureau told state news agency PAP, as organisers prepare for a major security challenge. Read more at straitstimes.com.", "filename": "world_europe_poland-to-send-20-soldiers-to-help-secure-paris-olympics_1728740420.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/20/ST-logo-placeholder_16.jpg?VersionId=5EaXDHC5JW2f08xiWTLzNhPvqkkR4WPK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_poland-to-send-20-soldiers-to-help-secure-paris-olympics_1728740420.html", "title": "Poland to send 20 soldiers to help secure Paris Olympics", "title_page": "Poland to send 20 soldiers to help secure Paris Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WARSAW - Poland will send 20 soldiers to help secure the Olympic Games in Paris, the head of the Polish National Security Bureau told state news agency PAP, as organisers prepare for a major security challenge.\nThe French capital has been on high alert since Islamist attacks in 2015 that killed 130 people and injured hundreds more, but the Olympics, and particularly the opening ceremony, will see safety measures boosted even further.\nWarsaw announced in March that a contingent of Polish troops, including dog handlers, would go to Paris as part of international efforts to keep the Olympics safe, but did not give details on numbers.\nNational Security Bureau chief Jacek Siewiera told PAP late on Wednesday that President Andrzej Duda had signed an order for 20 Polish soldiers to help their French counterparts.\nThe Polish personnel will provide assistance with security and counterterrorism measures from June 24 until the end of September.\nThe Olympic Games will take place from July 26 to Aug. 11, while the Paralympic Games run from Aug. 28 to Sept. 8. REUTERS", "url": "https://www.straitstimes.com/world/europe/poland-to-send-20-soldiers-to-help-secure-paris-olympics"}