{"authors": [], "date_download": "2024-10-12 14:09:00", "date_modify": "2024-10-12 14:09:00", "date_publish": "2023-03-01 18:02:29", "description": "Maxwell’s lawyers argued she was denied a fair trial and used as a scapegoat because Epstein evaded justice. Read more at straitstimes.com.", "filename": "world_united-states_ghislaine-maxwell-appeals-to-overturn-sex-crimes-conviction_1728742140.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/01/btghislaine20230301_1.jpg?VersionId=0qwRHUbyY8PCsHVh_PYylNFcdCCzFDvq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_ghislaine-maxwell-appeals-to-overturn-sex-crimes-conviction_1728742140.html", "title": "Ghislaine Maxwell appeals to overturn sex-crimes conviction", "title_page": "Ghislaine Maxwell appeals to overturn sex-crimes conviction | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Lawyers for Ghislaine Maxwell on Tuesday asked a federal appeals court to overturn her conviction and 20-year sentence for helping Jeffrey Epstein sexually abuse girls, US media reported.\nThe 61-year-old British socialite was convicted in December 2021 of recruiting and grooming young girls to be sexually abused by Epstein.\nThe American financier killed himself in jail in 2019 while awaiting his own sex-crimes trial. Maxwell, his lover turned close friend, was arrested the following year.\nIn a filing late on Tuesday with the US Court of Appeals for the Second Circuit in Manhattan, Maxwell’s lawyers argued that she was denied a fair trial and used as a scapegoat because Epstein evaded justice.\n“The government prosecuted Ms Maxwell as a proxy for Jeffrey Epstein. It did so to satisfy public outrage over an unpopular non-prosecution agreement and the death of the person responsible for the crimes,” defence attorney Arthur Aidala said in a statement quoted by ABC News.\nMaxwell’s lawyers argued that she was covered by a 2007 non-prosecution agreement between federal prosecutors in Florida and Epstein, which included a provision not to prosecute potential co-conspirators.\nEpstein was convicted in Florida in 2008 of paying young girls for massages but served just 13 months in jail under a secret plea deal.\nMaxwell’s lawyers also argued that prosecutors had waited too long to charge her and had violated the statute of limitations.\nAccording to ABC and Fox News, their filing said: “In its zeal to pin the blame for its own incompetence and for Epstein’s crimes on Maxwell, the government breached its promise not to prosecute Maxwell, charged her with time-barred offences, resurrected and recast decades-old allegations for conduct previously ascribed to Epstein and other named assistants.”\nThe lawyers also accused the government of joining forces with complainants’ civil attorneys, whose interests were financial, to develop new allegations that would support charges against Maxwell.”\nThe appeal also said trial judge Alison Nathan had wrongfully rejected a request by Maxwell in 2022 for a new trial.\nMaxwell had unsuccessfully argued that a juror, who had boasted of helping convince fellow panellists to convict her by recalling his own experiences as a sex abuse victim, had biased the jury.\nFollowing a months-long trial in New York, Maxwell was in June 2021 convicted on five of the six counts she was facing, including the most serious charge of sex-trafficking a minor.", "url": "https://www.straitstimes.com/world/united-states/ghislaine-maxwell-appeals-to-overturn-sex-crimes-conviction"}