{"authors": [], "date_download": "2024-10-12 13:37:18", "date_modify": "2024-10-12 13:37:18", "date_publish": "2024-08-20 06:00:00", "description": "Trump shares doctored images showing Taylor Swift support Donald Trump has shared doctored images on social media showing Taylor Swift and her fans support his presidential campaign, in an apparent effort to tap into the pop singer’s mega star power in the US election. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-aug-20-5_1728740238.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/bttrump220408720_0.jpg?VersionId=RrIIyg46i3KRQNttvRymDtLgrOhHE6BH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-aug-20-5_1728740238.html", "title": "While You Were Sleeping: 5 stories you might have missed, Aug 20", "title_page": "While You Were Sleeping: 5 stories you might have missed, Aug 20 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Trump shares doctored images showing Taylor Swift support\nDonald Trump has shared doctored images on social media showing Taylor Swift and her fans support his presidential campaign, in an apparent effort to tap into the pop singer’s mega star power in the US election.\nSwift has not yet publicly thrown her weight behind any presidential candidate in the November 5 election, but she backed President Joe Biden in 2020 and has previously been critical of Mr Trump.\nOn Aug 18, Mr Trump shared screenshots of posts with manipulated images – including some that an expert said appeared to be AI-generated – suggesting that the pop star and her fans, popularly known as Swifties, support his campaign.\nREAD MORE HERE\nBlinken says Netanyahu confirmed truce support, presses Hamas\nUS Secretary of State Antony Blinken said Aug 19 that Israeli Prime Minister Benjamin Netanyahu assured him of support for a US proposal to bridge gaps on reaching a Gaza ceasefire, and pressed Hamas to agree.\nFollowing three hours of talks with the prime minister in Jerusalem, Mr Blinken said that Netanyahu promised Israel would send a team to talks scheduled to resume this week, mediated by Egypt and Qatar.\n“In a very constructive meeting with Prime Minister Netanyahu today, he confirmed to me that Israel accepts the bridging proposal. He supports it. It’s now incumbent on Hamas to do the same,” Mr Blinken told reporters later in Tel Aviv.\nREAD MORE HERE\nExpelled former congressman Santos pleads guilty to corruption charges\nFormer US Representative George Santos pleaded guilty to criminal corruption charges on Aug 19, cementing the downfall of a novice politician who was expelled from Congress last year after a brief, scandal-plagued tenure.\nSantos, a Republican, was hit with federal charges in May 2023 for laundering campaign funds to pay for his personal expenses, charging donors’ credit cards without their consent, and receiving unemployment benefits while he was employed. He entered his guilty plea at a hearing before US District Judge Joanna Seybert in Central Islip, New York.\nSantos had initially pleaded not guilty. He had been in plea talks with prosecutors since last December.\nREAD MORE HERE\nUK grants permission for London City Airport expansion after appeal\nBritain’s government has approved plans to expand capacity at London City Airport by 2.5 million passengers, overturning parts of a previous local-level decision but maintaining a ban on Saturday afternoon flights.\nThe airport had sought to expand annual capacity to 9 million passengers, up from 6.5 million, by 2031. It wanted to take a number of measures, including seeking permission to push back a curfew on flights on Saturday afternoons from 12:30pm to 6:30pm local time. On Aug 19 a document published on the government website stated: “The Secretaries of State agree with the Inspectors’ conclusions, and agree with their recommendation. They have decided to grant planning permission, subject to revised conditions that maintain the existing Saturday curfew period.”\nThe decision is one of the first big infrastructure planning calls made by the new Labour government elected in July. Since taking office, ministers have pledged to streamline planning processes and boost construction in all sectors, but have also been forced to cancel some projects due to funding constraints.\nREAD MORE HERE\nGermany’s Gundogan retires from international football\nGerman midfielder Ilkay Gundogan has retired from international soccer, the 33-year-old said on Aug 19.\nGundogan, who joined Barcelona from Manchester City last year, made his debut for Germany in 2011 and scored 19 goals in 82 appearances for the national side.\n“After a few weeks of consideration, I have come to the conclusion that it is time to end my national team career,” Gundogan posted on social media.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-aug-20-5"}