{"authors": [], "date_download": "2024-10-12 13:59:52", "date_modify": "2024-10-12 13:59:52", "date_publish": "2022-10-06 21:51:27", "description": "Cases and deaths were highest in South-east Asia, East Asia and North Africa. Read more at straitstimes.com.", "filename": "world_europe_liver-cancer-deaths-predicted-to-soar-by-2040_1728741592.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/06/HZICU061022.jpg?VersionId=zs2lfidhTI0XqFiJOGN.KcpoMvwHLp6J", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_liver-cancer-deaths-predicted-to-soar-by-2040_1728741592.html", "title": "Liver cancer deaths predicted to soar by 2040", "title_page": "Liver cancer deaths predicted to soar by 2040 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The number of people who develop or die from liver cancer worldwide will increase by over 55 per cent by 2040 unless more is done to fight the often preventable disease, researchers said Thursday.\nSome 905,700 people were diagnosed with liver cancer, and 830,200 died from the disease, globally in 2020, according to a new analysis by scientists from the International Agency for Research on Cancer (IARC), an arm of the World Health Organisation based in Lyon, France.\nAt the current rate, 1.4 million people will be diagnosed and 1.3 million will die from liver cancer by 2040. That would mean an increase of 500,000 cases or deaths per year, \"unless we achieve a substantial decrease in liver cancer rates through primary prevention\", said IARC epidemiologist Harriet Rumgay, the study's lead author.\nThe study also found that liver cancer is one of the top three causes of cancer deaths in 46 countries - and is in the top five in nearly 100 countries.\nCases and deaths were highest in East and South-east Asia, as well as North Africa.\n\"Liver cancer causes a huge burden of disease globally each year,\" said study co-author Isabelle Soerjomataram.\n\"It is also largely preventable if control efforts are prioritised. Major risk factors include hepatitis B virus, hepatitis C virus, alcohol consumption, excess body weight, and metabolic conditions, including type 2 diabetes,\" she said in a statement.\nThe grim 2040 prediction illustrates the need for progress against hepatitis B and C after being disrupted by the Covid-19 pandemic, the researchers said, urging more vaccination, testing and treatment.\nDr Rumgay also called for \"measures to reduce population alcohol consumption and curb the rise in the prevalence of diabetes and obesity\".\nAnother IARC study recently suggested that 17 per cent of liver cancer cases can be avoided by reducing alcohol consumption.\nThe team based their analysis on the IARC's Globocan 2020 database, which has incidence and death estimates for 36 types of cancer across 185 countries. AFP", "url": "https://www.straitstimes.com/world/europe/liver-cancer-deaths-predicted-to-soar-by-2040"}