{"authors": [], "date_download": "2024-10-12 13:39:10", "date_modify": "2024-10-12 13:39:10", "date_publish": "2024-09-30 00:59:53", "description": "The plant's management said an artillery strike hit a transformer at the \"Raduga\" substation. Read more at straitstimes.com.", "filename": "world_europe_russian-held-zaporizhzhia-nuclear-plant-says-ukraine-again-attacks-substation_1728740350.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/30/LYNXMPEK8S08D-1.jpg?VersionId=yYVRRzVFE2UwYbjPS6IjxgLi3rCSXYPk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russian-held-zaporizhzhia-nuclear-plant-says-ukraine-again-attacks-substation_1728740350.html", "title": "Russian-held Zaporizhzhia nuclear plant accuses Ukraine of another substation attack", "title_page": "Russian-held Zaporizhzhia nuclear plant accuses Ukraine of another substation attack | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ZAPORIZHZHIA OBLAST - The management of the Russian-held Zaporizhzhia nuclear power station said on Sept 29 that Ukrainian forces had launched a new attack on a nearby electricity substation, destroying a transformer.\nThe Zaporizhzhia station – Europe’s largest with six reactors – was seized by Russian forces in the early days of Russia’s February 2022 invasion of Ukraine. Each side regularly accuses the other of attacking or plotting to attack the plant.\nThe plant’s management, writing on messaging app Telegram, said an artillery strike hit the transformer at the “Raduga” substation in the town of Enerhodar in south-eastern Ukraine.\nIt described the incident as “yet another terrorist act aimed at destabilising the situation in the Zaporizhzhia nuclear plant’s satellite city”.\nAlso posted was a photograph showing smoke billowing from the top of a building. It said power supplies to Enerhodar had not been interrupted.\nOn Sept 20, the plant’s management accused the Ukrainian military of attacking a second substation in Enerhodar.\nThe following day, Ukrainian Foreign Minister Andriy Sybiha accused Russia of planning strikes on Ukrainian nuclear facilities before winter. He provided no detailed explanation.\nPower lines to the Zaporizhzia plant have been cut on several occasions, increasing the chance of a blackout that could cause a nuclear accident.\nThe UN nuclear watchdog, the International Atomic Energy Agency, has stationed monitors permanently at the plant and urged both sides to refrain from all attacks on it. REUTERS", "url": "https://www.straitstimes.com/world/europe/russian-held-zaporizhzhia-nuclear-plant-says-ukraine-again-attacks-substation"}