{"authors": [], "date_download": "2024-10-12 14:01:00", "date_modify": "2024-10-12 14:01:00", "date_publish": "2024-03-13 22:37:30", "description": "TikTok would have to part ways from its Chinese parent company ByteDance or face a ban. Read more at straitstimes.com.", "filename": "world_united-states_house-of-representatives-passes-bill-that-could-ban-tiktok-in-the-us_1728741660.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/13/FILES-US-CHINA-INTERNET-POLITICS-TIKTOK-123650.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_house-of-representatives-passes-bill-that-could-ban-tiktok-in-the-us_1728741660.html", "title": "House of Representatives passes Bill that could ban TikTok in the US", "title_page": "House of Representatives passes Bill that could ban TikTok in the US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The US House of Representatives overwhelmingly passed a Bill on March 13 that would give TikTok’s Chinese owner ByteDance about six months to divest the US assets of the short-video app used by about 170 million Americans or face a ban.\nThe Bill was passed 352-65, with bipartisan support.\nBut it faces a more uncertain path in the Senate where some favour a different approach to regulating foreign-owned apps that could pose security concerns.\nDemocratic Senate Majority Leader Chuck Schumer has not indicated how he plans to proceed.\nTikTok called the Bill a “ban” and urged senators to listen to their constituents before taking any action.\n“This process was secret and the Bill was jammed through for one reason: It’s a ban.\n“We are hopeful that the Senate will consider the facts, listen to their constituents, and realise the impact on the economy, seven million small businesses, and the 170 million Americans who use our service,” a TikTok spokesperson said.\nTikTok’s fate has become a major issue in Washington.\nDemocratic and Republican lawmakers said their offices had received large volumes of calls from teenage TikTok users who oppose the legislation, with the volume of complaints at times exceeding the number of calls seeking a ceasefire between Israel and Hamas in Gaza.\nThe measure is also the latest in a series of moves in Washington to respond to US national security concerns about China, from connected vehicles to advanced artificial intelligence chips to cranes at United States ports.\nThe vote came just over a week after the Bill was proposed, and following one public hearing with little debate.\nIn February, US President Joe Biden’s re-election campaign joined TikTok, raising hopes among TikTok officials that legislation would be unlikely in 2024.\nThe House Committee on Energy and Commerce last week voted 50-0 in favour of the Bill, setting it up for a vote before the full House.\nMeanwhile, TikTok chief executive Chew Shou Zi was to visit Capitol Hill on March 13 on a previously scheduled trip to talk to senators, a source briefed on the matter said.\nThe company said before the vote: “This legislation has a predetermined outcome – a total ban of TikTok in the United States.” It added: “The government is attempting to strip 170 million Americans of their constitutional right to free expression.”\nMr Biden said last week that he would sign the Bill.\nWhite House National Security Adviser Jake Sullivan said on March 12 that the goal was ending Chinese ownership, not banning TikTok.\n“Do we want TikTok, as a platform, to be owned by an American company or owned by China? Do we want the data from TikTok – children’s data, adults’ data – to be staying here in America or going to China?” he said.\nIt is unclear if China would approve any sale or whether TikTok’s US assets could be divested in six months.\nIf ByteDance failed to do so, app stores operated by Apple, Alphabet’s Google and others would not be able to legally offer TikTok or provide Web hosting services to ByteDance-controlled applications.", "url": "https://www.straitstimes.com/world/united-states/house-of-representatives-passes-bill-that-could-ban-tiktok-in-the-us"}