{"authors": [], "date_download": "2024-10-12 13:59:00", "date_modify": "2024-10-12 13:59:00", "date_publish": "2024-06-21 00:55:03", "description": "Fears for jailed Kremlin critics have risen since opposition leader Alexei Navalny died in his Arctic prison in February. Read more at straitstimes.com.", "filename": "world_europe_prison-conditions-of-putin-critic-ilya-yashin-deteriorating-says-lawyer_1728741540.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/21/2024-06-05T174218Z33227344RC2D2Y96ESQURTRMADP3UKRAINE-CRISIS-RUSSIA-YASHIN.JPG?VersionId=U6p5Y0hK_V_u9lQr_Lvifz_qDrOq3otJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_prison-conditions-of-putin-critic-ilya-yashin-deteriorating-says-lawyer_1728741540.html", "title": "Prison conditions of Putin critic Ilya Yashin deteriorating, says lawyer", "title_page": "Prison conditions of Putin critic Ilya Yashin deteriorating, says lawyer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Prison conditions for Russian opposition politician Ilya Yashin - serving 8.5 years for denouncing Moscow’s invasion of Ukraine - have considerably worsened after he was moved to a punitive cell, his lawyer told AFP on June 20.\nFears for jailed Kremlin critics have risen since opposition leader Alexei Navalny died in his Arctic prison in February.\nYashin - a former ally of assassinated opposition figure Boris Nemtsov - was imprisoned in late 2022 for having denounced “murders of civilians” in the Ukrainian town of Bucha.\nAfter a court hearing, Yashin’s lawyer, Mr Mikhail Biryukov, told AFP that the 40-year-old was moved to a “PKT” prison cell, similar to one where Navalny was held.\nMr Biryukov said Yashin now has “limited movement on the territory of the prison and limited parcels and visits”.\nFood parcels are key to staying in good health in Russian prisons.\nMr Biryukov said Yashin was earlier kept in a “barrack of around 40 to 60 people” in a prison in the western Smolensk region.\nHe now has “special conditions” in a harsh isolation cell.\nYashin appeared via video-link at a court hearing to protest being designated a “foreign agent”, a label used to silence dissent.\n“This law was created to consolidate the power of Vladimir Putin,” he said.\nWearing a black prison uniform, he smiled and held on to metal bars of a cell, footage showed.\nHis mother, Tatiana Yashina, was at the hearing and said she was “of course worried” about the new conditions.\n“But we believe in him. That he will get through this,” she said.\nNow that he has been moved to the harsher cell, she will only be allowed “short (visits), once or twice a year”.\nVladimir Kara-Murza, a dual Russian and UK national serving 25 years on treason charges, has also been moved to the PKT cell in his Siberian prison.\nHis exiled lawyer, Mr Vadim Prokhorov, said on Facebook on June 19 that the prison administration had decided to place Kara-Murza there for “six months”.\nHe said the “formal reason” for the decision was that he “for a few seconds held his hand not behind his back.”\nIn the months before his death, Navalny was in and out of isolation cells. AFP", "url": "https://www.straitstimes.com/world/europe/prison-conditions-of-putin-critic-ilya-yashin-deteriorating-says-lawyer"}