{"authors": [], "date_download": "2024-10-12 14:07:10", "date_modify": "2024-10-12 14:07:10", "date_publish": "2022-09-30 04:10:18", "description": "Based in Germany and led by a high-ranking US general, it would train and equip the Ukrainian military. Read more at straitstimes.com.", "filename": "world_united-states_pentagon-plans-to-set-up-a-new-command-to-arm-ukraine-officials-say_1728742030.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/30/UKRAINE-RUSSIA-CONFLICT-WAR-190808.jpg?VersionId=baINsYSxRKiQaacNdhZBY07vwotIsrxi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_pentagon-plans-to-set-up-a-new-command-to-arm-ukraine-officials-say_1728742030.html", "title": "Pentagon plans to set up a new command to arm Ukraine, officials say", "title_page": "Pentagon plans to set up a new command to arm Ukraine, officials say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The Pentagon is preparing to overhaul how the United States and its allies train and equip the Ukrainian military, reflecting what officials say is the Biden administration's long-term commitment to support Ukraine in its war with Russia.\nThe proposal would streamline a training and assistance system that was created on the fly after the Russian invasion in February.\nThe system would be placed under a single new command based in Germany that would be led by a high-ranking US general, according to several military and administration officials.\nGeneral Christopher Cavoli, the top US officer in Europe, recently presented a proposal outlining the changes to Defence Secretary Lloyd Austin, the officials said.\nAustin and his top aides are reviewing the plan and are likely to make a final decision in the coming weeks, senior US officials said, adding that the White House and the Pentagon favoured the approach.\nThe officials spoke on the condition of anonymity to describe confidential discussions.\nJust as the Pentagon has committed more than US$16 billion (S$22 billion) in military aid to Ukraine - a combination of immediate shipments from stockpiles as well as contracts for weapons to be delivered over the next three years - the new command signals that the United States expects the threat from Russia to Ukraine and its neighbours to persist for many years, current and former senior US officials said.\n\"This recognises the reality of the important mission of security assistance to our Ukrainian partners,\" said Admiral James Stavridis, a former supreme allied commander for Europe.\n\"This will also create a formal security structure that our allies and partners can adhere to in terms of getting their equipment and training into the hands of the Ukrainians.\"\nThe new command, which would report to Cavoli, would carry out the decisions made by the Ukraine Defence Contact Group, a coalition of 40 countries that the Defence Department created after the Russian invasion to address Ukraine's needs and requests.\nAbout 300 people would be dedicated to the mission, which would be in Wiesbaden, Germany, the US Army's headquarters in Europe.\nMuch of the training of Ukrainian soldiers on US weapons systems is already taking place there or nearby.\nThe changes, which aim to give a formal structure to what has been improvised since the war's onset, are roughly modelled on US train-and-assist efforts in Iraq and Afghanistan over the past two decades. NYTIMES", "url": "https://www.straitstimes.com/world/united-states/pentagon-plans-to-set-up-a-new-command-to-arm-ukraine-officials-say"}