{"authors": [], "date_download": "2024-10-12 13:34:23", "date_modify": "2024-10-12 13:34:23", "date_publish": "2023-10-29 17:05:00", "description": "While Israel may succeed in destroying Hamas, it is ultimately fighting against an idea that may be more difficult to snuff out. Read more at straitstimes.com.", "filename": "world_middle-east_how-this-israel-hamas-conflict-is-like-nothing-that-s-happened-before_1728740063.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/29/dw-israel-border1-231029.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_how-this-israel-hamas-conflict-is-like-nothing-that-s-happened-before_1728740063.html", "title": "How this Israel-Hamas conflict is like nothing that has happened before", "title_page": "How this Israel-Hamas conflict is like nothing that has happened before | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM – The long history of the Israeli-Palestinian conflict is filled with bloodshed, dislocation and trauma. But even by those relative standards, the current conflagration stands out.\nFor one thing, it is especially brutal. Not since the Holocaust have as many Jews been massacred at one time as were on Oct 7, when Hamas militants stormed Israel, killing 1,400 people and taking more than 200 hostage.\nBefore Israel escalated its ground operations in the Hamas-run Gaza Strip, its retaliatory strikes, mostly from the air, killed more than 7,700, according to the Gazan authorities, and dislocated nearly half the population of 2.3 million, by an estimate of UN officials.\nIsrael’s decision to cut off power to Gaza – and severely limit water and food supplies – threatens a larger humanitarian calamity.\nBeyond that, this new chapter has changed the way Israelis see the threat from the Islamist group, and thus the measures they are prepared to take against it.\nFrom the start, Hamas, which the US and European Union designate a terrorist organisation, has been dedicated to the destruction of the state of Israel. For three decades, it has held on to that mission as other Palestinian leaders have committed to peaceful co-existence with Israel while pursuing their own state alongside it.\nHamas considers all of the Holy Land – which encompasses what today is Israel, the West Bank and Gaza – a divine Islamic endowment, and pledges in its charter to destroy Israel by any means.\nAfter Hamas showed what it is capable of on Oct 7, Israelis now say they are determined not just to suppress the group but to dismantle it, a goal that will entail more bloodshed and may not be achievable.\nHow we got here\nThe modern struggle between Arabs and Jews over ownership of the Holy Land is rooted in the nationalism that grew among both groups after the World War I-era collapse of the Ottoman Empire, which ruled the territory for centuries.\nIn 1920, the war’s victors gave Britain a mandate to administer what was then called Palestine. Intercommunal fighting in the territory was exacerbated by resistance among Arabs to Jewish immigration, which rose in the 1930s.\nIn the face of Nazi persecution, increasing numbers of Jews from abroad sought sanctuary in their ancient homeland, where Jews have lived for nearly 4,000 years.\nIn an effort to stop Arab-Jewish violence, a British commission in 1937 proposed partitioning the territory to create a state for each group. A decade later, the United Nations endorsed a different division.\nThe Arabs said no both times, while the Jews said yes.\nAfter declaring its independence in 1948, Israel was attacked by neighbouring Arab states, and its wartime gains established the borders of the new nation.\nThe Palestinians use the term Nakba, or disaster, to refer to this period, which produced an estimated 700,000 Palestinian refugees. Many of them fled to the Gaza Strip, then under Egyptian control.\nIn a subsequent 1967 war, Israel captured the rest of what had been Mandatory Palestine – Gaza plus the West Bank – and put Palestinian residents of the territories under military occupation.\nThe Palestine Liberation Organisation (PLO) came to prominence after that war, launching guerilla attacks on Israel and earning international recognition as the representative of the Palestinian people.\nA second intifada, from 2000 to 2005, was bloodier than the first.\nWith negotiations at a standstill, Israel in 2005 unilaterally withdrew its remaining forces from Gaza and uprooted Israeli settlers from the strip, while maintaining control of its airspace, maritime territory and entrances into Israel.\nIn 2006, Hamas defeated the PLO’s main faction, Fatah, in Palestinian legislative elections.\nAfter months of fighting between the two groups in Gaza, Hamas gained control of the territory in 2007 and has since used it periodically to launch rocket attacks and raids on Israel.\nFatah continues to dominate the Palestinian Authority, which is responsible for limited self-rule in the West Bank. Alarmed by the Hamas takeover, both Israel and Egypt imposed tight restrictions on goods and people moving in and out of Gaza – measures referred to as the blockade.\nIn recent years, Israel has taken limited steps to ease the constraints, including issuing permits for 20,000 Gazans to work inside Israel, where they could earn 10 times what they would at home.\nIt was commonly believed in Israel that Hamas was focused on improving Gaza’s economy, and that even if violence erupted from time to time, the threat Hamas posed could be contained to an acceptable level. Then came Oct 7.\nHamas’ assault on Israel\nThe attack on Israel that day began with a barrage of rocket strikes launched from Gaza.\nAs the sun rose, several thousand heavily armed Hamas militants burst out of the strip, mostly through holes they had blown in the fencing along the border with Israel. Some used paragliders or infiltrated by sea.\nThey penetrated army bases and attacked towns, as well as a music festival in the desert, seemingly with the sole purpose of killing or taking hostage as many Israelis as they could.\nPrior to the current war, Israel and Hamas fought half a dozen major military confrontations centred on Gaza, and engaged in a number of smaller clashes.\nThe recurring violence is particularly rough on children in Gaza, where 47 per cent of the population is younger than 18. A report in 2021 from the advocacy group Euro-Med Monitor found that nine out of 10 children in Gaza suffered some form of conflict-related trauma.\nThe war’s political fallout among Gazans will not be known for some time.\nIn 2014, just after Israel and Hamas fought their previous confrontation that comes closest to this one in ferocity – more than 2,100 Palestinians were killed and the strip suffered massive destruction – the Islamist group saw its popularity momentarily surge.\nBut a month later, polling showed Palestinians expressing dissatisfaction with the war’s achievements in the light of its costs.\nHamas’ standing began a decline that did not stop for another four years. The group got a more sustained boost after a bout of fighting in May 2021, but that was much more contained and far fewer Palestinians died.\nIt is impossible to know what those trends might mean for today’s conflict as there has not been one like this before. But the ways in which Palestinian attitudes are being shaped by the current tumult will surely play a role.\nIn their promised invasion of Gaza, Israeli forces aim to capture or kill Hamas members and to dismantle the group’s war-making capacities because, officials say, their citizens cannot live next to a group that is plotting their murder.\nBut more than men or weaponry, Hamas is an idea. Whether that idea survives Israel’s onslaught and inspires a new Hamas, or perhaps an even more radical successor, will depend on how the Israelis prosecute the war – but also on how the Palestinians ultimately come to regard the group that triggered this bloody new chapter. BLOOMBERG", "url": "https://www.straitstimes.com/world/middle-east/how-this-israel-hamas-conflict-is-like-nothing-that-s-happened-before"}