{"authors": [], "date_download": "2024-10-12 13:37:58", "date_modify": "2024-10-12 13:37:58", "date_publish": "2024-08-20 12:37:19", "description": "Ukrainian energy facilities have come under nearly daily bombardment over the past six months. Read more at straitstimes.com.", "filename": "world_europe_russia-launches-fifth-missile-attack-on-kyiv-in-august-ukraines-military-says_1728740278.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/LYNXMPEK7J08D-2.jpg?VersionId=.eYGRxs.jdoL_pdZtdFMrgA6lOrGCpnW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-launches-fifth-missile-attack-on-kyiv-in-august-ukraines-military-says_1728740278.html", "title": "Russia hits energy infrastructure in air strikes on Ukraine", "title_page": "Russia hits energy infrastructure in air strikes on Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Russia hit energy infrastructure in northern Ukraine in an overnight missile and drone attack and caused a big fire in the west of the country, resulting in an increase in chlorine levels in the air, Ukrainian officials said on Aug 20.\nUkraine’s air force commander said its forces shot down three ballistic missiles and 25 of the 26 drones launched in the attack on nine regions.\nRegional officials in the north-eastern Sumy region bordering Russia said an energy facility was hit, causing blackouts for 72 settlements and over 18,500 consumers.\nEnergy workers rushed to repair the damage, the regional administration said on the Telegram messaging app.\nUkrainian energy facilities have come under nearly daily bombardment over the past six months as the war grinds on following Russia’s full-scale invasion of the country in February 2022.\nUkraine buys electricity from its neighbours in the European Union but not enough to make up the deficit. Power cuts are regularly announced during peak evening consumption hours.\nAn industrial facility was attacked in the western region of Ternopil region during the latest bombardments, and a fuel reservoir was hit, officials said.\nUkrainian television showed huge columns of black smoke rising over Ternopil, and regional authorities urged people to stay indoors.\nMr Viktor Ustenko, a deputy head of the Ternopil regional administration, said more than 90 firefighters were involved in efforts to extinguish the fire.\n“The situation is fully under control,” Mr Ustenko said.\nAn attack on the capital Kyiv was repelled without major damage or casualties, officials said.\nThere was no immediate comment from Moscow about the attacks on Aug 20. Both sides say they target facilities key to the military and not civilian infrastructure, but many civilians have been killed in the war.\nMoscow has continued air strikes since Ukrainian forces began an incursion into Russia’s Kursk region on Aug 6, and Russian forces have been gradually advancing in parts of eastern Ukraine. REUTERS", "url": "https://www.straitstimes.com/world/europe/russia-launches-fifth-missile-attack-on-kyiv-in-august-ukraines-military-says"}