{"authors": [], "date_download": "2024-10-12 14:10:30", "date_modify": "2024-10-12 14:10:30", "date_publish": "2018-11-22 23:06:42", "description": "ISTANBUL (REUTERS) - A Turkish newspaper reported on Thursday (Nov 22) that CIA director Gina Haspel signalled to Turkish officials last month that the agency had a recording of a call in which Saudi Arabia’s crown prince gave instructions to “silence” Saudi journalist Jamal Khashoggi. Read more at straitstimes.com.", "filename": "world_middle-east_cia-had-recording-of-saudi-prince-demanding-jamal-khashoggi-be-silenced-says_1728742230.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/11/22/2018-11-19t142934z_1486260223_rc1be72b8a30_rtrmadp_3_saudi-king.jpg?VersionId=X1nvmih2hiLmTLZ7aLkk1qIy4E4xEhiY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_cia-had-recording-of-saudi-prince-demanding-jamal-khashoggi-be-silenced-says_1728742230.html", "title": "CIA had recording of Saudi prince demanding Jamal Khashoggi be 'silenced', says Turkish paper", "title_page": "CIA had recording of Saudi prince demanding Jamal Khashoggi be 'silenced', says Turkish paper | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ISTANBUL (REUTERS) - A Turkish newspaper reported on Thursday (Nov 22) that CIA director Gina Haspel signalled to Turkish officials last month that the agency had a recording of a call in which Saudi Arabia's crown prince gave instructions to \"silence\" Saudi journalist Jamal Khashoggi.\nAsked about the report, a Turkish official told Reuters he had no information about such a recording. Saudi Arabia has said Crown Prince Mohammed bin Salman had no prior knowledge of Khashoggi's killing at the Saudi consulate in Istanbul six weeks ago.\nWhen asked about the recording by reporters in Florida, US President Donald Trump said, \"I don't want to talk about it. You'll have to ask them.\"\nThe CIA declined to comment when asked about the report.\n\"There is talk of another recording,\" Hurriyet newspaper journalist Abdulkadir Selvi wrote in a column, saying the purported call took place between Prince Mohammed and his brother, Saudi Arabia's ambassador to Washington.\n\"It is being said that CIA chief Gina Haspel indicated this during her visit to Turkey,\" he wrote, adding that they had discussed Khashoggi, a critic of the kingdom's de facto ruler.\n\"It is being said the crown prince gave orders to 'silence Jamal Khashoggi as soon as possible',\" in a call which was monitored by the US agency, he said.\nKhashoggi was killed at the Saudi consulate in Istanbul on Oct 2 in an operation that Turkey's President Tayyip Erdogan has said was ordered by the highest level of Saudi leadership.\nAfter offering numerous contradictory explanations, Riyadh said last week Khashoggi had been killed and his body dismembered when negotiations to persuade him to return to Saudi Arabia failed.\nTrump said the CIA had not definitively concluded that the crown prince was responsible, and said he would stand by Saudi Arabia's leadership because it was a key US ally.\n\"We want low oil prices and Saudi Arabia has really done a good job in that respect,\" Trump said.\n\"I hate the crime. I hate what's done. I hate the cover up. And I tell you what: the crown prince hates it more than I do,\" Trump said, without providing further detail.", "url": "https://www.straitstimes.com/world/middle-east/cia-had-recording-of-saudi-prince-demanding-jamal-khashoggi-be-silenced-says"}