{"authors": [], "date_download": "2024-10-12 13:38:30", "date_modify": "2024-10-12 13:38:30", "date_publish": "2024-08-12 23:43:00", "description": "The exchange came as Israel has been bracing itself for a possible attack by Iran. Read more at straitstimes.com.", "filename": "world_middle-east_israels-prime-minister-defence-minister-trade-barbs-over-gaza-war-aims_1728740310.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/13/btnetanyahu20240813.JPG?VersionId=hUasMYJrngZ9Mbac7zEdXYka6kMfWtbT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israels-prime-minister-defence-minister-trade-barbs-over-gaza-war-aims_1728740310.html", "title": "Israel’s prime minister, defence minister trade barbs over Gaza war aims", "title_page": "Israel’s prime minister, defence minister trade barbs over Gaza war aims | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM – Israeli Prime Minister Benjamin Netanyahu traded barbs with his defence minister on Aug 12, underscoring the deep internal splits that continue to plague the government as the war in Gaza risks spilling out into a wider regional conflict.\nFollowing Israeli media reports quoting Defence Minister Yoav Gallant dismissing Mr Netanyahu’s war aim of total victory against the Islamist movement Hamas in Gaza as “nonsense”, Mr Netanyahu’s office put out a statement rebuking Mr Gallant.\n“When Gallant adopts the anti-Israel narrative, he harms the chances of reaching a hostage deal,” the statement said.\nIt said Israel’s war aim remained “total victory”, with the elimination of Hamas and the release of the remaining hostages seized by Hamas-led gunmen on Oct 7, 2023.\n“This is the clear directive of Prime Minister Netanyahu and the Security Cabinet, and it obligates everyone – including Gallant,” it said.\nThe exchange came as Israel has been bracing itself for a possible attack by Iran and the Iranian-backed Hezbollah movement in southern Lebanon, after a sharp escalation in tensions following a missile strike that killed 12 youngsters in the Israeli-occupied Golan Heights on July 27.\nIn the wake of that attack, Israel killed a senior Hezbollah commander in Beirut. A day later, Hamas political leader Ismail Haniyeh was assassinated in Tehran, drawing vows of retaliation from Iran.\nThe public reprimand of Mr Gallant, who has repeatedly clashed with Mr Netanyahu and the nationalist-religious parties in his coalition, was the latest episode of internal strife that has persisted since the government took office in 2022.\nIn 2023, Mr Netanyahu tried to sack Mr Gallant over his opposition to plans to curb the power of the Supreme Court, only to have to reverse course in the face of mass protests by hundreds of thousands of Israelis.\nThe latest exchange comes ahead of a last-ditch attempt to revive Egyptian and Qatari-brokered talks to halt the fighting in Gaza and bring back 115 Israeli and foreign hostages still held in the battered enclave.\nHamas has said it will not send a delegation to the meeting, accusing Mr Netanyahu of wanting to waste time rather than make an honest attempt to reach a deal. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/israels-prime-minister-defence-minister-trade-barbs-over-gaza-war-aims"}