{"authors": [], "date_download": "2024-10-12 13:34:54", "date_modify": "2024-10-12 13:34:54", "date_publish": "2024-09-23 09:55:00", "description": "Their current tactics risk the conflict spilling over into a wider regional war. Read more at straitstimes.com.", "filename": "world_middle-east_world-leaders-urge-israel-and-hezbollah-to-step-back-from-the-abyss_1728740094.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/23/ISRAEL-LEBANON-PALESTINIAN-CONFLICT-073718.jpg?VersionId=AzMFKRiyXVgp3VDLojT4hot3Szq4HYRi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_world-leaders-urge-israel-and-hezbollah-to-step-back-from-the-abyss_1728740094.html", "title": "World leaders urge Israel and Hezbollah to step back from the abyss", "title_page": "World leaders urge Israel and Hezbollah to step back from the abyss | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HAIFA, Israel – Israel and Hezbollah on Sept 22 threatened to escalate their cross-border attacks despite a chorus of international calls for both sides to step back from the brink of all-out war.\nIsraeli Prime Minister Benjamin Netanyahu said after intense rocket fire from Lebanon that Israel has dealt “a series of blows on Hezbollah that it could have never imagined”.\nA defiant Hezbollah deputy chief Naim Qassem said the group was in a “new phase” in its battle against Israel.\nBoth spoke after attacks on northern Israel sent hundreds of thousands of people to bomb shelters and caused damage in the Haifa area.\n“No country can tolerate attacks on its citizens,” Mr Netanyahu said nearly a year into the Gaza war sparked by Hamas’ Oct 7 attack on Israel that has also drawn in Iran-backed groups across the region, including Hezbollah.\nDefence Minister Yoav Gallant said military actions “will continue until we reach a point where we may ensure the safe return of Israel’s northern communities to their homes”.\n“This is our goal, this is our mission, and we will employ the means necessary to achieve it.”\nArmy chief Lieutenant General Herzi Halevi in a video statement vowed to “hit anyone who threatens” Israelis.\nIsrael’s key ally, the United States, said military escalation is not in Israel’s “best interest”, with President Joe Biden saying Washington was doing everything possible to prevent a wider conflagration.\nMr Biden said his administration was “going to do everything we can to keep a wider war from breaking out”. “And we’re still pushing hard,” he added.\nAhead of the annual General Assembly, UN chief Antonio Guterres warned of the risk of Lebanon becoming “another Gaza” and said it was “clear that both sides are not interested in a ceasefire” in the Gaza war.\nThe 27-nation European Union bloc is “extremely concerned” about the escalating violence and is calling for an “urgent” ceasefire, its foreign policy chief Josep Borrell said.\nA full-blown war “must be averted, including by renewed intense diplomatic mediation efforts”, he added.\nIsrael has signalled a shift in focus to Iran-backed Hezbollah after nearly a year of cross-border fire that began in October in what Hezbollah calls support for Hamas Palestinian militants fighting Israel.\nAn Israeli air strike in a densely populated Hezbollah stronghold in southern Beirut on Sept 20 killed the head of Hezbollah’s elite Radwan Force, Ibrahim Aqil.\nLebanon’s health ministry said the strike killed 45 people.\nIt came after a series of coordinated communications device blasts earlier in the week that killed 39 people and wounded almost 3,000, and which were blamed on Israel.\nSpeaking at Aqil’s funeral in Beirut on Sept 22, Mr Qassem said: “We have entered a new phase, namely an open reckoning” with Israel.\n“Threats will not stop us... We are ready to face all military possibilities.”\nHezbollah’s Radwan Force has spearheaded its ground operations, and Israel has repeatedly called for its fighters to be pushed back from the border.\nUN special coordinator for Lebanon Jeanine Hennis-Plasschaert posted on X that the region was “on the brink of an imminent catastrophe”.\nThe Israeli army said more than 150 rockets, missiles and drones were fired at its territory during the night and early on Sept 22, most from Lebanon.\nIt said it attacked Hezbollah targets in southern Lebanon in response and “to prevent a larger-scale attack”.\nSchools closed\nLebanon’s health ministry said three people were killed in Israeli strikes on southern areas, and Hezbollah announced two fighters were killed.\nIsrael’s civil defence agency ordered all schools in the north closed after the rocket fire.\n“It reminds me of Oct 7 when everybody stayed home,” Haifa resident Patrice Wolff told AFP.\nHezbollah said it had targeted Israeli military production facilities and an air base in the Haifa area after this week’s communication device blasts.\n“In an initial response,” Hezbollah said it “bombed the Rafael military industry complexes” in northern Israel with “dozens” of rockets.\nIt said it targeted Ramat David airbase deep inside Israel with Fadi-1 and Fadi-2 rockets in Hezbollah’s apparent first use of that rocket type since the Gaza war began.\nHezbollah chief Hassan Nasrallah has acknowledged that the communication devices attack was “unprecedented”. He vowed that Israel – which has not commented – would face retribution.\nStalled truce talks\nMonths of near-daily exchanges have killed hundreds in Lebanon, mostly fighters, and dozens in Israel and the annexed Golan, forcing tens of thousands on both sides from their homes.\nNetanyahu on Sept 17 announced an expansion of Israel’s war goals to include the return home of northern residents.\nInternational mediators from Qatar, Egypt and the United States have for months tried to secure a ceasefire and hostage release deal in Gaza, which diplomats repeatedly said would help calm regional tensions.\nEgyptian Foreign Minister Badr Abdelatty told AFP in an interview on Sept 22 that the Israel-Hezbollah flare-up “negatively affects” Gaza ceasefire efforts.\n“The problem is the lack of political will on the Israeli side,” he added.\nMr Netanyahu’s critics in Israel have accused him of dragging out the war.\nHamas’ Oct 7 attack on Israel resulted in the deaths of 1,205 people, mostly civilians, according to an AFP tally based on Israeli official figures that include hostages killed in captivity.\nOf the 251 hostages also seized by militants, 97 are still held in Gaza, including 33 the Israeli military says are dead.\nIsrael’s retaliatory military offensive has killed at least 41,431 people in Gaza, most of them civilians, according to figures provided by the Hamas-run territory’s health ministry. The UN has acknowledged the figures as reliable. AFP", "url": "https://www.straitstimes.com/world/middle-east/world-leaders-urge-israel-and-hezbollah-to-step-back-from-the-abyss"}