{"authors": [], "date_download": "2024-10-12 14:02:37", "date_modify": "2024-10-12 14:02:37", "date_publish": "2023-03-27 23:17:21", "description": "These war machines are seen as game changers in a conflict that has largely ground to a halt. Read more at straitstimes.com.", "filename": "world_europe_18-leopard-2-tanks-from-germany-reach-ukraine-says-security-source_1728741757.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/Vs8O3tqRGj6AQ9ROuBGfj-j4xwym_ANe5LnZjvnyxLU.jpg?VersionId=UgGxxAc2jWbSJBn2ZjJzIXs6rzS1LCnM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_18-leopard-2-tanks-from-germany-reach-ukraine-says-security-source_1728741757.html", "title": "18 Leopard 2 tanks from Germany reach Ukraine, says security source", "title_page": "18 Leopard 2 tanks from Germany reach Ukraine, says security source | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN – The 18 Leopard 2 battle tanks pledged by Germany to support Ukraine in its war against Russia have arrived in Ukraine, a security source said on Monday, confirming a report by the news magazine Der Spiegel.\nGermany agreed in January to supply the tanks, regarded as among the best in the West’s arsenal, overcoming misgivings about sending heavy weaponry that Kyiv says is crucial to defeat Russia’s invasion but Moscow casts as a dangerous provocation.\nBesides the 18 main battle tanks, 40 German Marder infantry fighting vehicles and two armoured recovery vehicles have also reached Ukraine, the security source said.\nThe German army trained the Ukrainian tank crews, as well as the troops assigned to operate the Marder vehicles, for several weeks on training grounds in Muenster and Bergen in northern Germany.\nBeyond the German vehicles, three Leopard tanks donated by Portugal also reached Ukraine, according to the security source. REUTERS", "url": "https://www.straitstimes.com/world/europe/18-leopard-2-tanks-from-germany-reach-ukraine-says-security-source"}