{"authors": [], "date_download": "2024-10-12 13:39:55", "date_modify": "2024-10-12 13:39:55", "date_publish": "2024-06-26 15:42:52", "description": "ATHENS - Greek judicial authorities have jailed the captain and first officer of a yacht ahead of a trial on charges of arson over a forest fire on the island of Hydra believed to have been sparked by fireworks, legal sources said. Read more at straitstimes.com.", "filename": "world_europe_yacht-crew-expected-to-deny-arson-charges-over-fire-on-greek-island_1728740395.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/LYNXMPEK5P07P-1.jpg?VersionId=aXLHkPISwPjhYAoYoCRdRVsx3aRX_W0H", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_yacht-crew-expected-to-deny-arson-charges-over-fire-on-greek-island_1728740395.html", "title": "Yacht captain jailed ahead of arson trial over Greek island fire", "title_page": "Yacht captain jailed ahead of arson trial over Greek island fire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ATHENS - Greek judicial authorities have jailed the captain and first officer of a yacht ahead of a trial on charges of arson over a forest fire on the island of Hydra believed to have been sparked by fireworks, legal sources said.\nThe two men and the entire crew of the yacht have denied any wrongdoing. Eleven other crew members were freed on bail and with restrictions.\nWildfires are common in the Mediterranean country but they have become more frequent and devastating due to hotter, drier and windier conditions, which scientists link to climate change. Greece has, in recent years, beefed up penalties for arson.\nThe fire, believed to have been triggered by fireworks, broke out on Friday night and devoured nearly 300,000 square metres of the island's pine forest before fire fighters doused the flames early on Saturday.\nThe Greek crew members of the yacht, which was moored 350 metres (383 yards) from the shore when the fire erupted, were arrested on Sunday at a marina near Athens and charged with starting the blaze.\nAll of them reiterated their denial of the charges before an investigating magistrate at the court of Piraeus on Wednesday.\nThe yacht operator, Salaminia Yachting Limited, said it \"retains absolute confidence in the integrity and sincerity of the crew members\", who deny involvement in the incident, according to a statement cited by the Athens News Agency.\nA legal source said earlier there was not enough evidence to link the crew with the case and that the captain was the first person to alert authorities about the fire. The foreign passengers who chartered the yacht, most of the from Kazakhstan, have left the country, the source added.\nA prosecutor ordered on Thursday an internal probe into the actions of authorities that allowed them to travel outside the country before the official investigation was concluded. Later in the day, charges for abetting arson were laid against eight of the passengers, police sources said.\nWitnesses have testified that they saw smoke and flames after hearing 15 to 20 loud sounds, similar to firework explosions, at 10:30 p.m. (1930 GMT) on Friday, according to court documents seen by Reuters.\nA rubber boat sailed towards the yacht as the fire rapidly spread, said one witness, who later saw a fire extinguisher on the yacht's stern. REUTERS", "url": "https://www.straitstimes.com/world/europe/yacht-crew-expected-to-deny-arson-charges-over-fire-on-greek-island"}