{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:53:46", "date_modify": "2024-10-12 13:53:46", "date_publish": "2024-03-28 15:25:00", "description": "She was concerned that it “hadn’t moved or pooped all night” despite being given food. Read more at straitstimes.com.", "filename": "world_europe_woman-in-britain-mistakes-hat-pom-pom-for-baby-hedgehog-takes-it-to-hospital_1728741226.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/28/hzpom280324.jpg?VersionId=lNbmZdpj1pENqGEM75Jxq7ur2tuEPcgk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_woman-in-britain-mistakes-hat-pom-pom-for-baby-hedgehog-takes-it-to-hospital_1728741226.html", "title": "Woman in Britain mistakes hat pom-pom for ‘baby hedgehog’, takes it to hospital", "title_page": "Woman in Britain mistakes hat pom-pom for ‘baby hedgehog’, takes it to hospital | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A woman rushed what she thought was a baby hedgehog into a wildlife hospital in Britain after caring for it overnight, only to find out that she had been worried over the health of a pom-pom from a hat.\nThe case of mistaken identity took place after the unnamed woman said she found what she thought was a hoglet at the side of a road, and spent the night looking after it.\nThe next day, the woman took it to the Lower Moss Wood Nature Reserve and Wildlife Hospital in Cheshire county, north-west England, as she was concerned that it “hadn’t moved or pooped all night” despite being given food, reported British news portal The Independent.\nDr Janet Kotze, who was the veterinarian on duty when the rescuer brought in the box containing the pom-pom, said she “couldn’t believe what I was seeing”.\n“I realised it wasn’t animated at all, and I picked it up and obviously from the weight I could feel that it wasn’t a hedgehog or any animal at all,” Dr Kotze told the New York Post.\nShe explained to the rescuer that it was “just a bobble”, and the surprised woman exclaimed “you’re joking”, before leaving the hospital with both the box and the pom-pom.\nThe wildlife hospital posted about the incident on its Facebook page on March 23.\n“Our hearts melted as a kind soul thought she was rescuing a baby hedgehog, only to discover it was a fluffy pom-pom from a bobble hat!” the facility said.\nAccompanying the post was a picture of the pom-pom nestled in a box lined with newspaper, with a small dish of food next to it.\n“This adorable ‘hoglet’ still got all the love, complete with some cosy TLC (tender loving care),” the facility said.\n“Sometimes, even the most heart-warming stories start with a hilarious twist! Maybe we can name this new species ‘Hedgebobbles’,” it added.\nDr Kotze said the woman will not be repeating the mistake after this experience.\n“She was very sweet. Bless her, her heart was in the right place,” The Independent quoted Dr Kotze as saying.", "url": "https://www.straitstimes.com/world/europe/woman-in-britain-mistakes-hat-pom-pom-for-baby-hedgehog-takes-it-to-hospital"}