{"authors": [], "date_download": "2024-10-12 13:38:54", "date_modify": "2024-10-12 13:38:54", "date_publish": "2024-08-16 01:30:48", "description": "LONDON - Russia and Ukraine should negotiate an end to their conflict to avoid the war spilling over into Belarus, President Alexander Lukashenko, a key ally of Vladimir Putin, said in an interview with Russian state television. Read more at straitstimes.com.", "filename": "world_europe_belarus-lukashenko-urges-russia-and-ukraine-to-end-war-as-kursk-incursion-continues_1728740334.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/16/ST-logo-placeholder_4.jpg?VersionId=eZAD42LtP3r81KeyWy6wdy60EWXK7Beb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_belarus-lukashenko-urges-russia-and-ukraine-to-end-war-as-kursk-incursion-continues_1728740334.html", "title": "Belarus' Lukashenko urges Russia and Ukraine to end war as Kursk incursion continues", "title_page": "Belarus' Lukashenko urges Russia and Ukraine to end war as Kursk incursion continues | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Russia and Ukraine should negotiate an end to their conflict to avoid the war spilling over into Belarus, President Alexander Lukashenko, a key ally of Vladimir Putin, said in an interview with Russian state television.\nLukashenko was speaking against the backdrop of a Ukrainian incursion into Russia that began on Aug. 6 when thousands of Kyiv's troops smashed through Russia's western border in a major embarrassment for Putin's top military brass.\nIn a wide-ranging interview, Lukashenko said that only \"high-ranking people of American origin\" wanted the Ukraine-Russia war to continue.\nThe West, he said, was encouraging Kyiv to fight because it wants Ukraine and Russia to \"destroy each other\", according to excerpts of the nearly two-hour interview published on Thursday on the Belarusian presidential website.\nRussia said on Thursday that it would beef up border defences as hundreds of thousands of people were ordered to evacuate the western Kursk region. Kyiv said its forces have advanced 35 km (22 miles) into Russia since last week and continue to gain ground.\nLukashenko suggested, without providing evidence, that Kyiv could have designs on attacking Belarus, and said that Minsk would not allow Ukrainian troops to \"trample on our country\".\nThe Ukrainian military did not immediately respond to a written request for comment.\nThe Belarusian leader has positioned himself as a main backer of Putin since the Russian president ordered the full-scale invasion of Ukraine in February 2022, part of which was staged from Belarusian soil.\nInstead of allowing battles to rage on, Lukashenko urged talks.\n\"Let's sit down at the negotiating table and end this brawl,\" he said. \"Neither the Ukrainian people, nor the Russians, nor the Belarusians need it. They (the West) need it.\"\nMoscow has said any peace talks should be based on Ukraine ceding land amounting to a fifth of its territory - much of it seized by Russian forces. Ukraine says Kyiv would be prepared for talks provided Ukraine's sovereignty and territorial integrity were fully respected.\nLukashenko charged that the West was betting that the destabilising situation in Kursk would encourage a troop mobilisation in both Belarus and Russia and \"shake up society from within.\"\n\"We don't want escalation and we don't want a war against the whole of NATO. We don't want that,\" he said.\nBut if Ukraine does provoke Belarus, Lukashenko cautioned, \"we'll have no other choice.\"\nLukashenko referred to the conflict as a \"common war\" of Belarus and Russia against \"those beasts\" - Kyiv and its Western allies - and said Moscow would \"back us up\" if Belarus was attacked.\nOn Saturday Minsk said it was sending troops to reinforce its southern border with Ukraine after accusing Kyiv of violating its airspace with drones. Kyiv said it had seen no signs of such a buildup.\nLukashenko repeated the claims about airspace violations and said the Belarusian troops were being despatched to the border to \"prevent a breakthrough.\"\nHe said Minsk saw no reason to use Russian nuclear weapons, deployed on Belarusian territory last year, unless its borders were violated.\n\"We are not going to use any weapons until you step on our state border,\" he said. REUTERS", "url": "https://www.straitstimes.com/world/europe/belarus-lukashenko-urges-russia-and-ukraine-to-end-war-as-kursk-incursion-continues"}