{"authors": [], "date_download": "2024-10-12 13:39:08", "date_modify": "2024-10-12 13:39:08", "date_publish": "2024-09-05 19:00:51", "description": "KYIV - Ukraine said 75 countries and international organisations have agreed a \\\"shared vision\\\" of measures to ensure the uninterrupted supply of Ukrainian agricultural products and help global food security, a major concern following Russia's 2022 invasion. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-peace-summit-follow-up-meeting-tackles-food-security_1728740348.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/LYNXMPEK840HX-1.jpg?VersionId=RUYvoWjw3jY9CX6PU78lSEjTfkWTLTh4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-peace-summit-follow-up-meeting-tackles-food-security_1728740348.html", "title": "Ukraine says peace summit follow-up meeting tackles food security", "title_page": "Ukraine says peace summit follow-up meeting tackles food security | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine said 75 countries and international organisations have agreed a \"shared vision\" of measures to ensure the uninterrupted supply of Ukrainian agricultural products and help global food security, a major concern following Russia's 2022 invasion.\nThe presidential office said an online meeting of representatives of the countries and organisations, held as a follow-up to a peace summit hosted by Switzerland in June, had also committed to additional efforts to implement international law.\nUkraine is a major wheat and corn producer and the U.N. said millions of people around the world were at greater risk of hunger from the knock-on effect for food prices.\nUkraine's port infrastructure has suffered frequent attacks since Russia withdrew last year from a U.N.-brokered deal that had guaranteed safe shipments of Ukrainian grain.\nHowever, restored logistics through ports in the southern Odesa region has helped shipments to recover.\nUkraine said it exported 69.86 million metric tons of grain, vegetable oils and oilseeds for the entire 2023/24 season.\nThat compares with Ukraine's monthly exports of up to 6 million tons of grain alone via the Black Sea before Russia's invasion.\nThe steps discussed at the meeting on Wednesday included the security of commercial navigation in the Black Sea and Azov basins and protection of trade routes, the presidential office said in a statement.\nIt also covered the restoration and air defence protection of Ukrainian port infrastructure and increasing production capacity of the country's agriculture sector.\nJon Finer, deputy U.S. national security adviser, who joined the meeting in-person during his Kyiv visit, said Ukraine's resilience and its support from partner countries had enabled it to defend its exports and push back the Russian Black Sea Fleet.\nThe meeting on Wednesday was the second in a series working group sessions following the June summit, which have included a discussion on energy security in August. A third planned meeting will discuss the release of prisoners and deported persons, the presidential office said. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-says-peace-summit-follow-up-meeting-tackles-food-security"}