{"authors": [], "date_download": "2024-10-12 13:49:54", "date_modify": "2024-10-12 13:49:54", "date_publish": "2024-09-06 15:11:12", "description": "PARIS - New French Prime Minister Michel Barnier on Friday pledged he would work independently from President Emmanuel Macron but signalled he would defend some of the president's key policies while toughening the government's stance on immigration. Read more at straitstimes.com.", "filename": "world_europe_french-far-right-exerts-outsize-power-over-barnier-and-macron-rivals-say_1728740994.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/06/LYNXMPEK8508I-1.jpg?VersionId=lKbBUPpA2EadRb.YmXmsPahp15ar9rCq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_french-far-right-exerts-outsize-power-over-barnier-and-macron-rivals-say_1728740994.html", "title": "New French PM Barnier pledges to defend key Macron policies, hints at rightward shift", "title_page": "New French PM Barnier pledges to defend key Macron policies, hints at rightward shift | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - New French Prime Minister Michel Barnier on Friday pledged he would work independently from President Emmanuel Macron but signalled he would defend some of the president's key policies while toughening the government's stance on immigration.\nGiving his first interview as government chief following his nomination on Thursday, Barnier said his government, which lacks a clear majority in a hung lower house of parliament, will include conservatives as well as members of Macron's camp.\nMembers from other groupings, including the left, were also welcome to back the new government. \"There is no red line\", Barnier said, adding: \"We need to open the door ... to all those who want it.\"\nMacron named 73-year-old Barnier, a conservative and a former Brexit negotiator, as prime minister on Thursday, capping a two-month-long search following his ill-fated decision to call a legislative election that delivered an unruly hung parliament.\nBarnier faces the daunting task of trying to drive reforms and the 2025 budget through a hung parliament, as France is under pressure from the European Commission and bond markets to reduce its deficit.\nSignalling his readiness to hold up some of Macron's widely unpopular reform policies, which likely includes taking political risks, Barnier said he was not prepared to repeal the rise of the retirement age to 64 from 62.\n\"We must not call into question this law which was adopted in very difficult circumstances,\" Barnier said, but added he was prepared to adjust the policy to better protect what he called \"the most vulnerable.\"\nThe left-wing New Popular Front and the far-right National Rally (RN), who together have a majority and could oust the prime minister through a no-confidence vote should they decide to collaborate, both massively campaigned against the reform.\nTOUGH ON IMMIGRATION\nIn a sign he would take a rightward shift on some issues, Barnier said he would pursue tougher policies to curb immigration. \"There still is a feeling that our borders are sieves and that migration flows aren't being controlled\", he said, adding:\n\"I don't have much in common with the ideologies of the National Rally, but I respect it.\"\nMacron's political rivals earlier said Marine Le Pen's movement was exerting outsize power over the president, who nominated Barnier with the tacit support of the far right after spending weeks looking for a candidate who would not immediately be toppled by a majority of lawmakers.\nThe RN gave tentative support to Barnier's nomination by saying it would not immediately try to vote it down, but made clear it could withdraw support at any point if its concerns on immigration, security and pocketbook issues were not met.\n\"Today, we have a prime minister who is completely dependent on the RN,\" said Lucie Castets, the prime ministerial pick of the leftist alliance that came top in the July vote, but who was overlooked by Macron after it failed to secure an absolute majority.\n\"It's now the far right that makes the kings or queens,\" Socialist Party chief Olivier Faure said on France Inter radio.\nLeftist parties have called for demonstrations during the weekend to protest against what they called a 'stolen election' due to Macron's decision not to name a prime minister from their ranks despite the bloc having won the most votes.\nEarlier on Friday, Barnier held talks with the head of Macron's centrist group of lawmakers in the National Assembly before meeting conservative leaders from both houses of parliament. He then had lunch with Macron at the Elysee Palace. REUTERS", "url": "https://www.straitstimes.com/world/europe/french-far-right-exerts-outsize-power-over-barnier-and-macron-rivals-say"}