{"authors": [], "date_download": "2024-10-12 13:37:57", "date_modify": "2024-10-12 13:37:57", "date_publish": "2024-08-16 17:40:58", "description": "KYIV - Russian attacks killed three civilians and injured five more in the last 24 hours in Ukraine's eastern Donetsk region, a local official said on Friday, as Moscow's forces mounted pressure to reach the city of Pokrovsk, a logistics hub. Read more at straitstimes.com.", "filename": "world_europe_three-killed-in-russian-attacks-on-ukraines-donetsk-official-says_1728740277.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/16/ST-logo-placeholder_47.jpg?VersionId=3iHh7deTYUYZ._gPXEzM0gO3prc7pDbN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_three-killed-in-russian-attacks-on-ukraines-donetsk-official-says_1728740277.html", "title": "Three killed in Russian attacks on Ukraine's Donetsk, official says", "title_page": "Three killed in Russian attacks on Ukraine's Donetsk, official says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Russian attacks killed three civilians and injured five more in the last 24 hours in Ukraine's eastern Donetsk region, a local official said on Friday, as Moscow's forces mounted pressure to reach the city of Pokrovsk, a logistics hub.\nThe eastern region of Donetsk, which Russian troops partially occupy, regularly comes under Russian shelling and air strikes. Ukraine says capturing the region is a battlefield priority for Moscow.\nThe number of battles reported by Kyiv's military on the Pokrovsk front in the last 24 hours fell to 41 from 58 over the previous day. The area has seen some of the war's heaviest fighting.\nThe region's governor, Vadym Filashkin, said an attack injured three people in the Selydove area of the district surrounding Pokrovsk. Six buildings were damaged, he said.\nOne person was killed in the village of Mykolayivka and two more were injured in the city of Kostyantynivka just to the west of Bakhmut, the devastated city captured by Russia last year after months of heavy fighting.\nTwo more people were killed in the village of Verkhniokamyanka, Filashkin said. Nine residential buildings and eight homes were also damaged in the district, he said.\nRussian forces stepped up their attacks on the Pokrovsk front this week after Ukrainian forces launched a surprise assault on Aug. 6 and said it had advanced 35 km into Russia's Kursk region. REUTERS", "url": "https://www.straitstimes.com/world/europe/three-killed-in-russian-attacks-on-ukraines-donetsk-official-says"}