{"authors": [], "date_download": "2024-10-12 13:36:42", "date_modify": "2024-10-12 13:36:42", "date_publish": "2024-07-23 04:05:06", "description": "US tensions with China will provide the backdrop to the trip. Read more at straitstimes.com.", "filename": "world_united-states_blinken-to-shore-up-us-relationships-in-asia-amid-political-uncertainty-at-home_1728740202.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/23/LYNXMPEK6L0MW-3.jpg?VersionId=8sZA2rl7R09fT59JaqQV83aiduqwPmkI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_blinken-to-shore-up-us-relationships-in-asia-amid-political-uncertainty-at-home_1728740202.html", "title": "Blinken, Austin to shore up US-Asia ties amid political uncertainty at home", "title_page": "Blinken, Austin to shore up US-Asia ties amid political uncertainty at home | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – US Secretary of State Antony Blinken and Defence Secretary Lloyd Austin head to Asia this week to reassure allies and partners of US support, the State Department’s top official for East Asia said on July 22, as the November US presidential election casts uncertainty over Washington’s foreign policy.\nUS tensions with China will provide the backdrop to the trip.\nMr Blinken is expected to meet his Chinese counterpart Wang Yi on the sidelines of regional meetings in Laos, Assistant Secretary of State Daniel Kritenbrink told reporters.\nMr Austin and Mr Blinken will hold security talks with US allies Japan and the Philippines.\nMr Blinken will also visit Singapore and Mongolia, and stop in Vietnam for the funeral of Mr Nguyen Phu Trong, head of the ruling Communist Party, who died last week.\nThe trip follows a tumultuous month in Washington. US President Joe Biden announced on July 21 that he will not run for re-election as expected and endorsed his Vice-President, Ms Kamala Harris, to replace him.\nOn July 13, the Republican nominee, former US president Donald Trump, survived an assassination attempt.\nAsked what Mr Blinken will say to allies about Mr Biden’s decision to step aside and whether that could bring changes in policy, Mr Kritenbrink said the message would be that America is “all-in on the Indo-Pacific”.\n“We do try to reassure allies and partners that there are certain fundamentals, I think, about America’s engagement that are not going to change, that have been consistent,” he said, citing American investments and bipartisan support in Washington for the administration’s approach to the region.\nMr Trump, who has been leading in the polls ahead of the Nov 5 election, launched a trade war against China while in the White House, and as a candidate has suggested he would impose tariffs of 60 per cent or higher on all Chinese goods.\nHe has signalled he would demand Taiwan boost its defence spending in the face of potential Chinese aggression if elected.\nAllies of the former president have assured Japan and South Korea he would continue Mr Biden’s engagement with them, aimed at countering China and North Korea.\nRegional security\nIn Laos’ capital, Vientiane, Mr Blinken will attend meetings of Asean on July 26 to 27, which China’s Mr Wang and Russian Foreign Minister Sergei Lavrov are also expected to attend.\nA North Korean official would also likely be in attendance, Mr Kritenbrink said.\nOfficials there are expected to discuss the conflict in Myanmar after a military junta seized power three years ago.\nThe US expects Myanmar to be represented by a non-political official as it has been at previous meetings since the coup, Mr Kritenbrink said.\nHe said Washington welcomed an announcement by Manila on July 21 that it had reached an understanding on the resupply of a Filipino naval ship beached on the Second Thomas Shoal.\nIn Tokyo, Mr Blinken and Mr Austin will meet their Japanese counterparts on July 28 and focus on the implementation of agreements reached at an April summit in Washington between Mr Biden and Japanese Prime Minister Fumio Kishida.\nThere, the allies announced plans to upgrade their military alliance, including the US military command in Japan and more joint development of defence equipment, amid shared concerns about China and Russia.\nTokyo wants a four-star US commander in Japan to match the rank of the head of a new Japanese headquarters that will oversee all of Japan’s military operations from 2025.\nExperts say that could lay the groundwork for a future unified Japanese-US command.\nThe US has said it would commit to match Japan’s planned command upgrade, but experts say there have been questions as to where a four-star US commander for Japan would be based.\nMr Kritenbrink said “command and control” would be discussed.\n“There’ll be discussions about our roles and missions and capabilities; how the alliance is postured to meet those challenges,” he added. “The United States and Japan are going to demonstrate in a responsible way how we will stand up and ensure not just the defence of Japan, but also our contribution to regional security.” REUTERS", "url": "https://www.straitstimes.com/world/united-states/blinken-to-shore-up-us-relationships-in-asia-amid-political-uncertainty-at-home"}