{"authors": [], "date_download": "2024-10-12 13:34:10", "date_modify": "2024-10-12 13:34:10", "date_publish": "2024-09-06 19:56:24", "description": "Colt Gray and his father made their first appearances in state court. Read more at straitstimes.com.", "filename": "world_teen-suspected-in-georgia-school-shooting-to-appear-in-court_1728740050.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/06/LYNXMPEK850FO-2.jpg?VersionId=iYYoiNeHI0DIOzYvsZzz1geDMj5gPxvS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_teen-suspected-in-georgia-school-shooting-to-appear-in-court_1728740050.html", "title": "Georgia school shooting: Teen faces life sentence, his father could get up to 180 years in prison", "title_page": "Georgia school shooting: Teen faces life sentence, his father could get up to 180 years in prison | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ATLANTA – The Georgia teenager charged as an adult with killing four people at his high school made his first appearance in state court on Sept 6. His father later appeared before the same judge on charges of enabling his son to obtain the rifle used in the shooting.\nSuspected Georgia high-school shooter Colt Gray, 14, faces murder charges stemming from the rampage on Sept 4, which killed four people and wounded nine others.\nGray did not enter a plea in front of Barrow County Superior Court Judge Currie Mingledorff. He was being held without bond in the Gainesville Regional Youth Detention Centre.\nMr Mingledorff told Gray that he was charged with four counts of felony murder and that he could face life in prison if convicted by a jury.\nGray was shackled as he sat next to his attorney, and answered several of the judge’s questions with a nod.\nFamily members of those killed in the shooting lined the first row of the courtroom and spilled into the second. They sat quietly, facing the judge. Some wiped their eyes.\nThe judge earlier told Gray he could face the death penalty, but later corrected himself, telling the youth he was not eligible for capital punishment, given that he is younger than 18.\nHis father, Colin Gray, came before Mr Mingledorff about 40 minutes after his son left the court.\nHe has been charged with four counts of involuntary manslaughter, two counts of second-degree murder and eight counts of cruelty to children.\nThe 54-year-old was shackled and wearing a prison striped shirt and trousers. He quietly answered a few questions by the judge and then spent most of the hearing rocking back and forth. The judge said the elder Gray faces up to 180 years in prison.\nGeorgia state and Barrow County investigators say Colt Gray used an “AR platform-style weapon”, or semi-automatic rifle, to carry out the attack at Apalachee High School, where two teachers and two 14-year-old students were killed.\nOne teacher and eight students were also wounded in the attack, the Georgia Bureau of Investigation said. Of those, the adult and six of the students were shot, the bureau said.\nAt the sound of gunshots, the school went into lockdown. The locked classroom doors, as well as a newly installed alarm system, may have helped to prevent further bloodshed, officials said.\nColt Gray was arrested moments after the attack by two sheriff’s deputies assigned to the school.\nThe shooting in Winder, a city of 18,000 some 80km north-east of Atlanta, revived both the national debate about gun control and the outpouring of grief that follows in a country where such attacks occur with some regularity.\nOfficials identified those killed as 14-year-old students Mason Schermerhorn and Christian Angulo and teachers Richard Aspinwall, 39, and Cristina Irimie, 53.\nQuestions have swirled about what motivated the suspect to open fire at the school, where he was a new student, just over a month into the school year.\nRelatives suggested that he had a troubled home life.\nMr Charlie Polhamus, the teenager’s maternal grandfather, said he believed his grandson was responsible for what happened, but also cast some of the blame on the tumult in the teenager’s life with his father, who had split from his mother, Mr Polhamus’ daughter.\n“My grandson did what he did because of the environment that he lived in,” Mr Polhamus said.\nIn May 2023, officials at the Federal Bureau of Investigation were alerted to some disturbing messages on Discord, a social media platform: Someone in a chat group had threatened to possibly “shoot up a middle school”.\nA report from the Jackson County Sheriff’s Office, obtained by The New York Times, said that an e-mail associated with the Discord user who had made the threat belonged to the suspect.\nThe report detailed how investigators looked into it but were unable to definitively link the threats to the boy, then 13, who denied that he had been the author.\nAt the time, Colin Gray told an investigator that he and his wife were no longer together and that they had been evicted from their home.\nThe father also told investigators that he had hunting rifles in the house but that his son did not have “unfettered” access to them, according to a transcript of the May 2023 interview obtained by the Times. REUTERS, NYTIMES", "url": "https://www.straitstimes.com/world/teen-suspected-in-georgia-school-shooting-to-appear-in-court"}