{"authors": [], "date_download": "2024-10-12 13:40:16", "date_modify": "2024-10-12 13:40:16", "date_publish": "2024-09-14 02:15:39", "description": "ANKARA - Turkey's spy chief has met a delegation from the Palestinian militant group Hamas in Ankara and discussed the negotiations for a ceasefire in Gaza, state broadcaster TRT said on Friday. Read more at straitstimes.com.", "filename": "world_europe_turkey-spy-chief-meets-members-of-hamas-political-bureau-in-ankara-trt-reports_1728740416.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/14/LYNXMPEK8C0PN-1.jpg?VersionId=Mmj0efV5dsTTjPvAFLQBPxxYuq_ER034", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_turkey-spy-chief-meets-members-of-hamas-political-bureau-in-ankara-trt-reports_1728740416.html", "title": "Turkey spy chief meets members of Hamas political bureau in Ankara, TRT reports", "title_page": "Turkey spy chief meets members of Hamas political bureau in Ankara, TRT reports | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANKARA - Turkey's spy chief has met a delegation from the Palestinian militant group Hamas in Ankara and discussed the negotiations for a ceasefire in Gaza, state broadcaster TRT said on Friday.\nIbrahim Kalin, head of Turkey's National Intelligence Agency, had met the delegation from the Hamas political bureau leadership, TRT Haber said citing Turkish security sources, without saying who the members of the delegation were.\nTurkey has denounced Israel's assault on Gaza.\nThe war was triggered on Oct. 7 when Hamas attacked Israel, killing 1,200 people and taking about 250 hostages, according to Israeli tallies. Israel's subsequent assault on Gaza has killed more than 41,000 Palestinians, according to the enclave's health ministry.\nTurkey's intelligence agency has been in contact with all actors including Hamas, Israel, Qatar and the United States and is conducting intensive diplomacy for a ceasefire in Gaza, TRT said. REUTERS", "url": "https://www.straitstimes.com/world/europe/turkey-spy-chief-meets-members-of-hamas-political-bureau-in-ankara-trt-reports"}