{"authors": [], "date_download": "2024-10-12 13:44:03", "date_modify": "2024-10-12 13:44:03", "date_publish": "2024-06-19 07:52:00", "description": "Confronted by families of those killed on two flights, Boeing's CEO apologised for \"the grief that we have caused\". Read more at straitstimes.com.", "filename": "world_boeing-ceo-apologises-for-quality-and-safety-issues-at-senate-hearing_1728740643.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/19/BOEINGSAFETY9.JPG?VersionId=4lobrYSsdtN4.qzrTLCxgm_B6ttnCVGP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_boeing-ceo-apologises-for-quality-and-safety-issues-at-senate-hearing_1728740643.html", "title": "Boeing CEO apologises for quality and safety issues at Senate hearing", "title_page": "Boeing CEO apologises for quality and safety issues at Senate hearing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Shortly after Boeing chief executive Dave Calhoun took his seat on June 18, families who lost relatives in the 2018 and 2019 crashes of the company’s 737 Max 8 planes demanded that he turn around and acknowledge them and the photos of their loved ones.\nAmong those behind Mr Calhoun were the parents and brother of Ms Samya Rose Stumo, the 24-year-old who was killed in the 2019 Ethiopian Airlines accident and a grandniece of Mr Ralph Nader, the consumer advocate and former presidential candidate.\nNearby sat the family of Mr John Barnett, the former Boeing engineer and whistleblower who died by suicide in 2024 in the midst of a US Justice Department criminal investigation into the company. Others held photos of their loved ones lost in the crashes.\n“I would like to apologise, on behalf of all of our Boeing associates spread throughout the world, past and present, for your losses,” Mr Calhoun said while facing the families. “And I apologise for the grief that we have caused.”\nThe hearing was Mr Calhoun’s first appearance before Congress since a January incident in which the door plug of a 737 Max 9 plane ripped off during an Alaska Airlines flight near Portland, Oregon.\nMr Calhoun, who plans to step down at the end of 2024, took over as chief executive in 2019 after two fatal crashes of a smaller version of the jet, the 737 Max 8. Those crashes, in which 346 people died, led to a 20-month global ban on the plane.\nMembers of a Senate investigative panel questioned Mr Calhoun about reports of the company retaliating against whistleblowers who raised safety and quality concerns, how parts made of questionable titanium made it into Boeing planes without detection and allegations of falsified inspection records involving the company’s 787 Dreamliner.\nSenator Richard Blumenthal, chair of the sub-committee holding the hearing, said Mr Calhoun had assured lawmakers that he was the leader Boeing needed to turn the corner after the Max crashes in 2018 and 2019.\nMr Blumenthal said the company had appeared to be heading in the right direction until the January incident, which he said exposed shortcuts the company had been taking.\n“This past January, the facade quite literally blew off the hollow shell that had been Boeing’s promises to the world,” Mr Blumenthal said. “And once that chasm was exposed, we learnt that there was virtually no bottom to the void that lay below.” NYTIMES", "url": "https://www.straitstimes.com/world/boeing-ceo-apologises-for-quality-and-safety-issues-at-senate-hearing"}