{"authors": [], "date_download": "2024-10-12 13:36:03", "date_modify": "2024-10-12 13:36:03", "date_publish": "2023-10-22 08:41:24", "description": "It also calls for the protection of civilians and notes that states must comply with international law. Read more at straitstimes.com.", "filename": "world_middle-east_us-pushes-un-to-back-israel-self-defense-demand-iran-stop-arms-to-hamas_1728740163.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/22/LYNXMPEJ9L008-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_us-pushes-un-to-back-israel-self-defense-demand-iran-stop-arms-to-hamas_1728740163.html", "title": "US pushes UN to back Israel’s right to self-defence, demand Iran stop arms to Hamas", "title_page": "US pushes UN to back Israel’s right to self-defence, demand Iran stop arms to Hamas | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "UNITED NATIONS - The United States proposed on Saturday a draft UN Security Council resolution that says Israel has a right to defend itself and demands Iran stop exporting arms to “militias and terrorist groups threatening peace and security across the region”.\nThe draft text, seen by Reuters, calls for the protection of civilians - including those who are trying to get to safety - and notes that states must comply with international law when responding to “terrorist attacks”, and urges the “continuous, sufficient and unhindered” delivery of aid to the Gaza Strip.\nIt was not immediately clear if or when the United States planned to put the draft resolution to a vote. To pass, a resolution needs at least nine votes in favour and no vetoes by Russia, China, the United States, France or Britain.\nThe move by the United States comes after it vetoed a Brazilian-drafted text on Wednesday that would have called for humanitarian pauses in the conflict between Israel and Palestinian Hamas militants, to allow aid access to Gaza.\nUS Ambassador Linda Thomas-Greenfield justified Wednesday’s veto by telling the council more time was needed for diplomacy on the ground as US President Joe Biden and US Secretary of State Antony Blinken visited the region, focused on brokering aid access to Gaza and trying to free hostages held by Hamas.\nHamas released two American hostages on Friday and the first humanitarian aid convoy arrived in Gaza from Egypt on Saturday.\nIsrael has vowed to wipe out the Hamas Islamist group that rules Gaza after its gunmen burst through the barrier fence surrounding the enclave on Oct 7 and rampaged through Israeli towns and kibbutzes, killing 1,400 people.\nIsrael has since pounded Gaza from the air, imposed a siege and is preparing for a ground offensive. Palestinian authorities say more than 4,000 people have been killed in the enclave. The UN says more than a million have been made homeless.\nThe US draft text does not call for any pause or truce in the fighting. It calls on all states to try and stop the “violence in Gaza from spilling over or expanding to other areas in the region, including by demanding the immediate cessation by Hezbollah and other armed-groups of all attacks”.\nLebanon’s Iran-backed, heavily armed Hezbollah group has clashed with Israel across the Lebanese border multiple times since Oct 7 in the deadliest confrontations since they fought a month-long war in 2006.\nSelf-defence\nThe US draft resolution demands Iran stop exporting arms to groups threatening peace and security across the region, including Hamas. Iran’s mission to the UN in New York did not immediately respond to a request for comment.\nIran has made no secret of its backing for Hamas, funding and arming the group and another Palestinian militant organisation Islamic Jihad. Iran’s mission to the UN said on Oct 8 that Tehran was not involved in the Hamas attack on Israel a day earlier.\nMs Thomas-Greenfield said on Wednesday that the US was disappointed the Brazilian draft did not mention Israel’s right to self-defence. The US text states that Israel has such a right under Article 51 of the founding UN Charter.\nArticle 51 covers the individual or collective right of states to self-defence against armed attack and states must immediately inform the 15-member Security Council of any action that states take in self-defence against armed attack.\nIn a letter sent the same day as the Hamas attack, Israel told the council it would “act in any way necessary to protect its citizens and sovereignty from the ongoing terrorist attacks originating from the Gaza Strip”. But it does not appear to have formally invoked Article 51, diplomats said.\nArab countries have argued that Israel cannot justify its actions as self-defence.\n“The Gaza Strip is an occupied territory,” Jordan’s UN Ambassador Mahmoud Daifallah Hmoud told the council on Monday, citing a 2004 opinion by the International Court of Justice on an Israeli separation barrier built around the West Bank.\n“We recall the advisory opinion of the ICJ ... according to which Israel does not have the right to defend itself within occupied Palestinian territory,” he said, speaking on behalf of the Arab group.\nIsrael said in 2004 that the barrier was meant to keep suicide bombers out of its cities. The ICJ said Israel “states, the threat which it regards as justifying the construction of the wall originates within, and not outside, that territory”.\n“Consequently, the Court concludes that Article 51 of the Charter has no relevance in this case,” it ruled. Israel rejected the ICJ ruling. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/us-pushes-un-to-back-israel-self-defense-demand-iran-stop-arms-to-hamas"}