{"authors": [], "date_download": "2024-10-12 13:31:47", "date_modify": "2024-10-12 13:31:47", "date_publish": "2024-04-13 18:51:02", "description": "MADRID - Police forces led by Spain have arrested a gang which allegedly defrauded 645 million euros ($686.41 million) from victims in 35 countries in a scam centred around cannabis plants for medicinal use. Read more at straitstimes.com.", "filename": "world_europe_police-arrest-international-gang-in-686-million-medicinal-cannabis-scam_1728739907.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/13/ST-logo-placeholder_23.jpg?VersionId=bN6541g5JCVHau03wZQizCs7luQgzm_6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_police-arrest-international-gang-in-686-million-medicinal-cannabis-scam_1728739907.html", "title": "Police arrest international gang in $686 million medicinal cannabis scam", "title_page": "Police arrest international gang in $686 million medicinal cannabis scam | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MADRID - Police forces led by Spain have arrested a gang which allegedly defrauded 645 million euros ($686.41 million) from victims in 35 countries in a scam centred around cannabis plants for medicinal use.\nThe gang mounted a marketing system and attended international cannabis fairs to convince victims to invest in the system, the Spanish National Police said in a statement.\nIt led the operation with the help of Europol and police forces in five other countries.\nNine suspects, who have not been named, were detained on April 11 on suspicion of fraud in Spain, Britain, Germany, Latvia, Poland, Italy and the Dominican Republic.\n\"The business model offered by this organization consisted of using the capital transferred from investors to develop partnerships to finance the cultivation of cannabis plants,\" Silvia Garrido, Spanish police spokeswoman said.\n\"With this system, they promised victims profits of between 70% and 168% per year, depending on the species of cannabis in which they invested.\"\nThe British National Crime Agency (NCA), which took part in the operation, said 180,000 people invested funds in “JuicyFields” which it called \"a notorious and elaborate Ponzi fraud scheme\".\nThe NCA also said that a 42-year-old man appeared in a London court on April 11 for the start of extradition proceedings.\nLuxury cars, hotel parties and music videos were used in an advertising campaign to promote the scheme, police said, and victims were taken to legal cannabis plantations which were involved in the scam.\nPolice carried out raids in 2022 but did not say if any suspects have been charged with any offences.\nPolice blocked bank accounts containing 58,600.00 euros and 116,300.00 euros in crypto currencies, and 106,000 euros in cash was recovered. Properties worth 2.6 billion euros were seized. REUTERS", "url": "https://www.straitstimes.com/world/europe/police-arrest-international-gang-in-686-million-medicinal-cannabis-scam"}