{"authors": [], "date_download": "2024-10-12 14:19:16", "date_modify": "2024-10-12 14:19:16", "date_publish": "2023-12-11 20:30:00", "description": "The 100-day presidential campaign is a chance to expose Putin as vulnerable, say aides of the opposition leader. Read more at straitstimes.com.", "filename": "world_putin-is-vulnerable-navalny-camp-to-tap-voter-concerns-on-war-and-economy_1728742756.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/11/RUSSIA-DIPLOMACY-G20-INDIA-131355.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_putin-is-vulnerable-navalny-camp-to-tap-voter-concerns-on-war-and-economy_1728742756.html", "title": "‘Putin is vulnerable’: Navalny camp to tap voter concerns on war and economy", "title_page": "‘Putin is vulnerable’: Navalny camp to tap voter concerns on war and economy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - With his hands on all the levers of power in Russia, President Vladimir Putin cannot be beaten in a presidential election, top aides to jailed opposition leader Alexei Navalny say.\nBut they see the 100-day campaign as a chance to expose him as vulnerable on the issues that most matter to Russians: the war in Ukraine and the state of the economy.\nMr Putin declared his candidacy for another six-year term on Dec 8 and there is no serious rival to challenge him, with Mr Navalny serving more than 30 years in a penal colony and other critics also jailed or in exile.\nWith the Kremlin in full control of state media and able to decide who can and cannot run, the Navalny camp says this is not a real election. But it sees the campaign window as a rare opportunity to draw Russians into a political conversation and convince them that Russia’s main problems are of Mr Putin’s making.\n“Of course, it’s impossible to beat Putin in the ‘elections’,” Navalny aide Leonid Volkov told Reuters. “The aim of our campaign is to change the political agenda in Russia.”\nDuring an election campaign when people are focused on politics and expecting promises and solutions, it will be harder for the Kremlin to avoid difficult topics, he said.\n“Putin is vulnerable because he does not have answers today to the questions that really worry people. These are the questions of an exit strategy for the war – when and how it should end and when the soldiers will return home – and the questions of destitution, poverty, corruption, financial credits and all the rest.”\nThe Kremlin says Mr Putin will win another six-year term because he commands overwhelming support across Russian society, with opinion poll ratings of around 80 per cent.\nSo far, only three people have declared their intention to run against him. Two are low-profile figures, Boris Nadezhdin and Yekaterina Duntsova, who may struggle to gather the 300,000 signatures required to support their candidacies. The third, nationalist Igor Girkin, is in jail awaiting trial on a charge of inciting extremist activity.\nOther possible candidates who have yet to declare include Communist leader Gennady Zyuganov and liberal Grigory Yavlinsky, both political veterans and serial election losers.\n‘Not Putin’\nWith the line-up still unclear, the Navalny camp has launched its campaign by simply urging Russians to vote against the incumbent.\n“We don’t have our own candidate. We had a candidate, Navalny, and they refused to register him, tried to kill him and put him in prison. Now we have, so to speak, a collective candidate ‘against Putin’,” said Ms Lyubov Sobol, a close Navalny associate who, like Mr Volkov, is on an official list of “terrorists and extremists” and is now based outside Russia.\nMr Navalny’s supporters cast him as a Russian version of South Africa’s Nelson Mandela, who will one day be freed from jail to lead the country.\nRussian authorities view Mr Navalny and his supporters as extremists with links to Western intelligence agencies intent on trying to destabilise Russia. Mr Putin has warned the West any meddling inside Russia will be considered an act of aggression.\nThe opposition is seeking volunteers from among the hundreds of thousands of people who have fled Russia since the start of the war and asking them to cold-call voters – ideally as many as 100 each, Ms Sobol said in a telephone interview.\nMany people would be scared and put the phone down, but others could be persuaded to talk, she said.\nOn its website NePutin (NotPutin).org, the Navalny team also calls for volunteers to spread videos and campaign messages online, and to stick up leaflets and scrawl graffiti in the streets – what Ms Sobol described as “partisan” tactics.\n“Putin’s task is to make sure these elections go as smoothly and calmly as possible, without any strain on the nerves. Our task is the opposite,” she said.\nWithin hours of Parliament announcing the March 17 election on Dec 7, the Navalny camp had fired its first campaign shot. It posted photos on social media of giant blue billboards it had placed in major cities, with an innocent-looking new year greeting to Russians. Underneath was a QR code leading to the NotPutin website.\nThe stunt showed the ingenuity of Navalny’s tech-savvy team. But the impact was brief, as the authorities took down the billboards and blocked access to the site.\n‘Points of tension’\nThe opposition has struggled in the past to present a united front between the Navalny camp and other prominent Putin opponents such as former oil tycoon Mikhail Khodorkovsky and former world chess champion Garry Kasparov.\nMr Volkov denied any split, saying all of them were appealing to the same audience.\nBut from outside Russia, they face a huge task to mobilise people in a country where nearly 20,000 have been detained since Moscow’s Feb 2022 invasion for protesting against the war in Ukraine.\nMs Sobol said opposition polling showed many people were dissatisfied with Putin but were afraid to speak out. She said it was precisely the degree of repression in Russia that showed that the authorities are worried.\n“We on the side of the opposition must create more points of tension for him,” she said. “We must make problems for him and his regime, and agitate, put out counter-propaganda and tell the truth.” REUTERS", "url": "https://www.straitstimes.com/world/putin-is-vulnerable-navalny-camp-to-tap-voter-concerns-on-war-and-economy"}