{"authors": [], "date_download": "2024-10-12 13:47:28", "date_modify": "2024-10-12 13:47:28", "date_publish": "2024-10-11 08:08:00", "description": "Officials say such claims could encourage people to ignore evacuation orders or spurn govt relief. Read more at straitstimes.com.", "filename": "world_united-states_disinformation-stirred-by-musk-and-trump-adds-strain-to-hurricane-recovery-in-the-us_1728740848.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/STORMFALSEHOODS2.JPG?VersionId=zTmoq1ya4eID8aGdi_T3vZKWxWNzVSXY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_disinformation-stirred-by-musk-and-trump-adds-strain-to-hurricane-recovery-in-the-us_1728740848.html", "title": "Disinformation stirred by Musk and Trump adds strain to hurricane recovery in the US", "title_page": "Disinformation stirred by Musk and Trump adds strain to hurricane recovery in the US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – US state and federal officials, already grappling with back-to-back hurricanes that have killed hundreds across the south-east, are now contending with another disaster-related threat: disinformation over their relief efforts and the cause of the storm.\nConspiracy theories and hate speech targeting the government’s storm response erupted across social media – especially on X – after Hurricane Helene devastated the region, with former president Donald Trump and X owner Elon Musk amplifying unverified allegations.\nNow, after Hurricane Milton struck Florida late on Oct 9, US officials have made it part of their strategy to rebut those falsehoods while also probing whether foreign actors share some of the blame.\nBogus claims included assertions that the Federal Emergency Management Agency (Fema) has diverted relief funding to undocumented migrants and is only providing US$750 (S$979) to disaster survivors.\nOther conspiracy theories alleged without evidence that the government would use the moment to seize private land, or that federal officials had somehow engineered the hurricanes.\nEmergency response officials and extremism researchers warn that the circulation of such deceptive claims during a disaster creates real-world peril, potentially encouraging people to ignore evacuation orders or spurn government relief.\nHate speech aimed at government agencies also risks inciting violence against officials who are delivering much-needed aid, they said.\nAt stake is more than just the safety and well-being of millions of people in the hurricanes’ paths.\nThe storms struck less than a month before the US election, with two of the hardest-hit states – Georgia and North Carolina – also considered pivotal to determining whether Vice-President Kamala Harris or Trump wins the presidency.\nMs Harris called Trump’s rhetoric “dangerous” and “unconscionable” during an interview with CNN, accusing the Republican candidate of misleading desperate people to the point that they may not receive necessary help.\nMs Jennie King, director of climate disinformation research and policy at the Institute for Strategic Dialogue (ISD), said in an interview: “The election is the mood music for absolutely everything playing out in the US, let alone a fairly unprecedented extreme weather event.\n“On top of all of the standard types of mis- and disinformation, which are primarily about opposing and delaying climate action, you also have all of the political posturing and anti-establishment conspiracy theories.”\nDisasters have long been magnets for disinformation. After wildfires ravaged the Hawaiian island of Maui in 2023, accounts linked to China pushed conspiratorial posts blaming the US government for the blazes and featured images of burning coastal roads generated by artificial intelligence, according to a Microsoft report earlier in 2024.\nMr Musk and Trump, his preferred presidential candidate, have promoted conspiracies about missing mail-in ballots and alleged that government agencies have failed to provide relief to affected areas.\nUS Representative Marjorie Taylor Greene, a Georgia Republican, wrote on X, “Yes they can control the weather”, drawing 43 million views.\nWhile Ms Greene never elaborated on who “they” were, long-established conspiracy theories have held that the US government is capable of bringing about extreme weather events such as hurricanes to directly benefit either their allies or themselves.\nThe ISD, which studies disinformation worldwide, cited 33 posts on X – featuring claims debunked by Fema – that generated more than 160 million views by Oct 7.\nPosts on X with anti-Semitic content – including attacks on public officials such as the mayor of Asheville, a Fema spokesman and Secretary of Homeland Security Alejandro Mayorkas – drew 17.1 million views as at Oct 7.\nISD identified crossover between online networks that specialise in denial of climate change and other extremist movements that previously pushed false claims about Haitian migrants in Springfield, Ohio and Russia’s full-scale invasion of Ukraine, among other contentious topics.\nNational security agencies including the Federal Bureau of Investigation and Office of the Director of National Intelligence are on alert for foreign influence operations that seize on the storms as a way to sow division in the country, according to a US official who briefed reporters on the condition of anonymity.\nTrump accused Ms Harris on Oct 9 of having “led the worst rescue operation in history in North Carolina” and repeated a false claim that the Biden administration stole money from Fema’s disaster fund to house illegal migrants.\n“The only misinformation is coming from the Harris-Biden administration,” said Ms Karoline Leavitt, a Trump campaign spokeswoman.\nPresident Joe Biden pushed back on Oct 9 night, accusing Trump, Ms Greene and others of spreading misinformation: “Quite frankly, these lies are un-American.”\nMs Harris intends to continue challenging Trump’s claims and to link his promotion of disinformation to voters’ doubts about his character, according to an adviser for the Vice-President who spoke on condition of anonymity.\nFema officials devoted their pre-storm briefing on Oct 8 to addressing deceptive claims about the storm response – an effort that includes a new website aimed at debunking online rumours.\nFema administrator Deanne Criswell, who has spent decades in emergency management, said the false rhetoric had reached a “level I’ve never seen before”.\nThe White House has used a Reddit account with posts directing victims of Hurricane Helene to federal resources and summarising the administration’s preparations for Hurricane Milton.\nIt also published a fact-check of some of the most common false claims that Trump and some other Republicans are amplifying.\nTrump’s attacks have made bedfellows of the Democratic administration and Republican officials whose constituents have lost their homes to Hurricane Helene or are recovering from Hurricane Milton.\nGovernors, mayors and members of Congress who are usually loath to break from the Republican nominee have been determined to push back on his claims.\nRepresentative Chuck Edwards, whose district includes most of storm-ravaged western North Carolina, issued a statement on Oct 8 to forcefully “dispel the outrageous rumours that have been circulated online” about the federal response.\nThe Republican congressman also reminded his constituents: “Nobody can control the weather.”\nWashington-based Republican strategist Doug Heye, a North Carolina native, has been active in calling out disinformation about the recovery process in his home state.\nRepublican officials in affected regions are spending time fact-checking their party’s presidential nominee instead of focusing on helping their constituents.\n“They and Fema have to take their eyes off the ball to deal with this and that is what is incredibly unhelpful for those who are impacted,” he said. “All of this stuff isn’t helping get relief on the ground and help the people in need.” BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/disinformation-stirred-by-musk-and-trump-adds-strain-to-hurricane-recovery-in-the-us"}