{"authors": [], "date_download": "2024-10-12 13:38:03", "date_modify": "2024-10-12 13:38:03", "date_publish": "2024-09-03 21:10:08", "description": "DUBAI/KABUL - Islamic State on Tuesday claimed responsibility for a suicide bombing in Afghanistan's capital Kabul that killed six people a day earlier, saying it was in response to the revival by Taliban authorities of detention facilities at the high-security Bagram base. Read more at straitstimes.com.", "filename": "world_islamic-state-claims-kabul-blast-citing-bagram-base-detentions_1728740283.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/ST-logo-placeholder_31.jpg?VersionId=.j6uUxBRD1qcJU3oLtnvBbYiyHY0OMjw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_islamic-state-claims-kabul-blast-citing-bagram-base-detentions_1728740283.html", "title": "Islamic State claims Kabul blast citing Bagram base detentions", "title_page": "Islamic State claims Kabul blast citing Bagram base detentions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI/KABUL - Islamic State on Tuesday claimed responsibility for a suicide bombing in Afghanistan's capital Kabul that killed six people a day earlier, saying it was in response to the revival by Taliban authorities of detention facilities at the high-security Bagram base.\nThe historic Soviet-built air strip was the main base for American forces in Afghanistan following the Sept. 11, 2001, attacks up until their 2021 withdrawal led to the takeover by the Islamist Taliban movement.\n\"The attack came in retaliation for Muslim prisoners in Taliban prisons, especially after their transfer to the notorious 'Bagram' prison, in a repeat of the American era and its practices against prisoners,\" Islamic State said in a post on its Telegram channel.\nIn the early years of the Afghan war under President George W. Bush, the CIA used Bagram as a \"black site\" detention centre for terrorism suspects, subjecting them to abuse that President Barack Obama would later acknowledge as torture.\nThe Acting Head of Prison Administration under the Taliban government, Mohammad Yusuf Mestari, said on Sunday that the prison at Bagram was being \"reactivated\" after it had not been in use for years.\nHe said the facility had been handed over the General Directorate of Intelligence and that some prisoners had been transferred there - but did not specify who they were.\nKabul police said all six killed on Monday were civilians and did not say what the target was. Islamic State, however, claimed 45 people including Taliban members had been killed when its bomber targeted people working with judicial services.\nReuters could not independently verify the casualty figures or the target. Afghanistan's Taliban-run interior ministry did not immediately respond to a Reuters request for comment.\nIslamic State-Khurasan, a local affiliate of the Middle East-based Islamic State, has waged an insurgency against the Taliban, who they see as their enemies.\nTaliban authorities say they have mostly crushed the group, even as it continues to carry out attacks in Afghanistan. Islamic State has claimed a number of attacks abroad, including a stabbing rampage in Germany, a concert hall assault in Moscow and a memorial bombing in Iran. REUTERS", "url": "https://www.straitstimes.com/world/islamic-state-claims-kabul-blast-citing-bagram-base-detentions"}