{"authors": [], "date_download": "2024-10-12 14:00:32", "date_modify": "2024-10-12 14:00:32", "date_publish": "2024-06-28 05:33:19", "description": "Chasiv Yar is seen as Moscow's next target in its slow advance through the area. Read more at straitstimes.com.", "filename": "world_europe_ukraine-military-says-russian-troops-pushed-out-of-part-of-key-eastern-town_1728741632.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/11411466.jpg?VersionId=8nTnCuZ7cGwrZFLq_qOUsJiP5iM27IrO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-military-says-russian-troops-pushed-out-of-part-of-key-eastern-town_1728741632.html", "title": "Ukraine military says Russian troops pushed out of part of key eastern town", "title_page": "Ukraine military says Russian troops pushed out of part of key eastern town | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine's military said on June 27 its forces had forced Russian troops out of a district in the town of Chasiv Yar on the war's eastern front seen as Moscow's next target in its slow advance through the area.\nBut a Russian report said Moscow's forces had destroyed a communications tower near the town and made further headway.\nRussian forces are slowly pushing their way across parts of eastern Ukraine, capturing several villages since seizing the key city of Avdiivka in February.\nChasiv Yar stands on high ground 20km to the west of Bakhmut, a town Russian forces captured a year ago after months of battles. Both sides see Chasiv Yar as a potential staging point for Russia to advance on the key cities of the eastern Donetsk region, including Kramatorsk and Slovyansk.\nMr Nazar Voloshyn, a spokesman for Ukraine's southern group of forces, told the Ukrinform news agency that Russian forces had moved out of Chasiv Yar's \"Kanal\" district along the Siverskyi Donets-Donbas canal that runs along the town's eastern edge.\n\"Ukrainian defenders have indeed squeezed Russian forces out of the Kanal district in Chasiv Yar in Donetsk region,\" Ukrinform quoted Mr Voloshyn as saying. \"The enemy army is no longer there.\"\nMr Voloshyn told other Ukrainian media outlets that Russian troops were shelling Kyiv's forces in more than 200 incidents over 24 hours, mostly on the town's southern approaches.\nThe Ukrainian military's General Staff, in a late evening report on June 27, said Russian troops had tried to push back Ukrainian forces six times near Chasiv Yar. Three attacks were repelled and fighting still gripped the area.\nUkraine's embassy in Washington posted a plea on social media platform X to stop Russia's advance on Chasiv Yar, saying Russia was \"desperately trying to wipe out the town targeting even damaged churches and civilian residential blocks of flats.", "url": "https://www.straitstimes.com/world/europe/ukraine-military-says-russian-troops-pushed-out-of-part-of-key-eastern-town"}