{"authors": [], "date_download": "2024-10-12 13:38:48", "date_modify": "2024-10-12 13:38:48", "date_publish": "2024-02-13 02:51:50", "description": "The grave was found on Feb 11 during construction of a small dam in the Sarbani area of central Khost. Read more at straitstimes.com.", "filename": "world_middle-east_decades-old-mass-grave-unearthed-in-afghanistan-taliban-officials_1728740328.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/13/btgrave20240213.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_decades-old-mass-grave-unearthed-in-afghanistan-taliban-officials_1728740328.html", "title": "Decades-old mass grave unearthed in Afghanistan: Taliban officials", "title_page": "Decades-old mass grave unearthed in Afghanistan: Taliban officials | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KABUL - A mass grave containing around 100 bodies, believed to date from Afghanistan’s Soviet-backed government era, has been discovered in the country’s eastern Khost province, local officials said on Feb 12.\nThe grave was found on Feb 11 during construction of a small dam in the Sarbani area of central Khost, mayor Bismillah Bilal said.\n“According to the initial information, these people were buried here after being killed in 1358” in the Afghan calendar, corresponding to April 1979 to March 1980, he told AFP.\n“At least 100 bodies were discovered” in the grave, Mr Bilal added, noting that some remains bore women’s clothing and that all appeared to be civilians.\nLocal residents said the remains belonged to victims of the violence that followed the 1978 Soviet-backed communist coup in Afghanistan.\n“In 1358, these people were brought here in a merciless, barbaric way by the cruel communist authorities without trial,” said Mr Salam Sharifi, whose father disappeared under the communist government, his remains never found.\n“They were martyred and we are their descendants. This is a cruelty that history will never forget,” Mr Sharifi told AFP.\nA committee has been appointed to relocate the remains, with residents helping municipality workers to remove the bodies from the site, piling the dry bones into bags that lined the excavated grave on Feb 12.\n“No one knows who these martyrs are,” said resident Mandair Mangal. “They were all buried in the earth and we are taking out the bones and sorting them.”\nAfter decades of conflict – including the Soviet invasion from 1979, the following civil war and the United States-led occupation – many mass graves have been found across Afghanistan.\nIn 2009, another mass grave of victims of the Soviet-backed government era was discovered, containing at least 20 bodies.\nMore recently, in September 2022, a mass grave containing the remains of 12 people was found in Spin Boldak, a site of fierce fighting between former Afghan government forces and Taliban fighters during their two-decade insurgency before they seized power in 2021. AFP", "url": "https://www.straitstimes.com/world/middle-east/decades-old-mass-grave-unearthed-in-afghanistan-taliban-officials"}