{"authors": [], "date_download": "2024-10-12 14:00:29", "date_modify": "2024-10-12 14:00:29", "date_publish": "2024-04-24 10:33:00", "description": "The Bill was passed easily after months of delay. Read more at straitstimes.com.", "filename": "world_us-congress-passes-ukraine-israel-foreign-aid-bill_1728741629.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/24/kc-con2504.jpg?VersionId=BgwowhtFR_lriX..0bim.mqpG9fMvk7H", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_us-congress-passes-ukraine-israel-foreign-aid-bill_1728741629.html", "title": "Biden signs into law Ukraine, Israel foreign aid Bill", "title_page": "Biden signs into law Ukraine, Israel foreign aid Bill | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - US President Joe Biden signed a hard-fought Bill into law on April 24, providing billions of dollars of new US aid to Ukraine for its war with Russia, and notching a rare bipartisan victory for the President as he seeks re-election and ending months of wrangling with Republicans in Congress.\n“It gives vital support to America’s partners, so they can defend themselves from threats to their sovereignty,” Mr Biden said.\nThe Bill was part of a sweeping foreign aid package that easily passed the US Congress late on April 23 after months of delay, clearing the way for fresh Ukraine funding amid advances from Russia’s invasion force and Kyiv’s shortages of military supplies.\nThe Senate approved, by 79 to 18, four Bills passed by the House of Representatives on April 20, after House Republican leaders abruptly switched course last week and allowed a vote on the US$95 billion (S$129 billion) in mostly military aid for Ukraine, Israel, Taiwan and US partners in the Indo-Pacific.\nThe four Bills were combined into one package in the Senate.\nUkrainian President Volodymyr Zelensky said he was grateful to US lawmakers for approving “vital” aid for Ukraine.\n“This vote reinforces America’s role as a beacon of democracy and leader of the free world,” he said in a statement on the Telegram app.\nThe largest Bill provides US$61 billion in critically needed funding for Ukraine; a second provides US$26 billion for Israel and humanitarian aid for civilians in conflict zones around the world, and a third mandates US$8.12 billion to “counter communist China” in the Indo-Pacific.\nA fourth, which the House added to the package last week, includes a potential ban on the Chinese-controlled social media app TikTok, measures for the transfer of seized Russian assets to Ukraine, and new sanctions on Iran.\nThe Biden administration is already preparing a US$1 billion military aid package for Ukraine, the first sourced from the Bill, two US officials told Reuters.\nIt includes vehicles, Stinger air defence munitions, additional ammunition for high-mobility artillery rocket systems, 155mm artillery ammunition, TOW and Javelin anti-tank munitions, and other weapons that can immediately be put to use on the battlefield.\nThe Senate’s Democratic and Republican leaders predicted that Congress had turned the corner in putting Russian President Vladimir Putin and other foreign adversaries on notice that Washington will continue supporting Ukraine and other foreign partners.\n“This national security Bill is one of the most important measures Congress has passed in a very long time to protect American security and the security of Western democracy,” Democratic Majority Leader Chuck Schumer told a news conference after the vote.\nIt was not immediately clear how the money for Israel would affect the conflict in Gaza. Israel already receives billions of dollars in annual US security assistance, but it more recently has faced its first direct aerial attack by Iran.\nAid supporters hope the humanitarian assistance will help Palestinians in Gaza, which has been devastated by Israel’s campaign against Hamas to retaliate for the Oct 7 attacks that killed 1,200 people.\nGaza health authorities say the campaign has led to the deaths of more than 34,000 civilians in the Palestinian enclave.\nIt was the second time in 2024 that the Democratic-led Senate passed security aid for Ukraine, Israel and the Indo-Pacific.\nThe last Bill, more than two months ago, garnered 70 per cent support in the 100-member Chamber from Republicans and Democrats. But leaders of the Republican-controlled House would not allow a vote on the foreign aid until last week.\nThe legislation’s progress has been closely watched by industry, with US defence firms up for major contracts to supply equipment for Ukraine and other US partners.\nExperts expect the supplemental spending to boost the order backlog of RTX along with other major companies that receive government contracts, such as Lockheed Martin, General Dynamics and Northrop Grumman.\nThe House passed the Ukraine funding by 311-112, with all “no” votes coming from Republicans, many of whom were bitterly opposed to further assistance for Kyiv. Only 101 Republicans voted for it, forcing Speaker Mike Johnson to rely on Democratic support and prompting calls for his ouster as House leader.\nHowever, the House left Washington for a week-long recess without triggering a vote to remove Mr Johnson. REUTERS", "url": "https://www.straitstimes.com/world/us-congress-passes-ukraine-israel-foreign-aid-bill"}