{"authors": [], "date_download": "2024-10-12 13:34:40", "date_modify": "2024-10-12 13:34:40", "date_publish": "2024-10-08 06:00:00", "description": "Biden, Harris mark Oct 7 with call for Mideast peace A somber US President Joe Biden lit a candle on Oct 7 at a Jewish ceremony of mourning to mark a year since Hamas’s attacks on Israel, as he and Kamala Harris stepped up what have so far been futile calls for Mideast peace. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-oct-8-6_1728740080.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/08/btbiden20241008_0.jpg?VersionId=46JA74.P_VIwdmM75ou61nUc9Kgae3gl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-oct-8-6_1728740080.html", "title": "While You Were Sleeping: 5 stories you might have missed, Oct 8", "title_page": "While You Were Sleeping: 5 stories you might have missed, Oct 8 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Biden, Harris mark Oct 7 with call for Mideast peace\nA somber US President Joe Biden lit a candle on Oct 7 at a Jewish ceremony of mourning to mark a year since Hamas’s attacks on Israel, as he and Kamala Harris stepped up what have so far been futile calls for Mideast peace.\nBiden condemned the October 7 attacks but also criticised the civilian death toll in Gaza, underscoring the tightrope that he and Democratic presidential hopeful Harris are treading on a conflict that could impact next month’s US election.\nIn a short ceremony at the White House, the 81-year-old president and First Lady Jill Biden stood in silence as a rabbi chanted a prayer for the dead, before Biden lit a single candle in memory of those killed.\nREAD MORE HERE\nUS judge orders Google to open up app store to competition\nA US judge on Oct 7 ordered Alphabet’s Google to overhaul its mobile app business to give Android users more options to download apps and to pay for transactions within them, following a jury verdict last year for “Fortnite” maker Epic Games.\nThe injunction by US District Judge James Donato in San Francisco outlined the changes Google must undertake to open up its lucrative app store, Play, to greater competition, including making Android apps available from rival sources.\nDonato’s order said that for three years Google cannot prohibit the use of in-app payment methods and must allow users to download competing third-party Android app platforms or stores.\nREAD MORE HERE\nDozens injured in Northern Ireland school bus crash\nDozens of children aboard a school bus which overturned in a crash Oct 7 suffered minor injuries, while four required hospital treatment, emergency services said.\nThe Northern Ireland Ambulance Service (NIAS) said it was dealing with the “major incident” near a village east of Belfast, on the eastern coast of the UK territory.\n“Latest information would indicate that 43 school children on the bus + 1 driver,” the NIAS said on X.\nREAD MORE HERE\nGrammy-winning Cissy Houston, mother of Whitney, dies at 91\nCissy Houston, the Grammy-winning mother of the late Whitney Houston, has died, her daughter-in-law said in a statement Oct 7. She was 91 years old.\n“It saddens my heart to announce the passing of my beloved Queen Cissy Houston today! Please keep the Houston family in your prayers,” Pat Houston wrote on Instagram.\nBorn Emily Drinkard, Cissy Houston sang soul and gospel, boasting a successful backup career for the likes of Elvis Presley, Aretha Franklin and Dionne Warwick, including as part of the popular group the Sweet Inspirations.\nREAD MORE HERE\nIBA urges federations to join legal action in Switzerland against IOC\nThe International Boxing Association (IBA) urged its national federations on Oct 7 to join legal action in Switzerland against what it called the “abusive behaviour” of Olympic organisers.\nThe IBA and International Olympic Committee (IOC) have been at loggerheads since the boxing body, led by Russian Umar Kremlev, was stripped of recognition last year over its failure to implement governance and finance reforms.\nThe tournament at the last two Olympics has been organised by the Swiss-based IOC, which has said boxing will not feature at the 2028 Los Angeles Games if national federations fail to appoint a new global body.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-oct-8-6"}