{"authors": [], "date_download": "2024-10-12 13:34:44", "date_modify": "2024-10-12 13:34:44", "date_publish": "2024-10-01 00:35:10", "description": "Israeli Prime Minister Benjamin Netanyahu has for years called for UNRWA to be dismantled. Read more at straitstimes.com.", "filename": "world_middle-east_unrwa-chief-denies-knowledge-that-suspended-employee-was-hamas-leader-in-lebanon_1728740084.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/01/btun20241001.jpg?VersionId=r8LjWdGehsXRIFbm9SdgvMk7Gj9ISEAo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_unrwa-chief-denies-knowledge-that-suspended-employee-was-hamas-leader-in-lebanon_1728740084.html", "title": "UNRWA chief denies knowledge that suspended employee was Hamas leader in Lebanon", "title_page": "UNRWA chief denies knowledge that suspended employee was Hamas leader in Lebanon | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GENEVA - The UN Palestinian refugee agency (UNRWA) chief on Sept 30 denied knowing that its employee Fateh Sherif Abu el-Amin was a Hamas commander in Lebanon and called on states to push back against Israeli attacks on the agency.\nThe head of Hamas’ Lebanon branch, Abu el-Amin was killed along with family members in an Israeli strike in southern Lebanon, the group said on Sept 30. He was suspended from his job at UNRWA in March following allegations concerning his politics, Philippe Lazzarini told reporters in Geneva.\n“I never heard the word commander before,” he said. “What’s obvious for you today, was not obvious yesterday.”\nLazzarini, who briefed press after meeting with UN member states earlier on Sept 30, said he asked them to “push back on all the reputation attack on the agency and the ongoing drafting of bills which could be adopted in Jerusalem.”\nHe was referring to a move by Israeli parliament to declare the organisation a “terrorist body” which has already received preliminary approval. Such a move would be “absolutely unconscionable”, he added.\nIsraeli Prime Minister Benjamin Netanyahu has for years called for UNRWA to be dismantled, accusing it of anti-Israeli incitement.\nUNRWA (United Nations Relief and Works Agency for Palestine Refugees in the Near East) was established in 1949 and provides relief to Palestinian refugees across the Middle East, including in Lebanon where it says up to 250,000 reside.", "url": "https://www.straitstimes.com/world/middle-east/unrwa-chief-denies-knowledge-that-suspended-employee-was-hamas-leader-in-lebanon"}