{"authors": [], "date_download": "2024-10-12 13:36:22", "date_modify": "2024-10-12 13:36:22", "date_publish": "2024-09-11 05:37:48", "description": "The rapper has moved to have the case dismissed. Read more at straitstimes.com.", "filename": "world_sean-diddy-combs-ordered-to-pay-100-million-in-sexual-assault-lawsuit_1728740182.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/rrdiddy1109.jpg?VersionId=iBGlaXB5_ul39xT8flC_WC_CeDXTFFI6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_sean-diddy-combs-ordered-to-pay-100-million-in-sexual-assault-lawsuit_1728740182.html", "title": "Sean ‘Diddy’ Combs ordered to pay $130 million to man who claims rapper sexually assaulted him", "title_page": "Sean ‘Diddy’ Combs ordered to pay $130 million to man who claims rapper sexually assaulted him | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – A Michigan inmate who accused Sean “Diddy” Combs of drugging and sexually assaulting him at a party almost 30 years ago has been awarded a US$100 million (S$130 million) judgment against the American rapper and record producer.\nDerrick Lee Smith, 51, won the multi-million-dollar judgment by default at Lenawee County Circuit Court during a virtual hearing on Sept 9 after Combs, 54, failed to show up.\nAn attorney for Combs said the rapper would move to have the judgment dismissed.\n“This man (Smith) is a convicted felon and sexual predator, who has been sentenced on 14 counts of sexual assault and kidnapping over the last 26 years,” said attorney Marc Agnifilo in a statement.\n“His resume now includes committing a fraud on the court from prison, as Mr Combs has never heard of him, let alone been served with any lawsuit. Mr Combs looks forward to having this judgment swiftly dismissed.”\nSmith, who was sentenced to prison for 75 years on sexual misconduct and kidnapping charges, filed complaints against Combs in June and August. He was given a temporary restraining order against Combs, who has several other sexual assault cases still pending.\nCombs, founder of the landmark label Bad Boy Records, is one of the most influential producers and executives in hip-hop and a hugely successful performer. He is also the impresario of his own Sean John clothing line. REUTERS", "url": "https://www.straitstimes.com/world/sean-diddy-combs-ordered-to-pay-100-million-in-sexual-assault-lawsuit"}