{"authors": [], "date_download": "2024-10-12 13:59:38", "date_modify": "2024-10-12 13:59:38", "date_publish": "2023-12-17 01:43:08", "description": "Notre-Dame is set to reopen for religious services and to the public on Dec 8, 2024. Read more at straitstimes.com.", "filename": "world_europe_notre-dame-rooster-back-on-paris-cathedrals-spire-as-renovation-enters-final-stage_1728741578.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/17/FRANCE-ARCHITECTURE-HERITAGE-RELIGION-CHURCH-RENOVATION-152013.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_notre-dame-rooster-back-on-paris-cathedrals-spire-as-renovation-enters-final-stage_1728741578.html", "title": "Notre-Dame rooster back on Paris cathedral’s spire as renovation enters final stage", "title_page": "Notre-Dame rooster back on Paris cathedral’s spire as renovation enters final stage | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - A large crane hoisted a new copper rooster back to the top of the spire of Notre-Dame on Dec 16, a meaningful milestone as workers race to finish renovating the fire-damaged Paris cathedral over the next 12 months.\nDuring the fire – which happened on April 15, 2019, and ravaged the cathedral – the old rooster crashed through the roof along with the wooden spire at the top of which it had been fixed. It was found dented but nearly intact among debris the day after the fire, and will be displayed in a new Notre Dame museum.\nThe new weather vane rooster, made of golden copper, was blessed by Paris Archbishop Laurent Ulrich during a ceremony on the morning of Dec 16. Inside the rooster are religious relics and a parchment with a long list of the names of workers, as well as donors and patrons.\n“It’s a phoenix,” said Mr Philippe Villeneuve, chief architect of France’s historical sites, who designed the flame-shaped rooster.\n“(It) shows that the flame is carried to the highest point of the cathedral... the fire is carried up there, but it’s a fire of resurrection,” he added, recalling the moment when he held the fallen rooster in front of cameras after the devastating fire.\nLast week, during a visit to the rebuilt spire, French President Emmanuel Macron pledged that reconstruction of the cathedral would be completed as scheduled and that it would reopen within 12 months.\nWhile still surrounded by metal scaffolding, the spire has again been part of Paris’ skyline since late November.\nThe 96m-tall spire was not part of the original design of the cathedral – which was built over nearly 200 years, starting in the middle of the 12th century. It was added during a 19th-century restoration by architect Eugene Viollet-le-Duc.", "url": "https://www.straitstimes.com/world/europe/notre-dame-rooster-back-on-paris-cathedrals-spire-as-renovation-enters-final-stage"}