{"authors": [], "date_download": "2024-10-12 13:53:22", "date_modify": "2024-10-12 13:53:22", "date_publish": "2024-09-05 21:30:55", "description": "Operators failed to implement technology forcing customers to park scooters in authorised areas. Read more at straitstimes.com.", "filename": "world_europe_madrid-to-ban-e-scooters-for-reckless-driving-and-chaotic-parking_1728741202.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/LYNXMPEK840MZ-1.jpg?VersionId=uHyIlHwilq5nT32xhX1vIwko0tWn5hL1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_madrid-to-ban-e-scooters-for-reckless-driving-and-chaotic-parking_1728741202.html", "title": "Madrid to ban e-scooters for reckless driving and chaotic parking", "title_page": "Madrid to ban e-scooters for reckless driving and chaotic parking | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MADRID – Spain’s capital will ban e-scooters rented through mobile apps after the city’s three licensed operators failed to implement limits on their clients’ circulation or control their parking, Madrid Mayor Jose Luis Martinez-Almeida said in a statement.\nMr Martinez-Almeida said the licenses of Lime, Dott and Tier Mobility would be cancelled from October and that the city has no plans to grant new licences to any other operators.\n“The market was found to be incapable of meeting the requirements set by the mayor’s office to ensure the highest level of safety for citizens,” he said in a statement on Sept 5.\nThe so-called scooter sharing system has raised opposition in cities worldwide due to reckless driving by users on streets and pavements, as well as haphazard parking that often leaves public spaces cluttered.\nSince May 2023, the Madrid city council regulated the rental e-scooter market, authorising only Amsterdam-based Dott, Germany’s Tier Mobility and US-based Lime, whose scooters are available on Uber’s app.\nThey were authorised to rent 2,000 scooters each.\nThe three operators were supposed to give the mayor’s office access to its data and were ordered to implement technology forcing their customers to leave the scooters in authorised areas only, preventing them from hiring them in pedestrian-only streets or near historic parks.\nThey failed to meet those conditions, the statement said, adding that they have 20 days to appeal.\nDott, Lime and Tier did not immediately respond to requests for comment.\nMadrid follows in the footsteps of Paris, which in 2023 banned e-scooter rentals following a public consultation. REUTERS", "url": "https://www.straitstimes.com/world/europe/madrid-to-ban-e-scooters-for-reckless-driving-and-chaotic-parking"}