{"authors": [], "date_download": "2024-10-12 14:16:51", "date_modify": "2024-10-12 14:16:51", "date_publish": "2022-03-12 21:01:38", "description": "UNHCR reported that nearly 2.6 million people had fled Ukraine as at Friday. Read more at straitstimes.com.", "filename": "world_europe_refugee-arrivals-dip-but-ukraines-neighbours-scramble-to-provide-shelter_1728742611.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/12/ads-refugees-12032022.jpg?VersionId=MZtb3p0YwufnrSzxKUma9jbF0FOQWoqZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_refugee-arrivals-dip-but-ukraines-neighbours-scramble-to-provide-shelter_1728742611.html", "title": "Refugee arrivals dip, but Ukraine's neighbours scramble to provide shelter", "title_page": "Refugee arrivals dip, but Ukraine's neighbours scramble to provide shelter | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PRZEMYSL, POLAND (REUTERS) - Ukraine’s neighbours reported a dip in numbers of refugees on Saturday (March 12) as governments and volunteers struggled to find shelter for the nearly 2.6 million mostly women and children who have fled since Russia’s invasion two weeks ago.\nArrivals were still building on an influx that is overwhelming volunteers, non-governmental organisations and authorities in eastern Europe’s border communities as well as the big cities to which most of the refugees head.\nPoland’s Border Guard said 76,200 people arrived on Friday - a drop of 12 per cent from the day before. Slovak police reported a similar dip in numbers, to 9,581 people, and arrivals to Romania dropped by 22 per cent to 16,348, police said.\nElena Pugachova, 52, a psychologist from Ukraine’s port city of Odessa, fought back tears after she stepped off a ferry that had carried her across the Danube river to Romania.\n“I can’t speak without tears, I’m sorry, but I’m really sorry for my country and nobody could expect this...They’re bombing Kharkiv, they’re bombing Mykolayiv, it’s only 120km from Odessa and it’s painful inside,” she said.\nMayor Wojciech Bakun of Przemysl, a Polish city of 60,000 near the Medyka border crossing, said the number of people arriving fell to around 18,000 over the past day from 23,000 the day before and peaks of over 50,000.\nHe said he needed support to prepare accommodation for 2,000-3,000 people.\n“I have the buildings but they need work, it would require between 10 million and 20 million zloty (S$3.1 million to S$6.2 million). I can’t finance this from the municipal budget as we have other needs, it could be funds from the European Union or from the government,” he said.\nVeronika Zhushman, 32, travelling with her six-year-old daughter, mother and younger sister from Vasylkiv in the Kyiv region, had slept the night in a sports gymnasium at a high school in the city.\nShe was woken up early on Saturday morning by another refugee’s mobile alert about a bombing.\n“I haven’t slept well since the beginning of the invasion… after the alarm went off I felt worried all over again,” she said.\nFighting raged near Kyiv on Saturday and Ukrainian officials said heavy shelling and threats of Russian air attacks were endangering attempted evacuations of desperate civilians from encircled towns and cities.\nThe United Nations refugee agency UNHCR reported that nearly 2.6 million people had fled Ukraine as of Friday, 1.6 million of them heading to Poland.\nRefugees have aimed for cities with established Ukrainian communities and better chances of finding work.\nIn the capital Warsaw, a city of 1.8 million before the Russian attack, refugees now make up more than 10% of the population, the city’s mayor said on Friday.\nCzechs ask EU partners for help\nHungary has received over 230,000 refugees, with 10,530 arrivals on Friday. Romania reported 380,866, including 16,348 on Friday.\nSlovakia reported 185,660 arrivals, with most continuing their journey further west.\nThe western route often goes to the Czech Republic, where officials on Friday estimated the number of refugees at 200,000.\nOn Saturday, the country asked EU partners to provide modular homes to shelter 50,000 refugees. Refugees would also be housed in gyms, halls and possibly tent camps, Interior Minister Vit Rakusan told news agency CTK.\nCzech police warned refugees about scammers offering help with visa processing and other assistance for money, or taking personal data that could be abused to steal or launder money.\nThey also urged caution about suspicious offers of work that could lead to forced prostitution or trafficking.\nRussia calls its actions in Ukraine a special military operation to disarm its neighbour and dislodge its “neo-Nazi” leaders. Kyiv and its Western allies say this is a baseless pretext to invade a country of 44 million people.", "url": "https://www.straitstimes.com/world/europe/refugee-arrivals-dip-but-ukraines-neighbours-scramble-to-provide-shelter"}