{"authors": [], "date_download": "2024-10-12 14:18:01", "date_modify": "2024-10-12 14:18:01", "date_publish": "2022-09-02 21:25:54", "description": "The plan is part of broader efforts to punish Russia for its military invasion of Ukraine. Read more at straitstimes.com.", "filename": "world_g-7-finance-ministers-agree-to-russian-oil-price-cap_1728742681.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/03/10134564.jpg?VersionId=yTJCjQUc4hPQOJU54PJjlgkOmyrkbaS2&h=3c991e7d", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_g-7-finance-ministers-agree-to-russian-oil-price-cap_1728742681.html", "title": "G-7 ministers forge ahead with Russian oil price cap, details thin", "title_page": "G-7 ministers forge ahead with Russian oil price cap, details thin | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Group of Seven (G-7) finance ministers agreed on Friday to impose a price cap on Russian oil aimed at slashing revenues for Moscow’s war in Ukraine while keeping oil flowing to avoid price spikes, but Russia vowed to halt sales to countries imposing it.\nThe ministers confirmed their commitment to forming a buyer’s cartel after meeting virtually. They said, however, that key details, including the per-barrel level of the cap would be determined later “based on a range of technical inputs” to be agreed by the coalition of countries implementing it.\n“Today we confirm our joint political intention to finalise and implement a comprehensive prohibition of services which enable maritime transportation of Russian-origin crude oil and petroleum products globally,” the ministers said.\nThe provision of Western-dominated maritime transportation services, including insurance and finance, would be allowed only if the Russian oil cargoes are purchased at or below the price level “determined by the broad coalition of countries adhering to and implementing the price cap.”\nOleg Ustenko, a senior economic adviser to Ukrainian President Volodymyr Zelensky, welcomed the development, and said he expected the price range to be between US$40 and US$60.\n“This is fantastic. It’s exactly what we needed” to reduce the revenues that Russia was collecting, he told Reuters. Brent crude futures rose 66 cents to US$93.02 a barrel on Friday.\nZelensky himself, in a video address, said a cap should also be imposed on Russian natural gas exports.\nA senior US Treasury official said the coalition would set a dollar price limit for Russian crude and two others for petroleum products – not discounts to global market prices. The cap would be revisited as needed.\nThe G-7 ministers said they would work to finalise the details in time to launch by Dec 5, when new European Union sanctions initiate a ban on Russian oil imports.\nGerman Finance Minister Christian Lindner, the current G-7 finance chair, said the price cap on Russian oil exports was designed to reduce President Vladimir Putin’s revenues.\n“At the same time, we want to curb rising global energy prices. This will minimise inflation globally,” he said.\nOil cutoff threat\nThe Kremlin responded by saying it would stop selling oil to countries implementing the price cap, saying it would destabilize global oil markets.\n“We simply will not cooperate with them on non-market principles,” spokesman Dmitry Peskov told reporters.\nNonetheless, US Treasury Secretary Janet Yellen said Russia would still have an economic incentive to sell oil at or near the cap, because otherwise it would have to shut down production that would be difficult to restart. China and India also would seek to buy oil at the capped price, she added.\nFrench Finance Minister Bruno Le Maire injected a dose of reality, telling his G-7 counterparts that more work was needed to work out technical details, persuade a critical mass of importers to join the plan and preserve European unity on the subject, his office said in a statement.\n“We got positive signals from other countries, but no firm commitments yet,” a senior G-7 source said of efforts to recruit other countries. “We wanted to send a signal of unity towards Russia and also countries like China.”\nThe G-7 announcement had little effect on benchmark crude prices, which rose in anticipation of an Opec+ discussion of output cuts on Monday amid weaker demand.\nEnforcing the cap would rely heavily on denying London-brokered shipping insurance, which covers about 95 per cent of the world’s tanker fleet, and finance to cargoes priced above the cap. But some analysts say alternatives could be found to circumvent it.\nThe G-7 ministers said they would seek to limit circumvention through “a record-keeping and attestation model covering all relevant types of contracts” that aims for consistent enforcement across jurisdictions.", "url": "https://www.straitstimes.com/world/g-7-finance-ministers-agree-to-russian-oil-price-cap"}