{"authors": [], "date_download": "2024-10-12 14:00:21", "date_modify": "2024-10-12 14:00:21", "date_publish": "2024-07-05 14:26:00", "description": "Kyiv has dealt a series of stinging blows to Moscow in the Black Sea. Read more at straitstimes.com.", "filename": "world_europe_ukraine-navy-chief-says-russia-is-losing-crimean-hub-in-black-sea_1728741621.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/05/LYNXMPEK6407V-1.jpg?VersionId=DpaxTcUlY3e6WX5uz.TmghBO8eXSYN4S", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-navy-chief-says-russia-is-losing-crimean-hub-in-black-sea_1728741621.html", "title": "Ukraine’s navy chief says Russia is losing Crimea hub in Black Sea", "title_page": "Ukraine’s navy chief says Russia is losing Crimea hub in Black Sea | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ODESA, Ukraine – The Russian navy’s Black Sea Fleet has been forced to move nearly all its combat-ready warships from Ukraine’s occupied Crimea peninsula to other locations and its main naval hub is becoming ineffectual because of attacks by Kyiv, Ukraine’s navy chief said.\nVice-Admiral Oleksiy Neizhpapa said Ukrainian missile and naval drone strikes have caused heavy damage to the Sevastopol base, a logistics hub for repairs, maintenance, training and ammunition storage among other important functions for Russia.\n“They were established over many decades, possibly centuries. And clearly they are now losing this hub,” Vice-Adm Neizhpapa told Reuters, in a rare interview in the port city of Odesa, ahead of Ukraine Navy Day on July 7.\nMore than 28 months after Russia’s full-scale invasion, Kyiv has dealt a series of stinging blows to Moscow in the Black Sea, although Ukrainian ground troops are on the back foot across a sprawling front.\nUkraine, which has no major warships at its disposal, has used uncrewed naval boats packed with explosives to target Russian vessels and pounded the fleet’s facilities and other military targets on Crimea with Storm Shadow and ATACMS missiles.\n“Almost all the main combat-ready ships have been moved by the enemy from the main base of the Black Sea Fleet, and the ships are kept in Novorossiisk, and some of them are kept in the Sea of Azov,” he said.\nRussia’s Novorossiisk naval base on its eastern Black Sea coast lacks the extensive facilities of Crimea’s Sevastopol, which served as the storage and loading site for cruise missiles used by its warships to launch air strikes on Ukraine, he added.\n“I understand that they are now trying to solve this problem in Novorossiisk,” he said, describing this as a “main issue” for the fleet.\nRussia’s Defence Ministry did not respond to a Reuters request for comment on Vice-Adm Neizhpapa’s remarks.\nPresident Vladimir Putin told navy chiefs in June that Russia’s fleet had been replenished over recent years and that a major modernisation was under way, including steps to “increase the combat stability of the fleet” and strengthen it.\nAlongside strategic bombers and ground-based launchers, missile-carrying warships and submarines play an important role in Russia’s regular long-range missile attacks.\nVice-Adm Neizhpapa said Ukraine had destroyed or damaged 27 naval vessels, including five that he said were destroyed by sea mines laid by Ukrainian naval drones near the Bay of Sevastopol.\nMoscow seized and annexed Crimea from Ukraine in 2014. Before February 2022, Russia used its Black Sea Fleet, which consists of dozens of warships, to project power into the Mediterranean and the Middle East.\nThroughout the Ukraine war, Turkey, which controls the straits in and out of the Black Sea, has not allowed warships to enter or exit.\nDefensive posture\nIn a sign of their more defensive posture, some Russian warships that seldom entered the Sea of Azov to the east of Crimea are now stationed there regularly, Vice-Adm Neizhpapa said.\nMonitoring data compiled by the Ukrainian Navy and provided to Reuters showed that as at June 27, 10 Russian warships were stationed in the Sea of Azov, compared with none in 2023.\nThe Black Sea Fleet is primarily used now for logistics, a small amount of coastal territorial control and for firing Kalibr cruise missiles at Ukraine, he said.\nHe declined to say what Ukraine’s future plans in the Black Sea would involve.\nUkraine’s operations in the Black Sea have allowed it to establish and secure its own shipping corridor without Russia’s blessing after Moscow pulled out of the wartime food export deal brokered by the UN in 2023.\nThe pushback began with Ukrainian coastal defences that allowed it to force naval vessels away. In April 2022, Ukrainian anti-ship missiles sank the Moskva, the flagship of Russia’s Black Sea Fleet, in a humiliating blow for the Kremlin.\nWith the addition of naval drone attacks and strikes, Russian warships do not enter the north-western part of the Black Sea over an area of almost 25,000 sq km, Vice-Adm Neizhpapa said.\nHe said the delivery of US-made F-16 fighter aircraft, expected to happen soon, would be a boost, allowing Ukraine to challenge what he called Russia’s “full dominance” of the skies over the Black Sea.\n“F-16s with the right armaments will be able to push away Russian warplanes. The north-western part of the Black Sea, particularly the corridor for civilian ships, will be almost 100 per cent secure,” he said.", "url": "https://www.straitstimes.com/world/europe/ukraine-navy-chief-says-russia-is-losing-crimean-hub-in-black-sea"}