{"authors": [], "date_download": "2024-10-12 14:04:49", "date_modify": "2024-10-12 14:04:49", "date_publish": "2023-05-28 16:47:00", "description": "Italy is the only major Western country to have joined China’s BRI scheme. Read more at straitstimes.com.", "filename": "world_europe_italy-pm-meloni-says-good-ties-with-china-possible-without-belt-and-road-initiative_1728741889.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/28/10653226_1.jpg?VersionId=O817YgKQvRgi6qSXuakk5qsJk1PiaJxq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_italy-pm-meloni-says-good-ties-with-china-possible-without-belt-and-road-initiative_1728741889.html", "title": "Italy PM Meloni says good ties with China possible without Belt and Road Initiative", "title_page": "Italy PM Meloni says good ties with China possible without Belt and Road Initiative | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MILAN - Good relations with China are possible even without being part of the Belt and Road Initiative (BRI) deal, Italian Prime Minister Giorgia Meloni said in an interview published on Sunday, as her government weighs abandoning the project.\nItaly is the only major Western country to have joined China’s BRI scheme.\nThe Chinese initiative envisions rebuilding the old Silk Road to connect China with Asia, Europe and beyond with large infrastructure spending.\nIn an interview with Il Messaggero daily, Ms Meloni said it is too early to anticipate the outcome of Italy’s decision on whether to remain part of the project.\nRome signed up to the deal in 2019, drawing criticism from Washington and Brussels.\n“Our assessment is very delicate and touches upon many interests,” said Ms Meloni.\nThe pact expires in March 2024 and will be automatically renewed unless either side informs the other that they are pulling out, giving at least three months’ notice.\nIn an interview with Reuters in 2022, before she won power in a September election, Ms Meloni made clear she disapproved of the 2019 move.\nShe said she had “no political will… to favour Chinese expansion into Italy or Europe”.\nMs Meloni noted that while Italy was the only one of the Group of Seven (G-7) rich democracies to have signed the Belt and Road memorandum, it was not the European and Western country with the strongest economic and trade ties with China.\n“This means it is possible to have good relations, also in important areas, with Beijing, without necessarily these being part of an overall strategic design,” she said.\nEarlier in May, a senior Italian government official told Reuters Italy was highly unlikely to renew the Belt and Road deal.\nA first test of the right-wing government’s attitude towards China looms as Rome vets a shareholder pact at tyre maker Pirelli, whose top investor is China’s Sinochem.\nChina is among the biggest markets for most countries in the G-7 group, particularly for export-reliant economies such as Japan and Germany.", "url": "https://www.straitstimes.com/world/europe/italy-pm-meloni-says-good-ties-with-china-possible-without-belt-and-road-initiative"}