{"authors": [], "date_download": "2024-10-12 13:34:55", "date_modify": "2024-10-12 13:34:55", "date_publish": "2024-09-24 23:48:00", "description": "A way towards peace, though, is clouded by the failure of an international effort to broker a ceasefire in Gaza. Read more at straitstimes.com.", "filename": "world_biden-urges-world-leaders-at-un-meet-to-stop-full-scale-war-in-lebanon_1728740095.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/11622438.jpg?VersionId=8m5wt.76tGjw0PR12B4CKP0PLcS_Rxr5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_biden-urges-world-leaders-at-un-meet-to-stop-full-scale-war-in-lebanon_1728740095.html", "title": "Biden urges world leaders at UN meet to stop ‘full-scale war’ in Lebanon", "title_page": "Biden urges world leaders at UN meet to stop ‘full-scale war’ in Lebanon | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – US President Joe Biden asked world leaders on Sept 24 to prevent “full-scale war” over Lebanon, as clashes escalated between Israel and Hezbollah, prompting the UN chief to warn of a situation “on the brink”.\nThe United Nations General Assembly – the high point of the diplomatic calendar – comes as the Lebanese authorities say Israeli strikes killed 558 people, 50 of them children.\n“Full-scale war is not in anyone’s interest. Even though the situation has escalated, a diplomatic solution is still possible,” Mr Biden said in his farewell address to the global body.\n“In fact, (it) remains the only path to lasting security to allow the residents from both countries to return to their homes on the border safely.”\nHe also pushed again for an elusive ceasefire between Israel and Hamas, telling the global body it was time to “end this war”.\nUN Security Council member France called for an emergency meeting on the crisis, as the European Union’s top diplomat, Mr Josep Borrell, warned “we are almost in a full-fledged war”.\n“We should all be alarmed by the escalation. Lebanon is at the brink,” UN Secretary-General Antonio Guterres said.\nPresident Masoud Pezeshkian of Iran, which backs both Hezbollah and Hamas, condemned the “senseless and incomprehensible” inaction by the UN against Israel.\nThe United States, Israel’s closest ally, has opposed a ground invasion into Lebanon. A senior official said ahead of Mr Biden’s speech that the US would bring “concrete” ideas for de-escalation to the UN.\nIt is unclear what progress can be made to defuse the situation in Lebanon as the efforts to broker a ceasefire in Gaza, which Israel has relentlessly pounded since October 2023, have come to nothing.\nMr Guterres cautioned against “the possibility of transforming Lebanon (into) another Gaza”, calling the situation in the embattled Palestinian territory a “non-stop nightmare”.\n‘Charade of hypocrisy’\nIsrael’s ambassador to the UN, Mr Danny Danon, hit back at the UN chief, calling the General Assembly debate an “annual charade of hypocrisy”.\n“When the UN secretary-general speaks about the release of our hostages, the UN assembly is silent. But when he speaks about the suffering in Gaza, he receives thunderous applause,” Mr Danon said.\nSince the annual gathering in 2023, when Sudan’s civil war and Russia’s Ukraine invasion dominated, the world has faced an explosion of crises.\nThe Oct 7 attack by the Palestinian Islamist group Hamas on Israel and the ensuing violence in the Middle East has exposed deep divisions in the global body.\nMr Richard Gowan of the International Crisis Group think-tank said he expects many leaders to “warn that the UN will become irrelevant globally if it cannot help make peace”.\nWith Israel’s leader, Mr Benjamin Netanyahu, and Palestinian President Mahmud Abbas expected to address the General Assembly this week, there could be combustible moments.\nMr Abbas took his seat alongside the Palestinian delegation in alphabetical order for the first time after the delegation received upgraded privileges in the assembly in May.\nOn Sept 24, representatives of Turkey, Jordan, Qatar, Iran and Algeria were slated to take the podium to press for a Gaza ceasefire after nearly one year of war.\n“The level of impunity in the world is politically indefensible and morally intolerable,” Mr Guterres said in his speech to the General Assembly, adding that “a growing number of governments and others feel entitled to a ‘get out of jail free’ card.”\nUkraine still on the agenda\nUkraine was also on the agenda on Sept 24, when President Volodymyr Zelensky was set to addresses a UN Security Council meeting on the Russian invasion.\nMr Biden said Russian President Vladimir Putin’s war has failed at its core aim.\n“He set out to destroy Ukraine, but Ukraine is still free,” he said.\nIt is unclear if the grand diplomatic gathering can achieve anything for the millions mired in conflict, poverty and climate crisis globally.\n“Any real diplomacy to reduce tensions will take place behind the scenes,” Mr Gowan said. AFP", "url": "https://www.straitstimes.com/world/biden-urges-world-leaders-at-un-meet-to-stop-full-scale-war-in-lebanon"}