{"authors": [], "date_download": "2024-10-12 14:10:10", "date_modify": "2024-10-12 14:10:10", "date_publish": "2019-01-01 10:31:00", "description": "ISTANBUL (REUTERS) - A Turkish pro-government television channel has broadcast video showing men carrying suitcases purportedly containing the remains of Saudi journalist Jamal Khashoggi into the residence of his country's consul general in Istanbul. Read more at straitstimes.com.", "filename": "world_middle-east_turkish-tv-shows-purported-transfer-of-khashoggi-remains_1728742210.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/01/01/bp_khashoggi_010119_31.jpg?VersionId=tNJIyhwPVB1Cb1YmPwjqk_cbk5s0ET8C", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_turkish-tv-shows-purported-transfer-of-khashoggi-remains_1728742210.html", "title": "Turkish TV shows purported transfer of Khashoggi remains", "title_page": "Turkish TV shows purported transfer of Khashoggi remains | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ISTANBUL (REUTERS) - A Turkish pro-government television channel has broadcast video showing men carrying suitcases purportedly containing the remains of Saudi journalist Jamal Khashoggi into the residence of his country's consul general in Istanbul.\nThe footage broadcast by A Haber shows men carrying what it says were a total of five cases through the main entrance of the residence, a short distance from the consulate where Khashoggi, a leading critic of Saudi policies, was killed in early October.\nA Turkish official said the media report, also carried by the pro-government Sabah newspaper on its website, appeared to be accurate, without giving further details.\nThere was no immediate reply from Saudi authorities to a Reuters request for comment on the footage.\nKhashoggi was a royal insider who became a critic of Crown Prince Mohammed bin Salman and began writing for the Washington Post after moving to the United States last year.\nSaudi officials have rejected accusations that the crown prince ordered his death. The murder has sparked global outrage and damaged the international reputation of 33-year-old prince, the kingdom's de facto leader.\nSabah said the cases had been brought to the residence in a black minibus at 3.09pm (1209 GMT).\nAfter offering numerous contradictory explanations regarding the fate of Khashoggi, Riyadh later said he had been killed and his body dismembered when negotiations to persuade him to return to Saudi Arabia failed.\nKhashoggi's remains have not been found and Turkey has repeatedly asked Saudi Arabia where they are. Last month, Turkish police searched a remote villa in a coastal area southeast of Istanbul as part of the investigation.\nSaudi Arabia's public prosecutor's office said last month it is seeking the death penalty for five individuals, and that 11 of 21 suspects have been indicted and will be referred to court in Saudi Arabia.\nTurkish Foreign Minister Mevlut Cavusoglu said last week Ankara was working with other countries to take the investigation into Khashoggi's killing to the United Nations.", "url": "https://www.straitstimes.com/world/middle-east/turkish-tv-shows-purported-transfer-of-khashoggi-remains"}