{"authors": [], "date_download": "2024-10-12 13:35:29", "date_modify": "2024-10-12 13:35:29", "date_publish": "2024-08-30 05:23:46", "description": "Nicaragua's government has banned 169 non-governmental organizations for allegedly not complying with sector regulations, according to a resolution published on Thursday in the government gazette. Read more at straitstimes.com.", "filename": "world_nicaragua-shutters-another-169-civil-society-groups-as-purge-intensifies_1728740129.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/30/LYNXMPEK7T02Y-1.jpg?VersionId=6rFaBSPiNh891Qw8SPwyUnKq44n4fNQK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_nicaragua-shutters-another-169-civil-society-groups-as-purge-intensifies_1728740129.html", "title": "Nicaragua shutters another 169 civil society groups as purge intensifies", "title_page": "Nicaragua shutters another 169 civil society groups as purge intensifies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Nicaragua's government has banned 169 non-governmental organizations for allegedly not complying with sector regulations, according to a resolution published on Thursday in the government gazette.\nThe organizations included Save The Children Canada, religious groups, livestock and agricultural associations, and foundations fighting diseases such as cancer and HIV/AIDS.\nWHY IT'S IMPORTANT\nThe move represents a further blow to civil society as part of a longstanding crackdown on groups viewed as hostile by President Daniel Ortega.\nKEY QUOTE\n\"They have not fulfilled their obligations,\" said the resolution, signed by Interior Minister Maria Amelia Coronel. It accused the groups of not providing detailed financial statements.\nCONTEXT\nThe government outlawed 1,500 groups for similar reasons just ten days ago. Since anti-government protests in 2018, Ortega's administration has banned thousands of NGOs, universities and media outlets, and jailed or expelled hundreds of opposition figures.\nBY THE NUMBERS\nOver 4,000 such organizations have been closed, according to activists. In many cases, their property or assets have been confiscated by the state. REUTERS", "url": "https://www.straitstimes.com/world/nicaragua-shutters-another-169-civil-society-groups-as-purge-intensifies"}