{"authors": [], "date_download": "2024-10-12 13:36:13", "date_modify": "2024-10-12 13:36:13", "date_publish": "2024-09-20 22:16:00", "description": "His efforts included becoming a sponsor of the Royal Windsor Horse Show. Read more at straitstimes.com.", "filename": "world_europe_billionaire-mohamed-al-fayed-outsider-shunned-by-british-high-society_1728740173.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/FILES-BRITAIN-CRIME-ASSAULT-HARRODS-125817.jpg?VersionId=CDuCQw2xskCREtSYFeR5LBvvuGuM_UOB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_billionaire-mohamed-al-fayed-outsider-shunned-by-british-high-society_1728740173.html", "title": "Billionaire Mohamed Al-Fayed: An outsider shunned by British high society", "title_page": "Billionaire Mohamed Al-Fayed: An outsider shunned by British high society | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Mr Mohamed Al-Fayed spent years trying to gain admission to the upper echelons of UK society, but ultimately failed to win either acceptance or British citizenship.\nIn his quest for the recognition he craved, the Egyptian billionaire, who died in 2023 aged 94, repeatedly attempted to ingratiate himself with the royal family.\nHis efforts included becoming a sponsor of the Royal Windsor Horse Show, one of the late Queen Elizabeth II’s favourite annual events.\nIn 1985, he also purchased Harrods, the luxury department store in London’s Knightsbridge, where the multiple women and girls he is now accused of raping and sexually assaulting were employees.\nOther lavish purchases that failed to secure his objectives include Fulham football club and the Ritz hotel in Paris.\nHis son Dodi’s fateful relationship with Princess Diana, which he engineered, might have led to a degree of acceptance.\nInstead, it marked his permanent estrangement after he insisted – without evidence – the queen’s husband Prince Philip had ordered the Paris car crash in which Diana and Dodi were killed to prevent her marrying a Muslim.\nMr Al-Fayed’s claims against the royal family came at a price.\nHarrods lost a royal warrant bestowed by Prince Philip in 2000, after what Buckingham Palace called “a significant decline in the trading relationship” between the royal member and the store.\nThe Establishment “dislike my outspokenness and determination to get the truth”, he said, as he announced his exile to Switzerland in 2003 because of his claims and what he said was the “unfair” treatment at the hands of the tax authorities.\nMr Al-Fayed, known for his outspoken and often foul-mouthed manner, was once dubbed the “phoney Pharaoh” by British media after a government report described his claims of a wealthy ancestry as “completely bogus”.\nFar from being the scion of a dynasty of cotton and shipping barons as he had portrayed himself, Mr Al-Fayed was the son of a poor Alexandrian schoolteacher who, after an early venture selling lemonade, set out in business selling sewing machines.\nHe later had the good luck to start working for the arms dealer Adnan Khashoggi, who recognised his business abilities and employed him in his furniture export business in Saudi Arabia.\nHe became an adviser to the Sultan of Brunei in the mid-1960s and moved to Britain in the 1970s.\n‘Cash for questions’\nMr Al-Fayed bought the Ritz in 1979 with his brother and the pair snapped up Harrods six years later after a long and bitter takeover battle with British businessman Roland “Tiny” Rowland.\nA subsequent government investigation into the takeover, officially published in 1990, found that Mr Al-Fayed and his brother had been dishonest about their wealth and origins to secure the takeover.\nFive years later, his first application for British citizenship was rejected.\nRevenge followed swiftly. Soon after, Mr Al-Fayed told the press that he had paid Conservative MPs to ask questions in Parliament on his behalf.\nThis brought down two prominent politicians, while Mr Al-Fayed also exposed Cabinet minister Jonathan Aitken’s involvement in a Saudi arms deal.\nAitken was later jailed for perjury and perverting the course of justice.\nAfter the death of Dodi and Diana, Mr Al-Fayed further alienated himself, with the commissioning of two ill-judged memorials to the couple at Harrods.\nOne, unveiled in 1998, was a kitsch pyramid-shaped display with photos of Diana and Dodi, a wine glass purported to be from their final dinner and a ring that he claimed his son bought for the princess.\nThe other, a copper statue of the couple releasing an albatross, was entitled “Innocent Victims” – a reflection of his view that Dodi and Diana “were murdered”.\nMr Al-Fayed sold Harrods in 2010 to the investment arm of Qatar’s sovereign wealth fund for a reported £1.5 billion (S$2.58 billion).\nAccording to Forbes list of the world’s billionaires, he was worth US$1.9 billion (S$2.46 billion) in November 2022. AFP", "url": "https://www.straitstimes.com/world/europe/billionaire-mohamed-al-fayed-outsider-shunned-by-british-high-society"}