{"authors": [], "date_download": "2024-10-12 14:04:58", "date_modify": "2024-10-12 14:04:58", "date_publish": "2023-02-28 12:59:14", "description": "He said he was sometimes chained to as many as 20 other inmates. Read more at straitstimes.com.", "filename": "world_united-states_ex-goldman-banker-ng-says-malaysian-jail-was-absolute-hell_1728741898.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/28/2023-02-25T170619Z65094564RC25JT98X4PARTRMADP3GOLDMAN-SACHS-1MDB-NG_7.JPG?VersionId=9XpQQHPcJsyPxHHWrCJ9uFSut5Ufq7_W", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_ex-goldman-banker-ng-says-malaysian-jail-was-absolute-hell_1728741898.html", "title": "Ex-Goldman banker Roger Ng convicted in 1MDB trial says Malaysian jail was ‘absolute hell’", "title_page": "Ex-Goldman banker Roger Ng convicted in 1MDB trial says Malaysian jail was ‘absolute hell’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Former Goldman Sachs Group banker and convicted 1MDB conspirator Roger Ng said in a court filing that he spent six months in a squalid Malaysian prison where he was sometimes chained to as many as 20 other inmates.\nNg described his previous incarceration in a letter to US District Judge Margo Brodie, pleading for leniency when he is sentenced next week for his role in the looting of Malaysian sovereign wealth fund 1MDB.\nIn the Saturday letter, Ng argued that the time he spent in Malaysia’s Sungai Buloh prison prior to his May 2019 extradition to the United States was “absolute hell” and punishment enough for his crimes.\nNg is asking Judge Brodie to give him no additional jail time in the US when she sentences him on March 9 in federal court in Brooklyn, New York.\nNg, 51, is the only Goldman employee to have gone to trial over the 1MDB scandal.\nIn Sungai Buloh, the one-time managing director said he lived with rats and other vermin, slept on a cement floor and contracted malaria and leptospirosis, a bacterial infection spread through contact with rat urine.\nWhen he was taken to court, Ng said he was handcuffed with 20 other prisoners in a “chain” and loaded into a crowded truck.\nHe was held in solitary confinement for up to two weeks at a time, Ng said.\n“Six months in the Malaysian prison had a devastating effect mentally and physically,” Ng wrote.\n“Until today, I find myself reclusive socially as I continue to deal with this brutal and distressing experience. The time without sunlight and in isolation made me lose my mind and become frightful.”\nNg was convicted by a federal jury in April of three felony counts, including conspiring to violate US anti-bribery laws and conspiring to launder money.\nTim Leissner, Ng’s former Goldman boss, pleaded guilty and was the government’s star witness at trial.\nLeissner will be sentenced in September.\nGoldman paid more than US$2.3 billion (S$3.1 billion) in the plea deal, the largest penalty in US history for a violation of the Foreign Corrupt Practices Act. BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/ex-goldman-banker-ng-says-malaysian-jail-was-absolute-hell"}