{"authors": [], "date_download": "2024-10-12 13:50:03", "date_modify": "2024-10-12 13:50:03", "date_publish": "2023-12-06 16:17:00", "description": "Rich countries offered barely half of what they promised to adaptation projects such as flood defences and early-warning systems. Read more at straitstimes.com.", "filename": "world_middle-east_cop28-loss-and-damage-fund-could-threaten-adaptation-cash_1728741003.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/06/IMGchennai-cyclonemich116J5PRN6.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_cop28-loss-and-damage-fund-could-threaten-adaptation-cash_1728741003.html", "title": "COP28 ‘loss and damage’ fund could threaten adaptation cash", "title_page": "COP28 ‘loss and damage’ fund could threaten adaptation cash | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI - Government pledges for climate adaptation at the COP28 summit have fallen far short of the target, with officials warning that resources to build resilience to wilder weather and rising seas could be diverted into a new “loss and damage” fund instead.\nAt a meeting at the Dubai talks late on Dec 4, rich countries offered only US$160 million (S$214 million) in contributions to the Adaptation Fund – barely half of its US$300 million goal in 2023 for projects such as flood defences and early warning systems.\nIn contrast, the loss and damage fund approved at the start of COP28 aims to help vulnerable countries or communities recover from climate impacts that cannot be avoided, such as repairing devastated property after a storm or relocating people threatened by rising seas and protecting cultural heritage.\nSeveral governments have mentioned the approval of that new fund among their reasons for offering less money for adaptation, said Mr Mikko Ollikainen, head of the Adaptation Fund.\n“The new loss and damage fund, there is so much political momentum around it... that countries have really dug deep to find resources for that,” he told the Thomson Reuters Foundation at the United Nations climate conference in Dubai, calling that “very positive”.\nBut he warned that without sufficient adaptation funding, the costs of damage from climate impacts will grow.\nDeveloping nations are pushing for new adaptation finance targets to be included in how countries respond to the Global Stocktake – a UN assessment showing climate action is lagging far behind what is needed – but their efforts have been met with pushback by rich nations.\nAt the COP26 talks in Glasgow in 2021, the Adaptation Fund – established in 2001 and a leading global fund for such projects – raised a record US$356 million in new pledges, more than double the amount raised so far at COP28.\nAt COP26, wealthy governments also committed to doubling adaptation finance to at least US$40 billion a year by 2025, but have made little progress since.\nAdaptation gap\nThis year is set to be the warmest since records began in 1940, due to climate change as well as an El Nino weather pattern, according to the European Union’s Copernicus Climate Change Service.\nAs a result, climate impacts including floods, droughts, wildfires and heatwaves have been felt across the world – and especially severely by developing nations, which have the least ability to withstand them.\nDespite this, experts say funding for adaptation measures is far short of global needs, and has been plateauing as many rich nations have failed to give more amid multiple political and economic crises including the Ukraine war and inflation.\nA recent report by the UN Environment Programme said projected annual adaptation costs and needs were 10 to 18 times more than the actual finance available in 2021, and funding fell by US$4 billion between 2020 and 2021.\n“We are in danger of allowing the narrative on loss and damage to crowd out the importance that is absolutely still necessary for adaptation,” Barbados Prime Minister Mia Mottley told a press conference this week.\n“What we want is to avert damage and avert loss before the event, which is why adaptation finance is critical,” she said.\nIn the first week of COP28, governments have pledged more than US$650 million to the loss and damage fund, led by the summit’s host, the United Arab Emirates, and Germany, which pledged US$100 million each.\nBut a major concern raised by officials and experts is whether the money promised is new cash and, if not, what other projects may lose their share of aid budgets – such as adaptation.\n“We are all concerned,” said Mr Achim Steiner, head of the UN Development Programme (UNDP), which helps countries implement projects backed by the Adaptation Fund.\n“I think it is now up to those who are pledging their contributions to the loss and damage fund to demonstrate that this is not... deducting funds from either mitigation or adaptation,” he said, adding that the UNDP is watching the situation carefully.\nGovernments must also pay more attention to the nature of these adaptation funds – such as whether they are loans or grants, said Ms Ebony Holland, nature and climate policy lead at the International Institute for Environment and Development, a policy research body.\nShe said countries most vulnerable to climate impacts want donors to provide more grants than cheap credit, and ensure the money is informed by the priorities of local communities instead of “funders and governments in distant countries”.\n“An overemphasis on the volume of funding shadows the critical need to ensure the quality of this finance,” Ms Holland said. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/cop28-loss-and-damage-fund-could-threaten-adaptation-cash"}