{"authors": [], "date_download": "2024-10-12 14:07:29", "date_modify": "2024-10-12 14:07:29", "date_publish": "2023-12-20 15:09:53", "description": "The government has hiked the amount a British person must earn to sponsor a foreign partner. Read more at straitstimes.com.", "filename": "world_europe_love-or-country-uk-families-caught-up-in-sunaks-plan-to-cut-migration_1728742049.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/20/LYNXMPEJBJ063-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_love-or-country-uk-families-caught-up-in-sunaks-plan-to-cut-migration_1728742049.html", "title": "Love or country: British families caught up in Sunak’s plan to cut migration", "title_page": "Love or country: British families caught up in Sunak’s plan to cut migration | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DURSLEY, England - In early December Ms Rebecca Kaya was celebrating after she and her Kurdish husband, Mr Baran, finally hit their savings goal to qualify for a British visa so the couple could move from Icmeler in Turkey to Britain.\nA few days later, Prime Minister Rishi Sunak hiked the amount a British person must earn in order to sponsor a foreign partner to move to Britain.\nIt raised fears that the savings threshold would also jump and their nest egg would not be enough.\nThe new policy came days after official data put legal net migration to Britain at a record high of 745,000 in 2022.\nIt prompted the government to announce a raft of measures to make it harder for people to move to the country.\nPublic concerns over high levels of migration have dominated Britain’s political landscape for more than a decade.\nIt has played a key role in the country’s vote to leave the European Union and prompted Mr Sunak to try to send those who arrive illegally to Rwanda to act as a deterrent.\nTargeting those who arrive on spousal visas – some 65,000 in the year ending September – the government has more than doubled the annual salary a British person must earn to sponsor a foreign partner’s visa, to £38,700 (S$65,000) from £18,600.\nAccording to the Migration Observatory at the University of Oxford, nearly 70 per cent of British employees in the UK do not earn enough to qualify for the higher level in 2023.\nIt said Britain had one of the highest income requirements in the world, as many other countries base their levels around the minimum wage.\nFor the Kayas, they had pursued an alternative way of securing a visa, by building up personal savings from Mr Baran’s work in the family business in the hospitality trade, Ms Rebecca’s online jewellery company and inheritance money from her father.\nThey had just put the required £62,500 into a British account, where it would need to be for six months to gain a visa.\nWhile the government has not said if the savings threshold will also rise, immigration lawyers expect it will. Immigration advice websites suggest it too could more than double, if the same calculation is applied as on income.\n“We’re doing everything that they’re asking and... just as we’re at the final hurdle, they changed the requirements,” Ms Rebecca Kaya said on a visit to a family member’s home in a small town outside Gloucester, England.\nBritain’s Home Office, the interior ministry responsible for migration strategy, has said the new policies will not be applied retrospectively and until the immigration rules are amended the minimum income threshold will remain the same.\n“We are establishing the specifics of the policy, including how it will apply to those renewing visas, and will confirm more details in due course,” a spokesperson said.\nIn their case, Mr Tom, earning £32,000 as a self-employed carpenter, is the main provider while Ms Paige cares for their two-year-old daughter.\nHe will be eligible to apply for indefinite leave to remain in April as his second spousal visa expires, but she fears he may have to leave if they do not meet the £38,700 requirement.\n“(This) is totally unfair on my child,” she told Reuters in her home in Enfield, London. “She has a right to have both her parents here.”\nThere is support for Mr Sunak’s migration policies among parts of his party and the public.\nBut any heavy-handed move to tighten numbers also draws criticism from businesses who say it will harm the economy, and from those who accuse the government of dictating who they can and cannot love.\nOn its own, a tightening of spousal rules is unlikely to hit the economy.\nBut critics have warned that some of those on the spousal system first came to Britain for postgraduate degrees, the type of skilled worker the government should want to retain.", "url": "https://www.straitstimes.com/world/europe/love-or-country-uk-families-caught-up-in-sunaks-plan-to-cut-migration"}