{"authors": [], "date_download": "2024-10-12 14:16:38", "date_modify": "2024-10-12 14:16:38", "date_publish": "2022-03-07 14:24:39", "description": "Lviv is a city of 700,000 people whose centre is on the UNESCO World Heritage List. Read more at straitstimes.com.", "filename": "world_europe_historic-ukrainian-city-scrambles-to-defend-heritage_1728742598.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/07/ac_ukrainehistorian_070322.jpg?VersionId=NdepuZaqsWpM_Rm59MyjDRwOS0esKoi7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_historic-ukrainian-city-scrambles-to-defend-heritage_1728742598.html", "title": "Historic Ukrainian city scrambles to defend heritage", "title_page": "Historic Ukrainian city scrambles to defend heritage | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LVIV (AFP) - Statues wrapped in foam and fireproof material can be seen all around the historic city of Lviv, where the race is on to protect cultural treasures against possible Russian bombardment.\nIn the western Ukrainian city's Market Square, only a trident can be seen sticking out from a statue of Neptune - the Roman god of the seas - that is entirely covered in a plastic sheeting.\n\"I got some money, gathered a team and bought some material,\" said Andriy Salyuk, head of the Society for the Protection of Monuments, and one of the main drivers behind the protection effort.\nVolunteers have joined up with city workers and builders in the movement to defend the rich heritage of Lviv, a city of 700,000 people whose centre is on the UNESCO World Heritage List.\nSalyuk said he was moved to act when an art historian \"told me that if there was a bombing, God help us, we could lose the stained glass windows!\".\n'We can't do everything'\nSpeaking to AFP in an office decorated with Ukrainian flags and the colours of various battalions fighting in eastern Ukraine, he said he has received donations from wealthy benefactors.\nThe effort has brought together an unlikely coalition, including construction companies which have advised on the best material to use to protect the stained glass windows of various churches.\nAt the Cathedral Basilica of the Assumption, which dates back to the 14th century, Andriy Pochekva was overseeing the installation of one such panel.\n\"We cannot protect from a direct impact but we are trying as much as possible to protect from light damage, whether it's a fire or a shockwave or small fragments,\" he said, as a crane manoeuvred the panel into position.\nOn one side of the cathedral, a large sculpture of the Holy Sepulchre has already been covered up under the watchful eye of Liliya Onishchenko from the city's cultural heritage protection department.\n\"I have devoted my entire life to defending cultural heritage,\" the 66-year-old told AFP.\n\"I do not want to see the results of our work destroyed by the war,\" she said.", "url": "https://www.straitstimes.com/world/europe/historic-ukrainian-city-scrambles-to-defend-heritage"}