{"authors": [], "date_download": "2024-10-12 14:08:35", "date_modify": "2024-10-12 14:08:35", "date_publish": "2022-06-03 00:09:02", "description": "He blamed the doctor for the pain he experienced after surgery. Read more at straitstimes.com.", "filename": "world_united-states_oklahoma-gunman-who-killed-four-targeted-surgeon-who-treated-him-police-say_1728742115.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/03/TOPSHOTS-TOPSHOT-US-TULSA-CRIME-SHOOTING-115410.jpg?VersionId=ZLn0jrT9CXtaLVkqx0f1CAxSvIHnopBZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_oklahoma-gunman-who-killed-four-targeted-surgeon-who-treated-him-police-say_1728742115.html", "title": "Oklahoma gunman who killed four targeted surgeon who treated him, police say", "title_page": "Oklahoma gunman who killed four targeted surgeon who treated him, police say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TULSA, OKLAHOMA (REUTERS) - A gunman who fatally shot five people including himself at an Oklahoma medical building after buying an assault-style rifle the same day had gone there to kill a doctor who he blamed for back pain he felt after surgery, authorities said on Thursday (June 2).\nThe suspect entered a building on Tulsa’s St Francis Health System campus with a semi-automatic weapon on Wednesday and opened fire at anyone he encountered, Tulsa police chief Wendell Franklin said during a news briefing. Two doctors and two other people were killed.\nThe suspect “came in with the intent to kill Dr. (Preston) Phillips and anyone who came in his way,” Franklin said.\nAuthorities found a letter on the gunman that made it clear that the attack was targeted.\nPhillips, 59, the surgeon who treated Lewis, was killed along with Dr Stephanie Husen, a 48-year-old sports medicine specialist.\nAuthorities named two other fatalities: Amanda Glenn, a receptionist, and William Love, a patient. The receptionist was initially identified as Amanda Green, but police later corrected the name on the department’s Facebook page.\n“They stood in the way and (the suspect) gunned them down,” Franklin said.\nThe gunman, who police said lived in Muskogee, Oklahoma, about 80km from Tulsa, had been released from the hospital on May 24 after back surgery, the police chief said.\nAfterwards, the man called several times complaining of pain, Franklin said.\nThe shooting comes on the heels of two other mass killings that have stunned Americans and reopened a long-standing debate over tightening controls on firearms ownership and the role of mental health in the epidemic of gun violence plaguing the United States.\n“Enough is enough. This must stop. Hospitals are pillars of our communities,” Chip Kahn, chief executive of the Federation of American Hospitals, said in a statement.\nThe gunman purchased the rifle he brought to the hospital at a local gun shop earlier on Wednesday, authorities said. He also bought a pistol at a pawn shop three days earlier.\nThe suspect parked on the second floor of the garage attached to the Natalie building, a five-story medical office building with numerous offices, rooms and hallways. He entered through the second-floor entryway and worked his way into the building, Franklin said.\nPolice arrived at the scene three minutes after receiving a call at 4.53pm CDT (4.53am on Thursday, Singapore time) of a shooting at the hospital.\nOfficers raced into the building and followed the sound of gunfire up to the second floor, and made contact with the victims and the suspect five minutes later, the chief said.\nOfficers at the scene said they heard a gunshot five minutes later, which Franklin said was the gunman taking his own life.\n“When we get that call, we are going to disregard any safety measures that we might have for ourselves and we are going to go in the building to deal with the threat. Our philosophy is that we will stop the threat and we will do that by any means necessary,” Franklin said. “That’s how we train.”", "url": "https://www.straitstimes.com/world/united-states/oklahoma-gunman-who-killed-four-targeted-surgeon-who-treated-him-police-say"}