{"authors": [], "date_download": "2024-10-12 13:28:44", "date_modify": "2024-10-12 13:28:44", "date_publish": "2024-02-08 15:40:00", "description": "The ICC should start trying suspects without having to modify its founding statutes, its chief prosecutor says. Read more at straitstimes.com.", "filename": "world_europe_icc-prosecutor-wants-court-to-try-environmental-crimes_1728739724.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/08/FRANCE-JUSTICE-ENVIRONMENT-ICC-180758.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_icc-prosecutor-wants-court-to-try-environmental-crimes_1728739724.html", "title": "ICC prosecutor wants court to try ‘environmental crimes’", "title_page": "ICC prosecutor wants court to try ‘environmental crimes’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The International Criminal Court’s (ICC) chief prosecutor told AFP on Feb 7 that he wants the tribunal to start trying suspects for “environmental crimes” without having to modify its founding statutes.\nMr Karim Khan said chemical attacks or assaults on nuclear plants could come under the existing terms of offences the court is authorised to prosecute: genocide, war crimes, crimes against humanity or crimes of aggression.\nMajor environmental destruction or pollution could therefore lead to prosecutions for war crimes or crimes against humanity, alongside rape or the deportation of children.\nThe latter allegation was made against Russian President Vladimir Putin, against whom the Hague-based ICC issued an arrest warrant in 2023.\nThe ICC’s Rome Statute mainly focuses on crimes against individuals or protected objects like churches, mosques, synagogues or Unesco heritage sites, but during conflicts “we have to see a horizon which is more wide”, Mr Khan said.\nStruggles for resources often drive conflicts, which themselves frequently target the environment, he said when asked if large-scale bombardment in Ukraine or Gaza might come under the definition of environmental crimes.\nMr Khan recently visited war-torn Sudan’s Darfur, a province exposed to growing desertification for more than 50 years, where he said droughts and water shortages between different communities “triggered animosity”.\nThe environment is also a victim when gold, wood, timber and rare earth metals are coveted during conflicts, while harmful substances such as cyanide and mercury are used to extract valuable ores, the British prosecutor added.\n“That leads to whole ecosystems being disrupted, degraded and indeed destroyed. Rivers vibrant, full of wildlife, plants and fish, become wastelands of death and despair,” Mr Khan said.\nMr Khan intends to issue a general policy paper in December that would set the legal framework for environmental crimes without having to add a fifth offence to the four listed in the Rome Statute.\n“This is the first time in the history of the International Criminal Court that we would have a considered policy paper on the forms that environmental crimes can take,” he said.\nIn 2016, former ICC chief prosecutor Fatou Bensouda said the court would focus on ecological damage, the illicit exploitation of natural resources or the illegal expropriation of land, a warning that had little visible impact.\nBut Mr Khan insisted his initiative was a step further as it was a thought-out policy rather than a promise or hope.\nMr Khan was speaking in Paris on the sidelines of a gathering of around 100 prosecutors and senior judges who were discussing behind closed doors the role of young people in environmental justice. AFP", "url": "https://www.straitstimes.com/world/europe/icc-prosecutor-wants-court-to-try-environmental-crimes"}