{"authors": [], "date_download": "2024-10-12 13:59:35", "date_modify": "2024-10-12 13:59:35", "date_publish": "2022-10-20 00:02:40", "description": "Many become orphans caught up in a “vicious cycle of disadvantage”, World Cancer Congress hears. Read more at straitstimes.com.", "filename": "world_europe_one-million-children-lose-their-mother-to-cancer-a-year-research-shows_1728741575.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/20/2022-09-01T200246Z1838465724RC2E8W9IV7O9RTRMADP3AFRICA-DROUGHT_1.JPG?VersionId=YA94ptd7dI1OJD_ipVE0JsNUlcxMYWzM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_one-million-children-lose-their-mother-to-cancer-a-year-research-shows_1728741575.html", "title": "One million children lose their mother to cancer a year, research shows", "title_page": "One million children lose their mother to cancer a year, research shows | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Around one million children worldwide lose their mother to cancer every year, often leaving orphans caught up in a “vicious cycle of disadvantage”, said researchers on Wednesday.\nThe first-ever estimate for the number of children left motherless from cancer was announced at the World Cancer Congress in Geneva.\nIt was prompted by a study in Africa by the World Health Organisation’s International Agency for Research on Cancer (IARC), which is based in Lyon, France.\nThat research followed more than 2,000 women with breast cancer in Namibia, Uganda, Zambia and Nigeria, over half of whom died in just five years.\nThe study illustrated that “the inter-generational impact of cancer deaths of mothers hasn’t been documented”, IARC epidemiologist Valerie McCormack told AFP.\nSo the IARC researchers calculated that out of the four million who died of cancer in 2020, one million children were left motherless.\nAround 45 per cent of the mothers died of breast and cervical cancer, which are “very preventable”, Ms McCormack said, calling for more investment to fight both diseases.\nDuring the research in sub-Saharan Africa, Ms McCormack said families described selling their land to pay for cancer treatment, leaving no money left for educating the children.\n“It’s a vicious cycle of disadvantage” for poorer families, she said.\nThe researchers arrived at their global estimate, which has not been peer reviewed, by combining the number of annual female cancer deaths from IARC’s Globocan database with fertility data from the United Nations.\nMore women than men die of cancer between the ages of 35 and 50 worldwide, largely due to cancer in female reproductive organs.\nAs time goes on, the situation reverses as men increasingly get prostate and lifestyle-related types of cancer.\nAnd people in high-income countries are more likely to die of cancer later in life, when their children have grown up.\nMs McCormack said the IARC was working on finding a similar global figure for children left fatherless by cancer, but it was a trickier equation without the fertility data. AFP", "url": "https://www.straitstimes.com/world/europe/one-million-children-lose-their-mother-to-cancer-a-year-research-shows"}