{"authors": [], "date_download": "2024-10-12 14:16:50", "date_modify": "2024-10-12 14:16:50", "date_publish": "2022-03-12 04:24:45", "description": "Hassan Al-Khalaf's mother could not leave Ukraine, so she sent her son on a 1,000km trek to Slovakia, where his brother studies. Read more at straitstimes.com.", "filename": "world_europe_my-hope-carried-me-11-year-old-ukrainian-boy-who-fled-alone-to-slovakia-says_1728742610.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/12/2022-03-11T173633Z_1330052630_RC2G0T9PVZXD_RTRMADP_3_UKRAINE-CRISIS-SLOVAKIA-DEMONSTRATION.JPG?VersionId=cosySeYQOKJ4QFFlYrwUTBzS1V_DbUQY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_my-hope-carried-me-11-year-old-ukrainian-boy-who-fled-alone-to-slovakia-says_1728742610.html", "title": "'My hope carried me,' 11-year-old Ukrainian boy who fled alone to Slovakia says", "title_page": "'My hope carried me,' 11-year-old Ukrainian boy who fled alone to Slovakia says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRATISLAVA (REUTERS) - Hassan Al-Khalaf, 11, clung to hope when he trekked across Ukraine by himself, safely reaching Slovakia after joining the masses of refugees escaping Russia's invasion of their country.\nHassan arrived in Slovakia in early March, drawing wide media attention after local police posted his story on their Facebook page, calling him a \"hero\" after his long journey by train and on foot from Zaporizhzhie in south-east Ukraine.\n\"I got my hope from my mom wanting me to go,\" Hassan said in an interview before appearing as a guest at a pro-Ukraine demonstration in the Slovak capital in Bratislava on Friday (March 11).\n\"My hope carried me on my way,\" he said through an interpreter.\nRussia calls its actions in Ukraine a \"special operation.\"\nHassan's widowed mother could not leave his grandmother at home, so she sent the boy off alone on the trip of over 1,000km to Slovakia, where his older brother studies.\nHe arrived with nothing but a plastic bag, passport and a phone number written on his hand.\n\"This brings tears to our eyes. This is the biggest hero of last night,\" Slovak police wrote on March 5 after Hassan appeared at the border crossing.\nHassan is one of more than 2.5 million refugees who have fled Ukraine, mostly to Poland, but also Slovakia, Hungary and Romania, to reach the European Union.", "url": "https://www.straitstimes.com/world/europe/my-hope-carried-me-11-year-old-ukrainian-boy-who-fled-alone-to-slovakia-says"}