{"authors": [], "date_download": "2024-10-12 14:04:23", "date_modify": "2024-10-12 14:04:23", "date_publish": "2023-02-15 01:41:00", "description": "Court hears he started collecting confidential information “to give the embassy a bit of a slap”.. Read more at straitstimes.com.", "filename": "world_europe_british-embassy-guard-who-spied-for-russia-tells-london-court-he-is-ashamed_1728741863.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/15/2023-02-14T170507Z2106712667RC24BZ9M6TJNRTRMADP3BRITAIN-SECURITY-RUSSIA-SPYING_1.JPG?VersionId=T1mT5sEvkZ8g9g2fa9iiHHA4.2FXJPv5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_british-embassy-guard-who-spied-for-russia-tells-london-court-he-is-ashamed_1728741863.html", "title": "British embassy guard who spied for Russia tells London court he is 'ashamed'", "title_page": "British embassy guard who spied for Russia tells London court he is 'ashamed' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - A security guard at the British embassy in Berlin who collected highly sensitive information and passed some of it to the Russian state told a London court on Tuesday that he is “disgusted with myself and ashamed of what I’ve done”.\nDavid Ballantyne Smith, 58, said he started collecting confidential information during a dispute with colleagues and while suffering from depression “to give the embassy a bit of a slap”.\n“I can only apologise for any distress I’ve caused to anyone,” he told London’s Old Bailey.\n“I didn’t set out to harm anyone in any way. I just had a bit of a grievance and I just wanted to embarrass the embassy.”\nSmith pleaded guilty in November to eight offences under the Official Secrets Act, including one charge relating to passing information to General Major Sergey Chukhrov, the Russian military attache to Berlin, in November 2020.\nThe seven other charges involve collecting information which might be useful to Russia, four of which relate to an MI5 officer posing as “Dmitry”, a Russian national who was supposedly providing assistance to Britain.\nThe court heard on Monday that Smith collected highly sensitive information for more than three years, including “secret” government communications with Prime Minister Boris Johnson from two Cabinet ministers and other sensitive documents.\nSmith said on Tuesday that he filmed the documents after drinking “seven pints of beer”, adding: “It seemed like a good idea at the time.”\nBut he said he did not pass the documents on to anyone as “it would be knowingly damaging the UK”.\nHis letter to Chukrov, which contained “highly sensitive information about the British embassy and those who worked within it”, prompted a joint investigation between British and German authorities, prosecutor Alison Morgan said on Monday.\nSmith was arrested in August 2021, the day after meeting “Irina” – an MI5 officer posing as a member of Russia’s military intelligence service, who told him she needed help as someone had passed information to Britain which “could be damaging to Russia”.\nAsked when he suspected “Irina” may have actually been working for British intelligence, Smith said in evidence on Tuesday: “The minute she opened her mouth I knew she was British because she spoke to me in a fluent English accent.”\nHe added that he continued to speak with her after she said she worked for Russian intelligence because he was “playing her along”.", "url": "https://www.straitstimes.com/world/europe/british-embassy-guard-who-spied-for-russia-tells-london-court-he-is-ashamed"}