{"authors": [], "date_download": "2024-10-12 14:08:32", "date_modify": "2024-10-12 14:08:32", "date_publish": "2022-07-05 00:45:10", "description": "Police said the shooter used a “high-powered rifle” and “firearm evidence” had been located on a nearby rooftop. Read more at straitstimes.com.", "filename": "world_united-states_shooting-breaks-out-at-july-4th-parade-route-in-chicago-suburb_1728742112.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/05/dw-chicago-shooting-suspect-220705.jpg?VersionId=iz9T217tJ0PcYamIbMNh0QEA8iSRQMdD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_shooting-breaks-out-at-july-4th-parade-route-in-chicago-suburb_1728742112.html", "title": "Suspected gunman arrested after killing at least 6 at Chicago July 4 parade", "title_page": "Suspected gunman arrested after killing at least 6 at Chicago July 4 parade | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HIGHLAND PARK (REUTERS, AFP) - Police on Monday (July 4) announced they had captured a person of interest associated with a shooting that killed six people and wounded more than 36 when a man with a high-powered rifle opened fire from a rooftop at a Fourth of July parade in the Chicago suburb of Highland Park.\nPolice confirmed they captured 22-year-old Robert E. Crimo III, who was from the area. They said he was driving a silver 2010 Honda Fit car.\nPolice can be seen surrounding a car and then Crimo exiting the vehicle with his hands raised, according to a video by the Chicago affiliate of ABC News. Crimo lies flat on the ground before police take him into custody.\nCharges will be filed, Highland Park Police said.\nThe shooting caused toddlers to abandon tricycles and parents to run for safety with their children, turning a civic display of patriotism into a scene of panicked mayhem.\n“It sounded like fireworks going off,” said retired doctor Richard Kaufman who was standing across the street from where the gunman opened fire, adding that he heard about 200 shots.\n\"It was pandemonium. A stampede. Babies were flying in the air. People were diving for cover,” he said. “People were covered in blood tripping over each other.” Police did not have a motive for the shooting.\nMore than 36 people were injured, mostly with gunshot wounds, said Jim Anthony, a spokesman for the NorthShore University HealthSystem. The 26 victims taken to the Highland Park hospital ranged in age from 8 to 85, said Brigham Temple, an emergency room doctor.\nThe New York Times named one of the dead as 76-year-old Nicolas Toledo, who was in a wheelchair and had not wanted to attend the parade, but his disabilities required that he be around someone full time and his family had not wanted to miss the event.\n“We were all in shock,” his granddaughter Xochil Toledo said. “We thought it was part of the parade.”\nAt least one of those killed was a Mexican national, a senior Mexican Foreign Ministry official said on Twitter.\nThe shooting comes with gun violence fresh on the minds of many Americans, after a massacre on May 24 killed 19 school children and two teachers at an elementary school in Uvalde, Texas, which followed a May 14 attack that killed 10 people at a grocery store in Buffalo, New York.\nAlong the parade route, abandoned chairs and other belongings could be seen scattered after panicked spectators fled for their lives.\n“Everyone thought it was fireworks,” one parade-goer, identified only as Zoe, told CNN. “My dad thought it was part of the show, and I’m like, ‘Dad, no... something is wrong.’ And I grabbed him. And I looked back at him, and then it was just a sea of panic, and people just falling and falling.”", "url": "https://www.straitstimes.com/world/united-states/shooting-breaks-out-at-july-4th-parade-route-in-chicago-suburb"}