{"authors": [], "date_download": "2024-10-12 14:01:33", "date_modify": "2024-10-12 14:01:33", "date_publish": "2023-04-25 13:53:18", "description": "The Armata has an unmanned turret, with crew remotely controlling the armaments, and boasts of a top speed of 80 kmh. Read more at straitstimes.com.", "filename": "world_europe_russia-s-new-t-14-armata-battle-tank-debuts-in-ukraine-moscow-threatens-to-deploy-longer-range-missiles_1728741693.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/25/aitank2504_1.JPG?VersionId=5U98WrRp9S8c1h96in6HXi7CW1veWAt2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-s-new-t-14-armata-battle-tank-debuts-in-ukraine-moscow-threatens-to-deploy-longer-range-missiles_1728741693.html", "title": "Russia unleashes new T-14 Armata battle tank in Ukraine, threatens to deploy longer-range missiles", "title_page": "Russia unleashes new T-14 Armata battle tank in Ukraine, threatens to deploy longer-range missiles | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russia has begun using its new T-14 Armata battle tanks to fire on Ukrainian positions “but they have not yet participated in direct assault operations”, the RIA state news agency reported on Tuesday.\nRIA said the tanks have been fitted with extra protection on their flanks, and crews have undergone “combat coordination” at training grounds in Ukraine.\nThe T-14 tank has an unmanned turret, with crew remotely controlling the armaments from “an isolated armoured capsule located in the front of the hull”.\nThe tanks have a maximum speed on the highway of 80kmh, RIA reported.\nIn January, British military intelligence reported that Russian forces in Ukraine were reluctant to accept the first tranche of the tanks due to their “poor condition”.\nIt said any deployment of the T-14 would likely be “a high-risk decision” for Russia and one taken primarily for propaganda purposes.\n“Production is probably only in the low 10s, while commanders are unlikely to trust the vehicle in combat,” the British military said.\n“Eleven years in development, the programme has been dogged with delays, reduction in planned fleet size and reports of manufacturing problems,” it added.\nThe Kremlin ordered production of 2,300 of the tanks – first unveiled in 2015 – by 2020, but this was later stretched to by 2025, according to Russian media reports.\nRussia, meanwhile, signalled that it might retreat from the moratorium on the deployment of intermediate and shorter-range missiles because of US help in Ukraine’s war efforts.\nMr Vladimir Yermakov, the Foreign Ministry’s head of nuclear non-proliferation, told Russian state news agency Tass that Moscow will evaluate the range of American-made missiles that are capable of reaching the Asia-Pacific region.\n“But even now we can say with confidence that the destabilising US military programmes and their allies make our moratorium more and more fragile, both in the Asia-Pacific region and in Europe,” he said. REUTERS", "url": "https://www.straitstimes.com/world/europe/russia-s-new-t-14-armata-battle-tank-debuts-in-ukraine-moscow-threatens-to-deploy-longer-range-missiles"}