{"authors": [], "date_download": "2024-10-12 14:08:36", "date_modify": "2024-10-12 14:08:36", "date_publish": "2023-11-06 09:40:00", "description": "Those who have bought the nuggets are warned not to eat them and to discard them, or return to place of purchase. Read more at straitstimes.com.", "filename": "world_tyson-recalls-nearly-30000-pounds-of-chicken-nuggets-over-metal-pieces_1728742116.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/06/US-TYSON-TO-CLOSE-FOUR-PLANTS-AS-CHICKEN-SALES-WEAKEN-144030.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_tyson-recalls-nearly-30000-pounds-of-chicken-nuggets-over-metal-pieces_1728742116.html", "title": "Tyson recalls over 13,500kg of chicken nuggets over metal pieces", "title_page": "Tyson recalls over 13,500kg of chicken nuggets over metal pieces | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Tyson Foods is recalling more than 13,500kg of its dinosaur-shaped chicken nuggets after some consumers said they found small metal pieces in them, federal officials said.\nThe recall, which was announced on Saturday, involves 833g plastic bags of the product, which is called Fully Cooked Fun Nuggets Breaded Shaped Chicken Patties, the US Department of Agriculture’s Food Safety and Inspection Service said in a statement.\nThe recall affects the dinosaur-shaped nuggets that were produced on Sept 5 by the Arkansas-based food processing company.\nThe bags affected have a “best if used by” date of Sept 4, 2024, and lot codes 2483BRV0207, 2483BRV0208, 2483BRV0209 and 2483BRV0210, the statement said.\nThe packaging features cartoon dinosaurs, one green and one red, looking over a plate of the breaded nuggets.\nOn its website, the company said it was voluntarily recalling the product “out of an abundance of caution”. It added that no other products were affected.\nThe products were shipped to distributors in Alabama, California, Illinois, Kentucky, Michigan, Ohio, Tennessee, Virginia and Wisconsin, according to the Food Safety and Inspection Service statement.\nTyson said the problem was discovered after it received complaints from consumers who said they found small metal pieces in the product, the federal agency said.\nThere was one report of a “minor oral injury” associated with the consumption of the product but no additional reports of injury or illness, officials said.\n“Anyone concerned about an injury or illness should contact a healthcare provider,” the federal statement said.\nThe Food Safety and Inspection Service urged consumers not to eat the nuggets and advised that any product left in the freezer “should be thrown away or returned to the place of purchase”.", "url": "https://www.straitstimes.com/world/tyson-recalls-nearly-30000-pounds-of-chicken-nuggets-over-metal-pieces"}