{"authors": [], "date_download": "2024-10-12 13:49:16", "date_modify": "2024-10-12 13:49:16", "date_publish": "2022-10-29 14:58:19", "description": "Some are linked to Chinese surveillance drones, or just air junk like balloons. Read more at straitstimes.com.", "filename": "world_united-states_many-military-ufo-reports-are-just-chinese-spying-or-airborne-trash_1728740956.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/29/UFOREPORT_1.JPG?VersionId=qxijSrTmUZEjIZYFfnkxmQJMEwbFRzRO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_many-military-ufo-reports-are-just-chinese-spying-or-airborne-trash_1728740956.html", "title": "Many military UFO reports are just Chinese spying or airborne trash", "title_page": "Many military UFO reports are just Chinese spying or airborne trash | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Government officials believe that surveillance operations by foreign powers and weather balloons or other airborne clutter explain most recent incidents of unidentified aerial phenomena – government-speak for UFOs – as well as many episodes in past years.\nThe sightings have puzzled the Pentagon and intelligence agencies for years, fuelling theories about visiting space aliens and spying by a hostile nation using advanced technology. But government officials say many of the incidents have far more ordinary explanations.\nIntelligence agencies are set to deliver a classified document to Congress by Monday updating a report made public last year that said nearly all of the incidents remain unexplained. The original document looked at 144 incidents between 2004 and 2021 that were reported by US government sources, mostly American military personnel.\nThis article is based on interviews with American officials familiar with the findings of the Pentagon and intelligence agencies’ examination of the incidents. The officials spoke on the condition of anonymity to discuss the classified work.\nSome of the incidents have been formally attributed to Chinese surveillance – with relatively ordinary drone technology – and others are also thought to be connected to Beijing. China, which has stolen plans for advanced fighter planes, wants to learn more about how the United States trains its military pilots, according to American officials.\nMuch of the information about the unidentified phenomena remains classified. While Congress has been briefed on some of the conclusions about foreign surveillance, Pentagon officials have kept most of the work secret – in large measure because they do not want China or other countries to know that their efforts to spy on the US military were detected.\nJust air junk\nBut such official secrecy comes at a cost, allowing conspiracy theories about government lies to thrive unchecked.\nMs Sue Gough, a Defence Department spokesperson, said the Pentagon remains committed to principles of openness but must balance that with its “obligation to protect sensitive information, sources and methods”.\nWhile the Pentagon will not “rush to conclusions in our analysis”, Ms Gough said, no single explanation addresses the majority of unidentified aerial phenomena reports.\n“We are collecting as much data as we can, following the data where it leads and will share our findings whenever possible,” she said.\nIt was not clear how much of the new intelligence report would be made public. But of the cases that have been resolved, most have proved to be either errant junk in the sky, like balloons, or surveillance activity, officials said. Incidents recorded in the past year, for which more data has been collected, have turned out to have ordinary, earthbound explanations.\nOfficially, many of the older incidents are still unexplained and there is just too little data for Pentagon or intelligence officials to make final conclusions.\n“In many cases, observed phenomena are classified as ‘unidentified’ simply because sensors were not able to collect enough information to make a positive attribution,” Ms Gough said, referring to cameras, radar and other devices that collect information. “We are working to mitigate these shortfalls for the future and to ensure we have sufficient data for our analysis.”\nOther officials insist that even though the evidence is imperfect, the grainy videos do not show space aliens.\nOptical illusions, along with the characteristics of classified sensors, have caused ordinary objects, like drones or balloons, to appear to be something unusual or frightening.\nOptical illusions\nIn May, the Pentagon announced that previously released images of green triangles that looked like they could be alien ships were actually drones photographed through night-vision lenses.\nMilitary officials declined to say precisely when or where the images were taken. But they believe the incidents are examples of attempts to conduct surveillance on military manoeuvres.\nUFO sceptics and experts in optics have long said many of the videos and sightings by naval aviators represent optical illusions that have made ordinary objects – weather balloons, commercial drones – appear to move faster than possible.\nMilitary officials have largely come to the same conclusion.\nBesides the images of the green triangles, the other recordings released by the Pentagon have not been categorised as surveillance incidents, at least so far. But Pentagon officials do not believe that any of them represent aliens, either.\nOne of the videos, referred to as GoFast, appears to show an object moving at immense speed. But an analysis by the military says that is an illusion created by the angle of observation against water. According to Pentagon calculations, the object is moving only about 48 kmh.\nAnother video, known as Gimbal, shows an object that appears to be turning or spinning. Military officials now believe that the optics of the classified image sensor, designed to help target weapons, make the object appear like it is moving in a strange way.\nPentagon analysts remain puzzled by some of the videos collected by the military. One where an object hovers over the water, jumps erratically, then peels away, is more difficult to explain, officials said. But analysts who have studied that video, as well as ones associated with eyewitness reports from aviators, are convinced it is not a piece of alien technology.\nBreathing life to conspiracy theories\nNevertheless, efforts by the Pentagon or intelligence officials to stamp out theories about aliens have largely failed. The Pentagon has formed, and then reformed, groups inside the department to improve data collection around the incidents and provide better explanations.\nMilitary officials have repeatedly said there is no evidence that any of the images show space alien visitors, comments often played down in the news media or ignored by lawmakers. In May, Pentagon officials testified under oath that the government has not collected materials from any alien landing on Earth. But the testimony did little to dampen enthusiasm for theories about extraterrestrial visitors.\nThere is a long history of the US government using speculation over conspiracy theories to prevent secrets from becoming widely known. During the development of American spy planes like the U-2 and SR-71 Blackbird, the government allowed rumours about UFO sightings to continue to help hide the development of those programmes.\nBut intelligence officials concluded long ago that using conspiracy theories as cover for classified programs sows distrust in the American government and paranoia. NYTIMES", "url": "https://www.straitstimes.com/world/united-states/many-military-ufo-reports-are-just-chinese-spying-or-airborne-trash"}