{"authors": [], "date_download": "2024-10-12 13:56:35", "date_modify": "2024-10-12 13:56:35", "date_publish": "2022-08-14 21:33:18", "description": "Officials had previously said they were considering euthanasia for the mammal because repeated appeals to the public to keep their distance had been in vain. Read more at straitstimes.com.", "filename": "world_europe_walrus-that-attracted-crowds-in-oslo-fjord-euthanised-officials_1728741395.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/14/sv_Freya_140822.jpg?VersionId=dkrk1RSu1gpX6UxE2SXo_X31usB23boZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_walrus-that-attracted-crowds-in-oslo-fjord-euthanised-officials_1728741395.html", "title": "Walrus that attracted crowds in Oslo fjord euthanised: officials", "title_page": "Walrus that attracted crowds in Oslo fjord euthanised: officials | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "OSLO (AFP) - A walrus nicknamed Freya that attracted crowds while basking in the sun of the Oslo fjord was euthanised, Norway officials said on Sunday (Aug 14).\n\"The decision to euthanise was taken on the basis of a global evaluation of the persistent threat to human security,\" the head of Norway's Fisheries Directorate Frank Bakke-Jensen said in a statement.\n\"We carefully examined all the possible solutions. We concluded that we could not guarantee the well-being of the animal by any of the means available,\" he said.\nOfficials had previously said they were considering euthanasia for the mammal because repeated appeals to the public to keep their distance from the young female weighing 600 kilograms had been in vain.\nFreya, whose name is a reference to the Norse goddess of beauty and love, had made headlines since July 17 when she was first spotted in the waters of the Norwegian capital.\nWalruses normally live in the even more northerly latitudes of the Arctic.\nBetween long naps - a walrus can sleep up to 20 hours a day - Freya had been filmed chasing a duck, attacking a swan and, more often than not, dozing on boats struggling to support her bulk.\nDespite repeated appeals, curious onlookers continued to approach her, sometimes with children in tow, to take photographs.\nFreya had already been sighted in the United Kingdom, the Netherlands, Denmark and Sweden and chose to spend part of the summer in Norway.\nFreya first gained notoriety in Norway by climbing onto pleasure boats in Kragero, an idyllic southern coastal village.\nThe walrus is a protected species that feeds mainly on invertebrates such as molluscs, shrimps, crabs and small fish.", "url": "https://www.straitstimes.com/world/europe/walrus-that-attracted-crowds-in-oslo-fjord-euthanised-officials"}