{"authors": [], "date_download": "2024-10-12 13:47:16", "date_modify": "2024-10-12 13:47:16", "date_publish": "2024-03-23 15:25:00", "description": "It urges more countries to join the UN Water Convention. Read more at straitstimes.com.", "filename": "world_europe_un-urges-more-water-cooperation-to-build-peace_1728740836.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/23/11236842.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_un-urges-more-water-cooperation-to-build-peace_1728740836.html", "title": "UN urges more water cooperation to build peace", "title_page": "UN urges more water cooperation to build peace | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GENEVA – Cooperation across borders on shared water resources can help avert conflicts and build peace, the United Nations said on March 22, urging all countries to join its Water Convention.\nThe UN stressed that with climate change and rising water scarcity worldwide, cross-border water cooperation was increasingly crucial for regional stability and conflict prevention.\n“Water and peace are very closely inter-related,” Ms Sonja Koeppel, secretary of the UN Water Convention, told AFP.\nShe pointed out that more than 60 per cent of all freshwater resources are shared by two or more countries, including major rivers like the Rhine and the Danube in Europe, the Mekong in Asia, the Nile in Africa and the Amazon in Latin America.\n“Cooperating over those waters is crucial for peace, for development for climate action,” she said.\nWater is such a vital resource, she said, that it has the power to bring countries in conflict to the table, opening the door to cooperation in other areas as well.\nIndia and Pakistan, for instance. have a cooperation agreement on use of the Indus river.\nAnd an agreement reached by Senegal, Mauritania, Guinea and The Gambia in the 1970s over the Senegal Basin has enabled them jointly to finance and build infrastructure that distributes water to all four countries.\nEven when political tensions reign between the countries, Ms Koeppel said, “this cooperation has continued to exist”.\n‘Ripple effect’\nA total of 153 countries around the world share water resources, but only 24 of those have signed onto various cooperation agreements covering all of their shared water, UN chief Antonio Guterres pointed out in a statement marking World Water Day on March 22.\n“We must accelerate efforts to work together across borders, and I urge all countries to join and implement the United Nations Water Convention,” he said.\n“Action for water is action for peace.”\nThe convention was established in 1992 to help foster responsible joint management of water resources in the European region, but opened up in 2016 to countries around the world.\nCurrently, it counts 52 state parties, mainly in Europe, Asia and Africa.\nMs Koeppel said the convention was a vital tool to instigate more cross-border water cooperation, but also to help countries to navigate complex situations and resolve disputes.\n“It is complicated for countries to cooperate especially in situations of water scarcity or floods or in case of accidental water pollution,” she said.\nThe convention can help countries to use their shared resources “peacefully and sustainably to protect the environment and to jointly adapt to climate change”, she said.\nShe hailed “huge momentum” in Africa for joining the convention, with nine countries now parties to the agreement, and around a dozen others in the process of joining.\nBut other regions need to catch up.\nWhen Panama joined in 2023, it became the sole member state in the Americas, a region with “many water challenges”, Ms Koeppel said.\nAnd Iraq last year also became the first member state in the Middle East – one of the most water-stressed, and conflict-plagued, regions in the world.\nMs Koeppel suggested that more cooperation on water in the Middle East could help ease tensions overall.\n“Based on examples from other parts of the world,” she said, “we can see how water has had a ripple effect to promote regional integration and sustainable development and climate action more broadly.” AFP", "url": "https://www.straitstimes.com/world/europe/un-urges-more-water-cooperation-to-build-peace"}