{"authors": [], "date_download": "2024-10-12 14:16:36", "date_modify": "2024-10-12 14:16:36", "date_publish": "2022-03-11 04:21:41", "description": "Moscow claims more than 2.5 million Ukrainians have asked to be evacuated to Russia. Read more at straitstimes.com.", "filename": "world_europe_moscow-says-to-open-daily-humanitarian-corridors-from-ukraine-to-russia_1728742596.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/11/TOPSHOTS-TOPSHOT-UKRAINE-RUSSIA-CONFLICT-153657.jpg?VersionId=F35HshQOqVFiDgVvCvyZc.rR1FxQM6ac", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_moscow-says-to-open-daily-humanitarian-corridors-from-ukraine-to-russia_1728742596.html", "title": "Moscow says to open daily humanitarian corridors from Ukraine to Russia", "title_page": "Moscow says to open daily humanitarian corridors from Ukraine to Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW (AFP) - Moscow said on Thursday (March 10) that it will open daily humanitarian corridors to evacuate civilians fleeing fighting in Ukraine to Russian territory, despite Kyiv insisting that no evacuation routes should lead to Russia.\n\"Humanitarian corridors towards the Russian Federation will now be opened, without any agreements, every day from 10am,\" defence ministry official Mikhail Mizintsev was quoted as saying by Russian agencies.\nHe said evacuation routes in other directions would proceed \"in agreement with the Ukrainian side\".\n\"We ask the International Committee of the Red Cross and the United Nations to work closely with Ukrainian authorities on the ground to inform the population about this Russian imitative,\" he said.\nHe also said the Russian army was working \"closely with Ukrainian representatives\" to open another three humanitarian corridors.\nMizintsev claimed that more than 2.5 million Ukrainians have asked to be evacuated to Russia.\nHe also claimed that Moscow had evacuated \"more than 187,000\" civilians to Russia, a number that could not be verified.\nMizintsev accused Ukrainian forces of blocking the evacuation of civilians in Mariupol, a southern port city besieged by Russian forces.\nThree rounds of talks between Russian and Ukrainian negotiators have resulted in the opening of several humanitarian corridors to evacuate civilians from fighting.\nRussian President Vladimir Putin sent in troops to Ukraine on Feb 24.", "url": "https://www.straitstimes.com/world/europe/moscow-says-to-open-daily-humanitarian-corridors-from-ukraine-to-russia"}