{"authors": [], "date_download": "2024-10-12 13:45:34", "date_modify": "2024-10-12 13:45:34", "date_publish": "2022-09-24 23:47:06", "description": "Next launch window for the uncrewed mission runs from Oct 17 to 31. Read more at straitstimes.com.", "filename": "world_united-states_nasa-scraps-tuesdays-artemis-moon-launch-due-to-storm_1728740734.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/24/US-SPACE-MOON-Artemis-150850.jpg?VersionId=Ouqg1y_fppz1IIja4aQAcmnJaSm16XxV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_nasa-scraps-tuesdays-artemis-moon-launch-due-to-storm_1728740734.html", "title": "Nasa scraps Tuesday's Artemis moon launch due to storm", "title_page": "Nasa scraps Tuesday's Artemis moon launch due to storm | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Nasa has called off the scheduled Tuesday launch of its historic uncrewed mission to the moon due to a tropical storm that is forecast to strengthen as it approaches Florida.\n\"Nasa is forgoing a launch opportunity... and preparing for rollback (from the launchpad), while continuing to watch the weather forecast associated with Tropical Storm Ian,\" it said on Saturday.\nThe US National Hurricane Centre said Ian is due to \"rapidly intensify\" over the weekend as it moves toward Florida, home to the Kennedy Space Centre, from which the rocket is set to launch.\nA decision on whether to roll back the giant Space Launch System (SLS) rocket to the Vehicle Assembly Building is due to be taken by the Artemis 1 team on Sunday.\nOn the launch pad, the orange and white SLS rocket can withstand wind gusts of up to 137kmh. But if it has to be sheltered, the current launch window, which runs until Oct 4, will be missed.\nThe next launch window will run from Oct 17 to 31, with one possibility of take-off per day, except from Oct 24-26 and 28.\nThe Artemis 1 space mission hopes to test the SLS as well as the unmanned Orion capsule that sits atop, in preparation for future moon-bound journeys with humans aboard.\nA successful Artemis 1 mission will come as a huge relief to the US space agency, after years of delays and cost overruns.", "url": "https://www.straitstimes.com/world/united-states/nasa-scraps-tuesdays-artemis-moon-launch-due-to-storm"}