{"authors": [], "date_download": "2024-10-12 13:38:36", "date_modify": "2024-10-12 13:38:36", "date_publish": "2024-09-01 14:59:29", "description": "KYIV - One civilian was killed and four others injured in Russian shelling overnight on Ukraine's Sumy region on the border between the two warring countries, the local Ukrainian administration said on Sunday. Read more at straitstimes.com.", "filename": "world_europe_one-killed-four-injured-in-russian-shelling-of-sumy-region-kyiv-says_1728740316.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/01/LYNXMPEK800EX-1.jpg?VersionId=AbUsvNcUqkNB..bUG5UWxV0GS1bA5GKB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_one-killed-four-injured-in-russian-shelling-of-sumy-region-kyiv-says_1728740316.html", "title": "One killed, four injured in Russian shelling of Sumy region, Ukraine says", "title_page": "One killed, four injured in Russian shelling of Sumy region, Ukraine says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - One civilian was killed and four others injured in Russian shelling overnight on Ukraine's Sumy region on the border between the two warring countries, the local Ukrainian administration said on Sunday.\n\"During the night and morning, the Russians carried out 18 shellings of border territories and settlements of the Sumy region. 47 explosions were recorded,\" the administration said on the Telegram messaging app.\nIt said nine districts of the region were under attack.\nUkrainian President Volodymyr Zelenskiy said that last week alone Russia had used 160 missiles, 780 guided aerial bombs and 400 attack drones against cities and troops across Ukraine, and he again called for permission to use Western-supplied weapons to strike deep inside Russia.\n\"To give full defence and secure our cities from this aggression, more support is needed for a just Ukrainian response,\" he said on Telegram.\nZelenskiy called for \"a decision on long-range strikes on missile launch sites from Russia, destruction of Russian military logistics, joint shooting down of missiles and drones\".\nLocal prosecutors said Russia had launched a missile attack late on Saturday on a convoy of grain trucks on the main road from Sumy to the city of Kharkiv route in the Sumy region and that a 23-year-old truck driver had been killed.\nOne truck caught fire and about 20 others were damaged, they said.\nUkraine's air force said in a separate statement it had destroyed eight out of 11 Russian attack drones used overnight.\n\"This time the occupiers targeted Ukrainian grain and the logistics of the agricultural sector, particularly in Mykolaiv and Sumy regions,\" the air force said, giving no more details.\nThe Sumy region borders Russia's Kursk region, where Ukrainian forces launched a major cross-border incursion on Aug. 6. Ukraine also launched waves of drone attacks targeting Russian power plants and a refinery near Moscow, sparking fires, Russian officials said on Sunday.\nRussian troops, meanwhile, continued over the weekend to press towards the strategic hub of Pokrovsk in eastern Ukraine. REUTERS", "url": "https://www.straitstimes.com/world/europe/one-killed-four-injured-in-russian-shelling-of-sumy-region-kyiv-says"}