{"authors": [], "date_download": "2024-10-12 13:44:22", "date_modify": "2024-10-12 13:44:22", "date_publish": "2023-12-26 02:46:41", "description": "Desert region known to be hiding place for ISIS militant groups that are still active. Read more at straitstimes.com.", "filename": "world_two-kuwaitis-kidnapped-on-iraqi-desert-hunting-trip-officials-say_1728740662.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/26/LYNXMPEJBO06F-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_two-kuwaitis-kidnapped-on-iraqi-desert-hunting-trip-officials-say_1728740662.html", "title": "Two Kuwaitis kidnapped on Iraqi desert hunting trip, officials say", "title_page": "Two Kuwaitis kidnapped on Iraqi desert hunting trip, officials say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANBAR, Iraq – Security forces are searching for two Kuwaitis who were kidnapped while on a hunting trip in a desert area in Iraq, two security officials said on Dec 25.\nA police colonel confirmed that the kidnapping took place on Dec 24 in a desert area between Anbar and Salahuddin provinces.\nHowever, an Iraqi Foreign Ministry statement referred to only one Kuwaiti national.\nIt said Iraq’s Foreign Minister Fuad Hussein told his Kuwaiti counterpart, Sheikh Salem Abdullah Al-Jaber Al-Sabah, that the Iraqi government would “determine the fate of the Kuwaiti national”. The statement followed a phone call between the two ministers on Dec 25.\nIraqi security officials said an initial investigation showed that one of the hunters’ vehicles was attacked by gunmen and contact had been lost with the two Kuwaitis.\nThe desert region is known to be a hiding place for Islamic State in Iraq and Syria (ISIS) militant groups that are still active, the two security sources said.\nThere was no immediate claim of responsibility for the incident. Hunters from wealthy Gulf states often make trips to Iraq’s southern and western desert in search of hawks.\nOne police officer told Reuters on condition of anonymity that the Kuwaitis had been in an extensive desert area that is very dangerous because Daesh (another name for ISIS) is still active there. REUTERS", "url": "https://www.straitstimes.com/world/two-kuwaitis-kidnapped-on-iraqi-desert-hunting-trip-officials-say"}