{"authors": [], "date_download": "2024-10-12 13:43:44", "date_modify": "2024-10-12 13:43:44", "date_publish": "2024-07-25 09:15:00", "description": "Fatal 737 Max crashes in 2018 and 2019 killed 346 people. Read more at straitstimes.com.", "filename": "world_united-states_boeing-finalizes-737-max-guilty-plea-deal-us-outlines-reasons_1728740624.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/25/FILES-BRITAIN-US-ACCIDENT-AVIATION-COURT-BOEING-000100.jpg?VersionId=7n9I3bu8FlnGyWP_l1HrlyYW_YgYRvj5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_boeing-finalizes-737-max-guilty-plea-deal-us-outlines-reasons_1728740624.html", "title": "Boeing finalises 737 Max guilty plea deal, US outlines reasons", "title_page": "Boeing finalises 737 Max guilty plea deal, US outlines reasons | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Boeing finalised a guilty plea to a criminal fraud conspiracy charge and agreed to pay a US$243.6 million (S$327.3 million) fine after it breached a 2021 deferred prosecution agreement with the US Justice Department, according to a court filing on July 24.\nThe planemaker allowed potentially risky work at its factories and did not ensure key airplane record keeping was accurate or complete, the Justice Department said as it outlined why it believed the planemaker had violated the 2021 deal.\nBoeing on July 7 agreed in principle to plead guilty to conspiring to defraud the Federal Aviation Administration (FAA) after the government said the planemaker knowingly made false representations about key software for the 737 Max.\nBoeing confirmed on July 24 that it had filed a detailed plea agreement with the Justice Department. “We will continue to work transparently with our regulators as we take significant actions across Boeing to further strengthen our safety, quality and compliance programs,” the company said.\nThe Justice Department said in May that Boeing had breached its obligations in the agreement that shielded the planemaker from criminal prosecution stemming from misrepresentations about a key software feature tied to fatal 737 Max crashes in 2018 and 2019 that killed 346 people.\nThe finding was made in the wake of a January in-flight panel blowout on an Alaska Airlines 737 Max that exposed continuing safety and quality issues at Boeing, just two days before the 2021 agreement shielding it from prosecution over the previous fatal crashes expired.\nDocumentation not completed\nThe Justice Department said in its court filing that Boeing failed to ensure employees documented removal of parts during manufacturing of an airplane and it did not ensure mechanics and inspectors who stamped they completed work had actually done so.\nThe Justice Department said Boeing in April disclosed false stamping at its 787 plant in South Carolina by some employees. The FAA said in May it was investigating after Boeing said some employees at the plant had committed “misconduct” by claiming some tests had been completed.\nBoeing also did not ensure work on airplanes was conducted in the proper sequence, the Justice Department said.\n“Boeing senior executives prioritised the movement of aircraft through Boeing’s factories over reducing out-of-sequence work to ensure production quality,” the filing said. “Out-of-sequence work is more difficult to perform (and) increases the risk that defects in manufacturing will occur.”\nThe Justice Department has a separate criminal probe ongoing into the Alaska Airlines jet that was missing four key bolts. Boeing has said no paperwork detailing the removal of the bolts was completed.\nAs part of the guilty plea deal, the planemaker agreed to spend at least US$455 million over the next three years to boost safety and compliance programs, said the filing, adding that was 75 per cent higher than Boeing’s previously planned expenditures on its corporate compliance program.", "url": "https://www.straitstimes.com/world/united-states/boeing-finalizes-737-max-guilty-plea-deal-us-outlines-reasons"}