{"authors": [], "date_download": "2024-10-12 13:31:08", "date_modify": "2024-10-12 13:31:08", "date_publish": "2021-04-16 06:53:10", "description": "It is likely that those who are more vulnerable will have to go first for additional jab.  Read more at straitstimes.com.", "filename": "world_united-states_us-preparing-for-1-year-covid-19-booster-shots-pfizer-chief-sees-need-for-third_1728739868.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/04/16/nmusvaccine1604.jpg?VersionId=hVNvu4gmQP3rMGG3u5gfGyaZDJT7ak6D", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-preparing-for-1-year-covid-19-booster-shots-pfizer-chief-sees-need-for-third_1728739868.html", "title": "US preparing for 1-year Covid-19 booster shots; Pfizer chief sees need for third dose", "title_page": "US preparing for 1-year Covid-19 booster shots; Pfizer chief sees need for third dose | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - The United States is preparing for the possibility that a booster shot will be needed between nine and 12 months after people are initially vaccinated against Covid-19, a White House official said on Thursday (April 15).\nWhile the duration of immunity after vaccination is being studied, booster vaccines could be needed, Dr David Kessler, chief science officer for President Joe Biden's Covid-19 response task force, told a congressional committee meeting.\n\"The current thinking is those who are more vulnerable will have to go first,\" he said.\nMeanwhile, Pfizer chief executive Albert Bourla said people will likely need a third booster dose of Covid-19 vaccines within 12 months and could need annual shots, CNBC reported based on his comments from April 1, which were made public on Thursday.\nInitial data has shown that vaccines from Moderna and partners Pfizer and BioNTech retain most of their effectiveness for at least six months, though for how much longer has not been determined.\nEven if that protection lasts far longer than six months, experts have said that rapidly spreading variants of the coronavirus and others that may emerge could lead to the need for regular booster shots, similar to annual flu shots.\nThe US is also tracking infections in people who have been fully vaccinated, Dr Rochelle Walensky, director of the US Centres of Disease Control and Prevention, told the House sub-committee hearing.\nOf 77 million people vaccinated in the US, there have been 5,800 such breakthrough infections, Dr Walensky said, including 396 people who required hospitalisation and 74 who died.\nDr Walensky added that some of these infections have occurred because the vaccinated person did not mount a strong immune response.\nBut the concern is that, in some cases, they are occurring in people infected by more contagious virus variants.\nEarlier this month, Pfizer and partner BioNTech said that their vaccine was around 91 per cent effective in preventing Covid-19, citing updated trial data that included more than 12,000 people fully inoculated for at least six months.", "url": "https://www.straitstimes.com/world/united-states/us-preparing-for-1-year-covid-19-booster-shots-pfizer-chief-sees-need-for-third"}