{"authors": [], "date_download": "2024-10-12 13:51:58", "date_modify": "2024-10-12 13:51:58", "date_publish": "2021-01-24 08:54:58", "description": "A tremor of magnitude 7.1 struck at 8.36pm 216 km north-east of the O’Higgins Chilean scientific base. Read more at straitstimes.com.", "filename": "world_chile-rattled-by-successive-tremors-downgrades-tsunami-warning_1728741118.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/01/24/fhearthquakes240121.jpg?VersionId=NIeYPwvcvu5El3I4BMIhHN8hEq4Db0Av", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_chile-rattled-by-successive-tremors-downgrades-tsunami-warning_1728741118.html", "title": "Chile regrets panic triggered by mistaken tsunami warning after quake", "title_page": "Chile regrets panic triggered by mistaken tsunami warning after quake | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SANTIAGO (REUTERS) - Authorities in Chile said on Saturday (Jan 23) they regretted spreading panic with a mistaken tsunami warning calling for people to get out of coastal areas following an earthquake in Antarctica.\nThe interior ministry said on Twitter that a tremor of magnitude 7.1 struck at 8.36pm 216 km north-east of the O'Higgins Chilean scientific base and called for the coastal regions of Antarctica to be evacuated because of a tsunami risk.\nThe ministry also sent a message to cellphones around the country urging people to abandon coastal areas, though the ministry later said it was sent in error.\n\"We want to provide peace of mind to the population, tell them that it is not necessary to evacuate the entire national territory, only the Antarctic base,\" Mr Miguel Ortiz of the ministry's National Emergency Office (Onemi) told a news conference.\nHe said the agency regretted the inconvenience caused by its messages, which he blamed on a technical error.\nThe tsunami warning for Antarctica was later lifted.\nPeople in coastal cities including La Serena, to the north of Santiago, and Valparaiso, started to leave areas close to the coast after the warning until reports started appearing that it was a false alarm.\nBut as Chileans were reacting to the warning, a second tremor, of magnitude 5.6, struck the Chile-Argentina border region, at 9.07pm, the GFZ German Research Centre for Geosciences said, at a depth of 133km and 30km east of Santiago.\nNo damage was reported from either quake.\nThe second one was close to Codelco's Andina and Teniente copper mines and Anglo American PLC's Los Bronces.\nThe Chilean mining regulator Sernageomin said that workers, mining operations and facilities had reported no problems after the quake.\nSernageomin said that following the first quake, 80 people were evacuated from Chile's main base in the Antarctic, the Presidente Eduardo Frei Montalva Base on Fildes Peninsula west of King George Island, and 55 more from three other bases, along with five foreign bases.\nThe army said no damage was reported at the Antarctic base.", "url": "https://www.straitstimes.com/world/chile-rattled-by-successive-tremors-downgrades-tsunami-warning"}