{"authors": [], "date_download": "2024-10-12 13:59:20", "date_modify": "2024-10-12 13:59:20", "date_publish": "2023-12-17 05:45:17", "description": "A selection of news stories that happened overnight, Dec 17, 2023. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-dec-17-5_1728741560.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/17/11020871_0.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-dec-17-5_1728741560.html", "title": "While You Were Sleeping: 5 stories you might have missed, Dec 17", "title_page": "While You Were Sleeping: 5 stories you might have missed, Dec 17 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Netanyahu hints at new Hamas talks after hostage deaths\nIsraeli Prime Minister Benjamin Netanyahu appeared to confirm on Dec 16 that new Qatar-mediated negotiations were under way to recover hostages held by Hamas in Gaza, after a source said Israel’s lead negotiator met Qatar’s prime minister.\nMr Netanyahu sidestepped a question at a news conference about a meeting on Dec 15 in Europe between his lead negotiator, Mossad head David Barnea, and Qatari Prime Minister Sheikh Mohammed bin Abdulrahman Al Thani. However, he confirmed he had given instructions to the negotiating team.\n“We have serious criticisms of Qatar, about which I suppose you will hear in due course, but right now we are trying to complete the recovery of our hostages,” he said, alluding to the gas-rich Gulf state’s ties to Hamas and Israel’s arch-foe Iran.\nNews of a new round of negotiations, first reported by Axios, came after Israel’s military disclosed that troops had accidentally killed three hostages who approached them with a white flag after having escaped their captors in Gaza on Dec 15.\nREAD MORE HERE\nNotre-Dame rooster back on Paris cathedral’s spire\nA large crane hoisted a new copper rooster back to the top of the spire of Notre-Dame on Dec 16, a meaningful milestone as workers race to finish renovating the fire-damaged Paris cathedral in the next twelve months.\nIn the April 15, 2019 fire that ravaged the cathedral, the old rooster had crashed through the roof along with the wooden spire at the top of which it had been fixed. It was found dented but nearly intact among debris the day after the fire, and will be displayed in a new Notre Dame museum.\nThe new weather vane rooster, made of golden copper, was blessed by the Paris archbishop Laurent Ulrich during a ceremony on Dec 16 morning. Inside, it features religious relics and a parchment with long list of the names of workers as well as donors and patrons.\nREAD MORE HERE\nSenior cardinal convicted of embezzlement\nCardinal Angelo Becciu, the most senior Catholic Church official ever to stand trial before a Vatican criminal court, was convicted on Dec 16 of embezzlement and sentenced to five-and-a-half years in jail.\nThe Italian prelate’s lawyer, Mr Fabio Viglione, told reporters in the courtroom that he would appeal, saying his client was innocent.\nBecciu, who lives at the Vatican, was expected to remain free for the time being.\nREAD MORE HERE\nLuton’s Lockyer ‘stable’ after cardiac arrest on pitch\nLuton captain Tom Lockyer was in a “stable” condition in hospital after suffering a cardiac arrest that led to his side’s Premier League clash against Bournemouth being abandoned on Dec 16.\nWith the score level at 1-1 in the 65th minute, Lockyer suddenly fell to the turf in a worrying scene.\nPlay was paused as the Luton defender received treatment from medics while both sides were sent to the dressing room.\nREAD MORE HERE\nActor Depardieu stripped of Belgian honorary citizen title\nA Belgian municipality on Dec 16 stripped French cinema legend Gerard Depardieu of the title of honorary citizen over misogynistic comments broadcast in a French documentary early in December.\nDepardieu, 74, was charged with rape in 2020 and has also faced 13 accusations of sexual harassment or assault, all of which he denies.\nThe documentary, The Fall Of The Ogre, aired on French public television on Dec 7, showed clips of the actor during a 2018 trip to North Korea.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-dec-17-5"}