{"authors": [], "date_download": "2024-10-12 13:58:30", "date_modify": "2024-10-12 13:58:30", "date_publish": "2024-03-30 00:36:08", "description": "The 87-year-old's sudden no-show is likely to renew concerns about his declining strength. Read more at straitstimes.com.", "filename": "world_europe_pope-leads-good-friday-service-ahead-of-colosseum-procession_1728741510.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/30/LYNXNPEK2S0AZ-1.jpg?VersionId=VKmVZ7YjJT6.Z7k53AN15HNuu6cOhQ0d", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_pope-leads-good-friday-service-ahead-of-colosseum-procession_1728741510.html", "title": "Pope skips Good Friday procession ‘to preserve his health’", "title_page": "Pope skips Good Friday procession ‘to preserve his health’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VATICAN CITY - Pope Francis cancelled his attendance at the Good Friday procession at Rome’s Colosseum at the last minute on March 29, in what the Vatican described as a bid “to preserve his health” ahead of more Easter week engagements.\nFrancis’ agenda for the next two days consists of an Easter Vigil service on the evening of March 30 and an Easter Mass and the twice-annual “Urbi et Orbi” (to the city and world) message and blessing on March 31.\nThe 87-year-old Argentinian’s sudden no-show is likely to renew concerns about his declining strength. He uses a cane or a wheelchair to move around due to a knee ailment, and suffers from repeated bouts of bronchitis and influenza.\nGood Friday leads on Sunday to Easter, the most important and joyous date in the Church’s liturgical calendar - commemorating the day Christians believe Jesus rose from the dead.\nThe Vatican announced the pope’s absence from the “Via Crucis” (Way of the Cross) procession just as it was about to start, saying in a statement he would follow it remotely from his Vatican residence.\nFrancis, who had looked fitter this week after weeks in which he struggled to speak in public and cancelled some meetings, also missed the procession last year, after recovering from a four-day hospital stay for bronchitis.\nFocus on women\nThe Via Crucis at the Colosseum is a re-enactment of Jesus’ death by crucifixion, in which participants take turns in holding the cross as they walk in and around the ancient Roman arena, stopping to pray and hear meditations.\nNuns, priests, a hermit, charity workers, migrants and disabled people were among those who took part in the service, held in a landmark monument believed to have been a place of martyrdom for early Christians.\nFrancis personally wrote the meditations for this year, a first in his 11-year papacy. They included praise for meekness and forgiveness in response to acts of evil, and prayers for persecuted Christians and war victims.\nThe pope, who has called for the Church to become less male-dominated, also hailed the women who helped Jesus while he carried the cross, and pleaded for “those (women) who in our own day are exploited and endure injustice and indignity”.\nIn another sign of his focus on women, Francis on March 28 performed the foot-washing ritual, which recalls Jesus’ gesture of humility to his apostles at the Last Supper, in a women’s prison in Rome.\nEarlier on March 29, he joined cardinals and bishops for the Passion of the Lord service in St Peter’s Basilica, which featured chants in Latin recounting events from Jesus’ arrest to his burial.\nIn previous years, Francis would start the service prostrating himself on the floor of the basilica, but his frail state no longer allows him to do so. Instead, he arrived in a wheelchair and prayed silently in front of the main altar. REUTERS", "url": "https://www.straitstimes.com/world/europe/pope-leads-good-friday-service-ahead-of-colosseum-procession"}