{"authors": [], "date_download": "2024-10-12 13:55:16", "date_modify": "2024-10-12 13:55:16", "date_publish": "2024-04-23 08:55:00", "description": "Karen was euthanised on April 18 and “passed away in staff’s hands”. Read more at straitstimes.com.", "filename": "world_united-states_beloved-ostrich-dies-at-kansas-zoo-after-swallowing-worker-s-keys_1728741316.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/23/ostrich20topeka20zoo.jpg?VersionId=S9OvX.O9WIVD0bvLvawsCXU5QciFmQ4Y", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_beloved-ostrich-dies-at-kansas-zoo-after-swallowing-worker-s-keys_1728741316.html", "title": "Beloved ostrich dies at Kansas zoo after swallowing worker’s keys", "title_page": "Beloved ostrich dies at Kansas zoo after swallowing worker’s keys | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KANSAS - A beloved ostrich died last week after reaching beyond the confines of her Kansas zoo enclosure to grab and swallow the keys of a staff member, according to the Topeka Zoo and Conservation Centre.\nThe five-year-old ostrich, Karen, had been a resident of the zoo for about a year and was renowned for her “playful antics”, which included swimming in the enclosure’s pool, playing in the sprinkler and “dancing” the zoo said on April 19 on social media.\n“Zoo guests and staff alike formed deep connections with her,” said the centre, which houses more than 300 animals and is about 105km east of Kansas City, Kansas.\nKaren’s life, however, was cut tragically short after she “reached beyond her exhibit fence”, grabbed the keys and immediately swallowed them, the zoo said, noting that it had consulted with experts across the country in an attempt to save her by both “surgical” and “non-surgical” means.\n“Unfortunately,” the zoo said, “these efforts were unsuccessful.”\nKaren was euthanised on April 18 and “passed away in staff’s hands”, the interim director of the zoo, Ms Fawn Moser, told The Associated Press. She did not immediately respond to requests for further information and an interview on April 22.\nThe zoo said on social media that it had conducted an investigation into the episode and was “taking appropriate actions regarding the team member involved”. The zoo will also establish new protocols to avoid similar occurrences in the future, it said.\nOstriches, while flightless, are known for their impressive speeds: A frightened bird can run about 72.4kmh and, if cornered, can deliver fatal kicks to predators. They can live to about 40 years old in the wild and longer in captivity.\n“We are devastated by the loss of Karen,” Ms Moser said in the social media post.\n“She was not just an animal,” she added, “she was a beloved member of our community.” NYTIMES", "url": "https://www.straitstimes.com/world/united-states/beloved-ostrich-dies-at-kansas-zoo-after-swallowing-worker-s-keys"}