{"authors": [], "date_download": "2024-10-12 13:49:23", "date_modify": "2024-10-12 13:49:23", "date_publish": "2024-10-05 22:21:43", "description": "PARIS/JERSALEM - Israeli Prime Minister Benjamin Netanyahu hit out at France's President Emmanuel Macron on Saturday for saying that shipments of arms to Israel used in the conflict in Gaza should be stopped as part of a broader effort to find a political solution. Read more at straitstimes.com.", "filename": "world_europe_frances-macron-says-sales-of-arms-used-in-gaza-should-be-halted_1728740963.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/05/LYNXMPEK9404P-1.jpg?VersionId=.2ixBp1hKQ.KGxKRprH3QUi7qJg3ySVL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_frances-macron-says-sales-of-arms-used-in-gaza-should-be-halted_1728740963.html", "title": "Israel says France's call for halting sales of arms used in Gaza is a 'disgrace'", "title_page": "Israel says France's call for halting sales of arms used in Gaza is a 'disgrace' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS/JERSALEM - Israeli Prime Minister Benjamin Netanyahu hit out at France's President Emmanuel Macron on Saturday for saying that shipments of arms to Israel used in the conflict in Gaza should be stopped as part of a broader effort to find a political solution.\n\"Shame on them,\" Netanyahu said of Macron and other Western leaders who have called for what he described as an arms embargo on Israel.\n\"Israel will win with or without their support,\" he said in a pre-recorded video released by his office, adding that calling for an arms embargo was a disgrace.\nMacron earlier told France Inter radio that the priority was \"to get back to a political solution (and) that arms used to fight in Gaza are halted. France doesn't ship any.\"\n\"Our priority now is to avoid escalation. The Lebanese people must not in turn be sacrificed, Lebanon cannot become another Gaza,\" he added.\nFrance is not a major weapons provider for Israel, shipping military equipment worth 30 million euros ($33 million) last year, according to the defence ministry's annual arms exports report.\nMacron's comments come as his Foreign Minister Jean-Noel Barrot is on a four-day trip to the Middle East, wrapping up on Monday in Israel as Paris looks to play a role in reviving diplomatic efforts. REUTERS", "url": "https://www.straitstimes.com/world/europe/frances-macron-says-sales-of-arms-used-in-gaza-should-be-halted"}