{"authors": [], "date_download": "2024-10-12 13:57:53", "date_modify": "2024-10-12 13:57:53", "date_publish": "2024-07-24 04:35:07", "description": "Ukrainian President Volodymyr Zelenskiy on Tuesday praised the Vatican's efforts in seeking peace and releasing prisoners of war in talks with a senior official, a contrast from previous tensions between Kyiv and the Holy See. Read more at straitstimes.com.", "filename": "world_europe_ukraines-zelenskiy-discusses-peace-prisoners-with-senior-vatican-official_1728741473.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/24/LYNXMPEK6M0Y6-1.jpg?VersionId=IsfLs3pko4OvA9nTOrIzRQMUBFbiAJA.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraines-zelenskiy-discusses-peace-prisoners-with-senior-vatican-official_1728741473.html", "title": "Ukraine's Zelenskiy discusses peace, prisoners with senior Vatican official", "title_page": "Ukraine's Zelenskiy discusses peace, prisoners with senior Vatican official | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Ukrainian President Volodymyr Zelenskiy on Tuesday praised the Vatican's efforts in seeking peace and releasing prisoners of war in talks with a senior official, a contrast from previous tensions between Kyiv and the Holy See.\nZelenskiy thanked Vatican Secretary of State Cardinal Pietro Parolin for \"the signal\" his visit to Kyiv had brought.\n\"It is a signal of support for Ukraine, Ukrainians and our desire to live in our own state and truly live in peace,\" Zelenskiy said in his nightly video address.\nThe cardinal, in effect Pope Francis's number two in the Vatican hierarchy, had visited four cities in Ukraine and Zelenskiy said the talks focused on \"what can be done this year to bring closer a just peace for Ukraine.\n\"It is very important for us and for the cause of peace that the Vatican is active in protecting life and helping us implement the peace formula, especially regarding the release of prisoners,\" he said, referring to Ukraine's peace plan discussed at last month's Swiss-organised peace summit.\n\"It was a good meeting and I hope there will be results.\"\nUkraine's relations with the Vatican have gone through some strain since Russian forces invaded Ukraine in February 2022.\nUkraine objected to Pope Francis's remarks in an interview earlier this year that Kyiv should have what he called the courage of the \"white flag\" and negotiate an end to the war.\nKyiv also criticised the Pope for expressing sympathy for the daughter of a prominent Russian ultra-nationalist killed by a car bomb near Moscow, as an innocent victim of war.\nA papal envoy has visited Kyiv and Moscow as part of efforts to bring home Ukrainian children authorities say have been deported by Russia.\nFrancis has repeatedly called for peace and deplored attacks during the conflict, notably a strike this month on medical facilities in Kyiv.\nTies between Kyiv and the Vatican are underpinned by the presence in Ukraine of some 5 million eastern-rite Catholics. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraines-zelenskiy-discusses-peace-prisoners-with-senior-vatican-official"}