{"authors": [], "date_download": "2024-10-12 14:22:03", "date_modify": "2024-10-12 14:22:03", "date_publish": "2024-08-23 15:23:22", "description": "She is the only person still unaccounted for since the yacht sank off Sicily this week. Read more at straitstimes.com.", "filename": "world_europe_search-for-body-of-mike-lynchs-daughter-resumes-after-sicily-shipwreck_1728742923.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/23/LYNXMPEK7M0A4-1.jpg?VersionId=XRdXQeMHo0u0QyRX3CAmleopyVJUPYCO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_search-for-body-of-mike-lynchs-daughter-resumes-after-sicily-shipwreck_1728742923.html", "title": "Search for body of Mike Lynch's daughter resumes after Sicily shipwreck", "title_page": "Search for body of Mike Lynch's daughter resumes after Sicily shipwreck | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PORTICELLO, Italy - Italian emergency services resumed their search on Aug 23 for the body of Mike Lynch’s 18-year-old daughter, the only person still unaccounted for since the British tech magnate’s family yacht sank off Sicily this week, killing him and six others.\nThe British-flagged Bayesian, a 56m-long superyacht carrying 22 passengers and crew, was anchored off the port of Porticello, near Palermo, when it capsized and sank on Aug 19 within minutes of being struck by a pre-dawn storm.\nMr Lynch’s daughter, Hannah, is presumed to be the seventh victim of the shipwreck. An interior ministry official said on Aug 22 her body might not be inside the yacht and could have been swept out to sea.\nA judicial investigation has been opened into the sinking, which has baffled naval marine experts, who say a boat like the Bayesian, built by Italian high-end yacht manufacturer Perini, should have withstood the storm.\nThe chief executive of The Italian Sea Group, which owns Perini, told Reuters the shipwreck was the result of a string of “indescribable, unreasonable errors” made by the crew, and ruled out any design or construction failings.\nPulling the wreck out of the sea, where it is now lying on its right side, apparently intact, at a depth of about 50m, may help investigators determine what happened to it, but the operation is likely to be complex and costly.\nMr Nick Sloane, the South African engineer who led the operation to salvage the Costa Concordia cruise liner that sank in 2012, said in Italian media interviews on Aug 23 that the operation would cost up to 15 million euros (S$21.8 million).\nHe told La Repubblica newspaper the yacht’s salvage would have to be completed by mid-October, and take six to eight weeks, including preparation work. Bringing the yacht to the surface will have to be done “very, very slowly”, and might take a couple of days, he said. REUTERS", "url": "https://www.straitstimes.com/world/europe/search-for-body-of-mike-lynchs-daughter-resumes-after-sicily-shipwreck"}