{"authors": [], "date_download": "2024-10-12 13:34:10", "date_modify": "2024-10-12 13:34:10", "date_publish": "2024-09-06 08:00:00", "description": "Threats to shoot up a middle school were made online in 2023 and anonymous tips were sent to the FBI. Read more at straitstimes.com.", "filename": "world_united-states_sheriff-s-report-details-interview-of-georgia-teen-suspect-in-prior-school-shooting-threat_1728740050.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/06/GASCHOOLSHOOTING3.JPG?VersionId=A20IOFbL1KsdaNgReAIhnZ78cBGMox7K", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_sheriff-s-report-details-interview-of-georgia-teen-suspect-in-prior-school-shooting-threat_1728740050.html", "title": "Sheriff’s report details interview of Georgia teen suspect in prior school shooting threat", "title_page": "Sheriff’s report details interview of Georgia teen suspect in prior school shooting threat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JEFFERSON, Georgia – The anonymous tips were sent to the Federal Bureau of Investigation (FBI) in May 2023 from as far away as Australia, warning that a user on Discord, a social media platform, had threatened in a chat group to possibly “shoot up a middle school”. The authorities were led to a 13-year-old living in Jackson County, Georgia.\nA report from the Jackson County sheriff’s office, obtained by The New York Times, detailed how investigators looked into but were unable to definitively link those threats to the teen, who is now in custody after a shooting on Sept 4 morning at his high school in Winder, Georgia. He is suspected of killing two students and two teachers.\nHours after the shooting, the FBI disclosed that law enforcement had investigated the online threat, which was made in May 2023. But the report from the sheriff’s office reveals more about how authorities were able to trace the post to the teenager and why – after interviewing the boy and his father – they did not take further action, other than a warning to his middle school.\nAccording to the report, the FBI received several tips from users with internet addresses in Palmdale, California; Los Angeles; and Cockburn, a city in Western Australia, which included the posts made in a group chat on Discord. The e-mail associated with the account belonged to Colt Gray, the teen accused of the shooting at his school.\nThe investigators found that the username on the Discord account had been written in Russian. “Translation of the Russian letters spells out the name Lanza,” the investigator wrote in his report, noting that it was the surname of the perpetrator of the 2012 massacre at Sandy Hook Elementary School in Newtown, Connecticut, in which 20 students and six teachers were killed.\nIn interviews with investigators, both Colt and his father, Mr Colin Gray, said they did not speak Russian, and the boy denied that he had been the author of the threats. He said he previously had a Discord account but had deleted it, claiming he had been repeatedly hacked and was “afraid someone would use his information for nefarious purposes”, an investigator wrote.\nThe teenager told an investigator “he would never say such a thing, even in a joking manner”, according to the report. During the interview, an investigator noted that the boy was calm and had a reserved demeanour.\nHis father told an investigator that he and his wife were divorced and had been evicted from their home. His wife took their younger two children, he said, and he and his son had moved into a new home.\nThe father also told an investigator that his son had experienced “some problems at West Jackson Middle School, and now that he was going to Jefferson Middle School, it was a lot better”.\nMr Gray also told investigators that he had hunting rifles in the house, but that his son did not have “unfettered” access to them.\nSheriff Janis G. Mangum of Jackson County said on the morning of Sept 5 that her office had notified Jefferson Middle School, where Colt had been enrolled, but classes had already ended for the school year. In 2024, Colt had just started as a freshman at Apalachee High School in Winder, which is in neighbouring Barrow County.\nAfter interviewing the father and son May 20, 2023, the investigators determined they had exhausted their efforts.\n“Due to the inconsistent nature of the information received by the FBI,” an investigator wrote, “the allegation that Colt or Colin is the user behind the Discord account that made the threat cannot be substantiated.”", "url": "https://www.straitstimes.com/world/united-states/sheriff-s-report-details-interview-of-georgia-teen-suspect-in-prior-school-shooting-threat"}