{"authors": [], "date_download": "2024-10-12 13:40:05", "date_modify": "2024-10-12 13:40:05", "date_publish": "2024-09-24 13:38:21", "description": "ANKARA - Turkey slammed Israel's recent attacks on Lebanon as \\\"efforts to drag the region into chaos\\\" on Monday, calling for international measures against them and a halt to support for Israel. Read more at straitstimes.com.", "filename": "world_middle-east_turkey-slams-israels-attacks-on-lebanon-calls-for-international-measures_1728740405.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/LYNXMPEK8N043-1.jpg?VersionId=dRdAEUTPexZAMRHSoelNSay8Uk_WACVP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_turkey-slams-israels-attacks-on-lebanon-calls-for-international-measures_1728740405.html", "title": "Turkey slams Israel's attacks on Lebanon, calls for international measures", "title_page": "Turkey slams Israel's attacks on Lebanon, calls for international measures | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANKARA - Turkey slammed Israel's recent attacks on Lebanon as \"efforts to drag the region into chaos\" on Monday, calling for international measures against them and a halt to support for Israel.\nIn some of the heaviest cross-border fire exchange since its nearly year-long war against Palestinian militant group Hamas in Gaza began, Israel has started shifting its focus north to Iran-backed Hezbollah, which has been firing rockets into Israel in support of Hamas, also backed by Iran.\nLebanese authorities have said Israeli airstrikes against Hezbollah sites in the country had killed 492 people on Monday and sent tens of thousands fleeing for safety in the country's deadliest day in decades.\nIn a statement late on Monday, the Turkish Foreign Ministry said countries that \"unconditionally support Israel\" were helping Israeli Prime Minister Benjamin Netanyahu \"shed blood for his political interests\".\n\"It is imperative that all institutions responsible for maintaining international peace and security, especially the United Nations Security Council, as well as the international community, take the necessary measures without delay,\" it said.\nNATO member Turkey has condemned Israel's military campaign in Gaza , started in retaliation for Hamas' cross-border attack on Oct. 7. Ankara also halted all trade with Israel and applied to join a genocide case against Israel at the World Court.\nOn Monday, Erdogan met the leaders of Greece, Germany, Iran, and Kuwait, as well as the chief prosecutor of the International Criminal Court (ICC), at the U.N. General Assembly in New York, the Turkish Presidency said, adding he had discussed the war in Gaza in the meetings.\nErdogan told Iranian President Masoud Pezeshkian that steps toward peace should be taken in response to Israel's hostility, his office said, adding that the Turkish leader also told chief prosecutor Karim Khan that Israel needed to be held accountable and that an ongoing genocide case against Israel at the ICC must be concluded.\nHe told Khan that Netanyahu's government \"did not hesitate to trample international law and human rights\", and that it was under the illusion that there is no power to stop it, it added. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/turkey-slams-israels-attacks-on-lebanon-calls-for-international-measures"}