{"authors": [], "date_download": "2024-10-12 14:08:22", "date_modify": "2024-10-12 14:08:22", "date_publish": "2024-03-27 16:05:33", "description": "KIBBUTZ SNIR, Israel - In an abandoned kibbutz in Israel's evacuation zone near the Lebanese border, Lior Shelef has stayed behind to keep watch as a reservist in a protection force. He still tends the cows and chickens, even as Hezbollah rockets keep coming closer. Read more at straitstimes.com.", "filename": "world_middle-east_abandoned-israeli-farms-cling-to-life-in-evacuation-zone_1728742102.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/27/LYNXNPEK2Q07Z-2.jpg?VersionId=ugBoJtfm0vtEUpMFjm9MPeBxohHUfeHt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_abandoned-israeli-farms-cling-to-life-in-evacuation-zone_1728742102.html", "title": "Abandoned Israeli farms cling to life in evacuation zone", "title_page": "Abandoned Israeli farms cling to life in evacuation zone | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KIBBUTZ SNIR, Israel - In an abandoned kibbutz in Israel's evacuation zone near the Lebanese border, Lior Shelef has stayed behind to keep watch as a reservist in a protection force. He still tends the cows and chickens, even as Hezbollah rockets keep coming closer.\nThe chicken coops had been damaged in a rocket attack and the frequent sound of explosions panics the animals.\n\"We don't know what will happen tomorrow. We don't know if the day will escalate to be worse or better,\" he said.\n\"If the chicken is very afraid because of the noise of the rockets, how it will affect her life? Maybe she will die from a heart attack.\"\nOver 2,000 rockets have been fired from Lebanon into northern Israel since the outbreak of the war in Gaza, when Lebanon's powerful Hezbollah group launched a campaign of attacks in support of Hamas Islamists.\nAround 100,000 Israelis have had to evacuate from the area around the northern border, as have tens of thousands of Lebanese from communities on the opposite side.\nThe evacuation has turned some of Israel's most productive farming communities into ghost towns, like Kibbutz Snir, which rears cows and chickens and grows avocados and some vegetables around 3 km from the Lebanese border.\nShelef said suppliers were not coming into the area due to the bombardments, making it hard for the skeleton staff to keep the farm fully functioning.\nIsrael's northern region accounts for a third of the country's agricultural land, and about 73% of its domestic egg production is concentrated in the Galilee and Golan regions, the Ministry of Agriculture and Rural Development said.\nParts of southern Israel near the Gaza Strip have also been evacuated since Hamas fighters burst across the border on Oct. 7 in the deadly rampage that precipitated the war. Greenhouses and dairy farms have been damaged there, a hit to an agriculture sector that is the pride of a country founded on dreams of making the desert bloom.\nIn February the farm ministry said it would lift duties on imported eggs to meet needs for the upcoming Jewish festival of Passover in April, forecasting a drop in local production due in part to the security situation.\n'ENDANGERING THEIR LIVES'\nDevora Evgi, who was evacuated from the small farming community of Avivim on the Lebanese border where she raises chickens, said the coops there were still being maintained by a few people who had stayed behind.\n\"They know that they are literally endangering their lives each time they go to the coops,\" she said. \"Hezbollah are constantly keeping them under surveillance and can fire a rocket suddenly at any time, with no warning.\"\nKeeping the community going would depend on restoring security, she said. \"I'm not going to hold down the front line like I have for my entire life if I don't have a way to make a living or security.\"\nIsrael has long fostered agricultural technology companies exploring ways to squeeze higher yields of higher-value crops from arid land.\nKiryat Shmona, a major city in Israel's upper northern region some seven kilometres from the Lebanese border, was being developed as a hub for food technology companies.\nBut since the city was evacuated last year, companies have left. On a recent visit, shops and homes were shuttered. Israeli military units patrolled the quiet streets.\nThe offices were mostly shut in a building used by Fresh Start, an early-stage agriculture tech investment company in the city. So were the adjacent offices of the 10 food tech start ups Fresh Start supports, though chief technology officer Tammy Meiron told Reuters the businesses were still operational from different locations elsewhere in Israel.\nApart from laboratory equipment left behind and school children's drawings on the walls, there was little sign of the cutting edge research work undertaken there.\n\"It's heartbreaking because it's empty. The town is empty,\" Meiron told Reuters as she looked out onto the lush green hills above her office window. \"It was full of young people ... And now everything is neglected.\" REUTERS", "url": "https://www.straitstimes.com/world/middle-east/abandoned-israeli-farms-cling-to-life-in-evacuation-zone"}