{"authors": [], "date_download": "2024-10-12 13:39:10", "date_modify": "2024-10-12 13:39:10", "date_publish": "2024-09-19 21:37:03", "description": "The woman is accused of treating minority Yazidi women and children as slaves. Read more at straitstimes.com.", "filename": "world_europe_sweden-charges-woman-with-genocide-crimes-against-humanity-in-syria_1728740350.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/19/2024-09-19T115140Z316740794RC2N3AAYES70RTRMADP3SWEDEN-CRIME.JPG?VersionId=.g3hjWWSLqjDC7NMr0Zv2dnkj98GrIGm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_sweden-charges-woman-with-genocide-crimes-against-humanity-in-syria_1728740350.html", "title": "Sweden charges woman with genocide, crimes against humanity in Syria", "title_page": "Sweden charges woman with genocide, crimes against humanity in Syria | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "STOCKHOLM – Swedish prosecutors charged a woman on Sept 19 with crimes against humanity for acts in Syria against women and children of the Yazidi religious minority from 2014 to 2016, the first time the Nordic country has brought this charge.\nThe woman, a 52-year-old Swedish citizen identified in the court indictment as Lina Ishaq, also faces charges of genocide and war crimes – or as an accessory to them – committed between 2014 and 2016, they said.\nProsecutors said she had travelled to Syria to help establish the rule there of ISIS, a militant Islamist group that seized large swathes of Syria and Iraq in 2014 before eventually being defeated.\nProsecutor Reena Devgun said in a statement that the woman was suspected of “buying or receiving civilian women and children belonging to the Yazidi minority in her residence in Raqqa in Syria”, and treating them as slaves.\n“Furthermore, they were subjected to severe suffering, slavery or other inhumane treatment. In violation of international law, they were deprived of liberty in the woman’s home and prevented from leaving,” Ms Devgun said.\nThe accused, who in 2020 returned to Sweden where she is currently serving time in prison for other offences in Syria, denies the new charges, her lawyer Mikael Westerlund said.\nUnder Swedish law, courts can try people for crimes against international law committed abroad.\nThe prosecution agency said crimes against humanity can include murder, rape, torture and forced labour if they are part of a widespread or systematic attack against a group of civilians.\nIn 2022, a Swedish court found the same woman guilty of war crimes and violation of international law for failing to prevent her 12-year-old son from becoming a child soldier in the northern Syrian city of Raqqa when it was under ISIS rule. REUTERS", "url": "https://www.straitstimes.com/world/europe/sweden-charges-woman-with-genocide-crimes-against-humanity-in-syria"}