{"authors": [], "date_download": "2024-10-12 14:01:16", "date_modify": "2024-10-12 14:01:16", "date_publish": "2020-09-18 20:05:09", "description": "This will bar Apple's App Store, Google Play and others from offering the apps on any platform that can be reached from within the US. Read more at straitstimes.com.", "filename": "world_united-states_trump-to-block-us-downloads-of-tiktok-wechat-on-sept-20_1728741676.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/WwgUHOTTHJcHABqvt9jyf9MF5oQmJPaXbWcgdmENbf8.jpg?VersionId=KgpInUQhFu3jlwecxaiB66bhP7GLQeFW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_trump-to-block-us-downloads-of-tiktok-wechat-on-sept-20_1728741676.html", "title": "Trump blocks US downloads of TikTok, WeChat from Sept 20", "title_page": "Trump blocks US downloads of TikTok, WeChat from Sept 20 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - The Trump administration will ban WeChat and video-sharing app TikTok from US app stores starting Sunday night (Sept 20), a move that will block Americans from downloading the Chinese-owned platforms over concerns they pose a national security threat.\nThe bans, announced on Friday, affect only new downloads and updates and are less sweeping than expected, particularly for TikTok, giving its parent group ByteDance some breathing space to clinch an agreement over the fate of its US operations.\nWeChat, an all-in-one messaging, social media and electronic payment app, faces more severe restrictions from Sunday.\nExisting TikTok users, on the other hand, will see little change until Nov 12 when a ban on some technical transactions will kick in, which TikTok said would amount to an effective ban.\n\"We disagree with the decision from the Commerce Department, and are disappointed that it stands to block new app downloads from Sunday and ban use of the TikTok app in the US from Nov 12,\" the company said in a statement.\n\"We will continue to challenge the unjust executive order, which was enacted without due process and threatens to deprive the American people and small businesses across the US of a significant platform for both a voice and livelihoods.\"\nChina's Commerce Ministry expressed its \"resolute opposition\" and urged the United States to stop its bullying and wrongdoing.\n\"If the US side obstinately clings to its course, China will take necessary measures to resolutely safeguard the legitimate rights and interests of Chinese companies,\" it said, without elaborating.\nCommerce Secretary Wilbur Ross told Fox Business Network that \"the basic TikTok will stay intact until Nov 12.\"\nThe ban on new US downloads of the widely popular app could still be rescinded by President Donald Trump before it takes effect if ByteDance seals a deal with Oracle that addresses concerns about the security of its users'data.\n\"This is the right move - ratchet up the pressure on Beijing, protect Americans,\" said Republican Senator Josh Hawley on Twitter.\nThe Trump administration has ramped up efforts to purge \"untrusted\" Chinese apps from US digital networks amid escalating tensions with Beijing on a range of issues from trade and human rights to the battle for tech supremacy.\nThe ban on WeChat, used by over one billion people worldwide, bars the transfer of funds or processing of payments to or from people in the United States through it. Users could also start to experience significantly slower service or sporadic outages from Sunday night.\nWeChat developer Tencent Holdings called the order \"unfortunate\" but said it \"will continue to discuss with the government and other stakeholders in the US ways to achieve a long-term solution.\"\nThe Commerce Department order bars Apple's app store, Alphabet's Google Play and others from offering the apps on any platform \"that can be reached from within the United States,\" a senior Commerce official told Reuters.\nWhile the bans are less dramatic than some had feared, the Commerce Department said it could issue additional orders if it finds \"that WeChat's or TikTok's illicit behavior is being replicated by another app somehow outside the scope of these executive orders.\"\nOracle shares were down 0.7 per cent after initially dropping 1.6 per cent in pre-market trading.\nThe American Civil Liberties Union said the Commerce order \"violates the First Amendment rights of people in the United States by restricting their ability to communicate and conduct important transactions on the two social media platforms.\"\nThe order does not ban US companies from doing businesses on WeChat outside the United States, which will be welcome news to US firms like Walmart and Starbucks that use WeChat's embedded 'mini-app' programs to facilitate transactions and engage consumers in China, officials said.\nThe order will not bar transactions with WeChat owner Tencent's other businesses, including its online gaming operations, and will not prohibit Apple, Google or others from offering TikTok or WeChat apps anywhere outside the United States.\nOn Friday, a US judge in California declined to block the Commerce Department WeChat order, but set a hearing for 2.45pm EDT (2.45am on Saturday, Singapore time). A lawyer for the WeChat users did not immediately respond to a request for comment.\nThe bans are in response to a pair of executive orders issued by Trump on Aug 6 that gave the Commerce Department 45 days to determine what transactions to block from the apps he deemed pose a national security threat. That deadline expires on Sunday.\nCommerce Department officials said they were taking the extraordinary step because of the risks the apps' data collection poses. China and the companies have denied US user data is collected for spying.\nRoss said in a written statement \"we have taken significant action to combat China's malicious collection of American citizens' personal data, while promoting our national values, democratic rules-based norms, and aggressive enforcement of US laws and regulations.\"\nApple and Google did not immediately respond to requests for comment.\nPOPULAR APPS\nTikTok has 100 million users in the United States and is especially popular among younger Americans.\nWeChat has had an average of 19 million daily active users in the United States, analytics firms Apptopia said in early August. It is popular among Chinese students, ex-pats and some Americans who have personal or business relationships in China.\nThe Commerce Department will not seek to compel people in the United States to remove the apps or stop using them. \"We are aiming at a top corporate level. We're not going to go out after the individual users,\" one Commerce official said.\nOver time, officials said, the lack of updates will degrade the apps usability.\n\"The expectation is that people will find alternative ways to do these actions,\" a senior official said. \"We expect the market to act and there will be more secure apps that will fill in these gaps that Americans can trust and that the United States government won't have to take similar actions against.\"\nCommerce is also barring additional technical transactions with WeChat starting Sunday that will significantly reduce the usability and functionality of the app in the United States.\nThe order bars data hosting within the United States for WeChat, content delivery services and networks that can increase functionality and internet transit or peering services.\n\"What immediately is going to happen is users are going to experience a lag or lack of functionality,\" a senior Commerce official said of WeChat users. \"It may still be usable but it is not going to be as functional as it was.\"\nCommerce will bar the same set of technical transactions for TikTok, but that will not take effect until Nov 12.\nCommerce will not penalize people who use TikTok or WeChat in the United States.\nThe order does not bar data storage within the United States for WeChat or TikTok.\nSome Americans may find workarounds. There is nothing that would bar an American from traveling to a foreign country and downloading either app, or potentially using a virtual private network and a desktop client, officials conceded.", "url": "https://www.straitstimes.com/world/united-states/trump-to-block-us-downloads-of-tiktok-wechat-on-sept-20"}