{"authors": [], "date_download": "2024-10-12 14:03:36", "date_modify": "2024-10-12 14:03:36", "date_publish": "2022-12-06 06:34:30", "description": "The weapons were Soviet-era jet drones, aimed at bases about 480km from the Ukrainian border. Read more at straitstimes.com.", "filename": "world_europe_ukraine-drones-attack-military-bases-deep-inside-russia_1728741816.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/06/2022-11-26T173401Z1371981765RC21TX9JYG7IRTRMADP3UKRAINE-CRISIS_3.JPG?VersionId=vRf_Fe9bvy4mL8op4PZ1F9f6oeLhrBPu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-drones-attack-military-bases-deep-inside-russia_1728741816.html", "title": "Ukraine shows expanded reach as drones target bases deep in Russia", "title_page": "Ukraine shows expanded reach as drones target bases deep in Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Ukraine executed its most brazen attack into Russian territory in the 9-month-old war on Monday, targeting two military bases hundreds of miles inside the country, using unmanned drones, according to the Russian defence ministry and a senior Ukrainian official.\nThe senior official said that the drones were launched from Ukrainian territory and that at least one of the strikes was made with the help of Ukrainian special forces operating close to the base, who helped guide the drone to the target.\nThe strikes signalled a new willingness by Kyiv to take the fight to bases in the heart of Russia, raising the stakes in the war, and demonstrated for the first time Ukraine’s ability to attack at such long distances. Shortly after the attacks on the bases, Russia sent a barrage of missiles streaking toward Ukrainian cities.\nThe Kremlin said the weapons launched by Ukraine were Soviet-era jet drones and were aimed at bases in Ryazan and Engels, about 480km from the Ukrainian border. It said that its forces had intercepted the drones, and that “the fall and explosion of the wreckage” had “slightly damaged” two planes, killing three servicemen and wounding four others.\nThe Engels airfield, on the Volga River in southern Russia, is a base for some of Russia’s long-range, nuclear-capable bombers, including the Tupolev-160 and Tupolev-95. Ukrainian officials say it is also a staging ground for Russia’s unrelenting campaign of missile attacks on infrastructure, which have left millions of Ukrainians with intermittent light, heat or water – or none at all – at the onset of winter. Security footage from an apartment complex near the base showed a fireball lighting up the sky.\nThe other explosion occurred at the Dyagilevo military base in the central city of Ryazan, only about 100 miles from Moscow, according to Russia’s defense ministry. It was there that the fatalities and injuries occurred, the Russian state news agency RIA Novosti reported.\nUkraine’s government declined to publicly acknowledge the strikes, in keeping with its practice with other attacks on Russia and Russian-occupied Crimea.\nThe Engels air base and the Ryazan military installation are between 300 and 450 miles from the Ukrainian border, which is beyond the range of any known missile in Ukraine’s arsenal.\nEven before Russia’s Defence Ministry accused Ukraine of sending drones to attack, the blast at the Engels airfield had prompted some of Russia’s influential pro-invasion bloggers to call for more strikes against Ukraine, and to renew criticism of the Russian armed forces.\n“Sometimes we feel that even if you put a bomb into these people’s pockets – they wouldn’t notice anyway,” Mr Voenniy Osvedomitel, a popular commentator, wrote on the messaging app Telegram.\nAfter the explosions, Mr Mykhailo Podolyak, an adviser to Ukraine’s president, appeared to note the strikes obliquely, as Ukrainian officials have often done after unexplained explosions inside Russia.\n“The Earth is round – discovery made by Galileo,” he wrote on Twitter. “If something is launched into other countries’ airspace, sooner or later unknown flying objects will return to departure point.”\nOnly a few hours after the explosions, Ukrainian officials said that more than a dozen Russian bombers had taken off from the Engels air base. NYTIMES", "url": "https://www.straitstimes.com/world/europe/ukraine-drones-attack-military-bases-deep-inside-russia"}