{"authors": [], "date_download": "2024-10-12 13:38:44", "date_modify": "2024-10-12 13:38:44", "date_publish": "2023-06-13 08:20:00", "description": "Mr Guterres endorsed the idea for an AI watchdog body similar to the International Atomic Energy Agency. Read more at straitstimes.com.", "filename": "world_united-states_un-chief-proposes-code-to-tackle-grave-misinformation_1728740324.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/13/2023-06-09T151526Z623433009RC2WR0A2GUVMRTRMADP3ENERGY-AI-JEFFERIES_0.JPG?VersionId=8NOV2HtZbJ79k5pMcqsdNABywYcgbVol", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_un-chief-proposes-code-to-tackle-grave-misinformation_1728740324.html", "title": "UN chief proposes code of conduct to tackle ‘grave’ misinformation", "title_page": "UN chief proposes code of conduct to tackle ‘grave’ misinformation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Alarm over advancements in artificial intelligence (AI) must not obscure the “grave” harm already being done by digital platforms rife with misinformation, United Nations chief Antonio Guterres said Monday, as he proposed an international code of conduct.\nRapidly developing AI tools, including chatbots, image generators and voice cloning technology, have sparked global concern over their striking ability to disseminate falsehoods.\nMr Guterres said he endorsed the idea for the creation of an AI watchdog body similar to the International Atomic Energy Agency, but noted that “only member states can create it, not the Secretariat of the United Nations”.\nHe added that while alarm bells over AI were “deafening”, they must not “distract us from the damage digital technology is already doing to our world”.\n“The proliferation of hate and lies in the digital space is causing grave global harm now,” Mr Guterres told a news conference while presenting a policy brief on the subject.\n“It is fuelling conflict, death and destruction now. It is threatening democracy and human rights now.”\nMr Guterres said a “United Nations code of conduct for information integrity on digital platforms” was being developed ahead of the UN’s Summit of the Future slated for next year.\nHis policy brief, which will feed the code of conduct, includes a slew of proposals, including that advertisers implicated in monetising harmful content take full responsibility for their spending.\n“Disinformation and hate should not generate maximum exposure and massive profits,” Mr Guterres said.\nWhile unleashing social and cultural transformation globally, online platforms have also “exposed a darker side”, he warned.\n“The ability to disseminate large-scale disinformation to undermine scientifically established facts poses an existential risk to humanity,” he insisted, referring to their risk to democratic institutions and human rights.\nHe said that the code of conduct should be based on a commitment to information integrity, human rights and support for independent media.\n“We must learn from the mistakes of the past. Digital platforms were launched into the world without sufficient awareness or assessment of the potential damage to societies and individuals,” Mr Guterres said.\n“The era of Silicon Valley’s ‘move fast and break things’ philosophy must be brought to a close.” AFP", "url": "https://www.straitstimes.com/world/united-states/un-chief-proposes-code-to-tackle-grave-misinformation"}