{"authors": [], "date_download": "2024-10-12 13:38:13", "date_modify": "2024-10-12 13:38:13", "date_publish": "2024-04-01 15:01:47", "description": "China said none of Manila’s policies would affect its maritime rights of sovereignty claims. Read more at straitstimes.com.", "filename": "world_philippines-to-boost-diplomacy-and-defence-capability-as-south-china-sea-countermeasures_1728740293.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/01/LYNXNPEK300EU-1.jpg?VersionId=MXYG02OLPKL6rwYpYrcK_59cle6_F.Bu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_philippines-to-boost-diplomacy-and-defence-capability-as-south-china-sea-countermeasures_1728740293.html", "title": "Philippines to boost diplomacy, defence capability as South China Sea ‘countermeasures’", "title_page": "Philippines to boost diplomacy, defence capability as South China Sea ‘countermeasures’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANILA – Countermeasures by the Philippines in response to China’s conduct in the South China Sea will entail strengthening its defence capabilities with allies and exhausting all diplomatic measures to resolve disputes, a security official said on April 1.\nPhilippine President Ferdinand Marcos Jr last week said that his country would implement unspecified measures against “illegal, coercive, aggressive and dangerous attacks” by China’s coast guard, upping the stakes in an escalating row in the South China Sea.\n“The proportionate, deliberate and reasonable response the President was talking about covered not only the aspect of strengthening military and defence capabilities with other allies... but it also talks about exhausting diplomatic efforts to resolve the issue,” Philippine National Security Council spokesman Jonathan Malaya said on state TV, describing the package as multidimensional.\nMr Marcos also ordered his government to strengthen its coordination on maritime security to confront “a range of serious challenges” to territorial integrity and peace, according to a copy of the directive released on March 31.\nChina’s Foreign Ministry on April 1 said that regardless of what policies the Philippines rolls out, none would affect China’s maritime rights or sovereignty claims.\nBeijing claims almost the entire South China Sea as its territory, policed by an armada of coast guard vessels, some more than 1,000km away from the country.\nThe Philippines and China have had a series of run-ins at sea in the past year over disputed maritime features, coinciding with Manila ramping up defence engagements with ally the United States.\nThe latest flare-up occurred on March 24, when China used water cannon to disrupt a Philippine resupply mission to the Second Thomas Shoal for soldiers guarding a warship intentionally grounded on a reef 25 years ago.\nDefence officials traded barbs recently, with China saying the Philippines was to blame for the breakdown of relations, and accusing its neighbour of provocations, misinformation and treachery.", "url": "https://www.straitstimes.com/world/philippines-to-boost-diplomacy-and-defence-capability-as-south-china-sea-countermeasures"}