{"authors": [], "date_download": "2024-10-12 14:03:27", "date_modify": "2024-10-12 14:03:27", "date_publish": "2024-06-27 17:33:19", "description": "HELSINKI - Finland will procure two surveillance aircraft from U.S.-based Sierra Nevada Corp for 163 million euros ($174 million) to patrol its long eastern border with Russia, the Finnish Border Guard said on Thursday. Read more at straitstimes.com.", "filename": "world_europe_finland-buys-two-border-surveillance-planes-for-174-million_1728741807.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/27/ST-logo-placeholder_14.jpg?VersionId=b6rpuOcArlfcTwB.d0HQ8HPj2lYYjp2Z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_finland-buys-two-border-surveillance-planes-for-174-million_1728741807.html", "title": "Finland buys two border surveillance planes for $174 million", "title_page": "Finland buys two border surveillance planes for $174 million | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HELSINKI - Finland will procure two surveillance aircraft from U.S.-based Sierra Nevada Corp for 163 million euros ($174 million) to patrol its long eastern border with Russia, the Finnish Border Guard said on Thursday.\nLate last year, Finland shut all crossing points for travellers along its 1,340 km (833 mile) border with Russia indefinitely after some 1,300 migrants from nations such as Syria and Somalia arrived via that route.\nHelsinki has been upping the border security as it believes the Kremlin stands ready to funnel more migrants across at any time - something Moscow has strongly denied.\n\"The new surveillance aircraft will significantly increase Finland's capability in border security and maritime security tasks, which is important in our difficult-to-predict security environment,\" Chief of Border and Coast Guard Division Matti Sarasmaa said in a statement.\nThe new aircraft, which will be manufactured by Canada's Bombardier and fitted for the Border Guard's purposes by Sierra Nevada, will replace ageing twin-turboprop planes in 2026 and 2027, it said.\nThe new planes will be equipped with advanced technical systems and modern surveillance sensors, it added. REUTERS", "url": "https://www.straitstimes.com/world/europe/finland-buys-two-border-surveillance-planes-for-174-million"}