{"authors": [], "date_download": "2024-10-12 14:04:40", "date_modify": "2024-10-12 14:04:40", "date_publish": "2023-03-03 12:20:59", "description": "The FBI task force also interviewed middlemen who serve the world’s most famous people. Read more at straitstimes.com.", "filename": "world_united-states_fbi-documents-show-leonardo-dicaprio-kim-kardashian-grilled-for-1mdb-and-connection-to-jho-low_1728741880.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/04/rrleokim0303.jpg?VersionId=LDVWO.y05QQNbR2vXmP.giZ_ayItPys1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_fbi-documents-show-leonardo-dicaprio-kim-kardashian-grilled-for-1mdb-and-connection-to-jho-low_1728741880.html", "title": "FBI documents show Leonardo DiCaprio, Kim Kardashian grilled over 1MDB and connection to Jho Low", "title_page": "FBI documents show Leonardo DiCaprio, Kim Kardashian grilled over 1MDB and connection to Jho Low | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Leonardo DiCaprio was struggling to remember some of the details about his relationship with financier Jho Low.\nIn an office on Sunset Boulevard in April 2018, a Federal Bureau of Investigation (FBI) special agent, an Internal Revenue Service investigator and three Department of Justice (DOJ) prosecutors started off their interrogation of the movie star with gentle questions, according to an FBI summary of the interview. They spoke about his acting career, his charity work and his production company Appian Way.\nSoon the interview turned to Low Taek Jho, the financier commonly known as Jho Low who is accused of orchestrating the looting of billions of dollars from Malaysian sovereign-wealth fund 1MDB, and whom Mr DiCaprio met in 2010.\nLow had lavished the actor with gifts, partying with him across the globe and financing his 2013 movie The Wolf Of Wall Street.\nMr DiCaprio recounted to the agents that the relationship began in a nightclub.\nHe had been told that Low’s money came from an unknown “whale of whales” in Abu Dhabi, he said, and that Low was the “Mozart of the business world”.\nOnly later, around 2015, did federal investigators target Low in a multi-billion-dollar embezzlement probe. He did not reply to a request for comment.\nAs an FBI agent presented Mr DiCaprio with e-mail and documents, the actor’s memory became less clear.\nHe did not remember discussing one of Low’s companies with him, even though Mr DiCaprio had once described Low in an e-mail to a potential investor as “my friend” and the “CEO” of that same company.\nWhen he looked at another e-mail, Mr DiCaprio told the agents it did not look like “something he would write” – he thought he “might have cut-and-pasted it”.\nMr DiCaprio was sure his managers had vetted Low before working with him on The Wolf Of Wall Street, but he did not recall what the background check had found.\nLow’s connection to Mr DiCaprio and other celebrities has come under renewed scrutiny as prosecutors prepare for the criminal trial of hip-hop legend Prakazrel “Pras” Michel, a member of the group the Fugees.\nMichel stands accused of directing foreign money into Mr Barack Obama’s 2012 presidential campaign and lobbying on behalf of Low and the Chinese government. Among the bright lights on Michel’s potential witness list are Mr DiCaprio, Mr Obama, former ­US president Donald Trump and hotel magnate Steve Wynn.\nA representative for Mr DiCaprio declined to comment. Representatives for Ms Kardashian, Mr Humphries and Mr West did not respond to detailed messages seeking comment.\nMs Kardashian also recounted an unusual money transfer. According to the FBI summary of her interview, she and others – including Wolf Of Wall Street co-producers Riza Aziz and Joey McFarland – were at a casino in Las Vegas with Low.\nThe group played baccarat in a private room. At 5am, Ms Kardashian was ready to leave, but a friend told her to drink some coffee and stick around, because he had “heard stories of Low giving people chips at the end of the night”.\nAs the gamblers screamed “monkey” (baccarat lingo that basically means “I need a 10 or face card”), Ms Kardashian called out which bets to make and won a big hand.\nShe tried to turn the winnings over to Low, but he told her to keep the chips, by then worth US$350,000. She told the FBI that when she went to the casino counter to cash out, she was handed US$250,000 in “a trash bag full of one hundred dollar bills”.\n“Kardashian put the trash bag full of cash in her carry-on bag and boarded a Southwest Airlines flight back to Los Angeles,” FBI agents wrote. She collected the other US$100,000, again in a trash bag full of cash, during a later trip to party with Low in Las Vegas.\nThe FBI task force interviewed not only A-listers, but also the middlemen who serve the world’s most famous people.\nMr Ralph DeLuca, a memorabilia broker, told the agents how he sold associates of Mr DiCaprio and Low US$10 million in vintage movie posters. Famed jeweller Lorraine Schwartz recalled bringing a diamond to a yacht in Monaco for Low to examine and crafting a necklace worth more than US$20 ­million allegedly for the wife of former Malaysian prime minister Najib Razak, who was sentenced to prison in connection with the 1MDB scandal.\nHer lawyers have said she did not request the necklace and never received it.\n“Low once told Schwartz not to tell other people about the purchases he made from his own account,” the FBI reported. “Schwartz thought this was because Low did not want people to know how much he was spending on gifts for others, especially Miranda Kerr.”\nMs Kerr, a supermodel, briefly dated Low. She turned over gifts he had given her to the government. Her representatives declined to comment for this story. Mr DeLuca and Ms Schwartz did not respond to messages.\nBut special agent Robert Heuchling of the FBI’s international corruption unit did want to know. By September 2019, after leading a global hunt for the billions of dollars Low and others had allegedly looted, Mr Heuchling and his colleagues were after every dollar they could find. They were still eager to haul in more celebrities, to build a case against Low and figure out where the stolen funds had gone.\n“Been thinking a bunch about Swizz,” he wrote to colleagues, referring to acclaimed record producer Swizz Beatz, who did not respond to a request for comment. “I think we need to bring Kerr to (the grand jury).”\nOne celebrity drew more attention from investigators than the others: Mr DiCaprio, whose relationship with Low extended far beyond parties and largesse.\nAgents collected thousands of BlackBerry messages and e-mails between the two and their associates. They built a spreadsheet of all the gifts Low had given to Mr DiCaprio across five years and the US$6 million he pledged to his charity.\nThey reviewed photos of the two wearing tuxedos at an event, signing paperwork and standing in front of a Basquiat that Low donated to Mr DiCaprio’s charity.\nWhat emerged from the FBI’s investigation was a picture of how close the men became. The movie star introduced Low as “my man”, and the investor called Mr DiCaprio “Ldogg”. Their mothers had met.\nMr DiCaprio connected Low with his friends in the art world, technology and real estate. And the pair traded ideas about a mega fund of US$1 billion for more films, a Warner Bros theme park in Asia with rides based on DiCaprio movies and the development of an eco-friendly resort in Belize.\n“I was working for him,” Mr DiCaprio later told a grand jury, “and that business also translates into being social. And so we saw each other more, and there was more interaction.”\nOften in the middle of those interactions was Mr Rick Yorn, Mr DiCaprio’s manager. A powerful figure in Hollywood, Mr Yorn represents a roster of A-listers including Jennifer Lawrence and Justin Timberlake. They have not been connected to the Low affair. A representative for Mr Yorn declined to comment for this story.\nFor his biggest client, Mr Yorn dreamt of a transformative deal and saw Low’s billions as a way to unlock it.\n“Need to talk about what I think is the ‘cracking of the code’ structure/deal for you,” Mr Yorn wrote to Mr DiCaprio in December 2013. “Been working on it quietly with a few people and I need to take you through it. Could be a game changer. I’m hesitant to tell Jho about it now, but I think I might give him a taste.”\nIt is unclear what kind of arrangement Mr Yorn envisioned, or whether it was ever set in motion, but he later wrote back to Mr DiCaprio: “I took Jho through it. He gets it big time.”\nMr Yorn became a hands-on negotiator and peacemaker, working directly with Low. At one juncture, Low groused about Wolf’s budget to Mr Yorn, telling him to “work your magic” and persuade director Martin Scorsese to cut costs.\nAt another point, when the deal seemed on the brink of falling apart, Mr Yorn wrote to Low’s team: “I wish it could cost less. It’s not for lack of trying and the (US$95 million budget) just can’t be done. I wish it could. We will be close.”\nThe e-mails show Mr Yorn saw Low as a potential partner in future deals. He told Mr DiCaprio he “would love to get Jho and the boys” to invest in a Cameron Diaz picture and credited Low with inspiring a US$30 million cash offer from Mr Aziz for Mr DiCaprio to star in two other films, The Brigands Of Rattleborge and Papillon. None of those deals worked out.\nMr Aziz did not respond to a message requesting comment.\nLike Mr DiCaprio, Mr Yorn became part of Low’s social circle, visiting his yacht in the Mediterranean and planning to join the financier at a party in Las Vegas. Reflecting one night on Low’s relationship with another supermodel, he wrote to Mr DiCaprio: “What a world, L. What a world.”\nEven after the DOJ announced plans to seize Low’s assets and the rights to The Wolf Of Wall Street, the financier continued to pitch to Mr Yorn and Mr DiCaprio. When Low pestered Mr DiCaprio about a Chinese film fund, the actor told agents, he had used his manager as a “buffer”.\n“Buddy, I know you don’t want to deal with Jho Low on this China deal,” he wrote to Mr Yorn in August 2016, “but by not engaging with him or contacting him back, he is constantly contacting me. Again, this is now falling in my hands.”\n“I’ll do whatever you want,” Mr Yorn responded. “I will deal. Just wanted some space. I told him after Labour Day… I’ll talk to him. I’m just protecting us.”\nLater, Mr Yorn wrote Mr DiCaprio: “I texted Jho brother. Are you having fun? We should rent that island out… with a bunch of hotties. Haha.”\nMr DiCaprio told the FBI he was not exactly sure where Low’s wealth came from. He said it was the responsibility of Mr Yorn and Mr DiCaprio’s entertainment lawyer to look into him. Mr DiCaprio said his publicist, Mr Shawn Sachs, had hired someone to conduct a background check on Low, but that he did not “thoroughly read” it.\n“Usually, DiCaprio relies on his representatives to read the reports and give him an okay to continue to work with someone. In this case, they gave him the green light to continue to work with Low,” FBI agents wrote.\nDuring the interview, they pressed Mr DiCaprio on when he became aware of the growing suspicions surrounding Low. “DiCaprio lives in a world of rumours,” they recounted, “so he did not take any of them seriously until the main negative news stories about Low came out, and his team told him it was now serious.”\nAnd as news stories began to emerge about Low and 1MDB in 2015, something else had fractured the relationship.", "url": "https://www.straitstimes.com/world/united-states/fbi-documents-show-leonardo-dicaprio-kim-kardashian-grilled-for-1mdb-and-connection-to-jho-low"}