{"authors": [], "date_download": "2024-10-12 14:02:43", "date_modify": "2024-10-12 14:02:43", "date_publish": "2022-06-16 01:00:29", "description": "Officials and experts say flooding the battlefield with advanced weapons is far slower and harder than it sounds. Read more at straitstimes.com.", "filename": "world_united-states_biden-announces-more-artillery-ammunition-anti-ship-missiles-for-ukraine_1728741763.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/16/UKRAINE-RUSSIA-CONFLICT-200115.jpg?VersionId=CqWbgof1oR6n4rb8gJAyLo4ygpsXbzfR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-announces-more-artillery-ammunition-anti-ship-missiles-for-ukraine_1728741763.html", "title": "US and allies pledge additional arms for Ukraine, but Kyiv wants more", "title_page": "US and allies pledge additional arms for Ukraine, but Kyiv wants more | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS (NYTIMES) – President Joe Biden on Wednesday (June 15) announced a further US$1 billion (S$1.4 billion) in weapons and aid for Ukraine, as the United States and its allies met to craft a response to Ukraine’s increasingly urgent calls for advanced arms to beat back Russia’s invasion.\nThe package, detailed by Secretary of Defence Lloyd Austin after a meeting with allies at Nato headquarters in Brussels, includes more long-range artillery, anti-ship missile launchers and more rounds for howitzers and for a sophisticated American rocket system on which Ukrainians are currently being trained.\nOverall, the US has now committed about US$5.6 billion in security assistance to Ukraine since Russia invaded on Feb 24.\nMr Biden said in a statement that he had told President Volodymyr Zelensky of Ukraine about the new weapons during a 40-minute call on Wednesday morning. Mr Zelensky and his aides have recently ramped up public pressure on the West to supply vastly more of the sophisticated armaments it has already sent, questioning their allies’ commitment to the Ukrainian cause and insisting that nothing else can stop the inexorable, brutal Russian advance in eastern Ukraine.\nBut Western officials and arms experts caution that flooding the battlefield with advanced weapons is far slower and more difficult than it sounds, facing obstacles in manufacturing, delivery, training and compatibility – and in avoiding depletion of Western arsenals.\nThe leaders of the European Union’s largest countries – Germany, France and Italy – are expected to pay their first visit to Mr Zelensky in Ukraine on Thursday, in a show of solidarity, but it remains unclear whether they will have much to offer. The leaders – Chancellor Olaf Scholz of Germany, President Emmanuel Macron of France and Prime Minister Mario Draghi of Italy – have all expressed the desire for a more rapid conclusion of the war through peace talks with Russia, raising hackles in Ukraine.\nMr Austin, together with Ukraine’s defence minister, Mr Oleksii Reznikov, met at Nato headquarters with defence officials from some 45 countries supporting Ukraine, to try to assess what weapons Ukraine needs right now and how its allies can best provide them.\n“We can’t afford to let up, and we can’t lose steam,” Mr Austin said in opening the gathering, urging allies to redouble their efforts to help Ukraine.\n“We must intensify our shared commitment to Ukraine’s self-defence, and we must push ourselves even harder to ensure that Ukraine can defend itself, its citizens and its territory,” he added.\nHe said that Germany would offer Ukraine three long-range, multiple-launch artillery rocket systems with ammunition. Slovakia is promising helicopters and ammunition, and Canada, Poland and the Netherlands pledged more artillery.\nPresident Vladimir Putin’s forces, advancing in the Donbas region of eastern Ukraine, are close to capturing Sievierodonetsk, the city that has been the focus of the fighting, and Ukrainian troops in the area are at risk of encirclement. In what seems like a replay of the siege in Mariupol, hundreds of civilians and troops are sheltering in bunkers below an industrial plant in the city.\nUkraine, Mr Austin said, “is facing a pivotal moment on the battlefield”. The Russian military in Donbas is relying heavily on its immense advantage in long-range artillery, pounding Ukrainian soldiers – as well as cities and towns – from a distance before trying to move in. The Ukrainians have drawn them into some close-quarters combat, with both sides reportedly suffering heavy casualties.\n“It is vital to hold on there, in Donbas,” Mr Zelensky said in a video address early Wednesday. “The more losses the enemy suffers there, the less power they will have to continue the aggression.”\nGeneral Mark Milley, the chairman of the US Joint Chiefs of Staff, said in Brussels that not just the sovereignty of Ukraine was at stake, but “the rules-based international order is also under threat due to the actions of Russia in Ukraine”.\nNato defence ministers are preparing for the alliance’s annual summit in Madrid this month, where it will unveil its first new strategic concept since 2010, when it described Russia as a potential partner. The new stance is being negotiated in drafts but is understood to set out a direction for Nato that sees Russia as an adversary, and mentions the threats posed to the trans-Atlantic alliance by China for the first time.\nThe ministers are also discussing how to satisfy Turkey, which has put a hold on the membership applications of Sweden and Finland over larger concerns about Kurdish separatism and terrorism. In response to Mr Putin’s invasion of Ukraine, the Swedes and Finns decided to abandon their long-held military nonalignment and join Nato.\nUkrainian officials have been pleading daily for more long-range artillery and complaining loudly that the West has been to slow to provide it. The howitzers and rocket launchers delivered or pledged by the US and others fall far short of what Ukraine says it needs to match Russian firepower.\nMr Mykhailo Podolyak, a leading adviser to Mr Zelensky, said this week that Ukraine needs 1,000 155-mm howitzers, 300 multiple-launch rocket systems and 500 tanks, among other things, to achieve battlefield parity – several times as much heavy weaponry as has been promised.\nMr Austin and Nato insist they understand the urgency.\n“Russia is using its long-range fires to try to overwhelm Ukrainian positions,” said Mr Austin, a retired four-star Army general.\nThe most advanced weapons the US has so far supplied Ukraine include four Himars truck-mounted multiple-launch rocket launchers, with rockets that have a range of up to 40 miles, greater than anything Ukraine currently possesses. The first Ukrainian team is scheduled to complete its training on the system on Wednesday, and it will be deployed in the battlefield next week, a Biden administration official said.\nThe package announced on Wednesday includes another three Himars launchers. Germany pledged three similar launchers, and Britain had previously promised three.\nThe new US commitment also includes 18 M777 155-mm howitzers, in addition to 108 already delivered, and 36,000 shells for them.\nMr Austin and Gen Milley pushed back on the charge that the allies were being too cautious in rushing advanced weapons to Ukraine, saying that everything was being done in coordination with Ukrainian military leaders.\n“I think the international community has done a pretty good job of providing that capability. But it’s never enough,” Mr Austin said. “And so we’re going to continue to work hard to move as much capability as we can as fast as we can.”\nBut promising weapons and delivering them are two different things.\nIt is one thing to get a large howitzer or tank or thousands of artillery shells to Ukraine’s western borders. But given that Nato countries do not want to risk direct confrontation with Russian forces, transport from there must be done by Ukrainians or private contractors.\nSimply getting the weapons across Ukraine to the eastern battlegrounds depends on railroads and transport networks that are being bombed and shelled by Russian forces to disrupt supply.\nUkraine’s military is running very low on shells for its artillery based on Soviet designs, some of it dating to the Soviet era, and Western countries do not make compatible ammunition. Former Soviet bloc countries like Poland have only so many munitions that are familiar to Ukrainian soldiers and work with their guns.\nMore modern Western equipment requires training, done in other countries, with those Ukrainians trained sent back to operate equipment or train others.\nModern weapons also require sophisticated maintenance, which takes further training, and US weapons generally do not use the metric system, which means different tools and wrenches.\nAnd different Nato member countries have varying equipment requiring varying training and tools. The French have provided Ukraine some of the most sophisticated artillery in the world, the Caesar self-propelled howitzer. Like the American M777, it fires 155-mm shells, but operating the two guns is not the same.\nAnd not only are sophisticated weapons systems expensive, but the supply is limited and production is often slow. Some countries sending arms to Ukraine have expressed fears of depleting their own stocks and weakening their national security, and some have secured commitments from the US and others to provide replacements.\nThe US has also been concerned that the Ukrainians not be given weapons with such long ranges that they can hit targets deep within Russia itself. So it did not immediately supply the Himars mobile rocket launcher, and it is not supplying the longest-range rockets the system can use.\nThere are also concerns about keeping control of advanced technology. For instance, there are efforts to get Ukraine more sophisticated anti-ship missiles, to drive the Russian navy further from the Ukrainian coast off Odesa. But those missiles include technology that can only be exported after obtaining special permission, and there are concerns that such weapons not fall into the hands of the Russians.\nThe US and its allies have been careful to express sympathy for Ukraine’s plight, and not to say that Kyiv’s complaints about the pace of supply are unfair or unfounded.\n“It’s an evolving list,” said the US ambassador to Nato, Julianne Smith.\n“The list that they gave us early on in the conflict looks very different from the list that we’re talking about now. We were heavily focused in the beginning on air defence. We transitioned to a conversation about ammunition. We’ve had moments where we’ve talked about coastal defence. We’re talking about heavy rocket artillery. We have shifted the conversation.”\nNato member countries will continue to provide Ukraine with heavy weapons and long-range systems, and a new package of assistance to Kyiv will be agreed on by allies in consultation with Ukraine, Nato Secretary-General Jens Stoltenber said before the defence ministers’ meeting on Wednesday.\n“Ukraine is in a really very critical situation, so there is an urgent need for support,” he said.", "url": "https://www.straitstimes.com/world/united-states/biden-announces-more-artillery-ammunition-anti-ship-missiles-for-ukraine"}