{"authors": [], "date_download": "2024-10-12 13:45:09", "date_modify": "2024-10-12 13:45:09", "date_publish": "2022-08-18 02:35:42", "description": "Oleg Artemyev was three hours into a six-hour spacewalk when voltage levels in his spacesuit's battery began to drop. Read more at straitstimes.com.", "filename": "world_europe_spacesuit-issue-forces-early-end-to-russian-space-walk_1728740709.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/18/2022-08-04T131237Z_1902157001_RC2OPV93TMZY_RTRMADP_3_SPACE-EXPLORATION-ISS-RUSSIA.JPG?VersionId=pWk2K988IN5uRSMMBk6D3CGNUARz9WVo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_spacesuit-issue-forces-early-end-to-russian-space-walk_1728740709.html", "title": "Spacesuit battery glitch forces early end to Russian spacewalk", "title_page": "Spacesuit battery glitch forces early end to Russian spacewalk | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - A Russian spacewalk outside the International Space Station ended hours earlier than planned on Wednesday (Aug 17) after a cosmonaut discovered an electrical issue with his spacesuit, US and Russian officials said.\nOleg Artemyev was roughly two hours into a six-hour spacewalk when voltage levels in his spacesuit’s battery began to unexpectedly drop, prompting flight controllers in Moscow to repeatedly order the cosmonaut’s immediate return to the space station’s airlock.\n“Oleg, drop everything and go back,” a flight controller urged Artemyev from mission control in Moscow, as heard on a live feed of space-to-ground audio.\n“Drop everything and start going back right away... Go back and connect to station power.”\nArtemyev returned to the airlock and connected his suit to the space station’s power.\nThe flight controller warned Artemyev that he risked losing power to his suit’s oxygen pump, and contact with mission control, if he did not immediately return to the airlock for power.\nNasa spokesman Rob Navias said Artemyev “was never in any danger.”\nRussian flight controllers opted to call off the spacewalk early once Denis Matveev, the other cosmonaut performing the spacewalk, gathered his tools and positioned the robotic arm they had been upgrading back into its normal position.\nUpon Matveev’s return, the spacewalk ended after four hours, at 1.54pm ET (1.54am on Thursday, Singapore time).", "url": "https://www.straitstimes.com/world/europe/spacesuit-issue-forces-early-end-to-russian-space-walk"}