{"authors": [], "date_download": "2024-10-12 13:52:43", "date_modify": "2024-10-12 13:52:43", "date_publish": "2024-01-11 16:35:55", "description": "Iranian authorities have arrested 35 people in relation to the Jan. 3 attacks in the southeastern city of Kerman, the Intelligence Ministry said on Thursday, according to the semi-official Tasnim news agency. Read more at straitstimes.com.", "filename": "world_middle-east_iran-says-it-arrested-35-people-in-relation-to-deadly-kerman-attacks_1728741163.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/11/LYNXMPEK0A0AR-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_iran-says-it-arrested-35-people-in-relation-to-deadly-kerman-attacks_1728741163.html", "title": "Iran says it arrested 35 people in relation to deadly Kerman attacks", "title_page": "Iran says it arrested 35 people in relation to deadly Kerman attacks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI - Iranian authorities have arrested 35 people in relation to the Jan. 3 attacks in the southeastern city of Kerman, the Intelligence Ministry said on Thursday, according to the semi-official Tasnim news agency.\nThe ministry said it had identified one of the two suicide bombers as a national of Tajikistan, who entered Iran illegally on Dec. 19.\nMore information will be released at a later date about the second suicide bomber, the ministry said, adding that the arrests had been carried out in several Iranian provinces.\nThe Islamic State claimed responsibility on Jan. 4 for the attack that killed nearly 100 people and wounded 284, at a memorial for top commander Qassem Soleimani.\nTehran has vowed revenge for the bloodiest such attack since the 1979 Islamic Revolution. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/iran-says-it-arrested-35-people-in-relation-to-deadly-kerman-attacks"}