{"authors": [], "date_download": "2024-10-12 13:35:38", "date_modify": "2024-10-12 13:35:38", "date_publish": "2023-10-27 17:15:54", "description": "CAIRO/Projectiles hit two Egyptian Red Sea towns on Friday injuring several people, sources and officials said, showing the risk of regional spillover from the Israel-Gaza conflict. Read more at straitstimes.com.", "filename": "world_blasts-hit-two-egyptian-red-sea-towns_1728740138.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/27/LYNXMPEJ9Q0DH-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_blasts-hit-two-egyptian-red-sea-towns_1728740138.html", "title": "Blasts hit two Egyptian Red Sea towns", "title_page": "Blasts hit two Egyptian Red Sea towns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CAIRO/JERUSALEM -Projectiles hit two Egyptian Red Sea towns on Friday injuring several people, sources and officials said, showing the risk of regional spillover from the Israel-Gaza conflict.\nThe explosions hit Taba on the border with Israel and Nuweiba about 70 km (43 miles) further away, two Egyptian security sources told Reuters, saying they were still gathering more information.\nThere was no claim of responsibility, but Egypt's state-linked Al-Qahera News said the missile that hit Taba appeared to be connected to fighting between Hamas militants and the Israeli military around Gaza, about 220 km (137 miles)miles away.\nEgypt's health ministry said six people were injured in Taba, with four already discharged from hospital, after an ambulance facility and residential building were hit.\nWitnesses in both places, who asked not to be named, confirmed explosions and smoke rising. Israel's military said it was aware of a security incident outside its borders.\nTaba and Nuweiba, both in Egypt's Sinai Peninsula, are popular with tourists.\nBordering both Gaza and Israel, Egypt is exposed to the conflict that blew up after Hamas' Oct. 7 assault on Israel and the subsequent bombardment of the Gaza Strip.\nCairo has been prominently advocating for aid flows into Gaza, the release of Hamas' hostages and a ceasefire.\nLast weekend, several Egyptian border guards were injured after being accidentally hit by fragments of a shell from an Israeli tank. Israel apologised for the incident.\nOn Wednesday, Hamas said it had targeted the Israeli town of Eliat, adjacent to Taba across the border, with a missile in what appeared to be the Islamist group's longest-range Palestinian attack of the flare-up since Oct. 7.\nAdding to an increasingly risky situation in the region, the U.S. military said last week a Navy warship in the Red Sea intercepted projectiles launched by Yemen's Iranian-backed Houthi group potentially toward Israel. REUTERS", "url": "https://www.straitstimes.com/world/blasts-hit-two-egyptian-red-sea-towns"}