{"authors": ["Arvind Jayaram"], "date_download": "2024-10-12 14:07:26", "date_modify": "2024-10-12 14:07:26", "date_publish": "2022-05-15 23:27:20", "description": "Nato foreign ministers said the accession process - which usually takes up to a year - would be expedited. Read more at straitstimes.com.", "filename": "world_europe_finland-sweden-on-the-fast-track-to-nato-membership-over-ukraine_1728742046.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/16/yu_nato_flags.jpg?VersionId=X061CuS_m7Ndwuv8JKslQ.PjmxeZP1nw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_finland-sweden-on-the-fast-track-to-nato-membership-over-ukraine_1728742046.html", "title": "Finland, Sweden on the fast track to Nato membership over Ukraine", "title_page": "Finland, Sweden on the fast track to Nato membership over Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Finland and Sweden are on the fast track to becoming the newest members of the North Atlantic Treaty Organisation (Nato) following their respective governments’ historic announcements on Sunday (May 15) that they will seek membership in the military alliance over Russia’s invasion of Ukraine.\nThe motion will be debated in the Finnish Parliament on Monday, but with a majority of lawmakers in favour and record levels of public support for the proposal, a formal application for Nato membership appears to now only be a formality.\nFinnish President Sauli Niinisto confirmed the bid to reporters in the presidential palace in Helsinki a day after informing his Russian counterpart Vladimir Putin of the move, prompting Mr Putin to warn that bilateral ties would be hurt.\n“Today, the President of the Republic and the Government’s Foreign Policy Committee have jointly agreed that Finland will apply for Nato membership after consulting Parliament. This is a historic day. A new era is opening,” Mr Niinisto said.\n“I, or Finland, are not known to sneak around and quietly disappear behind a corner. It is better to say it straight what already has been said, also to the concerned party and that is what I wanted to do,” he added, in reference to his call with Mr Putin.\nThe Kremlin said in a statement that “Putin stressed that abandoning the traditional policy of military neutrality would be a mistake, since there are no threats to Finland’s security”.\nThe Finland President downplayed concerns of Russian aggression, asserting that while there would be pushback from Moscow “little by little, I’m beginning to think that we’re not going to face actual military operations”.\nMeanwhile, Sweden’s long-ruling Social Democrats dropped their decades-old policy of military non-alignment on Sunday to open the doors to Nato membership.\nWhile the senior leadership was in favour of reversing their party’s traditional opposition to joining Nato, some dissenting voices had emerged to label any such move as hasty.\nBut an even greater number of MPs – some of whom had made their support contingent on Finland joining the bloc – threw their support behind the proposal, creating a large parliamentary majority in favour.\nThe two Nordic nations are now likely to submit a formal application within days, with Finnish Prime Minister Sanna Marin stating: “Hopefully, we can send our applications next week together with Sweden.”\nNato foreign ministers holding talks over the weekend in Berlin that were focused on the membership bids indicated that the accession process – which usually takes up to a year – would be expedited.\n“Germany has prepared everything to do a quick ratification process,” Foreign Minister Annalena Baerbock said, adding that security guarantees must be extended to assuage fears of Russian retaliation.\n“We must make sure that we will give them security guarantees, there must not be a transition period, a grey zone, where their status is unclear,” she said.", "url": "https://www.straitstimes.com/world/europe/finland-sweden-on-the-fast-track-to-nato-membership-over-ukraine"}