{"authors": ["Charissa Yong"], "date_download": "2024-10-12 14:08:04", "date_modify": "2024-10-12 14:08:04", "date_publish": "2022-08-30 23:56:43", "description": "Pennsylvania will be a key battleground state in November and in the next presidential election in 2024. Read more at straitstimes.com.", "filename": "world_united-states_biden-heads-to-pennsylvania-talks-gun-violence-as-campaign-ramps-up_1728742084.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/x--nzDDevUHNPJniGe6T_6bEPMcM3RuC2F2Fs4zMGGs.jpg?VersionId=HWGeaAr7AuQ9C0hkeawYMtBp_izw6Dl4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-heads-to-pennsylvania-talks-gun-violence-as-campaign-ramps-up_1728742084.html", "title": "Biden casts Democrats as party of law and order in midterm campaigning", "title_page": "Biden casts Democrats as party of law and order in midterm campaigning | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - United States President Joe Biden vowed to ban assault weapons and condemn political violence, two issues he criticised Republicans for not doing enough to address, during a visit to Pennsylvania on Tuesday ahead of the upcoming midterm elections.\nThe visit was the first of three that Mr Biden will make over the next week to the swing state, one of several in the country that will decide in November which party controls Congress for the rest of his term.\nThe President is ramping up campaigning for Democrats in swing states. In his recent speeches, he has launched increasingly direct attacks on Republicans - a departure from his pre-presidency persona, which earned him some criticism of being “too bipartisan” and having “too many Republican friends”, he quipped on Tuesday.\nMr Biden touted his plan to make America safer and his support for legislation to fund the police and reduce gun crime, a major concern of voters.\nHe also highlighted the bipartisan gun safety Bill Congress passed in June, its first major legislation on the issue in nearly 30 years, and slammed most Republican lawmakers for voting against it.\nThe President’s speech comes after several high-profile mass shootings over the summer, including one in an elementary school in Uvalde, Texas, in May that killed 19 children and two adults.\nCalling for a ban on assault rifles, Mr Biden said that to identify the bodies of their slain children, some parents had to supply DNA because of the damage the high-powered weapons had done.\n“For God’s sake, what is the rationale for these weapons outside of a war zone?” said Mr Biden, visibly angry. “DNA to say, that is my baby? What is the matter with us?”\nHe cited recent research in the New England Journal of Medicine, which found that guns had overtaken car accidents in 2020 to become the leading cause of children’s death in America.\nUS gun deaths surged in 2020 to their highest point since 1994, according to a report by the US Centres for Disease Control and Prevention in May.\nMr Biden vowed to fund police officers, distancing himself from the call by the progressive wing of his party to “defund the police”, which Republicans have targeted.\n“When it comes to public safety, the answer is not to defund the police but fund the police,” he said.\nThe city of Wilkes-Barre, which hosted Mr Biden’s rally, will also be visited on Saturday by former president Donald Trump. Neither has yet officially announced another run for the White House in 2024.\nMr Biden will return to the state on Thursday, when he will give an address on the threat some Republicans pose to America’s democracy, and again on Monday to attend a Labour Day event.\nOn Tuesday, he blasted a wing of the Republican Party for undermining law and order, a pointed attack on its traditional claim as “the party of law and order”.\n“Let me say this to my MAGA Republican friends in Congress: Don’t tell me you support law enforcement if you don’t condemn what happened on the sixth,” Mr Biden said.\nHe was referring to former president Trump’s \"Make America Great Again\" (MAGA) campaign slogan and the reluctance of his loyalists to decry the attack by his supporters on the US Capitol on Jan 6 last year.\nHe also criticised threats made against the Federal Bureau of Investigation (FBI) and its officers who had executed a search warrant at Mr Trump’s Mar-a-Lago property in Florida.\n“There is no place in this country - no place - for endangering the lives of law enforcement,” he said. “I’m opposed to defunding the police. I’m also opposed to defunding the FBI,” Mr Biden said.", "url": "https://www.straitstimes.com/world/united-states/biden-heads-to-pennsylvania-talks-gun-violence-as-campaign-ramps-up"}