{"authors": [], "date_download": "2024-10-12 13:54:08", "date_modify": "2024-10-12 13:54:08", "date_publish": "2024-09-25 09:50:00", "description": "The jail, a hulking concrete structure with about 1,200 inmates, has long had a history of complaints. Read more at straitstimes.com.", "filename": "world_united-states_strange-cellmates-in-a-brooklyn-jail-sean-combs-and-sam-bankman-fried_1728741248.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/25/rrseansam2509.jpg?VersionId=kMchfTc0R45jQ7S1hIkOJChxucekiOPp&h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_strange-cellmates-in-a-brooklyn-jail-sean-combs-and-sam-bankman-fried_1728741248.html", "title": "Strange cellmates in a Brooklyn jail: Sean Combs and Sam Bankman-Fried", "title_page": "Strange cellmates in a Brooklyn jail: Sean Combs and Sam Bankman-Fried | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Rapper Sean “Diddy” Combs is living in the same unit of a Brooklyn jail as Sam Bankman-Fried, the crypto mogul convicted of fraud, sleeping in a dormitory-style room with a group of other defendants assigned to the same section, according to a person familiar with the living arrangements.\nCombs has been held in the jail, the Metropolitan Detention Center, for nearly a week, since federal prosecutors unsealed an indictment charging him with racketeering conspiracy and sex trafficking in what the government has called a “decades-long pattern of physical and sexual violence”.\nHe has pleaded not guilty to all charges, and his lawyers argued strenuously for him to be released on bail, proposing to a judge that he put up a US$50 million (S$64 million) bond and hire a security team to monitor him at all hours.\nThe judge rejected the proposal, saying that he had concerns about Combs attempting to witness tamper, landing him in a special housing unit that often holds high-profile inmates.\nA spokesperson for the Bureau of Prisons said the agency “does not provide information about conditions of confinement, including housing assignments or internal security practices for any particular incarcerated individual”.\nBankman-Fried has been housed in the jail, known as MDC, since 2023, when his bail was revoked after a judge ruled that he had violated conditions of his release.\nIn the lead-up to his trial, his lawyers complained that he had only intermittent internet access and could not adequately prepare for his case. They said that Bankman-Fried, a vegan, was subsisting on a diet of water, bread and peanut butter.\nBankman-Fried, who founded the FTX cryptocurrency exchange, was convicted of masterminding a sweeping fraud in which he siphoned billions of dollars of his customers’ money into venture capital investments, political contributions and other lavish spending. He was sentenced to 25 years in prison.\nBut after his conviction, Bankman-Fried asked to remain at MDC while he pursued an appeal. He has overlapped in the unit with other high-profile inmates, including an ex-president of Honduras and Mexico’s former secretary of public security.\nCombs’ lawyers initially argued that the conditions at MDC were too “horrific” for a defendant awaiting trial. The jail, a hulking concrete structure with about 1,200 inmates, has long had a history of complaints.\nA lawyer for a detainee who died there in July from injuries sustained in a fight called the prison “an overcrowded, understaffed and neglected federal jail that is hell on earth”. In 2019, an electrical fire left some prisoners without heat in the dead of winter.\nBut on Sept 24, a lawyer for Combs, Mr Marc Agnifilo, who declined to comment on his client’s roommates, spoke much more positively about the detention centre, saying the “dedicated professionals at the MDC are doing everything possible to help him and his lawyers prepare his defence, and I personally thank them”.\n“He’s strong, focused and our meetings are very productive,” Mr Agnifilo said in a statement. “I can’t say enough good things about the MDC, which has been responsive to our and his needs.”\nCombs’ defence is pushing for a speedy trial, and Mr Agnifilo said his team was arranging for him to be able to assess the discovery provided by the government while incarcerated “as soon as humanly possible”. The government has said the case involved a “massive amount” of evidence, including many witnesses, photos, videos and text messages.\n“My view is if the government wants to arrest him and hold him in jail, despite a massive bail package and despite his repeated offers to turn himself in, we are all going to have to move this along with unprecedented urgency,” Mr Agnifilo said.\nIn a letter to the judge overseeing the case, Combs’ lawyers wrote on Sept 23 that they did not, at that point, intend to ask for Combs to be moved to a different detention center.\nThe Bureau of Prisons has said that in recent months it has made an effort to improve conditions there, including hiring more permanent staff and addressing more than 700 backlogged maintenance requests. NYTIMES", "url": "https://www.straitstimes.com/world/united-states/strange-cellmates-in-a-brooklyn-jail-sean-combs-and-sam-bankman-fried"}