{"authors": [], "date_download": "2024-10-12 13:47:15", "date_modify": "2024-10-12 13:47:15", "date_publish": "2024-10-11 13:35:00", "description": "Complex was located in a neighbourhood outside of mandatory evacuation zones. Read more at straitstimes.com.", "filename": "world_united-states_losing-everything-hurricane-hits-retirement-complex-in-florida_1728740835.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/2024-10-11T032608Z243196061RC2UHAA0JITCRTRMADP3STORM-MILTON.JPG?VersionId=nUWTvgJUE_RAhn1PJTtePKS0mE2KYHFy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_losing-everything-hurricane-hits-retirement-complex-in-florida_1728740835.html", "title": "Losing everything: Hurricane hits retirement complex in Florida", "title_page": "Losing everything: Hurricane hits retirement complex in Florida | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "FLORIDA – As gushing water from Hurricane Milton flooded their Florida apartment, Mr Lidier Rodriguez and Ms Sandra Escalona rushed upstairs to safety – a scene of danger and drama in a normally staid senior living facility.\nHours later, after the powerful storm hit on the evening of Oct 9, they watched as the same emergency crews who rescued them at their residence – a series of two-story apartment buildings – helped other older people get out.\nThe complex is on a low-lying and now flooded street near Tampa Bay on Florida’s west coast. Police and firefighters went from building to building in boats on Oct 10, helping people get to dry land.\n“We lost everything,” said Mr Rodriguez, a 54-year-old Cuban man who has been living in Florida for 20 years. “But at least we are alive. That is all we have left.”\nOutside their homes, dozens of residents look confused and shell shocked – like they did not know what to do next. They carried bags with the few belongings they were able to salvage, and in some cases their pet dogs and cats.\nNo one expected so much flooding in a neighbourhood that was not part of the many mandatory evacuation zones that Florida officials declared in the second major hurricane in as many weeks.\nThe neighbourhood was not damaged at all when Hurricane Helene hit late last month.\nMilton killed at least 11 people as it churned across the state and then out to the Atlantic. But Floridians heaved a sigh of relief because the storm surge, catastrophic damage and loss of life that many people feared did not materialise in the end.\nNow, what?\nWhen Ms Escalona saw a few inches of water on the floor of her home, she first thought a neighbour had left the water running, but soon realised something was very wrong.\n“It all happened very quickly. The water rushed in suddenly, it was strong, with a lot of current,” Ms Escalona recalled.\n“We grabbed some papers and the dog and left. We spent the night outside the door of the neighbours upstairs.”\nNow she and her husband are wondering what to do and where to go.\n“It is not easy to think you have everything and suddenly you have nothing,” said Mr Rodriguez.\n“We don’t know where to go. We have been in this country for nearly 20 years and have no family. It’s her, me, and the dog,” he said, pointing to their chihuahua Tito.\nRelief replaces fear\nEven though Milton was a powerful Category 3 hurricane on a five-level scale, in the end Florida was not hit nearly as hard as officials had feared.\nIn fact, most of the 11 fatalities from the storm happened on the East Coast, away from where the storm made landfall, due to tornadoes that spun off from the storm.\nIn Sarasota, about 100 km south of Clearwater and near where the hurricane made landfall, streets were gradually getting back to normal.\nEmergency crews cleared many streets before dawn, but there were still downed trees in some places, along with broken glass and other damage.\nNear the marina in Sarasota, dozens of people walked around taking pictures of the storm damage with their cellphones. They looked at a speedboat that had rammed into a boat rental office because of Milton’s powerful winds.\nMany people expressed relief that the city was not as badly damaged as they had expected.\n“I think it could have been a lot worse,” said one retiree, Ms Donna Pickup.\nThat feeling of relief is shared in Punta Gorda, 100 km south-east of Sarasota.\nIn that town, hit hard by Hurricane Ian in 2022, the storm surge that rushed in on the night of Oct 9 flooded seaside areas and left several yachts stranded on the ocean front promenade. But here, too, the damage was not as bad as many had feared.\n“Thank God,” said Mr David Cardoso, “a lot of houses are in pretty good tack.”\nHe added: “It was supposed to hit us worse.” AFP", "url": "https://www.straitstimes.com/world/united-states/losing-everything-hurricane-hits-retirement-complex-in-florida"}