{"authors": [], "date_download": "2024-10-12 13:45:29", "date_modify": "2024-10-12 13:45:29", "date_publish": "2022-07-16 09:39:51", "description": "Nasa officials have been steadfast in insisting that operations on the space station remain normal. Read more at straitstimes.com.", "filename": "world_united-states_in-space-us-russian-cooperation-finds-a-way-forward_1728740729.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/16/md_rusukraine_16072022.jpg?VersionId=J2XFU6EF5rZi73UlMdUmZDqyYoyPFYYR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_in-space-us-russian-cooperation-finds-a-way-forward_1728740729.html", "title": "In space, US-Russian cooperation finds a way forward", "title_page": "In space, US-Russian cooperation finds a way forward | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK (NYTIMES) - When SpaceX next launches a Falcon 9 rocket to the International Space Station, one of the astronauts aboard will be Russian.\nNasa and Roscosmos, the Russian space agency, announced Friday (July 15) that they had reached an agreement that would give Russian astronauts seats on American-built spacecraft in exchange for Nasa astronauts' getting rides to orbit on Russian Soyuz rockets.\nAlso on Friday, Russian President Vladimir Putin signed a decree dismissing Mr Dmitry Rogozin, who since 2016 had led Roscosmos, the state corporation that oversees Russia's space activities.\nRussians and Americans in orbit have sustained their close cooperation despite the fracturing of ties between the countries after Russia's invasion of Ukraine in February.\nThe relationship also endured Mr Rogozin's repeated belligerent pronouncements in the Russian news media and on his Twitter and Telegram accounts.\nIn April, Mr Rogozin demanded that economic sanctions against Russia be lifted and said that he had submitted a proposal urging the Russian government to leave the space station.\nThis week, after the European Space Agency formally pulled out of a collaboration with Russia on sending a robotic rover to Mars, Mr Rogozin said Russian astronauts on the space station would stop using a robotic arm built by the Europeans and lobbed disparaging words at Mr Josef Aschbacher, director-general of the European Space Agency, and Mr Josep Borrell Fontelles, a top European Union foreign policy official.\n\"I, in turn, give a command to our crew on the ISS to stop working with the European ERA manipulator,\" Mr Rogozin wrote on his Telegram channel. \"Let Aschbacher himself and his boss Borrell fly into space and do at least something useful in their lives.\"\nKremlin spokesperson Dmitry Peskov insisted that the move had nothing to do with Mr Rogozin's performance and promised that the former director would soon be employed again.\n\"This is not connected with any issues,\" Mr Peskov said Friday, according to the Russian state news media. \"In due time, Rogozin will be employed and will start a new job.\"\nMr Rogozin's successor will be Mr Yuri Borisov, who takes over Roscosmos after his own ousting as the deputy prime minister overseeing Russia's military industrial complex.\nMr Borisov is a longtime government official who also previously was a deputy defence minister. Unlike Mr Rogozin, he is not known for being a firebrand in public.\nNasa officials have been steadfast in insisting that operations on the space station remain normal, usually letting Mr Rogozin's comments pass without comment.\nFor example, without the crew swap agreement, if a problem grounded new Soyuz launches, then at some point, all of the Russian astronauts on the station would return to Earth, leaving the Russian-built segment of the station untended. That could put all of the station in danger.\n\"The station was designed to be interdependent and relies on contributions from each space agency to function,\" Nasa said. \"No one agency has the capability to function independent of the others.\"\nUnder the agreement, there is no exchange of money between Nasa and Roscosmos.\nFrom 2006 to 2020, Nasa had paid Russia an average of US$56 million (S$78.38 million) a seat to take 71 astronauts to the space station.\nAfter the retirement of Nasa's space shuttles in 2011, the Soyuz was the only way Nasa astronauts could go to orbit. That need ended when SpaceX's Crew Dragon spacecraft became operational in 2020.\nMs Anna Kikina, a Russian astronaut, will join two Nasa astronauts, Ms Nicole Mann and Mr Josh Cassada, and Mr Koichi Wakata of Japan aboard Crew-5, the next SpaceX mission to the space station, scheduled for September.\nAnother Russian astronaut, Mr Andrei Fedyaev, is scheduled to be a member of the crew of the following SpaceX mission in spring 2023.\nNasa astronauts, starting with Mr Frank Rubio and Ms Loral O'Hara, will be part of the crews on upcoming Soyuz launches.", "url": "https://www.straitstimes.com/world/united-states/in-space-us-russian-cooperation-finds-a-way-forward"}