{"authors": ["Charissa Yong"], "date_download": "2024-10-12 14:03:06", "date_modify": "2024-10-12 14:03:06", "date_publish": "2023-05-17 10:40:00", "description": "The decision could undermine US attempts to exert global leadership in the long run, say analysts. Read more at straitstimes.com.", "filename": "world_united-states_biden-cancels-part-of-asia-trip-over-debt-limit-crisis_1728741786.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/17/2023-05-16T213200Z1251994345RC2WZ0AAWHY7RTRMADP3USA-BIDEN_3.JPG?VersionId=czblxvtoOSjrQMw6EtUuE.vk_g9SchAh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-cancels-part-of-asia-trip-over-debt-limit-crisis_1728741786.html", "title": "Biden cancels part of Asia trip over debt limit crisis", "title_page": "Biden cancels part of Asia trip over debt limit crisis | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – United States President Joe Biden will cut short his upcoming trip to Asia, skipping planned visits to Australia and Papua New Guinea to deal with the looming debt limit crisis at home.\nHe will still attend the three-day Group of Seven (G-7) summit beginning on Friday in Hiroshima, Japan, but will return to the US on Sunday for meetings with congressional leaders, the White House said on Tuesday.\nAnalysts said the decision, while made due to urgent domestic priorities, could damage America’s credibility abroad, particularly if it undermines US attempts to exert global leadership in the long run.\n“The President must prioritise America’s financial solvency over foreign travel. Those who understand US politics will understand his decision,” Hudson Institute Asia-Pacific security chair Patrick Cronin said.\n“But America looks diminished when it fails to do the minimum of just showing up,” he added.\nThe Biden administration and congressional leaders are negotiating a deal to raise the nation’s borrowing limit and prevent the US from defaulting on its debt, which could happen as early as June 1. Tuesday’s talks produced no breakthroughs.\nMr Biden would have been the first sitting US President to visit Papua New Guinea, where he would have inked two security pacts, according to media reports.\nA summit with the other Quad nations of Australia, India and Japan, which Mr Biden was to have attended in Sydney, will now be held on the sidelines of the G-7 summit in Japan instead, Australian Prime Minister Anthony Albanese said on Wednesday.\nEurasia Group US managing director Jon Lieber said that Quad leaders, who are elected, understand that domestic matters must take precedence over international affairs.\n“If Biden loses legitimacy at home, he can’t do anything abroad, and the debt limit is a critical issue that will potentially upend his re-election if it doesn’t go well. Unfortunately, there is no way this won’t hurt his diplomatic efforts,” said Mr Lieber.\nIn a statement, the White House stressed that advancing partnerships like the Quad remained a key priority for Mr Biden.\nIt added that the US looked forward to finding other ways to engage with Australia, the Quad, Papua New Guinea and Pacific Islands leaders “in the coming year”.\nBut American Enterprise Institute senior fellow Zack Cooper said the decision to cut short the trip will damage US credibility, and that of the Biden administration, in Asia.\n“The explanation that American politics is more important will be seen as a reminder that domestic political problems in the United States can interfere with our engagement in Asia, which is exactly what many countries worry about in the first place,” said Dr Cooper.\nHe added that while Mr Biden’s attendance at the G-7 summit ensured at least some diplomatic gains from the trip, it also sent the message that the advanced industrial democracies of the G-7 were “more of a priority than many of the players in the Indo-Pacific region”.\nThe itinerary change also reflects a longer-term challenge for Mr Biden and the US in general – that America’s divisions at home are hurting it abroad.\n“While it may be accepted that domestic issues like this will always take precedence, the fact these issues come up at all reflects deeper polarisation in the US,” said Mr Lieber.\nThis polarisation makes it harder for the US to consistently provide global leadership, “creating vacuums where others can step in or where no one will lead at all”, he added.\nPrevious US administrations likewise faced challenges when trying to make the Asia-Pacific region a foreign policy priority.\nMr Barack Obama axed a trip to Asia in October 2013 over the federal government shutdown, while Donald Trump skipped the East Asia Summit in the Philippines in 2017 due to the length of his trip.\nDr Cronin said that while the Obama administration saw the need for a pivot to Asia, it could not fully implement that vision.\nAnd while the Trump administration gained bipartisan support for focusing on major power competition, it polarised many audiences at home and abroad, he said.\n“Now the Biden administration risks backsliding on some of its prized regional initiatives, at least in the Pacific and with the Quad,” Dr Cronin added.", "url": "https://www.straitstimes.com/world/united-states/biden-cancels-part-of-asia-trip-over-debt-limit-crisis"}