{"authors": [], "date_download": "2024-10-12 13:38:46", "date_modify": "2024-10-12 13:38:46", "date_publish": "2024-08-18 20:16:00", "description": "Russia claimed to capture another village near the Ukrainian-held logistics hub of Pokrovsk. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-it-struck-second-key-bridge-in-russias-kursk-region_1728740326.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/18/2024-08-18T073251Z1679867568RC27I9A4P1Q2RTRMADP3UKRAINE-CRISIS-GLUSHKOVO.JPG?VersionId=iXly0Qmly9IriWqk_Js5.GO09c8l3N7w", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-it-struck-second-key-bridge-in-russias-kursk-region_1728740326.html", "title": "Ukraine says it struck second key bridge in Russia’s Kursk region", "title_page": "Ukraine says it struck second key bridge in Russia’s Kursk region | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Ukraine said on Aug 18 it had struck a second key bridge in the Kursk region, seeking to disrupt Moscow’s supply routes as Kyiv’s unprecedented incursion on Russian soil stretched through its second week.\nRussia meanwhile ramped up pressure in east Ukraine, claiming to capture another village just a few kilometres from the Ukrainian-held logistics hub of Pokrovsk.\n“Minus one more bridge,” Ukrainian Air Force Commander Lieutenant-General Mykola Oleshchuk said on Telegram, publishing an aerial video of a blast tearing through a bridge near the Russian town of Zvannoye.\n“The Air Force aviation continues to deprive the enemy of logistical capabilities with precision air strikes,” he added.\nIt was not clear when Ukraine carried out the attack. Lt-Gen Oleshchuk did not give a date and Russian military bloggers shared photos of destruction from what appeared to be the same bridge dated Aug 17.\nKyiv sent troops and armoured vehicles across the border on Aug 6, in its biggest attack on Russian territory since the Kremlin launched its invasion of Ukraine in February 2022.\nOn Aug 16, Ukraine announced it had destroyed a separate bridge in the neighbouring town of Glushkovo, both of which lie on the river Seym that winds through the region.\nThe attacks on both bridges have left Russia with limited options to cross the river in the area, according to Russian military bloggers.\nMoscow said the destruction of one of the bridges had hindered evacuation efforts.\nThe Russian Defence Ministry said in a briefing it was pushing back against Ukraine’s forces near several villages.\nMore than 120,000 people have fled the region since fighting began, according to the Russian authorities.\nAdvancing to Pokrovsk\nRussia on Aug 18 said its forces had captured Svyrydonivka, another front-line settlement some 15km away from Pokrovsk.\nPokrovsk lies on the intersection of a key road that supplies Ukrainian troops and towns across the eastern front and has long been a target for the Russian army.\n“As a result of active operations, units of the Centre grouping of troops have liberated the village of Sviridonovka,” Moscow’s Defence Ministry said, using the Russian name for the village.\nRussian forces have been inching towards Pokrovsk for months, taking a string of tiny villages as they seek to reach the outskirts of the city.\nThe head of Pokrovsk’s military administration, Mr Sergiy Dobryak, warned earlier this week that Russia was a little over 10km from the outskirts of the city and urged remaining residents to evacuate.\nUkrainian forces earlier on Aug 18 announced they had thwarted a Russian missile attack on the capital Kyiv, where air raid sirens sounded before dawn.\n“This is the third ballistic missile attack on the capital in August with a clear interval of six days between each attack,” the Kyiv City military administration posted on Telegram after the early morning barrage.\nNo damage or casualties were reported from the attack, which the administration said likely involved “North Korean ballistic missiles of the KN-23 type”.\n‘Falling debris’\nUkrainian drones attacked an oil storage facility in Russia’s southern Rostov region early Aug 18 morning, sparking a large fire, the local governor said.\nVideos published on social media showed thick black smoke and bursts of flames coming from the site of the blaze, which the governor said was in the town of Proletarsk.\n“In the south-east of the Rostov region, air defences repelled a drone attack. As a result of falling debris on the territory of industrial storage facilities in Proletarsk, a diesel fuel fire broke out,” Governor Vasily Golubev said on Telegram.\n“At 05.35 (0235 GMT), firefighting at the industrial facility in Proletarsk was suspended due to a second drone attack,” he added in an update to the post.\nNo one was injured and firefighting efforts resumed shortly after, he said in a later post.\nProletarsk is some 25km from the Ukraine border and some 350km from Kyiv-held areas of fighting on the eastern Ukrainian front line.\nKyiv has repeatedly targeted oil and gas facilities in Russia since the conflict began, some hundreds of kilometres from its borders, in what it has called “fair” retaliation for attacks on its energy infrastructure.\nEarlier in August, Ukrainian President Volodymyr Zelensky praised his forces for hitting oil facilities in Russia, saying the attacks would help bring a “just end” to the conflict. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-says-it-struck-second-key-bridge-in-russias-kursk-region"}