{"authors": [], "date_download": "2024-10-12 14:02:22", "date_modify": "2024-10-12 14:02:22", "date_publish": "2023-03-31 04:51:54", "description": "A group of 65 Ukrainian military personnel has completed training. Read more at straitstimes.com.", "filename": "world_europe_ukraine-forces-complete-patriot-training-in-us_1728741742.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/31/2023-02-07T150613Z2131061017RC266Z9784QORTRMADP3UKRAINE-CRISIS-POLAND-PATRIOTS_6.JPG?VersionId=tHrhuMcE4cFh_qW3_Y_bAJ0zlxGwYqVZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-forces-complete-patriot-training-in-us_1728741742.html", "title": "Ukraine forces complete Patriot air defence training in US", "title_page": "Ukraine forces complete Patriot air defence training in US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – A group of 65 Ukrainian military personnel has completed training in the United States on the Patriot air defence system and returned to Europe, the Pentagon said on Thursday.\nUkraine had repeatedly pushed the United States for the high-tech system to help shield against Russian strikes and Washington promised in late 2022 that it would provide a Patriot battery, with Kyiv’s troops starting training in Oklahoma in January.\n“This week, 65 Ukrainian air defenders completed Patriot training at Fort Sill, Oklahoma, and have now arrived back in Europe,” Pentagon spokesman Pat Ryder told journalists.\n“They’re integrating with other Ukrainian air defenders along with donated Patriot air defence equipment from the United States, Germany and the Netherlands,” he said.\nMore than 7,000 Ukrainian military personnel have been trained by the US since Russia invaded its smaller neighbour in February 2022, Brigadier-General Ryder said.\nMade by Raytheon, the MIM-104 Patriot is a surface-to-air missile system initially developed to intercept high-flying aircraft.\nIt was modified in the 1980s to focus on the new threat of tactical ballistic missiles, and was used in combat against Iraq’s Russian-made Scuds in the first Gulf War. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-forces-complete-patriot-training-in-us"}