{"authors": [], "date_download": "2024-10-12 13:35:16", "date_modify": "2024-10-12 13:35:16", "date_publish": "2023-12-15 19:57:46", "description": "The Israeli military has recovered the bodies of three Israelis - a civilian and two soldiers - who had been held in the Gaza Strip by Hamas since its Oct. 7 attack on southern Israel, it said on Friday. Read more at straitstimes.com.", "filename": "world_israeli-forces-recover-the-bodies-of-a-civilian-two-soldiers-held-in-gaza-army_1728740116.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/15/LYNXMPEJBE0D0-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_israeli-forces-recover-the-bodies-of-a-civilian-two-soldiers-held-in-gaza-army_1728740116.html", "title": "Israeli forces recover the bodies of a civilian, two soldiers held in Gaza: Army", "title_page": "Israeli forces recover the bodies of a civilian, two soldiers held in Gaza: Army | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM -The Israeli military has recovered the bodies of three Israelis - a civilian and two soldiers - who had been held in the Gaza Strip by Hamas since its Oct. 7 attack on southern Israel, it said on Friday.\nThe military said 28-year-old Elia Toledano and 19-year-old soldiers Nik Beizer and Ron Scherman were identified in a process carried out by medical officials, military rabbis and forensic experts. It did not elaborate on the circumstances of their killing, or from where in Gaza they were recovered.\nIsraeli media reported that Toledano was taken by Hamas from an outdoor music festival that had turned into a massacre.\nIsrael said 240 people were taken hostage when Hamas gunmen breached the separation barrier into Israel on Oct. 7 and killed 1,200 people.\nPalestinian authorities say Israel's intense bombardment and ground operation in Gaza in the weeks since have killed nearly 19,000 Palestinians, wounded tens of thousands more and displaced half of the strip's 2.3 million population.\nDuring a week-long truce in late November, Hamas released more than 100 women, children and foreigners it was holding in Gaza in exchange for the release of 240 women and teenagers Israel had imprisoned, many without charge.\nMore than 130 hostages remain in Gaza. Some have been declared dead in absentia by Israeli authorities.\nThe Palestinian Prisoners Association said Israel has detained more than 4,400 Palestinians since Oct. 7 and is holding around half without charge. REUTERS", "url": "https://www.straitstimes.com/world/israeli-forces-recover-the-bodies-of-a-civilian-two-soldiers-held-in-gaza-army"}