{"authors": [], "date_download": "2024-10-12 14:03:39", "date_modify": "2024-10-12 14:03:39", "date_publish": "2023-01-13 07:13:06", "description": "US officials hope that keeping the most sophisticated chips out of China’s hands will slow its progress on advanced technologies. Read more at straitstimes.com.", "filename": "world_united-states_why-the-us-needs-japans-help-on-china-chips-restrictions_1728741819.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/13/2022-12-14T110034Z2005983639RC2M5Y98T2P4RTRMADP3MEXICO-USA-CHIPS-INSIGHT.JPG?VersionId=SeTb7afcL70FNmbbRLLzB5Ap33NjVQcG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_why-the-us-needs-japans-help-on-china-chips-restrictions_1728741819.html", "title": "Why the US needs Japan's help on China chips restrictions", "title_page": "Why the US needs Japan's help on China chips restrictions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - When the Biden administration unveiled aggressive export controls in October aimed at blocking China from becoming a global leader in advanced semiconductors it was missing a key ingredient: agreement from US allies to impose their own matching restrictions.\nPersuading Japan to join the US effort, which limits Chinese access to US chipmaking technology and cuts China off from certain semiconductor chips made anywhere in the world, will be high on US President Joe Biden’s to-do list when he meets with Japanese Prime Minister Fumio Kishida in Washington on Friday.\nAmerican officials, touting an ever-closer strategic alignment with Japan, are praising Tokyo’s plan for the biggest Japanese military buildup since World War II as rivalry with China in the region grows.\nBut while Japan is broadly in-line with the goals of the Biden administration’s expanded US export controls, Mr Kishida’s government has been vague about the extent to which it will join in.\nSpeaking in Washington last week, Japan’s minister of Economy, Trade and Industry Yasutoshi Nishimura promised to work more closely with Washington on export controls, although he did not say whether Tokyo would match sweeping US restrictions.\nThe hesitation is understandable - Japan is a top producer of the specialised tooling equipment needed to manufacture advanced chips and its companies hold 27 per cent of global market share, according to the Semiconductor Industry Association. Tokyo Electron, Japan’s leading chip manufacturing equipment maker, relies on China for about a quarter of its revenue.\nThe other top producers of chip-making gear are the United States and the Netherlands, home to ASML, another of the world’s biggest makers of chip-making tools.\nSeeking a deal\nUS officials are quick to play down the differences between the United States, Japan and other allies.\n“I think there’s a very, very similar vision of the challenges,” a senior US administration official told Reuters on Wednesday, adding that Japanese export restrictions may not be exactly the same as the US controls.\n“But I don’t think the Japanese question the basic premise that we need to be working closely together on this.”\nA US Commerce Department official said in October he expected a deal with allies in the near term.\nNetherlands Prime Minister Mark Rutte will travel to Washington to meet Mr Biden on Jan 17 and discuss “cooperation on critical technologies and shared vision for a free and open Indo-Pacific,” the White House said on Thursday.\nStill, said Mr Daniel Russel, a former top US diplomat for Asia, a gap remains between the US and Japanese positions.\n“Kishida wants the US to take a Goldilocks approach that is tough enough to deter Chinese assertiveness, but cautious enough to allow Japan’s business interests to thrive,” he said.\nBehind the US drive for high-tech export controls is rising alarm about China’s military buildup and its effort to outpace the United States in technologies such as artificial intelligence and quantum computing.\nFearing that this will yield a military edge for an increasingly assertive China, US officials hope that keeping the most sophisticated chips - and the tools needed to make them - out of China’s hands will slow the country’s progress on advanced technologies.\nBut unless Japan and the Netherlands impose their own export controls, China will soon perfect other ways of getting the equipment it needs, even as American companies stand to lose market share.\nA US deal with the Netherlands could also be within reach. One toolmaking industry executive familiar with that country’s sector said that if the Dutch government imposed similar export controls on its industry, ASML would probably not suffer a severe impact due to its extensive network of customers beyond China.\nIf US diplomacy succeeds, its policies could have the intended impact, argues Chris Miller, author of “Chip War” and an associate professor at Tufts University.\nWith Japan on board, particularly in terms of chip manufacturing tools, the United States could put up “a really large number of road blocks to China’s ability to advance its own domestic chipmaking,” Assoc Prof Miller said.\nThat would have knock-on effects for Beijing’s other tech ambitions, including in artificial intelligence.\nJapanese companies can make up for lost China business by expanding elsewhere, such as South-east Asia, a chip industry source familiar with internal discussions about export restrictions said.\n“For better or worse, Japan’s semiconductor strategy is moving in accordance with what the United States wants.” REUTERS", "url": "https://www.straitstimes.com/world/united-states/why-the-us-needs-japans-help-on-china-chips-restrictions"}