{"authors": [], "date_download": "2024-10-12 13:37:59", "date_modify": "2024-10-12 13:37:59", "date_publish": "2024-08-22 18:22:46", "description": "Ukraine strikes a storage site for fuel and glide bombs, according to a Kyiv security source. Read more at straitstimes.com.", "filename": "world_europe_ukraine-conducts-drone-attack-on-russian-airbase-in-volgograd-region-source-says_1728740279.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/22/LYNXMPEK7L0CD-1.jpg?VersionId=gKa4ZR2ysqY5E2ptILJsDrn8XogWOFxO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-conducts-drone-attack-on-russian-airbase-in-volgograd-region-source-says_1728740279.html", "title": "Ukraine conducts drone attack on Russian airbase in Volgograd region, source says", "title_page": "Ukraine conducts drone attack on Russian airbase in Volgograd region, source says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine conducted a drone attack on Russia's Marinovka military airfield in the southern Russian region of Volgograd, striking a storage site for fuel and glide bombs, a security source in Kyiv said on Aug 22.\nThe Russian governor of the Volgograd region said earlier that a fire had broken out at a military facility in the region after a Ukrainian drone crashed into it. The official, Andrei Bocharov, said there had been no casualties.\nThe source said the attack was part of a campaign of Ukrainian drone strikes on Russian airfields that are used by warplanes to conduct regular attacks on targets in Ukraine.\nApart from missile strikes, Ukraine has in particular flagged Russia's use of cheaply-produced glide bombs fired by warplanes as a menace to Ukrainian positions in the east, as well as cities and towns that have been struck by them.\nEven after the delivery of a small group of US-made F-16 fighter jets, the Ukrainian air force is outgunned by Russia's much larger and well-armed fleet of warplanes.\nRussia launched its full-scale invasion of Ukraine in February 2022. The source said the drone attack was a joint operation conducted by the Security Service of Ukraine and the country's special forces. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-conducts-drone-attack-on-russian-airbase-in-volgograd-region-source-says"}