{"authors": [], "date_download": "2024-10-12 14:10:48", "date_modify": "2024-10-12 14:10:48", "date_publish": "2017-06-05 19:54:38", "description": "TEHERAN (AFP) - Iran's foreign ministry on Monday (June 5) urged Qatar and neighbouring Gulf Arab countries that have severed diplomatic ties with the gas-rich peninsula to engage in dialogue. Read more at straitstimes.com.", "filename": "world_middle-east_iran-urges-dialogue-between-qatar-and-gulf-neighbours_1728742248.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2017/06/05/2017-06-05t024352z_1688764478_rc11ad0b56a0_rtrmadp_3_gulf-qatar.jpg?VersionId=bwbmRfC6_HZ2mT2qwIVeAsR8Qc8Z2OvC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_iran-urges-dialogue-between-qatar-and-gulf-neighbours_1728742248.html", "title": "Iran urges 'dialogue' between Qatar and Gulf neighbours", "title_page": "Iran urges 'dialogue' between Qatar and Gulf neighbours | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TEHERAN (AFP, REUTERS) - Iran's foreign ministry on Monday (June 5) urged Qatar and neighbouring Gulf Arab countries that have severed diplomatic ties with the gas-rich peninsula to engage in dialogue.\n\"The solution to differences between states in the region, including the current problem between Qatar and its three neighbours, is only possible through political and peaceful methods and dialogue between the parties,\" spokesman Bahram Ghasemi said in a statement published on the ministry's website.\nGulf states Saudi Arabia, Bahrain and the United Arab Emirates, plus Egypt and Yemen on Monday announced they were cutting all ties with Qatar, accusing it of supporting extremism, in the biggest diplomatic crisis in the region for years.\nGhasemi said increased tension among its southern neighbours \"is not to the benefit of any governments in the region and threatens the interests of all\" at a time when the world was \"suffering widespread terrorism and extremism\".\nShiite Iran has had no diplomatic ties with most of the mainly Sunni Gulf states since 2016, when Arab nations followed Saudi Arabia in severing relations after protesters torched its missions in the Islamic republic.\n\"Using sanctions in today's integrated world is inefficient, to be condemned and unacceptable,\" Ghasemi added of Qatar's neighbours closing all land, sea and air links with it.", "url": "https://www.straitstimes.com/world/middle-east/iran-urges-dialogue-between-qatar-and-gulf-neighbours"}