{"authors": [], "date_download": "2024-10-12 14:06:40", "date_modify": "2024-10-12 14:06:40", "date_publish": "2022-10-01 02:47:18", "description": "President Volodymyr Zelensky calls Russia \"bloodthirsty scum\" after attack kills at least 30 people. Read more at straitstimes.com.", "filename": "world_europe_bodies-in-cars-on-the-ground-after-zaporizhzhia-civilian-convoy-strike_1728742000.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/01/UKRAINE-RUSSIA-CONFLICT-WAR-152233.jpg?VersionId=nRMYvZSoFsZxqX9qdgEVWecTtzkXm4SX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_bodies-in-cars-on-the-ground-after-zaporizhzhia-civilian-convoy-strike_1728742000.html", "title": "Bodies in cars, on the ground after Zaporizhzhia civilian convoy strike", "title_page": "Bodies in cars, on the ground after Zaporizhzhia civilian convoy strike | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ZAPORIZHZHIA, Ukraine - The body of a man in a chequered jumper inside a car with blown-out windows, his tattooed hand still clutching the steering wheel.\nA woman's purple manicure and golden rings visible as her body lies in a pool of blood on the ground.\nThese are just some of at least 30 civilians killed in a strike on a humanitarian convoy outside Ukraine's southern city of Zaporizhzhia on Friday.\nThe deadly attack came in the morning, when hundreds of people were waiting in a line of vehicles to cross into the Russian-controlled part of the region.\nObtaining permission to move between Kyiv- and Moscow-held territory can be a lengthy process, with families divided by a moving frontline in a conflict that has ravaged Ukraine for seven months.\nThe strike came just hours before President Vladimir Putin declared four Ukrainian regions - including Zaporizhzhia - to be Russian in a lavish annexation ceremony at the Kremlin.\nAn AFP journalist at the scene saw bodies lying between damaged cars, with suitcases and handbags scattered nearby.\nOne man, 56-year-old Viktor, said his life was saved by the fact that he left the queue to find coffee.\n\"The waitress gave it to me, then there was a bang. She got scared and ran out. A few minutes later, another one. Now she is on the floor,\" he said.\n\"I managed to hide. She did not.\"\nA few metres behind him, the body of a young woman in a pink jacket was lying on the ground, her leg contorted.\nAnother woman's body was lying face down.\nBoth were killed between two rows of cars, the front of a convoy hoping to return to parts of southern Ukraine under Russian control.\nDrivers and passengers were waiting outside a logistics centre for permission to cross, which can take days or even weeks, according to Viktor.\nAnother woman who survived and asked to use the pseudonym Katya said some 300 cars were waiting around 8am when the rockets hit.\nUkrainian security forces said three S-300 missiles hit the transit centre and a small forest nearby.\nPolice inspected a large crater several meters deep near the line of cars.\n'Ukrainian, not Russian'\nAFP saw more than a dozen damaged cars and vans on Friday afternoon, all with their windows blown out.\nThe bodies of their former passengers, covered with a white sheet, were still inside.\nA soldier opened a minivan door, first discovering a small dog that had been killed, before pulling out the body of a man by his black jacket.\nThe remains of half a dozen victims in black body bags were placed in an ambulance nearby.", "url": "https://www.straitstimes.com/world/europe/bodies-in-cars-on-the-ground-after-zaporizhzhia-civilian-convoy-strike"}