{"authors": [], "date_download": "2024-10-12 14:13:27", "date_modify": "2024-10-12 14:13:27", "date_publish": "2024-07-24 20:17:00", "description": "Dealers have promised a steady supply of wares, but warned prices may go up. Read more at straitstimes.com.", "filename": "world_europe_paris-drug-dealers-say-they-re-ready-for-olympics-too_1728742407.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/24/OLYMPICSBUSINESSSLUMP2.JPG?VersionId=nilwrlNan0xpsFYXJQCYuPrLAhZpeGCw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_paris-drug-dealers-say-they-re-ready-for-olympics-too_1728742407.html", "title": "Paris drug dealers say they’re ready for Olympics too", "title_page": "Paris drug dealers say they’re ready for Olympics too | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - France has declared itself prepared for the deluge of Olympics visitors – and so have Paris’ drug dealers.\nThe dealers have promised a steady supply of wares, but warned prices may go up and delivery wait times too under the weight of tens of thousands of security forces and heavy demand.\nFrom Parisians renting out their apartments, to a transit system that has boosted its ticket prices, everyone is looking to make a buck during the Games, including the underworld.\n“We’re always ready in this business,” a Parisian dealer told AFP, echoing French leader Emmanuel Macron’s judgment this week that his nation is all set for the Games.\n“There will always be somebody ready, that’s how it is when there’s money to be made,” said the dealer, on condition of anonymity.\nWith up to 45,000 security forces policing the streets, experts expect delivery services will see a bump as clients seek to avoid getting busted.\nIn fact, France has already had a boom in messaging app and social media-driven drug deliveries since pandemic lockdowns pushed the trade off the street and onto smartphone screens.\nAt the same time, the country has voiced increasing alarm over a flourishing drug trade and deadly violence between rival gangs.\n“There is a kind of Uberisation of drug trafficking, with the development of digital offerings on applications like Telegram, or promotional deals,” said criminal attorney Adrien Gabeaud.\nPolice on the lookout\nIn the run-up to the Games, dealers have been updating their clients on feeds with what to expect during the competition that opens on June 26 and runs through Aug 11.\n“The prices of our services will be adjusted due to challenging road traffic conditions and heavy demand,” one seller wrote to customers.\nSwathes of central Paris will be cordoned off during the festivities, likely snarling car and pedestrian traffic enough that the Parisian dealer said it would not be worth the trouble, even to see the events.\nIn one exchange between a seller and a customer, seen by AFP, the dealer warns that transactions cannot happen in the open.\n“The police are on the lookout,” the message read.\nYet other dealers are sending out messages to assure clients that service will carry on. One wrote: “I inform you that despite the Olympics, the delivery service will remain the same.”\nIt is too soon to gauge whether or how much prices could rise, but criminal lawyer David Curiel predicted they are on their way up.\n“In Paris a gram of cocaine costs €50 (S$73) to €60, but now it could probably go up to €80 a gram,” he said.\n“They (dealers) can’t wait, for them this is like the sales,” he added, referring to France’s government-set promotion periods when shoppers flock to stores.\n‘Incredible’ amount of drugs\nFrance has pledged to crack down on digital drug sales and has deployed massive amounts of police to patrol Paris during the Games, which is expected to attract 15 million people.\nBut will there be a boom?\nAn AFP check of drug sales prices advertised on messaging apps did not reveal an immediate spike, and police sources were also sceptical.\n“No ‘Olympics effect’ so far” on boosting drug sales, a narcotics investigator told AFP, on condition of anonymity.\n“There’s already an incredible amount (of drugs) on offer,” the investigator noted.\nOn that much, the police and dealers seem to agree.\n“During Covid it was different. There was an incredible spike in prices, by two or three times. It was a fight to find anything,” the Parisian dealer said. “It’s been fine ahead of the Olympics.”\nThe real effect on Paris’ – and France’s – drug market will not become clear immediately but researchers have begun pondering the impact.\n“Law enforcement is heavily mobilised for the Olympics, but is that going to give (dealers) more opportunity to pursue their business elsewhere in France?” asked economist Nacer Lalam.\n“That will be something we won’t know until after the fact.” AFP", "url": "https://www.straitstimes.com/world/europe/paris-drug-dealers-say-they-re-ready-for-olympics-too"}