{"authors": [], "date_download": "2024-10-12 14:11:07", "date_modify": "2024-10-12 14:11:07", "date_publish": "2024-08-29 05:29:31", "description": "He again urged Western leaders to allow Ukraine to use Western weapons for long-range strikes. Read more at straitstimes.com.", "filename": "world_europe_ukraines-zelensky-says-people-killed-in-russian-airstrike-on-kupyansk_1728742267.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/11567041.jpg?VersionId=bvc3Q9S4UX3S1d.WsS7MtcuzGZ_VBTAV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraines-zelensky-says-people-killed-in-russian-airstrike-on-kupyansk_1728742267.html", "title": "Ukraine's Zelensky says people killed in Russian airstrike on Kupyansk", "title_page": "Ukraine's Zelensky says people killed in Russian airstrike on Kupyansk | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukrainian President Volodymyr Zelensky said on Aug 28 a Russian airstrike earlier in the day on the eastern town of Kupyansk had resulted in some deaths, urging Western leaders to allow Ukraine to use Western weapons for long-range strikes.\n“There was a strike with a guided aerial bomb on Kupyansk - right in the city centre, people were under the rubble. Unfortunately, there are fatalities,” Mr Zelensky said in his nightly address.\nHe did not give a number.\nKupyansk, which is located 35km from the border with Russia, was hit in the afternoon, local officials said. The strike injured 14 people and damaged the building of the city hall, the regional prosecutor’s office wrote earlier on the Telegram messaging app.\nMr Zelensky also said in the address that the West should lift restrictions on long-range airstrikes by Ukraine.\n“We continue to insist that decisiveness now, removing restrictions on Ukraine for long-range strikes now, will help us end the war as quickly as possible in a just manner for Ukraine and the entire world,” he said. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraines-zelensky-says-people-killed-in-russian-airstrike-on-kupyansk"}