{"authors": [], "date_download": "2024-10-12 13:55:12", "date_modify": "2024-10-12 13:55:12", "date_publish": "2023-08-29 09:36:38", "description": "The reward is to promote \"age-appropriate marriage and childbearing\" for first marriages. Read more at straitstimes.com.", "filename": "world_chinese-county-offers-cash-reward-for-couples-if-bride-is-aged-25-or-younger_1728741312.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/29/CHINA-PEOPLE-LIFESTYLE-131843.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_chinese-county-offers-cash-reward-for-couples-if-bride-is-aged-25-or-younger_1728741312.html", "title": "Chinese county offers ‘cash reward’ for couples if bride is aged 25 or younger", "title_page": "Chinese county offers ‘cash reward’ for couples if bride is aged 25 or younger | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – A county in eastern China is offering couples a “reward” of 1,000 yuan (S$190) if the bride is aged 25 or younger, the latest measure to incentivise young people to get married amid rising concern over a declining birth rate.\nThe notice, which was published on Changshan county’s official WeChat account last week, said the reward was to promote “age-appropriate marriage and childbearing” for first marriages. It also included a series of childcare, fertility and education subsidies for couples who have children.\nConcerned about China’s first population drop in six decades and its rapidly ageing population, the authorities are urgently trying an array of measures to lift the birth rate, including financial incentives and improved childcare facilities.\nChina’s legal age limit for marriage is 22 for males and 20 for females, but the number of couples getting married has been falling, which has driven down birth rates. Official policies also make it harder for single women to have children.\nMarriage rates hit a record low in 2022 at 6.8 million, the lowest since 1986, according to government data released in June. There were 800,000 fewer marriages last year than in 2021.\nChina’s fertility rate, already one of the world’s lowest, is estimated to have dropped to a record low of 1.09 in 2022, state media reported.\nHigh childcare costs and having to stop their careers have put many women off having more children or any at all. Gender discrimination and traditional stereotypes of women caring for their children are still widespread throughout the country.\nLow consumer confidence and growing concerns over the health of China’s economy are also key factors cited by young Chinese for not wanting to get married and have children. REUTERS", "url": "https://www.straitstimes.com/world/chinese-county-offers-cash-reward-for-couples-if-bride-is-aged-25-or-younger"}