{"authors": [], "date_download": "2024-10-12 13:47:43", "date_modify": "2024-10-12 13:47:43", "date_publish": "2023-04-28 07:20:33", "description": "On Thursday, the mercury rose above 34 deg C in most of the southern Andalusia region. Read more at straitstimes.com.", "filename": "world_europe_spain-hit-by-summer-strength-heat-in-april_1728740863.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/28/SPAIN-CLIMATE-WEATHER-WARMING-154931_4.jpg?VersionId=3FjuLr8FjvqOhGAHmLuz5tQHn1Wt67xk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_spain-hit-by-summer-strength-heat-in-april_1728740863.html", "title": "Spain hit by summer-strength heat in April, some areas driest in 1,000 years", "title_page": "Spain hit by summer-strength heat in April, some areas driest in 1,000 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEVILLE – An unusually early heatwave in drought-hit Spain was set to peak on Thursday and Friday, with temperatures expected to break April records in the south of the country.\nExperts have warned of the high risk of wildfires, and farmers have warned of the catastrophic effect it is having on their crops.\nSince Monday, Spain has been enveloped by a mass of warm, dry air from North Africa that has driven up temperatures to “levels normally seen in summer and exceptionally high for this time of year”, said Spain’s state weather agency Aemet.\n“It’s highly likely (the heatwave) will peak on Thursday and Friday,” it added, acknowledging many temperature records had already been beaten on Wednesday.\nOn Friday, preliminary data showed the mercury rising to 38.8 deg C in Cordoba in the southern Andalusia region, 0.1 deg C hotter than the day before.\nScorching temperatures have prompted warnings about the high risk of wildfires. Spain has already seen fire ravage 54,000ha of land so far in 2023, compared with 17,000ha in the same period in 2022.\nExperts say parts of the country are the driest in a thousand years, with a prolonged drought depleting reservoirs to half their normal capacity, figures show.\nOn Wednesday, at least three areas around the southern cities of Seville and Huelva recorded temperatures of 37 deg C.\nSchools adapt schedules\nThis could be Spain’s hottest April on record, said Mr Ruben del Campo, a spokesman for Aemet.\n“Due to its intensity and early character, this episode fits with what we are observing climate change causes,” he added.\nThe Health Ministry has recommended that Spain’s regions activate their heat plans – which outline measures to protect people from scorching temperatures.\nThat normally happens from June 1, but the ministry said that in 2023 they could come into effect as early as May 15, depending on the situation in each region.\nThe regional government of Madrid said metro trains in the Spanish capital would pass more frequently than usual to prevent long waits on platforms and crowding.\nIt is also considering opening some public swimming pools earlier in the year to help people cool off, and let schools adapt their timetables to avoid the worst of the heat.\nFarmland ‘suffocating’\nThe heatwave follows an abnormally warm and dry spring, spelling catastrophe for the agriculture sector in Spain, the world’s biggest exporter of olive oil and a key source of Europe’s fruit and vegetables.\nThe situation is so bad that some farmers have opted not to plant crops. The COAG farmers’ union has warned that 60 per cent of farmland was “suffocating” from lack of rainfall.\nSpain on Tuesday urged Brussels to activate the bloc’s agriculture crisis reserve to help farmers cope with the exceptional drought, while also announcing a series of tax breaks.\nIn 2022, Spain experienced its hottest year since records began, and United Nations figures suggest nearly 75 per cent of its land is susceptible to desertification due to climate change.\nThe number of days with summer temperatures in Spain has increased from 90 to 145 between 1971 and 2022, according to a study by the Polytechnic University of Catalonia published on Tuesday.\nPortugal was also feeling the heat with temperatures “10 to 15 deg C higher than normal” that could hit 37 deg C on Thursday, the weather institute said, a day after the mercury touched 35.4 deg C in the south. AFP", "url": "https://www.straitstimes.com/world/europe/spain-hit-by-summer-strength-heat-in-april"}