{"authors": [], "date_download": "2024-10-12 14:08:20", "date_modify": "2024-10-12 14:08:20", "date_publish": "2022-07-23 04:47:35", "description": "Package will also include 500 small and highly portable Phoenix Ghost drones, which detonate on their targets. Read more at straitstimes.com.", "filename": "world_europe_us-releases-us270m-in-military-aid-to-ukraine-including-rocket-systems_1728742100.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/23/UKRAINE-RUSSIA-CONFLICT-WAR-174450.jpg?VersionId=rbRlPTZxF6FwMyO4jUrW49wn.KMS6L8g", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_us-releases-us270m-in-military-aid-to-ukraine-including-rocket-systems_1728742100.html", "title": "US releases US$270m in military aid to Ukraine, including rocket systems", "title_page": "US releases US$270m in military aid to Ukraine, including rocket systems | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (AFP) - The United States on Friday (July 22) signed off on another US$270 million (S$375 million) in military aid to Ukraine including four new Himars precision rocket systems.\nRussia has \"launched deadly strikes across the country, striking malls, apartment buildings, killing innocent Ukrainian civilians,\" White House spokesman John Kirby told reporters.\n\"In the face of these atrocities, the president has made clear that we're going to continue to support the government of Ukraine and its people for as long as it takes,\" he said.\nThe fresh aid will bring to 20 the number of M142 High Mobility Artillery Rocket Systems sent to Ukraine, which has called the Himars - which can precisely strike targets within 80 kilometres - a game-changer in countering Russia.\nKirby said the fresh aid will also include 500 new Phoenix Ghosts, small and highly portable drones that detonate on their targets.\nThe latest aid also includes 36,000 rounds of artillery ammunition.\nMuch but not all of the aid comes from a US$40 billion package for Ukraine approved by Congress in May.", "url": "https://www.straitstimes.com/world/europe/us-releases-us270m-in-military-aid-to-ukraine-including-rocket-systems"}