{"authors": [], "date_download": "2024-10-12 13:40:13", "date_modify": "2024-10-12 13:40:13", "date_publish": "2024-04-16 06:02:39", "description": "A selection of news stories that happened overnight, April 16, 2024. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-april-16-5_1728740413.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/2024-04-14T094408Z869311299RC2967ADQKPCRTRMADP3ISRAEL-PALESTINIANS-IRAN_0.JPG?VersionId=I1xXkUZBYnZQZaBkXh6w62gIyDiIASH4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-april-16-5_1728740413.html", "title": "While You Were Sleeping: 5 stories you might have missed, April 16", "title_page": "While You Were Sleeping: 5 stories you might have missed, April 16 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Israeli military pledges response to Iran attack\nIsrael’s military chief said on April 15 his country would respond to Iran’s weekend missile and drone attack, amid calls for restraint by allies anxious to avoid an escalation of conflict in the Middle East.\nPrime Minister Benjamin Netanyahu summoned his war Cabinet for the second time in less than 24 hours to weigh how to react to Iran’s first-ever direct attack on Israel, a government source said.\nIsrael’s military chief of staff Herzi Halevi said the country would respond, but provided no details.\n“This launch of so many missiles, cruise missiles, and drones into Israeli territory will be met with a response,” he said at the Nevatim Airbase in southern Israel, which sustained some damage in the April 13 night-time attack.\nREAD MORE HERE\nDozens of potential Trump jurors dismissed for bias\nThe judge in Donald Trump’s hush money trial dismissed dozens of potential jurors on April 15 who said they could not impartially decide whether the former US president is guilty or innocent of criminal charges.\nOn the first day of the historic criminal trial, the first to involve a former president, Justice Juan Merchan told nearly 100 prospective jurors they must set aside any biases or personal attitudes about the defendant or the case, including “political orientation.”\nAt least 50 were dismissed after saying they could not be impartial in judging Trump, the 2024 Republican candidate for president.\nREAD MORE HERE\nCoral reefs suffer fourth global bleaching event\nAlong coastlines from Australia to Kenya to Mexico, many of the world’s colourful coral reefs have turned a ghostly white in what scientists said on April 15 amounted to the fourth global bleaching event in the last three decades.\nAt least 54 countries and territories have experienced mass bleaching among their reefs since February 2023 as climate change warms the ocean’s surface waters, according to the US National Oceanic Atmospheric Administration’s (Noaa) Coral Reef Watch, the world’s top coral reef monitoring body.\nBleaching is triggered by water temperature anomalies that cause corals to expel the colourful algae living in their tissues. Without the algae’s help in delivering nutrients to the coral, the corals cannot survive.\nREAD MORE HERE\nRust armourer sentenced to 18 months in fatal shooting\nHannah Gutierrez, the chief weapons handler for the Western movie Rust, was sentenced to 18 months in prison on April 15 in the death of cinematographer Halyna Hutchins, who was shot when actor Alec Baldwin was handling a gun during the film’s production in 2021.\nIn March, Gutierrez, 27, was found guilty of involuntary manslaughter for mistakenly loading a live round into a revolver Baldwin was using on a Santa Fe, New Mexico, movie set.\n“You turned a safe weapon into a lethal weapon,” Judge Mary Marlowe Sommer told Gutierrez, as she handed down the sentence.\nREAD MORE HERE\nPalmer scores four as Chelsea hit Everton for six\nCole Palmer scored four goals to put Chelsea within touching distance of the Premier League’s top six after a 6-0 win over Everton on April 15.\nThe England international has been a shining light in an otherwise disappointing campaign for the Blues, and moved level with Manchester City striker Erling Haaland’s 20 Premier League goals in the race for the Golden Boot.\nPalmer killed the game as a contest as he completed his hat-trick inside 30 minutes before Nicolas Jackson also struck before half-time.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-april-16-5"}