{"authors": [], "date_download": "2024-10-12 13:44:53", "date_modify": "2024-10-12 13:44:53", "date_publish": "2017-06-02 05:16:18", "description": "ROME (REUTERS) - Italy, France and Germany said on Thursday (June 1) they regretted US President Donald Trump’s decision to withdraw from the Paris climate accord and dismissed his suggestion that the global pact could be revised.  Read more at straitstimes.com.", "filename": "world_europe_france-italy-germany-defend-paris-accord-say-it-cannot-be-renegotiated_1728740693.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2017/06/02/42708259_-_26_05_2017_-_italy_g7_summit.jpg?VersionId=488VJVQsdvHUsueBpZXQvncbB8WZEYFf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_france-italy-germany-defend-paris-accord-say-it-cannot-be-renegotiated_1728740693.html", "title": "France, Italy, Germany defend Paris Accord, say it cannot be renegotiated", "title_page": "France, Italy, Germany defend Paris Accord, say it cannot be renegotiated | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME (REUTERS) - Italy, France and Germany said on Thursday (June 1) they regretted US President Donald Trump's decision to withdraw from the Paris climate accord and dismissed his suggestion that the global pact could be revised.\n\"We deem the momentum generated in Paris in December 2015 irreversible and we firmly believe that the Paris Agreement cannot be renegotiated since it is a vital instrument for our planet, societies and economies,\" the leaders of the three countries said in a rare joint statement.\nItalian Prime Minister Paolo Gentiloni, German Chancellor Angela Merkel and French President Emmanuel Macron urged their allies to speed up efforts to combat climate change and said they would do more to help developing countries adapt.\nThe three leaders tried to convince Trump last week at a Group of Seven summit to stay in the pact and honour US commitments undertaken by the previous administration.\nIn a speech at the White House, Trump said the US would look to renegotiate the agreement and condemned what he called\"draconian\" financial and economic burdens imposed by the deal.\nThe unusual French-Italian-German statement, released barely an hour after Trump announced his decision, underscored the disappointment of the euro zone's three largest economies and their resolve to plough ahead without Washington's support.\n\"We are convinced that the implementation of the Paris Agreement offers substantial economic opportunities for prosperity and growth in our countries and on a global scale,\" the three leaders said.\n\"We therefore reaffirm our strongest commitment to swiftly implement the Paris Agreement, including its climate finance goals and we encourage all our partners to speed up their action to combat climate change.\"\nIn his speech, Trump complained that the Paris Accord required wealthy nations to help developing countries build renewable energy sources. France, Italy and German indicated they were ready to do more to help in the absence of US funds.\n\"We will step up efforts to support developing countries, in particular the poorest and most vulnerable, in achieving their mitigation and adaptation goals,\" the three leaders said.", "url": "https://www.straitstimes.com/world/europe/france-italy-germany-defend-paris-accord-say-it-cannot-be-renegotiated"}