{"authors": [], "date_download": "2024-10-12 13:35:28", "date_modify": "2024-10-12 13:35:28", "date_publish": "2024-08-29 05:01:02", "description": "A selection of news stories that happened overnight, Aug 29, 2024. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-aug-29-5_1728740128.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/FILES-US-VOTE-TRUMP-SECRETSERVICE-165528_0.jpg?VersionId=4BCtfB7N6rnR8X_HduFimZ162AwCm8Ae", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-aug-29-5_1728740128.html", "title": "While You Were Sleeping: 5 stories you might have missed, Aug 29", "title_page": "While You Were Sleeping: 5 stories you might have missed, Aug 29 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Gunman settled on Trump as ‘opportunity’ target, says FBI\nThe gunman who tried to kill Donald Trump mounted a “sustained, detailed effort” to attack a major gathering of some sort before deciding to target the Republican presidential candidate at a Pennsylvania rally in July, FBI officials said on Aug 28.\nFBI officials said Thomas Crooks, 20, searched more than 60 times for information about the Republican presidential candidate and his then-rival, Democratic President Joe Biden, before registering for the Trump rally in early July.\n“We saw... a sustained, detailed effort to plan an attack on some events, meaning he looked at any number of events or targets,” Mr Kevin Rojek, the FBI’s top official in western Pennsylvania, said in a telephone briefing to reporters.\nMr Rojek said Crooks became “hyper focused” on the Trump rally when it was announced in early July “and looked at it as a target of opportunity.”\nREAD MORE HERE\nSpaceX Falcon 9 rocket grounded by FAA after failed landing\nThe US Federal Aviation Administration (FAA) on Aug 28 said SpaceX’s workhorse Falcon 9 rocket has been grounded after failing an attempt to land back on Earth during a routine Starlink mission, forcing the company’s second grounding this year.\nSpaceX’s Falcon 9 successfully launched a batch of Starlink internet satellites into orbit early on the morning of Aug 28.\nThe rocket’s reusable first stage booster then returned to Earth and attempted to land on a sea-faring barge as usual, but toppled into the ocean after a fiery touchdown, a SpaceX live stream showed.\nREAD MORE HERE\nRussia faces ‘difficult fight’ to retake Ukraine-held area\nRussian President Vladimir Putin will mount a counteroffensive to try to retake territory in the Kursk region captured by Ukrainian troops, but Russian forces will encounter “a difficult fight,” deputy CIA director David Cohen said on Aug 28.\nMr Cohen told a national security industry conference that the significance of the Ukrainian incursion, which has overrun some 777 sq km of the Russian province, remained to be seen.\nUkrainian forces crashed through Russia’s western border into the Kursk region on Aug 6 in a surprise offensive that is continuing.\nREAD MORE HERE\nCanada wildfires released more carbon than several countries\nWildfires that swept Canada’s woodlands in 2023 released more greenhouse gases than some of the largest emitting countries, a study found on Aug 28, calling into question national emissions budgets that rely on forests to be carbon stores.\nAt 647 megatonnes, the carbon released in the 2023 wildfires exceeded those of seven of the 10 largest national emitters in 2022, including Germany, Japan and Russia, the study published in the journal Nature found.\nOnly China, India and the United States emitted more carbon emissions during that period, meaning that if Canada’s wildfires were ranked alongside countries, they would have been the world’s fourth largest emitter.\nREAD MORE HERE\nParis Paralympics open in blaze of colour\nThe opening ceremony of the Paris Paralympics got under way on Aug 28 in the centre of the French capital, firing the starting gun on 11 days of intense competition.\nJust as for the opening ceremony of the Olympics on the River Seine in July, it took place away from the main stadium for the first time at a Paralympics.\nIn balmy weather - in contrast to the heavy rain which blighted the opening of the Olympics - the Games opened in Place de la Concorde, in the presence of French President Emmanuel Macron.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-aug-29-5"}