{"authors": ["Raul Dancel"], "date_download": "2024-10-12 13:34:53", "date_modify": "2024-10-12 13:34:53", "date_publish": "2022-10-19 19:32:32", "description": "So far, 108 countries have abolished the death penalty. Only 56 countries still have it in their law books for ordinary crimes. Read more at straitstimes.com.", "filename": "world_countries-and-territories-where-death-is-still-a-penalty_1728740093.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/20/49269725.jpg?VersionId=3z3KWMNiScVufW.DlkzV.4tW67YLzXRh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_countries-and-territories-where-death-is-still-a-penalty_1728740093.html", "title": "Countries and territories where death is still a penalty", "title_page": "Countries and territories where death is still a penalty | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Three recent studies in Singapore about the death penalty show most Singaporeans support it, even as more than two-thirds of the world have already removed it from their penalty toolbox.\nSingapore is among 56 nations and territories that have the death penalty and either carry out executions or have not made any official declarations not to execute, according to Amnesty International.\nIn Asia, the list includes China, Indonesia, Malaysia, Myanmar, Thailand, Vietnam, and the self-governed island of Taiwan.\nIran, Saudi Arabia, Somalia, South Sudan, the Democratic Republic of Congo and the United States are among the most notable nations outside Asia that likewise have death penalty laws and carry out executions.\nThere are 27 other countries that also allow the death penalty, but they have not executed anyone for at least 10 years and have a policy or more formal commitment not to execute.\nCategorised as “abolitionists in practice”, these countries include Brunei, Laos and Russia, says Death Penalty Information Centre, a non-governmental organisation.\nEight countries, meanwhile, have death penalty laws only for serious crimes in exceptional circumstances, such as those committed during times of war. The countries include Brazil, Chile, Guatemala, Israel and Peru.\nSo far, there have been 108 nations that do not allow the use of death penalty by law.\nIn terms of state-sanctioned executions, there were 579 in 2021, according to Amnesty International. That same year, at least 2,000 death sentences were served.\nIran was the biggest executioner, with 314 people executed, followed by Egypt (83), Saudi Arabia (65), Syria (24), Somalia (21) and the US (11). No records were available for China, where data on the death penalty is classified as a state secret.\nIn Saudi Arabia’s largest mass execution in years, 81 men were executed in one day in March.\nMost of these countries use hanging or shooting as their execution methods. China, the US and Vietnam prefer lethal injection, while Saudi Arabia continues to use beheading with a sword.", "url": "https://www.straitstimes.com/world/countries-and-territories-where-death-is-still-a-penalty"}