{"authors": [], "date_download": "2024-10-12 14:01:43", "date_modify": "2024-10-12 14:01:43", "date_publish": "2024-02-24 04:35:41", "description": "Zaporizhzhia Nuclear Power Plant in Ukraine is Europe's largest. Read more at straitstimes.com.", "filename": "world_europe_watchdog-iaea-urges-maximum-restraint-as-explosions-rock-ukraine-nuclear-plant_1728741703.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/24/2024-02-07T133342Z224529213RC2GJ1A7GIMNRTRMADP3UKRAINE-CRISIS-RUSSIA-IAEA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_watchdog-iaea-urges-maximum-restraint-as-explosions-rock-ukraine-nuclear-plant_1728741703.html", "title": "Watchdog IAEA urges 'maximum restraint' as explosions rock Ukraine nuclear plant", "title_page": "Watchdog IAEA urges 'maximum restraint' as explosions rock Ukraine nuclear plant | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VIENNA - UN atomic watchdog chief Rafael Grossi on Feb 23 called for “maximum military restraint” after a string of powerful explosions occurred near Ukraine’s Russian-controlled Zaporizhzhia nuclear plant this week.\nEurope’s biggest nuclear plant has been at the centre of fighting since it was captured by Russian forces in March 2022, and both Moscow and Kyiv have accused each other of compromising its safety.\nExperts from the International Atomic Energy Agency (IAEA) “stationed at the Zaporizhzhia plant reported hearing explosions every day over the past week, including one late last Friday that appeared to occur close to the plant,” Mr Grossi said, in a statement.\nOn Feb 22, there were also several blasts, including an “unusually loud one, indicating very close proximity to the site,” Mr Grossi said.\nThe large blast was part of what plant authorities described as “field training”, but with no shelling of the plant nor any damage to it.\nThis week’s “powerful explosions shook windows” at the Zaporizhzhia plant, which Mr Grossi warned were “underlining the urgent need for maximum military restraint to reduce the danger of a nuclear accident”.\nThe origin or direction of all other blasts – except the Feb 22 large explosion – could not be “conclusively determined”, the statement added.\nMoreover, the IAEA was told that a mine exploded outside the site perimeter on on Feb 22.\n“I remain deeply concerned about the nuclear safety and security situation” at Zaporizhzhia, Mr Grossi said.\n“The reports of our experts indicate possible combat action not far away from the site.”", "url": "https://www.straitstimes.com/world/europe/watchdog-iaea-urges-maximum-restraint-as-explosions-rock-ukraine-nuclear-plant"}