{"authors": [], "date_download": "2024-10-12 13:40:37", "date_modify": "2024-10-12 13:40:37", "date_publish": "2024-09-01 17:19:48", "description": "Hundreds of Israeli security forces have been carrying out raids across the West Bank since Aug 28. Read more at straitstimes.com.", "filename": "world_three-israelis-killed-in-west-bank-shooting-attack_1728740437.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/01/LYNXMPEK800DX-1.jpg?VersionId=70GBMQYiXe7lEp8VhyNqUhLjlqepvEtM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_three-israelis-killed-in-west-bank-shooting-attack_1728740437.html", "title": "3 Israeli policemen killed in West Bank shooting attack", "title_page": "3 Israeli policemen killed in West Bank shooting attack | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM – Three Israelis were killed on Sept 1 when their vehicle came under fire near the city of Hebron in the occupied West Bank, Israeli officials said.\nThe military confirmed the attack in the area of the Idna Tarqumiyah junction, saying security forces were searching for the assailants.\nHundreds of Israeli troops have been carrying out raids across the West Bank since Aug 28 in one of their largest actions in the area in months, which Israel says is aimed at rooting out Islamist militants.\nThe operation has drawn international calls for a halt.\nPrime Minister Benjamin Netanyahu said three policemen in the vehicle were killed in the attack on Sept 1.\n“We are fighting on all fronts against a cruel enemy who wants to murder us all,” Mr Netanyahu said, also referring to six Israeli hostages killed in captivity in Gaza and whose bodies were recovered from a tunnel on Sept 1.\nFinance Minister Bezalel Smotrich, a hardline member of Israel’s security Cabinet, called for more action against Palestinian militants in the West Bank.\n“We need to do now what we didn’t do that awful night and launch a pre-emptive strike and strike terrorism hard,” he said, referring to Hamas’ deadly Oct 7 attack on Israel.\n“We are committed to eliminating terrorism on all fronts,” he said, speaking from the scene of the Sept 1 attack.\nIsrael’s ambulance service initially said two people were killed and a third critically wounded.\nHamas, which is fighting a war with Israel in Gaza, praised the attack in the West Bank but did not claim it, saying it was a “natural response to the massacres and genocide in the Gaza Strip”.\n“We call on all those who carry weapons to direct their bullets at the chests of the occupiers who continue to commit massacres against our people in Gaza,” the statement said. REUTERS", "url": "https://www.straitstimes.com/world/three-israelis-killed-in-west-bank-shooting-attack"}