{"authors": [], "date_download": "2024-10-12 13:35:41", "date_modify": "2024-10-12 13:35:41", "date_publish": "2024-09-18 14:57:08", "description": "Drone footage from Sept 17 showed the Hungarian village of Venek submerged under water. Read more at straitstimes.com.", "filename": "world_europe_more-areas-of-central-europe-race-against-time-as-floods-approach_1728740141.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/18/LYNXMPEK8H05H-1.jpg?VersionId=oSTQPRgxES73QWit32YLME1lBj7kyhU_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_more-areas-of-central-europe-race-against-time-as-floods-approach_1728740141.html", "title": "More areas of Central Europe race against time as floods approach", "title_page": "More areas of Central Europe race against time as floods approach | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WARSAW - Volunteers and emergency personnel worked through the night from Sept 18 to 19 to fortify the Polish city of Wroclaw against approaching flood waters, while Hungary opened a dam as the prime minister warned a “crucial period” was approaching.\nThe worst floods to hit Central Europe in at least two decades have left a trail of destruction from Romania to Poland, spreading mud and debris in towns, destroying bridges, submerging cars and leaving the authorities and householders with a bill for damage that will run into billions of dollars.\n“A lot happened tonight,” Polish Prime Minister Donald Tusk told a crisis meeting in Wroclaw. “We will need urgent information... from those places that received high water.”\nLines of people in Wroclaw passed sandbags to fortify river banks and to protect buildings. The authorities expect waters to peak in Wroclaw on Sept 19.\nThe Polish Defence Ministry said more than 14,000 soldiers had been deployed to flood-hit regions, with the armed forces using helicopters to evacuate people and strengthen flood defences, while drones monitored the situation from above.\nTowns to the south of Wroclaw, such as Lewin Brzeski, have already felt the full force of the floods, forcing residents to wade through the streets in waist-high water or seek refuge on the roofs of the entrances to blocks of flats.\nPolish Finance Minister Andrzej Domanski told the crisis meeting that two billion zlotys (S$674 million) in funds had been secured for dealing with the effects of the floods.\nMr Tusk said there had been reports of soaring prices for many products in flood-hit areas and he did not rule out the introduction of price controls.\nHe also said the government would pay instalments of the mortgages of people whose houses had been flooded for a year.\nPope Francis talked about the “tragic hardships” caused by the floods during his weekly general audience in St Peter’s Square.\nHe said: “I assure everyone of my closeness, praying especially for those who have lost their lives and their families.”\nIn Hungary, the authorities opened a dam in the country's north-west to channel water from the Lajta river into an emergency reservoir, in a bid to protect the city of Mosonmagyarovar.\nThe water was allowed to flow onto agricultural land.\nIn the capital Budapest, the Danube is still expected to peak around or slightly above 8.5m, likely on Sept 20 or 21.\n“Due to heavy rains and floods, the situation is critical all across Central Europe,” Hungarian Prime Minister Viktor Orban said in a post on social media platform X late on Sept 17.\n“According to the latest forecasts, the crucial period for Hungary will begin tomorrow, so flood protection is going full steam ahead.”\nDrone footage from Sept 17 showed the Hungarian village of Venek, near Gyor in the north of the country, submerged underwater.\n“I think it’s kind of connected to the climate change because it’s a sudden flood,” said 51-year-old local resident Georg Bercsanyi.\n“It was raining for four days in the area, especially around Vienna in Austria. So that’s why we have this high water level now.”\nIn the Czech Republic, water levels were mostly receding, but rivers were still peaking in some parts of southern Bohemia.\nFinance Minister Zbynek Stanjura said on Sept 17 that he would like Parliament to approve an amendment to the budget to make room for flood relief, even though the cost of the damage is still not known. Mr Stanjura said it could perhaps be in the order of US$4 billion (S$5.2 billion).\nMayors of some Czech towns in the Opava river area demanded that this weekend’s elections for regional assemblies and one-third of the Upper House of Parliament be postponed due to a lack of power and flooding of polling stations.\nHowever, the government has decided to carry on with the vote, saying that makeshift voting stations and other improvised solutions would be used. REUTERS", "url": "https://www.straitstimes.com/world/europe/more-areas-of-central-europe-race-against-time-as-floods-approach"}