{"authors": [], "date_download": "2024-10-12 13:35:03", "date_modify": "2024-10-12 13:35:03", "date_publish": "2024-09-21 23:42:50", "description": "US National Security Adviser Jake Sullivan said the risk of further escalation is \"acute\". Read more at straitstimes.com.", "filename": "world_sullivan-expresses-worry-over-escalating-israel-lebanon-tension-calls-hezbollah-strike-as-justice-served_1728740103.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/22/11617468.jpg?VersionId=MioAS5dhQ3Efa8ywEKYQ.ur4cj.hbYvL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_sullivan-expresses-worry-over-escalating-israel-lebanon-tension-calls-hezbollah-strike-as-justice-served_1728740103.html", "title": "US’ Sullivan worried about escalating Israel-Lebanon tension, says Hezbollah strike is justice served", "title_page": "US’ Sullivan worried about escalating Israel-Lebanon tension, says Hezbollah strike is justice served | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WILMINGTON, Delaware - US National Security Adviser Jake Sullivan on Sept 21 said he was worried about escalation between Israel and Lebanon but that the Israeli killing of a top Hezbollah leader brought justice to the Iran-backed group.\nMr Sullivan, speaking with reporters in Wilmington, Delaware, said he still sees a path to a ceasefire in Gaza but that the US is “not at a point right now where we’re prepared to put something on the table”.\nMr Sullivan said the US is continuing to work with Qatar and Egypt as the two countries talk to Hamas, but that Washington, as it talks to Israel, is not in a position to propose a deal that could be accepted by both parties.\n“Could that change over the course of the coming days? It could,” Mr Sullivan said.\nHezbollah overnight said 16 of its members including senior leader Ibrahim Aqil and another top commander, Ahmed Wahbi, were among the 37 people that Lebanon’s Health Ministry said were killed in an Israeli air strike in a Beirut suburb on Sept 20.\nThe Israeli air strike, which the Lebanese Health Ministry said killed three children and seven women, was the deadliest in its conflict with Hezbollah since Oct 8, when the group began firing rockets into Israel in sympathy with Palestinians in the nearly year-old Israeli war against Hamas in Gaza.\nMr Sullivan said the Sept 20 strike served justice to Aqil, who was wanted by the US for two 1983 Beirut truck bombings that killed more than 300 people at the American embassy and a US Marines barracks.\n\"Any time a terrorist who has murdered Americans is brought to justice, we believe that that is a good outcome.”\nMr Sullivan said the risk of further escalation is “acute”, following the Israeli strike as well as the detonation of pagers and walkie-talkies across Lebanon in September that killed at least 39 and injured roughly 3,000.\nThose attacks were widely believed to have been carried out by Israel, which has neither confirmed nor denied its involvement.\n“While the risk of escalation is real, we actually believe there is also a distinct avenue to getting to a cessation of hostilities and a durable solution that makes people on both sides of the border feel secure,” Mr Sullivan said.", "url": "https://www.straitstimes.com/world/sullivan-expresses-worry-over-escalating-israel-lebanon-tension-calls-hezbollah-strike-as-justice-served"}