{"authors": [], "date_download": "2024-10-12 13:35:49", "date_modify": "2024-10-12 13:35:49", "date_publish": "2023-10-23 00:46:39", "description": "Gun licences generally require applicants to have served in the Israeli military. Read more at straitstimes.com.", "filename": "world_middle-east_fearing-internal-strife-from-gaza-war-israel-arms-civilian-security-squads_1728740149.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/23/LYNXMPEJ9L06U-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_fearing-internal-strife-from-gaza-war-israel-arms-civilian-security-squads_1728740149.html", "title": "Fearing internal strife from Gaza war, Israel arms civilian security squads", "title_page": "Fearing internal strife from Gaza war, Israel arms civilian security squads | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM – Israel has set up hundreds of volunteer security squads in the two weeks since the Gaza war erupted and is arming them should there be knock-on Israeli-Arab unrest, the authorities said on Sunday, despite what police said was “exemplary” conduct so far.\nThe last Gaza war in 2021 saw sometimes violent pro-Palestinian protests among the Arab citizens who make up 21 per cent of Israel’s population.\nTriggered by an Oct 7 attack by Hamas gunmen, the current war – and escalations of hostilities on the Lebanese border and in the occupied West Bank – have stirred worries about Israel’s already frayed internal ethnic relations.\nIsraeli police have arrested dozens of Arab citizens on suspicion of incitement and support for Hamas, based on social media posts.\nSome lawyers for those arrested have described the measures as unlawful and designed to stifle dissent at the war.\nThe police chief, Inspector-General Kobi Shabtai, said such monitoring enabled officers to pre-empt any eruptions of violence.\n“There has been exemplary conduct here,” he told a parliamentary review panel, “and almost zero incidents, with all those pinpoint events being dealt with at the local level and with less media resonance”.\n“There is dialogue with the (Arab) leadership and in parallel we are poised and ready for any scenario.”\nNational Security Minister Itamar Ben-Gvir has predicted that this war could see a repeat of the 2021 unrest.\nHe has ordered an easing of regulations for issuing gun licences to private citizens.\nThese generally require applicants to have served in the Israeli military, from which most Arabs are exempt.\nAn additional measure has been the setting up of volunteer security squads to patrol the streets and back up police. Insp-Gen Shabtai said 527 such squads have been created since Oct 7.\nMr Eliezer Rosenbaum, deputy director-minister of Mr Ben-Gvir’s ministry, told lawmakers that 20,000 firearms had been ordered for distribution to such squads, with another 20,000 to follow.\nHe said volunteers would also be issued with flak jackets and helmets.\nHe did not elaborate on the kind of firearms involved.\nMr Ben-Gvir has posted online video footage of himself handing out M-16 or M-4 assault rifles.\nMs Naella Gelkopf-Belais, a social activist from the mixed Israeli-Arab city of Haifa, said police should work with the civic authorities and be wary of “the creation of private militias”.\n“We in the city are on a tinderbox,” she said.\nInsp-Gen Shabtai said security squads would be subordinate to police.\n“It is good that there will be a lot of security squads and force, but caution must be exercised with this,” he said. “What is permitted and what is forbidden must be understood, and care must be taken that no finger is too light on the trigger.” REUTERS", "url": "https://www.straitstimes.com/world/middle-east/fearing-internal-strife-from-gaza-war-israel-arms-civilian-security-squads"}