{"authors": [], "date_download": "2024-10-12 14:03:30", "date_modify": "2024-10-12 14:03:30", "date_publish": "2024-07-03 19:25:10", "description": "MOSCOW - Russia will respond to Finland's decision to grant the United States access to its military bases, a spokesman for Russia's foreign ministry said on Wednesday. Read more at straitstimes.com.", "filename": "world_europe_russia-says-it-will-respond-to-finland-giving-us-access-to-bases_1728741810.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/03/ST-logo-placeholder_14.jpg?VersionId=QhsgD7O6AH3HjyHv0pyRLLr3afdikwV3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-says-it-will-respond-to-finland-giving-us-access-to-bases_1728741810.html", "title": "Russia says it will respond to Finland giving US access to bases", "title_page": "Russia says it will respond to Finland giving US access to bases | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russia will respond to Finland's decision to grant the United States access to its military bases, a spokesman for Russia's foreign ministry said on Wednesday.\n\"I can only confirm that Russia will not leave unanswered the NATO military build-up on our border, which threatens the security of the Russian Federation,\" Deputy Spokesman Andrei Nastasin said.\n\"We will also take the necessary measures, including of a military-technical nature, to counter aggressive decisions by Finland, as well as its NATO allies,\" he added.\nThe Finnish parliament on Monday approved a defence cooperation agreement with the United States that was signed in December, 2023.\nThe agreement opens 15 Finnish military facilities for potential use by the United States. Finland became a NATO member in 2023. REUTERS", "url": "https://www.straitstimes.com/world/europe/russia-says-it-will-respond-to-finland-giving-us-access-to-bases"}