{"authors": [], "date_download": "2024-10-12 13:37:08", "date_modify": "2024-10-12 13:37:08", "date_publish": "2024-08-21 20:27:38", "description": "Israel says its jets hit around 30 targets throughout the Gaza Strip, including tunnels, launch sites and an observation post. Read more at straitstimes.com.", "filename": "world_middle-east_israeli-strikes-kill-dozens-in-gaza-after-blinken-ends-visit-with-truce-deal-still-elusive_1728740228.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/22/LYNXMPEK7K0LI-1.jpg?VersionId=m0GU9tRPUT9v9C1Gzsd0AOywtmn05Dmm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israeli-strikes-kill-dozens-in-gaza-after-blinken-ends-visit-with-truce-deal-still-elusive_1728740228.html", "title": "Israeli strikes kill dozens in Gaza after Blinken ends visit without breakthrough", "title_page": "Israeli strikes kill dozens in Gaza after Blinken ends visit without breakthrough | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CAIRO/JERUSALEM - Israeli airstrikes across Gaza killed at least 50 Palestinians in the previous 24 hours, Palestinian health officials said on Aug 20, after US Secretary of State Antony Blinken ended his latest visit to the region with a truce deal still proving elusive.\nAs last-ditch diplomatic efforts aimed at halting the 10-month-old war between Israel and Hamas continued, the Israeli military said jets hit around 30 targets throughout the Gaza Strip including tunnels, launch sites and an observation post.\nIt said troops killed dozens of armed fighters and seized weapons including explosives, grenades and automatic rifles.\nLater in the day, the Israeli military struck a school and a nearby house in Gaza City, killing at least four people and wounding 15, including several children, the territory's Civil Emergency Service said.\nThe military said in a statement that it had hit Hamas militants operating at a command centre located inside a compound that had previously served as a school.\nIt accused Hamas of continuing to operate from within civilian facilities and areas, an allegation Gaza's dominant Islamist militant group denies.\nCommenting on the attack on the UN-run school, the head of the UN's Palestinian refugee agency, Philippe Lazzarini, wrote on X that \"Children reported killed and injured. Some were burnt to death.\"\n\"Gaza is no place for children anymore. They are the first casualty of this merciless war. We can't let the unbearable become a new norm. Enough. A ceasefire is beyond overdue,\" Mr Lazzarini wrote.\nIn the town of Bani Suhaila, near Khan Younis in the southern Gaza Strip, an Israeli airstrike killed seven Palestinians at a tent encampment for displaced people, medics said.\nThe military issued new evacuation orders in the heavily overcrowded area of Deir Al-Balah, in central Gaza, where hundreds of thousands of Palestinians displaced by the fighting have sought shelter.\nThe orders, which the military said were needed to clear civilians from what had become \"a dangerous combat zone\", were soon followed by tank fire with at least one person killed and several wounded by machine gun fire, medics and residents said.\nThe conflict churned on as Mr Blinken wound up his ninth troubleshooting visit to the Middle East since the Gaza war erupted last October, with still no sign that the big differences between the sides over how to end the war could be bridged.\nMr Blinken's talks with leaders of ceasefire mediators Egypt and Qatar, as well as in Israel, focused on the fate of tiny, crowded Gaza, where Israel's military campaign has killed more than 40,000 people since October according to Palestinian health authorities, and of the remaining hostages being held there.\nThe war began on Oct 7 2023, when Hamas gunmen stormed into Israeli communities and military bases, killing around 1,200 people and abducting about 250 hostages, according to Israeli tallies.\nFor displaced people left exposed in Deir Al-Balah, the lack of progress towards a ceasefire compounded the misery as they searched for space away from the fighting.\n\"Where will we go? Where will we go?\" said Aburakan, 55, a displaced person from Gaza City in the territory's north who has had to change refuge five times since October.\n\"We feel they are closing in. I live a few hundred meters from the threatened areas, and I have been searching since the early morning in vain for a space in western Deir Al-Balah, Khan Younis, or Nuseirat,\" he told Reuters, via a chat app.\n\"Unfortunately, we may die before we see an end to this war. All ceasefire talk is a lie.\"\nMost of Gaza's 2.3 million population has been displaced multiple times since the start of the Israeli campaign, launched after the Hamas-led attack on Israel. Even in areas designated safe zones there have been regular reports of casualties from Israeli strikes. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/israeli-strikes-kill-dozens-in-gaza-after-blinken-ends-visit-with-truce-deal-still-elusive"}