{"authors": [], "date_download": "2024-10-12 14:00:32", "date_modify": "2024-10-12 14:00:32", "date_publish": "2024-06-28 23:07:39", "description": "This comes after months of acute shortages. Read more at straitstimes.com.", "filename": "world_europe_ukraine-forces-see-sharp-increase-in-western-ammo-supplies_1728741632.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/2024-06-28T140434Z1176384403RC2QJ8AUVCSHRTRMADP3UKRAINE-CRISIS-CHASIV-YAR.JPG?VersionId=Ua_L3idC1nvUWIRAzsyXGfNrsdijOFu_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-forces-see-sharp-increase-in-western-ammo-supplies_1728741632.html", "title": "Ukraine forces see sharp increase in Western ammo supplies", "title_page": "Ukraine forces see sharp increase in Western ammo supplies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – After months of acute shortages, sources in Ukraine’s armed forces on June 28 told AFP that supplies of Western ammunition are increasing sharply.\nThe general staff of Ukraine’s armed forces and members of three brigades serving in the Donetsk region in eastern Ukraine said they had noticed a recent change compared with the start of 2024.\n“It’s become better over the past month, and it keeps getting better, at least for 155mm calibre artillery shells,” a Ukrainian sergeant using the call sign “Luntik” – a type of military nickname – told AFP.\nHe said that in the first quarter of the year, ammunition in his unit had been strictly rationed to “six shells every 24 hours” while the limit today was “up to 40 per day”.\nIn areas such as the Kharkiv region, where Russia launched a land offensive in May, he said “there is no limit”.\nIn Kharkiv, “the occupier has failed”, President Volodymyr Zelensky said on June 28, while admitting the situation remained difficult.\n“Our Ukrainian forces have stabilised the situation and stopped the offensive,” he said.\nThe outnumbered Ukrainian army has been heavily reliant on Western supplies against its better armed enemy.\nUkrainian forces have been particularly vulnerable since the end of 2023 because of major delays in European and US arms deliveries.\nThe US Congress in April voted through a US$61 billion (S$82.7 billion) aid package for Ukraine, but deliveries to the front line can take weeks or even months.\nNew supplies have still not brought levels back to those of 2023 “but it seems we should reach the same level soon”, the sergeant said.\nAn artillery serviceman in a different brigade in the same region said: “It has become a lot better.”\nBut another soldier in a third brigade said: “Unfortunately, the enemy still has an advantage in terms of personnel and artillery systems.\n“For a war of this intensity, we will need more and more.”\nLuntik said even when Ukrainian forces destroy Russian artillery systems, “they are replaced the next day”.\nAccording to a source at the general staff, the ratio between Ukrainian shelling and Russian shelling has moved in Kyiv’s favour thanks to the arrival of new Western supplies.\n“At the moment, the ratio of use of ammunition is one to three” in Russia’s favour, compared with “one to seven” before.\n“Our supplies have gone up and theirs have gone down,” he said. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-forces-see-sharp-increase-in-western-ammo-supplies"}