{"authors": [], "date_download": "2024-10-12 13:27:33", "date_modify": "2024-10-12 13:27:33", "date_publish": "2024-09-17 21:40:00", "description": "Since May, abortion has been illegal in Florida beyond six weeks of pregnancy. Read more at straitstimes.com.", "filename": "world_florida-s-abortion-restrictions-endanger-patients-report_1728739653.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/FILES-US-ABORTION-FLORIDA-POLITICS-130949.jpg?VersionId=HNoZ.zR8fsmYt.t1Ou3B88R1ZymAOjC4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_florida-s-abortion-restrictions-endanger-patients-report_1728739653.html", "title": "Florida’s abortion restrictions endanger patients: Report", "title_page": "Florida’s abortion restrictions endanger patients: Report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Abortion restrictions in Florida have led to care being delayed or denied outright in complicated pregnancies, according to a report issued on Sept 17.\nThe report, published by the non-profit NGO Physicians for Human Rights, asserts Florida’s abortion restrictions “endanger both clinicians and pregnant patients in the state”.\nSince May, abortion has been illegal in Florida beyond six weeks of pregnancy, which is before many women know they are pregnant.\nMedical practitioners who go against the law face up to five years in prison, as well as high fines and risking their medical licence.\nThe ban was instituted in the aftermath of the US Supreme Court overturning Roe v Wade in 2022, which gave federal protections to abortion.\nNow, 22 states have imposed some type of restriction or ban on the procedure, though some are putting those restrictions up to a vote, like in Florida.\nResidents of the Sunshine State will vote in November whether to add an amendment to the state constitution which would protect abortion rights until foetal viability – the same standard as under Roe v Wade.\nThe new report, which was published based on interviews with 25 healthcare professionals – including gynaecologists, obstetricians, midwives and others – comes on the heels of a ProPublica article detailing the death of a Georgia woman who did not receive timely care after suffering severe complications from abortion medication.\nExceptions?\nFlorida’s abortion ban allows for a few exceptions, such as in cases of rape or incest, danger to the mother’s life or irreversible impairment of “a major bodily function”, and “fatal” abnormalities of the foetus.\nHowever, the report argues that the law poorly defines the exceptions – leading to delays or even refusal of care.\nFor instance, the state defines fatal foetal abnormalities as “a terminal condition” that is “incompatible with life outside the womb and will result in death upon birth or imminently thereafter.”\nOne practitioner interviewed for the report told a story of a patient who had two children die at four months of age due to a rare genetic disease.\nWhen her next pregnancy was diagnosed with the same disease, the patient wanted an abortion, but “nobody felt comfortable saying that this is lethal immediately post-delivery”.\nThe patient ended up travelling out of state for an abortion, with the report noting that not all patients have this option.\n‘What is right’\nSimilar dilemmas arise when doctors try to determine what qualifies for an exception with a pregnancy that threatens the mother’s life.\nOne doctor reported he had to defend the necessity of an abortion to several hospital officials when a patient had an estimated 10 per cent risk of death if she continued her pregnancy.\n“I had to hear these people say, ‘Well, is 10 per cent a lot? Is that enough?’” recounted the doctor, who was eventually allowed to perform the abortion – weeks later.\nThe report also said restricting abortion has led to delayed mismanagement of miscarriages out of fear they will be treated as abortions.\nDoctors who don’t want to risk legal issues end up passing on treatment, lengthening wait times that could lead to complications.\n“It is a hard situation to be in just trying to do what is legal but also do what is right,” said one medical professional. AFP", "url": "https://www.straitstimes.com/world/florida-s-abortion-restrictions-endanger-patients-report"}