{"authors": [], "date_download": "2024-10-12 14:16:51", "date_modify": "2024-10-12 14:16:51", "date_publish": "2022-03-13 02:37:12", "description": "It brings total US security aid provided to Ukraine to US$1.2 billion since January 2021. Read more at straitstimes.com.", "filename": "world_europe_biden-authorises-us200-million-in-new-weapons-military-training-for-ukraine_1728742611.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/WLu7SOTZ1fjw62amHSELO2yGxnXlWhmH_uXeqHrET94.jpg?VersionId=GBA7vMuBOTJsBz4NHtqkAkcMWVaU2JzT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_biden-authorises-us200-million-in-new-weapons-military-training-for-ukraine_1728742611.html", "title": "Biden authorises US$200 million in new weapons, military training for Ukraine", "title_page": "Biden authorises US$200 million in new weapons, military training for Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - The United States on Saturday (March 12) said it would rush up to US$200 million (S$270 million) in additional small arms, anti-tank and anti-aircraft weapons to Ukraine, as Ukrainian officials pleaded for more equipment to defend against heavy shelling by Russian forces.\nUS President Joe Biden on Saturday authorised the additional security assistance, the White House said, paving the way for the “immediate” shipment of fresh military equipment to Ukraine, a senior administration official said.\nBiden’s decision brings total US security aid provided to Ukraine to US$1.2 billion since January 2021, and to US$3.2 billion since 2014, when Russia annexed the Crimea region of Ukraine, according to senior administration officials.\nIn a memorandum to Secretary of State Antony Blinken, Biden directed that up to US$200 million allocated through the Foreign Assistance Act be designated for Ukraine’s defence.\nThe funds can be used for weapons and other articles from the Defence Department’s stock, as well as military education and training to help Ukraine against the Russian invasion, now in its third week.\n“It will provide immediate military assistance to Ukraine, including anti-armour, anti-aircraft systems, and small arms in support of Ukraine’s front-line defenders,” one of the officials said, speaking on condition of anonymity.\nThe Pentagon declined to comment, referring queries to the White House and State Department.\nUkraine has been asking for more Javelin anti-tank weapons and Stinger missiles to shoot down aircraft.\nUkraine’s foreign minister, Dmytro Kuleba, on Saturday underscored Ukraine’s need for additional military supplies in an interview with the non-profit Renew Democracy Initiative.\nThe United States has drawn from US weapons stocks to supply Ukraine repeatedly, beginning in the fall of 2021 and then again in December and February.\nThe last batch of weapons provided by the United States in February included anti-armor, small arms, body armour and various munitions, according to the Pentagon, as well as anti-aircraft systems.\nOn Thursday night the US Congress approved US$13.6 billion in emergency aid for Ukraine as part of a US$1.5 trillion measure to fund the US government through September.", "url": "https://www.straitstimes.com/world/europe/biden-authorises-us200-million-in-new-weapons-military-training-for-ukraine"}