{"authors": [], "date_download": "2024-10-12 14:10:08", "date_modify": "2024-10-12 14:10:08", "date_publish": "2019-01-13 21:50:41", "description": "DOHA (AFP) - US Secretary of State Mike Pompeo said on Sunday (Jan 13) he will ask Saudi Crown Prince Mohammed bin Salman to ensure the killers of journalist Jamal Khashoggi are held accountable for their crime. Read more at straitstimes.com.", "filename": "world_middle-east_saudi-arabia-must-hold-khashoggis-killers-accountable-pompeo_1728742208.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/01/13/yq-mikepompeo-13012019.jpg?VersionId=zKvGTW6qZEIQ_F0NrQqoPvHXhxzCwrVb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_saudi-arabia-must-hold-khashoggis-killers-accountable-pompeo_1728742208.html", "title": "Saudi Arabia must hold Khashoggi's killers accountable: Pompeo", "title_page": "Saudi Arabia must hold Khashoggi's killers accountable: Pompeo | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA (AFP) - US Secretary of State Mike Pompeo said on Sunday (Jan 13) he will ask Saudi Crown Prince Mohammed bin Salman to ensure the killers of journalist Jamal Khashoggi are held accountable for their crime.\nThe top US diplomat, on an extensive Middle East tour, spoke ahead of a politically sensitive visit to Saudi Arabia, which has faced intense international scrutiny over Mr Khashoggi's murder inside its Istanbul consulate.\n\"We will continue to have a conversation with the crown prince and the Saudis about ensuring the accountability is full and complete with respect to the unacceptable murder of Jamal Khashoggi,\" Mr Pompeo told reporters at a press conference in Qatar.\n\"So, we'll continue to talk about that and make sure we have all the facts so that they are held accountable, certainly by the Saudis but by the United States as well.\"\nMr Pompeo is due to travel to Saudi Arabia later on Sunday as part of an eight-day trip to Amman, Cairo, Manama, Abu Dhabi, Doha, Riyadh, Muscat, and finally Kuwait City.\nHe was speaking to journalists in Doha after meeting his Qatari counterpart, Sheikh Mohammed bin Abdulrahman al-Thani.\nHe will meet the Qatari emir, Sheikh Tamim bin Hamad al-Thani, before heading to Saudi Arabia.\nSMILES WITH MBS\nMr Khashoggi was killed on Oct 2 in a case which stunned the world and threatened a serious rift between Riyadh and Washington.\nThe journalist was murdered and his corpse dismembered inside the kingdom's Istanbul consulate.\nEvidence subsequently emerged that the killing was done by a team of Saudis sent from Riyadh and closely linked to the crown prince. Washington subsequently demanded a transparent investigation.\nRiyadh prosecutors have announced indictments against 11 people, and are seeking the death penalty against five of them.\nBut Prince Mohammed, whose right-hand aides were allegedly involved in the murder, was exonerated by prosecutors despite US intelligence reportedly having evidence that he was behind it.\nOn a previous visit to Riyadh at the height of the Khashoggi affair, Mr Pompeo's broad smiles with the crown prince outraged some Americans.\nHowever, US President Donald President Trump has said Washington wants to preserve the alliance with the kingdom, although the US Senate has clearly blamed Prince Mohammed for the murder.\nWashington is eager for regional unity to gain widespread support its fight against Iran.\nMr Pompeo refused on Sunday to comment on reports that Washington had recently considered military action against Teheran.\nGULF CRISIS\nHe also called on Qatar and other Gulf countries to end the worst political rift in the region for years, which has seen Doha diplomatically and economically isolated by neighbouring former allies for the past 19 months.\nSaudi Arabia, the UAE, Bahrain and Egypt - all US allies - cut ties with Qatar in June 2017, accusing it of supporting terrorist groups and seeking closer ties to Saudi arch-rival Iran.\nQatar - also a US ally - denies the allegations and accuses the countries of seeking regime change.\n\"As for the GCC... we are all more powerful when we're working together when we have common challenges in the region and around the world,\" Pompeo said, referring to the six member nations of the Gulf Cooperation Council.\n\"Disputes between countries that have a shared objective are never helpful.\n\"We're hopeful that unity in the GCC will increase in the days and weeks and months ahead.\" He added that \"President Trump and I both believe the ongoing dispute in the region has gone on too long\".\nWashington, which at first appeared to back the boycott of Qatar, has so far been unsuccessful in trying to end the dispute.\nAttempts at mediation have stalled, as highlighted by the recent resignation of US envoy Anthony Zinni.\n\"It was time for change and he made his decision to move on but America's commitment remains unchanged,\" said Mr Pompeo of Mr Zinni.\nFor Washington, turning the page on the crisis is essential for the successful launch of the Strategic Alliance of the Middle East (MESA), which is a Nato-style security pact that includes Gulf countries as well as Egypt and Jordan.\nThe US and Qatar held the second \"strategic dialogue\" between the two countries on Sunday, and signed agreements on defence, education and culture.\n\"This reflects the good and historical relationship between the two countries,\" said the Qatari foreign minister.", "url": "https://www.straitstimes.com/world/middle-east/saudi-arabia-must-hold-khashoggis-killers-accountable-pompeo"}