{"authors": [], "date_download": "2024-10-12 14:19:00", "date_modify": "2024-10-12 14:19:00", "date_publish": "2023-12-15 01:17:32", "description": "Russia also launched missiles on the western Khmelnystkyi region, home to the Starokostiantyniv air base. Read more at straitstimes.com.", "filename": "world_europe_no-casualties-damage-after-russian-missile-attack-on-kyiv-region-governor-says_1728742740.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/15/LYNXMPEJBD0Q8-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_no-casualties-damage-after-russian-missile-attack-on-kyiv-region-governor-says_1728742740.html", "title": "Russian missiles strike central Ukraine targets, Ukraine air force says", "title_page": "Russian missiles strike central Ukraine targets, Ukraine air force says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine’s Air Force said Russian MiG-31K fighter jets carrying Kinzhal hypersonic missiles struck targets in central Ukraine just 10 minutes after their take-off from Savasleyka airbase sparked a national alert on Dec 14.\nThe Air Force said it shot down one Kinzhal missile over Kyiv region, while another two hit the Starokostiantyniv district, the location of an air base in the Khmelnytskyi region west of Kyiv that has been repeatedly attacked during the 21-month-old war.\nKyiv regional governor Ruslan Kravchenko said no casualties were reported, nor damage to critical and civilian infrastructure, after explosions were heard by a Reuters correspondent near the capital.\nThe Air Force said on the Telegram messaging app that Russian forces used three Kinzhals launched from three fighter jets in Russia’s central Tula region, and that its anti-aircraft missile unit shot down one of the missiles in the Kyiv region.\n“Of course, we do not comment on the consequences of hits/non-hits by enemy missiles in the Khmelnytskyi region,” it added.\nLocal authorities said earlier that emergency services were working at the two crash sites, but no injuries or damage were recorded.\nOvernight, Russia launched 42 drones and 6 missiles at Ukraine, with 11 people injured and buildings and warehouses damaged by falling debris. The Ukrainian military said it destroyed 41 drones. REUTERS", "url": "https://www.straitstimes.com/world/europe/no-casualties-damage-after-russian-missile-attack-on-kyiv-region-governor-says"}