{"authors": [], "date_download": "2024-10-12 14:01:37", "date_modify": "2024-10-12 14:01:37", "date_publish": "2023-06-02 18:53:00", "description": "Washington would also encourage initiatives by other countries to end the conflict, he said. Read more at straitstimes.com.", "filename": "world_united-states_us-seeks-just-and-lasting-peace-for-ukraine-blinken-says_1728741697.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/03/FINLAND-US-POLITICS-DIPLOMACY-095411.jpg?VersionId=SwWs86VC2k9InobuGoO8nEhe.AF8Hnhf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-seeks-just-and-lasting-peace-for-ukraine-blinken-says_1728741697.html", "title": "US seeks 'just and lasting peace' for Ukraine, Blinken says", "title_page": "US seeks 'just and lasting peace' for Ukraine, Blinken says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HELSINKI/WASHINGTON - The United States is working with Ukraine and other allies to build consensus around the core elements of a “just and lasting peace” to end the war with Russia, US Secretary of State Antony Blinken said on Friday.\nWashington would also encourage initiatives by other countries to end the conflict, as long as they upheld the United Nations Charter and Ukraine’s sovereignty, territorial integrity and independence, he said in a speech.\n“We will support efforts – whether by Brazil, China, or any other nation – if they help find a way to a just and lasting peace,” Mr Blinken added.\nStill, Washington would continue to support Ukraine militarily as the pre-requisite for meaningful diplomacy is that Kyiv is capable of deterring and defending against any future aggression.\n“Putin’s war of aggression against Ukraine has been a strategic failure,” Mr Blinken said, referring to Russian President Vladimir Putin.\nSpeaking in Finland, the newest member of the Nato alliance, Mr Blinken said the US would help build a “Ukrainian military of the future”.\nThat meant “a modern air force, integrated air and missile defence, advanced tanks and armoured vehicles, the national capacity to produce ammunition, and the training and support to keep forces and equipment combat ready”.\nThe top US diplomat has been visiting Finland, Norway and Sweden this week.\nThe Nordic region has become strategically more important, with previously non-aligned Finland joining the Western military alliance and Sweden seeking to join it too. REUTERS", "url": "https://www.straitstimes.com/world/united-states/us-seeks-just-and-lasting-peace-for-ukraine-blinken-says"}