{"authors": [], "date_download": "2024-10-12 14:08:48", "date_modify": "2024-10-12 14:08:48", "date_publish": "2022-06-03 05:26:28", "description": "Avowed white supremacist Payton Gendron is accused of killing 10 people at a supermarket on May 14. Read more at straitstimes.com.", "filename": "world_united-states_suspect-in-buffalo-mass-shooting-pleads-not-guilty-to-25-counts_1728742128.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/03/2022-06-02T150952Z_974312972_RC2EAU9W4G8H_RTRMADP_3_NEW-YORK-SHOOTING.JPG?VersionId=ce2.tRedHnkgu6.DvHfkYJVq8xwdtY.d", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_suspect-in-buffalo-mass-shooting-pleads-not-guilty-to-25-counts_1728742128.html", "title": "Suspect in Buffalo mass shooting pleads not guilty to 25 counts", "title_page": "Suspect in Buffalo mass shooting pleads not guilty to 25 counts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK (REUTERS) - The avowed white supremacist accused of a racist attack that killed 10 people at a supermarket in a Black neighbourhood in Buffalo, New York, pleaded not guilty on Thursday (June 2) to 25 counts in an indictment returned by a grand jury, court documents showed.\nThe accused shooter, Payton Gendron, appeared in court for an arraignment hearing in front of Erie County Court Judge Susan Eagan, who ordered the 18-year-old to be held without bond, local media reported.\nHe is due back in court on July 7.\nGendron was targeting Black people, authorities said, when he drove three hours from his home near Binghamton, New York, and shot 13 people with a semi-automatic, assault-style rifle at a Tops store in Buffalo, killing 10 in the May 14 attack.\nA grand jury returned an 25-count indictment on Wednesday.\nThe indictment's first count - domestic terrorism motivated by hate - accuses Gendron of carrying out the attack \"because of the perceived race and/or colour of such person or persons\" injured and killed. The charge carries a penalty of life imprisonment without parole.\nGendron is the first defendant to face a charge based on New York's domestic terrorism hate crime law, Erie County District Attorney John Flynn said at a briefing after the arraignment.\nThe law was proposed after a mass shooting targeting Mexicans at a Walmart store in El Paso, Texas, and took effect Nov 1, 2020.\nGendron also faces 10 counts of first-degree murder and 10 counts of second-degree murder, all of them as hate crimes. The grand jury, which decides whether sufficient evidence exists to bring a defendant to trial, also returned three counts of attempted murder as hate crimes and a single count of illegal possession of a weapon.\n\"When you hear the phrase, throw the book at someone... Well, in this case, right here, the defendant just got 'War and Peace',\" Flynn said, referring to the 1,200-page novel by Leo Tolstoy.", "url": "https://www.straitstimes.com/world/united-states/suspect-in-buffalo-mass-shooting-pleads-not-guilty-to-25-counts"}