{"authors": [], "date_download": "2024-10-12 13:42:23", "date_modify": "2024-10-12 13:42:23", "date_publish": "2024-06-28 20:48:32", "description": "ANKARA - Turkish President Tayyip Erdogan said on Friday he did not rule out a possible meeting with Syrian President Bashar al-Assad to help restore bilateral relations between the neighbours. Read more at straitstimes.com.", "filename": "world_europe_turkeys-erdogan-does-not-rule-out-meeting-syrias-assad-to-restore-ties_1728740543.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/LYNXMPEK5R0HJ-1.jpg?VersionId=..OPbp4ens5RDTCJ2iLkpXKpH9c5pY5F", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_turkeys-erdogan-does-not-rule-out-meeting-syrias-assad-to-restore-ties_1728740543.html", "title": "Turkey's Erdogan does not rule out meeting Syria's Assad to restore ties", "title_page": "Turkey's Erdogan does not rule out meeting Syria's Assad to restore ties | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANKARA - Turkish President Tayyip Erdogan said on Friday he did not rule out a possible meeting with Syrian President Bashar al-Assad to help restore bilateral relations between the neighbours.\nTurkey severed ties with Syria after the 2011 Syrian civil war and supported rebels looking to oust Assad.\nIt has carried out several cross-border military operations against militants it says threaten its national security and formed a \"safe zone\" in northern Syria where Turkish troops are now stationed.\nHowever, amid a regional charm offensive aimed predominantly at normalising ties with Gulf countries, Turkey has also said it may restore ties with Damascus if there is progress on the fight against terrorism, on the safe and voluntary return of millions of refugees hosted by Turkey, and on the political process.\nAsked by reporters about Assad's reported comments that his government was open to normalisation initiatives as long as they respected Syria's sovereignty and contributed to counter-terrorism, Erdogan said Ankara and Damascus could act to restore ties.\n\"There is no reason for it not to happen,\" Erdogan said, and added Turkey had no intention of interfering in Syria's internal affairs.\n\"Just as we kept our ties very lively in the past - we even held talks between our families with Mr Assad - it is certainly not possible (to say) this will not happen again in the future, it can happen,\" he said after Friday prayers.\nSyrian officials have repeatedly said that any moves towards normalising ties between Damascus and Ankara can only come after Turkey agrees to pull out thousands of troops it has stationed in the rebel-held northwest.\nIn April 2023, the defence ministers and intelligence chiefs of Iran, Russia, Syria and Turkey held talks, as part of efforts to rebuild Turkey-Syria ties after years of animosity. REUTERS", "url": "https://www.straitstimes.com/world/europe/turkeys-erdogan-does-not-rule-out-meeting-syrias-assad-to-restore-ties"}