{"authors": [], "date_download": "2024-10-12 14:18:28", "date_modify": "2024-10-12 14:18:28", "date_publish": "2024-05-21 05:12:11", "description": "The company will be conducting a service action to replace the specific parts. Read more at straitstimes.com.", "filename": "world_united-states_bmw-imported-8000-vehicles-into-us-with-parts-from-banned-chinese-supplier-senate-report-says_1728742708.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/21/btmini20240520.jpg?VersionId=lLrounuwhf6n0pLnB3roTofYyYF6GgHe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_bmw-imported-8000-vehicles-into-us-with-parts-from-banned-chinese-supplier-senate-report-says_1728742708.html", "title": "BMW imported 8,000 vehicles into US with parts from banned Chinese supplier, Senate report says", "title_page": "BMW imported 8,000 vehicles into US with parts from banned Chinese supplier, Senate report says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - German automaker BMW imported at least 8,000 Mini Cooper vehicles into the United States with electronic components from a banned Chinese supplier, a US Senate report released on May 20 said.\nA report by Senate Finance Committee Chairman Ron Wyden’s staff said BMW imported 8,000 Mini Coopers with parts from a Chinese supplier banned under a 2021 law and that BMW continued to import products with the banned parts until at least April.\nBMW Group said in an email it had “taken steps to halt the importation of affected products.”\nThe company will be conducting a service action to replace the specific parts, adding it “has strict standards and policies regarding employment practices, human rights, and working conditions, which all our direct suppliers must follow.”\nCongress in 2021 passed the Uighur Forced Labor Prevention Act (UFLPA) law to strengthen enforcement of laws to prevent the import of goods from China’s Xinjiang region believed to have been produced with forced labor by members of the country’s Uighur minority group. China denies the allegations.\n“Automakers’ self-policing is clearly not doing the job,” Wyden said, urging the Customs and Border Protection agency to “take a number of specific steps to supercharge enforcement and crack down on companies that fuel the shameful use of forced labor in China.” Customs and Border Protection did not immediately comment.\nThe report found that Bourns Inc, a California-based auto supplier, had sourced components from Sichuan Jingweida Technology Group (JWD). That Chinese company was added to the UFLPA Entity List in December, which means its products are presumed to be made with forced labor.\nBourns provided JWD parts to Lear Corp, a direct supplier for BMW and Jaguar Land Rover. Bourns notified Lear in January that electronic components known as LAN transformers had been produced by JWD and were prohibited in US imported vehicles.\nOn Jan 11, Lear sent letters to BMW, Jaguar Land Rover, Volvo and Volkswagen AG informing them of the banned components, the report said. Lear confirmed it promptly notified customers “of products containing these components and worked with our supplier to expeditiously re-source the manufacture of these components to another sub-supplier.”\nJaguar Land Rover imports\nThe report said Jaguar Land Rover imported spare parts with JWD components after December, adding that the automaker quarantined all existing inventory containing the JWD component globally for destruction. Jaguar Land Rover said as soon as it learned of the issue it “immediately stopped all shipments of the two affected aftermarket service parts.”\nThe company added it “takes human rights and forced labor issues seriously and has an active ongoing program of human rights protection and anti-slavery measures.”\nThe report said BMW “appears to have stopped (imports) only after the committee repeatedly asked detailed questions to Lear and Lear’s OEM customers, including BMW, about their relationship with JWD.”\nLear said it takes the issues raised seriously and shares “the committee’s desire to combat forced labor,” and noted it does not have a direct relationship with JWD.\nIn February, Volkswagen confirmed that several thousand Porsche, Bentleys and Audi vehicles were held at US ports because a Chinese subcomponent breached anti-forced labor laws.\nThe Senate report said the Volkswagen vehicles contained the JWD electronic parts and that the automaker voluntarily disclosed the issue to Customs and Border Protection.\nVW said on May 20 it has since replaced the parts in all vehicles held at US ports and “takes allegations of human rights violations very seriously and is committed to preventing the use of forced labor in our supply chain.”\nVolvo Cars received LAN transformers for a new car program not yet in production and did not use any in its vehicles, the report added. REUTERS", "url": "https://www.straitstimes.com/world/united-states/bmw-imported-8000-vehicles-into-us-with-parts-from-banned-chinese-supplier-senate-report-says"}