{"authors": [], "date_download": "2024-10-12 14:09:03", "date_modify": "2024-10-12 14:09:03", "date_publish": "2022-06-22 02:13:51", "description": "Core parts of the world's largest economy remain in good shape, says Biden economic adviser. Read more at straitstimes.com.", "filename": "world_united-states_white-house-says-concerned-about-recession-but-us-economy-strong_1728742143.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/22/US-RETAIL-SALES-RISE-IN-APRIL-AS-U_S_-CONSUMER-INCREASE-SPENDING-204815.jpg?VersionId=3RN5W8IhlQSEKSMYd0m0xS2aTG2qwPo4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_white-house-says-concerned-about-recession-but-us-economy-strong_1728742143.html", "title": "White House says concerned about recession but US economy strong", "title_page": "White House says concerned about recession but US economy strong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (AFP) - The American economy remains strong, but a White House economist acknowledged on Tuesday (June 21) that President Joe Biden's team is concerned about a possible recession.\nWith inflation soaring at the fastest pace in more than four decades, sending prices for gas and housing rocketing, Americans are feeling the pain and the Federal Reserve is cranking up interest rates to try to cool the economy, fuelling fears of a sharp downturn.\nDespite a contraction in the first three months of the year, core parts of the world's largest economy remain in good shape, including the labour market and consumer spending, Cecelia Rouse, head of Biden's Council of Economic Advisers said on CNBC.\n\"When we look at recession (risks)... that's obviously a concern, but the bones of our economy are solid,\" she said, noting that the United States is better positioned to face the challenges than most other nations.\nOn Sunday, Treasury Secretary Janet Yellen also tried to quell recession fears, saying a downturn is not \"inevitable\" even while the economy will slow as it \"transitions to stable growth.\"\nRouse said Biden is focused on the inflation challenge, which is mostly related to the Covid-19 pandemic: \"It's not easy to turn back on a global economy.\"\nGlobal supply chain snarls have been a key factor in fueling the prices increases, and continued pandemic lockdowns in China are adding to the ongoing uncertainty.\nBut Russia's invasion of Ukraine was a \"game changer,\" she said.\n\"We all hope the Fed can get inflation under control without ceding too much on maximum employment,\" Rouse said \"We all hope for the longed-for soft landing.\"\nThe Fed last week implemented the third interest rate hike this year, the biggest in nearly 30 years, and promised more big increases in coming months.\nRichmond Federal Reserve Bank president Thomas Barkin said on Tuesday it was not yet clear how fast and how far the central bank will have to move.\nPolicymakers \"will be nimble, and we will be data driven,\" he said during a discussion with the National Association for Business Economics.\n\"You want to get back to where you want to go as fast as you can without breaking anything,\" he said.\nBut he noted that he expects the supply chain issues to eventually resolve themselves which will ease inflation pressures.", "url": "https://www.straitstimes.com/world/united-states/white-house-says-concerned-about-recession-but-us-economy-strong"}