{"authors": [], "date_download": "2024-10-12 14:00:42", "date_modify": "2024-10-12 14:00:42", "date_publish": "2024-04-24 04:05:46", "description": "A vote on final passage could come as soon as April 23 or 24. Read more at straitstimes.com.", "filename": "world_united-states_us-senate-votes-overwhelmingly-to-advance-ukraine-israel-aid-legislation_1728741642.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/24/US-POLITICS-AID-UKRAINE-RUSSIA-CONFLICT-ISRAEL-PALESTINIAN-171738.jpg?VersionId=KGKQ2t5Z_iyJlGejbbaAZlSapfd.u8Xb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-senate-votes-overwhelmingly-to-advance-ukraine-israel-aid-legislation_1728741642.html", "title": "US Senate votes overwhelmingly to advance Ukraine, Israel aid legislation", "title_page": "US Senate votes overwhelmingly to advance Ukraine, Israel aid legislation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Billions of dollars in foreign aid for Ukraine, Israel and Taiwan advanced in the US Senate on April 23, heading for a vote on final passage days after the House of Representatives abruptly ended a months-long stalemate and approved the assistance in a rare Saturday session.\nThe Senate voted by an overwhelming 80 to 19 in favour of advancing the package of four Bills passed by the House, far more than the 60 needed to pave the way for a vote on final passage as soon as April 23 or 24.\nOne of the Bills provided US$61 billion (S$83 billion) for Ukraine, a second US$26 billion for Israel, and a third US$8.12 billion “to counter communist China” in the Indo-Pacific.\nA fourth Bill includes a potential ban on the social media app TikTok, measures for the transfer of seized Russian assets to Ukraine and new sanctions on Iran.\nDemocratic President Joe Biden has promised to sign it into law as soon as it passes the Senate.\nTwo US officials told Reuters the administration was already preparing a US$1 billion military aid package for Ukraine, the first to be sourced from the Bill.\nThat would clear the way for shipments of military assistance to Ukraine within days, boosting morale for its troops fighting Russian invaders.\nThe influx of weapons should improve Kyiv’s chances of averting a major Russian breakthrough in the east, analysts said, although it would have been more helpful if the aid had come closer to when Mr Biden requested it in 2023.\n“This is an inflection point in history. Western democracy perhaps faced its greatest threat since the end of the Cold War,” Senate Democratic Majority Leader Chuck Schumer said in the Senate, after the procedural vote.\nThe aid package could be the last approved for Ukraine until after elections in November when the White House, House of Representatives and one-third of the Senate are up for grabs.\nIt was not immediately clear how the money for Israel would affect the conflict in Gaza. Israel already receives billions of dollars in annual US security assistance.\nThe package includes humanitarian assistance, which supporters hope will help Palestinians in Gaza.\nHumanitarian concerns\nThe Israel Bill passed the House by an overwhelming 366 to 58, with 21 Republicans and 37 Democrats opposed. Republican “no” votes came from hardliners who generally oppose foreign aid.\nDemocratic objectors demanded more to ease the devastating humanitarian toll of Israel’s campaign in Gaza as it retaliates for the Oct 7 Hamas attacks that killed 1,200 people and resulted in about 250 hostages.\nThe Israeli military assault that followed those attacks has killed more than 34,000 people in Gaza, according to Gaza health authorities.\nThe Senate passed security aid for Ukraine, Israel and the Indo-Pacific more than two months ago, with support of 70 per cent of the 100-member chamber, both Republicans and Democrats.\nThe White House said Mr Biden told Ukrainian President Volodymyr Zelensky in a phone call on April 22 that his administration would provide new security assistance “to meet Ukraine’s urgent battlefield and air defence needs” as soon as he signs the supplemental spending Bills into law.\nThe legislation’s progress has been closely watched by industry, with US defence firms up for major contracts to supply equipment for Ukraine and other US partners. Backers of the foreign assistance stress that approving the Ukraine Bill would create many American jobs.\nExperts expect the supplemental spending to boost the order backlog of RTX along with other major companies that receive government contracts, such as Lockheed Martin, General Dynamics and Northrop Grumman.", "url": "https://www.straitstimes.com/world/united-states/us-senate-votes-overwhelmingly-to-advance-ukraine-israel-aid-legislation"}