{"authors": [], "date_download": "2024-10-12 13:38:09", "date_modify": "2024-10-12 13:38:09", "date_publish": "2024-08-13 22:23:34", "description": "There is also little or no shampoo, soap, period products or household cleaning materials. Read more at straitstimes.com.", "filename": "world_middle-east_gazas-girls-cut-off-their-hair-for-lack-of-combs_1728740289.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/13/LYNXMPEK7C0H8-1.jpg?VersionId=K.K1fUjgdtWE93i_PAFzLd7DPPjEu6Cn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_gazas-girls-cut-off-their-hair-for-lack-of-combs_1728740289.html", "title": "Gaza’s girls cut off their hair for lack of combs", "title_page": "Gaza’s girls cut off their hair for lack of combs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DEIR AL-BALAH, Gaza - When girls complain to Gaza paediatrician Lobna al-Azaiza that they have no comb, she tells them to cut off their hair.\nIt is not just combs. Israel’s blockade of the territory, ravaged by 10 months of war, means there is little or no shampoo, soap, period products or household cleaners.\nWaste collection and sewage treatment have also collapsed, and it is easy to see why contagious diseases that thrive on overcrowding and lack of cleanliness – such as scabies and fungal infections – are on the rise.\n“In the past period, the most common disease we have seen was skin rashes, skin diseases, which have many causes, including the overcrowding in the camps, the increased heat inside the tents, the sweating among children, and the lack of sufficient water for bathing,” the doctor said.\nDr Azaiza used to work at Kamal Adwan Hospital in Beit Lahia until Israeli tanks separated the north of the besieged enclave from the south.\nLike most of Gaza’s medics, she has adapted and continues to treat patients, walking to work past her own ruined house, demolished by an Israeli strike.\nThe tent clinic she set up with a small team began by treating children but has by necessity become a practice for whole families, most of whom have been ordered or bombed out of their homes, like the vast majority of Gaza’s 2.3 million people.\nEven the medication that is available is often unaffordable – a tube of simple burn ointment can now cost 200 shekels (S$70.80).\nInternational aid deliveries have been dramatically reduced since Israel seized control of the Rafah border crossing from Egypt, exacerbating a humanitarian crisis.\nIsrael denies responsibility for delays in getting urgent humanitarian aid in, saying that the United Nations and others are responsible for its distribution inside the enclave.\nDr Azaiza has little doubt about where the immediate solution lies.\n“The border crossing must be opened so that we can bring in medications, as most of the current ones are ineffective: zero effect, there is no effect on the skin diseases that we see,” she said. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/gazas-girls-cut-off-their-hair-for-lack-of-combs"}