{"authors": [], "date_download": "2024-10-12 13:59:50", "date_modify": "2024-10-12 13:59:50", "date_publish": "2022-10-18 04:20:48", "description": "Women who use them face more than twice the risk than those who never do. Read more at straitstimes.com.", "filename": "world_united-states_chemical-hair-straighteners-may-cause-uterine-cancer-study-shows_1728741590.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/18/CHINA-LIFESTYLE-081946_0.jpg?VersionId=0nPY5AfBFdGJdXV8bzybOMq29BDjInjg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_chemical-hair-straighteners-may-cause-uterine-cancer-study-shows_1728741590.html", "title": "Chemical hair straighteners may cause uterine cancer, study shows", "title_page": "Chemical hair straighteners may cause uterine cancer, study shows | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Women who frequently use chemical hair straightening products could face more than twice the risk of uterine cancer compared to those who never use them, according to a new study published on Monday.\nThe findings, published in the Journal of the National Cancer Institute, have particular relevance for Black women, who make up a majority of users of straightening products in the United States.\nScientists lauded the work, calling for action even though more work is required to confirm the conclusions, in what is an understudied area of research.\nLead author Alexandra White, a cancer epidemiologist with the National Institutes of Health led the study, told AFP it grew out of her previous research that found a link between permanent hair dye and straighteners and breast and ovarian cancers.\n“We know that these straighteners contain many different chemicals, including endocrine disruptors, and we would expect them to have adverse health effects for hormone sensitive cancers,” she said.\n“That led us to extend our previous work, just focusing on uterine cancer.”\nUterine cancer accounts for 3 per cent of all new cancers but is the most common cancer of the female reproductive system, with more than 65,000 new cases and 12,500 deaths are expected in 2022.\nThe outlook is generally good if the cancer is caught early, but treatment often involves removing the uterus, which would preclude child-bearing.\nThe new paper relied on data from more than 33,000 US women aged 35-74 who took part in the Sister Study, which is led by the government and designed to identify risk factors for cancer and other conditions.\nOver the course of 11 years, 378 women developed uterine cancer, which primarily affects tissue lining the uterus called endometrium. Type 1, the most common form of the cancer, is thought to be linked to having too much of the sex hormone estrogen.\nWomen who reported using hair straightening products in the past year were almost twice as likely to develop uterine cancer compared to women that never used them, the researchers found.\nThe link was stronger still for frequent users – defined as more than four uses in the past 12 months. These women had around 2.5 times the risk of developing the cancer compared to women who never used the products.\nNo similar associations were found for other hair products including dyes, bleach, highlights, or perms.\nBrazilian blowouts\n“The concern is that there are chemicals in these products that act essentially like estrogen in the body,” said White, disrupting normal hormonal processes that could influence cancer risk.\nA second possibility is that some products include carcinogens, such as formaldehyde, to break the bonds between keratin proteins in hair, which changes its structure and makes it straight.\nThough the study did not specifically ask women what products they used, a particular keratin treatment known as “Brazilian blowouts” was popular at the time the women were enrolled for this study, between 2003 and 2009, though its use has decreased since.", "url": "https://www.straitstimes.com/world/united-states/chemical-hair-straighteners-may-cause-uterine-cancer-study-shows"}