{"authors": ["Bhagyashree Garekar"], "date_download": "2024-10-12 13:37:40", "date_modify": "2024-10-12 13:37:40", "date_publish": "2023-10-14 17:35:00", "description": "Multicultural S'pore must be vigilant against influences from elsewhere, he adds. Read more at straitstimes.com.", "filename": "world_united-states_govt-explains-national-interest-to-repel-disinformation-says-dpm-wong_1728740260.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/14/MCIPhoto2.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_govt-explains-national-interest-to-repel-disinformation-says-dpm-wong_1728740260.html", "title": "Govt explains national interest to repel disinformation, says DPM Wong", "title_page": "Govt explains national interest to repel disinformation, says DPM Wong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Singapore protects its population against disinformation by explaining again and again to its citizens where its national interest lies, Deputy Prime Minister Lawrence Wong said while addressing an influential American think-tank on Friday.\n“Given that we are such a small, open multicultural society, we know that we are susceptible to influences from elsewhere,” he said during a discussion at the Centre for Strategic and International Studies on the last day of his Oct 5 to 15 working visit to the US.\n“That is why we are very vigilant about this.”\nDPM Wong was asked to spell out the Government’s stance on reports that China is trying to influence ethnic Chinese populations across South-east Asia, including that of Singapore.\n“We continually engage our public, educate, explain what is our national interest, why we take certain decisions. Not because of choosing sides or... external influence, but really because of Singapore’s own interest.\n“We spend a lot of time doing that,” he said.\nHe also said it helped that a distinct Singaporean identity, different from cultures in other countries, had evolved over time.\n“The majority of our population are ethnic Chinese, so we have ancestral roots going back to China, but we have, over time, evolved our own Singaporean identity.\n“We are Singaporean Chinese, and the Singaporean Chinese is very different from the Chinese from China – in values, in outlook, in identity. Just as a Singaporean Malay would be very different from a Malay from Malaysia or Indonesia, or a Singaporean Indian would be very different from someone who comes from India.\n“America, being a nation of immigrants, you must understand this very well,” he said,\nAnd influence percolated not just from China; Singapore was equally influenced by ideas originating in the West. A large proportion of Singaporeans consume English-language news and entertainment from the US and Britain, he pointed out.\n“There is no shortage of criticism about Singapore in the Western media, no shortage of commentaries and articles highlighting the shortcomings in our system and asking us to be more like Western liberal ideals.”\nBut the country steered its own course, he said.\n“At the end of the day, what is important for us, small though we may be, is that we are our own people, we make our own choices.\n“It really comes down to Singaporeans deciding on the future of our country.\n“Not China nor the West.”\nHe was also asked to react to a report published in The Washington Post in July which alleged that Lianhe Zaobao was peddling China’s propaganda.\nMr Wong said the Chinese-language newspaper had defended its editorial stance and strongly rejected the portrayal by the Post.\n“If you were to ask Singaporeans, the vast majority of Singaporeans reading the Chinese newspaper daily will not feel that what was portrayed in The Washington Post was accurate,” he said.\n“Because we can read and see for ourselves articles on China, and they cover a wide range, including many articles that criticise Singapore’s perspectives as they have to reflect our society.”\nThis is as it should be, he added.\n“Our newspapers cannot resemble The Washington Post, neither do we ask The Washington Post to become like Singapore newspapers.”", "url": "https://www.straitstimes.com/world/united-states/govt-explains-national-interest-to-repel-disinformation-says-dpm-wong"}