{"authors": [], "date_download": "2024-10-12 14:04:51", "date_modify": "2024-10-12 14:04:51", "date_publish": "2023-01-07 00:18:21", "description": "Iranian drones have been used to target civilian infrastructure in Ukraine amid Russia's invasion. Read more at straitstimes.com.", "filename": "world_united-states_us-targets-supply-of-iranian-drones-to-russia-in-new-sanctions_1728741891.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/07/RUSSIAIRANDRONES1_1.JPG?VersionId=u0xZccUfyu4okUw5RYADvJRc.FA4orGT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-targets-supply-of-iranian-drones-to-russia-in-new-sanctions_1728741891.html", "title": "US targets supply of Iranian drones to Russia in new sanctions", "title_page": "US targets supply of Iranian drones to Russia in new sanctions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The United States on Friday issued new sanctions targeting suppliers of Iranian drones that Washington said have been used to target civilian infrastructure in Ukraine during the conflict with Russia.\nRussia has been attacking vital Ukraine infrastructure since October with barrages of missile and drones, causing sweeping power blackouts as cold weather sets in.\nThe US Treasury Department said it imposed sanctions on six executives and board members of Iran’s Qods Aviation Industries (QAI), also known as Light Airplanes Design and Manufacturing Industries.\nThe Treasury described Qods Aviation Industries (QAI), which has been under US sanctions since 2013, as a key Iranian defence manufacturer responsible for designing and producing drones.\n“We will continue to use every tool at our disposal to deny (Russian President Vladimir) Putin the weapons that he is using to wage his barbaric and unprovoked war on Ukraine,” Treasury Secretary Janet Yellen said in the statement.\nIran’s mission to the United Nations in New York and Russia’s embassy in Washington did not immediately respond to requests for comment.\nIran has previously acknowledged sending drones to Russia but said they were sent before Russia’s February invasion. Moscow has denied its forces used Iranian drones in Ukraine.\nFriday’s sanctions reflect US concerns about Iranian-Russian military cooperation and Russia’s use of Iranian drones to hit Ukraine, a threat that could become more potent if Teheran were to provide missiles to Moscow to shore up Russian supplies.\nAmong those designated was Seyed Hojatollah Ghoreish, QAI’s board chairman and senior official in Iran’s Ministry of Defence and Armed Forces Logistics who “has led Iran’s military research and development efforts and was responsible for negotiating Iran’s agreement with Russia for the supply of Iranian (drones) for Russia’s war in Ukraine,” the Treasury said.\nThe Treasury also imposed sanctions on Ghassem Damavandian, QAI’s managing director and board member, saying he had likely facilitated QAI’s supply of drones to Iranian military services and the training of Russian personnel on use of QAI-made drones.\nFour others who have served as QAI board members were also placed under sanctions: Hamidreza Sharifi-Tehrani, Reza Khaki, Majid Reza Niyazi-Angili and Vali Arlanizadeh.\nThe sanctions also targeted the director of Iran’s Aerospace Industries Organisation, which the Treasury said was the key organisation responsible for overseeing Iran’s ballistic missile programmes.\nThe move freezes any US assets of those designated and generally bars Americans from dealing with them. Those engaged in certain transactions with them also risked being hit by sanctions.\nThe US has previously imposed sanctions on companies and people it accused of producing or transferring Iranian drones that Russia has used to attack civilian infrastructure in Ukraine. REUTERS", "url": "https://www.straitstimes.com/world/united-states/us-targets-supply-of-iranian-drones-to-russia-in-new-sanctions"}