{"authors": [], "date_download": "2024-10-12 14:01:25", "date_modify": "2024-10-12 14:01:25", "date_publish": "2024-04-16 18:32:26", "description": "A lack of air defense missiles prevented Ukraine from thwarting a Russian missile attack last week that destroyed the biggest power plant in the region around the capital Kyiv, President Volodymyr Zelenskiy said. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-it-ran-out-of-missiles-to-stop-russian-strike-ruining-power-station_1728741685.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/LYNXNPEK3F0E3-1.jpg?VersionId=Ae82ZtYL1BeHFvMLcUQAsfXrMCOFKV7d", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-it-ran-out-of-missiles-to-stop-russian-strike-ruining-power-station_1728741685.html", "title": "Ukraine says it 'ran out of missiles' to stop Russian strike ruining power station", "title_page": "Ukraine says it 'ran out of missiles' to stop Russian strike ruining power station | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A lack of air defense missiles prevented Ukraine from thwarting a Russian missile attack last week that destroyed the biggest power plant in the region around the capital Kyiv, President Volodymyr Zelenskiy said.\nZelenskiy's comments, which follow repeated warnings from his government to its allies about scarce air defences, reflect the dire situation Ukraine finds itself in as Russia scales up strikes on its energy system.\n\"There were 11 missiles flying. We destroyed the first seven, and four (remaining) destroyed Trypillia. Why? Because there were zero missiles. We ran out of missiles to defend Trypillia,\" he said in the interview with PBS.\nReuters was not able to independently verify the account. Zelenskiy has earlier warned that Ukraine has already had to make tough choices about what to protect and said his country could run out of defensive missiles entirely if Russian attacks continued apace.\nDestroyed in 11 March strike, Trypilska thermal power plant was the biggest energy facility near Kyiv and was built to have a capacity of 1,800 megawatts, more than the pre-war needs of Ukraine's biggest city. Other stations and imports have filled the gap for now but residents have been urged to save power.\nRussia has stepped up combined missile and drone strikes targeting Ukraine's grid system since mid-March. It is the second concerted Russian attack on the energy system since Russian forces invaded Ukraine more than two years ago and has proven much more devastating than the first one.\nIn recent attacks, Ukraine lost about 7 gigawatt of power generating capacity, with major thermal power plants and transmitting capabilities significantly damaged.\nMoscow says the strikes are aimed at degrading Ukraine's ability to fight and are in retaliation for recent attacks inside Russia.\nWestern allies have been reluctant to send additional air defenses to Ukraine, which says it needs 25 Patriot systems to cover its territory properly. Germany has pledged to deliver another system following urgent calls from Kyiv. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-says-it-ran-out-of-missiles-to-stop-russian-strike-ruining-power-station"}