{"authors": [], "date_download": "2024-10-12 13:39:43", "date_modify": "2024-10-12 13:39:43", "date_publish": "2024-07-17 18:43:21", "description": "BELGRADE - The Balkans, along with much of Europe, continued to swelter in a prolonged heatwave on Wednesday, triggering forest fires and drying up a Serbian lake for the first time, as a meteorologist warned such heatwaves could become more regular. Read more at straitstimes.com.", "filename": "world_europe_heatwave-dries-up-lake-in-serbia-triggers-fires-in-balkan-extreme-weather-event_1728740383.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/17/LYNXMPEK6G0D7-1.jpg?VersionId=aiTLEx9LOgN2F.29XwDbrwW_uYZV0C._", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_heatwave-dries-up-lake-in-serbia-triggers-fires-in-balkan-extreme-weather-event_1728740383.html", "title": "Heatwave dries up lake in Serbia, triggers fires in Balkan 'extreme weather event'", "title_page": "Heatwave dries up lake in Serbia, triggers fires in Balkan 'extreme weather event' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BELGRADE - The Balkans, along with much of Europe, continued to swelter in a prolonged heatwave on Wednesday, triggering forest fires and drying up a Serbian lake for the first time, as a meteorologist warned such heatwaves could become more regular.\n\"At the moment, we are amid an extreme weather event, a heatwave characterized by its length and intensity,\" Vladimir Djurdjevic, a Belgrade-based meteorologist, told Reuters, adding climate change could make such super-hot summers more frequent events.\nTemperatures sizzled across the Balkans this week, with most of the countries in the region, which includes Croatia, Montenegro and North Macedonia, expecting temperatures of around 39 degrees Celsius (102 Fahrenheit).\nIn Serbia, the Rusanda salt lake in the northern province of Vojvodina, which contains medicinal mud, dried up for the first time ever, locals said.\n\"It was all marsh and now the marsh is gone. This is the lowest (lake) level ... and it is also affected by this drought,\" said resident Sava Jovkic, 72.\nOn Wednesday, Serbia's public health institute declared dangerous conditions in 10 municipalities. A day earlier, the capital Belgrade recorded its hottest-ever July 16, with a temperature of 38.4째C (101.1째F).\nThe Adriatic Sea hovered at temperatures around a record-high 29.5째C in several coastal resorts of Croatia.\nFOREST FIRES\nNorth Macedonia and Albania both deployed firefighters, airplanes, and helicopters this week to fight forest fires in their countries. On Sunday, North Macedonia declared a state of emergency due to forest fires.\nIn a regional climate report on Wednesday, the World Bank warned that the economies of the Western Balkans needed to invest at least $37 billion in total over the next decade to protect people and property from the impact of climate change.\nThe Western Balkans comprise Albania, Bosnia and Herzegovina, Kosovo, Montenegro, North Macedonia, and Serbia.\nIn other parts of Europe, Italy is also expected to face blistering heat, with temperatures reaching 45째C. Searing temperatures have also impacted countries like Greece, France, Spain, Poland, and Ukraine. REUTERS", "url": "https://www.straitstimes.com/world/europe/heatwave-dries-up-lake-in-serbia-triggers-fires-in-balkan-extreme-weather-event"}