{"authors": [], "date_download": "2024-10-12 13:42:16", "date_modify": "2024-10-12 13:42:16", "date_publish": "2024-09-17 03:46:36", "description": "WASHINGTON - The U.S. military said on Monday it had completed its withdrawal from Niger. Read more at straitstimes.com.", "filename": "world_europe_us-military-says-it-completes-niger-withdrawal_1728740536.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/LYNXMPEK8F0Q9-1.jpg?VersionId=XEOnuaRBsOA.T4f2OUd3fdOxFAFm3z8z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_us-military-says-it-completes-niger-withdrawal_1728740536.html", "title": "US military says it completes Niger withdrawal", "title_page": "US military says it completes Niger withdrawal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The U.S. military said on Monday it had completed its withdrawal from Niger.\nThe West African nation's ruling junta in April ordered the U.S. to withdraw its nearly 1,000 military personnel from the country, in an embarrassing setback for Washington that followed a coup last year in the West African nation.\nBefore the coup, Niger had been a key partner in the U.S. fight against insurgents in the Sahel region of Africa, who have killed thousands of people and displaced millions more.\nWashington is searching for a Plan B in West Africa but the process is slow and officials caution that U.S. intelligence is dimming on the fast-growing extremist groups in the region.\nThe U.S. withdrawal from Niger was carried out in phases, with U.S. forces and assets withdrawing from Air Base 101 in Niamey on July 7, and Air Base 201 in Agadez on Aug. 5. The U.S. military said on Monday the U.S. Africa Command Coordination Element, consisting of a two-star general and staff, has also departed from Niger, and that the withdrawal was complete by a Sept. 15 deadline.\n\"Over the past decade, U.S. troops have trained Niger's forces and supported partner-led counterterrorism missions against Islamic State and al Qaeda in the region,\" it said in a statement.\n\"The U.S. Department of Defense and the Nigerien Ministry of National Defense recognize the sacrifices made by both nations' forces.\" REUTERS", "url": "https://www.straitstimes.com/world/europe/us-military-says-it-completes-niger-withdrawal"}