{"authors": [], "date_download": "2024-10-12 14:00:18", "date_modify": "2024-10-12 14:00:18", "date_publish": "2024-07-03 23:51:39", "description": "Ukraine's leader has had a fraught relationship with Trump. Read more at straitstimes.com.", "filename": "world_europe_ukraine-s-zelensky-challenges-trump-to-reveal-plans-for-ending-war_1728741618.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/03/2024-07-02T121530Z577844026RC2YM8ATAW12RTRMADP3UKRAINE-CRISIS-HUNGARY.JPG?VersionId=iX9Y1tVhTPjsY2zLQ4H03fqyOsw7sLB4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-s-zelensky-challenges-trump-to-reveal-plans-for-ending-war_1728741618.html", "title": "Ukraine’s Zelensky challenges Trump to reveal plans for ending war", "title_page": "Ukraine’s Zelensky challenges Trump to reveal plans for ending war | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukrainian President Volodymyr Zelensky said Donald Trump should come forward with his plan to quickly end the war with Russia, warning that any proposal must avoid violating the nation’s sovereignty.\n“If Trump knows how to finish this war, he should tell us today,” Mr Zelensky said, in a Bloomberg Television interview in Kyiv on July 3.\n“If there are risks to Ukrainian independence, if we lose statehood – we want to be ready for this, we want to know.”\nThe former US president, who leads in polls over President Joe Biden ahead of the November election, has boasted that he will end the war by the time he’s inaugurated in January. In the televised debate last week, Trump decried the billions of dollars spent on Ukraine’s defence, saying that Kyiv is “not winning the war”.\nIn a nearly hour-long interview, the Ukrainian leader lamented the delays in weapons deliveries from Western allies and said he was “potentially ready” to meet Trump to hear his team’s proposals.\n“They can’t plan my life and life of our people and our children,” he said.\n“We want to understand whether in November we will have the powerful support of the US, or will be all alone.”\nThe Ukrainian leader has had a fraught relationship with Trump, who during his presidency consistently accused Mr Zelensky of corruption and soon after the former comedian’s 2019 election leaned on him to investigate allegations against Mr Biden – a move that triggered his first impeachment.\nResponding to questions from Bloomberg on July 3, Mr Steven Cheung, the Trump campaign’s communications director, said the prospective Republican presidential candidate “will do what is necessary to restore peace and rebuild American strength and deterrence on the world stage”.\n“He is the only person who can make that happen,” Mr Cheung said.\n‘A long, long, long wait’\nMr Zelensky also challenged the notion that Kyiv is losing, refuting the term “deadlock” to describe the conflict. He said Kyiv’s forces are better positioned in terms of manpower than they were months ago and a new counteroffensive is a matter of arming its brigades.\n“It’s not a deadlock, it’s a problematic situation,” he said. “A deadlock means there’s no way out. But a problem can be solved if one has the will and has the tools. We do have the will, and the tools – they haven’t arrived yet.”", "url": "https://www.straitstimes.com/world/europe/ukraine-s-zelensky-challenges-trump-to-reveal-plans-for-ending-war"}