{"authors": [], "date_download": "2024-10-12 13:36:04", "date_modify": "2024-10-12 13:36:04", "date_publish": "2023-10-22 15:37:00", "description": "Gaza’s Health Ministry said 266 Palestinian had been killed by Israeli air strikes in the past 24 hours. Read more at straitstimes.com.", "filename": "world_middle-east_us-beefs-up-mideast-military-assets-as-israel-pounds-gaza-and-beyond_1728740164.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/22/ISRAEL-PALESTINIAN-GAZA-CONFLICT-064025.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_us-beefs-up-mideast-military-assets-as-israel-pounds-gaza-and-beyond_1728740164.html", "title": "Israel pounds Gaza as US sees ‘significant’ risk of attacks on Mid-East interests", "title_page": "Israel pounds Gaza as US sees ‘significant’ risk of attacks on Mid-East interests | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GAZA/JERUSALEM – Fears over the risk of the Israel-Hamas war mushrooming into a wider Middle East conflict rose on Sunday, with Washington warning of a significant risk to United States’ interests in the region as ally Israel pounded Gaza and clashes on its border with Lebanon intensified.\nGaza’s health ministry said 266 Palestinians, including 117 children, had been killed by Israeli air strikes in the past 24 hours in the enclave, to which Israel laid “total siege” after a deadly mass infiltration into Israel by Hamas gunmen on Oct 7.\nIn neighbouring Syria – where Hamas’ main regional backer, Iran, has a military presence – Israeli missiles hit Damascus and Aleppo international airports early on Sunday, putting both out of service and killing two workers, Syrian state media said.\nAlong Israel’s northern border with Lebanon, the Iran-backed Hezbollah has clashed with Israeli forces in support of Hamas in the deadliest escalation of frontier violence since an Israel-Hezbollah war in 2006.\nHezbollah said four fighters were killed in heavy exchanges of fire on Sunday and another died of wounds received earlier, raising to 24 the number of its members killed since Oct 7.\nLebanese security sources said 11 fighters with Palestinian militant groups in Lebanon had also been killed in the volatile border region, alongside four civilians.\nAt least five Israeli soldiers and one civilian have been killed on Israel’s side of the frontier, according to Israeli military reports.\nWith violence around its heavily guarded borders increasing, Israel on Sunday added 14 communities close to Lebanon and Syria to its evacuation contingency plan in the north of the country.\nUS Defence Secretary Lloyd Austin said Washington would send more military assets to the Middle East to support Israel and strengthen the US defence posture in the region following “recent escalations by Iran and its proxy forces” – a reference to Hezbollah and Palestinian Islamist militants.\nMr Austin told ABC’s This Week programme on Sunday: “We’re concerned about potential escalation. In fact, what we’re seeing... is the prospect of a significant escalation of attacks on our troops and our people throughout the region.\n“If any group or any country is looking to widen this conflict and take advantage of this very unfortunate situation... our advice is: don’t,” he added.\nWashington has already deployed a significant amount of naval power to the Middle East in recent weeks, including two aircraft carriers, support ships and about 2,000 marines, to help deter attacks by Iran-affiliated forces that could inflame the wider region.\nMr Austin said a terminal high-altitude area defence (Thaad) system and additional Patriot air defence missile system battalions will be sent to the region, and more troops will be put on standby.\nIranian security officials told Reuters that Iran’s strategy was for Middle East proxies like Hezbollah to pursue limited strikes on Israeli and US targets but avoid a major escalation that would draw in Teheran, a high-wire act for the Islamic republic.\nIsrael unleashed an aerial blitz on Gaza, which lies to its south-west, after Hamas militants breached the border and carried out a shock rampage through nearby communities, killing 1,400 people, mainly civilians, and taking 212 hostages back to Gaza.\nGaza’s health ministry said on Sunday that Israel’s air and missile strikes in retaliation had killed at least 4,741 and wounded 15,898, with more than a million of the tiny territory’s 2.3 million people displaced.\nIsrael has amassed tanks and troops near the fenced border around Gaza for a planned ground invasion aiming to annihilate Hamas, after several inconclusive wars dating to its seizure of power there in 2007, after Israel ended a 38-year occupation.\nElaborating on Israel’s strategy in remarks to Fox TV on Sunday, military spokesman Jonathan Conricus said it was “to have a weakened, tired and dislocated Hamas in preparation for our next stage of military operations”.\n“Our working assumption,” he said, “is that Hamas has prepared the battlefield, that there are various dimensions of warfare ready for us – specifically tunnels – and that Hamas, at least in the first and the intermediate stages, will fight and will inflict heavy casualties on (Israeli forces).”\nHamas’ armed wing said it had fired rockets at Tel Aviv on Sunday. There was no immediate word of damage or casualties.\nWith Israel keeping up daily bombardments that have laid waste to swathes of the densely populated enclave, Palestinians said they received renewed Israeli military warnings to move from Gaza’s north to the south to avoid the deadliest theatre of the war.\nThey said military leaflets dropped on the narrow territory, just 45km long, contained the added warning that they could be identified as sympathisers with a “terrorist organisation” if they stayed put.\n“For your own safety, move southward. We will continue to attack in the area of Gaza City and increase attacks,” Israeli military spokesman Daniel Hagari said.", "url": "https://www.straitstimes.com/world/middle-east/us-beefs-up-mideast-military-assets-as-israel-pounds-gaza-and-beyond"}