{"authors": [], "date_download": "2024-10-12 13:39:24", "date_modify": "2024-10-12 13:39:24", "date_publish": "2023-09-12 11:05:00", "description": "The lights seem to occur above sites of seismic stress. Read more at straitstimes.com.", "filename": "world_videos-of-earthquake-lights-above-morocco-are-an-unexplained-mystery_1728740364.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/12/ailight1209.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_videos-of-earthquake-lights-above-morocco-are-an-unexplained-mystery_1728740364.html", "title": "Videos of ‘earthquake lights’ above Morocco are an unexplained mystery", "title_page": "Videos of ‘earthquake lights’ above Morocco are an unexplained mystery | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MARRAKESH – People near Marrakesh, Morocco, shared videos recorded before the 6.8-magnitude earthquake that hit the area on Friday, showing unidentified lights in the sky.\nThe bizarre aerial phenomena are known as earthquake lights and seem to occur above sites of seismic stress.\n“People have wondered about them forever,” said Professor Karen Daniels, a physicist at North Carolina State University. “It’s one of those persistent mysteries that hang around and never quite get nailed.”\nEarthquake lights are difficult to study because earthquakes are impossible to predict. Without knowing when or where they will occur, researchers do not know where to place sensitive equipment that can detect them. Some experts doubt they are associated with earthquakes at all, according to the US Geological Survey.\nBut accounts of these lights go back centuries, Professor John Ebel, a seismologist at Boston College who wrote a book on the history of earthquakes in the north-eastern United States, said.\nResearchers, in a study in 2014, found reports of aerial luminous phenomena from 65 earthquakes occurring in Europe and the Americas during the 18th, 19th and 20th centuries.\nPeople have reported a variety of kinds of earthquake lights, ranging from glows high in the sky to low on the horizon. Some last up to minutes; others flash on and off like lightning. They have also been seen in different colours.\n“All of these have been reported by observers,” Prof Ebel said. “Which ones are actually true, and which ones are products of their imagination, we can’t really say.”\nThe advent of dashcams, smartphones and social media provided the first non-anecdotal data. Videos of earthquake lights, for example, caused a stir during the Guerrero, Mexico, earthquake of 2021.\nOne hypothesis for how earthquake lights form is that the friction between tectonic plates generates electricity. But experts question that idea, because this usually results from two different materials rubbing against and pulling electric charge away from each other.\n“Rock on rock is not a situation where people have been able to generate large charge separation,” Prof Daniels said. “And so it just doesn’t seem like a very good explanation for what people see.”\nOther explanations might be electrical arcing from power lines shaken by earthquakes, Prof Daniels added.\nBut she and other experts do not rule out the possibility that there is no relationship between the lights and tectonic events.\n“We’re comforted by things that we can understand, and we’re scared by things we don’t,” Prof Daniels said. “I think that’s part of the reason we’re so fascinated by this phenomenon.” NYTIMES", "url": "https://www.straitstimes.com/world/videos-of-earthquake-lights-above-morocco-are-an-unexplained-mystery"}