{"authors": [], "date_download": "2024-10-12 14:08:20", "date_modify": "2024-10-12 14:08:20", "date_publish": "2022-06-04 00:34:22", "description": "Ukraine has put up a fierce resistance since Feb 24 after Russian President Vladimir Putin declared a \"special military operation\". Read more at straitstimes.com.", "filename": "world_100-days-of-war-in-ukraine_1728742100.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/03/hz100days030622.jpg?VersionId=qxG0H4AIEJnqGAkiboUZi26Yc4X8JY9q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_100-days-of-war-in-ukraine_1728742100.html", "title": "100 days of war in Ukraine", "title_page": "100 days of war in Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Ukraine President Volodymyr Zelensky said on Friday (June 3) his country’s military would fend off the Russian invasion in a video marking 100 days of Moscow’s all-out assault on its pro-democracy neighbour.\n“Victory will be ours,” Mr Zelensky said in a video that included Prime Minister Denys Shmyhal and presidential advisor Mykhaylo Podolyak, recalling an impromptu message they posted outside government buildings at the onset of the war vowing to remain in the country.\nThis comes as Ukraine's Defence Minister Oleksii Reznikov said he believed the Kremlin was trying to move the war into a “protracted phase” by building layered defences in occupied regions in the south of the country.\nREAD MORE HERE\nRussia's Putin clings to semblance of normality as his war in Ukraine grinds on\nApproaching the 100-day mark in a war that he refuses to call by its name, Russian President Vladimir Putin is a man intent on conveying the impression of business as usual.\nAs his army fought its way into the Ukrainian city of Sievierodonetsk this week, Putin was making awkward small talk in a televised ceremony to honour parents of exceptionally large families.\nSince the start of May, he has met - mostly online - with educators, oil and transport bosses, officials responsible for tackling forest fires, and the heads of at least a dozen Russian regions, many of them thousands of miles from Ukraine.\nREAD MORE HERE\nHow the Biden administration has handled the invasion of Ukraine\nSeveral days before Russia launched its invasion of Ukraine, US President Joe Biden warned that Russian President Vladimir Putin had made the decision to attack.\nOne hundred days on, Mr Biden has remained at the forefront of the international response to the crisis, building a coalition to forcefully denounce Russia's actions, while arming Ukraine and refraining from putting American boots on the ground.\n\"America's goal is straightforward: We want to see a democratic, independent, sovereign and prosperous Ukraine with the means to deter and defend itself against further aggression,\" Mr Biden wrote in a New York Times commentary on Tuesday (May 31).\nREAD MORE HERE\nGermany struggles with arms and morality\nNearly each time German Chancellor Olaf Scholz has made a statement on the war in Ukraine, observers puzzle over whether he wholeheartedly supports Kyiv.\nHis vagueness reflects also the disunity within his Social Democratic Party (SPD).\nEarly on in the war, Mr Scholz gave his well-received \"Zeitenwende\" or \"turning point\" speech, announcing nothing less than an about-face in Germany's foreign and security policy. Subsequently, he fell short. The promised arms deliveries to Ukraine did not materialise or only did so slowly after public pressure.\nREAD MORE HERE\nTimeline: Russia's 100 days of war in Ukraine\nRussia's invasion of Ukraine entered its 100th day on Friday (June 3) with no end in sight to the fighting that has killed thousands, uprooted millions and reduced cities to rubble.\nAfter abandoning its assault on the capital, Kyiv, Russia is pressing on in the east and south in the face of mounting sanctions and a fierce Ukrainian counter-offensive bolstered by Western arms.\nSome key events in the conflict so far.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/100-days-of-war-in-ukraine"}