{"authors": [], "date_download": "2024-10-12 14:02:51", "date_modify": "2024-10-12 14:02:51", "date_publish": "2023-05-13 08:13:00", "description": "The main G-7 statement is set to include “a section specific to China”, said the unnamed US official. Read more at straitstimes.com.", "filename": "world_united-states_g-7-summit-statement-to-target-chinas-economic-coercion-us-source_1728741771.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/14/2021-09-06T050021Z905538677RC25KP98UQFMRTRMADP3SWF-CHINA-INVESTMENT.JPG?VersionId=hmoY8qDdOSK00WIGqIzpHOlVVcMl4GLx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_g-7-summit-statement-to-target-chinas-economic-coercion-us-source_1728741771.html", "title": "G-7 summit statement to target China’s ‘economic coercion’: US source", "title_page": "G-7 summit statement to target China’s ‘economic coercion’: US source | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Leaders of the Group of Seven (G-7) countries are set to issue a statement of concern about China’s use of “economic coercion” in its dealings abroad when they gather next week, according to a US official familiar with the discussions.\nThe statement, a likely component of the overall communique that will be released by leaders during the May 19 to 21 summit in Hiroshima, Japan, is expected to be paired with a broader written proposal for how the seven advanced economies will work together to counter “economic coercion” from any country.\nThe main G-7 statement is set to include “a section specific to China” with a list of concerns that include “economic coercion and other behaviour that we have seen specifically from the (People’s Republic of China)”, the official said on Friday.\nA separate “economic security statement will speak more to tools” used to counter those efforts, including planning and coordination, the person said. In each case, these statements are expected to go further than prior statements by the G-7.\nUS President Joe Biden has made China a focus of his foreign policy, working to keep the tense and competitive relationship from veering into one of open conflict, including over Taiwan.\nThe G-7, which also includes Canada, France, Germany, Italy and the United Kingdom, is closely tied economically to China, the world’s biggest exporter and a key market for many of the seven countries’ companies.\nIn April, China called a statement by the G-7 foreign ministers that touched on similar topics “full of arrogance, prejudice against China”, and lodged complaints with this year’s G-7 host, Japan.\nUnder Mr Biden’s predecessor, president Donald Trump, G-7 statements often offered only a cursory mention of issues involving China. The Biden administration has pushed for more direct statements.\nThe joint statement issued by all the G-7 leaders every year is intended to signal that the powerful countries are aligned on a range of political and economic issues.\nG-7 members will also hold out the prospect of further cooperation with China on areas like the climate.\n“We’re not for decoupling the US and Chinese economies; we are for de-risking, we are for diversifying,” said the US official. “That principle is very unifying.”\nNegotiations over the precise language of the leaders’ joint declarations are still subject to diplomacy and adjustment before they are released during the summit.\nThe G-7 meeting will be a test of how much the members, all rich democracies, can agree on a common approach to China, the world’s second-largest economy.\nThe China terms have been a major subject of the talks currently underway by G-7 finance leaders in Niigata, where they have focused on reducing “over-reliance” of their countries’ supply chains on Chinese manufacturing, by partnering with low- and middle-income countries.\n“The US wants to get something hard on paper down in terms of agreement and the other countries are interested, but they’re not as interested in putting specifics down on paper on these various instruments and economic statecraft tools,” said Mr Josh Lipsky, senior director of the Atlantic Council’s GeoEconomics Centre.\nIn particular, some G-7 members are sceptical about signing on to controls on outbound investment in China.\nThe policies are being drafted partly to help deny China’s military access to tools it could use to gain technological superiority, and many in the Biden administration see them as complementary to export controls restricting access to some semiconductors that have the same goal.\n“Of course, each member of the G-7 is to some extent going to carve their own path on China and yet there are also a set of kind of principles that unite the G-7 in a common approach to China,” said the US official.\nTravelling for the G-7 finance meeting in Japan, US Treasury Secretary Janet Yellen said on Thursday that China had clearly used economic coercion with Australia and Lithuania.\nHanging over the meeting was a lack of progress in resolving the US debt ceiling stalemate.\nA scheduled meeting on Friday between Mr Biden and top lawmakers was postponed until early next week as Mr Biden’s Democrats and Republicans seek a compromise to avoid a catastrophic default.\nUS officials, nonetheless, expect the President to attend the two-day summit as planned. followed by trips to Papua New Guinea and Australia also aimed at shoring up Washington’s approach to the China-dominated Asia-Pacific region. REUTERS", "url": "https://www.straitstimes.com/world/united-states/g-7-summit-statement-to-target-chinas-economic-coercion-us-source"}