{"authors": [], "date_download": "2024-10-12 13:36:21", "date_modify": "2024-10-12 13:36:21", "date_publish": "2024-06-08 23:42:45", "description": "MORONI - Police in Comoros detained two women on Saturday on charges of engaging in same-sex sexual activity after they asked an Islamic preacher to marry them, a public prosecutor said. Read more at straitstimes.com.", "filename": "world_two-women-in-comoros-detained-on-gay-sex-charges-after-marriage-bid_1728740181.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/08/ST-logo-placeholder_25.jpg?VersionId=ViBwHLcdn_hGgeQz0NjjBDptZ35JqcYh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_two-women-in-comoros-detained-on-gay-sex-charges-after-marriage-bid_1728740181.html", "title": "Two women in Comoros detained on gay sex charges after marriage bid", "title_page": "Two women in Comoros detained on gay sex charges after marriage bid | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MORONI - Police in Comoros detained two women on Saturday on charges of engaging in same-sex sexual activity after they asked an Islamic preacher to marry them, a public prosecutor said.\nGay sex is illegal in Comoros, a Muslim-majority archipelago nation in the Indian ocean which has a population of 870,000.\nPublic prosecutor Ali Mohamed Djounaid said the women were being held in pre-trial detention at a prison in the capital, Moroni, after a court appearance in which they were charged with having \"unnatural sex\".\n\"They are accused of acts that are contrary to good morals and against nature,\" Djounaid said. If convicted, the two women who are aged 22 and 25 could be jailed for up to two years, he added.\nIt was not immediately possible to reach a lawyer representing the women.\nThere has been a growing crackdown on same-sex relations in some African countries in recent years, with tough anti-LGBTQ+ laws passed in Uganda and Ghana drawing strong condemnation from Western countries and rights campaigners.\nThe Ugandan law enacted last year includes life imprisonment for gay sex and the death penalty for certain same-sex acts.\nA report by the UK-based Human Dignity Trust, a rights group, said there were few known examples of anti-LGBTQ+ laws being enforced in the Comoros in recent years. REUTERS", "url": "https://www.straitstimes.com/world/two-women-in-comoros-detained-on-gay-sex-charges-after-marriage-bid"}