{"authors": [], "date_download": "2024-10-12 14:04:24", "date_modify": "2024-10-12 14:04:24", "date_publish": "2023-12-13 23:12:13", "description": "Spiegel magazine reported that the leaked material concerned the surveillance of Russia’s paramilitary group Wagner. Read more at straitstimes.com.", "filename": "world_europe_ukraine-weapons-treason-case-throws-light-on-russian-spy-threat-to-germany_1728741864.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/14/2023-12-13T095455Z294034758RC29W4ADW9V9RTRMADP3GERMANY-SECURITY-SPY.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-weapons-treason-case-throws-light-on-russian-spy-threat-to-germany_1728741864.html", "title": "Two Germans go on trial for handing Ukraine war secrets to Russia", "title_page": "Two Germans go on trial for handing Ukraine war secrets to Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - Two German men went on trial in Berlin on Dec 13 accused of passing intelligence secrets related to the war in Ukraine to Russia’s security services.\nThe pair, referred to only as Carsten L and Arthur E, are accused by prosecutors of working together with a Russian businessman to “procure sensitive information” from Germany’s BND foreign intelligence.\nAt least part of the intelligence allegedly “concerned the war in Ukraine”, said Ms Lisa Jani, spokeswoman for the Berlin criminal court.\n“Information therefore that was particularly important not only for the federal republic (of Germany), but also for the Russian side,” she told journalists.\nMs Jani and the prosecutors did not detail the nature of the leaked information, but Spiegel magazine had reported that it concerns the surveillance of Russia’s paramilitary group Wagner.\nDue to the sensitivity of the trial, proceedings are being held under tight security, with some sessions potentially closed to the public.\nIn the soundproofed courtroom, the defendants were seated separately in glass boxes and avoided looking at each other during the hearing.\nCarsten L, an employee of the BND, is alleged to have passed documents from the agency to Arthur E, who in turn handed them to a contact in Russia, according to prosecutors.\nBetween September and October 2022, Carsten L is said to have printed out or taken screenshots of nine internal BND files.\nThe documents were transferred to Arthur E, who allegedly carried digital copies to Moscow, printed them out and turned them over to Russia’s FSB security agency.\nThe pair face charges of high treason and if found guilty, could be jailed for life.\nPrecious metals dealer\nThe intelligence official Carsten L and businessman Arthur E “got to know each other and got along well”, Ms Jani said.\nArthur E, whose activities included precious metals trading in Africa, is said to have had “good connections” in Russia and allegedly established the link with the FSB, Ms Jani said.\nFor their services, the FSB is said to have paid Carsten L at least €450,000 (S$650,000) and Arthur E at least €400,000, she said.\nAccording to a report by the German weekly Spiegel, part of the information related to a messaging app used by the mercenary group Wagner, which fought alongside Russia’s regular troops in Ukraine.\nThe BND gained access to the platform but traffic in the chat dried up after the information is said to have been passed to Moscow, depriving Germany of vital information about the invasion, the magazine said.\nThe Wagner group was brought to heel by Moscow after its leader Yevgeny Prigozhin led an armed rebellion against Russia’s military leadership in June.\nMany Wagner fighters were integrated into the regular army, while Prigozhin himself was killed in an air crash in Russia in August.\nBut at the time of the leak, Wagner mercenaries played a prominent part in Russia’s war effort.\n‘Unauthorised contact’\nCarsten L was arrested in December 2022 and his alleged accomplice was detained a month later as he arrived at Munich airport from the United States. They were charged in September.\nBoth face an additional charge for having “unauthorised contact with each other in the pre-trial detention centre”, where they could have “exchanged information that could influence the proceedings”, Ms Jani said.\nCarsten L’s lawyer, Mr Johannes Eisenberg, said in a statement there was “no objective evidence whatsoever” for his client’s alleged treason.\nMr Eisenberg complained of a “show trial” after judges said the highly sensitive nature of the accusations meant part of the charge sheet could be kept secret.\nGermany has been shaken by several cases of alleged spying for Russia since the invasion of Ukraine in early 2022, amid suggestions that officials in Berlin are too sympathetic with Moscow.\nEarlier this year, a German national working for the military was arrested on suspicion of spying for Russia.\nAnd in November 2022, a German man was handed a suspended sentence for passing information to Russian intelligence services while working as a reserve officer for the German army. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-weapons-treason-case-throws-light-on-russian-spy-threat-to-germany"}