{"authors": [], "date_download": "2024-10-12 14:08:58", "date_modify": "2024-10-12 14:08:58", "date_publish": "2022-05-31 16:04:14", "description": "This is Israel's first big trade accord with an Arab state that reduces or removes tariffs. Read more at straitstimes.com.", "filename": "world_middle-east_israel-signs-major-trade-pact-with-gulf-state-uae_1728742138.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/31/AK_isrflag_310522.jpg?VersionId=x3Gx780EtCvWM0DRm_LMCVnISXCJ6ikQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israel-signs-major-trade-pact-with-gulf-state-uae_1728742138.html", "title": "Israel signs major trade pact with Gulf state UAE", "title_page": "Israel signs major trade pact with Gulf state UAE | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI (REUTERS) - Israel signed a free trade agreement with the United Arab Emirates on Tuesday (May 31), its first big trade accord with an Arab state that reduces or removes tariffs and over time targets lifting annual bilateral trade to more than US$10 billion (S$13.7 billion).\nThe pact was signed in Dubai by Israel's Minister of Economy and Industry Orna Barbivai and her counterpart, UAE Minister of Economy Abdulla bin Touq Al Marri, after months of negotiations.\nTariffs will be eliminated on 96 per cent of goods with the UAE predicting the Comprehensive Economic Partnership Agreement would boost bilateral trade to more than US$10 billion a year within five years.\nEmirati trade minister Thani Al Zeyoudi said the trade deal wrote \"a new chapter in the history of the Middle East\". \"Our agreement will accelerate growth, create jobs and lead to a new era of peace, stability, and prosperity across the region,\" he wrote on Twitter.\nThe agreement has been signed amid escalating Israeli-Palestinian violence.\nThe UAE foreign ministry on Monday condemned what it called a \"storming\" of Al Aqsa compound in Jerusalem by \"extremist settlers under the protection of Israeli forces\". That appeared to refer to visits by thousands of Jews, who revere the site as vestige of their two ancient temples, on the day marking Israel's capture of Jerusalem's Old City in a 1967 war. Some of the visitors prayed and held up Israeli flags - resulting, police said, in their removal.\nAl Aqsa, also the third holiest site in Islam, is situated in East Jerusalem's Old City that Israel has annexed but is not recognised internationally.\nThe foreign ministry, in the written statement, also asked \"Israeli authorities to take responsibility for reducing escalation and ending all attacks and practices that lead to the continuation of tensions while underscoring the need to exercise maximum restraint to avoid further instability\".\nThe same day invited media were told they could no longer attend the signing of the trade deal. No reason was given for the sudden change.\nIsrael's Barbivai told Israeli radio on Tuesday she had heard \"nothing out of the ordinary\" about the Al Aqsa violence so far during her visit to the UAE.\nPresident of the UAE-Israel Business Council Dorian Barak said the trade agreement defined tax rates, imports and intellectual property, which would encourage more Israeli companies to set up offices in the UAE, particularly in Dubai.\nThe council predicts there will be almost 1,000 Israeli companies working in or through the UAE by the end of the year doing business with South Asia, the Far East and Middle East.\n\"The domestic market doesn't represent the entirety of the opportunity. The opportunity is really setting up in Dubai, as many companies have, in order to target the broader region,\" Barak told Reuters by phone.\nEmirati-Israeli trade reached US$1.2 billion in 2021, according to official Israeli data.\nAhead of the signing, Israel's economy ministry had said the accord would remove tariffs on food, agriculture, cosmetics, medical equipment and medicine.\n\"Together we will remove barriers and promote comprehensive trade and new technologies, which will form a solid foundation for our common path, will contribute to the well-being of citizens and make it easier to do business,\" Israel's Barbivai said on Monday.\nFor oil-rich UAE, the deal with Israel is its second bilateral free trade agreement after signing a similar accord with India in February. It is in bilateral trade talks with several other countries, including Indonesia and South Korea.\nThe UAE has been aggressively pursuing these deals in a bid to strengthen its economy and status as a major business hub following the hit it took from the coronavirus pandemic.\nIsrael and the UAE established ties in September 2020 in a US-brokered deal that broke with decades of Arab policy that had called for a Palestinian state before ties with Israel.\nBahrain and Morocco also recognised Israel in the same year.", "url": "https://www.straitstimes.com/world/middle-east/israel-signs-major-trade-pact-with-gulf-state-uae"}