{"authors": [], "date_download": "2024-10-12 13:36:42", "date_modify": "2024-10-12 13:36:42", "date_publish": "2024-07-31 03:59:02", "description": "ACCRA - Ghana's lawmakers on Tuesday passed a law to give more opportunities to women at the national level, the speaker of parliament said, with a target to increase their participation in governance and decision-making to a minimum of 30% by 2030. Read more at straitstimes.com.", "filename": "world_ghana-parliament-passes-law-to-quicken-womens-empowerment_1728740202.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/ST-logo-placeholder_5.jpg?VersionId=nrdfBEhzRcCiQJNjmVY0zYN12SQh9eyK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_ghana-parliament-passes-law-to-quicken-womens-empowerment_1728740202.html", "title": "Ghana parliament passes law to quicken women's empowerment", "title_page": "Ghana parliament passes law to quicken women's empowerment | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ACCRA - Ghana's lawmakers on Tuesday passed a law to give more opportunities to women at the national level, the speaker of parliament said, with a target to increase their participation in governance and decision-making to a minimum of 30% by 2030.\nMembers of parliament (MPs) unanimously passed the Affirmative Action Gender Bill 2024, ending a process started in 1998 to create an equitable society and mandate efforts to address the socio-cultural, political, economic, and educational imbalances in private and public sectors.\nThe law will take effect when President Nana Akufo-Addo, who supported the measure in Parliament, signs it.\nSpeaker of Parliament Alban Bagbin said the West African nation must now act to implement the requirements of the law, inspired by the 1992 Constitution which says the state must take steps to ensure gender equality and equity.\n\"We need to do more to be able to create this free and just society we are looking for to liberate more of our women,\" Bagbin said.\nThe gold, cocoa and oil producer in February passed one of Africa's most restrictive laws against LGBTQ people, although its implementation has been held up by two legal cases.\nLess than 15% of Ghana's 275-member parliament are women, below the 30% target set out by the United Nations for all countries.\nThe country was ranked 119th in a June report on the global gender gap on political empowerment.\nShamima Muslim, 44, a gender and political activist, said the passage marked the first steps towards \"correcting historical and systemic barriers to participation for women and other marginalized groups.\"\n\"It is a welcome decision that demands further consistent action to achieve the noble ideal of building a just and equitable country,\" she said. REUTERS", "url": "https://www.straitstimes.com/world/ghana-parliament-passes-law-to-quicken-womens-empowerment"}