{"authors": [], "date_download": "2024-10-12 14:03:53", "date_modify": "2024-10-12 14:03:53", "date_publish": "2023-01-07 17:45:07", "description": "The purported attack happened on Orthodox Christmas, when a truce unilaterally declared by Moscow was supposed to be in effect. Read more at straitstimes.com.", "filename": "world_europe_ukrainian-attack-drone-shot-down-over-sevastopol-says-russia-installed-official_1728741833.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/07/RUSSIA-UKRAINE-CONFLICT-WAR-BRIDGE-AFPPICTURESOFTHEYEAR2022-111524_1.jpg?VersionId=s3U_Hy0wkvgE77lLNjSqZ_aY6hAH5H1z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukrainian-attack-drone-shot-down-over-sevastopol-says-russia-installed-official_1728741833.html", "title": "Ukrainian attack drone shot down over Sevastopol, says Russia-installed official", "title_page": "Ukrainian attack drone shot down over Sevastopol, says Russia-installed official | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW – The Russian-installed governor of the Crimean city of Sevastopol said on Saturday that air defences shot down a drone in what he suggested was the latest attempted Ukrainian attack on a port where Russia’s Black Sea Fleet is based.\nMr Mikhail Razvozhaev, Sevastopol’s Russian-backed governor, made the accusation on the Telegram messaging service, alleging that the incident occurred in the early hours of Jan 7, which is Orthodox Christmas.\n“Even the sacred holiday of Christmas was not a reason for these inhuman people to halt their attempts to attack our Hero City,” Mr Razvozhaev wrote.\nThere was no immediate comment on the allegation from Ukraine, which has not in the past confirmed similar alleged incidents but has made clear it reserves the right to do what is necessary to return its own territory.\nRussia annexed Crimea from Ukraine in 2014, and Kyiv says it is determined to return the Black Sea peninsula, along with a swath of eastern Ukraine and other territory that Russian forces have seized since they invaded on Feb 24, 2022.\nCrimea, which Russia says is now its sovereign territory, was one of the launchpads for what Moscow called its “special military operation” and has come under attack several times - most spectacularly in August, when a series of explosions destroyed a group of warplanes at a Russian naval base.", "url": "https://www.straitstimes.com/world/europe/ukrainian-attack-drone-shot-down-over-sevastopol-says-russia-installed-official"}