{"authors": [], "date_download": "2024-10-12 14:03:42", "date_modify": "2024-10-12 14:03:42", "date_publish": "2024-06-08 15:02:37", "description": "Tensions over migration are high across Europe as far-right parties call for tougher controls. Read more at straitstimes.com.", "filename": "world_europe_tensions-flare-on-poland-belarus-border-as-more-migrants-arrive_1728741822.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/08/LYNXMPEK5701Z-2.jpg?VersionId=8ojwXoX6npGoLgADIVlBzFUwpdgzBYc2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_tensions-flare-on-poland-belarus-border-as-more-migrants-arrive_1728741822.html", "title": "Tensions flare on Poland-Belarus border as more migrants arrive", "title_page": "Tensions flare on Poland-Belarus border as more migrants arrive | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BIALOWIEZA, Poland – Surrounded by lush forests, a dozen people huddled near a razor-tipped fence along the Belarus border, waiting for a chance to scale it or push aside its slats to head west into Poland.\nOn the other side, armed Polish border guards and soldiers walked and drove back and forth, keeping a close eye on the group, mostly young men from the Middle East, some of them marked with cuts from the sharp wire.\nTensions over migration are high across Europe as far-right parties calling for tougher controls face off against centrist movements in European Parliament elections, which are taking place in Poland on June 9.\nHere, that stand-off has an extra geopolitical edge. Poland and the European Union have accused Belarus and Russia of trying to spread chaos since 2021 by pushing migrants over the frontier in what Warsaw calls a “hybrid war”. Minsk and Moscow have dismissed the accusations.\nThe numbers of people arriving have been rising recently, according to Polish government figures.\nAnd this week, what Poland sees as a war had a casualty when a soldier patrolling the border died after succumbing to his wounds from a confrontation with migrants on May 28.\nIn response, the centrist, pro-EU government of Prime Minister Donald Tusk has announced plans to re-introduce a no-go zone along the frontier.\n“This border is not safe, unfortunately. The purpose of this zone is to ensure that no one is exposed to the type of attack that Polish soldiers are exposed to,” Deputy Defence Minister Pawel Zalewski told Reuters.\nBack at the fence on June 3, the group kept waiting. Mr Ahmed Lebek, 24, from Aleppo, Syria, said he had been there for more than a month. His brother had given up and gone back to Belarus, though he had had no news from him since.\n“I come from the war to find a good life. But I found it very hard to cross this border,” said Mr Ahmed, 35, an English teacher from Syria. He had tried four times to climb the fence.\nUnder current arrangements, migrants can apply for asylum in EU member Poland once they are on Polish soil.\nOne of them who made it across the fence a day later was Mr Noaman Al-Hemyari, a 24-year-old graphic designer from Yemen.\nIn the forest on the Polish side of the border, he told Reuters he and others had built a ladder from wood, fabric scraps and plastic bags, and used it to scale the barrier when darkness fell.\nHe had originally applied for a Polish student visa from Yemen, which was rejected, before travelling to Moscow, then Belarus and later the border area, where he had spent 22 days.\n“We had been caught by the Belarusians. They hit us... Then they said ‘go’,” Mr Noaman said, visibly relieved and with leaves still in his hair.\n“They (smugglers) said it’s so easy... They lied to us. If I had any idea it’s like this, I wouldn’t have come.”", "url": "https://www.straitstimes.com/world/europe/tensions-flare-on-poland-belarus-border-as-more-migrants-arrive"}