{"authors": [], "date_download": "2024-10-12 13:37:20", "date_modify": "2024-10-12 13:37:20", "date_publish": "2024-08-20 18:32:14", "description": "Israel has accepted a “bridging proposal”, while Hamas says it remains keen on a pause in fighting. Read more at straitstimes.com.", "filename": "world_middle-east_blinken-in-egypt-seeking-progress-towards-ceasefire-gaza-deal_1728740240.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/aiblinken200824.jpg?VersionId=ttKrWxQQ_rgrWUTslV2sS82FdCYGgT2Q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_blinken-in-egypt-seeking-progress-towards-ceasefire-gaza-deal_1728740240.html", "title": "Blinken in Egypt seeking progress towards Gaza ceasefire deal", "title_page": "Blinken in Egypt seeking progress towards Gaza ceasefire deal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ALAMEIN, Egypt – US Secretary of State Antony Blinken pushed for progress towards a Gaza ceasefire and hostage release deal as he visited Egypt on Aug 20, but major areas of dispute have yet to be resolved in talks planned for later this week.\nMr Blinken flew to Egypt from Tel Aviv, where he said Israeli Prime Minister Benjamin Netanyahu accepted a US “bridging proposal” aimed at narrowing the gaps between the two sides after talks last week paused without a breakthrough.\nHe urged Hamas to also accept the proposal as the basis for more talks. The Palestinian militant group has not explicitly rejected the proposal, but said in a statement it overturns what was previously agreed, without specifying how, and accused Israel and its US ally of spinning out negotiations in bad faith.\nIn Egypt, Mr Blinken met President Abdel Fattah El-Sisi, whose country has been helping mediate the on-off Gaza talks for months, along with the United States and Qatar.\nMr Sisi said after the meeting that it was time to put an end to the war and warned of the conflict expanding in the region.\nAt stake is the fate of tiny, crowded Gaza, where Israel’s military campaign has killed more than 40,000 people since October, according to the Palestinian health authorities, and of the remaining hostages being held there.\nThe war in Gaza began on Oct 7, 2023, when Hamas gunmen stormed into southern Israel, killing more than 1,200 people and taking about 250 hostages.\nOn Aug 20, Israel’s military said it recovered the bodies of six hostages from southern Gaza. Only 109 hostages now remain in Gaza, of whom around a third are believed to be dead.\nIn Gaza, Israeli forces battled Hamas-led militants in central and southern areas. At least 21 people were killed early on Aug 20, including at a school housing those displaced by the war.\nIsrael’s military said it struck Hamas militants embedded in the school.\nGaza’s Hamas-run Health Ministry said on Aug 20 that it was still waiting for polio vaccines to arrive after the disease was discovered in the enclave, where most people now live in tents or shelters without proper sanitation.\nIt echoed a call by the United Nations last week for a ceasefire to allow the vaccination campaign.\nMr Blinken has called the latest push for a deal “probably the best, possibly the last opportunity”, and said his meeting with Mr Netanyahu was constructive, adding that it was incumbent on Hamas to accept the bridging proposal.\nOfficials from the US, Hamas, Israel, Egypt and Qatar have not spelt out what is in the proposal or how it differs from previous versions.\n“There are questions of implementation and making sure that it’s clearly understood what each side will do to carry out its commitments,” Mr Blinken said on Aug 19.\nHamas rejected US comments that it was backing away from a deal, saying Egyptian and Qatari mediators knew it dealt positively towards the negotiations and that it was Mr Netanyahu who had always obstructed an agreement with new demands.\nIt said it was still committed to terms it agreed with mediators in July based on a proposal made by the US in May.\nMr Netanyahu denies obstructing a deal.\nMonths of on-off talks have circled the same issues, with Israel saying the war can only end with the destruction of Hamas as a military and political force, and Hamas saying it will only accept a permanent, not temporary, ceasefire.\nThere are disagreements over Israel’s continued military presence inside Gaza, particularly along the border with Egypt, the free movement of Palestinians inside the territory, and the identity and number of prisoners to be freed in a swop.\nEgypt is particularly focused on a security mechanism for the Philadelphi Corridor, the narrow border strip between Egypt and Gaza that Israeli forces seized in May.\nBoth Hamas and Egypt are opposed to Israel keeping troops there, but Mr Netanyahu has said they are needed on the border to stop weapons being smuggled into Gaza.\nEgyptian security sources said the US has proposed an international presence in the area, a suggestion the sources said could be acceptable to Cairo if it was limited to a maximum of six months.\n“The ceasefire in Gaza must be the beginning of broader international recognition of the Palestinian state and the implementation of the two-state solution, as this is the basic guarantor of stability in the region,” Mr Sisi said after meeting Mr Blinken. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/blinken-in-egypt-seeking-progress-towards-ceasefire-gaza-deal"}