{"authors": [], "date_download": "2024-10-12 13:34:52", "date_modify": "2024-10-12 13:34:52", "date_publish": "2024-09-10 21:22:38", "description": "BRUSSELS - Europol is mobilising teams to try to solve the 1996 gangland murder of a criminal from the former Yugoslavia who was found shot dead in Germany, the pan-European police force said on Tuesday. Read more at straitstimes.com.", "filename": "world_europe_europol-tackles-unsolved-1996-gangland-murder-in-germany_1728740092.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/LYNXMPEK890HA-1.jpg?VersionId=8zk0A5Qn2gOw.60TU626uiwidNM8xtEo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_europol-tackles-unsolved-1996-gangland-murder-in-germany_1728740092.html", "title": "Europol tackles unsolved 1996 gangland murder in Germany", "title_page": "Europol tackles unsolved 1996 gangland murder in Germany | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS - Europol is mobilising teams to try to solve the 1996 gangland murder of a criminal from the former Yugoslavia who was found shot dead in Germany, the pan-European police force said on Tuesday.\nThe cold case concerns Nenad Gajanovic, whose body was discovered in a German town in August 1996 next to a stolen red vehicle riddled with bullets.\nEuropol, headquartered in The Hague, said Gajanovic was \"involved in criminal circles\" and known to authorities over burglaries in northern Germany.\nGerman police in the Cloppenburg-Vechta region and Europol are seeking the public's help in solving a case \"with links to serious organised crime\", Europol said in a statement.\n\"Despite extensive investigations over the years, the identity of the suspect(s) remains unknown,\" it said, and authorities hoped new information from the public could finally resolve the case.\nThere was a surge in organised crime in the Balkans during the ethnic wars that followed Yugoslavia's break-up in the 1990s as the region became flooded with weapons and drugs. REUTERS", "url": "https://www.straitstimes.com/world/europe/europol-tackles-unsolved-1996-gangland-murder-in-germany"}