{"authors": [], "date_download": "2024-10-12 14:04:10", "date_modify": "2024-10-12 14:04:10", "date_publish": "2023-12-20 00:51:10", "description": "Among those convicted are a Russian player for a Polish ice hockey club, two Ukrainian lawyers, and a French language teacher. Read more at straitstimes.com.", "filename": "world_europe_poland-convicts-14-foreigners-of-spying-for-russia_1728741850.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/20/POLAND-GERMANY-UKRAINE-RUSSIA-DEFENCE-CONFLICT-163546.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_poland-convicts-14-foreigners-of-spying-for-russia_1728741850.html", "title": "Poland convicts 14 foreigners of spying for Russia", "title_page": "Poland convicts 14 foreigners of spying for Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LUBLIN, Poland - A Polish court on Dec 19 convicted 14 citizens of Russia, Belarus and Ukraine for belonging to a spy ring preparing acts of sabotage on behalf of Moscow.\nThe defendants were charged in November for offences including seeking to derail trains carrying aid to neighbouring Ukraine, and monitoring critical infrastructure and military facilities in the Nato member country.\nThey received jail terms ranging from 13 months to six years.\n“The court found all the defendants guilty of the crimes charged, and found some of them to be operating within an organised criminal group,” Judge Jaroslaw Kowalski said, as he delivered the verdict.\nThe 14 defendants were convicted in absentia after they all pleaded guilty and skipped the trial.\nTwo other alleged members of the spy ring will be tried separately after they withdrew their initial guilty pleas.\nAmong those convicted is a Russian player for a Polish ice hockey club, who was sentenced to two years and 11 months in jail. His arrest in June prompted a “strong protest” from Moscow and a demand for a “comprehensive explanation”.\nRussian state media identified him as Maxim Sergeyev, who played for Zaglebie Sosnowiec in the south-western Polish city of Sosnowiec.\nThe ring also included two Ukrainian lawyers, a political scientist, a French language teacher, a pharmacy technician, and a software engineer, the Rzeczpospolita daily reported.\nPaid in cryptocurrency\nInvestigators said the members of the ring received their orders via the Telegram messaging app and were paid in cryptocurrency.\nPolish media reported they received between US$300 (S$400) and US$10,000 dollars.\nProsecutor Piotr Lopatynski highlighted the role played by Telegram and cryptocurrency.\n“We’re looking at a new, perhaps hitherto unknown way of running or organising a spy network in Poland,” he told reporters.\nMost of the members of the spy ring were detained in March.\nPoland’s then Defence Minister Mariusz Blaszczak had said at the time that “the threat was real”.", "url": "https://www.straitstimes.com/world/europe/poland-convicts-14-foreigners-of-spying-for-russia"}