{"authors": [], "date_download": "2024-10-12 14:05:49", "date_modify": "2024-10-12 14:05:49", "date_publish": "2022-05-16 22:12:31", "description": "The two countries need each of Nato's 30 members to approve their application. Read more at straitstimes.com.", "filename": "world_europe_sweden-launches-nato-bid-seeks-to-overcome-turkish-objections_1728741949.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/17/md_tayyip_17052022.jpg?VersionId=AqoeE5BbPrpJfx8JTA61mAV.WMjkI6kH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_sweden-launches-nato-bid-seeks-to-overcome-turkish-objections_1728741949.html", "title": "Sweden and Finland's plans for Nato membership hit snag as Turkey says no", "title_page": "Sweden and Finland's plans for Nato membership hit snag as Turkey says no | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "STOCKHOLM (REUTERS) - Sweden will formally apply for Nato membership in the next few days, Prime Minister Magdalena Andersson said on Monday (May 16), but its accession process, and that of Finland, hit a snag when Nato member Turkey’s president said he would not approve either bid.\nSweden and Finland need each of Nato’s 30 members to approve their applications. The ratification process had been expected to take up to a year, though Turkey’s objections have thrown that into doubt.\nAt a news conference, Turkish President Tayyip Erdogan said Sweden and Finland should not bother sending delegations to Ankara to persuade Turkey to support their bids.\n“Neither of these countries have a clear, open attitude towards terrorist organisations,” Erdogan said. “How can we trust them?” He called Sweden a “hatchery” for terrorist organisations with terrorists in parliament.\nRussia’s invasion of Ukraine has shaken up Europe’s security architecture and forced Sweden and Finland to choose sides after staying out of the US-led Nato alliance during the Cold War.\nSweden’s Social Democrat government, worried the country will be vulnerable while its application is considered, had been hoping for a quick ratification process.\nBut Turkey’s objections, which Nato leaders initially hoped would not cause a major delay, now look to present a serious obstacle.\nA spokesperson for Swedish Foreign Minister Ann Linde declined to comment.\nHistoric decision\nThe decisions by Finland and Sweden to apply to Nato set the two countries on a path toward ending policies of military non-alignment that had defined their defence strategies since the start of the Cold War.\n“We are leaving one era behind us and entering a new one,” Andersson told a news conference on Monday.\nShe said Sweden’s application could be submitted in the next couple of days and would be synchronised with Finland.\n“Nato will strengthen Sweden, Sweden will strengthen Nato,”she said.\nThe decision to abandon the military non-alignment that has been a central tenet of Swedish national identity for two centuries reflects a sea change in public perception in the Nordic region following Russia’s attack on Ukraine.\nAndersson said Sweden did not want permanent Nato military bases or nuclear weapons on its territory if its membership was approved.\nRussian President Vladimir Putin offered a mild response to the decisions, saying: “As far as expansion goes, including new members Finland and Sweden, Russia has no problems with these states – none.”\nHe did however accuse the United States of using the enlargement in an “aggressive” way to aggravate an already difficult global security situation. He said Russia would respond if the alliance moves weapons or troops forward.\nGeneral Micael Byden, commander of the Swedish Armed Forces, told a news conference the decision to apply was right from a military strategic perspective and that defending Sweden, unilaterally or in cooperation with other states, would be easier with Sweden part of Nato.\n“I know, based on my conversations and the relations that I have with my counterparts, that Sweden is welcome in Nato. But we are not only welcome – I also know that Sweden as a member makes Nato stronger,” Byden said.\nSweden has received assurances of support from the United States, the United Kingdom, Germany and France but not any legally binding guarantees of military aid.\nIn a joint statement on Monday, Nordic neighbours Denmark, Norway and Iceland also pledged support.\nMoscow calls its invasion of Ukraine a “special military operation” to rid the country of fascists, an assertion Kyiv and its allies say is a baseless pretext for an unprovoked war.", "url": "https://www.straitstimes.com/world/europe/sweden-launches-nato-bid-seeks-to-overcome-turkish-objections"}