{"authors": [], "date_download": "2024-10-12 14:04:39", "date_modify": "2024-10-12 14:04:39", "date_publish": "2022-12-23 03:00:07", "description": "The man is being charged with treason. Read more at straitstimes.com.", "filename": "world_europe_german-intelligence-official-held-in-russia-spying-probe_1728741879.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/23/2022-12-22T183729Z69775107RC25BY9MN9ABRTRMADP3UKRAINE-CRISIS-GERMANY-RUSSIA_2.JPG?VersionId=MrBSWbs1dCUY8g_j1rhCWC370mztAj32", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_german-intelligence-official-held-in-russia-spying-probe_1728741879.html", "title": "Germany accuses one of its intelligence officers of being a Russian spy", "title_page": "Germany accuses one of its intelligence officers of being a Russian spy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - A member of Germany’s Federal Intelligence Service has been arrested on suspicion of spying for Russia and is being charged with treason, national prosecutors said on Thursday.\nGermany’s federal public prosecutor office said in its statement that the suspect, identified as “Carsten L” under German privacy laws, was accused of “passing on information he had obtained in the course of his professional activities to a Russian intelligence service”.\nOn Thursday, a federal judge approved keeping the defendant in custody.\nHe was arrested last week, but German authorities have released few details.\nThe Federal Intelligence Service head Bruno Kahl said in a statement that releasing more information would “offer an advantage to an adversary with the intention of harming Germany”.\nThe Federal Intelligence Service, the BND, focuses on foreign intelligence, like the Central Intelligence Agency, and its mission, according to its website, is to compile “political, economic and military foreign intelligence”.\nThe investigation comes after a string of arrests across Europe of others accused of being Russian spies.\nMost of the cases involve people who prosecutors say were embedded in an organisation or community to enable long-term espionage or recruitment.\nIn November, Norwegian authorities announced they had arrested a man posing as a Brazilian academic at a university on charges of gathering intelligence for Russia.\nIn June, an intern at the International Criminal Court, also with a Brazilian passport, was arrested in The Hague and charged with spying for Russia.\nIn late November, a Swedish raid caught a Russian couple who were accused of espionage. And earlier this week, Austrian investigators arrested a Greek resident of Vienna on suspicion of espionage for Russia.\nThe arrest in Germany may prove unusual, however, in that the accused mole was found inside the country’s own intelligence agency, raising the risk that contacts and informants within Russia may have been betrayed.\nFederal prosecutors said, in a statement, they searched the suspect’s home and workplace.\nMr Kahl, the BND president, described Russia as an actor “whose unscrupulousness and willingness to use violence we have to reckon with”.\nA number of other Russian spies, who were not undercover agents but officially worked for intelligence services, have been rounded up and expelled in recent years, possibly making Russia more reliant on sleeper agents, especially as the Kremlin’s war effort in Ukraine has faltered.\nSecurity analysts in Europe say the arrests have also made Moscow push more aggressively for intelligence from its remaining sources.\nGermany’s last case of a double agent was in 2014, when a member of the intelligence services was put in prison for eight years for espionage, mostly for passing information to the CIA, and for offering himself to Russian secret services. NYTIMES", "url": "https://www.straitstimes.com/world/europe/german-intelligence-official-held-in-russia-spying-probe"}