{"authors": [], "date_download": "2024-10-12 13:51:57", "date_modify": "2024-10-12 13:51:57", "date_publish": "2024-02-21 18:06:00", "description": "ZURICH - Switzerland is increasing its efforts to crack down on companies and individuals who are using the neutral country to circumvent sanctions imposed on Russia. Read more at straitstimes.com.", "filename": "world_europe_swiss-cracking-down-on-attempts-to-evade-russian-sanctions_1728741117.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/21/LYNXNPEK1K0BJ-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_swiss-cracking-down-on-attempts-to-evade-russian-sanctions_1728741117.html", "title": "Swiss cracking down on attempts to evade Russian sanctions", "title_page": "Swiss cracking down on attempts to evade Russian sanctions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ZURICH - Switzerland is increasing its efforts to crack down on companies and individuals who are using the neutral country to circumvent sanctions imposed on Russia.\nThe State Secretariat for Economic Affairs (SECO) has set up a specialist team to investigate and enforce sanctions which Bern imposed following Moscow's invasion of Ukraine two years ago.\nThe move comes after Switzerland last year came under fire for not doing enough to prevent Russians hiding money in Swiss banks.\nAround 7.7 billion Swiss francs of assets had been frozen at the end of last year, a fraction of the 150 billion francs of Russian money estimated to be held in Swiss banks.\nSECO said on Wednesday that 230 potential sanctions breaches have been reported to it since the invasion following tip-offs from financial companies, customs officials and other countries.\nThis led to 47 proceedings, with 20 cases being dropped, and nine fines of varying severity handed out. Some 18 cases are still active, with new cases being added all the time, SECO said.\nThe majority of cases relate to breaches of bans on exporting luxury goods or products of economic importance to Russia which could support Moscow's war effort, a SECO spokesman said.\nWhile SECO carries out the more simple investigations, the more complicated cases are handed over to the Office of the Attorney General (OAG), which last week said it was looking into possible breaches.\nSwiss broadcaster RTS said last week the OAG has also been called into two cases involving commodities trading companies. The OAG declined to comment on the cases.\n\"The complexity of these cases is very high,\" said Simon Pluess, the head of export controls and sanctions at SECO. \"For example there are often companies hiding behind other companies and we have to establish who the beneficial owner is.\"\nOther countries were now recognising that Switzerland was taking sanctions seriously, he said.\n\"When we talk with international partners they have recognised that Switzerland is doing a lot,\" Pluess said. \"Switzerland is also sharing information with other countries. The criticism has mostly disappeared.\" REUTERS", "url": "https://www.straitstimes.com/world/europe/swiss-cracking-down-on-attempts-to-evade-russian-sanctions"}