{"authors": [], "date_download": "2024-10-12 13:39:21", "date_modify": "2024-10-12 13:39:21", "date_publish": "2023-10-05 20:34:23", "description": "Afghanistan's embassy in New Delhi continues to function, India's foreign ministry said on Thursday, days after the embassy announced that it was suspending operations. Read more at straitstimes.com.", "filename": "world_india-says-afghan-embassy-still-open-despite-suspension-announcement_1728740361.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/05/LYNXMPEJ940HW-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_india-says-afghan-embassy-still-open-despite-suspension-announcement_1728740361.html", "title": "India says Afghan embassy still open despite suspension announcement", "title_page": "India says Afghan embassy still open despite suspension announcement | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI -Afghanistan's embassy in New Delhi continues to function, India's foreign ministry said on Thursday, days after the embassy announced that it was suspending operations.\nIndia does not recognise Afghanistan's Taliban government though has allowed the ambassador and mission staff, who were appointed by the government of ousted Afghan President Ashraf Ghani, to issue visas and handle trade matters.\nThe embassy had announced last week that it would cease operations in India from Oct. 1, listing a series of allegations including that it received no support from the Indian government.\nRejecting the claims, Indian foreign ministry spokesperson Arindam Bagchi said, \"I don't think they are factually correct\".\n“Our understanding is that the embassy in New Delhi is functioning,\" Bagchi told reporters. He added that the foreign ministry had been informed of the embassy's decision to halt operations and was in touch with Afghan diplomats at the embassy and consulates in Mumbai and Ahmedabad.\n“We are also aware that there has been a prolonged absence of the ambassador, and that a large number of Afghan diplomats have left India in the recent past,” Bagchi said. REUTERS", "url": "https://www.straitstimes.com/world/india-says-afghan-embassy-still-open-despite-suspension-announcement"}