{"authors": [], "date_download": "2024-10-12 13:27:48", "date_modify": "2024-10-12 13:27:48", "date_publish": "2024-07-01 19:00:00", "description": "They are concerned that a change could soon bring the virus closer to becoming transmissible between humans. Read more at straitstimes.com.", "filename": "world_scientists-wary-of-bird-flu-pandemic-unfolding-in-slow-motion_1728739668.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/01/2024-05-28T102331Z1976295349RC2RL0AHCPEWRTRMADP3HEALTH-BIRDFLU-NETHERLANDS-VACCINES.JPG?VersionId=tXsYfMm31qMBKelKfEaCf1iDZULIuizZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_scientists-wary-of-bird-flu-pandemic-unfolding-in-slow-motion_1728739668.html", "title": "Scientists wary of bird flu pandemic ‘unfolding in slow motion’", "title_page": "Scientists wary of bird flu pandemic ‘unfolding in slow motion’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CHICAGO – Scientists tracking the spread of bird flu are increasingly concerned that gaps in surveillance may keep them several steps behind a new pandemic, according to Reuters interviews with more than a dozen leading disease experts.\nMany of them have been monitoring the new subtype of H5N1 avian flu in migratory birds since 2020. But the spread of the virus to 129 dairy herds in 12 US states signals a change that could bring it closer to becoming transmissible between humans. Infections also have been found in other mammals, from alpacas to house cats.\n“It almost seems like a pandemic unfolding in slow motion,” said Professor Scott Hensley, who teaches microbiology at the University of Pennsylvania. “Right now, the threat is pretty low… but that could change in a heartbeat.”\nThe earlier the warning of a jump to humans, the sooner global health officials can take steps to protect people by launching vaccine development, wide-scale testing and containment measures.\nFederal surveillance of US dairy cows is currently limited to testing herds before they cross state lines. State testing efforts are inconsistent, while testing of people exposed to sick cattle is scant, government health officials and pandemic flu experts told Reuters.\n“You need to know which are the positive farms, how many of the cows are positive, how well the virus spreads, how long do these cows remain infectious, the exact transmission route,” said Dutch flu virologist Ron Fouchier of the Erasmus Medical Centre in Rotterdam.\nDr Jeanne Marrazzo, director of the US National Institute of Allergy and Infectious Diseases, said surveillance for humans is “very, very limited”.\nShe described the US Centres for Disease Control and Prevention’s (CDC) human flu surveillance network as “really a passive reporting, passive presentation mechanism”. The US Department of Agriculture (USDA) is more proactive in testing cows, but does not make public which farms are affected, she said.\nSeveral experts said differing approaches from animal and human health agencies could hamper a quicker response.\n“If you were designing the system from scratch, you would have one agency,” said Dr Gigi Gronvall, a biosecurity expert at the Johns Hopkins Centre for Health Security. “This is not the only example where we have environmental or animal problems that cause human problems.”\nA USDA spokesman said the agency is working “around the clock” with CDC and other partners in a “whole-of-government response”, adding that ongoing research shows “America’s food supply remains safe, sick cows generally recover after a few weeks, and the risk to human health remains low”.\nThe CDC in a statement said it, the USDA and state and local health departments across the country “have been preparing for the emergence of a novel influenza virus for nearly two decades and continually monitor for even the smallest changes in the virus”.\n‘A note of caution’\nSome pandemics, including Covid-19, arrive with little warning.\nIn the last flu pandemic, caused by H1N1 in 2009, the virus and its predecessors had first spread among animals for several years, Prof Hensley said, but more surveillance would have helped health the authorities prepare.\nThree people in the US have tested positive for H5N1 avian flu since late March after contact with cows, experiencing mild symptoms. One person in Mexico was infected with a separate H5 strain not previously seen in humans, and with no known exposure to animals. Other cases were reported in India, China and Australia, caused by different strains.\nThe World Health Organisation says H5N1‘s risk to humans is low because there is no evidence of human transmission. Some tools are available if that changes, including limited amounts of existing H5N1 vaccine and antiviral medications like Tamiflu.\nThere are mechanisms to launch larger-scale production of tests, treatments and vaccines, if needed, said the UN agency’s head of flu, Dr Wenqing Zhang.\nOther experts said there is sufficient concern to start preparing for potential spread in humans, although triggers for taking action differ depending on the role played in the response, said Mr Richard Hatchett, chief executive of the Coalition for Epidemic Preparedness Innovations (CEPI). His organisation acted early on funding Covid-19 vaccine development, and is now in talks with research partners about H5N1.\nCEPI aims to create a library of prototype vaccines for pathogens with pandemic potential. This would help drugmakers initiate large-scale production and distribute shots where necessary within 100 days of an outbreak.\nSome countries are taking steps to protect people against H5N1. The United States and Europe are securing doses of “pre-pandemic” flu vaccine that could be used for high-risk groups, including farm or lab workers. Finland is expected to become the first country to inoculate fur and poultry farm workers, as well as animal health response workers.\nExpanding vaccine access is also complex, said the WHO’s Dr Zhang. Manufacturers of potential pandemic flu vaccines make seasonal flu shots and cannot produce both at once, she said.\nSince most flu vaccines are made using virus grown in eggs, it could take up to six months to produce pandemic shots. The US is in talks with Moderna to use their faster mRNA technology for pandemic flu shots.\nThe experts all acknowledged a need to balance acting quickly to avert a threat versus overreacting.\n“We want to sound a note of caution,” said Dr Wendy Barclay, a virologist at University College London who researches avian flu for the UK Health Security Agency, “without saying the world is about to end”. REUTERS", "url": "https://www.straitstimes.com/world/scientists-wary-of-bird-flu-pandemic-unfolding-in-slow-motion"}