{"authors": [], "date_download": "2024-10-12 13:34:21", "date_modify": "2024-10-12 13:34:21", "date_publish": "2024-09-14 14:55:00", "description": "He died on Sept 11, aged 86, after a long battle with cancer. Read more at straitstimes.com.", "filename": "world_peru-bids-farewell-to-divisive-ex-leader-fujimori_1728740061.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/14/2024-09-13T235325Z1886135233RC2ZZ9AAGBOARTRMADP3PERU-POLITICS-FUJIMORI.JPG?VersionId=7GWWJ24N1gX329lJN8TfDxHLuSkyDFeQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_peru-bids-farewell-to-divisive-ex-leader-fujimori_1728740061.html", "title": "Peru bids farewell to divisive ex-leader Fujimori", "title_page": "Peru bids farewell to divisive ex-leader Fujimori | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LIMA - Peru will on Sept 14 lay to rest polarising former president Alberto Fujimori, who ruled with an iron fist in the 1990s and later spent 16 years in prison for crimes against humanity.\nMr Fujimori, who had Japanese heritage, was revered by many for crushing leftist guerrillas and for boosting the economy, but reviled by others as an autocrat who signed off on brutal human rights abuses.\nHe died on Sept 11, aged 86, after a long battle with cancer.\nAfter lying in state for three days he will be buried on Sept 14, following a state funeral.\nDebated legacy\nThe death of the ex-leader, who loomed large over Peruvian politics long after he faxed in his resignation from exile in Japan in 2000, triggered a vigorous debate on social media over his legacy.\nThousands of admirers queued at the National Museum in Lima on Sept 12 and 13 to pay their respects at his open casket.\n“He defeated terrorism and in reality was the best president Peru could have had,” Ms Jackeline Vilchez, from a family of self-described “fujimoristas”, said outside the former leader’s residence, where she came to pay her respects.\nBut relatives of the victims of army massacres carried out on his watch lamented that he went to the grave without showing remorse for their deaths.\n“He left without asking forgiveness from their families, he made a mockery of us,” Ms Gladys Rubina, the sister of one of the civilian victims, told AFP, sobbing.\nCrimes against humanity\nMs Fujimori, an engineer by training, worked as a university math professor before entering politics.\nIn 1990, he caused a surprise by defeating acclaimed writer Mario Vargas Llosa to win the presidency.\nHis neoliberal economic policies won him the support of the ruling class and international financial institutions.\nHe also won praise for crushing a brutal insurgency by Shining Path and Tupac Amaru leftist rebels in a conflict that left more than 69,000 people dead and 21,000 missing between 1980 and 2000, according to a government truth commission.\nBut the brutal tactics employed by the military saw him spend his twilight years in jail.\nIn 2009, he was sentenced to 25 years in prison for crimes against humanity over two massacres carried out in the name of Peru’s so-called war on terror – one at a house party, the other in a university dormitory – that left 25 people dead.", "url": "https://www.straitstimes.com/world/peru-bids-farewell-to-divisive-ex-leader-fujimori"}