{"authors": [], "date_download": "2024-10-12 13:46:29", "date_modify": "2024-10-12 13:46:29", "date_publish": "2020-03-11 20:46:39", "description": "TEHERAN (AFP) - Iran on Wednesday reported 63 new deaths from the novel coronavirus, the highest single-day toll in the three weeks since the Islamic republic announced the first deaths from the outbreak. Read more at straitstimes.com.", "filename": "world_middle-east_iran-announces-63-new-virus-deaths-taking-total-to-354_1728740789.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/03/11/yq-tehran-11032020.jpg?VersionId=uuxvOJhL_eDlJ_xluR8YIi5Jdb8ErY2Z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_iran-announces-63-new-virus-deaths-taking-total-to-354_1728740789.html", "title": "Iran announces 63 new virus deaths, taking total to 354", "title_page": "Iran announces 63 new virus deaths, taking total to 354 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TEHERAN (AFP) - Iran on Wednesday (March 11) reported 63 new deaths from the novel coronavirus, the highest single-day toll in the three weeks since the Islamic republic announced the first deaths from the outbreak.\nThe outbreak of the coronavirus in Iran is one of the deadliest outside China, where the disease originated.\n\"Based on new lab results, we have identified 958 new confirmed cases of COVID-19 infection in the country, bringing the total number of cases to 9,000,\" health ministry spokesman Kianoush Jahanpour said in a televised news conference.\n\"Unfortunately in the past 24 hours, we have had reports of 63 deaths and overall 354 have lost their lives\" to the virus, he added.\nThe capital Teheran had the most new infections with 256 cases. The central province of Isfahan followed with 170, and Semnan, to the east of Teheran, had 63. Bushehr as well as Kohgiluyeh and Boyerahmad in the southwest had no new cases.\nIran announced its first coronavirus deaths, in the Shiite holy city of Qom, on Feb 19. It is yet to officially impose quarantines but authorities have repeatedly called on people to refrain from travelling.\nThey have closed schools and universities and resorted to shutting hotels and other tourist accommodation to discourage travel.\nJahanpour said the number of infections was still on the rise and that Iran would not be \"celebrating the end of coronavirus\" during the country's new year holidays, which start on March 20.\nPresident Hassan Rouhani also called on people to limit their movements in order to contain the virus.\n\"Movements must be reduced to the possible minimum, unless it is absolutely necessary,\" Rouhani said during a cabinet meeting, flanked by ministers wearing masks.\n\"Everyone must pay attention to protocols and be careful so the virus's spread can be contained,\" he added.\nRouhani also warned against \"exaggerating\" the number of dead through non-official tolls and causing \"fear and anxiety\" among the public.\nApart from direct fatalities, 84 people have died from methanol poisoning in Iran after rumours circulated that drinking alcohol can help cure or protect from the virus.\nIn some provinces such as Khuzestan in the southwest, the death toll from poisoning is higher than that from the coronavirus.\nSeparately, Iran's foreign ministry expressed concern over the health of Iranian prisoners in the United States because of what it called President Donald Trump's mismanagement of the coronavirus outbreak there.\nSpokesman Abbas Mousavi made the remarks after the United States demanded the release of American prisoners from virus-hit Iran.\n\"We're worried about the health of some Iranian prisoners taken hostage\" in the US, he told a news conference that was held online because of the outbreak.", "url": "https://www.straitstimes.com/world/middle-east/iran-announces-63-new-virus-deaths-taking-total-to-354"}