{"authors": [], "date_download": "2024-10-12 14:01:14", "date_modify": "2024-10-12 14:01:14", "date_publish": "2024-04-23 06:07:06", "description": "He also noted the role of House Speaker, House Minority Leader in securing passage of military aid Bill. Read more at straitstimes.com.", "filename": "world_europe_ukraines-zelenskiy-expresses-gratitude-to-biden-says-deal-on-atacms-in-place_1728741674.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/23/LYNXNPEK3L0SC-1.jpg?VersionId=WwfzstTK4gheY5F.UwgRCkx7pUqUNvl.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraines-zelenskiy-expresses-gratitude-to-biden-says-deal-on-atacms-in-place_1728741674.html", "title": "Ukraine’s Zelensky expresses gratitude to Biden, says deal in place for long-range missile systems", "title_page": "Ukraine’s Zelensky expresses gratitude to Biden, says deal in place for long-range missile systems | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Ukrainian President Volodymyr Zelensky said on April 22 that he had expressed gratitude to US President Joe Biden for support and leadership in a telephone conversation.\nMr Zelensky, writing on the Telegram messaging app, said he noted in the conversation the role of House of Representatives Speaker Mike Johnson and House Minority leader Hakeem Jeffries in securing passage of a major military aid Bill to Ukraine.\nLater, in his nightly video address, Mr Zelensky said the legislation, still to be approved by the US Senate and signed by Mr Biden, clarified that Ukraine would be receiving the long-range ATACMS (Army Tactical Missile Systems) it has long sought.\n“In the agreement on ATACMS for Ukraine, all the details are in place,” he said. “Thank you, Mr President, thank you Congress, thank you America.”\nUS Senate Intelligence Committee chair Mark Warner told CBS programme Face The Nation on April 21 that the ATACMS were among equipment that should be on its way to Ukraine this week.\nATACMS are long-range guided missiles. The White House in October 2023 confirmed that it had provided Kyiv with a type of ATACMS capable of hitting targets up to 165km away.\nMr Zelensky also told Mr Biden about “Russian air terror through thousands of missiles, drones and bombs” and noted a strike on a television tower in Ukraine’s second-largest city of Kharkiv, which occurred minutes before their conversation.\nThe Ukrainian President also reported, in a post on the Telegram messaging app, that it had outlined to a delegation of visiting US members of Congress Kyiv’s most urgent defence needs, particularly enhanced air defence. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraines-zelenskiy-expresses-gratitude-to-biden-says-deal-on-atacms-in-place"}