{"authors": [], "date_download": "2024-10-12 13:44:22", "date_modify": "2024-10-12 13:44:22", "date_publish": "2023-12-20 16:39:53", "description": "Kuwait's new emir, Sheikh Meshal al-Ahmad al-Sabah, forcefully castigated lawmakers and executive authorities on Wednesday for what he said was harm to the interests of the country and the people in his first remarks after he was formally sworn in. Read more at straitstimes.com.", "filename": "world_kuwaits-new-emir-sworn-in-demands-comprehensive-review_1728740662.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/20/LYNXMPEJBJ06G-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_kuwaits-new-emir-sworn-in-demands-comprehensive-review_1728740662.html", "title": "Kuwait's new emir sworn in, demands comprehensive review", "title_page": "Kuwait's new emir sworn in, demands comprehensive review | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUWAIT -Kuwait's new emir, Sheikh Meshal al-Ahmad al-Sabah, forcefully castigated lawmakers and executive authorities on Wednesday for what he said was harm to the interests of the country and the people in his first remarks after he was formally sworn in.\nAfter swearing the constitutional oath in the National Assembly on Wednesday, Sheikh Meshal criticised the authorities' decision to appoint people to positions \"that are not consistent with the simplest rules of justice and fairness\".\nHe also objected to the pardoning of several convicts and opposition figures, and the damaging of the Kuwaiti identity.\nThe emir said it was \"necessary to review our current reality, especially in terms of security, the economy and living conditions\".\nHe stressed \"the importance of follow-up, responsible oversight, and objective accountability within the framework of the constitution and the law for negligence, dereliction and tampering with the interests of citizens.\"\nKuwait will maintain its Gulf, regional and international commitments, Sheikh Meshal said.\nSheikh Meshal, 83, was Kuwait's day-to-day ruler during much of his half-brother Sheikh Nawaf's reign due to his ill-health. His predecessor died on Saturday. REUTERS", "url": "https://www.straitstimes.com/world/kuwaits-new-emir-sworn-in-demands-comprehensive-review"}