{"authors": [], "date_download": "2024-10-12 14:04:40", "date_modify": "2024-10-12 14:04:40", "date_publish": "2023-05-10 00:29:22", "description": "Moscow routinely denies carrying out cyberespionage operations. Read more at straitstimes.com.", "filename": "world_united-states_fbi-says-it-has-sabotaged-hacking-tool-created-by-elite-russian-spies_1728741880.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/10/bthack20230510.jpg?VersionId=IP3Ipc.l7GcUlX8Nfff7rQwJ_4doH41m", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_fbi-says-it-has-sabotaged-hacking-tool-created-by-elite-russian-spies_1728741880.html", "title": "FBI says it has sabotaged hacking tool created by elite Russian spies", "title_page": "FBI says it has sabotaged hacking tool created by elite Russian spies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The FBI has sabotaged a suite of malicious software used by elite Russian spies, US authorities said on Tuesday, providing a glimpse of the digital tug-of-war between two cyber superpowers.\nSenior law enforcement officials said FBI technical experts had identified and disabled malware wielded by Russia’s FSB security service against an undisclosed number of American computers, a move they hoped would deal a death blow to one of Russia’s leading cyber spying programmes.\n“We assess this as being their premier espionage tool,” one of the US officials told journalists ahead of the release. He said Washington hoped the operation would “eradicate it from the virtual battlefield.”\nThe official said the FSB spies behind the malware, known as Snake, are part of a notorious hacking group tracked by the private sector and known as “Turla.”\nThe group has been active for two decades against a variety of Nato-aligned targets, US government agencies and technology companies, a senior FBI official said.\nRussian diplomats did not immediately return a message seeking comment. Moscow routinely denies carrying out cyberespionage operations.\nUS officials spoke to journalists on Tuesday ahead of the news release on condition that they not be named. Similar announcements, revealing the FSB cyber disruption effort, were made by security agencies in the UK, Canada, Australia and New Zealand.\nTurla is widely considered one of the most sophisticated hacking teams studied by the security research community.\n“They have persisted in the shadows by focusing on stealth and operational security,” said John Hultquist, vice president of threat analysis at US cybersecurity company Mandiant. “They are one of the hardest targets we have.” REUTERS", "url": "https://www.straitstimes.com/world/united-states/fbi-says-it-has-sabotaged-hacking-tool-created-by-elite-russian-spies"}