{"authors": [], "date_download": "2024-10-12 13:35:08", "date_modify": "2024-10-12 13:35:08", "date_publish": "2024-08-06 04:26:06", "description": "BOGOTA - Colombia's armed forces have restarted operations against leftist rebel group the National Liberation Army (ELN), Defense Minister Ivan Velasquez said on Monday. Read more at straitstimes.com.", "filename": "world_colombia-armed-forces-restart-military-operations-against-eln-rebels_1728740108.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/06/LYNXMPEK740VM-3.jpg?VersionId=mUVkUTkUSseRZPGjWrUmFUhz8aQJGYpr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_colombia-armed-forces-restart-military-operations-against-eln-rebels_1728740108.html", "title": "Colombia armed forces restart military operations against ELN rebels", "title_page": "Colombia armed forces restart military operations against ELN rebels | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BOGOTA - Colombia's armed forces have restarted operations against leftist rebel group the National Liberation Army (ELN), Defense Minister Ivan Velasquez said on Monday.\nThe decision to restart military operations comes after a six-month ceasefire between the two sides ended on Saturday.\nThe government of President Gustavo Petro, Colombia's first left-wing leader, restarted peace talks with the ELN at the end of 2022 as part of its total peace policy, where it is looking to end the country's six-decade conflict that has left more than 450,000 dead.\n\"There is no ceasefire,\" Velasquez told journalists. \"This means that offensive operations are back on and that is the order of the commander of the military to all forces, and also of the director of the national police.\"\nPeace talks froze in recent months and the ELN ended its suspension of kidnappings - which security sources say provide the group with much-needed financing - representing the return of one of the most feared elements of Colombia's conflict.\nNegotiations between previous governments and the ELN - considered a terrorist organization by the U.S. and the European Union - broke down due to the group's radical positions, diffuse chain of command and dissent in its ranks.\nColombia's government recently opted to end a ceasefire with certain elements within the Estado Mayor Central, a dissident faction of the former Revolutionary Armed Forces of Colombia (FARC) rebels who reject a 2016 peace deal with the state.\nHowever, officials recently entered into separate talks with the Segunda Marquetalia, another dissident FARC faction that abandoned the peace process and returned to arms. REUTERS", "url": "https://www.straitstimes.com/world/colombia-armed-forces-restart-military-operations-against-eln-rebels"}