{"authors": [], "date_download": "2024-10-12 13:44:14", "date_modify": "2024-10-12 13:44:14", "date_publish": "2024-04-17 18:20:00", "description": "Overcoming dust storms, treacherous terrain and a dead sensor, Ingenuity defied all expectations. Read more at straitstimes.com.", "filename": "world_a-long-goodbye-nasa-mars-helicopter-sends-last-message-to-earth_1728740654.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/17/Mars20Helicopter2028129.jpg.JPEG?VersionId=MxmFH1ik1iarVeGxYM9GazMsKqPFIOCj&h=15533b3c", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_a-long-goodbye-nasa-mars-helicopter-sends-last-message-to-earth_1728740654.html", "title": "‘A long goodbye’: Nasa Mars helicopter sends last message to Earth", "title_page": "‘A long goodbye’: Nasa Mars helicopter sends last message to Earth | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Nasa’s Ingenuity Mars helicopter has transmitted its final message to Earth and will now serve as an immobile data-gathering unit on the red planet’s surface, the space agency said on April 16.\nThe tissue box-sized aircraft made history by achieving the first powered flight on another planet after hitching a ride under the belly of the Perseverance rover, which first lifted off the surface on April 19, 2021.\n“A long goodbye,” Nasa said on social media site X.\n“Ingenuity’s team received their final message from the #MarsHelicopter, which will now serve as a stationary testbed, collecting data that could benefit future explorers of the Red Planet.”\nOriginally intended only to prove flight was possible in the ultra-thin Martian atmosphere through five test runs, Ingenuity defied all expectations.\nIt was deployed a total of 72 times, logging more than two hours of flight time in short hops, overcoming dust storms, treacherous terrain, a dead sensor and frigid conditions.\nIts mission evolved to act as an aerial scout to assist its wheeled companion in searching for signs of ancient microbial life from billions of years ago, when Mars was much wetter and warmer than today.\nDesigned to operate in springtime, its solar-powered heating system was unable to remain on throughout the night in winter. That led to the flight computer freezing over and forced engineers to devise new protocols.\nNasa said on April 15 it was attempting to bring Martian rocks collected by the Perseverance rover back to Earth faster and more cheaply, with the agency facing mounting criticism for going massively over budget.\nThe effort comes as China is making progress towards a simpler “grab-and-go” sample return mission to the red planet “around 2030”, according to state media, which would make it the first nation to achieve the feat. AFP", "url": "https://www.straitstimes.com/world/a-long-goodbye-nasa-mars-helicopter-sends-last-message-to-earth"}