{"authors": [], "date_download": "2024-10-12 14:05:48", "date_modify": "2024-10-12 14:05:48", "date_publish": "2024-04-03 22:12:32", "description": "MADRID - The European Central Bank could start cutting interest rates in June after a continued slowdown in inflation in the euro zone, ECB policymaker Pablo Hernandez de Cos said on Wednesday. Read more at straitstimes.com.", "filename": "world_europe_ecbs-central-scenario-points-to-interest-rate-cut-in-june-de-cos-says_1728741948.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/03/LYNXNPEK320LL-1.jpg?VersionId=CzHyBm3Ql.hOWLoKinLlH.y1SggLhjWj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ecbs-central-scenario-points-to-interest-rate-cut-in-june-de-cos-says_1728741948.html", "title": "ECB's central scenario points to interest rate cut in June, De Cos says", "title_page": "ECB's central scenario points to interest rate cut in June, De Cos says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MADRID - The European Central Bank could start cutting interest rates in June after a continued slowdown in inflation in the euro zone, ECB policymaker Pablo Hernandez de Cos said on Wednesday.\nHis comments come after the euro zone inflation subsided unexpectedly last month, solidifying the case for the ECB to start lowering borrowing costs from record highs.\n\"As of today, the central scenario is that June could be the first interest rate cut,\" De Cos told a financial event in Barcelona.\nConsumer price growth in the 20 nations sharing the euro currency slowed to 2.4% in March from 2.6% a month earlier, defying expectations for a steady rate as food, energy and industrial goods prices all pulled the headline figure lower.\nUnderlying inflation, closely watched by the ECB to gauge the durability of price pressures, meanwhile fell to 2.9% from 3.1%, coming below expectations for 3.0%, data from the EU's statistic's agency showed on Wednesday.\n\"The data has been a positive one, a further reduction in inflation, also in core inflation. Most importantly, it is compatible with the ECB's March forecast,\" the also Bank of Spain Governor said.\nThe ECB has been cautious in starting to ease policy because it only expects inflation back at its 2% target next year.\nIn its quarterly economic projections released in March, the ECB cut its forecast for price growth this year from 2.7% to 2.3% and said it now expects inflation to fall to 1.9% in summer 2025.\n\"Let me stress that this is not an unconditional projection, that we will obviously continue to receive information that will have to be carefully analysed,\" De Cos said.\nMeeting next week, the central bank is expected to acknowledge the improved outlook but policymakers are unlikely to cut rates straight away.\nInvestors see almost no chance of a cut on April 11 but have fully priced in a move for June, followed by another two or three steps later this year. REUTERS", "url": "https://www.straitstimes.com/world/europe/ecbs-central-scenario-points-to-interest-rate-cut-in-june-de-cos-says"}