{"authors": [], "date_download": "2024-10-12 14:07:23", "date_modify": "2024-10-12 14:07:23", "date_publish": "2022-09-25 23:56:50", "description": "It is the latest US warning following a thinly veiled nuclear threat made by the Russian president last week. Read more at straitstimes.com.", "filename": "world_united-states_us-warns-putin-of-catastrophic-consequences-if-nuclear-weapons-used-in-ukraine_1728742043.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/26/btukraine20220925.jpg?VersionId=pSEQvrCdEqSREVOjN_CNnu9fFHkPbwI1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-warns-putin-of-catastrophic-consequences-if-nuclear-weapons-used-in-ukraine_1728742043.html", "title": "US warns Putin of 'catastrophic' consequences if nuclear weapons used in Ukraine", "title_page": "US warns Putin of 'catastrophic' consequences if nuclear weapons used in Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The United States would respond decisively to any Russian use of nuclear weapons against Ukraine and has spelt out to Moscow the \"catastrophic consequences\" it would face, US National Security Adviser Jake Sullivan said on Sunday.\nSullivan's remarks represented the latest American warning following the thinly veiled nuclear threat made by Vladimir Putin last Wednesday in a speech in which the Russian president also announced his country's first wartime military mobilisation since World War II.\n\"If Russia crosses this line, there will be catastrophic consequences for Russia. The United States will respond decisively,\" Sullivan told NBC's \"Meet the Press\" programme.\nSullivan did not describe the nature of the planned US response in his comments on Sunday.\nBut he said the United States has privately to Moscow \"spelt out in greater detail exactly what that would mean\".\nSullivan said that the United States has been in frequent, direct contact with Russia, including during the last few days to discuss the situation in Ukraine and Putin's actions and threats.\nUS President Joe Biden in a speech at the United Nations General Assembly in New York last Wednesday accused Putin of making \"overt nuclear threats against Europe\" in reckless disregard for nuclear nonproliferation responsibilities.\nRussia also is staging a referendum in four eastern Ukrainian regions with the goal of annexing territory that Russian forces have taken during their invasion of Ukraine launched in February.\nUkraine and its allies have called the referendums a sham designed to justify an escalation of the war and Putin's mobilisation drive after recent battlefield losses.\nBy incorporating the areas of Luhansk, Donetsk, Kherson and Zaporizhzhia into Russia, Moscow could portray attacks to retake them as an attack on Russia itself, a warning to Ukraine and its Western allies.\nAfter suffering setbacks on the battlefield, Putin is mobilising 300,000 troops while also threatening to use \"all available means\" to protect Russia.\n\"This is not a bluff,\" Putin said in the remarks viewed on the world stage as a threat on the potential use of nuclear weapons.\nSullivan said on Sunday: \"Putin remains intent ... on wiping out the Ukraine people that he does not believe have a right to exist. So he's going to keep coming and we have to keep coming with weapons, ammunition, intelligence and all the support we can provide.\" REUTERS", "url": "https://www.straitstimes.com/world/united-states/us-warns-putin-of-catastrophic-consequences-if-nuclear-weapons-used-in-ukraine"}