{"authors": [], "date_download": "2024-10-12 14:07:07", "date_modify": "2024-10-12 14:07:07", "date_publish": "2022-09-21 08:59:17", "description": "He says the world must continue backing Kyiv to make sure Putin fails in his ‘imperial ambitions’. Read more at straitstimes.com.", "filename": "world_europe_putin-must-recognise-he-cannot-win-ukraine-war-says-german-chancellor_1728742027.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/21/ac_soldierukr_210922.jpg?VersionId=mn9zqZtaoE0VELaDx2viqfRsDO1fUEvh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_putin-must-recognise-he-cannot-win-ukraine-war-says-german-chancellor_1728742027.html", "title": "Putin must recognise he cannot win Ukraine war, says German chancellor", "title_page": "Putin must recognise he cannot win Ukraine war, says German chancellor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Russian President Vladimir Putin will only give up his \"imperial ambitions\" that risk destroying Ukraine and Russia if he recognises he cannot win the war, German Chancellor Olaf Scholz said Tuesday.\n\"This is why we will not accept any peace dictated by Russia, and this is why Ukraine must be able to fend off Russia's attack,\" Mr Scholz said in his first address to the United Nations General Assembly.\nThe return of imperialism, with Mr Putin's war on Ukraine, is not just a disaster for Europe but for the global, rules-based peace order, he said.\nMr Scholz called on the UN to defend this from those who would prefer a world where the \"strong rule the weak\".\n\"Do we watch helplessly as some want to catapult us back into a world order where war is a common means of politics, independent nations must join their stronger neighbours or colonial masters, and prosperity and human rights are a privilege for the lucky few?\" he asked.\n\"Or do we manage together to ensure the multipolar world of the 21st century remains a multilateral world? My answer, as a German and European, is: We must manage it,\" he added.\nTo better achieve this end, the global south needs a greater say in world affairs, Mr Scholz said.\nWith greater responsibility would come greater conviction, he said.\nWestern allies have been competing with Russia for diplomatic influence since the Kremlin began its invasion on Feb 24.\nMr Scholz announced that Berlin would host a conference on the reconstruction of Ukraine on Oct 25.", "url": "https://www.straitstimes.com/world/europe/putin-must-recognise-he-cannot-win-ukraine-war-says-german-chancellor"}