{"authors": [], "date_download": "2024-10-12 13:40:41", "date_modify": "2024-10-12 13:40:41", "date_publish": "2024-09-04 05:55:58", "description": "A selection of news stories that happened overnight, Sept 4, 2024. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-sept-4-6_1728740441.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/JK00112.jpg?VersionId=x0HPhi8hpmb0gIujhXPZXbXWaZ_rRz2E", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-sept-4-6_1728740441.html", "title": "While You Were Sleeping: 5 stories you might have missed, Sept 4", "title_page": "While You Were Sleeping: 5 stories you might have missed, Sept 4 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Poland’s Foreign Minister brings Ukraine rallying cry to South-east Asia\nTwo-and-a-half years after Russian President Vladimir Putin launched a full-scale invasion of Ukraine, Poland’s Foreign Affairs Minister Radek Sikorski’s exasperation is unmistakable.\n“My frustration is that in some parts of the world, people don’t see this Russian aggression for what it is, which is a colonial attempt to regain its... former ‘colony’,” Mr Sikorski told The Straits Times in an interview on Sept 2, during his first official visit to Singapore in his second stint as his country’s chief diplomat.\nUnited Nations member states had voted overwhelmingly to condemn Russia in the immediate aftermath of its invasion of Ukraine in February 2022. However, deepening the support for Ukraine has proven a tougher sell outside of Europe and North America, as international attention was diverted by the Middle East crisis and intensifying US-China competition.\nWith their shared history of Russian control, Poland has been among Ukraine’s loudest and biggest advocates. If Mr Putin succeeds in Ukraine, the existential fear is that he would go on to invade and retake Poland and other former Soviet territories such as Estonia, Georgia and Latvia.\nREAD MORE HERE\nUkraine arms chief, ministers resign in government shake-up\nThe Ukrainian minister in charge of weapons production resigned on Sept 3 in anticipation of another defence role and four other ministers stood down in a major government shake-up at a critical juncture in the war with Russia.\nThe resignations of Strategic Industries Minister Oleksandr Kamyshin, Deputy Prime Minister Olha Stefanishyna and the justice, environment and reintegration ministers leaves over a third of the Cabinet vacant after sackings earlier this year.\nPresident Volodymyr Zelensky and his political allies could move to fill the positions to create order before he travels in September to the United States, where he hopes to present a “victory plan” to US President Joe Biden, a key ally.\nREAD MORE HERE\nEx-aide to NY Governor charged with acting as Chinese agent\nA former aide to New York Governor Kathy Hochul has been charged with acting as an undisclosed agent of the Chinese government, federal prosecutors in Brooklyn said.\nProsecutors said Linda Sun, 41, was arrested on Sept 3 and is expected to be presented in court later in the day. Sun’s husband Chris Hu also faces criminal charges.\nWhile working in state government, Sun allegedly blocked representatives of the Taiwanese government from meeting with officials, and allegedly sought to arrange for a high-level New York state official to visit China.\nREAD MORE HERE\nNo link between mobile phones and brain cancer: WHO study\nThere is no link between mobile phone use and increased brain cancer risk, according to a new review of the available published evidence worldwide commissioned by the World Health Organisation (WHO).\nDespite the huge rise in the use of wireless technology, there has not been a corresponding rise in the incidence of brain cancers, the review, published on Sept 3, found.\nThat applies even to people who make long phone calls or those who have used mobile phones for more than a decade.\nREAD MORE HERE\nSprint banter will see Duplantis race Warholm over 100m\nAs head-to-head exhibition 100 metres races go, it is certainly one that catches the eye: Pole vault king Armand Duplantis up against 400m hurdles master Karsten Warholm in Zurich on Sept 4.\nThe two track stars will clash at the Letzigrund Stadium ahead of the Sept 4 Diamond League meet proper to make good on some training ground banter that has escalated all the way to a sprint-off.\nNorway’s Warholm is the reigning 400m hurdles world record holder, an Olympic gold and silver medallist and three-time world champion.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-sept-4-6"}