{"authors": [], "date_download": "2024-10-12 13:38:18", "date_modify": "2024-10-12 13:38:18", "date_publish": "2024-08-14 07:35:00", "description": "The cross-border attack caught Russia by surprise and signified a shift in tactics for Ukraine. Read more at straitstimes.com.", "filename": "world_europe_what-to-know-about-ukraine-s-cross-border-assault-into-russia__gl=1_xedsqd__gcl_au_MTQ1NjEwODM2LjE3MjMwNDE3MzI_1728740298.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/14/IMGUKRAINEFRONTLINE211SKBRM9P.jpg?VersionId=17luJqeLffSySCD4qZ9WnT3eyhAYrjVM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_what-to-know-about-ukraine-s-cross-border-assault-into-russia__gl=1_xedsqd__gcl_au_MTQ1NjEwODM2LjE3MjMwNDE3MzI_1728740298.html", "title": "Explainer: What to know about Ukraine’s cross-border assault into Russia", "title_page": "Explainer: What to know about Ukraine’s cross-border assault into Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Ukraine pressed ahead with its assault inside Russian territory on Aug 13, a week into the biggest foreign incursion into the country since World War II.\nWhile Russian military officials on Aug 13 insisted that the situation was under control, Mr Aleksei Smirnov, acting governor of Russia’s Kursk region where Ukraine mounted its incursion, warned that “the crisis has not yet been overcome”.\nUkraine President Volodymyr Zelensky of Ukraine said on Aug 13 that “our forces continue to advance in the Kursk region”.\nColonel Roman Kostenko, a member of Ukraine’s Parliament serving in the country’s military, told a local news outlet that the “advance is ongoing”.\nThe cross-border attack caught Russia by surprise and signified a shift in tactics for Ukraine more than two years after Moscow’s troops poured across Ukraine’s border in a full-scale invasion.\nThe rapid advance by Ukrainian forces has been an embarrassment for the Kremlin and aims to alter the narrative of the war at a time when Ukraine’s forces are stretched thin on the front lines of their own country.\nHere’s what to know about Ukraine’s cross-border operation in Russia.\nWhat happened?\nUkrainian troops and armoured vehicles stormed into the Kursk region of western Russia on the morning of Aug 6, punching through border defences and seizing several settlements in heavy fighting that left a trail of death and ruin.\nThe assault opened a new front in the 30-month war and did not catch just Russia off guard: Some Ukrainian soldiers and US officials said they also lacked advance notice.\nRussia’s top general estimated that Ukraine had deployed 1,000 soldiers for the incursion, while US officials said Ukraine had sent several thousand. Military analysts have said the attack involved elements of at least four brigades in a rare example of a successful operation involving support from artillery, air defences and electronic warfare. That translated into quick advances on the ground.\nHow far into Russia have Ukrainian troops advanced?\nUkrainian forces advanced several miles into Russia within the first 24 hours of the incursion.\nBy Aug 12, Mr Smirnov said that 28 towns and villages were under Ukrainian control. Ukrainian troops had pushed 11km into Russian territory along a 40km front, he said, adding that 12 civilians had died in the fighting.\nHis claims could not be independently verified, though the description of the extent of Ukraine’s advance was roughly in line with analysts’ estimates.\nThe head of Ukraine’s armed forces, General Oleksandr Syrsky, on Aug 12 claimed Ukraine had control of “about 1,000 sq km”. Mr Zelensky said on Aug 13 on social media platform X that “74 communities are under Ukrainian control”, though that could not be independently verified.\nWhy is this significant?\nUkraine has regularly bombarded Russian oil refineries and airfields with a fleet of homemade drones since Moscow’s full-scale invasion began. It has also helped stage two other ground attacks. Those, however, were smaller forays into Russia by Russian exile groups backed by the Ukrainian army and ended in quick retreats.\nUntil last week, Ukrainian forces had not counter-attacked into Russia. The gains in Kursk are the quickest for Ukrainian forces since they reclaimed the Kherson region of their own country in November 2022.\nHow has the Kremlin responded?\nAs Ukrainian forces pushed deeper into Russia, Moscow scrambled to shore up its defences, and President Vladimir Putin convened his security services to coordinate a response.\nThe Russian military said it was sending more troops and armoured vehicles to try to repel the attack, with Russian television broadcasting images of columns of military trucks.\nWhile the efforts appear to have helped stall further advances by Ukrainian troops, Ukraine’s forces are holding ground a week into the incursion. They claimed on Aug 10 to have captured a small village in the neighboring Belgorod region, and analysts say their forces control most of the Kursk town of Sudzha, about 10km from the border.\nRussian officials and the state news media have repeatedly claimed to have the situation under control – most recently on Aug 13 – only to then lose more ground.\n“The operation to neutralise” Ukrainian units, Russia’s Ministry of Defence said on Aug 13, “is in progress”.\nAnd what about Putin?\nThe incursion has embarrassed Mr Putin and his military establishment, prompting questions about Russia’s level of preparedness.\nUnderscoring how the surprise attack rattled the Kremlin, Mr Putin lashed out at the West in a tense televised meeting with his top officials on Aug 12.\n“The West is fighting us with the hands of the Ukrainians,” he said, repeating his frequent depiction of the war, which he started, as a proxy campaign against Russia by the West. “The enemy will certainly get the response he deserves, and all our goals, without doubt, will be accomplished.”\nMr Putin directed his military to push out Ukraine’s troops and to work with the border guard service to “ensure the reliable protection of the state border” – an acknowledgment that Russia had failed in that regard.\nWhat has Ukraine said?\nIt took days for Ukraine to publicly acknowledge the cross-border operation, with the military staying silent in the face of accusations and statements from Russian officials.\nMr Zelensky’s most explicit reference to the Kursk region incursion came only on the night of Aug 12, when he said that Russia had launched attacks from the area.\n“Therefore, our operations are purely a security matter for Ukraine,” he said in his nightly address. But he also hinted at another rationale, adding: “Russia brought war to others, and now it’s coming home.”\nWhat is the goal of Ukraine’s incursion?\nAnalysts say that Ukraine’s offensive most likely has two main aims: Draw Russian forces from the front lines in eastern Ukraine, and seize territory that could serve as a bargaining chip in future peace talks.\nThe operation could also offer a much-needed morale boost for Ukrainians, whose forces have been losing ground to Russian troops for months.\nBut military analysts have questioned whether Kyiv’s cross-border assault is worth the risk, given that Ukrainian forces are already stretched on the front lines of their own country, including suffering from shortages of troops and ammunition.\nHow is it affecting the fight inside Ukraine?\nRussian forces have been pummelling Ukrainian forces in the east even as Moscow races to respond to the incursion into the Kursk region, according to Ukrainian military officials.\nAnd there is little indication so far that Russia is redirecting front-line forces from eastern Ukraine. Instead of pulling those brigades, Russia appeared to be redeploying lower-level units to the Kursk region, according to a briefing on Aug 11 by the Institute for the Study of War, a US-based research organisation.\nWhile Kyiv’s allies have in the past been wary that Ukrainian incursions in Russia could escalate the war, the US has suggested that the assault in the Kursk region does not violate American guidance.\nHowever, senior American officials have said privately that they understood Kyiv’s need to change the optics and the narrative of the war, but that they were sceptical Ukraine could hold the territory long enough to force Russia to divert significant forces from the front lines in eastern and southern Ukraine.\nWhat happens next?\nMr Heorhii Tykhyi, a spokesperson for Ukraine’s Foreign Ministry, told local news outlets on Aug 13 that the country was “not interested in taking territory in Kursk region”, echoing Mr Zelensky in saying the incursion was aimed at protecting its own citizens.\nBut it still remains unclear whether Ukraine will try to solidify control over the land it has captured or be forced to retreat.\nRussian officials have warned that the incursion could expand. The authorities in the Belgorod region have said they are evacuating a district, and Mr Putin, in his televised meeting, told the governor of a third border region – Bryansk – that it appeared “relatively calm” for now but “this doesn’t mean that the same situation will remain tomorrow”.\nOn Aug 13, Russia’s Emergencies Ministry spokesman Artyom Sharov said more than 2,000 people had left or been evacuated from “borderline districts” in the Kursk region over the past 24 hours, state news agency Tass reported. NYTIMES", "url": "https://www.straitstimes.com/world/europe/what-to-know-about-ukraine-s-cross-border-assault-into-russia?_gl=1*xedsqd*_gcl_au*MTQ1NjEwODM2LjE3MjMwNDE3MzI."}