{"authors": [], "date_download": "2024-10-12 13:36:49", "date_modify": "2024-10-12 13:36:49", "date_publish": "2024-09-12 01:53:09", "description": "WASHINGTON - The Biden administration is overriding human rights conditions on military aid to Egypt, a State Department spokesperson said on Wednesday, granting the U.S. ally its full allocation of $1.3 billion this year for the first time during this administration, despite ongoing concerns over human rights in the country. Read more at straitstimes.com.", "filename": "world_middle-east_biden-administration-grants-egypt-13-billion-in-military-aid-despite-rights-requirements_1728740209.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/LYNXMPEK8A0RJ-2.jpg?VersionId=Y9j11i3qLWVyy4GkJBU_eKUREtWHdjgz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_biden-administration-grants-egypt-13-billion-in-military-aid-despite-rights-requirements_1728740209.html", "title": "US grants Egypt $1.3b in military aid, overriding rights conditions", "title_page": "US grants Egypt $1.3b in military aid, overriding rights conditions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The Biden administration is overriding human rights conditions on military aid to Egypt, a State Department spokesperson said on Wednesday, granting the U.S. ally its full allocation of $1.3 billion this year for the first time during this administration, despite ongoing concerns over human rights in the country.\nThe announcement comes as Washington has relied heavily on Cairo - a longstanding U.S. ally - to mediate so far unsuccessful talks between Israel and Hamas on a ceasefire deal to end the war in Gaza.\nOf the $1.3 billion in U.S. foreign military financing allocated to Egypt, $320 million is subject to conditions that have meant at least some of that sum has been withheld in recent years.\nSecretary of State Antony Blinken told Congress on Wednesday that he would waive a certification requirement on $225 million related to Egypt's human rights record this year citing \"the U.S. national security interest,\" the spokesperson said by email.\n\"This decision is important to advancing regional peace and Egypt’s specific and ongoing contributions to U.S. national security priorities, particularly to finalize a ceasefire agreement for Gaza, bring the hostages home, surge humanitarian assistance for Palestinians in need, and help bring an enduring end to the Israel-Hamas conflict,\" the spokesperson said.\nCairo has remained a close regional ally of Washington despite accusations of widespread abuses under President Abdel Fattah al-Sisi's government, including torture and enforced disappearances.\nSisi denies there are political prisoners in Egypt. He says stability and security are paramount and authorities are promoting rights by trying to provide basic needs such as jobs and housing.\nThe war in Gaza, sparked by the Oct. 7 attacks by Palestinians militants on southern Israel, has increased Washington's reliance on Cairo for diplomatic efforts like the ceasefire talks. Much needed humanitarian aid for Palestinians in Gaza also enters from Egypt.\nCONTINUED DETENTIONS\nBlinken issued a similar same waiver on the human rights conditions last year but withheld a portion of the military aid over Egypt's failure to make \"clear and consistent progress\" on the release of political prisoners.\nThis year, Blinken determined that Egypt had made sufficient efforts on political prisoners to release $95 million tied to progress on the issue, the spokesperson said.\nThey cited Egypt's effort's to draft legislation to reform pre-trial detention and the broader penal code, its release of some political prisoners and a move to end travel bans and asset freezes associated with foreign funding for non-governmental organizations.\nRights groups have questioned how effective the draft legislation on pre-trial detention would be for ending abusive practices and say some human rights lawyers remain under travel bans.\nSeth Binder, director of advocacy for the Washington-based Middle East Democracy Center (MEDC), said that while about 970 prisoners had been released since last September, at least 2,278 Egyptians were arbitrarily arrested over the same period, according to data collected by MEDC and Egyptian human rights groups.\n“There's no reasonable assessment where one could say there's been progress on the human rights situation in Egypt. It remains a huge crisis,” he said, pointing to the tens of thousands of political prisoners still held in the country.\nThe State Department spokesperson said Washington was continuing \"a rigorous dialogue with the Egyptian government on the importance of concrete human rights improvements that are crucial to sustaining the strongest possible U.S.-Egypt partnership.\" REUTERS", "url": "https://www.straitstimes.com/world/middle-east/biden-administration-grants-egypt-13-billion-in-military-aid-despite-rights-requirements"}