{"authors": [], "date_download": "2024-10-12 13:36:03", "date_modify": "2024-10-12 13:36:03", "date_publish": "2023-10-21 21:09:54", "description": "The summit comes amid growing concern of an unfolding humanitarian catastrophe in the blockaded enclave. Read more at straitstimes.com.", "filename": "world_arab-leaders-at-cairo-peace-summit-denounce-israel-attacks-on-gaza-urge-fresh-peace-push_1728740163.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/21/2023-10-21T130421Z1862858208RC20X3ASCS1WRTRMADP3ISRAEL-PALESTINIANS-EGYPT-DIPLOMACY.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_arab-leaders-at-cairo-peace-summit-denounce-israel-attacks-on-gaza-urge-fresh-peace-push_1728740163.html", "title": "Cairo Peace Summit ends without Gaza breakthrough", "title_page": "Cairo Peace Summit ends without Gaza breakthrough | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CAIRO – Arab leaders at a Cairo summit on Saturday condemned Israeli bombardment of Gaza as Europeans said civilians should be shielded, but with Israel and senior US officials absent there was no agreement towards containing the violence.\nEgypt, which called the meeting and hosted it, said it had hoped participants would call for peace and resume efforts to resolve the decades-long Palestinian quest for statehood.\nBut the meeting ended without leaders and foreign ministers agreeing a joint statement, two weeks into a conflict that has killed thousands and visited a humanitarian catastrophe on the blockaded Gaza enclave of 2.3 million people.\nDiplomats attending the talks had not been optimistic of a breakthrough, with Israel preparing a ground invasion of Gaza aimed at wiping out the militant Palestinian group Hamas that rampaged through its towns on Oct 7, killing 1,400 people.\nGaza's Health Ministry said on Saturday Israel's air and missile strikes had killed at least 4,385 Palestinians since the Hamas attack.\nWhile Arab and Muslim states called for an immediate end to Israel's offensive, Western countries mostly voiced more modest goals such as humanitarian relief for civilians.\nJordan's King Abdullah denounced what he termed global silence about Israel's attacks, which have killed thousands in Hamas-ruled Gaza and made over a million homeless, and urged an even-handed approach to the Israeli-Palestinian conflict.\n\"The message the Arab world is hearing is that Palestinian lives matter less than Israeli ones,\" he said, adding he was outraged and grieved by acts of violence waged against innocent civilians in Gaza, the Israeli-occupied West Bank, and Israel.\nPalestinian President Mahmoud Abbas said Palestinians would not be displaced or driven off their land.\n\"We won't leave, we won't leave,\" he told the summit.\nFrance called for a humanitarian corridor into Gaza that it said could lead to a ceasefire. Britain and Germany both urged Israel's military to show restraint and Italy said it was important to avoid escalation.\nThe United States, Israel's closest ally and a vital player in all past peace efforts in the region, only sent its Cairo charge d'affaires who did not address the meeting in public.\nEuropean Council President Charles Michel said the main goal of the summit was \"to listen to each other\".\nHowever, \"we understand that we need to work more together\" on issues including the humanitarian situation, avoiding a regional escalation and a Palestinian-Israeli peace process, he added.\nIsrael has vowed to wipe the Iranian-backed Hamas militant group \"off the face of the earth\" over the shock Oct. 7 assault, the deadliest Palestinian militant attack in Israel's 75-year history.\nIt has said it told Palestinians to move south within Gaza for their own safety, although the coastal strip is only 45 km long and Israeli air strikes have also hit the south.\nCeasefire\nThe meeting was meant to explore how to head off a wider regional war. But diplomats knew public agreement would be hard because of sensitivities around calls for a ceasefire, whether to include mention of Hamas' attack and Israel's right to defend itself.\nArab states fear the offensive could drive Gaza residents permanently from their homes and even into neighbouring states - as happened when Palestinians fled or were forced from their homes in the 1948 war following Israel's creation.\nEgyptian President Abdel Fattah al-Sisi said his country opposed what he called the displacement of Palestinians into Egypt's largely desert Sinai region, adding the only solution was an independent Palestinian state.\nEgypt fears insecurity near the border with Gaza in northeastern Sinai, where it faced an Islamist insurgency that peaked after 2013 and has now largely been suppressed.\nJordan, home to many Palestinian refugees and their descendants, fears a wider conflagration would give Israel the chance to expel Palestinians en masse from the West Bank.\nKing Abdullah said forced displacement \"is a war crime according to international law, and a red line for all of us.\"\nShortly before the summit opening, trucks loaded with humanitarian aid began entering the Rafah crossing into Gaza. Egypt has been trying for days to channel humanitarian relief to Gaza through the crossing, the one access point not controlled by Israel.", "url": "https://www.straitstimes.com/world/arab-leaders-at-cairo-peace-summit-denounce-israel-attacks-on-gaza-urge-fresh-peace-push"}