{"authors": [], "date_download": "2024-10-12 14:04:34", "date_modify": "2024-10-12 14:04:34", "date_publish": "2023-09-03 05:48:20", "description": "Italy says its Belt and Road pact with China has fallen short of expectations. Read more at straitstimes.com.", "filename": "world_europe_italy-moves-to-weaken-ties-with-china-without-upsetting-beijing_1728741874.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/03/2023-06-21T124818Z611976093RC2ON1AVU4UMRTRMADP3UKRAINE-CRISIS-BRITAIN-RECOVERY.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_italy-moves-to-weaken-ties-with-china-without-upsetting-beijing_1728741874.html", "title": "Italy moves to weaken ties with China without upsetting Beijing", "title_page": "Italy moves to weaken ties with China without upsetting Beijing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MILAN - When Italian Foreign Minister Antonio Tajani is in China this week, he will be balancing two competing interests – laying the ground for his country’s exit from a controversial investment pact with Beijing, while also trying to avoid a rupture with the world’s second-largest economy.\nDuring a three-day trip starting on Sunday, Mr Tajani, who is also Italian Prime Minister Giorgia Meloni’s deputy, will meet Chinese Foreign Minister Wang Yi and other officials to discuss the possibility of leaving the Belt and Road Initiative (BRI), an investment pact designed to deepen economic ties with allies.\nJust before boarding a plane to China, Mr Tajani said that the 2019 agreement had fallen short of expectations.\n“Belt and Road was a decision made in the past,” he told journalist Francine Lacqua in a Bloomberg Television interview on Saturday, at the Ambrosetti Forum in Cernobbio, Italy.\nRegardless of what Italy decides regarding the pact, “it will not be a message against China”, he said.\nBloomberg reported earlier that Italy was signalling to allies that it intended to pull out of the BRI.\nBut delivering on such a scenario will require a significant diplomatic effort.\nMs Meloni has said she will visit China in the coming months as part of the outreach started by Mr Tajani.\nItaly’s membership in the BRI has turned into a dilemma for the government after making it an outlier among the Group of Seven countries.\nIt raised questions about Rome’s foreign alliances at a time of an increasingly fraught rivalry between China and a United States suspicious of Beijing’s ambitions.\nThe impact of Italy’s controversial pact with China on trade has been twofold, according to Bloomberg calculations based on Eurostat data.\nWhile imports from China accelerated between 2020 and 2022, following the signing of the Belt and Road memorandum, the trend has been more volatile for exports.\nAfter growing almost 20 per cent in 2021, they rose only 5 per cent in 2022, lagging behind the pace of inflation.\nMs Meloni’s government must decide by the end of 2023 whether to renew its involvement in the programme that was once the backbone of Chinese President Xi Jinping’s efforts to deepen economic ties across the world.\nItaly has been caught between escalating tensions between Washington and Beijing, which have compounded due to China’s support for Russia.\nEuropean countries are struggling to balance a desire to engage with China on trade and investment, while pushing back against claims of economic coercion.\nThe European Union has urged member states to tighten export controls on technology that could be exploited by rivals, and cautions not to share information with “countries of concern” that could harness artificial intelligence and quantum computing for military use.\nEarlier in 2023, the Dutch government said it would prohibit Europe’s most valuable technology company, ASML Holding, from shipping some of its machines to China.\nBloomberg reported earlier that the US actively pressured Rome to take a public stance on the issue and exit the investment pact with China, according to people familiar with the talks. BLOOMBERG", "url": "https://www.straitstimes.com/world/europe/italy-moves-to-weaken-ties-with-china-without-upsetting-beijing"}