{"authors": [], "date_download": "2024-10-12 13:57:07", "date_modify": "2024-10-12 13:57:07", "date_publish": "2024-02-28 16:37:47", "description": "VATICAN CITY - Pope Francis, who has been suffering from influenza, made a brief trip to a Roman hospital for medical checks on Wednesday but was able to return to the Vatican, his office said in a statement. Read more at straitstimes.com.", "filename": "world_europe_pope-francis-skips-readings-at-audience-says-he-still-has-a-cold_1728741427.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/28/LYNXNPEK1R094-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_pope-francis-skips-readings-at-audience-says-he-still-has-a-cold_1728741427.html", "title": "Pope Francis had CT scan during hospital check-up, sources say", "title_page": "Pope Francis had CT scan during hospital check-up, sources say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VATICAN CITY - Pope Francis, who has been suffering from influenza, made a brief trip to a Roman hospital for medical checks on Wednesday but was able to return to the Vatican, his office said in a statement.\nThe pope, who is 87, had checks at the Tiber Island hospital after his weekly general audience, the statement said, without providing further details.\nTwo medical sources told Reuters he had a CT scan.\nFrancis underwent the same procedure at the same hospital in November, following another bout of influenza. The scan allows doctors to see detailed internal images of a patient's body.\nTelevised images on Wednesday showed a Vatican-registered white Fiat - a model Francis uses regularly - leaving the medical facility in the centre of Rome at around midday (1100 GMT).\nThe pontiff earlier skipped a reading at his Wednesday weekly audience, delegating the task to an aide and telling the faithful he was still not well.\n\"Dear brothers and sisters, I still have a bit of a cold,\" Francis said at the audience on Wednesday, announcing that someone else would read his catechesis on envy and vainglory, two of the seven deadly sins.\nThe reading was about one page long.\nThe pope spoke at the end of his audience, sounding hoarse and coughing a bit, to greet some of the faithful and issue calls for peace, as is customary.\nFrancis, who has had a number of health issues recently, had cancelled appointments on Saturday and on Monday due to what the Vatican called a mild flu. On Sunday, he addressed crowds in St Peter's Square as normal, to deliver his Angelus message.\nThe pope was forced to cancel a planned trip to a COP28 climate meeting in Dubai at the start of December because of the effects of influenza and lung inflammation.\nIn January, he was unable to complete a speech owing to \"a touch of bronchitis\". Later in the month he said he was doing better despite \"some aches and pains\".\nAs a young man in his native Argentina, Francis had part of a lung removed.\nThe pope also has difficulty walking, and regularly uses a wheelchair or a cane. On Wednesday, he arrived at his indoor audience in a wheelchair. REUTERS", "url": "https://www.straitstimes.com/world/europe/pope-francis-skips-readings-at-audience-says-he-still-has-a-cold"}