{"authors": [], "date_download": "2024-10-12 13:44:09", "date_modify": "2024-10-12 13:44:09", "date_publish": "2023-10-03 21:03:53", "description": "A supporter of former Libyan dictator Muammar Gaddafi who was involved in the hijacking of an aircraft to Malta in 2016 has been jailed for 10 years by a Maltese court after he pleaded guilty. Read more at straitstimes.com.", "filename": "world_europe_malta-jails-libyan-hijack-accomplice_1728740649.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/03/LYNXMPEJ920GF-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_malta-jails-libyan-hijack-accomplice_1728740649.html", "title": "Malta jails Libyan hijack accomplice", "title_page": "Malta jails Libyan hijack accomplice | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VALLETTA - A supporter of former Libyan dictator Muammar Gaddafi who was involved in the hijacking of an aircraft to Malta in 2016 has been jailed for 10 years by a Maltese court after he pleaded guilty.\nAli Ahmed Lano Saleh was one of two men who hijacked an Afriqiyah Airlines Airbus A320 to Malta on Dec. 23, 2016.\nThe plane had been on an internal flight in Libya when the two hijackers ordered the pilot to divert to Rome. They landed in Malta instead because of a lack of fuel.\nThe hijackers had threatened to blow up the plane, but their weapons later turned out to be fake and the 109 passengers were released unharmed. The hijackers' demands were never made clear.\nThe hijack mastermind, Soko Moussa Shaha Ali, was jailed for 25 years in 2020.\nIn sentencing Saleh, the court said it had taken into account the fact that he had pleaded guilty, that the passengers were released quickly and unharmed, and that he was not the mastermind of the hijacking. REUTERS", "url": "https://www.straitstimes.com/world/europe/malta-jails-libyan-hijack-accomplice"}