{"authors": [], "date_download": "2024-10-12 14:18:05", "date_modify": "2024-10-12 14:18:05", "date_publish": "2024-04-16 21:07:17", "description": "This comes after Iran on April 13 launched more than 300 drones and missiles against Israel. Read more at straitstimes.com.", "filename": "world_us-will-use-sanctions-to-disrupt-irans-malign-activity-yellen-says_1728742685.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/LYNXNPEK3F0HY-1.jpg?VersionId=5ZyBFSEMmXq7KQoxS1iZ02CdjLD6I.2D", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_us-will-use-sanctions-to-disrupt-irans-malign-activity-yellen-says_1728742685.html", "title": "US will use sanctions to disrupt Iran’s ‘malign’ activity: Yellen", "title_page": "US will use sanctions to disrupt Iran’s ‘malign’ activity: Yellen | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - US Treasury Secretary Janet Yellen on April 16 said Iran’s attack on Israel last weekend and its financing of militant groups in Gaza, Lebanon, Yemen and Iraq threatened stability in the Middle East and could cause economic spillovers.\nDr Yellen began remarks prepared for a news conference by addressing what she called an unprecedented attack on Israel by Iran and its proxies, saying Treasury would use its sanctions authority and work with allies to “continue disrupting the Iranian regime’s malign and destabilising activity”.\nThe US is using financial sanctions to isolate Iran and disrupt its ability to fund proxy groups and support Russia’s war in Ukraine, the Treasury Department said.\nTreasury has targeted more than 500 individuals and entities connected to terrorism and terrorist financing by the Iranian regime and its proxies since the start of the Biden administration in January 2021, Dr Yellen said.\nThat has included targeting Iran’s drone and missile programs and its financing of the Palestinian militant group Hamas, the Houthis in Yemen, Hezbollah in Lebanon and Iraqi militia groups, she said.\n“From this weekend’s attack to the Houthi attacks in the Red Sea, Iran’s actions threaten the region’s stability and could cause economic spillovers,” Yellen said, without giving details.\nShe spoke at a news conference during this week’s meetings of the International Monetary Fund (IMF) and World Bank, which bring top finance officials to Washington from around the world.\nIran on April 13 launched more than 300 drones and missiles against Israel, its first direct attack on the country, in retaliation for a suspected Israeli air strike on its embassy compound in Damascus on April 11 killed elite military officers.\nIsrael’s military said that it shot down almost all the drones and missiles, and that the attack caused no deaths, but the situation has increased fears of open warfare between the longtime foes.\nIn Gaza, more than 33,000 Palestinians have been killed in the Israeli offensive launched against Hamas after the group attacked Israel on Oct 7, killing 1,200 people and taking 253 hostages, according to Israeli tallies.\nDr Yellen said Washington was continuing to use economic tools to pressure Hamas, but said Treasury was emphasising that its sanctions should not impede life-saving aid.\nShe called for urgent action to end Palestinian suffering in the narrow enclave, noting that Gaza’s entire population of more than two million people was facing acute food insecurity and that most of the population had been displaced.\n“It is incumbent on all of us here at these meetings to do everything in our power to end this suffering,” she said.\nDr Yellen noted that Washington was also using sanctions to target extreme settler violence in the West Bank, while working to ensure a functioning banking system there and supporting IMF programmes in Jordan and Egypt. REUTERS", "url": "https://www.straitstimes.com/world/us-will-use-sanctions-to-disrupt-irans-malign-activity-yellen-says"}