{"authors": [], "date_download": "2024-10-12 14:04:15", "date_modify": "2024-10-12 14:04:15", "date_publish": "2023-01-06 08:10:09", "description": "Officials are gathering pace in documenting crimes often hidden under layers of shame, stigma and fear. Read more at straitstimes.com.", "filename": "world_europe_fear-still-remains-ukraine-finds-sexual-crimes-where-russian-troops-ruled_1728741855.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/07/UKRAINESEXUALVIOLENCE7_0.JPG?VersionId=lGXHWxBZcOGOepDOI2z3d42qW2jdxqDe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_fear-still-remains-ukraine-finds-sexual-crimes-where-russian-troops-ruled_1728741855.html", "title": "‘Fear still remains’: Ukraine finds sexual crimes where Russian troops ruled", "title_page": "‘Fear still remains’: Ukraine finds sexual crimes where Russian troops ruled | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KHERSON, Ukraine – On her eighth or ninth day in Russian detention, Olha, a 26-year-old Ukrainian, was tied to a table, naked to the waist. For 15 minutes, her interrogator levelled obscenities at her, then threw a jacket over her and let seven other men into the room.\n“It was to frighten,” she remembered. “I did not know what would come next.”\nSitting in Olha’s cramped kitchen weeks later in Kherson, in southern Ukraine, Ms Anna Sosonska, an investigator with the prosecutor general’s office, listened to her recount the ordeal – an account of forced nudity that, prosecutors say, added to an accumulation of evidence that Russian forces had used sexual crimes as a weapon of war in the places they once ruled.\n“We are finding this problem of sexual violence in every place that Russia occupied,” said Ms Sosonska, 33. “Every place: Kyiv region, Chernihiv region, Kharkiv region, Donetsk region and also here in Kherson region.”\nAfter months of bureaucratic and political delays, Ukrainian officials are gathering pace in documenting sexual crimes, which are prevalent and devastating in times of war but often remain hidden under layers of shame, stigma and fear.\n“We found all types of cases of war crimes: rape, forced nudity, sexual torture” inflicted on men, women and children, Ms Sosonska said. A pattern to the crimes is emerging, she added. “Now we see there is a line of war crimes in the Russian army and among Russian commanders.”\nRussian officials have repeatedly denied accusations of human rights abuses, despite widespread evidence and accounts collected by Ukrainian and international investigators. A spokesman for Russia’s Foreign Ministry, Ms Maria Zakharova, recently dismissed a report by the UN Human Rights Commission as unsubstantiated testimonies and no more than “rumours and gossip”.\nAfter investigating some areas Russia retreated from, an independent international commission reported to the United Nations in October that “an array of war crimes committed in Ukraine” included cases of sexual violence against women and girls.\nVictims ranged from older than 80 to as young as a four-year-old girl forced to perform oral sex on a soldier, which is rape, the report said. It detailed more than a dozen cases involving gang rapes, family members forced to watch a relative being sexually assaulted, and sexual violence against detainees.\nMs Iryna Didenko, who leads the prosecutor’s department investigating such crimes, has already opened 154 cases of conflict-related sexual violence. The real number, she said, is “much, much more”.\nIn one formerly occupied village in the Kyiv region, psychologists found one in nine women had experienced sexual violence, she said. Hundreds of people suffered sexual violence and torture in Russian detention, she added.\nThe trauma is raw and inhibiting. Viktoriya, a 42-year-old woman in the Kyiv region, shakes when she describes how, in early March, Russian soldiers shot dead her neighbour and then hauled her and her neighbour’s wife off to be raped.\n“The fear still remains,” she said. “Sometimes when the electricity is out, I am seized by fear and I feel they could come back.”\nViktoriya was one of the few survivors willing to talk publicly. She asked that only her first name be used and that her face not be photographed, as did several other women, for fear of reprisals by Russian forces.\nBut the stigma and judgment of neighbours and acquaintances were also an abiding pain, she said.\n“They are gossiping about me, and I mostly stay at home,” she said.\nThe grief was such that her neighbour Nataliia, who was also raped and whose husband was killed, was given refuge abroad. Her 15-year-old son was suicidal in the weeks after the attack, Ms Didenko said.\nA psychologist and lawyer, Ms Didenko met Nataliia when she visited their village after Russian troops withdrew. Before the war, her department had handled domestic violence crimes, and she knew well the difficulties women faced in reporting crimes, she said.\nMuch of that has to do with the stigma of rape in a conservative religious society, but there is also a deep-seated distrust of the authorities in a post-Soviet system that has rarely focused on victims’ needs and often blamed them instead.\n“From our experience with domestic violence, we realised victims do not talk about it in principle,” Ms Didenko said. It is even harder in a war when they could be accused of fraternising with the enemy, she said.\n“No one will come running to apply to us,” she said. “That’s why we decided that we have to go to them.”\nThe need to help Ukraine’s survivors of sexual violence is immense, activists say. The nation’s few women’s shelters have started taking in war victims. Aid organisations such as Women for Women International and the Andreev Foundation started providing mobile gynaecological clinics and counseling sessions.\nOf more than 800 woman and girls that the foundation has counselled since the invasion began, 22 have acknowledged experiencing sexual violence in the war. Eight were younger than 18.\nSome survivors have expressed suicidal thoughts, said Ms Anna Orel, an assistant project manager at the foundation. “One girl said that she wanted to cut off her own skin,” she said. “She could not bear the smell of men’s perfume.”\nOthers were scared of military uniforms, even of Ukrainian soldiers, and of men in general.\n“Many of them don’t want to continue to live,” Ms Orel said. “It’s very, very important for some professional person to hold their hand and to go through this with them.”\nFrom the accounts of those who have come forward, there is evidence that Russian commanders knew about rape or even encouraged it, officials said. Mr Wayne Jordash, a British lawyer advising Ukrainian prosecutors, said he had seen signs of acquiescence by commanders among 30 cases he had reviewed.\nMs Didenko said there was a clear pattern of behavior when Russian troops seized an area: “Ground forces arrive, and rapes start on the second or third day.”\nWitnesses reported commanders’ ordering rape or giving instructions that suggested they condoned it, like telling soldiers to find some relaxation.\nIn one case Ms Didenko described, a commander told his men, “OK, go,” as he waited outside a house. One soldier was heard saying, “We’ll just beat her,” about one woman, and “This one we’ll rape.”\nIn another case, eight Russian soldiers raped and assaulted a man who was stopped at a checkpoint.\n“These are not single cases,” Ms Didenko said.\nThere is an even clearer pattern, she said, of organised sexual abuse in the detention facilities run by Russian troops, police officers and security forces.\nInvestigators have found at least four large detention facilities in Kherson city, with graphic evidence of systemic torture under Russian occupiers.\nIn a business centre’s basement, detainees slept on pieces of cardboard in complete darkness and carved tallies to count the days and messages into the wall. “Oh God, give strength,” one read.\n“This was the torture room,” said Mr Yaroslav Manko, 30, a prosecutor from the region. The police found a rubber baton, metal handcuffs and an electric grill that he said was used to burn detainees’ fingers. They also found a list naming Russian officers who had worked there.\nThere was extensive sexual abuse in the detention centres, including rape with batons and electric shocks to genitals, prosecutors and city officials said.\nOlha, the Kherson woman, said that over 14 days in detention this autumn, she was threatened with rape, and that she was punched and kicked in the head and chest, breaking a rib. Russians put clamps on her legs, arms and earlobes to send an electric current through her body, she said, and doused her in water to worsen the shocks.\nHer interrogators knew she worked with volunteers bringing aid from Ukrainian-held territory to civilians in Kherson. They demanded she film a propaganda video and distribute supplies in the name of United Russia, President Vladimir Putin’s governing political party.\nAnother activist, Andriy, 35, was held for five days in August. Russian occupiers accused him of helping underground partisans and demanded he give up his friends and acquaintances.\n“They give you electric shocks, then you’re given a rest,” he said. “As you are recovering, they beat you with batons or fists.” The bruises on his back were shaped in a Z, a symbol of Russian fighters in Ukraine, he said. The electrical shocks to his earlobes knocked him unconscious. The shocks to his genitals still cause pain four months later.", "url": "https://www.straitstimes.com/world/europe/fear-still-remains-ukraine-finds-sexual-crimes-where-russian-troops-ruled"}