{"authors": [], "date_download": "2024-10-12 14:07:39", "date_modify": "2024-10-12 14:07:39", "date_publish": "2022-05-15 22:20:34", "description": "BERLIN (BLOOMBERG) - Nato welcomed Finland's decision to seek entry into the defense alliance in a historic move following Russia's invasion of Ukraine that ends the Nordic nation's long-held stance of military non-alignment. Read more at straitstimes.com.", "filename": "world_nato-lauds-historic-moment-as-finland-applies-to-join-alliance_1728742059.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/15/ads-finland-nato-15052022.jpg?VersionId=NXevtjB1gFqrN71hdTE6n1aoeBTo1bI6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_nato-lauds-historic-moment-as-finland-applies-to-join-alliance_1728742059.html", "title": "Nato lauds historic moment as Finland applies to join alliance", "title_page": "Nato lauds historic moment as Finland applies to join alliance | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN (BLOOMBERG) - Nato welcomed Finland's decision to seek entry into the defense alliance in a historic move following Russia's invasion of Ukraine that ends the Nordic nation's long-held stance of military non-alignment.\nFinland's formal decision was made on Sunday (May 15) and requires sign-off by the Parliament, expected within days. It's pulling neighboring Sweden along, with a decision by the ruling party in that country slated for later on Sunday in Stockholm.\nForeign ministers of the North Atlantic Treaty Organisation member countries concluded a two-day meeting in Berlin with welcoming words for the Nordic nations and pledged to process applications rapidly, with German Foreign Minister Annalena Baerbock saying the two are already de-facto \"Nato members, just without membership cards.\"\nMr Jens Stoltenberg, secretary general of the bloc, said their entry \"would be a historic moment\" and \"increase our shared security and demonstrate that our doors remain open and that aggression doesn't pay,\" according to comments made at a news conference on Sunday.\nNeighboring Sweden's ruling Social Democrats are on Sunday planning to disclose their stance on Nato membership, just as policy makers are seeking to calm concerns that Turkey could derail their bid. The military bloc requires unanimity to bring in new members.\nUS Secretary of State Antony Blinken said he's \"very confident\" allies will reach a consensus on Finland and Sweden.\nTurkey on Friday suddenly raised concerns over support to Kurdish \"terrorists,\" though it had previously indicated it viewed Finnish and Swedish accession to the bloc in favorable light.\nSo \"you can understand I am a bit confused,\" Finland's President Sauli Niinisto said on Sunday, urging \"a clear answer\" from President Recep Tayyip Erdogan.\n\"Turkey has made it clear that its intention is not to block membership\" of Nato for Finland and Sweden, Mr Stoltenberg said. He also pledged to address Finnish and Swedish security concerns for the period before collective security guarantees kick in with full membership.\nTurkey has long complained of insufficient cooperation from Nato and European allies in its fight with the Kurdistan Workers' Party, or PKK, which is labelled as a terrorist organisation by the US and European Union.\n\"Turkey has conveyed its concerns during the Nato expansion meeting. To be specific; representatives of these two countries were holding meetings with PKK and YPG members and Sweden was also providing weapons to those,\" Turkish Foreign Minister Mevlut Cavusoglu said on Sunday in Berlin. He also suggested they should lift a weapons-export ban on Turkey, and signaled that a more conciliatory attitude was required from Sweden.\nDefining moment\nFinland's move - which has a broad backing among lawmakers in Helsinki - has been called the third defining moment in its history, completing the Nordic nation's century-long aspiration to be considered a fully fledged part of the west.\n\"We see a very different kind of Russia today than we saw just a few months ago,\" Prime Minister Sanna Marin told reporters in Helsinki. \"We cannot trust anymore that there will be a peaceful future next to Russia on our own.\"\n\"That's why we're making the decision to join Nato,\" she said. \"It's an act of peace so that there would never again be war in Finland.\"\nHaving won independence in 1917 after more than 100 years as a Grand Duchy of the Russian Empire, Finns fought two wars with the Soviet Union, ceding parts of their territory in 1944. Finland then tiptoed through an era of neutrality during the Cold War - by necessity, not by choice - cowering to Moscow while retaining independence in a policy that came to be known as Finlandisation.\nAfter the collapse of the Soviet Union, the Nordic country immediately sought entry into the European fold in Sweden's wake, with the two joining the European Union in 1995.\n\"We have been talking here in Finland for at least 30 years about Nato membership,\" President Niinisto said. \"When we talk about security, even if it's not that visible in daily life, it has huge impact in our minds and that makes this decision also historic.\"\nSurvival\nA former president, Mauno Koivisto, was once asked what the idea of Finland is, if not a part of Russia. His famous one-word reply: \"Survival.\"\nIn that spirit, the country of 5.5 million people has always remained on alert. It's guarding a border roughly 1,300 kilometers (800 miles) long, has a reserve of 900,000 troops and is able to deploy 280,000 of them in war time.\nIt's held on to a conscription-based system where most men and some women undergo military training lasting from six months to a year.\nFinland's military equipment are compatible with Nato gear and include a large number of artillery and tanks. The country in December decided to buy 64 Lockheed Martin Corp. F-35A multi-role fighter jets to replace its aging F/A-18 Hornets in a €10 billion (S$14.5 billion) procurement.\nRussian Reaction President Niinisto phoned Russian President Vladimir Putin on Saturday to inform him of the plan to seek Nato membership. The move would be a \"mistake because there are no threats to Finland's security\", Mr Putin told his Finnish counterpart, according to a statement from the Kremlin, adding that it could harm relations between the countries.\nMr Putin's reaction to the Finnish plan was \"milder than ever before,\" Niinisto told reporters on Sunday. \"It may be that they want to avoid\" this becoming a topic of discussion in Russia, he said.\nRussia has hinted at the prospect of more troops on the border, or bringing nuclear weapons into its Baltic exclave of Kaliningrad in response.\n\"This is a card the Russians have been playing since 2014 and onward,\" said Anna Wieslander, director for Northern Europe at the Atlantic Council. \"We believe that they have had such weapons in Kaliningrad already since 2018 and have taken precautions due to that.\"", "url": "https://www.straitstimes.com/world/nato-lauds-historic-moment-as-finland-applies-to-join-alliance"}