{"authors": [], "date_download": "2024-10-12 13:34:57", "date_modify": "2024-10-12 13:34:57", "date_publish": "2024-01-21 22:34:00", "description": "The group made the comments in its first public report justifying the attacks. Read more at straitstimes.com.", "filename": "world_middle-east_hamas-says-oct-7-attacks-a-necessary-step-but-admits-faults_1728740097.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/21/PALESTINIAN-ISRAEL-CONFLICT-135303.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_hamas-says-oct-7-attacks-a-necessary-step-but-admits-faults_1728740097.html", "title": "Hamas says Oct 7 attacks a ‘necessary step’ but admits ‘faults’", "title_page": "Hamas says Oct 7 attacks a ‘necessary step’ but admits ‘faults’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GAZA STRIP - Palestinian militant group Hamas said Jan 21 that its Oct 7 attacks in southern Israel were a “necessary step” against Israeli occupation of the Palestinian territories.\nBut the Islamist group admitted in a 16-page report justifying the attack that “some faults happened... due to the rapid collapse of the Israeli security and military system, and the chaos caused along the border areas with Gaza”.\nThe document was the group’s first public report released in English and Arabic explaining the background to the attack, when the militants broke through Gaza’s militarised border.\nAt the end of a Jewish holiday on Oct 7, hundreds of Hamas fighters crossed into Israel by land, air and sea and killed civilians in the streets, in their homes and at an outdoor rave party.\nThe attack resulted in the deaths of about 1,140 people, mostly civilians, according to an AFP tally based on official Israeli figures.\nAround 700 Israeli civilians and 76 foreigners were among the dead, with one Israeli still missing, according to Israeli social security data.\nDuring the attack, the gunmen seized around 250 hostages, according to the latest Israeli figures.\nIsraeli officials say around 132 captives remain in Gaza, of whom at least 27 are believed to have been killed.\n“If there was any case of targeting civilians it happened accidently and in the course of the confrontation with the occupation forces,” Hamas said in the report.\n“Many Israelis were killed by the Israeli army and police due to their confusion.”\n‘Halt Israeli aggression’\nIsrael retaliated by declaring a war to destroy Hamas, pounding the Gaza Strip in the deadliest bombing campaign the area has ever faced.\nIsrael deployed tens of thousands of troops along the Gaza frontier and on the northern border with Lebanon.\nIt declared a complete siege of Gaza, cutting off supplies of water, electricity and food, decisions denounced by the United Nations.\nIsrael’s retaliation has killed at least 25,105 people in Gaza, mostly women, children and adolescents, according to the health ministry in the territory.\nIsraeli officials have repeatedly alleged that the militants committed gang rape, genital mutilation and engaged in sexual acts with children and corpses during the attack.\nHamas has rejected the accusations, saying they were intended to “demonise” it.\nThe militant group said the attack was “a necessary step and a normal response to confront all Israeli conspiracies against the Palestinian people”.\nOn Jan 21, Hamas urged “the immediate halt of the Israeli aggression on Gaza, the crimes and ethnic cleansing committed against the entire Gaza population”.\nAnd the group said it rejected any international and Israeli efforts to decide Gaza’s post-war future.\n“We stress that the Palestinian people have the capacity to decide their future and to arrange their internal affairs,” the report said, adding that “no party in the world” had the right to decide on their behalf.\nHamas pointed to the historical origins of the conflict, saying “the battle of the Palestinian people against occupation and colonialism did not start on Oct 7, but started 105 years ago, including 30 years of British colonialism and 75 years of Zionist occupation”.\nThe group said it wanted to “hold the Israeli occupation legally accountable” for the suffering it had inflicted on the Palestinian people. AFP", "url": "https://www.straitstimes.com/world/middle-east/hamas-says-oct-7-attacks-a-necessary-step-but-admits-faults"}