{"authors": [], "date_download": "2024-10-12 13:39:35", "date_modify": "2024-10-12 13:39:35", "date_publish": "2024-05-21 13:39:56", "description": "PARIS - France backs the International Criminal Court and the \\\"fight against impunity\\\", its foreign ministry said after the ICC prosecutor requested arrest warrants for Israeli Prime Minister Benjamin Netanyahu and Hamas leaders for alleged war crimes. Read more at straitstimes.com.", "filename": "world_europe_france-backs-icc-after-prosecutor-seeks-arrest-warrants-for-israels-netanyahu_1728740375.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/21/LYNXMPEK4K04Y-1.jpg?VersionId=krtbtd9Rn0ofP5QW8II2lzbcdeNZujCW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_france-backs-icc-after-prosecutor-seeks-arrest-warrants-for-israels-netanyahu_1728740375.html", "title": "France backs ICC after it seeks arrest warrants for Israel's Netanyahu, Hamas leaders", "title_page": "France backs ICC after it seeks arrest warrants for Israel's Netanyahu, Hamas leaders | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - France backs the International Criminal Court and the \"fight against impunity\", its foreign ministry said after the ICC prosecutor requested arrest warrants for Israeli Prime Minister Benjamin Netanyahu and Hamas leaders for alleged war crimes.\nOn Monday, ICC prosecutor Karim Khan said he had requested arrest warrants for Netanyahu, his defence chief Yoav Gallant and three Hamas leaders, including its chief, Yahya Sinwar.\nIf such warrants are issued, members of the court, which includes nearly all countries of the European Union, could be put in a diplomatically difficult position.\n\"France supports the International Criminal Court, its independence and the fight against impunity in all situations,\" the foreign ministry said in a statement late on Monday.\nWhile U.S. President Joe Biden called the legal step against Israeli officials \"outrageous\", the French foreign ministry took a different stance.\nIt reiterated both its condemnation of Hamas's 'anti-Semitic massacres' on Oct. 7 as well as its warnings over possible violations of international humanitarian law by Israel's invasion of the Gaza strip.\n\"As far as Israel is concerned, it will be up to the court's pre-trial chamber to decide whether to issue these warrants, after examining the evidence put forward by the prosecutor,\" the ministry said.\nForeign Minister Stephane Sejourne told the National Assembly on Tuesday that the \"simultaneous\" warrant requests must not establish an \"equivalency\" between Hamas and Israel.\n\"On one side you have a terrorist group that congratulated itself on the Oct. 7 attacks...and on the other side you have a democracy, Israel, that must respect international law while conducting a war it did not start,\" Sejourne said. REUTERS", "url": "https://www.straitstimes.com/world/europe/france-backs-icc-after-prosecutor-seeks-arrest-warrants-for-israels-netanyahu"}