{"authors": [], "date_download": "2024-10-12 14:08:26", "date_modify": "2024-10-12 14:08:26", "date_publish": "2024-06-19 02:00:31", "description": "He honed his skills as a political dealmaker during nearly 14 years as Dutch prime minister. Read more at straitstimes.com.", "filename": "world_europe_dutchman-mark-rutte-longtime-putin-critic-set-to-lead-nato-alliance_1728742106.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/19/LYNXMPEK5H0NQ-1.jpg?VersionId=LYK8F8TAQmGT.Vr7gkx5sCpx9TGuNypt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_dutchman-mark-rutte-longtime-putin-critic-set-to-lead-nato-alliance_1728742106.html", "title": "Dutchman Mark Rutte, long-time Putin critic, set to lead Nato alliance", "title_page": "Dutchman Mark Rutte, long-time Putin critic, set to lead Nato alliance | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AMSTERDAM - Mr Mark Rutte, who looks set to be Nato's next secretary-general, is a staunch ally of Ukraine and a fierce critic of Russian President Vladimir Putin, who honed his skills as a political dealmaker during nearly 14 years as Dutch prime minister.\nMr Rutte, 57, has been one of the driving forces behind Europe's military support for Ukraine since Russia's 2022 invasion, and says defeat on the battlefield for Moscow is vital to secure peace in Europe.\nHis view is heavily influenced by the downing of an airliner over Ukraine in 2014, which the Netherlands blames on Russia, and in which 196 of the 298 victims were Dutch. Nato must be powerful to counter Moscow, and other European Union leaders must not be naive about Mr Putin's Russia, he says.\n\"He won’t stop at Ukraine, if we don’t stop him now. This war is bigger than Ukraine itself. It’s about upholding the international rule of law,\" Mr Rutte told the United Nations in September 2022, seven months after Russia's full-scale invasion.\nMr Rutte first took office in 2010 and went on to become the longest-serving Dutch prime minister before announcing in 2023 that he planned to leave national politics.\nAfter the downing of flight MH17, he went from being primarily domestically focused to one of the EU's main dealmakers, playing an important role in European debates on immigration, debt and the response to Covid-19.\nUnder his leadership, the Netherlands has increased defence spending to more than the 2 per cent threshold of GDP required of Nato members, providing F-16 fighter jets, artillery, drones and ammunition to Kyiv and investing heavily in its own military.\nHis path to replace Mr Jens Stoltenberg, who steps down as Nato chief in October after nearly a decade at the helm, became all but certain after Hungary and Slovakia indicated on June 18 that they would back his nomination to lead the 32-state alliance.\nThat left only Romania, whose President Klaus Iohannis was also vying for the job, opposed to Mr Rutte's candidacy.\nMr Stoltenberg said on Tuesday that Mr Rutte was a \"very strong\" candidate to replace him and a decision was near.\nUnder Mr Stoltenberg, who joined a few months after Russia annexed Crimea from Ukraine in 2014, the alliance has added Montenegro, North Macedonia, Finland and Sweden as new members.\nSome members of the North Atlantic Treaty Organisation had hoped Estonian Prime Minister Kaja Kallas would become the first woman to lead Nato but others saw her as too hawkish towards Russia.\nTransatlantic bond\nMr Rutte will step aside formally as prime minister when the recently forged right-wing Dutch government replaces his centre-right coalition.\nMr Rutte, who is unmarried, has lived all his life in The Hague and had hinted he might enjoy teaching after politics, but he cited the war in Ukraine as the reason for seeking an international post as he set his sights on the Nato leadership.\nHe is a strong backer of Ukrainian President Volodymyr Zelensky, whom he recalled meeting in Kyiv five years ago.\n\"It was clear even then: this is a man with a mission... I am convinced that Ukraine's success largely depends on the mentality he conveyed from the very beginning,\" Mr Rutte told Reuters in April.\nBy contrast, even while warning of the threat posed by Mr Putin, he has suggested the Russian leader is not as strong as he seems.\n\"Don't mentally overestimate Putin. I've talked to the man a lot. He's not a strong man, he's not a strong guy,\" Mr Rutte said in a debate with Parliament in April.\nMr Rutte cemented his bid to become Nato’s new chief in 2023 while co-leading an international coalition that will deliver F-16 fighters to Ukraine and train Ukrainian pilots.\nIn his last months in office, he also signed a 10-year security pact with Ukraine, guaranteeing support from the Netherlands despite criticism by far-right leader and election-winner Geert Wilders.\nMr Rutte has forged good relationships with various British and US leaders and is widely seen as having been one of the most successful in the EU at dealing with former US president Donald Trump, who is standing for re-election.\nThis could prove valuable experience, as Trump's possible return has unnerved Nato leaders since the former president called into question US willingness to support other members of the defence alliance if they were attacked.\nAt the annual Munich Security Conference in 2023, Mr Rutte said leaders should stop \"moaning and whining about Trump\", and spend more on defence and ammunitions production, regardless of who wins the US election. REUTERS", "url": "https://www.straitstimes.com/world/europe/dutchman-mark-rutte-longtime-putin-critic-set-to-lead-nato-alliance"}