{"authors": [], "date_download": "2024-10-12 14:05:32", "date_modify": "2024-10-12 14:05:32", "date_publish": "2022-05-18 07:05:04", "description": "Washington seeks to ensure Moscow is held accountable for its actions. Read more at straitstimes.com.", "filename": "world_united-states_us-launches-programme-to-capture-analyse-evidence-of-russian-war-crimes-in-ukraine_1728741932.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/18/md_ukrwarcrimepros_18052022.jpg?VersionId=JIcVwO9FPZqiRAWgNIeQy3qcXeVsc_dW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-launches-programme-to-capture-analyse-evidence-of-russian-war-crimes-in-ukraine_1728741932.html", "title": "US launches programme to capture, analyse evidence of Russian war crimes in Ukraine", "title_page": "US launches programme to capture, analyse evidence of Russian war crimes in Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - The US State Department on Tuesday (May 17) announced the launch of a new programme to capture and analyse evidence of war crimes and other atrocities allegedly perpetrated by Russia in Ukraine, as Washington seeks to ensure Moscow is held accountable for its actions.\nThe State Department in a statement said the so-called Conflict Observatory will encompass documentation, verification and dissemination of open-source evidence of Russia's actions in Ukraine. Reports and analyses will be made available through the Conflict Observatory's website.\nUS President Joe Biden has hammered Russia over what he calls \"major war crimes\" committed in Ukraine, and has underscored his resolve to hold Moscow accountable for launching the largest land war in Europe since World War II.\nThe Kyiv government has accused Russia of atrocities and brutality against civilians during the invasion and said it has identified more than 10,000 possible war crimes.\nRussia denies targeting civilians and says, without evidence, that signs of atrocities were staged.\nThe US State Department said the new programme, which is being established with an initial US$6 million (S$8.31 million) investment, will analyse and preserve information, including satellite imagery and information shared on social media, so it can be used in ongoing and future accountability mechanisms.\n\"This new Conflict Observatory programme is part of a range of US government efforts at both national and international levels designed to ensure future accountability for Russia's horrific actions,\" the statement said.\nThe programme is a collaboration with geographic information systems company Esri, Yale University's Humanitarian Research Lab, the Smithsonian Cultural Rescue Initiative and PlanetScape Ai, the State Department said, adding that future funding will come from the European Democratic Resilience Initiative.\nState Department spokesperson Ned Price said the United States has been engaged through a variety of mechanisms to collect and document evidence of potential war crimes and atrocities with relevant prosecutors, state entities and organisations.\nBut the new programme, he told reporters, will share those findings for the public and authorities in areas of appropriate jurisdiction, including within Ukraine and possibly the United States, \"so that prosecutors can potentially even build criminal cases based on the material that is published.\"\nA Ukrainian court held a preliminary hearing on Friday (May 13) in the first war crimes trial arising from Russia's Feb 24 invasion, after charging a captured Russian soldier with the murder of a 62-year-old civilian.\nRussia has bombed cities to rubble and hundreds of civilian bodies have been found in towns where its forces withdrew since starting what it calls a special operation to demilitarise Ukraine. Kyiv and its Western allies say it is a baseless pretext for an unprovoked war.\nThe International Criminal Court (ICC) said on April 25 it would take part in a joint team with Ukrainian, Polish and Lithuanian prosecutors investigating war crimes allegations against Russian forces.\nUkraine has little experience in prosecuting such cases. Its Parliament last year adopted legislation to provide a legal framework for war crimes prosecutions in line with international practice, Ms Zera Kozlyieva, deputy head of the war crimes unit in the prosecutor-general's office, said last month.", "url": "https://www.straitstimes.com/world/united-states/us-launches-programme-to-capture-analyse-evidence-of-russian-war-crimes-in-ukraine"}