{"authors": [], "date_download": "2024-10-12 14:01:48", "date_modify": "2024-10-12 14:01:48", "date_publish": "2020-09-10 08:16:03", "description": "SAN FRANCISCO (AFP) - Chinese internet giant ByteDance is in talks with the US about ways it might avoid having to sell its TikTok operations here, the Wall Street Journal reported Wednesday (Sept 9). Read more at straitstimes.com.", "filename": "world_united-states_bytedance-in-talks-with-us-to-avoid-selling-tiktok-report_1728741708.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/09/10/rk_tiktok_100920.jpg?VersionId=S3DG8mKUbAQYJ1ONUJHsovt3gQMaFJt8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_bytedance-in-talks-with-us-to-avoid-selling-tiktok-report_1728741708.html", "title": "ByteDance in talks with US to avoid selling TikTok: Report", "title_page": "ByteDance in talks with US to avoid selling TikTok: Report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAN FRANCISCO (AFP) - Chinese internet giant ByteDance is in talks with the US about ways it might avoid having to sell its TikTok operations here, the Wall Street Journal reported Wednesday (Sept 9).\nTikTok has been at the centre of a diplomatic storm between Washington and Beijing, and President Donald Trump gave Americans a deadline to stop doing business with TikTok's Chinese parent company ByteDance - effectively compelling a sale of the app to a US company.\nWalmart has joined forces with Microsoft in negotiations to buy TikTok. Oracle is also reported to be interested in TikTok.\nTikTok - which has been downloaded 175 million times in the US and more than a billion times around the world - has filed a lawsuit challenging the crackdown by the US government.\nThe suit contends that Trump's order was a misuse of the International Emergency Economic Powers Act because the platform is not \"an unusual and extraordinary threat.\"\nTrump claims that TikTok could be used by China to track the locations of federal employees, build dossiers on people for blackmail and conduct corporate espionage.\nTikTok - used by as many as a billion people worldwide to make quirky, short-form videos on their cellphones - has repeatedly denied sharing data with Beijing.\nTalks between ByteDance and the US have been taking place for months but have grown more urgent as the deadline set by Trump nears, according to the Journal report.\nAt least one of TikTok's major investors was part of a group that met recently with representatives from the Central Intelligence Agency to discuss data security, the Journal reported, citing someone familiar with the matter.\nTrump last week repeated his demand for a piece of the action from any sale of TikTok's US operations for forcing such a deal.\n\"Well, I told them that they have until September 15th to make a deal; after that, we close it up in this country,\" Trump told journalists.", "url": "https://www.straitstimes.com/world/united-states/bytedance-in-talks-with-us-to-avoid-selling-tiktok-report"}