{"authors": [], "date_download": "2024-10-12 13:57:07", "date_modify": "2024-10-12 13:57:07", "date_publish": "2024-02-27 01:42:15", "description": "BUENOS AIRES - A deadly type of bird flu has been confirmed on the mainland of Antarctica for the first time, scientists said, a potential risk for the southern region's huge penguin colonies. Read more at straitstimes.com.", "filename": "world_bird-flu-reaches-mainland-antarctica-for-first-time-scientists-say_1728741427.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/27/LYNXNPEK1P0ON-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_bird-flu-reaches-mainland-antarctica-for-first-time-scientists-say_1728741427.html", "title": "Bird flu reaches mainland Antarctica for first time, scientists say", "title_page": "Bird flu reaches mainland Antarctica for first time, scientists say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BUENOS AIRES - A deadly type of bird flu has been confirmed on the mainland of Antarctica for the first time, scientists said, a potential risk for the southern region's huge penguin colonies.\n\"This discovery demonstrates for the first time that the Highly Pathogenic Avian Influenza virus has reached Antarctica despite the distance and natural barriers that separate it from other continents,\" Spain's Higher Council for Scientific Investigation (CSIC) said on Sunday.\nThe presence of the virus was confirmed on Saturday in samples of dead skua seabirds that were found by Argentine scientists near the Antarctic base Primavera, CSIC added.\nThe confirmed case on the Antarctic peninsula, coming after cases on islands nearby, including among gentoo penguins, highlights the risk to colonies in the region to the H5N1 avian flu that has decimated bird populations around the world in recent months.\n\"Analysis has conclusively shown that the birds were infected with the H5 subtype of avian influenza and at least one of the dead birds contained the highly pathogenic avian influenza virus,\" CSIC said in a statement.\nArgentina's Antarctic Institute on Monday said that the South American country had worked with Spanish researchers to test samples from dead birds found earlier in the year near the Argentine base, which confirmed the presence of the virus.\nHundreds of thousands of penguins gather in tightly packed colonies on the Antarctic continent and nearby islands, which could enable the deadly virus to easily spread.\nData from the Scientific Committee on Antarctic Research also showed a now-confirmed case at the research base. REUTERS", "url": "https://www.straitstimes.com/world/bird-flu-reaches-mainland-antarctica-for-first-time-scientists-say"}