{"authors": [], "date_download": "2024-10-12 13:36:41", "date_modify": "2024-10-12 13:36:41", "date_publish": "2024-09-17 06:31:25", "description": "The Biden administration continues with efforts to revive the stalled ceasefire talks. Read more at straitstimes.com.", "filename": "world_blinken-to-travel-to-egypt-and-discuss-gaza-ceasefire_1728740201.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/LYNXMPEK8F0SH-1.jpg?VersionId=3diF1HpLPMlO7_NDB7Uylyx6ITmnMQjE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_blinken-to-travel-to-egypt-and-discuss-gaza-ceasefire_1728740201.html", "title": "Blinken to make 10th trip to Middle East for elusive Gaza ceasefire", "title_page": "Blinken to make 10th trip to Middle East for elusive Gaza ceasefire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – US Secretary of State Antony Blinken plans to embark on his 10th trip to the Middle East since the Israel-Hamas war began almost a year ago, as the Biden administration continues efforts to revive the stalled ceasefire talks as the US election approaches.\nThe top US diplomat will fly to Cairo to discuss the negotiations for a ceasefire in Gaza and broader regional security issues, as well as for talks with Egyptian officials, State Department spokesman Matthew Miller said on Sept 16.\nThe statement mentions only one stop in Egypt, and it does not appear that Mr Blinken will travel to Israel on this visit.\nThe announcement came on the same day as Israeli officials stressed to Mr Amos Hochstein, an adviser to US President Joe Biden, that their government was increasingly looking at military means for returning residents in northern Israel displaced by clashes with Hezbollah militants in Lebanon.\nThat would amount to an expansion of the conflict, which the Biden team has tried desperately to avoid.\nDefence Minister Yoav Gallant told Mr Hochstein that “the only way left to return the residents of the north to their homes is via military action”.\nPrime Minister Benjamin Netanyahu separately told him “that Israel appreciates and respects the support of the United States, but in the end will do what is necessary to maintain its security”, according to a read-out from the prime minister’s office.\nThe latest bout of regional diplomacy since the Oct 7, 2023, assault by Hamas, in which 1,200 Israelis were killed and about 250 others taken captive, unfolded as the US and partners struggle to close the remaining gaps in talks for a ceasefire, including details about the release of hostages and the deployment of Israeli troops.\nMore than 41,000 Palestinians have been killed in Gaza, according to the Hamas-run Health Ministry.\nThe US is currently still working with mediators on a new proposal, Mr Miller said on Sept 16.\nOn Sept 5, Mr Blinken said the US, Qatar and Egypt would share their thoughts “in the coming days” on how to “resolve the remaining outstanding questions” in the negotiations.\nWhile American officials, including Mr Blinken, have said a deal is roughly 90 per cent completed, the long-running negotiations to end the war appear to have stalled after the killing earlier in September of six hostages held by Hamas, which has been designated a terrorist organisation by the US and the European Union.\nMr Netanyahu has refused to withdraw Israeli troops from the Philadelphi Corridor along the Egypt-Gaza border, a key disagreement.\nThe Israeli leader argues that his forces must police smuggling routes that could help Hamas, and that Israel cannot reward the militant group with concessions after hostages were killed. BLOOMBERG", "url": "https://www.straitstimes.com/world/blinken-to-travel-to-egypt-and-discuss-gaza-ceasefire"}