{"authors": [], "date_download": "2024-10-12 14:01:03", "date_modify": "2024-10-12 14:01:03", "date_publish": "2024-01-26 01:40:43", "description": "Ukraine is working to organise a visit by Hungarian Prime Minister Viktor Orban, Ukrainian Deputy Prime Minister Olha Stefanishyna said on Thursday, the first visit since Russia's invasion by a figure widely seen as the most sympathetic to Moscow of all leaders of NATO states. Read more at straitstimes.com.", "filename": "world_europe_kyiv-working-to-organise-visit-by-hungarys-orban-ukraine-deputy-pm-says_1728741663.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/26/LYNXMPEK0O0PF-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_kyiv-working-to-organise-visit-by-hungarys-orban-ukraine-deputy-pm-says_1728741663.html", "title": "Kyiv working to organise visit by Hungary's Orban, Ukraine deputy PM says", "title_page": "Kyiv working to organise visit by Hungary's Orban, Ukraine deputy PM says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Ukraine is working to organise a visit by Hungarian Prime Minister Viktor Orban, Ukrainian Deputy Prime Minister Olha Stefanishyna said on Thursday, the first visit since Russia's invasion by a figure widely seen as the most sympathetic to Moscow of all leaders of NATO states.\nStefanishyna confirmed the plans in remarks to Reuters, related by her aide.\nThe Hungarian and Ukrainian foreign ministers are due to meet on Monday, and President Volodymyr Zelenskiy's chief of staff has said a visit by Orban could be discussed.\nRelations between Budapest and Kyiv have been strained by Hungary's opposition to providing aid to Ukraine from the EU budget and scepticism about Ukraine's NATO and EU membership aspirations. REUTERS", "url": "https://www.straitstimes.com/world/europe/kyiv-working-to-organise-visit-by-hungarys-orban-ukraine-deputy-pm-says"}