{"authors": [], "date_download": "2024-10-12 14:00:27", "date_modify": "2024-10-12 14:00:27", "date_publish": "2024-07-03 18:55:22", "description": "In June, allies decided Nato would assume a greater role in coordinating arms supplies to Ukraine. Read more at straitstimes.com.", "filename": "world_europe_nato-members-agree-40-billion-euro-financial-pledge-for-ukraine-diplomats-say_1728741627.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/03/LYNXMPEK620DA-1.jpg?VersionId=t7OkqH8xmmLct7ceyPxE4TO0iUrVtYKf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_nato-members-agree-40-billion-euro-financial-pledge-for-ukraine-diplomats-say_1728741627.html", "title": "Nato members agree on $58b financial pledge for Ukraine, diplomats say", "title_page": "Nato members agree on $58b financial pledge for Ukraine, diplomats say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS - Nato allies have agreed to fund military aid for Ukraine with €40 billion (S$58 billion) in 2025, two Western European diplomats told Reuters on July 3, a week before the alliance’s leaders are set to meet in Washington.\nNato Secretary-General Jens Stoltenberg had asked allies to make a multi-year commitment to keep military aid for Kyiv at the same level as that since Russia’s full-scale invasion of Ukraine in 2022, adding up to about €40 billion a year.\nWhile the member states did not back Mr Stoltenberg’s original request for such a multi-year pledge, the pact includes a provision to re-evaluate allied contributions at future Nato summits, according to a diplomat.\nAllies also decided to have two reports over the next year to establish which country supplies what to Ukraine, the diplomat said, to meet demands for more transparency over the burden sharing in the alliance.\nMember states “will aim to meet this pledge through proportionate contributions”, the agreement said.\nThe financial pledge is part of a broader Ukraine package that Nato leaders will agree to when they gather for the Washington summit from July 9 to 11.\nIn June, allies decided that Nato would assume a greater role in coordinating arms supplies to Ukraine, taking over from the United States in a bid to safeguard the process as Nato-sceptic Donald Trump seeks a second term as US president.\nAfter Russia’s invasion in 2022, the US gathered like-minded nations at the Ramstein air base in Germany, forming a group of nations that now numbers about 50, which meets regularly to match Kyiv’s arms requests with pledges of donors.\nThis so-called Ramstein group will continue to exist as a US-led political forum but Nato will take over the military working level below that coordinates arms deliveries and training for Ukrainian troops.\nThe move is widely seen as a way to provide a degree of “Trump-proofing” by putting coordination under a Nato umbrella, giving the alliance a more direct role in the war against Russia, while stopping well short of committing its own forces.\nBut diplomats acknowledge such a move may have limited effect, as the US is Nato’s dominant power and provides the majority of weaponry to Ukraine.\nSo if Washington wanted to slash Western aid to Kyiv, it would still be able to do so.\nHowever, allies are still at odds in the run-up to the Washington summit over whether, and how, to strengthen Nato’s wording on Ukraine’s future membership in the alliance.\nNato’s official line is that Ukraine will join one day, but not while the country is at war. “Ukraine’s future is in Nato,” its leaders declared at 2023’s Vilnius summit.\nSome allies want this language to be strengthened, suggesting the summit declare that Ukraine’s path to membership is “irreversible”, according to diplomats. REUTERS", "url": "https://www.straitstimes.com/world/europe/nato-members-agree-40-billion-euro-financial-pledge-for-ukraine-diplomats-say"}