{"authors": [], "date_download": "2024-10-12 14:10:28", "date_modify": "2024-10-12 14:10:28", "date_publish": "2018-12-07 02:34:19", "description": "WASHINGTON (REUTERS) - US senators, bent on punishing Saudi Crown Prince Mohammed bin Salman for the killing of journalist Jamal Khashoggi, said on Thursday (Dec 6) they want to vote next week to penalise Riyadh, but struggled to agree on how best to do so. Read more at straitstimes.com.", "filename": "world_united-states_us-senators-grapple-with-ways-to-punish-saudis-over-khashoggi-death_1728742228.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/12/07/file728180w0zw4fhz58aln.jpg?VersionId=EjgeA0eOt_Wl.lt9MFbNMAg5OfDbWaFM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-senators-grapple-with-ways-to-punish-saudis-over-khashoggi-death_1728742228.html", "title": "US senators grapple with ways to punish Saudis over Khashoggi death", "title_page": "US senators grapple with ways to punish Saudis over Khashoggi death | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - US senators, bent on punishing Saudi Crown Prince Mohammed bin Salman for the killing of journalist Jamal Khashoggi, said on Thursday (Dec 6) they want to vote next week to penalise Riyadh, but struggled to agree on how best to do so.\nDespite President Donald Trump's desire to maintain close ties to Saudi Arabia, several of his fellow Republicans have joined Democrats in blaming the crown prince for Khashoggi's death and backing legislation to respond by ending US support for the Saudi-led war effort in Yemen, imposing new sanctions and stopping weapons sales.\nFive Republican and Democratic senators met behind closed doors on Thursday morning to discuss how to move ahead, saying afterward they had not yet come up with a compromise that could win enough bipartisan support to pass the Senate.\nThe senators' lack of agreement contrasted with their harsh words on Tuesday against the crown prince, the de facto ruler of the kingdom who has denied knowledge of the operation that killed Khashoggi on Oct 2 in the Saudi consulate in Istanbul.\nA briefing by Central Intelligence Agency Director Gina Haspel for senators on Tuesday hardened their resolve to act against the prince known as MbS, who has the support of Trump.\nThere are three different measures making their way through the Senate: a war powers resolution ending any U.S. involvement in the Yemen conflict, legislation imposing a broad clampdown on Saudi Arabia, including ending arms sales and levying new sanctions; and a nonbinding resolution targeting the crown prince.\nThe Senate is expected to vote on the war powers resolution next week, but lawmakers have not yet agreed on how, or whether, it should be amended. Some have questioned whether the resolution is even legal, and others said they want a response to Khashoggi's death but agree with the Trump administration that Washington should continue to back the Saudis as an essential counterweight to Iran.\nSaudi Arabia is leading a campaign in Yemen against the Houthis, Shi'ite Muslim fighters that Yemen's neighbors view as agents of Iran. The war has killed more than 10,000 people and created the world's most urgent humanitarian crisis.\nDEFYING TRUMP\nFourteen Republicans, who hold a slim majority in the Senate and rarely break from the president, have already defied Trump and voted with Democrats in favor of moving ahead with the war powers resolution.\nBut to become law, the resolution would not just have to pass the Senate this month, but also must pass the House of Representatives and be signed by Trump, neither of which is expected this year. However, backers said Senate passage alone would still be an important step.\n\"A vote on the resolution is a very tough message to Saudi Arabia that the relationship is changing. And you can interpret that as a message on the Yemen war, but you can also interpret that as a message on Khashoggi,\" Democratic Senator Chris Murphy, a co-sponsor, told reporters.\nIt was not immediately clear whether the broader legislation would come up for a Senate vote before lawmakers go home for the year and a new Congress is seated in January, or whether some provisions might be added to the war powers measure.\nRepublican Senator Bob Corker, chairman of the Senate Foreign Relations Committee, who is retiring this month, said he hoped to hold a hearing early next week on the broader legislation.\nSenator Lindsey Graham, one of the most vocal critics of Saudi Arabia who is close to Trump, introduced the bipartisan, but nonbinding, Senate resolution on Thursday. That measure is intended to hold the Saudi crown prince \"accountable\" for contributing to the humanitarian crisis in Yemen, a blockade of Qatar, the jailing of dissidents and Khashoggi's death.\nGraham said he supported the idea of stopping US aid for the war in Yemen, but thought the war powers resolution was not constitutional.\nMany lawmakers have been calling for months for an end to US refuelling of Saudi jets that bomb Yemen, often killing civilians. But the murder of Khashoggi, a US resident and Washington Post columnist, added to frustration with the kingdom and prompted even stronger demands for a shift in relations.", "url": "https://www.straitstimes.com/world/united-states/us-senators-grapple-with-ways-to-punish-saudis-over-khashoggi-death"}