{"authors": [], "date_download": "2024-10-12 14:03:12", "date_modify": "2024-10-12 14:03:12", "date_publish": "2023-04-19 23:37:22", "description": "Patriot is seen as one of the most advanced US air defence systems. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-received-first-patriot-air-defence-systems_1728741792.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/20/2023-04-04T161050Z49111470RC266Z90DL81RTRMADP3UKRAINE-CRISIS-ARMS_0.JPG?VersionId=LjfNRwpnjFEsnBxC1F7QDBGur0iSXwTN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-received-first-patriot-air-defence-systems_1728741792.html", "title": "Ukraine says it has received first Patriot air defence systems", "title_page": "Ukraine says it has received first Patriot air defence systems | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Kyiv said on Wednesday that it had received the first Patriots, seen as one of the most advanced US air defence systems, and deployed France’s light armoured fighting vehicles as Ukraine prepares for a counteroffensive.\n“Today, our beautiful Ukrainian sky becomes more secure because Patriot air defence systems have arrived in Ukraine,” Defence Minister Oleksiy Reznikov said on Twitter.\nHe added that the United States, Germany and the Netherlands had “kept their word”.\nWashington said in late 2022 that it would provide Ukraine with its Patriot air defence system as Russia pounded Ukraine’s energy infrastructure from the air.\nUkrainian President Volodymyr Zelensky has said the system will “significantly” strengthen Ukraine’s defence against Russian strikes.\nRussian President Vladimir Putin dismissed the announcement at the time, saying Russia will find an “antidote”.\nGermany announced in January that it was following the US in sending one of the advanced missile defence batteries to Ukraine.\nThe Netherlands said it would supply parts of a Patriot air defence system to Ukraine, specifically two launchers and missiles.\nSeparately, the Ukrainian army said on Wednesday that France’s light AMX-10 RC armoured fighting vehicles were “already in service”. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-says-received-first-patriot-air-defence-systems"}