{"authors": [], "date_download": "2024-10-12 14:18:47", "date_modify": "2024-10-12 14:18:47", "date_publish": "2024-02-09 02:33:23", "description": "The raids were carried out as part of a preliminary investigation launched by France’s financial prosecution service, said the source. Read more at straitstimes.com.", "filename": "world_europe_huawei-raided-in-france-on-suspicion-of-improper-conduct-says-judicial-source_1728742727.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/09/FILES-FRANCE-CHINA-TECHNOLOGY-JUSTICE-145408.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_huawei-raided-in-france-on-suspicion-of-improper-conduct-says-judicial-source_1728742727.html", "title": "Huawei raided in France on suspicion of improper conduct, says judicial source", "title_page": "Huawei raided in France on suspicion of improper conduct, says judicial source | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The French offices of Chinese telecoms giant Huawei were raided this week on suspicion of improper behaviour, a judicial source told AFP on Feb 8.\nThe source said the Feb 6 raids were carried out as part of a preliminary investigation launched by France’s financial prosecution service (PNF).\nNo other details were immediately available about the probe into the company, whose French offices are located just outside Paris in Boulogne-Billancourt.\nImproper behaviour can include offences such as corruption and influence peddling.\nHuawei arrived in France in 2003 and now runs six research centres and a global design centre in the country.\nThe telecoms giant is currently building a factory in Alsace in northeastern France, its first outside China, to produce equipment for mobile telecom networks, in particular 5G.\nHuawei has around 20 per cent of France’s telecommunications market.\nFounded in 1987, Huawei is the world’s leading equipment manufacturer for 5G, the fifth generation of mobile Internet.\nThe Shenzhen-based giant has been at the centre of an intense standoff between China and the United States, with Washington warning its equipment could be used for state espionage, an allegation the company denies.\nIn June 2023, the European Commission warned that Huawei and another Chinese telecoms giant, ZTE, pose a risk to the EU’s security.\nThe EU’s internal market commissioner, Thierry Breton, has called on the bloc’s 27 member states and its telecoms operators to exclude Huawei and ZTE equipment from their mobile networks. AFP", "url": "https://www.straitstimes.com/world/europe/huawei-raided-in-france-on-suspicion-of-improper-conduct-says-judicial-source"}