{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:53:32", "date_modify": "2024-10-12 13:53:32", "date_publish": "2024-08-07 13:30:00", "description": "The June 15 incident was recounted by a passenger in a TikTok video which has gone viral with over 1.2 million views. Read more at straitstimes.com.", "filename": "world_united-states_american-airlines-flight-makes-emergency-landing-after-claims-of-lice-from-traveller-s-hair_1728741212.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/07/2024-08-05T221849Z1560924099RC2W99A7Y3DHRTRMADP3USA-AVIATION-AIRLINES.JPG?VersionId=WiaF3Ez1pQ7OPLsp1m15HFxCY_0MLt70", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_american-airlines-flight-makes-emergency-landing-after-claims-of-lice-from-traveller-s-hair_1728741212.html", "title": "American Airlines flight makes emergency landing after claims of lice from traveller’s hair", "title_page": "American Airlines flight makes emergency landing after claims of lice from traveller’s hair | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "An American Airlines flight from Los Angeles to New York had to make an emergency landing in Phoenix, Arizona, after some passengers reported seeing head lice on a traveller’s hair.\nThe June 15 incident was recounted by a passenger, Mr Ethan Judelson, in a TikTok video which has gone viral with over 1.2 million views.\n“Unfortunately this is real, there was a woman with such bad lice we had to do an emergency landing,” he said.\nThe plane landed about an hour into the flight, but Mr Judelson, 28, said no one was “freaking out”.\n“As soon as we land, this woman across the aisle from me rushes to the front of the plane.\n“So the girl next to me... we were both like, ‘Where she thinks she’s going? But she gets off and vanishes before anyone else even stood up,” he said in the video.\nHe said the crew told the passengers they will get more information once they deplane, but the only thing they learnt was that the next flight to New York will be 12 hours later.\nPassengers were also given hotel vouchers and US$12 (S$16).\nHowever, Mr Judelson, 28, noticed two girls who seemed to know more, so he approached them and was told cryptically: ‘“let’s just say it was in the best interest of everyone here that they did this. It’s for the safety of the plane’”.\nMr Judelson, who works as an executive assistant on a TV show, came to know of the real reason why the plane made an emergency landing only the next day when he went to Phoenix airport to buy snacks.\n“Apparently, the two girls saw lice crawling out of the woman’s hair... and alerted the flight attendant and they had to ground the plane,” he said in the video, referring to the woman who had rushed off the plane earlier.", "url": "https://www.straitstimes.com/world/united-states/american-airlines-flight-makes-emergency-landing-after-claims-of-lice-from-traveller-s-hair"}