{"authors": [], "date_download": "2024-10-12 14:06:28", "date_modify": "2024-10-12 14:06:28", "date_publish": "2022-04-14 16:53:50", "description": "Russia would have to strengthen its land, naval, air forces in Baltic Sea to restore military balance, top Moscow official said.  Read more at straitstimes.com.", "filename": "world_russia-warns-of-baltic-nuclear-deployment-if-nato-admits-sweden-and-finland_1728741988.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/14/ads-nato-14042022.jpg?VersionId=921yYO1FpnEtLbmmB2nFGN3YoO9OActo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_russia-warns-of-baltic-nuclear-deployment-if-nato-admits-sweden-and-finland_1728741988.html", "title": "Russia warns of Baltic nuclear deployment if Nato admits Sweden and Finland", "title_page": "Russia warns of Baltic nuclear deployment if Nato admits Sweden and Finland | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON (REUTERS) - One of Russian President Vladimir Putin's closest allies warned Nato on Thursday (April 14) that if Sweden and Finland joined the United States-led military alliance then Russia would have to bolster its defences in the region, including by deploying nuclear weapons.\nFinland, which shares a 1,300km border with Russia, and Sweden are mulling over whether or not to join the Nato alliance. Finland will make a decision in the next few weeks, Prime Minister Sanna Marin said on Wednesday.\nMr Dmitry Medvedev, deputy chairman of Russia's Security Council, said that should Sweden and Finland join Nato then Russia would have to strengthen its land, naval and air forces in the Baltic Sea to restore military balance.\nMr Medvedev also explicitly raised the nuclear threat by saying that there could be no more talk of a \"nuclear free\" Baltic - where Russia has its Kaliningrad exclave sandwiched between Poland and Lithuania.\n\"There can be no more talk of any nuclear-free status for the Baltic, the balance must be restored,\" said Mr Medvedev, who was president from 2008-2012.\n\"Until today, Russia has not taken such measures and was not going to,\" he said.\n\"If our hand is forced well... take note, it wasn't us who proposed this.\"\nRussia's Feb 24 invasion of Ukraine has killed thousands of people, displaced millions and raised fears of a wider confrontation between Russia and the United States.\nMr Putin says the \"special military operation\" in Ukraine is necessary because the US was using Ukraine to threaten Russia and Moscow had to defend against the persecution of Russian-speaking people by Ukraine.\nUkraine says it is fighting against an imperial-style land grab and that Mr Putin's claims of genocide are nonsense.", "url": "https://www.straitstimes.com/world/russia-warns-of-baltic-nuclear-deployment-if-nato-admits-sweden-and-finland"}