{"authors": [], "date_download": "2024-10-12 14:01:26", "date_modify": "2024-10-12 14:01:26", "date_publish": "2024-04-20 04:29:50", "description": "Strike destroys agricultural goods intended for export to Asia and Africa, say officials. Read more at straitstimes.com.", "filename": "world_europe_russian-missiles-destroy-grain-storage-facilities-in-odesa-region-ukraine-says_1728741686.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/20/imgonline-com-ua-FrameBlurred-fvXMrG5C3OhtsM7A.jpg?VersionId=aUnDYGhZ0sSI9xLDeVU.i6VhmM29Gt.l", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russian-missiles-destroy-grain-storage-facilities-in-odesa-region-ukraine-says_1728741686.html", "title": "Russian missiles destroy grain storage facilities in Odesa region, Ukraine says", "title_page": "Russian missiles destroy grain storage facilities in Odesa region, Ukraine says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Russian missiles hit the port of Pivdennyi in Ukraine’s southern Odesa region on April 19, destroying grain storage facilities and foodstuffs they contained, President Volodymyr Zelensky and other officials said.\n“They hit the sea port Pivdennyi. Several missiles struck port facilities, not only Ukrainian, but Singapore’s as well,” Mr Zelensky said in a virtual address to the Nato-Ukraine Council.\nUkraine’s Ministry for Restoration, in a post on the Telegram messaging app, said the strike “destroyed storage facilities and agricultural goods which had been intended for export to Asia and Africa”.\nThe regional governor said one person was injured in the strike, while Ukraine’s southern military command said the attack had sparked fires.\nLocal Telegram channels shared videos of heavy black smoke rising from what they said was the site of the strike.\nMr Zelensky, in a subsequent post on X, said the attack was “part of a deliberate Russian strategy” to harm Ukraine and countries relying on its food exports.\n“Dear partners in the Global South, this is Russia’s true attitude towards you, your food security, and well-being,” he wrote.\n“Russia is willing to harm people in your countries in order to achieve its insane goal of destroying our country at any cost.”\nUkraine has for months been appealing to countries where Russia has more longstanding contacts – in Africa, Latin America and Asia – for greater support for Kyiv’s position.", "url": "https://www.straitstimes.com/world/europe/russian-missiles-destroy-grain-storage-facilities-in-odesa-region-ukraine-says"}