{"authors": [], "date_download": "2024-10-12 14:05:32", "date_modify": "2024-10-12 14:05:32", "date_publish": "2023-04-21 07:00:15", "description": "Michel was also an agent of China in seeking the extradition of Guo Wengui, says US prosecutor Sean Mulryne. Read more at straitstimes.com.", "filename": "world_united-states_rapper-pras-michel-took-133m-to-do-malaysian-fugitive-jho-low-s-bidding-us-says_1728741932.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/21/2023-04-03T152324Z718411694RC2270AZ7AQTRTRMADP3USA-JUSTICE-DICAPRIO_4.JPG?VersionId=bwTaTJDCnAkDxl09QENqj4jTxmfkwlk.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_rapper-pras-michel-took-133m-to-do-malaysian-fugitive-jho-low-s-bidding-us-says_1728741932.html", "title": "Rapper Pras Michel took $133m to do Malaysian fugitive Jho Low’s bidding, US says", "title_page": "Rapper Pras Michel took $133m to do Malaysian fugitive Jho Low’s bidding, US says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Pras Michel was paid US$100 million (S$133 million) to try to end US government probes of Malaysian tycoon Jho Low and to aid the Chinese government in seeking the US extradition of a billionaire dissident, a prosecutor told jurors.\nMichel, a Grammy-winning rapper who reinvented himself as a political influencer, was central to a plot to convince former president Donald Trump’s administration to end a probe of Low’s alleged embezzlement of billions of dollars from the Malaysian development fund 1MDB, prosecutor Sean Mulryne argued on Thursday.\nAt the same time, Michel was an agent of China in seeking the extradition of Chinese billionaire Guo Wengui, Mr Mulryne said.\n“This case is about foreign influence, it’s about foreign money, it’s about greed,” Mr Mulryne said in closing arguments that followed four weeks of testimony at Michel’s illegal lobbying trial in Washington’s federal court.\nThe 50-year-old Michel, a member of hip-hop group Fugees, is accused of failing to notify the United States government about his back-channel lobbying for Low.\nOf the US$100 million Low paid for that lobbying, Michel kept more than US$70 million, prosecutors say.\nProsecutors also charged Michel with funnelling US$2 million of Low’s money into the 2012 campaign of former president Barack Obama through straw donors the rapper refunded, and of tampering with witnesses. For those efforts, Michel pocketed at least US$18 million, prosecutors said.\nEntertainment projects\nMichel testified in his own defence this week, telling jurors he never acted on China’s behalf, and that he did not know he had to notify the US government under the Foreign Agents Registration Act (FARA).\nHe said the US$100 million he received came indirectly from Low, as prosecutors say, but was an investment for entertainment projects.\nMichel conceded that he paid friends to donate to Mr Obama’s campaign, but said he did so with his own money, not Low’s.\nHe also said Low gave him US$20 million to get a photograph with Mr Obama, which came at a holiday party. Low insisted that the money for the donations was now Michel’s own, not Low’s.\nDefence lawyer David Kenner, in his summation on Thursday, said Michel did not attempt to influence the US government.\n“In 2012, Jho Low wanted a photograph,” Mr Kenner said. “That’s what this entire case is about.”\nThe trial featured testimony from Hollywood actor Leonardo DiCaprio, who had partied with Low.\nMr DiCaprio said Low told him he wanted to give US$20 million to US$30 million to the Democratic Party in 2012. Low put US$100 million into the film The Wolf Of Wall Street, which starred Mr DiCaprio.\nAccording to Mr Kenner, Mr DiCaprio’s testimony showed that the actor had socialised for years with Low and never did anything to vet his background or citizenship.\nSimilarly, the defence lawyer said, Michel was not obligated to vet Low.\n“Is that a burden an American citizen has to take on their shoulders before they begin to hang out with somebody?” Mr Kenner said.\nMr Mulryne said Michel worked with other conspirators in 2017 to try to squelch a US civil forfeiture lawsuit against Low and encourage Mr Guo’s removal from the US.\nThe plotters included former Trump fund-raiser Elliott Broidy; former Justice Department attorney George Higginbotham, who worked on the side as Michel’s lawyer; and Hawaiian businesswoman Nickie Mali Lum Davis.\nAll three pleaded guilty, but Trump pardoned Broidy. Higginbotham and Broidy testified as government witnesses.\nMr Kenner told jurors that neither Broidy nor Higginbotham testified that they had told Michel he had an obligation to register as a foreign agent.\n“Mr Michel had no knowledge of a requirement for him to register under FARA,” Mr Kenner said. “Nobody told him, and he didn’t know it himself.”\nTravelled to Asia\nMr Mulryne recounted that Michel travelled to Asia several times to discuss China’s goal and met a top Chinese security official at the Four Seasons Hotel in midtown Manhattan.\nHe also had Higginbotham deliver a message to the Chinese Embassy in Washington, the prosecutor said.\n“Mr Michel told you that he was just a messenger, trying to trivialise or minimise his role,” Mr Mulryne said.\nIn that world, “being a messenger is not a minor role, it’s the lead role”, he added.\nThe prosecutor also argued that Michel lied to banks about the source and purpose of tens of millions of dollars he received from Low.\nHe said a Morgan Stanley banker testified that Michel told him his millions came from a wealthy investor on a boat in Asia. The banker had concerns that the money may be laundered, and closed the account.\nMichel was indicted with Low, who is considered a fugitive and believed to be in China.\nAside from the FARA and Chinese agent charges, Michel is charged with witness tampering. He is also charged with conspiring to serve as an unregistered foreign agent and to launder money.\nProsecutors claimed Michel used a “burner phone” in 2019 to send intimidating text messages to witnesses.\nMr Kenner said in his summation the government offered no evidence that Michel had purchased the phone.\nThe prosecutor’s summation was interrupted when a juror said he felt ill and requested a break.\nWhen the entire jury left the courtroom, the ailing juror briefly passed out, US District Judge Colleen Kollar-Kotelly said.\nShe dismissed the juror, who went to a hospital for evaluation, and replaced him with an alternate juror.\nThe judge said the jury will begin deliberations on Monday. BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/rapper-pras-michel-took-133m-to-do-malaysian-fugitive-jho-low-s-bidding-us-says"}