{"authors": [], "date_download": "2024-10-12 14:07:20", "date_modify": "2024-10-12 14:07:20", "date_publish": "2022-08-26 03:51:09", "description": "Europe's largest nuclear power plant has lost three out of four lines and is said to be \"hanging on by a thread\". Read more at straitstimes.com.", "filename": "world_europe_zaporizhzhias-power-lines-ramparts-against-nuclear-meltdown-in-ukraine_1728742040.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/26/UKRAINE-RUSSIA-CONFLICT-WAR-NUCLEAR-HISTORY-122657%20%281%29.jpg?VersionId=Hv59oNx_u9_4JeopSHtns23gTDmW8pYY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_zaporizhzhias-power-lines-ramparts-against-nuclear-meltdown-in-ukraine_1728742040.html", "title": "Zaporizhzhia's power lines: Ramparts against nuclear meltdown in Ukraine", "title_page": "Zaporizhzhia's power lines: Ramparts against nuclear meltdown in Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VIENNA (REUTERS) - The last of four regular power lines supplying the Russian-held nuclear power plant at Zaporizhzhia in Ukraine was briefly cut on Thursday (Aug 25), meaning the plant had to resort to backup power for the first time, thinning its defences against a meltdown.\nIn all nuclear power plants, fission of nuclear fuel gives off heat to then produce steam that turns turbines to generate electricity. That process must be controlled to prevent a runaway chain reaction that would overheat and in the worst case cause a meltdown like those at Chernobyl or Fukushima.\nZaporizhzhia, in Russian-occupied southern Ukraine near front lines along the major Dnipro River, is Europe's biggest nuclear power station and its area has been repeatedly hit by shelling in the past few weeks.\nReactors like the six at Zaporizhzhia, two of which are in operation, have a primary cooling circuit in which electrical pumps push water through the reactor core.\nMaintaining power supply is crucial to that working.\n\"If the cooling is interrupted, the fuel can heat up within a matter of hours to a temperature at which it can become damaged and begin to release highly radioactive fission products,\" Edwin Lyman, director of nuclear power safety at the US-based Union of Concerned Scientists, said in a blog post.\n\"If adequate cooling is not ultimately restored, the fuel can melt through the steel reactor vessel and - in the most severe situation - the containment structure can leak or rupture, releasing fission products to the environment.\"\nIf the reactor has shut down, the fuel must still be cooled, as must spent fuel, but it can go without cooling for longer.\n\"They have to have power to the plant. They have to keep the nuclear fuel cool in the reactor,\" said Mark Hibbs, senior fellow at the Nuclear Policy Program at the Carnegie Endowment for International Peace.\nThree out of four lines 'lost'\nGiven the importance of power supply, backups are built in.\nThere are four regular, 750-kilovolt (kV) power lines designed to supply Zaporizhzhia but three of them \"were lost earlier during the conflict\", the International Atomic Energy Agency said in a statement on Ukraine on Thursday.\nUkraine informed the agency that the fourth line was cut at least twice on Thursday but was later restored.\nIt was the first time all four regular lines had been down, Ukraine said.\nThe cause was not immediately clear, the IAEA said.", "url": "https://www.straitstimes.com/world/europe/zaporizhzhias-power-lines-ramparts-against-nuclear-meltdown-in-ukraine"}