{"authors": [], "date_download": "2024-10-12 14:07:40", "date_modify": "2024-10-12 14:07:40", "date_publish": "2022-05-15 12:25:34", "description": "The country \"must apply for Nato membership without delay\", said Mr Niinisto. Read more at straitstimes.com.", "filename": "world_europe_finland-to-officially-announce-nato-decision-as-sweden-holds-key-meet_1728742060.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/15/ads-niinisto-15052022.jpg?VersionId=kl_wFNe.ENPALSkaRNXTooB67R3NdXqr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_finland-to-officially-announce-nato-decision-as-sweden-holds-key-meet_1728742060.html", "title": "Finland to apply for Nato membership: President Niinisto", "title_page": "Finland to apply for Nato membership: President Niinisto | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HELSINKI (AFP) - Finland's President Sauli Niinisto said on Sunday (May 15) Helsinki will apply for Nato membership, as Sweden's ruling party holds a decisive meeting that could pave the way for a joint application.\nThe president and Finnish Prime Minister Sanna Marin are expected to submit a membership proposal to Parliament on Monday.\nLess than three months after Russia's Feb 24 invasion of Ukraine, the two Nordic neighbours look poised to reverse policies on military non-alignment dating back more than 75 years in Finland and over two centuries in Sweden.\n\"Hopefully we can send our applications next week together with Sweden,\" Finland's Marin said on Saturday.\nThe countries broke their strict neutralities after the end of the Cold War by joining the European Union and becoming partners to North Atlantic Treaty Organisation in the 1990s, solidifying their affiliation with the West.\nBut the concept of full Nato membership was a non-starter in the countries until the war in Ukraine saw public and political support for joining the military alliance soar in both countries.\nFinland has been leading the charge, while Sweden appears anxious at being the only non-Nato country around the Baltic Sea.\nMany Swedish politicians have even said their support is conditional on Finland joining.\nOn Thursday, Niinisto and Marin publicly said their country \"must apply for Nato membership without delay\".\nOn Saturday, the Finnish head of state phoned his Russian counterpart President Vladimir Putin to inform him of his country's desire to join Nato, in a conversation described as \"direct and straightforward\".\n\"Avoiding tensions was considered important,\" President Niinisto was quoted as saying in a statement by his office.\nBut Mr Putin responded by warning that joining Nato \"would be a mistake since there is no threat to Finland's security\", according to a Kremlin statement.\nNo other choice\nAccording to recent polls, the number of Finns who want to join the alliance has risen to over three-quarters, triple the level seen before the war in Ukraine.\nIn Sweden, support has also risen dramatically, to around 50 per cent - with about 20 per cent against.\nThe senior leadership of Sweden's Social Democrats, led by Prime Minister Magdalena Andersson, is due to meet on Sunday afternoon to decide whether the party should abandon its historic stance against joining, last reaffirmed at the party's annual congress in November.\nA green light from the ruling Social Democrats would secure a firm majority in Sweden's parliament in favour of joining.\nWhile the party's leading politicians have seemed ready to reverse the decision, critical voices within have denounced the change in policy as rushed.\nBut analysts say it is unlikely that the party will oppose the move.\n\"There will perhaps not be the same sense of urgency\", as in Finland, defence researcher Robert Dalsjo, an analyst at the Swedish Defence Research Institute, told AFP.\n\"But the leaders in Sweden have realised that they really don't have another choice, once Finland has,\" he added.\nNato membership needs to be approved and ratified by all 30 members of the alliance.\nWhile Finland and Sweden claim to have had favourable signals from Ankara, Turkish President Recep Tayyip Erdogan has expressed his opposition.\nTurkey's objections, directed in particular at Stockholm, focus on what it considers to be the countries' leniency towards the Kurdistan Workers' Party, which is on the EU's list of terrorist organisations.\nHowever, Turkish Foreign Minister Mevlut Cavusoglu said he was ready to discuss the matter with both countries, as well as with other Nato nations.\nFinnish Foreign Minister Pekka Haavisto said he was \"confident\" of reaching an agreement with Turkey.", "url": "https://www.straitstimes.com/world/europe/finland-to-officially-announce-nato-decision-as-sweden-holds-key-meet"}