{"authors": [], "date_download": "2024-10-12 14:02:27", "date_modify": "2024-10-12 14:02:27", "date_publish": "2022-05-14 13:40:12", "description": "Finland and Sweden would reduce the vulnerability of Nato's north-eastern flank next to Russia. Read more at straitstimes.com.", "filename": "world_europe_nato-expansion-could-finally-shore-up-alliances-weakest-flank_1728741747.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/14/afnato140522.jpg?VersionId=do7p1FncBtmhHrci_HckNgAT_i35n5RD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_nato-expansion-could-finally-shore-up-alliances-weakest-flank_1728741747.html", "title": "Nato expansion could finally shore up alliance's weakest flank", "title_page": "Nato expansion could finally shore up alliance's weakest flank | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS (BLOOMBERG) - Nato has long faced a complex military problem: how to best defend the Baltic states that border Russia and Belarus if ever Moscow chose to attack. President Vladimir Putin may have inadvertently forced a solution.\nWhile much of the focus of deteriorating east-west relations has been on Germany's new military plans, the expected accession of Finland and Sweden to the 30-member transatlantic alliance is part of the biggest shift in European foreign policy to emerge since Russia's invasion of Ukraine.\nAfter waging war in part to stop Nato's expansion, Putin is now confronted with the opposite. Membership for Finland would draw a line under an era that saw its giant Russian neighbour exert so much influence over the country's relationship with the rest of Europe. For Sweden, it marks a final end to the neutrality that had defined the nation for two centuries.\nFor the North Atlantic Treaty Organisation, the Nordic countries will not only bring timely extra military capabilities. Geographically, they will reduce the vulnerability of its northeastern flank by adding 1,343km of additional land frontier with Russia and effectively isolating its enclave of Kaliningrad sandwiched between Poland and Lithuania on the Baltic Sea.\n\"In case of a conflict, there's an opportunity to close the Gulf of Finland,\" Lithuanian Defence Minister Arvydas Anusauskas told reporters. \"That's new opportunities, something we didn't even contemplate before.\"\nNato foreign ministers will gather in Berlin this weekend, where they'll be joined by their Swedish and Finnish counterparts. There's momentum behind the two Nordic countries applying for membership imminently, though it's not a done deal.\nOn Friday (May 13), Turkish President Recep Tayyip Erdogan voiced concerns over what he called \"terrorists\" in Sweden and Finland and he wants them to take a clear stance against supporters of separatist Kurdish militants.\nShould Turkey be mollified, the presence of the nations in the alliance could thwart any future Russian plans to target what has often been seen as Nato's Achilles' Heel on the Baltic. Estonia, Latvia and Lithuania, which used to be part of the Soviet Union and joined Nato in 2004, would be able to rely on more immediate help and new routes for supplies via Finland and Sweden.\nThe three nations aren't likely to see an immediate military threat from Russia, particularly as Putin's army gets bogged down in its war in Ukraine. But they have for years faced various forms of intimidation.\nLate last year, Putin demanded Nato withdraw forces from the countries and other eastern states and refrain from enlarging further, particularly given Ukraine's aspirations to join. Nato rejected the idea. The change in the geopolitical calculus would mean a dramatic increase in the cost of any offensive by Russia in the area and, as a result, should ultimately lower tensions between Nato allies and Moscow, according to William Alberque, director of strategy, technology and arms control at the London-based International Institute for Strategic Studies.\n\"Russia's all about hitting you where you're weak, not where you're really, really strong,\" Alberque said. \"When it's actually stable with a credible deterrence force, Russia will say it's not worth it. This is going to reduce tensions.\"\nThat may take time. Russian officials have warned of severe consequences for regional security should Finland and Sweden join Nato, including vague threats about positioning nuclear arms in the Baltics. It's unclear to what extent such weapons are already stationed there, though. Russia's Baltic Fleet practised delivering mock strikes by its nuclear-capable Iskander missiles in Kaliningrad, the Defence Ministry said on May 5.\nAfter Finnish President Sauli Niinisto and Prime Minister Sanna Marin declared on Thursday the country must join Nato \"without delay\", Kremlin spokesman Dmitry Peskov said the move would \"definitely\" be a threat to Russia.\nHe didn't elaborate on what Russia might do if Finland does join the alliance, though Russia's ambassador to the European Union, Vladimir Chizhov, said it would involve \"improving or raising the degree of defence preparations along the Russian-Finnish border\". Joining Nato \"has never made any country more secure\", he said in an interview with the UK's Sky News.\nIndeed, Finland's move to join the military bloc is particularly painful for Russia, said Igor Korotchenko, head of the Moscow-based Centre for Analysis of World Arms Trade. The country has been seen as a close neighbour by the Kremlin after decades of Soviet-era influence over it, giving rise to the term \"Finlandisation\" where a larger state effectively controls the foreign policy of a smaller nation while allowing it to remain independent.\nWhile Finland and Sweden's membership would bring benefits to the Baltics, it shouldn't dramatically change Russia's perspective, according to Kimberly Marten, a professor of political science at Barnard College of Columbia University. The two countries have already been closely training with Nato for years, so officially joining the alliance would in some ways only be a formality.\n\"There's always a risk that something will be the straw that breaks the camel's back,\" Marten said in reference to Putin's possible reaction to further Nato enlargement. \"But you have to weigh the risks versus the benefits and I think it's clear in this case the benefits outweigh the risks.\"\nTogether, the Nordic countries would both bring strong Nato-standard militaries with increasing defence budgets and an already high level of integration into the alliance given frequent joint exercises and intelligence sharing.\nNato diplomats also point to their strong navies as an asset in the Baltic Sea as well as Finland's large pool of trained reserve soldiers. The two would also add major airpower to the alliance: Sweden boasts Gripen fighter aircraft, while Finland is replacing its F/A-18 Hornets with 64 F-35A multi-role jets.\nWith Nato capabilities on either side of the Gulf of Finland - about 50km at its narrowest point - the allies could block Russia's Baltic Fleet in case of any hostilities. Kaliningrad could be further isolated from the rest of Russia if the EU decided to cut off road and rail transit.", "url": "https://www.straitstimes.com/world/europe/nato-expansion-could-finally-shore-up-alliances-weakest-flank"}