{"authors": [], "date_download": "2024-10-12 13:44:52", "date_modify": "2024-10-12 13:44:52", "date_publish": "2017-06-02 03:52:00", "description": "WASHINGTON (AFP) - President Donald Trump on Thursday (June 1) announced America’s withdrawal from the Paris climate deal, signaling a policy shift with wide-ranging repercussions for the climate and Washington’s ties with the world. Read more at straitstimes.com.", "filename": "world_united-states_donald-trump-pulls-us-out-of-global-climate-change-accord_1728740692.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/brightcove-thumbnails/TCDYY3-ZGDav7gGSmBEstm5KBAO51cfYmaOSViwyvKI.jpg?VersionId=TNWEZryos.fgOeX8jYwQJlGEG2Xh8H16", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_donald-trump-pulls-us-out-of-global-climate-change-accord_1728740692.html", "title": "Donald Trump pulls US out of global climate change accord", "title_page": "Donald Trump pulls US out of global climate change accord | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (AFP) - President Donald Trump on Thursday (June 1) announced America's withdrawal from the Paris climate deal, signaling a policy shift with wide-ranging repercussions for the climate and Washington's ties with the world.\nIn a highly anticipated statement from the White House Rose Garden, Trump said the United States would abandon the current deal - but was open to negotiating a new one.\n\"As of today, the United States will cease all implementation of the non-binding Paris accord and the draconian financial and economic burdens the agreement imposes on our country,\" Trump said.\n\"We're getting out but we'll start to negotiate and we will see if we can make a deal that's fair. And if we can, that's great. And if we can't, that's fine.\"\nAlthough details and the timeframe are still unclear, Trump argued that the agreement was a bad deal for Americans and that he was keeping a campaign promise to put American workers first.\n\"I cannot, in good conscience, support a deal that punishes the United States, which is what it does,\" Trump said.\nThe White House has told allies the 2015 deal was signed by President Barack Obama out of \"desperation.\" Trump faced last-minute pressure from business tycoons, foreign allies and from inside his own White House not to pull out of the 196-party accord.\nEver the showman, the 70-year-old gave his decision a reality-TV-style tease, refusing to indicate his preference either way until his announcement.\nHis decision could seriously hamper efforts to cut emissions and limit global temperature increases. The United States is the world's second largest emitter of greenhouse gases, after China.\nOpponents of withdrawal - said to include Trump's own daughter Ivanka - have warned that America's reputation and its leadership role on the world stage are also at stake, as is the environment.\nNicaragua and Syria are the only countries not party to the Paris accord, the former seeing it as not ambitious enough and the latter being racked by a brutal civil war.\nDIPLOMATIC PRESSURE\nTrump's long wind-up prompted fierce lobbying, with his environmental protection chief Scott Pruitt and chief strategist Steve Bannon urging the President to leave.\nA dozen large companies including oil major BP, agrochemical giant DuPont, Google, Intel and Microsoft, have also urged Trump to remain part of the deal.\nTesla and SpaceX boss Elon Musk said he would have \"no choice\" but to leave White House-backed business councils if Trump pulls out.\nOn the diplomatic front, German Chancellor Angela Merkel led the \"remain\" camp, publicly describing the deal as \"essential,\" and suggesting other countries would press ahead regardless.\nTrump raised alarm bells when he refused to sign up to a pledge on the deal at last week's Group of Seven meeting in Italy.\nMerkel on Saturday labelled the result of the \"six against one\" discussion \"very difficult, not to say very unsatisfactory.\" European Commission President Jean-Claude Juncker was less diplomatic, all but accusing the US president of being ill-informed.\n\"I am a transatlanticist. But if the US president in the next hours and days says that he will get out of the Paris accord, then it's the responsibility of Europe to say: that's not acceptable.\" He noted that it would likely take three or four years to exit from the Paris deal, and revealed that world leaders had sought to explain that to Trump at the G-7 summit.\n\"As it appears, that attempt failed,\" said Juncker.\nCHINA PLEDGE\nHours ahead of Trump's announcement, China's Premier Li Keqiang also pledged to stay the course on implementing the climate accord, and urged other countries to do likewise.\n\"China will continue to implement promises made in the Paris Agreement, to move towards the 2030 goal step by step steadfastly,\" Li said in a Berlin joint press conference with Merkel.\n\"But of course, we also hope to do this in cooperation with others.\" China has been investing billions in clean energy infrastructure, as its leaders battle to clear up the choking pollution enveloping its biggest cities, including Beijing.\nChina and the US are responsible for some 40 per cent of the world's emissions and experts warn is vital for both to remain in the Paris agreement if it is to succeed.\nThe leader of Asia's other behemoth, Indian Prime Minister Narendra Modi, said this week failing to act on climate change would be \"morally criminal\".\nCONTRADICTORY SIGNALS\nTrump's announcement comes less than 18 months after the historic climate pact was adopted in the French capital, the fruit of a hard-fought agreement between Beijing and Washington under Obama's leadership.\nThe Paris Agreement commits signatories to efforts to reduce greenhouse gas emissions that cause global warming, which is blamed for melting ice caps and glaciers, rising sea levels and more violent weather events.\nThey vowed steps to keep the worldwide rise in temperatures \"well below\" two degrees Celsius (3.6 degrees Fahrenheit) from pre-industrial times and to \"pursue efforts\" to hold the increase under 1.5 degrees Celsius.\nSince taking office on January 20, Trump, who has called climate change a \"hoax\", has sent contradictory signals on the Paris deal.\nWhen asked on Tuesday whether Trump believes human activity is contributing to climate change, White House spokesman Sean Spicer told reporters, \"Honestly, I haven't asked him that. I can get back to you.\"", "url": "https://www.straitstimes.com/world/united-states/donald-trump-pulls-us-out-of-global-climate-change-accord"}