{"authors": [], "date_download": "2024-10-12 13:43:51", "date_modify": "2024-10-12 13:43:51", "date_publish": "2024-07-08 12:45:00", "description": "The charge relates to two 737 Max crashes in Indonesia and Ethiopia over a five-month period in 2018 and 2019. Read more at straitstimes.com.", "filename": "world_boeing-to-plead-guilty-in-us-probe-of-fatal-737-max-crashes-says-doj-official_1728740631.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/08/2024-06-12T235301Z1996866304RC2OFV985FA1RTRMADP3BOEING-DOJ.JPG?VersionId=57yTtgK1h4JHOjO0Sjed79IzII_XKjBy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_boeing-to-plead-guilty-in-us-probe-of-fatal-737-max-crashes-says-doj-official_1728740631.html", "title": "Boeing to plead guilty in US probe of fatal 737 Max crashes, says DOJ official", "title_page": "Boeing to plead guilty in US probe of fatal 737 Max crashes, says DOJ official | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK/WASHINGTON – Boeing has agreed to plead guilty to a criminal fraud conspiracy charge to resolve a US Justice Department investigation linked to two 737 Max fatal crashes, a government official said on July 7.\nThe plea, which requires a federal judge’s approval, would brand the planemaker a convicted felon. Boeing will also pay a criminal fine of US$243.6 million (S$328.4 million), a Department of Justice (DOJ) official said.\nThe charge relates to two 737 Max crashes in Indonesia and Ethiopia over a five-month period in 2018 and 2019 that killed 346 people and prompted the families of the victims to demand that Boeing face prosecution.\nA guilty plea potentially threatens the company’s ability to secure lucrative government contracts with the likes of the US Defence Department and Nasa, although it could seek waivers. Boeing became exposed to criminal prosecution after the DOJ in May found that the company violated a 2021 settlement involving the fatal crashes.\nStill, the plea spares Boeing a contentious trial that could have exposed many of the company’s decisions leading up to the fatal Max plane crashes to even greater public scrutiny. It would also make it easier for the company, which will have a new chief executive later in 2024, to try to move forward as it seeks approval for its planned acquisition of Spirit AeroSystems.\nBoeing declined to comment.\nBoeing has also agreed to invest at least US$455 million over the next three years to strengthen its safety and compliance programmes, the official said. The DOJ will appoint a third-party monitor to oversee the firm’s compliance. The monitor will have to publicly file with the court annual reports on the company’s progress.\nThe DOJ on June 30 offered a plea agreement to Boeing and gave the company until the end of the week to take the deal or face a trial on a charge of conspiring to defraud the Federal Aviation Administration (FAA) in connection with a key software feature tied to the fatal crashes.\nAfter being briefed last week on the DOJ’s offer, a lawyer for some of the families criticised it as a “sweetheart deal”. They have vowed to oppose the deal in court.\nThe DOJ’s push to charge Boeing has deepened an ongoing crisis engulfing Boeing since a separate January in-flight blow-out exposed continuing safety and quality issues at the planemaker.\nA panel blew off a new Boeing 737 Max 9 jet during a Jan 5 Alaska Airlines flight, just two days before the 2021 deferred prosecution agreement that had shielded the company from prosecution over the previous fatal crashes expired. The agreement covers only Boeing’s conduct before the fatal crashes and does not shield the planemaker from any other potential investigations or charges related to the January incident or other conduct.\nBoeing is pleading guilty to making knowingly false representations to the FAA about having expanded a key software feature used on the Max to operate at low speeds. The new software saved Boeing money by requiring less intensive training for pilots.\nThe Manoeuvring Characteristics Augmentation System is a software feature designed to automatically push the airplane’s nose down in certain conditions. It was tied to the two crashes that led to the FAA grounding the plane for 20 months, an action that cost Boeing US$20 billion and the government lifted in November 2020.\nAs part of the deal, Boeing’s board of directors will meet with relatives of those killed in the Max crashes, the official said.\nThe agreement does not shield any executives, the DOJ official said, though charges against individuals are seen as unlikely due to the statute of limitations.\nThe agreed penalty will be Boeing’s second fine of US$243.6 million related to the fatal crashes – bringing the full fine to the maximum allowed. The company paid the fine previously as part of 2021‘s US$2.5 billion settlement. The US243.6 million fine represented the amount Boeing saved by not implementing full-flight simulator training.\nFamilies of the victims of those crashes slammed the previous agreement and, earlier in 2024, pressed the DOJ to seek as much as US$25 billion from Boeing.\nThe DOJ has held several meetings in 2024 to hear from the victims’ families as officials investigated Boeing’s breach of the 2021 deal. REUTERS", "url": "https://www.straitstimes.com/world/boeing-to-plead-guilty-in-us-probe-of-fatal-737-max-crashes-says-doj-official"}