{"authors": [], "date_download": "2024-10-12 13:44:55", "date_modify": "2024-10-12 13:44:55", "date_publish": "2023-03-16 07:20:47", "description": "The new suits are more streamlined and flexible, with greater range of motion and variability in size and fit. Read more at straitstimes.com.", "filename": "world_united-states_nasa-unveils-new-spacesuit-specially-tailored-for-lunar-wear_1728740695.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/16/TOPSHOTS-TOPSHOT-US-SPACE-MOON-172158_3.jpg?VersionId=5jW5jZJMMyPM7DjXe3KInU6ySCfZjWRP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_nasa-unveils-new-spacesuit-specially-tailored-for-lunar-wear_1728740695.html", "title": "Nasa unveils new spacesuit for Moon landing", "title_page": "Nasa unveils new spacesuit for Moon landing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HOUSTON – The big, puffy white moon suits worn by Neil Armstrong and his fellow Apollo astronauts a half-century ago are out of fashion. Lunar haute couture now calls for something more form-fitting and appropriate for men and women alike.\nThe National Aeronautics and Space Administration on Wednesday unveiled the first prototype for a newly designed next-generation spacesuit specially tailored and accessorised for the first astronauts expected to venture back to the moon’s surface in the next few years.\nThe latest in moon-wear was displayed at the Johnson Space Centre in Houston during an event hosted for the media and students by Axiom Space, the Texas-based company contracted by Nasa to build suits for Artemis, successor to the Apollo moon programme.\nThe Artemis I mission, the inaugural launch of Nasa’s powerful next-generation rocket and its newly built Orion spacecraft on an uncrewed test flight around the moon and back, was successfully completed in December.\nNasa and the Canadian Space Agency plan to announce on April 3 the four astronauts chosen to fly as early as next year on Artemis II, another out-and-back mission.\nThat flight, if successful, will pave the way for a planned Artemis III astronaut expedition to the lunar surface – the first ever to the moon’s South Pole – later in the decade. It will be the first ever to send a woman to walk on the moon.\nNasa promises that subsequent Artemis missions will include the first person of colour on the moon.\nThe programme, named for Apollo’s twin sister from Greek mythology, is aimed ultimately at establishing a sustainable lunar base as a stepping stone to future human exploration of Mars.\nNasa chief Bill Nelson said the new spacesuits “will open opportunities for more people to explore and conduct science on the moon then ever before.”\nAll 12 Nasa astronauts who landed on the moon during a total of six Apollo missions from 1969 to 1972 were white men.\nThe outfits worn to the moon by Artemis astronauts will look very different from the bulky spacesuits of yore.\nBranded by Axiom as the “Axiom Extravehicular Mobility Unit”, or AxEMU for short, the new suits are more streamlined and flexible than the old Apollo get-ups, with greater range of motion and variability in size and fit.\nThey are designed to fit a broad range of potential wearers, accommodating at least 90 per cent of the United States’s male and female population, Nasa said.\nThe suits also will incorporate advances in life-support systems, pressure garments and avionics.", "url": "https://www.straitstimes.com/world/united-states/nasa-unveils-new-spacesuit-specially-tailored-for-lunar-wear"}