{"authors": [], "date_download": "2024-10-12 13:41:01", "date_modify": "2024-10-12 13:41:01", "date_publish": "2024-08-04 15:40:00", "description": "According to Turkish media, 50 million of the country’s 85 million people have an Instagram account. Read more at straitstimes.com.", "filename": "world_instagram-blocked-in-turkey-for-third-day_1728740461.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/04/FILES-US-INTERNET-FACEBOOK-202909.jpg?VersionId=g2aIBz8GG5YIXZSmPyoJmJ57998KXXET", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_instagram-blocked-in-turkey-for-third-day_1728740461.html", "title": "Instagram blocked in Turkey for third day", "title_page": "Instagram blocked in Turkey for third day | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ANKARA - Instagram users in Turkey woke up on Aug 4 to find the social media network blocked for the third consecutive day, following censorship accusations against the US company from a high-ranking Turkish official.\nThe BTK communications authority announced on its website on Aug 2 that the Meta-owned platform had been frozen, without giving any reason.\nAn official then referred to a regulation that allows “criminal content” to be blocked.\n“Our country has values and sensitivities. Despite our warnings, they did not take care of criminal content,” Transport and Infrastructure Minister Abdulkadir Uraloglu said on Aug 2.\n“We blocked access. When they abide by our laws, we’ll lift the ban.”\nThe President’s communications director Fahrettin Altun, accused Instagram on July 31 of “preventing people from publishing messages of condolence for the martyr (Hamas leader Ismail) Haniyeh”.\n“This is a very clear and obvious attempt at censure,” Mr Altun said on social media platform X.\nThe social-democrat and nationalist opposition parties and the Ankara legal profession petitioned the courts on Aug 2 for the freeze to be lifted.\nAccording to Turkish media, 50 million of the country’s 85 million people have an Instagram account. AFP", "url": "https://www.straitstimes.com/world/instagram-blocked-in-turkey-for-third-day"}