{"authors": [], "date_download": "2024-10-12 14:10:46", "date_modify": "2024-10-12 14:10:46", "date_publish": "2024-09-13 18:25:31", "description": "Mr Hui Ka Yan, who was once China’s richest man, is not known to have been formally charged with any crimes. Read more at straitstimes.com.", "filename": "world_evergrande-chairman-hui-kept-in-special-detention-center-in-shenzhen-sources-say_1728742246.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/13/LYNXMPEK8B0E0-1.jpg?VersionId=RWpJs3UFNt318HnE7vp5XbP7mbqcLVCw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_evergrande-chairman-hui-kept-in-special-detention-center-in-shenzhen-sources-say_1728742246.html", "title": "Evergrande chairman kept in special detention centre in Shenzhen, sources say", "title_page": "Evergrande chairman kept in special detention centre in Shenzhen, sources say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG – Mr Hui Ka Yan, the chairman of China Evergrande Group – the company at the centre of the country’s property sector crisis – has been moved to a special detention centre in Shenzhen, two sources with knowledge of the matter said.\nMr Hui, 65, has not been seen in public since he was taken away by the Chinese authorities a year ago and his current whereabouts have not been previously reported.\nAfter China’s securities regulator found Evergrande’s flagship unit had inflated earnings and committed securities fraud, Mr Hui was fined US$6.6 million (S$8.6 million) in March and barred from the securities market for life. Evergrande was ordered into liquidation in January.\nMr Hui, who was once China’s richest man, is not known to have been formally charged with any crimes, and it is unclear how long he will remain in detention or whether he will be tried or set free.\nThe Chinese authorities have detained many former high-flying business executives, and some have remained in detention for years with little or no information about their fate.\nThe property tycoon was initially under house surveillance in Beijing after his arrest, according to one of the sources.\nHe was transferred to Shenzhen a few months ago to allow him to more easily communicate with top Evergrande executives, said the second source. Evergrande is headquartered in the neighbouring southern city of Guangzhou, and its wealth management unit is based in Shenzhen.\nChina’s Ministry of Public Security and the Shenzhen municipal government did not respond to Reuters requests for comment, nor did Hengda Real Estate, Evergrande’s main unit.\nMr Hui founded Evergrande in 1996, transforming it into China’s biggest property developer in terms of contracted sales, aggressively taking on debt.\nSince 2021, the company has defaulted on most of its US$300 billion liabilities, as well as billions of dollars of wealth management product payments, and its troubles have been emblematic of China’s property sector woes that have long dragged on economic growth.\nIn March, a regulatory probe found an Evergrande unit inflated revenue by 564 billion yuan (S$103 billion) during 2019-2020 and issued bonds based on falsified statements.\nWealth management payments\nAccording to the second source, Mr Hui is in “good shape” and has access to medical care and good food at the special detention centre. Detainees at special detention centres typically receive better treatment than at ordinary detention centres.\nMr Hui wrote a letter to senior Evergrande executives after being sent to the centre, urging them to resolve the non-payment of returns to investors in its wealth management products as soon as possible, the source added.\nEvergrande’s wealth management unit announced plans in late 2021 to repay investors in its wealth management products.\nBut in August 2023, it said it was no longer able to make the monthly instalments. Some of the unit’s staff were detained by the Shenzhen police a couple of weeks later.\nThe two sources also said Evergrande is close to handing over most homes that have been promised to buyers, adding that more than 70 per cent of the construction is completed for those apartments.\nThey did not provide details on how many apartments that might mean. Evergrande had nearly 800 projects across the country as of 2022. REUTERS", "url": "https://www.straitstimes.com/world/evergrande-chairman-hui-kept-in-special-detention-center-in-shenzhen-sources-say"}