{"authors": [], "date_download": "2024-10-12 13:49:15", "date_modify": "2024-10-12 13:49:15", "date_publish": "2023-01-26 07:39:45", "description": "Ji Chaoqun was accused of identifying US scientists and engineers who could be recruited by the Jiangsu Province Ministry of State Security. Read more at straitstimes.com.", "filename": "world_united-states_chinese-engineer-gets-eight-year-sentence-in-us-for-spying_1728740955.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/26/2021-11-16T020517Z1296322838RC2DVQ90RYWCRTRMADP3USA-CHINA-BIDEN-XI_1.JPG?VersionId=4bsKGCtoxWStlkN2JleeNXJ6fTPMqQBI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_chinese-engineer-gets-eight-year-sentence-in-us-for-spying_1728740955.html", "title": "Chinese engineer gets eight-year sentence in US for spying", "title_page": "Chinese engineer gets eight-year sentence in US for spying | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – A Chinese engineer was sentenced to eight years in a US prison on Wednesday for providing Beijing with information on possible recruitment targets.\nJi Chaoqun, who came to the United States on a student visa in 2013 and later enlisted in the army reserves, was accused of identifying American scientists and engineers who could be recruited by the Jiangsu Province Ministry of State Security.\nThe body is a key Chinese intelligence unit involved in numerous schemes to illegally obtain US industrial and trade secrets.\nJi was arrested in September 2018 on charges that he had supplied Chinese intelligence with biographical information about eight people, all naturalised American citizens originally from China or Taiwan, and some of whom were US defence contractors.\nJi, 31, was convicted in September of illegally acting as an agent of a foreign government and of making false statements after a two-week trial in Chicago.\nThe charge is often used by US prosecutors in espionage-related cases where the accused is not clearly a foreign intelligence agent.\nAccording to the Justice Department, Ji acted at the direction of Xu Yanjun, a deputy division director in the Jiangsu unit.\nJi’s case was apparently linked to Chinese efforts over several years to steal trade secrets from Ohio-based GE Aviation – one of the world’s leading aircraft engine manufacturers – and other aviation companies, including US military suppliers.\nXu was a key figure in that effort. Arrested in Belgium in 2018, he was extradited to the US to stand trial.\nHe was convicted in November 2021 of economic espionage and attempted theft of trade secrets.\nIn November 2022, Xu was sentenced to 20 years in prison. AFP", "url": "https://www.straitstimes.com/world/united-states/chinese-engineer-gets-eight-year-sentence-in-us-for-spying"}