{"authors": [], "date_download": "2024-10-12 14:01:50", "date_modify": "2024-10-12 14:01:50", "date_publish": "2023-05-04 03:28:01", "description": "Intelligence chief warns of a significant risk that Moscow could target infrastructure in Europe and North America. Read more at straitstimes.com.", "filename": "world_europe_nato-warns-that-russia-is-mapping-eu-us-critical-assets_1728741710.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/04/2023-02-22T131816Z1863410373RC2AGZ9KVX25RTRMADP3SAFRICA-SECURITY-RUSSIA-CHINA_0.JPG?VersionId=bcmsihNsK2cWvHGitUMU_83G44mklnDv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_nato-warns-that-russia-is-mapping-eu-us-critical-assets_1728741710.html", "title": "Nato warns that Russia is mapping EU, US critical assets", "title_page": "Nato warns that Russia is mapping EU, US critical assets | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS - Nato’s intelligence chief said that Russia is mapping critical undersea systems and warned of a significant risk that Moscow could target infrastructure in Europe and North America.\n“There are heightened concerns that Russia may target undersea cables and other critical infrastructure in an effort to disrupt western life and gain leverage against those nations that are providing support to Ukraine,” Mr David Cattler, the military alliance’s assistant secretary-general for intelligence and security, told reporters.\nMembers of the North Atlantic Treaty Organisation have been racing to better safeguard undersea critical infrastructure after Nord Stream pipelines blasts last autumn highlighted the difficulty of monitoring facilities and identifying attackers.\nAt issue is protecting systems like undersea cables, which account for 95 per cent of Internet communications and together carry an estimated US$10 trillion (S$13 trillion) worth of financial transactions every day, according to Nato.\n“Russia is actively mapping allied critical infrastructure both on land and on the seabed, this effort is supported by Russia’s military and civilian intelligence services,” Mr Cattler said.\nHe warned of “a persistent and significant risk” that Russia could attack allied systems.\nRussia has blamed “Anglo-Saxon” allies for blowing up the Nord Stream gas pipelines, denying western accusations that it targeted its own links. But further incidents in recent months of what appear to be Russian spy ships operating near allied systems have heightened concern.\nAdmiral Henrique Gouveia e Melo, the head of the Portuguese Navy, told state-owned broadcaster RTP in March that a Russian vessel near the Portuguese island region of Madeira was a spy ship that was following and measuring submarine cables.\nRussian patrols\nA joint investigation published in April by Danish, Finnish, Swedish and Norwegian public broadcasters said that Russian military and civilian ships were mapping seabed infrastructure in the Baltic and North seas.\nRussia’s “patrols into the Atlantic and throughout the Atlantic are at a high level, most of the time at a higher level than what we’ve seen in recent years”, Mr Cattler said.\nHe added that Russia appears to be targeting undersea infrastructure in the broad Atlantic, the Baltic Sea and the North Sea.\nMr Cattler pointed to Russia’s military strategy – which calls for rapid destruction of critical infrastructure in the early stages of a conflict, a tactic seen in Ukraine – as one reason for the heightened concern.\nReconnaissance programme\nMoscow’s efforts are led in part by an underwater reconnaissance programme in the Ministry of Defence and are supported by military and civilian intelligence services, with considerable resources at their disposal across the digital, space, air, land and maritime domains, he said.\nWhile China is also active in the domain, Mr Cattler said, it is more interested in buying infrastructure than testing the vulnerabilities of others. He added that threats also exist from terrorists and other groups, particularly where the cables or infrastructure meet land.", "url": "https://www.straitstimes.com/world/europe/nato-warns-that-russia-is-mapping-eu-us-critical-assets"}