{"authors": [], "date_download": "2024-10-12 13:37:33", "date_modify": "2024-10-12 13:37:33", "date_publish": "2024-08-06 04:10:54", "description": "WASHINGTON - U.S. Secretary of State Antony Blinken, in a call on Monday with Sudan's army chief Abdel Fattah al-Burhan, reiterated the need for Sudan's military to participate in ceasefire talks this month in Switzerland, the State Department said. Read more at straitstimes.com.", "filename": "world_uss-blinken-urges-sudanese-army-to-participate-in-ceasefire-talks-state-dept-says_1728740253.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/06/LYNXMPEK740VD-2.jpg?VersionId=5GPLIYznlIKgv5.90SIN7dm5uCZuQmIs", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_uss-blinken-urges-sudanese-army-to-participate-in-ceasefire-talks-state-dept-says_1728740253.html", "title": "US's Blinken urges Sudanese army to participate in ceasefire talks, State Dept says", "title_page": "US's Blinken urges Sudanese army to participate in ceasefire talks, State Dept says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - U.S. Secretary of State Antony Blinken, in a call on Monday with Sudan's army chief Abdel Fattah al-Burhan, reiterated the need for Sudan's military to participate in ceasefire talks this month in Switzerland, the State Department said.\nLater, Burhan said in a statement on X that he discussed with Blinken the necessity of addressing the Sudanese government's concerns before starting negotiations.\nIn response to a recent invitation to attend U.S.-sponsored peace talks in Geneva, Sudan's government said: \"The government made clear that any negotiations before ... full withdrawal and an end to expansion (by the he paramilitary Rapid Support Forces) will not be acceptable to the Sudanese people.\"\nHowever, the government requested meetings with U.S officials to discuss the agenda for the talks.\nThe Geneva talks, which the RSF has agreed to attend, would be the first major attempt in months to mediate between the two warring sides to end the 15-month-old war. REUTERS", "url": "https://www.straitstimes.com/world/uss-blinken-urges-sudanese-army-to-participate-in-ceasefire-talks-state-dept-says"}