{"authors": [], "date_download": "2024-10-12 14:04:18", "date_modify": "2024-10-12 14:04:18", "date_publish": "2023-01-07 03:27:34", "description": "It does not include advanced Western tanks sought by Kyiv, but will still provide significant firepower. Read more at straitstimes.com.", "filename": "world_europe_us-announces-4b-in-military-assistance-for-ukraine_1728741858.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/07/2023-01-02T103134Z1575622762RC2AGY957QL2RTRMADP3UKRAINE-CRISIS-DONETSK-REGION_5.JPG?VersionId=XAAv1uklI9Sa5p5CDtRZFoy3FmtIXrfL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_us-announces-4b-in-military-assistance-for-ukraine_1728741858.html", "title": "US announces $4b in military assistance for Ukraine", "title_page": "US announces $4b in military assistance for Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The United States on Friday announced a major military assistance package for Ukraine that is valued at more than US$3 billion (S$4 billion) and includes 50 Bradleys and dozens of other armoured vehicles.\nThe assistance – US$2.85 billion drawn from US inventories and US$225 million in foreign military financing – does not include advanced Western tanks sought by Kyiv, but will still provide significant additional firepower for its forces.\nIt is “the largest security assistance package in total value that we have committed so far,” Deputy Assistant Secretary of Defence Laura Cooper told journalists.\nThe marquee items in the package are the Bradleys, which come with 500 TOW anti-tank missiles and 250,000 rounds of ammunition for their 25mm autocannons.\n“The Bradley vehicles will further enhance Ukraine’s ability to conduct complex maneuvers in almost all weather conditions and terrain, especially in the south and the east of the country,” Ms Cooper said.\nAlso included in the package are 100 M113 and 55 MRAP armoured vehicles, 18 155mm self-propelled howitzers, as well as artillery ammunition, mortar rounds, air defence missiles, and various small arms.\nThe self-propelled howitzers “will provide greater protection and maneuverability” than previously provided artillery pieces that must be towed by vehicles, Ms Cooper said.\nThe equipment will complement expanded US training for Ukrainian forces starting this month that will focus on larger-scale maneuvers, she said.\n“We are positioning Ukraine to be able to move forward and retake territory,” Ms Cooper added.\nZelensky welcomes US aid\nUkrainian President Volodymyr Zelensky hailed the new package as “timely and strong.” It brings total US military assistance since Russia invaded in February 2022 to more than US$24.2 billion.\n“For the first time, we will get Bradley armoured vehicles – this is exactly what is needed. New guns and projectiles, including high-precision ones,” he said in his evening address.\nWashington and Berlin announced the previous day that they would provide armoured vehicles – Bradleys from the US and Marders from Germany – but did not provide details.", "url": "https://www.straitstimes.com/world/europe/us-announces-4b-in-military-assistance-for-ukraine"}