{"authors": [], "date_download": "2024-10-12 14:01:40", "date_modify": "2024-10-12 14:01:40", "date_publish": "2024-04-18 02:11:15", "description": "The vote could finally get much-needed help to Ukrainian forces as they battle Russian invaders. Read more at straitstimes.com.", "filename": "world_us-house-sets-long-awaited-vote-on-billions-for-ukraine-israel_1728741700.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/18/US-POLITICS-CONGRESS-JOHNSON-164650.jpg?VersionId=kNW4rnO1Q.CiCtsYagkODCCengnYfDEy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_us-house-sets-long-awaited-vote-on-billions-for-ukraine-israel_1728741700.html", "title": "House Republicans finally announce vote for $82b in Ukraine aid", "title_page": "House Republicans finally announce vote for $82b in Ukraine aid | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The Republican leader of the US House of Representatives on April 17 announced a weekend vote on massive new military aid, including some US$61 billion (S$82 billion) in long-delayed support for Ukraine, as well as billions for Israel and Taiwan.\nThe vote – set for April 20 – could finally get much-needed help to outgunned Ukrainian forces as they battle Russian invaders, and President Joe Biden swiftly called for Congress to pass it.\nIf it does, “I will sign this into law immediately to send a message to the world: We stand with our friends, and we won’t let Iran or Russia succeed”, he said in a White House statement.\nBut the vote also sets up a showdown with House Speaker Mike Johnson’s own far-right wing, which for months has been steered by Donald Trump into blocking aid to Kyiv.\nAlong with the US$61 billion for Ukraine, the Bills would allocate more than US$26 billion for Israel as it wages war against Hamas militants in the Gaza Strip and squares up against regional foe Iran and its proxies.\nThat includes US$9.2 billion in humanitarian aid for civilian-packed Gaza, which had been a key requirement for Democrats.\nThe package also provides US$8 billion for self-ruled Taiwan, which China sees as part of its territory and has vowed to retake – by force if necessary.\nFor months, Speaker Johnson has faced huge pressure from the White House and much of Congress to allow the lower house to vote on aid to Ukraine and Israel that was already approved in the Senate.\nMr Johnson had refused to let that US$95 billion package through, as Republicans wrangled over Mr Biden’s immigration policies.\nInstead, the speaker is pushing this separate package – which the Pentagon also urged be passed “as quickly as possible”, warning it has already seen a “shift” in Ukraine’s ability to hold off Russian forces.\nIt remains unclear if Mr Johnson’s aid Bills would pass the House or the Democrat-controlled Senate.\nThe Speaker’s majority is razor-thin, and he is facing a potential Republican revolt over his complex plan, with right-wing congressman Matt Gaetz denouncing it as “abject surrender” on CNN.\nConservatives have complained over the billions in aid already spent since the fighting began in February 2022.\nThey also insist the immigration crisis at the US southern border must be tackled first, despite largely rejecting the February package which included some of the tightest border restrictions in years.\nWithout the near-total backing of his party, Mr Johnson would be left to rely on votes from Democrats to pass the package, with some, such as Ms Rosa DeLauro of Connecticut, voicing their support.\nInvesting in America\nMr Johnson announced the vote would be held on April 20 shortly after Mr Biden described Ukraine and Israel as two US allies desperate for help.\nThey both “depend on American assistance, including weaponry, to do it. And this is a pivotal moment”, Mr Biden wrote in a Wall Street Journal op-ed.\nMr Biden argued in the journal that the aid is needed to help Ukraine, which is running out of ammunition, and Israel in the wake of last weekend’s mass Iranian drone attack.\nBut he said the assistance is just as important for US security.\n“Mr Putin wants to subjugate the people of Ukraine and absorb their nation into a new Russian empire. The government of Iran wants to destroy Israel forever – wiping the world’s only Jewish state off the map,” Mr Biden wrote.\n“America must never accept either outcome – not only because we stand up for our friends, but because our security is on the line, too.”\nMr Biden said the money would not be “blank cheques”.\nThe weaponry for Ukraine would be built in US factories, he said, writing: “We’d help our friends while helping ourselves.”\nHe also sought to allay concerns within his own Democratic Party, where growing numbers of members oppose arming Israel during its devastating war against Hamas. AFP", "url": "https://www.straitstimes.com/world/us-house-sets-long-awaited-vote-on-billions-for-ukraine-israel"}