{"authors": [], "date_download": "2024-10-12 13:59:36", "date_modify": "2024-10-12 13:59:36", "date_publish": "2023-08-31 01:47:57", "description": "Psychological experts found he had dementia. Read more at straitstimes.com.", "filename": "world_united-states_former-us-cardinal-mccarrick-not-competent-to-face-sex-abuse-trial-judge-says_1728741576.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/31/2023-08-30T155320Z1491988719RC2EY2A7PDF1RTRMADP3USA-PRIEST.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_former-us-cardinal-mccarrick-not-competent-to-face-sex-abuse-trial-judge-says_1728741576.html", "title": "Former US cardinal McCarrick not competent to face sex abuse trial, judge says", "title_page": "Former US cardinal McCarrick not competent to face sex abuse trial, judge says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DEDHAM, Massachusetts - A Massachusetts judge on Wednesday dismissed a criminal case charging former Roman Catholic cardinal Theodore McCarrick with molesting a 16-year-old boy in 1974, saying the 93-year-old was not competent to stand trial after psychological experts found he had dementia.\nMcCarrick, a former archbishop of Washington, is the only current or former US Catholic cardinal to ever face child sex abuse charges, with prosecutors in Massachusetts and Wisconsin filing separate cases against him.\nThe case in Dedham, Massachusetts, before Judge Paul McCallum was the first to be filed, with prosecutors in July 2021 charging McCarrick with three counts of indecent assault and battery.\nThose cases are the only two he has faced, despite lawsuits by other men accusing him of sexual abuse decades ago.\nA legal quirk froze the statute of limitations in the Massachusetts case after McCarrick, a non-resident, left the state.\nSupporters of Catholic Church sex abuse victims expressed disappointment in Wednesday’s decision, and his alleged victim in the case in a court filing said it would allow his lawyers to proclaim he has never been convicted of wrongdoing.\n“McCarrick walks a free man and I am left with nothing,” the alleged victim wrote.\nMcCarrick pleaded not guilty in September 2021.\nAt Wednesday’s proceedings, he showed little emotion as he appeared via a video feed from the assisted living facility where he lives in Missouri.\nHis lawyers declined to comment.\nMcCarrick was expelled from the Roman Catholic priesthood in 2019 after a Vatican investigation found him guilty of sexual crimes against minors and adults.\nA Vatican report in November 2020 found that McCarrick rose through the Church’s ranks despite rumours of sexual misconduct and that Pope John Paul II promoted him despite knowing the allegations.\nAccording to court records, the alleged victim in the Massachusetts case said McCarrick, a family friend, began molesting him when he was a boy.\nThe man told police that during his brother’s wedding reception in 1974 at Wellesley College in Massachusetts, McCarrick groped him as they walked around campus before taking him into a small closet-like room and fondling him.\nHis attorneys in February moved to dismiss the Massachusetts case, saying a professor of psychiatry and behavioural science at the Johns Hopkins University School of Medicine found McCarrick has dementia, likely due to Alzheimer’s disease.\nProsecutors retained their own expert, state psychologist Kerry Nelligan, who testified on Wednesday that she also determined he had dementia, which hinders his ability to assist in his defence.\n“There were significant deficits in his memory and ability to retain information,” Ms Nelligan said. REUTERS", "url": "https://www.straitstimes.com/world/united-states/former-us-cardinal-mccarrick-not-competent-to-face-sex-abuse-trial-judge-says"}