{"authors": [], "date_download": "2024-10-12 14:03:26", "date_modify": "2024-10-12 14:03:26", "date_publish": "2023-04-11 20:15:57", "description": "A Ukrainian soldier says it's thanks to drones that Bakhmut is still holding out despite waves of Russian attacks. Read more at straitstimes.com.", "filename": "world_europe_revenge-of-the-geeks-drones-battle-on-ukraine-front_1728741806.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/11/UKRAINE-RUSSIA-CONFLICT-WAR-DRONE-195236_2.jpg?VersionId=U6Wv0WzCodtopDvIW6MY51lxYuJeh.L6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_revenge-of-the-geeks-drones-battle-on-ukraine-front_1728741806.html", "title": "‘Revenge of the geeks’: Drones battle on Ukraine front", "title_page": "‘Revenge of the geeks’: Drones battle on Ukraine front | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEAR BAKHMUT, Ukraine – At a Ukrainian training camp near Bakhmut, surrounded by soldiers lugging heavy equipment and firing ear-piercing weapons, a bespectacled man carrying a grey pouch struts jauntily across a field.\n“My weapon is a lot more discreet. These are the eyes of the army,” said Oleksandr, a soldier in his 30s with a camouflage helmet and a neatly trimmed beard, pulling out a drone from the pouch.\nOleksandr is the head of an air support unit for the army’s Fifth Brigade, mostly providing reconnaissance and surveillance but also using specially adapted drones to drop grenades.\nHis mission is to fly drones above the city of Bakhmut in eastern Ukraine – scene of the longest battle of the war and current epicentre of the fighting between Russian and Ukrainian forces.\nWhen he is not on a mission, Oleksandr is training or fixing his drones.\n“We identify the enemy and we can accompany assault units,” he said, clearing branches from a take-off spot for his drone.\nIn the modern battlefield, drones can update artillery units in real time, effectively replacing the role of spotters who adjust fire to hit targets.\nThe same is also true for the other side, and drone operators also work to neutralise Russian drones.\nGift from the Russians\nViktor, another member of Oleksandr’s drone unit, keeps the interceptor in a large briefcase.\nHe shows off its screen with a predatory smile.\n“Look, you can see them all! The Mavic and the others! All the drones!” he said.\nHe added that the device was “a gift from the Russians”.\n“In Ukraine, we don’t make machines like this. We stole it from the enemy,” he said.\nMany drones are lost, crash or get shot down. Oleksandr estimates he has lost around 100.\nThe operator said there was nothing straightforward about serving in drone units, where you have to learn to be ingenious and adaptable to succeed.\n“It’s a big job. The operator has to know everything – how to maximise the range of the drone, how to create a take-off point in complicated terrain, how to dig a trench and hide his presence,” he added.\nThe drones used by the Ukrainian army are often commercial models.\nOperators first have to hack the software to “make them invisible to Russian radio surveillance”, said Oleksandr.", "url": "https://www.straitstimes.com/world/europe/revenge-of-the-geeks-drones-battle-on-ukraine-front"}