{"authors": [], "date_download": "2024-10-12 14:02:10", "date_modify": "2024-10-12 14:02:10", "date_publish": "2023-05-22 06:34:00", "description": "The city is also known for its famous sparkling wine – whose production has now moved to the Odessa region. Read more at straitstimes.com.", "filename": "world_europe_bakhmut-from-city-of-wine-and-roses-to-hell-on-earth_1728741730.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/22/FILES-UKRAINE-RUSSIA-CONFLICT-WAR-BAKHMUT-154100_0.jpg?VersionId=Y_lSU8U.ru1UGjDFqYQesYBtA8TX0GCE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_bakhmut-from-city-of-wine-and-roses-to-hell-on-earth_1728741730.html", "title": "Bakhmut: From 'city of wine and roses' to 'hell on earth'", "title_page": "Bakhmut: From 'city of wine and roses' to 'hell on earth' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The city of Bakhmut, whose capture was claimed by Russia on Saturday and denied by Ukrainian President Volodymyr Zelensky on Sunday, had a population of around 72,000 people before the war.\nThe city is crossed by the Bakhmutka River in Donetsk region – one of four Ukrainian regions Russia claimed to have annexed in 2022 without fully controlling them months into its invasion.\nLocated at the bottom of a valley, the city is particularly difficult to defend from attack.\nOnce an important rail hub in an area best known for salt mining, the industrial city has been the epicentre of the fighting in eastern Ukraine since last summer that has left much of it in ruins.\nThe Ukrainian soldiers defending it have defined the battle as “hell on earth” or referred to it as a new “Verdun” – the longest battle of World War I.\nIt was near Bakhmut that AFP video journalist Arman Soldin was killed by rocket fire on May 9 while reporting.\nIn March, local officials estimated the remaining civilian population at just 3,000 people.\nIt is thought few if any remain there now.\n‘Road of Life’\nThe city is also known for its famous sparkling wine – whose production has now moved to the Odessa region.\nIt was called Artemovsk between 1924 and 2016 – an homage to a Soviet revolutionary nicknamed “Artem”.\nIt was once known as the “city of wine and roses”.\nA city street nicknamed “Rose Alley” broke a Ukrainian record for having 5,000 roses along it.\nFor months, just a single road has linked Ukrainian units holding out in the western part of the city with the rest of their forces.\nStrewn with burnt-out vehicles, it was has been nicknamed by soldiers the “Road of Life”.\nWhen the conflict between Kyiv and Moscow-backed separatists first started in 2014, pro-Russian fighters tried to take over Bakhmut but were pushed back by Ukraine’s military in July of that year.\nWhile some experts have questioned the strategic importance of Bakhmut, Mr Zelensky said in March that its capture could leave an “open road” for Russian troops to attack the cities of Sloviansk and Kramatorsk.\nWhen AFP journalists visited the city in April, they found artillery-scarred buildings whose courtyards were littered with twisted metal from bombed playgrounds, glass shards and makeshift crosses over graves of hastily buried civilians.\nSome civilians – often elderly ones – have refused to leave, even though they have been living in basements without water or electricity. AFP", "url": "https://www.straitstimes.com/world/europe/bakhmut-from-city-of-wine-and-roses-to-hell-on-earth"}