{"authors": [], "date_download": "2024-10-12 13:29:44", "date_modify": "2024-10-12 13:29:44", "date_publish": "2024-09-02 19:59:56", "description": "The recovery of the bodies of six Israeli hostages seized by Palestinian militants during the Oct. 7 Hamas-led attacks has triggered deep shock in Israel, bringing half a million people into the streets in protest on Sunday and prompting the biggest labour union to launch a general strike on Monday. Read more at straitstimes.com.", "filename": "world_europe_who-are-the-six-israeli-hostages-found-dead-in-gaza_1728739784.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/LYNXMPEK810CG-1.jpg?VersionId=WnUkxEYPAj6ZBKUfhXOFSEPkm1GWcnY5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_who-are-the-six-israeli-hostages-found-dead-in-gaza_1728739784.html", "title": "Who are the six Israeli hostages found dead in Gaza?", "title_page": "Who are the six Israeli hostages found dead in Gaza? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The recovery of the bodies of six Israeli hostages seized by Palestinian militants during the Oct. 7 Hamas-led attacks has triggered deep shock in Israel, bringing half a million people into the streets in protest on Sunday and prompting the biggest labour union to launch a general strike on Monday.\nThey were some of the 250 people abducted during the attack which prompted Israel's ongoing Gaza offensive.\nHere are some details on the six, who were shot dead between 48-72 hours before being found by Israeli forces, according to health ministry estimates:\nHersh Goldberg-Polin\nGoldberg-Polin, a 23-year-old American-Israeli, was one of 40 people taken hostage at an outdoor dance festival - the Nova festival - where thousands of people were partying in the dawn hours of Oct. 7 when the attackers struck.\nHe was born in California, and immigrated to Israel with his family aged seven. His parents, Rachel Goldberg and Jon Polin, spoke at the U.S. Democratic National Convention in August, where his mother described him as a \"happy-go-lucky, laid back, good humoured, respectful and curious person\".\nShe said that as rockets began to fall, he took refuge with others in a bomb shelter into which the attackers threw hand grenades. His left forearm was blown off before he was abducted into Gaza, she said.\nHe appeared in a video released by Hamas on April 24 showing him with an amputated hand, according to a statement from The Hostages Families Forum.\nU.S. President Joe Biden spoke with his parents to offer condolences.\nAlexander Lobanov\nLobanov, 32, was also seized at the Nova festival, where he worked as a bar manager, according to The Hostages Families Forum. He hailed from the Israeli city of Ashkelon.\n\"Testimonies indicate that Alex helped evacuate people and ran with five others in the Be'eri forest. While they escaped, he was captured,\" the statement said. He was married and was father to a two-year-old child and a 5-month-old baby born while he was in captivity.\nIsraeli media said he was a dual Russian citizen. Following a meeting with a Hamas delegation in January, the Russian foreign ministry named him as one of three Russian citizens being held by Palestinian factions, and urged the speedy release of civilians captured on Oct. 7.\nCarmel Gat\nGat, 40, was seized from her parents' home in Kibbutz Be'eri - among the communities hardest hit on Oct. 7. Her mother was killed during the attack, The Hostages Families Forum said.\nGat hailed from Tel Aviv and was an occupational therapist \"full of compassion and love,\" it said.\n\"After 50 days without a sign of life, the family received testimonies from returned hostages who described her as their guardian angel. To survive captivity, she taught them meditation and yoga exercises,\" it said.\nAlmog Sarusi\nSarusi, 27, was also abducted from the Nova festival, which he had been attending with his girlfriend, who was killed in the attack, The Hostages Families Forum said.\nHe was from the city of Ra'anana and was \"a vibrant, positive person who loved travelling around Israel in his white jeep with his guitar\", it said.\nEden Yerushalmi\nYerushalmi, 24, was working as a bartender at the Nova festival, The Hostages Families Forum said. When sirens sounded, she sent her family a video of rocket fire and said she was leaving. She called the police and appealed to them to find her.\n\"For four hours afterward, she spoke with her sisters May and Shani, who heard everything she went through as she tried to escape. Her last words were, 'Shani, they've caught me',\" according to the Forum's statement.\nShe had been studying to become a pilates instructor.\nOri Danino\nDanino, 25, was taken captive at the Nova festival while driving back to help others escape, according to the Hostages Families Forum. He was from Jerusalem and had planned to begin academic studies in electrical engineering. \"Ori was known for his ambition, love for people, and was beloved by all,\" it said. REUTERS", "url": "https://www.straitstimes.com/world/europe/who-are-the-six-israeli-hostages-found-dead-in-gaza"}