{"authors": [], "date_download": "2024-10-12 13:59:02", "date_modify": "2024-10-12 13:59:02", "date_publish": "2024-08-01 00:29:53", "description": "Zelensky urges key player China to pressure the Kremlin to end its invasion of his country. Read more at straitstimes.com.", "filename": "world_europe_zelensky-says-ukraine-and-the-world-want-russia-at-second-peace-summit_1728741542.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/UKRAINE-RUSSIA-CONFLICT-WAR-151406_1.jpg?VersionId=LdWIT71Bd21y1uhjiUKYnuC0FOr.Df60&h=7f1846aa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_zelensky-says-ukraine-and-the-world-want-russia-at-second-peace-summit_1728741542.html", "title": "Zelensky says Ukraine, and the world, want Russia at second peace summit", "title_page": "Zelensky says Ukraine, and the world, want Russia at second peace summit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "RIVNE, Ukraine - The entire world, including Ukraine, wants Russia to join global leaders at a planned second peace summit to end the war in Ukraine, President Volodymyr Zelensky has told French media, including AFP.\nWith Russian forces gaining momentum on the front and aid from allies ebbing or in doubt, Mr Zelensky has launched an ambitious diplomatic offensive to end the war grinding through its third year.\nHe gathered leaders and top officials from dozens of countries at the Swiss mountainside resort of Burgenstock in June for a first summit, which Russia derided as a waste of time and China shunned.\nWhile the Kremlin was not invited to the first gathering, now is the time for Moscow to take a seat at the table, Mr Zelensky said.\n“The majority of the world today says that Russia must be represented at the second summit, otherwise we will not achieve meaningful results,” he said in western Ukraine on July 30.\n“Since the whole world wants them to be at the table, we cannot be against it.”\nRussian President Vladimir Putin has said he is open to negotiations, but would order a ceasefire only if Kyiv effectively surrendered territory that Moscow claims as its own.\n‘A serious challenge’\nMr Zelensky’s push focuses on a sweeping 10-point plan that would restore Ukrainian territorial integrity, return prisoners of war and give Ukraine energy and economic guarantees.\nHe acknowledged that China was a key player but said he did not want mediation from Beijing and instead urged it to pressure the Kremlin to end its invasion.\n“If China wants, it can force Russia to stop this war,” Mr Zelensky said.\nWhile the Ukrainian leader has won broad international backing for his peace efforts, Mr Zelensky hit out at some of those same allies for barring his army from using their weapons to hit deep inside Russian territory.\n“It’s a serious challenge that we can’t use all the weapons we need to stop this enemy. What would you do if you were us?“ he said.\nHe also criticised stilted arms deliveries, saying Ukraine was still waiting for weapons from allies to equip recently mobilised troops.\nAnd if Ukraine breaks the terms of use for Western-donated weapons “then they can say that we won’t give you any more help – that’s the risk”, he said.\nMr Zelensky met French media at a school gym in the western town of Rivne, after being whisked from a gathering to hear grievances of local businesses and a meeting with local officials.\nMr Zelensky criticised the International Olympic Committee’s decision to allow some Russian athletes to compete at the Paris Games under a neutral flag.\n“Let there be bloodstains on it, and then let them compete,” he said, calling the IOC decision “piecemeal sanctions”.\nUnpredictable ‘risks’ from US\nWith uncertainty for Ukrainian forces looming over the sprawling eastern front line, Mr Zelensky also conceded that a neck-and-neck presidential race in the US – a vital political and military ally – presented further “risks”.\nWashington has provided tens of billions of dollars in military assistance for Kyiv since Russia launched its full-scale invasion of Ukraine in February 2022.\nBut a victory for Republican candidate Donald Trump – who claims he will be able to force the sides into a negotiated settlement – would bring Washington’s continued support into question.\n“We cannot influence any election,” he told reporters. “Of course, the United States is a challenge today. And there are risks that probably none of us can predict.”\nThe Democrats’ presumptive White House candidate Kamala Harris has echoed President Joe Biden’s pro-Ukraine stance.\nMr Zelensky said his team had been in touch both with her aides and the Trump campaign.\n“As president of Ukraine, I must, of course, have a dialogue between my team and the Biden, Trump, and today, Harris teams,” Mr Zelensky said.\n“We have to have all these contacts and talk about what our future might look like if one side or the other wins the election.” AFP", "url": "https://www.straitstimes.com/world/europe/zelensky-says-ukraine-and-the-world-want-russia-at-second-peace-summit"}