{"authors": [], "date_download": "2024-10-12 13:59:06", "date_modify": "2024-10-12 13:59:06", "date_publish": "2023-12-31 21:48:34", "description": "Pope Francis briefly noted the anniversary in his Dec 31 blessing to crowds in St. Peter's Square. Read more at straitstimes.com.", "filename": "world_europe_benedict-would-have-banned-same-sex-blessings-aide-says-on-anniversary_1728741546.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/31/LYNXMPEJBU04M-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_benedict-would-have-banned-same-sex-blessings-aide-says-on-anniversary_1728741546.html", "title": "Benedict would have banned same-sex blessings, aide says on anniversary", "title_page": "Benedict would have banned same-sex blessings, aide says on anniversary | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VATICAN CITY - The Vatican marked the first anniversary on Dec 31 of the death of Pope Benedict XVI, with one of his closest aides saying he never would have approved a recent declaration allowing Catholic priests to bless same-sex couples.\nCardinal Gerhard Mueller, who was the Church's doctrinal chief under Benedict, and Archbishop Georg Gaenswein, who was Benedict's private secretary, both German, were two headliners at an event marking the anniversary and organised by the conservative US-based Catholic television network EWTN.\n\"It never would have happened (under Benedict) because it was so ambiguous,\" Mueller said on the sidelines of the event when asked by Reuters about the landmark declaration issued on Dec 18.\nWhile the December declaration says such blessings cannot resemble the sacrament of matrimony between a man and a woman and cannot be part of rituals or liturgies, some advocates of more inclusion of LGBT people saw it as a possible precursor of same-sex marriage in the Church.\n\"There is no homosexual matrimony. It does not exist, it cannot exist, despite ideologies we have (today),\" said Mueller, whom Francis removed as head of the Vatican's doctrinal department after Benedict resigned in 2013.\nFrancis briefly noted the anniversary in his Dec 31 blessing to crowds in St. Peter's Square, saying Benedict had \"served the Church with love and wisdom\" and that he \"We feel so much affection, so much gratitude, so much admiration for him\".\nFrancis then asked the crowd for a round of applause for Benedict, who was the first pope in 700 years to step down instead of rule for life.\nMueller said that while his personal relationship with Francis is \"very good\" he does not hesitate to disagree with him in public on doctrinal issues because \"we are not in the Soviet Union where only one leader has a say\".\nMueller said \"the best thing we can do for the pope is always to be close to the Catholic truth and faith and not to be here as adulators\".\nEarlier in St. Peter's Basilica, Gaenswein, Benedict's secretary, said a memorial Mass for Benedict. Gaenswein's voice broke twice with emotion while reading his homily.\nBenedict's shock resignation divided the Church, with many saying he should not have stepped down.\nHis 10 years living in the Vatican as \"pope emeritus\" widened the conservative-progressive divide, with some diehard traditionalists not recognising Francis as leader.\n\"I think many polemics will be forgotten,\" Gaenswein said on the sidelines of the television event. \"What remains is the substance, and (as for) the substance of his papacy, history will judge\".\nGaenswein, who Francis dispatched back to Germany after Benedict died, said that when Benedict decided to resign, the former pope was convinced he had at most a year left to live.\n\"I pray he will be a saint. I wish he will be a saint. And I am convinced he will be a saint,\" he said. REUTERS", "url": "https://www.straitstimes.com/world/europe/benedict-would-have-banned-same-sex-blessings-aide-says-on-anniversary"}