{"authors": [], "date_download": "2024-10-12 14:16:40", "date_modify": "2024-10-12 14:16:40", "date_publish": "2022-03-11 07:01:38", "description": "Strikes came as talks between foreign ministers of Ukraine and Russia made little progress. Read more at straitstimes.com.", "filename": "world_europe_russian-forces-attack-institute-in-kharkiv-which-has-experimental-reactor_1728742600.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/SuDaQ0gdEu0ZoSR4eKNZslNChbB5SRg79sb-o3eBfAU.jpg?VersionId=3paSR.4d6xY3_UCqCBrGkS6nEKHH4VRv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russian-forces-attack-institute-in-kharkiv-which-has-experimental-reactor_1728742600.html", "title": "Russian forces attack institute in Kharkiv which has experimental reactor", "title_page": "Russian forces attack institute in Kharkiv which has experimental reactor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (REUTERS) - Russian planes bombed an institute in the Ukrainian city of Kharkiv that is home to an experimental nuclear reactor and a neighbouring hostel is on fire, a senior Ukrainian official said on Thursday (March 10).\nMr Anton Gerashchenko, an adviser to the minister of internal affairs, said in an online post that the Institute of Physics and Technology contained \"sources of radiation used for scientific purposes\".\nThe Interfax Ukraine news agency said the fire service was extinguishing a blaze in a five-story hostel which covered a total of 100 sq m.\nThe Ukrainian Parliament's official website had earlier said fighting close to the institute was continuing.\nRussian forces last week captured the nuclear power station at Zaporizhzhia after an attack during which an adjacent training facility was set on fire.\nHundreds of thousands of civilians remained trapped in Ukrainian cities on Thursday, sheltering from Russian air raids and shelling as talks between Ukraine and Russia's foreign ministers made little apparent progress.\nWith Russian President Vladimir Putin's war in Ukraine entering its third week, officials in Mariupol said Russian warplanes again bombed the southern port city where a maternity hospital was pulverised on Wednesday.\nThe invasion has so far failed to reach its stated objectives. It has caused thousands of deaths and forced more than 2 million people to flee Ukraine, where several cities are under siege.\nIt has also hit the world's economy, still emerging from the effects of the coronavirus pandemic.\nInternational Monetary Fund Managing Director Kristalina Georgieva said the war and the massive sanctions leveraged against Russia as punishment have triggered a contraction in global trade and sent food and energy prices sharply higher, which will force the IMF to lower its global growth forecast next month.\nA ceasefire was not meant to be on the agenda at Thursday's talks in Antalya, Mr Lavrov added.\nWhile there was no apparent progress towards a ceasefire, analysts said the fact the ministers were even meeting left a window open for ending the war.\nThe road ahead for any negotiation would be difficult, but Moscow's slower-than-expected military progress and the stinging cost of sanctions had potentially opened an opportunity for a compromise, they said.\nIn Washington, Central Intelligence Agency director William Burns said Mr Putin did not appear to have a \"sustainable\" end-game in Ukraine and might soon try to find a way to end the fighting.\nOthers, however, cautioned that Putin could still seek to escalate.\n\"We have moved the dial for the process from zero to at least having the possibility for a discussion. But the indications of troop movements toward Kyiv may indicate that the worst may still be ahead of us,\" said Jonathan Eyal at the Royal United Services Institute in London.", "url": "https://www.straitstimes.com/world/europe/russian-forces-attack-institute-in-kharkiv-which-has-experimental-reactor"}