{"authors": [], "date_download": "2024-10-12 13:39:49", "date_modify": "2024-10-12 13:39:49", "date_publish": "2024-10-03 19:46:05", "description": "Ukraine President Zelensky asked Kyiv’s allies to shoot down Iranian missiles and drones used by Russia. Read more at straitstimes.com.", "filename": "world_europe_nato-chief-rutte-visits-ukraine-in-first-trip-in-new-role_1728740389.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/LYNXMPEK920EZ-1.jpg?VersionId=NQ_w7Q9WoWd8CwKkwi8OqhHMPp6JimIL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_nato-chief-rutte-visits-ukraine-in-first-trip-in-new-role_1728740389.html", "title": "Nato chief Rutte visits Ukraine in first trip in new role", "title_page": "Nato chief Rutte visits Ukraine in first trip in new role | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Nato chief Mark Rutte discussed the war in Ukraine and Kyiv’s “victory plan” with President Volodymyr Zelensky on Oct 3 after arriving in the Ukrainian capital on his first official trip since becoming the alliance’s secretary-general.\nMr Zelensky said in a joint news conference with Mr Rutte he would like to see Kyiv’s allies shooting down Iranian missiles and drones used by Russia in attacks on Ukraine, as some of Israel’s allies did when Tehran attacked Israel with missiles this week.\nHe also called on Ukraine’s allies to allow deep strikes into Russia with weapons supplied by them, saying they were “delaying” their decision.\nAllowing Kyiv to hit targets deep inside Russia would boost its capabilities in disrupting Russian logistics and command chains. Wary of Russia’s response, Ukraine’s allies have held off on making such a move.\nMr Rutte affirmed Nato’s commitment to Ukraine eventually becoming a member.\n“Ukraine is closer to Nato than ever before, and it will continue along this path until it secures Nato membership,” he said.\nRussia, which began its full-scale invasion of Ukraine in February 2022, has long opposed Ukraine’s accession to the North Atlantic Treaty Organisation.\nMr Rutte voiced strong support for Ukraine on Oct 1 after taking over as Nato chief from Mr Jens Stoltenberg.\nMr Rutte served as prime minister of the Netherlands until earlier in 2024, and was regarded in this role as an ally of Kyiv, approving the transfer of Dutch F-16 fighter jets to Ukraine. REUTERS", "url": "https://www.straitstimes.com/world/europe/nato-chief-rutte-visits-ukraine-in-first-trip-in-new-role"}