{"authors": [], "date_download": "2024-10-12 14:02:29", "date_modify": "2024-10-12 14:02:29", "date_publish": "2022-06-02 07:30:00", "description": "Here is a look at the weaponry promised sent or promised so far. Read more at straitstimes.com.", "filename": "world_europe_arms-for-ukraine-who-has-sent-what_1728741749.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/02/ac_rocketlaunch_020622.jpg?VersionId=H_rodqIg8j7dl.9ygSbCjacGEOw0qVlD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_arms-for-ukraine-who-has-sent-what_1728741749.html", "title": "Arms for Ukraine: Who has sent what", "title_page": "Arms for Ukraine: Who has sent what | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS (AFP) - The United States has agreed to supply Ukraine with advanced rocket launch systems to try to turn the tide of the war.\nDespite multiple countries sending arms to Ukraine since Russia invaded on Feb 24, Kyiv has complained that it is still outgunned and pleaded for more heavy weapons.\nHere is a look at the weaponry promised sent or promised so far. This is not an exhaustive list as some nations keep their donations secret.\nUnited States\nThe US said Tuesday (May 31) it had agreed to Kyiv's request for Himars multiple-rocket launchers, which will allow Ukrainian forces to hit deeper behind Russian lines while staying out of range of Russian artillery.\nThe Himars, which will be limited in range by the US to prevent Ukrainian forces using them to strike targets inside Russia, are the centrepiece of a US$700 million (S$962.30 million) package of weapons to be paid for from a US$40 billion fund for Ukraine approved by Congress last month.\nThe Biden administration has already sent US$4.5 billion in military aid since the war began.\nThe weapons pledged or sent include 72 155mm howitzers, 72 vehicles to tow them, 144,000 rounds of ammunition, and more than 120 \"Phoenix Ghost\" tactical drones recently developed by the US Air Force specifically to address Ukraine's needs.\nThe US has also pledged helicopters, armoured personnel carriers, 1,400 Stinger anti-aircraft systems, 5,000 Javelin anti-tank missiles, several thousand rifles with ammunition and a range of other equipment.\nTurkey\nTurkey's Bayraktar TB2 combat drones have become famous the world over since the war began, with videos going viral of Ukrainian forces using them to destroy convoys of Russian armoured vehicles and artillery.\nUkraine also said it used a TB2 to distract the defences of the Russian warship Moskva before pounding it with missiles in mid-April, causing it to sink.\nBefore the invasion Kyiv had around 20 TB2s. In March, Kyiv said it had received more, without saying how many.\nUnited Kingdom\nBritain said on May 20 it had committed £450 million (S$772.43 million) so far to supporting the Ukrainian military. The government said the aid included 120 armoured vehicles, over 5,800 anti-tank missiles, five air defence systems, over 1,000 rockets and 4.5 tonnes of explosives.\nIn early May, Prime Minister Boris Johnson also promised electronic warfare equipment, a counter-battery radar system, GPS jamming equipment and thousands of night-vision devices.\nBritain says it has also trained more than 22,000 Ukrainian soldiers.\nCanada\nCanada has supplied Ukraine with C$262 million (S$284.62 million) of military aid since February.\nIn late May, the federal government said it was sending 20,000 artillery shells, to go with the M777 howitzers it has already sent to boost Ukraine's defences in the Donbas.\nOttawa has also sent Kyiv drone cameras, rifles, ammunition, high-resolution satellite imagery, rocket launchers, thousands of hand grenades and two tactical airlift aircraft.\nSweden announced in late February it would send 10,000 single use anti-tank launchers along with demining equipment.\nFinland, which like Sweden has applied for Nato membership since Russia's invasion of Ukraine, announced in February it would send Kyiv 2,500 assault rifles, 150,000 rounds of ammunition and 1,500 single use anti-tank launchers. A month after the war began, Helsinki said it would send more weapons, without specifying what type.\nThree days after the war started, Denmark said it would send 2,700 anti-tank launchers. On a visit to Kyiv in late, Prime Minister Mette Fredriksen announced another 600 million Danish kroner (S$118.12 million) for weapons. Washington says Denmark plans to send a Harpoon anti-ship missile system, which can target ships as far as 187 miles (300 kilometres) offshore.\nUkraine's neighbours\nPoland says it has sent US1.6 billion worth of arms, including an unspecified number of tanks. Polish and US media have reported that Warsaw supplied over 200 tanks, which would make Ukraine's second-biggest weapons supplier after the US.\nWarsaw says it has also sent anti-tank missiles, mortars, ammunition and drones.\nSlovakia has so far contributed military material worth 153 million euros and has reached a deal with Ukraine on the sale of at least eight howitzers.\nBaltic states\nCentral and Eastern Europe\nSlovenia announced in late February it was sending Kalashnikov assault rifles and ammunition. Slovenia was also in discussions with Germany about sending Ukraine a large number of its Soviet-era tanks in return for German tanks and troop carriers but no deal has been announced as yet.\nBulgaria is not officially providing military equipment to Ukraine due to opposition from pro-Russian socialists.\nThe Czech Republic has provided military aid worth 3.5 billion koruna (S$207 million) and says it is planning further supplies worth up to 28 million euros. US Defence Secretary Lloyd Austin said the Czech government had supplied combat helicopters and rocket systems. Prague says Czech companies will also repair Ukrainian tanks.\nBelgium, Netherlands, Greece, Italy\nBelgium says it has sent 5,000 automatic rifles and anti-tank weapons to Ukraine.\nThe Netherlands in late February promised the delivery of 200 Stinger missiles and in April said it would send a limited number of howitzers.", "url": "https://www.straitstimes.com/world/europe/arms-for-ukraine-who-has-sent-what"}