{"authors": [], "date_download": "2024-10-12 13:28:15", "date_modify": "2024-10-12 13:28:15", "date_publish": "2024-09-12 17:15:00", "description": "A tightening of immigration rules may have made Britain less attractive for high-skilled migrants. Read more at straitstimes.com.", "filename": "world_europe_britain-is-struggling-to-attract-skilled-workers-from-abroad_1728739695.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/2024-08-06T070331Z480999412RC2FQ8ABIW7WRTRMADP3BRITAIN-BOE-BANKS.JPG?VersionId=5dFSQjNqT0sd3zyMCe9e4jhkFfuZYwbM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_britain-is-struggling-to-attract-skilled-workers-from-abroad_1728739695.html", "title": "Britain is struggling to attract skilled workers from abroad", "title_page": "Britain is struggling to attract skilled workers from abroad | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – High-wage foreigners are shunning Britain in favour of countries such as France and the Netherlands, despite government efforts to attract skilled migrants to boost economic growth.\nOf all the clicks on British job postings from workers abroad, only a fifth were on high-wage jobs, or postings offering the upper third of wages, according to data covering the first six months of 2024 from job-search website Indeed.\nOnly Spain had a smaller proportion among the 10 advanced economies analysed.\nForeigners still have a strong urge to work in Britain, but they are not the kind of workers the government wants.\nThe lowest-paid jobs attracted 40 per cent of clicks from abroad, casting doubt over the Conservatives’ policies to discourage low-skill migration.\nThe decline in interest from better qualified foreigners poses a challenge for the new Labour government’s ambitions to cement Britain at the top of the Group of Seven growth league.\nMigration is a top issue for voters, and Prime Minister Keir Starmer has promised to reduce the need for foreign labour by improving the training of British workers.\nBut with some of the country’s most productive sectors such as information technology and engineering continuing to experience staff shortages, Labour is eager not to obstruct their ability to bring in talent from abroad.\n“While there’s been a surge in foreign interest in UK roles, the country falls behind other Western nations in attracting highly skilled workers, which is at odds with the government’s current immigration policy,” said Mr Pawel Adrjan, economic research director for Emea and Apac at Indeed.\nFrance and the Netherlands attracted the highest proportion of high-skill workers, with more than one in three clicks from abroad going to the best-paid jobs, the Indeed report showed.\nA tightening of immigration rules since splitting from the European Union in 2021 may have made Britain less attractive for high-skilled migrants, but it has done nothing to deter foreign workers overall.\nInterest in British jobs on Indeed is 54 per cent above levels seen before Brexit and the Covid-19 pandemic, with three time more work permits issued than in 2019.\nFood preparation and retail were among the sectors seeing the strongest growth in overseas searches.\nBritish jobs on Indeed were particularly popular with workers from countries such as India, Pakistan, the US and the United Arab Emirates.\nBut Britain may be losing its appeal for its domestic workers.\nA majority of British employees said their lifestyle would improve if they moved to a different country, while half said working abroad would lift their incomes and offer more career opportunities.\nSmaller economies tend to be more attractive to foreign workers than major countries, Indeed found.\nLuxembourg is a top destination, thanks to a multilingual environment, job opportunities in the financial sector and a high number of cross-border employees. BLOOMBERG", "url": "https://www.straitstimes.com/world/europe/britain-is-struggling-to-attract-skilled-workers-from-abroad"}