{"authors": [], "date_download": "2024-10-12 14:08:23", "date_modify": "2024-10-12 14:08:23", "date_publish": "2022-07-23 04:47:51", "description": "A ceasefire would give Moscow an opportunity to replenish and rearm, ultimately prolonging the conflict, he said. Read more at straitstimes.com.", "filename": "world_europe_ukraines-zelensky-says-no-ceasefire-without-recovering-land-lost-to-russia_1728742103.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/23/2022-07-03T165747Z_498985892_RC2G4V9V6P7Z_RTRMADP_3_UKRAINE-CRISIS-ZELENSKIY-AUSTRALIA.JPG?VersionId=Y_kgXSJfC5ZmnkRneqhWn9IDFGE.h1Ur&h=d01005d1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraines-zelensky-says-no-ceasefire-without-recovering-land-lost-to-russia_1728742103.html", "title": "Ukraine's Zelensky says no ceasefire without recovering land lost to Russia", "title_page": "Ukraine's Zelensky says no ceasefire without recovering land lost to Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (REUTERS) - Ukrainian President Volodymyr Zelensky said a ceasefire with Russia without reclaiming lost territories would only prolong the war, according to an interview with the Wall Street Journal on Friday (July 22).\nHe warned that a ceasefire that allows Russia to keep Ukrainian territories seized since the invasion in February would only encourage an even wider conflict, giving Moscow an opportunity to replenish and rearm for the next round.\nZelensky also spoke about US-supplied high mobility artillery rocket systems (Himars), saying, \"the Western supplies of Himars, while making a material difference, are much lower than what Ukraine needs to turn the tide.\"\n\"Freezing the conflict with the Russian Federation means a pause that gives the Russian Federation a break for rest,\" the Wall Street Journal reported, citing comments by Zelensky.\nHe said: \"Society believes that all the territories must be liberated first, and then we can negotiate about what to do and how we could live in the centuries ahead.\"\n\"A more pressing need is air-defence systems that could prevent Russia from raining long-range missiles on otherwise peaceful cities hundreds of miles from the front lines,\" Zelensky added.\nReferring to the deal signed with Russia to reopen grain exports Zelensky said, \"Diplomatic concessions to Moscow might stabilise the markets somewhat, but would only provide a temporary respite and boomerang in the future.\"", "url": "https://www.straitstimes.com/world/europe/ukraines-zelensky-says-no-ceasefire-without-recovering-land-lost-to-russia"}