{"authors": [], "date_download": "2024-10-12 13:39:15", "date_modify": "2024-10-12 13:39:15", "date_publish": "2023-10-09 02:00:27", "description": "It is the deadliest quake to rock the quake-prone mountainous country in years. Read more at straitstimes.com.", "filename": "world_afghan-earthquakes-kill-2445-taliban-say-as-deaths-mount_1728740355.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/09/LYNXMPEJ970AJ-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_afghan-earthquakes-kill-2445-taliban-say-as-deaths-mount_1728740355.html", "title": "Afghan earthquakes kill 2,445 as deaths mount", "title_page": "Afghan earthquakes kill 2,445 as deaths mount | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KABUL – More than 2,400 people were killed in earthquakes in Afghanistan, the Taliban administration said on Sunday, in the deadliest tremors to rock the quake-prone mountainous country in years.\nThe Saturday quakes in the west of the country hit 35km north-west of the city of Herat, with one of magnitude 6.3, the United States Geological Survey said.\nThey are among the world’s deadliest quakes in 2023, after tremors in Turkey and Syria killed an estimated 50,000 in February.\nMr Janan Sayeeq, spokesman for Afghanistan’s Ministry of Disasters, said in a message to Reuters that the toll had risen to 2,445 dead, but he revised the number of injured to “more than 2,000”. Earlier, he had said that 9,240 people had been injured. The death toll spiked from 500 reported earlier on Sunday by the Red Crescent.\nMr Sayeeq also said 1,320 houses had been damaged or destroyed.\nTen rescue teams were in the area, which borders Iran, Mr Sayeeq told a press conference.\nMore than 200 dead had been taken to various hospitals, said a Herat health department official who identified himself as Dr Danish, adding that most of them were women and children.\nBodies had been “taken to several places – military bases, hospitals”, Dr Danish said.\nBeds were set up outside the main hospital in Herat to receive a flood of victims, photos on social media showed.\nFood, drinking water, medicine, clothes and tents were urgently needed for rescue and relief, Mr Suhail Shaheen, the head of the Taliban political office in Qatar, said in a message to the media.\nAfghanistan’s healthcare system, reliant almost entirely on foreign aid, has faced crippling cuts in the two years since the Taliban took over and much international assistance, which had formed the backbone of the economy, was halted.\nDiplomats and aid officials say concerns over Taliban restrictions on women and competing global humanitarian crises are causing donors to pull back on financial support. The Islamist government has ordered most Afghan female aid staff not to work, although with exemptions in health and education.\nIn August, a spokesperson for the International Committee of the Red Cross said it was likely to end its financial support for 25 Afghan hospitals because of funding constraints. It was not immediately clear if the Herat hospital was on that list.\nThe quakes triggered panic in Herat, resident Naseema said. “People left their houses, we all are on the streets,” she wrote in a text message to Reuters on Saturday, adding that the city was feeling aftershocks.\nThere are a total of 202 public health facilities in Herat province, one of which is the major regional hospital where 500 casualties had been taken, the World Health Organisation (WHO) said in a report on Sunday.\nA vast majority of the facilities are smaller basic health centres and logistical challenges were hindering operations, particularly in remote areas, the WHO said.\n“While search and rescue operations remain ongoing, casualties in these areas have not yet been fully identified,” it said. REUTERS", "url": "https://www.straitstimes.com/world/afghan-earthquakes-kill-2445-taliban-say-as-deaths-mount"}