{"authors": [], "date_download": "2024-10-12 13:51:14", "date_modify": "2024-10-12 13:51:14", "date_publish": "2024-07-17 18:38:05", "description": "GENEVA - Switzerland has opened investigations into more than 50 cases of possible sanctions violations and has found breaches in 15 of them so far, the government said in a statement on Wednesday. Read more at straitstimes.com.", "filename": "world_europe_switzerland-opens-dozens-of-russian-sanctions-cases_1728741074.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/17/LYNXMPEK6G0CZ-1.jpg?VersionId=GL5UcOHE1VGMtZwMtA13D2mFYnOUdxw5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_switzerland-opens-dozens-of-russian-sanctions-cases_1728741074.html", "title": "Switzerland opens dozens of Russian sanctions cases", "title_page": "Switzerland opens dozens of Russian sanctions cases | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GENEVA - Switzerland has opened investigations into more than 50 cases of possible sanctions violations and has found breaches in 15 of them so far, the government said in a statement on Wednesday.\nSince Russia's invasion of Ukraine in February 2022, Switzerland has adopted sanctions similar to those of other Western countries, passing new measures earlier this month.\nThe State Secretariat for Economic Affairs (SECO) said in an email to Reuters that the effective implementation of sanctions was a government priority and that it had opened 56 violations proceedings to date.\nOf those, around half have been dropped and penalties have been ordered for 15 of them. The others remain under investigation, it said.\nSECO did not name the sectors involved, nor the individual companies subject to investigation.\nSwitzerland said earlier this year it had set up a specialist team to investigate and enforce sanctions that Bern imposed following Moscow's invasion of Ukraine. REUTERS", "url": "https://www.straitstimes.com/world/europe/switzerland-opens-dozens-of-russian-sanctions-cases"}