{"authors": [], "date_download": "2024-10-12 13:47:42", "date_modify": "2024-10-12 13:47:42", "date_publish": "2023-01-03 01:26:00", "description": "Spain saw temperatures surge repeatedly in successive heat waves from May and into October. Read more at straitstimes.com.", "filename": "world_europe_spain-sees-hottest-year-on-record-in-2022_1728740862.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/03/bthot20220103_1.jpg?VersionId=_z1yEJhP8WEHlwyi3dIm1z9YuBMgIm.X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_spain-sees-hottest-year-on-record-in-2022_1728740862.html", "title": "Spain sees hottest year on record in 2022", "title_page": "Spain sees hottest year on record in 2022 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MADRID - Spain in 2022 experienced the hottest year since records began, the country’s national weather service said Monday, adding that several northern cities were also unseasonably warm on New Year’s Day 2023.\nNations across the globe grappled with extreme weather including scorching temperatures and drought across Europe which last year fuelled wildfires, damaged crops and led to water use restrictions.\nSpain recorded an average temperature for the year of nearly 15.5 deg C, the highest since records began in 1916, national weather office Aemet said in a tweet.\nIt was the first time that the average yearly temperature surpassed 15 deg C, the office added.\nSpain saw temperatures surge repeatedly in successive heat waves from May and into October, with the mercury soaring above 40 deg C across large swathes of the country.\nExcept for March and April, the remaining months of 2022 were “warmer than normal, especially May, July and October which were extremely warm”, the weather office said in a preliminary report in December.\nThe exceptionally warm weather continued into the new year with several northern cities recording record highs on New Year’s Day.\nBilbao airport reached 25.1 deg C, the hottest temperature recorded for the city in January and more like a summer’s day than the start of the year, the national weather service said.\nThe average July temperature for the city is in the mid twenties.\nSpain also recorded one of its driest years in 2022, with only 2005 and 2017 having received less precipitation, it added.\nWater restrictions\nThe country’s reservoirs were at 43 per cent capacity at the end of December, below a 10-year average of 53 per cent, according to the environment ministry.\nBarcelona and large swathes of Spain’s northeastern region of Catalonia have imposed water restrictions due to the lack of rain.\nThe measures include banning the use of drinking water to wash the exterior of houses or cars or to fill swimming pools, and reducing the amount of water used for irrigation.\nThe scorching temperatures this summer caused the deaths of 4,744 people in Spain, according to an estimate from a public health institute based on the number of excess deaths recorded during the period.\nHeat can kill by inducing heatstroke, which damages the brain, kidneys and other organs, but it can also trigger other conditions such as a heart attack or breathing problems.\nThe exceptionally dry and hot year favoured explosive wildfires that ravaged over 300,000 hectares (740,000 acres) of land in Spain, according to the European Union’s EFFIS satellite monitoring service, the biggest amount in over two decades.\nEarth has warmed more than 1.1 deg C since the late 19th century, with roughly half of that increase occurring in the past 30 years, the World Meteorological Organisation said in a report in November.\nGreenhouse gases accounting for more than 95 per cent of warming are all at record levels, the body’s annual State of the Global Climate found. AFP", "url": "https://www.straitstimes.com/world/europe/spain-sees-hottest-year-on-record-in-2022"}