{"authors": [], "date_download": "2024-10-12 14:15:50", "date_modify": "2024-10-12 14:15:50", "date_publish": "2022-03-16 04:51:50", "description": "Kyiv official describes a \"very difficult and viscous negotiation process\", but says compromise is possible. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-fundamental-contradictions-in-talks-with-russia_1728742550.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/gQxJaZBjJT4QpbxFPbgcLmHpLwrFzxjX8ugp2br7ieA.jpg?VersionId=8RHqtCXlSPwVnVL1TNVylmxCBGCjwJ0_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-fundamental-contradictions-in-talks-with-russia_1728742550.html", "title": "Ukraine says 'fundamental contradictions' in talks with Russia", "title_page": "Ukraine says 'fundamental contradictions' in talks with Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (AFP) - There are \"fundamental contradictions\" in talks aimed at ending Russia's military attack on Ukraine but compromise is possible, a member of the Ukrainian delegation and presidential aide, Mykhailo Podolyak, said on Tuesday (March 15).\n\"We'll continue tomorrow. A very difficult and viscous negotiation process. There are fundamental contradictions. But there is certainly room for compromise,\" Podolyak tweeted.\nTalks resumed on Tuesday, with both sides having signalled progress.\nPresident Volodymyr Zelensky said that the Russians \"have already begun to understand that they will not achieve anything by war\" and called Monday's talks \"pretty good\".\nRussian Foreign Minister Sergei Lavrov said on Tuesday at a press conference that \"talks are now continuing on giving Ukraine neutral military status, in the context of security guarantees for all participants in this process\", as well as on \"demilitarising Ukraine\", Interfax news agency reported.\nLavrov is set to meet his Turkish counterpart Mevlut Cavusoglu in Moscow on Wednesday to discuss the Ukraine conflict, the Russian ministry said.", "url": "https://www.straitstimes.com/world/europe/ukraine-says-fundamental-contradictions-in-talks-with-russia"}