{"authors": [], "date_download": "2024-10-12 14:11:27", "date_modify": "2024-10-12 14:11:27", "date_publish": "2018-11-21 02:04:48", "description": "Defying pressure from United States lawmakers to impose tougher sanctions on Saudi Arabia, President Donald Trump also said he would not cancel military contracts with the kingdom. Read more at straitstimes.com.", "filename": "world_united-states_us-will-stand-by-saudis-even-though-prince-may-have-had-knowledge-of-killing_1728742287.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/brightcove-thumbnails/Y1dFI6bcJaptkeUWxdxvigrFVYsziiiszikMnfpqyKI.jpg?VersionId=uHCKyOLjadXwhyofEfzj3zuhwHPhuFKt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-will-stand-by-saudis-even-though-prince-may-have-had-knowledge-of-killing_1728742287.html", "title": "US will stand by Saudis, even though prince may have had knowledge of Jamal Khashoggi killing, says Trump", "title_page": "US will stand by Saudis, even though prince may have had knowledge of Jamal Khashoggi killing, says Trump | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - President Donald Trump vowed on Tuesday (Nov 20) to remain a \"steadfast partner\" of Saudi Arabia despite saying that Saudi Crown Prince Mohammed bin Salman may have known about the plan to murder dissident journalist Jamal Khashoggi last month.\nDefying pressure from United States lawmakers to impose tougher sanctions on Saudi Arabia, Mr Trump also said he would not cancel military contracts with the kingdom.\nSuch a \"foolish\" move would benefit only Russia and China, said the US President, who critics accuse of exaggerating the importance of those weapons sales to the American economy.\nMr Trump said US intelligence agencies were still studying the evidence around Mr Khashoggi's murder inside the Saudi consulate in Istanbul on Oct 2 and who planned it.\n\"Our intelligence agencies continue to assess all information, but it could very well be that the Crown Prince had knowledge of this tragic event - maybe he did and maybe he didn't!\" Mr Trump said in a statement issued by the White House.\nUS intelligence sources say the CIA's assessment is that Mr Khashoggi's death was ordered directly by the Crown Prince, who is Saudi Arabia's de facto ruler and is widely known by his initials MBS.\nDemocratic and Republican lawmakers have urged Mr Trump to drop his support for MBS, but the President has been reluctant.\nMr Trump said on Tuesday that both Saudi Arabia's King Salman and MBS \"vigorously deny any knowledge of the planning or execution of the murder\", and that the truth may never be known.\nHe also stressed that Saudi Arabia, a major oil producer, is an important business partner and a \"great ally\" in the fight against Iranian power in the Middle East.\n\"The United States intends to remain a steadfast partner of Saudi Arabia to ensure the interests of our country, Israel and all other partners in the region,\" Mr Trump said.\nHis comments were quickly condemned by Democratic lawmakers.\nMr Adam Schiff, who is expected to become leader of the House of Representatives' Intelligence Committee in January, said the US should immediately end support for Saudi Arabia in the Yemen war and suspend arms sales to the kingdom.\n\"The President adds to his track record of ignoring his own intelligence agencies, and undermining American values at home and abroad, by giving Saudi Arabia a pass for the brutal and premeditated murder of a US resident and journalist. Outrageous,\" Mr Dick Durbin, a senior Democratic senator, said in a Twitter post.\nSome of Mr Trump's fellow Republicans have also vowed to break from him and push for firmer US action against Saudi Arabia.\nRepresentative Francis Rooney, a Republican on the House Foreign Affairs Committee, said Washington should apply the so-called Magnitsky Act to those responsible for Mr Khashoggi's death. The legislation hits human rights violators with freezes on US assets, US travel bans, and prohibitions on Americans doing business with them.\n\"I don't think we have any choice but to take this very seriously and apply the Magnitsky Act,\" Mr Rooney told CNN.\nMr Trump has placed his alliance with Saudi Arabia at the heart of his Middle East policy, and it was the first country he visited after becoming president in 2017.\nHis son-in-law Jared Kushner has developed a personal relationship with MBS, and Mr Trump has often overstated the economic value of close ties with Saudi Arabia, especially arms sales.\n\"If we foolishly cancel these contracts, Russia and China would be the enormous beneficiaries - and very happy to acquire all of this newfound business. It would be a wonderful gift to them directly from the United States!\" Mr Trump said in his statement on Tuesday.", "url": "https://www.straitstimes.com/world/united-states/us-will-stand-by-saudis-even-though-prince-may-have-had-knowledge-of-killing"}