{"authors": [], "date_download": "2024-10-12 13:50:07", "date_modify": "2024-10-12 13:50:07", "date_publish": "2024-08-16 20:36:01", "description": "With a political truce for the Games, Macron had aimed to name a prime minister by mid-August. Read more at straitstimes.com.", "filename": "world_europe_frances-macron-invites-parties-for-talks-with-view-to-name-new-pm_1728741007.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/16/FRANCE-POLITICS-HISTORY-WWII-CEREMONY-075300.jpg?VersionId=Q2ceWMQW.jth97uvR2sgqm5Ux8T46r3S", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_frances-macron-invites-parties-for-talks-with-view-to-name-new-pm_1728741007.html", "title": "France’s Macron invites parties for talks with view to name new PM", "title_page": "France’s Macron invites parties for talks with view to name new PM | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - President Emmanuel Macron has invited party leaders from France’s two parliamentary chambers for talks on Aug 23 with a view to appointing a new premier, his office said on Aug 16.\nAfter a surprise July 7 election delivered a hung Parliament and a blow to Mr Macron’s centrist coalition, outgoing Prime Minister Gabriel Attal’s government steered France through the Paris Olympics in a caretaker role.\nWith a political truce in place for the Games, Mr Macron had aimed to name a prime minister by mid-August. So far, he has ignored the candidate agreed on by the left-wing alliance, the New Popular Front, which came top in the vote.\nThe aim of the Aug 23 meetings with presidents of the party groups in the National Assembly and Senate is to “build the broadest and most stable majority possible to serve the country”, Mr Macron’s office said in a statement.\n“In the legislative elections, the French people expressed their desire for change and a broad-based consensus. In a spirit of responsibility, all political leaders must work to implement this desire,” the statement added, saying the appointment of a new prime minister will follow on from these talks.\nA source close to Mr Macron told Reuters in August that the president believes the vote delivered a National Assembly whose centre of gravity is in the centre or the centre-right and that a new prime minister should be able to find common ground with moderates across the political spectrum. REUTERS", "url": "https://www.straitstimes.com/world/europe/frances-macron-invites-parties-for-talks-with-view-to-name-new-pm"}