{"authors": [], "date_download": "2024-10-12 14:02:12", "date_modify": "2024-10-12 14:02:12", "date_publish": "2024-03-06 14:37:00", "description": "Russia has increasingly used warplanes near the front lines to drop powerful guided bombs on Ukrainian positions. Read more at straitstimes.com.", "filename": "world_europe_shift-in-russian-tactics-intensifies-air-war-in-ukraine_1728741732.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/06/TOPSHOTS-TOPSHOT-UKRAINE-RUSSIA-WAR-CONFLICT-160133.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_shift-in-russian-tactics-intensifies-air-war-in-ukraine_1728741732.html", "title": "Shift in Russian tactics intensifies air war in Ukraine", "title_page": "Shift in Russian tactics intensifies air war in Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – The Ukraine war has been fought largely on the ground in the past two years, with troops often locked in back-and-forth battles with heavy artillery and drone support.\nThe countries’ air forces have played second fiddle because of Ukraine’s limited fleet of planes and Russia’s inability to gain the air supremacy it once expected.\nBut as the Russian military presses on with attacks in the east, its air force has taken on a greater role.\nMilitary analysts say Russia has increasingly used warplanes near the front lines to drop powerful guided bombs on Ukrainian positions and clear a path forward for the infantry.\nThat tactic, used most notably in Avdiivka, the strategic eastern city captured by Russian forces in February, has yielded good results, experts say.\nBut it has also come with risks.\n“It’s a costly but quite effective tool that Russia is now using in the war,” said Mr Serhiy Hrabskyi, a retired Ukrainian army colonel. It is dangerous for them to send their fighter jets close to the front line, he added, but it can “impact Ukrainian positions effectively”.\nThe Ukrainian army last week said it had shot down seven Su-34 fighter jets, nearly all operating in the east, just a few days after downing an A-50 long-range radar reconnaissance aircraft.\nIt was, according to Ukrainian officials, part of a series of successful strikes against the Russian air force, in which Ukraine claimed to have shot down 15 planes in as many days.\nThe majority of the shootdowns could not be independently verified, and a senior US official expressed scepticism at that number.\nThe official said the Ukrainians appear to be taking credit in some instances for planes they fired at, but which were not confirmed to have been downed.\nOryx, a military analysis site that counts losses based on visual evidence, and Russian military bloggers confirmed the loss of two Su-35 fighter jets. Britain’s military intelligence services confirmed the destruction of the A-50 plane.\nMr Tom Karako, the director of the Missile Defence Project at the Washington-based Centre for Strategic and International Studies, said the Russian losses probably were the result of “some relationship between the Russian aircraft being put in harm’s way”, Ukraine’s intelligence gathering on the movements of Russian planes and the deployment of air-defence systems “to take them out”.\nAfter the invasion in February 2022, Ukraine managed to keep Russia from controlling the skies through air combat and the skilful use of anti-aircraft missiles.\nAfter only a month and heavy losses among its warplanes, Russia stopped flying its aircraft beyond the front lines, Royal United Services Institute (Rusi) said in a report, turning instead to launching barrages of cruise and ballistic missiles from afar.\nBut that left Russia “unable to effectively employ the potentially heavy and efficient aerial firepower” of its fighter bombers to strike Ukrainian front-line positions, the report said.\nThis began to change in early 2023 when Russia started using glide bombs, guided munitions that are dropped from a plane and can fly long distances to the front lines, limiting the risk to planes from anti-aircraft missiles.\nCarrying hundreds of kilograms of explosives, the glide bombs can smash through the underground bunkers that protect soldiers at the front.\n“These bombs completely destroy any position,” Mr Egor Sugar, a Ukrainian soldier who fought in Avdiivka, wrote on social media. “All buildings and structures simply turn into a pit after the arrival of just one.”\nUkrainian officials and military analysts said Russian aviation had played an important role in the capture of Avdiivka, one that required Russian jets “to fly closer” to the front line to maximise the effect of the glide bombs.\nAnd that exposed them to the risk of being shot down by Ukraine’s air defences.\nIn late December, the Ukrainian army said it destroyed three Su-34 jets near the Russian-controlled eastern bank of the Dnipro River in the south, where Ukrainian troops have secured small positions. Then came the shootdowns in the east.\nIt remains unclear which air-defence systems Ukraine has deployed. But some army officials and analysts have hinted at the use of the US-made Patriot, America’s most advanced ground-based air-defence system.\nThe Institute for the Study of War, a Washington-based think-tank, said “Russian forces appeared to tolerate an increased rate of aviation losses in recent weeks in order to conduct glide-bomb strikes in support of ongoing Russian offensive operations in eastern Ukraine”.\nOne of Ukraine’s biggest successes in the air battle was the destruction last week of one of Russia’s A-50 radar planes – the second in 2024 – which are critical in coordinating aerial bombardments of Ukrainian positions on the front.\n“Taking out their eyes, and taking out their targeting ability, that’s a pretty good win,” Mr Karako said.\nBritain’s military intelligence said Russia had seven other A-50s but that it had “highly likely grounded the fleet from flying” in support of its military operations to prevent further losses, thus reducing the “situational awareness provided to air crews”.\nThe Ukrainian air force said Russian aviation activity in eastern Ukraine had significantly subsided by the evening of March 2.\nIt is unclear how long Russia can sustain air losses. Rusi analysts said in February that Russian air crew losses amounted to nearly 160 personnel, which they described as “a serious loss of capability”.\nThe Russian state news agency Tass said on February 27 that the state-owned defence conglomerate, Rostec, would resume production of the A-50 “since it is needed by the Russian armed forces”.\nMr Hrabskyi likened Russia’s costly strategy in the air to its tactics on the ground, where it has sent wave after wave of troops in bloody assaults to capture cities, regardless of the human cost.\n“The Russians don’t care,” he said. “If they have an order, they will use all available capabilities, all available weapons systems to attack.” NYTIMES", "url": "https://www.straitstimes.com/world/europe/shift-in-russian-tactics-intensifies-air-war-in-ukraine"}