{"authors": [], "date_download": "2024-10-12 13:39:37", "date_modify": "2024-10-12 13:39:37", "date_publish": "2024-07-31 05:19:14", "description": "The police did not give any details about the 17-year-old male suspect, beyond saying he was born in Britain. Read more at straitstimes.com.", "filename": "world_violent-crowd-clashes-with-uk-police-after-young-girls-killed_1728740377.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/LYNXMPEK6T157-1.jpg?VersionId=Tj2RMgjPhC3AF9C3yOZJW0G.hguB_raw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_violent-crowd-clashes-with-uk-police-after-young-girls-killed_1728740377.html", "title": "Violent crowd clashes with British police, vehicles set alight after young girls stabbed to death", "title_page": "Violent crowd clashes with British police, vehicles set alight after young girls stabbed to death | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SOUTHPORT, England – A large crowd of anti-Muslim protesters clashed with the police on July 30 in a northern English town where three girls were stabbed to death and five other children were critically wounded during an attack at a dance event on July 29.\nThe police said the protesters were supporters of the English Defence League which has previously staged often violent demonstrations against Islam.\nThe police have not given any details about the 17-year-old male suspect, beyond saying that he was born in Britain, but hundreds of people gathered in the town on July 30.\nThe suspect is in police custody on suspicion of murder and attempted murder after the incident at the Taylor Swift Yoga And Dance Workshop in Southport, north of Liverpool, a summer vacation event for children aged from six to 11.\nPolice vehicles were damaged and set alight, and items were thrown towards a nearby mosque. One video posted online showed the crowd chanting “we want our country back”.\nAssistant Chief Constable Alex Goss said the situation was unacceptable, and added: “Yesterday, our officers and other members of the emergency services were faced with one of the most difficult situations they will ever face.\n“Tonight, they find themselves being attacked as they endeavour to prevent disorder.”\nWitnesses to the attack on July 29 described what they saw as being like a scene from a horror film.\nEight other children suffered stab wounds and five remained in a critical condition. Two adults were also critically wounded while attempting to protect the young victims, the police said.\nBritish Prime Minister Keir Starmer visited the town earlier on July 30, and King Charles and his family expressed their shock. Meanwhile, Home Secretary Yvette Cooper told Parliament that people must not speculate about the motive of the attack.\nUS singer Swift wrote on Instagram that she was “just completely in shock”.\n“These were just little kids at a dance class. I am at a complete loss for how to ever convey my sympathies to these families.”\nHer fans have raised more than £125,000 (S$215,000) online to help families of the victims and for the hospital where some of the children were being treated.\nThe three girls who died in the attack were named as Bebe King, six, Elsie Dot Stancombe, seven, and Alice Dasilva Aguiar, nine.\n“Keep smiling and dancing like you love to do our Princess, like we said before to you, you’re always our princess and no one would change that. Love from Your Hero Daddy and Mummy,” Alice’s family said in a statement.\nMerseyside police said the motive was unclear but added that they were not looking for anyone else in connection with the stabbings, amid fevered speculation on social media about the suspect, who was born in Cardiff and lived in a nearby village.\n“We have already said that the person arrested was born in the UK and speculation helps nobody at this time,” Assistant Chief Constable Goss said.\nThe attack has shocked Southport, a quiet seaside town, and the country as a whole. Mr Starmer paid a sombre visit to the scene on July 30 to lay flowers and to meet the police and paramedics who responded to the incident.\n“I came here to pay my respects to the victims and families who are going through raw pain and grief that most of us can’t imagine, I can’t imagine as a dad myself,” he told reporters.\nThere has been increasing concern at rising levels of stabbings and knife crime in Britain, and the Southport attack follows other recent similar, indiscriminate rampages.\n“I’m absolutely determined that my government will get to grips with it,” Mr Starmer said. REUTERS", "url": "https://www.straitstimes.com/world/violent-crowd-clashes-with-uk-police-after-young-girls-killed"}