{"authors": [], "date_download": "2024-10-12 14:01:20", "date_modify": "2024-10-12 14:01:20", "date_publish": "2023-06-03 18:07:00", "description": "Ukraine’s air defences work round-the-clock to combat the relentless barrage of missiles from Russia. Read more at straitstimes.com.", "filename": "world_europe_we-have-no-days-off-the-non-stop-work-of-ukrainian-air-defences_1728741680.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/03/UKRAINEAIRDEFENSE4_3.JPG?VersionId=4I5PKZ6wPxCTLgE1az75e5A0RN9ZEM3p", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_we-have-no-days-off-the-non-stop-work-of-ukrainian-air-defences_1728741680.html", "title": "‘We have no days off’: The non-stop work of Ukrainian air defences", "title_page": "‘We have no days off’: The non-stop work of Ukrainian air defences | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Find it, target it, shoot it.\nThe drill is the same for Ukraine’s air defence crews as they work round the clock to combat the relentless barrage of missiles the Russians launch at Kyiv, mostly foiling the most intense bombardment of the capital since the first weeks of the war.\nIn the month of May alone, Russia bombarded Kyiv 17 times.\nIt has fired hypersonic missiles from MiG-31 fighter jets and attacked with land-based ballistic missiles powerful enough to level an entire apartment block.\nRussian bombers and ships have fired dozens of long-range cruise missiles, and more than 200 attack drones have featured in blitzes meant to confuse and overwhelm Ukrainian air defences.\nIt presents a constant struggle for Ukrainian defenders.\nRussian assaults can be unrelenting. They come mostly at night, but sometimes in the daytime hours, as they did on Monday.\nEven when Ukraine manages to blast missiles from the sky, falling debris can bring death and destruction.\nEarly on Thursday, Russia sent a volley of 10 ballistic missiles at Kyiv. Ukrainian officials said these were all shot down but that falling fragments killed three people, including a child, and injured more than a dozen others.\nYet overall, very little has penetrated the complex and increasingly sophisticated air defence network around Ukraine’s capital, saving scores of lives.\n“We have no days off,” said Riabyi, the call sign of the 26-year-old “shooter” who is part of a two-person anti-aircraft missile crew responsible for protecting just one patch of sky just outside Kyiv.\nUkraine’s air defences are a stitched-together patchwork of weapons, many of them newly supplied by the West, protecting millions of civilians in Kyiv and other cities, as well as guarding critical infrastructure that includes four working nuclear power plants.\nMr Andriy Yusov, a spokesman for Ukraine’s military intelligence agency, said the recent air raids aimed at the capital were a “massive and unprecedented” assault intended to exhaust air defence systems, strike a powerful symbolic blow at the heart of the ancient capital and sow terror.\nUkrainian President Volodymyr Zelensky once again thanked “the defenders of the sky” in his address to the nation on Tuesday night.\nThe battle in the skies, he made clear, is as important as the bloody struggle being waged by soldiers on land.\nAir defence teams have managed to shoot down roughly 90 per cent of the incoming missiles and drones recently and, remarkably, 100 per cent of the ballistic missiles aimed at Kyiv, according to the Ukrainian air force.\nThose statistics could not be independently verified.\nAir defence assets will also be critical in Ukraine’s looming counteroffensive – keeping newly acquired weapons safe as they stage for battle and then providing cover for Ukrainian troops if they manage to break through the Russian lines.\nContinuing success in the skies, however, is by no means assured.\nLeaked Pentagon documents made public in April expressed deep concern that Russia could achieve air superiority as Ukraine runs out of anti-aircraft missiles for Soviet-designed S-300 and Buk systems that still make up the backbone of its air defences.\nSince that analysis was leaked, Ukraine’s Western allies have stepped up delivery of new systems and ammunition.\nThe arrival of two Patriot batteries in late April gave Ukraine its first system designed to shoot down ballistic missiles.\nAir defence systems rely on a variety of methods to take down incoming missiles.\nFor a cruise missile, which can travel at around 805kmh, an interceptor can target its heat signature or track a laser projected onto the missile by the Ukrainian defender, among other methods.\nBallistic missiles are capable of travelling much faster.\nUkrainians target them with interceptor missiles that are also capable of travelling at high speed and that have their own guidance and radar to assist in tracking at such speeds.\nThe only proven defence against the powerful Russian Iskander missiles is the US Patriot air defence system, which can be fired within nine seconds of a target being identified.\nStill, Ukraine must make difficult decisions about how to deploy limited resources.\nDr Karako of the Missile Defence Project said the recent attacks on Kyiv have shown “how stressing and challenging a concerted air assault can be”, underscoring the need for Ukraine to keep building its defences as the Russians try to wear them down.\nWhile Ukrainian and Western officials have noted that Russia is likely running low on precision missiles, and relying more on less accurate missiles and drones, Moscow has shown that it still has the capacity to stage attacks at a regular tempo.\nSince Russia launched its full-scale invasion 15 months ago, it has fired more than 5,000 missiles and attack drones at targets across Ukraine, according to a recent study by the Centre for Strategic and International Studies.\nBut like Russia’s ground offensives, the air assaults have failed to produce the strategic military effects Moscow desired, according to the study.\nUkrainian air defences have “greatly shaped the course of the war, limiting Russian striking power”.\nFor Kyiv residents, the nearly nightly blitzes have been exhausting and terrifying.\nThe first alarm usually sounds after midnight, and the assaults last for hours.\n“I’m checking the information trying to understand what is flying and from where,” said Ms Natalia Ulianytska, 32, a human rights activist who lives in Kyiv.\n“When there’s a massive missile attack, I go to the bathroom together with my cat,” she said.\nRiabyi, the gunner, said he has had to learn on the job.\nHe was still going through training at a base in Ukraine’s west when Russia invaded.\nHis wife, pregnant with their first child, fled their home north of Kyiv before Russian soldiers could occupy the village; Riabyi was dispatched to Kyiv.\nHis daughter was born in May, but he did not see her for the first time until December.\nThey spent a few days together and then he had to return to his post to help ensure she could sleep safely. NYTIMES", "url": "https://www.straitstimes.com/world/europe/we-have-no-days-off-the-non-stop-work-of-ukrainian-air-defences"}