{"authors": [], "date_download": "2024-10-12 13:45:37", "date_modify": "2024-10-12 13:45:37", "date_publish": "2022-09-02 11:55:13", "description": "The space agency has been working to correct the technical difficulties that delayed the previous launch. Read more at straitstimes.com.", "filename": "world_united-states_nasa-will-try-to-launch-artemis-1-to-the-moon-again-on-saturday_1728740737.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/02/md_nasa_02092022.jpg?VersionId=wrb7zgCV7BqSAnZWTeFR4rUzpVRSTOwM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_nasa-will-try-to-launch-artemis-1-to-the-moon-again-on-saturday_1728740737.html", "title": "Nasa will try to launch Artemis 1 to the moon again on Saturday", "title_page": "Nasa will try to launch Artemis 1 to the moon again on Saturday | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MERRITT ISLAND - The stars appear to be aligned for Nasa's Moon rocket to finally blast off on Saturday, with weather forecasts favourable and technical issues that postponed the launch earlier this week resolved.\nLiftoff is scheduled for 2.17pm local time (2.17am Sunday in Singapore) from Kennedy Space Centre in Florida, with the potential for up to a two-hour delay if necessary.\nThe chance for favourable weather conditions within that window sat at 60 per cent on Thursday evening.\nThe weather looks good and is not expected to be a \"show-stopper\", forecast analyst Melody Lovin said at a media conference.\nNasa has also been working to correct the technical difficulties that led to the last-minute delay of the launch during its originally scheduled window on Monday.\nAt first, it seemed that one of the rocket's four main engines was too hot, though it turned out just to be a reading from a bad sensor, the rocket's programme manager John Honeycutt said on Thursday.\nIn the future, the incorrect information will simply be ignored.\nThen, a fuel tank leak had to be patched.\n\"We were able to find what we believe is the source of the leak and correct that,\" launch director Charlie Blackwell-Thompson said.\nThe Artemis 1 mission is an uncrewed test flight. It will be the first launch for the Space Launch System (SLS) rocket, the most powerful in the world and which has been in development for more than a decade.\n\"There's no guarantee that we're going to get off on Saturday, but we're going to try,\" said Artemis mission manager Mike Sarafin.\nIf the mission goes ahead on Saturday, the Orion capsule fixed atop the rocket will spend 37 days in space, orbiting the Moon from about 100km away.", "url": "https://www.straitstimes.com/world/united-states/nasa-will-try-to-launch-artemis-1-to-the-moon-again-on-saturday"}