{"authors": [], "date_download": "2024-10-12 14:19:41", "date_modify": "2024-10-12 14:19:41", "date_publish": "2022-04-06 05:03:41", "description": "Marine Le Pen has sought to distance herself from Vladimir Putin after the invasion of Ukraine. Read more at straitstimes.com.", "filename": "world_europe_frances-macron-targets-poll-rival-le-pen-over-ties-to-russia_1728742781.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/06/lepenputinnew06.jpg?VersionId=A3J5mq44wCIlLEM16iUO.HhD26iu5Pq0&h=b0acceeb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_frances-macron-targets-poll-rival-le-pen-over-ties-to-russia_1728742781.html", "title": "France's Macron targets far-right poll rival Le Pen over ties to Russia", "title_page": "France's Macron targets far-right poll rival Le Pen over ties to Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SPEZET, FRANCE (AFP) - French President Emmanuel Macron on Tuesday (April 5) accused his far-right election rival Marine Le Pen of being too close to Russian leader Vladimir Putin, denying he had indulged the Kremlin over the Russian invasion of Ukraine.\nRussia and Ukraine risk becoming a key issue in France's election campaign this month, as polls project Le Pen could make a serious challenge to the centrist Macron in the second round run-off on April 24.\n\"You should not be looking at me if you want to find complacency towards Vladimir Putin, or Russian financing,\" he told reporters on a campaign visit to Brittany ahead of the first round of polls on Sunday.\n\"You should be looking at the other candidates. Don't forget that,\" he said on a cam.\nWhile Macron did not name Le Pen by name, his comments were a clear reference to the far-right National Rally (RN) leader who was hosted by Putin in 2017 and whose party is continuing to pay back a loan of some nine million euros from a Russian creditor.\nLe Pen has sought to distance herself from Putin after the invasion of Ukraine, saying he is \"not the same person\" she had met in 2017 and speaking of \"war crimes\" after the discovery of corpses outside Kyiv.\nMacron has kept up dialogue with Putin even after the launch of the Russian invasion on Feb 24 but said that it was at the request of President Volodymyr Zelensky who believed such talks were still useful.\n\"I will do so, so long as the Ukrainian president asks me to have a dialogue with Russia, so long as France can play a role in making the negotiations progress, obtaining things on the humanitarian level and preparing for peace.\"\nHis comments also came after bitter criticism from Polish Prime Minister Mateusz Morawiecki over Macron's policy of keeping up talks with Putin despite the mounting outrage over Russia's actions in Ukraine.\n\"How many times have you negotiated with Putin and what have you achieved? We do not discuss, we do not negotiate with criminals. Criminals have to be fought against,\" Morawiecki said Monday, addressing Macron.\n\"Nobody negotiated with Hitler. Would you negotiate with Hitler, with Stalin, with Pol Pot?\" he asked.\nMacron said that he had never used the situation in Ukraine for political ends and said he would only visit Zelensky in Kyiv if it could bring results.\n\"If it can bring something and have a useful effect, I would do it either before or after\" the presidential election, he said.", "url": "https://www.straitstimes.com/world/europe/frances-macron-targets-poll-rival-le-pen-over-ties-to-russia"}