{"authors": [], "date_download": "2024-10-12 13:38:58", "date_modify": "2024-10-12 13:38:58", "date_publish": "2024-10-11 13:06:28", "description": "This could help explain US opposition to any Israeli strike on Iran's nuclear programme. Read more at straitstimes.com.", "filename": "world_middle-east_us-still-believes-iran-has-not-decided-to-build-a-nuclear-weapon-us-officials-say_1728740338.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/LYNXMPEK9A04H-1.jpg?VersionId=ZSojWOY_3l7P9wyZ8Gcav90PqWpFsyoR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_us-still-believes-iran-has-not-decided-to-build-a-nuclear-weapon-us-officials-say_1728740338.html", "title": "Washington believes Iran has not decided to build a nuclear weapon, US officials say", "title_page": "Washington believes Iran has not decided to build a nuclear weapon, US officials say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The United States still believes that Iran has not decided to build a nuclear weapon despite Tehran’s recent strategic setbacks, including Israel’s killing of Hezbollah leaders and two largely unsuccessful attempts to attack Israel, two US officials told Reuters.\nThe comments from a senior Biden administration official and a spokesperson for the Office of the Director of National Intelligence (ODNI) added to public remarks earlier this week by Central Intelligence Agency director William Burns, who said the United States had not seen any evidence Iran’s leader had reversed his 2003 decision to suspend the weaponisation programme.\n“We assess that the Supreme Leader has not made a decision to resume the nuclear weapons programme that Iran suspended in 2003,” said the ODNI spokesperson, referring to Iran’s leader, Ayatollah Ali Khamenei.\nThe intelligence assessment could help explain US opposition to any Israeli strike on Iran’s nuclear programme in retaliation for a ballistic missile attack that Tehran carried out last week.\nUS President Joe Biden said after that attack he would not support an Israeli strike on Iranian nuclear sites, but did not explain why he had reached that conclusion. His remarks drew fierce criticism from Republicans, including former president Donald Trump.\nUS officials have long acknowledged that an attempt to destroy Iran’s nuclear weapons programme might only delay the country’s efforts to develop a nuclear bomb and could even strengthen Tehran’s resolve to do so.\n“We’re all watching this space very carefully,” the Biden administration official said.\nIran’s mission to the United Nations in New York did not immediately respond to a request for comment, but Tehran has repeatedly denied ever having had a nuclear weapons programme.\nIn the past weeks, Israel’s military has inflicted heavy losses on Hezbollah, the most powerful member of the Iran-backed network known as the Axis of Resistance.\nThe group’s setbacks have included the killing of its leader Hassan Nasrallah in an Israeli air strike in September.\nThe weakening of a key Iranian ally has prompted some experts to speculate that Tehran may restart its efforts to acquire a nuclear bomb to protect itself.\nMs Beth Sanner, a former US deputy director of national intelligence, said the risk of Mr Khamenei reversing his 2003 religious dictum against nuclear weapons is “higher now than it has been” and that if Israel were to strike nuclear facilities, Tehran would likely move ahead with building a nuclear weapon.\nThat would still take time, however.\n“They can’t get a weapon in a day. It will take months and months and months,” said Ms Sanner, now a fellow with the German Marshall Fund.\nIran is now enriching uranium to up to 60 per cent fissile purity, close to the 90 per cent of weapons grade, at two sites, and in theory it has enough material enriched to that level, if enriched further, for almost four bombs, according to a yardstick of the International Atomic Energy Agency, the UN watchdog.\nThe expansion in Iran’s enrichment programme has reduced the so-called breakout time it would need to produce enough weapons-grade uranium for a nuclear bomb to “a week or a little more”, according to Mr Burns, from more than a year under a 2015 accord that Trump pulled out of when he was president.\nActually making a bomb with that material would take longer. How long is less clear and the subject of debate.\nPossible Israeli attack\nIsrael has not yet disclosed what it will target in retaliation for Iran’s attack last week with more than 180 ballistic missiles, which largely failed thanks to interceptions by Israeli air defences as well as by the US military.\nThe United States has been privately urging Israel to calibrate its response to avoid triggering a broader war in the Middle East, officials have said, with Mr Biden publicly voicing his opposition to a nuclear attack and concerns about a strike on Iran’s energy infrastructure.\nIsrael, however, views Iran’s nuclear programme as an existential threat.\nThe conflicts in the Middle East between Israel and Iran and Iran-backed groups in Lebanon, Gaza and Yemen have become campaign issues ahead of the Nov 5 presidential election, with Trump and his Democratic rival, US Vice-President Kamala Harris, positioning themselves as pro-Israel.\nSpeaking at a campaign event last week, Trump mocked Mr Biden for opposing an attack on Iran’s nuclear sites, saying: “That’s the thing you want to hit, right?”\nMr Avi Melamed, a former Israeli intelligence officer and government official, said Iran still had space to compensate for setbacks dealt to its proxies and missile force without having to resort to developing a nuclear warhead.\n“The Iranians have to recalculate what’s next. I don’t think at this point they will rush to either develop or boost the (nuclear) programme towards military capacity,” he said. “They will look around to find what manoeuvring space they can move around in.” REUTERS", "url": "https://www.straitstimes.com/world/middle-east/us-still-believes-iran-has-not-decided-to-build-a-nuclear-weapon-us-officials-say"}