{"authors": [], "date_download": "2024-10-12 13:38:10", "date_modify": "2024-10-12 13:38:10", "date_publish": "2024-08-14 17:33:39", "description": "The US has said it expects indirect talks to go ahead as planned in Qatar's capital Doha on Aug 15. Read more at straitstimes.com.", "filename": "world_middle-east_hamas-to-stay-out-of-gaza-truce-talks-iran-considers-israel-attack_1728740290.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/14/11548262.jpg?VersionId=loc3uDMsz75QmHwVAd3NPLArhNghokI3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_hamas-to-stay-out-of-gaza-truce-talks-iran-considers-israel-attack_1728740290.html", "title": "Hamas to stay out of Gaza truce talks as Iran considers Israel attack", "title_page": "Hamas to stay out of Gaza truce talks as Iran considers Israel attack | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CAIRO – The Palestinian militant group Hamas said on Aug 14 it would not take part in a new round of Gaza ceasefire talks slated for Aug 15 in Qatar, dimming hopes for a negotiated truce that Iranian sources say could hold back an Iranian attack on Israel.\nThe US has said it expects indirect talks to go ahead as planned in Qatar’s capital Doha on Aug 15, and that a ceasefire agreement was still possible.\nHowever, Axios reported that US Secretary of State Antony Blinken has postponed a trip to the Middle East that had been expected to begin on Aug 13.\nThree senior Iranian officials have said that only a ceasefire deal in Gaza would hold Iran back from direct retaliation against Israel for the assassination of Hamas leader Ismail Haniyeh on its soil in July.\nThe Israeli government said it would send a delegation to the Aug 15 talks but Hamas, which controls Gaza, requested a workable plan to implement a proposal it has already accepted, instead of more talks.\n“Hamas is committed to the proposal presented to it on July 2, which is based on the UN Security Council resolution and the Biden speech, and the movement is prepared to immediately begin discussion over a mechanism to implement it,” senior Hamas official Sami Abu Zuhri told Reuters.\n“Going to new negotiation allows the occupation to impose new conditions and employ the maze of negotiation to conduct more massacres,” he added.\nThere has been no let-up in fighting in Gaza, where residents of the southern city of Khan Younis said Israeli forces blew up homes in the east and intensified tank shelling on eastern areas of the city centre.\nIsrael said it was responding to Hamas rocket fire towards Tel Aviv on Aug 13 and that it had struck rocket launching pads and militants among 40 military targets over 24 hours, including in central Gaza, Khan Younis, and western Rafah in the south.\nHamas and Islamic Jihad said they had attacked Israeli forces in several areas, while Palestinian health officials said Israeli strikes had killed at least 14 people thus far on Aug 14, mostly in the centre and south.\nHamas also said its fighters were engaged in fierce clashes with Israeli forces in another Palestinian territory, the Israeli-occupied West Bank, where Israel said it had killed a number of militants.\n‘Uncertain opportunities for diplomacy’\nA ceasefire deal would aim to end fighting in Gaza and ensure the release of Israeli hostages held in the enclave in return for many Palestinians jailed by Israel, but the two sides remain divided by sequencing and other issues.\nHamas wants an agreement to end the war and a withdrawal of Israeli forces from Gaza as a basic pre-condition for releasing hostages, while Israeli Prime Minister Benjamin Netanyahu says he will only agree to a pause in fighting to allow as many hostages to return as possible. He has repeatedly said the war can end only when Hamas is eradicated.\nA Hamas-led attack on Israeli communities around the Gaza Strip on Oct 7 killed some 1,200 people, with more than 250 taken into captivity in Gaza, according to Israeli tallies, in one of the most devastating blows against Israel in its history.\nIn response, Israeli forces have razed much of Gaza, displaced most of the population, and killed around 40,000 people, according to the Palestinian Health Ministry, eliciting horror around the world. Israel says it has lost more than 300 soldiers. Hamas rocket attacks on its territory have continued.", "url": "https://www.straitstimes.com/world/middle-east/hamas-to-stay-out-of-gaza-truce-talks-iran-considers-israel-attack"}