{"authors": [], "date_download": "2024-10-12 13:36:16", "date_modify": "2024-10-12 13:36:16", "date_publish": "2023-10-15 01:56:15", "description": "The open-air base has existed since at least 2013 and is about 8km from Israel’s border. Read more at straitstimes.com.", "filename": "world_middle-east_israel-knew-a-nearby-hamas-base-posed-a-threat-but-it-expanded-anyway_1728740176.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/15/ISRAEL-PALESTINIAN-CONFLICT-DEMO-144355.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israel-knew-a-nearby-hamas-base-posed-a-threat-but-it-expanded-anyway_1728740176.html", "title": "Israel knew a nearby Hamas base posed a threat, but it expanded anyway", "title_page": "Israel knew a nearby Hamas base posed a threat, but it expanded anyway | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – In 2014, and again as recently as May 2021, Israel bombed a key military base in Gaza, clearly seeing it as a threat. But videos and satellite photos show that over the last year and a half, the site significantly expanded and was used by Hamas to train paragliders, part of the first wave of the militant group’s deadly Oct 7 terror attack.\nThe open-air base – more than 1.5km wide and covering nearly 160ha – has existed since at least 2013 and is about 8km from Israel’s border. It includes firing ranges, structures for urban warfare training and a nearly 600m-long airstrip.\nSatellite images captured in July 2014 show four holes in the runway that a New York Times analysis suggests were caused by an Israel Defence Forces (IDF) air strike. The runway was later rebuilt, but in May 2021 was hit in another air strike. Satellite photos taken soon after that show three large craters in the concrete.\nImages captured since August 2022 show the base’s runway was repaired, a new road and training facilities built and the firing ranges expanded.\nWhile it was not possible to determine precisely what role the base played in the Oct 7 incursion, visual evidence from around August 2022 clearly links Hamas to the facility, and suggests the group used it to rehearse an attack.\nThe Times verified that a Hamas propaganda video released on the day of the incursion was filmed there on Aug 18, 2022. Fighters are seen readying propeller-driven paragliders attached to three-wheeled seats before taking off, flying a short distance, landing and launching a mock attack on a group of concrete buildings resembling a small settlement.\nEven before the Oct 7 attack, Hamas was not shy about publicising the base. Sections of it, geolocated and verified by the Times, appear in a May 2022 training video released by the group showing fighters firing weapons and speeding around in a pickup truck.\nSecurity analysts have raised serious questions about why the base was able to grow and remain active before Saturday’s assault.\n“The intelligence failure here is huge,” said Dr Raphael Cohen, a senior political scientist at the Rand Corp, a research group, and an intelligence officer in the US Army Reserve.\nThe IDF did not respond to a request for comment, but a spokesman, Lieutenant-Colonel Jonathan Conricus, told CNN, which reported this past week on it and other Hamas bases near the Israeli border, that such facilities were “nothing new”. Israel had struck many of Hamas’ training areas in the past, he said, adding that the group had “many training areas”.\nBeyond the evident expansion, the base is in a conspicuous location. The runway is less than a kilometre from the largest logistics base in the Gaza Strip for the United Nations Relief and Works Agency, the agency responsible for Palestinian refugee affairs, completed in 2019. NYTIMES", "url": "https://www.straitstimes.com/world/middle-east/israel-knew-a-nearby-hamas-base-posed-a-threat-but-it-expanded-anyway"}