{"authors": [], "date_download": "2024-10-12 14:08:06", "date_modify": "2024-10-12 14:08:06", "date_publish": "2022-07-24 03:45:07", "description": "Defence officials also want to know who is collaborating with the occupiers in Enerhodar. Read more at straitstimes.com.", "filename": "world_europe_tell-us-where-russian-troops-are-living-ukraine-tells-citizens-in-key-region_1728742086.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/24/UKRAINE-RUSSIA-CONFLICT-152056.jpg?VersionId=TCfU1_QxtRm79Rwau8u0BFnBab_rMdOA&h=0a65d968", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_tell-us-where-russian-troops-are-living-ukraine-tells-citizens-in-key-region_1728742086.html", "title": "Tell us where Russian troops are living, Ukraine tells citizens in key region", "title_page": "Tell us where Russian troops are living, Ukraine tells citizens in key region | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (REUTERS) - Ukraine's defence ministry on Saturday (July 23) urged citizens in a key area seized by Russia to reveal where Moscow's troops were living and who among the local population was collaborating with the occupying authorities.\nThe statement by the ministry's defence intelligence directorate was aimed at people in and around the southern city of Enerhodar, which is home to a major nuclear power station.\n\"Please let us know as a matter of urgency the exact location of the occupying troops' bases and their residential addresses... and the places of residence of the commanding staff,\" it said, adding that exact coordinates were desirable.\nIt also asked for details \"of local collaborators who went over to the side of the enemy\", including where they lived and worked, as well as information about \"people who 'sympathise' with the occupiers\".\nRussia captured Enerhodar in early March and in May, the Russian-appointed head of the city was injured in an explosion.\nThe Kremlin termed it a \"terrorist attack\".\nIn June, a pro-Russian official in the southern Kherson region was killed in a blast, RIA news agency said. Earlier that month the head of the region's penal service was taken to hospital after a bomb exploded near his car.\nThe intelligence directorate's appeal - published on Telegram - also asked for the routes that Russian military equipment was using in Enerhodar.\n\"Together, let's kick the occupants out of our homeland!\" it said, adding people could either call in details or provide them via the WhatsApp or Signal instant messaging apps.", "url": "https://www.straitstimes.com/world/europe/tell-us-where-russian-troops-are-living-ukraine-tells-citizens-in-key-region"}