{"authors": [], "date_download": "2024-10-12 14:05:14", "date_modify": "2024-10-12 14:05:14", "date_publish": "2022-06-16 07:48:33", "description": "An enclosure dubbed \"Iron City\" contains five carriages that can host up to 25 families. Read more at straitstimes.com.", "filename": "world_europe_train-carriages-host-the-homeless-in-ukraines-irpin_1728741914.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/16/md_traincabinroom_16062022.jpg?VersionId=.fFaeMbL1rvUTIYC0hBNC.WUKuMnhOk4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_train-carriages-host-the-homeless-in-ukraines-irpin_1728741914.html", "title": "Train carriages host the homeless in Ukraine's Irpin", "title_page": "Train carriages host the homeless in Ukraine's Irpin | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "IRPIN (AFP) - A Russian missile transformed Mr Vladimir Melnik's house in the Kyiv suburb of Irpin into a smouldering wreck as Moscow's forces advanced on the Ukrainian capital in March.\nThree months later, the 73-year-old is back in Irpin and settling into a train carriage newly converted into accommodation for those whose homes were destroyed in the town devastated by Russia's invasion.\n\"A missile pierced the roof, the ceiling and ended up in the cellar, but I managed to save myself,\" said Mr Melnik, who lived with his sister after his house burned down on March 10.\n\"Here, I was told I could stay as long as necessary,\" he told AFP as he showed black and white photographs of his former dwelling.\nAn enclosure dubbed \"Iron City\" contains five carriages that can host up to 25 families, Ukrainian railway company Ukrzaliznytsia (UZ) told reporters during a presentation of the homes on Wednesday (June 15).\nThe carriages come equipped with air conditioning, bathroom facilities and a coffee machine, and residents can connect to a Wi-Fi network provided by US billionaire Elon Musk's Starlink service.\nA dining car offers residents meals prepared every day by an NGO and a seventh carriage has been kitted out with shower rooms, a changing room and a washing machine.\nAn open space is dedicated to recreation, with small playgrounds for children, a barbecue area, benches, wooden tables and two hammocks.\nThe location is a haven of tranquility that contrasts sharply with the horrors of war the residents endured.\n\"Now we need to get the damage to the house assessed and rebuild everything, and that is going to take time,\" Mr Melnik said, wondering how he can finance the repairs on a monthly pension worth less than 200 euros (S$290).\nMs Olga Oleinik, 77, moved with her family of six into one of the carriages on Wednesday after her Irpin home was destroyed at the start of the war. She and Mr Melnik are among the first five families to be hosted. Others will arrive in the coming days.\nMr Oleksandr Pertsovskyi, head of UZ's passenger division, told AFP the maximum capacity of 25 families would be reached by the end of the month.", "url": "https://www.straitstimes.com/world/europe/train-carriages-host-the-homeless-in-ukraines-irpin"}