{"authors": [], "date_download": "2024-10-12 14:08:45", "date_modify": "2024-10-12 14:08:45", "date_publish": "2022-06-02 08:14:51", "description": "No final decisions have been made about the trip. Read more at straitstimes.com.", "filename": "world_united-states_biden-planning-gulf-visit-could-meet-crown-prince-sources_1728742125.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/02/ac_bidenvowing_020622.jpg?VersionId=ydtFI6VEywYDvO_0rzw_3Wrkzv0Wkhni", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-planning-gulf-visit-could-meet-crown-prince-sources_1728742125.html", "title": "Biden planning Gulf visit, could meet Crown Prince: Sources", "title_page": "Biden planning Gulf visit, could meet Crown Prince: Sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - US officials are planning a trip for President Joe Biden to the Middle East later this month to meet Gulf allies, which could put him in the same room with Saudi Crown Prince Mohammed bin Salman, sources said on Wednesday (June 1).\nNo final decisions have been made about the trip, according to sources inside and outside the United States familiar with the planning, who spoke on condition of anonymity.\nThe trip, tentatively being planned after a Group of Seven summit in Germany and a Nato meeting in Spain, would include a visit to Israel, in which Mr Biden would meet Israeli Prime Minister Naftali Bennett, the sources said.\nAsked about the possibility of Mr Biden going to Saudi Arabia, White House spokesman Karine Jean-Pierre told reporters on Wednesday she had no trips to preview, and that Mr Biden stood by his earlier opinions of the Crown Prince.\nUpset at the murder of Washington Post journalist Jamal Khashoggi, which US intelligence says was approved by Prince Mohammed, Mr Biden entered office in January 2021 vowing to recalibrate the US relationship with Saudi Arabia.\nFormer president Donald Trump's White House had cozy ties with the Crown Prince.\nThe visit would be aimed at bolstering relations with Saudi Arabia at a time when Mr Biden is trying to find ways to lower high petrol prices in the US.\nWhether Saudi Arabia would agree to increase oil production is highly uncertain. It has previously rejected US requests to do so, remaining in compliance with an output agreement that the Organisation of Petroleum Exporting Countries (Opec) reached with Russia and nine other producers.\nThe so-called Opec+ group has been unwinding record output cuts in place since 2020, as demand recovered from the coronavirus pandemic, but not as fast as the West and other consumers want.\nMr Biden is aiming to participate in a Riyadh summit of the Gulf Cooperation Council (GCC), a regional union whose members are Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates, sources said.\nThe goal would be to reactivate an annual summit between the US and the GCC that began during the presidency of Mr Barack Obama.\nBefore agreeing to the summit, Washington is looking for an extension of the Yemen truce and clarity on oil output by Saudi Arabia and the UAE, one source said.\nA two-month nationwide truce between a Saudi-led coalition and the Iran-aligned Houthi group, the first since 2016, expires on June 2.\nTwo senior US officials visited Saudi Arabia in May for talks that covered energy and other issues but did not include calls for boosting Saudi oil exports, the White House said at the time.", "url": "https://www.straitstimes.com/world/united-states/biden-planning-gulf-visit-could-meet-crown-prince-sources"}