{"authors": [], "date_download": "2024-10-12 13:37:33", "date_modify": "2024-10-12 13:37:33", "date_publish": "2024-08-06 10:35:00", "description": "On Aug 1, Russia released Wall Street Journal reporter Evan Gershkovich, along with 15 other inmates. Read more at straitstimes.com.", "filename": "world_navalny-couldn-t-be-freed-until-gershkovich-was-kidnapped-gershkovich-couldn-t-be-freed-until-navalny-was-dead_1728740253.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/06/11517495.jpg?VersionId=MYGh5HNLvc8Druptb4O8BbJpI6liu0Py", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_navalny-couldn-t-be-freed-until-gershkovich-was-kidnapped-gershkovich-couldn-t-be-freed-until-navalny-was-dead_1728740253.html", "title": "Navalny couldn’t be freed until Gershkovich was kidnapped. Gershkovich couldn’t be freed until Navalny was dead.", "title_page": "Navalny couldn’t be freed until Gershkovich was kidnapped. Gershkovich couldn’t be freed until Navalny was dead. | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - A few days ago, Russian political prisoners started vanishing from their prison colonies: Their lawyers would come to see them only to be told their clients were no longer there.\nThe disappearance of an inmate is often bad news – it can mean a move to a more remote colony, illness or death.\nBut as the number of “missing” prisoners grew, in the Russian dissident community a mounting sense of anticipation replaced the concern. “A trade”, a prominent Russian in exile posted on his Facebook page, without bothering to explain the reference. “Definitely a trade”, posted a young Russian activist in exile, a day later. “I am hopeful and I’m afraid to say the word,” posted another.\nOn Aug 1, Russia released Wall Street Journal reporter Evan Gershkovich, along with 15 other inmates. In exchange, Germany, the United States, Slovenia, Norway and Poland together released a total of eight prisoners, including Russian assassin Vadim Krasikov.\nIt was the largest and most complicated prisoner swap in US history. It was also the largest such bargain the West has ever struck with Russia, a country whose legal system is designed to punish opponents of the regime and to generate hostages.\nThe story of this exchange began a year before Mr Gershkovich’s arrest, in late January 2022. Christo Grozev, an investigative journalist living in Vienna, was strolling along Silver Lake Reservoir in Los Angeles with Maria Pevchikh, a leading figure in the anti-corruption movement started by Russian opposition leader Alexei Navalny.\nMr Grozev, tall and lanky, moves with an awkwardness that suggests a boy who grew too fast. He sometimes forgets his backpack in cafes, and he is peculiarly open for someone in his line of work.\nMs Pevchikh, who is a good two heads shorter, is organised, relentlessly logical, suspicious of strangers and careful with her words. The two had first connected after Mr Grozev reached out to Mr Navalny on social media platform X, then Twitter. Mr Navalny had survived a poisoning attempt that very nearly took his life. Mr Grozev thought he might have identified the people who had done it.\nAlong with producer Odessa Rae and director Daniel Roher, Mr Grozev had recently left Ukraine after offending too many powerful people. Together, the three wanted to travel to Germany, where Mr Navalny was recuperating, to make a movie about him and his failed assassins.\nThe resulting collaboration, called simply “Navalny,” contained the single greatest scene in the history of documentary filmmaking, an eight-minute sequence in which Mr Navalny, pretending to be an assistant to the head of the Russian secret police, dials one of his failed assassins and gets an unwitting confession out of him. Mr Grozev and Ms Pevchikh are sitting to either side of Mr Navalny, stifling screams of horror mixed with delight.\nWeeks after that phone call, Mr Navalny flew back to Moscow and was immediately arrested. A year after that, “Navalny” was winning major awards and heading for an Oscar, and Mr Grozev and Ms Pevchikh were discussing how to leverage that success to secure Mr Navalny’s release.\nOn that stroll around the reservoir, they came up with a crazy scheme they decided to call Secret Project Silver Lake. They wanted to organise a swap of Russian spies held in Western prisons for Mr Navalny and other Russian political prisoners. When Ms Pevchikh got back to where the team was staying, she searched online for “Glienicke Bridge”, a crossing between what used to be East and West Berlin, the site of several prior prisoner swaps, including one that involved four countries and almost 30 people.\nJames P. Rubin, who was leading a State Department project on Russian disinformation (and who had recently watched “Navalny”), heard about Mr Grozev’s situation and offered a room in his own house.\nMr Grozev moved in and spent the next couple of months explaining Secret Project Silver Lake, which Mr Rubin would eventually take to his boss, Secretary of State Antony Blinken.\nOn Feb 24, 2022, Russia launched a full-scale invasion of Ukraine. Ms Pevchikh and her colleagues were alarmed for Mr Navalny: The FSB had already tried to kill him at least once. Whatever was preventing the Kremlin from having him killed in prison – some remnant of concern for Russia’s standing in the world, some semblance of regard for legitimacy – would be gone now.\n“If they were bombing Kyiv,” she told me, recounting her thoughts at the time, “if they were killing tens of thousands of civilians, then murdering Alexei had gone from being a very big thing to being a very small thing.” Secret Project Silver Lake was more urgent than ever.\nIn the summer of 2022, Ms Pevchikh landed a meeting with Hillary Clinton. Mr Grozev and Ms Pevchikh were impressed – Mrs Clinton was, they thought, the first person who really got it. She warned that a plan like this would take years to pull off, but she took the idea to the White House. President Joe Biden, Mr Blinken and the White House national security adviser, Jake Sullivan eventually came on board.\nThey were not primarily in it for Mr Navalny, however. They were in it for a former Marine named Paul Whelan, who had gone to Moscow in search of adventure and business opportunities and ended up arrested and sentenced to 16 years for what the Russians called espionage.\nIn April 2022, Russia had swapped another former Marine, Trevor Reed (sentenced to nine years for supposedly attacking Moscow police officers), for a Russian pilot the United States had convicted of drug smuggling. In December 2022, Russia traded WNBA player Brittney Griner (sentenced to nine years for bringing a vaping pen with marijuana into the country) for arms dealer Viktor Bout. Mr Whelan, who had been in custody longer than Reed or Griner, fell by the wayside both times.\nTo give up someone accused of espionage, the Russians would need a bigger reward. Someone like Krasikov, a Russian who was serving a life sentence in Germany for carrying out a political assassination in the middle of the day in a Berlin park.\nAmericans had previously gauged German interest in releasing Mr Krasikov in exchange for Mr Whelan. Germany had said no – a rare and painful rejection for the White House, and one that made it all that more unlikely that Secret Project Silver Lake could succeed.\nBut in March 2023, the terrain shifted again.\nRussian authorities arrested Evan Gershkovich, a reporter for The Wall Street Journal, and charged him with espionage.\nFor Secret Project Silver Lake, Mr Gershkovich’s arrest presented an opportunity of sorts – for the White House to approach Germany again. Mr Grozev kept telling any official who would listen that Germany would be more receptive if Mr Navalny, a hero in that country, were also part of the package.\nMr Grozev had another card to play: His own investigative work had played a crucial role in identifying Krasikov as the man who conducted that assassination in the Berlin park. Mr Grozev’s own testimony had helped put him behind bars. If Mr Grozev signalled that he was in favour of the swap – despite the possibility that Krasikov, once released, might retaliate – the Germans might be more willing to consider it.\nMr Rubin summed up the German dilemma as “moral imperative versus moral hazard”. The moral imperative was to save hostages. The moral hazard was the danger of establishing precedent by releasing an assassin, one who had acted brazenly on German soil. Even inside the German Cabinet, there was no agreement.\nThen there was the question of how to conduct the negotiations. Standard diplomatic channels are too inflexible for such a complicated deal. The Russian government is a black box. Everyone knows that President Vladimir Putin personally makes all important decisions, but no one knows who has enough access to him to pose the questions. So Mr Grozev tried to find his own ways in, through Russian intelligence contacts he had developed while attempting to find his would-be assassins.\nBy February 2024, the White House was finally, fully behind the idea of negotiating a deal. An existing channel – already used to execute the Mr Reed and Ms Griner transfers – “on the intelligence side of the house”, in Washington-speak, was activated.\nIt appeared that the Kremlin had agreed to a trade that would involve Mr Gershkovich, Mr Navalny and several other Russian dissidents. Mr Grozev and Ms Pevchikh, in Munich for an annual security conference, were ecstatic. On the evening of Feb 15, they debated whether to buy champagne or hold off until the trade had happened. Out of superstition, they decided to hold off.\nLate that night, Ms Pevchikh suddenly blurted out a terrifying question: “But what if they kill him?”\nThat is silly, Mr Grozev told her. There is a protocol, a way these things are done.\nMs Pevchikh later told me that she had no idea why she even asked what she asked: It wasn’t a fear she was aware of experiencing. The next day, the world learned that Mr Navalny had died in a Russian prison.\nOn Aug 1, a Russian plane carrying 16 people, among them Americans, Germans and Russians, landed in Ankara, Turkey. In exchange, Russia got Krasikov, along with a Russian hacker and a Russian businessperson convicted of insider trading, both of whom had been serving time in the United States, and five convicted or suspected spies, released by the United States, Norway, Poland and Slovenia. Mr Grozev’s investigative work had played a key role in identifying several of the spies.\nThe three Americans posed for a photo with an American flag. They looked as one would expect: happy and emaciated. A neat stack of sandwiches was waiting on what appeared to be a conference table behind them. Then they flew to the United States.\nThe freed dissidents are Ilya Yashin, an opposition politician sentenced to 8.5 years for “spreading false information about the Russian armed forces”; Oleg Orlov, a 71-year-old human-rights activist sentenced to 2.5 years for “discrediting the Russian armed forces”; Aleksandra Skochilenko, an artist sentenced to seven years for “spreading false information”; Andrei Pivovarov, an activist sentenced to four years for being a member of what Russia calls an “undesirable organisation”; Vladimir Kara-Murza, a journalist and political activist who survived two assassination attempts before being sentenced to 25 years for high treason; and three former heads of regional chapters of Mr Navalny’s organisation, all of them sentenced for “extremist activities” – Ksenia Fadeyeva and Vadim Ostanin, who were serving nine years each, and Lilia Chanysheva, who had been sentenced to 9.5 years.\nOne of the people who made it possible was Alexei Navalny. If he had not been arrested, Mr Grozev and Ms Pevchikh would not have concocted Secret Project Silver Lake. If he had not died, the swap would most likely have never happened. Mr Putin would probably never have let him go free. “This should have been such a happy day,” Ms Pevchikh said to me. “But – ” She paused. “This ‘but’ is as big as Earth itself.”\nCompounding Ms Pevchikh’s sense of loss is the fact that three of Mr Navalny’s lawyers and one of his fellow activists who stood trial alongside him – “the only people who had access to Navalny for the last three years of his life”, she said – remain in prison, as do hundreds of others sentenced for journalism, activism and truth-telling. Now that Russia has extracted its agents, the West has less to offer it in exchange for these hostages. Nor is it likely to try, if my conversations with Washington officials involved in this swap are any indication. For them the Russian dissidents were something of an afterthought, an addition forced by Mr Grozev and Ms Pevchikh – and, eventually, by Navalny’s death.\nAnd yet, 16 people have joined the rest of us on this side of the Russian border. Unlike Russia’s spies and assassins, they will never be able to go home again. But at least they can live and speak freely despite the targets on their backs. NYTIMES", "url": "https://www.straitstimes.com/world/navalny-couldn-t-be-freed-until-gershkovich-was-kidnapped-gershkovich-couldn-t-be-freed-until-navalny-was-dead"}