{"authors": [], "date_download": "2024-10-12 13:33:59", "date_modify": "2024-10-12 13:33:59", "date_publish": "2024-09-17 02:48:38", "description": "Both President Joe Biden and V-P Kamala Harris have denounced the apparent assassination bid. Read more at straitstimes.com.", "filename": "world_united-states_trump-blames-biden-and-harris-rhetoric-for-assassination-bids_1728740039.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/US-VOTE-POLITICS-TRUMP-031455.jpg?VersionId=y2VigQo6Ul6BXBlXkEeSXBReOEu3hRci", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_trump-blames-biden-and-harris-rhetoric-for-assassination-bids_1728740039.html", "title": "Trump blames Biden and Harris’ ‘rhetoric’ for assassination attempts", "title_page": "Trump blames Biden and Harris’ ‘rhetoric’ for assassination attempts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WEST PALM BEACH, Florida - Donald Trump on Sept 16 blamed his election rival Kamala Harris and US President Joe Biden after he was targeted in a second apparent assassination attempt, saying their “rhetoric” about him endangering democracy is to blame.\nThe former US president’s rapid politicisation of the Sept 15 incident, in which a man allegedly planned to fire on the Republican while he played golf in Florida, guaranteed that tensions ahead of the presidential election in seven weeks would continue to boil.\nBoth Mr Biden and Ms Harris have denounced the apparent assassination bid.\nThe accused, identified by police as 58-year-old Ryan Wesley Routh, was arrested soon after being spotted hiding with an assault-style rifle at the edge of Trump’s golf course in West Palm Beach. US Secret Service agents opened fire, and he fled before surrendering without a struggle.\nOn Sept 15, Routh appeared in court, where he was informed he was being charged with illegal firearms possession. He appeared calm and did not speak, other than to say “yes” to questions from the judge.\nMore charges are expected at a later date, with the Federal Bureau of Investigation (FBI) probing what it said “appears to be an attempted assassination”.\nAccording to an FBI criminal complaint, Routh seems to have spent nearly 12 hours on the perimeter of the Trump golf course, based on cell phone records.\nOn July 13, Trump was grazed by a bullet in an attack at a Pennsylvania rally, which also saw a supporter in the crowd killed before the lone gunman was shot dead by return fire.\nTrump – who was not hurt in the Sept 15 event – told Fox News Digital that rhetoric from Mr Biden and Ms Harris “is causing me to be shot at, when I am the one who is going to save the country”.\nThe 78-year-old referred to frequent comments that he poses a “threat to democracy”.\nMr Biden and Ms Harris have described the former president as a danger over his refusal to concede defeat to Mr Biden in 2020 and his campaign to classify the mob of his supporters who stormed Congress in 2021 as political dissidents.\nTrump – whose main election message against Ms Harris is built on dark warnings about immigrant “invasion” and claims that the United States is a “failing nation” that only he can save – said his opponents “use highly inflammatory language”.\n“I can use it too – far better than they can – but I don’t,” he added.\nIn a later post on his Truth Social network, Trump said “the bullets are flying, and it will only get worse”, before launching into an attack on immigrants.\nAs a major party candidate and former president, Trump has a sizeable security detail but smaller than that of a sitting president. This meant that on Sept 15, the bodyguards could not cordon off the entire golf course, Palm Beach County Sheriff Ric Bradshaw said, explaining how the accused was able to get to within a few hundred metres of Trump before being intercepted.\nThe would-be attacker has a lengthy criminal record, according to US media, and was obsessed with the Ukrainian cause. He travelled to Ukraine, claiming he wanted to volunteer and was recruiting foreign fighters to help repel Russia’s invasion.\nHowever, there is no evidence that Routh ever fought there or was able to join the Ukrainian military. His social media presence indicates a wide variety of political affiliations at home.\nCondemning “any form of political violence”, United Nations spokesman Stephane Dujarric expressed relief on Sept 16 “that the former president is safe and that law enforcement acted quickly”.\nFear of wider violence\nThe intensity of threats is rising as the US presidential race enters its final weeks, and polls continue to indicate a tight finish on Nov 5.\nThe latest twist follows days of tension in the Ohio town of Springfield as a result of conspiracy theories stoked by Trump and his running mate J.D. Vance about the local Haitian immigrant community.\nSchools and other public institutions have been repeatedly shut down there since Sept 12 after receiving threats.\nThere are also broader worries that Trump will again refuse to concede if he loses to Ms Harris, stoking a repeat of the violence on Jan 6, 2021, when his supporters stormed Congress to try to stop certification of Mr Biden’s victory two months earlier.\nTrump used the Sept 15 incident to appeal for campaign funds, posting on social media a day later: “FIGHT, FIGHT, FIGHT!!!!!” and “Donate Today!” AFP", "url": "https://www.straitstimes.com/world/united-states/trump-blames-biden-and-harris-rhetoric-for-assassination-bids"}