{"authors": [], "date_download": "2024-10-12 14:06:59", "date_modify": "2024-10-12 14:06:59", "date_publish": "2022-03-31 21:51:47", "description": "The war has created a \"new sense of urgency\" among member states, the Nato chief said. Read more at straitstimes.com.", "filename": "world_europe_ukraine-war-spurring-nato-allies-to-spend-more-stoltenberg_1728742019.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/31/ads-natoallies-31032022.jpg?VersionId=uXVl..6iaLO39LLOP6Wnzx0_VpUYsdzk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-war-spurring-nato-allies-to-spend-more-stoltenberg_1728742019.html", "title": "Ukraine war spurring Nato allies to spend more: Stoltenberg", "title_page": "Ukraine war spurring Nato allies to spend more: Stoltenberg | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS (AFP) - Russia's invasion of Ukraine has created a \"new sense of urgency\" among Nato member states to boost defence spending, the alliance's chief Jen Stoltenberg said on Thursday (March 31) as he unveiled the organisation's 2021 report.\nThe report itself - covering expenditures before Russia launched its war in February this year - showed just eight of Nato's 30 member nations were meeting a target of spending 2 per cent of gross domestic product on defence.\nAs usual, the United States - by far the biggest military power in Nato - led spending, with 3.6 per cent, around the same level as Greece.\nThe other six countries to exceed the 2 per cent \"guideline\" were: Poland, Britain, Croatia, Estonia, Latvia and Lithuania.\nThat was a smaller cohort than in 2020, when 11 Nato countries met the 2 per cent target.\nBut Mr Stoltenberg said the war in Ukraine had brought \"a new security reality\" and allies were stepping up to it.\nHe pointed to the announcement by Germany just days after the Feb 24 invasion that it was going to plough €100 billion (S$150 billion) into its dilapidated military and surpass the 2 per cent defence spending goal.\nHe also highlighted similar pledges by Denmark, Poland and Romania to meet the target.\n\"Together, this makes a huge difference,\" he said.\nMr Stoltenberg acknowledged that governments had to juggle spending priorities between defence, health, education and infrastructure.\nBut, he said, \"at the same time when we see a new security reality, when we see the aggressive actions of Russia against Ukraine, then we all realise the need to invest in our security\".\nMr Stoltenberg said the upped spending pledges would inform a Madrid summit of Nato leaders in June, which is to chart out a new defence posture for the alliance, especially geared to the demonstrated threat from Russia.\n\"I think what you're seeing is that there's a need to invest more in air defence, there's a need to invest more in higher readiness, to also have more ammunition, more and more ability to sustain operations for a longer period of time, and high-end capabilities,\" he said.", "url": "https://www.straitstimes.com/world/europe/ukraine-war-spurring-nato-allies-to-spend-more-stoltenberg"}