{"authors": [], "date_download": "2024-10-12 14:16:23", "date_modify": "2024-10-12 14:16:23", "date_publish": "2022-03-16 03:07:24", "description": "Biden will also attend an EU summit in Brussels to discuss Russia's invasion of Ukraine. Read more at straitstimes.com.", "filename": "world_europe_biden-to-assert-iron-clad-commitment-on-nato-trip_1728742583.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/16/US-PRESIDENT-BIDEN-SPEAKS-AT-NATIONAL-LEAGUE-OF-CITIES_-CONGRESS-194431.jpg?VersionId=bYj.Mo5iuCuNMDIVD_I_vqDoOlPVBn55", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_biden-to-assert-iron-clad-commitment-on-nato-trip_1728742583.html", "title": "Biden to assert 'iron-clad commitment' on Nato trip", "title_page": "Biden to assert 'iron-clad commitment' on Nato trip | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (AFP) - US President Joe Biden will use a trip to an emergency Nato summit next week to demonstrate Washington's \"iron-clad\" backing for its allies, the White House said on Tuesday (March 15).\nBiden will also attend an EU summit in Brussels to discuss Russia's invasion of Ukraine and Western efforts to impose \"economic costs on Russia (and) provide humanitarian support to those affected by the violence,\" Press Secretary Jen Psaki told reporters.\nAt the March 24 Nato summit - also in Brussels - Biden will \"reaffirm our iron-clad commitment to our Nato allies,\" she said.\nPsaki did not rule out Biden adding stops to his European trip, amid speculation that he could meet with some of the three million refugees who have now fled Ukraine.\nShe said his \"real focus right now is to meet with Nato partners in Brussels. If there are additional steps, we'll share all those details.\"\nAddressing a key Russian concern used to justify the invasion, Ukrainian President Volodymyr Zelensky said earlier on Tuesday that Ukraine should accept that it would not become a member of Nato.\nIf Russian forces attack a Nato country, all members of the transatlantic alliance, including the United States, are obligated to come to its aid militarily.\nBolstered Nato forces\nThe emergency Nato summit \"will address Russia's invasion of Ukraine, our strong support for Ukraine, and further strengthening Nato's deterrence and defence,\" Nato Secretary-General Jens Stoltenberg said in a tweet.\n\"At this critical time, North America and Europe must continue to stand together.\" Stoltenberg also said Tuesday that Nato was worried Russia is gearing up to carry out a chemical attack in Ukraine.\n\"We are concerned that Moscow could stage a false flag operation possibly including chemical weapons,\" the Nato chief told reporters, citing \"absurd claims\" from Russia that Ukraine possesses biological weapons labs.\nNato, he said, remains \"very vigilant\" on that risk and stressed that Russia would have \"a high price to pay\" if it carried out such a \"violation of international law.\"", "url": "https://www.straitstimes.com/world/europe/biden-to-assert-iron-clad-commitment-on-nato-trip"}