{"authors": [], "date_download": "2024-10-12 13:35:06", "date_modify": "2024-10-12 13:35:06", "date_publish": "2024-02-19 19:59:27", "description": "Israel has imposed restrictions in the past, saying that doing so prevents violence. Read more at straitstimes.com.", "filename": "world_middle-east_israel-to-set-security-limits-on-ramadan-prayers-at-jerusalems-al-aqsa-netanyahu-says_1728740106.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/19/LYNXNPEK1I09O-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israel-to-set-security-limits-on-ramadan-prayers-at-jerusalems-al-aqsa-netanyahu-says_1728740106.html", "title": "Israel to set security limits on Ramadan prayers at Jerusalem’s Al-Aqsa Mosque", "title_page": "Israel to set security limits on Ramadan prayers at Jerusalem’s Al-Aqsa Mosque | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - Israel will allow Ramadan prayers at Jerusalem's Al-Aqsa Mosque during the upcoming holy month but limits will be set according to security needs, Prime Minister Benjamin Netanyahu's office said on Feb 19.\nThe Hamas militant group, Israel's main enemy in the Gaza war, denounced the proposed restrictions and the top Palestinian Islamic council called on all Muslims to visit Al Aqsa regardless.\nThe mosque, one of the holiest sites in the world for Muslims, sits on a hilltop in Jerusalem's Old City in a compound also revered by Jews as the site of their temples of biblical times.\nRules about access to the site have been a frequent source of friction, particularly during holidays including Ramadan, which begins this year on or around March 10. Israel has imposed restrictions in the past – usually keeping out younger worshippers – saying that doing so prevents violence.\nAsked about the possibility of blocking access for Israeli Muslims to Al-Aqsa, Mr Netanyahu's office said: \"The Prime Minister made a balanced decision to allow freedom of worship within the security needs determined by professionals.\"\nIt gave no further details.\nMr Netanyahu is under pressure from both far-right partners in his coalition who want tougher curbs and countries in the region pushing to keep the status quo.\nNational Security Minister Itamar Ben-Gvir, who heads a hardline party in the government, said that those who hate Israel would use the event to show support for the Hamas leadership and incite violence.\n\"The entry of tens of thousands of haters in a victory celebration on the Temple Mount is a security threat to Israel,\" Mr Ben-Gvir said.\nThe Supreme Fatwa Council, the top Palestinian Islamic assembly, called on \"everyone who can reach the blessed Al-Aqsa Mosque to travel to it and protect it\".\nHamas said that Palestinians should \"reject this criminal decision, resist the occupation’s arrogance and insolence, and mobilise to stand firm and steadfast in Al-Aqsa Mosque.\"\nIn April 2023, Israeli police clashed with Palestinians at the mosque during Ramadan. There was also violent unrest at the site in 2021 and 2022. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/israel-to-set-security-limits-on-ramadan-prayers-at-jerusalems-al-aqsa-netanyahu-says"}