{"authors": [], "date_download": "2024-10-12 13:55:54", "date_modify": "2024-10-12 13:55:54", "date_publish": "2023-12-23 02:55:53", "description": "Cuba now one of a handful of countries that allow the practice, which some equate with murder. Read more at straitstimes.com.", "filename": "world_cuba-quietly-authorizes-euthanasia_1728741354.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/23/LYNXMPEJBL0IR-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_cuba-quietly-authorizes-euthanasia_1728741354.html", "title": "Cuba quietly authorises euthanasia", "title_page": "Cuba quietly authorises euthanasia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HAVANA – Cuba on Dec 22 became the second country in Latin America and the Caribbean to authorise euthanasia, following Colombia.\nThe communist-run country’s National Assembly passed the measure as part of legislation updating the nation’s legal framework for its universal and free healthcare system.\n“The right of people to a dignified death is recognised in end-of-life decisions, which may include the limitation of therapeutic effort, continuous or palliative care, and valid procedures that end life,” the final draft of the legislation stated.\nEuthanasia and medically assisted suicide, opposed by most religions, spark huge controversy around the world, with just a handful of countries allowing the practices and some equating them with murder.\nThe Cuban Roman Catholic Church was not immediately available for comment.\nAt Havana’s Institute of Oncology and Radiobiology, the country’s leading cancer centre, Dr Alberto Roque, who has a master’s in bioethics, welcomed the measure and said it established the “legal framework for future euthanasia in any of its forms, that is, active euthanasia or assisted suicide”.\nThere was barely a mention in Cuba’s state-run media that the government would approve the practice, and no public debate, though Dr Roque said that would change as rules were drawn up.\nOutside the cancer institute, 47-year-old nurse Suaima Lopez, who has rectal cancer, said she favoured euthanasia in case she or other patients did not recover.\n“Families want to keep loved ones alive until the very, very last moment but one has to think of those suffering,” Ms Lopez said.\n“If only we could have a dignified death... at a certain moment when nothing can be done any more... Let me die peacefully, in peace and harmony.”\nSwitzerland, the Netherlands, Luxembourg, Canada, Australia, Spain, Germany, New Zealand and some states in the United States also allow medically assisted suicide. REUTERS", "url": "https://www.straitstimes.com/world/cuba-quietly-authorizes-euthanasia"}