{"authors": [], "date_download": "2024-10-12 14:06:39", "date_modify": "2024-10-12 14:06:39", "date_publish": "2022-09-22 01:14:54", "description": "People were arrested at rallies in 38 different cities across the country. Read more at straitstimes.com.", "filename": "world_europe_more-than-1300-arrests-in-russia-anti-mobilisation-protests-ngo_1728741999.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/22/2022-09-21T170835Z_1423769662_RC2SLW90LG0Q_RTRMADP_3_UKRAINE-CRISIS-MOBILISATION-PROTESTS.JPG?VersionId=ojaWJWL2IAIRJuAujlaalBj6q58YC_7m", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_more-than-1300-arrests-in-russia-anti-mobilisation-protests-ngo_1728741999.html", "title": "More than 1,300 arrests in Russia anti-mobilisation protests: NGO", "title_page": "More than 1,300 arrests in Russia anti-mobilisation protests: NGO | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - More than 1,300 people have been arrested at demonstrations across Russia against President Vladimir Putin’s announcement of a partial mobilisation of civilians to fight in Ukraine, a police monitoring group said on Wednesday.\nThe independent OVD-Info protest monitoring group said that according to information it had collated from 38 Russian cities, more than 1,311 people had been held by late evening.\nIt said those figures included at least 502 in Moscow and 524 in St Petersburg, Russia’s second most populous city.\nThe protests were the largest in Russia since demonstrations that broke out following the announcement of Moscow’s military intervention in Ukraine in February.\nAFP journalists in the centre of the Russian capital Moscow said at least 50 people were detained by police wearing anti-riot gear on a main shopping street.\nIn Russia’s former imperial capital, Saint Petersburg, AFP reporters saw police surround small a group of protesters and detain them one-by-one, loading them onto a bus.\nProtesters were chanting “No mobilisation!”\n“Everyone is scared. I am for peace and I don’t want to have to shoot. But coming out now is very dangerous, otherwise there would be many more people,” said protester Vasily Fedorov, a student wearing a pacifist symbol on his chest.\n“I came out to the rally planning to participate, but it looks like they’ve already arrested everyone. This regime has condemned itself and is destroying its youth,” said Alexei, a 60-year-old resident who declined to give his last name.\n“Why are you serving Putin, a man who’s been in power for 20 years!” a young protester shouted at one policeman.\n“I came to say that I am against war and mobilisation,” Oksana Sidorenko, a student, told AFP.\n“Why are they deciding my future for me? I’m scared for myself, for my brother,” she added.\nAlina Skvortsova, 20, said she hoped Russians would soon understand the nature of the Kremlin’s offensive in neighbouring Ukraine.\n“As soon as they really understand, they will come out on to the street, despite the fear,” she said.", "url": "https://www.straitstimes.com/world/europe/more-than-1300-arrests-in-russia-anti-mobilisation-protests-ngo"}