{"authors": [], "date_download": "2024-10-12 14:01:22", "date_modify": "2024-10-12 14:01:22", "date_publish": "2024-04-19 14:21:02", "description": "The downing of a Russian bomber used to fire cruise missiles at Ukraine would be a symbolic win for Kyiv. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-russian-strikes-on-dnipropetrovsk-region-kill-at-least-8_1728741682.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/19/LYNXNPEK3I064-1.jpg?VersionId=fxYa9X60TWXfuNnqdj8iVFiTROEtSs3r", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-russian-strikes-on-dnipropetrovsk-region-kill-at-least-8_1728741682.html", "title": "Eight killed in Russian strikes as Ukraine downs bomber", "title_page": "Eight killed in Russian strikes as Ukraine downs bomber | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Russian strikes against Ukraine on April 19 killed at least eight people, including two children, as Kyiv said that it shot down a Russian strategic bomber for the first time.\nMoscow said a military plane had crashed in Russian territory while returning to base from a combat mission after suffering a technical malfunction.\nThe downing of a Russian bomber used to fire cruise missiles would be a highly symbolic win for Ukraine, which has been pounded by hundreds of Russian aerial strikes since Moscow invaded more than two years ago.\nThe latest overnight Russian strikes on the eastern Dnipropetrovsk region left more death and destruction, officials said.\n“A horrific Russian air strike on the Dnipropetrovsk region this morning,” Ukraine’s Foreign Minister Dmytro Kuleba said in a post on X, formerly Twitter.\n“Two children are among those killed. A 14-year-old girl and an eight-year-old boy.”\nHead of the region Sergiy Lysak said medics had been able to save a six-year-old boy previously reported killed, revising down an earlier toll of nine dead.\nTwelve people were reported injured.\nLife-saving air defence\nThe strikes – which hit the region’s Synelnykivsky area and the regional capital of Dnipro – triggered fresh outrage in Kyiv.\n“Children must not be killed in air strikes in modern Europe. We must protect them with a reliable air shield,” Mr Kuleba said.\nUkraine’s railway operator said train facilities were hit in the attack and that seven employees were among those wounded. A female member of staff was killed, they added.\nPresident Volodymyr Zelensky, in response to the strike, repeated calls for Ukraine’s Western allies to supply the country with more air defence systems.\n“Every country that provides air defence systems to Ukraine, every leader who helps persuade our partners that air defence systems should not be stored in warehouses but deployed in real cities and communities facing terror, and everyone who supports our defence is a lifesaver,” Mr Zelensky said.\nThe President also announced that he had visited troops and inspected fortifications in the eastern Donetsk region. Russian forces have taken advantage of Ukraine’s manpower and ammunition shortages and steadily gained ground in the region.\nIn Washington, the US House of Representatives is gearing up for a crucial weekend vote on a long-stalled US$61 billion (S$83 billion) package of military aid that could deliver much-needed weapons to Ukrainian soldiers struggling on the front lines.\nThe downed long-range strategic bomber was a Tu-22M3, the main intelligence directorate of Ukraine’s Defence Ministry said.\nShot down\nRussian officials said the plane crashed over the southern Stavropol region.\nThey said the pilots ejected but that at least one member of the crew had died.\n“According to preliminary data, the cause of the accident was a technical malfunction,” state news agencies quoted the Defence Ministry as saying.\nThe governor of Stavropol, Mr Vladimir Vladimirov, said two crew members had been taken to a local medical centre.\n“The search for the fourth pilot is continuing,” he added, posting photos of the burnt-out and mangled plane fuselage in a field.\nThe plane crashed in the region’s Krasnogvardeysky district, the governor said – around 400km from the eastern edge of the annexed Crimean peninsula.\nThe Ukraine intelligence directorate said the plane “was shot down at a distance of about 300 kilometres from Ukraine. As a result of the hit, the bomber was able to fly to the Stavropol area, where it crashed”.\nUkraine’s air force said Russia had launched 22 missiles and 14 Iranian-designed attack drones overnight – including from the downed strategic bomber.\nIt said all the unmanned aerial vehicles were downed as well as 15 missiles.\nRussian strikes have pummelled towns and cities across Ukraine since Moscow’s invasion more than two years ago.\nA missile attack on the northern city of Chernigiv left 18 dead earlier this week. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-says-russian-strikes-on-dnipropetrovsk-region-kill-at-least-8"}