{"authors": [], "date_download": "2024-10-12 14:00:45", "date_modify": "2024-10-12 14:00:45", "date_publish": "2023-12-26 15:26:50", "description": "Ukraine said its air force destroyed the Novocherkassk landing ship in occupied Crimea. Read more at straitstimes.com.", "filename": "world_ukraine-claims-destruction-of-major-russian-navy-vessel-in-crimea_1728741645.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/26/CRIMEA-UKRAINE-RUSSIA-CONFLICT-132646.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_ukraine-claims-destruction-of-major-russian-navy-vessel-in-crimea_1728741645.html", "title": "Kremlin confirms Russian warship hit by Ukrainian strike", "title_page": "Kremlin confirms Russian warship hit by Ukrainian strike | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - The Kremlin on Dec 26 acknowledged a Ukrainian attack had damaged a warship in the occupied Crimean port of Feodosia in what Ukraine and its Western allies called a major setback for the Russian navy.\nUkraine said its air force destroyed the Novocherkassk landing ship, with President Volodymyr Zelensky joking on social media that the vessel had now joined “the Russian underwater Black Sea fleet”.\nRussian Defence Minister Sergei Shoigu informed “about the damage to our large landing ship” to President Vladimir Putin in “a very detailed report”, the president’s spokesman Dmitry Peskov told journalists.\nUkraine’s military said earlier that its air force had destroyed the Russian naval ship in a missile attack on the eastern Crimean port.\nThe Ukrainian defence ministry wrote on X that the “Novocherkassk landing ship was destroyed in Feodosia tonight”.\nIt published an unattributed photo showing flames and smoke in a port at night.\n“Ukraine’s aviation did an excellent job. Crimea is Ukraine. There is no place for the occupier’s fleet here,” the ministry wrote.\nIn his post on social media, Mr Zelensky wrote: “The occupiers will not have a single peaceful place in Ukraine”.\nThe attack comes after Ukraine struck the Black Sea fleet’s headquarters in Sevastopol in September, forcing Moscow to move warships to ports further east.\nBritish defence minister Grant Shapps wrote on Twitter that “this latest destruction of Putin’s navy demonstrates that those who believe there’s a stalemate in the Ukraine war are wrong!”\n“Russia’s dominance in the Black Sea is now challenged,” he added.\nShip ‘transported Shaheds’\nUkraine’s air force said that its tactical aviation attacked the Novocherkassk with cruise missiles at around 0030 GMT (8.30am Singapore time) in the area of Feodosia.\nVideos posted on social media showed a fire on the horizon in a port area, followed by a loud explosion and a much larger burst of flames and smoke.", "url": "https://www.straitstimes.com/world/ukraine-claims-destruction-of-major-russian-navy-vessel-in-crimea"}