{"authors": [], "date_download": "2024-10-12 14:03:52", "date_modify": "2024-10-12 14:03:52", "date_publish": "2022-11-23 07:21:26", "description": "The strike came just days after Moscow said it was strengthening its position on the Crimean peninsula. Read more at straitstimes.com.", "filename": "world_europe_moscow-says-on-alert-after-crimea-hit-by-drone-attack_1728741832.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/23/UKRAINE-FRONT-3_0.JPG?VersionId=8tOFNy58oHdCrnkmZ8kyruWwq_FnXYCh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_moscow-says-on-alert-after-crimea-hit-by-drone-attack_1728741832.html", "title": "Moscow says on alert after Crimea hit by 'drone attack'", "title_page": "Moscow says on alert after Crimea hit by 'drone attack' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine’s Russian-annexed Crimean peninsula was targeted by a drone attack on Tuesday, Kremlin-installed authorities said, adding that Moscow’s forces there were “on alert”.\nThe strike came as Kyiv claimed another territorial victory and just days after Moscow said it was strengthening its position on the Crimean peninsula.\n“There is an attack with drones,” the governor of the Sevastopol administrative region in Crimea, Mr Mikhail Razvozhayev, said on Telegram. “Our air defence forces are working right now.”\nHe said two drones had “already been shot down”.\nMr Razvozhayev said no civilian infrastructure had been damaged and called on residents to remain calm.\nMoscow annexed Crimea in 2014 after nationwide pro-democracy demonstrations that led to the ouster of Ukraine’s Kremlin-friendly president.\nIt used the peninsula, which hosts several important Russian military bases, as a launching pad for its February invasion of Ukraine.\nBut in recent months, Ukrainian forces have been pushing a counter-offensive in the south towards Crimea and earlier in November reclaimed Kherson, the capital of the region bordering the annexed peninsula.\nThere have been several explosions at or near Russian military installations in Crimea since February, including a coordinated drone attack on a key Russian naval port at Sevastopol in October.\nLast week, the Moscow-aligned governor of the territory, Mr Sergei Aksyonov, said the authorities were strengthening positions on the peninsula.\n“Fortification work is being carried out...with the aim of guaranteeing the security of all Crimeans,” he said.\nUkraine said on Tuesday that it had recaptured almost the entire region of an isolated peninsula off the Black Sea, where fighting is ongoing.\n“We are restoring full control over the region. We have three settlements left on the Kinburn Split to officially no longer be a region at war,” said Mykolaiv regional governor Vitaly Kim on social media.\nThe southern split jutting into the Black Sea is divided in two: in the west, as part of the Mykolaiv region and to the east as part of the Kherson region.\nIt is cut off from territory controlled by Ukraine’s forces by the Dnipro river, which flows through the Kherson region.\nUkraine’s Foreign Minister Dmytro Kuleba told the European Union in an online media conference that its support was crucial, warning against “fatigue” towards the war.\n“If we Ukrainians are not tired, the rest of Europe has neither moral nor political right to be tired,” he said.\nMr Kuleba called on the EU to implement a fresh round of sanctions against Russia, urging particular attention to measures that slow down and stop Russia’s missile industry.\n“I call on my colleagues in the EU...to put aside any doubts or, as the fashionable phrase goes, ‘fatigue’ and to start and quickly conclude the ninth sanctions package,” he said.\nThe US government said on Tuesday it would provide another US$4.5 billion (S$6.2 billion) in financial backing for “supporting core government services”.\nAs much of Ukraine’s energy grid is pounded by Russian strikes, the World Bank has warned that the country faces severe energy supply disruption amid frigid weather.\n“The Kremlin wants to transform the cold this winter into a weapon of mass destruction,” Ukraine President Volodymyr Zelensky told a meeting of French mayors in a video message.\nMeanwhile, Russian energy giant Gazprom accused Ukraine of diverting natural gas supplies transiting to Moldova, and threatened to curtail deliveries through a key pipeline to Europe in response.\nThe allegations marked the latest point of tension over energy deliveries between Kyiv, European capitals and Moscow – which has reduced consignments to Europe in response to Western sanctions over the conflict.\nUkraine denied the allegations, saying that all the gas bound for Moldovan consumers had been transferred in full. AFP", "url": "https://www.straitstimes.com/world/europe/moscow-says-on-alert-after-crimea-hit-by-drone-attack"}