{"authors": [], "date_download": "2024-10-12 14:17:59", "date_modify": "2024-10-12 14:17:59", "date_publish": "2024-04-17 04:32:32", "description": "Here are details about existing measures against Iran and what the US might do next. Read more at straitstimes.com.", "filename": "world_middle-east_explainer-what-are-us-sanctions-on-iran-how-can-washington-impose-more_1728742679.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/17/LYNXNPEK3F0TY-1.jpg?VersionId=fQzkmsZV_UnKw.Nt9_kQkh.MIDq0CNU1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_explainer-what-are-us-sanctions-on-iran-how-can-washington-impose-more_1728742679.html", "title": "Explainer: What are US sanctions on Iran? How can Washington impose more?", "title_page": "Explainer: What are US sanctions on Iran? How can Washington impose more? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The United States has warned it will impose new sanctions on Iran following its unprecedented attack on Israel.\nUS Treasury Secretary Janet Yellen on April 16 said new sanctions on Tehran – which could be focused on reducing the country’s capacity to export oil – would come within days. Congressional Republicans are also considering a series of Bills on Iran.\nHere are details about existing measures against Iran and what the US might do next:\nWhat is the scope of existing US sanctions on Iran?\nWashington’s sanctions on Iran already ban nearly all US trade with the country, block the government’s assets in the US and prohibit US foreign assistance and arms sales, according to the US Congressional Research Service (CRS).\nThousands of people and companies, both Iranian and foreign, have been targeted under the sanctions programme as Washington has sought to constrain Iran’s government and change its behaviour, the CRS said in a report in 2023.\nUS concerns have included Iran’s nuclear programme, human rights abuses and its support for groups the US sees as terrorists.\n“US sanctions on Iran are arguably the most extensive and comprehensive set of sanctions that the United States maintains on any country,” the CRS said.\nWhat more can the US do?\nMr Peter Harrell, a former National Security Council official, said US options for further sanctions include targeting the flow of Iranian oil and playing a more aggressive game of Whac-A-Mole to go after Iran’s front companies and financiers.\nOne of the most significant moves would be for Washington to get the European Union and other Western allies to impose multilateral sanctions on Tehran, he said, as most of the sanctions in place against Iran currently are US measures.\nFormer president Donald Trump reinstated US sanctions that were eased under an international deal on Tehran’s nuclear programme when he withdrew in 2018.\n“We have to be realistic that from a US perspective, while there are always more sanctions you can impose, we are in a world of diminishing actual economic pressure because we have so many sanctions already in place,” Mr Harrell said.\nWhat is congress considering?\nHouse Republican leaders have accused President Joe Biden of failing to enforce existing measures, and said they would take up a series of Bills to sharpen sanctions on Iran.\nAmong them is legislation that would increase congressional oversight of sanctions waivers, tighten restrictions on the export of US goods and technology to Iran, and require the administration to ensure humanitarian exemptions to the sanctions do not facilitate acts of terrorism or the proliferation of weapons of mass destruction.\nThere was no immediate indication of when, if ever, any of the measures would become law, which would require passage by the Democratic-led Senate and the signature of Democratic President Joe Biden.\nThe House late on April 15 overwhelmingly passed a Bill called the Iran-China Energy Sanctions Act, which would expand sanctions on Iran by requiring annual reports to determine whether Chinese financial institutions have participated in transactions on Iranian oil. It would ban US financial institutions from having accounts for any Chinese entities that engage in those deals.\nThe Bill faces an uncertain future in the Senate.\nThe Democratic-led Senate may consider its own legislation. The Senate Foreign Relations Committee passed a Bill on April 15 that would impose measures on foreign ports and refineries that process oil exported from Iran in violation of US sanctions, after a companion Bill passed in 2023 in the House.\nThe Biden administration has imposed sanctions on hundreds of people and entities in Iran-related action since 2021.", "url": "https://www.straitstimes.com/world/middle-east/explainer-what-are-us-sanctions-on-iran-how-can-washington-impose-more"}