{"authors": [], "date_download": "2024-10-12 13:38:30", "date_modify": "2024-10-12 13:38:30", "date_publish": "2024-08-20 02:46:59", "description": "Ukrainian forces now control more than 1,250 sq km and 92 settlements in Russia's Kursk region. Read more at straitstimes.com.", "filename": "world_zelenskiy-if-ukraine-could-strike-deep-in-russia-no-need-for-kursk-incursion__gl=1_gl0ph__gcl_au_MTQ1NjEwODM2LjE3MjMwNDE3MzI_1728740310.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/LYNXMPEK7I0J9-1.jpg?VersionId=w_NicPRXDMsi5AeAlyawQ_8coxguCV7e", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_zelenskiy-if-ukraine-could-strike-deep-in-russia-no-need-for-kursk-incursion__gl=1_gl0ph__gcl_au_MTQ1NjEwODM2LjE3MjMwNDE3MzI_1728740310.html", "title": "Kursk attack shows Moscow red lines are a bluff, says Zelensky, pressing for deep strikes into Russia", "title_page": "Kursk attack shows Moscow red lines are a bluff, says Zelensky, pressing for deep strikes into Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV -Ukrainian President Volodymyr Zelensky said on Aug 19 that his country’s assault on Russia’s Kursk region showed that Kremlin threats of retaliation were a bluff, and he urged Kyiv’s allies to loosen curbs on using foreign-supplied weapons.\nMr Zelensky said Ukrainian forces now controlled more than 1,250 sq km and 92 settlements in the Kursk region, while Russia said Ukraine had struck a third bridge in the region, complicating Russian efforts to repel the Ukrainian attack.\nUkraine launched its surprise strike on the Russian region on Aug 6, the biggest invasion of Russia since World War II, in an operation that Kyiv says is aimed at carving out a buffer zone and wearing down Russia’s war machine.\nSpeaking to a gathering of Ukrainian diplomats, Mr Zelensky singled out allies who have supplied long-range weapons but told Kyiv they cannot use them deep inside Russia for fear of crossing “red lines” set out by Russian President Vladimir Putin.\n“We are witnessing a significant ideological shift – the naive, illusory concept of so-called red lines regarding Russia, which dominated the assessment of the war by some partners, has crumbled apart these days,” Mr Zelensky said.\nHe said Ukraine, because of the restrictions imposed by allies, could not use the weapons at its disposal to hit some Russian military targets. He urged allies to be bolder in their decisions about how to help Kyiv in the war.\n“The world sees that everything in this war depends only on courage - our courage, the courage of our partners. On brave decisions for Ukraine, on courage in supporting Ukraine,” Mr Zelensky said.\nDespite its thrust into Russia, Ukraine’s forces are on the defensive elsewhere. They face a battle to protect the strategic eastern city of Pokrovsk, where Russia has steadily advanced in recent weeks in heavy fighting more than two years since Russia’s full-scale invasion.\nUkraine’s military said late on Aug 19 its forces had fought 63 skirmishes over the course of the day against Russian forces on the Pokrovsk front, and it expected that area to remain the focus of Russian attacks.\nRussia said a third bridge had been struck and damaged on the Seym River that winds through the Kursk region bordering northeastern Ukraine.\nUkraine has not yet commented on the strike, but Kyiv’s air force chief has said his forces have destroyed two bridges to weaken enemy logistics.\nMilitary analysts said the bridges were part of critical supply lines for Russian troops defending the area. Reuters could not independently confirm the damage to the bridges or the battlefield situation in Kursk.\nMr Zelensky said on Aug 18 his troops were unleashing what he described as “maximum counteroffensive actions” aimed at creating a buffer zone and hurting Moscow’s military potential.\nMore than 121,000 people have been evacuated from nine border districts in the Kursk region, Russia’s emergencies ministry said.\nRussian presidential aide Yuri Ushakov said Moscow was not ready to hold peace talks with Ukraine for now, given Kyiv’s Kursk attack. Ukraine has demanded a full withdrawal of Russian troops from its territory before it sits down for any talks.\nPokrovsk push\nUkrainian forces face a tough battle near Pokrovsk, a transport hub for Ukrainian forces. Russian troops are now around 10km from the outskirts of the city, said Mr Serhiy Dobriak, head of the local military administration.\nHe said up to 600 people were leaving on a daily basis, and that municipal services could be cut off within a week as Russian forces close in.\nRegional governor Vadym Filashkin said a curfew in settlements close to Pokrovsk had been tightened and the situation was “very difficult”.\nUkraine’s top general said Kyiv was also “doing everything necessary” to defend the eastern city of Toretsk as Moscow tries to threaten Ukrainian supply lines. Russia said its forces had captured the nearby town of Zalizne.\nThe war, which has killed tens of thousands and devastated cities across Ukraine, shows no sign of letting up. Kyiv expects Moscow to boost its forces in Ukraine by year’s end to 800,000, up from around 600,000 now, Ukrainian Deputy Defence Minister Ivan Havryliuk told Ukrainian media.\nUkraine has been backed by arms from its allies but is worried that support may drop as the war grinds on.\nGerman defence stocks fell on Aug 19 after a newspaper said the finance ministry would not approve additional applications for Ukraine military aid because of budget constraints.\nA German finance ministry spokesperson later said Berlin was working intensively with its Group of Seven partners on a plan to make loans available for military support for Ukraine, funded by the proceeds of frozen Russian assets. REUTERS", "url": "https://www.straitstimes.com/world/zelenskiy-if-ukraine-could-strike-deep-in-russia-no-need-for-kursk-incursion?_gl=1*gl0ph*_gcl_au*MTQ1NjEwODM2LjE3MjMwNDE3MzI."}