{"authors": [], "date_download": "2024-10-12 14:02:57", "date_modify": "2024-10-12 14:02:57", "date_publish": "2023-04-29 22:40:00", "description": "A Ukrainian official described the blast as “God’s punishment” for a Russian strike on a Ukrainian city on Friday. Read more at straitstimes.com.", "filename": "world_europe_fire-breaks-out-at-crimea-fuel-depot-after-drone-strike-ukraine-says-more-than-10-oil-tanks-damaged_1728741777.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/30/10598084.jpg?VersionId=ZtoQ2ebnyfm4JRQID8b_RlhBwJcrSVN2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_fire-breaks-out-at-crimea-fuel-depot-after-drone-strike-ukraine-says-more-than-10-oil-tanks-damaged_1728741777.html", "title": "Fire breaks out at Crimea fuel depot after drone strike; Ukraine says over 10 oil tanks damaged", "title_page": "Fire breaks out at Crimea fuel depot after drone strike; Ukraine says over 10 oil tanks damaged | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - An apparent drone strike started a fire at a fuel storage facility in the Crimean port city of Sevastopol on Saturday, the Moscow-installed governor there said.\nThe fire was fully extinguished and no one was injured.\nA Ukrainian military intelligence official said more than 10 tanks of oil products with capacity of around 40,000 tonnes were destroyed, RBC Ukraine reported.\nThe official, Mr Andriy Yusov, did not claim Ukraine was responsible for the explosion in comments reported by RBC.\nHe instead described the blast as “God’s punishment” for a Russian strike on a Ukrainian city on Friday.\nA spokesman for Ukraine’s armed forces said earlier he did not have any information to suggest Ukraine was responsible for the fire.\nMr Sergei Aksyonov, the Russian-appointed head of Crimea, said on Telegram that air defence and electronic warfare forces on Saturday shot down two drones over the Crimean peninsula.\n“There are no casualties or destruction,” he said.\nThe governor of Sevastapol, Mr Mikhail Razvozhaev, said experts had examined the site and “it became clear that only one drone was able to reach the oil reservoir”.\nAnother drone was downed, its wreckage found on the shore near the terminal, he added on the Telegram messaging app.\nSevastopol, on the Crimean peninsula that Russia annexed from Ukraine in 2014, has come under repeated air attacks since Russia invaded the country as a whole in February 2022.\nRussian officials have blamed the attacks on Ukraine. AFP, REUTERS", "url": "https://www.straitstimes.com/world/europe/fire-breaks-out-at-crimea-fuel-depot-after-drone-strike-ukraine-says-more-than-10-oil-tanks-damaged"}