{"authors": [], "date_download": "2024-10-12 13:35:37", "date_modify": "2024-10-12 13:35:37", "date_publish": "2024-07-25 18:11:08", "description": "WASHINGTON - The first time President Joe Biden's administration considered ordering the U.S. military to build a floating pier off Gaza to deliver aid in late 2023, it was put on the backburner. Read more at straitstimes.com.", "filename": "world_middle-east_how-biden-s-gaza-pier-project-unraveled_1728740137.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/25/LYNXMPEK6O0DL-1.jpg?VersionId=Y0CBs9gA2WV6_u7FoxoOkY4AnziP.aBl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_how-biden-s-gaza-pier-project-unraveled_1728740137.html", "title": "How Biden’s Gaza pier project unraveled", "title_page": "How Biden’s Gaza pier project unraveled | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The first time President Joe Biden's administration considered ordering the U.S. military to build a floating pier off Gaza to deliver aid in late 2023, it was put on the backburner.\nThe United States was under pressure to ease the humanitarian crisis in the war-torn Palestinian enclave, which had been worsened by Israel's closure of many land border crossings, and sea deliveries were seen as a possible solution.\nU.S. Admiral Christopher Grady, the vice chairman of the Joint Chiefs of Staff and a career Navy surface warfare officer, told a meeting that he was very concerned that the sea could become too rough for a pier to deliver humanitarian aid and laid out weather-related risks, a former U.S. official and a current U.S. official said.\nIt wasn't until early 2024 that the idea came up again as the situation in Gaza grew more desperate and aid organizations warned that mass famine among Palestinian civilians was looming.\n\"We sort of reached a point where it seemed appropriate to take more risk because the need was so great,\" a former senior Biden administration official said.\nThe resulting pier mission did not go well.\nIt involved 1,000 U.S. troops, delivered only a fraction of the promised aid at a cost of nearly $230 million, and was from the start beset by bad luck and miscalculations, including fire, bad weather and dangers on shore from the fighting between Israel and Hamas.\nBiden, after promising a \"massive increase\" in aid, acknowledged that the pier had fallen short of his aspirations. \"I was hopeful that would be more successful,\" he told reporters on July 11.\nThe internal discussions about the Gaza pier, including discarded options to briefly deploy troops to the enclave, have not been previously reported.\nThe pier mission, which was formally ended last week, was the most controversial of the U.S. military's attempts to help contain the fallout from the Israel-Hamas war that erupted on Oct. 7, 2023, and has drawn criticism from Biden's Republican critics and many current and former aid workers.\nThe effort also underscores the humanitarian crisis in Gaza and Israeli Prime Minister Benjamin Netanyahu's struggles to bring the conflict to a close, both of which are in focus during his visit to Washington this week.\nThe Pentagon referred questions about the pier to remarks made at a July 17 briefing with Vice Admiral Brad Cooper, the deputy commander of U.S. Central Command. In it, Cooper said the mission was a success, delivering the largest amount of aid ever into the Middle East.\nMike Rogers, the Republican who leads the Pentagon's oversight committee in the House of Representatives, called the pier \"an embarrassment.\"\n\"The pier was an ill-conceived political calculation by the Biden administration,\" Rogers told Reuters.\nNO BOOTS ON THE GROUND\nWith alarm rising over the humanitarian crisis in Gaza in 2023, Curtis Reid, chief of staff at the White House National Security Council, was tasked with creating a working group with different government agencies to look at ways to increase aid into Gaza.\n\"(It) was a request for agencies to put everything you got on the table,\" the former senior official said. The Pentagon then started looking at options.\nAsked for comment, the NSC acknowledged inter-agency discussions on potential policy options.\n\"Because of this work, we were able to advance the delivery of humanitarian assistance into Gaza, utilizing every tool possible,\" said Adrienne Watson, an NSC spokesperson.\nWhen the head of the military's Central Command, General Michael \"Erik\" Kurilla, initially briefed Defense Secretary Lloyd Austin about the pier mission, his first proposal included a limited number of U.S. troops on the ground, temporarily, to attach the pier to the shore, the former official said.\nAustin was aware that the White House was opposed to deploying U.S. forces to Gaza and asked Kurilla to go back and rework it, a current U.S. official and the former official said.\nKurilla created a plan to train Israeli forces to do the installation of the pier on the shore, the former official added. Israeli forces later carried out the plan. The Israeli prime minister's office and defense ministry referred Reuters' questions about the pier to the U.S. military.\nKurilla's Central Command declined to comment on the record. A U.S. defense official, speaking on condition of anonymity, denied the account and said \"boots on the ground was never a consideration.\"\nCurrent and former officials described Central Command as extremely confident the pier project would succeed.\n\"CENTCOM and General Kurilla, from Day 1, they were consistent in saying: 'We can do this,'\" the former U.S. official said.\nThe first turn of bad luck came on April 11, when a fire broke out in the engine room of the USNS 2nd Lt. John P. Bobo, a Navy ship transporting part of the pier system to the Mediterranean.\nThe crew put out the fire but the ship had to turn back to the United States.\nTHREE FOOT WAVES\nWeather was an even bigger problem.\nAn early warning of the challenges from rough seas came last summer, when U.S. troops attempted to install the pier on an Australian shore during a military exercise.\nThe sea was too rough, a military officer who directly worked on the pier exercise told Reuters.\nIn the end, the soldiers couldn't connect the pier to the beach itself, and instead brought supplies ashore using boats to bridge the gap between the end of the floating pier and the beach.\nU.S. officials acknowledge that the Mediterranean weather was a worry. But they were unprepared for how bad the sea conditions turned out to be.\n\"The forecast that they had (was) basically that the sea state was going to be three or less up until around September,\" said one senior U.S. defense official, referring to sea state three, when waves do not exceed three feet.\nInstead, waves broke the pier just nine days after it became operational on May 16. The damage was so bad that it had to be moved to the Israeli port of Ashdod for repairs.\nThe incident would be prove the norm, with bad weather keeping the pier inoperative for all but 20 days -- half as long as it took to bring the system across the sea to Gaza.\nWhile there were no deaths or known direct attacks on the pier, three U.S. troops suffered non-combat injuries in support of the pier in May, with one medically evacuated in critical condition.\nOVER-ESTIMATING DISTRIBUTION\nDelivering the food, shelter and medical care that was brought onshore through the pier also proved harder than expected.\nThe U.S. military aimed to ramp up to as many as 150 trucks a day of aid coming off the pier.\nBut because the pier was only operational for a total of 20 days, the military says it moved a total of only 19.4 million pounds of aid into Gaza. That would be about 480 trucks of aid delivered in total from the pier, based on estimates by the World Food Programme from earlier this year of weight carried by a truck.\nThe United Nations says about 500 truckloads of aid are needed daily to address the needs of Palestinians in Gaza.\nJust days after the first shipments of aid rolled off the pier in Gaza, crowds overwhelmed trucks and took some of it.\nIsrael's killings of seven World Central Kitchen workers in April and its use of an area near the pier as it staged a hostage rescue recovery mission in June also dented the confidence of aid organizations, on whom the U.S. was relying to carry the supplies from the shore and distribute to residents.\nA senior U.S. defense official acknowledged that aid delivery \"proved to be perhaps more challenging than the planners anticipated.\"\nOne former official said Kurilla had raised distribution as a concern early on.\n\"General Kurilla was also very clear about that: 'I can do my piece of this, and I can do distribution if you task me to do it,'\" the former official said.\n\"But that was explicitly scoped out of what the task was. And so we were reliant on these international organizations.\"\nCurrent and former U.S. officials told Reuters that the United Nations and aid organizations themselves were always cool to the pier.\nAt a closed-door meeting of U.S. officials and aid organizations in Cyprus in March, Sigrid Kaag, the U.N. humanitarian and reconstruction coordinator for Gaza, offered tacit support for Biden's pier project.\nBut Kaag stressed the UN preference was for \"land, land, land,\" according to two people familiar with the discussions.\nThe United Nations declined to comment on the meeting. It referred to a briefing on Monday where a spokesperson for the organization said that the U.N. appreciated every way of getting aid into Gaza, including the pier, but more access through land routes is needed.\nThe underlying concern for aid organizations was that Biden, under pressure from fellow Democrats over Israel's killing of civilians in Gaza, was pushing a solution that would at best be a temporary fix and at worst would take pressure off Netanyahu's government to open up land routes into Gaza.\nDave Harden, a former USAID mission director to the West Bank and Gaza, described the pier project as \"humanitarian theater.\"\n\"It did relieve the pressure, unfortunately, on having the (land border) crossings work more effectively.\" REUTERS", "url": "https://www.straitstimes.com/world/middle-east/how-biden-s-gaza-pier-project-unraveled"}