{"authors": [], "date_download": "2024-10-12 13:27:56", "date_modify": "2024-10-12 13:27:56", "date_publish": "2024-05-25 06:00:00", "description": "Covid pandemic cut global life expectancy by nearly two years: WHO Covid-19 cut global life expectancy by almost two years when it raged from 2019 to 2021, wiping out a decade of progress, the World Health Organization said on May 24. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-may-25-3_1728739676.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/25/btlife20240525_0.JPG?VersionId=Q22j9YEzazjplsBc2mmIEn0rp878Qvhx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-may-25-3_1728739676.html", "title": "While You Were Sleeping: 5 stories you might have missed, May 25", "title_page": "While You Were Sleeping: 5 stories you might have missed, May 25 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Covid pandemic cut global life expectancy by nearly two years: WHO\nCovid-19 cut global life expectancy by almost two years when it raged from 2019 to 2021, wiping out a decade of progress, the World Health Organization said on May 24.\n“The Covid-19 pandemic reversed the trend of steady gain in life expectancy at birth and healthy life expectancy at birth,” the UN health agency said.\nGlobal life expectancy fell 1.8 years to 71.4 years, the same level as it was in 2012, according to a WHO annual world health statistics study.\nREAD MORE HERE\nPandemic agreement talks end without deal\nNegotiations on a landmark global agreement on handling future pandemics came to a close on May 24 without finalising a deal, though countries voiced the desire to keep pushing for an accord.\nScarred by the devastation caused by Covid-19 – which killed millions of people, shredded economies and crippled health systems – countries have spent two years trying to hammer out binding commitments on pandemic prevention, preparedness and response.\nBut the talks gathered momentum only in the last few weeks, as the fast-approaching deadline set for before next week’s start of the World Health Organization’s annual meeting of its 194 member states loomed.\nREAD MORE HERE\nExiled Chinese businessman stole US$1 billion to fund luxury lifestyle, prosecutor says\nExiled Chinese businessman Miles Guo scammed his followers out of more than US$1 billion (S$1.35 billion) after Chinese authorities seized his property, a federal prosecutor said on May 24 as Guo’s fraud trial began in New York.\nAssistant US Attorney Micah Fergenson told jurors that Guo, who was a real estate developer in China and moved to New York, amassed an online following through videos criticising the Chinese government.\nAfter authorities in China and Hong Kong seized his assets in response, Guo started pitching fraudulent investments to his followers, Fergenson said.\nREAD MORE HERE\nThree Christian missionaries from Oklahoma-based group killed in Haiti\nThree Christian missionaries from Missions in Haiti were shot and killed in an ambush by a gang in Haiti, the Oklahoma-based group said on May 24.\nThe missionaries were taking shelter in a house when gang members began shooting at the residence at about 9 p.m. CDT (0200 GMT) May 23, the group said in two Facebook posts.\nMonths of gang violence in Haiti have forced the government into retreat, and US Secretary of State Antony Blinken has warned the country is close to becoming a failed state.\nREAD MORE HERE\nLeclerc shows Ferrari’s pace as Verstappen struggles\nFerrari’s Charles Leclerc raised hopes of a first home podium appearance after setting the fastest lap in practice for Formula One’s showcase Monaco Grand Prix on May 24 ahead of Mercedes’ Lewis Hamilton.\nThe local hero, who has twice been on pole position in Monaco without securing a top three finish, showed an impressive pace with a best lap of one minute and 11.278 seconds on the soft tyres.\nThat time was already quicker than last year’s pole of 1:11.365 set by Red Bull’s Max Verstappen, who has also been on pole at every race this season and is aiming for an outright record ninth in a row.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-may-25-3"}