{"authors": [], "date_download": "2024-10-12 14:19:15", "date_modify": "2024-10-12 14:19:15", "date_publish": "2023-12-15 01:18:43", "description": "Kyiv is trying to ensure continued Western support for Ukraine in its fight against Russian invasion. Read more at straitstimes.com.", "filename": "world_europe_ukraines-zelensky-on-surprise-visit-to-germany_1728742755.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/15/zelenskyingermany.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraines-zelensky-on-surprise-visit-to-germany_1728742755.html", "title": "Ukraine’s Zelensky on surprise visit to Germany", "title_page": "Ukraine’s Zelensky on surprise visit to Germany | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "FRANKFURT, Germany - Ukrainian President Volodymyr Zelensky made an unannounced visit to Germany on Dec 14, his spokesman said, as Kyiv tries to ensure continued Western support for the embattled country.\nZelensky spokesman Sergiy Nykyforov said the purpose of the trip was “to visit the (United States) military base in Wiesbaden, from where the assistance from partners is coordinated”.\nOn X, formerly Twitter, Ukraine’s presidential chief of staff, Mr Andriy Yermak, posted simply a German flag and a flexed bicep.\nA police spokesman in the German business capital Frankfurt told AFP earlier that Mr Zelensky had “appointments in the Rhine-Main area”.\nThe spokesman said police officers had accompanied Mr Zelensky from Frankfurt airport towards nearby Wiesbaden and had temporarily blocked off traffic for security reasons.\nPolitico had reported on Dec 14 that German defence firms were given 24 hours to list armaments that could be sent to Ukraine in 2024, based on a request to industry from senior government officials.\nIn 2022, the US Department of Defence established a new organisation in Wiesbaden to coordinate long-term security force assistance.\nAs he urged allies in Europe and the US to keep backing Kyiv, Mr Zelensky on Dec 14 made an unannounced visit to Oslo for talks with the leaders of the five Nordic countries on the eve of a crunch European Union meeting in Brussels.", "url": "https://www.straitstimes.com/world/europe/ukraines-zelensky-on-surprise-visit-to-germany"}