{"authors": [], "date_download": "2024-10-12 13:34:34", "date_modify": "2024-10-12 13:34:34", "date_publish": "2024-09-05 19:45:55", "description": "BERLIN - After coming second in the Brandenburg state vote on Sunday and winning the Thuringia state election this month, Germany's far-right Alternative for Germany (AfD) party now commands a blocking minority in two regions.  Read more at straitstimes.com.", "filename": "world_europe_explainer-what-can-germanys-far-right-afd-do-with-its-regional-blocking-minority_1728740074.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/LYNXMPEK840JE-1.jpg?VersionId=y63dy4c4buYVVq2_f5KHbDrv9s8z6L0a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_explainer-what-can-germanys-far-right-afd-do-with-its-regional-blocking-minority_1728740074.html", "title": "Explainer-What can Germany's far-right AfD do with its blocking minorities?", "title_page": "Explainer-What can Germany's far-right AfD do with its blocking minorities? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - After coming second in the Brandenburg state vote on Sunday and winning the Thuringia state election this month, Germany's far-right Alternative for Germany (AfD) party now commands a blocking minority in two regions.\nWHY IS A BLOCKING MINORITY PART OF THE LAW?\nIn Germany, some decisions of great consequence like changing the constitution or making appointments to bodies key to the functioning of democracy and the rule of law require a two-thirds majority.\nConversely, any one party that can marshal a third of votes in parliament - representing a significant portion of public opinion - can wield a blocking minority.\nThe two-thirds or super majority, a rule inspired in part by the Nazis' seizure of dictatorial power after winning the 1933 election, was designed to stop any one party capturing the state and transforming it. Sweeping change should be achievable only through agreement among multiple parties.\nOn the other hand, a blocking minority could be used by a party at odds with liberal democracy, like the AfD, to gum up and delegitimise the state, for example by snarling appointments to judicial and security bodies.\nWHERE IS A TWO-THIRDS MAJORITY NEEDED?\nIn Thuringia, a two-thirds majority is needed for appointments to the state Constitutional Court, the committee that appoints other judges and the committee that oversees security services and appoints the official leading the security agency which, among other things, monitors alleged far-right and extremist threats to democracy - including the AfD.\nIn Brandenburg, two thirds of legislators must vote for new Constitutional Court judges or for changes to the state constitution. The AfD's support would also be needed to dissolve parliament and call new elections.\nWILL THE AfD BLOCK ALL NOMINATIONS?\nOn election night, Bjoern Hoecke, the radical AfD leader in Thuringia, said he would use his blocking minority to defeat attempts by other parties to freeze it out of power. His colleagues in Brandenburg echoed that view on Sunday.\nThe AfD has for years been accused of using legislative and judicial levers to bog down state institutions across Germany, maximising its clout even without formal legislative powers. It says it is merely making full use of its democratic rights.\nThe party is one of the most active sponsors of filings before the Federal Constitutional Court, packing out its docket with unmanageable case volumes.\nWHEN DOES THE FIRST CRUNCH COME?\nThe first appointment that will require a two-thirds approval comes soon with the replacement of a Constitutional Court judge in Thuringia. In Brandenburg, the first urgent vacancy does not arise until 2029, limiting the party's immediate leverage.\nHOW MUCH HARM COULD A BLOCKING MINORITY DO?\nFollowing the immediate replacement in Thuringia, all the remaining judges' terms will have expired by 2029. Lower court judges in Thuringia in the formerly Communist east are older than the national average - many have been in office since German reunification in 1990 - so a wave of retirements is due in coming years. If no replacements can be appointed, there could be long waits for justice.\nWHAT ARE THE CONSEQUENCES BEYOND THE JUDICIARY?\nSurveys show the AfD thrives on the perception of many voters that a sclerotic and ineffective state needs radical change. Endless delays to rulings on everything from company filings and divorce papers to criminal cases could reinforce that perception, even if the AfD is itself partly to blame.\nWhile small Thuringia has less than 3% of Germany's population, snarls in the system will be noticed far beyond its boundaries and could influence voters further afield ahead of next year's national election.\nWHAT CAN BE DONE?\nOn the national level, government and opposition recently agreed to amend the constitution so a future party attempting to advance an authoritarian agenda would not be able to disable the Federal Constitutional Court, which is regarded as German democracy's ultimate guarantor.\nIt's too late for that in Thuringia and Brandenburg: state politicians will have little choice but to try to strike deals, informal or otherwise, with the AfD, regardless of their stated refusal to work with the far rightists.\nLegal scholars, like Erfurt University's Anna-Mira Brandau, have been looking into whether the federal government could delegate its own judges and courts to cases in Thuringia as an emergency stop-gap. REUTERS", "url": "https://www.straitstimes.com/world/europe/explainer-what-can-germanys-far-right-afd-do-with-its-regional-blocking-minority"}