{"authors": ["Rhea Yasmine"], "date_download": "2024-10-12 13:54:53", "date_modify": "2024-10-12 13:54:53", "date_publish": "2024-07-31 15:19:55", "description": "Children screamed in fear as others swatted the insects away from their bodies. Read more at straitstimes.com.", "filename": "world_united-states_dragonfly-apocalypse-shocks-beachgoers-in-rhode-island_1728741293.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/rhode20island20dragonfly.png?VersionId=hktcJK1E4oDjamKXLm.iHanIhp6GYbif", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_dragonfly-apocalypse-shocks-beachgoers-in-rhode-island_1728741293.html", "title": "‘Dragonfly apocalypse’ shocks beachgoers in Rhode Island", "title_page": "‘Dragonfly apocalypse’ shocks beachgoers in Rhode Island | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Weekend beachgoers in Rhode Island were stunned by an “apocalyptic” spectacle – a massive swarm of dragonflies filling the sky, their wings a blur as they flew past the frightened crowd.\nIn videos circulating on social media, dragonflies zipped through the air at Misquamicut State Beach and South Shore Beach in the north-eastern US state. The two beaches are over an hour’s drive away from each other.\nChildren could be heard screaming in fear while others were seen swatting the insects away from their bodies.\n“I think it’s the end of the world!” said one beachgoer in a video posted on TikTok.\nAccording to a TikTok user, the dragonflies flew in from the ocean, with several swarms flying in throughout the day.\nOne of the swarms lasted for about five minutes, she said in the comments section.\nWhile many were puzzled by the rare swarm of dragonflies, some said that it was a sign of good luck.\nA comment on a TikTok video read: “A great omen. Dragonflies are symbols of rebirth and transformation.”\nOthers rejoiced at the impending decline of the mosquito population that would be brought about by the dragonflies.\n“At least you won’t see any mosquitoes for a while,” said one netizen.\nAccording to Mr David W. Gregg, executive director of the Rhode Island Natural History Survey, the dragonflies – known as blue dashers – were most likely just “looking for a better habitat”.\n“Central Massachusetts and Rhode Island have been in a drought the last couple of weeks,” he said.\n“What happened was their ponds started to dry up and the mosquito population started to decline, and suddenly it put pressure on them,” he was quoted as saying by The Washington Post.\nHe added that a milder winter in 2024 likely contributed to more dragonflies hatching.\nThe dragonflies were probably moving north as the beach is not a good habitat for dragonflies, he said, assuring people that there is nothing to fear.\n“People shouldn’t be afraid. (Dragonflies) don’t bite or sting. The worst thing that can happen is they eat all the mosquitoes.”\nThis is not the first spotting of a dragonfly swarm in the US.\nIn 2019, a high volume of dragonflies swarmed parts of the US and even appeared on the weather radar in three states – Indiana, Ohio and Pennsylvania.\nAccording to CNN, Ohio State University Entomology Professor Norman Johnson said at the time that the dragonflies were probably green darners, which were on their way to the south in the fall.\nHe said that while dragonflies do not usually travel in swarms, local weather conditions can cause them to bunch up.", "url": "https://www.straitstimes.com/world/united-states/dragonfly-apocalypse-shocks-beachgoers-in-rhode-island"}