{"authors": ["Charissa Yong"], "date_download": "2024-10-12 14:07:52", "date_modify": "2024-10-12 14:07:52", "date_publish": "2022-09-06 07:11:35", "description": "Last week in Philadelphia, Biden blasted Republicans devoted to Trump's \"Make America Great Again\" agenda. Read more at straitstimes.com.", "filename": "world_united-states_biden-assails-trump-loyalists-but-not-all-republicans-after-backlash_1728742072.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/06/dw-biden-pittsburgh-220906.jpg?VersionId=fKav9BgqNnHd5LfVO6uSszaSR2KsOiWv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-assails-trump-loyalists-but-not-all-republicans-after-backlash_1728742072.html", "title": "Final stretch of midterm campaigning kicks off in US", "title_page": "Final stretch of midterm campaigning kicks off in US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - United States President Joe Biden doubled down on his criticism of extremist pro-Trump Republicans in two speeches over Monday’s Labour Day holiday, while touting legislation passed by the Democrat-controlled Congress.\nThe long weekend is seen as the unofficial start of the final stretch of campaigning before voters head to the polls for the midterm elections on Nov 8 to decide whether to hand control of the chambers of Congress to Republicans or Democrats.\nMr Biden visited the battleground states of Wisconsin and Pennsylvania, whose votes were instrumental in sending him to the White House in 2020, to drum up support for Democratic candidates.\nIn Milwaukee, Wisconsin, the President repeated a theme he has been building on in recent weeks - that extremist Republicans, who deny legitimate election results and foment political violence, are a threat to America’s democracy.\n“Not every Republican is a Maga Republican. Not every Republican embraces that extreme ideology,” Mr Biden said in a speech to union leaders, referring to former president Donald Trump’s “Make America Great Again” slogan.\n“But the extreme Maga Republicans in Congress have chosen to go backwards - (they are) full of anger, violence, hate and division,” he added.\nMr Biden was interrupted by a heckler but responded by urging the crowd to let the heckler be, saying: “Everybody is entitled to be an idiot.”\nThe President also took aim at certain Republican lawmakers, including Wisconsin Senator Ron Johnson, for not condemning last year’s Jan 6 attack on the Capitol by a mob of Trump supporters. Mr Johnson said last May that the riot had been “by and large a peaceful protest”.\nSaid Mr Biden: “The definition of democracy is you accept the will of the people when the votes are honestly counted... To this day, Maga Republicans in Congress defend the mob that stormed the Capitol, and people died later.”\nHe added: “There is no democracy where you can be pro-insurrection and pro-democracy.”\nThe President had a similar message in Pittsburgh, Pennsylvania, stressing that democracy was at stake.\nMr Biden received some backlash over the weekend for his criticism of Republicans, but stressed repeatedly that he was not referring to all in the party.\nUS midterm elections are seen as a referendum on the sitting president, whose party tends to take a beating at the polls.\nBut Democrats have framed the midterms as a chance to condemn the politics of Mr Trump, and campaigned on other issues, such as abortion rights, energising their voters.\nThey have also been unexpectedly buoyed by a series of legislative victories, passing Bills ranging from infrastructure and semiconductor manufacturing to healthcare and climate change.\nRepublicans, meanwhile, have attacked the Biden administration for high inflation and rising crime, hoping that the focus on a flagging economy will give them a boost.\nIn a rejoinder to Mr Biden, Mr Johnson, the Republican senator whom the President slammed for not condemning the Capitol riot, said that Mr Biden was not helping workers in Wisconsin.\nWrote Mr Johnson on Twitter: “Forty-year high inflation, record gas prices, unsafe communities, rising crime, baby formula shortages. Democrat policies have been disastrous for all Wisconsinites.”", "url": "https://www.straitstimes.com/world/united-states/biden-assails-trump-loyalists-but-not-all-republicans-after-backlash"}