{"authors": [], "date_download": "2024-10-12 13:58:05", "date_modify": "2024-10-12 13:58:05", "date_publish": "2024-06-09 01:47:58", "description": "Comedians Whoopi Goldberg and Jimmy Fallon will be among more than 100 entertainers at the Vatican on June 14. Read more at straitstimes.com.", "filename": "world_pope-francis-invites-comedians-including-whoopi-goldberg-to-vatican_1728741485.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/09/LYNXMPEK5704A-1.jpg?VersionId=Z6XmfTFvIu56J7DlHiUzRxLheJmK04wx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_pope-francis-invites-comedians-including-whoopi-goldberg-to-vatican_1728741485.html", "title": "Pope Francis invites comedians including Whoopi Goldberg to Vatican", "title_page": "Pope Francis invites comedians including Whoopi Goldberg to Vatican | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VATICAN CITY – Pope Francis, who says he regularly prays “Lord, give me a sense of humour”, will welcome comedians from around the world to a cultural event in Italy to “celebrate the beauty of human diversity”, the Vatican said on June 8.\nAmerican comedians Whoopi Goldberg, Jimmy Fallon, Conan O’Brien and Chris Rock will be among more than 100 entertainers at the Vatican on June 14.\nThe Pope “recognises the significant impact that the art of comedy has on the world of contemporary culture”, a Vatican statement said.\nBritish comedian Stephen Merchant, co-writer of the TV comedy series The Office (2001 to 2003), and Italian comedian Lino Banfi will also be at the event.\nThe meeting will take place on June 14 morning, before the Pope travels to Puglia to attend the Group of Seven (G7) leaders’ summit.\n“The meeting between Pope Francis and the world’s comedians aims to celebrate the beauty of human diversity and to promote a message of peace, love and solidarity,” the Vatican said.\nThe audience has been organised by the Vatican’s Dicastery for Culture and Education and Dicastery for Communication.\nGoldberg, 68, said in May in an interview that she had offered the Pope a cameo in upcoming film sequel Sister Act 3, in which she will reprise her comedy role of a singer who takes refuge in a convent and organises a choir.\n\"He said he would see what his time was like,\" Goldberg joked, when asked if the Pope had accepted her offer. REUTERS", "url": "https://www.straitstimes.com/world/pope-francis-invites-comedians-including-whoopi-goldberg-to-vatican"}