{"authors": [], "date_download": "2024-10-12 13:36:33", "date_modify": "2024-10-12 13:36:33", "date_publish": "2024-08-08 08:20:00", "description": "The criticism first surfaced during Mr Tim Walz’s first campaign to be governor. Read more at straitstimes.com.", "filename": "world_united-states_vance-attacks-walz-s-military-record-accusing-him-of-avoiding-a-tour-in-iraq_1728740193.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/US-KAMALA-HARRIS-AND-TIM-WALZ-HOLD-CAMPAIGN-RALLY-IN-WISCONSIN-233409.jpg?VersionId=ADsZDueqLd_pFlwmZIdGLUrws3g1jFNx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_vance-attacks-walz-s-military-record-accusing-him-of-avoiding-a-tour-in-iraq_1728740193.html", "title": "Vance attacks Walz’s military record, accusing him of avoiding tour in Iraq and of ‘stolen valour’", "title_page": "Vance attacks Walz’s military record, accusing him of avoiding tour in Iraq and of ‘stolen valour’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHELBY TOWNSHIP, Michigan – Senator J.D. Vance accused Minnesota Governor Tim Walz on Aug 7 of quitting the Army National Guard two decades ago to avoid being deployed to Iraq and of exaggerating his service record to claim falsely that he had served in combat.\nBoth provocative charges amounted to some of the sharpest Republican attacks yet on the Minnesota governor, and appeared aimed at disrupting what has been a run of positive news coverage of the Democratic ticket since US Vice-President Kamala Harris replaced US President Joe Biden as the party’s nominee.\nThe accusations by Mr Vance, who served a four-year active duty enlistment in the Marine Corps, about Mr Walz, whose career in the National Guard spanned 24 years, also served to pit the military records of the two major parties’ vice-presidential candidates against each other.\nSpeaking at the police department in Shelby Township, Michigan, on the morning of Aug 7, Mr Vance said Mr Walz had effectively deserted his fellow soldiers to avoid serving in Iraq because he retired from the National Guard in May 2005, several months before his artillery unit received orders to deploy there.\n“You abandoned your unit right before they went to Iraq,” Mr Vance said.\nMr Vance based his accusations on a Facebook post from 2018, and a paid letter to the editor to the West Central Tribune that same year in which the writers, Mr Thomas Behrends and Mr Paul Herr, both retired command sergeant majors in the Minnesota National Guard, accused Mr Walz of “conveniently retiring a year before his battalion was deployed to Iraq”.\nThe criticisms were first levelled by Mr Behrends and Mr Herr during Mr Walz’s first campaign to be governor.\nBut Mr Joseph Eustice, a 32-year veteran of the National Guard who led the same battalion as Mr Walz and served under him, said in an interview on Aug 7 that the Governor was a dependable soldier and that the attacks by his fellow comrades were unfounded.\n“He was as good a soldier as you’d find, and to have two former sergeant majors say that he wasn’t, it’s just not true,” Mr Eustice said, adding that he disagreed with Mr Walz’s politics and most likely would not vote for him in November even though they were friends.\nMr Eustice recalled that Mr Walz’s decision to run for Congress came months before the battalion received any official notice of deployment, though he said there had been rumours that it might be deployed.\nAccording to Mr Eustice, the two men were exercising in early 2005 when Mr Walz, who was then a command sergeant major, turned to Mr Eustice, who was then a first sergeant, and said: “I got to ask you something. I’m thinking about running for Congress.”\n“I said, ‘What the hell’s wrong?’” Mr Eustice added. “I mean, why would you want to do such a thing?”\nThe Harris-Walz campaign did not provide any new details about the timeline of Mr Walz’s decision to retire. Instead, it pointed to other past comments from fellow guardsmen who said that Mr Walz had been considering running for office for some time and that the decision to retire from the military had weighed heavily on him.\n“After 24 years of military service, Governor Walz retired in 2005 and ran for Congress, where he chaired Veterans Affairs and was a tireless advocate for our men and women in uniform,” said Mr Ammar Moussa, a campaign spokesman. “As vice-president of the United States, he will continue to be a relentless champion for our veterans and military families.”\nOn Aug 7, Mr Vance also seized on a remark by Mr Walz in a video clip that the Harris campaign had promoted on social media on Aug 6, in which the Governor told a crowd about support for gun control, saying that “we can make sure those weapons of war, that I carried in war, are only carried in war”.\nMr Walz never served in combat, however, which prompted Mr Vance to accuse him of “stolen valour”.\n“I’d be ashamed if I was him and I lied about my military service like he did,” Mr Vance said.\nMr Walz was deployed after the Sept 11 terrorist attacks as part of Operation Enduring Freedom, but not in a combat zone.\n“The Governor carried, fired and trained others to use weapons of war innumerable times,” Mr Moussa said. “Governor Walz would never insult or undermine any American’s service to this country – in fact, he thanks Senator Vance for putting his life on the line for our country. It’s the American way.”\nMr Walz’s long years in uniform began when he enlisted as an infantryman in the Nebraska Army National Guard in 1981, a few days after his 17th birthday. When he transferred to the Minnesota National Guard in the 1990s, his job scope changed to that of artillery.\nHe retired in 2005 as a master sergeant but had served earlier as a command sergeant major, one of the Army’s highest enlisted ranks.\nThe accusation also recalled similar criticisms that former US president Donald Trump has faced about avoiding military service. The three-time Republican presidential nominee sidestepped the war in Vietnam thanks to a deferment related to bone spurs in his heel, a medical assessment that was made as a favour for Trump’s father, the doctor’s daughter told The New York Times in 2018.\nMr Patrick Murphy, a former US Army captain who was a roommate of Mr Walz’s when both served in the US House, said he was dismayed by the attacks on Mr Walz’s military record.\n“Anyone who tries to criticise his record but looks the other way at Donald Trump’s six deferments to Vietnam is beyond the pale,” said Mr Murphy, a Pennsylvania Democrat.\nMr Vance was on active duty with the Marine Corps from 2003 to 2007 during the Iraq war.\nMr Vance, who then went by the name “James D. Hamel”, was assigned to the Second Marine Aircraft Wing, one of the Marine Corps’ largest subordinate commands that oversees aircraft such as fighter jets and helicopters. He was deployed to Iraq in 2005 and 2006 with the aircraft wing but did not serve as a front-line combatant.\nHis official military occupation, known as a combat correspondent, meant he was tasked with basic communication roles such as writing articles about the happenings in his unit. NYTIMES", "url": "https://www.straitstimes.com/world/united-states/vance-attacks-walz-s-military-record-accusing-him-of-avoiding-a-tour-in-iraq"}