{"authors": [], "date_download": "2024-10-12 13:50:05", "date_modify": "2024-10-12 13:50:05", "date_publish": "2023-12-05 00:44:05", "description": "About 5.13 million excess deaths a year attributable to ambient air pollution from fossil fuel use. Read more at straitstimes.com.", "filename": "world_middle-east_cut-fossil-fuel-use-to-save-millions-of-lives-health-experts-say_1728741005.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/05/btfossil20231204.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_cut-fossil-fuel-use-to-save-millions-of-lives-health-experts-say_1728741005.html", "title": "Cut fossil fuel use to save millions of lives, health experts say", "title_page": "Cut fossil fuel use to save millions of lives, health experts say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI – Countries must put people’s health at the centre of their plans to fight climate change and phase out fossil fuels as a way to tackle air pollution and diseases being aggravated by rising temperatures, health specialists told the United Nations climate summit.\nAt the COP28 conference in Dubai, more than 120 nations signed a declaration to boost health-related climate finance, but the document made no mention of fossil fuels – the main source of climate-warming emissions.\nClimate campaigners, researchers and health policymakers said phasing out the use of fossil fuels was vital to saving millions of lives each year and called on governments to address the link between emissions and air quality, and include measurable goals or targets.\n“We need to integrate climate change as a core component to enable us, as the first-line responders, to respond, detect and treat climate-related health impacts,” said Dr Omnia El Omrani, a climate and health policy expert from Egypt.\nDespite an increase globally in illnesses and deaths linked to fossil fuel burning such as asthma, lung infections and respiratory diseases, she said health authorities in many countries do not connect the trend to greenhouse gas emissions.\nAn estimated 5.13 million excess deaths a year globally are attributable to ambient air pollution from fossil fuel use and therefore could potentially be avoided by phasing out fossil fuel, according to a new study published in November by the British Medical Journal.\nDespite that, the issue was missing from two-thirds of the national climate plans, known as nationally determined contributions, submitted to the UN, according to an October report by the Global Climate and Health Alliance (GCHA).\n“The threats to health resulting from climate change are immediate and present. However, for too long, health has been a footnote to climate discussion,” World Health Organisation head Tedros Adhanom Ghebreyesus said at the first-ever Health Day at COP28 in Dubai, calling for countries to include health in their climate action plans.\nRising temperatures are also pushing mosquito-borne diseases such as dengue, chikungunya, Zika, yellow fever and malaria into regions that were not previously affected by them, Dr Tedros said.\n‘Glaring omission’\nClimate campaigners also criticised the failure of some high-emitting nations such as India, Russia, Saudi Arabia and South Africa to endorse the COP28 Declaration on Climate and Health.\n“(That) carries huge consequences for the populations of those countries in addition to the emissions that need to be addressed globally,” said Ms Jess Beagley, policy lead for the GCHA, a coalition of health non-governmental organisations and health professionals.\nThe alliance called the declaration’s failure to mention fossil fuels a “glaring omission”.\nIt did include the announcement of US$1 billion (S$1.34 billion) in pledges from governments, charities and development banks to mobilise finance for climate and health in developing countries, where climate-related health risks are especially high.\nThe funding initiative includes US$300 million from the Global Fund, US$100 million from the Rockefeller Foundation to support climate and health solutions, and a £54 million (S$91.3 million) pledge from the British government.\nAt present, health-focused climate action receives only 2 per cent of adaptation funding and 0.5 per cent of climate funding.\nHealth and climate campaigners say that is nowhere near enough to tackle the growing burden of tropical diseases as the world warms, and other climate-driven health threats such as malnutrition, malaria, diarrhoea and heat stress.", "url": "https://www.straitstimes.com/world/middle-east/cut-fossil-fuel-use-to-save-millions-of-lives-health-experts-say"}