{"authors": [], "date_download": "2024-10-12 14:04:57", "date_modify": "2024-10-12 14:04:57", "date_publish": "2022-04-04 07:28:52", "description": "Ukrainians were still finding the dead in yards and on the roads amid mounting evidence that civilians had been killed purposely. Read more at straitstimes.com.", "filename": "world_europe_in-the-kyiv-suburb-of-bucha-they-shot-everyone-they-saw_1728741897.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/04/ac_Buchavehicle_0400422.jpg?VersionId=lqVK.sYIl09sp.pJ2QjCwUfE6aEwVSd1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_in-the-kyiv-suburb-of-bucha-they-shot-everyone-they-saw_1728741897.html", "title": "In the Kyiv suburb of Bucha, 'they shot everyone they saw'", "title_page": "In the Kyiv suburb of Bucha, 'they shot everyone they saw' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BUCHA, UKRAINE (NYTIMES) - When a column of Russian tanks drove into the Kyiv suburb of Bucha in the first days of the war, Ms Tetiana Pomazanko thought they held Ukrainian soldiers and went out to her front gate to see.\nBut the troops opened fire on Ms Pomazanko, 56. Bullets ripped through the wooden gate and fence around her house, killing her instantly. Her body still lay in the garden Sunday (April 3), where her 76-year-old mother had covered her as best she could with plastic sheeting and wooden boards.\n\"They were driving up the street,\" said her mother, Mrs Antonina Pomazanko. \"She thought they were ours.\"\nMs Pomazanko's killing is just one of scores being uncovered days after Russian troops withdrew from the outlying suburbs of Ukraine's capital, Kyiv, after weeks of fierce fighting. On Sunday, Ukrainians were still finding the dead in yards and on the roads amid mounting evidence that civilians had been killed purposely and indiscriminately.\nDr Serhiy Kaplishny is a coroner in Bucha who worked there from Feb 24, the day of the invasion, until March 10, when he fled. He returned to Bucha on Saturday. He said that, so far, his team had collected more than 100 bodies during and after the fighting and the Russian occupation.\nDr Kaplishny said that before he left Bucha - as back-and-forth battles raged and then the Russian army established control - he had buried 57 bodies in a cemetery. Fifteen of those people had died of natural causes, the rest from gunshot wounds, including point-blank shots, or from shrapnel. Three of the bodies were those of Ukrainian soldiers, he said.\nBefore leaving town in March, he said, he had arranged for a local backhoe operator to dig a mass grave in the yard of an Orthodox church. Without electricity for refrigeration, the morgue had become intolerable, and another solution was needed. \"It was a horror,\" he said.\nAfter he left, the mass grave filled up with about 40 bodies, he said, of people who died during the Russian occupation. Local coroners from his office who stayed in the town had collected some of those bodies, he said.\nOn a visit Sunday to the mass grave - about a dozen yards long and 2 yards wide - a pile of excavated dirt lay nearby to pile onto bodies. In one corner, two pairs of shoes and an arm protruded from a thin layer of dirt, and in another, a hand stuck out. On top of the pile, a half-dozen black body bags had been tipped into the pit.\nBy the end of the day, back in town, he said that he had picked up about 30 more bodies in a white van. Thirteen of them were men whose hands had been tied and who had been shot at close range in the head.\nHe said he did not know the circumstances of their deaths but believed, based on their apparently recent deaths, that they were prisoners killed before the Russian army withdrew.\n\"They were civilians,\" Dr Kaplishny said, showing cellphone pictures of dead men in civilian clothes with their hands bound behind their backs and in one case in the front.\nIn the images, eight bodies with hands bound lay in a courtyard of a house and five in a basement, he said. \"Look, that one was shot in the eye,\" Dr Kaplishny said.\nMs Galina Levitskaya, 60, a retired teacher, said she had no negative experiences with the enlisted Russian soldiers who patrolled the town. It was her impression, she said, that they had orders to be polite and to share their meal rations, which they did. \"They helped us carry bags,\" she said.\nA unit of ethnic Chechen fighters, who were bearded and wore black uniforms, had searched door to door, she said. If an occupant opened the door, she said, the fighters generally just searched for weapons and left. If nobody opened the door, she said, they would kick it in to search.\nOthers fared far worse. Mr Vitaly Sinadin, a 45-year-old sculptor who was hobbling down a street Sunday afternoon, said he had been tied to a metal pole for two days in a cinderblock house used by Russian forces as a base.\n\"They beat me, asking, 'Where are the Ukrainian soldiers?' and 'Who in town is in the Territorial Defence Force?'\" - a reference to the volunteer units that sprang up in the first days of the Russian invasion.\nA sprawling red-and-black bruise covering his thighs and back was consistent with his account of extensive beatings.", "url": "https://www.straitstimes.com/world/europe/in-the-kyiv-suburb-of-bucha-they-shot-everyone-they-saw"}