{"authors": [], "date_download": "2024-10-12 13:34:59", "date_modify": "2024-10-12 13:34:59", "date_publish": "2024-09-03 16:00:16", "description": "JOHANNESBURG - Six people wanted for murder and extortion were killed in a shootout with South African police in the city of Durban late on Monday, police said. Read more at straitstimes.com.", "filename": "world_six-murder-suspects-killed-in-shootout-with-south-african-police_1728740099.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/ST-logo-placeholder_22.jpg?VersionId=2IAVUnr_IotyBF.uM6M4lwgRS53B3yzk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_six-murder-suspects-killed-in-shootout-with-south-african-police_1728740099.html", "title": "Six murder suspects killed in shootout with South African police", "title_page": "Six murder suspects killed in shootout with South African police | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JOHANNESBURG - Six people wanted for murder and extortion were killed in a shootout with South African police in the city of Durban late on Monday, police said.\nThe suspects, linked to a triple murder on Friday and the execution-style killing of four other people on Sunday, were shot dead after exchanging gunfire with police at a rented holiday apartment near the city's South Beach district, police said in a statement on Tuesday.\nSouth Africa has one of the highest murder rates in the world, with data released by police last week showing there was an average of 68 murders a day nationally between April and June.\nPolice had been tracking the suspects since Sunday's killings, when the suspects had ordered their victims to lie down and then shot them in the back of the head.\nThe suspects were also believed to have been involved in the illicit drug trade, police said.\nPolice Minister Senzo Mchunu is due to address lawmakers later on Tuesday on the high levels of extortion in the country. REUTERS", "url": "https://www.straitstimes.com/world/six-murder-suspects-killed-in-shootout-with-south-african-police"}