{"authors": ["Elaine Lee"], "date_download": "2024-10-12 14:04:01", "date_modify": "2024-10-12 14:04:01", "date_publish": "2024-04-16 20:20:00", "description": "Restaurant owner Angelo Lella said 90 per cent of customers have taken up the offer. Read more at straitstimes.com.", "filename": "world_europe_restaurant-in-italy-gives-free-bottles-of-wine-to-diners-who-surrender-their-phones_1728741841.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/seth-fink-ddK-w24AdTA-unsplash.jpg?VersionId=oycIN4KV8lkBIsAqG0.XTGusj8XAyaL7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_restaurant-in-italy-gives-free-bottles-of-wine-to-diners-who-surrender-their-phones_1728741841.html", "title": "Restaurant in Italy gives free bottles of wine to diners who surrender their phones", "title_page": "Restaurant in Italy gives free bottles of wine to diners who surrender their phones | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Free wine, anyone?\nBut you have to give up your phone first.\nA newly opened restaurant in Italy is making that offer to those who hand over their mobile phones before their meal.\nThe owner of Al Condominio, located in the northern city of Verona, said he aims to encourage diners to interact with each other instead of playing with their phones during the meal, reported The Guardian.\nMr Angelo Lella said he was motivated to open a restaurant that was different and he decided to use this method to encourage diners to enjoy their meals together.\n“Technology is becoming a problem – there is no need to look at your phone every five seconds, but for many people it is like a drug… This way, they have an opportunity to put it aside and drink some good wine,” he added.\nUpon entering the restaurant, diners will be given the option to lock their phones in a box, Mr Lella said.\nWhen they show the key to the waiter, a bottle of wine will be served to each table.\nMr Lella said: “Ninety per cent of customers have opted to leave aside their phones in exchange for wine. It really is a beautiful thing to see people embracing it – they are talking to each other, rather than looking at photos or responding to messages on their phones.”\nLike Al Condominio, other restaurants around the world have also encouraged their patrons ditch their devices to enjoy their meals.\nIn 2018, a restaurant in Sydney called Contact Bar and Kitchen offered every customer a free glass of wine for putting their phones in a locker behind the bar.\nThe same year, an Italian-American restaurant chain named Frankie & Benny’s in the United Kingdom gave out free kids’ meals to those who participated in the exercise.\nIn 2022, an Indian restaurant named Spice Fusion in the United Kingdom offered diners a 20 per cent discount off their bill if they locked away their phones.\nIt is unclear if the restaurants still offer these perks.", "url": "https://www.straitstimes.com/world/europe/restaurant-in-italy-gives-free-bottles-of-wine-to-diners-who-surrender-their-phones"}