{"authors": [], "date_download": "2024-10-12 13:34:22", "date_modify": "2024-10-12 13:34:22", "date_publish": "2024-09-14 17:00:00", "description": "Rhythms and routines in Springfield have not been the same. Read more at straitstimes.com.", "filename": "world_united-states_ohio-city-unnerved-by-bomb-threats-conspiracy-theories-in-wake-of-trump-s-false-claims_1728740062.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/14/POLITICALMEMES1.JPG?VersionId=y9VYjU7erCCt2QFFbnSXoQqO9HR8QMf.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_ohio-city-unnerved-by-bomb-threats-conspiracy-theories-in-wake-of-trump-s-false-claims_1728740062.html", "title": "Ohio city unnerved by bomb threats, conspiracy theories in wake of Trump’s false claims", "title_page": "Ohio city unnerved by bomb threats, conspiracy theories in wake of Trump’s false claims | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – The dogs and cats of Springfield, Ohio, appear to be perfectly safe, but many of its people found their lives upended this week by political rumour-mongering that has resulted in multiple bomb threats, school closures and a decision to dispatch the FBI.\nEver since former president Donald Trump claimed on national television that immigrants were stealing and devouring the household pets of Springfield – “they’re eating the dogs”, he practically shouted, “they’re eating the cats” – the rhythms and routines in the city have not been the same.\nNever mind that the city authorities have refuted the story, and that many residents called it ridiculous.\nThe furore created by Trump during the presidential debate on the night of Sept 10 has put Springfield in the cross hairs of the nation’s political wars. In the days that followed, bomb threats proliferated, closing City Hall, schools and a motor vehicle office. FBI agents descended on the community to guard against danger not to animals, but to humans.\nThe unexpected and unwanted attention generated by Trump’s false stories led to real-life confusion and anxiety for some residents.\nSchools have been evacuated, children sheltered at home and parents forced to make other plans during the working day.\nMr Gethro Jean, a Haitian pastor, said he had been fielding questions from congregants who were concerned about attending church on Sept 15.\nMs Cydney Mills, 41, who kept her three children out of school on Sept 13, after the latest round of bomb threats, said: “Our town was pinpointed in the debate. After that, people are just showing their true colours and exhibiting hate.”\nJude Earlywine, 14, was in English class at Springfield High School on the morning of Sept 13 when he heard that hundreds of young children were filing into the gymnasium after bomb threats had forced the evacuation of their elementary schools.\n“Everyone was talking about it, and many people got scared because they thought that thousands of students could be killed if someone really wanted to bomb us,” he said, noting that his high school, the only one in the city, enrols more than 1,500 students.\nTrump’s fixation on Springfield drew an angry rebuke on Sept 13 from President Joe Biden, who denounced his predecessor for trafficking in false rumours that have demonised Haitian migrants and inflamed the presidential campaign.\nAt a brunch on the South Lawn of the White House billed as a “celebration of black excellence”, Mr Biden noted that Haitian immigrants were “under attack in our country right now”, a reference everyone in the audience appeared to understand even though he did not name Trump.\n“It’s simply wrong,” Mr Biden said, his voice rising in indignation. “There’s no place in America. This has to stop, what he’s doing. It has to stop.”\nOn Sept 13, Trump refused to back down and vowed to conduct a mass deportation from Springfield if he is elected, saying that Haitian immigrants there were “destroying their way of life”.\nAlthough he did not repeat the claim about the pets, neither did he retract it, even though his own Republican running mate J.D. Vance of Ohio, who first aired the rumour, has since acknowledged that it may not be true.\n“We’re going to get these people out,” Trump told reporters during a stop in California.\n“We’re going to have the largest deportation in the history of our country and we’re going to start with Springfield and Aurora,” referring to a city in Colorado where he has said Venezuelan gangs are “taking over buildings”.\nThe rumours about Springfield may be tied to right-wing agitators.\nThe day after the debate, the leader of the national neo-Nazi group Blood Tribe, Mr Christopher Pohlhaus, took credit on his Telegram channel, according to NBC News. He wrote that Blood Tribe had “pushed Springfield into the public consciousness”.\nThe majority of Haitians in Springfield and elsewhere in the United States are in the country legally, having received temporary protected status from the Biden administration under a programme started by President George W. Bush for nationals of countries in turmoil.\nSpringfield has attracted Haitian immigrants in recent years, after the city leadership successfully marketed the city as an attractive place to do business. It is accessible to two interstates and is home to several colleges.\nIt was also affordable. Car-parts makers, food and clothing distributors, and others set up shop there, especially from about 2017. But there were not enough workers.\nWord travelled rapidly among Haitians in Florida, Haiti and even in other countries, that Springfield boasted well-paying jobs and a low cost of living. Since the Covid-19 pandemic, between 12,000 and 20,000 Haitians have arrived there, according to estimates by city officials.\nHaitians were particularly attractive to employers because many of them had or were eligible for work authorisation through their temporary protected status or another Biden administration programme.\nMr Jean Prospere, a Haitian who lives in Springfield with his teenage son, Keith, said that he had been shaken by the attacks on Haitians.\n“I’m not feeling good,” he said.\n“I saw that information in social media networks, and it’s not real,” he said, referring to Haitians stealing neighbours’ pets for consumption.\nMr Prospere said he fled Haiti in 2019 after gangs extorted from him and threatened to kill him. He has applied for asylum and has received authorisation to work. Currently, he assembles car parts at a company outside Springfield.\n“I hope we can find a solution between Haitian people and American people in Springfield,” he said.\nThe frenzy has perhaps upset parents the most.\nMs Mills was dropping off two of her children at Snowhill Elementary a few minutes behind schedule on the morning of Sept 13 when she noticed that students were being escorted to several buses lined up outside.\nShe suspected that, following threats that shuttered schools a day earlier, “something crazy was going on”, she said.\nSoon her cellphone buzzed with a message from the district informing parents that the school had been evacuated, and their children were being relocated to the city’s high school to be picked up there. She drove off with her daughter, Trinity, eight, and son Gabriel, 10.\nMs Mills decided not to drop off her youngest child, Jason, four, at his pre-school programme. Fulton Elementary had reopened on Sept 13 after a bomb threat led to its closure and evacuation a day earlier.\n“Once I found out what was going on at Snowhill, I e-mailed his teacher at Fulton and said we’d rather be safe than sorry,” said Ms Mills. “She told me that very few kids were showing up.”\nMs Mills, who lives in the working-class area of Springfield, referred to as the South Side, said she has many Haitian neighbours. They had helped spruce up the neighbourhood, she said, because they were renting homes that had been boarded up or dilapidated.\n“There were many houses that had boards over windows or big old red X signs,” she said. “There are Haitians moving in and they are fixing them.”\nLocal police officers and federal agents with bomb-sniffing dogs eventually combed Snowhill Elementary on Sept 13 and declared the building safe. But the day was already lost, leaving many families unnerved.\nMs Michelle Johnson, 51, a life-long Springfield resident, sat on her front porch with three grandchildren, ages seven, 10 and 13. She has custody and had to go pick them up at school.\nShe thought the threats were just someone trying to get attention and she worried that the same thing was going to happen next week too. “When will it stop?” she asked.\nTeenager Jude said parents had pulled fellow students out of class after receiving a notice from the superintendent about threats to schools. A sophomore, Jude told his mother he wanted to stay in school to take an advanced placement history exam later in the day.\nBy lunchtime, hundreds of students had left the high school, he said, and the marching band’s hall rally, planned before a football game on the night of Sept 13, had been cancelled.\nMisinformation about Haitians on social media and bomb threats have become the main topic of conversation among his friends this week, he said.\n“Everybody is completely on edge,” Jude said.\n“It’s really stressful.” He added: “I feel that something big is about to happen, but I don’t know what it is.\n“What I am really hoping is that something big just happens,” he said, meaning a big news event elsewhere. “And it all dissolves from there – we are not in the national spotlight any more and nobody is accusing members of our immigrant community of eating our pets and spreading other lies”. NYTIMES", "url": "https://www.straitstimes.com/world/united-states/ohio-city-unnerved-by-bomb-threats-conspiracy-theories-in-wake-of-trump-s-false-claims"}