{"authors": [], "date_download": "2024-10-12 14:02:00", "date_modify": "2024-10-12 14:02:00", "date_publish": "2023-12-28 18:27:32", "description": "A Panama-flagged bulk carrier that was headed to a River Danube port to load grain has hit a mine in the Black Sea, the Ukrainian military said on Thursday. Read more at straitstimes.com.", "filename": "world_europe_bulk-carrier-hits-mine-in-black-sea-two-people-injured-ukraine-says_1728741720.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/28/LYNXMPEJBR07H-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_bulk-carrier-hits-mine-in-black-sea-two-people-injured-ukraine-says_1728741720.html", "title": "Bulk carrier hits mine in Black Sea, two people injured, Ukraine says", "title_page": "Bulk carrier hits mine in Black Sea, two people injured, Ukraine says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - A Panama-flagged bulk carrier that was heading to the River Danube port to load grain hit a Russian mine in the Black Sea, injuring two crew members, Ukrainian officials said on Dec 28.\nThe incident that took place on Dec 27 was the latest instance of a civilian vessel hitting an explosive in the Black Sea.\nKyiv has said increased Russian attacks on shipping and port infrastructure are to blame.\nRussia’s defence ministry did not immediately respond to a request for comment.\nA shipping source speaking on condition of anonymity told Reuters the Greek-operated VYSSOS was the vessel that had been hit. The vessel’s Athens-based manager, which was listed in databases as Nava Shipping, could not be immediately located for comment.\n“A Panama-flagged civilian vessel was blown up on an enemy sea mine in the Black Sea... The vessel lost its course and control, and a fire broke out on the upper deck,” Ukraine’s southern military command said on Telegram.\nA captain and a sailor, an Egyptian citizen, were injured, and the latter was taken to hospital in the city of Izmail, the head of the Odesa regional prosecutor’s office told a briefing.\nHe said the incident happened early on Dec 27 at a river mouth. The vessel stopped updating its position, according to the ship tracking and maritime analytics provider MarineTraffic.\nIt was heading to Izmail, the British maritime security company Ambrey told Reuters. The mine hit its stern, and detonation caused equipment and machinery failure.\nThere were 18 crew members onboard, 13 Egyptians, three Ukrainians, and two Turkish citizens.\nUkraine says Moscow has increased attacks on Ukraine’s port infrastructure since mid-July, when it quit a UN-brokered deal that allowed safe passage of Ukrainian grain shipments via the Black Sea.", "url": "https://www.straitstimes.com/world/europe/bulk-carrier-hits-mine-in-black-sea-two-people-injured-ukraine-says"}