{"authors": [], "date_download": "2024-10-12 13:39:41", "date_modify": "2024-10-12 13:39:41", "date_publish": "2024-07-24 23:21:37", "description": "WARSAW - Polish divers said on July 24 they had discovered a 19th-century shipwreck in the Baltic Sea off the Swedish coast, its hold replete with crates of champagne and porcelain. Read more at straitstimes.com.", "filename": "world_europe_champagne-filled-shipwreck-found-by-polish-divers_1728740381.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/24/shipwreckchampers25.jpg?VersionId=gM7RIlUdfjoE9AAG4QmmWxYvfymbiBZl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_champagne-filled-shipwreck-found-by-polish-divers_1728740381.html", "title": "Champagne-filled shipwreck found by Polish divers", "title_page": "Champagne-filled shipwreck found by Polish divers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WARSAW - Polish divers said on July 24 they had discovered a 19th-century shipwreck in the Baltic Sea off the Swedish coast, its hold replete with crates of champagne and porcelain.\nThe group said it was thrilled to find rare “treasure” on board when it came upon the presumed merchant vessel last week.\n“The whole wreck is loaded to the brim with crates of champagne, mineral water and china,” Mr Tomasz Stachura, the Baltictech diver group leader, told AFP.\nHe said the divers counted around 100 champagne bottles among the discovered items.\n“I have been diving for 40 years and it often happens that there is one bottle or two... to discover a wreck with so much cargo, it’s a first for me,” Mr Stachura added.\nThe discovery, made around 20 nautical miles (37km) south of the Swedish island of Oland, was largely a coincidence, according to the Polish divers who for years have been combing the seabed in search of sunken ships.\n“We were just checking out new spots out of pure curiosity and that’s when we came across this wreck,” Mr Stachura said.\nThe group said the discovery of sealed clay water bottles helped them determine that the vessel capsized in the second half of the 19th century.\n“We managed to take pictures of the brand name stamped on a clay bottle, which turned out to be one from the German company Selters - and the logo had this precise shape during that period,” Mr Stachura said.\nThe divers said they had notified Swedish regional authorities about the finding, but warned it would take a while for the champagne treasure to be extracted due to administrative restrictions.\n“It had been lying there for 170 years so let it lie there for one more year, and we will have time to better prepare for the operation,” Mr Stachura said. AFP", "url": "https://www.straitstimes.com/world/europe/champagne-filled-shipwreck-found-by-polish-divers"}