{"authors": ["Nirmal Ghosh"], "date_download": "2024-10-12 13:45:21", "date_modify": "2024-10-12 13:45:21", "date_publish": "2023-11-30 23:05:00", "description": "The degree to which the overall US-India ties are impacted depends largely on the responsiveness of Modi’s government. Read more at straitstimes.com.", "filename": "world_united-states_us-allegations-of-indian-murder-plot-unlikely-to-derail-ties-but-india-must-respond-analysts_1728740721.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/30/FILES-US-INDIA-DIPLOMACY-195132_0.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-allegations-of-indian-murder-plot-unlikely-to-derail-ties-but-india-must-respond-analysts_1728740721.html", "title": "US allegations of Indian murder plot unlikely to derail ties, but India must respond: Analysts", "title_page": "US allegations of Indian murder plot unlikely to derail ties, but India must respond: Analysts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON/NEW DELHI - The allegations in an indictment unsealed in New York on Nov 29 that an Indian citizen sought to arrange the assassination of a prominent Sikh separatist on United States soil are an embarrassment for the US-India relationship, but are unlikely to derail it.\nThough the allegations are bound to draw scrutiny in the US Congress, the Biden administration will seek to manage the fallout, analysts say, given increasing strategic convergence with India over China and the Indo-Pacific region.\nBut the degree to which the overall US-India ties are impacted depends largely on the responsiveness of Prime Minister Narendra Modi’s government over the issue, and whether it will provide reassurances that it will not happen again, says Ms Lisa Curtis, senior fellow and director of the Indo-Pacific Security Programme at the Centre for a New American Security, a think-tank.\nMs Curtis, who as deputy assistant to the president and National Security Council senior director for South and Central Asia from 2017 to 2021 helped craft US policy on India, told The Straits Times: “While the situation could strain the relationship in the near term, US-India ties will likely ultimately weather this storm.\n“They have each invested heavily in building ties over the last few years, and they both view China as the biggest threat to their national security. There is much at stake for both countries, and it’s in their mutual interest to find a way forward.”\nThe US Justice Department said an unnamed Indian government employee directed a plot targeting the Sikh activist, who was also unnamed but is understood to be Mr Gurpatwant Singh Pannun, a lawyer for the New York-based Sikhs for Justice. The group seeks a separate Sikh state called Khalistan out of India’s Punjab state.\nMr Pannun is a wanted man in India, which considers Sikhs for Justice a group that supports terrorism.\nThe Indian government employee allegedly recruited an Indian national named Nikhil Gupta to hire a local hitman to carry out the assassination. But the hitman, who was offered US$100,000 (S$133,000) for the job, was actually a confidential source working with the US Drug Enforcement Agency.\nThe plot was foiled in June. Nikhil Gupta, arrested in the Czech Republic in late June, has been charged with murder for hire and conspiracy to commit murder for hire. The US is seeking his extradition.\nWashington raised the plot with India’s government then, and New Delhi has set up a committee to investigate it. On Nov 30, Mr Arindam Bagchi, spokesman for India’s Ministry of External Affairs, said at a press conference: “Let me reiterate, this is… contrary to government policy.”\nThe episode came on the heels of the Canadian government accusing India of orchestrating the killing of a Khalistan activist and Canadian citizen, Mr Hardeep Singh Nijjar, also in June, in British Columbia.\nThe Canadian government has yet to produce any evidence in public, and the allegation was sharply rejected by New Delhi, which has long accused Canada of harbouring those it deems to be terrorists.\nThere is more at stake in the US case, however.\nFor President Joe Biden’s administration, a strong relationship with India is critical to its Indo-Pacific strategy – including the four-nation Quad, said Dr Aparna Pande, director of the Initiative on the Future of India and South Asia at the conservative Hudson Institute in Washington.\nThe Quad, or Quadrilateral Security Dialogue, comprises India, Australia, Japan and the US. India is due to host a summit of the Quad in 2024.\n“For the US, the primary threat remains China, and a strong India-US partnership is a key element of US national security strategy,” Dr Pande said.\n“For India too, the relationship with the US is one of its most important; India’s ambitions… are tied to a strong relationship with the US in the economic, defence and technological realms,” she told The Straits Times.\nBut she cautioned that an attempt on an American citizen is something that any US administration has to take seriously, saying: “Some reputational damage has already occurred.”\n“This will continue because of constant media references, social media tweets and broader discussion among the American public,” Dr Pande added.\n“India will thus need to find a way to sit down and talk with the US on this issue so that both sides can then move on and not allow this to linger for too long.”\nIn New Delhi, Mr Manoj Joshi, a distinguished fellow at the Observer Research Foundation think-tank, warned of a trust deficit, saying: “Security ties, which also include intelligence sharing, require a high level of trust. A trust deficit of sorts will arise.”\nHe added: “While the shared concern over the growing assertiveness of China would remain a driver in US-India ties, the onus was on India to clarify its role, if any, in the thwarted plot.”\nOtherwise, he said, “the situation will hang over the relationship, at least for a while”.\nMr Richard Rossow, chair in US-India Policy Studies at the Centre for Strategic and International Studies, a Washington think-tank, noted that the New York plot was uncovered well before major high-level India-US engagements, which still went ahead.\nThese included Mr Biden’s visit to New Delhi in September for the Group of 20 summit.\nThus, the issue is “thorny, but not enough to trigger a course change”, he said.\nAdditional reporting by Nirmala Ganapathy in New Delhi", "url": "https://www.straitstimes.com/world/united-states/us-allegations-of-indian-murder-plot-unlikely-to-derail-ties-but-india-must-respond-analysts"}