{"authors": [], "date_download": "2024-10-12 13:59:17", "date_modify": "2024-10-12 13:59:17", "date_publish": "2024-07-31 23:20:57", "description": "Countries taking part in the Games have set up pavilions across the French capital to beat the drum for their athletes and culture. Read more at straitstimes.com.", "filename": "world_europe_ukraine-olympic-pavilion-aims-to-jolt-west-over-war_1728741557.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/OLY-PARIS-2024-OPENING-180324.jpg?VersionId=xcoVnEVpIWwlOrFFNyjofFNboDhh4GB8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-olympic-pavilion-aims-to-jolt-west-over-war_1728741557.html", "title": "Ukraine Olympic pavilion aims to jolt West over war", "title_page": "Ukraine Olympic pavilion aims to jolt West over war | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The damaged blue and yellow seats from a stadium destroyed by Russian troops stand at the entrance to the “Ukraine House” at the Paris Olympics.\nCountries taking part in the Games have set up pavilions across the French capital to beat the drum for their athletes and culture.\nBut Ukraine House, which sits next to Club France in Parc de la Villette in northern Paris, stands out. It is a gritty celebration of Ukrainian national identity and the fighting spirit and ingenuity of its people, both on the battlefield and in sport.\nThere is the homemade barbell made from a pipe and two tyres like the one high jumper Andriy Protsenko used to train with when Russian troops occupied his home region of Kherson in the south.\nA mockup of the Donetsk airport, a symbol of Ukraine’s resistance, is also on display.\nThe world’s biggest sporting competition is taking place as Russia’s invasion stretches into its third year, making a mockery of the idea of an Olympic truce.\nThe Kremlin’s troops are slowly advancing in the east while Kyiv’s forces are outgunned and exhausted.\nWith 140 athletes competing for medals, the Games are a chance for Ukraine to make sure its fight for survival is not forgotten at a time of waning interest in the West.\nJoy, anger, sorrow\n“I ask you not to forget about Ukraine,” Sports Minister Matviy Bidnyi pleaded at the pavilion’s opening at the weekend.\nDozens of guests stood up for the Ukrainian national anthem and observed a moment of silence, with French Sports Minister Amelie Oudea-Castera and World Athletics head Sebastian Coe pledging continued support.\nBut despite the promises of aid, it is becoming harder for Ukraine to make its voice heard, especially at a time of fears of a wider conflict in the Middle East.\nThe programme at Ukraine House offers a rollercoaster of emotions from anger and sorrow to pride and joy as organisers seek to pull at people’s heartstrings.\nThe country’s athletes including star tennis player Elina Svitolina and Yaroslava Mahuchikh, who has just set a new world record in the women’s high jump, are scheduled to drop by for interviews.\nVisitors will also get the chance to learn how to cook borscht, Ukraine’s iconic beetroot soup, but also an opportunity to watch 20 Days In Mariupol, a harrowing documentary which won the best documentary Oscar in March.\nSinger Jamala, who won the 2016 Eurovision Song Contest, said countries of “the first world” needed to see that “disgusting things” are continuing to happen to Ukraine.\n“OK, it’s not fresh news, but we still need your help,” she said.\n“Our kids are dying every day. Our men are dying. Our women get raped.”\n‘Look at this’\nNext week, the pavilion will welcome two children injured in the war – eight-year-old gymnast Oleksandra Paskal and runner Yana Stepanenko, 13.\nOleksandra lost her leg in a Russian attack on the southern region of Odesa two years ago. But after undergoing rehabilitation she continues to train and compete.\nYana, who lost both her lower legs in a Russian attack on the Kramatorsk train station, ran five kilometres on prosthetics in the Boston Marathon in 2023.\n“You should look at this,” Sports Minister Mr Bidnyi told AFP.\n“Tomorrow, this can come to your country.”\nThe 44-year-old said it was hard for people to understand what Ukrainians were going through. “It’s a different planet,” he said.\nIn early July, Mr Bidnyi’s wife lost her 20-year-old cousin as Russia struck a business centre and a leading children’s hospital in Kyiv, among other sites.\n“I found her headless body,” he said.\n“People should not be seeing things like this.”\nThe July 8 Russian strikes on Kyiv killed 33 people including five children and left more than 120 injured.\nPresident Volodymyr Zelensky skipped the Olympic opening ceremony in Paris and is not expected to attend the Games which close on Aug 11.\nAs the Olympics got under way, Mr Zelensky and his wife Olena visited young patients at the devastated Kyiv hospital.", "url": "https://www.straitstimes.com/world/europe/ukraine-olympic-pavilion-aims-to-jolt-west-over-war"}