{"authors": [], "date_download": "2024-10-12 14:18:35", "date_modify": "2024-10-12 14:18:35", "date_publish": "2023-03-18 10:41:28", "description": "A speech transcript provided a window into Huawei’s efforts to bounce back from US trade restrictions. Read more at straitstimes.com.", "filename": "world_united-states_huawei-has-replaced-thousands-of-us-banned-parts-in-its-products-founder-says_1728742715.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/18/2023-03-06T184416Z1735641821RC2HOZ988TC3RTRMADP3GERMANY-CHINA-HUAWEI-TECH_0.JPG?VersionId=aNSCWcoi3tgbx00O696ynmd9iUma0Khy", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_huawei-has-replaced-thousands-of-us-banned-parts-in-its-products-founder-says_1728742715.html", "title": "Huawei has replaced thousands of US banned parts in its products, says founder", "title_page": "Huawei has replaced thousands of US banned parts in its products, says founder | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAN FRANCISCO – Huawei Technologies has replaced more than 13,000 parts in its products that were hit by US trade sanctions, the Chinese tech giant’s founder said, according to a speech transcript posted on Friday by a Chinese university.\nAccording to the transcript of the February speech posted by Shanghai Jiao Tong University, Mr Ren Zhengfei said Huawei had over the past three years replaced the 13,000 components with domestic Chinese substitutes and had redesigned 4,000 circuit boards for its products.\nHe said production of circuit boards had “stabilised”.\nThe remarks, which Reuters could not independently verify, provided a window into Huawei’s efforts to bounce back from US trade restrictions.\nSince 2019, Huawei, a major supplier of equipment used in 5G telecommunications networks, has been the target of successive rounds of US export controls.\nThose controls cut off both Huawei’s supply of chips from US companies and its access to US technology tools to design its own chips and have them manufactured by partners.\nThe Biden administration last year also banned the sale of new Huawei equipment in the United States.\nMr Ren made the remarks in a talk to Chinese technology experts on Feb 24, the university said.\nThe university posted the transcript on its website on Friday.\nA US-based Huawei representative did not immediately respond to a request for comment on Friday.\nMr Ren said Huawei invested US$23.8 billion (S$32 billion) in research and development in 2022, and “as our profitability improves, we’ll continue to increase R&D spending”.\nThe founder said the company had built its own enterprise resource planning system, called MetaERP.\nTo launch in April, it will help run the firm’s core business functions, including finance, supply chain and manufacturing operations.\nMr Ren said Huawei has no plans to launch a rival to the wildly popular artificial intelligence (AI) chatbot ChatGPT, but said Microsoft, the backer of the application’s developer OpenAI, would not be the only dominant player.\nHe said Huawei is focusing on being the “underlying computing power platform” of AI. REUTERS", "url": "https://www.straitstimes.com/world/united-states/huawei-has-replaced-thousands-of-us-banned-parts-in-its-products-founder-says"}