{"authors": [], "date_download": "2024-10-12 13:42:32", "date_modify": "2024-10-12 13:42:32", "date_publish": "2024-09-10 22:42:32", "description": "DAKAR - The Senegalese navy on Tuesday found 17 more bodies from a boat carrying migrants that capsized off the coast, taking the death toll to 26. Read more at straitstimes.com.", "filename": "world_death-toll-from-migrant-boat-that-capsized-off-senegal-rises-to-26_1728740552.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/ST-logo-placeholder_21.jpg?VersionId=cI3XJsKXsC0EU8_E7d5BoxvJjxoUc97p", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_death-toll-from-migrant-boat-that-capsized-off-senegal-rises-to-26_1728740552.html", "title": "Death toll from migrant boat that capsized off Senegal rises to 26", "title_page": "Death toll from migrant boat that capsized off Senegal rises to 26 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DAKAR - The Senegalese navy on Tuesday found 17 more bodies from a boat carrying migrants that capsized off the coast, taking the death toll to 26.\nThe Atlantic migration route from the coast of West Africa to the Canary Islands, typically used by African migrants trying to reach Spain, is one of the world's deadliest.\nYears of Islamist conflict in the Sahel region, unemployment and the impact of climate change on farming communities are among the reasons why people attempt the crossing.\nThe boat that capsized - a narrow, wooden fishing vessel known as a pirogue - was carrying over 100 migrants from the Senegalese town of Mbour. It overturned after travelling for only 4 km (2.5 miles), state broadcaster Radio Television Senegalaise reported on Sunday.\nThe Senegalese navy sent three boats and a Spanish plane as part of search and rescue efforts. It gave the latest death toll in a post on its X account on Tuesday.\nOn Monday the navy said nine bodies had been recovered and an unknown number of people had been rescued by local fishermen, the same day it stopped two other boats carrying 421 people trying to migrate.\nThe route from Africa to the Canary Islands has seen a 154% surge in migrants this year, with 21,620 crossings to the archipelago in the first seven months of 2024, according to data from the European Union's border agency.\nSpanish authorities say as many as 150,000 more migrants from Africa may be set to make the crossing this year. REUTERS", "url": "https://www.straitstimes.com/world/death-toll-from-migrant-boat-that-capsized-off-senegal-rises-to-26"}