{"authors": [], "date_download": "2024-10-12 14:03:36", "date_modify": "2024-10-12 14:03:36", "date_publish": "2023-03-28 17:04:03", "description": "MOSCOW - Possible drone attacks against key energy infrastructure are a serious threat to Russia’s energy security, Energy Minister Nikolai Shulginov said on Tuesday. Read more at straitstimes.com.", "filename": "world_europe_russia-says-drone-attacks-on-energy-infrastructure-are-key-threat_1728741816.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/28/2023-03-27T075244Z1323585406RC2720ADV2NDRTRMADP3RUSSIA-BLAST_1.JPG?VersionId=RC97Z8vG9NsGAouk8EhnKfBbtzrvgR7v", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-says-drone-attacks-on-energy-infrastructure-are-key-threat_1728741816.html", "title": "Russia says drone attacks on energy infrastructure are key threat", "title_page": "Russia says drone attacks on energy infrastructure are key threat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Possible drone attacks against key energy infrastructure are a serious threat to Russia’s energy security, Energy Minister Nikolai Shulginov said on Tuesday.\nMr Shulginov did not mention Ukraine by name, but Russia says it has foiled a number of attempted Ukrainian drone attacks in recent months.\nUkraine has not publicly acknowledged launching attacks against targets inside Russia, but senior officials in Kyiv have on occasion appeared to welcome the news of successful drone attacks on Russian soil.\n“The key threat now is acts of illegal interference through the use of unmanned aerial vehicles (UAVs),” Mr Shulginov said during a roundtable discussion where he addressed the security of Russia’s energy facilities.\nHe said he was cooperating with Russia’s Defence Ministry and FSB security service on the issue.\nRussia has previously reported drone attacks in several towns and cities, some of them hundreds of kilometres from its border with Ukraine.\nOn Sunday, the ministry said it had halted a UAV attack in a town 220km south of Moscow, bringing down the drone over residential houses in the town of Kireyevsk.\nRussia accused Ukraine of mounting drone attacks on air bases deep inside Russian territory in December 2022, including the main base for strategic bomber planes near the city of Saratov, after flying hundreds of kilometres through Russian airspace.\nRussia itself has launched waves of missile and drone strikes against Ukraine’s energy infrastructure over the past six months of the conflict, often knocking out power for millions of civilians across Ukraine.\nREUTERS", "url": "https://www.straitstimes.com/world/europe/russia-says-drone-attacks-on-energy-infrastructure-are-key-threat"}