{"authors": [], "date_download": "2024-10-12 13:49:09", "date_modify": "2024-10-12 13:49:09", "date_publish": "2023-12-12 01:25:53", "description": "Of the nearly 15,000 freshwater fish species assessed, 25 per cent were at risk of extinction. Read more at straitstimes.com.", "filename": "world_freshwater-fish-swim-into-trouble-as-climate-change-increases-threat-iucn_1728740949.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/12/AtlanticSalmonMale28519859055429.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_freshwater-fish-swim-into-trouble-as-climate-change-increases-threat-iucn_1728740949.html", "title": "Freshwater fish swim into trouble as climate change increases threat: IUCN", "title_page": "Freshwater fish swim into trouble as climate change increases threat: IUCN | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI - A quarter of freshwater fish species worldwide are at risk of extinction, according to an update to the global red list of threatened species on Monday, highlighting the escalating impacts of human-caused climate change on the planet’s wildlife.\nThe assessment published by the International Union for Conservation of Nature (IUCN) also updated its list to reflect climate change threats to Atlantic Salmon, green turtles and Big leaf mahogany trees.\n“Climate change is menacing the diversity of life our planet harbours and undermining nature’s capacity to meet basic human needs,” IUCN Director General Grethel Aguilar said in a statement.\nOf the nearly 15,000 freshwater fish species assessed, 25 per cent were at risk of extinction and of those at least 17 per cent were suffering consequences of climate change, including fluctuating water levels and shifting seasons.\nThe IUCN ranks a species’ risk of extinction along nine categories ranging from “not evaluated” to “extinct”.\nAtlantic salmon experienced a 23 per cent decrease between 2006 and 2020, rising along the list from of “least concern” to “near threatened”.\nGlobal warming is affecting “all stages” of its lifecycle – reducing prey, allowing invasive species to expand, and increasing deaths of young salmon due to water pollution linked mostly to logging and agriculture, IUCN said in a statement.\nGreen turtles in the Central South Pacific and East Pacific were classified as “endangered” and “vulnerable” respectively in the update.\nRising sea temperatures decrease hatching success and reduce the seagrass green turtles rely on for food. Rising sea levels flood nests and drown the young, while adult turtles are often caught and killed as a by-product of industrial fishing.\nThe big leaf mahogany tree was reclassified from “vulnerable” to “endangered” due to the unsustainable harvesting of sought-after timber and agricultural encroachment on the tropical forests where it grows.\nBut the updated list also showed the power of conservation efforts.\nThe scimitar-horned oryx improved from “extinct in the wild” to “endangered” after conservationists successfully reintroduced the species in Chad.\nThe previously “critically endangered” saiga antelope rose to “near threatened” on the list. Between 2015 and 2022 its population, living mostly in Kazakhstan, increased by 1,100 per cent as a result of stringent anti-poaching measures and enforcement.\nBut both species are at risk of rising threats from climate change in the regions where they live.\nThe scimitar-horned oryx faces more frequent and severe droughts in the Sahel region of Africa. And in 2015 saiga antelopes suffered “mass mortality” due to “abnormally high temperatures and humidity” in the region, according to the authors.\n“To ensure the results of conservation action are durable, we need to decisively tackle the interlinked climate and biodiversity crises,” said IUCN President Razan Al Mubarak.\nThe IUCN Red List now includes 157,190 species, of which 44,016 are threatened with extinction.\nThe updated list comes as nations race against the clock to reach an agreement during this year’s COP28 climate conference in Dubai, scheduled to end Tuesday. AFP", "url": "https://www.straitstimes.com/world/freshwater-fish-swim-into-trouble-as-climate-change-increases-threat-iucn"}