{"authors": [], "date_download": "2024-10-12 13:35:53", "date_modify": "2024-10-12 13:35:53", "date_publish": "2024-07-31 18:29:32", "description": "MADRID - Hundreds of firefighters backed up by waterbomber aircraft sought to contain two wildfires that have raged since Tuesday in eastern Spain, and much of the rest of the country is on red alert for heat and fires. Read more at straitstimes.com.", "filename": "world_europe_wildfires-rage-in-spain-as-heatwave-peaks_1728740153.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/LYNXMPEK6U0GQ-1.jpg?VersionId=FXZP9hUHaj8ydqruzy77hJte2S9fu2KA", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_wildfires-rage-in-spain-as-heatwave-peaks_1728740153.html", "title": "Wildfires rage in Spain as heatwave peaks", "title_page": "Wildfires rage in Spain as heatwave peaks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MADRID - Hundreds of firefighters backed up by waterbomber aircraft sought to contain two wildfires that have raged since Tuesday in eastern Spain, and much of the rest of the country is on red alert for heat and fires.\nA blaze in Benasau in the eastern region of Valencia forced emergency services to remove several hundred villagers from their homes as a precaution when it broke out in nearby hills.\nFirefighters said the \"fire is evolving favourably\" following all-night efforts.\nAnother one, in the province of Cuenca more inland, has burnt through more than 1,500 hectares of vegetation since Tuesday. Both blazes have been qualified as severe.\nWeather service AEMET predicted maximum temperatures of 43-44 degrees Celsius (109.4-111.2°F) in parts of the country on Wednesday, which is expected to be the peak day of a heatwave, while the interior ministry warned of very high or extreme risk of wildfires across Spain.\nAEMET said that the Barcelona-Fabra observatory in the northeastern region of Catalonia registered an all-time high temperature of 40 C on Tuesday, beating its previous record of 39.8 C (103.64°F) set in July 1982.\nThis is the third heatwave in Spain over the last two weeks.\nRising global temperatures due to climate change have also contributed to more frequent wildfires elsewhere - from China to Canada. In Europe, they are also raging in the Balkans region. REUTERS", "url": "https://www.straitstimes.com/world/europe/wildfires-rage-in-spain-as-heatwave-peaks"}