{"authors": [], "date_download": "2024-10-12 13:37:07", "date_modify": "2024-10-12 13:37:07", "date_publish": "2024-09-06 08:30:00", "description": "White House seeks discounted server bandwidth from tech giants to support VPNs. Read more at straitstimes.com.", "filename": "world_united-states_us-calls-on-big-tech-to-help-evade-online-censors-in-russia-iran_1728740227.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/06/2024-09-05T173718Z1095079332RC2GU9ACFRNNRTRMADP3USA-RUSSIA-HACK.JPG?VersionId=MfLOLVdsgJGzryTHm2R65H7i0eDOm68C", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-calls-on-big-tech-to-help-evade-online-censors-in-russia-iran_1728740227.html", "title": "US calls on Big Tech to help evade online censors in Russia and Iran", "title_page": "US calls on Big Tech to help evade online censors in Russia and Iran | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The White House, aiming to persuade US tech giants to offer more digital bandwidth for government-funded internet censorship evasion tools, held a meeting with representatives of Amazon.com, Alphabet’s Google, Microsoft, Cloudflare and others on Sept 5.\nThe tools have seen a surge of usage in Russia, Iran, Myanmar and authoritarian states that heavily censor the internet.\nThe pitch to tech companies was to help offer discounted or heavily subsidised server bandwidth to meet the fast-growing demand for virtual private network (VPN) applications funded by the US-backed Open Technology Fund (OTF), the organisation’s president Laura Cunningham told Reuters.\n“Over the last few years, we have seen an explosion in demand for VPNs, largely driven by users in Russia and Iran,” she said. “For a decade, we routinely supported around nine million VPN users each month, and now that number has more than quadrupled.”\nVPNs help users hide their identity and change their online location, often to bypass geographic restrictions on content or to evade government censorship technology, by routing internet traffic through external servers outside of that government’s control.\nThe OTF specifically backs VPNs that are designed to work in states that restrict access to the internet. The US injected increased funding into VPNs supported by the OTF following Russia’s invasion of Ukraine in 2022, Reuters exclusively reported at the time.\nThe organisation has since received a boost to its budget from the US State Department via its Surge and Sustain Fund for Anti-Censorship Technology, an initiative created at the Biden administration’s Summit for Democracy.\nBut it has struggled to meet increased demand in countries like Russia, Myanmar, and Iran, where internet censorship heavily restricts access to outside information.\nAround 46 million people a month now use US-backed VPNs, Ms Cunningham said, but added that a sizeable chunk of the budget was taken up by the cost of hosting all that network traffic on private sector servers.\n“We want to support these additional users, but we don’t have the resources to keep up with this surging demand,” she said.\nRepresentatives of Amazon Web Services, Google, and Microsoft did not immediately respond to a request from Reuters for comment.\nA Cloudflare spokesperson said the firm was working with researchers to “better document internet shutdowns and censorship”. REUTERS", "url": "https://www.straitstimes.com/world/united-states/us-calls-on-big-tech-to-help-evade-online-censors-in-russia-iran"}