{"authors": [], "date_download": "2024-10-12 14:00:30", "date_modify": "2024-10-12 14:00:30", "date_publish": "2022-04-23 08:03:09", "description": "This is Moscow’s first admission of the losses following the sinking of the flagship. Read more at straitstimes.com.", "filename": "world_europe_moscow-says-1-dead-27-missing-after-moskva-cruiser-sinking__gl=1_1thxk49__gcl_au_MTkxOTI1NzUuMTcxNDY1NzIwMQ._1728741630.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/23/md_battleship_23042022.jpg?VersionId=8kD8kPSGL_8C96shvC6eNbdOmIDiZ.QC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_moscow-says-1-dead-27-missing-after-moskva-cruiser-sinking__gl=1_1thxk49__gcl_au_MTkxOTI1NzUuMTcxNDY1NzIwMQ._1728741630.html", "title": "Moscow says 1 dead, 27 missing after Moskva cruiser sinking", "title_page": "Moscow says 1 dead, 27 missing after Moskva cruiser sinking | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW (AFP) - Russia said on Friday (April 22) that one crew member died and 27 were missing after the Moskva missile cruiser sank last week, Moscow's first admission of the losses following the tragedy.\nThe flagship of Russia's Black Sea Fleet had been leading Russia's naval effort in the nearly two-month conflict in Ukraine, playing a central role in the siege of the port city of Mariupol.\nAfter the Moskva sank, parents and other family members of sailors who served aboard - including conscripts - took to social media, saying their children had gone missing and that they needed answers.\n\"As a result of a fire on April 13, the Moskva missile cruiser was seriously damaged due to the detonation of ammunition,\" the defence ministry said in a statement carried by Russian news agencies late Friday.\n\"One serviceman was killed, another 27 crew members went missing,\" the ministry said, adding that \"the remaining 396 members\" had been evacuated.\nA senior Pentagon official said the Moskva warship was hit by two Ukrainian missiles before it sank in the Black Sea.\nThe Russian defence ministry made the announcement after authorities first said that all crew members had been evacuated.\n\"The Russian defence ministry is providing all the necessary support and assistance to the families and friends of the deceased and the missing,\" the statement said.\nIt said that \"an absolute majority\" of contract servicemen wished to continue their service aboard vessels of the Black Sea Fleet.\nIn recent days, a number of Russian parents called for the truth about their missing children, but the Kremlin had previously refused to reveal any details about the casualties aboard the warship which is able to carry up to 680 sailors.\nSeveral families have said on social media or in statements to independent Russian or foreign press that they cannot find their children who were serving on the Moskva.\nOne parent, Dmitry Shkrebets, said on social media that when he tried to learn more about the fate of his missing son, the commander of the cruiser and his deputy had gone incommunicado.\nAsked to comment on the situation on Tuesday, President Vladimir Putin's spokesman said the Kremlin was not at liberty to reveal any details.\nMeduza, an independent Russian-language news website, citing a source close to the command of Russia's Black Sea Fleet, said 37 members of the Moskva's crew had died.", "url": "https://www.straitstimes.com/world/europe/moscow-says-1-dead-27-missing-after-moskva-cruiser-sinking?_gl=1*1thxk49*_gcl_au*MTkxOTI1NzUuMTcxNDY1NzIwMQ.."}