{"authors": [], "date_download": "2024-10-12 14:18:37", "date_modify": "2024-10-12 14:18:37", "date_publish": "2023-12-12 00:23:33", "description": "Prices of eggs are up by 40 per cent in November from the same time in 2022. Read more at straitstimes.com.", "filename": "world_europe_rising-egg-prices-show-cracks-in-sanctions-hit-russian-economy_1728742717.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/12/bteggs20231212.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_rising-egg-prices-show-cracks-in-sanctions-hit-russian-economy_1728742717.html", "title": "Rising egg prices show cracks in sanctions-hit Russian economy", "title_page": "Rising egg prices show cracks in sanctions-hit Russian economy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russians have voiced concern about the growing cost of a basic food staple – eggs – pointing to the fragile state of the sanctions-hit economy, as President Vladimir Putin seeks a fifth term in office.\nMr Putin has said he would run for re-election in March in a vote that falls over two years after he launched a military operation that led to mass casualties and triggered Western sanctions.\nHe has repeatedly praised his economy’s resilience against the sanctions, but the Russians’ buying power is shrinking, with inflation accelerating to 7.5 per cent year on in November.\nAnd the price jump in eggs – they are up by 40 per cent in November from the same time in 2022, according to the Russian statistics agency Rosstat – couldn’t come at a politically worse time, as they are a key ingredient for many traditional Russian holiday dishes.\n“I’m horrified!... What’s going on with the prices is a nightmare, and not just for eggs, but for everything,” 76-year-old pensioner Yelizaveta Shalayevskaya told AFP in Moscow on Monday.\n“I used to buy eggs for 70 roubles (S$1) at the shop, now it costs around 130-140,” 21-year-old student Ilya Zarubin told AFP.\nMs Nina Nevarenykh, a 65-year-old pensioner, agreed that egg prices have risen sharply.\n“I do not understand why (eggs) have gone up, but it’s a fact... I can feel how my wallet is impacted,” she said.\nExperts cited in Russian media said the increase was triggered by a rise in the prices of poultry feed and veterinary products, itself indirectly caused by Western sanctions on imported goods.\n‘Eggs for everyone’\nThe increase has the authorities worried.\nGeneral prosecutor Igor Krasnov launched checks to probe potentially unjustified price increases from sellers and producers.\nThe Federal Service for Veterinary and Phytosanitary Supervision – Rosselkhoznadzor – in the meantime authorised the import of eggs from Turkey.\nThe agriculture ministry also suggested a six-month ban on the export of Russian eggs.\nIn the southern city of Belgorod, near Ukraine, the authorities called for calm after people queued for eggs over the weekend.\nIn a scene reminiscent of the Soviet Union, videos on social media showed people queueing in the snow in the hope of getting cheaper priced eggs at an agricultural fair.\n“There won’t be any shortage... there will be eggs for everyone,” regional vice-governor Yulia Shchedrina said on Telegram.\nShe nonetheless announced to limit sales to 20 eggs per person.\nEgg prices are scrutinised by Russian families who are getting ready for winter celebrations.\nEggs are a vital ingredient of many traditional Russian holiday dishes including the mayonnaise-heavy Russian “Olivier” salad, a staple of the New Year’s feast.\nMs Yelena, a 60-year-old manager living in Moscow, was not about to give up on the beloved dish.\n“I will make Olivier salad for the New Year no matter what, even if food has become more expensive,” she told AFP.", "url": "https://www.straitstimes.com/world/europe/rising-egg-prices-show-cracks-in-sanctions-hit-russian-economy"}