{"authors": [], "date_download": "2024-10-12 14:05:37", "date_modify": "2024-10-12 14:05:37", "date_publish": "2023-04-19 06:54:09", "description": "Michel told a federal jury that Low hired him to be a “celebrity surrogate” to get the photo. Read more at straitstimes.com.", "filename": "world_united-states_rapper-pras-michel-says-malaysian-fugitive-jho-low-paid-27-million-for-obama-photo_1728741937.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/19/2023-04-03T152324Z718411694RC2270AZ7AQTRTRMADP3USA-JUSTICE-DICAPRIO_3.JPG?VersionId=63jFjwjI4lX5pPHuUdrRCF2r.niyKpO.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_rapper-pras-michel-says-malaysian-fugitive-jho-low-paid-27-million-for-obama-photo_1728741937.html", "title": "Rapper Pras Michel says Malaysian fugitive Jho Low paid $27 million for Obama photo", "title_page": "Rapper Pras Michel says Malaysian fugitive Jho Low paid $27 million for Obama photo | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Grammy-winning rapper Pras Michel told jurors on Tuesday at his illegal lobbying trial that party-boy Malaysian tycoon Jho Low – once a friend and now a fugitive – paid him US$20 million (S$27 million) to get a photo with former United States president Barack Obama in 2012.\nMichel told a federal jury in Washington that Low had hired him to be a “celebrity surrogate” to get the photo.\nThe rapper is accused of using straw donors to funnel illegal donations from Low into Mr Obama’s campaign.\nProsecutors say he later illegally lobbied former president Donald Trump’s administration to drop US probes of Low’s alleged looting of billions of dollars from the Malaysian development fund 1MDB.\nMichel, a member of the hip-hop band Fugees, said he witnessed Low’s wild lifestyle filled with celebrities, nightclubs, models and free-flowing cash.\nHe described the tycoon as a “wealthy man willing to do anything, spend any type of money” to get his photo with Mr Obama, but that Low’s reputation made him “too hot” to get an invitation to fund-raisers. Michel said he initially agreed to help, but at a price.\n“I basically asked for US$1 million to begin to think about how I would get this photo,” Michel said as a lawyer questioned him. “I was going to try.”\nUltimately, Low paid Michel US$20 million over nine months, which led to the tycoon getting photographed with Mr Obama at a White House Christmas party, the rapper said.\nDuring the first three weeks of the trial, prosecutors alleged that Michel, 50, was driven by greed and pocketed US$18 million of the US$20 million that Low paid to gain access to Mr Obama.\nThey also say he made at least US$70 million more for his role in a scheme to lobby the Trump administration to drop its investigations of Low.\nMichel was later indicted along with Low, who remains at large and is believed to be in China.\nMichel said he never made any donations on behalf of Low and did not believe the political donations were illegal.\nBut on cross-examination, prosecutor John Keller got Michel to admit the money came from Low, and that the rapper reimbursed his friends for the political donations they made to support Mr Obama.\n“Once Jho Low gave me the money, it was my money,” Michel said.\nHe added: “It’s what the market is willing to bear. Give me my money, and I’ll try to figure it out.”\nMichel said the money was a gift, not income, and he was free to do what he liked with it.\n“I would say it’s free money,” Michel said. “I didn’t work for it. I was having fun trying to get a photo for President Obama.”\nMr Keller showed jurors letters that a lawyer for Michel wrote in 2019 to three friends who were straw donors, saying they should regard the money from Michel as loans, not gifts. Michel said he regretted the letters.\n“That was a bad idea,” Michel said. “I was scared. I just did something stupid.”\n‘Party Guy’\nMichel said he helped with a July 2012 fund-raiser for Mr Obama in Miami, where the entry was US$40,000 a head, insisting he used his own money – not Low’s – to pay for three Haitian friends to attend.\nBut Michel said he could not convince Mr Obama’s campaign to let Low attend that event or another one that September.\n“My understanding is that the campaign thought he was too hot,” Michel said.\n“They didn’t want the optics at that time. At that point, Jho Low was a party guy – Vegas, champagne, parties with Paris Hilton. The campaign just didn’t want that.”\nLow did not attend the second event, where Low’s father sat next to Mr Obama.\nThat event was at the Washington house of Obama fund-raiser Frank White Jr, who asserted his Fifth Amendment right against self-incrimination rather than testify at Michel’s trial.\nJurors saw several photos of Mr Obama at the event.\nAfter Michel discussed the holiday party photo, he answered questions about his efforts to push the US to extradite Chinese billionaire Guo Wengui, a vocal critic of Beijing.\nMichel said he met voluntarily several times with Federal Bureau of Investigation agents to discuss Guo and three Americans being held hostage in China, including a pregnant woman.", "url": "https://www.straitstimes.com/world/united-states/rapper-pras-michel-says-malaysian-fugitive-jho-low-paid-27-million-for-obama-photo"}