{"authors": [], "date_download": "2024-10-12 13:47:45", "date_modify": "2024-10-12 13:47:45", "date_publish": "2024-10-11 07:10:00", "description": "Living through a single major hurricane can cause anxiety, depression and post-traumatic stress. Read more at straitstimes.com.", "filename": "world_united-states_how-back-to-back-hurricanes-harm-mental-health_1728740865.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/11/US-WEATHER-HURRICANE-MILTON-212010.jpg?VersionId=BXGtMaLD1t3yoC2k4LyS6ziGhv9TdbPk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_how-back-to-back-hurricanes-harm-mental-health_1728740865.html", "title": "How back-to-back hurricanes harm mental health", "title_page": "How back-to-back hurricanes harm mental health | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "FLORIDA – As Hurricane Milton battered Florida’s Gulf Coast on Oct 10, Ms Chloe Ottani followed the news with horror from her parents’ Connecticut home. She had just evacuated her apartment at the University of Tampa for the second time in two weeks.\nMs Ottani and other students were evacuated on Oct 8 as the hurricane morphed into a Category 5 storm. The mayor of Tampa, Ms Jane Castor, warned that day that those who remained in evacuation zones were “going to die”.\n“I haven’t put my phone down for the last 24 hours,” Ms Ottani, 21, said on Oct 10.\nBy Oct 10, the hurricane, which landed as a Category 3 storm, had killed at least four people and left more than 3.3 million without power as it crossed central Florida before returning to sea. In several Gulf Coast counties, the authorities were assessing the damage and clearing debris.\nFor Ms Ottani and other Gulf Coast residents, this and other recent storms have taken a toll on their mental health. In 2022, Hurricane Ian pulverised large swathes of south-western Florida.\nTwo weeks ago, Hurricane Helene tore through many of the same communities as a Category 4 storm before ploughing north through Georgia and into the Blue Ridge Mountains. With wreckage from Helene still piled up on street corners this week, many Floridians fled or fortified their homes once more as Milton, one of the strongest Atlantic hurricanes ever, approached.\nLiving through a single major hurricane can cause anxiety, depression and post-traumatic stress. Experiencing repeated disasters, particularly in a short period of time, can exacerbate those effects, making people more vulnerable to mental health issues and prolonging the time it takes for them to recover emotionally.\nOne study of Florida residents who lived through hurricanes Irma and Michael in 2017 and 2018 found that experiencing two hurricanes in such close succession compounded their psychological distress.\n“It traps people in this cycle of anxiety and trauma,” said Ms Laura Wright, a psychologist and the training director of counselling services at Florida Gulf Coast University in Fort Myers.\nOn Oct 8, Ms Wright, her partner and her 16-year-old son drove 144km to Fort Lauderdale, Florida, leaving behind a 100-year-old home. They had just finished fixing the damage caused by Hurricane Ian two years ago and dreaded the condition they might find it in after Hurricane Milton passed.\n“My family and I are pretty exhausted from the back-to-back storm stress,” she said on Oct 10.\nIn the days before the hurricane, Ms Wright described feeling “anticipatory anxiety” – not knowing what was going to happen and fearing the worst.\n“It’s like waiting for the ball to drop. You can’t relax,” said Ms Becky Mossoney, a retiree who lives in Lake Suzy, Florida. She kept herself busy the day before the hurricane made landfall by filling her bathtub with water and her freezer with ice, and by coordinating with neighbours to fuel up a generator in their community clubhouse. The community was left without power for 12 days after Hurricane Ian, and this storm was predicted to be even more damaging.\nThe mental health impacts of back-to-back storms can be magnified for people without financial resources to recover damaged homes or vehicles, or to recoup lost income from businesses being closed. It can also lead to paralysing fear in young people unaccustomed to having to make major decisions like whether to evacuate, said Ms Melissa Brymer, director of the terrorism and disaster programmes at the UCLA and Duke University National Centre for Child Traumatic Stress.\n“Home feels so far away in these moments when you can’t go home. That isolation, and the burden of their choice, causes incredible anxiety,” she said.\nMs Ottani said she chose the University of Tampa for its design programme and great weather. But her college experience has been marked by fear and grief over the tremendous damage south-western Florida has sustained from recent storms. A few weeks ago, she helped her neighbours in Tampa clear out their waterlogged homes, tossing their destroyed furniture onto the curb after Hurricane Helene had passed. This week, she listened as a county sheriff urged people to write their names in permanent marker on their bodies as another major hurricane approached.\n“It has really affected my academics but also my well-being,” she said. “It is extremely hard to worry about school when you are terrified for your life and the city that you love.” NYTIMES", "url": "https://www.straitstimes.com/world/united-states/how-back-to-back-hurricanes-harm-mental-health"}