{"authors": [], "date_download": "2024-10-12 13:44:27", "date_modify": "2024-10-12 13:44:27", "date_publish": "2023-04-27 06:55:58", "description": "A shortage of planes and labour, as well as high oil prices, have contributed to the issue. Read more at straitstimes.com.", "filename": "world_why-flying-is-so-expensive-and-likely-to-remain-that-way_1728740667.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/27/rrflying2704_3.jpg?VersionId=yCRsQhsBmmbTemTnrNqV9WHSXTmDWpBr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_why-flying-is-so-expensive-and-likely-to-remain-that-way_1728740667.html", "title": "Why airfares are so expensive and likely to remain that way", "title_page": "Why airfares are so expensive and likely to remain that way | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The worst of the pandemic has subsided, countries are accessible again and airlines expect decent profits now that business and leisure travel has returned. Why, then, are fares still so high?\nFor one thing, there is a lack of planes. During the pandemic, airlines idled large portions of their fleets because travel demand was so lacklustre that they were not needed. Now they cannot bring them back fast enough – it takes 100 working hours to ready the biggest jets for service after being parked away.\nAnother reason: Consumers are willing to pay more for tickets after being denied the chance to travel, in some cases for as long as three years. A Booking.com survey of more than 25,000 adults planning to travel in the next 12 to 24 months found that many wanted to be “more indulgent” with their itineraries to make up for lost opportunities.\n“Even if some trips might be a bit more expensive than they were previously, many people still see value in spending on travel,” said Mr Marcos Guerrero, senior director of flights at the online travel company.\nThe bad news for consumers is that ticket prices are likely to stay elevated for several years, at least according to Mr Michael O’Leary, chief executive officer of Ryanair Holdings, Europe’s biggest airline in terms of passengers carried.\nLack of staff\nAirlines were stung by nearly US$200 billion (S$267 billion) in losses over Covid-19 and tens of millions of aviation jobs were cut. With a travel recovery now well under way, the industry is struggling to re-recruit sufficiently. Many well-trained former workers decided to switch careers entirely to take up more stable jobs.\nThe shortages have worsened delays at airport check-in desks, immigration counters and baggage carousels. They have also forced airlines to work harder to attract and retain staff, which has meant offering better salaries. That translates into higher airfares as carriers try to recoup the additional costs.\nHigh oil prices\nFuel prices have cooled in the past year, but crude is still more than 50 per cent more expensive than in January 2019, posing a problem for airlines, as fuel is their single greatest cost. Many carriers, especially low-cost ones, do not hedge fuel, leaving them vulnerable to price spikes sparked by events such as Russia’s invasion of Ukraine.\nAirlines contribute a little more than 2 per cent of the world’s carbon emissions, but lag almost all other businesses in pledges for a cleaner future. That is partly because the only feasible solution now – sustainable aviation fuel – costs as much as five times traditional jet fuel.\nThe industry is going to have to pay US$2 trillion to become carbon neutral by 2050, according to the International Air Transport Association. Airlines will have to raise ticket prices to cope, making flying even more costly.\nMeanwhile, some of the newest technologies being discussed – hydrogen-powered and electric aircraft – remain mostly in the research stages, and are set to be expensive if they come to fruition.\nShortage of aircraft\nAs many as 16,000 aircraft – about two-thirds of the world’s commercial fleet – was grounded at the height of the pandemic. Making them airworthy again is a huge task that involves scrutinising every part to ensure they are safe. Many were kept in deserts in the United States and Australia, where they are less susceptible to wear and tear, yet they still can suffer from issues such as damaged interiors and engines.\nOn top of that, aircraft manufacturers are falling behind, with labour shortages at subcontractors putting the brakes on production. Sanctions tied to Russia have also made it harder for Airbus, Boeing and their suppliers to secure raw materials like titanium, pushing up prices of parts.\nGetting hold of new engines is another headache. The likes of Spirit Airlines and India’s IndiGo have been forced to idle new aircraft, as parts are in short supply and manufacturers are struggling to build new turbines. Some new-generation technology also needs more frequent maintenance, as parts like exotic metal alloys, coatings and composites wear out faster.\n“Capacity is a challenge,” Ryanair’s O’Leary said at a Bloomberg conference in April. “Over the medium term, the inability of Airbus and Boeing to deliver any meaningful increase in production means capacity is going to continue to be challenging for the next two, three, five years.”\nHe expects fares to rise by double digits this summer, following jumps of as much as 15 per cent in 2022.\nChina’s slow return\nChina, the world’s second-biggest economy and source of almost US$280 billion in annual tourism spending prior to the pandemic, is still rebuilding from the crisis. The government held on to virus containment measures such as citywide lockdowns way longer than anywhere else, and people are not overly eager to risk travelling again, even after the Covid-Zero approach was abandoned.\nA survey published on Wednesday found that more than 30 per cent of Chinese travellers ruled out overseas travel in 2023.\nThe Association of Asia Pacific Airlines has said it will take at least a year for China to get back to pre-pandemic levels of international air travel. Domestic traffic is returning to the equivalent of 2019, but the wider reopening is taking much longer to recover after China’s approach left it more isolated and out of whack with the rest of the world.\nA slow China reopening makes airlines nervous about bringing back all of their aircraft and capacity, resulting in fewer seats on international routes, squeezing demand and driving up airfares.\n“Airlines still haven’t fully recovered from the pandemic,” said Mr Clint Henderson, managing editor of frequent-flyer website The Points Guy. “Flights to China are a great example. There are very few right now and the ones there are have astronomically high prices.”", "url": "https://www.straitstimes.com/world/why-flying-is-so-expensive-and-likely-to-remain-that-way"}