{"authors": [], "date_download": "2024-10-12 13:57:14", "date_modify": "2024-10-12 13:57:14", "date_publish": "2023-10-03 07:35:00", "description": "The performance of the vaccines has raised hopes among scientists that mRNA technology will prove useful against other diseases.  Read more at straitstimes.com.", "filename": "world_mrna-proved-magic-in-covid-vaccines-what-else-can-it-do_1728741434.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/03/BRITAIN-HEALTH-VIRUS-VACCINES-121604.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_mrna-proved-magic-in-covid-vaccines-what-else-can-it-do_1728741434.html", "title": "mRNA proved magic in Covid-19 vaccines. What else can it do?", "title_page": "mRNA proved magic in Covid-19 vaccines. What else can it do? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – When it became clear in early 2020 that the Sars-CoV-2 virus posed a pandemic threat, researchers who had been exploring using messenger RNA to develop vaccines saw an opportunity.\nCovid-19 shots made this way were the first to demonstrate efficacy, and they have proved to be the most effective vaccines against the disease.\nTwo scientists, Dr Katalin Kariko and Dr Drew Weissman, whose research laid the groundwork for their development, won the Nobel Prize in medicine on Monday.\nThe performance of the vaccines, from Moderna and the Pfizer/BioNTech partnership, has raised hopes among scientists that mRNA technology will prove useful against other diseases.\n1. How do mRNA vaccines work?\nInstead of introducing the body to an inactivated or weakened version of a virus or a piece of it, like previous generations of vaccines, they temporarily turn the body’s cells into tiny vaccine-making factories. They do this using synthesised versions of something called messenger RNA, a molecule that normally carries genetic coding from a cell’s DNA to its protein-making machinery.\nIn the case of Covid-19 vaccines, the mRNA instructs the body to make the spike protein that Sars-CoV-2 uses to enter cells. This, in turn, stimulates the body to make high levels of antibodies to the virus.\nMessenger RNA vaccines are quicker to develop than traditional ones because their production does not require growing viruses or viral proteins inside live cells. It took researchers just a few days in January 2020 to come up with the mRNA sequence used in the Covid-19 vaccine made by Moderna.\n2. How might mRNA be useful for other vaccines?\nOnce an mRNA vaccine proves effective, in theory researchers can quickly tweak it to combat a different virus by changing the genetic code they put into the mRNA.\nObvious targets include the 50 or so new viruses that have infected humans in the last 40 years for which there are no vaccines as well as hard-to-target pathogens such as the human immunodeficiency virus.\nHoping to improve on the performance of the first vaccine for malaria, which prevented four in 10 cases among children who received four doses in a large study, BioNTech is testing an mRNA shot against the disease.\nResearchers also hope mRNA vaccines can improve on existing versions of flu shots, which must sometimes begin production six months in advance based on experts’ assessment of which strains of flu virus are likely to circulate. The hope is that the shorter lead times required to make mRNA shots would enable health officials to more closely match them to flu strains and improve upon typical efficacy rates of 40 per cent to 60 per cent. Moderna said on Sept 13 that a reformulated version of its mRNA-based flu shot met its primary goals in a final-stage trial – a result that could pave the way for the company to seek regulatory approval for the vaccine.\n3. What about broader applications?\nEnthusiasts suggest the technology will produce a new industry capable of treating almost everything from heart disease to cancer to rare genetic conditions. That is because, in theory, mRNA could be used to prompt cells in the body to produce any protein – not just a so-called antigen that generates antibodies to fight infection but also an enzyme to reverse disease, or growth agents to repair damaged tissue.\nIn December, Moderna and Merck & Co announced that an mRNA cancer vaccine they are developing, when taken in combination with Merck’s cancer therapy Keytruda, reduced melanoma deaths in a mid-stage trial.\n4. What are the caveats?\nIt is an open question whether there would be a good economic case for mRNA-based flu vaccines if they turn out to be more expensive and only modestly better than existing ones. The mRNA Covid-19 shots have complicated refrigeration requirements, which increase the cost of deploying them.\nTo expand beyond vaccines into the far larger and more lucrative therapeutics market will require surmounting additional technical hurdles. To treat chronic diseases, for example, companies will have to prove that they can safely deliver the therapies to the target organs. And to develop cancer vaccines, mRNA researchers will have to solve the thorny problem of teaching the immune system to distinguish between specific tumours and healthy cells. Many previous approaches have failed. BLOOMBERG", "url": "https://www.straitstimes.com/world/mrna-proved-magic-in-covid-vaccines-what-else-can-it-do"}