{"authors": [], "date_download": "2024-10-12 14:01:19", "date_modify": "2024-10-12 14:01:19", "date_publish": "2023-06-03 15:10:00", "description": "Kyiv hopes a counteroffensive to reclaim territory will change the war that has raged since February 2022. Read more at straitstimes.com.", "filename": "world_europe_zelensky-says-ukraine-ready-to-launch-counteroffensive-against-russia-invasion_1728741679.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/03/10667642_8.jpg?VersionId=cM0mcvai515MSex7tDIHg8ysk363F341", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_zelensky-says-ukraine-ready-to-launch-counteroffensive-against-russia-invasion_1728741679.html", "title": "Ukraine’s Zelensky ‘ready’ for offensive against Russian invasion but fears major casualties", "title_page": "Ukraine’s Zelensky ‘ready’ for offensive against Russian invasion but fears major casualties | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Ukraine is ready to launch its long-awaited counteroffensive to recapture Russian-occupied territory, President Volodymyr Zelensky said in an interview published on Saturday.\n“We strongly believe that we will succeed,” he told The Wall Street Journal.\nBut Mr Zelensky said he fears large casualties due to Moscow’s superior air power, adding that “a large number of soldiers will die” if Kyiv is not given the weapons to counter Russian air power.\nHe said it will be “dangerous” to launch without more Western help to counter the air attacks.\nHe spoke as the capital was this week hit by a series of aerial assaults, including a rare daytime one.\n“Everyone knows perfectly well that any counteroffensive without air superiority is very dangerous,” he said.\n“Imagine the feeling of a soldier who knows that he doesn’t have a roof and he doesn’t understand why neighbouring countries have one.”\nMr Zelensky said there is only one weapon – the United States-made Patriot air defence system – that can protect Ukrainian skies, asking for more to be delivered to Kyiv.\n“The reality is that 50 Patriots will, for the most part, prevent people from dying.”\nKyiv hopes a counteroffensive to reclaim territory will change the dynamics of a war that has raged since Russia invaded Ukraine 15 months ago.\nMr Zelensky said in May that Ukraine needs to wait for more Western armoured vehicles to arrive before launching the counteroffensive.\nHe has been on a diplomatic push to maintain Western support, seeking more military aid and weapons, which is key for Ukraine to succeed in its plans.\nRussia holds swathes of Ukrainian territory in the east, south and south-east.\nA long spell of dry weather in some parts of Ukraine has driven anticipation that the counteroffensive might be imminent.\nOver the past several weeks, Ukraine has increased its strikes on Russian ammunition depots and logistical routes.\nOn Saturday, Ukraine’s military said in a daily report that Maryinka in the Donetsk region in the east is the focus of fighting. Ukrainian forces repelled all 14 Russian troop attacks there, the report said. REUTERS, AFP", "url": "https://www.straitstimes.com/world/europe/zelensky-says-ukraine-ready-to-launch-counteroffensive-against-russia-invasion"}