{"authors": [], "date_download": "2024-10-12 14:11:14", "date_modify": "2024-10-12 14:11:14", "date_publish": "2018-11-29 01:57:31", "description": "WASHINGTON (REUTERS) - Senior members of President Donald Trump's Cabinet urged US senators on Wednesday (Nov 28) not to downgrade ties with Saudi Arabia over the killing of journalist Jamal Khashoggi, saying it would be a mistake for national security and would not push Saudis in a better direction at home. Read more at straitstimes.com.", "filename": "world_united-states_us-officials-pompeo-mattis-warn-against-downgrading-us-saudi-ties_1728742274.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/brightcove-thumbnails/XiO-AJrh9zngR7NghHVjS_cePPaiCMVS91zRERryOqA.jpg?VersionId=YiqtQPjIHTZJ9Z_GEe4WfIF6nn66Knaj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-officials-pompeo-mattis-warn-against-downgrading-us-saudi-ties_1728742274.html", "title": "US officials Pompeo, Mattis warn against downgrading US-Saudi ties", "title_page": "US officials Pompeo, Mattis warn against downgrading US-Saudi ties | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - Senior members of President Donald Trump's Cabinet urged US senators on Wednesday (Nov 28) not to downgrade ties with Saudi Arabia over the killing of journalist Jamal Khashoggi, saying it would be a mistake for national security and would not push Saudis in a better direction at home.\nAfter repeated calls from members of Congress for a strong US response, Secretary of State Mike Pompeo and Defense Secretary Jim Mattis briefed the Senate behind closed doors about Saudi Arabia and the Oct 2 murder of Khashoggi at the Saudi consulate in Istanbul, and on the civil war in Yemen.\n\"The October murder of Saudi national Jamal Khashoggi in Turkey has heightened the Capitol Hill caterwauling and media pile-on. But degrading US-Saudi ties would be a grave mistake for the national security of the US and its allies,\" Pompeo wrote in a blog post released shortly before the briefing.\nTrump has dismissed a CIA assessment that Saudi Crown Prince Mohammed bin Salman ordered Khashoggi's killing.\nTrump last week vowed to remain a \"steadfast partner\" of Saudi Arabia and said it was not clear whether the prince knew about the plan to kill Khashoggi.\nThose comments further angered members of the US Congress, including some of Trump's fellow Republicans, who have demanded an investigation of potential involvement by the crown prince.\nRepublican Senator Bob Corker said after the briefing it was apparent to everyone in the room that the crown prince was responsible for Khashoggi's death.\n\"We have a problem here. We understand that Saudi Arabia is an ally, of sorts, and a semi important country,\" said Corker, chairman of the Senate Foreign Relations Committee. \"We also have a crown prince that's out of control.\"\nDemocratic Senator Bob Menendez said Washington was basically telling an ally \"you can kill with impunity\".\n\"It is outrageous that we are willing to turn our eye away from such a murder because we have 'interests,'\" he said.\nURGENT HUMANITARIAN EMERGENCY\nGulf Arab states have been battling in Yemen since 2015 to restore a government driven out by the Houthis, Shi'ite Muslim fighters that Yemen's neighbors view as agents of Iran. The war has killed more than 10,000 people and created the world's most urgent humanitarian emergency.\nPompeo said the United States would provide an additional US$131 million (S$180 million) for food aide in Yemen.\nIn his remarks, which were released as the meeting with lawmakers began, Mattis said pulling back US military support in Yemen and stopping weapons sales to important partners would be misguided.\n\"Our security interests cannot be dismissed, even as we seek accountability for what President (Donald) Trump described as the \"unacceptable and horrible crime\" of Jamal Khashoggi's murder, a crime which \"our country does not condone,\" Mattis said in his prepared remarks.\nPompeo made the case that the Saudis are too important an ally to lose, citing the country's help to contain Iran in the region, secure democracy in Iraq and fight the Islamic State and other extremist groups.\n\"The kingdom is a powerful force for stability in the Middle East,\" he wrote. \"Saudi Arabia, like the US - and unlike these critics - recognises the immense threat the Islamic Republic of Iran poses to the world.\"\nIn his prepared remarks, also released as the briefing took place, Pompeo said stopping refueling and other support for the Saudi-led coalition in Yemen \"would do immense damage\" to the interests of the United States and its allies and partners in the Middle East.\nThe conflict is seen as a proxy war between Saudia Arabia and Iran.\n\"The first mission is to assist the Saudis and the Emiratis in their fight against Iranian-backed Houthi fighters. This conflict isn't optional for Saudi Arabia, and abandoning it puts American interests at risk too,\" Pompeo said.\nThe Senate is due to hold a procedural vote later on Wednesday on a measure that would end US support for the conflict in Yemen.", "url": "https://www.straitstimes.com/world/united-states/us-officials-pompeo-mattis-warn-against-downgrading-us-saudi-ties"}