{"authors": [], "date_download": "2024-10-12 14:01:11", "date_modify": "2024-10-12 14:01:11", "date_publish": "2024-04-22 17:11:57", "description": "The aid package will replenish Kyiv’s critically low stocks of artillery shells and air defences. Read more at straitstimes.com.", "filename": "world_europe_us-aid-could-buy-kyiv-time-but-ukraine-needs-many-more-troops_1728741671.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/22/LYNXNPEK3L0A7-2.jpg?VersionId=rkMnsi66Q3SH70ywrTcPOF2IRN5KE1c6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_us-aid-could-buy-kyiv-time-but-ukraine-needs-many-more-troops_1728741671.html", "title": "US aid could buy Kyiv time, but Ukraine needs many more troops", "title_page": "US aid could buy Kyiv time, but Ukraine needs many more troops | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – For the exhausted Ukrainian artillery gunners holding off Russian forces near the eastern town of Kupiansk, the American aid package expected to finally pass this week is a lifeline and, potentially, a game-changer, although that could take some time.\n“If they’d passed it (earlier), it would have changed the situation dramatically,” said one soldier, who said a shortage of shells has reduced their covering fire for infantrymen, costing lives and territory.\nAfter six months of congressional wrangling, the US$61 billion (S$83 billion) aid package is now expected to be approved this week by the US Senate and signed by US President Joe Biden, replenishing Kyiv’s critically low stocks of artillery shells and air defences.\nThe influx of weapons should improve Kyiv’s chances of averting a major Russian breakthrough in the east, said two military analysts, an ex-Ukrainian defence minister and a European security official.\nBut Kyiv still faces manpower shortages on the battlefield, while questions linger over the strength of its fortifications along a sprawling, 1,000km front line ahead of what Ukrainian President Volodymyr Zelensky said could be a Russian summer offensive.\n“The most important source of Ukrainian weakness is the lack of manpower,” said Mr Konrad Muzyka, director of the Rochan military consultancy in Poland.\nAfter months of debate, a law signed by Mr Zelensky on April 16 to overhaul the rules governing how Ukraine mobilises civilians into the army enters into force in May with the aim of making the process faster, more transparent and effective.\nBut new draftees will require months of training before they can be deployed, which in turn creates a “window of opportunity” for Russia to exploit, Mr Muzyka said.\n“I would expect the situation to probably continue to deteriorate over the next three months, but if mobilisation goes according to plan and the US aid is unblocked, then the situation should improve from autumn onwards,” he said.\nThe Kremlin said the US aid would not alter Russia’s upper hand on the front lines and would simply result in more Ukrainian deaths.\nNarrow shell gap\nMoscow has had the battlefield advantage since capturing Avdiivka, a long-time bastion town in the eastern Donbas region, in February, and its forces have been slowly advancing, using greater numbers of troops and artillery shells.\nThey are now bearing down on the town of Chasiv Yar, located on high ground that, if captured, would bring Moscow closer to the remaining Kyiv-held Donbas cities of Kostiantynivka, Kramatorsk and Sloviansk.\nMr Zelensky said last week Russia was now able to fire 10 times more artillery rounds than Ukraine’s troops. Russian forces outnumber Kyiv’s troops seven to 10 times in the east, a Ukrainian general said.\nMr Andriy Yusov, Ukraine’s military intelligence spokesman, said Moscow was focused on the full capture of the eastern Donetsk and Luhansk regions – the Donbas.\nRussia, he added, was attacking on three fronts there: west of Avdiivka, from Kupiansk to Lyman and west of Bakhmut. In the south, it was pressing on Robotyne, the village retaken by Kyiv during the 2023 offensive, he said.\nUkrainian positions have been pounded in 2024 by thousands of glide bombs fired by warplanes taking advantage of Russian air superiority and dwindling Ukrainian air defences.\nMr Andriy Zagorodnyuk, a former Ukrainian defence minister, said an influx of ground-based air defences would help, while US-produced F-16 fighter jets, which Kyiv expects to receive later in 2024, would force Russian warplanes back entirely.\nReplenished stocks of artillery shells should bring the gap in rounds fired down to several Russian rounds for every one Ukrainian round, he added.\n“We don’t need to have one-to-one. Three to one would still do the job,” he said, citing Kyiv’s more “calculated” approach versus Russia’s reliance on quantity.\nIn addition to US aid, European Union assistance includes a Czech-led initiative that will begin supplying Ukraine some 300,000 rounds of 155mm artillery shells beginning in June.\nA senior European security source told Reuters that if Ukraine received the new US and EU assistance, the likelihood of averting a major Russian breakthrough over the next 12 months was “quite high”.\nLosing more ground\nThe Ukrainian military needed a “massive” influx of personnel to stall Russian forces across the entire front, Mr Muzyka said, adding that a separate recruitment drive to enlist volunteer fighters would not be enough to cover the deficit.\nThe European security source also said Ukraine needed to step up its mobilisation effort.\nNeither side in the conflict shares official data on their own military strength and casualty rates.\nUkraine’s Mr Yusov said Russia, which controls 18 per cent of Ukrainian territory, has between 450,000 and 470,000 ground troops fighting in Ukraine in addition to 35,000 national guardsmen, as well as separate air force and naval operations taking place.\nKyiv has said in the past that it has around a million people under arms.\nIn December, Mr Zelensky said his military wanted to mobilise up to half a million new soldiers.\nUkraine’s top commander said after taking the helm in February that a review of resources had concluded that a “significantly reduced” number was needed.\nMr Muzyka said it was unclear how deep Ukraine’s fortifications were. The military says it has been working around the clock to improve them, and Mr Zelensky said in April construction was up to 98 per cent complete in some areas of the front.\n“Essentially, what we’re looking at in 2024 is as strong enough a defensive position as possible, but accepting that the Ukrainians are probably going to lose some ground to the Russians,” Mr Matthew Savill, military sciences director at the London-based RUSI think-tank, said.\nThat, he said, was the result of the 2023 Ukrainian counter-offensive that proved unable to significantly pierce Russian lines, Russia’s concentration of forces and the long delay in the approval of US military assistance.\n“This is far later and a far less favourable position than the Ukrainians would have been hoping for in winter in terms of this support and other support,” he said.\n“The big challenge now is to simultaneously put up a strong defence and then prepare for an offensive in 2025.” REUTERS", "url": "https://www.straitstimes.com/world/europe/us-aid-could-buy-kyiv-time-but-ukraine-needs-many-more-troops"}