{"authors": [], "date_download": "2024-10-12 14:02:25", "date_modify": "2024-10-12 14:02:25", "date_publish": "2023-03-04 04:14:56", "description": "Ukrainian combatants reportedly killed two civilians, in what Ukraine said was a Kremlin \"provocation\". Read more at straitstimes.com.", "filename": "world_europe_russia-border-town-on-edge-after-what-moscow-calls-a-ukraine-incursion_1728741745.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/04/RUSSIA-UKRAINE-CONFLICT-BORDER-144042_0.jpg?VersionId=ZTc6KpuPpgSzOukhSxzn.8n6Lyrw55ER", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-border-town-on-edge-after-what-moscow-calls-a-ukraine-incursion_1728741745.html", "title": "Russia border town on edge after what Moscow calls a Ukraine 'incursion'", "title_page": "Russia border town on edge after what Moscow calls a Ukraine 'incursion' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KLIMOVO, Russia - Russians in the border region of Bryansk were on edge on Friday after Moscow accused Ukrainian combatants of killing two civilians in a rare cross-border incursion.\nWhile some wondered how what Moscow called “Ukrainian nationalists” had even made it across the border, others said the region had been a tinderbox ever since Russian President Vladimir Putin sent troops to Ukraine last year.\nUkrainian authorities dismissed the reports as a “provocation”.\nAfter Thursday’s drama, locals went about their daily business, but tensions were palpable.\n“We are afraid of everything,” Mrs Olga Ulyanova, a 62-year-old pensioner, told AFP, near a market in Klimovo, a gritty industrial town that features a monument to Soviet leader Vladimir Lenin.\n“I live alone and I’m worried. The bandits might come, break down the door and kill me,” Mrs Ulyanova added. “Everyone is waiting for something and is afraid of something.”\nKlimovo, which is home to around 13,500 people, is located not far from the villages of Lyubechane and Sushany, the scene of the reported attacks.\nMr Oleg Poshlov, a 38-year-old librarian, compared the town in the southern region of Bryansk to a “tinderbox” but expressed support for the authorities. “We will never give up our country,” he added.\nOn Thursday, Moscow reported that a group of “Ukrainian nationalists” had crossed into the region of Bryansk, killed two civilians and wounded an 11-year-old child.\nPresident Putin denounced the “terror attack”, but a different account was put forward in two videos on social media showing four men in military uniform claiming to be from a Russian volunteer group in the Ukrainian army.\nThe FSB domestic security service said the attackers had later been pushed back over the border and targeted with a “massive artillery strike”.\nBut locals said they had questions.\nMs Elena Romanenko, 47, said the reported cross-border incident was concerning.\n“This was very unexpected,” said Ms Romanenko, who works as a packer at a grocery store.\nShe said she thought the Russian military had been “better trained and our borders had been better protected”.\n‘Always tense’\nRussia claims its border regions, including Bryansk and Kursk, have been routinely shelled by Ukrainian forces since the start of Moscow’s assault, but the alleged incursion would be a rare instance of fighting inside its territory.\nMs Romanenko said that despite everything she had faith in Russia’s air defence and that the town had seen “many fewer” hits recently.\n“We believe that our boys will protect us,” she said.\nMany locals were afraid to speak to reporters.\nSome said they felt abandoned and said authorities needed to beef up security. “We don’t understand why there is no military in the city,” said a 66-year-old woman.\nAnother woman said she had packed an emergency suitcase and always carried identity papers in case she and her family had to “run”.\n“We are always tense,” said the 47-year-old woman.\nEven local authorities admitted they were concerned but insisted that life was returning to normal.\n“Of course, the situation is a bit worrying,” Mr Nikolai Samusev, head of the nearby village of Novyi Ropsk, told AFP.\n“We did not expect this to happen.” AFP", "url": "https://www.straitstimes.com/world/europe/russia-border-town-on-edge-after-what-moscow-calls-a-ukraine-incursion"}