{"authors": [], "date_download": "2024-10-12 13:42:48", "date_modify": "2024-10-12 13:42:48", "date_publish": "2024-10-09 02:04:27", "description": "The safety alert directs pilots and airline operators to review Boeing’s procedure for responding to a jammed rudder. Read more at straitstimes.com.", "filename": "world_united-states_us-faa-issues-safety-alert-over-boeing-737-rudder-issue_1728740568.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/09/btboeing20241009.JPG?VersionId=I4Fj5Dmk_mlYlFf8e6fUU3G.NslJ2b.9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-faa-issues-safety-alert-over-boeing-737-rudder-issue_1728740568.html", "title": "US FAA issues safety alert over Boeing 737 rudder issue", "title_page": "US FAA issues safety alert over Boeing 737 rudder issue | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The Federal Aviation Administration said on Oct 8 it issued a safety alert to airlines warning of the potential for limited or jammed rudder movement on certain Boeing 737 airplanes after a safety official urged the agency to take action.\nThe National Transportation Safety Board on Sept 26 issued urgent safety recommendations to Boeing and the FAA after investigating the potential for rudder issues in some 737 airplanes, which prompted the FAA to convene a corrective action review board.\nThe NTSB recommendation came as they investigate a February incident involving a United Airlines flight.\nThe safety alert directs pilots and airline operators to review Boeing’s procedure for responding to a jammed rudder but does not require airlines to replace the parts that can stick.\nLast week, the NTSB said more than 40 foreign operators of Boeing 737 airplanes may be using 737 or 737 Next Generation planes with rudder components that could pose safety risks.\nThe FAA said the alert provides information on an existing automated check of the rudder system “that would identify limited or jammed rudder movement during approach prior to landing” and said airlines should warn pilots the rudder “could potentially become jammed or restricted in flight or during landing due to moisture that could accumulate and freeze.”\nThe NTSB said 271 impacted parts may be installed on aircraft in service operated by at least 40 foreign air carriers and 16 may still be installed on US-registered aircraft and up to 75 may have been used in aftermarket installation.\nBoeing earlier informed affected 737 operators of a “potential condition with the rudder rollout guidance actuator” in August, in what is known as a Multi Operator Message.\nBoeing said Oct 8 it continues to work under the oversight of regulators and has “reminded operators of the proper actions that flight crews should take if they encounter rudder restriction.”\nThe NTSB is investigating an incident in February in which the rudder pedals on a United 737 MAX 8 were stuck in the neutral position during a landing at Newark. There were no injuries to the 161 passengers and crew.\nUnited said last month the rudder control parts at issue were in use in only nine of its 737 aircraft originally built for other airlines and the components were all removed earlier this year.\nThe NTSB earlier criticised Boeing for failing to inform United the 737s it received were equipped with actuators “mechanically connected to the rudder control system” and expressed concerns other airlines were unaware of their presence. REUTERS", "url": "https://www.straitstimes.com/world/united-states/us-faa-issues-safety-alert-over-boeing-737-rudder-issue"}