{"authors": [], "date_download": "2024-10-12 14:08:46", "date_modify": "2024-10-12 14:08:46", "date_publish": "2022-05-07 05:48:48", "description": "Additional artillery munitions, radar and other equipment will help Kyiv repel Russia’s invasion. Read more at straitstimes.com.", "filename": "world_united-states_biden-announces-more-artillery-radars-for-ukraines-war-against-russia_1728742126.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/ZjIdH861fjrQ384tixPOMti7SSvbRWUTHDw17McRJiE.jpg?VersionId=9.mVm3SNHmjkOGOI2KVIYY_LUqwDLABA", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-announces-more-artillery-radars-for-ukraines-war-against-russia_1728742126.html", "title": "Biden announces new US$150 million weapons package for Ukraine", "title_page": "Biden announces new US$150 million weapons package for Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (AFP) - US President Joe Biden signed a new US$150 million (S$200 million) weapons package for Ukraine on Friday (May 6), providing additional artillery munitions, radar and other equipment in the latest in a series of transfers to help Kyiv repel Russia’s invasion.\n“Today, the United States is continuing our strong support for the brave people of Ukraine as they defend their country against Russia’s ongoing aggression,” Biden said in a statement.\nThe United States has rushed US$3.4 billion worth of armaments to Ukraine since Russia invaded on Feb 24, including howitzers, anti-aircraft Stinger systems, anti-tank Javelin missiles, ammunition and recently-disclosed “Ghost” drones.\nThe new package will be worth US$150 million and include 25,000 155mm artillery rounds, counter-artillery radar, jamming equipment, field equipment and spare parts, a US official said.\nReuters was first to report the latest tranche of weapons.\nThe new transfers would come from the remaining US$250 million in the Presidential Drawdown Authority, which allows the president to authorise the transfer of excess weapons from US stocks without congressional approval in response to an emergency.\nLast month Biden proposed a US$33 billion assistance package for Ukraine, including more than US$20 billion in military aid.\nCongress must approve the new funding package. House of Representatives and Senate leaders have said they want to move quickly, but have not yet said when they will vote on Biden’s request.\nBiden urged lawmakers to work quickly, saying the latest weapons authorisation “nearly exhausted” drawdown authority funding. “Congress should quickly provide the requested funding to strengthen Ukraine on the battlefield and at the negotiating table,” his statement said.\nThe United States has been training some Ukrainian forces, outside Ukraine, on how to use systems like the howitzers.\nThe new package was announced as Biden prepared to join other Group of Seven leaders in a video call on Sunday in a show of unity with Ukrainian President Volodomyr Zelensky a day before Russia marks its Victory Day holiday.\nRussian President Vladimir Putin casts the war in Ukraine as a battle to protect Russian speakers there from persecution by Nazis and to guard against what he calls the US threat to Russia posed by Nato enlargement.\nUkraine and the West reject the fascism claim as baseless and say Putin is waging an unprovoked war of aggression.\nUkraine and its allies say that after failing to seize the capital, Kyiv, Russian forces have made slow progress in their goal of capturing the country’s east and south but bombardments have affected more and more civilians.\nRussia denies the allegations and says it targets only military or strategic sites, not civilians.", "url": "https://www.straitstimes.com/world/united-states/biden-announces-more-artillery-radars-for-ukraines-war-against-russia"}