{"authors": [], "date_download": "2024-10-12 14:04:38", "date_modify": "2024-10-12 14:04:38", "date_publish": "2023-07-30 17:14:00", "description": "Italy was the only major Western country that signed up to the initiative. Read more at straitstimes.com.", "filename": "world_europe_joining-china-s-belt-and-road-was-an-atrocious-decision-italian-minister-says_1728741878.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/30/yuGuidoCrosetto3007.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_joining-china-s-belt-and-road-was-an-atrocious-decision-italian-minister-says_1728741878.html", "title": "Joining China’s Belt and Road was an ‘atrocious’ decision, says Italian minister", "title_page": "Joining China’s Belt and Road was an ‘atrocious’ decision, says Italian minister | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME - Italy made an “improvised and atrocious” decision when it joined China’s Belt and Road Initiative (BRI) four years ago as it did little to boost exports, said Italian Defence Minister Guido Crosetto in an interview published on Sunday.\nItaly signed up to the BRI under a previous government, becoming the only major Western country to take such a step. Mr Crosetto is part of an administration that is considering how to break free of the agreement.\nThe BRI scheme envisions rebuilding the old Silk Road to connect China with Asia, Europe and beyond with large infrastructure spending. Critics see it as a tool for China to spread its geopolitical and economic influence.\n“The decision to join the (new) Silk Road was an improvised and atrocious act” that multiplied China’s exports to Italy but did not have the same effect on Italian exports to China, Mr Crosetto told the Corriere della Sera newspaper.\n“The issue today is: How to walk back (from the BRI) without damaging relations (with Beijing). Because it is true that China is a competitor, but it is also a partner,” the minister added.\nAfter a White House meeting with United States President Joe Biden on Thursday, Italian Prime Minister Giorgia Meloni said her government had until December to make a decision on the BRI. She also announced that she would soon travel to Beijing.\nIn an interview on Saturday with the TG5 Italian news programme, Ms Meloni said it was a “paradox” that even if Italy is part of the BRI, it is not the Group of Seven country with the strongest trading links with China.\n“This shows that you can have good relations and trading partnerships” even outside of the BRI, she added. REUTERS", "url": "https://www.straitstimes.com/world/europe/joining-china-s-belt-and-road-was-an-atrocious-decision-italian-minister-says"}