{"authors": [], "date_download": "2024-10-12 13:39:49", "date_modify": "2024-10-12 13:39:49", "date_publish": "2024-03-07 11:11:29", "description": "A fourth global mass coral bleaching event is likely unfolding in the Southern Hemisphere, scientists warn. Read more at straitstimes.com.", "filename": "world_ocean-temperature-hit-record-high-in-february-2024-eu-scientists-say_1728740389.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/07/LYNXNPEK2602M-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_ocean-temperature-hit-record-high-in-february-2024-eu-scientists-say_1728740389.html", "title": "Ocean temperatures hit new high in February; 9th straight month of record global heat", "title_page": "Ocean temperatures hit new high in February; 9th straight month of record global heat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Ocean temperatures hit a record high in February, with the average global sea surface temperature at 21.06 deg C, said the European Union’s Copernicus Climate Change Service (C3S) on March 7.\nFebruary’s average sea surface temperature surpassed the previous record of 20.98 deg C set in August 2023, in a data set that goes back to 1979.\nThe concerning marine record arrived during what was also the hottest February on record, marking the ninth consecutive month with such a milestone for the respective month.\nMarine scientists warned this week that a fourth global mass coral bleaching event is likely unfolding in the Southern Hemisphere, driven by warming waters, and could be the worst in the planet’s history.\nCorals bleach under heat stress, expelling the colourful, helpful algae that live in their tissues, leaving behind a pale skeleton. This makes them vulnerable to starvation and disease, and many die. This can lead to the collapse of fragile reef ecosystems, with coastlines left unprotected from erosion and storms and fisheries falling short.\nAn El Nino climate pattern, borne out of warmer-than-usual surface waters in the Eastern Pacific, alongside human-caused climate change, is fuelling the extra heat.\n“What is more surprising is that sea surface temperatures are at record levels over regions far away from the centre of the El Nino action, such as the tropical Atlantic and Indian Ocean,” said climate scientist Richard Allan from the University of Reading.\nThis, he said, pointed to the strong influence of rising greenhouse gas emissions in the atmosphere.\nWhile the global average sea surface temperature record excludes the polar oceans, things are in bad shape there, too.\nAntarctic sea ice reached its annual minimum extent in February, registering its third lowest extent on record at 28 per cent below average.", "url": "https://www.straitstimes.com/world/ocean-temperature-hit-record-high-in-february-2024-eu-scientists-say"}