{"authors": [], "date_download": "2024-10-12 14:10:52", "date_modify": "2024-10-12 14:10:52", "date_publish": "2018-11-29 04:34:35", "description": "WASHINGTON (REUTERS) - United States Secretary of State Mike Pompeo said on Wednesday (Nov 28) that there was no direct evidence connecting Saudi Crown Prince Mohammed bin Salman to the murder of journalist Jamal Khashoggi last month in Istanbul. Read more at straitstimes.com.", "filename": "world_united-states_pompeo-says-no-hard-evidence-saudi-prince-ordered-khashoggi-killing_1728742252.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/11/29/file72yt3qqdj6g1hx42cjlm_0.jpg?VersionId=_oQ98pdCUgoAq1m9TrDncnZvWHkLHPoS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_pompeo-says-no-hard-evidence-saudi-prince-ordered-khashoggi-killing_1728742252.html", "title": "Pompeo says no hard evidence Saudi prince ordered Khashoggi killing", "title_page": "Pompeo says no hard evidence Saudi prince ordered Khashoggi killing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - United States Secretary of State Mike Pompeo said on Wednesday (Nov 28) that there was no direct evidence connecting Saudi Crown Prince Mohammed bin Salman to the murder of journalist Jamal Khashoggi last month in Istanbul.\nMr Pompeo spoke to reporters after he and Defence Secretary Jim Mattis told the Senate behind closed doors that weakening US-Saudi ties over the killing would hurt national security.\n\"There is no direct reporting connecting the Crown Prince to the order to murder Jamal Khashoggi,\" Mr Pompeo said.\nHowever, many senators left the briefing saying otherwise.\n\"I don't think there's anybody in the room that doesn't believe he was responsible for it,\" Senator Bob Corker, the Republican chairman of the Senate Foreign Relations Committee, told reporters after the briefing.\n\"MBS has not taken ownership of the death,\" Mr Corker said, using the short-hand initials for the crown prince.\nThe CIA has assessed that the Crown Prince had ordered the Oct 2 killing of Mr Khashoggi at the Saudi consulate in Istanbul. Republican Senator Lindsey Graham said he would withhold his vote on any key issue, including a government spending Bill, until he gets a briefing on the topic from the CIA.", "url": "https://www.straitstimes.com/world/united-states/pompeo-says-no-hard-evidence-saudi-prince-ordered-khashoggi-killing"}