{"authors": [], "date_download": "2024-10-12 13:34:49", "date_modify": "2024-10-12 13:34:49", "date_publish": "2024-09-18 11:11:45", "description": "BOGOTA - An attack with explosives by Colombian leftist rebel group the National Liberation Army (ELN), which left more than two dozen troops injured and two dead, has \\\"practically\\\" ended peace talks, Colombia's President Gustavo Petro said on Tuesday. Read more at straitstimes.com.", "filename": "world_colombias-petro-says-eln-attack-practically-ends-peace-talks_1728740089.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/19/LYNXMPEK8H0NS-1.jpg?VersionId=zkK2W1DINSDdmqtTzMK9GpdnKgne096Z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_colombias-petro-says-eln-attack-practically-ends-peace-talks_1728740089.html", "title": "Colombia's Petro says ELN attack 'practically' ends peace talks", "title_page": "Colombia's Petro says ELN attack 'practically' ends peace talks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BOGOTA - An attack with explosives by Colombian leftist rebel group the National Liberation Army (ELN), which left more than two dozen troops injured and two dead, has \"practically\" ended peace talks, Colombia's President Gustavo Petro said on Tuesday.\nThe attack, which took place on Tuesday and is the most serious since a bilateral ceasefire between the government and the ELN ended in August, occurred in a rural area of Colombia's Arauca province, which sits on the border with Venezuela.\n\"A truck, loaded with explosives which wounded 27 young people and killed two, planted by the ELN with who we were talking about peace (...) well, that's practically an action that ends the peace process with blood,\" Petro said during an event in Bogota.\nPetro, Colombia's first leftist president, restarted peace talks with the ELN at the end of 2022 as part of his efforts to deliver total peace and end the country's six-decade conflict which has left more than 450,000 dead.\nThe talks have faced a crisis for months due to the government's decision to begin separate talks with an ELN unit in the southwest of the country which earlier parted ways with the rebel group. REUTERS", "url": "https://www.straitstimes.com/world/colombias-petro-says-eln-attack-practically-ends-peace-talks"}