{"authors": [], "date_download": "2024-10-12 14:02:11", "date_modify": "2024-10-12 14:02:11", "date_publish": "2024-03-24 11:55:00", "description": "Russian forces have taken control of frontline settlements as Ukrainian forces suffer troop shortages. Read more at straitstimes.com.", "filename": "world_europe_russia-claims-new-village-taken-on-ukraine-frontline_1728741731.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/24/2024-03-22T103045Z2081338008RC27P6ASLUYLRTRMADP3OLYMPICS-2024.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-claims-new-village-taken-on-ukraine-frontline_1728741731.html", "title": "Russia claims new village taken on Ukraine frontline", "title_page": "Russia claims new village taken on Ukraine frontline | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV, UKRAINE - Russia on March 23 claimed a new territorial victory over Ukrainian forces struggling to find weapons and troops while the two sides staged deadly aerial attacks on each other.\nAs a militant attack on a Moscow concert hall became a new flashpoint dispute between the arch-rivals, Russia’s armed forces said they had seized the Ukrainian village of Ivanivske, just west of Bakhmut, the devastated city seized 10 months ago.\nRussian forces have taken control of a string of frontline settlements in recent weeks, as Ukrainian forces suffer troop and ammunition shortages.\nThe capture last month of Adviivka, near the Russian-held stronghold of Donetsk, was the first major territorial gain made by Russia since Bakhmut and was hailed by President Vladimir Putin as a sign that Russian forces are back on the offensive.\nRussia’s defence ministry said in a statement that the army had “liberated” Ivanivske, which is also close to the town of Chasiv Yar that could become the next target.\nIf Russia took Chasiv Yar, it could step up attacks on the strategic city of Kramatorsk that is already facing growing bombardment.\nThe Russian claim came amid mounting tensions over an attack on a Moscow concert hall on Friday that authorities said left at least 133 dead.\nPresident Vladimir Putin said in a nationally televised speech on March 23 that the four detained “perpetrators” were “travelling towards Ukraine where, according to preliminary information, they had a window to cross the border”.\nRussia’s FSB security service said earlier that the assailants had been “in contact” with people in Ukraine as they tried to flee the country.\nKyiv has strongly denied any involvement, saying that Russia was looking for excuses to step up the war. The United States has said it has seen no sign of Ukrainian involvement in the Crocus City Hall attack.\n‘A difficult morning’\nWhile Ukraine has struggled to find weapons and soldiers for its war, it has kept up drone attacks on Russia, which has also launched increasing air assaults.\nMultiple air attacks on the Russian border region of Belgorod adjoining Ukraine killed two people and injured at least seven, the regional governor said.\nFurther east, a drone attack on the Samara region caused a fire at a major oil refinery, the latest in a series of strikes against Russia’s energy industry.\nBelgorod governor Vyacheslav Gladkov wrote on Telegram that two districts in his region as well as the regional capital, Belgorod, had been hit in drone and air attacks.\n“It’s shaping up to be a difficult morning,” Gladkov said.\n“As a result of an air attack by Ukrainian armed forces on Belgorod, three balconies collapsed in an apartment building. One of these apartments was occupied by a married couple. To much grief, the man died from his injuries on the spot,” he said.\nRussia said later March 23 that it had repulsed a barrage of Ukrainian missiles fired at the city of Sevastopol in Crimea, which it annexed in 2014.\nBut Sevastopol’s governor Mikhail Razvozhayev later announced that rocket fragments had killed a 65-year-old resident and four other people had been injured.\n“It was the biggest attack in recent times,” he said.\nEuropean tensions\nUkraine said 34 Russian drone strikes had targeted its territory, but 31 had been shot down.\nIn the major city of Kharkiv, near the war frontlines, four people were hit by a Shahed drone.\nKharkiv, Ukraine’s second city, was plunged into darkness on March 22 after mass attacks on Ukraine’s electricity supply and some 275,000 people in the city were still without power on March 23, according to its governor Oleg Synegubov.\nMeanwhile disagreements between European partners over the possibility of ground operations have threatened to undermine crucial cooperation.\nLast month, French President Emmanuel Macron refused to rule out putting troops on the ground in Ukraine – a position he has not recanted from, despite a stern response from Berlin and other European partners.\nOn March 23, Italy’s deputy prime minister, Matteo Salvini, said Macron was endangering Europe, calling him a “warmonger”.\n“I think that President Macron, with his words, represents a danger for our country and our continent,” Salvini told a gathering in Rome of right-wing and nationalist European leaders. AFP", "url": "https://www.straitstimes.com/world/europe/russia-claims-new-village-taken-on-ukraine-frontline"}