{"authors": [], "date_download": "2024-10-12 14:17:12", "date_modify": "2024-10-12 14:17:12", "date_publish": "2022-03-02 10:30:52", "description": "He also vowed his Russian counterpart Vladimir Putin would pay over the long run for invading Ukraine. Read more at straitstimes.com.", "filename": "world_united-states_biden-bans-russian-flights-from-using-us-airspace_1728742632.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/YUpS_0VP4m55Gpxg4LPDLszlsIGqGodZUBJ820Xh9ds.jpg?VersionId=aB02Kqxb_FyVOBzyfR2ggPIU1T4GNCld", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-bans-russian-flights-from-using-us-airspace_1728742632.html", "title": "Biden bans Russian flights from using US airspace, criticises Putin", "title_page": "Biden bans Russian flights from using US airspace, criticises Putin | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (REUTERS) - United States President Joe Biden on Tuesday (March 1) said his country will join its allies and ban Russian flights from using US airspace, following Moscow's invasion of Ukraine last week.\nIn his State of the Union address, he branded his Russian counterpart Vladimir Putin a “dictator”.\n“A Russian dictator, invading a foreign country, has costs around the world,” Mr Biden told Congress.\nBut “in the battle between democracy and autocracy, democracies are rising to the moment, and the world is clearly choosing the side of peace and security,” he said.\nMr Biden vowed that Mr Putin would pay over the long run even if he made gains on the battlefield in Ukraine.\n“While he may make gains on the battlefield – he will pay a continuing high price over the long run,” Mr Biden said.\nThe world has “isolated” Mr Putin for sending Russian forces into Ukraine, Mr Biden said, vowing that devastating sanctions would sap Russia’s economic strength and weaken its military.\n“Putin is now isolated from the world more than he has ever been,” Mr Biden told members of Congress during his address, adding that the Russian President “has no idea what’s coming” in terms of economic penalties and punishment.\nMr Biden also took aim at Russian oligarchs and “corrupt leaders” who he said have bilked billions of dollars off Mr Putin’s regime.\n“We’re coming for your ill-begotten gains,” he warned them.", "url": "https://www.straitstimes.com/world/united-states/biden-bans-russian-flights-from-using-us-airspace"}