{"authors": [], "date_download": "2024-10-12 13:41:01", "date_modify": "2024-10-12 13:41:01", "date_publish": "2024-08-02 19:14:45", "description": "Iran and its allies, including Hamas and Hezbollah, have accused Israel of the assassination. Read more at straitstimes.com.", "filename": "world_europe_israel-summons-turkish-envoy-over-half-mast-salute-for-hamas-leader_1728740461.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/11512996_1.jpg?VersionId=szlQUpi1ddu9n4KL_Ccy57G62vkz7CUk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_israel-summons-turkish-envoy-over-half-mast-salute-for-hamas-leader_1728740461.html", "title": "Israel summons Turkish envoy over half-mast salute in Tel Aviv for Hamas leader Haniyeh", "title_page": "Israel summons Turkish envoy over half-mast salute in Tel Aviv for Hamas leader Haniyeh | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - Israel's foreign ministry summoned the deputy Turkish ambassador for a reprimand on Aug 2 after Turkey's embassy in Tel Aviv lowered its flag to half mast in response to the killing of Hamas political leader Ismail Haniyeh.\n\"The State of Israel will not tolerate expressions of mourning for a murderer like Ismail Haniyeh,\" Foreign Minister Israel Katz said in a statement.\nHaniyeh was killed in Tehran while there to attend the inauguration of Iranian President Masoud Pezeshkian.\nIsrael has not made any official claim of responsibility for his death but Iran and its allies, including Hamas and Hezbollah, have accused Israel of the assassination and vowed revenge.\nTurkish President Tayyip Erdogan declared Aug 2 a day of national mourning for Haniyeh.\nKatz's statement said Haniyeh had been Hamas leader during the Oct 7 attack on Israel that killed some 1,200 Israelis and foreigners and saw more than 250 taken hostage into Gaza, triggering Israel's assault on the coastal enclave.\nTensions between Israel and Turkey have risen sharply since the start of the war in Gaza, in which more than 39,000 Palestinians have been killed. REUTERS", "url": "https://www.straitstimes.com/world/europe/israel-summons-turkish-envoy-over-half-mast-salute-for-hamas-leader"}