{"authors": [], "date_download": "2024-10-12 13:50:09", "date_modify": "2024-10-12 13:50:09", "date_publish": "2024-08-11 11:00:00", "description": "He will have to face the reality of the deadlocked politics created by his calling of snap polls. Read more at straitstimes.com.", "filename": "world_europe_after-olympic-dream-a-rude-political-awakening-for-macron_1728741009.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/11/2024-08-10T205724Z1188113079UP1EK8A1M7NDZRTRMADP3OLYMPICS-2024-BASKETBALL.JPG?VersionId=hM49AFsWuyvoSJlMaTZbnMYpsIdg6nQs", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_after-olympic-dream-a-rude-political-awakening-for-macron_1728741009.html", "title": "After Olympic dream, a rude political awakening for Macron?", "title_page": "After Olympic dream, a rude political awakening for Macron? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The success of the Olympic Games has surpassed the wildest dreams of many in France, but in the next few weeks, President Emmanuel Macron will still have to face the reality of the deadlocked politics created by his calling of snap legislative elections.\nWith the Games just around the corner, the polls left France with three major blocs in Parliament – the left as the largest, followed by Mr Macron’s centrist forces and the far right – with none of them close to mustering the numbers for an overall majority.\nThe former government of Macron allies, under Prime Minister Gabriel Attal, has carried on in a caretaker capacity throughout the Games, but five weeks after the elections, the country still does not have a new prime minister.\nMr Macron may be hoping that the Games will boost his embattled fortunes in the same way that France’s hosting and winning of the 1998 football World Cup dragged up former president Jacques Chirac’s popularity ratings.\nBut even with Paris set to continue basking in the limelight while hosting the Paralympics from Aug 28 to Sept 8, he faces a potentially fraught return to reality.\nWhile the Games have lifted what was a morose mood in France, it is far from certain this will give a new impulse to the remaining three years of the unpopular President’s mandate.\n‘Very angry’\n“The fact that things are going well, that we are seen as beautiful and successful abroad, has struck a chord in a country that was experiencing decline and was no longer capable of doing great things collectively,” said prominent political commentator Emmanuel Riviere.\n“This changes the collective climate but not the political situation – the situation remains blocked, many voters are frustrated... The French are putting things into perspective and remain very angry with Emmanuel Macron.”\nMr Macron’s approval ratings remain well under 30 per cent, with the President keeping a low profile during the election campaign and the Games, spending most of the Olympics ensconced in the Mediterranean holiday residence of the French president and making only occasional visits to Paris.\n“The country needed this moment of coming together. In terms of the political impact, I remain very reserved,” one minister from the outgoing government, who asked not to be named, told AFP.\nWhen it comes to the Olympics, “we cannot make it a partisan success”, added another.\n‘Political change’\nThe No. 1 priority for Mr Macron will be naming, and winning approval for, a new prime minister and government, a process that appears to remain as blocked as it was before the Games.\nThe left-wing New Popular Front, which emerged as the largest faction post-election, has said it wants the economist Lucie Castets to be the new premier.\nMr Macron’s forces have shown little interest in the idea, preferring an alliance with the traditional right, with the name of former Chirac-era minister and current head of the northern Hauts de France region, Mr Xavier Bertrand, frequently cited as a candidate to lead a centre-focused coalition.\nOutgoing Equality Minister Aurore Berge named Mr Bertrand as a possible candidate alongside the likes of former EU Brexit negotiator Michel Barnier and Senate speaker Gerard Larcher, saying he had “solid experience of government, Parliament and compromise”.\nNaming him would be an “aberration”, objected Ms Castets, while Greens leader Marine Tondelier accused Mr Macron of exploiting the political “truce” he called for the Olympics. “This Olympic truce is not just because Emmanuel Macron is tired, it is because he wants time” and “to obstruct any attempt at political change”, she said.\n‘Still thinking’\nThere had been expectation that Mr Macron could name the new premier in the window between the Olympics, which closed on Aug 11, and the opening of the Paralympics on Aug 28.\nBut as visitors and Parisians gasp in awe for a last time at the Olympic cauldron tethered to a balloon, sources within the executive are playing down the prospects of a rapid breakthrough.\n“It (the Olympics) will calm things down in the sense that the idea that we work together will be less absurd,” said a senior figure close to Mr Macron, asking not to be named.\n“But it’s not because we went to take selfies in front of the cauldron with half of Paris that we’re suddenly going to form a coalition.”\nMr Macron, known to use his vacations at the Fort de Bregancon residence for deep reading and reflection, is “still thinking”, according to a person close to him. AFP", "url": "https://www.straitstimes.com/world/europe/after-olympic-dream-a-rude-political-awakening-for-macron"}