{"authors": [], "date_download": "2024-10-12 13:42:56", "date_modify": "2024-10-12 13:42:56", "date_publish": "2024-10-08 18:27:28", "description": "DAKAR - Burkina Faso's junta has suspended U.S.-funded broadcaster Voice of America for three months over comments about a jihadist insurgency in West Africa's Sahel region, and temporarily banned local news outlets from using any international media reports, authorities said late on Monday. Read more at straitstimes.com.", "filename": "world_burkina-fasos-junta-suspends-voa-over-insurgency-comments_1728740576.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/08/ST-logo-placeholder_18.jpg?VersionId=mWwfG08DWQFkktOKAmcSIBCtvF4Lrk7M", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_burkina-fasos-junta-suspends-voa-over-insurgency-comments_1728740576.html", "title": "Burkina Faso's junta suspends VOA over insurgency comments", "title_page": "Burkina Faso's junta suspends VOA over insurgency comments | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DAKAR - Burkina Faso's junta has suspended U.S.-funded broadcaster Voice of America for three months over comments about a jihadist insurgency in West Africa's Sahel region, and temporarily banned local news outlets from using any international media reports, authorities said late on Monday.\nMilitary leaders who seized power in a September 2022 coup - the second that year - have become increasingly intolerant of criticism amid worsening insecurity despite promises to quash an Islamist insurgency.\nThe superior council for communication (CSC) accused Voice of America (VOA) of demoralising troops in Burkina Faso and neighbouring Mali in a discussion on Sept. 19 that was also broadcast by a private local radio station.\nIt said the reporter described a jihadist attack on Bamako last month as \"courageous\", criticised security operations and provided an unfounded death toll for an attack on a Burkina Faso town that killed hundreds in August.\n\"The CSC has suspended all synchronisation of national media with international media until further notice,\" it added in a statement.\nVOA did not immediately respond to a request for comment.\nBurkina Faso is one of several Sahel nations that have been struggling to contain Islamist insurgencies linked to al Qaeda and Islamic State that have spread from neighbouring Mali since 2012, killing thousands and displacing millions.\nFrustration over authorities' failure to protect civilians has contributed to coups in Mali, Burkina Faso and Niger since 2020.\nBurkina Faso in April suspended the radio broadcasts of VOA, BBC Africa and other international media outlets for two weeks over their coverage of a Human Rights Watch report accusing the army of extrajudicial killings, which it denies.\nLast month, the CSC withdrew the radio frequencies of France's popular RFI radio, which regularly reports on the Sahel. It did not provide an explanation for its removal. REUTERS", "url": "https://www.straitstimes.com/world/burkina-fasos-junta-suspends-voa-over-insurgency-comments"}