{"authors": [], "date_download": "2024-10-12 13:34:08", "date_modify": "2024-10-12 13:34:08", "date_publish": "2024-09-21 10:09:00", "description": "Some US lawmakers, as well as advocacy and human rights groups, also criticised the cartoon. Read more at straitstimes.com.", "filename": "world_united-states_us-lawmaker-rashida-tlaib-condemns-cartoon-showing-her-with-exploding-pager_1728740048.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/21/2024-09-21T005412Z1406439569RC2GW7A4O3Y9RTRMADP3ISRAEL-PALESTINIANS-RASHIDA-TLAIB.JPG?VersionId=xjcWmoGeY5ncErKmCoIDTrfqyuof1YlP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-lawmaker-rashida-tlaib-condemns-cartoon-showing-her-with-exploding-pager_1728740048.html", "title": "US lawmaker Rashida Tlaib condemns cartoon showing her with exploding pager", "title_page": "US lawmaker Rashida Tlaib condemns cartoon showing her with exploding pager | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Palestinian American US lawmaker Rashida Tlaib on Sept 20 condemned as racist a cartoon published in the conservative magazine National Review showing her with an exploding pager – a reference to an attack this week against members of the Iran-backed militant group Hezbollah in Lebanon.\n“Our community is already in so much pain right now. This racism will incite more hate + violence against our Arab & Muslim communities, and it makes everyone less safe. It’s disgraceful that the media continues to normalise this racism,” Ms Tlaib wrote on the social media platform X.\nMs Tlaib, a Democrat who represents a district from Michigan in the US House of Representatives, is the lone Palestinian American lawmaker in the US Congress.\nThe Muslim American advocacy group Emgage Action, Democratic US House members Cory Bush and Alexandria Ocasio-Cortez, some local officials in Michigan and human rights groups also criticised the cartoon.\nNational Review did not immediately respond to a request for comment.\nThe cartoon, published on Sept 19, showed a woman sitting next to an exploding pager.\nThe woman’s desk in the cartoon had a name card saying “Rep. Tlaib” while the woman herself is shown saying: “ODD. MY PAGER JUST EXPLODED.”\nThe cartoon was created by Mr Henry Payne, a Detroit News auto critic.\nMr Payne’s X account titled the cartoon as “Tlaib Pager Hamas”.\nThe Detroit News said it was not involved in its creation and distribution, and chose not to run it.\nThousands of pagers used by members of Hezbollah in Lebanon exploded on Sept 17.\nThat was followed a day later by the explosion of hand-held radios in Lebanon, with dozens killed and thousands wounded in the incidents.\nSecurity sources have said Israel was responsible. Israel did not take responsibility.\nIsrael’s military offensive in the Gaza Strip has killed more than 40,000 Palestinians, according to health officials in the Hamas-ruled enclave, and created a humanitarian crisis.\nIsrael’s assault followed an attack by Hamas on Oct 7, 2023, that killed 1,200 people and in which about 250 were taken hostage, according to Israeli tallies.\nMs Tlaib has been a fierce critic of Israel’s actions in the war and American support for the long-time US ally.\nHuman rights advocates have cited rising dehumanisation of Arabs, Muslims and Jews amid the war. REUTERS", "url": "https://www.straitstimes.com/world/united-states/us-lawmaker-rashida-tlaib-condemns-cartoon-showing-her-with-exploding-pager"}