{"authors": [], "date_download": "2024-10-12 14:07:19", "date_modify": "2024-10-12 14:07:19", "date_publish": "2022-09-12 02:48:39", "description": "The blackouts came after Ukrainian forces said they had recaptured dozens of towns and villages in eastern Ukraine.  Read more at straitstimes.com.", "filename": "world_europe_ukraine-officials-blame-russia-for-blackouts-across-east-of-country_1728742039.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/12/yu_kharkiv0912.jpg?VersionId=nBuuu9v8NufKcN2P5mLh3zbuDS8gP6VH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-officials-blame-russia-for-blackouts-across-east-of-country_1728742039.html", "title": "Ukraine officials blame Russia for blackouts across east of country", "title_page": "Ukraine officials blame Russia for blackouts across east of country | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KRAMATORSK, UKRAINE - Officials in east Ukraine on Sunday blamed Russian attacks on key facilities for widespread blackouts that hit large areas of the country where Kyiv's forces have been making gains in a counter-offensive.\nThe blackouts, which came after Ukrainian forces said they had recaptured dozens of towns and villages in eastern Ukraine, hit regions with pre-war populations of millions of people.\nThe regional governor of the Kharkiv region, where Ukrainian troops have reported the largest gains, said Russian forces had \"struck critical infrastructure\" across the region and its main city, also called Kharkiv.\n\"There is no electricity or water supply in several settlements. Emergency services are working to control fires at the sites that were hit,\" Oleg Synegubov said in a statement on social media.\nThe head of the Dnipropetrovsk region Dmytro Reznichenko also said Russian forces were responsible for blackouts across his region. \"Several cities and communities in the Dnipropetrovsk region are without electricity.\nThe Russians hit energy infrastructure. They cannot accept defeat on the battlefield,\" he said in a statement online. The head of the eastern Sumy region meanwhile said the cuts to electricity and water supplies had impacted at least 135 towns and villages.\nAFP journalists in the Donetsk regional city of Kramatorsk meanwhile confirmed the cuts were also impacting one of the largest cities in the east still under Ukrainian control. Its governor had also reported cuts across the region, which has been partially controlled by Moscow-backed separatist since 2014. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-officials-blame-russia-for-blackouts-across-east-of-country"}