{"authors": [], "date_download": "2024-10-12 13:29:02", "date_modify": "2024-10-12 13:29:02", "date_publish": "2022-11-24 03:14:21", "description": "Covid-19 resulted in weakened surveillance of measles. Read more at straitstimes.com.", "filename": "world_europe_measles-now-an-imminent-global-threat-due-to-pandemic-say-who-cdc_1728739742.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/24/US-CENTER-FOR-DISEASE-CONTROL-REPORTS-HIGHEST-NUMBER-OF-MEASLES-192445_6.jpg?VersionId=j28q6mCYSBsu1NmC8NyTqnWLRHRRoO8o", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_measles-now-an-imminent-global-threat-due-to-pandemic-say-who-cdc_1728739742.html", "title": "Measles vaccine coverage gap sparks fears of resurgence in children", "title_page": "Measles vaccine coverage gap sparks fears of resurgence in children | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GENEVA - Measles is threatening to make a comeback in children after a record shortfall in vaccination rates during the pandemic, said world and US health officials.\nNearly 40 million children around the world missed a measles vaccine dose in 2021, according to a joint report from the World Health Organisation and the US Centres for Disease Control and Prevention (CDC). That raises the risk of the highly infectious respiratory virus re-emerging in the United States and other countries where it has been rooted out by immunisation campaigns.\nDeclining disease surveillance and disruptions in immunisation campaigns during the Covid-19 pandemic have helped make measles an “imminent threat” around the world, according to the report.\nVaccination coverage for US children younger than two years old is currently hovering at 90.4 per cent, far below the 95 per cent level needed to keep the disease at bay, according to CDC data.\n“The record number of children under-immunised and susceptible to measles shows the profound damage immunisation systems have sustained during the Covid-19 pandemic,” CDC director Rochelle Walensky said.\nMeasles can be prevented with two doses of vaccine that are routinely included in US childhood shots that also prevent mumps and rubella.\nCampaigns led the US to measles eradication in 2000, but imported cases from parts of the world where the virus still circulates cause sporadic outbreaks. In 2018, an imported case sparked a flare-up that tore through an unvaccinated community in New York, eventually infecting 649 people.\nMore than 13 per cent of US children are now susceptible to measles due to declines in vaccine coverage during the pandemic, according to a separate study published in July in the journal Vaccine, and the disease already appears to be slipping through coverage gaps.\nAn ongoing outbreak in Columbus, Ohio, has infected two dozen unvaccinated children. Nearly half of them were hospitalised, local health data showed. The highly contagious virus, which spreads through coughing and sneezing, has already moved through 11 Columbus-area daycare facilities.\nAlmost two-thirds of the Ohio cases are in one- to two-year-olds, all of whom are unvaccinated against measles, mumps and rubella (MMR). MMR vaccine coverage among Ohio kindergarteners fell from 92.4 per cent during the 2019-2020 school year to 89.6 per cent in the following year, according to the CDC.\n“What’s happening in Ohio may be a harbinger of things to come,” said Dr Robert Bednarczyk, a global health and epidemiology professor at Emory University in Atlanta who helped write the Vaccine paper. “When you factor in Covid-19 declines in primary care visits, is this going to start raising questions about other routine vaccinations?”\nClusters of measles-susceptible children could reignite transmission within the US. Symptoms usually begin with a fever, cough, runny nose and watery eyes. Tiny white spots then start to appear inside the mouth, followed by a red blotchy rash. Serious cases can cause pneumonia.\n“Highly infectious diseases like measles act as the proverbial canary in the coal mine, identifying weaknesses in public health infrastructure,” Dr Bednarczyk and his colleagues said in their July paper. “Where childhood vaccination rates dip, measles will often be the first pathogen to re-emerge.” BLOOMBERG", "url": "https://www.straitstimes.com/world/europe/measles-now-an-imminent-global-threat-due-to-pandemic-say-who-cdc"}