{"authors": [], "date_download": "2024-10-12 13:39:53", "date_modify": "2024-10-12 13:39:53", "date_publish": "2024-05-29 02:21:38", "description": "A Hong Kong-registered container ship is the prime suspect, after two subsea telecoms cables were cut in October 2023. Read more at straitstimes.com.", "filename": "world_europe_estonia-says-china-has-not-responded-to-subsea-cables-probe-request_1728740393.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/29/estoniachinasunseacable29.jpg?VersionId=1k63DqZRCyPyn1fk2nxFVdNIvo1EiQ0V", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_estonia-says-china-has-not-responded-to-subsea-cables-probe-request_1728740393.html", "title": "Estonia says China has not responded to subsea cables probe request", "title_page": "Estonia says China has not responded to subsea cables probe request | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VILNIUS - Estonia’s state prosecutor said China has not responded to a six-month-old request for help with an investigation into a Chinese ship which Estonia suspects cut two of its subsea telecoms cables.\nThe two cables connecting Estonia to Finland and Sweden were damaged on Oct 7-8, and an Estonia-Finland gas pipeline was broken the same night, hurting energy security and raising alarm bells in the wider region.\nBoth Estonia, which is investigating the cables damage, and Finland, which is looking into the Balticconnector gas pipeline, have named the Hong Kong-registered container ship NewNew Polar Bear as the prime suspect.\n“The Chinese authorities have not provided a response on executing the legal aid request as of yet”, Estonian state prosecutor Triinu Olev said, in a written statement on May 28.\n“We need to collect additional evidence to determine whether the damage was caused intentionally or by accident. We submitted a legal aid request to the Chinese authorities to gather evidence from the vessel and its crew”, she added.\nThere was no immediate reply from the Chinese embassy to a Reuters email seeking comment on Ms Olev’s remarks.\nEstonia believes the vessel belongs to a Chinese company, Ms Olev said.\nThe request was sent on Nov 10, her spokesperson told Reuters in December.\nA separate legal assistance request was sent to China by the Finnish investigation, he said.\nReuters has reported that the vessel was present at all three sites around the time of their damage, on its way to a port near St Petersburg, Russia, according to data from MarineTraffic, a ship-tracking and maritime analytics provider.\nA large anchor, believed to belong to the Chinese vessel, was found near the pipeline, and the investigators said the pipe and the telecoms cables were likely broken as the anchor was dragged across the sea bed.\nFinland’s National Bureau of Investigation told Reuters in April it has “cooperated with Chinese authorities in solving” the damage to the pipeline, adding, “there is progress in the investigation”.\nChina said in October it was willing to provide the gas pipeline investigation the necessary information in accordance with international law. Russia has dismissed as “rubbish” the idea that it was involved.\nNewNew Polar Bear has been anchored in China’s Tianjin port since returning from Russia in December, according to MarineTraffic data.\nNato stepped up its patrols in the Baltic Sea in 2023 after the incidents, and the Norwegian Navy shadowed the NewNew Polar Bear as it sailed over the country’s key gas pipelines. REUTERS", "url": "https://www.straitstimes.com/world/europe/estonia-says-china-has-not-responded-to-subsea-cables-probe-request"}