{"authors": [], "date_download": "2024-10-12 13:43:53", "date_modify": "2024-10-12 13:43:53", "date_publish": "2024-03-30 10:35:00", "description": "He is seeking to woo the moderates who prefer Nikki Haley over Donald Trump. Read more at straitstimes.com.", "filename": "world_united-states_biden-campaign-launches-ad-targeting-moderate-republicans_1728740633.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/30/2024-03-29T201128Z1282054274RC2VT6A8VZ43RTRMADP3ISRAEL-PALESTINIANS-BIDEN-ARAB-AMERICANS.JPG?VersionId=KIuw1an1ft.QaH2lcjWvRZiLatxIbpWw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-campaign-launches-ad-targeting-moderate-republicans_1728740633.html", "title": "Biden campaign launches ad targeting moderate Republicans", "title_page": "Biden campaign launches ad targeting moderate Republicans | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – United States President Joe Biden released a TV spot on March 29 targeting voters of Mrs Nikki Haley, as he seeks to rebuild the coalition that won him the last election by wooing the moderates who preferred her to Donald Trump for the Republican nomination.\nThe ad shows Trump – the Republicans’ 2024 standard-bearer – repeatedly mocking the former United Nations ambassador and telling a reporter he can win without pursuing her supporters.\n“She’s gone crazy. She’s a very angry person,” Trump is heard saying during the 30-second commercial, punctuated with social media posts in which the Republican claims he “will not accept” her supporters and threatens to kick them out of his political movement.\nMr Biden posted the video on social media alongside the caption: “Nikki Haley voters, Donald Trump doesn’t want your vote. I want to be clear: There is a place for you in my campaign.”\nMr Biden has built up a campaign war chest in excess of US$70 million (S$94.3 million) ahead of November’s rematch with Trump, more than doubling his predecessor’s fund-raising haul and giving allies more latitude to spend big on TV advertising. The President raised an estimated US$26 million on March 28 at a New York event with former presidents Barack Obama and Bill Clinton.\nTrump has had to divide his time between campaign stops and court appearances as he defends himself against 88 felony counts.\nHe has also had to dedicate tens of millions of dollars in donations that could have boosted his campaign on legal fees.\nBut he benefits greatly from free coverage as he turns his many appearances at courthouses into campaign events.\nThe 77-year-old, who has been indicted four times – mostly over alleged attempts to cheat in elections – is expected to raise US$33 million from a fund-raiser on April 6 in Florida, according to the Financial Times.\nTrump secured the Republican nomination at the beginning of March after defeating Mrs Haley by wide margins in all the early voting and “Super Tuesday” states – including her home turf of South Carolina.\nBut large swathes of Republican primary voters – upwards of 40 per cent in some states – did not support Trump, raising fears that he will not be able to win the moderates he will need to take back the White House.\nThe TV spot will run for three weeks in eight key battleground states, targeting Mrs Haley voters in predominantly suburban districts where she performed best against Trump.\nThe ad will also appear across a wide array of digital platforms, including those owned by Meta – parent company of Facebook and Instagram – and YouTube.\n“As Trump loses ground, derides women and threatens to ban abortion nationwide – Joe Biden is reaching across the aisle to Haley voters, inviting them to join his growing and winning coalition of voters who will decide this election,” the President’s campaign said. AFP", "url": "https://www.straitstimes.com/world/united-states/biden-campaign-launches-ad-targeting-moderate-republicans"}