{"authors": [], "date_download": "2024-10-12 14:02:06", "date_modify": "2024-10-12 14:02:06", "date_publish": "2023-05-21 13:19:00", "description": "Still, Kyiv has not won commitments for delivery of the planes. Read more at straitstimes.com.", "filename": "world_german-chancellor-f-16-pilot-training-a-message-to-russia-not-game-changer-for-now_1728741726.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/21/FILES-UKRAINE-RUSSIA-CONFLICT-US-DEFENSE-F-16-170225_4.jpg?VersionId=1SWk7SerhiOVK691V0InBpTlqn1jiUHb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_german-chancellor-f-16-pilot-training-a-message-to-russia-not-game-changer-for-now_1728741726.html", "title": "F-16 pilot training a message to Russia, not game changer for now: German Chancellor", "title_page": "F-16 pilot training a message to Russia, not game changer for now: German Chancellor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HIROSHIMA – Potential allied training programmes for Ukrainian pilots on F-16 fighter jets were a message to Russia not to expect to succeed in its invasion of Ukraine even in a prolonged conflict, German Chancellor Olaf Scholz said on Sunday.\nKyiv has not won commitments for delivery of the planes, but US President Joe Biden and senior US officials told Group of Seven (G-7) leaders on Friday that Washington supports joint allied training programmes for Ukrainian pilots on F-16s.\nThe issue of Ukraine acquiring and using the advanced fighter jets is a delicate challenge for the G-7, which has gradually stepped up its support for Kyiv in the 15-month-old war but is wary of provoking Moscow too far.\nRussian Deputy Foreign Minister Alexander Grushko said on Saturday that Western countries would run “colossal risks” if they supplied Ukraine with F-16s, Tass news agency reported.\n“The training of the pilots is a longer project,” Mr Scholz told reporters before leaving the G-7 summit in the Japanese city of Hiroshima. “The US has not finally decided what stands at the end. The project has a message for Russia: Russia cannot count on winning if it bets on a long war.”\nBritish Prime Minister Rishi Sunak said his country would work with the Netherlands, Belgium and Denmark “to get Ukraine the combat air capability it needs”.\nTraining on the US-made jets will take place in Europe and take time, US officials have said, estimating that at least 18 months are needed for training and delivery.\nA French military official briefing reporters at the G-7 was cautious about the process, saying that in the case of France, the offer was for basic pilot training.\nDiscussions with Kyiv were ongoing and no Ukrainian pilots were now being trained in France, the official said.\nFrance does not have F-16s, only French-made Rafale warplanes and previous-generation Mirage 2000 jets.\nThe official said training a person from scratch to operate a Nato-made warplane could take as long as four years, while an experienced pilot used to Ukrainian jets would need four to nine months.\n“It’s not the immediate priority for Ukraine. We are in a counteroffensive stage and this training won’t be ready in the coming weeks, but for the long term.”\nThe official noted that talk of F-16s was grabbing headlines, as the issue of German-made Leopard tanks had done before, but insisted that the current request was just for training. “It’s the logo to show the initiative. It’s an initiative to train pilots without putting a plane behind it,” he said. REUTERS", "url": "https://www.straitstimes.com/world/german-chancellor-f-16-pilot-training-a-message-to-russia-not-game-changer-for-now"}