{"authors": [], "date_download": "2024-10-12 13:32:07", "date_modify": "2024-10-12 13:32:07", "date_publish": "2023-10-04 03:08:56", "description": "Each piece of candy contained 100mg of THC, which is considered a strong dose for experienced adults. Read more at straitstimes.com.", "filename": "world_over-60-jamaican-school-kids-hospitalized-after-eating-cannabis-rainbow-candy_1728739927.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/04/LYNXMPEJ920RW-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_over-60-jamaican-school-kids-hospitalized-after-eating-cannabis-rainbow-candy_1728739927.html", "title": "Over 60 Jamaican schoolkids hospitalised after eating cannabis rainbow candy", "title_page": "Over 60 Jamaican schoolkids hospitalised after eating cannabis rainbow candy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KINGSTON – More than 60 Jamaican primary school pupils were hospitalised after eating potent rainbow-coloured cannabis candy, the Caribbean country’s education minister said on social media platform X.\nThe candy caused them to vomit and hallucinate.\n“I feel confident that together, we will strengthen our safety and security regime to combat the unconscionable sale of marijuana-infused products to children,” Ms Fayval Williams said on Tuesday, noting the “most unfortunate” circumstances under which she met parents and stakeholders of Ocho Rios Primary School.\nLate on Monday, Ms Williams had shared an image she said had been reported to her ministry showing a colourful packet of “full-throttle rainbow sour belts”, each containing 100mg of THC, a substance found in marijuana – which is considered a strong dose for experienced adults.\n“One little boy said he only had one sweetie,” Ms Williams said, adding several of the schoolchildren had been given intravenous drips to speed up recovery. “That’s how potent this product is.”\nJamaica decriminalised possession of up to 57g of marijuana for religious, medicinal and scientific purposes in 2015, and set up a licensing agency for the country’s legal medical cannabis industry.\nRadio Jamaica reported that the Ganja Growers and Producers Association of Jamaica was suggesting a public education programme for responsible consumption by adults and to prevent consumption by children, as well as pushing for more packaging regulations. REUTERS", "url": "https://www.straitstimes.com/world/over-60-jamaican-school-kids-hospitalized-after-eating-cannabis-rainbow-candy"}