{"authors": [], "date_download": "2024-10-12 14:09:17", "date_modify": "2024-10-12 14:09:17", "date_publish": "2018-10-20 12:23:52", "description": "ISTANBUL (AGENCE FRANCE-PRESSE) - Saudi Arabia has admitted that a dissident journalist was murdered in its consulate in Turkey. Read more at straitstimes.com.", "filename": "world_middle-east_murder-of-saudi-dissident-journalist-jamal-khashoggi-a-look-at-the-main-players_1728742157.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/10/20/nz-suspect-20.jpg?VersionId=aL6C2Qj8Ii5F6Q7O9hXabYBcUpIdqSps", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_murder-of-saudi-dissident-journalist-jamal-khashoggi-a-look-at-the-main-players_1728742157.html", "title": "Murder of Saudi dissident journalist Jamal Khashoggi: A look at the main players and suspects", "title_page": "Murder of Saudi dissident journalist Jamal Khashoggi: A look at the main players and suspects | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ISTANBUL (AGENCE FRANCE-PRESSE) - Saudi Arabia has admitted that a dissident journalist was murdered in its consulate in Turkey.\nHere's a look at the main names that have cropped up in the case:\n1. MR JAMAL KHASHOGGI\nA complex man of contradictions, journalist Jamal Khashoggi went from being a Saudi royal family insider to an outspoken critic of the ultra-conservative kingdom's government, and was ultimately killed inside its consulate in Istanbul.\nThe Saudi journalist - who disappeared after entering his country's consulate in Istanbul on Oct 2 to obtain marriage papers - went into self-imposed exile in the United States in 2017 after falling out with Saudi's powerful Crown Prince Mohammed bin Salman.\nMr Khashoggi, 59, came from a prominent Saudi family with Turkish origins. His grandfather, Mohammed Khashoggi, was the personal doctor of Saudi Arabia's founder, King Abdul Aziz al-Saud. His uncle was the notorious arms dealer Adnan Khashoggi.\nBorn in the Saudi holy city of Medina on Oct 13, 1958, Mr Khashoggi spent his youth studying Islamic ideology and embraced liberal ideas.\nA friend of a young Osama bin Laden, a Muslim Brotherhood sympathiser, an aide to the Saudi royal family, a critic of the kingdom's regime and a liberal - such conflicting descriptions were all ascribed to Mr Khashoggi.\nOver the years, he maintained ambiguous ties with the Saudi authorities, having held advisory positions in Riyadh and Washington, including to Prince Turki al-Faisal, who ran Saudi Arabia's intelligence agency for more than 20 years.\nIn an article published in the Post last year, Mr Khashoggi, whose 60th birthday was on Oct 13, said that under Prince Mohammed - the kingdom's de facto ruler - Saudi Arabia was entering a new era of \"fear, intimidation, arrests and public shaming\".\n2. CROWN PRINCE MOHAMMED BIN SALMAN\nAs the 33-year-old heir to the Saudi throne, Crown Prince Mohammed bin Salman was expected to rule for half a century. And he still might.\nBut at the moment he's in trouble. The alleged murder of Jamal Khashoggi has put Saudi leaders under a harsh spotlight.\nPrince Mohammed, who's effectively been running the country on behalf of his father King Salman, denies knowing anything about the journalist's disappearance. Popularly known as MBS, he's been singled out for blame in the US Congress, while Western policymakers are shunning his showpiece investor summit next week.\nWhen his father King Salman ascended to the throne in 2015, Prince Mohammed leapfrogged a generation of more experienced uncles and cousins to become heir to the throne.\nOn the way he grabbed control over the key levers of the economy, including the central bank and oil giant Aramco, as well as the Defence Ministry.\nThe crown prince set out to change a strict religious culture, and he delivered on some promises, allowing women to drive cars and loosening Saudi social life by permitting cinemas and concerts. Those measures won him fanfares in the West.\nBut at the same time, Saudi Arabia detained dozens of prominent local entrepreneurs as part of a supposed crackdown on graft. Abroad, it launched a boycott of Qatar, and got embroiled in disputes with Germany and Canada that threatened commercial deals with those countries.\nOpposition to any of his initiatives hasn't been tolerated in a climate of fear. An economist who questioned a sale plan for Aramco was arrested. So were women activists who'd campaigned for an end to the driving ban. So were dozens of people accused of collaboration with Qatar - a charge also levelled at Mr Khashoggi, before he disappeared.\nNevertheless, Prince Mohammed, who's denied any knowledge of Khashoggi's fate, still has his defenders - notably US President Donald Trump.\n3. MR SAUD AL-QAHTANI\nCrown Prince Mohammed's key counsellor is said to have been Mr Saud al-Qahtani, his media adviser, but also increasingly his consigliere in the kingdom's battles with foreign adversaries such as Qatar and Iran, as well as domestic critics.\nLike his boss, Mr Qahtani is considered young and headstrong. Mr Qahtani organised interviews with MBS for visiting foreign journalists. But sources say he was quietly assuming a larger role overseeing strategy in social media, which the Saudis (like the Russians) view as a domain of war.\nMr Qahtani's headquarters was a special \"Centre for Studies and Media Affairs\", operating inside the royal court without supervision from other ministries. It became, in part, a domestic snooping operation, sources say.\nMr Qahtani is a demon in Saudi Twitter debates, with 1.3 million followers and barbed messages to dissenters. He has created a hashtag with the Arabic term for \"Black List\", and he urges Saudis to report enemies of the kingdom.\nHis opponents in Qatar refer to Mr Qahtani's followers (perhaps including automated bots) as an \"Army of Flies\".\nUS officials believe that, in addition to seeking dominance in social media, Mr Qahtani and other advisers have helped MBS use the latest and most aggressive hacking techniques against adversaries.\nMr Qahtani has been sacked for allegedly contributing to the aggressive environment that allowed Mr Khashoggi's visit to the Saudi consulate to escalate into violence.\n4. MAJOR-GENERAL AHMED AL-ASSIRI\nThe deputy director of Saudi intelligence has been sacked for his role in allegedly organising the operation that led to Mr Khashoggi's killing.\nThe general has been a well-known face to the international news media since he was named as spokesman for the Saudi-led coalition that intervened in Yemen in 2015. He gave interviews in fluent French, English and Arabic, but often privately harassed reporters when their reports turned out not to his liking.\nGen Assiri was promoted last year to his current job in intelligence, and the Saudis are expected to contend that in the Khashoggi case, he was seeking to prove himself, according to people familiar with their plans.\nGen Assiri's seniority makes the notion that he carried out the operation without the further participation of Prince Mohammed at least technically plausible. Lower-ranking Saudi officers might have trusted that the general was giving them orders on behalf of the prince.\nEven before Saudi channels ran the news that Mr Khashoggi was killed in the Saudi consulate on Saturday, news reports indicated that the Saudi rulers would say that Gen Assiri received verbal authorisation from Prince Mohammed to capture Mr Khashoggi for an interrogation in Saudi Arabia, but either misunderstood his instructions or overstepped that authorisation and took the dissident's life, according to two of the people familiar with the Saudi plans.\n5. THE MURDER SUSPECTS\nEighteen people have been detained by the Saudi authorities as part of their investigation into Mr Khashoggi's murder.\nWhile the Saudi government has not named the people detained over the murder, Turkey has said that a 15-member Saudi team had flown into Istanbul on private jets and visited the Saudi consulate on the day Mr Khashoggi disappeared. The same people had flown out of the country on the same day.\nTurkey's Sabah Daily has said one suspect, Mr Maher Abdulaziz Mutreb, was a diplomat assigned to the Saudi embassy in London in 2007, citing a British diplomatic roster.\nMr Mutreb, perhaps a bodyguard, has been photographed emerging from planes with Prince Mohammed on recent trips to Madrid and Paris, the newspaper reported.\nIt added that Mr Mutreb was also photographed standing guard during Prince Mohammed's visits in the United States to Houston, Boston and the United Nations.\nThe New York Times said three other suspects are Mr Abdulaziz Mohammed al-Hawsawi - a member of the security team that travels with Prince Mohammed - Mr Thaar Ghaleb al-Harbi, and Mr Muhammed Saad Alzahrani.\nMr Harbi and Mr Alzahrani have the same names as two people who have been identified as members of the Saudi Royal Guard, the New York Times said.\nA fifth suspect is an autopsy expert, Mr Salah al-Tubaigy, who the New York Times said identified himself on his Twitter account as the head of the Saudi Scientific Council of Forensics.\nHe also held high positions in the Interior Ministry and the kingdom's top medical school, the report said.", "url": "https://www.straitstimes.com/world/middle-east/murder-of-saudi-dissident-journalist-jamal-khashoggi-a-look-at-the-main-players"}