{"authors": [], "date_download": "2024-10-12 14:07:54", "date_modify": "2024-10-12 14:07:54", "date_publish": "2022-07-28 10:13:20", "description": "Troop deaths and injuries have been mounting, given that fierce fighting has endured for months. Read more at straitstimes.com.", "filename": "world_united-states_us-quietly-sharing-its-estimate-of-russian-war-casualties-more-than-75000-killed-or-injured_1728742074.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/28/ac_ukr-soldier_280722.jpg?VersionId=OktSa0_fnCmt3Md2JxPhL.n.XIIIuTfW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-quietly-sharing-its-estimate-of-russian-war-casualties-more-than-75000-killed-or-injured_1728742074.html", "title": "US quietly sharing its estimate of Russian war casualties: More than 75,000 killed or injured", "title_page": "US quietly sharing its estimate of Russian war casualties: More than 75,000 killed or injured | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (NYTIMES) - The Biden administration is quietly circulating an estimate of Russian casualties in Ukraine that far exceeds earlier US estimates, telling lawmakers that more than 75,000 members of Russia's forces had been killed or injured.\nA legislator who recently visited Ukraine confirmed Wednesday (July 27) that the estimate had emerged in a briefing from the State Department, Department of Defence, the Joint Chiefs of Staff and the Office of the Director of National Intelligence.\nEarlier in the day, a reporter for CNN tweeted the estimate and said it had been shared in a classified House briefing.\nIf accurate, the loss of 75,000 troops to death or injury would amount to a staggering loss: Estimates of the number of Russian forces in Ukraine ranged as high as 150,000 in the spring, meaning roughly half could be out of action.\nPentagon officials have said that losing just 10 per cent of a military force, including those killed and injured, renders a single unit unable to carry out combat-related tasks. Such losses also affect the morale and cohesion of a military unit.\nThroughout the war, Ukraine and Russia have shielded their casualty numbers, keeping one another, and the rest of the world, guessing about the depth of their losses.\nBoth sides have an interest in under-reporting battlefield losses: Russia to preserve its domestic narrative of success, and Ukraine to maintain morale.\nTroop deaths and injuries have been mounting, given that fierce fighting has endured for months, but the Biden administration's estimate suggests just how high casualties may have gone on Russia's side.\nMore recently, a senior adviser to President Volodymyr Zelensky of Ukraine said that Ukrainian military casualties were now 100 to 200 per day.\nJust weeks into the war, US officials offered what they said was a conservative estimate of more than 7,000 Russian war deaths so far - more than the number of US troops killed over 20 years in Iraq and Afghanistan combined.\nRussia followed with a far smaller count, saying March 25 that 1,351 of its troops had been killed. And Mr Zelensky said the same month that an estimated 1,300 Ukrainian soldiers had been killed.\nIn May, Ukraine said that 30,000 Russian soldiers had been killed since the invasion began in February, a number impossible to independently verify.\nIn April, a British intelligence assessment put the estimated Russian losses at half that number.\nMr Zelensky made a new claim in his nightly address Tuesday, saying that almost 40,000 Russian soldiers had been killed since the start of the war, with tens of thousands more injured.\nThat claim comports, in broad terms, with the US estimate of about 75,000 Russian total casualties.", "url": "https://www.straitstimes.com/world/united-states/us-quietly-sharing-its-estimate-of-russian-war-casualties-more-than-75000-killed-or-injured"}