{"authors": [], "date_download": "2024-10-12 13:44:23", "date_modify": "2024-10-12 13:44:23", "date_publish": "2024-03-14 15:42:00", "description": "Even nuclear war and unbridled climate change on Earth would not make Mars more liveable, Mr Obama said. Read more at straitstimes.com.", "filename": "world_europe_protect-earth-instead-of-colonising-mars-obama-says_1728740663.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/14/nasa-vhSz50AaFAs-unsplash.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_protect-earth-instead-of-colonising-mars-obama-says_1728740663.html", "title": "Protect Earth instead of colonising Mars, Obama says", "title_page": "Protect Earth instead of colonising Mars, Obama says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Humanity must preserve Earth before dreaming of colonising Mars because even nuclear war and unbridled climate change cannot make the red planet more liveable, former United States president Barack Obama said on March 13.\nSpeaking at a renewable energy conference in the French capital Paris, the former US president mentioned Silicon Valley “tycoons, many of whom are building spaceships” that could take humans to Mars.\n“But when I hear some of the people talk about the plan to colonise Mars because the Earth environment may become so degraded that it becomes unliveable, I look at them like, what are you talking about?”\n“Even after a nuclear war, Earth would be more liveable than Mars, even if we didn’t do anything about CC (climate change) it would still have oxygen – as far as we can tell, Mars does not,” Mr Obama said.\n“I would rather us invest in taking care of this planet here,” he continued, saying space exploration should be for gathering knowledge and discovery rather than creating new living space for humanity.\n“We were designed for this place, and it would be good if we kept this place in a way that’s liveable,” he concluded.\nDuring his hour-long talk, Mr Obama discussed his climate record at the White House between 2009 and 2017.\nAs for his successor and potential future president Donald Trump, a long-time climate sceptic who withdrew the US from the landmark 2015 Paris Agreement, Mr Obama said the facts spoke for themselves.\nMr Obama was speaking as a special guest at the opening the Powr Earth Summit, a gathering organised by two renewable energy entrepreneurs and attended by industry players. AFP", "url": "https://www.straitstimes.com/world/europe/protect-earth-instead-of-colonising-mars-obama-says"}