{"authors": [], "date_download": "2024-10-12 13:34:36", "date_modify": "2024-10-12 13:34:36", "date_publish": "2024-09-25 20:58:43", "description": "TBILISI - The United States has withdrawn an invitation to Georgia's prime minister to attend a reception for world leaders hosted by President Joe Biden during this week's U.N. General Assembly, a U.S. official said, in the latest blow to a once-close relationship. Read more at straitstimes.com.", "filename": "world_europe_georgian-pm-disinvited-from-biden-un-reception-as-relations-sour_1728740076.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/25/LYNXMPEK8O0GG-1.jpg?VersionId=T3x8_dyGDuZbGQlCcGLmeYkyC1CmGUVR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_georgian-pm-disinvited-from-biden-un-reception-as-relations-sour_1728740076.html", "title": "US withdraws Georgian PM's invitation to Biden's UN reception", "title_page": "US withdraws Georgian PM's invitation to Biden's UN reception | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TBILISI - The United States has withdrawn an invitation to Georgia's prime minister to attend a reception for world leaders hosted by President Joe Biden during this week's U.N. General Assembly, a U.S. official said, in the latest blow to a once-close relationship.\nThe official told Reuters that Washington had cancelled the invitation to Prime Minister Irakli Kobakhidze and declined all meetings with the Georgian delegation.\nThey said the move was connected with Georgia's passage of a law on \"foreign agents\" earlier this year. Recent conversations with the Georgian government had convinced Washington that Tbilisi was intentionally scuttling its own path to joining the European Union and NATO, the official added.\nGeorgia's InterPressNews cited the U.S. embassy in Tbilisi as saying that the invitation had been rescinded over what it said was the Georgian government's \"anti-democratic actions, disinformation, and negative rhetoric towards the U.S. and the West.\"\nIt quoted parliamentary speaker Shalva Papuashvili as saying that the withdrawal of the invitation was \"frivolous\".\nBroadly pro-Western and a major U.S. aid recipient since independence from the Soviet Union in 1991, EU candidate-member Georgia has in recent months seen its ties with Western powers sour over accusations of authoritarian and pro-Russian leanings.\nThe ruling Georgian Dream party, widely seen as controlled by billionaire ex-Prime Minister Bidzina Ivanishvili, passed the \"foreign agents\" law despite condemnation by Western countries who saw it as inspired by Russian legislation used to crush Kremlin critics.\nThe law requires organisations receiving more than 20% of their funding from abroad to register as agents of foreign influence, imposing onerous disclosure requirements and punitive fines for violations.\nGeorgian Dream is seeking a fourth term in office in an October parliamentary election, and Ivanishvili has repeatedly suggested that if re-elected the party will move to ban the pro-Western opposition United National Movement.\nAccording to opinion polls, Georgian Dream remains the most popular party but it has lost ground since 2020, when it won almost 50% of the vote and a slim parliamentary majority.\nIn a post on Facebook, senior Georgian Dream MP Mamuka Mdinaradze accused Biden of seeking to provide an electoral \"lifeline\" to the Georgian opposition.\nIn further signs of the chill in relations, the U.S. this month imposed sanctions on two Georgian police commanders it said were involved in beatings meted out to leaders of mass protests against the foreign agent law.\nLast week the EU, which has previously said Georgia's application process is de facto frozen, said it may suspend its visa-free regime for Georgians if the October election is not free, fair and peaceful. REUTERS", "url": "https://www.straitstimes.com/world/europe/georgian-pm-disinvited-from-biden-un-reception-as-relations-sour"}