{"authors": [], "date_download": "2024-10-12 14:07:46", "date_modify": "2024-10-12 14:07:46", "date_publish": "2023-03-19 05:15:52", "description": "KIGALI - Britain’s interior minister defended a controversial plan to deport asylum seekers who arrive in the UK illegally to Rwanda during a visit to the country on Saturday, saying it was “compassionate”. Read more at straitstimes.com.", "filename": "world_europe_britain-defends-rwanda-asylum-plan-as-compassionate_1728742066.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/19/2023-03-18T203342Z1152082512RC2BWZ9C4XNYRTRMADP3BRITAIN-IMMIGRATION-RWANDA_0.JPG?VersionId=0toDyLjPyN_hzOvx41EmArYS7RWgdm51", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_britain-defends-rwanda-asylum-plan-as-compassionate_1728742066.html", "title": "Britain defends Rwanda asylum plan as 'compassionate'", "title_page": "Britain defends Rwanda asylum plan as 'compassionate' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KIGALI - Britain’s interior minister defended a controversial plan to deport asylum seekers who arrive in the UK illegally to Rwanda during a visit to the country on Saturday, saying it was “compassionate”.\nThe UK’s conservative government has made tackling illegal immigration a priority, and it was a key promise as the country left the European Union.\nIt is seeking to outlaw asylum claims by all illegal arrivals and transfer them to “safe” third countries, such as Rwanda, in a bid to stop thousands of migrants from crossing the Channel on small boats.\n“I sincerely believe that this world-leading partnership between two allies and two friends, the United Kingdom and Rwanda, will lead the way in finding a solution which is both humanitarian and compassionate,” Home Secretary Suella Braverman said in Kigali.\nShe spoke alongside Rwandan Foreign Minister Vincent Biruta, who said the move “will not only help dismantle criminal human-smuggling networks, but also save lives”.\nMore than 45,000 migrants arrived on the shores of south-east England on small boats last year – a 60 per cent annual increase on a perilous route that has been used by more people every year since 2018.\n‘Safe passage, not Rwanda’\nThe government, which is trailing in opinion polls, has been striving for years to tackle the crossings.\nIt had hoped the threat of a one-way ticket to Rwanda, where migrants would remain if accepted for asylum, would deter the cross-Channel journeys.\nBut that plan, announced by former prime minister Boris Johnson last year, was blocked at the last minute by the European Court of Human Rights (ECHR), which is separate to the EU.\nIt was then upheld by the High Court in London, but has been mired in appeals. No flights to Rwanda have yet taken place.", "url": "https://www.straitstimes.com/world/europe/britain-defends-rwanda-asylum-plan-as-compassionate"}