{"authors": [], "date_download": "2024-10-12 13:37:05", "date_modify": "2024-10-12 13:37:05", "date_publish": "2024-08-22 16:18:00", "description": "The US said the USS Ralph Johnson made a \"routine\" transit of the strait in accordance with international law. Read more at straitstimes.com.", "filename": "world_china-says-it-monitored-warned-us-destroyer-in-taiwan-strait_1728740225.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/22/2024-06-12T185125Z1335199773RC2T98ACB4KURTRMADP3USA-CHINA-DIPLOMACY.JPG?VersionId=eUm8zKSU8cuX5ZQyjY.7fKccWdBEtFni", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_china-says-it-monitored-warned-us-destroyer-in-taiwan-strait_1728740225.html", "title": "China says it monitored, warned US destroyer in Taiwan Strait", "title_page": "China says it monitored, warned US destroyer in Taiwan Strait | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING - China’s military said it had monitored and warned a US destroyer as it sailed through the Taiwan Strait on Aug 22, the latest such traversing of the sensitive waterway to upset Beijing.\nChina claims sovereignty over democratically governed Taiwan, and says it has jurisdiction over the strait.\nTaiwan and the United States dispute that, saying the Taiwan Strait is an international waterway.\nThe US Navy’s 7th Fleet said in a statement that the destroyer USS Ralph Johnson made a “routine” transit of the strait in accordance with international law.\nChina’s military described the sailing as “public hype”, adding that it had sent naval and air forces to monitor and warn the US ship, and “deal with it in accordance with the law and regulations”.\n“Troops in the theatre remain on high alert at all times and will resolutely safeguard national sovereignty and security as well as regional peace and stability,” said the Eastern Theatre Command of the Chinese People’s Liberation Army.\nTaiwan’s Defence Ministry said the ship sailed in a northerly direction through the strait and that Taiwanese forces had monitored the situation but observed nothing unusual.\nUS military ships and aircraft transit the narrow strait about once a month.\nTaiwan’s government rejects China’s sovereignty claims and says that only the island’s people can decide their future.\nChina has never renounced the use of force to bring Taiwan under its control. REUTERS", "url": "https://www.straitstimes.com/world/china-says-it-monitored-warned-us-destroyer-in-taiwan-strait"}