{"authors": [], "date_download": "2024-10-12 13:48:51", "date_modify": "2024-10-12 13:48:51", "date_publish": "2023-12-14 16:18:00", "description": "The EU rejected the proposal for a UN-run trading system with looser standards. Read more at straitstimes.com.", "filename": "world_middle-east_cop28-kicks-carbon-trading-down-the-road-as-eu-blocks-deal_1728740931.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/14/btcarbon20231214.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_cop28-kicks-carbon-trading-down-the-road-as-eu-blocks-deal_1728740931.html", "title": "COP28 kicks carbon trading down the road as EU blocks deal", "title_page": "COP28 kicks carbon trading down the road as EU blocks deal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI - United Nations climate talks failed on Dec 13 to seal a deal on new rules which would allow the launch of a central system for countries and companies to begin offsetting their carbon emissions and trading those offsets.\nThe European Union, Mexico and the Independent Association of Latin America and the Caribbean (Ailac) rejected a proposed deal, negotiated over two weeks at COP28, which would have set key rules for approving offset projects in a centralised UN-run system, two negotiators inside the closed-door technical talks told Reuters.\nThe United States was with a majority of countries that pushed for the deal’s adoption, saying demands for stricter rules would be too onerous for many developing countries with limited means for overseeing and regulating projects.\n“The US and European Union have been at loggerheads” on the issue, said Mr Dirk Forrister, president and chief executive officer of the International Emissions Trading Association.\nThe EU wanted rules that put carbon offsets in line with the high standards set by the 27-member bloc’s own emissions trading system, three negotiators and observers who were closely following the talks told Reuters.\nWhile the EU system does not use offsets, it effectively sets carbon prices by granting companies permission to emit.\nThe price for emitting one metric tonne of carbon surged above €100 (S$145) in the EU system earlier in 2023 and is now trading at around €70, LSEG futures market data shows.\nFailure to reach a deal on Dec 13 in Dubai means that eight years after the Paris Agreement provided for governments and companies to offset some of their emissions by paying for emissions-cutting projects elsewhere, trading has yet to begin.\n“This is certainly a setback for carbon markets,” said Ms Lina Barrera of Conservation International.\n“Those interested in participating in the market won’t know what to expect, slowing the whole process of getting a market off the ground,” Ms Barrera said.\nThe technical working groups will now need to begin negotiating again from scratch in 2024, with the next chance for a deal at COP29, in Azerbaijan in 2025.\nTwin-track\nNegotiations are following two parallel tracks – one to establish rules for a centralised system overseen by the UN, and one for bilateral trading between countries.\nThe EU had been pushing for rules that would hold parties to stringent standards and give the centralised oversight body less discretion in decision-making. It also wanted additional oversight on the bilateral trading.\n“If you move into a carbon market, if you’re into this type of business, it had better be verifiable, certifiable and transparent,” EU climate commissioner Wopke Hoekstra said.\n“That is the very least our people all across the globe should be able to expect,” Mr Hoekstra said on Dec 9.\nIf the UN-run system were to launch with looser standards, the carbon prices set through that market would likely be lower than those in the EU, antagonising European businesses that would be held to higher standards, experts said.\nNegotiators and observers familiar with the talks said the EU was concerned that such a move could weaken its own system or discourage ambitious climate action.\nThe UN-led market for carbon offsets would also be separate, and run alongside, voluntary carbon markets, where companies can trade offsets to meet climate targets but are not legally required to do so.\nThese have faltered over the last year, after reports of projects failing to live up to environmental promises.\nSeveral analysts said no deal was better than a bad one.\nCarbon Market Watch said the proposed rules would have allowed too much of a free-for-all in which countries could set their own standards, while rules for projects like planting trees to remove carbon from the atmosphere were weak.\n“By rejecting it, negotiators made the best out of a bad situation,” said Carbon Market Watch’s Gilles Dufrasne. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/cop28-kicks-carbon-trading-down-the-road-as-eu-blocks-deal"}