{"authors": [], "date_download": "2024-10-12 14:10:09", "date_modify": "2024-10-12 14:10:09", "date_publish": "2019-01-16 00:39:12", "description": "LONDON/WASHINGTON (REUTERS) - A Saudi royal adviser fired over the killing of journalist Jamal Khashoggi continues to wield influence in Crown Prince Mohammed bin Salman's inner circle, according to Western, Arab and Saudi sources with links to the royal court. Read more at straitstimes.com.", "filename": "world_middle-east_saudi-aide-fired-over-jamal-khashoggi-murder-still-wields-influence-say-sources_1728742209.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/01/16/2019-01-03t125540z_1782996069_rc1fc484d770_rtrmadp_3_saudi-khashoggi.jpg?VersionId=NryM6mPaPn7HNb1gzFlJZ6xGl9jvT7yV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_saudi-aide-fired-over-jamal-khashoggi-murder-still-wields-influence-say-sources_1728742209.html", "title": "Saudi aide fired over Jamal Khashoggi murder still wields influence, say sources", "title_page": "Saudi aide fired over Jamal Khashoggi murder still wields influence, say sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON/WASHINGTON (REUTERS) - A Saudi royal adviser fired over the killing of journalist Jamal Khashoggi continues to wield influence in Crown Prince Mohammed bin Salman's inner circle, according to Western, Arab and Saudi sources with links to the royal court.\nSaud al-Qahtani was dismissed as a top aide to the de facto Saudi leader in late October, after overseeing the operation to kill Khashoggi inside the Saudi consulate in Istanbul by giving orders via Skype, according to regional intelligence sources.\nA senior Saudi official at the time called his removal \"a political decision... based on dereliction of duty and participation in the sequence of events\" that led to the murder.\nWeeks later, the US Treasury sanctioned Qahtani for his role.\nBut six sources told Reuters that Qahtani remains active on behalf of the royal court.\nTwo of them said he has kept in touch with the crown prince, while three others said he has continued to instruct a small group of Saudi journalists on what to write about the kingdom's policies.\nAs head of the royal court's media centre until his dismissal, Qahtani ran an electronic media army tasked with protecting Saudi Arabia's image, dictating the official line on issues from a dispute with Qatar to security and human rights.\nThe apparent impunity of Qahtani, seen as the crown prince's right-hand man, risks undermining Saudi promises to hold those responsible to account, the sources say.\nThe US Senate last month backed a resolution blaming the crown prince, known as MbS, for the killing and insisted Riyadh fully investigate.\nA Saudi official denied Qahtani was still playing a role inside the royal court, saying he has not conducted any work since his dismissal and that he remains under investigation and banned from travel.\nThe official referred Reuters to comments by the public prosecutor's spokesman last year that 21 Saudis were taken into custody in relation to the Khashoggi case, 11 of whom have been indicted and referred to trial.\nReuters has been unable to reach Qahtani since he was fired.\n'FREE AND IN FAVOUR'\nAt the heart of the crown prince's inner circle, Qahtani controlled access to MbS and would often speak on his behalf before he was dismissed, government insiders have said.\nNo official replacement has yet been announced.\nQahtani has continued to make repeated appearances at the royal court, although it was not clear in what capacity, five of the sources said.\nAll of the sources spoke on condition of anonymity to discuss sensitive internal matters.\n\"He is still around, free and in favour. The crown prince is still holding on to him and doesn't seem to be willing to sacrifice him,\" one of the foreign sources said.\nMbS himself has told visitors that Qahtani is still an adviser while assuring them that some responsibilities have been taken from him, according to a source familiar with the discussion between the crown prince and the visitors. The source did not elaborate.\nQahtani has also continued to dictate the royal court's official line to columnists and top editors he considers able to influence public opinion, according to three of the sources, despite leaving a WhatsApp group he ran for that purpose.\nInstead, he has messaged individuals directly, instructing them on what or what not to write, these sources said.\nLYING LOW\nQahtani's involvement in Khashoggi's murder, which intelligence sources have said included giving orders over Skype to the team inside the consulate, has fuelled speculation that MbS ordered the hit. Saudi officials have said the crown prince knew nothing of the killing.\nThe public prosecutor has said Qahtani briefed a team of Saudi operatives ahead of a mission to repatriate Khashoggi. Saudi officials have refused to disclose whether Qahtani was among those arrested.\nThe Saudi public prosecutor is seeking the death penalty for five of the 11 suspects detained over Khashoggi's killing and a first court hearing was held this month. The suspects were not named and Reuters could not determine whether Qahtani was present at the hearing.\nA source familiar with US government agencies' reporting and analyses said they believe Qahtani has been instructed to lie low for a while but think it is unlikely that MbS would ditch Qahtani.\nSome Western allies had been concerned, even before Khashoggi's killing, by the power Qahtani wielded within the royal court and have privately urged Riyadh to replace him with more seasoned advisers, according to Western diplomats in Riyadh.\nQahtani stopped using Twitter, a platform he regularly used to attack the kingdom's critics, on Oct 23 and changed the biography on his profile to \"personal account\".\nBut Saudi activists living abroad still see his influence on Saudi media and in the Twitter attacks they say they face, accusing them of being disloyal to MbS or unpatriotic for not supporting his policies.\n\"Nothing has changed. It seems to have the same line, the same offensive language. His fingerprints are all over it still,\" said Hala al-Dosari, a Saudi scholar and activist based in the United States.", "url": "https://www.straitstimes.com/world/middle-east/saudi-aide-fired-over-jamal-khashoggi-murder-still-wields-influence-say-sources"}