{"authors": [], "date_download": "2024-10-12 13:51:01", "date_modify": "2024-10-12 13:51:01", "date_publish": "2023-10-11 05:08:14", "description": "The grand champion gourd weighs 1,247kg. Read more at straitstimes.com.", "filename": "world_united-states_oh-my-gourd-hippo-sized-pumpkin-is-worlds-biggest_1728741061.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/11/2023-weigh-off-winner-Travis-Gienger-and-family-300dpi.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_oh-my-gourd-hippo-sized-pumpkin-is-worlds-biggest_1728741061.html", "title": "Oh my gourd: Hippo-size pumpkin is world's biggest", "title_page": "Oh my gourd: Hippo-size pumpkin is world's biggest | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – A monster pumpkin weighing the same as a hippopotamus has claimed the world record for the mightiest gourd – and bagged its grower a US$30,000 (S$40,900) prize.\nMr Travis Gienger squashed the competition with his enormous fruit weighing in at an improbable 1,247kg at the Half Moon Bay Art and Pumpkin Festival in California, on Monday.\nAn orange-shirted Mr Gienger punched the air and offered hugs all round after the weigh-in, as Queen’s We Are The Champions blasted, according to a video from the event.\nThe contest, in its 50th year, pits growers of mega-gourds from all over North America against each other to see who can produce the biggest berry.\nMr Gienger, a horticulture teacher from Minnesota, pipped his nearest rival by a hefty 114kg to walk away with 2023’s title.\nHe also bagged a new world record in the process, besting an Italian effort from 2021 that tipped the scales at a relatively svelte 1,226kg, organisers said, and claimed the US$30,000 in the process.\nThe grand champion gourd will be on display in Half Moon Bay this weekend when the town hosts its Art and Pumpkin Festival.\nThe United States is currently in the throes of autumn celebrations with pumpkins of all shapes and sizes available at many stores.\nWhile some will be carved into ghoulish designs for Halloween at the end of October, others will be made into pies or consumed as part of dinner.\nPumpkin spice – a blend of cinnamon, cloves, nutmeg and ginger – is almost inescapable at this time of year, flavouring everything from cookies to coffee and even cans of Spam. AFP", "url": "https://www.straitstimes.com/world/united-states/oh-my-gourd-hippo-sized-pumpkin-is-worlds-biggest"}