{"authors": [], "date_download": "2024-10-12 14:01:33", "date_modify": "2024-10-12 14:01:33", "date_publish": "2023-05-27 17:10:00", "description": "Anti-Russian fighters conducted a cross-border attack in the Belgorod region of southern Russia. Read more at straitstimes.com.", "filename": "world_europe_for-ukraine-military-far-right-russian-volunteers-make-for-worrisome-allies_1728741693.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/27/TOPSHOTS-TOPSHOT-UKRAINE-RUSSIA-CONFLICT-WAR-064914_2.jpg?VersionId=ygp5859QN5h1T4941TnyESVa7XWbxg6p", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_for-ukraine-military-far-right-russian-volunteers-make-for-worrisome-allies_1728741693.html", "title": "For Ukraine military, far-right Russian volunteers make for worrisome allies", "title_page": "For Ukraine military, far-right Russian volunteers make for worrisome allies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – A group of fighters aligned with Ukraine, who had participated last week in the most intense fighting inside Russia’s borders since the invasion, gathered the foreign and local press in an undisclosed location on Wednesday. The aim was to celebrate, taunt the Kremlin and show off what they called “military trophies” from their incursion into their native land: Russia.\nTheir leader, Mr Denis Kapustin, was proud that his force of anti-Putin Russians at one point controlled, he said, 42 sq km of Russian territory.\n“I want to prove that it’s possible to fight against a tyrant,” he added. “That Putin’s power is not unlimited, that the security services can beat, control and torture the unarmed. But as soon as they meet a full armed resistance, they flee.”\nIt was the rhetoric of a dissident freedom fighter, but there was a discordant note that emerged as clearly as the neo-Nazi Black Sun patch on the uniform of one of the soldiers: Mr Kapustin and prominent members of the armed group he leads, the Russian Volunteer Corps, openly espouse far-right views.\nIn fact, German officials and humanitarian groups, including the Anti-Defamation League, have identified Mr Kapustin as a neo-Nazi.\nMr Kapustin, who has long used the alias Denis Nikitin but typically goes by his military call sign, White Rex, is a Russian citizen who moved to Germany in the early 2000s. He associated with a group of violent soccer fans and later became “one of the most influential activists” in a neo-Nazi splinter group in the mixed-martial arts scene, officials in the German state of North Rhine-Westphalia have said.\nMr Kapustin has reportedly been banned from entering Europe’s visa-free, 27-country Schengen zone, but he has said only that Germany cancelled his residency permit.\nThe fact that the group has garnered attention for its operation and revived coverage of its ties to neo-Nazis is an awkward development for Ukraine’s government. In particular, President Vladimir Putin of Russia has justified his invasion on the false claim of fighting neo-Nazis and made it a regular theme of Kremlin propaganda.\nMost of the anti-Russian groups harbour long-term political ambitions to return home and overthrow the Russian and Belarusian governments.\n“The Russian Volunteer Corps marches in and destroys the current government – that’s the only way,” Mr Kapustin said earlier this year. “You cannot persuade a tyrant to leave, and any other force would be seen as invaders.”\nIn reality, far-right groups in Ukraine are a small minority, and the country has denied any involvement in the Russian Volunteer Corps or any role in fighting on the Russian side of the border. But Mr Kapustin said his group “definitely got a lot of encouragement” from Ukrainian authorities.\nThe Russian Volunteer Corps, also known by its Russian initials RDK, was one of two groups of anti-Russian fighters who conducted a cross-border attack in the Belgorod region of southern Russia on Monday, engaging enemy troops over two days of skirmishing.\nThe aim of the incursions, the groups say, was to force Moscow to redeploy soldiers from occupied areas of Ukraine to defend its borders, stretching its defences before a planned Ukrainian counter-offensive, a goal that aligns with the broader objectives of Ukraine’s military.\nThe Russian Volunteer Corps also claimed credit for two incidents in the Russian border region of Bryansk in March and April.\nThe second group was the Free Russia Legion, which operates under the umbrella of Ukraine’s International Legion, a force that includes American and British volunteers, as well as Belarusians, Georgians and others and is overseen by Ukraine’s armed forces and commanded by Ukrainian officers.\nAt the news conference on Wednesday, Mr Kapustin affirmed that his group was not controlled by the Ukrainian army but said the military had wished the fighters “good luck”.\n“Everything we do, every decision we make, beyond the state border is our own decision. Obviously we can ask our comrades and friends for their assistance in planning,” he continued.\n“They would say ‘yes, no’ and this is the kind of encouragement, help I was talking about.”\nThat claim could not be independently verified.\nMr Andriy Chernyak, a representative of Ukraine’s military intelligence service, defended Kyiv’s willingness to allow the group to fight on its behalf.\n“Ukraine definitely supports all those who are ready to fight the Putin regime,” he said.\n“People came to Ukraine and said that they want to help us to fight Putin’s regime, so of course we let them, same as many other people from foreign countries.” NYTIMES", "url": "https://www.straitstimes.com/world/europe/for-ukraine-military-far-right-russian-volunteers-make-for-worrisome-allies"}