{"authors": [], "date_download": "2024-10-12 13:36:44", "date_modify": "2024-10-12 13:36:44", "date_publish": "2024-07-01 05:33:03", "description": "Despite no specific threat, Europe remains vigilant after a March attack near Moscow killed 150. Read more at straitstimes.com.", "filename": "world_united-states_us-military-raises-alert-level-for-europe-bases-reports_1728740204.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/01/ST-logo-placeholder_2.jpg?VersionId=uk9e_QReMGaLhxQ7r3eFQFFPBqClLfKc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-military-raises-alert-level-for-europe-bases-reports_1728740204.html", "title": "US military raises alert level for Europe bases: Reports", "title_page": "US military raises alert level for Europe bases: Reports | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – The US military has raised the alert level of several bases in Europe to its second-highest level, multiple American media outlets reported on June 30.\nThe American bases, located across Europe, were raised to the “Charlie” alert level, ABC News and CNN reported, both citing unnamed officials.\nThat level is ordered when “an incident occurs or intelligence is received indicating some form of terrorist action or targeting against personnel or facilities is likely”, the US Army says on its website.\nThe highest level “Delta” is applied when a terrorist attack has occurred or one is “imminent”.\nThe US European Command (USEUCOM) did not confirm the status change when contacted by AFP, but said: “We remain vigilant.”\nThe Pentagon meanwhile said: “Due to a combination of factors potentially impacting the safety and security of US service members and their families stationed in the European theatre, US European Command is redoubling its efforts to stress vigilance during the summer months.”\nThe US State Department currently advises American citizens in Germany, where the USEUCOM is headquartered, to exercise increased caution due to terrorism.\nWhile no specific threat has been mentioned, European nations have been on heightened alert since gunmen in March killed nearly 150 people outside Moscow, an attack claimed by militant group ISIS.\nFrance has also increased its state of alert ahead of the Paris Olympics, while Germany is currently hosting an international football tournament. AFP", "url": "https://www.straitstimes.com/world/united-states/us-military-raises-alert-level-for-europe-bases-reports"}