{"authors": [], "date_download": "2024-10-12 13:59:01", "date_modify": "2024-10-12 13:59:01", "date_publish": "2024-07-05 21:36:10", "description": "Vladimir Kara-Murza is serving a 25-year prison sentence over his criticism of Russia's invasion of Ukraine. Read more at straitstimes.com.", "filename": "world_russian-opposition-figure-kara-murza-in-prison-hospital-wife-says__gl=1_15jetj6__gcl_au_MjEwMDE3NDM4Ny4xNzIwNzk1NTk1_1728741541.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/06/FILES-RUSSIA-POLITICS-OPPOSITION-KARA-MURZA-133639.jpg?VersionId=GmiPLIOm6r2HwrmG6iB3VzdGnU5aE8aM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_russian-opposition-figure-kara-murza-in-prison-hospital-wife-says__gl=1_15jetj6__gcl_au_MjEwMDE3NDM4Ny4xNzIwNzk1NTk1_1728741541.html", "title": "Jailed Kremlin critic Vladimir Kara-Murza transferred to prison hospital", "title_page": "Jailed Kremlin critic Vladimir Kara-Murza transferred to prison hospital | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Kremlin critic Vladimir Kara-Murza has been transferred to a prison hospital and his lawyers have been denied access to him for two days, his wife said on July 5, raising fears for the dissident’s fate.\nKara-Murza, 42, is serving a 25-year prison sentence on treason and other charges, one of the harshest punishments Moscow has meted out to opponents of Russian President Vladimir Putin.\nTwice poisoned in what he alleges were assassination attempts by the Russian security services, concern has grown for Kara-Murza’s health since the death of opposition leader Alexei Navalny in an Arctic prison colony in February.\n“Vladimir Kara-Murza was transferred to a prison hospital. His lawyers weren’t allowed access to him,” Mrs Evgenia Kara-Murza said, in a social media post, adding that she had no information on his condition.\nShe said her husband had been transferred from the IK-6 high-security prison colony in the Siberian region of Omsk where he is serving his sentence to a regional prison hospital.\n“His lawyers, who had travelled to IK-6 from Moscow and had been waiting from 8:30 in the morning on Thursday, were informed about this in the afternoon after more than five hours of waiting,” she said.\nAfter travelling to the hospital, they were first told Kara-Murza was not there, and then after visiting hours closed the facility confirmed to them he had been admitted.\nStaff there continued to deny access to his lawyers on July 5, saying he had not been fully processed and was then being seen by doctors, Mrs Kara-Murza said.\n“Thus, the lawyers were not able to see Vladimir and make sure that he was alright,” she said.\nThey may not be able to try again until after the weekend, she added.\n‘Threat to life’\nKara-Murza vocally campaigned against President Putin for years, and stayed inside the country to criticise Russia’s invasion of Ukraine, even as Moscow passed a raft of anti-dissent and military censorship laws.\nHundreds have been prosecuted under the measures and most Russian opposition figures not in jail have fled into exile.\nThe Kremlin critic - who is a dual Russian-UK citizen - suffers from a nerve condition after he fell severely ill in 2015 and 2017 in what he says were poisonings orchestrated by Russia’s FSB security service.\nAn investigation led by Bellingcat journalists in 2021 also suggested that FSB agents were involved in both cases.\nHe was arrested in April 2022 and sentenced a year later after blasting Russia’s invasion of Ukraine and pressing Western countries to impose sanctions against the Kremlin.", "url": "https://www.straitstimes.com/world/russian-opposition-figure-kara-murza-in-prison-hospital-wife-says?_gl=1*15jetj6*_gcl_au*MjEwMDE3NDM4Ny4xNzIwNzk1NTk1"}