{"authors": [], "date_download": "2024-10-12 13:35:02", "date_modify": "2024-10-12 13:35:02", "date_publish": "2024-09-20 08:05:00", "description": "It had put into motion a plan to set up a shell company that would pose as an international pager producer. Read more at straitstimes.com.", "filename": "world_middle-east_how-israel-built-a-modern-day-trojan-horse-exploding-pagers_1728740102.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/TOPSHOTS-TOPSHOT-LEBANON-ISRAEL-PALESTINIAN-CONFLICT-125938_0.jpg?VersionId=YACmxkh9xCzpJSENYsUJXQLxDiXdXnah", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_how-israel-built-a-modern-day-trojan-horse-exploding-pagers_1728740102.html", "title": "How Israel built a modern-day Trojan horse - exploding pagers", "title_page": "How Israel built a modern-day Trojan horse – exploding pagers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - The pagers began beeping just after 3.30pm on the afternoon of Sept 17 in Lebanon, alerting Hezbollah operatives to a message from their leaders in a chorus of chimes, melodies and buzzes.\nBut it was not the militants’ leaders. The pages had been sent by Hezbollah’s arch enemy and within seconds, the alerts were followed by the sounds of explosions and cries of pain and panic in streets, shops and homes across Lebanon.\nPowered by just a few ounces of an explosive compound concealed within the devices, the blasts sent grown men flying off motorcycles and slamming into walls, according to witnesses and video footage.\nPeople out shopping fell to the ground, writhing in agony, smoke snaking from their pockets.\nMr Mohammed Awada, 52, and his son were driving by one man whose pager exploded, he said. “My son went crazy and started to scream when he saw the man’s hand flying away from him.”\nBy the end of the day, at least a dozen people were dead and more than 2,700 were wounded, many of them maimed.\nAnd the following day, 20 more people were killed and hundreds wounded when walkie-talkies in Lebanon also began mysteriously exploding.\nSome of the dead and wounded were Hezbollah members, but others were not – four of the dead were children.\nIsrael has neither confirmed nor denied any role in the explosions, but 12 current and former defence and intelligence officials who were briefed on the attack say the Israelis were behind it, describing the operation as complex and long in the making.\nThey spoke to The New York Times on the condition of anonymity, given the sensitivity of the subject.\nThe booby-trapped pagers and walkie-talkies were the latest salvo in the decades-long conflict between Israel and Hezbollah, which is based across the border in Lebanon.\nThe tensions escalated after the war began in the Gaza Strip.\nIranian-backed groups including Hezbollah have long been vulnerable to Israeli attacks using sophisticated technologies.\nIn 2020, for example, Israel assassinated Iran’s top nuclear scientist using an artificial-intelligence-assisted robot controlled remotely via satellite. Israel has also used hacking to stymie Iranian nuclear development.\nIn Lebanon, as Israel picked off senior Hezbollah commandos with targeted assassinations, their leader came to a conclusion: If Israel was going high-tech, Hezbollah would go low.\nIt was clear, a distressed Hezbollah chief Hassan Nasrallah said, that Israel was using cellphone networks to pinpoint the locations of his operatives.\n“You ask me where is the agent,” he told his followers in a publicly televised address in February. “I tell you that the phone in your hands, in your wife’s hands and in your children’s hands is the agent.”\nThen he issued a plea. “Bury it,” he said. “Put it in an iron box and lock it.”\nHe had been pushing for years for Hezbollah to invest instead in pagers, which for all their limited capabilities could receive data without giving away a user’s location or other compromising information, according to US intelligence assessments.\nIsraeli intelligence officials saw an opportunity.\nEven before the Hezbollah leader decided to expand pager usage, Israel had put into motion a plan to establish a shell company that would pose as an international pager producer.\nBy all appearances, BAC Consulting was a Hungary-based company that was under contract to produce the devices on behalf of a Taiwanese company, Gold Apollo.\nIn fact, it was part of an Israeli front, according to three intelligence officers briefed on the operation.\nThey said at least two other shell companies were created as well to mask the real identities of the people creating the pagers: Israeli intelligence officers.\nBAC did take on ordinary clients, for which it produced a range of ordinary pagers.\nBut the only client that really mattered was Hezbollah, and its pagers were far from ordinary.\nProduced separately, they contained batteries laced with the explosive pentaerythritol tetranitrate, or PETN, according to the three intelligence officers.\nThe pagers began shipping to Lebanon in the summer of 2022 in small numbers, but production was quickly ramped up after the Hezbollah chief denounced cellphones.\nSome of his fears were spurred by reports from allies that Israel had acquired new means to hack into phones, activating microphones and cameras remotely to spy on their owners.\nAccording to three intelligence officials, Israel had invested millions in developing the technology and word spread among Hezbollah and its allies that no cellphone communication – even encrypted messaging apps – was safe anymore.\nNot only did Nasrallah ban cellphones from meetings of Hezbollah operatives, he ordered that details of Hezbollah movements and plans never be communicated over cellphones, said three intelligence officials.\nHezbollah officers, he ordered, had to carry pagers at all times, and in the event of war, pagers would be used to tell fighters where to go.\nOver the summer, shipments of the pagers to Lebanon increased, with thousands arriving in the country and being distributed among Hezbollah officers and their allies, according to two American intelligence officials.\nTo Hezbollah, they were a defensive measure, but in Israel, intelligence officers referred to the pagers as “buttons” that could be pushed when the time seemed ripe.\nThat moment, it appears, came this week.\nSpeaking to his security Cabinet on Sept 15, Israeli Prime Minister Benjamin Netanyahu said he would do whatever was necessary to enable more than 70,000 Israelis driven away by the fighting with Hezbollah to return home, according to reports in Israeli news outlets.\nThose residents, he said, could not return without “a fundamental change in the security situation in the north”, according to a statement from his office.\nOn Sept 17, the order was given to activate the pagers.\nTo set off the explosions, according to three intelligence and defence officials, Israel triggered the pagers to beep and sent a message to them in Arabic that appeared as if it had come from Hezbollah’s senior leadership.\nSeconds later, Lebanon was in chaos.\nWith so many people wounded, ambulances crawled through the streets and hospitals were soon overwhelmed. Hezbollah said at least eight of its fighters were killed, but non-combatants were also drawn into the fray.\nIn Lebanon’s Bekaa Valley, in the village of Saraain, nine-year-old Fatima Abdullah had just come home from her first day of fourth grade when she heard her father’s pager begin to beep, her aunt said.\nShe picked up the device to take it to him and was holding it when it exploded, killing her.\nOn Sept 18, as thousands gathered in Beirut’s southern suburbs to attend an outdoor funeral for four people killed in the blasts, chaos erupted anew. There was another explosion.\nAmid the acrid smoke, panicked mourners stampeded onto the streets, seeking shelter in the lobbies of nearby buildings.\nMany were afraid that their phone, or the phone of a person standing next to them in the crowd, was about to explode.\n“Turn off your phone!” some shouted. “Take out the battery!” Soon, a voice on a loudspeaker at the funeral urged everyone to do this.\nFor the Lebanese, the second wave of explosions was confirmation of the lesson from the day before: They now live in a world in which the most common of communication devices can be transformed into instruments of death.\nOne woman, Madam Um Ibrahim, stopped a reporter in the middle of the confusion and begged to use a cellphone to call her children. Her hands shaking, she dialled a number and then screamed a directive: “Turn off your phones now!” NYTIMES", "url": "https://www.straitstimes.com/world/middle-east/how-israel-built-a-modern-day-trojan-horse-exploding-pagers"}