{"authors": [], "date_download": "2024-10-12 14:07:40", "date_modify": "2024-10-12 14:07:40", "date_publish": "2022-07-30 01:43:02", "description": "US Secretary of State Antony Blinken initiated the call with Russia's Foreign Minister Sergei Lavrov. Read more at straitstimes.com.", "filename": "world_united-states_us-blinken-holds-frank-discussion-with-russian-fm-on-prisoners-ukraine_1728742060.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/30/blinkenlavrov30.jpg?VersionId=g_ZyjqubY078p6_1FrPpOkYhMdFJpfJ5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-blinken-holds-frank-discussion-with-russian-fm-on-prisoners-ukraine_1728742060.html", "title": "US, Russia top diplomats hold ‘frank’ first talks since war", "title_page": "US, Russia top diplomats hold ‘frank’ first talks since war | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (AFP) - The top diplomats of the United States and Russia spoke Friday (July 29) for the first time since the Ukraine war, with Secretary of State Antony Blinken describing a “frank” exchange as he pushed to free two Americans.\nBlinken initiated the call with Foreign Minister Sergei Lavrov, whom he had shunned as early as a few weeks ago, as he pressed Russia to accept an offer to free prisoners.\n“We had a frank and direct conversation. I pressed the Kremlin to accept the substantial proposal that we put forth on the release of Paul Whelan and Brittney Griner,” Blinken told reporters.\nPresident Joe Biden has faced growing public pressure to find a way home for Griner, a basketball star jailed for transport of cannabis oil, and Whelan, a former Marine jailed on espionage charges he denies.\nBlinken declined to characterise Lavrov’s reaction, saying, “I can’t give you an assessment of whether I think things are any more or less likely.” “But it was important that he heard directly from me on that,” Blinken said.\nRussia’s foreign ministry, in a statement on the call, said that relations between the two nations “are in strong need of normalization.”\n“As for a potential swap of Russian and American prisoners, the Russian side insisted that we return to a regime of professional dialogue, free of media speculation, in the framework of discreet diplomacy,” it said.\nLavrov also denounced the US military and Nato for their supply of billions of dollars of weapons to Ukraine, saying it “only prolonged the agony of the Kyiv regime, extending the conflict and its victims.” the foreign ministry said.\nWarnings on annexation\nThe US proposal, sent quietly to Russia several weeks earlier, reportedly includes swapping the two Americans for convicted Russian arms smuggler Viktor Bout and would follow a similar prisoner exchange in April.\nBlinken said he also pressed Lavrov on Russia honouring a Turkish-brokered proposal to ship grain out of Ukraine and on purported plans by Moscow to annex additional parts of Ukraine seized by Russian troops.\nBlinken said he told Lavrov that the world will not recognize annexation.\n“It was very important that the Russians hear directly from us that that will not be accepted – and not only will it not be accepted, it will result in additional significant costs being imposed upon Russia if it follows through,” Blinken said.\nBlinken said Russia was preparing “sham referendums” to try to “falsely demonstrate that the people in these parts of Ukraine somehow seek to become part of Russia.” The votes would be part of Russian President Vladimir Putin’s objective of “gobbling up as much Ukrainian territory as he can,” he added.\nThe telephone conversation was the first between Blinken and Lavrov since Feb 15, when the top US diplomat warned Russia against invading Ukraine, repeating a message he delivered in person in Geneva a month earlier.\nPutin went ahead and attacked nine days later, leading the United States and its allies to impose sweeping sanctions and to seek to isolate Russia on the world stage.\nBlinken refused to meet Lavrov when they both attended talks in early July in Bali of the Group of 20 major economies. They are likely to cross paths again next week at talks of the Association of Southeast Asian Nations in Cambodia.", "url": "https://www.straitstimes.com/world/united-states/us-blinken-holds-frank-discussion-with-russian-fm-on-prisoners-ukraine"}