{"authors": [], "date_download": "2024-10-12 13:34:43", "date_modify": "2024-10-12 13:34:43", "date_publish": "2024-09-25 02:03:31", "description": "Before the execution, the victim’s family had opposed the killing of Williams. Read more at straitstimes.com.", "filename": "world_missouri-man-faces-execution-on-tuesday-despite-prosecutors-opposition_1728740083.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/25/LYNXMPEK8N0PO-3.jpg?VersionId=NYlhjV3WKrT0e9AA00OAa4hk5c3ZEfMK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_missouri-man-faces-execution-on-tuesday-despite-prosecutors-opposition_1728740083.html", "title": "Missouri man executed despite prosecutor’s opposition", "title_page": "Missouri man executed despite prosecutor’s opposition | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MISSOURI - A Missouri man was executed on Sept 24, according to the state’s Department of Corrections, even though the prosecutor’s office that secured his murder conviction 21 years ago expressed doubts about the integrity of the case.\nThe victim’s family also said he should be spared.\nThe US Supreme Court, the last body that could have halted the execution, declined to intervene in the case hours before Marcellus Williams, 55, was put to death by lethal injection shortly after 6pm (7am on Sept 25 Singapore time), in a prison in Bonne Terre on Sept 24.\nHis death came a day after both Missouri governor Mike Parson and the state’s highest court also rejected his last-ditch bids to avoid execution.\nWilliams was found guilty in 2003 of killing Ms Felicia “Lisha” Gayle, a former newspaper reporter who was stabbed to death in her home, though he has maintained his innocence.\nSt Louis County prosecuting attorney Wesley Bell, whose office handled the original prosecution, had sought to block the execution due to questions about the original trial.\nMr Bell said in a written statement after the execution that “if there is even the shadow of a doubt of innocence, the death penalty should never be an option.”\nMs Tricia Rojo Bushnell, a lawyer with the Innocence Project who helped represent Williams, wrote in a statement that “the execution of an innocent person is the most extreme manifestation of Missouri’s obsession with ‘finality’ over truth, justice, and humanity, at any cost”.\nIn court papers, Mr Bell questioned the reliability of the two main trial witnesses, concluded that prosecutors improperly excluded black jurors on the basis of race and noted that new testing found no trace of Williams’ DNA on the murder weapon. Williams was African American.\nSubsequent tests revealed DNA on the knife from a prosecutor and an investigator who had worked on the case and handled the weapon without gloves.\nThe contamination of the knife led prosecutors and Williams’ attorneys to reach an agreement in August calling for him to enter a no-contest plea and receive a sentence of life in prison.\nThe state Supreme Court blocked the deal at the request of Missouri Attorney-General Andrew Bailey. A state judge upheld the conviction earlier in September, finding that the lack of evidence on the knife was not enough to establish his innocence.\nThe Missouri Supreme Court affirmed that decision on Sept 23.\nGovernor Parson, a Republican, also turned down Williams’ request for clemency on Sept 23.\n“We hope this gives finality to a case that has languished for decades, revictimising Ms. Gayle’s family over and over again,” Governor Parson said in a statement after the execution. “No juror nor judge has ever found Williams’ innocence claim to be credible.”\nIn Williams’ petition for clemency made to the Supreme Court, his lawyers noted that Ms Gayle’s own family thought that he should not be executed, given doubts about his guilt, and that they had approved of his life-in-prison plea deal made in August.\nMr Laurence Komp and Ms Laine Cardarella, with the Federal Public Defender Office in the Western District of Missouri, who also represented Williams, said in a written statement that they were baffled as to why the “admitted racial discrimination” in Williams’ trial was left unaddressed.\nWilliams’ public defenders said he adopted the name Khaliifah ibn Rayford Daniels after converting to Islam.\nThe corrections department released his handwritten final statement, in which he said: “All praise be to Allah in every situation!!!” REUTERS", "url": "https://www.straitstimes.com/world/missouri-man-faces-execution-on-tuesday-despite-prosecutors-opposition"}