{"authors": [], "date_download": "2024-10-12 13:37:59", "date_modify": "2024-10-12 13:37:59", "date_publish": "2024-08-14 19:03:40", "description": "The man also lost his wife and her mother, in the Gaza apartment where they were sheltering. Read more at straitstimes.com.", "filename": "world_middle-east_palestinian-newborn-twins-killed-as-father-obtained-birth-certificates_1728740279.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/14/11548339.jpg?VersionId=oJYbw6PJO3l4Sh5fE.xO6JFnqMC.PVzg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_palestinian-newborn-twins-killed-as-father-obtained-birth-certificates_1728740279.html", "title": "Palestinian newborn twins killed as father obtained birth certificates", "title_page": "Palestinian newborn twins killed as father obtained birth certificates | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DEIR AL-BALAH, Gaza - Mohammed Abu Al-Qumsan had just picked up birth certificates for his newly-born twins when he found out they had been killed, along with his wife and her mother, by an Israeli strike on the Gaza apartment where they were sheltering.\nHe waved the laminated documents, supposed to signify rare joy in the besieged Palestinian enclave, as a man held him while he wept at the morgue where their bodies were brought.\n“My wife is gone, my two babies and my mother-in-law. I was told it’s a tank shell on the apartment they were in, in a house we were displaced to,” said Mr Al-Qumsan, 31, recalling the devastating phone call from people in the neighbourhood.\nHe and others carried his boy and girl, Asser and Ayssel, who were wrapped in white shrouds – a common sight in Gaza, where Israel’s land and air campaign has put hundreds of thousands of people regularly on the move in search of shelter.\nA man prayed as the bodies were placed in the back of a car. A crowd gathered and people looked on from the balcony of one of Gaza’s overwhelmed emergency rooms, at the Al-Aqsa Martyrs Hospital in Deir al-Balah in the centre of the coastal strip.\nTen months after the Gaza war erupted, air strikes, artillery shells and severe shortages of medicine, food and clean water have brought one of the world’s most densely populated places to its knees.\n“Today, it was registered in history that the occupation army targets newborn children who are barely four days old, twins along with their mother and grandmother,” hospital doctor Khalil al-Daqran said.\nIsrael says it goes to great lengths to avoid civilian casualties and accuses arch-foe Hamas of using human shields, charges the militants deny.\nA Hamas-led attack on Israeli communities around Gaza on Oct 7 killed some 1,200 people, with more than 250 taken into captivity in Gaza, in one of the most devastating blows against Israel in its history.\nIsrael struck back with an offensive that has killed nearly 40,000 people and wounded more than 92,000, according to the Gaza health authorities, and reduced much of the enclave to rubble. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/palestinian-newborn-twins-killed-as-father-obtained-birth-certificates"}