{"authors": [], "date_download": "2024-10-12 13:36:20", "date_modify": "2024-10-12 13:36:20", "date_publish": "2024-06-26 17:02:48", "description": "WASHINGTON - President Joe Biden issued a proclamation on Wednesday that would set in motion a process to pardon U.S. veterans convicted by the military for gay sex, which was illegal until the provision was repealed in late 2013. Read more at straitstimes.com.", "filename": "world_biden-announces-process-to-pardon-us-veterans-convicted-by-military-for-gay-sex_1728740180.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/27/LYNXMPEK5P09T-2.jpg?VersionId=mGXqH7_NGsrcwWAemeickPI7AIRMXgfu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_biden-announces-process-to-pardon-us-veterans-convicted-by-military-for-gay-sex_1728740180.html", "title": "Biden announces process to pardon US veterans convicted by military for gay sex", "title_page": "Biden announces process to pardon US veterans convicted by military for gay sex | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - President Joe Biden issued a proclamation on Wednesday that would set in motion a process to pardon U.S. veterans convicted by the military for gay sex, which was illegal until the provision was repealed in late 2013.\nThe Biden administration estimates that the proclamation could affect thousands of individuals convicted of consensual sexual conduct and who may be eligible for a pardon, senior administration officials said.\n\"Our Nation's service members stand on the frontlines of freedom, and risk their lives in order to defend our country,\" Biden said in a statement. \"Despite their courage and great sacrifice, thousands of LGBTQI+ service members were forced out of the military because of their sexual orientation or gender identity.\"\nThe affected individuals can apply for proof that they may be eligible, and if they receive a certificate of pardon, they can then apply to have their discharge characterization changed, the officials said.\nThe administration is considering ways to reach out to individuals who might be eligible for the pardon, the officials said.\nIn late 2013, the U.S. Senate passed a measure that included a repeal of a military ban on consensual sex, defined in Article 125 of the Uniform Code of Military Justice as \"unnatural carnal copulation,\" according to the ACLU. The Senate sent the measure to former President Barack Obama to sign.\nBiden served under Obama as vice president. REUTERS", "url": "https://www.straitstimes.com/world/biden-announces-process-to-pardon-us-veterans-convicted-by-military-for-gay-sex"}