{"authors": [], "date_download": "2024-10-12 13:39:04", "date_modify": "2024-10-12 13:39:04", "date_publish": "2024-09-24 01:53:08", "description": "Deforestation has led to the loss of 12.5 per cent of the Amazon’s plant cover from 1985 to 2023. Read more at straitstimes.com.", "filename": "world_amazon-forest-has-lost-an-area-the-size-of-germany-and-france_1728740344.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/btamazon20240924.jpg?VersionId=RTsLiKyGaLjNR8BFAoJ186HCbqbt.lgY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_amazon-forest-has-lost-an-area-the-size-of-germany-and-france_1728740344.html", "title": "Amazon forest has lost an area the size of Germany and France", "title_page": "Amazon forest has lost an area the size of Germany and France | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "RIO DE JANEIRO – The world’s biggest rainforest, the Amazon, has lost an area about the size of Germany and France combined to deforestation in four decades, a study showed on Sept 23.\nThe South American jungle, spanning nine countries, is seen as crucial to the fight against climate change due to its ability to absorb planet-warming carbon dioxide from the atmosphere.\nDeforestation, mainly for mining and agricultural purposes, has led to the loss of 12.5 per cent of the Amazon’s plant cover from 1985 to 2023, according to RAISG, a collective of researchers and non-governmental organisations.\nThis amounts to 88 million ha of forest cover lost across Brazil, Bolivia, Peru, Ecuador, Colombia, Venezuela, Guyana, Suriname and French Guiana.\nRAISG experts reported an “accelerated transformation” of the Amazon, with an “alarming increase” in the use of land previously occupied by forest for mining, crops or livestock.\n“A large number of ecosystems have disappeared to give way to immense expanses of pastures, soybean fields or other monocultures, or have been transformed into craters for gold mining,” experts said.\nMs Sandra Rio Caceres, from the Institute of the Common Good – a Peruvian association that took part in the study – said: “With the loss of the forest, we emit more carbon into the atmosphere and this disrupts an entire ecosystem that regulates the climate and the hydrological cycle, clearly affecting temperatures.”\nShe said she believes the loss of vegetation in the Amazon is directly linked to severe drought and wildfires affecting several South American countries.\nThe World Weather Attribution network of scientists said on Sept 22 that climate change was increasing the risk and severity of fires in the Amazon and Pantanal wetlands, which are releasing “massive amounts” of CO2 into the atmosphere.\nMs Clair Barnes, a researcher from Imperial College London, said: “Never-ending heat has combined with low rainfall to turn these precious ecosystems into highly flammable tinderboxes.\n“As long as the world burns fossil fuels, the risk of devastating wildfires will continue to increase in the Amazon and Pantanal.”\nThe drought has placed some Amazon rivers at their lowest level in decades, threatening the lifestyle of some 47 million people who live on their banks.\nThe dry spell has sent fires – often lit to clear land for farming – burning out of control in Brazil, Ecuador, Colombia and Peru. AFP", "url": "https://www.straitstimes.com/world/amazon-forest-has-lost-an-area-the-size-of-germany-and-france"}