{"authors": [], "date_download": "2024-10-12 13:37:23", "date_modify": "2024-10-12 13:37:23", "date_publish": "2024-08-31 16:29:13", "description": "Clashes in disputed waters continue despite both sides promising to de-escalate the situation. Read more at straitstimes.com.", "filename": "world_china-philippines-accuse-each-other-of-ramming-ships-in-south-china-sea_1728740243.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/31/PHILIPPINES-CHINA-MARITIME-DIPLOMACY-121256.jpg?VersionId=mXuhdJDIQ1eOelWkU7F9gcvu67sXPVud", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_china-philippines-accuse-each-other-of-ramming-ships-in-south-china-sea_1728740243.html", "title": "China, Philippines again accuse each other of ramming ships near disputed shoal", "title_page": "China, Philippines again accuse each other of ramming ships near disputed shoal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China and the Philippines again traded accusations of ramming each other’s ships in a disputed area of the South China Sea on Aug 31, the latest in an escalating series of clashes in the vital waterway.\nThe China Coast Guard said a Philippine ship, “illegally stranded” at the Sabina Shoal, lifted anchor and “deliberately rammed” a Chinese vessel, while the Philippine Coast Guard said a Chinese vessel “intentionally rammed” one of its ships.\nBeijing claims almost the entire South China Sea, including parts claimed by the Philippines, Brunei, Malaysia, Taiwan and Vietnam. Portions of the waterway, where US$3 trillion (S$3.9 trillion) worth of trade passes annually, are believed to be rich in oil and natural gas deposits, as well as fish stocks.\nThe Permanent Court of Arbitration in 2016 found China’s sweeping claims had no legal basis, a ruling Beijing rejects.\nMr Liu Dejun, a spokesman for China’s coast guard, called on the Philippines in a statement to withdraw immediately from the shoal.\n“The Chinese coast guard will take the measures required to resolutely thwart all acts of provocation, nuisance and infringement and resolutely safeguard the country’s territorial sovereignty and maritime rights and interests,” Mr Liu said.\nThe Philippine Coast Guard’s spokesman, Commodore Jay Tarriela, told reporters the China Coast Guard ignored collision regulations and carried out dangerous manoeuvres, resulting in damage but that no injuries were reported.\nSabina Shoal is located 140km west of the Philippine island of Palawan and about 1,200km from Hainan island, the nearest major Chinese landmass.\nPhilippine and Chinese vessels have collided at least twice in August near Sabina, which analysts say Beijing is seeking to further encroach upon, moving deeper into Manila’s exclusive economic zone and normalising Chinese control of the area.\nThe discovery of piles of crushed coral at the shoal ignited suspicion in Manila that Beijing was planning to build another permanent base there, which would be its closest outpost to the Philippine archipelago.\nRecent clashes between Philippine and Chinese vessels have also taken place around Second Thomas Shoal.\nA Filipino sailor lost a thumb in a clash there in June when Chinese coast guard members wielding knives, sticks and an axe foiled a Philippine Navy attempt to resupply a small garrison.\nSabina Shoal is also the rendezvous point for Philippine resupply missions to the garrison on Second Thomas Shoal.\nThe repeated confrontations prompted Manila to brand Beijing the “biggest disruptor” to peace in South-east Asia at a defence conference in August. REUTERS, AFP", "url": "https://www.straitstimes.com/world/china-philippines-accuse-each-other-of-ramming-ships-in-south-china-sea"}