{"authors": [], "date_download": "2024-10-12 14:07:05", "date_modify": "2024-10-12 14:07:05", "date_publish": "2022-09-12 18:15:00", "description": "Thousands of civilians have been killed in the fighting, which has taken a new turn over the past week. Read more at straitstimes.com.", "filename": "world_europe_key-events-in-the-war-in-ukraine-from-invasion-to-lightning-counter-attack_1728742025.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/12/nf-russia-120922.jpg?VersionId=g5mgxPU0XBQrebBPkuMJZJvlLwjGmS9r", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_key-events-in-the-war-in-ukraine-from-invasion-to-lightning-counter-attack_1728742025.html", "title": "Key events in the war in Ukraine: From invasion to lightning counter-attack", "title_page": "Key events in the war in Ukraine: From invasion to lightning counter-attack | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Russia invaded neighbouring Ukraine on Feb 24, sparking the worst conflict in Europe in decades.\nThousands of civilians have been killed in the fighting, which has taken a new turn over the past week, as Ukrainian forces drive Russian forces from key eastern towns in a swift counter-offensive.\nFebruary: Invasion\nRussian President Vladimir Putin announces a \"special military operation\" on Feb 24.\nHe says this is to protect the Russian-speaking, self-declared separatist republics of Luhansk and Donetsk in the east of Ukraine, whose independence he has just recognised.\nHe says he wants to \"de-Nazify\" Ukraine, a former Soviet republic and demands a guarantee it will never join Nato.\nA full-scale invasion starts, with air and missile strikes on several cities.\nUkrainian President Volodymyr Zelensky pledges to stay in the capital, Kyiv, to lead the resistance.\nThe West imposes unprecedented sanctions on Russia. The European Union and United States send weapons to Ukraine. The aid pledged by Washington rises into the billions.\nMarch: Advances in south but Kyiv holds\nRussian troops attack Ukraine's south coast, seizing most of Kherson, a strategic region crucial for agriculture and close to the Russian-annexed Crimean Peninsula.\nMoscow's forces seek to surround Kyiv and take Ukraine's second city Kharkiv in the northeast. They meet fierce resistance.\nA month into the fighting, Russia withdraws from the Kyiv area and the north to focus on the eastern industrial Donbas region (Luhansk and Donetsk), partly held by separatists, along with the south.\nApril: War crimes revealed\nBodies pile up in cellars where residents hide out for weeks.\nOn May 21, Russia announces it is in full control of the city, after the Ukrainian troops that held out for weeks at Azovstal surrender.\nSweden and Finland apply to become members of Nato, fearing they could be future targets of Russian aggression.\nJune: Donbas battle rages\nIn June, all eyes are on Donbas, where Russia harnesses its superior firepower to take the city of Severodonetsk after one of the bloodiest battles of the war.\nTen days later, the first official shipment of grain since the invasion leaves Odessa with 26,000 tonnes of maize on board.\nThe breakthrough on grain, brokered by the United Nations and Turkey, is overshadowed by the escalating gas dispute between Russia and Europe.\nRussian energy giant Gazprom slashes its supply to Europe through the Nord Stream pipeline before turning off the tap altogether, prompting a spike in gas prices and fears of shortages this winter.\nAugust: Nuclear fears\nIn August, concerns mount over the Russian-occupied Zaporizhzhia nuclear power plant in southern Ukraine. Constant shelling of the area raises the spectre of a nuclear disaster.\nSeptember: Lightning counter-offensive\nOn Sunday, Ukraine claims it has retaken more than 3,000 sq km of terrain in a second, lightning counter-offensive around Kharkiv in the northeast which appeared to catch Russia off guard.\nKyiv says the area includes the key city of Izyum and accuses retreating Russian forces of targeting the electricity grid, causing massive power cuts in the east.\nOn Monday, the military says it has recaptured 20 more settlements in 24 hours.\nThe reaction in Moscow is muted but a map released by the defence ministry confirms a major withdrawal from the Kharkiv region. AFP", "url": "https://www.straitstimes.com/world/europe/key-events-in-the-war-in-ukraine-from-invasion-to-lightning-counter-attack"}