{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:53:58", "date_modify": "2024-10-12 13:53:58", "date_publish": "2024-03-05 13:00:00", "description": "The public praised the volunteers, even though the rescue mission turned out to be a wild goose chase. Read more at straitstimes.com.", "filename": "world_europe_rescuers-in-england-race-to-save-dog-stuck-in-ditch-turns-out-it-s-a-statue_1728741238.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/05/aidog050324.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_rescuers-in-england-race-to-save-dog-stuck-in-ditch-turns-out-it-s-a-statue_1728741238.html", "title": "Rescuers in England race to save dog stuck in ditch, turns out it’s a statue", "title_page": "Rescuers in England race to save dog stuck in ditch, turns out it’s a statue | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Animal rescue volunteers in England rushed to the aid of a dog after receiving reports that it was stuck in a ditch, only to find that it was a statue.\nBut the staff members from Cleethorpes Wildlife Rescue did not criticise the incident as a waste of their time. Instead, they thanked those who reported the sighting of the ‘canine’.\nThey went to Thorpe Park in Lincolnshire on March 3 after the organisation received “multiple consecutive reports” of a dog stuck in a ditch.\nAs the volunteers headed to the site, located near Cleethorpes beach, another team simultaneously discussed its rescue plan with a local group specialising in lost pets.\n“On arrival, we were thankful to hear... It was a statue! A statue that had already been rescued by an on-site member of staff,” Cleethorpes Wildlife Rescue said on its Facebook page.\nIt posted a picture of the life-like 60cm stone statue of a spaniel in the ditch, and another picture of the statue after its retrieval.\n“Thank you to those who reported with good intent, and thank you to our water rescue volunteers for their immediate response – on scene and ready to go in less than 20 minutes!” the organisation added.\nThe public was full of praise for the group, which provides rehabilitation for injured wildlife.\n“Thank goodness, it looked so real in the original photo, well done to the person who reported it, they must’ve been mortified,” said Ms Sally Johnson, commenting on the post.\nMs Janey Bugg noted that it was “amazing” that so many people “scrambled” to check out the report and “in such a short space of time too”.\nAnother commenter, with the handle PickWalks_GY, quipped: “Actually quite a cute statue. Is he for sale?”", "url": "https://www.straitstimes.com/world/europe/rescuers-in-england-race-to-save-dog-stuck-in-ditch-turns-out-it-s-a-statue"}