{"authors": [], "date_download": "2024-10-12 14:02:08", "date_modify": "2024-10-12 14:02:08", "date_publish": "2022-06-15 05:32:18", "description": "Secretary-General Jens Stoltenberg was speaking after informal talks with leaders in the Netherlands. Read more at straitstimes.com.", "filename": "world_europe_nato-needs-greater-readiness-more-weapons-says-military-alliance-chief_1728741728.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/15/10013511.jpg?VersionId=BAeb71KQ6dEUW04.r29ICsCTIGW2_GfD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_nato-needs-greater-readiness-more-weapons-says-military-alliance-chief_1728741728.html", "title": "Nato needs greater readiness, more weapons, says military alliance chief", "title_page": "Nato needs greater readiness, more weapons, says military alliance chief | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "THE HAGUE (REUTERS) - Nato must build out \"even higher readiness\" and strengthen its weapons capabilities along its eastern border in the wake of Russia's invasion of Ukraine, the military alliance's chief said on Tuesday (June 14).\nSecretary-General Jens Stoltenberg was speaking after informal talks in the Netherlands with Dutch Prime Minister Mark Rutte and the leaders of Denmark, Poland, Latvia, Romania, Portugal and Belgium ahead of a wider Nato summit in Madrid at the end of the month.\n\"In Madrid, we will agree a major strengthening of our posture,\" he said.\n\"Tonight, we discussed the need for more robust and combat-ready forward presence and an even higher readiness and more pre-positioned equipment and supplies.\"\nResponding to a call by Ukrainian President Volodymyr Zelensky earlier on Tuesday for more long-range weapons, Stoltenberg said he agreed that Kyiv should be supplied with more heavy weaponry, but provided no details.\n\"Ukraine should have more heavy weapons and Nato allies and partners have provided heavy weapons... and they are also stepping up,\" Stoltenberg said.\n\"In terms of weaponry, we stand united here that it is crucial for Russia to lose the war,\" Dutch leader Rutte told reporters in The Hague.\n\"And as we cannot have a direct confrontation between Nato troops and Russia, what we need to do is make sure that Ukraine can fight that war, that it has access to all the necessary weaponry.\"\nAsked about Sweden and Finland's applications to join the alliance, Stoltenberg said he was seeking \"a united way forward\" to resolve opposition from Turkey, which has been angered by what it deems as Swedish support of Kurdish militants.\nFollowing Russia's Feb 24 invasion of Ukraine, which Moscow calls \"a special military operation\", Nato has boosted its presence in the Baltics.\nStoltenberg said Nato will deliver a further strengthening of the alliance when all 30 members meet June 29-30 in the Spanish capital.", "url": "https://www.straitstimes.com/world/europe/nato-needs-greater-readiness-more-weapons-says-military-alliance-chief"}