{"authors": [], "date_download": "2024-10-12 13:40:59", "date_modify": "2024-10-12 13:40:59", "date_publish": "2024-09-01 05:32:27", "description": "A selection of news stories that happened overnight, Sept 1, 2024. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-sept-1-5_1728740459.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/01/SWIMMING-OLY-PARIS-2024-PARALYMPICS-191751_0.jpg?VersionId=BOq3.PDfc3TCqnA5c5axFDRownGaY.2z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-sept-1-5_1728740459.html", "title": "While You Were Sleeping: 5 stories you might have missed, Sept 1", "title_page": "While You Were Sleeping: 5 stories you might have missed, Sept 1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Gold No. 2 for Singapore swimmer Yip Pin Xiu\nSingapore swimmer Yip Pin Xiu made it a perfect two out of two on Aug 31 (Sept 1, Singapore time), when she won the S2 50m backstroke final to claim her second gold at the Paris Paralympics.\nShe clocked 1min 05.99sec at the La Defense Arena to finish ahead of rivals Haidee Aceves (1:08.96) of Mexico and Spain’s Teresa Perales (1:10.95).\nThe 32-year-old claimed her first gold in Paris on Aug 29 in the S2 100m back, with Aceves and Italy’s Angela Procida winning the silver and bronze.\nWith this result, Yip has achieved a special three-peat of back-to-back titles in the S2 50m and 100m from Rio 2016, Tokyo 2020 and Paris 2024. She now has seven golds and a silver across five editions of the Paralympic Games.\nREAD MORE HERE\nZelensky presses US for deeper strikes into Russia\nUkrainian President Volodymyr Zelensky increased pressure on the United States to let Kyiv strike deeper into Russian territory after his representatives met senior US officials in Washington on Aug 31.\nWashington has provided Ukraine with more than US$50 billion (S$65 billion) worth of military aid since 2022, but has limited the use of its weapons to Ukrainian soil and defensive crossborder operations.\n“Clearing the Ukrainian sky of Russian guided aerial bombs is a strong step to force Russia to seek an end to the war and a just peace,” Mr Zelensky said, in his nightly video address.\nREAD MORE HERE\nSeven dead, dozens injured after bus overturns in US\nSeven people, including a six-year-old and 16-year-old, were killed when a bus overturned east of Vicksburg, Mississippi, early on Aug 31, Warren County coroner Doug Huskey said.\nThe two young victims were siblings, according to the coroner.\nThe Mississippi Highway Patrol said the incident took place around 12.40am on Interstate 20 near Bovina in Warren County when a 2018 Volvo commercial passenger bus travelling westbound left the roadway and overturned.\nREAD MORE HERE\nKamala Harris says Trump ‘disrespected sacred ground’\nDemocratic presidential candidate Kamala Harris said on Aug 31 that her Republican rival Donald Trump “disrespected sacred ground” at a US military cemetery, after reports that his campaign team pushed a staff member during a politicised visit.\nTrump’s cemetery visit - intended to provide a campaign boost ahead of November’s election - has instead mushroomed into a public dispute between the former president and the military.\n“Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt,” Ms Harris said of the Aug 26 incident at Arlington National Cemetery near Washington, where Trump was accompanying relatives of US service members killed in Afghanistan.\nREAD MORE HERE\n‘Energised’ Erling Haaland hits another hat-trick for City\nErling Haaland fired Manchester City to the top of the Premier League with a second consecutive hat-trick in a 3-1 win at West Ham on Aug 31.\nThe Norwegian put Ipswich to the sword last weekend and followed up with another treble to take his tally to 70 goals in 69 Premier League games since joining City from Borussia Dortmund.\nCity have started the defence of their title in ominous fashion for those looking to depose Pep Guardiola’s men after winning the league for four consecutive seasons.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-sept-1-5"}