{"authors": [], "date_download": "2024-10-12 13:44:34", "date_modify": "2024-10-12 13:44:34", "date_publish": "2023-08-10 14:41:00", "description": "If Mars did support life, they were likely primitive single-celled microorganisms. Read more at straitstimes.com.", "filename": "world_europe_mars-once-had-wet-and-dry-alternating-climates-conducive-for-life-to-form-study-says_1728740674.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/10/hzmars100823.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_mars-once-had-wet-and-dry-alternating-climates-conducive-for-life-to-form-study-says_1728740674.html", "title": "Mars once had wet and dry alternating climates conducive for life to form: Study", "title_page": "Mars once had wet and dry alternating climates conducive for life to form: Study | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Nasa’s Curiosity rover has discovered the first evidence that Mars once had a climate which alternated between wet and dry seasons similar to Earth, a study said on Wednesday, suggesting the red planet may have once had the right conditions to support life.\nThough the surface of Mars is now an arid desert, billions of years ago rivers and vast lakes are thought to have stretched across its surface.\nSince 2012, the Curiosity rover has been exploring the huge Gale crater, which is believed to be home of a former lake and has a massive mountain of sediment nearly six kilometres high in its centre.\n“We quickly realised that we were working in lakes and rivers deposits, but did not know what type of climate they were linked to,” Dr William Rapin, a researcher at France’s CNRS scientific research centre and the study’s lead author, told AFP.\nWhile climbing the slope of the sediment mountain in 2021, Curiosity found salt deposits forming a hexagonal pattern in soil dated to nearly four billion years ago.\nThe rover’s instruments identified the patterns as cracks in dried mud, according to the study published in the journal Nature.\n“When a lake dries up the mud cracks, and when it fills back up, the cracks heal,” Dr Rapin explained.\nRepeat this process enough times, and the cracks arrange themselves in hexagons.\nTherefore, this is “the first tangible proof that Mars had a cyclical climate”, Dr Rapin said.\nRegularly occurring wet and dry seasons, as on Earth, could have provided the conditions needed for life to form, the researchers said.\n‘Pretty lucky’\nCuriosity has already detected the presence of organic compounds considered the building blocks of life on Mars, which could be another piece of the puzzle.\nBut these building blocks need the right conditions to become the precursors of life.\n“In a world that’s too dry, these molecules never have the opportunity to form – nor do they in a world that’s too wet,” Dr Rapin said.\nBut banish thoughts of big-headed green men – if Mars did support life, it was likely primitive single-celled microorganisms.\n“Over 11 years, we’ve found ample evidence that ancient Mars could have supported microbial life” due to the Curiosity rover, said Dr Ashwin Vasavada of The National Aeronautics and Space Administration’s Jet Propulsion Laboratory.\n“Now, the mission has found evidence of conditions that may have promoted the origin of life, too,” he said in a statement.\nThe discovery of such ancient terrain could never have been possible on Earth, where tectonic plates constantly reshuffle the surface, sifting away such lingering traces of the past.\nThat means that studying Mars – which lacks tectonic plates – could help scientists solve the mystery of how life began on our home planet.\n“It’s pretty lucky of us to have a planet like Mars nearby that still holds a memory of the natural processes which may have led to life,” Dr Rapin said. AFP", "url": "https://www.straitstimes.com/world/europe/mars-once-had-wet-and-dry-alternating-climates-conducive-for-life-to-form-study-says"}