{"authors": [], "date_download": "2024-10-12 14:08:34", "date_modify": "2024-10-12 14:08:34", "date_publish": "2022-05-27 05:00:11", "description": "Over 4,000 children and adolescents up to the age of 19 died from firearm-related injuries in 2020. Read more at straitstimes.com.", "filename": "world_united-states_guns-are-now-the-leading-cause-of-death-for-us-children_1728742114.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/27/2022-05-26T204722Z_1358522320_RC20FU9I96NR_RTRMADP_3_TEXAS-SHOOTING.JPG?VersionId=ozhH5_CKQMZO5_4ipjhlhq45Oqey4rte", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_guns-are-now-the-leading-cause-of-death-for-us-children_1728742114.html", "title": "Guns are now the leading cause of death for US children", "title_page": "Guns are now the leading cause of death for US children | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (AFP) - Firearm deaths have surpassed motor vehicle crashes as the leading cause of death among American youngsters, with official data showing a strong rise in gun-related homicides such as the killing of 19 children in a Texas school rampage.\nOverall, 4,368 children and adolescents up to the age of 19 died from firearm-caused injuries in 2020, a rate of 5.4 per 100,000 a dashboard by the Centres for Disease Control and Prevention (CDC) showed.\nHomicides made up nearly two-thirds of the gun deaths.\nBy comparison, there were 4,036 deaths linked to motor vehicles, the previous leading cause of death among this age group.\nThe gap has been narrowing as road safety measures have improved over the decades, while gun related deaths have risen.\nThe trend lines crossed in 2020, the latest year for which data is available - a finding identified in a letter to the New England Journal of Medicine (NEJM) last week.\nThe letter's authors noted the new data was consistent with other evidence that gun violence rose during the Covid-19 pandemic, for reasons that aren't fully clear, but \"it cannot be assumed that (it) will later revert to pre-pandemic levels.\"\nThe newly-updated CDC dashboard shows that nearly 30 per cent of the deaths were suicides, just over three percent were unintentional, and 2 per cent were of undetermined intent.\n'Deadly consequences'\nA small number were categorised as \"legal intervention\" or self-defence.\nThe deaths disproportionately impacted Black children and adolescents, who were more than four times as likely to die as white children - for whom motor vehicles still posed a greater threat.\nThe second most impacted group by guns were American Indians.\nMales, meanwhile, were six times likelier to die by a gun than females.\nBy region, the gun-related death rate was highest in the capital Washington, followed by the state of Louisiana, then Alaska.\nThe figures served to underscore that while mass shootings such as the one in Uvalde provoke horror, they make up only a tiny fraction of overall childhood gun deaths.\n\"Since the 1960s, continuous efforts have been directed toward preventing deaths from motor vehicle crashes,\" wrote the authors of another recent letter to the NEJM, contrasting the situation with that of firearms, where regulations have been loosened.\nHolden Thorp, editor-in-chief of leading journal Science published an editorial Thursday calling for more research into the public health impacts of gun ownership to advance policy change.\n\"Scientists should not sit on the sidelines and watch others fight this out,\" he said.\n\"More research into the public health impacts of gun ownership will provide further evidence of its deadly consequences,\" he continued, arguing that severe mental illness, often blamed for mass shootings, was prevalent at similar levels in other countries that do not have regular mass shootings.", "url": "https://www.straitstimes.com/world/united-states/guns-are-now-the-leading-cause-of-death-for-us-children"}