{"authors": [], "date_download": "2024-10-12 14:18:53", "date_modify": "2024-10-12 14:18:53", "date_publish": "2023-10-20 05:10:40", "description": "US lawmakers are debating several pieces of legislation to pressure Iran. Read more at straitstimes.com.", "filename": "world_middle-east_us-senators-ready-bill-to-fund-office-helping-iran-oil-seizures_1728742733.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/20/LYNXMPEJ9I12C-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_us-senators-ready-bill-to-fund-office-helping-iran-oil-seizures_1728742733.html", "title": "US senators ready bill to fund office helping Iran oil seizures", "title_page": "US senators ready bill to fund office helping Iran oil seizures | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - US senators from both parties are readying legislation to help the federal government enforce oil sanctions on Iran, the office of Senator Joni Ernst, a Republican, told Reuters on Thursday.\nSenator Ernst is spear-heading the bill slated for release on Monday to create a US$150 million (S$206 million) Iranian sanctions enforcement fund for the Department of Homeland Security Investigation (HSI) office, with a priority on Iranian petroleum sanctions. The bill will be co-led by Senator Richard Blumenthal, a Democrat.\nThe Homeland investigative office has conducted probes that led to the seizure of two cargoes of Iranian oil since its enforcement programme was activated in 2019. Such actions come with high upfront costs, which have not always been fully available.\nUS lawmakers are debating several pieces of legislation to pressure Iran after the Oct 7 attacks on Israel by Hamas that killed at least 1,400 people, mostly civilians. Hamas has long been backed by Iran, but Tehran has denied any involvement in the attacks.\nThe latest seizure by the Justice Department in April was a cargo carried by the Suez Rajan tanker. Iran's Islamic Revolutionary Guard Corps (IRGC) had been trying to send the nearly one million barrels of Iranian oil to China, in violation of US sanctions.\n“Right now, we are witnessing the chaos Iran-backed Hamas is inflicting on Israel and the world, funded by the IRGC’s illicit oil sales,” Senator Ernst said through a spokesman.\n“Instead of allowing Iran’s illegal actions to continue, I’m working to cut the red tape and equip HSI, and its proven record of enforcing sanctions, with the support and resources it needs to go after and stop Tehran,” Senator Ernst’s statement added.\nAs Iran's oil exports jumped this year despite US sanctions over its nuclear program, Senator Ernst and Senator Blumenthal have urged the Biden administration to enable the Homeland investigative office to help seize shipments. Iran says the nuclear program is for peaceful purposes.\nIran also has its own leverage over oil shipping. About a fifth of the world's supply of seaborne petroleum passes through the Strait of Hormuz, a chokepoint between Iran and Oman, according to data from analytics firm Vortexa.\nIn May, Iran seized two oil tankers in Gulf waters, part of a series of seizures or attacks on commercial vessels since 2019.\nUnder the current law, 75 per cent of funds from US oil seizures go to the US Victims of State Sponsored Terror Fund. The additional 25 per cent would go to the enforcement fund, which would be capped at US$500 million, and additional funds would help pay down the national debt.\nSenator Blumenthal said the proposed measure “will establish dedicated resources to go after illicit Iranian oil”, help to undermine Tehran’s influence, and provide money to the Victims of State Sponsored Terrorism Fund. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/us-senators-ready-bill-to-fund-office-helping-iran-oil-seizures"}