{"authors": [], "date_download": "2024-10-12 13:38:42", "date_modify": "2024-10-12 13:38:42", "date_publish": "2024-08-20 09:22:05", "description": "Ukraine said it had not seen an increase in Belarusian troops on the border. Read more at straitstimes.com.", "filename": "world_europe_belarus-says-it-sends-more-troops-aircraft-armoury-to-border-with-ukraine_1728740322.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/LYNXMPEK7J017-1.jpg?VersionId=lBKYTXiPc7gjpg6NLp3m6XD6fmGOhrGS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_belarus-says-it-sends-more-troops-aircraft-armoury-to-border-with-ukraine_1728740322.html", "title": "Belarus says it sent more troops, aircraft, armoury to border with Ukraine", "title_page": "Belarus says it sent more troops, aircraft, armoury to border with Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Belarus on Aug 19 said it had sent aircraft, air defence forces and armoury to its border with Ukraine, a day after President Alexander Lukashenko said he had deployed nearly a third of his country’s armed forces to the region.\n“The group has been significantly increased and at the moment they are on duty at the southern borders of our country,” Major-General Andrei Lukyanovich, commander of the Air Force and Air Defence of Belarus, told the state-owned CTV broadcaster.\nAviation, anti-aircraft missile forces and radio-technical troops were deployed to the border, Maj-Gen Lukyanovich said, according to a transcript provided on CTV’s website.\nDays after Ukraine’s surprise incursion into Russia’s territory, Mr Lukashenko – a loyal ally of President Vladimir Putin – accused Kyiv of aggressive policies and of sending more than 120,000 of its troops to the border with Belarus.\nUkraine said it had not seen an increase in Belarusian troops on the border and called Mr Lukashenko’s statements “rhetoric” aimed at pleasing Mr Putin, who used Belarus as a launchpad to start his invasion in Ukraine in February 2022.\nMoscow calls the war a “special military operation”. Kyiv and its allies say it is an unprovoked imperialistic attempt at a land grab, which has since killed thousands and displaced millions of Ukrainians, turning cities into rubble.\nMaj-Gen Lukyanovich told CTV that Belarus was also expecting more military aircraft deliveries from Moscow in 2024 and that Minsk was putting its efforts into strengthening its anti-drone systems.\n“The fact that drones are the plague of the 21st century is obvious,” Maj-Gen Lukyanovich said. “This is a headache, which, I think, we will find the means to counter.” REUTERS", "url": "https://www.straitstimes.com/world/europe/belarus-says-it-sends-more-troops-aircraft-armoury-to-border-with-ukraine"}