{"authors": [], "date_download": "2024-10-12 13:35:39", "date_modify": "2024-10-12 13:35:39", "date_publish": "2023-10-27 23:56:04", "description": "JERUSALEM/ Israeli security forces restricted young Palestinians from entering Al-Aqsa mosque in Jerusalem for prayers on Friday and deployed in strength across the Old City and beyond to quell any unrest spilling over from the conflict in Gaza. Read more at straitstimes.com.", "filename": "world_middle-east_prayers-protests-and-clashes-in-jerusalem-and-west-bank-as-gaza-war-rages_1728740139.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/27/LYNXMPEJ9Q0QD-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_prayers-protests-and-clashes-in-jerusalem-and-west-bank-as-gaza-war-rages_1728740139.html", "title": "Prayers, protests and clashes in Jerusalem and West Bank as Gaza war rages", "title_page": "Prayers, protests and clashes in Jerusalem and West Bank as Gaza war rages | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM/RAMALLAH - Israeli security forces restricted young Palestinians from entering Al-Aqsa mosque in Jerusalem for prayers on Friday and deployed in strength across the Old City and beyond to quell any unrest spilling over from the conflict in Gaza.\nIn the occupied West Bank, Israeli troops killed four Palestinians during raids, the official Palestinian news agency WAFA said. Two of the dead were identified by militant factions as their members.\nLarge numbers of Israeli police kept guard around Al-Aqsa, a perennial flashpoint and often the scene of clashes, as Palestinians gathered for Friday prayers, Reuters journalists said. At one point they fired teargas.\nIt was the third week in row that Palestinians have been restricted from praying at the mosque following the Hamas assault on southern Israel on Oct. 7 and the ensuing Israeli bombardment and siege of Hamas-ruled Gaza.\nThey were made to say prayers outside the Old City, gathering by roadsides while Israeli security forces watched.\nEventually about 5,000 elderly worshippers were allowed to enter. The authority in charge of the mosque, the Jerusalem Islamic Endowments Department, said that normally about 50,000 would take part.\nThe mosque is sited on a hill known to Jews as the Temple Mount and to Muslims as The Noble Sanctuary.\nIn the West Bank, the Israeli military said that during arrest operations, its troops came under attack in the city of Jenin and fired back, killing two men.\nThe Islamic Jihad militant group confirmed one of them belonged to it, and Hamas said one its fighters was killed in the Jenin fighting.\nWAFA said another two Palestinians were killed, one in Jenin and one in the town of Qalqiya, saying their deaths took the number of Palestinians killed in the West Bank since the Hamas-Israel conflict broke out to 110.\nThe military said that in Qalqiya, troops came under fire while shutting down a store whose owner was accused of incitement to violence. They returned fire, hitting at least one person, a military statement said.\nProtests also took place in Hebron in the West Bank.\nIn the capital of neighbouring Jordan, thousands of people took to the streets to denounce Israel and voice support for the Palestinians. Many waved the green, red white and black Palestinian flag.\n\"We are with Palestinians and with Gazans. We also came to stress that we are standing behind the resistance until the end,\" said participant Mahmoud Aqalan.\nAnother protester, Hassan Sultan, said: \"It is our brothers who are being killed in Gaza. This is the least we could do - to make our position known to the world.\" REUTERS", "url": "https://www.straitstimes.com/world/middle-east/prayers-protests-and-clashes-in-jerusalem-and-west-bank-as-gaza-war-rages"}