{"authors": [], "date_download": "2024-10-12 13:49:20", "date_modify": "2024-10-12 13:49:20", "date_publish": "2023-11-17 16:40:00", "description": "The amount countries say they need to withstand climate impacts far exceeds the figures generated by analysis models. Read more at straitstimes.com.", "filename": "world_world-needs-232-billion-more-to-face-climate-impacts-than-estimates-show_1728740960.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/17/2023-11-16T191510Z1536510471RC27E4AT7LASRTRMADP3USA-WEATHER-FLORIDA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_world-needs-232-billion-more-to-face-climate-impacts-than-estimates-show_1728740960.html", "title": "World needs $232 billion more to face climate impacts than estimates show", "title_page": "World needs $232 billion more to face climate impacts than estimates show | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – The United Nations Environment Programme (Unep) recently published its annual Adaptation Gap Report, examining how much funding the world’s developing countries will need to withstand the impacts of climate change. The report provides a complex, but constructive understanding of the investment required, beginning with the striking shortfall today. According to Unep, “adaptation finance needs are 10 to 18 times as great as current international public adaptation finance flows – at least 50 per cent higher than previously estimated”.\nThere is not one assessment of the investment required for adaptation; in fact, there are two, and they have significantly different dollar figures. The first is the “modelled” cost of adaptation, which is based on an “analysis of the adaptation needed to reduce incremental climate risks, relative to a reference period, without consideration of how this is financed”. Unep gives this cost investment requirement as US$215 billion (S$290 billion) a year this decade.\nThe second is the “country adaptation finance needs”, which refer to the “financial resources required by countries from international and domestic sources” to implement national adaptation plans. This assessment reflects countries’ own assessment of what adaptation programmes might cost, as well as the specific adaptation needs that countries have identified. Unep says this figure is nearly double the modelled cost, at US$387 billion (S$522 billion) a year this decade.\nThe biggest distinction between modelled costs and finance needs is on a regional basis. The modelled costs of adapting Latin America and the Caribbean to climate change is almost twice the amount countries in that region say they need. On the other side, South Asian countries report they need more than double what modelled costs show.\nBoth modelled costs and finance needs indicate East Asia will require the most, or around 40 per cent, of all adaptation investment dollars between 2020 and 2030. Yet, this varies greatly from the adaptation finance flows today; sub-Saharan Africa currently receives the largest share (roughly 30 per cent) of this investment.\nUnep’s adaptation gap report makes two other key points for adaptation finance between now and 2030.\nThe first is about relative adaptation finance needs by country income level. As the report notes, upper and lower middle-income countries have the highest “absolute costs” for adaptation.\nHowever, richer countries’ adaptation investment requirements are relatively low when viewed as a share of their absolute income levels – only 0.7 per cent of gross domestic product (GDP) for lower-middle income and 0.5 per cent of GDP for upper-middle income countries. Low-income countries, despite their absolutely smaller needs, have a much higher adaptation investment burden as a percentage of GDP at 3.5 per cent. That makes international support for such efforts all the more important.\nThe second point is adaptation investment is not just needed immediately; it will be required continuously for the foreseeable future. Even if we do reach net-zero greenhouse gas emissions by 2050, the impacts of still-high atmospheric carbon-dioxide levels will be with us for decades. That means we need to be prepared to invest not just in the adaptation requirements that are evident today, but also those that we will discover in coming years.\nAs the impacts of climate change worsen, adapting will not be optional; and funding adaptation will not be, either. BLOOMBERG", "url": "https://www.straitstimes.com/world/world-needs-232-billion-more-to-face-climate-impacts-than-estimates-show"}