{"authors": [], "date_download": "2024-10-12 14:02:09", "date_modify": "2024-10-12 14:02:09", "date_publish": "2023-05-11 20:40:00", "description": "Britain on Thursday said it is supplying Ukraine with Storm Shadow long-range cruise missiles. Read more at straitstimes.com.", "filename": "world_europe_zelensky-says-more-time-needed-for-counteroffensive-in-bakhmut-but-wagner-says-ukraine-making-gains_1728741729.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/11/UKRAINERUSSIA13_0.jpg?VersionId=Ui2eVmB9RHSciTgrdke0c.qTnYkjyO2C", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_zelensky-says-more-time-needed-for-counteroffensive-in-bakhmut-but-wagner-says-ukraine-making-gains_1728741729.html", "title": "Zelensky says more time needed for counteroffensive in Bakhmut, but Wagner says Ukraine making gains", "title_page": "Zelensky says more time needed for counteroffensive in Bakhmut, but Wagner says Ukraine making gains | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - The leader of Russia’s Wagner private army said on Thursday that Ukraine’s long-awaited counteroffensive was already under way and making gains on the outskirts of the eastern city of Bakhmut, while Kyiv said its main effort had not yet started.\nUkrainian operations were “unfortunately, partially successful”, Mr Yevgeny Prigozhin, whose force of mercenaries and convicts recruited from prison has led Russia’s main military campaign in Bakhmut, said on social media.\nKyiv says it has pushed Russian forces back over the past two days near Bakhmut in small-scale local assaults, but a counteroffensive involving tens of thousands of troops and hundreds of new Western tanks has yet to begin.\n“We still need a bit more time,” President Volodymyr Zelensky said in an interview with European broadcasters released earlier on Thursday.\nUkrainian forces had already received enough equipment from Western allies for their campaign, but were waiting for the full complement to arrive to reduce casualties, Mr Zelensky said.\n“With (what we have) we can go forward and be successful,” he said. “But we’d lose a lot of people. I think that’s unacceptable.”\nMr Prigozhin, a once secretive figure who has lately issued daily statements denouncing the Russian command for failing to adequately supply his fighters, said Mr Zelensky was being “deceptive” and the Ukrainian offensive was already under way.\nWhile Mr Prigozhin’s forces have been fighting in the centre of the city, he has said Ukraine is making gains on its flanks in areas defended by regular Russian troops, some of whom have fled.\nThe war in Ukraine is at a turning point, with Kyiv poised to unleash its new counterstrike after six months of keeping its forces on the defensive, while Russia mounted a huge winter offensive that failed to capture significant territory.\nWestern allies are sending hundreds of tanks and armoured vehicles to Ukraine for its counteroffensive and have trained thousands of Ukrainian troops abroad.\nMoscow’s main target for months has been the small eastern Ukrainian city of Bakhmut, which it has come close to capturing but not quite taken in what would be its sole prize after months of the bloodiest ground combat in Europe since World War II.\nMr Prigozhin said on Tuesday that a Russian brigade had fled from the trenches, giving up a swathe of land south-west of Bakhmut. A Ukrainian unit claimed to have routed the brigade, destroying two of its companies.\nThe commander of Ukraine’s ground forces said on Wednesday that Russian forces had retreated in places by as much as 2km at the front line.\nThe Russian defence ministry has not commented on those reports, but in remarks overnight, Kremlin spokesman Dmitry Peskov acknowledged that the war was “very difficult”. He said he had no doubt that Bakhmut “will be captured and will be kept under control”.\nManaging expectations\nIn anticipation of the Ukrainian counteroffensive, Russia has resumed air strikes on Ukraine over the past two weeks after a lull of nearly two months. Moscow says Ukraine has used drones to strike occupied areas and Russian territory near the border.\nIn the latest report, the governor of Russia’s Bryansk region bordering Ukraine said a drone had hit a fuel storage depot. No one was hurt. Kyiv does not comment on such incidents.\nUkraine has been asking for months for long-range missiles, but support provided by Britain and other allies such as the United States has previously been limited to shorter-range weapons.\nBut this has changed. Britain on Thursday said it is supplying Ukraine with Storm Shadow long-range cruise missiles, making it the first country to provide Kyiv with longer-range weapons.\nSome Ukrainian officials have tried to manage expectations for their counteroffensive, cautioning against expecting a swift repeat of Ukraine’s big military successes in 2022, when it pushed Russian forces back from Kyiv’s outskirts and recaptured swathes of occupied territory in unexpected breakthroughs.\nRussia is determined to defend the sixth of Ukraine’s territory that it has occupied and claims to have annexed forever. In the six months since the last major Ukrainian advance, it has built extensive fortifications along the front. Penetrating that with an armoured assault would be far more complicated than anything Ukraine’s forces have attempted yet.\nIn Brussels, Nato’s top military official said the war would increasingly be a battle between large numbers of poorly trained Russian troops with outdated equipment, and a smaller Ukrainian force with better Western weapons and training.\nAdmiral Rob Bauer, a Dutch officer who is chair of Nato’s military committee, said Russia was deploying T-54 tanks – an old model designed in the years after World War II. REUTERS, AFP", "url": "https://www.straitstimes.com/world/europe/zelensky-says-more-time-needed-for-counteroffensive-in-bakhmut-but-wagner-says-ukraine-making-gains"}