{"authors": [], "date_download": "2024-10-12 14:01:45", "date_modify": "2024-10-12 14:01:45", "date_publish": "2023-12-31 05:00:49", "description": "The corridor was created in August to link Ukraine’s ports to the Bosphorus Strait. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-13-million-tonnes-of-merchandise-exported-via-black-sea-corridor_1728741705.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/31/UKRAINE-RUSSIA-CONFLICT-WAR-143959.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-13-million-tonnes-of-merchandise-exported-via-black-sea-corridor_1728741705.html", "title": "Ukraine says 13 million tonnes of merchandise exported via Black Sea corridor", "title_page": "Ukraine says 13 million tonnes of merchandise exported via Black Sea corridor | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV, Ukraine – Ukraine has exported about 13 million tonnes of merchandise on some 400 ships since setting up a protected maritime corridor in August to fend off Russian threats, a government minister said on Dec 30.\nWhile Ukraine had few military achievements on land in 2023, on the Black Sea it has pushed Russia’s much larger navy away from its coasts, allowing the resumption of grain exports.\nInfrastructure Minister Oleksandr Kubrakov said he was “grateful” to Ukraine’s international partners “for ensuring the operation of the corridor in conditions of military aggression”.\nThe corridor was created in August to link Ukraine’s ports to the Bosphorus Strait, several weeks after Moscow refused to agree on a new accord to allow cereal exports through the contested Black Sea.\nThe now-defunct accord had allowed Ukraine to export nearly 33 million tonnes of cereals and other foodstuffs over a year.\nThe sea route is particularly important now because several land border crossings have been blocked in recent months by Polish truckers unhappy with Ukrainian competition.\nRussia had threatened to target ships arriving and leaving Ukrainian ports, and has attacked port and grain storage facilities.\nA Panamanian-flagged grain carrier headed to a Ukrainian port hit a mine this week, wounding two sailors.\nOn Dec 30, Ukraine President Volodymyr Zelensky saluted his country’s maritime success, claiming that his forces had “reconquered the sea” in 2023. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-says-13-million-tonnes-of-merchandise-exported-via-black-sea-corridor"}