{"authors": [], "date_download": "2024-10-12 13:41:46", "date_modify": "2024-10-12 13:41:46", "date_publish": "2024-01-10 02:20:35", "description": "The lander failed to enter its correct sun-facing orientation and its battery levels plummeted. Read more at straitstimes.com.", "filename": "world_fuel-leak-on-astrobotics-moon-lander-leaves-no-chance-of-soft-landing_1728740506.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/10/LYNXMPEK080P6-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_fuel-leak-on-astrobotics-moon-lander-leaves-no-chance-of-soft-landing_1728740506.html", "title": "Fuel leak on Astrobotic’s moon lander leaves ‘no chance’ of soft landing", "title_page": "Fuel leak on Astrobotic’s moon lander leaves ‘no chance’ of soft landing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Astrobotic’s Peregrine lunar lander has “no chance” of a soft landing on the moon after springing a propellant leak in the first few hours of its journey in space, the company said on Jan 9 about the first such attempt by the United States in five decades.\nThere was 40 hours of fuel left on the lander that will allow it to operate “as a spacecraft” even as engineers determine what its new mission in orbit will be, the space robotics firm said.\nThe craft was launched aboard the first flight of Vulcan, a rocket that had been under development for a decade by United Launch Alliance, a joint venture of Boeing and Lockheed Martin.\nThe lander was launched successfully at 2.18am ET on Jan 8 from Cape Canaveral, Florida, but it suffered a propulsion system issue en route to the moon.\nAfter the launch, the lander failed to enter its correct sun-facing orientation in space and saw its battery levels plummet, but Astrobotic was able to fix the issue, the company said.\n“The team continues to work to find ways to extend Peregrine’s operational life,” it said, adding that engineers are receiving data and proving spaceflight operations for components and software related to its next lunar lander mission. REUTERS", "url": "https://www.straitstimes.com/world/fuel-leak-on-astrobotics-moon-lander-leaves-no-chance-of-soft-landing"}