{"authors": [], "date_download": "2024-10-12 14:01:51", "date_modify": "2024-10-12 14:01:51", "date_publish": "2023-05-22 09:40:00", "description": "Mr Antonov said that any Ukrainian strike on Crimea would be considered a strike on Russia. Read more at straitstimes.com.", "filename": "world_russia-says-f-16-transfer-to-ukraine-would-raise-questions-of-nato-s-involvement_1728741711.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/22/FILES-UKRAINE-RUSSIA-CONFLICT-US-DEFENSE-F-16-170225_0.jpg?VersionId=MVWrahL9QDWe3YwZKX0pwbWbp4_WWW.o", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_russia-says-f-16-transfer-to-ukraine-would-raise-questions-of-nato-s-involvement_1728741711.html", "title": "Russia says F-16 transfer to Ukraine would raise questions of Nato’s involvement", "title_page": "Russia says F-16 transfer to Ukraine would raise questions of Nato’s involvement | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW – The transfer of F-16 fighter jets to Ukraine would raise the question of Nato’s involvement in the conflict, Russia’s Ambassador to the United States Anatoly Antonov said in remarks published early on Monday.\n“There is no infrastructure for the operation of the F-16 in Ukraine and the needed number of pilots and maintenance staff is not there either,” Mr Antonov said in remarks published on the embassy’s Telegram messaging channel.\n“What will happen if the American fighters take off from Nato airfields, controlled by foreign ‘volunteers’?“\nUS President Joe Biden on Friday endorsed training programmes for Ukrainian pilots on F-16 fighter jets, and Ukrainian President Volodymyr Zelensky assured Mr Biden that the aircraft would not be used to go into Russian territory.\nMr Antonov said that any Ukrainian strike on Crimea would be considered a strike on Russia.\n“It is important that the US be fully aware of the Russian response,” Mr Antonov said.", "url": "https://www.straitstimes.com/world/russia-says-f-16-transfer-to-ukraine-would-raise-questions-of-nato-s-involvement"}