{"authors": [], "date_download": "2024-10-12 13:38:31", "date_modify": "2024-10-12 13:38:31", "date_publish": "2024-08-21 19:57:42", "description": "Kyiv launched a major assault into western Russia on Aug 6, advancing up to 28-35km. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-it-hits-pontoon-bridges-in-kursk-region-with-us-made-rockets_1728740311.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/21/LYNXMPEK7K0DW-2.jpg?VersionId=bo427483.2xAPFtOQKVCIJ5VfxRhI_y5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-it-hits-pontoon-bridges-in-kursk-region-with-us-made-rockets_1728740311.html", "title": "Ukraine hitting pontoon bridges in Kursk region with US-made rockets", "title_page": "Ukraine hitting pontoon bridges in Kursk region with US-made rockets | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine’s military said on Aug 21 its forces are using US-manufactured Himars rocket systems to destroy pontoon bridges and engineering equipment in Russia’s Kursk region, targeting logistics in its major cross-border incursion.\nRussian officials have said Ukraine has damaged or destroyed at least three bridges over the Seym River since Kyiv launched a major assault on western Russia on Aug 6, advancing up to 28-35km.\n“Where do Russian pontoon bridges ‘disappear’ in the Kursk region? Operators... accurately destroy them,” Ukraine’s Special Operations Forces said on Telegram messenger.\nThe statement said US-manufactured Himars rocket systems were used. It was the first official statement from Kyiv that Western weapons are part of the unprecedented offensive.\nWashington has made no direct comment regarding the use of US-made weapons in the Kursk region, while saying its policies had not changed and that Ukraine was defending itself from Russia’s attacks.\nWhile allies have barred Ukraine from conducting long-range strikes with Western weapons inside Russia, they have allowed Kyiv to use them to hit border areas since Russia's new offensive on Kharkiv region this spring.\nThe Kremlin says the use of US-made weapons inside its territory is an escalation.\nThe video posted by special forces showed strikes on several pontoon crossings. At least one strike appeared to be conducted with cluster munitions.\nReuters could not independently verify the statement and video.\nThe video clip also showed drone strikes on military trucks and other locations described as a munitions warehouse and an electronic warfare complex.\nReuters has been able to verify at least one pontoon crossing that seems to have been destroyed.\nIt was likely set up between Aug 14 and 17 linking the Russian settlements of Zvannoe and Glushkovo after two bridges were destroyed or damaged earlier.\nThe crossing, some 14km from the border, was gone by Aug 19, satellite imagery showed. Smoke was also visible in images from the area that day.\nWhile Kyiv has reported a string of battlefield successes since it crossed unexpectedly into Russia’s Kursk region on Aug 6, Moscow has pressed forward on the front line in eastern Ukraine, 2½ years since its full-scale invasion.\nRussia’s Defence Ministry has said in recent days that its forces have taken control over several settlements in the area, including Zhelanne and Svyrydonivka, as well as the town of Niu York, some 46km from Pokrovsk.\nUkraine’s military has not directly commented on these claims while reporting heavy fighting in the areas.\nUkraine’s Foreign Ministry has said the advance in the Kursk region made bigger gains than Russia had captured since the start of 2024. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-says-it-hits-pontoon-bridges-in-kursk-region-with-us-made-rockets"}