{"authors": [], "date_download": "2024-10-12 13:27:17", "date_modify": "2024-10-12 13:27:17", "date_publish": "2023-10-14 16:46:00", "description": "Videos on social media showed fans pushed and shoved to get their hands on Pikachu merchandise. Read more at straitstimes.com.", "filename": "world_europe_van-gogh-museum-in-amsterdam-scraps-pokemon-cards-over-safety-concerns_1728739637.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/14/NETHERLANDS-ART-193848.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_van-gogh-museum-in-amsterdam-scraps-pokemon-cards-over-safety-concerns_1728739637.html", "title": "Amsterdam’s Van Gogh Museum scraps Pokemon card giveaway over safety concerns", "title_page": "Amsterdam’s Van Gogh Museum scraps Pokemon card giveaway over safety concerns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "THE HAGUE – The Van Gogh Museum in Amsterdam said on Saturday it will no longer hand out a prized Pokemon card after the giveaway sparked crushes by “scalpers” reselling it for exorbitant prices.\nLaunched with great fanfare in September to mark the museum’s 50th anniversary, the collaboration with Pokemon was intended to inspire younger visitors and included exhibitions on artist Vincent Van Gogh’s links with Japan.\nBut it also attracted die-hard Pokemon fans keen to get their hands on a limited-edition “Pika-Portrait” card. Pikachu With Grey Felt Hat showed the yellow character in a pose inspired by a famous Van Gogh self-portrait and was available after completing a “quest” around the museum.\n“Recently, a small group of individuals has created an undesirable situation that has led us to take the difficult decision to remove the Pikachu With Grey Felt Hat promo card from the museum,” the Amsterdam institution said in a statement.\nThis was done to allow visitors to explore the exhibits in a “safe and enjoyable manner” and was taken with the safety and security of staff in mind, the museum added.\nSeveral visitors posted videos online showing unruly scenes at the museum as fans pushed and shoved to get their hands on prized Pikachu merchandise. As the cards are limited-edition, collectors hoping to “catch them all” are prepared to pay huge prices to get them.\nSo-called scalpers obtain as many as they can to resell them on trading websites. Pikachu With Grey Felt Hat has been changing hands for hundreds of dollars, with one going on eBay for an ambitious US$6,969 (S$9,500).\nFans from Britain, the US and Canada will soon get another chance to pick up the rare card via the Pokemon Centre, the museum said, with retailers in Holland selling them again early in 2024.\nBut “it will not be available via the Van Gogh Museum”, the statement stressed. AFP", "url": "https://www.straitstimes.com/world/europe/van-gogh-museum-in-amsterdam-scraps-pokemon-cards-over-safety-concerns"}