{"authors": [], "date_download": "2024-10-12 13:29:34", "date_modify": "2024-10-12 13:29:34", "date_publish": "2024-02-12 16:02:00", "description": "Putin has urged the US to discuss a deal that would allow Moscow to control 20 per cent of Ukraine’s territory. Read more at straitstimes.com.", "filename": "world_two-years-into-russia-ukraine-war-negotiations-a-distant-prospect_1728739774.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/12/FRONTED13UKRAINERUSSIA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_two-years-into-russia-ukraine-war-negotiations-a-distant-prospect_1728739774.html", "title": "Two years into Russia-Ukraine war, negotiations still a distant prospect", "title_page": "Two years into Russia-Ukraine war, negotiations still a distant prospect | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - After two years of war in Ukraine, there is no prospect of negotiations to find a breakthrough as Russian President Vladimir Putin, emboldened by the erosion of Western support for Kyiv, girds for a long conflict.\n2024 will be another year of war as Ukraine is determined to keep on fighting to recapture territory while Putin will only be satisfied with Kyiv’s full surrender, analysts and diplomats say.\nPutin may have signalled in a Feb 6 interview with right-wing US talk show host Tucker Carlson that Russia was interested in negotiations but this would be so much on Moscow’s own terms that Kyiv would not countenance such talks.\n“I don’t see any negotiations taking place any time soon,” Mr Fyodor Lukyanov, head of the Kremlin-linked Council on Foreign and Defense Policy think tank in Moscow, told AFP.\n“There’s nothing they can negotiate about.”\nWhile the winter of 2022 was humiliating for Mr Putin, who failed to take Kyiv within days, he has now regrouped and appears reinvigorated by Ukraine’s unsuccessful counteroffensive, the prospect of Donald Trump returning to the White House in November’s presidential election and the rise of the far-right in Europe.\n“Wouldn’t it be better to negotiate with Russia?“ Mr Putin told Mr Carlson, urging the United States to discuss a deal that would allow Moscow to control 20 per cent of Ukraine’s territory. “Sooner or later we’ll come to an agreement anyway.”\nMr Mykhailo Podoliak, an adviser to Ukrainian President Volodymyr Zelensky, reiterated Kyiv’s long-held position that no negotiations were possible until Russia withdraws from occupied territories.\n“In any other case, negotiations are impossible,” Mr Podoliak told AFP.\nA European diplomat, speaking on condition of anonymity, also ruled out any talks under the current circumstances.\n“Negotiations can only take place when Ukraine is in a position of strength on the ground,” said the diplomat.\nTake action\nBut after two years of resisting the full-scale invasion of the much larger neighbour, Ukraine’s troops are exhausted, and a Republican hold-up on US military aid and Europe’s inability to ramp up weapons supplies fast enough contribute to a sense of uncertainty and gloom in Kyiv.\nCracks are beginning to emerge, with Mr Zelensky’s decision to part ways with popular army chief Valery Zaluzhny seen as a sign of the first serious split within the leadership.\nBy contrast, Russia has withstood the initial shock of unprecedented Western sanctions and put its economy on a war footing, ramping up production and recruitment and jailing critics of the invasion.\nLate in the day\nMr Putin appears to be anxiously awaiting the result of the US election, too.\n“I think my expectation is that Putin won’t make peace or a meaningful peace before he sees the result of our election,” a senior US official said on condition of anonymity.\nTrump has said he would be able to end the war in Ukraine “in 24 hours” if re-elected, with Mr Zelensky saying such remarks were “very dangerous”.\n“Nobody knows what Trump’s foreign policy will be, starting with himself,” said former French diplomat and political analyst Marie Dumoulin.\nEuropean leaders increasingly realise that if Mr Putin is allowed to win in Ukraine, he could then be tempted to test Nato’s defences, analysts say.\nIn January, French President Emmanuel Macron called on European countries to back Ukraine “over the long term” and get ready in case Washington decides to pull the plug on aid.\nIt will take time for the continent’s defence industry to step up ammunition production but the West could still turn things around, said analysts.\n“For Europeans in particular, this means putting their money where their mouth is. The acquisition of ammunition, missiles, combat vehicles and spare parts is severely behind schedule,” said Mr Gustav Gressel of the European Council on Foreign Relations.\n“Although late in the day, Europeans can still correct this course.” AFP", "url": "https://www.straitstimes.com/world/two-years-into-russia-ukraine-war-negotiations-a-distant-prospect"}