{"authors": [], "date_download": "2024-10-12 13:42:46", "date_modify": "2024-10-12 13:42:46", "date_publish": "2024-10-10 06:59:06", "description": "The plane was over Canada when it took a sharp right turn and headed for New York. Read more at straitstimes.com.", "filename": "world_united-states_turkish-airlines-pilot-dies-mid-flight-forcing-emergency-landing-in-new-york_1728740566.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/10/PILOTDEATH.JPG?VersionId=5PV_Wrf1DyaEa8fRpsq_ue9jUDu2HlcV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_turkish-airlines-pilot-dies-mid-flight-forcing-emergency-landing-in-new-york_1728740566.html", "title": "Turkish Airlines pilot dies mid-flight, forcing emergency landing in New York", "title_page": "Turkish Airlines pilot dies mid-flight, forcing emergency landing in New York | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – A Turkish Airlines flight travelling from Seattle to Istanbul made an emergency landing at John F. Kennedy International Airport (JFK) in New York early on the morning of Oct 9 after the pilot died, the airline and federal aviation authorities said.\nThe plane, an Airbus A350, took off at 7.02pm on Oct 8 (10.02am Singapore time on Oct 9), according to FlightAware data.\nThe pilot, Mr Ilcehin Pehlivan, lost consciousness during the flight, the airline said, and after unsuccessful attempts to revive him, a decision was made to land at JFK after about eight hours in the air.\nThe plane, Flight 204, was over Baffin Island in northern Canada when it took a sharp right turn and headed for New York. It landed there at 5.57am.\nMr Pehlivan, 59, died before the plane landed, the airline said, without specifying a cause. The airline said that he had regular health examinations, including one in March, and that no problems were found.\nThe airline said arrangements were being made to get passengers to Istanbul on other flights.\nThe US Federal Aviation Administration confirmed the incident in a statement and said that “one of the pilots suffered a medical emergency”. The agency referred additional questions to the airline. NYTIMES", "url": "https://www.straitstimes.com/world/united-states/turkish-airlines-pilot-dies-mid-flight-forcing-emergency-landing-in-new-york"}