{"authors": [], "date_download": "2024-10-12 14:16:05", "date_modify": "2024-10-12 14:16:05", "date_publish": "2022-03-15 16:08:06", "description": "The three will be visiting as \"representatives of the European Council\". Read more at straitstimes.com.", "filename": "world_europe_polish-czech-slovenian-pms-to-travel-to-kyiv-on-tuesday-statement_1728742565.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/16/2022-03-15T213135Z_1779671999_RC283T9GN9VP_RTRMADP_3_UKRAINE-CRISIS-CENTRALEUROPE-VISIT-KYIV.JPG?VersionId=IdWaA0b94yQyTpcIMTlFYmI8SGwNKh13", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_polish-czech-slovenian-pms-to-travel-to-kyiv-on-tuesday-statement_1728742565.html", "title": "Polish, Czech, Slovenian PMs meet Ukraine's Zelensky in Kyiv", "title_page": "Polish, Czech, Slovenian PMs meet Ukraine's Zelensky in Kyiv | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PRAGUE/WARSAW (REUTERS) – The prime ministers of the Czech Republic, Poland and Slovenia arrived in Kyiv on Tuesday (March 15) in a show of high-level backing for Ukrainian President Volodymyr Zelensky, who briefed them on the war with Russia.\nThe three, who came by train, were the first foreign leaders to visit the capital since Russia invaded last month.\n“Your visit to Kyiv at this difficult time for Ukraine is a strong sign of support. We really appreciate it,” Zelensky said in an online post.\nBrief footage released by his office showed him speaking in Ukrainian and English to Polish Prime Minister Mateusz Morawiecki, Czech counterpart Petr Fiala and Slovenia’s Janez Jansa, who were also due to meet Ukrainian officials.\nAlso in attendance was Polish Deputy Prime Minister Jaroslaw Kaczynski, leader of the country’s ruling PiS party, who is seen as the main decision-maker in the country.\nRussian air strikes and shelling hit Kyiv on Tuesday killing at least four people, authorities said, as invading forces tightened their grip and the mayor announced a 35-hour curfew.\n“It is here, in war-torn Kyiv, that history is being made. It is here, that freedom fights against the world of tyranny. It is here that the future of us all hangs in the balance,” Morawiecki wrote on Twitter.\nThe Czech Republic and Poland, former communist members of both the EU and Nato, have been among the strongest backers of Ukraine in Europe since the Russian invasion.\nUkrainian Prime Minister Denys Shmygal hailed what he said was the “courage of true friends” and said the leaders would discuss support for Ukraine and further sanctions.\nPolish state-run broadcaster TVP Info reported that Morawiecki and Kaczynski also went to meet the Kyiv authorities.\nFiala said the decision to visit was taken in consultation with European Council President Charles Michel and European Commission President Ursula von der Leyen.\nThe idea of the trip was agreed at an EU leaders’ summit in Versailles in France last week, Dworczyk said.", "url": "https://www.straitstimes.com/world/europe/polish-czech-slovenian-pms-to-travel-to-kyiv-on-tuesday-statement"}