{"authors": [], "date_download": "2024-10-12 14:03:35", "date_modify": "2024-10-12 14:03:35", "date_publish": "2022-12-07 04:58:40", "description": "Twin strikes on air bases have dealt Moscow a major reputational blow. Read more at straitstimes.com.", "filename": "world_europe_drone-strikes-deep-in-russia-seen-as-ukrainian-rebuff-to-missile-barrages_1728741815.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/07/UKRAINERUSSIA_0.JPG?VersionId=XPNI5h190Xl8rfZ3Ek7IwhNCyN633PA4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_drone-strikes-deep-in-russia-seen-as-ukrainian-rebuff-to-missile-barrages_1728741815.html", "title": "Drone strikes deep in Russia seen as Ukrainian rebuff to missile barrages", "title_page": "Drone strikes deep in Russia seen as Ukrainian rebuff to missile barrages | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Twin strikes on air bases deep inside Russian territory have dealt Moscow a major reputational blow and raised questions about why its defences failed, analysts said, as attention turned to the use of drones in the war between neighbours.\nUkrainian officials revelled in the blasts but declined to acknowledge Kyiv’s role, after Russia said Ukraine used unmanned Soviet-era aerial vehicles to attack two air force bases in the Ryazan and Saratov areas of south-central Russia.\nNeither side has produced concrete evidence of what kinds of weapons were used and who was behind the attacks.\nBut the Russian statements suggested Ukraine may have used a Tupolev Tu-141 or Tu-143 reconnaissance drone, which date to the 1970s but could have been carrying explosives this time, according to some experts.\nKyiv also said on Sunday it was making progress with a new indigenous combat drone with a range of 1,000km.\nMoscow said Monday’s attacks killed three of its servicemen and wounded four more, as well as damaging two warplanes. On Tuesday, a third Russian airfield in Kursk, which lies closer to Ukraine, was set ablaze in another drone strike.\nMilitary analysts saw the attacks as Kyiv’s response to Russia on the same day that Moscow conducted another wave of missile strikes on critical infrastructure in Ukraine.\nIt remains to be seen whether Russia seeks to retaliate; it unleashed the first wave of its bombardment campaign shortly after an attack on a key bridge leading to annexed Crimea that it said was organised by Ukrainian military intelligence.\n“It’s a bigger image blow than a military one,” said Mr Oleh Zhdanov, a military analyst based in Kyiv.\n“It means there are no sites in western Russia that are out of Ukraine’s reach.”\nThe damage to the warplanes sparked renewed grumbling among Russia’s military bloggers, whose social media posts can provide a window into the mood in Russia on the course of the war unleashed by Russia’s invasion of Ukraine in February.\n“And I, a naive civilian fool, thought that planes were kept under concrete shelters during war.., no?“ wrote Russian military blogger Vladlen Tatarsky.\n“It turns out that small drones, the danger from which was so neglected, can attack strategic aircraft.”\n‘Asymmetrical response’\nAnalysts said it was unclear why Russia’s sophisticated air defences had failed to spot the threat and nullify it, if indeed Kyiv did use an old Tupolev reconnaissance drone.\n“It would be visible on radars: the question arises of how this drone could fly from Ukraine through Russian territory and not be visible to S-400 units and hit strategic bombers at a military site,” said Mr Oleksandr Musiyenko, another Kyiv analyst.\n“We could conclude that Russian air defences cannot guarantee the protection of their strategic aerodromes and that they effectively admit this,” he said.\nA senior Western official told Reuters that if Kyiv was behind the drone strikes, “it does show that they can operate in Russia at will, and that will deeply worry the Russians”.\nWestern officials said they were confident that it was at the Engels base that Russia kept its strategic long-range bombers, but that now it would have to think of moving them.\n“It may have the effect of pushing those bombers into dispersed locations,” the senior official said. “It certainly makes the Russians less confident... (that) anywhere is safe.”\nIt was not the first time Russia accused Ukraine of using such drones for attacks inside its borders.\nThe Defence Ministry in Moscow said Ukraine used Tupolev Tu-143 drones laden with explosives in July to conduct strikes in the southern Russian regions of Belgorod and Kursk that border on Ukraine.", "url": "https://www.straitstimes.com/world/europe/drone-strikes-deep-in-russia-seen-as-ukrainian-rebuff-to-missile-barrages"}