{"authors": [], "date_download": "2024-10-12 14:01:38", "date_modify": "2024-10-12 14:01:38", "date_publish": "2023-05-25 12:40:00", "description": "Seoul has reached a “confidential arrangement” with Washington, according to the Wall Street Journal. Read more at straitstimes.com.", "filename": "world_europe_artillery-rounds-from-south-korea-heading-to-ukraine-via-us_1728741698.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/25/10648122_1.jpg?VersionId=vxba7opXGTbNLToimn0.MhBUpNZijj1m", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_artillery-rounds-from-south-korea-heading-to-ukraine-via-us_1728741698.html", "title": "Artillery rounds from South Korea heading to Ukraine via US: Report", "title_page": "Artillery rounds from South Korea heading to Ukraine via US: Report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – Hundreds of thousands of South Korean artillery rounds are on their way to Ukraine via the United States after Seoul’s initial resistance towards arming Ukraine, the Wall Street Journal reported.\nThe Journal, citing unnamed sources, said Seoul reached a “confidential arrangement” with Washington to transfer the shells to the US to be delivered to Ukraine after Washington asked its Asian ally in 2022 for artillery support.\nMr Jeon Ha-kyu, a spokesman at South Korea’s Defence Ministry, said on Thursday the ministry has been in talks with the Pentagon on ammunition exports.\nHe said there were “inaccurate parts” in the Journal’s report, but declined to give details.\n“There have been various discussions and requests, and our government will take appropriate measures while comprehensively reviewing the war and humanitarian situation in Ukraine,” Mr Jeon said.\nA US ally and major producer of artillery ammunition, South Korea has so far ruled out sending lethal aid to Ukraine, citing business ties with Russia and Moscow’s influence over North Korea, despite mounting pressure from Washington and Europe to supply weapons.\nPresident Yoon Suk-yeol, in an interview with Reuters in April, signalled the prospect of a change, saying it might be difficult for Seoul to adhere to only providing humanitarian and financial support if Ukraine faces a large-scale civilian attack or a “situation the international community cannot condone”.\nWhen asked on Wednesday about the potential to supply ammunition to Ukraine, South Korea’s national security adviser Cho Tae-yong told Parliament that officials will make a decision after monitoring developments.\nMr Cho said there were no plans to send shells either directly or via Poland, but did not elaborate on cooperation with the US.", "url": "https://www.straitstimes.com/world/europe/artillery-rounds-from-south-korea-heading-to-ukraine-via-us"}