{"authors": [], "date_download": "2024-10-12 14:05:07", "date_modify": "2024-10-12 14:05:07", "date_publish": "2023-05-21 21:45:00", "description": "Russia used to be a member of the G-7, until Moscow's annexation of Ukraine’s Crimea region in 2014. Read more at straitstimes.com.", "filename": "world_russia-calls-g-7-summit-incubator-for-anti-russian-and-anti-chinese-hysteria_1728741907.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/21/10643212_1.jpg?VersionId=anD64BcLLuR0zbqQeYCAK9gJIgEJFNt_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_russia-calls-g-7-summit-incubator-for-anti-russian-and-anti-chinese-hysteria_1728741907.html", "title": "Moscow calls G-7 summit incubator for anti-Russian and anti-Chinese ‘hysteria’", "title_page": "Moscow calls G-7 summit incubator for anti-Russian and anti-Chinese ‘hysteria’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russia’s Foreign Ministry on Sunday dismissed the Group of Seven (G-7) summit in Japan’s Hiroshima as a “politicised” event that it said had pumped out anti-Russian and anti-Chinese statements, and accused the forum of undermining global stability.\nMoscow lashed out after leaders of the world’s richest democracies said they would not back down from supporting Ukraine, in a warning to Russian President Vladimir Putin as he claimed to have taken the eastern city of Bakhmut, which Kyiv denied.\nIn a statement posted on Telegram, the Russian Foreign Ministry said the G-7 had “irreversibly deteriorated” and that the forum had become “an ‘incubator’ where, under the leadership of the Anglo-Saxons, destructive initiatives that undermine global stability are prepared”.\n“The leaders of the G-7 brought to their meeting the ringleader of the Kyiv regime they control and turned the Hiroshima event into a propaganda show,” the Russian Foreign Ministry said.\nThe summit’s “main conclusion was a bunch of announcements filled with hateful anti-Russian and also anti-Chinese messages”.\nThe West’s decline in global influence “is forcing the members of this body to put all their efforts into whipping up anti-Russian and anti-Chinese hysteria”, the statement said.\n“We are certain that our evaluation of the G-7 and its destructive actions is shared by the majority of the international community,” it added.\nRussia used to be a member of the G-7 club of industrialised democracies, which was previously known as the G-8, until Moscow was excluded after its annexation of Ukraine’s Crimea region in 2014.\nUkrainian President Volodymyr Zelensky was present at the Hiroshima summit as a guest, an opportunity he used to encourage member nations to maintain arms supplies and diplomatic support for Kyiv amid its war with Russia, something Moscow still calls “a special military operation”.\nThe summit gave Mr Zelensky a chance to lobby for support from other attendees, such as Indian Prime Minister Narendra Modi and Brazilian President Luiz Inacio Lula da Silva, who have remained uncommitted.\nThe Russian Foreign Ministry, in the same statement, also accused the G-7 of “flirting” with non-Western states in an effort to stymie the development of their ties with Moscow and Beijing.\nIt said it was convinced, though, that the forum was incapable of reflecting the interests of the Asia-Pacific region, South Asia, the Middle East, Africa or Latin America. REUTERS", "url": "https://www.straitstimes.com/world/russia-calls-g-7-summit-incubator-for-anti-russian-and-anti-chinese-hysteria"}