{"authors": ["Nirmal Ghosh"], "date_download": "2024-10-12 13:45:17", "date_modify": "2024-10-12 13:45:17", "date_publish": "2023-11-24 05:00:00", "description": "India's partnership with the US, while deepening, has limits, say analysts on this week’s Asian Insider podcast.  Read more at straitstimes.com.", "filename": "world_united-states_india-us-partnership-deepens-but-limits-remain_1728740717.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/24/Biden20Modi.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_india-us-partnership-deepens-but-limits-remain_1728740717.html", "title": "India, US partnership deepens, but limits remain", "title_page": "India, US partnership deepens, but limits remain | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – With India wielding more influence in a multipolar world, its foreign policy is much discussed in Washington, especially after Indian Prime Minister Narendra Modi’s state visit in June – a high honour for a foreign leader.\nWhile India is happy to work with the United States to counterbalance China, it will always act in its own national interest – and not take sides in foreign conflicts. Thus its partnership with the US, while deepening, has its limits, noted analysts on this week’s Asian Insider podcast.\nIndia’s support for Israel is a recent example of how New Delhi nuances its positions in areas where it has interests. It does not necessarily follow the US’ lead.\nIn October, India joined 44 other countries in abstaining from a United Nations General Assembly resolution calling for a humanitarian ceasefire in Gaza, as it did not contain any condemnation of Hamas’ Oct 7 attack on Israel. The US was one of only 14 countries that opposed the resolution, citing the same reason.\nLess than two weeks later, India was among 145 countries that voted for a UN resolution that condemned Israeli settlements in the West Bank. In contrast, the US was among seven that voted against it.\nIndia’s foreign policy has been remarkably consistent, said Dr Aparna Pande, author of two books on Indian foreign policy and director of the Initiative on the Future Of India and South Asia at the conservative Hudson Institute.\nIndia does not take sides in any conflict, but instead advocates peaceful negotiations, she said.\nEven as India condemns terrorism, its support for a two-state solution to the Israeli-Palestinian conflict and the Palestinian cause remains. “There’s a nuance there,” she said.\nThe four-nation Quad (Quadrilateral Security Dialogue) is another example of India’s nuanced foreign policy.\nIndia is the only country that is not a formal security ally of the other Quad members – Australia, Japan and the US – but is nevertheless part of a group that is key to the Americans’ strategy to counter China.\nIndia, which will chair the group and host its annual summit in 2024, is at the heart of the US-led Indo-Pacific strategy.\nYet notwithstanding its alignment with the US, New Delhi also participates in non-Western groupings that include both Russia and China.\nOne example is Brics, made up originally of Brazil, Russia, India, China and South Africa. At its August summit in South Africa, the group invited Argentina, Egypt, Ethiopia, Iran, Saudi Arabia and the United Arab Emirates to become full members.\nSuch arrangements show a desire by Indian leaders to ensure that their country is not viewed as a follower of the West, Dr Pande wrote in November in the journal GIS.\nIndia’s Minister for External Affairs, Dr S. Jaishankar, elaborated on this point in September during a talk at the Council on Foreign Relations in Washington. “A country of the scale and complexity of India has to often assess its situation and dig into its own experiences and DNA to come up... (with)... an independent pathway,” he said.\nDr Satu Limaye, vice-president of the East West Centre, an education and research organisation, said New Delhi would welcome the US playing a greater role in the Indian Ocean. Indian strategists and officials have growing concerns about when China will have a carrier strike group or other large capabilities in the region, he added.\n“This is quite a change from an earlier era when the US was not particularly welcome in the Indian Ocean,” said Dr Limaye, speaking alongside Dr Pande on this week’s Asian Insider podcast.\nThere remains, however, a fundamental difference between Indian and American views of the world, he noted.\n“The US believes that it should be the pre-eminent power in the world, sometimes framed as leadership... but India sees a world evolving towards multipolarity, in which its role naturally and properly constitutes one pole.”\nDr Pande noted that India has an interest in the Middle East as well as the Indian Ocean.\nThere are nine million Indian citizens in the Gulf states, and India has had to evacuate some from conflicts. About one-third of India’s remittances, and about 50 per cent of India’s oil and gas, come from the Gulf and the Middle East.\nWith sea lanes critical to India’s trade, the Indian Ocean matters more than the Pacific to New Delhi.\nDr Limaye said there is a “very compelling need for India and the United States to work together”. Their partnership would be mostly focused on technology, with defence, security and politics being other areas of cooperation.\nWith the Global South distrustful of the Global North, “it’s useful for the US to have partners who, frankly, think well of the US”, he added.", "url": "https://www.straitstimes.com/world/united-states/india-us-partnership-deepens-but-limits-remain"}