{"authors": [], "date_download": "2024-10-12 14:05:16", "date_modify": "2024-10-12 14:05:16", "date_publish": "2022-05-27 22:41:31", "description": "\"If our country does not halt the military operation, then there will be even more orphans in our country,\" said a lawmaker. Read more at straitstimes.com.", "filename": "world_europe_russian-lawmakers-in-hot-water-for-urging-putin-to-end-ukraine-conflict_1728741916.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/27/ads-russiantroops-27052022.jpg?VersionId=DwInE4W_0aS4La8O33OrJkAyT6mYydUF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russian-lawmakers-in-hot-water-for-urging-putin-to-end-ukraine-conflict_1728741916.html", "title": "Russian lawmakers in hot water for urging Putin to end Ukraine conflict", "title_page": "Russian lawmakers in hot water for urging Putin to end Ukraine conflict | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW (AFP) - Two Communist lawmakers in Russia's Far East on Friday (May 27) urged President Vladimir Putin to put an end to Moscow's offensive in Ukraine in a rare public show of dissent.\nDespite thousands of people having been killed and wounded during Russia's three-month military campaign in Ukraine, Mr Putin has largely enjoyed the public loyalty of the country's political parties and government officials.\nBut a meeting of the legislative assembly of the Primorsky Krai region caused an uproar on Friday when a local lawmaker and member of the Communist faction in the legislature read out a statement urging the Kremlin chief to pull out Russian troops.\n\"If our country does not halt the military operation, then there will be even more orphans in our country,\" lawmaker Leonid Vasyukevich read from the statement, according to a video of the meeting.\n\"During a military operation, people become disabled. These are young people who could be of great use to our country,\" he added.\n\"We demand an immediate withdrawal of the Russian troops.\"\nAs he read the appeal, several lawmakers and the governor of the region, Oleg Kozhemyako, tried to silence him.\nMr Kozhemyako accused Mr Vasyukevich of \"tarnishing\" the reputation of the Russian army and called him a \"traitor\".\nMr Vasyukevich said the statement had been signed by four Communist lawmakers but two of those deputies disavowed the appeal at the meeting.\nA majority of lawmakers present at the meeting then voted to strip Mr Vasyukevich and Mr Gennady Shulga, another lawmaker backing the appeal, of the right to speak at Friday's session.\nThe head of the local Communist faction, Anatoly Dolgachev, said the move had not been agreed with the party and promised to take \"the toughest measures\".\nThe veteran leader of the Communist Party, Gennady Zyuganov, has publicly supported Mr Putin over Ukraine.\nRussian artists, media figures and several business tycoons have spoken out against the Kremlin's offensive in Ukraine that has led to a barrage of unprecedented Western sanctions against Moscow.\nBut after three months of the hostilities, there has been no apparent outbreak of dissent from within Mr Putin's inner circle or top officials.\nRussia has adopted legislation that could see people imprisoned for up to 15 years for discrediting the Russian military.", "url": "https://www.straitstimes.com/world/europe/russian-lawmakers-in-hot-water-for-urging-putin-to-end-ukraine-conflict"}