{"authors": [], "date_download": "2024-10-12 14:00:43", "date_modify": "2024-10-12 14:00:43", "date_publish": "2024-04-23 23:32:20", "description": "It will include Himars missiles, artillery ammunition and Javelin anti-tank munitions, among others. Read more at straitstimes.com.", "filename": "world_us-preparing-1-billion-weapons-package-for-ukraine-officials-say_1728741643.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/24/GLOBALMILITARYSPENDING.JPG?VersionId=I7Dhq3TVuvkj1rxQ4JoQe8e83_t96vqk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_us-preparing-1-billion-weapons-package-for-ukraine-officials-say_1728741643.html", "title": "US preparing $1.36b weapons package for Ukraine, say officials", "title_page": "US preparing $1.36b weapons package for Ukraine, say officials | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – The US is preparing a US$1 billion (S$1.36 billion) military aid package for Ukraine, the first to be sourced from the yet to be signed Ukraine-Israel Bill, two US officials told Reuters on April 23.\nThe aid package includes vehicles, Stinger air defence munitions, additional ammunition for high-mobility artillery rocket systems, 155mm artillery ammunition, TOW and Javelin anti-tank munitions and other weapons that can immediately be put to use on the battlefield, the officials said, speaking on condition of anonymity.\nPresident Joe Biden had asked the US Congress to provide US$60.8 billion in aid to Ukraine, but the initiative stalled when Republicans in the House of Representatives refused to move the measure forward for months.\nOn April 23, the Senate was expected to vote on four Bills now passed by the House. One Bill for Ukraine, a second with US$26 billion for Israel, a third with US$8.12 billion “to counter communist China” in the Indo-Pacific and a fourth that includes a potential ban on the social media app TikTok.\nThe Ukraine Bill also calls for the transfer of Army Tactical Missile Systems with a range of up to 300km, which Kyiv has pledged not to use inside Russia’s territory.\nRussia has increased its long-range bombardment of Ukraine’s energy infrastructure and its cities in recent weeks, ratcheting up the pressure on Kyiv as Moscow’s more numerous and better equipped forces slowly advance on the battlefield in the east.\nOnce the Ukraine Bill is signed, funds to replenish stocks would rebound, alleviating Pentagon concerns that the use of Presidential Drawdown Authority (PDA) to aid Ukraine would compromise US military preparedness.\nTens of billions of dollars in the Bill was earmarked to buy replacements for weapons sent to Ukraine along with transportation and administrative overhead.\nThe Bill gives Mr Biden US$8 billion worth of further PDA. This added to the US$3.9 billion remaining from previously authorised PDA means Mr Biden can transfer US$11.9 billion worth of excess weapons from US stocks without congressional approval in response to an emergency.", "url": "https://www.straitstimes.com/world/us-preparing-1-billion-weapons-package-for-ukraine-officials-say"}