{"authors": [], "date_download": "2024-10-12 13:59:05", "date_modify": "2024-10-12 13:59:05", "date_publish": "2023-12-29 19:52:52", "description": "Nigerian Catholic couple Jane and Lucy have little hope their local parish church will bless their same-sex union anytime soon, as conservative priests across Africa choose to ignore a landmark Vatican ruling allowing such blessings. Read more at straitstimes.com.", "filename": "world_in-nigeria-and-much-of-africa-catholic-same-sex-couples-see-no-blessings-soon_1728741545.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/29/LYNXMPEJBS08I-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_in-nigeria-and-much-of-africa-catholic-same-sex-couples-see-no-blessings-soon_1728741545.html", "title": "In Nigeria and much of Africa, Catholic same-sex couples see no blessings soon", "title_page": "In Nigeria and much of Africa, Catholic same-sex couples see no blessings soon | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ABUJA - Nigerian Catholic couple Jane and Lucy have little hope their local parish church will bless their same-sex union anytime soon, as conservative priests across Africa choose to ignore a landmark Vatican ruling allowing such blessings.\nConservative Catholics have condemned the Vatican's declaration two weeks ago, which was approved by Pope Francis, that will allow blessings for same-sex couples, as long as they are not part of the regular Church rituals or liturgies.\nThe pope has hit back against the criticism and what he called inflexible ideological positions that hinder the Church from moving forward.\nBut in many African countries, such as the continent's most populous one, Nigeria, even having a same-sex relationship is outlawed and often punishable by long jail terms.\nLittle wonder that 39-year-old Jane, who has been living with her partner for six years, does not feel the Vatican's declaration will change much.\n\"Maybe in the next 20 years (or) next 30 years but right now it will be difficult for them (Bishops) to just accept this,\" Jane told Reuters inside her room in north central Benue state.\nIn the Anglican church, the issue has caused deep divisions for more than two decades, most recently following Archbishop of Canterbury Justin Welby's proposal earlier this year to allow priests to bless same-sex unions, bringing the faith close to splitting point.\nThe Catholic Church has so far sought to avoid the impression of conflict.\nCatholic bishops from Angola, Kenya, Nigeria, Malawi to Sao Tome and Principe, Uganda and Zimbabwe are among clerics who have said they will not bless same-sex couples, but have argued that the Pope's decree can be interpreted as optional.\nFather Patrick Alumunku of St Louis Catholic Church Mbora parish in the capital Abuja said the Vatican declaration was unsettling for many followers but should be viewed as a move towards inclusiveness for all God's children.\nHe denied that this was an incremental step to eventually accept same-sex unions in the church.\n\"There are laws that have been made by God and by the church in 2000 years which cannot change,\" said Alumunku.\nFor activist and poultry farmer Jane, the fact that the issue is being discussed openly is reason enough to consider eventually approaching her priest for a blessing, if her partner agrees.\n\"I think he (Pope Francis) tried to understand the feelings of people who tend to be born different or people who basically are now becoming like the outcasts of this society,\" she said.\n\"We are getting there, a moment of self expression and acceptance is coming.\" REUTERS", "url": "https://www.straitstimes.com/world/in-nigeria-and-much-of-africa-catholic-same-sex-couples-see-no-blessings-soon"}