{"authors": [], "date_download": "2024-10-12 14:03:02", "date_modify": "2024-10-12 14:03:02", "date_publish": "2023-05-03 12:45:00", "description": "A standoff in the House is threatening to push Washington to the brink of a crisis. Read more at straitstimes.com.", "filename": "world_united-states_what-you-need-to-know-about-the-us-debt-ceiling_1728741782.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/03/2023-03-15T204033Z432198657RC285Y9BUP1TRTRMADP3GLOBAL-BANKS-SVB-POLL_2.JPG?VersionId=tcA8YslaBf4wmD08ur0MSyr2cT6yu41D", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_what-you-need-to-know-about-the-us-debt-ceiling_1728741782.html", "title": "What you need to know about the US debt ceiling", "title_page": "What you need to know about the US debt ceiling | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - A stand-off between President Joe Biden’s Democrats and the Republican majority in the United States House of Representatives over the debt ceiling is threatening to push Washington to the brink of an economic crisis.\nWhat is the debt ceiling?\nWashington regularly sets a limit on federal borrowing.\nCurrently, the ceiling is set at US$31.4 trillion (S$42 trillion), equal to roughly 120 per cent of the country’s annual economic output.\nThe debt reached that ceiling in January and the Treasury Department has kept obligations just within the limit by suspending investments in some federal pension funds while continuing to borrow from investors.\nBy July or August, Washington could have to stop borrowing altogether and rely solely on tax receipts to pay its bills. Because the Treasury borrows close to 20 cents for every dollar it spends, Washington at that point would start missing payments owed to lenders, citizens or both.\nIs the debt ceiling good for anything?\nFew countries in the world have debt ceiling laws and Washington’s periodic lifting of the borrowing limit merely allows it to pay for spending Congress has already authorised.\nTreasury Secretary Janet Yellen and other policy experts have called on Washington to eliminate the limit because it amounts to a bureaucratic stamp on decisions already made.\nSome analysts proposed that the Treasury can bypass the crisis by minting a multi-trillion-dollar platinum coin and putting it in the government’s account, an idea seen as an outlandish gimmick. Others argue the debt ceiling itself violates the US Constitution. But if the Biden administration invoked that argument, which involves the 14th Amendment, a legal challenge would follow.\nThe debt ceiling is supported by Democratic and Republican lawmakers alike and both have used it as leverage when their party does not control the White House. That makes it unlikely to be eliminated any time soon.\nWhat happens when Washington can no longer borrow money?\nShockwaves would ripple through global financial markets as investors question the value of US bonds, which are seen as among the safest investments and serve as building blocks for the world’s financial system.\nThe US economy would almost certainly fall into recession if the government was forced to miss payments on things like soldiers’ salaries or Social Security benefits for the elderly. Economists expect that millions of Americans would lose their jobs. Already, investors are shunning some US debt securities that come due in July and August as they try to avoid bills maturing when the risk of a debt default is highest.\nHow did things get to this point?\nRepublicans, who hold a narrow 222-213 majority in the House of Representatives, in late April passed a Bill that would raise the debt limit but also set in place sweeping spending cuts over the next decade.\nThe Bill has no chance of approval in the Democratic-controlled US Senate. House Speaker Kevin McCarthy hopes to lure Mr Biden into negotiations on spending cuts even as the White House insists on a debt limit increase with no strings attached.\nHasn’t this happened before?\nThis kind of brinkmanship has been part of US politics for decades but worsened significantly after fiscal hawks in the Republican Party grew in power since 2010.\nIn a 2011 showdown, House Republicans successfully used the debt ceiling to extract sharp limits on discretionary spending from then Democratic President Barack Obama.\nSpending caps stayed in place for most of the rest of the decade, but the episode rattled investors and led to a historic downgrade of the US credit rating. REUTERS", "url": "https://www.straitstimes.com/world/united-states/what-you-need-to-know-about-the-us-debt-ceiling"}