{"authors": [], "date_download": "2024-10-12 13:34:09", "date_modify": "2024-10-12 13:34:09", "date_publish": "2024-09-23 05:23:05", "description": "The meeting is expected to take place on the sidelines of the UN General Assembly in New York. Read more at straitstimes.com.", "filename": "world_biden-expected-to-meet-vietnamese-president-on-wednesday-source-says_1728740049.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/23/LYNXMPEK8L0AL-1.jpg?VersionId=SnkRC6YzYti2wsfranYFJ_uVXbDNgVSL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_biden-expected-to-meet-vietnamese-president-on-wednesday-source-says_1728740049.html", "title": "Biden expected to meet Vietnamese President on Sept 25, source says", "title_page": "Biden expected to meet Vietnamese President on Sept 25, source says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – US President Joe Biden is expected to meet Vietnam’s President and ruling Communist Party chief To Lam on Sept 25, a person familiar with the matter told Reuters.\nThe meeting is expected to take place on the sidelines of the United Nations General Assembly in New York.\nThe White House had no immediate comment. A Vietnamese Foreign Ministry spokesperson previously had not said whether Mr Lam would meet Mr Biden during the trip.\nMr Biden has been eager to deepen relations with the strategic South-east Asian country and manufacturing hub in a bid to counter Russia and China, with which Vietnam also retains ties.\nIn September 2023, Mr Biden visited Vietnam and secured deals on semiconductors and minerals and an upgrade to Hanoi’s highest diplomatic status, alongside China and Russia.\nIn his first trip to the United States since he was named in early August as head of the party, the country’s most powerful job, Mr Lam will speak at the UN event and meet representatives from several US corporations, including Alphabet’s Google and Facebook owner Meta, Reuters previously reported.\nMr Lam’s trip also includes a stop in Cuba, Vietnam’s long-term communist partner. REUTERS", "url": "https://www.straitstimes.com/world/biden-expected-to-meet-vietnamese-president-on-wednesday-source-says"}