{"authors": [], "date_download": "2024-10-12 13:50:15", "date_modify": "2024-10-12 13:50:15", "date_publish": "2023-12-01 15:57:00", "description": "The launch of the global fund gave COP28 a 'running start', nations most vulnerable to the impact of warming say the work is far from over. Read more at straitstimes.com.", "filename": "world_middle-east_early-pledges-to-loss-and-damage-fund-build-shaky-trust-at-cop28_1728741015.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/01/2023-11-30T144910Z398161382RC2VI4AFUWIJRTRMADP3CLIMATE-UN-DISASTER-INSURANCE-ANALYSIS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_early-pledges-to-loss-and-damage-fund-build-shaky-trust-at-cop28_1728741015.html", "title": "Early pledges to 'loss and damage' fund build shaky trust at COP28", "title_page": "Early pledges to 'loss and damage' fund build shaky trust at COP28 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI/BARCELONA - The launch of a long-awaited global fund to deal with growing loss and damage from wilder weather and rising seas, at Thursday’s opening of the COP28 climate summit in Dubai, gave the annual talks a “running start”, UN climate chief Simon Stiell said.\nBut the initial euphoria greeting its birth - met with smiles and a standing ovation by negotiators - got a tempered response from vulnerable nations on the frontlines of global warming and activists who said the work is far from over.\n“We cannot rest until this fund is adequately financed and starts to actually alleviate the burden of vulnerable communities,” said 39 countries making up the Alliance of Small Island Nations (Aosis) in a statement after the approval.\nThose countries, which include Mr Stiell’s native Grenada, are bearing a heavier burden as encroaching oceans eat away low-lying land and fiercer storms wipe out large chunks of their economies.\nSome of those living in island nations face having to relocate to higher ground or leaving their homelands entirely, with Australia recently agreeing to allow up to 280 Tuvaluans to migrate there annually under a special visa programme in response to climate change.\n“Success starts when the international community can properly support the victims of this climate crisis with efficient, direct access to the finance they urgently need,” the Aosis statement added.\nWhile more pledges are expected to be made to the new fund during the two-week COP28, the opening session garnered enough money to officially put it into operation, with a US$100-million contribution from the UAE matched with the same from Germany.\nBritain gave just over US$50 million, while the United States offered US$17.5 million and Japan US$10 million.\nThe European Union and its member states later confirmed a further US$145 million, bringing the total to more than US$420 million so far.\nTrust restored?\nMr Ani Dasgupta, president of the World Resources Institute, a US think-tank, said the donations represent “a dramatic turn of events compared to just two years ago when it wasn’t certain if developed countries could ever be convinced to back a loss and damage fund”.\n“While inadequate to the scale of what is needed, these early contributions will play a critical role in restoring trust between developed and developing countries as the UN climate talks get underway,” he added.\nThe issue of loss and damage has been hotly debated at successive UN climate conferences. For many years, wealthy nations rejected demands to pay compensation for the impacts of their high historical share of planet-heating emissions - a stance reiterated by US climate envoy John Kerry on Thursday.\nBut last year at COP27, after three decades of pushing, developing countries and small island nations won agreement on the new fund that will pay to repair devastated property, relocate threatened communities or preserve cultural heritage before it vanishes.\nThe details of where the money will come from and go to, and how the fund will be managed, were left to be worked out by the current COP28 conference in Dubai.\nAfter much wrangling over where the fund will be housed, a compromise was reached in early November. Developed countries pushed poorer nations into accepting the World Bank as its host for an initial period of up to four years, although the fund will have an independent board.\nNew or recycled cash?\nAfter the fund was launched in Dubai, developing countries from the Democratic Republic of Congo to Iran and Vanuatu echoed the call for more contributions to the fund and demands for easy access to its coffers for vulnerable countries and communities.\nMany aid specialists also warned rich nations against taking their contributions to the new fund from budgets that would otherwise be used to pay for emergency relief in disasters or development programmes like health or education.\nMr Ian Mitchell, a senior policy fellow at the Centre for Global Development, described Thursday’s loss and damage pledges as “tokenistic”.\n“If they’re not additional (to aid), then they may actually be damaging for climate resilience and development,” he said.\nOther proposals are under discussion for non-government sources of finance that could expand resources for the loss and damage fund, including global taxes on fossil fuels, aviation, shipping and financial trading.\n“If there was a new source of revenue for the loss and damage fund then that would be a major breakthrough for climate and development in a way that these incremental amounts are not,” Mr Mitchell said. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/early-pledges-to-loss-and-damage-fund-build-shaky-trust-at-cop28"}