{"authors": [], "date_download": "2024-10-12 14:06:23", "date_modify": "2024-10-12 14:06:23", "date_publish": "2022-09-22 15:18:16", "description": "Restrictive measures, both ‘personal and sectoral’, are on the table, ministers say. Read more at straitstimes.com.", "filename": "world_europe_g-7-condemns-russias-escalatory-steps-plans-new-sanctions_1728741983.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/22/ads-donbas-220922.jpg?VersionId=0TgBBONN4F0TTpe3mKBCsym1w2lL81h1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_g-7-condemns-russias-escalatory-steps-plans-new-sanctions_1728741983.html", "title": "G-7 condemns Russia's 'escalatory steps', plans new sanctions", "title_page": "G-7 condemns Russia's 'escalatory steps', plans new sanctions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Foreign ministers from the Group of Seven (G-7) - the world's largest developed economies - have said they will pursue further sanctions against Russia, following President Vladimir Putin's move to mobilise reservists for the war in Ukraine.\nIn a statement, they said they \"deplored deliberate Russian escalatory steps, including the partial mobilisation of reservists and irresponsible nuclear rhetoric\".\nThe G-7 will \"pursue further targeted sanctions and are committed to sustained economic and political pressure on Russia\", they said after a meeting on the fringes of the United Nations General Assembly.\n\"We will study, we will adopt, new restrictive measures, both personal and sectoral,\" EU foreign policy chief Josep Borrell, who attended the meeting, told reporters earlier Wednesday after a meeting with his European colleagues.\nThe G-7 ministers from Canada, the United States, France, Germany, Italy, Japan and Britain, as well as the European Union's top diplomat, also condemned a plan to hold \"sham referenda on sovereign Ukrainian territory\" in the occupied Donbas.\nThe voting \"cannot be free or fair\" while Russian forces are present, they added.\nThe ministers repeated a pledge made at the beginning of September to \"finalise preparations\" for the implementation of a price cap on Russian oil.", "url": "https://www.straitstimes.com/world/europe/g-7-condemns-russias-escalatory-steps-plans-new-sanctions"}