{"authors": [], "date_download": "2024-10-12 14:06:24", "date_modify": "2024-10-12 14:06:24", "date_publish": "2022-10-11 19:06:26", "description": "Moscow will also not turn down a chance to set up a Biden-Putin meeting, he says. Read more at straitstimes.com.", "filename": "world_europe_top-diplomat-says-russia-open-to-talks-with-west-awaiting-serious-proposal_1728741984.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/11/sv_Lavrov_111022.jpg?VersionId=nql5eHOobq4.Zxrc9QEjESgHxFAkxnSO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_top-diplomat-says-russia-open-to-talks-with-west-awaiting-serious-proposal_1728741984.html", "title": "Top diplomat says Russia open to talks with West, awaiting serious proposal", "title_page": "Top diplomat says Russia open to talks with West, awaiting serious proposal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Russian Foreign Minister Sergei Lavrov said on Tuesday Moscow is open to talks with the West on the Ukraine war, but that it has yet to receive any serious proposal to negotiate.\nIn an interview on state TV, Mr Lavrov said officials, including White House national security spokesman John Kirby, have said the United States is open to talks but that Russia has refused.\n\"This is a lie,\" he said. \"We have not received any serious offers to make contact.\"\nHe also said Russia will not turn down a meeting between President Vladimir Putin and US President Joe Biden at a forthcoming Group of 20 meeting and will consider a proposal if it receives one.\n\"We have repeatedly said that we never refuse meetings. If there is a proposal, then we will consider it,\" He said.\nCommenting on the possibility that Turkey could host talks between Russia and the West, Mr Lavrov said Moscow would be willing to listen to any suggestions but could not say in advance whether this would lead to results.\nHe said Turkish President Tayyip Erdogan would have an opportunity to put proposals to Mr Putin when both visit Kazakhstan this week.", "url": "https://www.straitstimes.com/world/europe/top-diplomat-says-russia-open-to-talks-with-west-awaiting-serious-proposal"}