{"authors": [], "date_download": "2024-10-12 13:44:40", "date_modify": "2024-10-12 13:44:40", "date_publish": "2024-08-18 10:50:00", "description": "Paintings by Van Gogh and Monet were unaffected in the Aug 17 blaze. Read more at straitstimes.com.", "filename": "world_europe_fire-contained-at-historic-london-arts-centre_1728740680.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/18/11553339.jpg?VersionId=3zLhLhPBpoNQMAA1N6Ti4Q2GR8klD5pO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_fire-contained-at-historic-london-arts-centre_1728740680.html", "title": "Fire contained at historic London arts centre housing priceless artworks", "title_page": "Fire contained at historic London arts centre housing priceless artworks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Priceless artworks housed in London’s Somerset House, including paintings by van Gogh and Monet, were unaffected by a fire that erupted at the historic building on Aug 17, according to the gallery.\nAround 125 firefighters and 20 fire engines worked to tamp out the flames that ripped through the roof of the western wing, bringing the blaze at the more than 450-year-old site under control before 7pm local time (2am Singapore time).\n“The fire at #SomersetHouse is now under control and investigations into the cause will begin,” the London Fire Brigade posted on social media site X.\nThe neoclassical cultural complex stretching along the Thames River was scheduled to host a breakdancing competition on Aug 17 when a column of smoke began wafting above the centre, prompting dozens of calls to the fire department.\n“The fire was located in part of the building’s roof space,” London Fire Brigade’s assistant commissioner Keeley Foster told reporters outside the landmark, according to a statement.\n“The age and design of the building proved a challenge for crews as they initially responded.”\nThere were no reports of injuries as staff and visitors had left the building by the time fire crews arrived, the brigade added.\nSomerset House, home to Queen Elizabeth I before she was crowned in 1558 and to Anne of Denmark, said in a notice on its website that it “will remain closed until further notice”.\nThe landmark cultural complex in the heart of London hosts a range of creative businesses and arts spaces, including the Courtauld Gallery, which counts Vincent van Gogh’s Self-Portrait With Bandaged Ear among the masterpieces in its collection.\nThe Somerset House statement said: “The Courtauld Gallery has not been directly impacted by the fire and it will remain open.”\nFootage taken from central London showed thick plumes of smoke rising above the building, which stretches for around 180m along the banks of the River Thames.\nThe courtyard of the grand building hosts music gigs in the summer and a popular ice rink in the winter, appearing in the 2003 film Love Actually.", "url": "https://www.straitstimes.com/world/europe/fire-contained-at-historic-london-arts-centre"}