{"authors": [], "date_download": "2024-10-12 14:16:23", "date_modify": "2024-10-12 14:16:23", "date_publish": "2022-03-13 13:58:13", "description": "Britain says the attack, 25km from the Polish border, marks a significant escalation of the conflict. Read more at straitstimes.com.", "filename": "world_europe_air-strike-launched-on-ukraine-military-base-near-polish-border-lviv-authorities_1728742583.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/13/nf-airstrike-130322.jpg?VersionId=t2BSLhNkpDJZ1gCba.Vq3LxOJzm6VLf8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_air-strike-launched-on-ukraine-military-base-near-polish-border-lviv-authorities_1728742583.html", "title": "Russia strikes military base near Polish border as it steps up its offensive, says Ukraine", "title_page": "Russia strikes military base near Polish border as it steps up its offensive, says Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LVIV, UKRAINE (REUTERS) - A Russian air strike on a large Ukrainian military facility near the border with Nato member Poland on Sunday killed 35 people and wounded 134, a local Ukrainian official said, as other officials reported intense Russian attacks around the country.\nBritain said the incident, just 25km from the Polish border, marked a significant escalation of the conflict. United States President Joe Biden has said that Nato, or the North Atlantic Treaty Organisation, would defend every inch of its territory if Russia’s invasion of Ukraine spills over into member states of the Western defence alliance.\nUkraine said foreign military instructors have previously worked at the Yavoriv International Centre for Peacekeeping and Security, but a Nato official said there were no personnel from the alliance there. It was not immediately clear whether any non-Nato states might have representatives there.\nRegional governor Maksym Kozytskyy said Russian planes fired around 30 rockets at the facility, adding that some were intercepted before they hit. At least 35 people were killed and 134 wounded, he said. Reuters was not able to verify his statement.\nThe 360 sq km facility is one of Ukraine’s biggest and the largest in the western part of the country.\nThe Kremlin did not immediately reply to a request for comment on the reported missile strike so close to the border with Nato, and a short video briefing by Russia’s Defence Ministry spokesman on Sunday (March 13) made no mention of such an attack.\nNineteen ambulances with sirens on were seen by Reuters driving from the direction of the Yaroviv facility after the reported strike and black smoke rose from the area.\n“Russia has attacked the International Centre for Peacekeeping & Security near Lviv. Foreign instructors work here. Information about the victims is being clarified,” Ukrainian Defence Minister Oleksii Reznikov said in an online post.\n'Violent and inhuman'\nA Ukrainian Defence Ministry representative told Reuters the ministry was still trying to establish if any foreign instructors were at the centre at the time of the attack.\nUkraine, whose aspirations to join Nato are a major irritant to Russian President Vladimir Putin, held most of its drills with countries in the Western defence alliance at the base before the invasion. The last major exercises were in September.\nIn the weeks before Russia invaded on Feb 24, the Ukrainian military trained there, but according to Ukrainian media, all foreign instructors left the training ground in mid-February, while leaving all the equipment.\nRussia’s invasion of Ukraine, launched by Mr Putin on Feb 24, has sent more than 2.5 million people fleeing across borders and trapped hundreds of thousands in besieged cities.\n“It is terrifying how violent and inhuman it is,” Olga, a refugee from Kyiv, told Reuters after crossing the border into Romania.\nUkraine reported renewed air strikes on an airport in the west, heavy shelling on Chernihiv north-east of the capital Kyiv and attacks on the southern town of Mykolayiv, where officials said nine people were killed.\nUkraine’s human rights monitor said Russia used phosphorous bombs in an overnight attack on the town of Popasna in the eastern Luhansk region, calling it a war crime. She shared a photograph purporting to show the alleged attack, but did not say if Ukraine had concrete evidence. Reuters could not immediately verify any of the reports.\nWhile Western nations have sought to isolate Mr Putin by imposing harsh sanctions, the US and its allies are concerned to avoid Nato being drawn into the conflict.\nAsked how much of an escalation the attack was, British Cabinet Minister Michael Gove told a BBC interviewer: “It is significant.”\nMr Putin was pushing the boundaries in military terms, he said.\nAirport hit in west\nThe mayor of Ivano-Frankivsk, another city in western Ukraine, said Russian troops also continued to hit its airport, with no initial reports of casualties.\nIn eastern Ukraine, Russian troops were trying to surround Ukrainian forces as they advance from the port of Mariupol in the south and the second city Kharkiv in the north, the British Defence Ministry said.\nKharkiv has suffered some of the heaviest bombardment.\nVideos from one resident, Mr Teimur Aliev, who is helping to bring aid to residents, show bombed buildings lining streets, burnt-out cars riddled with shrapnel holes and debris strewn around.\n“We will stitch up the wounds and the pain of our country and our city. We are ready to build it and we are ready to renew it when the war is over. We’re not going anywhere,” Mr Aliev, a 23-year-old musician, said of his food distribution network, which now has dozens of volunteers.\nBritish intelligence also said Russian forces advancing from Crimea, which Russia annexed from Ukraine in 2014, were trying to circumvent Mykolayiv as they look to drive west towards Odesa.\nAir raid sirens again woke residents in Kyiv on Sunday morning, while in Chernihiv, around 150km north-east, firefighters rescued residents from a burning building after heavy shelling, video from Ukraine’s emergency service, and verified by Reuters, showed.", "url": "https://www.straitstimes.com/world/europe/air-strike-launched-on-ukraine-military-base-near-polish-border-lviv-authorities"}