{"authors": [], "date_download": "2024-10-12 13:43:30", "date_modify": "2024-10-12 13:43:30", "date_publish": "2024-07-20 01:17:47", "description": "Adidas said it would be “revising the remainder of the campaign” with immediate effect. Read more at straitstimes.com.", "filename": "world_europe_adidas-drops-bella-hadid-from-campaign-over-gaza-controversy_1728740610.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/20/btbella20240720.jpg?VersionId=lkj1KD70n5wxPfDL5RyydmrPg129bHuo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_adidas-drops-bella-hadid-from-campaign-over-gaza-controversy_1728740610.html", "title": "Adidas drops Bella Hadid from campaign over Gaza controversy", "title_page": "Adidas drops Bella Hadid from campaign over Gaza controversy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - Adidas said on July 19 it had dropped vocal pro-Palestinian model Bella Hadid from an advertising campaign for retro sneakers referencing the 1972 Munich Olympics, which were overshadowed by a massacre of Israeli athletes.\nThe German sportswear giant recently relaunched the SL72, a shoe first showcased by athletes at the 1972 Olympics, as part of a series reviving old classic sneakers. Eleven Israeli athletes and a German police officer were killed at the 1972 Munich Games after gunmen from the Palestinian Black September group broke into the Olympic village and took them hostage.\nMs Hadid, who was born in the US but has Palestinian roots through her father, has been vocal about her support for Palestinian rights since the Hamas attack on Israel on Oct 7 triggered the war in Gaza.\nAdidas said it would be “revising the remainder of the campaign” with immediate effect.\n“We are conscious that connections have been made to tragic historical events – though these are completely unintentional – and we apologise for any upset or distress caused,” the company said in a statement sent to AFP on July 19.\n‘Collective memory’\nA spokeswoman confirmed that Ms Hadid had been removed from the campaign, which notes that the shoes were first introduced in 1972 but never mentions the terror attack on the Israeli athletes.\nPictures of the American model wearing the retro Adidas shoes had caused an outcry among pro-Israeli groups.\n“Guess who the face of the campaign is? Bella Hadid, a model with Palestinian roots who has spread anti-Semitism in the past and incited violence against Israelis and Jews,” the Israeli embassy in Germany wrote on X on July 18.\n“How can Adidas now claim that the reference (to the events in Munich) was ‘completely unintentional’?” Israel’s ambassador to Germany Ron Prosor said in response to the firm’s climbdown. “The terror of 1972 is etched into the collective memory of Germans and Israelis,” he told Die Welt TV on July 19.\nA flood of social media posts meanwhile expressed support for Ms Hadid, criticised Adidas for axing the model, and called for a boycott of the company.\nPro-Palestinian demonstrations\nThe Gaza war was triggered by the Oct 7 attack by Palestinian Hamas militants on southern Israel which resulted in the deaths of 1,195 people, mostly civilians, according to an AFP tally based on Israeli figures. Israel’s military retaliation to wipe out Hamas has killed at least 38,848 people, also mostly civilians, according to data from the Health Ministry in Hamas-ruled Gaza.\nMs Hadid has taken part in several pro-Palestinian demonstrations during the conflict and has described Israel’s offensive as a genocide.", "url": "https://www.straitstimes.com/world/europe/adidas-drops-bella-hadid-from-campaign-over-gaza-controversy"}