{"authors": [], "date_download": "2024-10-12 14:19:41", "date_modify": "2024-10-12 14:19:41", "date_publish": "2022-04-11 04:11:50", "description": "Ifop pollsters predicted a tight runoff, with 51% for Macron and 49% for Le Pen. Read more at straitstimes.com.", "filename": "world_europe_frances-macron-and-le-pen-head-to-april-24-election-runoff_1728742781.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/JtfhbJOdoL6T5oROOGTtsBq2TDgOKXHG08hrLc88r0o.jpg?VersionId=1pDy5lpcnE6VNRG4HyIovA7WTfGCzJgG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_frances-macron-and-le-pen-head-to-april-24-election-runoff_1728742781.html", "title": "France’s Macron and Le Pen head for cliffhanger April 24 election runoff", "title_page": "France’s Macron and Le Pen head for cliffhanger April 24 election runoff | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS (REUTERS) - French leader Emmanuel Macron and his strongest challenger Marine Le Pen qualified on Sunday (April 10) for a presidential election runoff on April 24, pitting a pro-European economic liberal against a far-right nationalist.\nWith partial results putting Macron in first place ahead of Le Pen after Sunday's first round voting, other major candidates admitted defeat. Except for another far-right candidate, Eric Zemmour, they all urged voters to back the incumbent in two weeks' time in order to block the far-right.\nBut after five years in power in which his abrasive style has upset many, while Le Pen succeeded in softening her image, Macron will not be able to count on voters’ traditional anti-far right front.\n“Nothing is decided, and the battle we will wage in the next 15 days will be decisive for France and Europe,” Macron told supporters, urging all voters to rally behind him on April 24 to stop the far-right from ruling the European Union’s second-largest economy.\nIfop pollsters predicted a tight runoff, with 51 per cent for Macron and 49 per cent for Le Pen. In 2017, he won with 66.1 per cent of the votes.\nOther pollsters offered a slightly bigger margin in favour of Macron, with up to 54 per cent. But that was in any case much narrower than in 2017, when Macron beat Le Pen with 66.1 per cent of the votes.\nLe Pen, who had eaten into the president's once-commanding 10-point poll lead in recent weeks, said she was the one to protect the weak and unite a nation tired of its elite.\n\"What will be at stake on April 24 is a choice of society, a choice of civilisation,” she told supporters, who chanted “We will win!” as she told them: “I will bring order back to France.”\nMacron, meanwhile, told supporters waving French and EU flags: “The only project that is credible to help purchasing power is ours.”\nWith 96 per cent of the votes counted for Sunday’s first round, Macron garnered 27.41 per cent of the votes and Le Pen 24.03 per cent. A near total count of the vote was expected for later in the night.\nA Le Pen victory on April 24 would be a similar jolt to the establishment as Britain’s Brexit vote to leave the European Union (EU) or Donald Trump’s 2017 entry into the White House.\nFrance would lurch from being a driving force for European integration to being led by a euro-sceptic who is also suspicious of the NATO military alliance.\nWhile Le Pen has ditched past ambitions for a “Frexit” or to haul France out of the euro zone’s single currency, she envisages the EU as a mere alliance of sovereign states.\nConservative candidate Valerie Pecresse warned of \"disastrous consequences\" if Macron lost, while the Socialists'Anne Hidalgo urged supporters to vote for him \"so that France does not fall into hatred\".\n\"Not one vote for Le Pen!\" added hard-left candidate Jean-Luc Melenchon, who, according to the estimates, placed third with around 20 per cent of the votes.", "url": "https://www.straitstimes.com/world/europe/frances-macron-and-le-pen-head-to-april-24-election-runoff"}