{"authors": [], "date_download": "2024-10-12 14:08:23", "date_modify": "2024-10-12 14:08:23", "date_publish": "2024-02-08 21:40:16", "description": "RAFAH, Gaza Strip - With one million Gazans displaced from their homes by Israeli bombardments seeking refuge in the border town of Rafah, five families have moved into a chicken farm, living in its long concrete sheds, the battery coops transformed into bunk beds. Read more at straitstimes.com.", "filename": "world_middle-east_displaced-gazans-resort-to-living-in-chicken-sheds_1728742103.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/08/LYNXMPEK170K5-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_displaced-gazans-resort-to-living-in-chicken-sheds_1728742103.html", "title": "Displaced Gazans resort to living in chicken sheds", "title_page": "Displaced Gazans resort to living in chicken sheds | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "RAFAH, Gaza Strip - With one million Gazans displaced from their homes by Israeli bombardments seeking refuge in the border town of Rafah, five families have moved into a chicken farm, living in its long concrete sheds, the battery coops transformed into bunk beds.\nThe war that began on Oct. 7 with a Hamas attack on Israel that killed 1,200 people - drawing an Israeli military assault on Gaza that local health authorities say has killed more than 27,800 Palestinians - has devastated the enclave.\nMore than 85% of Gaza's 2.3 million inhabitants have fled their homes, with about one million flocking into Rafah, hard against the Egyptian border. Many of them live in tents crammed into empty lots or patches of beach.\nFor the Hanoon family, one of five in an extended clan that have moved in there, the chicken farm feels close to rock bottom.\n\"We're living in a place meant for animals,\" said Umm Mahdi Hanoon, standing among the cages. \"Imagine a child sleeping in a chicken crate.\"\n\"The place is very bad. Water leaks down on us. The cold is really harsh for the children, for the old people, for those who are ill... sometimes we wish the morning won't come,\" she said.\nHer son Mahdi said they had lived in the Sheikh Radwan neighbourhood of Gaza City, an area that came under the path of Israel's military offensive early in the war.\n\"We moved to al-Zawayda. Due to the shelling we looked for another place but couldn't find one because there are a lot of us. Then an acquaintance, a friend of my cousin's, told me there's a chicken farm in Rafah with cages,\" he said.\n\"We struggled at first. There were insects. We have children,\" he said, initially thinking they would only be there for a couple of days.\nBut as the time went by they had to accept that the chicken sheds would be their home for much longer. They used the metal frames of the cages as beds and cook bread, when they manage to find flour, on a metal stove on the floor.\n\"It is hard to live in a place like this, a place which was designed for chicken and birds. You find yourself in a cage,\" Mahdi said. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/displaced-gazans-resort-to-living-in-chicken-sheds"}