{"authors": [], "date_download": "2024-10-12 13:40:34", "date_modify": "2024-10-12 13:40:34", "date_publish": "2021-12-04 23:51:56", "description": "It is witnessed by a handful of scientists, experts and well-heeled adventure tourists. Read more at straitstimes.com.", "filename": "world_total-solar-eclipse-plunges-antarctica-into-darkness_1728740434.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/12/04/topshots-topshot-antartica-astronomy-sun-eclipse-153016.jpg?VersionId=g9y1W7fGf7XlkRO_BGwKiYOp4kO12aAd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_total-solar-eclipse-plunges-antarctica-into-darkness_1728740434.html", "title": "Total solar eclipse plunges Antarctica into darkness", "title_page": "Total solar eclipse plunges Antarctica into darkness | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SANTIAGO (AFP) - A total solar eclipse plunged Antarctica from summer into darkness early on Saturday (Dec 4) in a rare astronomical spectacle witnessed by a handful of scientists and thrill-seekers - and countless penguins.\n\"The visibility was excellent,\" said Professor Raul Cordero of the University of Santiago de Chile, who was on site to witness \"totality\" at 0746 GMT (3.46pm Singapore time), with the \"ring of fire\" phase lasting just over 40 seconds.\nSolar eclipses occur when the Moon passes between the Sun and Earth, casting its shadow on Earth. For the eclipse to be total, the Sun, Moon and Earth must be directly aligned.\nTotality was visible only in Antarctica, experienced by a small number of scientists, experts and adventure tourists - who paid some US$40,000 (S$55,000) for the privilege.\nStreamed live by Nasa from the Union Glacier camp in Antarctica, the eclipse began at 0700 GMT as the Moon began to move in front of the Sun, coming to an end at 0806 GMT.\nThe Union Glacier camp is situated about 1,000km north of the South Pole.\nAccording to Nasa, a partial eclipse was also visible across parts of the Southern Hemisphere, including parts of St Helena, Namibia, Lesotho, South Africa, Chile, New Zealand and Australia.\nThe last total solar eclipse in Antarctica occurred on Nov 23, 2003, and the next one will not be until 2039.\nAn annular solar eclipse - in which the Moon obscures all but an outer ring of the Sun - is set to sweep across North America in October 2023, followed by a total eclipse in April 2024.", "url": "https://www.straitstimes.com/world/total-solar-eclipse-plunges-antarctica-into-darkness"}