{"authors": [], "date_download": "2024-10-12 14:01:53", "date_modify": "2024-10-12 14:01:53", "date_publish": "2022-03-24 08:18:13", "description": "The alliance said it would help Ukraine prepare for possible chemical, biological and even nuclear threats from Russia. Read more at straitstimes.com.", "filename": "world_europe_as-biden-visits-europe-nato-says-its-doubling-eastern-flank-forces_1728741713.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/24/ac_firefighterskyiv_240322.jpg?VersionId=KqcwY.xBpHQN_jjJWCygEAqDJUxT1fCM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_as-biden-visits-europe-nato-says-its-doubling-eastern-flank-forces_1728741713.html", "title": "As Biden visits Europe, Nato says it's doubling eastern flank forces", "title_page": "As Biden visits Europe, Nato says it's doubling eastern flank forces | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS (NYTIMES) - Nato announced a doubling of its military presence near Ukraine on Wednesday (March 23) and said the alliance would help the country prepare for possible chemical, biological and even nuclear threats from the Russian invaders, which would be a once-unthinkable expansion in the month-old war.\nThe announcement by Jens Stoltenberg, Nato's secretary-general, came hours before President Joe Biden landed in Europe for an extraordinary strategy session with the alliance, created in 1949 to contain the Soviet Union. The warnings underscored the urgency of efforts to prevent the conflict from spreading beyond Ukraine's borders and entangling Nato in a direct fight with Russia.\nThe possibility that Russia might resort to weapons of mass destruction also reflected the Russian military's failure to achieve more than a stalemate so far in the face of an unexpectedly tenacious Ukrainian resistance.\nBiden's Nato meeting on Thursday (March 24) will be followed by a session with counterparts from the Group of 7 industrialised powers, and then with the European Union. The last will include an appearance by President Volodymyr Zelenskyy of Ukraine, via video link from an embattled Kyiv. That discussion is expected to explore ways to further tighten the already-severe Western economic sanctions on Russia that are aimed at pressuring its president, Vladimir Putin, into halting the war.\nThose punishments, which have crashed the rouble's value and begun to cause severe shortages inside Russia, have erased decades of its financial integration with the world in the space of a few weeks. Russia's decision to strictly control how the Ukraine conflict is reported domestically - it is a criminal offence to call the conflict a war or invasion - has further raised repression in the country.\nBiden wants to steel the allies for the likelihood that the conflict lasts for months or years, requiring a long-term commitment to economic and military confrontation, administration officials say.\nBut the Europeans are unwilling to follow the United States in stopping purchases of Russian oil and gas, which are much more critical to their economies. Chancellor Olaf Scholz of Germany said such a halt would imperil \"hundreds of thousands of jobs\". So, in some ways, Biden's back-to-back meetings also represent the most severe test of the trans-Atlantic alliance's cohesion over the Ukraine crisis.\nThe alliance has so far proved remarkably unified in trying to turn Russia into a pariah and help Ukraine's outgunned defense forces to frustrate the Russian military's ground advances in the country.\nAnd Russia might have incurred more losses than previously thought, according to a senior Nato military official who, speaking on the condition of anonymity on Wednesday, said that 7,000 to 15,000 Russian troops had been killed in Ukraine over the past month. The upper range is more than double the Pentagon's figure of around 7,000.\nDespite Russia's frustration in Ukraine so far, Putin has shown no sign of backing down in his campaign to subjugate the former Soviet republic with bombings and shellings that have levelled all or parts of some cities, displaced a quarter of the population and created the biggest refugee crisis in Europe since World War II.\nBiden and other Western leaders have denounced Putin's willingness to order such tactics, and Biden has gone so far as to call his Russian counterpart a war criminal - a description that outraged the Kremlin. On Wednesday, Secretary of State Antony Blinken, who was joining Biden in Europe, took his remarks one step further, announcing that the United States has formally concluded that Russian forces committed war crimes in Ukraine.\nThe practical implications of Blinken's announcement were not immediately clear. But they appeared bound to further aggravate the US relationship with Russia, already at its most fragile stage since the Cold War.", "url": "https://www.straitstimes.com/world/europe/as-biden-visits-europe-nato-says-its-doubling-eastern-flank-forces"}