{"authors": [], "date_download": "2024-10-12 13:35:14", "date_modify": "2024-10-12 13:35:14", "date_publish": "2024-09-12 03:38:25", "description": "He has not spoken with Israeli Prime Minister Benjamin Netanyahu since the Hamas attack last year. Read more at straitstimes.com.", "filename": "world_middle-east_un-chief-says-lack-of-accountability-on-un-staff-killings-in-gaza-unacceptable_1728740114.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/LYNXMPEK8A0U8-1.jpg?VersionId=QvEejtG1D.55oMqXVpwovIFJix9jxMNf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_un-chief-says-lack-of-accountability-on-un-staff-killings-in-gaza-unacceptable_1728740114.html", "title": "UN chief says lack of accountability on UN staff killings in Gaza ‘unacceptable’", "title_page": "UN chief says lack of accountability on UN staff killings in Gaza ‘unacceptable’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - A lack of accountability for the killing of United Nations staff and humanitarian aid workers in the Gaza Strip is “totally unacceptable”, UN Secretary-General Antonio Guterres told Reuters in a wide-ranging interview on Sept 11.\nMr Guterres also said establishing a UN peacekeeping force would not be the best solution for Haiti, where armed gangs have taken over much of the Caribbean nation’s capital and expanded to surrounding areas, fuelling a humanitarian crisis with mass displacement, sexual violence and widespread hunger.\nAhead of the annual meeting of world leaders at the UN General Assembly later in September, Mr Guterres summed up the past year as “very tough, very difficult”.\nIt has been dominated by the war in the Gaza Strip, which began – just two weeks after leaders left New York following 2023’s assembly – after Palestinian militant group Hamas led a cross-border raid into Israel, killing 1,200 and taking about 250 hostages, according to Israeli tallies.\nDescribing Israel’s retaliation against Hamas in Gaza – where local health officials say some 41,000 Palestinians have been killed since the war began – Mr Guterres said there have been “very dramatic violations of the international humanitarian law and the total absence of an effective protection of civilians”.\n“What’s happening in Gaza is totally unacceptable,” he said.\nThe Israeli military says it takes steps to reduce the risk of harm to civilians and that at least a third of the Palestinian fatalities in Gaza are militants. It accuses Hamas of using Palestinian civilians as human shields, which Hamas denies.\nNearly 300 humanitarian aid workers, more than two-thirds of them UN staff, have also been killed amid the conflict, according to the UN.\nMr Guterres said there should be an effective investigation and accountability for their deaths.\n“We have courts, but we see that the decisions of courts are not respected, and it is this kind of limbo of accountability that is totally unacceptable and that requires also a serious reflection,” he said.\nThe top UN court, the International Court of Justice, said in July that Israel’s occupation of Palestinian territories and settlements is illegal and should be withdrawn.\nThe 193-member UN General Assembly is likely to vote next week on a draft resolution that would give Israel a six-month deadline to do so.\nMr Guterres said he has not spoken with Israeli Prime Minister Benjamin Netanyahu – who has long accused the UN of being anti-Israel – since the Oct 7 Hamas attack.\nThe pair met in person at the UN a year ago, and Mr Guterres said he would do so again – if Mr Netanyahu asked.\n“I have not talked to him because he didn’t pick up my phone calls, but I have no reason not to speak with him,” Mr Guterres said. “So if he comes to New York, and he asks to see me, I will be very glad to see him.”\nWhen asked if Mr Netanyahu planned to meet Mr Guterres on the sidelines of the UN General Assembly, Israel’s UN Ambassador Danny Danon said Mr Netanyahu’s schedule has not been finalised yet.\nHaiti ‘scandal’\nMr Guterres described the current state of the world as chaotic.\nHe said the Gaza conflict and Russia’s war in Ukraine were stuck, with no peaceful solutions in sight.\nWhen asked about Western accusations that North Korea and Iran are now providing Russia with weapons, Mr Guterres said: “Any expansion of war in Ukraine is an absolutely dramatic development.”\nIran has rejected the Western accusations, while North Korea has denied the allegations against it.\nUN sanctions monitors said in April that debris from a missile that landed in the Ukrainian city of Kharkiv on Jan 2 was from a North Korean Hwasong-11 series ballistic missile.\nIn Haiti, a UN-backed international force has been slow to deploy – after Haiti asked for help in 2022 – and lacks funds.\nThe United States wants the UN Security Council to ask the global body for a plan to transition the force into a UN peacekeeping operation.\n“I don’t think peacekeeping is the best solution in a situation like this... peacekeeping means to keep the peace, and that’s not exactly the situation we have in Haiti,” Mr Guterres said. “I find it a scandal that it has been so difficult to mobilise funds for such a dramatic situation.”\nTrump looms\nMr Guterres’ first five-year term as secretary-general coincided with the US presidency of Donald Trump, who cut funding to the international body, calling it weak and incompetent.\nTrump is again the Republican presidential nominee and will face off against Democratic Vice-President Kamala Harris in the Nov 5 election.\n“We are ready to work in all circumstances in defence of the values of the (founding UN) charter and of the values of the UN,” Mr Guterres said when asked if the world body had a contingency plan for a possible second Trump administration.\nDuring his first term in office, Trump also withdrew the US from the Paris Agreement, an international pact to fight climate change, and Trump’s campaign said he would do it again if he wins in November.\nThe US is currently a full participant in the accord, after President Joe Biden swiftly rejoined in 2021.\n“It will survive. But, of course, it will probably survive severely undermined,” Mr Guterres said of a second withdrawal from the pact by a potential Trump administration.\nMr Guterres has long pushed for stronger action to fight climate change.\nWith abortion rights a key topic in the US election, Mr Guterres said the US voice was “obviously very important” at the UN when it came to the issue of women’s sexual and reproductive rights, as well as health.\nUnder Trump’s presidency, the US opposed long-agreed international language on women’s sexual and reproductive rights and health in UN resolutions over concern that it would advance abortion rights.\nTrump also cut funding in 2017 for the UN Population Fund because, as his administration said, it “supports, or participates in the management of, a programme of coercive abortion or involuntary sterilisation”.\nThe UN said this was an inaccurate perception. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/un-chief-says-lack-of-accountability-on-un-staff-killings-in-gaza-unacceptable"}