{"authors": [], "date_download": "2024-10-12 13:36:26", "date_modify": "2024-10-12 13:36:26", "date_publish": "2023-10-15 01:29:32", "description": "A brutal Hamas attack on Israel on Oct 7 took the country by surprise. Read more at straitstimes.com.", "filename": "world_middle-east_israel-admits-intelligence-mistakes-in-failing-to-predict-hamas-attacks_1728740186.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/15/2023-07-31T180333Z837265609RC2HE2ANC8P0RTRMADP3ISRAEL-SAUDI-USA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israel-admits-intelligence-mistakes-in-failing-to-predict-hamas-attacks_1728740186.html", "title": "Israel admits intelligence ‘mistakes’ in failing to predict Hamas attacks", "title_page": "Israel admits intelligence ‘mistakes’ in failing to predict Hamas attacks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM – A senior Israeli official on Saturday admitted “mistakes” in intelligence assessments ahead of a brutal Hamas attack last weekend that took the country by surprise.\nPalestinian militants early on Oct 7 launched a multi-pronged assault, breaching the Gaza border barrier and targeting southern Israeli communities and army bases.\n“It’s my mistake, and it reflects the mistakes of all those making (intelligence) assessments,” National Security Adviser Tzachi Hanegbi told a press briefing, when asked about his recent remarks predicting no Hamas aggression.\n“We really believed that Hamas learnt the lesson from” its last major war with Israel in 2021, Mr Hanegbi said.\nMore than 1,300 civilians and security forces have been killed since the attack began, according to Israeli officials, and at least 120 have been seized by militants and are believed to be held captive in Gaza.\nMr Hanegbi rejected negotiations on any prisoner swop deal with Hamas.\n“There’s no way to negotiate with an enemy we have sworn to obliterate,” he said.\nRelentless Israeli air strikes on the blockaded Palestinian enclave over the past week have killed upwards of 2,200, including at least 600 children, Hamas officials said. AFP", "url": "https://www.straitstimes.com/world/middle-east/israel-admits-intelligence-mistakes-in-failing-to-predict-hamas-attacks"}