{"authors": [], "date_download": "2024-10-12 14:04:10", "date_modify": "2024-10-12 14:04:10", "date_publish": "2023-12-13 08:25:00", "description": "He mailed people poison. Read more at straitstimes.com.", "filename": "world_canadian-faces-14-murder-charges-after-allegedly-helping-people-kill-themselves_1728741850.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/13/pexels-stephen-andrews-9900013.jpg.JPEG?h=852d9817", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_canadian-faces-14-murder-charges-after-allegedly-helping-people-kill-themselves_1728741850.html", "title": "Canadian faces 14 murder charges after allegedly helping people kill themselves", "title_page": "Canadian faces 14 murder charges after allegedly helping people kill themselves | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "OTTAWA – A Canadian man who allegedly helped more than a dozen young people across the province of Ontario kill themselves by mailing them poison has been charged with 14 counts of second-degree murder, police said on Dec 12.\nKenneth Law, 58, had previously been charged with 14 counts of counselling or aiding suicide.\nPolice said Law posted about 160 packages of sodium nitrite to people in Canada and also sent at least 1,200 packages to addresses in more than 40 countries.\n“It’s clearly significant... to be laying this many (charges) and that’s not taken lightly by the investigative team,” Inspector Simon James of the police force in York, a northern district of Toronto, told a televised press conference.\nThe victims ranged in age from 16 to 36, but Insp James declined to name them or explain why the charges against Law had been upgraded. He also said he did not know how many people abroad might have died.\n“We continue to cooperate with law enforcement agencies and collaborate with them globally,” said Insp James.\nThe Canadian Broadcasting Corp, citing official records and statements, said Law could be linked to 117 deaths around the world, most of them in Britain. It said the authorities in New Zealand, France, Ireland, Italy, Germany and Switzerland all confirmed that Law shipped packages to their countries.\nLaw, who police allege used a number of websites to reach his victims, is in jail and will make his next court appearance on Dec 19.\n“One of the challenges that we face (is that) a number of these sites are located in other countries where Canadian law does not apply,” said Insp James.\nIf Law is found guilty, he will go down as one of the worst mass murderers in Canadian history. In April 2020, a 51-year-old man shot dead 22 people in the Atlantic province of Nova Scotia before being killed by police. REUTERS", "url": "https://www.straitstimes.com/world/canadian-faces-14-murder-charges-after-allegedly-helping-people-kill-themselves"}