{"authors": [], "date_download": "2024-10-12 14:00:11", "date_modify": "2024-10-12 14:00:11", "date_publish": "2024-09-27 16:09:07", "description": "VALENCIA - As Spanish microbiologist Pilar Bosch was casting around for a subject to investigate for her PhD in 2008, she stumbled across a paper suggesting that bacteria, her field, could be used in art restoration, her mother's own area of expertise. Read more at straitstimes.com.", "filename": "world_europe_spanish-mother-and-daughter-train-bacteria-to-restore-church-frescoes_1728741611.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/27/LYNXMPEK8Q083-2.jpg?VersionId=kK9WQOxxcBvcneCy.hgkz6EIja19dtD5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_spanish-mother-and-daughter-train-bacteria-to-restore-church-frescoes_1728741611.html", "title": "Spanish mother and daughter train bacteria to restore church frescoes", "title_page": "Spanish mother and daughter train bacteria to restore church frescoes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VALENCIA - As Spanish microbiologist Pilar Bosch was casting around for a subject to investigate for her PhD in 2008, she stumbled across a paper suggesting that bacteria, her field, could be used in art restoration, her mother's own area of expertise.\nAt that same moment, her mother - Pilar Roig - was struggling to restore 18th-century paintings by Antonio Palomino in one of the oldest churches in Spain's third city, Valencia.\nShe was finding it particularly difficult to remove glue that had been used to pull the frescoes from the walls of Santos Juanes church during restoration work in the 1960s.\n\"My mother had a very difficult problem to solve and I found a paper about bacteria used to clean frescoes in Italy,\" Bosch, 42, said.\nShe did her PhD on that project. And more than a decade later, daughter and mother have joined forces on a 4-million-euro ($4.46-million) project, funded by local foundations, to use some of the techniques to restore the artworks in Valencia.\nThe microbiologist trains bacteria by feeding them samples of the glue which was made from animal collagen. The bacteria then naturally produce enzymes to degrade the glue.\nThe family team then mixes the bacteria with a natural algae-based gel and spread it on the paintings - which were taken from the walls in the 1960s, then nailed back on, still covered in glue.\nAfter three hours, the gel is removed, revealing glue-free paintings.\n\"In the past, we used to work in a horrible manual way, with warm water and sponges that took hours and damaged the painting,\" said Roig, now 75, whose father and grandfather along with other relatives also worked in art conservation.\nHer microbiologist daughter has now joined in. \"It certainly runs in the family,\" Bosch said, as both stood in lab coats, supervising the restoration.\nBosch has also applied her use of bacteria to restoration projects in Pisa and Monte Cassino in Italy and in Santiago de Compostela in northern Spain. She is now training up cohorts of a different kind of bacteria to clear walls of spray-painted graffiti. REUTERS", "url": "https://www.straitstimes.com/world/europe/spanish-mother-and-daughter-train-bacteria-to-restore-church-frescoes"}