{"authors": [], "date_download": "2024-10-12 13:45:10", "date_modify": "2024-10-12 13:45:10", "date_publish": "2023-01-25 04:15:29", "description": "The advanced nuclear thermal propulsion technology could be developed and demonstrated as soon as 2027, the space agency said. Read more at straitstimes.com.", "filename": "world_united-states_nasa-pentagon-developing-nuclear-powered-rocket-for-mars-voyage_1728740710.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/25/FILES-US-NUCLEAR-SPACE-NASA-MARS-183934.jpg?VersionId=DDMzZsFvTA1WLizibW6BusVeZAz0wsY_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_nasa-pentagon-developing-nuclear-powered-rocket-for-mars-voyage_1728740710.html", "title": "Nasa, Pentagon developing nuclear-powered rocket for Mars voyage", "title_page": "Nasa, Pentagon developing nuclear-powered rocket for Mars voyage | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Nasa is partnering with a Pentagon research agency to develop a nuclear-powered rocket engine in preparation for sending astronauts to Mars.\nNasa Administrator Bill Nelson said Tuesday that the US space agency will team up with the Defense Advanced Research Projects Agency (Darpa) to “develop and demonstrate advanced nuclear thermal propulsion technology as soon as 2027.”\n“With the help of this new technology, astronauts could journey to and from deep space faster than ever – a major capability to prepare for crewed missions to Mars,” Nelson said in a statement.\nDarpa is the Pentagon’s research and development arm and has played a role in many of the notable innovations of the 20th century including the Internet.\nNasa said nuclear thermal rockets can be three or more times more efficient than conventional chemical propulsion and would reduce transit time, essential for an eventual mission to Mars.\nIn a nuclear thermal engine, a fission reactor is used to generate extremely high temperatures.\nHeat from the reactor is transferred to liquid propellant which is then converted into gas, which expands through a nozzle and provides thrust.\n“Darpa and Nasa have a long history of fruitful collaboration,” Darpa director Stefanie Tompkins said, citing the Saturn V rocket that took the first astronauts to the Moon.\n“The nuclear thermal rocket programme will be essential for more efficiently and quickly transporting material to the Moon and, eventually, people to Mars,” Tompkins said.\nNasa conducted its last nuclear thermal rocket engine tests more than 50 years ago but the programme was abandoned due to budget cuts and Cold War tensions. AFP", "url": "https://www.straitstimes.com/world/united-states/nasa-pentagon-developing-nuclear-powered-rocket-for-mars-voyage"}