{"authors": [], "date_download": "2024-10-12 13:32:16", "date_modify": "2024-10-12 13:32:16", "date_publish": "2024-10-02 14:35:38", "description": "MOSCOW - Russian troops are in complete control of the town of Vuhledar in Ukraine's eastern Donetsk region, the SHOT Telegram channel and pro-Russian war bloggers said on Wednesday. Read more at straitstimes.com.", "filename": "world_europe_russian-forces-in-complete-control-of-vuhledar-in-eastern-ukraine-war-bloggers-say_1728739936.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/LYNXMPEK91068-2.jpg?VersionId=sOD4kcCzJwqH7kESEsOdFCA.YL3OcpXQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russian-forces-in-complete-control-of-vuhledar-in-eastern-ukraine-war-bloggers-say_1728739936.html", "title": "Russian forces in complete control of Vuhledar in eastern Ukraine, war bloggers say", "title_page": "Russian forces in complete control of Vuhledar in eastern Ukraine, war bloggers say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russian troops are in complete control of the town of Vuhledar in Ukraine's eastern Donetsk region, the SHOT Telegram channel and pro-Russian war bloggers said on Wednesday.\nReuters could not independently confirm those reports. The Russian Defence Ministry has not yet confirmed the town's capture.\nOn Tuesday, a regional Ukrainian official said Russian troops had reached the town's centre, a bastion on strategic high ground that has resisted Russian assaults for more than two years.\nRussia said in 2022 it had annexed four Ukrainian regions - including Donetsk - a move Kyiv and the West have rejected as illegal. Moscow sought to capture Vuhledar, a coal mining town with a pre-war population of around 14,000, as a key stepping stone to incorporating the entire Donetsk region into Russia.\nThe town lies at the intersection of the eastern and southern battlefields, giving it added importance to supplying both sides' troops.\nVuhledar also sits close to a railway line connecting Crimea, the Black Sea peninsula which Russia annexed from Ukraine in 2014, to Ukraine's industrialised Donbas region, which comprises Donetsk and the eastern region of Luhansk, most of which Moscow controls.\nThe town has been devastated by repeated assaults. Images of Russian forces waving their flag on the roof of an administrative building on Tuesday in the centre showed a structure which had been reduced to rubble in parts and whose blackened windows had all been blown out. REUTERS", "url": "https://www.straitstimes.com/world/europe/russian-forces-in-complete-control-of-vuhledar-in-eastern-ukraine-war-bloggers-say"}