{"authors": [], "date_download": "2024-10-12 13:58:03", "date_modify": "2024-10-12 13:58:03", "date_publish": "2024-01-31 11:38:00", "description": "Infections rose 17 per cent to 207,000 cases in the US in 2022. Read more at straitstimes.com.", "filename": "world_united-states_us-syphilis-cases-rise-to-highest-level-in-more-than-70-years_1728741483.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/31/SYPHILISRATES1.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-syphilis-cases-rise-to-highest-level-in-more-than-70-years_1728741483.html", "title": "US syphilis cases rise to highest level in more than 70 years", "title_page": "US syphilis cases rise to highest level in more than 70 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Cases of syphilis, a debilitating sexually transmitted disease (STD), are surging in the US and have returned to levels not seen in more than 70 years.\nInfections rose 17 per cent to 207,000 cases in the US in 2022, the Centres for Disease Control and Prevention (CDC) said on Jan 30 in a release of the latest data available. Annual cases hovered just above 30,000 two decades ago.\nRates of syphilis have been rising for years amid funding cuts to local public health agencies and transmission increases associated with more drug use and unprotected sex.\nIn response, the Department of Health and Human Services, which oversees the CDC, initiated a syphilis task force in 2023 that has focused on increasing testing and treatment.\n“We need a whole-country response,” said Dr Jonathan Mermin, director of the National Centre for HIV, Viral Hepatitis, STD, and TB Prevention at the CDC. “There are no shortcuts.”\nSyphilis can lay dormant in people for years and then cause medical problems, including blindness and even death.\nIt is particularly troubling if pregnant women get infected because the disease can be passed to foetuses and babies with deadly effects. In 2022, congenital syphilis caused 231 stillbirths and 51 infant deaths, according to CDC data.\nAs part of its strategy to combat the disease, the CDC has also supported the development of a rapid syphilis test that could identify cases anywhere, an improvement over current tests in the US that require laboratories, Dr Mermin said.\nBut even when patients are identified, they currently face a hurdle to get treatment. The best medicine for syphilis is penicillin G benzathine, which is sold by Pfizer in the US under the brand Bicillin L-A, and it has been in short supply since April because of high demand.\nPfizer has increased production and expects supply to normalise by June. The Food and Drug Administration also greenlit the importation of a version of penicillin G benzathine that is approved in Europe but not the US.\nAbout 50,000 doses are available, said Mr Pavel Svintozelskiy, medical affairs manager for Provepharm, a company involved in the importation.\nOnly drug\nPenicillin G benzathine is the only drug that can prevent someone from passing the disease to a foetus, resulting in congenital syphilis.\nTo preserve Bicillin L-A for pregnant people, the CDC recommended that healthcare providers treat others with a different drug, doxycycline. But that medicine is significantly less convenient.\nWhile Bicillin L-A can cure syphilis with as little as one shot, doxycycline requires weeks of taking a pill twice a day.\nMany people with syphilis are homeless or struggle with substance abuse, making it difficult to consistently take medication.", "url": "https://www.straitstimes.com/world/united-states/us-syphilis-cases-rise-to-highest-level-in-more-than-70-years"}