{"authors": [], "date_download": "2024-10-12 13:42:36", "date_modify": "2024-10-12 13:42:36", "date_publish": "2024-05-03 16:46:34", "description": "Turkey's decision made it the first of Israel's key trade partners to halt exports and imports. Read more at straitstimes.com.", "filename": "world_turkey-says-israel-trade-halted-until-permanent-gaza-ceasefire_1728740556.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/03/btport20240503.JPG?VersionId=S83DaRfEMTUvW5MnlsMKggdh0FkD8zFT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_turkey-says-israel-trade-halted-until-permanent-gaza-ceasefire_1728740556.html", "title": "Turkey says Israel trade halted until permanent Gaza ceasefire", "title_page": "Turkey says Israel trade halted until permanent Gaza ceasefire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ISTANBUL – Turkey will not resume trade with Israel, worth US$7 billion (S$9.5 billion) a year, until a permanent ceasefire and humanitarian aid are secured in Gaza, it said on May 3.\nTurkey is the first of Israel’s key partners to halt trade over the conflict.\nIsrael’s “uncompromising attitude” and the worsening situation in Gaza’s southern Rafah region – where Israel has threatened to launch a new offensive – prompted Turkey to halt all exports and imports, said Trade Minister Omer Bolat.\nIsrael’s Foreign Minister Israel Katz criticised Turkish President Recep Tayyip Erdogan’s move, announced late on May 2, saying it breaks international trade agreements and that this was “how a dictator behaves”.\nMilitant group Hamas, which rules Gaza, praised the decision as brave and supportive of Palestinian rights.\nMr Bolat said: “We decided to stop exports and imports to and from Israel until a permanent ceasefire is achieved (in Gaza) and humanitarian aid is allowed without interruption.”\nTurkey is negotiating “with our Palestinian brothers on alternative arrangements to ensure that they are not affected by this decision”, he added while announcing April trade figures.\nIn April, Turkey curbed exports of steel, fertiliser and jet fuel among 54 product categories over what it said was Israel’s refusal to allow Ankara to take part in aid air-drop operations for Gaza.\nAll remaining trade, which amounted to US$5.4 billion in Turkish exports and US$1.6 billion in Israeli imports in 2023, is now halted.\nTop Turkish exports to Israel are steel, vehicles, plastics, electrical devices and machinery, while imports are dominated by fuels at US$634 million last year, Turkish trade data show.\nWorkarounds\nTurkish exporters with firm orders are looking at ways to send their goods to Israel via third countries after Turkey halted bilateral trade, four export sector sources told Reuters.\nMr Katz said blocking ports for Israeli imports and exports ignores trade deals, adding on social media platform X that Israel would work toward alternatives for trade with Turkey.\nTurkey has denounced Israel’s military campaign in Gaza, sent thousands of tons of aid for Gazans and, this week, said it would join South Africa’s genocide case against Israel at the International Court of Justice.\nYet its decision to maintain commercial ties with Israel until last month, despite Mr Erdogan’s strong rhetoric, prompted a domestic backlash and hurt the results of the ruling AK Party in nationwide local elections in March.\nHamas said on May 3 that Turkey’s trade halt was “brave and reflective of the Turkish people’s longstanding support for Palestinian rights and self-determination”.\nTurkey maintains ties with Hamas leaders and does not deem it a terrorist group.\nMore than 34,000 people have been killed in Gaza during Israel’s nearly seven-month-old military offensive, Palestinian health officials say, after Hamas militants killed some 1,200 people and took 253 hostages during an Oct 7 assault on southern Israel, according to Israeli tallies. REUTERS", "url": "https://www.straitstimes.com/world/turkey-says-israel-trade-halted-until-permanent-gaza-ceasefire"}