{"authors": [], "date_download": "2024-10-12 14:00:04", "date_modify": "2024-10-12 14:00:04", "date_publish": "2022-03-01 19:46:38", "description": "PARIS (AFP) - French actor Gerard Depardieu, a friend of Russian President Vladimir Putin, on Tuesday (March 1) came out against the war in Ukraine and called for negotiations. Read more at straitstimes.com.", "filename": "world_europe_putin-friendly-french-actor-depardieu-objects-to-fratricidal-war_1728741604.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/01/mi_gerardputin_010322.jpg?VersionId=vSI62JTeXRG.96sG58av7UDPn2cOW7Ei&h=84b6ffaa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_putin-friendly-french-actor-depardieu-objects-to-fratricidal-war_1728741604.html", "title": "Putin-friendly French actor Depardieu objects to 'fratricidal' war", "title_page": "Putin-friendly French actor Depardieu objects to 'fratricidal' war | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS (AFP) - French actor Gerard Depardieu, a friend of Russian President Vladimir Putin, on Tuesday (March 1) came out against the war in Ukraine and called for negotiations.\n\"Russia and Ukraine have always been brother countries,\" the 73-year-old film star told AFP in a phone call.\n\"I am against this fratricidal war. I say 'stop the weapons and negotiate',\" Depardieu said.\nIn 2013, he sparked a huge outcry by leaving France and taking Russian nationality in protest at a proposed tax hike on the rich in his homeland.\nPutin treated him to a dinner to present him with his new citizenship and Depardieu was subsequently full of praise for the strongman.\n\"I will say what I think about Putin: The Russian nation needs a person just like this - with a Russian temper. Putin is trying to return just a bit of dignity back to the people,\" he said after the dinner.\nOnly last month, as tensions soared at the Ukraine border, Depardieu opened an Instagram account with a picture of himself embracing Putin.\nHe also said on French television: \"Leave Vladimir alone.\"\nDepardieu became a star in France from the 1980s with roles in \"The Last Metro\", \"Police\" and \"Cyrano de Bergerac\", before Peter Weir's \"Green Card\" also made him a Hollywood celebrity.\nHe later acted in global productions, including Kenneth Branagh's \"Hamlet\", Ang Lee's \"Life of Pi\" and Netflix's \"Marseille\" series.\nIn 2015, Ukraine blacklisted Depardieu in apparent retribution for his reported refusal to recognise the independence of the former Soviet state.\nThe culture ministry gave no official reason for the ban at the time, but it had previously identified Depardieu and other Russia-friendly international film stars as national security threats whose movies should be banned.\nIn 2021, the actor was charged with raping and sexually assaulting a young French actress at his home in Paris three years earlier. He denied the accusation.", "url": "https://www.straitstimes.com/world/europe/putin-friendly-french-actor-depardieu-objects-to-fratricidal-war"}