{"authors": [], "date_download": "2024-10-12 13:38:14", "date_modify": "2024-10-12 13:38:14", "date_publish": "2024-05-14 21:58:00", "description": "Some analysts said the impact from the new tariff hikes on China may be limited in the short run. Read more at straitstimes.com.", "filename": "world_united-states_china-strongly-opposes-us-tariff-hikes-pledging-measures-to-defend-rights_1728740294.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/14/2024-05-14T001320Z1440129912RC2XP7AKBF1HRTRMADP3USA-URANIUM-BAN-BIDEN.JPG?VersionId=.XqzeLZkLHrglgMI40YhNnFDxEo2QbQX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_china-strongly-opposes-us-tariff-hikes-pledging-measures-to-defend-rights_1728740294.html", "title": "China strongly opposes US tariff hikes, pledging measures to defend rights", "title_page": "China strongly opposes US tariff hikes, pledging measures to defend rights | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BEIJING – China strongly opposed the United States’ tariff hikes, its Commerce Ministry said on May 14, vowing it would take resolute measures to defend its rights and interests.\n“US raising Section 301 tariffs violates President Biden’s commitment to ‘not seek to suppress and contain China’s development’ and ‘not to seek to decouple and break links with China’,” said a statement by the ministry, adding the move would “seriously affect the atmosphere of bilateral cooperation”.\nUS President Joe Biden on May 14 unveiled a bundle of steep tariff increases on an array of Chinese imports.\nThe new measures affect US$18 billion (S$24 billion) in Chinese imported goods, including steel and aluminium, semiconductors, batteries, critical minerals, solar cells and cranes, while retaining Trump-era tariffs on over US$300 billion in goods.\n“The US should immediately correct its wrongdoing and remove the additional tariffs imposed on China,” the Chinese Commerce Ministry urged in the statement.\nThe Biden administration officials said their measures are “carefully targeted” and unlikely to worsen a bout of inflation that has already angered American voters and imperilled Mr Biden’s re-election bid.\nSome analysts said the impact from the new tariff hikes on China may be limited in the short run.\nNomura analysts said in a note on May 13 that US-bound exports of Chinese EVs, medical supplies and semiconductor products only account for 5.9 per cent of China’s overall exports to the United States and less than 1 per cent of China’s total exports.\nStill, the rising geopolitical concerns over the relationship between the world’s two biggest economies may dent market confidence, and China’s economy also faces challenges of a protracted property weakness and tepid demand. REUTERS", "url": "https://www.straitstimes.com/world/united-states/china-strongly-opposes-us-tariff-hikes-pledging-measures-to-defend-rights"}