{"authors": [], "date_download": "2024-10-12 13:38:35", "date_modify": "2024-10-12 13:38:35", "date_publish": "2024-08-29 17:38:54", "description": "KYIV - A Russian drone and missile attack on Monday forced Ukraine to disconnect several nuclear power units from the grid, posing a risk to the nuclear power sector, a Ukrainian mission to the International Atomic Energy Agency said. Read more at straitstimes.com.", "filename": "world_europe_russias-attacks-on-ukraines-power-sector-pose-risk-to-nuclear-facilities-kyiv-says_1728740315.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/LYNXMPEK7S0CH-1.jpg?VersionId=xLGy9y18CklDlw1xz_Qi6TZXbqkwn7nv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russias-attacks-on-ukraines-power-sector-pose-risk-to-nuclear-facilities-kyiv-says_1728740315.html", "title": "Russian attacks on power sector pose risk to nuclear facilities, Ukraine says", "title_page": "Russian attacks on power sector pose risk to nuclear facilities, Ukraine says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - A Russian drone and missile attack on Monday forced Ukraine to disconnect several nuclear power units from the grid, posing a risk to the nuclear power sector, a Ukrainian mission to the International Atomic Energy Agency said.\nRussia used more than 200 missiles and drones in Monday's attack on energy facilities, Ukrainian officials said.\n\"The Russian Federation continues to deliberately target Ukraine's energy infrastructure, intending to disrupt the operation of the country's nuclear power plants, which provide most of Ukraine's electricity,\" the Ukrainian mission to the U.N. nuclear watchdog said in a note on Thursday.\n\"Russian attacks pose a significant risk to the stable operation of nuclear facilities in Ukraine and the safety of millions of people.\"\nRussia, which began its full-scale invasion in February 2022, stepped up attacks on Ukraine's power grid in March in what Kyiv said looked like a concerted effort to degrade the system before winter.\nUkraine's mission to the IAEA said Monday's attack was intended to paralyse the operation of power facilities.\n\"It is a deliberate decision by the Putin regime to threaten the world with nuclear catastrophe,\" Andriy Yermak, President Volodymyr Zelenskiy's chief of staff, said on Telegram messenger.\nUkraine has not said Russia has attacked nuclear power plants directly, but strikes on transmission and distribution systems have forced the grid operator to reduce production at nuclear power plants or shut down nuclear units.\nThe mission said that as a result of Monday's attack, three out of four power units at the Rivne nuclear power plant in western Ukraine were disconnected from the grid, as was power unit 3 of the South Ukrainian nuclear power plant.\nUkrainian nuclear energy firm Energoatom declined comment.\nIAEA CONCERN\nRussia's Defence Ministry said on Monday it had struck electricity substations in nine Ukrainian regions and gas compressor stations in three regions.\nUkrainian officials have said Ukraine has lost about half its power generating capacity during the war, and most of its power needs are now covered by electricity produced by three Ukrainian nuclear power plants.\nUkraine's Zaporizhzhia nuclear power plant, the Europe's largest, is occupied by Russian forces and out of operation.\nThe IAEA has urged both sides to refrain from fighting around nuclear plants to avoid a catastrophic incident, and IAEA chief Rafael Grossi said after visiting Russia's Kursk nuclear power plant on Tuesday that there was a risk of a nuclear accident there.\nRussia says the plant has been attacked by Ukrainian forces following a Ukrainian incursion into Russian territory this month. Ukraine has yet to respond to the accusations. REUTERS", "url": "https://www.straitstimes.com/world/europe/russias-attacks-on-ukraines-power-sector-pose-risk-to-nuclear-facilities-kyiv-says"}