{"authors": [], "date_download": "2024-10-12 13:55:04", "date_modify": "2024-10-12 13:55:04", "date_publish": "2024-04-26 07:50:00", "description": "Two of the five British Army horses that bolted in London on April 24 are in a “serious condition”. Read more at straitstimes.com.", "filename": "world_europe_two-runaway-army-horses-in-serious-condition-uk-minister_1728741304.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/26/d232fde9-9655-4616-af3c-2186652e9375.jpg?VersionId=ukRJrx_Nf4lJIPwXOBN2FAbAs08xoXrs", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_two-runaway-army-horses-in-serious-condition-uk-minister_1728741304.html", "title": "Two runaway army horses in ‘serious condition’: British minister", "title_page": "Two runaway army horses in ‘serious condition’: British minister | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Two of the five British Army horses that bolted in central London on April 24 before galloping through the streets at rush hour are in a “serious condition”, a minister said on April 25.\n“There were five horses. They have all been recovered. Three of them are fine, two of them are unfortunately in a relatively serious condition and obviously we will be monitoring that condition,” Defence Minister James Cartlidge told Sky News.\nThe British Army later wrote on social media platform X that the injured horses, named Vida and Quaker, were operated upon on April 24, with one transferred to an equine hospital.\nThe other horses involved are “being closely observed” but are expected to return to duty “in due course”, it added.\nSeven horses and six soldiers from the Household Cavalry were on an extended exercise in Belgravia, near the regiment’s barracks off Hyde Park, when the chaos erupted on the morning of April 24.\nFour service personnel were thrown from their horses, with five of the animals bolting and four getting loose, reportedly after they were spooked by concrete being moved by builders hitting the ground.\nTwo horses then ran along busy roads, dodging buses, taxis and other traffic.\nThree of the unseated soldiers were taken to hospital but all are expected to make a full recovery, the army posted on April 25.\nA number of prestigious army cavalry regiments have stables in the British capital and horses are a regular sight around government buildings on Whitehall, Buckingham Palace, The Mall and in nearby Hyde Park.\nMr Cartlidge stressed that the events on April 24 were “extremely unlikely” to be repeated.\n“You are probably aware that the army has horses out on exercise in central London every day of the week. It is about 150 horses on average exercising every day,” he told LBC radio.\n“So this is extremely unlikely, this scenario.”\nLondon Ambulance Service said it was called at 8.25am local time to reports of a person being thrown from a horse on Buckingham Palace Road.\nTwo of the horses were recaptured by the City of London Police, which polices the Square Mile financial district.\nOfficers contained two animals while “an army horse box had collected the horses and transported them to veterinary care”.", "url": "https://www.straitstimes.com/world/europe/two-runaway-army-horses-in-serious-condition-uk-minister"}