{"authors": [], "date_download": "2024-10-12 13:36:36", "date_modify": "2024-10-12 13:36:36", "date_publish": "2024-09-09 22:02:14", "description": "Ms Harris and Trump face a tight race before the Nov 5 election. Read more at straitstimes.com.", "filename": "world_ten-former-top-us-military-officials-back-harris-call-trump-a-danger_1728740196.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/09/LYNXMPEK880GN-1.jpg?VersionId=jPGNmRAhEJd6dyZUUQ2UcE71wWytK4gp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_ten-former-top-us-military-officials-back-harris-call-trump-a-danger_1728740196.html", "title": "Ten former top US military officials back Harris, call Trump ‘a danger’", "title_page": "Ten former top US military officials back Harris, call Trump ‘a danger’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - A group of 10 retired top US military officials endorsed US Vice-President Kamala Harris in a letter made public on Sept 9, saying she is the only presidential candidate fit to serve as the nation’s commander-in-chief and calling her Republican rival Donald Trump “a danger to our national security and democracy”.\nThe letter, signed by Retired General Larry Ellis and Retired Rear Admiral Michael Smith, among others, cited Trump’s comments disparaging members of the military and his own “chaotic approach” to Afghanistan ahead of the US withdrawal, including negotiating a deal with the Taliban that allowed 5,000 of the group’s fighters to return to the battlefield.\nIn contrast, they wrote, Ms Harris “has demonstrated her ability to take on the most difficult national security challenges in the Situation Room and on the international stage”, from Russia’s invasion of Ukraine to tensions with China in the Indo-Pacific.\n“Harris is the best – and only – presidential candidate in this race who is fit to serve as our commander-in-chief,” they wrote in the letter posted on X by Ms Harris’ campaign.\nThe Democratic vice-president and Trump, who is running for the third time after serving from 2017 to early 2021, face a tight race before the Nov 5 election in an unprecedented contest in which the future of American democracy looms large.\nThe letter coincided with a new Harris campaign ad released before the two candidates’ Tuesday night debate featuring former Trump officials warning that a second Trump presidency would pose major risks.\n“In 2016 Donald Trump said he would choose only the best people to work in his White House. Now, those people have a warning for America. Trump is not fit to be president again, fears his vice-president,” the ad says.\nIt featured videos from Trump’s former vice-president, Mike Pence, former defense secretary Mike Esper, former national security adviser John Bolton and former chairman of the Joint Chiefs of Staff General Mark Milley.\nThe letter also comes a day before House Speaker Mike Johnson hosts a congressional gold medal ceremony honouring the 13 service members killed in the chaotic Afghanistan withdrawal in August 2021.\nTrump and his fellow Republicans have tried to blame Ms Harris for the Afghanistan pull-out, with those in Congress issuing a report on Sept 9.\nThe retired military officials, in their letter, blamed Trump for “failing to take responsibility for his own role in putting service members in harm’s way”, noting his deal to free Taliban fighters without involving the Afghan government and for not leaving a withdrawal plan after he left office following his 2020 election loss. REUTERS", "url": "https://www.straitstimes.com/world/ten-former-top-us-military-officials-back-harris-call-trump-a-danger"}