{"authors": [], "date_download": "2024-10-12 13:42:17", "date_modify": "2024-10-12 13:42:17", "date_publish": "2024-09-17 13:46:00", "description": "The deluge, which coincides with a crucial crop season, is being blamed on global warming. Read more at straitstimes.com.", "filename": "world_west-african-floods-displace-24-million-and-deepen-food-crisis_1728740537.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/17/NIGER-WEATHER-FLOOD-111304.jpg?VersionId=iPqQdaNi8KNEtOUvgicMalyBhwUrEnOz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_west-african-floods-displace-24-million-and-deepen-food-crisis_1728740537.html", "title": "West African floods displace 2.4 million and deepen food crisis", "title_page": "West African floods displace 2.4 million and deepen food crisis | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ABUJA – West African floods have displaced at least 2.4 million people, killed about 1,000 and are devastating crops in a region that is already short of food and plagued by insecurity, according to assessments by four governments.\nThe heavy rain across the western half of the semi-arid Sahel zone, which borders the southern Sahara Desert from Africa’s west to east coasts, is likely to persist, according to the Famine Early Warning Systems Network.\nThe deluge in 2024, which coincides with a crucial crop season, is being blamed by researchers on global warming, who say rising temperatures are seeing the air store more water vapour.\n“The dramatic flooding that we’re currently seeing in West Africa coincides with the monsoon season,” said Mr Benjamin Sultan, a researcher at the French government’s Research Institute for Sustainable Development who is working on climate change with a focus on West Africa, in an interview.\n“It’s becoming more and more intense every year, causing deadly floods, as we’re seeing in the Sahel.”\nThe floods are hitting a region that’s among the least prepared globally for climate-related disasters, with little money available to buffer infrastructure against adverse weather.\nChad ranks last in an index of 187 countries assessed by the Notre Dame Global Adaptation Initiative for climate-change vulnerability, Mali 180th, Niger 176th and Nigeria 152nd.\nIn Chad, the floods have swept across almost the entire country, resulting in at least 340 deaths and rendering 1.5 million homeless, according to the government.\nAbout 160,000 dwellings have been destroyed, 260,000ha submerged and 60,000 livestock drowned.\n“With flooded farmland and drowned livestock, there will be a lot less food available now and in the future in a country where 3.4 million people already face acute hunger – the highest level of food insecurity ever recorded in Chad,” United Nations Office for the Coordination of Humanitarian Affairs spokesman Jens Laerke told a UN press briefing last week.\nNeighbouring Niger has also been hit hard with 130,000 made homeless and 273 killed, while Mali has recorded 62 deaths and 181,000 people are without shelter, according to the governments of the two nations.\nFood prices are rising in Niger as transport routes to markets become impassable.\n“I’ve never seen rain like this,” said Mr Mamadou Tidiani, a farmer with seven children in Niger’s Agadez region. “It’s too soon to say how much of the harvest that was destroyed, but I fear it will be bad.”\nNorthern Nigeria has not been spared either, with floods displacing more than 610,000 and killing 201, according to the World Health Organisation.\nMr Tahir Hamid Nguilin, Chad’s finance minister and chairman of the flooding prevention committee, has said the situation is unprecedented, especially in the northern part of the country, which is largely desert.\nMillet, corn, sorghum and rice production has been affected.\nA large part of the Sahara will get more than 500 per cent of its normal September rainfall, according to Severe Weather Europe, a blog that publishes weather forecasts.\nThe wet weather in western Africa coincides with torrential rain in European nations including Poland, Austria and Germany that has left several people dead. BLOOMBERG", "url": "https://www.straitstimes.com/world/west-african-floods-displace-24-million-and-deepen-food-crisis"}