{"authors": [], "date_download": "2024-10-12 13:48:59", "date_modify": "2024-10-12 13:48:59", "date_publish": "2023-02-04 14:44:19", "description": "FlightRadar24 has updated its label for the US object, adding it's \"not a Chinese balloon\". Read more at straitstimes.com.", "filename": "world_united-states_thousands-mistake-us-research-aircraft-viral-explosion-for-chinese-spy-balloon_1728740939.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/04/2023-02-03T142718Z1775055034RC2I2Z9AKFMQRTRMADP3USA-CHINA-SPY_13.JPG?VersionId=joxznoh7.HxeOGYrnSCqGYIZKqFeHCQh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_thousands-mistake-us-research-aircraft-viral-explosion-for-chinese-spy-balloon_1728740939.html", "title": "Thousands mistake ordinary US research aircraft for Chinese ‘spy’ balloon", "title_page": "Thousands mistake ordinary US research aircraft for Chinese ‘spy’ balloon | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – A high-altitude research balloon from the US is now among the world’s most-tracked aircraft, after thousands of internet users mistook it for the suspected Chinese surveillance balloon floating over the western state of Montana.\nMore than 4,000 users were following every move of “N257TH”, a standard high-altitude research balloon often released over the US, according to FlightRadar24.\nIn response, the popular aircraft-tracking website said in a tweet on Saturday that it updated its label for the US balloon, adding that the object was “not a Chinese balloon”.\nThe high-altitude Chinese balloon floating over the continental US has gripped the world’s attention and forced Secretary of State Antony Blinken to cancel his trip to Beijing.\nThe balloon is suspected to be part of a broader Chinese spying programme that’s seen many such devices sent over the US, including some during the Trump administration, according to officials in Washington.\nThe fate of the balloon, as it wafts 16km above ground, remains uncertain – as do the delicate relations between two superpowers grasping for ways to de-escalate tensions and get talks back on track.\nAuthorities in the city of Billings in southern Montana issued a statement refuting the veracity of a video purporting to show an explosion and the balloon crashing to the ground, after it went viral on Twitter and was shared by cable news networks. BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/thousands-mistake-us-research-aircraft-viral-explosion-for-chinese-spy-balloon"}