{"authors": [], "date_download": "2024-10-12 14:08:28", "date_modify": "2024-10-12 14:08:28", "date_publish": "2023-03-10 03:01:50", "description": "Ng was convicted of helping loot billions of dollars from Malaysia’s 1MDB sovereign wealth fund. Read more at straitstimes.com.", "filename": "world_united-states_ex-goldman-banker-roger-ng-sentenced-to-10-years-prison-in-1mdb-corruption-case_1728742108.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/10/Bloomberg20337268768_8.jpg?VersionId=fF_QPvmYqdNd1IsASs0brqpQHHhcSYgP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_ex-goldman-banker-roger-ng-sentenced-to-10-years-prison-in-1mdb-corruption-case_1728742108.html", "title": "Ex-Goldman banker Roger Ng sentenced to 10 years in prison over 1MDB corruption case", "title_page": "Ex-Goldman banker Roger Ng sentenced to 10 years in prison over 1MDB corruption case | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Former Goldman Sachs banker Roger Ng was sentenced to 10 years in prison on Thursday, after he was convicted of helping loot billions of dollars from Malaysia’s 1MDB sovereign wealth fund.\nA jury in Brooklyn federal court last April found Ng, Goldman’s former head of investment banking in Malaysia, guilty of helping his former boss, Tim Leissner, embezzle money from the fund, launder the proceeds and bribe government officials to win business.\nThe charges stem from some US$6.5 billion (S$8.78 billion) in bonds that Goldman helped 1MDB, which was founded to finance development projects in Malaysia, sell in 2012 and 2013.\nUS prosecutors said US$4.5 billion of that sum was embezzled by officials, bankers and their associates, in one of the biggest scandals in Wall Street history. The funds were used to buy high-end real estate, jewellery and artwork, and finance the Hollywood film The Wolf of Wall Street, according to the Department of Justice.\nUS District Judge Margo Brodie, who imposed the sentence, said Ng, 50, and his co-defendants “effectively stole money” meant for infrastructure and economic development projects to aid the Malaysian people.\n“There is a critical need to deter crimes of pure greed like this one,” Judge Brodie said.\nNg plans to appeal the sentence, his lawyer Marc Agnifilo told reporters after the hearing. Ng had pleaded not guilty and argued that US$35 million in kickback payments he was accused of receiving were actually a return on an investment his wife had made.\nThe scandal also rocked Malaysian politics. Former prime minister Najib Razak is serving a 12-year prison sentence after being convicted by a Malaysian court of receiving US$10 million from a former 1MDB unit.\nNajib has consistently denied wrongdoing.\nFederal prosecutors in Brooklyn had urged Judge Brodie to sentence Ng to 15 years in prison.\nIn a statement following the sentence, Mr Breon Peace, US Attorney for the Eastern District of New York said the punishment would show “there is a significant price to pay for corporate corruption”.\nNg requested no prison time and that he be allowed to return to Malaysia, where he spent six months in a Malaysian prison in conditions that his lawyer said nearly killed him and harmed his mental health.\nIn court on Thursday, Ng told Judge Brodie he wanted to go back to Malaysia to care for his ageing mother, and to be with his daughter.\nJudge Brodie said she takes the impact of sentencing on children seriously, but that Ng’s separation from his daughter was “not a unique circumstance”.\nLeissner had been Goldman’s South-east Asia chief. He pleaded guilty and testified against Ng as part of a cooperation agreement. He has not yet been sentenced.\nJho Low, a Malaysian financier and suspected mastermind of the scheme, was indicted alongside Ng in 2018 but remains at large.\nIn October 2020, Goldman agreed to pay US$2.9 billion and its Malaysian unit pleaded guilty to a corruption charge. REUTERS", "url": "https://www.straitstimes.com/world/united-states/ex-goldman-banker-roger-ng-sentenced-to-10-years-prison-in-1mdb-corruption-case"}