{"authors": [], "date_download": "2024-10-12 13:46:43", "date_modify": "2024-10-12 13:46:43", "date_publish": "2020-02-08 12:38:30", "description": "GENEVA - As experts raced against time to ascertain the severity of the coronavirus, the World Health Organisation (WHO) said on Friday (Feb 7) that Chinese data of about 17,000 cases shows 82 per cent of cases are deemed mild. Read more at straitstimes.com.", "filename": "world_europe_coronavirus-chinese-data-of-82-cases-are-mild-says-who_1728740803.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/02/08/nz_wuhanhosp_080220.jpg?VersionId=YpFiEUsTbsEKeApf18TYYEejyXbkw96j", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_coronavirus-chinese-data-of-82-cases-are-mild-says-who_1728740803.html", "title": "Coronavirus: Chinese data shows 82% of cases are mild, says WHO", "title_page": "Coronavirus: Chinese data shows 82% of cases are mild, says WHO | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GENEVA - As experts raced against time to ascertain the severity of the coronavirus, the World Health Organisation (WHO) said on Friday (Feb 7) that Chinese data of about 17,000 cases shows 82 per cent of cases are deemed mild.\nThe data also showed that only 15 per cent of the cases are severe and 3 per cent are deemed critical.\n\"That varies with age,\" Dr Maria Van Kerkhove, technical lead for the WHO's Health Emergencies Programme, said during a media briefing on Friday. \"The older you are, the higher the proportion of (severe) cases there are.\"\nPreviously, it was reported that 20 per cent of coronavirus cases were categorised as severe.\nOverall, the WHO said less than 2 per cent of patients infected with the virus have died, mostly due to multiple organ failures in elderly people and those with underlying health issues.\nOn Saturday, it was reported that the death toll in mainland China increased by 86 to 722, and is poised to pass the 774 deaths recorded globally during the 2002-2003 pandemic of Severe Acute Respiratory Syndrome (Sars).\nThe number of reported Sars cases was 8,098, suggesting a far lower transmission rate than the latest coronavirus, but a higher mortality rate.\nSo far only two deaths have been reported outside mainland China - in Hong Kong and the Philippines - from about 332 cases in 27 countries and regions.\nDespite the relatively low death rate, a paper published in the Journal of the American Medical Association (Jama) on Friday showed the spread of transmission.\nThe study found that a total of 138 patients got the virus in a period spanning January 1 to January 28, with hospital-associated transmission accounting for 41 percent of all cases.\nThe coronavirus, currently given the temporary name of 2019-nCoV, originated from the Chinese central city of Wuhan in December.\nThe first few cases were traced to a market where wildlife was also openly sold.\nAccording to the BBC, the coronavirus family itself can cause symptoms ranging from a mild cold all the way through to severe lung problems, which can kill.\nIn patients with coronavirus, it started with fever, followed by a dry cough and then, after a few days, shortness of breath.\nNotably, the infection rarely seems to cause a runny nose or sneezing, said the BBC.\nCountries around the world have taken precautions to stem the spread of the coronavirus, from closing borders to taking temperatures of travellers coming from areas with an outbreak of the epidemic.\nSome healthcare experts however said the rate of transmission for the coronavirus is not as severe as the seasonal flu or influenza.\nAccording to the Centres for Disease Control and Prevention (CDC), the flu caused an estimated 19 million illnesses in the US alone this season, as well as 180,000 hospitalisations and 10,000 deaths.\nThe CDC estimates that, on average, about 8 per cent of the US population gets sick with the flu each season. By contrast, there are currently only 12 cases of people afflicted with the coronavirus in the US.\nHowever, some have pointed out that scientists have studied the seasonal flu for years while the coronavirus is still a relative unknown.\n\"Despite the morbidity and mortality with influenza, there's a certainty … of seasonal flu,\" Dr Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said on Jan 31.\n\"I can tell you all, guaranteed, that as we get into March and April, the flu cases are going to go down. You could predict pretty accurately what the range of the mortality is and the hospitalisations (will be),\" Dr Fauci said.\n\"The issue now with (the coronavirus) is that there's a lot of unknowns.\"\nSources: Reuters, Agence France-Presse, BBC", "url": "https://www.straitstimes.com/world/europe/coronavirus-chinese-data-of-82-cases-are-mild-says-who"}