{"authors": [], "date_download": "2024-10-12 13:40:49", "date_modify": "2024-10-12 13:40:49", "date_publish": "2024-08-13 05:25:29", "description": "The 18-year-old suspect broadcast the attack live on X before police apprehended him. Read more at straitstimes.com.", "filename": "world_europe_five-injured-in-stabbing-at-mosque-in-turkey_1728740449.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/13/ST-logo-placeholder_24.jpg?VersionId=KvB4bay1ZiUj3gX6Oe6AnJfT_QAlKXxM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_five-injured-in-stabbing-at-mosque-in-turkey_1728740449.html", "title": "Five injured in stabbing at mosque in Turkey", "title_page": "Five injured in stabbing at mosque in Turkey | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ISTANBUL – A masked man wearing a helmet and bulletproof vest on Aug 12 stabbed at least five people outside a mosque in north-west Turkey before being detained by police, according to local media reports.\nThe 18-year-old suspect, armed with a long knife, broadcast the attack at the tea garden of a mosque in the city of Eskisehir live on X before police apprehended him, the local media reported.\nSome media agencies reported seven people had been injured.\n“The attacker was dressed like a person in a game, with an axe at his waist, wearing a bulletproof vest and a helmet, his face masked,” the news site Eskisehir Durum reported.\nImages he had taken of himself show that he wore goggles over his mask, completely concealing his face.\nSeveral news sites claimed he also wore a “black sun”, a Nazi symbol made up of several swastikas, on his chest.\nThe assailant did not shout or express any motivation for his actions, according to the daily Cumhuriyet, which claimed he was “influenced by war games”. AFP", "url": "https://www.straitstimes.com/world/europe/five-injured-in-stabbing-at-mosque-in-turkey"}