{"authors": [], "date_download": "2024-10-12 13:34:00", "date_modify": "2024-10-12 13:34:00", "date_publish": "2024-09-22 17:12:53", "description": "The US President plans to announce new executive action on gun violence soon. Read more at straitstimes.com.", "filename": "world_background-checks-blocked-thousands-of-gun-sales-to-youth-domestic-abusers-white-house-says_1728740040.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/22/US-JUSTICE-WEAPONS-140701.jpg?VersionId=..EpXIdrkSIcW8j6VMBIPm5ve53dqtrX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_background-checks-blocked-thousands-of-gun-sales-to-youth-domestic-abusers-white-house-says_1728740040.html", "title": "Background checks blocked thousands of gun sales to youth, domestic abusers in US: White House", "title_page": "Background checks blocked thousands of gun sales to youth, domestic abusers in US: White House | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Enhanced background checks have blocked thousands of gun sales to people under the age of 21 and those convicted of misdemeanour domestic violence crimes in the past year, said the White House on Sept 22.\nThis comes a year after President Joe Biden set up a new office to accelerate work on preventing gun violence.\nHomicides have dropped 17 per cent in the period, building on the largest-ever drop in homicides in 2023, the White House said.\nIt said data from the Gun Violence Archive showed that mass shootings were also down 20 per cent to date in 2024, compared with a year earlier, and would reach their lowest level in 2024 since 2019.\nThe Federal Bureau of Investigation has conducted more than 300,000 enhanced background checks of individuals aged under 21 as required under Mr Biden’s Bipartisan Safer Communities Act, which was signed into law in June 2022.\nIt denied more than 3,500 of those transactions, with the enhanced background checks alone responsible for nearly 900 blocked sales, the White House said. Background checks for those convicted of domestic violence crimes have blocked more than 4,600 sales so far in 2024.\nDr Stefanie Feldman, who heads the new office, said the progress reflected a wide range of efforts. This included dozens of executive actions since Mr Biden took office, increased collaboration among federal agencies, closer work with state and local governments, and increased funding for enforcement of existing laws and mental health programmes.\nShe told Reuters that Mr Biden and Vice-President Kamala Harris, the Democratic nominee in the Nov 5 presidential election, would announce additional executive action soon.\nDr Feldman declined to provide any details, but said the action involved some “wholly new ideas” and would take hard work to complete before Mr Biden leaves office in January.\nGun safety has been a big focus for Mr Biden and Ms Harris – both of whom are gun owners – since they took office in 2021.\nThe US surgeon-general declared gun violence a public health crisis in June, calling for more research funding, better mental health access, and other steps such as secure storage.\nDemocrats largely favour stricter gun laws as a way to reduce deaths from gun violence, while Republicans generally oppose stricter laws, citing the right to bear arms established in the US Constitution’s Second Amendment.\nDespite partisan divisions, Dr Feldman said her office had worked well with Republican state and local elected officials, and 17 states had passed legislation to address gun violence.\nThe office was also working with non-elected officials, including healthcare providers and executives, law enforcement and community leaders, some of whom might identify as Republican but shared a commitment to reduce gun violence.\n“The farther away you get from Washington, the less political this issue actually is,” she said. “Everyone wants their kid to come home from school safely. Everyone wants their kid to be able to go play in the neighbourhood and be safe.” REUTERS", "url": "https://www.straitstimes.com/world/background-checks-blocked-thousands-of-gun-sales-to-youth-domestic-abusers-white-house-says"}