{"authors": [], "date_download": "2024-10-12 13:36:27", "date_modify": "2024-10-12 13:36:27", "date_publish": "2023-10-08 00:45:04", "description": "At least 200 Israelis were reported killed and 1,100 wounded by gunbattles raging in more than 20 locations inside Israel. Read more at straitstimes.com.", "filename": "world_middle-east_gunmen-in-homes-and-captives-abducted-to-gaza-leave-israelis-in-shock__gl=1_1lpkwjx__gcl_au_OTIzMjI4NDMuMTY5Mzk0NjEzNg._1728740187.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/08/ISRAEL-PALESTINIAN-CONFLICT-162736_0.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_gunmen-in-homes-and-captives-abducted-to-gaza-leave-israelis-in-shock__gl=1_1lpkwjx__gcl_au_OTIzMjI4NDMuMTY5Mzk0NjEzNg._1728740187.html", "title": "‘Sea of bodies’ in Israel, scores dead in Gaza as shock Hamas attack unleashes war", "title_page": "‘Sea of bodies’ in Israel, scores dead in Gaza as shock Hamas attack unleashes war | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM/GAZA/SDEROT - Gunmen from the Palestinian group Hamas rampaged through Israeli towns on Saturday killing and capturing scores of civilians and soldiers in a surprise assault, met by Israel with massive retaliatory air strikes that killed scores in the Gaza Strip.\nThe worst attack on Israel for decades unleashed a war that both sides vowed to escalate. At least 200 Israelis were reported killed and 1,100 wounded by gunbattles raging in more than 20 locations inside Israel.\nIn Gaza, health officials reported more than 230 people killed and 1,600 wounded.\n“Our enemy will pay a price the type of which it has never known,” Prime Minister Benjamin Netanyahu said. “We are in a war and we will win it”.\nHamas leader Ismail Haniyeh said the assault that had begun in Gaza would spread to the West Bank and Jerusalem.\n“This was the morning of defeat and humiliation upon our enemy, its soldiers and its settlers,” he said in a speech. “What happened reveals the greatness of our preparation. What happened today reveals the weakness of the enemy.”\nIn Sderot, in southern Israel near Gaza, bodies of Israeli civilians lay strewn across a highway, surrounded by broken glass. A woman and a man were sprawled out dead across the front seats of a car. A military vehicle drove past the bodies of another woman and a man in a pool of blood behind another car.\n“I went out, I saw loads of bodies of terrorists, civilians, cars shot up. A sea of bodies, inside Sderot along the road, other places, loads of bodies,” said Shlomi from Sderot.\nTerrified Israelis, barricaded into safe rooms, recounted their plight by phone on live TV.\n“They just came in again, please send help,” a woman identified as Dorin told Israel’s N12 News from Nir Oz, a kibbutz near Gaza. “My husband is holding the door closed... They are firing rounds of bullets.”\nMs Esther Borochov, who fled a dance rave party attacked by the gunmen, told Reuters she survived by playing dead in a car after the driver trying to help her escape was shot point blank.\n“I couldn’t move my legs,” she told Reuters at the hospital. “Soldiers came and took us away to the bushes.”\nIn Gaza, black smoke and orange flames billowed into the evening sky from a high rise tower hit by an Israeli retaliatory strike. Crowds of mourners carried the bodies of freshly killed militants through the streets, wrapped in green Hamas flags.\nGaza’s dead and wounded were carried into crumbling and overcrowded hospitals with severe shortages of medical supplies and equipment. The health ministry said 232 people had been killed.\nStreets were deserted apart from ambulances racing to the scenes of air strikes. Israel cut the power, plunging the city into darkness.\n‘Day of the greatest battle’\nBy nightfall on Saturday in southern Israel, residents had yet to be given the all-clear to leave the shelters where they had hidden from the gunmen since the early hours.\n“It’s not over because the (army) hasn’t said the kibbutz is clear of terrorists,” Mr Dani Rahamim told Reuters by telephone from the shelter where he was still hiding in Nahal Oz, close to the Gaza fence. Gunfire had subsided but regular explosions could still be heard.\nHamas said it fired a volley of 150 rockets towards Tel Aviv on Saturday evening in retaliation for an Israeli air strike that took down a high rise building with more than 100 apartments.\nHamas has since fought four wars against Israel since seizing control of Gaza in 2007. But the scenes of violence inside Israel itself were unlike anything seen since the suicide bombings of the Palestinian Intifada uprising two decades ago.\nThat Israel was caught completely off guard was lamented as one of the worst intelligence failures in its history, a shock to a nation that boasts of its intensive infiltration and monitoring of militants.\nIn Gaza, a narrow strip where 2.3 million Palestinians have lived under an Israeli blockade for 16 years, residents rushed to buy supplies in anticipation of days of war ahead. Some evacuated their homes and headed for shelters.\nScores of Palestinians were killed and hundreds wounded in clashes at the border into Israel, where fighters captured the crossing point and tore down fences. Some of those dead were civilians, among crowds that attempted to cross into Israel through the damaged gates.\n“We are afraid,” Palestinian Amal Abu Daqqa told Reuters, as she left her house in Khan Younis.\nBiden offers support\nWestern countries, led by the United States, denounced the Palestinian attack and pledged support for Israel.\n“I made clear to Prime Minister Netanyahu that we stand ready to offer all appropriate means of support to the Government and people of Israel,” US President Joe Biden said, in a statement issued after the two men spoke on a call.\n“Israel has a right to defend itself and its people. The United States warns against any other party hostile to Israel seeking advantage in this situation,” Mr Biden added.\nAcross the Middle East, there were demonstrations in support of Hamas, with Israeli and US flags set on fire and marchers waving Palestinian flags in Iraq, Lebanon, Syria and Yemen.\nThe Hamas attack was openly praised by Iran and by Hezbollah, Iran’s Lebanese allies.\nUN Middle East peace envoy Tor Wennesland condemned the attacks on Israel, warning in a statement: “This is a dangerous precipice, and I appeal to all to pull back from the brink.”\nBackdrop of surging violence\nThe escalation comes against a backdrop of surging violence between Israel and Palestinian militants in the Israeli occupied West Bank, where a Palestinian authority exercises limited self-rule, opposed by Hamas that wants Israel destroyed.\nIn the West Bank, there were clashes in several locations on Saturday, with stone throwing youths confronting Israeli troops. Four Palestinians including a 13-year-old boy were killed. Palestinian factions called a general strike for Sunday.\nIsrael itself has been experiencing internal political upheaval, with the most right-wing government in its history attempting to overhaul the judiciary.\nMeanwhile, Washington has been trying to strike a deal that would normalise ties between Israel and Saudi Arabia, seen by Israelis as the biggest prize yet in their decades-long for Arab recognition. Palestinians fear any such deal could sell out their future dreams of an independent state. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/gunmen-in-homes-and-captives-abducted-to-gaza-leave-israelis-in-shock?_gl=1*1lpkwjx*_gcl_au*OTIzMjI4NDMuMTY5Mzk0NjEzNg.."}