{"authors": [], "date_download": "2024-10-12 14:02:35", "date_modify": "2024-10-12 14:02:35", "date_publish": "2023-05-19 12:04:57", "description": "The visit is particularly symbolic given Russia’s periodic threats to use atomic weapons in Ukraine. Read more at straitstimes.com.", "filename": "world_zelensky-set-to-visit-japan-leaders-start-summit_1728741755.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/19/UKRAINECORRUPTION_1.JPG?VersionId=iQu6Uq3Ai.v4J1rMt4Bjfc_OCogq0Jsj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_zelensky-set-to-visit-japan-leaders-start-summit_1728741755.html", "title": "Ukraine’s Zelensky to visit Hiroshima G-7 summit in person", "title_page": "Ukraine’s Zelensky to visit Hiroshima G-7 summit in person | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TOKYO – Ukrainian President Volodymyr Zelensky will travel to Hiroshima, Japan, to join the Group of Seven (G-7) leaders in person, according to people familiar with the plans.\nMr Zelensky will fly on a United States military plane to Japan after an expected stop in Saudi Arabia to attend the Arab League summit, said the people, who asked not to be identified discussing confidential information.\nA spokesman for the US National Security Council declined to comment.\nJapanese officials had previously said Mr Zelensky would join the others virtually, even while they added an extra session on Ukraine on Sunday to accommodate the Ukrainian leader’s schedule.\nA spokesman for Japan’s Foreign Ministry declined to comment further on Friday.\nThe visit to Hiroshima, ground zero for the first nuclear attack 78 years ago, is particularly symbolic given Russian President Vladimir Putin’s periodic threats to use atomic weapons in Ukraine.\nG-7 leaders will hold talks on further responses to Russia’s invasion of Ukraine during meetings that began on Friday.\nBloomberg reported that the nations will agree to work together to track Russian diamonds, but stop short of slapping Moscow with an outright ban on the lucrative gem trade.\nBarrages of sanctions have crimped growth but failed to deter Mr Putin’s military assault on Ukraine, and Russia’s economy has been underpinned by commodity and energy exports to countries outside the G-7.\nOver the past week, Mr Zelensky toured European capitals to make the case for more weapons deliveries.\nHis trip to Berlin coincided with Germany announcing its largest aid package yet, and British Prime Minister Rishi Sunak pledged support for a coalition to help provide Ukraine with Western-made fighter jets, though no concrete plans were set.\nIt is still not clear whether US President Joe Biden would sign off on sending American jets as well.\nAlthough Ukraine has sought more advanced fighter jets since the first days of Russia’s invasion in 2022, Western governments have resisted the requests over concerns about the risk of escalating tensions with Moscow. BLOOMBERG", "url": "https://www.straitstimes.com/world/zelensky-set-to-visit-japan-leaders-start-summit"}