{"authors": [], "date_download": "2024-10-12 13:39:05", "date_modify": "2024-10-12 13:39:05", "date_publish": "2024-09-24 06:00:00", "description": "Terrified Lebanese families flee massive Israeli bombardment Families from south Lebanon clogged the highways north on Sept 23, fleeing an expanding Israeli bombardment for an uncertain future with children crammed onto parents’ laps, suitcases tied to car roofs and dark smoke rising behind them. Read more at straitstimes.com.", "filename": "world_while-you-were-sleeping-5-stories-you-might-have-missed-sept-24-6_1728740345.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/btlebanon20240924_0.jpg?VersionId=ICTn9LDH3rd33OhhdgmbdtD2yXKOp4h6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_while-you-were-sleeping-5-stories-you-might-have-missed-sept-24-6_1728740345.html", "title": "While You Were Sleeping: 5 stories you might have missed, Sept 24", "title_page": "While You Were Sleeping: 5 stories you might have missed, Sept 24 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Terrified Lebanese families flee massive Israeli bombardment\nFamilies from south Lebanon clogged the highways north on Sept 23, fleeing an expanding Israeli bombardment for an uncertain future with children crammed onto parents’ laps, suitcases tied to car roofs and dark smoke rising behind them.\nCountless cars, vans and pick-up trucks were loaded with belongings and filled with people, sometimes several generations to a vehicle, while other families had fled fast, taking only the bare essentials as bombs rained down from above.\n“When the strikes happened in the morning on the houses I grabbed all the important papers and we got out. Strikes all around us. It was terrifying,” said Abed Afou whose village of Yater was hit heavily in the dawn barrage.\nREAD MORE HERE\nRussians denying medical care to Ukraine prisoners: UN experts\nJails controlled by Russia are deliberately withholding medical care for Ukrainian prisoners, with doctors in one prison even taking part in what it called “torture”, a commission mandated by the UN rights council.\nThe commission, set up by the Human Rights Council to investigate violations in Ukraine since Russia’s invasion, had already concluded that Moscow’s occupying forces were using torture “systematically”.\nBut in his oral report to the council, commission chair Erik Mose said torture had become a “common and acceptable practice”, with Russian authorities acting with “a sense of impunity”.\nREAD MORE HERE\nAmazon forest has lost an area the size of Germany and France\nThe world’s biggest rainforest, the Amazon, has lost an area about the size of Germany and France combined to deforestation in four decades, a study showed on Sept 23.\nThe South American jungle, spanning nine countries, is seen as crucial to the fight against climate change due to its ability to absorb planet-warming carbon dioxide from the atmosphere.\nDeforestation, mainly for mining and agricultural purposes, has led to the loss of 12.5 per cent of the Amazon’s plant cover from 1985 to 2023, according to RAISG, a collective of researchers and NGOs.\nREAD MORE HERE\nWorld’s oceans near critical acidification level: Report\nThe world’s oceans are close to becoming too acidic to properly sustain marine life or help stabilise the climate, a new report said on Sept 23.\nThe report by the Potsdam Institute for Climate Impact Research (PIK) details nine factors that are crucial for regulating the planet’s ability to sustain life.\nIn six of these areas, the safe limit has already been exceeded in recent years as a result of human activity.\nREAD MORE HERE\nMan City’s Rodri ‘out for season’ after ACL injury: Reports\nManchester City and Spain midfielder Rodri could miss the rest of the season due to an anterior cruciate ligament injury, according to reports in Spain on Sept 23.\nThe 28-year-old limped off during City’s 2-2 draw against Arsenal in the Premier League on Sept 22 after going down holding his right knee.\nESPN and Spanish sports daily Marca reported that tests on Sept 23 have confirmed an ACL tear.\nREAD MORE HERE", "url": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-sept-24-6"}