{"authors": [], "date_download": "2024-10-12 14:00:00", "date_modify": "2024-10-12 14:00:00", "date_publish": "2022-10-29 19:10:05", "description": "Former naval lieutenant Sophie Brook said a male colleague climbed into her bed when she was asleep and kissed her. Read more at straitstimes.com.", "filename": "world_europe_uk-navy-probes-claims-of-sexual-harassment-on-submarines_1728741600.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/29/2022-09-19T113923Z232208457RC2AKW9AK6ESRTRMADP3BRITAIN-ROYALS-QUEEN.JPG?VersionId=BwLPs4jWBVI7sjsGWePbFA.M2d6_cavW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_uk-navy-probes-claims-of-sexual-harassment-on-submarines_1728741600.html", "title": "UK navy probes claims of sexual harassment on submarines", "title_page": "UK navy probes claims of sexual harassment on submarines | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - The head of the British Royal Navy has announced a probe after several whistle-blowers made allegations of widespread sexual harassment of female staff on submarines.\nThe Daily Mail on Saturday published a story based on an interview with Ms Sophie Brook, a former naval lieutenant, who described a “constant campaign of sexual bullying” including male crew members putting the names of female colleagues on a “rape list”.\nThe article also quoted two unnamed whistle-blowers who backed her account.\nFirst Sea Lord Ben Key, the professional head of the navy, said in a statement to the newspaper that he had called for an investigation to be carried out by his senior team and was “deeply disturbed” by the “abhorrent” allegations.\n“Sexual assault and harassment has no place in the Royal Navy and will not be tolerated,” Mr Key said, and anyone found culpable would “be held accountable” regardless of rank.\nMs Brook, 30, had been tipped to become a submarine commander but became suicidal and self-harmed as a result of the culture on board and was ultimately dismissed by the navy.\nThe Royal Navy’s submarine service only began admitting women in 2011.\nMale superiors would routinely address her using a sexual obscenity and put their penises in her pocket, Ms Brook said.\nShe learnt she was No. 6 on a list of which female crew members would be raped first in the event of a catastrophe.\nA married colleague exposed himself to her and another climbed into her bed when she was asleep and started kissing her, she said.\nOne woman who formally complained about naked pictures of women on display in a working area was “frozen out” and unable to advance, Ms Brook said.\nShe began self-harming at 21, two years after joining the navy.\nAfter needing stitches for one injury, the doctor asked for her to be taken off duties, but she was put on watch immediately afterwards with “total responsibility” for the nuclear submarine, she said.\nMs Emma Norton, director of the Centre for Military Justice, a charity that gives legal aid to victims of harassment, told Sky News that only around 10 per cent of women who experience serious bullying and harassment in the service make a formal complaint because “they have no faith that they’ll get any kind of justice or a fair hearing”.\nMs Norton said the Royal Navy had failed to act on repeated recommendations for greater independent oversight into such complaints.\nA retired navy rear admiral, Mr Chris Parry, told the BBC: “Some of the sexualised behaviour that we see in the normal working place is transferred to submarines, as you would expect”. AFP", "url": "https://www.straitstimes.com/world/europe/uk-navy-probes-claims-of-sexual-harassment-on-submarines"}