{"authors": [], "date_download": "2024-10-12 13:31:27", "date_modify": "2024-10-12 13:31:27", "date_publish": "2024-08-26 07:41:00", "description": "Rescuers have a ‘good feeling’ on where the two trapped tourists might be, but the operation is complicated. Read more at straitstimes.com.", "filename": "world_europe_two-hurt-two-missing-after-ice-cave-collapses-in-iceland-police_1728739887.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/26/iStock-1313731079.jpg?VersionId=_YRR5SeTEDQRfxAuuzAILu10pAK5oHxj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_two-hurt-two-missing-after-ice-cave-collapses-in-iceland-police_1728739887.html", "title": "1 dead, 2 others trapped after ice wall collapses during group tour in Iceland", "title_page": "1 dead, 2 others trapped after ice wall collapses during group tour in Iceland | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "REYKJAVIK – One person died, two remained trapped and one was injured after an ice canyon wall collapsed on Aug 25 during a group tour of a glacier in south-eastern Iceland, the authorities said.\nEmergency responders received a call at about 3pm that a group of about 25 tourists with a tour guide were exploring ice caves and canyons on the glacier, Breidamerkurjokull, when the side of an ice canyon gave way, said Mr Jon Víglundsson, a spokesman for Ice-Sar, a volunteer search-and-rescue association.\nThe glacier is part of Vatnajokull National Park, one of Europe’s largest, spread across nearly 14,140 sq km.\nFour people were hit by the falling ice, a local police force, said on Facebook, adding that two of them were rescued.\nOne victim was pronounced dead at the scene and the other was airlifted to Landspitalinn, the National University Hospital of Iceland, and was in stable condition, the agency said on Facebook late in the evening on Aug 25.\nTwo people remained trapped, the agency said, and their conditions were unclear.\nA search-and-rescue effort to find the missing tourists was suspended late on Aug 25, the authorities said.\n“Conditions during the search are difficult and darkness is now upon us,” the agency said, adding that it was dangerous to continue the search through the night.\nThe search will resume in the morning, police said.\nOthers in the group remained uninjured, according to police.\nIt was unclear on Aug 25 evening where the tourists were from, which tour company organised the expedition, or how many guides were on the trip.\nAt least 150 people were involved in the search-and-rescue efforts, Mr Víglundsson said.\nCrews had a “good feeling” on where the two trapped tourists might be, he said, but the operation was complicated.\n“Although we think we know the location of the two missing, it is hard to say what amount of ice is between them and the rescuers,” Mr Víglundsson said. “It is a difficult situation.”\nDue to the precarious location on the glacier, teams could not use heavy equipment and were instead using hacksaws, chainsaws and ice picks to move the ice by hand to “clear a path” forward, Mr Víglundsson said.\nCrews were working in teams of 12 and in shifts, he said.\nAccording to the US Geological Survey, Breidamerkurjokull is an outlet glacier that extends from Vatnajokull, Iceland’s largest glacier, into the Jokulsarlon glacial lagoon.\nBreidamerkurjokull is famous for its ice caves. The best time to visit is in winter, according to Adventures.is, an Icelandic tour operator.\nIcelandic online newspaper Vísir reported that tourism companies that had signed a contract with the national park were authorised to organise ice cave trips and glacier walks year-round, and that the park “trusts companies to assess the conditions”. NYTIMES", "url": "https://www.straitstimes.com/world/europe/two-hurt-two-missing-after-ice-cave-collapses-in-iceland-police"}