{"authors": [], "date_download": "2024-10-12 13:45:19", "date_modify": "2024-10-12 13:45:19", "date_publish": "2022-12-14 08:15:00", "description": "A satellite mission is expected to collect measurements in high-definition detail. Read more at straitstimes.com.", "filename": "world_united-states_nasa-to-conduct-first-global-water-survey-from-space_1728740719.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/14/2022-12-13T221043Z1363136121RC2A5Y9YWXHWRTRMADP3SPACE-EXPLORATION-WATER_3.JPG?VersionId=wHLhtwX7o8LkHQMyOWuAlCQh9rfESm2p", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_nasa-to-conduct-first-global-water-survey-from-space_1728740719.html", "title": "Nasa to conduct first global water survey from space", "title_page": "Nasa to conduct first global water survey from space | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES - An international satellite mission led by the National Aeronautics and Space Administration is set for blast-off from Southern California early on Thursday on a major earth science project to conduct a comprehensive survey of the world’s oceans, lakes and rivers for the first time.\nDubbed Swot, short for Surface Water and Ocean Topography, the advanced radar satellite is designed to give scientists an unprecedented view of the liquid covering 70 per cent of the planet, shedding new light on the mechanics and consequences of climate change.\nA Falcon 9 rocket, owned and operated by billionaire Elon Musk’s commercial launch company SpaceX, is set to lift off before dawn on Thursday from the Vandenberg Space Force Base, about 275km north-west of Los Angeles, to carry Swot into orbit.\nIf all goes as planned, the SUV-sized satellite will produce research data within several months.\nNearly 20 years in development, Swot incorporates advanced microwave radar technology that scientists say will collect height-surface measurements of oceans, lakes, reservoirs and rivers in high-definition detail.\nThe data, compiled from radar sweeps of the planet at least twice every 21 days, will enhance ocean-circulation models, bolster weather and climate forecasts and aid in managing scarce freshwater supplies in drought-stricken regions, according to researchers.\nThe satellite was designed and built at Nasa’s Jet Propulsion Laboratory (JPL) near Los Angeles. Developed by the US space agency with its counterparts in France and Canada, Swot was one of 15 missions listed by the National Research Council as projects Nasa should undertake in the coming decade.\n“It’s really the first mission to observe nearly all water on the planet’s surface,” said JPL scientist Ben Hamlington, who also leads Nasa’s sea-level change team.\nOne major thrust of the mission is to explore how oceans absorb atmospheric heat and carbon dioxide in a natural process that moderates global temperatures and climate change.\nScanning the seas from orbit, Swot is designed to precisely measure fine differences in surface elevations around smaller currents and eddies, where much of the oceans’ drawdown of heat and carbon is believed to occur. And Swot can do so with 10 times greater resolution than existing technologies, according to JPL.\nLooking for ocean’s tipping point\nOceans are estimated to have absorbed more than 90 per cent of the excess heat trapped in earth’s atmosphere by human-caused greenhouse gas emissions.\nStudying the mechanism by which that happens will help climate scientists answer a key question – “What is the turning point at which oceans start releasing, rather than absorbing, huge amounts of heat back into the atmosphere and accelerate global warming, rather than limiting it,” said Dr Nadya Vinogradova Shiffer, Swot’s programme scientist at Nasa in Washington.\nSwot’s ability to discern smaller surface features will also be used to study the impact of rising ocean levels on coastlines.\nMore precise data along tidal zones would help predict how far storm-surge flooding may penetrate inland, as well as the extent of saltwater intrusion into estuaries, wetlands and underground aquifers.\nFreshwater bodies are another key focus for Swot, which is equipped to observe the entire length of nearly all rivers wider than 100m, as well as more than one million lakes and reservoirs larger than 62,500 sq m.\nTaking inventory of earth’s water resources repeatedly over Swot’s three-year mission will enable researchers to better trace fluctuations in rivers and lakes during seasonal changes and major weather events.\nNasa’s Swot freshwater science lead Tamlin Pavelsky said collecting such data is akin to “taking the pulse of the world’s water system, so we’ll be able to see when it’s racing, and we’ll be able to see when it’s slow”.\nSwot’s radar instrument operates at the so-called Ka-band frequency of the microwave spectrum. It allows scans to penetrate cloud cover and darkness over wide swathes of the earth.\nThis enables scientists to accurately map their observations in two dimensions regardless of weather or time of day and to cover large geographic areas far more quickly than before.\nBy comparison, previous studies of water bodies relied on data taken at specific points, such as river or ocean gauges, or from satellites that can track measurements only along a one-dimensional line, requiring scientists to fill in data gaps through extrapolation.\n“Rather than giving us a line of elevations, it’s giving us a map of elevations, and that’s just a total game changer,” said Dr Pavelsky. REUTERS", "url": "https://www.straitstimes.com/world/united-states/nasa-to-conduct-first-global-water-survey-from-space"}