{"authors": [], "date_download": "2024-10-12 13:39:22", "date_modify": "2024-10-12 13:39:22", "date_publish": "2024-09-18 18:21:54", "description": "MOSCOW - The Kremlin on Wednesday described as \\\"dangerous\\\" comments by Jens Stoltenberg, the outgoing head of NATO, that a decision by the West to allow Ukraine to use Western long-range weapons to strike Russia would not be a red line that would prompt an escalation by Moscow. Read more at straitstimes.com.", "filename": "world_europe_kremlin-calls-stoltenbergs-comments-on-missile-strikes-on-russia-dangerous_1728740362.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/18/LYNXMPEK8H0B9-2.jpg?VersionId=UgqdNWZuYQgdjlymMUsPM7je9LctF7SD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_kremlin-calls-stoltenbergs-comments-on-missile-strikes-on-russia-dangerous_1728740362.html", "title": "Kremlin calls Stoltenberg's comments on missile strikes on Russia 'dangerous'", "title_page": "Kremlin calls Stoltenberg's comments on missile strikes on Russia 'dangerous' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - The Kremlin on Wednesday described as \"dangerous\" comments by Jens Stoltenberg, the outgoing head of NATO, that a decision by the West to allow Ukraine to use Western long-range weapons to strike Russia would not be a red line that would prompt an escalation by Moscow.\nUkrainian President Volodymyr Zelenskiy has been pleading with allies for months to let Ukraine fire Western missiles including long-range U.S. ATACMS and British Storm Shadows into Russia to limit Moscow's ability to launch attacks.\nIn an interview with The Times published on Tuesday, Stoltenberg dismissed a warning by Russian President Vladimir Putin last week that letting Ukraine use such weapons to strike deep inside Russian territory would mean the West was directly fighting Russia.\n\"There have been many red lines declared by him before, and he has not escalated, meaning also involving NATO allies directly in the conflict,\" said Stoltenberg, whose tenure as head of the military alliance ends in October.\n\"He has not done so, because he realises that NATO is the strongest military alliance in the world. They also realise that nuclear weapons, nuclear war, cannot be won and should not be fought. And we have made that very clear to him several times.\"\nKremlin spokesman Dmitry Peskov told reporters that Stoltenberg's remarks were dangerous.\n\"This ostentatious desire not to take seriously the Russian president's statements is a move that is completely short-sighted and unprofessional,\" said Peskov.\nStoltenberg's position is \"extremely provocative and dangerous,\" Peskov added.\nA senior NATO military official said over the weekend that Ukraine would have good military reason to strike deeper into Russia using Western weapons. Kyiv's allies, including the United States and Britain, are currently discussing whether to give Kyiv a green light to do so.\nSenior Russian politicians and foreign policy hawks have suggested that Moscow could respond with nuclear weapons. The head of Russia's nuclear testing site said on Tuesday that his facility was ready to resume testing \"at any moment.\" Russia has the world's largest nuclear arsenal.\nIn the course of the war, Washington and its allies have increased military aid to Ukraine in ways that were unthinkable when it started, including by providing tanks, advanced missiles and F-16 fighter jets.\nThat has prompted some Western politicians to suggest Putin's nuclear rhetoric is a bluff and that the U.S. and NATO should go all-out to help Ukraine win the war. Zelenskiy has said Ukraine's incursion into Russia, launched on Aug. 6, makes a mockery of Putin's red lines. REUTERS", "url": "https://www.straitstimes.com/world/europe/kremlin-calls-stoltenbergs-comments-on-missile-strikes-on-russia-dangerous"}