{"authors": [], "date_download": "2024-10-12 13:59:51", "date_modify": "2024-10-12 13:59:51", "date_publish": "2023-12-16 04:17:48", "description": "French actor Gerard Depardieu's Legion d'Honneur medal is under review following a string of allegations about sexual aggression and a TV documentary in which he was heard making lewd comments about women. Read more at straitstimes.com.", "filename": "world_europe_france-to-review-actor-depardieus-legion-dhonneur-medal-following-allegations_1728741591.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/16/LYNXMPEJBE0O1-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_france-to-review-actor-depardieus-legion-dhonneur-medal-following-allegations_1728741591.html", "title": "France to review actor Depardieu's Legion d'Honneur medal following allegations", "title_page": "France to review actor Depardieu's Legion d'Honneur medal following allegations | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - French actor Gerard Depardieu's Legion d'Honneur medal is under review following a string of allegations about sexual aggression and a TV documentary in which he was heard making lewd comments about women.\nFrench Culture Minister Rima Abdul Malak said on France 5 television she had asked the \"grande chancellerie\" committee in charge of the Legion d'Honneur - France's highest decoration - to start a disciplinary procedure to review whether the medal should be suspended or withdrawn.\nAbdul Malak said she was \"disgusted\" by comments made by Depardieu, one of France's most famous actors, during a 2018 trip to North Korea and broadcast in a \"Complement d'Enquete\" TV documentary on France 2 earlier this month.\n\"Shocking comments ... bringing shame on France,\" she said.\nDepardieu has been the focus of a string of accusations of sexism and sexual violence in recent years.\nIn March 2022, a Paris court ruled it would press ahead with an investigation into Depardieu after an actress accused him of rape. Charlotte Arnould had revealed that she was the woman behind the accusation, saying that she could not bear to remain silent any longer. Since then, more than 10 women have accused Depardieu of sexual violence.\nDepardieu, through his lawyer, has previously \"firmly rejected\" the accusations.\nIn an Oct. 2 letter published in French daily Le Figaro, Depardieu denied all blame.\n\"Never, absolutely never, have I abused a woman,\" he wrote.\nDepardieu has starred in scores of French-language movies, rising to prominence in 1974 with \"Going Places\", and gaining international recognition with a starring role in the 1990 English-language comedy \"Green Card\". He won a Golden Globe best actor award for that role.\nHis performance in the French-language \"Cyrano de Bergerac\" that same year won him the award for best male performance at the Cannes film festival, and a nomination in the best leading actor category at the 1990 Academy Awards. REUTERS", "url": "https://www.straitstimes.com/world/europe/france-to-review-actor-depardieus-legion-dhonneur-medal-following-allegations"}