{"authors": [], "date_download": "2024-10-12 14:02:24", "date_modify": "2024-10-12 14:02:24", "date_publish": "2023-04-03 20:13:47", "description": "The battle for the mining city and logistics hub of Bakhmut has been one of the bloodiest of the conflict. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-its-forces-fight-on-in-bakhmut-mocks-russian-claim-to-have-captured-city_1728741744.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/04/UKRAINE-RUSSIA-CONFLICT-WAR-140214_1.jpg?VersionId=r0Sl7P9gAodai5kcwNfmaUWk_g4X82zx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-its-forces-fight-on-in-bakhmut-mocks-russian-claim-to-have-captured-city_1728741744.html", "title": "Ukraine mocks Russian claim to have taken Bakhmut, says attacks repelled", "title_page": "Ukraine mocks Russian claim to have taken Bakhmut, says attacks repelled | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Kyiv scorned Russian claims to have captured eastern Bakhmut on Monday, saying its foes had raised a victory flag over “some kind of toilet” and that Ukrainian forces had repelled nearly 20 attacks along the city’s front line in the last 24 hours.\nThe battle for the mining city and logistics hub of Bakhmut has been one of the bloodiest of the conflict, now in its second year, with many casualties on both sides and the city largely destroyed by bombardments.\nMr Yevgeny Prigozhin, head of the Wagner mercenary force spearheading the siege, said on Sunday that his troops had raised a Russian flag on the city centre administrative building even though Ukrainian soldiers still held some western positions.\n“From a legal point of view, Bakhmut has been taken,” said Mr Prigozhin, who has previously made premature claims.\nBut Ukraine’s military said fighting was still raging around the city council building, as well as in other nearby towns.\n“Bakhmut is Ukrainian and they have not captured anything and are very far from doing that,” Mr Serhiy Cherevatyi, spokesman for the eastern military command, told Reuters.\n“They raised the flag over some kind of toilet. They attached it to the side of who knows what, hung their rag and said they had captured the city. Well good, let them think they’ve taken it,” Mr Cherevatyi added by telephone.\nThe Ukrainian armed forces General Staff said in an evening statement that 45 enemy attacks had been repelled in total in the last 24 hours, with Bakhmut at the “epicentre of operations” along with the cities of Avdiivka and Maryinka farther south.\n“The enemy is attempting to take under full control the city of Bakhmut,” it said on Facebook. “Ukrainian forces repelled nearly 20 enemy attacks along the front line.”\nMr John Kirby, a spokesman for the United States National Security Council, told reporters in Washington that Ukraine was still fighting hard for Bakhmut, describing the battles as “quite, quite violent and quite close”.\n“Even if the Russians do get it, it isn’t going to change the battlefield dynamics from a strategic perspective,” he said.\nReuters could not verify the battlefield reports.\nLying on the edge of a chunk of Donetsk province under Russian control, Bakhmut had a population of 70,000 before Moscow invaded Ukraine in February 2022.\nRussian forces, bogged down in a war of attrition after a series of setbacks, are seeking a victory from their winter offensive but have suffered huge casualties around Bakhmut.\nUkrainian military commanders have said their own counter-offensive – backed by newly delivered Western tanks and other hardware – is not far off, but have stressed the importance of holding Bakhmut and inflicting losses in the meantime.\nFinland, which shares a 1,300km border with Russia, will join Nato on Tuesday, marking the completion of a swift journey into the Western military alliance following Russia’s invasion of Ukraine, officials said.\nIn response, Russian Deputy Foreign Minister Alexander Grushko said Russia would strengthen military capacity in its western and north-western regions, state-owned news agency RIA reported.\n“In the event that the forces and resources of other Nato members are deployed in Finland, we will take additional steps to reliably ensure Russia’s military security,” he told RIA.\nIn warnings to the West against arming Ukraine, Russian officials increasingly play up the risks of nuclear weapons being used in the war, and said in March that they would station tactical nuclear weapons in neighbouring Belarus.\nMoscow’s ambassador to Minsk said on Sunday that Russia would move nuclear weapons close to its western border with Belarus – a move that would place them at Nato’s threshold.\nThe head of the International Atomic Energy Agency, Mr Rafael Grossi, will visit Moscow on Wednesday, a Russian envoy said.\nMr Grossi would meet a Russian delegation and discuss the Zaporizhzhia nuclear power station, located in a Russian-controlled part of Ukraine, near the front line of fighting between Russian and Ukrainian forces.\nRussia calls its invasion of Ukraine a “special military operation”, claiming Kyiv’s ties to the West posed a security threat. Kyiv and the West call the war an unprovoked assault to subdue an independent country.\nTens of thousands of Ukrainian civilians and soldiers on both sides have been killed. Russia has destroyed Ukrainian cities and forced millions of people to flee their homes, and it claims to have annexed nearly a fifth of Ukraine.\nIn Moscow, the Kremlin accused Ukraine of organising the murder of prominent war blogger Vladlen Tatarsky on Sunday in a St Petersburg cafe and charged a 26-year-old Russian woman, Darya Trepova, with terrorism offences over the killing.\nUkrainian President Volodymyr Zelensky on Monday paid tribute to nearly 400 residents of the village of Yahidne in north Ukraine who were held in a school basement under Russian occupation for 27 days before they were set free a year ago.\nAsked about a Ukrainian counter-offensive, he said: “We will do it, and they have to know that we will do it, and they have time to go away, or we will kill them.” REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-says-its-forces-fight-on-in-bakhmut-mocks-russian-claim-to-have-captured-city"}