{"authors": [], "date_download": "2024-10-12 13:39:40", "date_modify": "2024-10-12 13:39:40", "date_publish": "2024-07-11 22:51:08", "description": "When rescuers arrived, only a dozen whales were still alive, having been stranded for several hours. Read more at straitstimes.com.", "filename": "world_europe_at-least-65-pilot-whales-die-in-scottish-mass-stranding_1728740380.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/strandedscotlandwhales12.jpg?VersionId=FT.YFSMdsJbQ8fCI4VWc8MY0_DnXc7DS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_at-least-65-pilot-whales-die-in-scottish-mass-stranding_1728740380.html", "title": "‘Mass stranding’ of more than 70 pilot whales in Scotland", "title_page": "‘Mass stranding’ of more than 70 pilot whales in Scotland | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Scores of whales washed ashore in a “mass stranding” in Scotland’s Orkney archipelago on July 11, a British marine life rescue charity said.\nA total of 77 long-finned pilot whales were found on the island of Sanday in Orkney, off the northeastern coast of Scotland, after the British Divers Marine Life Rescue (BDMLR) received a report.\nWhen the BDMLR arrived, only a dozen whales were still alive, having been “stranded for several hours already”, the animal rescue charity said.\nFirst aid was being provided to the surviving animals as the “incoming tide approaches them”, it added.\n“Our team continues to work hard to manage this incredibly difficult situation”, BDMLR said in the statement on its website, adding that help was also coming from the Scottish Marine Animal Strandings Scheme to probe the incident.\nWhile such mass strandings are not uncommon among pilot whales who tend to travel in tightly-knit groups, this one is larger than in previous years.\nIn 2023, 55 pilot whales washed ashore and died on the island of Lewis, off north-west Scotland.\nMuch bigger strandings have taken place in other parts of the world, with the largest in parts of New Zealand and Australia. AFP", "url": "https://www.straitstimes.com/world/europe/at-least-65-pilot-whales-die-in-scottish-mass-stranding"}