{"authors": [], "date_download": "2024-10-12 13:38:22", "date_modify": "2024-10-12 13:38:22", "date_publish": "2024-04-18 04:55:25", "description": "Mr Biden called for a tripling in tariffs on Chinese steel and aluminum imports. Read more at straitstimes.com.", "filename": "world_united-states_biden-targets-cheating-china-on-trip-to-us-steel-heartland_1728740302.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/18/US-PRESIDENT-BIDEN-SPEAKS-AT-THE-UNITED-STEEL-WORKERS-HEADQUARTE-204223.jpg?VersionId=ndH2kcE45ywqDJGCSmBr3dyRbM3KnPAK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-targets-cheating-china-on-trip-to-us-steel-heartland_1728740302.html", "title": "Biden targets 'cheating' China on trip to US steel heartland", "title_page": "Biden targets 'cheating' China on trip to US steel heartland | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PITTSBURGH - US President Joe Biden called for a hike in steel tariffs on “cheating” China on April 17, as he courted blue-collar voters on an election campaign trip to the battleground state of Pennsylvania.\n“I stand by you, the American steel worker,” Mr Biden said to cheers as he unveiled the latest in a series of protectionist measures in a speech to the United Steelworkers union in Pittsburgh.\nDemocrat Mr Biden was on the second day of a three-day swing through Pennsylvania as he competes with Republican rival Donald Trump for working- and middle-class votes ahead of November’s election.\nMr Biden, who narrowly won Pennsylvania from Trump in 2020 and has made more campaign visits there than in any other state, called for a tripling in tariffs on Chinese steel and aluminum imports.\n“China’s steel companies don’t need to worry about making a profit because the Chinese government is subsidising them so heavily,” the 81-year-old Mr Biden said.\n“They’re not competing, they’re cheating. They’re cheating and we’ve seen the damage here in America.”\nMr Biden won the coveted backing in March of the union, and has opposed a bid by Japan’s Nippon Steel to take over the Pittsburgh-based firm US Steel in a further attempt to woo the union.\nHe repeated his vow on April 17 to torpedo the Japanese takeover of the “iconic American company”.\n“American-owned, American-operated by American union steelworkers, the best in the world – and that’s going to happen, I promise,” he said.\nBeijing reacted furiously after Washington said it was also launching a probe into Chinese shipbuilding following a complaint by unions, including United Steelworkers.\nMr Biden insisted, however, that he was not seeking a showdown with China.\n“No trade war,” Mr Biden earlier said, when asked by reporters about the Chinese tariffs during a stop at a coffee shop in his hometown of Scranton, Pennsylvania.\nOn the first day of the trip on April 15, he stopped by his childhood home in Scranton while taking aim at Trump as an elitist billionaire, as the tycoon languished in a New York courtroom as part of his hush money trial.\nThe Biden administration views China’s practices as a barrier to that.\nChina accounts for about half of global steel production, while exporting the metal at a significantly lower cost than US steel prices, a senior US official told reporters.\nThe US Trade Representative said separately it was launching its probe into China’s trade practices in the shipbuilding, maritime and logistics sectors.\nBeijing said it firmly opposes the probe, with China’s commerce industry calling it “full of false accusations, misinterpreting normal trade and investment activities as harming US national security and corporate interests, and blaming China for its own industrial problems.”\nThe trade tensions come against a backdrop of wider stresses between the world’s two biggest economies.\nThe US has identified China as its key rival for the coming century, but Mr Biden has also sought to manage tensions.\nHe met with Chinese leader Xi Jinping in California in 2023 and they spoke recently.\nBut China was again angered when Mr Biden hosted the leaders of Japan and the Philippines last week in a concerted front against China’s increasing assertiveness in the Asia-Pacific region. AFP", "url": "https://www.straitstimes.com/world/united-states/biden-targets-cheating-china-on-trip-to-us-steel-heartland"}