{"authors": [], "date_download": "2024-10-12 13:46:10", "date_modify": "2024-10-12 13:46:10", "date_publish": "2024-01-10 23:02:29", "description": "Melania Trump’s parents took the oath to become US citizens in 2018. Read more at straitstimes.com.", "filename": "world_united-states_former-us-first-lady-melania-trump-announces-death-of-her-mother_1728740770.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/10/melaniamum11.jpg.JPEG?h=561eebd7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_former-us-first-lady-melania-trump-announces-death-of-her-mother_1728740770.html", "title": "Former US first lady Melania Trump announces death of her mother", "title_page": "Former US first lady Melania Trump announces death of her mother | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Former US first lady Melania Trump has announced the death of her mother Amalija Knavs. She was 78.\n“It is with deep sadness that I announce the passing of my beloved mother,” Ms Trump posted late on Jan 9 on X, the former Twitter.\n“Amalija Knavs was a strong woman who always carried herself with grace, warmth, and dignity,” she said, adding: “We will miss her beyond measure and continue to honour and love her legacy.”\nMelania Trump’s mother came to the United States from Slovenia with her husband Victor Knavs, and following a years-long immigration process the couple took the oath to become US citizens in 2018, while Donald Trump was president.\nAfter becoming legal permanent residents, they obtained citizenship through the sponsorship of their adult daughter, taking advantage of the very family reunification visa process that then-president Donald Trump himself had derided as “chain migration” and said should be abolished.\nIn 2017, Melania Trump became the first presidential wife to be born outside the United States since Louisa Adams in 1825.\nTrump himself had campaigned heavily on restricting US immigration. As president he urged the building of a wall on the southern border with Mexico and restricting other forms of immigration and visa mechanisms.\nKnavs’ cause of death was not announced.\nIn Slovenia, she worked at local textile factory Jutranjka, first introducing daughter Melania to the fashion business as a child model for the company in the mid-1970s. Her husband Viktor was an entrepreneur.", "url": "https://www.straitstimes.com/world/united-states/former-us-first-lady-melania-trump-announces-death-of-her-mother"}