{"authors": [], "date_download": "2024-10-12 13:58:25", "date_modify": "2024-10-12 13:58:25", "date_publish": "2024-06-25 03:32:21", "description": "SAO PAULO - American linguist and philosopher Noam Chomsky, who is recovering in Brazil after he suffered a stroke last year, received a visit on Monday at his Sao Paulo home from Brazilian President Luiz Inacio Lula da Silva, the government news agency reported. Read more at straitstimes.com.", "filename": "world_lula-visits-convalescing-noam-chomsky-in-sao-paulo_1728741505.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/25/LYNXMPEK5N0PP-1.jpg?VersionId=VJ.08Ndi_WNsM4fp5bjyxk2uGt8PGXd8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_lula-visits-convalescing-noam-chomsky-in-sao-paulo_1728741505.html", "title": "Lula visits convalescing Noam Chomsky in Sao Paulo", "title_page": "Lula visits convalescing Noam Chomsky in Sao Paulo | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAO PAULO - American linguist and philosopher Noam Chomsky, who is recovering in Brazil after he suffered a stroke last year, received a visit on Monday at his Sao Paulo home from Brazilian President Luiz Inacio Lula da Silva, the government news agency reported.\nChomsky, 95, was recently hospitalized in Sao Paulo and was discharged June 18 to continue his treatment at home.\nHe is married to Brazilian Valeria Wasserman. The couple have had a residence in Brazil since 2015, Agencia Brazil said.\nBeyond linguistics, Chomsky is an intellectual known for his social criticism and political activism. He has been an outspoken critic of U.S. foreign policy since the Vietnam war.\nIn 2018, Chomsky and his wife visited Lula, a former shoeshine boy and union leader who was first elected to the presidency in 2002, when he was in prison on alleged corruption charges that had barred him from running for office again. Those charges were later overturned, and Lula was elected for an unprecedented third term in 2022.\n\"Although his policies while in office were designed to accommodate the concerns of domestic and international finance, he is despised by elites, in part no doubt because of his policies of social inclusion and benefits for the dispossessed,\" Chomsky wrote at the time. REUTERS", "url": "https://www.straitstimes.com/world/lula-visits-convalescing-noam-chomsky-in-sao-paulo"}