{"authors": [], "date_download": "2024-10-12 13:43:35", "date_modify": "2024-10-12 13:43:35", "date_publish": "2024-08-08 05:31:24", "description": "Starliner has been docked to the ISS for 63 of the maximum 90 days it can stay. Read more at straitstimes.com.", "filename": "world_boeings-starliner-astronauts-could-return-on-spacex-capsule-in-feb-2025-nasa-says_1728740615.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/2024-08-07T173139Z1722683771RC2UD7A214PHRTRMADP3SPACE-EXPLORATION-BOEING-STARLINER.JPG?VersionId=KvJDDLOCs5b4zMtRY8MIbGvRNS5xprXP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_boeings-starliner-astronauts-could-return-on-spacex-capsule-in-feb-2025-nasa-says_1728740615.html", "title": "Boeing’s Starliner astronauts could return to Earth on SpaceX capsule in February 2025: Nasa", "title_page": "Boeing’s Starliner astronauts could return to Earth on SpaceX capsule in February 2025: Nasa | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Nasa officials said on Aug 7 the two astronauts delivered to the International Space Station (ISS) in June by Boeing’s Starliner could return on SpaceX’s Crew Dragon in February 2025 if Starliner is still deemed to be unable to safely return them to Earth.\nThe US space agency has been discussing potential plans with SpaceX to leave two seats empty on an upcoming Crew Dragon launch for Nasa astronauts Butch Wilmore and Suni Williams, who became the first crew to fly Boeing’s Starliner capsule.\nThe astronauts’ test mission, initially expected to last about eight days on the station, has been drawn out by issues with Starliner’s propulsion system that have increasingly called into question the spacecraft’s ability to safely return them to Earth as planned.\nA Boeing spokesperson said if Nasa decides to change Starliner’s mission, the company “will take the actions necessary to configure Starliner for an uncrewed return”.\nThruster failures during Starliner’s initial approach to the ISS in June and several leaks of helium – used to pressurise those thrusters – have set Boeing off on a testing campaign to understand the cause and propose fixes to Nasa, which has the final say. Recent results have unearthed new information, causing greater alarm about a safe return.\nThe latest test data has stirred disagreements and debate within Nasa about whether to accept the risk of a Starliner return to Earth, or make the call to use Crew Dragon instead.\nUsing a SpaceX craft to return astronauts that Boeing had planned to bring back on Starliner would be a major blow to an aerospace giant that has struggled for years to compete with SpaceX and its more experienced Crew Dragon team.\nStarliner has been docked to the ISS for 63 of the maximum 90 days it can stay, and it is parked at the same port that Crew Dragon will have to use to deliver the upcoming astronaut crew.\nOn Aug 6, Nasa, using a SpaceX rocket and a Northrop Grumman capsule, delivered a routine shipment of food and supplies to the station, including extra clothes for Mr Wilmore and Ms Williams.\nStarliner’s high-stakes mission is a final test required before Nasa can certify the spacecraft for routine astronaut flights to and from the ISS. Crew Dragon received Nasa approval for astronaut flights in 2020.\nStarliner development has been set back by management issues and numerous engineering problems. It has cost Boeing US$1.6 billion (S$2.12 billion) since 2016, including US$125 million from Starliner’s current test mission, securities filings show.\nConcerns at Nasa\nA meeting this week of Nasa’s commercial crew programme, which oversees Starliner, ended with some officials disagreeing with a plan to accept Boeing’s testing data and use Starliner to bring the astronauts home, officials said during a news conference.\n“We didn’t poll in a way that led to a conclusion,” commercial crew programme chief Steve Stich said.\nMr Ken Bowersox, Nasa’s space operations chief, added: “We heard from a lot of folks that had concerns, and the decision was not clear.”\nA Boeing executive was not at the Aug 7 press conference.\nWhile no decision has been made on using Starliner or Crew Dragon, Nasa has been buying Boeing more time to do more testing and gather more data to build a better case to trust Starliner. Nasa expects to make a decision some time next week, officials said.\nThe agency on Aug 6 delayed by more than a month SpaceX’s upcoming Crew Dragon mission, a routine flight called Crew-9, that is expected to send three Nasa astronauts and a Russian cosmonaut to the ISS.\nNasa's ISS programme chief said the agency has not yet decided which astronauts they would pull off the mission for Mr Wilmore and Ms Williams if necessary.\nBoeing’s testing so far has shown that four of Starliner’s jets had failed in June because they overheated and automatically turned off, while other thrusters re-fired during tests appeared weaker than normal because of some restriction to their propellant.\nGround tests in late July at the White Sands Missile Range in New Mexico have helped reveal that the thrusters’ overheating causes a Teflon seal to warp, choking propellant tubes for the thrusters and thereby weakening their thrust.\n“That, I would say, upped the level of discomfort, and not having a total understanding of the physics of what’s happening,” Mr Stich said, describing why Nasa now appears more willing to discuss a Crew Dragon contingency after previously downplaying such a prospect to reporters. REUTERS", "url": "https://www.straitstimes.com/world/boeings-starliner-astronauts-could-return-on-spacex-capsule-in-feb-2025-nasa-says"}