{"authors": [], "date_download": "2024-10-12 13:56:52", "date_modify": "2024-10-12 13:56:52", "date_publish": "2024-03-12 16:37:00", "description": "Strain’s disappearance eliminated a viral source of death and disease, especially among children. Read more at straitstimes.com.", "filename": "world_as-covid-19-spread-a-strain-of-flu-disappeared-now-scientists-say-a-second-one-could-go-too_1728741412.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/12/IMGJFG00643art113S4JM60.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_as-covid-19-spread-a-strain-of-flu-disappeared-now-scientists-say-a-second-one-could-go-too_1728741412.html", "title": "As Covid-19 spread, a strain of flu disappeared; now scientists say a second one could go too", "title_page": "As Covid-19 spread, a strain of flu disappeared; now scientists say a second one could go too | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MELBOURNE – Stay-at-home orders, border closures, mask-wearing and other measures aimed at stemming Covid-19’s spread led to the global disappearance of a notorious winter germ. Now, scientists say it might be feasible with better vaccines to rid the world of a second one.\nFor decades, flu epidemics were driven by four strains. One of them, the so-called Yamagata-lineage of type-B influenza, was struggling to compete before the pandemic and has not been seen since March 2020, said Mr Ian Barr, deputy director of the World Health Organization’s Collaborating Center for Reference and Research on Influenza in Melbourne.\nCovid restrictions gave it “the killer blow which knocked it out”, Mr Barr said in an interview.\nThe strain’s disappearance eliminated a viral source of death and disease, especially among children, and a component of annual flu vaccines.\nIt also showed that it might be possible going forward to eliminate its type-B cousin, a strain known as “Victoria”.\nUnlike type-A influenza, which has a broad host range and risks causing pandemics, B strains lack an animal reservoir and might be more readily snuffed out with better vaccines that not only protect against getting sick, but also prevent transmission, scientists wrote in a paper last week in the journal Lancet Infectious Diseases.\nOn average, the strains together account for 23 per cent of annual influenza cases globally – including 1.4 million hospitalisations – and about US$1.3 billion (S$1.73 billion) in healthcare costs in the US alone each year.\n“The theoretically plausible eradication of influenza B virus could remove this considerable clinical and economic burden,” Professor Florian Krammer, a professor of vaccinology at the Icahn School of Medicine at Mount Sinai in New York, and colleagues wrote in the paper. BLOOMBERG", "url": "https://www.straitstimes.com/world/as-covid-19-spread-a-strain-of-flu-disappeared-now-scientists-say-a-second-one-could-go-too"}