{"authors": [], "date_download": "2024-10-12 13:34:43", "date_modify": "2024-10-12 13:34:43", "date_publish": "2024-09-24 06:18:16", "description": "The World Bank on Sept 23 said the Palestinian territories were already “nearing economic freefall”. Read more at straitstimes.com.", "filename": "world_middle-east_us-urges-israel-to-extend-banking-relations-with-palestinian-banks-for-at-least-a-year_1728740083.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/LYNXMPEK8M0QO-1.jpg?VersionId=Q1Jzmnw0h74iFUdK5Hv5xBkT2EfcX28X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_us-urges-israel-to-extend-banking-relations-with-palestinian-banks-for-at-least-a-year_1728740083.html", "title": "US urges Israel to extend banking relations with Palestinian banks for at least a year", "title_page": "US urges Israel to extend banking relations with Palestinian banks for at least a year | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – US Deputy Treasury Secretary Wally Adeyemo urged Israel to extend its banking relationships with Palestinian banks for at least a year to avert an economic crisis in the West Bank, warning that Israel’s own security was at stake.\nMr Adeyemo delivered the message in a meeting with Bank of Israel Governor Amir Yaron in New York on Sept 23, on the sidelines of the United Nations General Assembly before meeting separately with Jordan’s King Abdullah.\n“He expressed the United States government’s concern about threats by some within the Israeli government to sever correspondent banking relationships between Israeli and Palestinian banks and insisted that these should be extended for at least a year,” the US Treasury Department said in a statement about Mr Adeyemo’s meeting with Mr Yaron.\nIsrael’s UN mission declined to comment.\nUS officials have been warning for months that threats by Israeli Finance Minister Bezalel Smotrich and other Israeli officials to cut off Palestinian banks from their Israeli correspondent banks could destabilise the Palestinian Authority, which in turn could harm Israel’s own security.\nThe banking correspondence authorisation is due to expire on Oct 31, posing risks to export and import transactions valued at nearly US$10 billion (S$12.9 billion), treasury officials have said.\nMr Adeyemo told King Abdullah that any Israeli move to cut off Palestinian banks would raise the risk of regional instability and could move more Palestinian financial transactions into the shadows, both of which would harm Israeli and regional security, said a source familiar with those talks.\nUS Treasury Secretary Janet Yellen raised similar concerns ahead of a Group of Seven (G7) finance ministers meeting in May, and the issue was mentioned in two G7 joint communiques.\n“The viability of the Palestinian Authority is essential to stability in the West Bank, which in turn is essential to Israel’s own national security,” said one US official, speaking on condition of anonymity.\nThe World Bank on Sept 23 said the Palestinian territories were already “nearing economic freefall”, with Gaza’s gross domestic product declining 86 per cent in the first quarter of 2024 year-on-year, and the Palestinian Authority facing a financing gap of US$1.86 billion in 2024 and heightened risks of a “systemic failure”.\nMr Smotrich in June extended a waiver that allows cooperation between Israel’s banking system and Palestinian banks in the occupied West Bank, but only for four months, not a full year as his predecessors had done.\nThe waiver allows Israeli banks to process shekel payments for services and salaries tied to the Palestinian Authority, without the risk of being charged with money laundering and funding terrorism. Without it, Palestinian banks would be cut off from the Israeli financial system.\nUS officials have been tight-lipped about what would happen if Israel failed to extend the waiver, and whether they could impose sanctions similar to those slapped on Israeli settlers for violence against Palestinians in the West Bank. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/us-urges-israel-to-extend-banking-relations-with-palestinian-banks-for-at-least-a-year"}