{"authors": [], "date_download": "2024-10-12 13:56:38", "date_modify": "2024-10-12 13:56:38", "date_publish": "2022-07-29 20:33:08", "description": "Diageo, Birkin making more money from most expensive products. Read more at straitstimes.com.", "filename": "world_how-the-other-half-lives-luxury-companies-thrive-as-the-very-wealthy-splurge_1728741398.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/29/ads-dior-290722.jpg?VersionId=4q25ZMn6aiyz8l_mUiXV6IAa4YedV31U", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_how-the-other-half-lives-luxury-companies-thrive-as-the-very-wealthy-splurge_1728741398.html", "title": "How the other half lives: Luxury companies thrive as the very wealthy splurge", "title_page": "How the other half lives: Luxury companies thrive as the very wealthy splurge | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON/PARIS (REUTERS) - While millions are fretting whether they can afford another US$1,000 (S$1,380) on energy this year, others are still splashing out on US$10,000 Hermes handbags as soaring prices leave wealthier people relatively unscathed.\nA string of consumer companies, from spirits group Diageo to Birkin bag maker Hermes, have this week reported they are making money from their most expensive products and expect to continue to do so, despite a cost of living crisis that shows no signs of abating.\nSharply higher interest rates, surging inflation and a prolonged energy crisis are leading to the conclusion that the global economy is headed towards a recession.\nBut millions of wealthier consumers are still sitting on a cushion of savings built up during the Covid-19 pandemic and keen to treat themselves after two years of restrictions.\nRecord margins\nHermes reported a record quarterly profit margin on Friday (July 29), as sales rose sharply amid strong growth in Europe and the United States, and a rebound in China in June.\nChairman Axel Dumas said he saw no sign of a slowdown in any region, even though the company has raised prices 4 per cent this year.\nCarmaker Renault also said its turnaround strategy of focusing on selling fewer but more profitable cars was paying off, and upgraded its forecast for full-year margins. The most expensive Renault cars can cost over US$100,000.\n\"The surprising resilience of European consumers can also be seen in the strong results of luxury brands owner Louis Vuitton, particularly in their fashion and leather goods, such as Fendi and Christian Dior,\" Ms Rebecca Chesworth, a senior equities strategist at investor State Street, said.\n\"Consumers enjoying travel reopening have been boosting sales of wines and spirits.\"\nFinancial jeopardy for others\nMany consumers are bracing for the economy to deteriorate rapidly this winter.\nIn Britain, for example, a price cap on typical household energy bills is expected to jump from £1,277 (S$2,058) earlier this year to more than £3,500 by October, while the cost of food has leapt by 10 per cent year-on-year.\nThat will plunge hundreds of thousands into financial jeopardy, unable to spend on anything but the absolute basics.\nFood and personal goods companies such as Nestle and Unilever have been locked in hard negotiations with retailers since late last year, with supermarkets reluctant to raise prices of basic necessities and risk alienating shoppers struggling to get by.\n\"Not all companies can (raise prices). Only companies that have pricing power that are doing relatively well - that have the dominant positions in their respective sectors - will be able to do that,\" BlackRock Investment Institute's global chief investment strategist Wei Li told Reuters. \"Focusing on the quality players within the sector is important.\"\nCome fly with me\nWhile wealthier consumers' savings are still being eroded by inflation, they currently seem focused on enjoying the freedoms that have returned with the easing of Covid-19 restrictions.\nBritish Airways-owner IAG on Friday returned to profit for the first time since the pandemic, as more people flew around Europe between April and June.\n\"Commentary suggesting forward bookings show no sign of weakness supports the argument that pent-up demand for travel still far outweighs the impact of a cost-of-living crisis,\" Mr Matt Britzman, an equity analyst at Hargreaves Lansdown, said.\nIAG sales, on trips mostly booked out of Britain, Spain and the United States, more than quadrupled to 9.35 billion euros (S$13.2billion) in the first half of the year versus last year.\n\"We've had fast growth in the recovery (in travel retail) as you see travel pick up,\" Diageo CEO Ivan Menezes told analysts on Thursday (July 28) after the Don Julio tequila and Johnnie Walker whisky maker beat full-year sales expectations.\nTo be sure, Mr Menezes cautioned: \"To get back to where we were, it's probably another two years, maybe a bit longer.\"", "url": "https://www.straitstimes.com/world/how-the-other-half-lives-luxury-companies-thrive-as-the-very-wealthy-splurge"}