{"authors": [], "date_download": "2024-10-12 14:02:58", "date_modify": "2024-10-12 14:02:58", "date_publish": "2023-05-06 22:50:00", "description": "Russia's President Putin unveiled the Kinzhal missile in 2018 and called it “an ideal weapon”. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-downed-hypersonic-missile-in-historic-first-time_1728741778.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/07/20230425-Balikatan3823-ADS-0108a.jpg?VersionId=Erl7BMVZFT9TG9JDMqDJX6TflxH2vSFz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-downed-hypersonic-missile-in-historic-first-time_1728741778.html", "title": "Ukraine says it downed hypersonic missile in 'historic' first time", "title_page": "Ukraine says it downed hypersonic missile in 'historic' first time | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Ukraine said on Saturday that it had for the first time downed a Russian hypersonic Kinzhal missile during a wave of Russian attacks in the night between Wednesday and Thursday.\nRussian President Vladimir Putin, who unveiled the Kinzhal missile in 2018, has termed it “an ideal weapon” that is extremely difficult for missile defences to intercept.\n“I congratulate the Ukrainian people on the historic event,” General Mykola Oleshchuk said on Telegram. “Yes, we shot down the ‘unparallelled’ Kinzhal” missile.\nThe Ukraine Air Force said the missile was shot down with a Patriot air-defence system in skies over Kyiv at around 2.30am on Thursday (7.30am Singapore time on Thursday).\nUkraine appealed to its Western allies to help reinforce its air defence system as Russia pounded Ukraine energy infrastructure from the air over winter.\nMid-April, Ukraine received the first Patriots, seen as one of the most advanced US air defence systems.\nPresident Volodymyr Zelensky has said the system would “significantly” strengthen Ukraine’s defences against Russian strikes. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-says-downed-hypersonic-missile-in-historic-first-time"}