{"authors": [], "date_download": "2024-10-12 14:01:40", "date_modify": "2024-10-12 14:01:40", "date_publish": "2024-04-16 01:39:39", "description": "Ukraine has in recent months grown increasingly frustrated at delays in Western aid. Read more at straitstimes.com.", "filename": "world_europe_ukraine-s-zelensky-calls-for-same-unity-from-allies-as-for-israel_1728741700.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/UKRAINE-RUSSIA-CONFLICT-WAR-122146.jpg?VersionId=wjmtNP7Oa3kpmz9wanvHdavgFkKNuoDi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-s-zelensky-calls-for-same-unity-from-allies-as-for-israel_1728741700.html", "title": "Ukraine’s Zelensky calls for same ‘unity’ from allies as for Israel", "title_page": "Ukraine’s Zelensky calls for same ‘unity’ from allies as for Israel | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukrainian President Volodymyr Zelensky urged allies on April 15 to show the same “unity” towards Ukraine as Israel, which said it repelled an Iranian attack over the weekend with Western support.\nUkraine has in recent months grown increasingly frustrated at delays in Western aid, including air defences it says are urgently needed to repel deadly Russian attacks.\nIn a post on Telegram, Mr Zelensky thanked allies who had responded to Ukraine’s call for more air defences but said “the intensity of Russian attacks requires greater unity”.\n“By defending Israel, the free world has demonstrated that such unity is not only possible, but also 100 per cent effective,” he said.\n“The same is possible in defending Ukraine, which, like Israel, is not a Nato member, from terror,” he continued, calling for “political will” from Ukraine’s allies.\nUkraine’s Foreign Minister Dmytro Kuleba also invoked Western support for Israel in a press conference earlier, in which he called for more support “as soon as possible”.\n“We see that when allies act as one in a very coordinated way, not a single missile falls on the targets, reaches targets in Israel,” Mr Kuleba said, alongside his Norwegian counterpart.\n“Everything we are asking from partners, even if you cannot act the way you act in Israel, give us what we need and we will do the rest of the job,” he added.\nIran over the weekend launched hundreds of drones and missiles, including from its own territory, at Israel in retaliation for a deadly April 1 strike on Iran’s consulate in Damascus.\nIsrael’s military said it intercepted 99 per cent of the aerial threats with the help of the US and other allies, and that the overnight attack caused only minor damage. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-s-zelensky-calls-for-same-unity-from-allies-as-for-israel"}