{"authors": [], "date_download": "2024-10-12 14:00:33", "date_modify": "2024-10-12 14:00:33", "date_publish": "2023-11-14 20:00:43", "description": "Ukraine's exports through an alternative Black Sea shipping corridor have reached almost four million metric tons since the route started operating in August, Ukrainian President Volodymyr Zelenskiy said on Tuesday. Read more at straitstimes.com.", "filename": "world_europe_ukraine-grain-exports-via-new-black-sea-corridor-hit-4-million-t-zelenskiy_1728741633.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/14/LYNXMPEJAD0HF-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-grain-exports-via-new-black-sea-corridor-hit-4-million-t-zelenskiy_1728741633.html", "title": "Ukraine grain exports via new Black Sea corridor hit 4 million tonnes", "title_page": "Ukraine grain exports via new Black Sea corridor hit 4 million tonnes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine's exports through an alternative Black Sea shipping corridor have reached almost four million tonnes since the route started operating in August, Ukrainian President Volodymyr Zelensky said on Tuesday.\nUkraine launched a \"humanitarian corridor\" for ships bound for African and Asian markets to try to circumvent a de facto blockade in the Black Sea after Russia quit a United Nations-brokered deal that had guaranteed Kyiv's seaborne exports during the war.\nUkrainian officials said the route - which runs along Ukraine's south-west Black Sea coast, into Romanian territorial waters and onwards to Turkey, would also be used for grain shipments.\n\"The grain corridor is working. We are now overcoming the four million tons mark and maintaining positive dynamics,\" Mr Zelensky said, on the Telegram messaging app.\nUkrainian transport authorities last week said 91 vessels exported 3.3 million tonnes of agricultural and metal products as of Nov 9.\nThe situation with exports along the route became more complicated last week when a Russian missile hit a civilian vessel in an Odesa region port.\nOfficials said the route continued to operate, but brokers reported a rise in freight prices.\n\"This (attack) is of course bad, it affects the cost of freight and the willingness of traders to buy grain from us and work with Ukraine,\" Ukrainian Agriculture Minister Mykola Solsky told national television, late on Monday.\n\"We understand that Odesa region ports need to be protected, everyone is doing it and the situation is improving every week, and we will still export,\" Mr Solsky added.\nUkraine's government expects a harvest of 79 million tonnes of grain and oilseeds in 2023, with its 2023/24 exportable surplus totalling about 50 million tonnes.\nUkrainian grain exports have fallen to 9.8 million tonnes as of Nov 6 in the 2023/24 July-June marketing season from 14.3 million tonnes a season earlier.\nThe ministry gave no explanation for the drop but traders and farmers' unions have said blocked Ukrainian Black Sea ports and Russian attacks on the country's Danube River ports are the main reasons for lower exports.\nUkraine has traditionally shipped most of its exports through its deep water Black Sea ports. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-grain-exports-via-new-black-sea-corridor-hit-4-million-t-zelenskiy"}