{"authors": [], "date_download": "2024-10-12 13:49:37", "date_modify": "2024-10-12 13:49:37", "date_publish": "2024-09-22 03:28:00", "description": "PARIS - Here are details of the main ministerial appointments after French President Emmanuel Macron's office unveiled on Saturday the new cabinet that will report to Prime Minister Michel Barnier: Read more at straitstimes.com.", "filename": "world_europe_key-ministers-in-frances-new-government-line-up_1728740977.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/22/LYNXMPEK8K09R-1.jpg?VersionId=zNjk.9q1LSOPXXg4zwJni1zpCeAS9X62", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_key-ministers-in-frances-new-government-line-up_1728740977.html", "title": "Key ministers in France's new government line-up", "title_page": "Key ministers in France's new government line-up | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Here are details of the main ministerial appointments after French President Emmanuel Macron's office unveiled on Saturday the new cabinet that will report to Prime Minister Michel Barnier:\nANTOINE ARMAND, FINANCE MINISTER\nA relative newcomer to politics, Armand, 33, was first elected to parliament in 2022 on the centrist ticket of Macron's camp and was re-elected in July's snap legislative election.\nIn the new parliament, he had been set to head the economic committee in the lower house until Barnier tapped him for the top job at the powerful Ministry of Economics and Finance.\nArmand is no stranger to \"Bercy\" as the ministry is often called in France, having joined its elite corps of finance inspectors after graduating in 2018 from the prestigious Ecole Nationale d'Administration - a training college for future senior civil servants that Macron also attended.\nHe will be seconded by Laurent Saint-Martin on budget issues, a delicate portfolio that will report directly to the prime minister, as France struggles to contain a rising budget deficit and contemplates spending cuts and tax hikes.\nBRUNO RETAILLEAU, INTERIOR MINISTER\nA conservative senator since 2004, Bruno Retailleau, 63, is known for his hard-right views and is the most senior figure from his Republicans (LR) party to enter Barnier's government.\nRetailleau was a driving force behind the party's shift to the right in an increasingly polarised political landscape, in particular on hot-button issues such as immigration.\nAs leader of the conservative group of senators, Retailleau has criticised Macron's latest attempts to toughen immigration rules, calling for a much tougher stance that would include constitutional changes allowing welfare benefit cuts.\nHe has also urged tougher policing on left-wing and environmental protesters and opposed Macron's push to add the right for women to pursue an abortion to the constitution.\nJEAN-NOEL BARROT, FOREIGN MINISTER\nBarrot, 41, is promoted to foreign minister after serving as junior minister for European affairs since February 2024. Before that he was Macron's minister for digital affairs.\nBarrot comes from a family with a strong political background. His father, Jacques Barrot, was a prominent French politician who served in various ministerial positions and as a European commissioner.\nHe provides essential political balance for the government, hailing from the centrist party of Francois Bayrou, the political veteran whose independent MoDem party Macron needs to keep on his side.\nBENJAMIN HADDAD, EUROPE MINISTER\nHaddad, 38, a fluent English-speaker with excellent contacts in Washington, DC, where he spent years working at a think-tank, was first elected to parliament in 2022 under Macron's party colours.\nHe has been vocal on diplomatic issues and especially the war in Ukraine, having convinced tens of European lawmakers to sign a plea to the U.S. Congress to unlock aid for Ukraine at the end of 2023.\nSEBASTIEN LECORNU, DEFENCE MINISTER\nLecornu, a Macron loyalist, remains in his post at the helm of the Defence Ministry.\nA low-profile minister who started his career in conservative ranks, he was excluded from the Republicans after being named a junior minister in Macron's government in 2017. REUTERS", "url": "https://www.straitstimes.com/world/europe/key-ministers-in-frances-new-government-line-up"}