{"authors": [], "date_download": "2024-10-12 13:57:09", "date_modify": "2024-10-12 13:57:09", "date_publish": "2024-03-27 02:25:47", "description": "Researchers looked at nearly 12 million virus genomes. Read more at straitstimes.com.", "filename": "world_europe_humans-give-more-viruses-to-animals-than-they-give-us-study-finds_1728741429.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/27/LYNXNPEK2P0RU-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_humans-give-more-viruses-to-animals-than-they-give-us-study-finds_1728741429.html", "title": "Humans give more viruses to animals than they give us: Study", "title_page": "Humans give more viruses to animals than they give us: Study | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Some of the deadliest diseases to stalk humankind have come from pathogens that jumped from animals to people. The virus that causes Aids, for example, crossed over from chimpanzees. And many experts believe the virus that caused the Covid-19 pandemic flowed from bats.\nBut, as a new study shows, this exchange has not been a one-way street. An analysis of all the publicly available viral genome sequences yielded a surprising result: Humans give more viruses – about twice as many – to animals than they give to us.\nThe researchers looked at nearly 12 million virus genomes and detected almost 3,000 instances of viruses jumping from one species to another. Of those, 79 per cent involved a virus going from one animal species to another animal species. The remaining 21 per cent involved humans. Of those, 64 per cent were human-to-animal transmissions, known as anthroponosis, and 36 per cent were animal-to-human transmissions, called zoonosis.\nThe animals affected by anthroponosis included pets such as cats and dogs; domesticated animals such as pigs, horses and cattle; birds such as chickens and ducks; primates such as chimpanzees, gorillas and howler monkeys; and other wild animals such as raccoons, the black-tufted marmoset and the African soft-furred mouse.\nWild animals, in particular, were much more likely to experience human-to-animal transmission than the other way around.\n“This really highlights our enormous impact on the environment and the animals around us,” said Mr Cedric Tan, a doctoral student in computational biology at the University College London (UCL) Genetics Institute, who is the lead author of the study published this week in the journal Nature Ecology & Evolution.\nPeople and animals are hosts to innumerable microbes that can jump to another species through close contact. The study looked at viral transmissions involving all the vertebrate groups: mammals, birds, reptiles, amphibians and fish.\n“Viruses can jump between different species via the same modes of transmission that apply to humans, including direct contact with infected fluids, or getting bitten by other species, amongst others,” Mr Tan said.\n“However, before a virus can jump into a new host, it must either already possess the biological toolkit, or acquire host-specific adaptations, to enter the cells of the new host species and exploit their resources.”\nOver the millennia, pandemics that have killed millions of people have been caused by pathogens such as viruses, bacteria and fungi that crossed over to people from animals. Zoonosis has been the primary concern concerning dangerous emerging infectious diseases.\nComputational biologist and study co-author Francois Balloux, director of the UCL Genetics Institute, said: “The vast majority of pathogens circulating in humans have been acquired from animals at some point in time.\n“The current biggest threat is probably bird flu H5N1, which is circulating in wild birds. The main reason recent host jumps can be so devastating is because the population of host species has no pre-existing immunity to the novel disease.”\nThe 14th-century Black Death – when the bacterial disease bubonic plague killed millions of people in Europe, Asia, the Middle East and North Africa – was caused by a bacterium normally circulating in wild rodents.\nAnd present-day threats like the Ebola virus similarly arose from animals.\nMr Tan said: “It is largely believed that Sars-CoV-2, the agent of the Covid-19 pandemic, likely originated in horseshoe bats and jumped into humans.”\nSars-CoV-2 outbreaks, however, were also documented during the pandemic in farmed minks infected by people.\nMany species-to-species transmissions are inconsequential.\nProfessor Balloux said: “In most cases, such infections lead nowhere, as the virus is poorly adapted and there is no onward transmission in the new host.\n“In some cases, the virus can start circulating, causing a disease outbreak, an epidemic, a pandemic, or even establishes itself into an endemic pathogen. Small zoonotic disease outbreaks are probably fairly common, even if we miss the vast majority of them, but full-blown epidemics tend to be rare events, evolutionary speaking.” REUTERS", "url": "https://www.straitstimes.com/world/europe/humans-give-more-viruses-to-animals-than-they-give-us-study-finds"}