{"authors": [], "date_download": "2024-10-12 14:00:31", "date_modify": "2024-10-12 14:00:31", "date_publish": "2023-07-17 16:00:00", "description": "It said the halting of the grain agreement had nothing to do with the latest bridge attack.  Read more at straitstimes.com.", "filename": "world_europe_russia-closes-crimea-bridge-after-official-declares-emergency_1728741631.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/18/2023-07-17T050221Z1675689182RC2342ACFSLDRTRMADP3UKRAINE-CRISIS-CRIMEA-BRIDGE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-closes-crimea-bridge-after-official-declares-emergency_1728741631.html", "title": "Moscow halts grain deal in what UN says is a blow to people in need everywhere", "title_page": "Moscow halts grain deal in what UN says is a blow to people in need everywhere | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW – Russia halted participation on Monday in the year-old UM-brokered deal that lets Ukraine export grain through the Black Sea, spreading fear in poorer countries that price rises will put food out of reach.\nHours earlier, a blast knocked out Russia’s bridge to Crimea in what Moscow called a strike by Ukrainian sea drones, killing two people in what Moscow cast as a terrorist attack on the road bridge, a major artery for Russian troops fighting in Ukraine.\nThe Kremlin said there was no link between the attack and its decision to suspend the grain deal, over what it called a failure to meet its demands to implement a parallel agreement easing rules for its own food and fertilizer exports.\n“Unfortunately, the part of these Black Sea agreements concerning Russia has not been implemented so far, so its effect is terminated,” Kremlin spokesman Dmitry Peskov told reporters on a conference call.\nUM Secretary-General Antonio Guterres signalled that Russia’s withdrawal meant that the related pact to facilitate Russia’s grain and fertilizer exports was also terminated.\n“Today’s decision by the Russian Federation will strike a blow to people in need everywhere,” he told reporters.\nMoscow said it would consider rejoining the grain deal if it saw “concrete results” on its demands but that its guarantees for the safety of navigation would meanwhile be revoked.\nIn Washington, the White House said Russia’s suspension of the pact “will worsen food security and harm millions”.\nUS Secretary of State Antony Blinken called it unconscionable.\nGlobal food prices\nUkraine and Russia are some of the world’s biggest exporters of grain and other foodstuffs and any interruption could drive up food prices across the globe.\nShashwat Saraf, the emergency director in East Africa for the International Rescue Committee (IRC), said the impacts would be far-reaching in Somalia, Ethiopia and Kenya, which have been facing the Horn of Africa’s worst drought in decades.\n“I don’t know how we will survive,” said Halima Hussein, a mother of five children living in a crowded camp in Somalia’s capital Mogadishu for people displaced by years of failed rains and violence.\nUkraine’s President Volodymyr Zelenskiy raised the prospect of resuming grain exports without Russia’s participation, suggesting Kyiv would seek Turkey’s support to effectively negate the Russian de facto blockade imposed last year.\n“We are not afraid,” spokesperson Serhiy Nykyforov quoted Zelenskiy as saying. “We were approached by companies, shipowners. They said that they are ready, if Ukraine lets them go, and Turkey continues to let them through, then everyone is ready to continue supplying grain.”\nRussian offensive\nKyiv has been striking Russian supply lines as it pursues a counteroffensive to drive Russian forces out of its south and east. On Monday it reported two more civilians killed by Russian forces, which it said had begun a major push in the northeast.\n“For two days running, the enemy has been actively on the offensive in the Kupiansk sector in Kharkiv region. We are defending. Heavy fighting is going on and the positions of both sides change dynamically several times a day,” Deputy Defence Minister Hanna Maliar, wrote on Telegram.\nThe armed forces said Russia had amassed a huge array of forces.\n“In the Lyman-Kupiansk sector the enemy has concentrated a very powerful grouping. More than 100,000 personnel, more than 900 tanks, more than 555 artillery systems, and 370 multiple launch rocket systems,” Serhiy Cherevatyi, spokesperson for the Ukrainian Armed Forces East group, said on national TV.\nReuters was not able to verify the accounts and there was no immediate comment from Russia.\nUkrainian ground forces Commander General Oleksander Syrskyi said: “In these complicated circumstances, I met fighting brigades from our group of forces (in the northeastern Kupiansk region) to correct our plans and resolve issues on site.\n“We are continuing to move forward, step by step to liberate our land.”\nThe blast on the road bridge to Crimea could limit Moscow’s ability to supply its troops in southern Ukraine, although Russian President Vladimir Putin said the bridge had not been used for military transports for a long time.\nImages showed a section of the road bridge had come down and traffic was halted in both directions, although a parallel railway bridge was still operational. Blasts were reported before dawn on the 19-km (12-mile) bridge, which Putin ordered built after seizing and annexing the peninsula from Ukraine in 2014.\nPutin told officials repair work should start quickly and that Russia would respond to the “senseless” attack.\nUkrainian media quoted unidentified officials as saying Ukraine’s Security Service (SBU) had deployed maritime drones against the bridge. SBU spokesperson Artem Dekhtyarenko alluded to the idea that the agency would reveal details after Ukraine won the war, without directly claiming responsibility.\nUkraine says the bridge is illegal. It was hit by a massive explosion and fire in October.\nWithout Russia?\nThe grain deal was hailed as preventing a global food emergency when it was brokered by the United Nations and Turkey last year.\nGlobal commodity food prices rose on Monday, though the increase was limited, suggesting traders did not yet anticipate a severe supply crisis.\nWestern countries say Russia is trying to use its leverage over the grain deal to weaken financial sanctions, which do not apply to Russia’s agricultural exports.\nEuropean Commission President Ursula von der Leyen said the EU would continue to try to secure food for poor countries.", "url": "https://www.straitstimes.com/world/europe/russia-closes-crimea-bridge-after-official-declares-emergency"}