{"authors": [], "date_download": "2024-10-12 13:44:34", "date_modify": "2024-10-12 13:44:34", "date_publish": "2024-02-03 17:00:00", "description": "Scientists say shielding Earth from 2% of the Sun’s radiation will keep it in manageable climate boundaries. Read more at straitstimes.com.", "filename": "world_fringe-climate-proposal-a-giant-space-parasol-gains-interest_1728740674.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/03/ISRAEL-LEBANON-PALESTINIAN-CONFLICT-153333.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_fringe-climate-proposal-a-giant-space-parasol-gains-interest_1728740674.html", "title": "Fringe climate proposal of a giant space parasol gains interest", "title_page": "Fringe climate proposal of a giant space parasol gains interest | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SALT LAKE CITY, Utah - It has come to this. With Earth at its hottest point in recorded history, and humans doing far from enough to stop its overheating, a small but growing number of astronomers and physicists are proposing a potential fix that could have leapt from the pages of science fiction: the equivalent of a giant beach umbrella, floating in outer space.\nThe idea is to create a huge sunshade and send it to a faraway point between Earth and the Sun to block a small but crucial amount of solar radiation, enough to counter global warming. Scientists have calculated that if just shy of 2 per cent of the Sun’s radiation is blocked, that would be enough to cool the planet by 1.5 deg C and keep Earth within manageable climate boundaries.\nThe idea has been at the outer fringes of conversations about climate solutions for years. But as the climate crisis worsens, interest in sun shields has been gaining momentum, with more researchers offering up variations. There is even a foundation dedicated to promoting solar shields.\nA recent study led by the University of Utah explored scattering dust deep into space, while a team at the Massachusetts Institute of Technology is looking into creating a shield made of “space bubbles”.\nIn the summer of 2023, Dr Istvan Szapudi, an astronomer at the Institute for Astronomy at the University of Hawaii, published a paper that suggested tethering a big solar shield to a repurposed asteroid.\nNow scientists led by Professor Yoram Rozen, a physics professor and director of the Asher Space Research Institute at Technion-Israel Institute of Technology, say they are ready to build a prototype shade to show that the idea will work.\nTo block the necessary amount of solar radiation, the shade would have to be about 2.59 million sq km, roughly the size of Argentina, Prof Rozen said. A shade that big would weigh at least 2.5 million tonnes – too heavy to launch into space, he said. So, the project would have to involve a series of smaller shades. They would not completely block the Sun’s light, but rather cast slightly diffused shade onto Earth, he said.\nProf Rozen said his team was ready to design a prototype shade of 100 sq ft, or about 9 sq m, and is seeking between US$10 million (S$13.4 million) and US$20 million to fund the demonstration.\n“We can show the world, ‘Look, there is a working solution, take it, increase it to the necessary size,’” he said.\nProponents say that a sunshade would not eliminate the need to stop burning coal, oil and gas, the main drivers of climate change. Even if greenhouse gas emissions from fossil fuels were to immediately drop to zero, there is already excessive heat-trapping carbon dioxide in the atmosphere.\nThe Earth’s average temperature is on the brink of rising 1.5 deg C over the pre-industrial average.\nThat is the point beyond which the chances of extreme storms, drought, heatwaves and wildfires would increase significantly and humans and other species would struggle more to survive, scientists say. The planet has already warmed 1.2 deg C.\nA sunshade would help stabilise the climate, supporters of the idea say, while other climate mitigation strategies were being pursued.\n“I’m not saying this will be the solution, but I think everybody has to work towards every possible solution,” said Dr Szapudi, the astronomer who proposed tethering a sunshade to an asteroid.\nIt was 1989 when Dr James Early of the Lawrence Livermore National Laboratory suggested a “space-based solar shield” positioned near a fixed point between the Earth and the Sun called Lagrange Point One, or L1, some 1.5 million km away, four times the average distance between the Earth and the Moon. There, the gravitational pulls from the Earth and Sun cancel each other out.\nIn 2006, Professor Roger Angel, an astronomer at the University of Arizona, presented his proposal for a deflective sun shield at the National Academy of Sciences and later won a grant from the National Aeronautics and Space Administration’s Institute for Advanced Concepts to continue his research. He suggested releasing trillions of very lightweight spacecraft at L1, using transparent film and steering technology that would prevent the devices from drifting off orbit.\n“It’s just like you just turned a knob down on the Sun,” Prof Angel said, “and you don’t mess with the atmosphere.”\nThe sunshade idea has its critics, among them Ms Susanne Baur, a doctoral candidate who focuses on solar radiation modification modelling at the European Centre for Research and Advanced Training in Scientific Computation in France.\nA sunshade would be astronomically expensive and could not be implemented in time, given the speed of global warming, she said.\nIn addition, a solar storm or collision with stray space rocks could damage the shield, resulting in sudden, rapid warming with disastrous consequences, Ms Baur said.\nTime and money would be better spent on working to reduce greenhouse gas emissions and removing carbon dioxide from the atmosphere, she said, with a small portion of research devoted to “more viable and cost-effective” solar geo-engineering ideas.\nBut sunshade proponents say that at this stage, reducing greenhouse gas emissions will not go far enough to allay climate chaos, that carbon dioxide removal has proved extremely difficult to realise and that every potential solution ought to be explored.\nA fully operational sunshade would have to be resilient and reversible, Dr Szapudi said.\nIn his proposed design, he said 99 per cent of its weight would come from the asteroid, helping offset the cost. It would still likely carry a price tag of trillions of dollars, an amount that is far less than what is spent on military weapons, he said.\n“Saving the Earth and giving up 10 per cent of your weapons to destroy things is actually a pretty good deal in my book,” Dr Szapudi said.\nHe held up Tesla as an example of an idea that once seemed wildly ambitious, but within 20 years of its founding became the world’s top manufacturer of electric vehicles.\nMr Morgan Goodwin, executive director of the Planetary Sunshade Foundation, a non-profit organisation, said one reason sunshades have not gained as much traction is that climate researchers have been focused, quite naturally, on what is happening within the Earth’s atmosphere and not on space.\nBut the falling costs of space launches and investments in a space industrial economy have widened possibilities, Mr Goodwin said. The foundation suggests using raw materials from space and launching solar shade ships into L1 from the Moon, which would cost far less than setting off from Earth.\n“We think as the idea of sunshades becomes more understood by climate folks, it’s going to be a pretty obvious part of the discussion,” said Mr Goodwin, who is also senior director at the Angeles chapter of the Sierra Club.\nThe Technion model involves affixing lightweight solar sails to a small satellite sent to L1. Their prototype would move back and forth between L1 and another equilibrium point, with the sail tilting between pointing to the Sun and being perpendicular to it, moving like a slat on a Venetian blind. This would help keep the satellite stable and eliminate the need for a propulsion system, Prof Rozen said.\nProf Rozen said the team was still in the predesign phase but could launch a prototype within three years after securing funds.\nHe estimated that a full-sized version would cost trillions (a tab “for the world to pick up, not a single country”) but reduce the Earth’s temperature by 1.5 deg C within two years.\n“We at the Technion are not going to save the planet,” Prof Rozen said. “But we’re going to show that it can be done.” NYTIMES", "url": "https://www.straitstimes.com/world/fringe-climate-proposal-a-giant-space-parasol-gains-interest"}