{"authors": ["Bhagyashree Garekar"], "date_download": "2024-10-12 13:37:42", "date_modify": "2024-10-12 13:37:42", "date_publish": "2023-10-15 08:40:00", "description": "Bilateral ties will explore new areas such as emerging tech, outer space exploration and green energy. Read more at straitstimes.com.", "filename": "world_united-states_singapore-and-us-to-venture-into-new-areas-to-beef-up-ties-says-dpm-lawrence-wong_1728740262.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/15/MCIPhoto1.JPG?h=cc2b2e13", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_singapore-and-us-to-venture-into-new-areas-to-beef-up-ties-says-dpm-lawrence-wong_1728740262.html", "title": "Singapore and US to venture into new areas to beef up ties, says DPM Lawrence Wong", "title_page": "Singapore and US to venture into new areas to beef up ties, says DPM Lawrence Wong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – The United States will continue to play a dominant role in the world in the foreseeable future and Singapore will expand bilateral ties into new areas such as emerging technologies, outer space exploration and green energy, Deputy Prime Minister and Finance Minister Lawrence Wong said on Friday.\nSpeaking at the end of his 10-day visit to the US, Mr Wong noted that defence and security have always been key pillars of the relationship, and said Singapore seeks to go beyond these traditional areas.\n“We have launched a dialogue on critical and emerging technologies. We are looking at how we can do more in terms of exploration in outer space; we are looking at cooperation in green energy solutions,” he said. He added that the US and Singapore are also working together to jointly deliver technical assistance to countries in the Pacific Islands region.\nWhile conceding that an increasingly multipolar world will make for more complexity, Mr Wong said the US will retain its primacy.\n“There is China rising, there is India, there is Asean, so it will become a more complex environment. But the US will still be a dominant pole in this equation for quite some time to come,” he said in a 30-minute interview with the Singapore media.\nCalling the testy Washington-Beijing relationship the key issue of the day, Mr Wong noted that it had evolved since his visit to China in May, with both sides saying they do not want confrontation.\n“It will be very useful for both sides to be able to rebuild the strategic trust that is needed to take the relationship forward,” he said, adding that Singapore could be a facilitator.\nHopes have been raised for a meeting between US President Joe Biden and his Chinese counterpart Xi Jinping at the Asia-Pacific Economic Cooperation leaders’ summit to be held in San Francisco in November.\n“That is what we hope for, and to the extent that we can, we will try and do our part to facilitate this positive direction in the relationship,” Mr Wong said.\nHe dismissed talk of America’s decline.\n“When I was a student here in the early 90s, there were already fears that Japan would overtake the US. But look what has happened since then. The US economy has remained remarkably strong and resilient,” he said.\n“If, as a student in 1990, I had put US$100 in the S&P 500, I would be earning a lot of money today. If I had put that same US$100 in any other stock market anywhere else in the world, it would not have achieved the same amount of returns.”\nWill the US continue to outperform the rest of the world? Mr Wong said the chances are good.\n“Past performance is not a predictor of future success. But when you look at the underlying drivers of the US’ economic engine – the cutting-edge research that they have, the best universities in the world being in the US, the open society that attracts talent from everywhere around the world – I think these are all important drivers of the US’ innovation, growth and prosperity,” he said.\n“For the foreseeable future, at least, I think the US will continue to have a very strong leading position. And that is why we value and appreciate the very close relationship that we have with the US across many different areas.”\nMr Wong said there is a “full agenda ahead” for US-Singapore relations.\n“We have a deep reservoir of strategic trust between the two sides, and that enables us to continue to find very useful ways of partnership and collaboration in the years to come,” he added.\nDuring his visit, Mr Wong had substantive meetings with senior members of the Biden administration, covering a wide range of issues from national security to economics to finance, “reflecting the strong and multifaceted nature of our cooperation with the US”, a statement from Singapore’s Ministry of Foreign Affairs (MFA) said.\nAmong others, Mr Wong met National Security Adviser Jake Sullivan, Secretary of Commerce Gina Raimondo, Trade Representative Katherine Tai and National Economic Council director Lael Brainard.\nThe US is the largest foreign direct investor in Singapore, with an investment stock worth $421.8 billion in 2022. Its investment in Singapore is larger than American investment in China, Japan and South Korea combined. Singapore is the third-largest Asian investor in the US, after Japan and South Korea, with investment stock valued at US$57.5 billion (S$78.8 billion) in 2022.\nDuring his discussions in Washington, Mr Wong reiterated Singapore’s commitment to green energy and net zero emissions by 2050 despite being an alternative-energy disadvantaged nation. Singapore is exploring all options to decarbonise its power sector, including emerging technologies like low-carbon hydrogen, and advanced geothermal energy systems.\n“In this context, DPM Wong expressed Singapore’s interest to cooperate with the US to explore the possible role of civilian nuclear energy in the green energy transition,” the MFA statement said.\nIn his remarks to the media, Mr Wong said Singapore did not have any easy way to get to net zero because it did not have the means to deploy renewable energy at scale.\n“Solar, we do not have enough land; wind and tidal, these are not options for us,” he said.\n“It is all very preliminary and at a very exploratory stage because we have not made any decisions,” he said about Singapore studying civilian nuclear energy.\n“Because the technology is evolving and you see newer, safer nuclear options evolving, we would like to study these, not preclude them at this early juncture, and build up capacity in this area. So that is one of the new specific areas that we are looking at to collaborate with the US.”\nAnswering a question on the situation in Gaza, where Israel is preparing to launch “a significant ground operation” in response to an attack by Palestinian militant group Hamas, Mr Wong said the safety and security of civilians are an urgent priority. The war has claimed more than 3,500 lives since Hamas launched attacks on Oct 7\n“The US and regional partners are also trying very hard to prevent an escalation of the situation so that you do not end up with a wider conflict that involves other countries in the Middle East,” he said.\nSingapore is watching the situation very closely, and an escalation will impact South-east Asia and Singapore too. “On the economic front, you could have implications for oil, disruptions in supplies of energy, and that will impact the economy,” Mr Wong said.\n“On the security front, you could have extremist and terrorist groups who are trying to exploit the situation. You already see wider calls for a jihad against Israel. That is very dangerous and we know that Singapore can be a very attractive target,” he said, adding that Singapore is stepping up security measures to ensure external events do not impact its peace and harmony built up over decades.", "url": "https://www.straitstimes.com/world/united-states/singapore-and-us-to-venture-into-new-areas-to-beef-up-ties-says-dpm-lawrence-wong"}