{"authors": [], "date_download": "2024-10-12 14:05:08", "date_modify": "2024-10-12 14:05:08", "date_publish": "2022-10-18 09:21:29", "description": "Russia's bombing of Ukraine's capital on Monday was delivered by Iranian-made drones. Read more at straitstimes.com.", "filename": "world_europe_drones-embody-an-iran-russia-alliance-built-on-hostility-to-the-us_1728741908.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/18/10249347_1.jpg?VersionId=4e7qDNqGGNuhlQFHEVQlTOqfWMirjQQ4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_drones-embody-an-iran-russia-alliance-built-on-hostility-to-the-us_1728741908.html", "title": "Drones embody an Iran-Russia alliance built on hostility to the US", "title_page": "Drones embody an Iran-Russia alliance built on hostility to the US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TEHERAN - The Iranian-made drones that Russia sent on Monday to divebomb Ukraine’s capital delivered the most emphatic proof yet that Teheran has become a rare, increasingly close ally to the Kremlin, offering both weapons and international support that Russia sorely lacks.\nThere is no deep love between Russia - newly a pariah for attacking another country - and Iran, which for decades are among the most strategically isolated nations in the world. But the two authoritarian governments, both chafing under Western sanctions, share a view of the United States as their great enemy and a threat to their grip on power.\n“This is a partnership of convenience between two embattled dictatorships,” said Mr Karim Sadjadpour, an Iran expert at the Washington-based Carnegie Endowment for International Peace.\nBoth countries are deep in crisis, struggling economically and politically. Iran is attempting to quell street protests that pose the most serious challenge in years to the government, while Russia is trying to manage rising dissension over a faltering war effort and an unpopular draft.\nThe emergence of a Moscow-Teheran alliance has multiple international implications, potentially dimming prospects for a new agreement to rein in Iran’s nuclear programme and raising the pressure on Israel, Iran’s sworn enemy, to take Ukraine’s side in the war.\nThe relationship between Russia and Iran has been developing for years.\nRussian President Vladimir Putin deployed his air force to Syria starting in 2015 to prevent the collapse of the regime of President Bashar al-Assad, a longtime ally of Teheran. Russia and Iran worked in lock step militarily, with Russian warplanes providing cover for Iranian militiamen and Iranian proxy forces fighting on the ground.\nSyria was one example of the effort by both to find ways to sap American strength and prestige wherever they could in the world, and Ukraine provides a similar opportunity on an even larger, more visible scale.\nAfter its 1979 revolution, Iran formulated foreign policy around the slogan “Neither East Nor West”, equally wary of the Soviet Union and the US. Now, the Islamic Republic is choosing sides, analysts said, and images of Iran’s exploding drones accurately hitting their targets advertise it as a regional power to be taken seriously.\nIn Teheran, the spokesman for the Iranian foreign ministry denied on Monday that his country was selling weapons to Russia, even as social media outlets linked to Iran’s Revolutionary Guard, which developed the lumbering yet lethal drones, boasted about them.\n“There is no doubt that the drones used by Russia’s military are Iranian,” said a post on Sepah Cyberi, a Telegram channel affiliated with the Guard, while the country’s cyberarmy chief Ali Akbar Raefipour gloated on Twitter that Iran’s Shahed drone was now “the most talked about weapon in the world”.\nIran does not want to highlight the weapons sales because Ukraine is generally more popular than Russia among ordinary Iranians, and the Islamic Republic casts itself as a defender of underdogs in world affairs, said Dr Mahmoud Shoori, deputy director of the Institute of Iran and Eurasia Studies in Teheran and an expert on Iran-Russia relations.\nBut at the same time, “Iran also wants to show the world that it has a military superpower as an ally and it has the capacity to sell weapons to such a power”, he said in a telephone interview. “It shows the West’s policies of maximum pressure to isolate Iran have not worked.”\nIran or its proxies have been accused of using drones for attacks on adversaries in its own region, such as Saudi Arabia.\nFor Iran, Russian use of its drones sends a message to its domestic audience, including those who have been protesting against restrictions on women’s rights and personal freedom for weeks.\nThe government is trying to show Iranians that it is “not in a position of weakness, and has not been cowed by external pressure and threats,” said Dr Ali Vaez, the Iran project director for the International Crisis Group, an independent research institute.\nThe Washington Post reported on Sunday that Iran would also sell short-range ballistic missiles to Russia, weapons far more deadly than the drones. Analysts used to laugh off Iranian missiles as cheap knockoffs of Soviet or North Korean weapons, but no longer.\nIn recent years, Iran has made “lots of advances and has really improved their targeting ability”, said Dr Afshon Ostovar, an associate professor of Middle Eastern politics at the Naval Postgraduate School in Monterey, California.\nIt is not clear how Saudi Arabia, Iran’s primary regional adversary, will react to the Kremlin’s drawing closer to Teheran. The Saudi government and Moscow have joined forces recently in trying to raise oil prices, irking Washington and fuelling inflation.\nIn Israel on Sunday, Cabinet Minister Nachman Shai said on social media that Iran’s military assistance to Russia removed “any doubt where Israel should stand in this bloody conflict. The time has come for Ukraine to receive military aid, as well, just as the USA and Nato countries provide”. NYTIMES", "url": "https://www.straitstimes.com/world/europe/drones-embody-an-iran-russia-alliance-built-on-hostility-to-the-us"}