{"authors": [], "date_download": "2024-10-12 13:48:34", "date_modify": "2024-10-12 13:48:34", "date_publish": "2023-02-11 18:45:00", "description": "The balloon was equipped with an antenna to pinpoint the locations of communications devices. Read more at straitstimes.com.", "filename": "world_united-states_what-was-the-chinese-spy-balloon-trying-to-collect_1728740914.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/12/TOPSHOTS-TOPSHOT-US-CHINA-BALLOON-DEBRIS-ESPIONAGE-064014.jpg?VersionId=FPupygmqq90_Frk0KKu6fsZdNg_4nB_O", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_what-was-the-chinese-spy-balloon-trying-to-collect_1728740914.html", "title": "What was the Chinese spy balloon trying to collect?", "title_page": "What was the Chinese spy balloon trying to collect? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – The United States government is combing through a variety of intelligence – debris, reconnaissance plane photos and old observations – to learn what the Chinese spy balloon was after as it made its way across the US in early February before being shot down by a Sidewinder missile fired by a stealth fighter jet last weekend.\nThe Chinese spy balloon was equipped with an antenna meant to pinpoint the locations of communication devices and was capable of intercepting calls made on those devices, according to declassified intelligence released by the State Department on Thursday.\nThe balloon, which traversed America for several days, transfixed the public and focused attention both in Washington and across the country on the intensifying rivalry between China and the US.\nIn the wake of the discovery of the balloon, Secretary of State Antony Blinken cancelled a planned trip to Beijing.\nChina, perhaps in retaliation, rebuffed attempts by Defence Secretary Lloyd Austin to call his Chinese counterpart to discuss the spy balloon, further raising the temperature of an already tense relationship between the world’s two superpowers.\nHere is what we know about the balloon.\nWhat was the spy balloon collecting?\nThis is the big question. Officials do not yet know what information the balloon was supposed to be stealing as it made its way across the country.\nThe balloon had a signals intelligence array – fancy spy speak for an antenna that can locate communication devices and listen in on them.\nBut officials do not yet know if that array was meant to gather calls made on military radios or from ordinary mobile phones, or something else altogether.\nHow many spy balloons have there been?\nBalloons are hard to pick up on radar. Many of the first Chinese spy balloons that were observed near US military exercises or bases were not identified as surveillance tools.\nInstead, they were classified as unidentified aerial phenomena, modern-day Pentagon jargon for unidentified flying objects.\nOver the past 18 months, the US began learning more about the Chinese spy balloon programme.\nAs officials reviewed some previous cases of unidentified aerial phenomena, they determined that they were spy balloons.\nA review of the old data showed that at least three spy balloons entered US airspace during the Trump administration.\nThere was at least one additional visit during the Biden administration.\nBut all of those previous incidents were relatively short – not the days-long transit of this month’s spy balloon.\nWas this part of a wider Chinese surveillance programme?\nChina has developed a spy balloon programme as a complement to its fleet of reconnaissance satellites, American officials said, with a mission to collect information across the world.\nBecause the capabilities of the spy balloons are not yet perfectly understood, it is not certain if they gather different information from China’s satellites.\nNevertheless, officials said, at the very least, the balloons can linger longer over a site than a satellite.\nAnd while reconnaissance satellites are often focused on imagery, the balloons appear to be mostly about collecting communications.\nSome officials say the spy balloon programme has been focused on the Pacific region, collecting information on US bases and allied military operations.\nAnd of course, the Chinese do not just use balloons to conduct surveillance at military bases. Some classified reports suggest they are also using advanced technologies to collect information about the US military.\nIs this a big deal or not?\nYes. To be clear, the balloon saga is not comparable with an earthquake in Turkey that killed more than 20,000. Nor is it comparable with the war in Ukraine that is set to enter into a second year.\nThat said, the spy balloon incident will complicate the relationship between the two most powerful countries on earth.\nSome policymakers and lawmakers in Washington have been arguing for years that the US public has not taken the challenge of China seriously enough – prioritising the country’s cheap mobile phones and entertaining videos on its TikTok platform over concerns about an authoritarian state that bolsters its power through the intrusive surveillance of its people.\nBut the balloon ordeal was a big enough deal for the State Department to cancel Secretary of State Antony Blinken’s planned trip – the first by a Biden Cabinet secretary to Beijing – without rescheduling it.\nWhen he cancelled the trip, Mr Blinken said the entry of the balloon was a “clear violation of US sovereignty and international law.”", "url": "https://www.straitstimes.com/world/united-states/what-was-the-chinese-spy-balloon-trying-to-collect"}