{"authors": [], "date_download": "2024-10-12 14:10:32", "date_modify": "2024-10-12 14:10:32", "date_publish": "2018-11-13 07:57:44", "description": "WASHINGTON (NYTIMES) - Shortly after journalist Jamal Khashoggi was killed last month at the Saudi Consulate in Istanbul, a member of the kill team instructed a superior over the phone to \"tell your boss\", believed to be Crown Prince Mohammed bin Salman, that the operatives had carried out their mission, according to three people familiar with a recording of Mr Khashoggi's killing collected by Turkish intelligence. Read more at straitstimes.com.", "filename": "world_united-states_tell-your-boss-recording-is-seen-to-link-saudi-crown-prince-more-strongly-to_1728742232.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/11/13/nz-saudi-131118.jpg?VersionId=.MEx.GpwjNPz6a38Je3nctb2m.PVqolz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_tell-your-boss-recording-is-seen-to-link-saudi-crown-prince-more-strongly-to_1728742232.html", "title": "'Tell your boss': Recording is seen to link Saudi crown prince more strongly to Khashoggi killing", "title_page": "'Tell your boss': Recording is seen to link Saudi crown prince more strongly to Khashoggi killing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (NYTIMES) - Shortly after journalist Jamal Khashoggi was killed last month at the Saudi Consulate in Istanbul, a member of the kill team instructed a superior over the phone to \"tell your boss\", believed to be Crown Prince Mohammed bin Salman, that the operatives had carried out their mission, according to three people familiar with a recording of Mr Khashoggi's killing collected by Turkish intelligence.\nThe recording, shared last month with CIA Director Gina Haspel, is seen by intelligence officials as some of the strongest evidence linking Crown Prince Mohammed to the killing of Mr Khashoggi, a Virginia resident and Washington Post columnist whose death prompted an international outcry.\nWhile he was not mentioned by name, US intelligence officials believe \"your boss\" was a reference to Crown Prince Mohammed. Maher Abdulaziz Mutreb, one of 15 Saudis dispatched to Istanbul to confront Mr Khashoggi, made the phone call and spoke in Arabic, the people said.\nTurkish intelligence officers have told US officials they believe that Mutreb, a security officer who frequently travelled with Crown Prince Mohammed, was speaking to one of the crown prince's aides.\nWhile translations of the Arabic may differ, the people briefed on the call said Mutreb also said to the aide words to the effect of \"the deed was done\".\n\"A phone call like that is about as close to a smoking gun as you are going to get,\" said Dr Bruce Riedel, a former CIA officer now at the Brookings Institution. \"It is pretty incriminating evidence.\"\nTurkish officials have said that the audio does not conclusively implicate Crown Prince Mohammed, and US intelligence and other government officials have cautioned that however compelling the recording may be, it is still not irrefutable evidence of his involvement in the death of Mr Khashoggi.\nEven if Mutreb believed the killing was ordered by the crown prince, for example, he may have had an inaccurate understanding of the origins of the order. Crown Prince Mohammed is not specifically named on the recording, and intelligence officials do not have ironclad certainty that Mutreb was referring to him.\nIn a statement on Monday, Saudi officials denied that the crown prince \"had any knowledge whatsoever\" of Mr Khashoggi's killing.\nReferring to Mutreb's instructions to \"tell your boss\", the Saudi statement said that Turkey had \"allowed our intelligence services to hear recordings, and at no moment was there any reference to the mentioned phrase in the such recordings\".\nThe Turks may possess multiple recordings, including surveillance of telephone calls, and Turkish authorities may have shared the audio only selectively.\nA CIA spokesman declined to comment.\nThe call was part of a recording that Turkish officials played for Ms Haspel during her visit in October to Ankara, Turkey's capital, but they did not allow her to bring it back to the United States.\nOn Saturday, President Recep Tayyip Erdogan of Turkey announced that his government had shared the audio with Saudi Arabia, the United States and other Western allies.\nBut while Turkish officials have played the recording for US and other intelligence agencies and provided transcripts, the Turks have not handed over the recording for independent analysis, according to Turkish officials.\nTurkey shared evidence from the case with \"a large number of friendly nations\", a spokesman for Mr Erdogan, Mr Fahrettin Altun, said Monday.\nReacting to French criticism of Turkey's handling of the case, Mr Altun said that the Turkish government had played an audio recording for French intelligence officials and given them transcripts.\n\"Let us not forget that this case would have been already covered up had it not been for Turkey's determined efforts,\" Mr Altun said.\nThe growing evidence that Crown Prince Mohammed was involved in the killing of Mr Khashoggi is certain to intensify pressure on the White House, which appeared intent on relying on a lack of concrete proof of his involvement to preserve its relationship with him.\nThe crown prince has fostered a close relationship with the President's son-in-law and senior adviser, Mr Jared Kushner, and the Trump administration has turned Saudi Arabia into Washington's most crucial Arab partner.\nSome Trump advisers have argued that they would need indisputable evidence of Crown Prince Mohammed's involvement in Mr Khashoggi's killing before they would punish him or the kingdom more harshly.\nTurkish officials have said the recording contains evidence of a premeditated killing, in which Saudi agents quickly strangled Mr Khashoggi and methodically dismembered his body with a bone saw.\nThe administration, according to current and former officials, is hoping that making some modest moves on sanctions and curtailing support for the Saudi war effort in Yemen will satisfy critics, including those on Capitol Hill.\nBut the shift in power in Congress, where Democrats take control of the House in January, is also increasing pressure on the administration to take more punitive action.\nThe CIA and other intelligence officials were set to brief Congress this week, and congressional leaders will press Ms Haspel for her assessment of Crown Prince Mohammed's culpability.\nMr Trump himself has suggested more information would be coming out.\n\"I'll have a much stronger opinion on that subject over the next week,\" he told reporters on Wednesday at the White House. \"I am forming a very strong opinion.\"\nSigns of a hardening stance within the administration are emerging. The State Department issued a tough statement on Sunday saying that Secretary of State Mike Pompeo had told Crown Prince Mohammed in a phone call that \"the United States will hold all of those involved in the killing of Jamal Khashoggi accountable\".\nSaudi officials planned to release their own inquiry in the coming days, but Turkey's revelation that they and Western officials also have the transcripts of the recordings could force the Saudis to scramble before any presentation they planned to make.\nEven without definitive proof, intelligence agencies had already concluded that only Crown Prince Mohammed could have ordered the operation to kill Mr Khashoggi, given the personal character of his governance and the depth of his control over the kingdom.\nEvidence from the tape also showed that Mr Khashoggi was killed soon after he entered the room of the Saudi Consulate in Istanbul where the security team was waiting for him, further proof that the killing was planned, according to people briefed on the intelligence.\nCurrent and former intelligence officials insisted that it is rare that all of the pieces of a complex puzzle like Mr Khashoggi's killing would ever be available. Intelligence, according to a former official, simply does not work like a spy thriller or television cop show where a case turns on a crystal-clear recording.\nInvestigators were unlikely to collect a piece of evidence that incontrovertibly links the crown prince to the killing, said Representative Adam Schiff, a California Democrat, who is set to lead the House Intelligence Committee next year.\n\"You are not going to have any of the people who carried out the murder speak openly about who they got their orders from or who is in the loop on it,\" Mr Schiff said in an interview. \"That is not realistic to expect.\"\nThe absence of direct evidence does not prevent the intelligence community from laying responsibility at Crown Prince Mohammed's feet. An intelligence assessment includes an agency's best judgement on what happened based on the available facts and experience of officials.\nMr Schiff promised that when he takes charge of the Intelligence Committee, he will investigate Mr Khashoggi's killing and examine Saudi Arabia's actions more broadly in the Middle East, including its military campaign in Yemen, which has prompted a humanitarian crisis.\n\"We need to do our own due diligence, we need to make sure we are getting good intelligence, and we need to make sure the administration doesn't misrepresent to the country what foreign actors are doing,\" Mr Schiff said.\nNonetheless, current and former officials said they do not expect Mr Trump to drop his support for Crown Prince Mohammed.\n\"The Trump family and the President have built up such an overwhelming reliance on the crown prince that the relationship is now, in their view, too big to fail,\" Mr Schiff said.\nPolicymakers - not Ms Haspel or Mr Dan Coats, the director of national intelligence - will decide what sort of relationship to have with Crown Prince Mohammed and what punishment Saudi Arabia should face for Mr Khashoggi's killing, current and former officials said.", "url": "https://www.straitstimes.com/world/united-states/tell-your-boss-recording-is-seen-to-link-saudi-crown-prince-more-strongly-to"}