{"authors": [], "date_download": "2024-10-12 14:07:50", "date_modify": "2024-10-12 14:07:50", "date_publish": "2022-09-07 07:01:43", "description": "But he made no mention of a new military success in the east hinted at by officials earlier. Read more at straitstimes.com.", "filename": "world_europe_zelensky-says-ukraine-forces-shot-down-five-russian-cruise-missiles_1728742070.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/07/ac_2s7_070922.jpg?VersionId=x53h3PW1LjDnwO97Dy7t6CPHQJN.f20t", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_zelensky-says-ukraine-forces-shot-down-five-russian-cruise-missiles_1728742070.html", "title": "Zelensky says Ukraine forces shot down five Russian cruise missiles", "title_page": "Zelensky says Ukraine forces shot down five Russian cruise missiles | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV/VIENNA - Ukrainian forces shot down five Russian cruise missiles on Tuesday, most of them in the south, President Volodymyr Zelensky said, but he made no mention of a new military success in the east hinted at by officials earlier.\n\"This morning alone, five of six Russian X-101 missiles were downed,\" Mr Zelensky said in an evening address.\n\"This is a costly loss for Russia, and it saves many Ukrainian lives. Four of these missiles were downed by the 'South' district of the air command.\"\nReuters was not able to independently verify Mr Zelensky's statement and there was no immediate response from Russia.\nThough Ukrainian officials did not give specific details, several posts on social media from military bloggers and witnesses reported fighting around Balakliia, an eastern town of 27,000 people that lies between Kharkiv and Russian-held Izyum, a city with a major railway hub used by Moscow to supply its forces.\nOne tweet by a Zelensky adviser spoke of \"great news\" coming from the president on the operation in Kharkiv region.\nReuters was unable to independently verify the reports posted on social media.\nLittle information has emerged about progress of the main Ukrainian offensive in the southern Kherson region, with Kyiv barring journalists from the front line and releasing only limited reports to preserve the element of surprise.\nRussia says it has repelled the Kherson assault, but Ukraine has reported steady success.\nWestern military experts say Ukraine's aim in the south appears to be to trap thousands of Russian troops on the west bank of the wide Dnipro River and cut them off by destroying their rear supply lines.\nThe announcement of a simultaneous Ukrainian advance near Kharkiv was an indication that Russian troops were having difficulty reinforcing along the front, said Mr Mark Hertling, a retired former US commander of ground forces in Europe.\n\"This confirms RU inability to manoeuvre forces between theatre locations & within their force's defensive 'stance' to counter Ukrainian offensive actions,\" Mr Hertling tweeted.\nThere have also been increasing attacks by Ukrainians in Russian-occupied areas against Moscow-installed authorities.\nOn Tuesday, the Russian-installed commandant of the southern port of Berdiansk was badly injured when his car was blown up outside the city administration building, pro-Russian local officials said, blaming Ukraine for the attack.\nIn the latest plea by United Nations (UN) Secretary-General Antonio Guterres to demilitarise the area around the Russian-held Zaporozhzhia nuclear power plant in southern Ukraine, he laid out specific steps for both sides on Tuesday.", "url": "https://www.straitstimes.com/world/europe/zelensky-says-ukraine-forces-shot-down-five-russian-cruise-missiles"}