{"authors": [], "date_download": "2024-10-12 14:07:21", "date_modify": "2024-10-12 14:07:21", "date_publish": "2022-09-03 14:48:17", "description": "Russia delays pipeline reopening in blow to Europe, as G-7 agrees on Russian oil price cap. Read more at straitstimes.com.", "filename": "world_europe_russia-west-step-up-energy-war-as-risk-of-nuclear-disaster-haunts-ukraine_1728742041.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/03/ads-iaea-030922.jpg?VersionId=6DntDIbsPipJs6KZ.IV34VNRaijVNAI1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-west-step-up-energy-war-as-risk-of-nuclear-disaster-haunts-ukraine_1728742041.html", "title": "Russia, West step up energy war as risk of nuclear disaster haunts Ukraine", "title_page": "Russia, West step up energy war as risk of nuclear disaster haunts Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ZAPORIZHZHIA, Ukraine - As United Nations inspectors sought to avert a nuclear disaster on Ukraine's frontline, the West and Russia wounded each other's economies, with Moscow keeping its main gas pipeline to Germany shut Saturday while threatened with price caps on oil exports.\nRussia's state-controlled energy giant Gazprom blamed a technical fault in the Nord Stream 1 pipeline for the delay Friday. But the high-level manoeuvres in energy politics were seen as an extension of the war, and the ramifications would be felt far beyond Ukraine.\nThe announcements came as Moscow and Kyiv traded blame over their actions at the Russian-occupied Zaporizhzhia nuclear power plant, where UN inspectors arrived Thursday on a mission to help avert a catastrophe.\nMr Vladimir Rogov, a pro-Russian official in the Zaporizhzhia region, said Ukrainian forces shelled Europe's largest nuclear plant several times overnight, and the main power line to the station was downed, forcing it to use reserve power.\nTit-for-tat\nGazprom's indefinite delay to resuming gas deliveries will deepen Europe's problems securing fuel for winter, with living costs already surging, led by energy prices.\nNord Stream 1, which runs under the Baltic Sea to supply Germany and others, had been due to resume operating after a three-day halt for maintenance on Saturday, but the pipeline operator reported zero flows.\nMoscow has blamed sanctions, imposed by the West after Russia's Feb 24 invasion of Ukraine, for hampering routine operations and maintenance of Nord Stream 1.\nBrussels and Washington accuse Russia of using gas as an economic weapon.\nThe United States said it has been collaborating with Europe to ensure sufficient supplies are available for winter.\nFinance ministers from the Group of Seven wealthy democracies - Britain, Canada, France, Germany, Italy, Japan and the US - said Friday a cap on the price of Russian oil was meant to \"reduce… Russia's ability to fund its war of aggression whilst limiting the impact of Russia's war on global energy prices\".\nThe Kremlin, which calls the conflict \"a special military operation\", said it would stop selling oil to any countries that implemented the cap.\nA reactor at the site was reconnected to Ukraine's grid Friday, a day after it shut down due to shelling near the site, Ukraine's state nuclear company Energoatom said.\nThe site sits on the south bank of a huge reservoir on the Dnipro River, 10 km across the water from Ukrainian positions.\nEach side has accused the other of shelling near the facility, which is still operated by Ukrainian staff and supplies more than a fifth of Ukraine's electricity in peacetime.\nKyiv also accuses Russia of using it to shield its weapons, which Moscow denies.\nRussia has so far resisted international calls to pull troops out of the plant and demilitarise the area.\nUkraine's state nuclear company said Russia barred the IAEA team from the plant's crisis centre, where Kyiv says Russian troops are stationed. That would make it difficult to make an impartial assessment.\nUkrainian President Volodymyr Zelensky urged the IAEA team to go further, despite the difficulties.\n\"Unfortunately we haven't heard the main thing from the IAEA, which is the call for Russia to demilitarise the station,\" Mr Zelenskiy said.\nElsewhere\nRussian Defence Minister Sergei Shoigu said Ukraine was continuing to use weapons from its Western allies to shell the plant. He rejected assertions by Kyiv and the West that Russia has deployed heavy weapons at the plant.\nSeveral towns near the plant came under Russian shelling Thursday, Zaporizhzhia regional council mayor Mykola Lukashuk said.\nMr Rogov, the pro-Russian official, said Ukrainian forces shelled Enerhodar, the Russia-held town near the power station. He repeated accusations that Ukraine mounted a commando-style raid on the station with speedboats on the river. Ukrainian officials have dismissed this as a fabrication.\nElsewhere on the frontlines, Ukraine started an offensive this week to recapture territory in southern Ukraine, mainly further down the Dnipro in neighbouring Kherson province. Both sides have claimed battlefield successes in the initial days of what Ukrainians bill as a potential turning point in the war.\nDetails have been scarce, with Ukrainian officials releasing little information. Ukraine's general staff said Friday Russian forces shelled dozens of cities and towns, including Kharkiv, Ukraine's second-largest city, in the north and in the Donetsk region in the east. REUTERS", "url": "https://www.straitstimes.com/world/europe/russia-west-step-up-energy-war-as-risk-of-nuclear-disaster-haunts-ukraine"}