{"authors": [], "date_download": "2024-10-12 13:36:22", "date_modify": "2024-10-12 13:36:22", "date_publish": "2024-09-10 19:57:37", "description": "He started to show symptoms of what could be a bladder infection or colic on Sept 6. Read more at straitstimes.com.", "filename": "world_europe_frenchman-on-trial-for-rape-of-drugged-wife-is-hospitalised-lawyer-says_1728740182.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/LYNXMPEK890EY-1.jpg?VersionId=PQR.2hlUPE4mkRiWNznad70dPW1gQHyP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_frenchman-on-trial-for-rape-of-drugged-wife-is-hospitalised-lawyer-says_1728740182.html", "title": "Frenchman on trial for mass rape of wife back in court on Wednesday", "title_page": "Frenchman on trial for mass rape of wife back in court on Wednesday | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AVIGNON, France - A Frenchman being tried for recruiting strangers to rape his drugged wife will be back in court on Sept 11, after being admitted to hospital, the presiding judge at his trial said.\nThe hospital admission on Sept 10 of Dominique Pelicot, a 71-year-old retiree accused of repeatedly raping and enlisting dozens of strangers to abuse his heavily sedated wife, had sparked speculation that the trial may be adjourned, but the presiding judge said the trial could now continue as planned.\nThe judge, Roger Arata, said he had been handed a medical certificate saying that Pelicot was fit to resume his ordinary daily activities and his state allowed the transfer from his prison cell to the courtroom.\nIt was not clear when the judge might call Pelicot to testify.\nPelicot has been on trial since last week, as are 50 other men, aged between 26 and 74, for alleged involvement, in a case that has horrified France.\nThe main defendant, who has admitted to the charges against him, had been scheduled to be questioned on Tuesday afternoon, but on Sept 9 appeared frail, leaning on a cane and the glass side of the dock, and was excused from court over what his lawyer, Ms Beatrice Zavarro, said was abdominal pain.\nPresiding judge Arata ordered that the accused be examined, saying he could request a suspension of the trial “until his state of health improves”.\nMs Zavarro said that her client was in no way “evading” his trial.\n“He has always said he would be present and testify. It’s essential,” she added.\n‘Nothing will change’\nExperts on Sept 9 had described Pelicot as a self-centred manipulator with no empathy and a split personality.\nHis ex-wife and victim, Ms Gisele Pelicot, 71, says she was troubled by strange memory lapses for years until police uncovered the abuse by chance after he was caught filming up women’s skirts in a local supermarket.\nThe trial is open to the public at her request to raise awareness about the use of drugs to commit sexual assault.\nThe family’s attorney, Mr Stephane Babonneau, earlier on Sept 10 said it was “absolutely necessary that Mr Pelicot be treated medically and be able to attend the debates”.\nMs Gisele Pelicot and her children “do not wish to testify without him being present,” he added.\nMost of the alleged rapes took place in the Pelicot home in Mazan, a village of 6,000 people in the southern region of Provence.\nPelicot kept meticulous records of the abuse of his wife, discovered after police seized his computer and other equipment.\n‘Deep unconscious state’\nAn investigator, who waded through images and footage found on the main defendant’s computer, told the court on Sept 10 that all the co-accused must have known that Ms Gisele Pelicot was unconscious.\n“Beyond the images, you need to listen to the sound. You immediately notice that she’s sleeping,” Mr Stephan Gal said.\n“Some even came back on several occasions, and none could have been unaware that she was in a deep unconscious state.”\nEighteen of the 51 accused, including Pelicot, are in custody, while 32 other defendants are attending the trial as free men.\nThe last one, still at large, is being judged in absentia.\nThe investigator recounted the case of one of the co-defendants, Mathieu D, accused of sexually abusing Ms Gisele Pelicot, like many others without a condom.\nPolice identified him thanks to a distinctive tattoo, Mr Gal said.\nThey found his contact in the main defendant’s telephone, and his phone data showed he was in Mazan on the same day.\nWhen interrogated, Mathieu D “said he knew Dominique Pelicot was going to put his wife to sleep, but he thought it was part of a ‘sexual game’. He said it was presented as a scenario and he had naively, blindly gone for it,” Mr Gal said.\nThe main defendant’s daughter, Ms Caroline Darian, 45, has said her life was “literally turned upside down” when she heard of the abuse.\nPhotomontages of her naked had also been found on her father’s computer.\nThe couple’s two sons are still due to speak. AFP", "url": "https://www.straitstimes.com/world/europe/frenchman-on-trial-for-rape-of-drugged-wife-is-hospitalised-lawyer-says"}