{"authors": [], "date_download": "2024-10-12 13:38:09", "date_modify": "2024-10-12 13:38:09", "date_publish": "2024-08-22 17:37:46", "description": "He met top commander Oleksandr Syrskyi during his visit to the Sumy region, and touted the capture of another Russian village. Read more at straitstimes.com.", "filename": "world_europe_ukraines-zelenskiy-visits-border-area-near-russia-incursion_1728740289.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/22/GVk2T3VXkAAzSJp.jpg?VersionId=zf7zCJCOd3Tc0TMzxqxu9RrQWSl7sTEi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraines-zelenskiy-visits-border-area-near-russia-incursion_1728740289.html", "title": "Zelensky visits border area near Ukraine’s incursion into Russia", "title_page": "Zelensky visits border area near Ukraine’s incursion into Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine's President Volodymyr Zelensky said on Aug 22 he had travelled to the country's north-east border area from where Kyiv's forces have conducted a major cross-border offensive into Russia's Kursk region, and touted the capture of one more Russian village.\nThe Ukrainian leader said he had met his top commander, Colonel-General Oleksandr Syrskyi, during the visit to the Sumy region, more than two weeks since Ukraine wrongfooted Russia by smashing through the border with thousands of troops.\n\"In certain areas of the Kursk region under the control of Ukraine, there is one more settlement, and we have a replenishment of the exchange fund,\" he said, referring to the capture of Russian soldiers who could be exchanged for Ukrainian prisoners of war held by Moscow.\nMr Zelensky published a video showing him shaking Col-Gen Syrskyi's hand and embracing him. The operation into the Kursk region has given a major morale boost to the Ukrainian military after months of slow but steady Russian gains in the east.\nRussian President Vladimir Putin has said Moscow will deliver a \"worthy response\" to the incursion, which he has described as a major provocation.\nUkraine has closely guarded its overarching aims in the Kursk region, but said it has carved out a buffer zone from an area that Russia has used to pound targets in Ukraine with cross-border strikes.\nIn a statement accompanying the video, Mr Zelensky wrote that there had been a decrease in shelling and in civilian casualties in the Sumy region since the Kursk operation.\nMr Zelensky said Col-Gen Syrskyi had briefed him on steps taken by Ukraine to reinforce its defences on the eastern fronts near the settlements of Toretsk and Pokrovsk, where Moscow's forces have concentrated their offensive for months. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraines-zelenskiy-visits-border-area-near-russia-incursion"}