{"authors": [], "date_download": "2024-10-12 14:01:09", "date_modify": "2024-10-12 14:01:09", "date_publish": "2024-04-17 15:10:17", "description": "Ukraine pleads for more help as Russia launches its deadliest strike in weeks on Chernihiv. Read more at straitstimes.com.", "filename": "world_europe_russian-attack-kills-people-in-ukraines-chernihiv-hits-infrastructure-governor-says_1728741669.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/18/2024-04-17T094650Z461152256RC2887ARIXTKRTRMADP3UKRAINE-CRISIS-ATTACK-CHERNIHIV.JPG?VersionId=CmA9sY7iN1jNKZY.9rRd7_E59fjQazCD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russian-attack-kills-people-in-ukraines-chernihiv-hits-infrastructure-governor-says_1728741669.html", "title": "Russian missile barrage on Ukraine city kills 18", "title_page": "Russian missile barrage on Ukraine city kills 18 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CHERNIHIV, Ukraine – Rescuers were removing mountains of rubble on April 18 from the site of a lethal Russian missile strike on Ukraine’s historic city of Chernihiv, where at least 18 people were killed in an attack that has prompted fresh pleas for allies to boost Kyiv’s overstretched air defence systems.\nThree Russian missiles crashed into the northern Ukrainian city on April 17, leaving pools of blood on the street at the scene of one strike, where rescue workers searched for survivors and carried away the wounded on stretchers.\nThe official death toll rose to 18 by the morning of April 18. Seventy-seven people – including four children – were injured, according to Ukraine’s emergency services department.\nAs President Volodymyr Zelensky appealed for more help from Western allies, the US House of Representatives finally announced a vote on a massive military aid package that includes about US$61 billion (S$82 billion) in long-delayed support for Kyiv, a move welcomed by President Joe Biden.\nChernihiv resident Olga Samoilenko told AFP she and her children found shelter in the corridor of their apartment building after the first missile exploded.\n“Our neighbours were already there. We started shouting for everyone to fall to the floor. They did. There were two more explosions. Then we ran to the parking lot,” the 33-year-old said.\nZelensky questions West’s resolve\nMayor Oleksandr Lomako said 16 buildings had been damaged in the attack, while other officials said dozens of vehicles were also destroyed.\nThere was one direct hit on an infrastructure facility, but it was not linked to energy production, the mayor said.\nA 25-year-old policewoman on sick leave was among those killed after suffering a severe shrapnel injury, the interior minister said.\nAFP journalists at the scene saw a body being pulled from the rubble and an eight-storey hotel building gutted by the strike, where municipal workers were using a crane to clear debris.\nNearby apartments, a beauty salon and beer shop were among structures whose windows had been blown out by the attack.\nThe Chernihiv region, which borders Belarus to the north, was partially occupied at the beginning of the Russian invasion but has been spared fighting on its territory for around two years since Russian forces retreated.\nMr Zelensky blamed Russia for the attack but also said the West should do more to help defend Ukraine’s skies. “This would not have happened if Ukraine had received sufficient air defence equipment and if the world’s determination to resist Russian terror had been sufficient,” he said.", "url": "https://www.straitstimes.com/world/europe/russian-attack-kills-people-in-ukraines-chernihiv-hits-infrastructure-governor-says"}