{"authors": [], "date_download": "2024-10-12 13:58:55", "date_modify": "2024-10-12 13:58:55", "date_publish": "2024-02-07 20:19:43", "description": "Pope Francis said he sees \\\"hypocrisy\\\" in criticism of his decision to allow priests to bless same-sex couples, possibly his most strongly worded defence of the move. Read more at straitstimes.com.", "filename": "world_europe_pope-denounces-hypocrisy-of-those-who-criticise-lgbt-blessings_1728741535.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/07/LYNXMPEK160HQ-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_pope-denounces-hypocrisy-of-those-who-criticise-lgbt-blessings_1728741535.html", "title": "Pope denounces 'hypocrisy' of those who criticise LGBT blessings", "title_page": "Pope denounces 'hypocrisy' of those who criticise LGBT blessings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VATICAN CITY - Pope Francis said he sees \"hypocrisy\" in criticism of his decision to allow priests to bless same-sex couples, possibly his most strongly worded defence of the move.\nLGBT blessings were authorised last month by a Vatican document called Fiducia Supplicans (Supplicating Trust), but that has met with significant resistance in the Catholic Church, particularly from African bishops.\n\"Nobody gets scandalised if I give my blessings to a businessman who perhaps exploits people, and this is a very grave sin. But they get scandalised if I give them to a homosexual,\" Francis told Italian Catholic magazine Credere.\n\"This is hypocrisy,\" he said.\nCredere released extracts of the interview on Wednesday, a day ahead of publication.\nFrancis, who famously said \"Who am I to judge?\" when asked about homosexuality at the beginning of his papacy, has made it one of his missions to promote a more welcoming and less judgmental Catholic Church.\nConservatives say this risks undermining the Church's moral teachings.\nFrancis has defended Fiducia Supplicans on several occasions, but acknowledged the pushback against it, saying for example that blessings do not amount to formal Church approval for same-sex unions.\n\"When a couple comes forward spontaneously to ask for them, one does not bless the union, but simply the people who together have requested it. Not the union, but the persons,\" he said on Jan. 26.\nThe Catholic Church teaches that gay sex is sinful and disordered, and that people with same-sex attractions, which are not considered sinful, should try to be chaste.\nIn another interview published last week, Francis said he hoped critics of LGBT blessings would eventually understand them, but that Africans were a \"special case\" in their opposition to homosexuality.\nBishops in Africa have effectively rejected the Fiducia Supplicans. In some African countries, homosexuality is severely punished, with prison sentences or even the death penalty. REUTERS", "url": "https://www.straitstimes.com/world/europe/pope-denounces-hypocrisy-of-those-who-criticise-lgbt-blessings"}