{"authors": [], "date_download": "2024-10-12 13:39:42", "date_modify": "2024-10-12 13:39:42", "date_publish": "2024-07-17 15:12:56", "description": "KIBATI, Democratic Republic of Congo - Under the denuded slopes of Mount Nyiragongo volcano in eastern Democratic Republic of Congo, traders in Kibati town bartered over sacks of charcoal, a product of deforestation that an ongoing conflict has pushed to unprecedented levels, the United Nations says. Read more at straitstimes.com.", "filename": "world_dr-congo-conflict-fuels-forest-loss_1728740382.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/17/LYNXMPEK6G0AM-1.jpg?VersionId=9e1OHgT0vVkLsX8jVC59r3L97rrK36qD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_dr-congo-conflict-fuels-forest-loss_1728740382.html", "title": "DR Congo conflict fuels forest loss", "title_page": "DR Congo conflict fuels forest loss | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KIBATI, Democratic Republic of Congo - Under the denuded slopes of Mount Nyiragongo volcano in eastern Democratic Republic of Congo, traders in Kibati town bartered over sacks of charcoal, a product of deforestation that an ongoing conflict has pushed to unprecedented levels, the United Nations says.\nMotorbikes piled with freshly sawn planks zipped down the main road in Kibati, a community that has remained under Congolese army control even as a two-year insurgency by the M23 militia advanced in conflict-torn North Kivu province, displacing more than 1.7 million people.\n\"In the camp, we're dying of hunger. We've decided to make charcoal so we can feed our children,\" said displaced vendor Jacques Muzayi at Kibati.\nThe insecurity has worsened the pressure on the region's once densely forested hillsides and its protected Virunga national park, home to many of the world's last mountain gorillas.\n\"There used to be a forest here,\" said Bantu Lukambo, head of a local environmental organisation.\nHe was standing outside Kibati within the park in scrubland that was dotted with hacked-up tree stumps. Only a few trees around a nearby park ranger station had been left standing.\n\"It is since the start of the war that the combatants have been devastating Virunga,\" he said, describing how this paved the way for smaller-scale destruction.\nEach morning in Kibati, crowds of local residents and people displaced by the fighting enter the park's territory in search of logs to burn to make charcoal for cooking. Others go deeper to cut trees for planks, or plant crops in the newly open land.\n\"UNPRECEDENTED LEVELS\"\nForest loss in Nyiragongo and Rutshuru, two territories in the conflict zone and partly within the national park, has \"reached unprecedented levels\" since 2021, when authorities declared martial law in the east in response to rising violence, a United Nations report said on July 8.\nIn areas they control in North Kivu, armed actors from all sides are profiting off the production or trade in wooden planks, while illegal and uncontrolled logging has led to \"the destruction of significant swaths of virgin forest in protected areas of Virunga,\" the report said.\nData from Global Forest Watch, an initiative that uses satellites to track deforestation, showed that annual tree cover loss in Virunga rose over 22% to 6,804 hectares in 2021 and a further 7,255 hectares were lost in 2022 as the insurgency rolled on.\nVirunga Park Director Emmanuel de Merode said that estimating the extent of forest loss and its causes was complicated, because of the many threats, including recent eruptions by some of the park's active volcanoes.\nBut \"the conflict has greatly accelerated deforestation,\" he told Reuters, describing the area around Nyiragongo volcano as a particular area of concern.\n\"All the slopes of Nyiragongo have been completely deforested. I fly over these areas regularly, so I see it.\"\nFor years, militia-linked insecurity has troubled Virunga, whose expanses of forest and savannah make it one of the most biodiverse territories on the continent with three types of great ape, bush elephants, and the endangered Okapi - nicknamed Africa's unicorn.\nBut De Merode said M23's occupation of parts of Virunga had greatly limited his rangers' ability to monitor and protect those areas.\n\"I want the authorities do everything possible to end this war,\" said Christoph Lewis, another displaced man in Kibati who earns up to 500 Congolese francs ($0.18) unloading planks, some of which were hewn from trees felled within the park.\n\"It is the war that drives people to destroy the environment,\" he said. REUTERS", "url": "https://www.straitstimes.com/world/dr-congo-conflict-fuels-forest-loss"}