{"authors": [], "date_download": "2024-10-12 13:40:25", "date_modify": "2024-10-12 13:40:25", "date_publish": "2024-09-06 20:46:34", "description": "Turkey said Ms Aysenur Ezgi Eygi was shot in the head. Read more at straitstimes.com.", "filename": "world_us-citizen-killed-in-anti-settler-protest-in-west-bank-palestinian-news-agency-reports_1728740425.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/07/americankilledwestbank07.jpg?VersionId=YGx4A7dJTMtttalwcu_IiEszZzo28axp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_us-citizen-killed-in-anti-settler-protest-in-west-bank-palestinian-news-agency-reports_1728740425.html", "title": "UN demands full probe into Israel’s killing of Turkish-American woman in West Bank", "title_page": "UN demands full probe into Israel’s killing of Turkish-American woman in West Bank | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - The UN has called for a “full investigation” into the killing of a Turkish-American woman who had been taking part in a protest against settlement expansion in the Israeli-occupied West Bank on Sept 6.\n“We would want to see a full investigation of the circumstances and people should be held accountable,” UN spokesman Stephane Dujarric said on Sept 6, following news that Ms Aysenur Ezgi Eygi, a 26-year-old activist, succumbed to her wounds after being shot in the head by Israeli forces.\n“Civilians must be, must be protected at all times,” he added.\nPalestinian officials said Ms Eygi was from Seattle, and held US and Turkish citizenship.\nThe White House said it was deeply disturbed by her death and called on Israel to investigate, while Turkey’s President Recep Tayyip Erdogan condemned her death, saying Turkey “will continue to work in every platform to halt Israel’s policy of occupation and genocide”.\nIsrael denies that its actions in occupied Palestinian territories amount to genocide.\nThe Palestinian Authority’s official news agency, Wafa, said Ms Eygi’s killing occurred during a regular protest march by activists in Beita, a village near Nablus that has seen repeated attacks on Palestinians by Jewish settlers.\nIsrael’s military said its troops had fired towards a male “main instigator” who posed a threat by hurling rocks at soldiers.\nThe military was looking into reports that a female foreign national “was killed as a result of shots fired in the area. The details of the incident and the circumstances in which she was hit are under review”.\nThere was no immediate comment on the incident from Prime Minister Benjamin Netanyahu’s office.\nDr Fouad Nafaa, head of Rafidia Hospital in Nablus, told Reuters that Ms Eygi had arrived there in critical condition with a serious head injury.\n“We tried to perform a resuscitation operation on her, but unfortunately she died,” he said.\nMs Eygi had recently graduated from the University of Washington in Seattle, the school’s president, Professor Ana Mari Cauce, said in a statement, describing the news of her death as “awful” and saying Ms Eygi had a “positive influence” on other students.\nHer family described her as a “fiercely passionate human rights activist” who had recently participated in college campus protests against US support for Israel’s war in Gaza.\nTheir statement called on President Joe Biden and Vice-President Kamala Harris to pursue an independent US probe into her killing.\n‘Deeply disturbed’\nThe White House’s National Security Council spokesman Sean Savett said Washington was “deeply disturbed by the tragic death of an American citizen” in the West Bank on Sept 6.\n“We have reached out to the government of Israel to ask for more information and request an investigation into the incident,” Mr Savett said.\nUS Senator Chris Van Hollen said Ms Eygi was the third American killed in the West Bank since Oct 7, when Hamas militants’ attack on Israel sparked war in Gaza and a resurgence of West Bank violence.\nThe war between Israel and Hamas in Gaza has entered its 12th month, with little sign of respite for the Palestinian territory.\nIsraeli military strikes across the Palestinian Gaza Strip killed at least 61 people in the space of 48 hours, local medics said on Sept 7.\nNumerous rounds of diplomacy have so far failed to clinch a ceasefire deal to end the conflict and bring the release of Israeli and foreign hostages held in Gaza, as well as many Palestinians jailed in Israel.\nUS Central Investigation Agency director William Burns, the chief US negotiator trying to help secure a ceasefire in Gaza and the release of hostages by Hamas, said on Sept 7 that a more detailed proposal on the ceasefire would be made in the coming days.\nIn a separate incident on Sept 6 near Beita, in the village of Qaryut, a 13-year-old girl was killed by Israeli gunfire, Palestinian health officials said, after settlers attacked the village.\nWafa quoted the girl’s father as saying she was in their home when it was hit by gunfire. The Israeli military said it was investigating after its troops had fired in the air to disperse what it described as violent confrontations between dozens of settlers and Palestinians in the area.", "url": "https://www.straitstimes.com/world/us-citizen-killed-in-anti-settler-protest-in-west-bank-palestinian-news-agency-reports"}