{"authors": [], "date_download": "2024-10-12 14:03:11", "date_modify": "2024-10-12 14:03:11", "date_publish": "2023-03-09 12:14:11", "description": "Kyiv said the attack included six Kinzhal hypersonic cruise missiles, one of Moscow’s most valuable weapons. Read more at straitstimes.com.", "filename": "world_europe_russia-unleashes-missile-barrage-on-ukraine-as-ground-battle-rages-in-the-east_1728741791.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/10/UKRAINERUSSIA19_1.JPG?VersionId=E9of6xMhobJ.xsA5GsB0kAz6ctG143Vm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-unleashes-missile-barrage-on-ukraine-as-ground-battle-rages-in-the-east_1728741791.html", "title": "Russia kills nine civilians in Ukraine in first huge missile wave for weeks", "title_page": "Russia kills nine civilians in Ukraine in first huge missile wave for weeks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV/ZOLOCHIV, Ukraine - Russia fired a huge wave of missiles across Ukraine on Thursday as people slept, killing at least nine civilians and knocking out power in an attack that Kyiv said included six Kinzhal hypersonic cruise missiles, one of Moscow’s most valuable weapons.\nThe mass strikes on targets far from the front were the first such wave since mid-February and shattered the longest calm since Moscow began an air campaign against Ukraine’s civil infrastructure five months ago.\nThey also briefly forced Europe’s biggest nuclear power plant off the grid.\n“The occupiers can only terrorise civilians. That’s all they can do. But it won’t help them. They won’t avoid responsibility for everything they have done,” said Ukrainian President Volodymyr Zelensky, describing strikes that hit infrastructure and residential buildings in 10 regions.\nRussia’s defence ministry said it had carried out a “massive retaliatory strike” as payback for a cross-border raid last week. It claimed to have hit all its intended targets, destroying drone bases, disrupting railways and damaging facilities that make and repair arms.\nVillagers in Zolochiv in Ukraine’s western Lviv region carried a body in a black plastic bag over the rubble of a brick house completely destroyed by a missile. They put the body into the back of a white van with another. A dog lay curled up on a carpet in the ruins.\nMs Oksana Ostapenko said the house belonged to her sister Halyna, whose body was still buried under the rubble with two other family members.\n“They still haven’t found them. We were hoping that they’re alive. But they’re not alive,” she said.\nAnother civilian was reported killed by the missiles in the central Dnipro region. Three civilians were separately reported killed by artillery in Kherson.\nMoscow says such hits are intended to reduce Ukraine’s ability to fight. Kyiv says the air strikes have no military purpose and aim to harm and intimidate civilians, a war crime.\nIn the capital Kyiv, a seven-hour alert through the night was the longest of Russia’s five-month air campaign.\n“I heard a very loud explosion, very loud. We quickly jumped out of bed and saw one car on fire. Then the other cars caught on fire as well. The glass shattered on the balconies and windows,” said Liudmyla, 58, holding a toddler in her arms on a Kyiv street near wrecked cars.\n“The child got scared and jumped out of bed,” she said.\n“How can they do this? How is this possible? They are not humans.”\nRussia is believed to have just a few dozen Kinzhals, which fly many times faster than the speed of sound and are built to carry nuclear warheads with a range of more than 2,000km. In his speeches, President Vladimir Putin regularly touts the Kinzhal as a weapon for which the transatlantic Nato alliance backing Kyiv has no answer.\nUkraine said the attacks had knocked out power in various places including to the Zaporizhzhia nuclear power plant, Europe’s largest, severing it from the grid and forcing it onto emergency diesel power to prevent a meltdown. It was later reconnected to Ukraine’s energy grid, operator UkrenergoIt was later reconnected to Ukraine’s energy grid, operator Ukrenergo said.\nThe plant, which Russia has held since capturing it early in the war, is near the front line and both sides have warned in the past of a potential for disaster. Moscow said it was safe.\nUN nuclear watchdog chief Rafael Grossi appealed for a protection zone around the plant.\n“Each time we are rolling a dice. And if we allow this to continue time after time then one day our luck will run out,” Mr Grossi told the IAEA’s 35-nation Board of Governors.\nKyiv, the Black Sea port of Odesa and Kharkiv were all hit. Targets stretched from Zhytomyr, Vynnytsia and Rivne in the west to Dnipro and Poltava in central Ukraine, officials said.\nUkraine fights on at Bakhmut\nOn the battlefield, the week has seen an apparent shift as Ukraine has decided to fight on in Bakhmut, a small city that has borne the brunt of a Russian winter offensive in the bloodiest fighting of the war.\nMoscow says Bakhmut is important as a step to securing the surrounding Donbas region, a major war aim. The West says the ruined city has little value and Russian forces are sacrificing lives to give Mr Putin his only victory since sending hundreds of thousands of reservists into battle at the end of last year.\nUkraine had appeared likely to withdraw from Bakhmut, but commanders now say they are inflicting enough damage on Russia’s assault force to justify staying and fighting on.\nMr Yevgeny Prigozhin, head of Russia’s Wagner private army which has led the fighting in Bakhmut, said on Wednesday his forces controlled all of the city east of a river through it.\nMoscow, which claims to have annexed a fifth of Ukraine, says it launched its “special military operation” a year ago to combat a security threat. Kyiv and the West call it an unprovoked war to subdue an independent state. REUTERS", "url": "https://www.straitstimes.com/world/europe/russia-unleashes-missile-barrage-on-ukraine-as-ground-battle-rages-in-the-east"}