{"authors": [], "date_download": "2024-10-12 13:57:27", "date_modify": "2024-10-12 13:57:27", "date_publish": "2024-03-06 00:35:50", "description": "Resistance ranged from 3.9% to 8.6%, reaching 19.6% among some. Read more at straitstimes.com.", "filename": "world_europe_who-says-resistance-to-gsks-hiv-drug-is-growing_1728741447.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/06/LYNXNPEK240LO-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_who-says-resistance-to-gsks-hiv-drug-is-growing_1728741447.html", "title": "WHO warns of growing resistance to GSK’s HIV drug", "title_page": "WHO warns of growing resistance to GSK’s HIV drug | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - The World Health Organisation (WHO) said on March 5 that resistance to GSK’s human immunodeficiency virus (HIV) drug dolutegravir has exceeded levels observed during its trials, citing observational and survey data received from a few countries.\nResistance ranged from 3.9 per cent to 8.6 per cent, and reached 19.6 per cent among people who have received and transitioned to a dolutegravir-containing antiretroviral therapy regimen to combat high HIV viral loads.\nHIV medicines reduce the amount of the virus in the body to a very low level and helps prevent illness.\n“The resistance analysis focuses on subgroups whose virus was not suppressed, and the data does not indicate that resistance was prevalent in the overall population,” a GSK spokesperson said on March 5.\nThe agency did not disclose the number of countries from where the data was reported, but said that to date, only a few countries have reported survey data to WHO.\nOnly Haiti reported survey data to WHO for HIV drug resistance among infants who have not received the therapy or infants starting it.\nWHO said there have been cases of resistance to a class of HIV drugs known as integrase-strand transfer inhibitors in patients who took the injectable version of an HIV preventive drug called cabotegravir or CAB-LA.\nCabotegravir, also made by GSK, is sold under the brand name Apretude.\nWHO recommended that countries routinely implement standardised surveillance of resistance to HIV drugs, which could help understand the patterns of resistance among people not achieving a suppressed viral load.\n“We agree with the WHO that there is a need for further surveillance,” GSK said.\nThe agency has been recommending the use of dolutegravir as the preferred first- and second-line HIV treatment for all population groups since 2018.\nIt has recommended the use of long-acting injectable cabotegravir as an additional prevention for those at substantial risk of HIV infection since 2022. REUTERS", "url": "https://www.straitstimes.com/world/europe/who-says-resistance-to-gsks-hiv-drug-is-growing"}