{"authors": [], "date_download": "2024-10-12 13:37:09", "date_modify": "2024-10-12 13:37:09", "date_publish": "2024-09-05 02:15:38", "description": "WASHINGTON/MEXICO CITY - U.S. Secretary of State Antony Blinken will visit Haiti on Thursday, a senior U.S. official said, as Washington seeks to solidify the U.N.-backed security mission in the Caribbean country that has been ravaged by gang violence. Read more at straitstimes.com.", "filename": "world_blinken-to-travel-to-haiti-to-shore-up-security-mission-backing_1728740229.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/LYNXMPEK8400D-1.jpg?VersionId=Sla_7QjUgAkHHKyGBn8F4ROkfUqw1haL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_blinken-to-travel-to-haiti-to-shore-up-security-mission-backing_1728740229.html", "title": "Blinken to travel to Haiti to shore up security mission backing", "title_page": "Blinken to travel to Haiti to shore up security mission backing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON/MEXICO CITY - U.S. Secretary of State Antony Blinken will visit Haiti on Thursday, a senior U.S. official said, as Washington seeks to solidify the U.N.-backed security mission in the Caribbean country that has been ravaged by gang violence.\nBrian Nichols, U.S. assistant secretary of state for Western Hemisphere affairs, said Blinken will meet with Haitian Prime Minister Garry Conille and the transition council before traveling to the Dominican Republic.\nNichols, speaking to reporters on Wednesday, called on the rest of the international community to step forward with more financial contributions so the existing force - which is led by Kenya - can continue and additional nations can deploy units.\nThe current mission in Haiti is supported by the United Nations, with much of the contributions coming from Washington. The United States is looking at several options, including a formal U.N. peace-keeping operation, that could help ensure the mission has reliable financing and staffing going forward, Nichols said.\n\"Our goal is to have a mission that is effective, strong, able to deliver the kind of security progress that the Haitian people deserve. And we're working with our international partners to do that,\" Nichols said.\nThe United States and Canada have made the largest contributions to the force so far, Nichols said.\nGang wars have displaced more than 578,000 Haitians, while nearly 5 million - almost half the population of 11.7 million - are facing acute hunger, with 1.6 million of those people at risk of starvation, the United Nations says.\nHaiti in 2022 called for a security mission to help its under-resourced police fight the gangs, who have taken over most of the capital Port-au-Prince. Recruiting minors into their ranks, the gangs have carried out indiscriminate killings, gang rape, and extortion.\nBut progress has been slow. So far just 400 Kenyan police mandated to lead a U.N.-ratified mission have deployed in Haiti, while countries have lagged in delivering on promises of funds, personnel and armored trucks.\nMany Haitians have also been wary of international interventions after previous U.N. missions left behind a devastating cholera epidemic and sex abuse scandals.\nWhile in Haiti, Blinken will discuss the urgent need for elections, Nichols said, adding that engaging with the prime minister and transitional council was a priority.\n\"This is a crucial moment in Haiti... We're seeing that forward movement on the security side that we've long waited for, but we also need to see progress on the political side,\" Nichols said.\nHaiti has not had a president since former President Jovenel Moise was assassinated in July 2021.\nWhile in the Dominican Republic - which shares the island of Hispaniola with Haiti - Blinken will meet with President Luis Abinader. They will discuss strengthening economic ties, advancing democracy, and promoting increased security in the region, particularly in Haiti, Nichols said. REUTERS", "url": "https://www.straitstimes.com/world/blinken-to-travel-to-haiti-to-shore-up-security-mission-backing"}