{"authors": [], "date_download": "2024-10-12 13:47:38", "date_modify": "2024-10-12 13:47:38", "date_publish": "2024-03-08 08:11:29", "description": "It said industry marketing was increasingly targeting women. Read more at straitstimes.com.", "filename": "world_alcohol-policies-need-sharper-focus-on-gender-who-says_1728740858.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/08/LYNXNPEK27005-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_alcohol-policies-need-sharper-focus-on-gender-who-says_1728740858.html", "title": "Alcohol policies need sharper focus on gender, WHO says", "title_page": "Alcohol policies need sharper focus on gender, WHO says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - The World Health Organisation (WHO) on March 8 urged governments to consider gender when developing their alcohol policies, warning that industry marketing increasingly targeted women, who face greater health risks than men from lower levels of drinking.\nThe Geneva-based WHO said that there was good evidence that men, women and minority groups were affected differently by alcohol-related harms and that the industry tailored its marketing to target different genders.\n“Despite this… alcohol control policies remain largely gender blind,” it said, calling on governments to consider gender when devising control measures.\nThe industry increasingly used gendered approaches to appeal to consumers, it continued, adding that it was vital to keep pace with these changing marketing tactics.\nAfter broad successes in tackling the public health impact of other products like cigarettes, the WHO is increasingly turning its attention to addressing the harms linked to alcohol.\nIt pointed to studies that have found that the industry increasingly targets women through everything from packaging to advertisements, which emphasise aspects of feminism or female friendship.\nWomen in Africa and India, for example, were targeted with sweetened beverages marketed as representing freedom and empowerment, studies found.\nMen are also specifically targeted with alcohol marketing linked to traditional notions of masculinity and are at greater risk of drinking in high quantities, developing alcohol problems and aggressive or risky behaviour, the WHO pointed out.\nBut women suffer greater harms at lower levels of alcohol consumption, it continued, citing studies that found alcohol use disorders progress more quickly for women and that women endure more second-hand harm from alcohol use by partners, family members or others.\nThe LGBTQ (lesbian, gay, bisexual, transgender and queer) community also faces different harms, often consuming more alcohol and having more substance use problems than cisgender and heterosexual people, while the legacy of colonialism and economic marginalisation have also left indigenous peoples at increased risk, the WHO said.\nThe WHO says drinking alcohol is a causal factor in more than 200 disease and injury conditions, including some cancers, liver cirrhosis and cardiovascular diseases. REUTERS", "url": "https://www.straitstimes.com/world/alcohol-policies-need-sharper-focus-on-gender-who-says"}