{"authors": [], "date_download": "2024-10-12 13:45:33", "date_modify": "2024-10-12 13:45:33", "date_publish": "2022-08-29 07:04:10", "description": "Alternative dates for the launch of the long-awaited test flight are Sept 2 and Sept 5. Read more at straitstimes.com.", "filename": "world_united-states_nasas-mega-moon-rocket-ready-for-liftoff-on-eve-of-debut-artemis-mission_1728740733.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/08/29/ac_nasarocket_290822.jpg?VersionId=72g1ndyrvG17j.1_BnbtwTUdlaD2jPD5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_nasas-mega-moon-rocket-ready-for-liftoff-on-eve-of-debut-artemis-mission_1728740733.html", "title": "Artemis 1 mission: Nasa calls off launch of mega-moon rocket", "title_page": "Artemis 1 mission: Nasa calls off launch of mega-moon rocket | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KENNEDY SPACE CENTRE, UNITED STATES (AFP, REUTERS) - An engine problem forced Nasa on Monday (Aug 29) to postpone for at least four days the launch of its colossal next-generation rocketship on a long-awaited debut test flight around the moon and back 50 years after Apollo’s last lunar mission.\nThe countdown was halted about 40 minutes before launch time as the 32-storey-tall, two-stage Space Launch System (SLS) rocket and its Orion crew capsule awaited liftoff from the Kennedy Space Center in Cape Canaveral, Florida.\nThe US space agency cited a problem on one of the rocket’s main engines, after launch teams had begun filling its core fuel tanks with super-cooled liquid oxygen and hydrogen propellants. Mission engineers struggled to properly condition that engine to the right temperature for launch, the agency said.\nNasa did not give a new launch date but said its first available backup launch opportunity was set for Friday, Sept 2. Whether the agency sticks with that date depends on how quickly engineers can resolve the engine issue. The subsequent launch opportunity is Monday, Sept 5.\nLaunch teams had spent a final full day of preparations ahead of Monday's planned liftoff of Nasa's giant next-generation rocket on its debut test flight, to kick off the agency's Artemis moon-to-Mars programme 50 years after the end of Apollo.\nThe Space Launch System (SLS) rocket is set to propel an uncrewed capsule named Orion around the moon and back on a six-week test flight designed to put both vehicles through their paces before flying astronauts in a subsequent mission targeted for 2024.\nThe SLS-Orion combo, standing 322 feet (98m) tall, form the centrepiece of the US space agency's successor to the Apollo moon programme of the 1960s and 1970s.\nBilled as the most powerful, complex rocket in the world, the SLS represents the biggest new vertical launch system Nasa has built since the Saturn V flown for Apollo, which grew out of the US-Soviet space race of the Cold War era.\nIf the first two Artemis missions succeed, Nasa is aiming to land astronauts back on the moon, including the first woman to set foot on the lunar surface, as early as 2025, though many experts believe that time frame is likely to slip by a few years.\nThe last humans to walk on the moon were the two-man descent team of Apollo 17 in 1972, following in the footsteps of 10 other astronauts during five earlier missions beginning with Apollo 11 in 1969.\nThe Artemis programme seeks to eventually establish a long-term lunar base as a stepping stone to even more ambitious astronaut voyages to Mars, a goal that Nasa officials have said will probably take until at least the late 2030s to achieve.\nSLS has been under development for more than a decade, with years of delays and cost overruns.\nBut the Artemis programme also has generated tens of thousands of jobs and billions of dollars in commerce under the primary contractors Boeing Co for SLS and Lockheed Martin Corp for Orion.", "url": "https://www.straitstimes.com/world/united-states/nasas-mega-moon-rocket-ready-for-liftoff-on-eve-of-debut-artemis-mission"}