{"authors": [], "date_download": "2024-10-12 14:07:29", "date_modify": "2024-10-12 14:07:29", "date_publish": "2022-07-25 23:33:44", "description": "Gazprom said it was cutting daily gas deliveries into Europe to about 20 per cent of the pipeline's capacity. Read more at straitstimes.com.", "filename": "world_europe_russias-gazprom-says-to-cut-nord-stream-gas-deliveries-sharply-from-wednesday_1728742049.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/25/yu_gazprom2607.jpg?VersionId=HS5e4CKbclAMRHT7HcUsDg5Gdfmzbcn5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russias-gazprom-says-to-cut-nord-stream-gas-deliveries-sharply-from-wednesday_1728742049.html", "title": "Russia's Gazprom to slash Nord Stream gas deliveries from Wednesday", "title_page": "Russia's Gazprom to slash Nord Stream gas deliveries from Wednesday | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW (AFP, BLOOMBERG, REUTERS) - Gazprom said it was cutting daily gas deliveries via the Nord Stream pipeline to 33 million cubic metres a day - about 20 per cent of the pipeline's capacity - from Wednesday (July 27).\nThe Russian gas giant said in a statement on Monday that it was halting the operation of one of the last two operating turbines due to the \"technical condition of the engine\".\nThe move poses further risks to Europe’s gas supply ahead of winter.\nNord Stream flows were already reduced to 40 per cent of capacity since last month, after sanctions on Russia delayed the return of another turbine following repairs in Canada.\nWhile the repaired turbine was finally shipped to Germany, it missed a ferry sailing on Saturday to Helsinki amid paperwork delays, Russian newspaper Kommersant reported.\nRussian President Vladimir Putin warned last week that flows could drop to 20 per cent if the turbine issues aren’t resolved.\nMr Putin also warned the West this month that continued sanctions risked triggering catastrophic energy price rises for consumers around the world.\nRussia is the world’s second largest oil exporter after Saudi Arabia and the world’s largest exporter of natural gas.\nEurope imports about 40 per cent of its gas and 30 per cent of its oil from Russia.\nGazprom said that the supplies from the Portovaya compressor station will be slashed from 7am Moscow time on Wednesday.\nThe announcement came after Russia last week restored critical gas supplies to Europe through Germany via Nord Stream after 10 days of maintenance, but only at 40 per cent of the pipeline's capacity.\nGermany, which is heavily dependent on Russian gas, has accused Moscow of using energy as a \"weapon\".\nIn response, the German government said there was no technical justification for Gazprom's announcement that it was slashing gas flows via the Nord Stream pipeline.\n\"According to the information we have there is no technical reason for a reduction of deliveries,\" a German Economy Ministry spokesman told AFP.\nGazprom cut flows to Germany via the Nord Stream 1 pipeline under the Baltic Sea in recent weeks, blaming the absence of a Siemens gas turbine that was undergoing repairs in Canada.\nEarlier on Monday, Gazprom said it had received paperwork related to the delayed delivery of the turbine but pointed out a number of issues including those relating to European Union and British sanctions remained.\nThe showdown comes amid raging tensions over Russia's intervention in Ukraine.\nEU states have accused Russia of squeezing supplies in retaliation for Western sanctions over the offensive.\nEnduring German reliance on Russian gas coupled with alarming signals from Moscow have turned up the pressure on Europe's top economy.\nA total shutdown of imports or a sharp reduction in the flow from east to west could have a catastrophic effect, shutting factories and forcing households to turn down the heat.\nThe Kremlin has denied that it is seeking to use Russia’s vast energy resources to blackmail the European Union, which together with the United States and other Western nations has imposed waves of sanctions on Moscow since it sent troops into Ukraine on Feb 24.", "url": "https://www.straitstimes.com/world/europe/russias-gazprom-says-to-cut-nord-stream-gas-deliveries-sharply-from-wednesday"}