{"authors": [], "date_download": "2024-10-12 14:05:16", "date_modify": "2024-10-12 14:05:16", "date_publish": "2022-05-23 17:34:44", "description": "This is the first war crimes trial arising from Russia’s invasion and there could be many more to come. Read more at straitstimes.com.", "filename": "world_europe_kremlin-says-concerned-by-ukraines-war-crimes-trial-against-russian-soldier_1728741916.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/23/AK_vs_230522.jpg?VersionId=90sSS.7nIuzL9P3dX5e8W78yPj25N5a8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_kremlin-says-concerned-by-ukraines-war-crimes-trial-against-russian-soldier_1728741916.html", "title": "Ukrainian court sentences Russian soldier to life in prison for killing civilian", "title_page": "Ukrainian court sentences Russian soldier to life in prison for killing civilian | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (REUTERS) - A Ukrainian court sentenced a Russian soldier to life in prison on Monday (May 23) for killing an unarmed civilian in the first war crimes trial arising from Russia’s Feb 24 invasion.\nVadim Shishimarin, a 21-year-old Russian tank commander, has pleaded guilty to killing an elderly unarmed civilian in the north-east Ukrainian village of Chupakhivka on Feb 28 after being ordered to shoot at him.\nJudge Serhiy Agafonov said Shishimarin, carrying out a “criminal order” by a soldier of higher rank, had fired several shots at the victim’s head from an automatic weapon.\n“Given that the crime committed is a crime against peace, security, humanity and the international legal order ... the court does not see the possibility of imposing a (shorter) sentence,” he said.\nShishimarin, wearing a blue and grey hooded sweatshirt, watched proceedings silently from a reinforced glass box in the courtroom and showed no emotion as the verdict was read out.\nHe stood with head bowed throughout the proceedings, listening to a translator.\nThe trial, which began only last week, has huge symbolic significance for Ukraine and an international lawyer told Reuters it could be the first of many.\nKyiv has accused Russia of atrocities and brutality against civilians during the invasion and said it has identified more than 10,000 possible war crimes.\nRussia has denied targeting civilians or involvement in war crimes.\nThe Kremlin did not immediately comment on the verdict. It has previously said that it has no information about the trial and that the absence of a diplomatic mission in Ukraine limits its ability to provide assistance.\nBar set 'very high'\nUkrainian state prosecutors said Shishimarin and four other Russian servicemen stole a car to escape after their column was targeted by Ukrainian forces.\nAfter driving into Chupakhivka, the soldiers saw Shelipov riding a bicycle and talking on his phone. Shishimarin was ordered to kill Shelipov to prevent him reporting on their location, the prosecutors said.\nIn court last week, Shishimarin acknowledged he was to blame and asked the victim’s widow to forgive him.\nThe court reached its verdict five days after holding its first full hearing. In contrast, the International Criminal Court has not handed down a single life sentence and the International Criminal Tribunal for the former Yugoslavia sentenced only six people to life imprisonment.\nMark Ellis, executive director of the International Bar Association, said the verdict was “not surprising” and could be the first part of “a large puzzle also involving Ukrainian soldiers being held in Russia”.\n“If this is the baseline trial ... it sets the bar very high,” he said. “For most other war crimes cases in Ukraine I suspect we’ll see similar sentences because this is the baseline trial.”", "url": "https://www.straitstimes.com/world/europe/kremlin-says-concerned-by-ukraines-war-crimes-trial-against-russian-soldier"}