{"authors": [], "date_download": "2024-10-12 14:08:19", "date_modify": "2024-10-12 14:08:19", "date_publish": "2022-06-04 05:40:07", "description": "Officials have said Ukraine is in control of around one fifth of the city. Read more at straitstimes.com.", "filename": "world_europe_ukraines-foreign-fighters-join-raging-battle-for-eastern-city-of-sievierodonetsk_1728742099.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/04/2022-06-03T190641Z_1798261220_RC2IKU9OVT4L_RTRMADP_3_UKRAINE-CRISIS-GAIDAI-SIEVIERODONETSK.JPG?VersionId=qdiQg7dcw0q4iIqYc35JEqz5VIFP6xwf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraines-foreign-fighters-join-raging-battle-for-eastern-city-of-sievierodonetsk_1728742099.html", "title": "Ukraine's foreign fighters join raging battle for eastern city of Sievierodonetsk", "title_page": "Ukraine's foreign fighters join raging battle for eastern city of Sievierodonetsk | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SIEVIERODONETSK, UKRAINE (REUTERS) - Foreigners fighting for Ukraine arrived in the embattled city of Sievierodonetsk in the eastern province of Luhansk this week, vowing to repel the Russian advance as Moscow pursues its push to seize the last Ukrainian-held territories in the east.\nSince being driven back from the capital Kyiv, Russia has launched a huge new assault in Luhansk and Donetsk, two provinces that make up the eastern region of Donbas.\nWhile the advance in Donetsk has been much slower, Russia has gained control over much of Luhansk and in recent weeks has poured its forces into the small factory city of Sievierodonetsk, around 145km from the Russian border.\nBoth sides have suffered punishing losses in the street-by-street battles but the stakes are high: If Sievierodonetsk falls, neighbouring Lysychansk would be the last city that Russia needs to have full control of Luhansk.\n\"We're gonna push the Russians back. It will take a day, a month, or a year it does not f***ing matter. We are on the right side of history,\" said Zurab Kakalidze, a Georgian who described himself as \"just a 22-year-old kid\" and member of the Ukrainian Foreign Legion.\nKakalidze was one of a dozen foreign volunteers who were unloading weapons, including automatic weapons and shoulder-propelled rockets, from a truck on Thursday.\n\"It's a war for Georgians as well,\" said Kakalidze, who wore a patch on his combat fatigues combining the Ukrainian and Georgian flags.\nOn Wednesday, officials said Ukraine was in control of around one fifth of the city.\nThe Luhansk region governor on Friday said Ukraine had taken back another 20 per cent.\nAnother soldier fighting for Ukraine in the city and who did not give his name spoke in Portuguese.\n\"Since I got here, I dedicated my entire life to this. I came here to protect the people and I will only leave with a victory. Glory to Ukraine,\" he said.\nCity destroyed\nThe tree lined road into Sievierodonetsk from Lysychansk city was riddled with craters and destroyed vehicles. Black smoke from shelling rose above the city.\nAt the entrance to Sievierodonetsk, an armoured personnel carrier was balanced over the edge of a partially destroyed bridge. An artillery gun lay upside down.", "url": "https://www.straitstimes.com/world/europe/ukraines-foreign-fighters-join-raging-battle-for-eastern-city-of-sievierodonetsk"}