{"authors": [], "date_download": "2024-10-12 13:36:33", "date_modify": "2024-10-12 13:36:33", "date_publish": "2023-10-12 15:59:00", "description": "Israeli jets have pounded Gazan targets for days in retribution for an attack by Hamas militants. Read more at straitstimes.com.", "filename": "world_middle-east_israel-conducts-large-scale-strike-on-gaza-as-blinken-heads-to-region_1728740193.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/12/dw-gaza2-strikes-231012.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israel-conducts-large-scale-strike-on-gaza-as-blinken-heads-to-region_1728740193.html", "title": "Israel conducts ‘large-scale strike’ on Gaza as top US diplomat urges restraint", "title_page": "Israel conducts ‘large-scale strike’ on Gaza as top US diplomat urges restraint | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON/JERUSALEM/GAZA - Israel’s military said it was conducting a large-scale strike on targets belonging to Hamas in Gaza on Thursday, as US Secretary of State Antony Blinken arrived in Tel Aviv to give the assurance that the United States would always back Israel, but also to urge restraint to protect Palestinian civilians.\nIsraeli jets have pounded Gaza targets for days in retribution for a weekend attack by Hamas militants who breached the border fence enclosing the enclave and rampaged through towns and villages, killing 1,300 people, injuring more than 2,700 and taking scores of hostages.\nPalestinian media, citing Gaza’s health ministry, reported that 1,417 Palestinians have been killed in the enclave, including 447 children, with around 6,000 wounded.\nIsrael’s military said it was conducting a large-scale strike on Hamas targets in Gaza as it prepares to launch a multi-pronged invasion of the territory.\nIsrael is targeting Hamas’ political and military leaders in Gaza, said the Israeli Defence Forces (IDF) spokesman, Lieutenant-Colonel Richard Hecht.\nHamas’ elite Nukhba forces led last Saturday’s assault, and the Israeli military’s focus is to hit that group’s command centres in Gaza, Lt-Col Hecht told reporters on Thursday.\nHe said a widely anticipated ground invasion has not yet been decided upon by the new emergency unity government announced on Wednesday night.\nThe military is nonetheless preparing for such a move, should it be ordered, he said.\n“We are preparing ourselves for the next stages of war,” Lt-Col Hecht said.\n“The IDF and all our units, the whole general staff and everyone are preparing multiple operational contingency plans,” he said. “It could be from the air, it could be combined from the sea, air, and we are waiting to see what our political leadership decides about a potential ground war.”\nHamas insisted in a statement that Israel was not only targeting senior members of its military wing and leadership in Gaza, but also “civil institutions, mosques, homes and residential buildings” and doing so “without warning”.\nUS President Joe Biden dispatched Mr Blinken to the Middle East to show Washington’s enduring support for Israel, secure the release of captives, including Americans, and prevent a wider war from erupting.\n“You may be strong enough on your own to defend yourself,” Mr Blinken said at a joint press conference with Israeli Prime Minister Benjamin Netanyahu. “But as long as America exists, you will never, ever have to. We will always be there by your side.”\n“Anyone who wants peace and justice must condemn Hamas’ reign of terror,” Mr Blinken said. “We know Hamas doesn’t represent the Palestinian people or their legitimate aspirations to live with equal measures of security, freedom, justice opportunity and dignity.”\nSpeaking on personal terms, he said, “I come before you not only as the United States Secretary of State but also as a Jew”, and “as a husband and father of young children”.\n“It is impossible for me to look at the photos of families killed, such as the mother, father and three small children murdered as they sheltered in their home in Kibbutz Nir Oz, and not think of my own children,” he added.\nHe disclosed that at least 25 Americans were killed in Israel, up from the 22 confirmed by US officials on Wednesday.\nSpeaking to a roundtable of Jewish community leaders in Washington, Mr Biden said his deployment of military ships and aircraft closer to Israel should be seen as a signal to Iran, which backs Islamist groups Hamas and Lebanon’s Hezbollah.\n“We made it clear to the Iranians: Be careful,” he said.\nIran likely knew Hamas militants were planning “operations against Israel” but initial US intelligence reports showed that some Iranian leaders were surprised by the group’s unprecedented attack from Gaza, US sources said on Wednesday.\n‘We are all soldiers of Israel’\nIsrael’s leaders on Wednesday formed a unity government, promising to put bitter political divisions aside to focus on the fight against Hamas.\nFormer defence minister Benny Gantz, a centrist opposition leader, spoke live on Israeli television alongside Mr Netanyahu and Defence Minister Yoav Gallant after forming a war Cabinet focused entirely on the conflict.\n“Our partnership is not political, it is a shared fate,” said Mr Gantz. “At this time, we are all the soldiers of Israel.”\nMr Netanyahu said the people of Israel and its leadership were united. “We have put aside all differences because the fate of our state is on the line,” he said.\nMr Gantz’s National Unity Party, which has fiercely opposed judicial reforms proposed by Mr Netanyahu’s right-wing coalition, said it will not promote any unrelated policy or laws while the fighting goes on.\nIsrael has put Gaza under “total siege” to stop food and fuel reaching the enclave of 2.3 million people, many poor and dependent on aid. Hamas media said on Wednesday that electricity went out after the only power station stopped working.\nA group of independent UN experts on Thursday condemned violence against civilians in Israel, but they also deplored the “collective punishment” of reprisal strikes against Gaza.\nWhile condemning the “horrific crimes committed by Hamas”, the group said Israel has resorted to “indiscriminate military attacks against the already exhausted Palestinian people of Gaza”.\n“This amounts to collective punishment,” the group, which includes several UN special rapporteurs, said in a statement.\n“There is no justification for violence that indiscriminately targets innocent civilians, whether by Hamas or Israeli forces,” they said.\nThe group said taking hostages in the context of hostilities also constituted a war crime.\n“The civilians taken by Hamas must be immediately released, pending which their fate and whereabouts must be disclosed,” the experts said.\nIsrael’s chief military spokesman, Rear-Admiral Daniel Hagari, said Israel was able to confirm the identities of 97 people taken hostage into Gaza.", "url": "https://www.straitstimes.com/world/middle-east/israel-conducts-large-scale-strike-on-gaza-as-blinken-heads-to-region"}