{"authors": [], "date_download": "2024-10-12 14:10:26", "date_modify": "2024-10-12 14:10:26", "date_publish": "2018-12-05 03:51:11", "description": "The explosive new declarations by two key senators came after a briefing by the CIA's director. Read more at straitstimes.com.", "filename": "world_united-states_zero-doubt-saudi-crown-prince-directed-khashoggi-murder-gop-senators_1728742226.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/rxPRdpLdr1ZHhAbq5sgKTFL6BdteXUw0xwv6gLzzg0o.jpg?VersionId=Qs51zHcBC4aSYdTFpTHfaBr7P_pWrGnk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_zero-doubt-saudi-crown-prince-directed-khashoggi-murder-gop-senators_1728742226.html", "title": "'Zero' doubt Saudi crown prince directed Khashoggi murder: Republican senators", "title_page": "'Zero' doubt Saudi crown prince directed Khashoggi murder: Republican senators | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (AFP) - Two key United States Republican senators said on Tuesday (Dec 4) after a briefing by the CIA's director that they have \"zero\" doubt Saudi Arabia's crown prince directed the murder of the journalist Jamal Khashoggi.\nThe explosive new declarations by members of President Donald Trump's party run counter to the White House narrative downplaying possible links between Crown Prince Mohammed bin Salman, also known as MBS, and the October killing of journalist and palace critic Khashoggi at the kingdom's Istanbul consulate.\n\"I have zero question in my mind that the crown prince directed the murder and was kept appraised of the situation all the way through it,\" Senate Foreign Relations Committee chairman Bob Corker told reporters after CIA director Gina Haspel briefed a small group of senators.\n\"If MBS were in front of a jury he'd be convicted in less than 30 minutes.\"\nFellow Republican Senator Lindsey Graham, who has urged Mr Trump to take a far tougher stance against Riyadh over the killing, also attended the hour-long briefing.\nHe minced no words afterwards, saying he believes Crown Prince Mohammed is \"a wrecking ball\" who is \"complicit in the murder of Mr Khashoggi to the highest level possible\".\n\"There's not a smoking gun but a smoking saw,\" Mr Graham added.\nAfter reports that the CIA concluded that the crown prince ordered Mr Khashoggi's assassination in the Istanbul consulate on Oct 2, Mr Trump issued a statement saying US-Saudi relations and oil market stability were too important to rock over the scandal.\nLast week, under mounting pressure from lawmakers on both sides of the political aisle who wanted action against Riyadh, Secretary of State Mike Pompeo and Pentagon chief Jim Mattis held a closed-door all-senators briefing where they said there was no direct evidence linking the crown prince to the murder.\nOn Tuesday, Mr Graham swatted their assessment aside.\n\"You have to be wilfully blind not to come to the conclusion that this was orchestrated and organised by people under command of MBS, and that he was intricately involved in the demise of Mr Khashoggi.\"", "url": "https://www.straitstimes.com/world/united-states/zero-doubt-saudi-crown-prince-directed-khashoggi-murder-gop-senators"}