{"authors": [], "date_download": "2024-10-12 13:57:35", "date_modify": "2024-10-12 13:57:35", "date_publish": "2024-01-26 10:50:52", "description": "Venezuelan President Nicolas Maduro warned on Thursday that a deal with the political opposition for elections to be held later this year was in danger of collapse, after what he has described as \\\"conspiracies\\\" against him. Read more at straitstimes.com.", "filename": "world_venezuelas-maduro-says-election-deal-with-opposition-could-collapse_1728741455.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/26/LYNXMPEK0P029-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_venezuelas-maduro-says-election-deal-with-opposition-could-collapse_1728741455.html", "title": "Venezuela's Maduro says election deal with opposition could collapse", "title_page": "Venezuela's Maduro says election deal with opposition could collapse | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CARACAS - Venezuelan President Nicolas Maduro warned on Thursday that a deal with the political opposition for elections to be held later this year was in danger of collapse, after what he has described as \"conspiracies\" against him.\nWHY IT MATTERS\nLast year, the government of Maduro's ruling socialists reached a deal with the political opposition over talks in Barbados to hold elections sometime during the second half of this year.\nThe deal caused the United States to temporarily ease economically debilitating oil sanctions on the crude-exporting country.\nU.S. officials stressed that the relief was dependent on Caracas lifting bans on opponents holding public office, as well as releasing political prisoners and \"unjustly detained\" Americans.\nVenezuela has yet to lift a ban on Maria Corina Machado, the opposition's presidential candidate.\nThis week, Maduro said \"conspiracies\" against him and high-ranking government officials were dismantled last year, with nearly three dozen civilians and military personnel detained.\nLater, U.S. officials said they were \"concerned\" about the arrests, which included members of the political opposition.\nKEY QUOTES\n\"Today the Barbados agreements are mortally wounded, they're in intensive care, they were stabbed, kicked,\" Maduro said in a televised state broadcast.\n\"Hopefully we can save the Barbados agreements and, through dialogue, reach real overarching agreements through national consensus,\" he added.\nWHAT'S NEXT\nThe government's arrest of opposition members could put the agreements at risk, and cause the sanctions to snap back. The arrest of opposition figures also threatens Machado's electoral chances, after she formed an alliance on Tuesday to mobilize her campaign. REUTERS", "url": "https://www.straitstimes.com/world/venezuelas-maduro-says-election-deal-with-opposition-could-collapse"}