{"authors": [], "date_download": "2024-10-12 13:35:37", "date_modify": "2024-10-12 13:35:37", "date_publish": "2024-10-02 03:49:10", "description": "JERUSALEM - Depending on where you were in Jerusalem on the night of Oct 1, Iran’s missile attack on Israel provoked either fervent prayers or cries of joy. Read more at straitstimes.com.", "filename": "world_middle-east_prayers-and-applause-two-sides-of-jerusalem-react-to-iran-missiles_1728740137.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/IRANISRAEL2.JPG?VersionId=MHyz4DWDw8sb.C1btQQvn7rFaWnJSw6F", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_prayers-and-applause-two-sides-of-jerusalem-react-to-iran-missiles_1728740137.html", "title": "Prayers and applause: Two sides of Jerusalem react to Iran missiles", "title_page": "Prayers and applause: Two sides of Jerusalem react to Iran missiles | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JERUSALEM - Depending on where you were in Jerusalem on the night of Oct 1, Iran’s missile attack on Israel provoked either fervent prayers or cries of joy.\nJewish prayers in an underground car park in west Jerusalem; expressions of joy in Palestinian districts in the Israeli-annexed east of the city.\nWhen the air raid sirens wailed, hundreds of people in the central bus station in the west heeded the military’s calls and headed underground to take shelter.\nSome of those who gathered in the car park read from religious texts as others stayed glued to their phones.\nThe dull sound of explosions came from above as Israeli air defences intercepted incoming missiles fired from Iran.\nOutside in the open, the dark sky was streaked with light trails from the east, amid the boom of blasts echoing over the Holy City.\nIn a shelter in Musrara district in west Jerusalem, residents called friends and relatives elsewhere in Israel to exchange news of what was happening.\nOne man who preferred not to be identified by name told AFP: “We can put things into perspective, but the kids can’t.”\nHe gave out sweets to young ones in the car park, “so they don’t have bad memories” of the situation.\nChildren were crying, however, and families continued to arrive amid the wave of alerts.\nSome even expressed surprise as they had not heard of the threat, despite repeated warnings broadcast by the authorities for more than an hour.\nOn the other side of Jerusalem is the Palestinian quarter of Silwan in the east of the city, which Israel seized in the 1967 war and later annexed.\nOne resident told AFP of the reaction in Silwan when the warnings sounded.\n“As soon as the Palestinians heard the first sirens, there were whistles and applause, and there were cries of ‘Allahu Akbar!’ (God is Greatest),” said one resident, of the moment the streaks of fire appeared in the night sky.\nShe said people did not go to shelters because they don’t have any. Instead they went out into the streets or onto roofs to see what was happening.", "url": "https://www.straitstimes.com/world/middle-east/prayers-and-applause-two-sides-of-jerusalem-react-to-iran-missiles"}