{"authors": [], "date_download": "2024-10-12 13:49:49", "date_modify": "2024-10-12 13:49:49", "date_publish": "2023-12-06 18:05:00", "description": "The “faith pavilion” offers a change of pace and something else sorely needed: unity and optimism. Read more at straitstimes.com.", "filename": "world_got-to-have-faith-religion-finds-its-moment-at-cop28_1728740989.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/06/UAE-UN-CLIMATE-COP28-RELIGION-083954.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_got-to-have-faith-religion-finds-its-moment-at-cop28_1728740989.html", "title": "Got to have faith: Religion finds its moment at COP28", "title_page": "Got to have faith: Religion finds its moment at COP28 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBAI – From meditation to spiritual guidance to indigenous hymns, the vibe in the “faith pavilion” at COP28 is a little different at the high-stakes United Nations climate talks in Dubai.\nOrthodox priests rub shoulders with Emiratis in flowing white robes and Jewish rabbis in the quiet, air-conditioned calm of the pavilion, the first ever dedicated to religion at a COP conference.\nHoused in a building of dark glass and geometric triangles, the pavilion offers a space for quiet reflection away from the frenetic diplomacy and flashy business shows that accompany the marathon climate negotiations.\nIt also offers something else sorely needed at COP: unity and optimism.\n“This testifies to the willingness to work together,” Pope Francis said in a video message at the pavilion’s inauguration on Dec 3 in a united call to action with senior Muslim cleric Ahmed al-Tayeb, the grand imam of Al Azhar mosque in Cairo, Egypt.\n“Today, the world needs alliances that are not against someone but for the benefit of everyone.”\nVisitors joining daily “ritual relaxation” sessions or engaging with religious leaders in a lounge room are invited to consider the role of faith in addressing the challenge of global warming.\n“For a fairer and more sustainable world, we trust and pray,” one visitor wrote on a paper cut-out tree pinned alongside other messages of hope and solidarity to the pavilion wall.\nSpiritual crisis\nOrganisers say more than 300 faith leaders from all major religions and traditional beliefs are expected to participate in the pavilion during the two-week-long conference being held in the glitzy Gulf city.\nThis is the first time in nearly 30 years of global climate talks that religion has been given its own venue, and the striking space has prime real estate in the buzzing heart of an enormous complex.\nThis COP is the largest ever and thousands of people walk by the pavilion every day, whether en route to meetings and expo shows, or to buy ice cream from a stall doing a brisk trade out front.\nThe COP can be an overwhelming experience, and faith leaders hope attendees of all creeds embrace the pavilion as a respite from the haggling, heat and anxiety over the planet’s future.\nBridge the gap\nBehind the scenes, organisers say the pavilion is supporting progress toward an ambitious pact to limit global warming, which also ensures financial aid for the world’s poorest on the front lines of climate change.\nFaith leaders are offering moral and pastoral services to diplomats working around the clock on the agreement, and for the first time have interfaith representatives attending the formal negotiation sessions.\n“We want to bring that spiritual understanding to the decision-making process,” said Dr Iyad Abumoghli, director for Faith for Earth, an initiative within the UN Environment Programme.\nPanels at the pavilion have explored difficult themes, including the climate-related loss of homeland, mining in Africa and ethical investing, and speakers have included government ministers, academics and business leaders.\nFaith leaders also issued an interfaith statement in support of reducing and eventually exiting fossil fuels – a flashpoint issue at the conference overseen by an Emirati oil executive.\nThe pavilion seeks to foster trust – a vital element at any COP – between scientific and religious communities that have not always seen eye-to-eye.\n“I know it’s all about science,” Mr Mohamed Bahr from the Muslim Council of Elders, said. “But we’re trying here to bridge the gap between science and faith.” AFP", "url": "https://www.straitstimes.com/world/got-to-have-faith-religion-finds-its-moment-at-cop28"}