{"authors": [], "date_download": "2024-10-12 14:18:59", "date_modify": "2024-10-12 14:18:59", "date_publish": "2023-12-15 00:39:55", "description": "It was unclear whether Mr Putin saw the seemingly unfiltered on-screen messages. Read more at straitstimes.com.", "filename": "world_europe_make-way-for-the-young-russians-biting-questions-to-putin_1728742739.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/15/screenputin15.jpg.JPEG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_make-way-for-the-young-russians-biting-questions-to-putin_1728742739.html", "title": "‘Make way for the young’: Russians’ biting comments to Putin", "title_page": "‘Make way for the young’: Russians’ biting comments to Putin | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russian President Vladimir Putin answered 67 questions during a marathon press conference on Dec 14, but some of the most stinging ones were broadcast on the screen behind him.\nRussian citizens submitted more than 2.8 million questions to Mr Putin, who announced he would run for re-election in 2024, allowing him to extend his decades-long grip on power into the 2030s.\n“No need to run for another mandate – make way for the young!” one viewer said, sending his question by text.\n“Who will be president after you?” another asked.\nThroughout the four-hour press conference, questions sent by viewers appeared seemingly unfiltered on the screens of the grand conference hall.\nIt is unclear whether or not Mr Putin saw them.\nAnswering pre-selected questions, Mr Putin stressed that Western sanctions and international isolation had done little to hurt Russia’s economy or morale, two years into the offensive.\n“Why is your reality different to ours?” another person asked.\nAnother question read: “Vladimir Vladimirovich! When will we have a better life?”", "url": "https://www.straitstimes.com/world/europe/make-way-for-the-young-russians-biting-questions-to-putin"}