{"authors": [], "date_download": "2024-10-12 13:56:18", "date_modify": "2024-10-12 13:56:18", "date_publish": "2023-04-22 07:45:21", "description": "The northern elephant seal sleeps just two hours a day during Pacific Ocean foraging journeys. Read more at straitstimes.com.", "filename": "world_united-states_you-think-you-need-more-sleep-tell-that-to-an-elephant-seal_1728741378.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/22/SEALSUNDERWATERNAPS_0.JPG?VersionId=kpdJTQbATSvccmQWMp68QkOS8xxw2Wr6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_you-think-you-need-more-sleep-tell-that-to-an-elephant-seal_1728741378.html", "title": "You think you need more sleep? Tell that to an elephant seal", "title_page": "You think you need more sleep? Tell that to an elephant seal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Sleep is a precious commodity for people and across the animal kingdom, indispensable even as its biological purpose remains somewhat mysterious.\nWe spend about a third of our lives asleep. But some animals get a lot less slumber – with certain species like the northern elephant seal taking sleeplessness to an extreme.\nResearchers in a new study described the unusual sleep habits of this species, finding that during Pacific Ocean foraging journeys that can last seven months, these bulky marine mammals sleep just two hours a day – cobbled together from naps of about 10 minutes each as they dive deep to avoid predators.\nThe only other mammal known to get so little sleep is the African elephant.\nThe seals’ sleep duration during these ocean voyages differed significantly from the 10 hours a day they spend sleeping on the beach during breeding season at places like California’s Ano Nuevo beach.\nThe researchers placed on the heads of the seals a non-invasive waterproof synthetic rubber cap with sensors to monitor sleep signals generated by the brain, heart rate, location and depth.\nThe researchers focused on female seals because they engage in the long open-ocean journeys, while males feed in coastal waters.\nThe study documented unorthodox sleep behavior.\nDuring dives lasting about 30 minutes, the seals went into a deep sleep stage called slow-wave sleep while maintaining a controlled downward trajectory.\nWhen they then experienced rapid eye movement (REM) sleep, a stage causing sleep paralysis, the seals drifted into a corkscrew “sleep spiral”, turning upside down and sometimes ending up motionless on the sea floor.\n“Then, at the deepest point of their sleeping dive – up to 377m deep – they wake up and swim back to the surface,” said Dr Jessie Kendall-Bar, a post-doctoral fellow at the University of California San Diego’s Scripps Institution of Oceanography and lead author of the study published this week in the journal Science.\nThe species is the world’s second-largest seal, topped by only the southern elephant seal.\nMale northern elephant seals may reach 4m long and weigh up to 2,000kg. Females reach about 3m in length and 590kg.\nThe seals eat large amounts of fish and squid. Despite their size, they are vulnerable to sharks and killer whales.\n“It is remarkable that a wild animal will fall into deep, paralytic REM sleep when there are predators on the hunt. The seals solve this problem by going into deep sleep in the deep parts of the oceans where predators do not typically hunt them,” said study co-author Terrie Williams, director of the University of California, Santa Cruz’s Comparative Neurophysiology Lab.\n“The brain’s ability to act as a master switch to awaken the sleeping seals at depth before they would drown is also a revelation concerning the neural precision of the mammalian brain. Imagine if a sleeping human suddenly awoke on the bottom of a pool and had to figure a way out. It is chilling and speaks to the incredible survival control of the seal’s brain,” Professor Williams added.\nThe researchers also observed seals sleeping in a laboratory setting and at Ano Nuevo beach.\n“It is very peaceful to spend time on the beach watching elephant seals sleep. I have spent many days at Ano Nuevo taking notes as the seals held their breath for 10 minutes at a time, even on land,” Dr Kendall-Bar said.\n“There would be complete silence except the howling wind and then, all of a sudden, the snort of an elephant seal as it emerges from a 10-minute sleep apnea,” she added.\n“Its pulmonary surfactant – a gooey coating of the respiratory system to facilitate lung collapse at depth – erupts from its nose as it takes a few breaths before plunging back into slumber.” REUTERS", "url": "https://www.straitstimes.com/world/united-states/you-think-you-need-more-sleep-tell-that-to-an-elephant-seal"}