{"authors": [], "date_download": "2024-10-12 13:57:56", "date_modify": "2024-10-12 13:57:56", "date_publish": "2024-06-15 17:21:22", "description": "The Russian plane failed to respond to a radio warning from Sweden's military air traffic control. Read more at straitstimes.com.", "filename": "world_europe_russian-plane-violated-swedish-airspace-on-friday-military-says_1728741476.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/15/ST-logo-placeholder_15.jpg?VersionId=di.2D_BPlurdcKGurSfojlP9i.Vnd6zo", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russian-plane-violated-swedish-airspace-on-friday-military-says_1728741476.html", "title": "Swedish airspace violated by Russian military jet on June 14, armed forces say", "title_page": "Swedish airspace violated by Russian military jet on June 14, armed forces say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "STOCKHOLM - A Russian military aircraft was met by Swedish fighter jets after it briefly violated Sweden’s airspace east of the Baltic island of Gotland on June 14, the Nordic country’s armed forces said on June 15.\nTwo Gripen jets were sent up to meet the Russian plane, an SU-24, after it failed to respond to a radio warning from Sweden’s military air traffic control, the Swedish armed forces said in a statement.\n“The Russian actions are not acceptable and show a lack of respect for our territorial integrity,” Swedish air force chief Jonas Wikman said. “We followed the entire chain of events and were in place to intervene.”\nThe June 14 incident took place as Sweden – Nato’s newest member – and several of its new allies take part in naval exercises in the Baltic Sea.\nThe Swedish military said similar airspace violations by Russian aircraft last occurred in 2022 when two SU-27 and two SU-24 planes also made incursions near Gotland.\nSweden’s neighbour Finland said separately on June 14 it suspected that four Russian military planes had violated its airspace on June 10. REUTERS", "url": "https://www.straitstimes.com/world/europe/russian-plane-violated-swedish-airspace-on-friday-military-says"}