{"authors": [], "date_download": "2024-10-12 14:16:25", "date_modify": "2024-10-12 14:16:25", "date_publish": "2022-03-07 21:51:18", "description": "Macron warned the situation in Ukraine was worsening by the day. Read more at straitstimes.com.", "filename": "world_europe_macron-condemns-putins-moral-cynicism-over-ukraine-corridors_1728742585.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/07/mi_presemmanuel_070322.jpg?VersionId=_eIdUepelYmGFk2HsG80XdrQf2LJIqp.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_macron-condemns-putins-moral-cynicism-over-ukraine-corridors_1728742585.html", "title": "Macron condemns Putin's 'moral cynicism' over Ukraine corridors", "title_page": "Macron condemns Putin's 'moral cynicism' over Ukraine corridors | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS (AFP) - French President Emmanuel Macron on Monday (March 7) accused his Russian counterpart Vladimir Putin of hypocrisy and cynicism after Moscow said it would open humanitarian corridors to allow the evacuation of civilians from several Ukrainian cities, but only to Russia or Belarus.\n\"All this is not serious, it is moral and political cynicism, which I find intolerable,\" Mr Macron told LCI television in an interview.\nHe added that promises to protect civilians only so that they could flee towards Russia were \"hypocritical\".\n\"I do not know many Ukrainians who want to go to Russia,\" he added, saying that full ceasefires to protect civilians were needed rather than corridors.\nMoscow announced the proposed escape routes from Kharkiv, Kyiv, Mariupol and Sumy after Mr Putin and Mr Macron spoke by telephone on Sunday, saying the move was taken after a \"personal request\" by Mr Macron.\nBut the Elysee Palace said no such request was made and Mr Macron accused Moscow of a \"PR stunt\" with its announcement.\nMr Macron warned the situation in Ukraine was worsening by the day and international attempts to agree a ceasefire had so far failed.\nHe said a top priority was to avoid \"catastrophes\" with Ukraine's nuclear power plants after Europe's largest atomic power plant Zaporizhzhia was attacked and seized by invading Russian forces last week.\nThere are four active nuclear plants in the country as well as the Chernobyl facility that was the site of the 1986 nuclear disaster.\nBut Mr Macron also insisted that \"France is not at war with Russia\", adding that \"what we want is to stop this war without becoming belligerents ourselves\".\nMr Macron spoke to Mr Putin on Sunday for one hour and 45 minutes, the fourth time they had spoken since the Russian invasion of Ukraine on Feb 24.\nRussia would reach its objectives in Ukraine \"either through negotiation or through war\", Mr Putin told Mr Macron according to a French presidential official, adding the Russian president also pledged \"it was not his intention\" to attack Ukrainian nuclear sites.", "url": "https://www.straitstimes.com/world/europe/macron-condemns-putins-moral-cynicism-over-ukraine-corridors"}