{"authors": [], "date_download": "2024-10-12 14:04:32", "date_modify": "2024-10-12 14:04:32", "date_publish": "2023-01-06 03:37:46", "description": "The US would provide Ukraine with Bradley Infantry Fighting Vehicles while Germany would provide Marder Infantry Fighting Vehicles.  Read more at straitstimes.com.", "filename": "world_europe_us-weapons-package-for-ukraine-includes-50-bradley-fighting-vehicles_1728741872.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/06/2023-01-04T214018Z587866206RC2WJY9KRCYBRTRMADP3UKRAINE-CRISIS-USA-DEFENSE_2.JPG?VersionId=LAYR0ciks7A2QpC9TZLMoiPAvIhJT.pD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_us-weapons-package-for-ukraine-includes-50-bradley-fighting-vehicles_1728741872.html", "title": "Germany and US agree to send combat vehicles to Ukraine", "title_page": "Germany and US agree to send combat vehicles to Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN/WASHINGTON - The leaders of the United States and Germany on Thursday announced they were sending armoured fighting vehicles to Ukraine, ramping up military support for Kyiv to repel Russian forces after a similar move by France earlier this week.\nIn a joint statement after a call between US President Joe Biden and German Chancellor Olaf Scholz, the United States said it would provide Ukraine with Bradley Infantry Fighting Vehicles while Germany would provide Marder Infantry Fighting Vehicles.\nThe US weapons package, to be announced on Friday, is expected to include about 50 Bradley Fighting Vehicles as part of security assistance totalling about US$2.8 billion (S$3.77 billion), US officials told Reuters.\n“Right now the war in Ukraine is at a critical point,” Mr Biden told reporters. “We have to do everything we can to help the Ukrainians resist Russian aggression.”\nBoth countries agreed to train Ukrainian soldiers on how to use them, it said, while Germany would also supply a Patriot air defence battery to Ukraine, which has scored some battlefield successes since Russian forces invaded last February but has asked allies for heavier weapons to defend itself.\n“President Biden and Chancellor Scholz expressed their common determination to continue to provide the necessary financial, humanitarian, military and diplomatic support to Ukraine for as long as needed,” the statement said.\nRussia’s ambassador in Washington said the Bradleys “decision” showed Moscow’s US interlocutors “have not even tried to listen to our numerous calls to take into account possible consequences of such a dangerous course by Washington.”\nAmbassador Anatoly Antonov, in comments published in Russian and English on the Facebook page of the Russian embassy, said there could be no more talk of weapons transfers being of a defensive nature.\nThe administration’s actions, he said in remarks framed as responses to media questions, “indicate a lack of any desire for a political settlement.”\nUkraine President Volodomyr Zelensky expressed his appreciation for Germany’s contribution, saying on Twitter that“Germany is making an important contribution to intercepting all Russian missiles!”\nThe decision was announced after Mr Scholz’s government faced a chorus of calls from within his three-way coalition to beef up military support for Ukraine after France announced it was sending light AMX-10 RC armoured combat vehicles.\nMr Scholz has ramped up defence spending and sent aid and weapons to Ukraine since the invasion, but has, like other Western powers, sometimes hesitated before supplying powerful weapons for fear of risking direct conflict with Russia.\nHe has also made it clear that he did not want to go it alone on sending heavy weapons to Ukraine and that he would coordinate deliveries with other members of the Nato alliance.\nOn a visit to London, German Foreign Minister Annalena Baerbock said Ukraine must be given weapons not only to defend itself but also to liberate areas under Russian occupation.\n“We cannot leave any room to doubt our support, and we have to constantly see what more we can do, especially in terms of military support,” she told a briefing alongside her British counterpart James Cleverly.\nThat includes weapons that “Ukraine needs to free occupied areas and the people who are suffering under Russian terror”, she said.\nGerman politicians had also renewed calls for Berlin to deliver tanks to Ukraine.\nMs Marie-Agnes Strack-Zimmermann, the head of the parliamentary defence committee and a member of Scholz’s junior coalition partner Free Democrats (FDP), had publicly chided Mr Scholz after the French announcement, saying that “other partner countries are once again leading the way”. REUTERS", "url": "https://www.straitstimes.com/world/europe/us-weapons-package-for-ukraine-includes-50-bradley-fighting-vehicles"}