{"authors": [], "date_download": "2024-10-12 13:50:01", "date_modify": "2024-10-12 13:50:01", "date_publish": "2023-12-06 15:57:00", "description": "Sovereign wealth funds, the largest sustained by oil, have committed less than $13 billion to the climate cause. Read more at straitstimes.com.", "filename": "world_middle-east_sovereign-wealth-funds-struggle-to-turn-their-trillions-to-climate-finance_1728741001.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/06/FILES-OPEC-OIL-ENERGY-ECONOMY-INDUSTRY-POLITICS-192009.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_sovereign-wealth-funds-struggle-to-turn-their-trillions-to-climate-finance_1728741001.html", "title": "Sovereign wealth funds struggle to turn their trillions to climate finance", "title_page": "Sovereign wealth funds struggle to turn their trillions to climate finance | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON/DUBAI - Sovereign wealth funds (SWF) that control nearly US$12 trillion (S$16 trillion) in assets are unlikely to quickly dismantle the hurdles in the way of urgently needed increases to their climate investments, even as COP28 talks seek to close the funding gap.\nFunds such as those of Norway and COP28 host United Arab Emirates face obstacles, including mandates that require predictable returns that make it hard to find enough sustainable projects in which they can invest.\nSo far, SWFs, the largest of which are sustained by oil, have committed less than US$10 billion to the climate cause, even though a dozen interviews with SWFs and analysts who track them showed that funds, big and small, are increasingly concerned with the energy transition.\n“I’m not seeing wide-ranging investment strategy against climate change in funds around the world,” said Professor Bernardo Bortolotti, director of the Sovereign Investment Lab at Bocconi University in Milan. “With the notable exception of Singapore and New Zealand, the commitments so far have been lacklustre, accounting for less than 5 per cent of total sustainable investments.”\nSome smaller funds, such as those in Nigeria and Bahrain, are boosting renewables or carbon offsetting, while a survey published in November showed more than a third of public funds planned to increase allocations to green bonds and assets.\nBut the outright level of cash that SWFs have put towards renewable energy and other sustainable investments has stagnated.\nResearch by the Centre for the Governance of Change at Spain’s IE University tallied global SWFs sustainable investments – everything from renewable energy to recycling and sustainable agriculture – at US$9.3 billion in 2022 – below the 2018 peak of US$9.6 billion.\nDuring and after the pandemic, analysts said caution increased as a deteriorating world economic outlook drove investors to safer assets and sapped investment appetite for unpredictable green technology.\nThe limited sovereign wealth investment compares with their US$11.6 trillion of assets under management, and with UNCTAD estimates of a US$5.8 trillion global sustainable finance market.\nFigures from the International Forum of Sovereign Wealth Funds (IFSWF) and the International Renewable Energy Agency similarly show SWF investments are stuck.\n“From the numbers we track... we haven’t seen growth,” said Dr Ute Collier, acting director for knowledge, policy and finance at International Renewable Energy Agency.\nMandates matter\nUN-commissioned research found the world needs US$125 trillion by 2050 to achieve net-zero greenhouse gas emissions; UNCTAD pegged the annual developing world funding gap at US$4 trillion. The UN and the International Finance Corporation are among those turning to SWFs to fill it.\nThere are roughly 100 SWFs worldwide and they include those launched even by cash-poor countries. Some run assets, such as state-owned airlines or telecoms, while others facilitate foreign investment at home.\nThe top 10, dominated by oil wealth, control 90 per cent of the assets.\nSet up by governments, more than 30 SWFs, including seven of the top 10, back the Santiago Principles, meaning they pledge to make independent investment decisions, rather than taking direction from government, as a way of inspiring international confidence.\nMandates also include ensuring predictable returns – similar to those sought by pension funds that aim to safeguard rich-world workers’ retirement pots.\nThis limits the scope to boost money for renewables, sustainable agriculture or energy storage.\n“Returns are just too low,” Dr Jim Krane, the Wallace S. Wilson Fellow for Energy Studies at Rice University’s Baker Institute told Reuters. “The sovereign wealth fund mandate is to maximise returns, so they look elsewhere.”\nA source at one fund signed on to the Santiago Principles said that it could invest in climate goals but “on the rationale of investing for financial returns”.\nThe UAE, whose COP presidency has come under criticism because of its closeness to the oil industry, used the talks to announce a US$30 billion climate-focused vehicle, bypassing some of its largest SWFs, which are signed on to the Santiago Principles.\nThe world’s largest fund, Norway’s Norges Bank, has evicted big polluters from its portfolio and created sustainable investment goals. A Norges spokesperson said it is in regular contact with other SWFs to discuss responsible investment, including on climate.\nWorking for change\nSources at the wealth funds, speaking on condition of anonymity because they were not authorised to speak publicly, say that internally they see increasing value in trying to green their portfolios, and even reach net-zero.\n“Equity investments through SWFs are organically heading in that direction,” one source close to a Gulf fund told Reuters.\nThe One Planet Sovereign Wealth Fund (OPSWF) Network is also working to create the framework that funds need to boost these investments, including by improving the climate data for all investors and by identifying what could help emerging countries attract private capital – including from SWFs – to their energy transition plans.\nMr Lawrence Yanovitch, the OPSWF coordinator, said that funds are “stepping up their pace”.\n“We see it in the way in which members are integrating climate issues into their portfolios by hiring expert staff and engaging in training and peer exchanges,” he said.\nAt COP28 on Dec 4, IE University, the IFSWFs and the UN Joint Sustainable Development Goals Fund launched an initiative to connect African SWFs with sustainable investments, and to help attract private capital. They intend to eventually expand to other regions.\nIE’s Javier Capape said the cash stagnation was temporary; the 66 SWFs’ “green” deals in 2022 were four times that of the average of the previous four years.", "url": "https://www.straitstimes.com/world/middle-east/sovereign-wealth-funds-struggle-to-turn-their-trillions-to-climate-finance"}