{"authors": [], "date_download": "2024-10-12 14:04:21", "date_modify": "2024-10-12 14:04:21", "date_publish": "2023-11-29 03:27:59", "description": "Mercury and arsenic were used in the attack on Ms Marianna Budanova, the wife of Lieutenant-General Kyrylo Budanov. Read more at straitstimes.com.", "filename": "world_europe_ukraine-suspects-russia-poisoned-spy-chiefs-wife_1728741861.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/29/2023-11-28T115525Z1892193358RC2XUY9M6KGWRTRMADP3UKRAINE-CRISIS-BUDANOV.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-suspects-russia-poisoned-spy-chiefs-wife_1728741861.html", "title": "Ukraine suspects Russia poisoned spy chief’s wife", "title_page": "Ukraine suspects Russia poisoned spy chief’s wife | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine said on Nov 28 it believed Russia had poisoned the wife of its military intelligence chief, in an apparent assassination attempt targeting the heart of Kyiv’s leadership.\nMs Marianna Budanova, who is an adviser to Kyiv Mayor Vitali Klitschko, was hospitalised after a prolonged deterioration in her health, the Babel news outlet reported earlier.\nUkrainian investigators’ “main hypothesis” is that Russia was involved in the poisoning attempt, Ukrainian military intelligence spokesman Andriy Yusov later told AFP.\n“The target was the wife,” he added, because “it is simply impossible to reach the commander directly”, referring to Lieutenant-General Kyrylo Budanov.\nThere was no immediate comment from the Russian authorities.\nMr Yusov said mercury and arsenic, highly toxic substances, were used in the attack.\nCiting unnamed intelligence sources, Babel said Kyiv had opened an investigation into what it described as “attempted murder”. A source speaking on condition of anonymity told AFP Babel’s report was accurate, adding that Mrs Budanova had been poisoned and was receiving treatment, but declined to give further details.\nBabel reported that the substances found in her body “are not used in normal life or military affairs”.\n“Their presence may indicate a deliberate poisoning attempt,” it said.\nIt also said “several” other employees of GUR, the military intelligence service, were being treated for suspected poisoning.\nMr Yusov confirmed to AFP that traces of heavy metals had been found in other employees, but declined to say how many.\n‘Over time’\nMs Budanova was reportedly hospitalised after her condition deteriorated and has already undergone some treatment.\nIt is not clear when she fell ill, but Mr Yusov told AFP that the assassination attempt “could have been stretched over time”.\n“I can’t talk about the timing now,” he said.\nLaw enforcement officials believe the poison was administered through her food, news outlet Ukrainska Pravda reported.\nRussia has been accused of poisoning attacks before, although the Kremlin has firmly denied the charges.\nIn 2018, a former Russian military intelligence officer convicted by Moscow of high treason was poisoned along with his daughter in Britain.\nAssassinations are not unheard of in the Ukraine war.\nSeveral pro-Russian officials and supporters of Moscow’s invasion of Ukraine have been assassinated since Russia launched its full-scale assault on Ukraine in February 2022.\nOfficials said they have foiled “more than 10” assassination attempts against Lt-Gen Budanov, a highly respected figure in Ukraine.\nLt-Gen Budanov’s influential military intelligence unit is considered responsible for several sabotage attacks against Russia that have taken place behind the front lines.\nMoscow has accused the GUR of being behind the October 2022 explosions on the Kerch bridge, which links Russia to the annexed Crimean peninsula.\nLt-Gen Budanov said in August his wife had been living with him “in his office”.\nHe said she had not left his side since the start of the invasion for security purposes. AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-suspects-russia-poisoned-spy-chiefs-wife"}