{"authors": [], "date_download": "2024-10-12 14:06:54", "date_modify": "2024-10-12 14:06:54", "date_publish": "2022-09-30 22:38:31", "description": "He added that Kyiv is ready for talks with Moscow, but not with President Vladimir Putin. Read more at straitstimes.com.", "filename": "world_europe_zelensky-says-ukraine-applying-for-nato-membership_1728742014.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/30/yu_zelensky_nato0930.jpg?VersionId=e5AIZ9_ZvRs8n.YmbmkPrFwIDYwwsGS0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_zelensky-says-ukraine-applying-for-nato-membership_1728742014.html", "title": "Zelensky says Ukraine applying for fast-track Nato membership", "title_page": "Zelensky says Ukraine applying for fast-track Nato membership | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - President Volodymyr Zelensky said on Friday that Ukraine is formally applying for fast-track membership of the Nato military alliance and that Kyiv is ready for talks with Moscow, but not with President Vladimir Putin.\nThe Ukrainian leader made his comments in a video which appeared intended as a forceful rebuttal to the Kremlin after Mr Putin held a ceremony in Moscow to proclaim four partially occupied Ukrainian regions as annexed Russian land.\n“We are taking our decisive step by signing Ukraine’s application for accelerated accession to Nato,” Mr Zelensky said in a video on Telegram.\nThe video showed Mr Zelensky announcing the decision and then signing a document flanked by his prime minister and the speaker of Parliament.\nHis remarks come after Mr Putin signed treaties to annex four Moscow-occupied Ukrainian regions – Donetsk, Kherson, Lugansk and Zaporizhzhia – at a grand ceremony in the Kremlin.\nThe pro-Kremlin leaders of the annexed territories claimed the regions voted in favour of becoming part of Russia in referendums that Western capitals and international organisations did not recognise.\nMr Zelensky's announcement is likely to touch a nerve in Moscow which casts the Nato bloc at home as a hostile military alliance bent on encroaching in Moscow's sphere of influence and destroying it.\nIn his video speech, Mr Zelensky accused Russia of brazenly rewriting history and redrawing borders “using murder, blackmail, mistreatment and lies”, something he said Kyiv would not allow.\nHe said however that Kyiv remains committed to the idea of co-existence with Russia “on equal, honest, dignified and fair conditions”.\n“Clearly, with this Russian president it is impossible. He does not know what dignity and honesty are. Therefore, we are ready for a dialogue with Russia, but with another president of Russia,” Mr Zelensky said. AFP, REUTERS", "url": "https://www.straitstimes.com/world/europe/zelensky-says-ukraine-applying-for-nato-membership"}