{"authors": [], "date_download": "2024-10-12 13:47:44", "date_modify": "2024-10-12 13:47:44", "date_publish": "2024-10-03 03:44:45", "description": "More than 160 people were killed when Helene tore through several southeastern US states over several days. Read more at straitstimes.com.", "filename": "world_united-states_biden-lands-in-south-carolina-to-view-damage-from-hurricane-helene-deploys-1000-troops_1728740864.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/2024-10-02T182245Z1923856865RC2ICAAEG2PXRTRMADP3STORM-HELENE-BIDEN.JPG?VersionId=vLgC5y8ZrmKmklykXquEVDEcP0uGlJBB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_biden-lands-in-south-carolina-to-view-damage-from-hurricane-helene-deploys-1000-troops_1728740864.html", "title": "Biden, Harris view Helene devastation, 1,000 troops deployed", "title_page": "Biden, Harris view Helene devastation, 1,000 troops deployed | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GREER, South Carolina - US President Joe Biden and Vice-President Kamala Harris travelled on Oct 2 to South Carolina, North Carolina and Georgia to assess the devastation wrought by Hurricane Helene in the US South-east, which has killed more than 160 people.\nMr Biden landed on the afternoon of Oct 2 in Greer, South Carolina, where he was met by South Carolina Governor Henry McMaster, US Senator Lindsey Graham and North Carolina Governor Roy Cooper, among others.\nThe president had what appeared to be an intense conversation with the group on the tarmac, then boarded a helicopter for an aerial tour.\nBefore leaving Washington, Mr Biden directed up to 1,000 active-duty troops to immediately deploy to assist with response and recovery efforts.\nSearch-and-rescue teams have conducted nearly 1,500 structural evaluations and hundreds of rescues and evacuations, said Homeland Security Secretary Alejandro Mayorkas.\nFormer president Donald Trump, a Republican running against Ms Harris in this year’s presidential election, falsely claimed that Mr Biden, a Democrat, had been unresponsive to the hurricane’s destruction, an allegation local officials deny.\nMs Harris arrived in Georgia on Oct 2 and will head to North Carolina in the coming days.\nMr Biden will be briefed in Raleigh, North Carolina, later on Oct 2 as rescuers scour the state’s mountains for survivors, then head to Georgia and Florida on Oct 3, White House spokesperson Karine Jean-Pierre said.\nMore than US$10 million (S$13 million) has been provided directly to those affected by the storm, Ms Jean-Pierre said.\nOver 4,800 personnel from across the federal workforce have been deployed to help in recovery efforts, along with 8.8 million meals, more than 7.4 million litres of water and 150 emergency power generators, said Mr Mayorkas.\nStill, the Homeland Security secretary said federal funding may not be enough should another hurricane hit.\n“We are meeting the moment, but that doesn’t speak about the future,” Mayorkas said.\n“We are expecting another hurricane hitting... Fema does not have the funds to make it through the season.”", "url": "https://www.straitstimes.com/world/united-states/biden-lands-in-south-carolina-to-view-damage-from-hurricane-helene-deploys-1000-troops"}