{"authors": [], "date_download": "2024-10-12 14:02:41", "date_modify": "2024-10-12 14:02:41", "date_publish": "2023-05-07 12:10:00", "description": "The overnight strikes coincided with reports of multiple explosions across Russian-occupied Crimea. Read more at straitstimes.com.", "filename": "world_europe_ukraine-launches-more-than-10-drones-on-crimea-russia-installed-official_1728741761.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/07/aiukraine0705_2.JPG?VersionId=A8Z8crHhBLGzLoRb72rXigoCQKU9S4l8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-launches-more-than-10-drones-on-crimea-russia-installed-official_1728741761.html", "title": "Russia keeps up missile attacks on Ukraine ahead of expected Kyiv offensive", "title_page": "Russia keeps up missile attacks on Ukraine ahead of expected Kyiv offensive | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Russia kept up its missile attacks on Ukraine on Sunday ahead of a widely anticipated Ukrainian counter-offensive, targeting an industrial site in the southern Mykolaiv region.\nMykolaiv Governor Vitaliy Kim said a building and territory belonging to an unspecified enterprise were damaged overnight after Russian long-range bombers targeted his region with five Kh-22 cruise missiles.\nUkrainian Air Force spokesman Yuriy Ihnat told local television on Sunday morning that a total of six of those missiles had been fired at Ukraine overnight but that none had hit their targets.\nGovernor Oleh Synyehubov said at least five people were injured after an S-300 missile struck a carpark in the city of Balakliya in the eastern Kharkiv region.\nRussian forces have stepped up their long-range missile strikes on civilian and infrastructure targets in recent days. Air raid alerts blared for several hours overnight into early Sunday over roughly two-thirds of Ukraine, extending from Kyiv and regions to the west of the capital through to the entire east and south.\nOfficials in the capital Kyiv and the south-eastern Dnipropetrovsk region also reported shooting down a reconnaissance and attack drone in the early hours.\nThe overnight strikes coincided with Ukrainian and Russian media reports of multiple explosions across Russian-occupied Crimea.\nUkraine launched more than 10 drones overnight on the peninsula, including three on the port of Sevastopol, a Russian-installed official said early on Sunday, adding that air defence systems repelled all the attacks on Sevastopol.\n“No objects (in Sevastopol) were damaged,” Mr Mikhail Razvozhayev, the Moscow-installed governor of Sevastopol, said on the Telegram messaging app.\nThere were no immediate details of any damage from the strikes elsewhere on the Crimean Peninsula, which Russia annexed from Ukraine in 2014.\nBaza, a Telegram channel with links to Russia’s law enforcement agencies, reported earlier on Sunday that according to the channel’s preliminary information, there were no casualties in what it said was a series of attacks on Crimea.\nAccording to Ukrainian monitoring of Telegram channels, explosions took place in Sevastopol and Saki – where Russia has an airbase – as well as a few other places.\nStrikes on Russian-held targets have intensified in the past two weeks, especially in Crimea.\nUkraine, without confirming any role in those attacks, says destroying infrastructure is preparation for its planned ground assault. REUTERS, AFP", "url": "https://www.straitstimes.com/world/europe/ukraine-launches-more-than-10-drones-on-crimea-russia-installed-official"}