{"authors": [], "date_download": "2024-10-12 14:07:21", "date_modify": "2024-10-12 14:07:21", "date_publish": "2022-09-30 04:06:31", "description": "It comes as Russia plans to declare the annexation of parts of Ukraine occupied by Russian troops on Friday. Read more at straitstimes.com.", "filename": "world_europe_us-senate-approves-us12-billion-in-new-aid-for-ukraine_1728742041.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/30/UKRAINE-RUSSIA-CONFLICT-WAR-195810.jpg?VersionId=1UyENJJw14QD8NXHb0nq9oafXlI21uaz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_us-senate-approves-us12-billion-in-new-aid-for-ukraine_1728742041.html", "title": "US Senate approves US$12b in new aid for Ukraine", "title_page": "US Senate approves US$12b in new aid for Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The US Senate approved US$12 billion (S$17 billion) in new economic and military aid for Ukraine on Thursday as part of a stopgap extension of the federal budget into December.\nThe measure, agreed by senators of both parties, includes US$3 billion for arms, supplies and salaries for Ukraine's military, and authorises President Joe Biden to direct the US Defence Department to take US$3.7 billion worth of its own weapons and materiel to provide Ukraine.\nIt also provides US$4.5 billion for Kyiv to keep the country's finances stable and keep the government running, providing services to the Ukrainian people.\nIt comes as Russian President Vladimir Putin plans to declare the annexation of parts of Ukraine occupied by Russian troops on Friday.\n\"Seven months since the conflict began, it's crystal clear that American assistance has gone a long way to helping the Ukrainian people resist Putin's evil, vicious aggression,\" said Senate Majority Leader Chuck Schumer.\n\"But the fight is far from over, and we must, we must, continue helping the brave, valiant Ukrainian people.\"\nThe Ukraine aid is part of a short-term extension of the federal budget, which is to expire at the end of the fiscal year on Sept 30 without the parties in Congress having agreed to a full-year allocation for fiscal 2022-23.\nThe extension, or continuing resolution, will keep the government running into December, but it has to first be approved by the House of Representatives to avoid shutting down parts of the government on Monday. AFP", "url": "https://www.straitstimes.com/world/europe/us-senate-approves-us12-billion-in-new-aid-for-ukraine"}