{"authors": [], "date_download": "2024-10-12 14:01:42", "date_modify": "2024-10-12 14:01:42", "date_publish": "2024-02-16 20:58:16", "description": "Mr Navalny was Russia’s most prominent opposition leader. Read more at straitstimes.com.", "filename": "world_europe_explainer-who-was-alexei-navalny-and-what-did-he-say-of-russia-putin-and-death_1728741702.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/16/LYNXNPEK1F0FL-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_explainer-who-was-alexei-navalny-and-what-did-he-say-of-russia-putin-and-death_1728741702.html", "title": "Who was Alexei Navalny and what did he say of Russia, Putin and death?", "title_page": "Who was Alexei Navalny and what did he say of Russia, Putin and death? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russia’s Alexei Navalny died on Feb 16 in the penal colony north of the Arctic Circle where he was serving a jail term, the Russian prison service said.\nHe was 47.\nNavalny was Russia’s most prominent opposition leader.\nHe “felt unwell” after a walk in the penal colony in Kharp, about 1,900km north-east of Moscow.\nNavalny, the prison service said, had lost consciousness almost immediately.\nOpposition leader\nNavalny became the leading figure among Russia's splintered opposition.\nSupporters cast him as a Russian version of South Africa's Nelson Mandela who would one day be freed from jail to lead the country.\nHe earned admiration from many in Russian opposition circles for voluntarily returning to Russia in 2021 from Germany, where he underwent treatment for what Western laboratory tests showed was an attempt to poison him with a nerve agent in Siberia.\nRise to prominence\nA former lawyer, Navalny rose to prominence with blogs that exposed what he said was vast corruption across the Russian elite, describing Russia as ruled by “crooks and thieves”.\nHe participated in Russian nationalist marches in the 2000s.\nCalls for restrictions on immigration and criticism over what some viewed as his overly nationalist views prompted his expulsion from the liberal Yabloko opposition party in 2007.\nHe lampooned Russian President Vladimir Putin’s elite and exposed some of the opulence of the lifestyles of senior officials.\nNavalny used the Internet and even drones to illustrate what he described as their vast holdings and luxury property.\nWhen demonstrations against Mr Putin flared in December 2011, after an election tainted by fraud accusations, Navalny was one of the first protest leaders arrested.\nNavalny long forecast Russia could face seismic political turmoil, including revolution, because he said Mr Putin had built a brittle system of personal rule reliant on sycophancy and corruption.\nWhat does the Kremlin say?\nThe Kremlin said Mr Putin had been informed of Navalny’s death.\nThe Kremlin dismissed Navalny’s allegations of vast corruption and Mr Putin’s personal wealth. Navalny’s movement is outlawed and most of his senior allies have fled Russia and now live in Europe.\nRussian officials cast Navalny as an extremist who was a puppet of the US’ Central Intelligence Agency that they say is intent on trying to sow the seeds of revolution to weaken Russia and make it a client state of the West.\nNavalny was detained countless times for organising public rallies, and prosecuted repeatedly on charges including corruption, embezzlement and fraud. He said the accusations and convictions were politically motivated.\nNavalny had an extra 19 years in a maximum security penal colony added to his jail term in 2023 in a criminal case that he said was designed to cow the Russian people into political submission.\nPoisoning\nIn August 2020, Navalny fell ill on a flight from Tomsk, in Siberia, to Moscow.\nThe pilot made an emergency landing, saving his life, and Navalny was flown to Berlin, where he was treated for the effects of a neurotoxin that German military tests showed to be Novichok, a poison developed in the Soviet Union.\nMr Putin dismissed a joint media investigation that said it had identified a team of assassins from Russia’s FSB security service. “If someone had wanted to poison him, they would have finished him off,” he said.\nFamily\nNavalny’s wife is Yulia. They have a daughter, Darya, and a son, Zakhar.\nKey Navalny quotes\nOn the Ukraine war:\n“This is a stupid war which your Putin started,” Navalny told an appeal court in Moscow via video link from a corrective penal colony in 2022. “This war was built on lies.”\n“One madman has got his claws into Ukraine and I do not know what he wants to do with it – this crazy thief.”\nOn Putin:\n“Corruption is the foundation of contemporary Russia, it is the foundation of Mr Putin’s political power,” Navalny told Reuters in an interview in 2011.\nOn Russia:\n“Once the great Russian writer Leo Tolstoy described the structure of power in Russia: ‘the villains who robbed their own people got together, recruited soldiers and judges to guard their orgy, and now they’re having a feast’. This brilliant phrase precisely describes what is happing in our country.”\nIn 2023, he admonished the Russian elite for its venality, expressing hatred for those who he said squandered a historic opportunity to reform after the 1991 fall of the Soviet Union.\nHe dissected Russia’s post-Soviet history, including the legacies of the most powerful figures of the 1990s who became known as the reformers who sought to lay the foundations of capitalism and the oligarchs who won fabulous fortunes.\n“I can’t stop myself from fiercely, wildly hating those who sold, pissed away, and squandered the historical chance that our country had in the early nineties,” Navalny said.\nOn fear and ambition:\n“Why should I be afraid?” he said in 2011 when asked about the dangers of challenging the Kremlin.\nWhen asked by Reuters about his ambition, he winced but said: “I would like to be president, but there are no elections in Russia.”\nOn death:\n“If they decide to kill me then it means we are incredibly strong, and we need to use that power and not give up,” he once told CNN. “We don’t realise how strong we actually are.” REUTERS", "url": "https://www.straitstimes.com/world/europe/explainer-who-was-alexei-navalny-and-what-did-he-say-of-russia-putin-and-death"}