{"authors": [], "date_download": "2024-10-12 13:43:31", "date_modify": "2024-10-12 13:43:31", "date_publish": "2024-05-03 12:38:00", "description": "His death follows that of another Boeing whistleblower, who died from a self-inflicted wound in March. Read more at straitstimes.com.", "filename": "world_united-states_whistleblower-who-raised-safety-concerns-at-boeing-contractor-spirit-dies_1728740611.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/03/2024-05-02T145640Z1123336893RC2DI7A475U1RTRMADP3BOEING-737MAX-SPIRIT-AERO-LAWSUIT.JPG?VersionId=azHbScfi35ytG4a5qPu9YY_2yTDCRvxa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_whistleblower-who-raised-safety-concerns-at-boeing-contractor-spirit-dies_1728740611.html", "title": "Whistleblower who raised safety concerns at Boeing contractor Spirit dies", "title_page": "Whistleblower who raised safety concerns at Boeing contractor Spirit dies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Mr Josh Dean, a former quality auditor at a Boeing Co. supplier who raised concerns about the safety of the 737 Max jet, has died.\n“Our thoughts are with Josh Dean’s family,” Spirit AeroSystems Holdings Inc., which makes aircraft parts for Boeing, said in a statement. “This sudden loss is stunning news here and for his loved ones.”\nMr Dean, who was 45, was hospitalised after developing breathing problems just over two weeks ago and had struggled with pneumonia and MRSA, a serious bacterial infection, the Seattle Times reported, citing his aunt Carol Parsons.\nMr Dean had given a deposition in a Spirit shareholder lawsuit and also filed a complaint with the Federal Aviation Administration (FAA) alleging “serious and gross misconduct by senior quality management of the 737 production line” at Spirit, according to the Times report.\nMr Dean’s death follows the passing of another Boeing whistleblower, Mr John Barnett, who died from a self-inflicted wound in March, according to media reports.\nIn an interview with the Wall Street Journal published earlier in 2024, Mr Dean said that he was laid off during the pandemic shutdown and upon his return in May 2021, Spirit had lost many of its most experienced mechanics and auditors.\nHe alleged he was later fired after flagging mis-drilled holes in fuselages, according to the report. A company spokesman said at the time it strongly disagreed with the assertions in the shareholder lawsuit.\nMr Dean had filed a complaint with the Department of Labour alleging his termination was in retaliation for raising safety concerns, according to the Seattle Times.\nBoeing’s safety record and workplace culture are under intense scrutiny after a string of high-profile quality-control problems, including an almost catastrophic mid-air blowout earlier in 2024. No one was injured and the plane landed safely.\nThe incident on an Alaska Airlines flight saw the FAA order a temporary grounding of 171 planes for inspection, while carriers across the globe briefly took their Max 9s out of service.\nThe 737 Max has a troubled history. The jet was grounded by regulators worldwide after deadly crashes in Indonesia and Ethiopia in 2018 and 2019, which killed the hundreds of passengers on board.\nA 20-month span followed during which lawmakers and others denounced Boeing’s safety culture, leading to billions of dollars in lost sales and other costs.\nThe model’s flight prohibition order was lifted in November 2020 in the US after Boeing made a series of software upgrades and training changes. Other nations then variously followed. BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/whistleblower-who-raised-safety-concerns-at-boeing-contractor-spirit-dies"}