{"authors": [], "date_download": "2024-10-12 13:33:59", "date_modify": "2024-10-12 13:33:59", "date_publish": "2024-09-22 15:25:48", "description": "Police have not got anyone in custody over the shooting, said the police. Read more at straitstimes.com.", "filename": "world_four-killed-dozens-injured-in-alabama-mass-shooting_1728740039.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/22/pexels-chaikong2511-34552.jpg?VersionId=RTq8OB5lQn2SrZT5zTaYvhaQxTpyPTem", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_four-killed-dozens-injured-in-alabama-mass-shooting_1728740039.html", "title": "Four killed, dozens injured in Alabama mass shooting", "title_page": "Four killed, dozens injured in Alabama mass shooting | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - A mass shooting involving several assailants has left at least four people dead and dozens wounded in the US state of Alabama, police said on Sept 21.\n“We believe that multiple shooters fired multiple shots on a group of people” in the Five Points South district of Birmingham just after 11pm, police officer Truman Fitzgerald told local media.\nOfficers found two adult males and one adult female who were unresponsive on the pavement suffering from a gunshot wound, he said. All three were pronounced dead at the scene. A fourth victim died at a local hospital, he added.\nCNN reported that Mr Fitzgerald said the victims were in the open on the pavement or on the streets. Detectives are determining whether the shooters walked up to the victims or drove by in a vehicle, he added.\nDozens of people were wounded in the shooting with at least four sustaining life-threatening injuries, he said.\nThe others had “various injuries”, he added.\nPolice have not got anyone in custody over the shooting, Mr Fitzgerald said, urging the public to provide any information that could help the investigation.\nSeveral agencies are involved in the investigation, including the Federal Bureau of Investigation and the Bureau of Alcohol, Tobacco, Firearms and Explosives.\nIn 2024, there have been at least 403 mass shootings – defined as a shooting involving at least four victims, dead or wounded – across the United States, according to the Gun Violence Archive (GVA).\nAt least 12,416 people have been killed in firearms violence in 2024 in the United States, according to the GVA. AFP", "url": "https://www.straitstimes.com/world/four-killed-dozens-injured-in-alabama-mass-shooting"}