{"authors": [], "date_download": "2024-10-12 13:37:40", "date_modify": "2024-10-12 13:37:40", "date_publish": "2024-09-08 08:30:00", "description": "She also said US-China ties need to be “prioritised and nurtured” by the next US administration. Read more at straitstimes.com.", "filename": "world_united-states_yellen-probably-done-when-biden-ends-term-may-meet-chinese-counterpart-soon_1728740260.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/08/416480659.jpg?VersionId=L5kxtQLip5m.4ebxXviVP2t8xn19gecV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_yellen-probably-done-when-biden-ends-term-may-meet-chinese-counterpart-soon_1728740260.html", "title": "Yellen ‘probably done’ when Biden ends term, may meet Chinese counterpart soon", "title_page": "Yellen ‘probably done’ when Biden ends term, may meet Chinese counterpart soon | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AUSTIN, Texas – US Treasury Secretary Janet Yellen on Sept 7 said that she is “probably done” serving at the highest levels of government after President Joe Biden’s term ends in January, but will likely meet again soon with her Chinese counterpart.\nAsked at the Texas Tribune Festival in Austin, Texas, whether she would be “done” when a new administration takes over in January, or might continue in her job or take on a new administration role, she said: “Probably done, but... we’ll see.”\nThe comments are the closest that Dr Yellen, 78, has come to announcing her plans as the presidential race between Vice-President Kamala Harris and former president Donald Trump heats up. Dr Yellen has been the first woman to serve as Treasury secretary, Federal Reserve chair and director of the White House National Economic Council.\nShe told the event in Austin that she still has a lot of work to do at the Treasury in the coming months, including another likely meeting with Chinese Vice-Premier He Lifeng, her Beijing counterpart, to try to manage an often-tense relationship.\nThe two met in April in Beijing, where Dr Yellen warned China to rein in excess industrial capacity ahead of President Joe Biden’s decision to impose steep tariff increases on Chinese-made electric vehicles, batteries, solar products and semiconductors.\nDr Yellen said she would welcome a visit to the US but also may return to China herself, adding: “My guess is that we will have, one way or another, a visit.”\nThe Treasury’s top economic diplomat, Undersecretary Jay Shambaugh, will lead a delegation to Beijing “very soon” to discuss economic issues. Dr Shambaugh leads a US-China economic working group that has made addressing China’s excess factory production a top issue\nDr Yellen said the US-China relationship “needs to be prioritised and nurtured” by the next US administration, with discussions at the highest levels and among agency staff.\n“We have enough differences and without a chance to discuss them and put them in context, it’s certainly possible for tensions to rise,” she said. “So this is something that really requires ongoing attention. I hope that it would get it.”\n‘Solid economy’\nDr Yellen also said the US economy has largely reached a “soft landing” with lower inflation after US August jobs data on Sept 6 showed a slight decline in the unemployment rate despite slower hiring.\n“When you see pace of job creation diminishing over time, what I love to see is that it stabilises roughly where it is now, and we have to be careful to make sure that it’s not going to weaken further,” she said.\nShe said consumer spending remains “quite solid” and while there is “less frenzy” in hiring, there have been no significant layoffs.\n“I’m attentive to downside risks now on the employment side, but what I think we’re seeing, we will continue to see, is a good, solid economy,” she said. REUTERS", "url": "https://www.straitstimes.com/world/united-states/yellen-probably-done-when-biden-ends-term-may-meet-chinese-counterpart-soon"}