{"authors": [], "date_download": "2024-10-12 13:56:53", "date_modify": "2024-10-12 13:56:53", "date_publish": "2024-04-06 03:43:15", "description": "A farm worker from Texas was reported to be infected on April 1. Read more at straitstimes.com.", "filename": "world_cdc-issues-health-alert-for-bird-flu-infection-in-us_1728741413.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/06/LYNXNPEK340RX-1.jpg?VersionId=hbjTlroJAG6_a9d4omEUU4pqUsk1qxgN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_cdc-issues-health-alert-for-bird-flu-infection-in-us_1728741413.html", "title": "Health alert issued for bird flu infection in US", "title_page": "Health alert issued for bird flu infection in US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The US Centres for Disease Control and Prevention (CDC) on April 5 issued a health alert to inform clinicians, state health departments and the public of a case of avian influenza in a person who had contact with dairy cows presumed to be infected with the virus.\nThe farm worker from Texas was reported to be infected on April 1, making it the second case of the H5N1 strain of avian influenza, commonly known as bird flu, identified in a person in the United States.\nIt follows a 2022 case in Colorado, and comes as the virus is spreading to new mammals, including dairy cattle for the first time.\nTo prevent infection from the virus, the CDC recommends the use of personal protective equipment, testing, antiviral treatment, patient investigations and monitoring of people exposed to sick or dead, wild and domesticated animals and livestock that may have been infected with the virus.\nEarlier this week, the CDC said the infection does not change the risk assessment for the US general public from H5N1 bird flu, which it considers to be low. The Texas patient's only symptom was eye inflammation, according to the state's health department. REUTERS", "url": "https://www.straitstimes.com/world/cdc-issues-health-alert-for-bird-flu-infection-in-us"}