{"authors": [], "date_download": "2024-10-12 14:08:47", "date_modify": "2024-10-12 14:08:47", "date_publish": "2022-06-01 07:31:16", "description": "New variants of Covid-19, lockdowns in China and Russia's war on Ukraine have all imposed shocks on the economy, she said. Read more at straitstimes.com.", "filename": "world_united-states_us-treasurys-yellen-says-i-was-wrong-last-year-on-the-path-of-us-inflation_1728742127.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/01/ac_yellen-fed_010622.jpg?VersionId=0Q9kEBFnbWXBl1hmNmpMxsoAiFC0dtQb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-treasurys-yellen-says-i-was-wrong-last-year-on-the-path-of-us-inflation_1728742127.html", "title": "US Treasury's Yellen says 'I was wrong' last year on the path of inflation", "title_page": "US Treasury's Yellen says 'I was wrong' last year on the path of inflation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON (BLOOMBERG) - US Treasury Secretary Janet Yellen gave her most direct admission yet that she made an incorrect call last year in predicting that elevated inflation wouldn't pose a continuing problem.\n\"I was wrong about the path inflation would take,\" Ms Yellen said in an interview that aired Tuesday (May 31) on CNN. \"There have been unanticipated and large shocks to the economy that have boosted energy and food prices and supply bottlenecks that have affected our economy badly that at the time I didn't fully understand.\"\nNew variants of Covid-19, lockdowns in China and Russia's war on Ukraine have all imposed shocks on the economy, the Treasury chief said after attending a meeting at the White House with President Joe Biden and Federal Reserve Chair Jerome Powell to address inflation.\nMr Biden said earlier on Tuesday that his role as president is to give the Fed \"the space they need to do their job, adding, \"I'm not going to interfere with their critically important work.\"\nMs Yellen said that the Fed is taking the steps it needs to stem inflation.\nPublic support for Mr Biden on handling the economy has cratered with the surge in the cost of living. Consumer prices in April rose 8.3 per cent from a year before, close to the 40-year high reached in March.\nJobs slowdown\nMs Yellen highlighted how well the economy has performed in other respects, particularly with regard to employment. But she also made clear that she didn't expect the same robust pace of growth and job creation the US has enjoyed during the recovery from the crisis.\n\"Now we're in a period of transition,\" she said. \"We're not expecting to see the same kinds of job gains, monthly job gains or growth figures going forward. We're looking at steady and stable growth and bringing inflation down.\"\nAsked if the US had seen the worst of the inflation spike, Ms Yellen said it was encouraging that core inflation - a measure that strips out energy and food prices in an effort to show the trend in underlying inflation - had dropped.\nThe core gauge of consumer prices eased to a 6.2 per cent gain in the year through April and is expected to continue slowing in future months.\nStill, Ms Yellen noted that European countries have recently taken steps to limit their imports of Russian oil - a move that has caused global oil prices to rise. \"We can't rule out further shocks,\" she said.", "url": "https://www.straitstimes.com/world/united-states/us-treasurys-yellen-says-i-was-wrong-last-year-on-the-path-of-us-inflation"}