{"authors": [], "date_download": "2024-10-12 13:44:29", "date_modify": "2024-10-12 13:44:29", "date_publish": "2023-12-16 18:33:00", "description": "Sheikh Nawaf took over as emir in September 2020. Read more at straitstimes.com.", "filename": "world_middle-east_kuwait-emir-sheikh-nawaf-dies-aged-86-royal-court_1728740669.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/16/2023-12-16T095706Z664955194RC28Y4AS7HB6RTRMADP3KUWAIT-EMIR.JPG.JPEG?h=c6b29dbd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_kuwait-emir-sheikh-nawaf-dies-aged-86-royal-court_1728740669.html", "title": "Kuwait emir Sheikh Nawaf dies, aged 86; Crown Prince Sheikh Meshal named new emir", "title_page": "Kuwait emir Sheikh Nawaf dies, aged 86; Crown Prince Sheikh Meshal named new emir | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUWAIT CITY - Kuwait saw a quick transition to a new emir on Dec 16 following the death of Sheikh Nawaf al-Ahmad Al-Sabah at age 86, after three years in power.\nHe was succeeded by his half-brother, Sheikh Meshal, who takes over the oil-rich Gulf kingdom at the age of 83, state television reported.\nSheikh Meshal, who assumed some key constitutional duties of the emir in 2021, has spent most of his career in Kuwait’s security and intelligence apparatus, keeping a distance from the often-bitter disputes within the royal family.\nHis predecessor’s reign was short but tumultuous, marked by deep political turmoil and economic challenges triggered by a fall in oil prices that have left the country lagging behind its wealthy Gulf neighbours, the United Arab Emirates, Qatar and Saudi Arabia.\nState television had cut its regular programming and switched to a broadcast of Quranic recital before the announcement of Sheikh Nawaf’s death.\n“With great sadness and sorrow, we mourn... the death of Sheikh Nawaf al-Ahmad Al-Sabah, Emir of the State of Kuwait,” said a statement on state TV.\nPublic offices will shut for three days, and 40 days of mourning were declared.\nSheikh Nawaf, who will be laid to rest on Dec 17, had been hospitalised in November for an undisclosed “emergency”, but had been said to be in a stable condition.\nThe “smooth and orderly succession process...is a testimony to (Kuwait’s) mature political system,” Professor Abdullah Al Shayji, a political science expert at Kuwait University said on social media.\nBorn in 1937, Sheikh Nawaf took over as emir in September 2020 upon the death of another half-brother, Sheikh Sabah, at the age of 91.\nKuwait – a conservative country where sovereign powers remain concentrated in the hands of the ruling Al-Sabah family – is home to the most active and powerful Parliament in the Gulf.\nBut repeated stand-offs between elected lawmakers and Cabinet ministers installed by the ruling family have hindered development efforts and discouraged investors.\nSheikh Nawaf’s rule also saw the Gulf country hold three parliamentary elections in as many years, and there have been five different government Cabinets in 2023.\nThe political deadlock has delayed necessary reforms and blocked development projects, leaving infrastructure and education in disrepair and much of the population disgruntled.\nGiven his age, concerns about his health were commonplace during his rule.\nSheikh Nawaf ascended to the role of crown prince in 2006, appointed by his half-brother Sheikh Sabah al-Ahmad Al-Sabah.\nSheikh Nawaf’s issued numerous amnesties for political prisoners, earning him the title “emir of pardons”.\n“(He will) be remembered for his unique personal attributes: soft-spoken, devout, modest, low profile”, said Dr Bader al-Saif, a history professor at Kuwait University.\nThere were condolences from around the world.\n“He served his country for six decades and fulfilled his duty with all sincerity,” said Sheikh Mohammed bin Rashid Al Maktoum, the ruler of Dubai, on X, formerly Twitter.\nSaudi Arabia’s royal court said the kingdom “and its people share the sorrows of their brothers in the State of Kuwait”.\nQatar’s emir Sheikh Tamim bin Hamad Al-Thani called his passing “painful” and Oman said it would observe three days of mourning.\nBritish Prime Minister Rishi Sunak called the sheikh “a great friend of the UK”, and a statement by the Kremlin said “he had great authority in the Middle East”.\n‘Insider-outsider’\nSheikh Meshal becomes Kuwait’s 17th ruler.\nA father of 12, he will have a year to name a new crown prince, amid speculation on whether he will appoint an heir from a younger generation.\nThe choice of crown prince will reflect “internal ruling family dynamics,” said Dr al-Saif.\n“Whether Kuwait witnesses its first generational shift in decades or not... the country will need to deliver on various fronts.”\nSheikh Meshal was deputy chief of the Kuwait National Guard from 2004 to 2020, and was named crown prince when Sheikh Nawaf took power.\nHe spent many years in the interior ministry, rising through the ranks to head the department of general investigation from 1967 until 1980, where he was credited for strengthening its function as a state security service.\n“With a career in the security bureau and national guard, Sheikh Meshal is an insider-outsider,” said Dr al-Saif on X.\n“He was ‘in the room’ close to three of the previous four emirs on daily matters without (being in government),” he said.\nIn 2016, Sheikh Meshal travelled abroad and underwent a “successful operation”, but details of the treatment were not disclosed. AFP", "url": "https://www.straitstimes.com/world/middle-east/kuwait-emir-sheikh-nawaf-dies-aged-86-royal-court"}