{"authors": [], "date_download": "2024-10-12 14:01:41", "date_modify": "2024-10-12 14:01:41", "date_publish": "2024-04-13 21:56:12", "description": "Mr Zelensky called on all other leaders of partner states to follow this example. Read more at straitstimes.com.", "filename": "world_europe_zelenskiy-thanks-germany-for-new-patriot-system-at-critical-time_1728741701.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/13/LYNXNPEK3C047-1.jpg?VersionId=8tuxFLFUb5HM8S3Y7xb8PkrlRldt.JnQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_zelenskiy-thanks-germany-for-new-patriot-system-at-critical-time_1728741701.html", "title": "Zelensky thanks Germany for new Patriot system at ‘critical time’", "title_page": "Zelensky thanks Germany for new Patriot system at ‘critical time’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine’s President Volodymyr Zelensky thanked Germany’s Chancellor Olaf Scholz for approving the delivery of an additional Patriot missile system and supplying more air defence missiles at a “critical time” for his country.\nNews of a third Patriot air defence system from Germany came as momentum on the battlefield has shifted in Russia’s favour, more than two years since it launched its February 2022 invasion.\nMr Zelensky said a week ago that 25 of the US Patriot systems were needed to cover the entire country, which is under assault from Russian ballistic and hypersonic missiles that can hit targets within minutes.\nOn April 13, Mr Zelensky wrote on the Telegram messaging app that he had an “important, productive” conversation with Mr Scholz.\n“I am grateful to the Chancellor for the decision to supply another, additional Patriot system to Ukraine, as well as missiles for the existing air defence systems.”\nHe added: “I call on all other leaders of partner states to follow this example.”\nMr Zelensky said he and Mr Scholz also discussed preparations for a reconstruction conference in Berlin and a peace summit in Switzerland in June.\nThe German Defence Ministry said in a post on X that the new Patriot system would be handed over immediately and that it was in addition to air defence systems already delivered and planned.\nAn April 10 German government summary of arms and military equipment transfers to Ukraine included two Patriot systems on a list of air defence supplies already delivered. REUTERS", "url": "https://www.straitstimes.com/world/europe/zelenskiy-thanks-germany-for-new-patriot-system-at-critical-time"}