{"authors": [], "date_download": "2024-10-12 14:18:17", "date_modify": "2024-10-12 14:18:17", "date_publish": "2024-09-24 01:48:13", "description": "OTTAWA - A Canadian man detained by China for more than 1,000 days said he was put into solitary confinement for months and interrogated for up to nine hours every day, treatment he said amounted to psychological torture. Read more at straitstimes.com.", "filename": "world_canadian-detained-by-china-says-he-experienced-psychological-torture_1728742697.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/LYNXMPEK8M0KV-1.jpg?VersionId=sBhzPnQHsyU49w1sHAob1Sqqgan5Bw2W", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_canadian-detained-by-china-says-he-experienced-psychological-torture_1728742697.html", "title": "Canadian detained by China says he experienced psychological torture", "title_page": "Canadian detained by China says he experienced psychological torture | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "OTTAWA - A Canadian man detained by China for more than 1,000 days said he was put into solitary confinement for months and interrogated for up to nine hours every day, treatment he said amounted to psychological torture.\nMichael Kovrig, speaking to the Canadian Broadcasting Corp in an interview released on Monday, also said he had missed the birth of his daughter and only met her for the first time when she was two-and-a half years old.\nKovrig and fellow Canadian Michael Spavor were taken into custody in December 2018 shortly after Canadian police detained Meng Wanzhou, the chief financial officer of Chinese telecoms equipment giant Huawei, on a U.S. warrant. Both men were accused of spying.\n\"I still carry a lot of pain around with me and that can be heavy at times,\" Kovrig said in his first substantial comments since he and Spavor were released in September 2021.\nKovrig noted that U.N. guidelines say prisoners should not be put into solitary confinement for more than 15 days in a row.\n\"More than that is considered psychological torture. I was there for nearly six months,\" said Kovrig, a former diplomat who had been working as an adviser with a think-tank when arrested.\nKovrig said there was no daylight in the solitary cell, where the fluorescent lights were kept on 24 hours a day. At one point, his food ration was cut to three bowls of rice a day.\n\"It was psychologically absolutely, the most grueling, painful thing I've ever been through,\" he said.\n\"It's a combination of solitary confinement, total isolation, and relentless interrogation for six to nine hours every day,\" he said. \"They are trying to bully and torment and terrorize and coerce you ... into accepting their false version of reality.\"\nKovrig and Spavor were released on the same day the U.S. Justice Department dropped its extradition request for Meng and she returned to China.\nThe Chinese embassy in Ottawa, responding to Kovrig's interview, said he and Spavor had been suspected of engaging in activities endangering China's national security.\nChinese judicial authorities handled the cases in strict accordance with the law, it said in a statement.\nBilateral ties are chilly. China this month opened a one-year anti-dumping investigation into imports of rapeseed from Canada, just weeks after Ottawa announced 100% tariffs on Chinese-made electric vehicles.\nKovrig's partner was six months pregnant at the time of his arrest. She played their daughter recordings of his voice and showed pictures of her father so she would recognize him when they finally met.\n\"I'll never forget that sense of wonder, of everything being new and wonderful again and pushing my daughter on a swing that had her saying to her mother 'Mummy, I'm so happy',\" he said.\nThe Chinese embassy in Ottawa was not immediately available for comment. REUTERS", "url": "https://www.straitstimes.com/world/canadian-detained-by-china-says-he-experienced-psychological-torture"}