{"authors": [], "date_download": "2024-10-12 14:00:02", "date_modify": "2024-10-12 14:00:02", "date_publish": "2024-07-05 15:56:15", "description": "European Union leaders warned against appeasing Moscow and said the Hungarian leader did not speak for the EU. Read more at straitstimes.com.", "filename": "world_europe_hungarys-orban-says-in-no-position-to-negotiate-between-ukraine-and-russia_1728741602.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/06/11459413.jpg?VersionId=6PB4H3oq1S.6boHOSQHiw5W3NYnSYt0p&h=c0b42204", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_hungarys-orban-says-in-no-position-to-negotiate-between-ukraine-and-russia_1728741602.html", "title": "Hungary's Orban talks Ukraine peace with Putin, stirring EU outcry", "title_page": "Hungary's Orban talks Ukraine peace with Putin, stirring EU outcry | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW/BUDAPEST - Hungarian Prime Minister Viktor Orban held talks on a potential Ukrainian peace deal with Russian President Vladimir Putin on July 5, angering some European Union leaders who warned against appeasing Moscow and said he did not speak for the EU.\nHungary assumed the six-month rotating presidency of the bloc on July 1. Five days in and Mr Orban has visited Ukrainian President Volodymyr Zelensky in Kyiv and formed the \"Patriots for Europe\" alliance with other right-wing nationalists.\nThen he went to Moscow on a \"peace mission\", days before a Nato summit that will address further military aid for Ukraine against what the Western defence alliance has called Russia's \"unprovoked war of aggression\".\nIt was the first meeting of an EU leader with Mr Putin in Moscow since April 2022, two months after Moscow launched its full-scale invasion of Ukraine, and Mr Orban's first since then, although the two have met elsewhere.\nMr Orban's trip drew strong rebukes from fellow EU leaders and Ukraine said it had not been consulted beforehand.\nEuropean Commission president Ursula von der Leyen said that only unity and determination within the 27-nation EU would pave the way to a just and lasting peace in Ukraine\".\n\"Appeasement will not stop Putin,\" she said on X.\nMr Putin, who received Mr Orban in the Kremlin, said the talks had been useful, but accused Ukraine of not wanting to end the two-and-a-half-year-old war and said his own ideas on how to end the conflict - which Ukraine has said are tantamount to surrender - were the way forward.\n\"Their implementation, it seems to us, would make it possible to stop hostilities and begin negotiations,\" Mr Putin told reporters.\n\"I have repeatedly said that we have always been and remain open to discussing a political and diplomatic settlement.\nHowever, on the other side (of the conflict), we hear about the reluctance to resolve issues in this particular way.\"\nMr Putin said in June that Russia would end the conflict, which Moscow calls a special military operation to protect its own security, if Kyiv agreed to drop its aspirations to Nato membership and hand over the entirety of four provinces claimed by Moscow - demands Kyiv swiftly rejected as unacceptable.\nUkraine sees its 10-point peace plan and a recent international summit based on it as the only realistic path, and said Mr Orban's trip to Moscow was not coordinated with Kyiv.\n\"We remind you that for our state, the principle of 'no agreements on Ukraine without Ukraine' remains unshakable and (we) call on all states to observe it strictly,\" Kyiv's foreign ministry said in a statement.\n‘Scepticism’ of Hungary’s motivations\nMr Orban, a critic of Western military aid to Ukraine who has the warmest relations of any EU leader with Mr Putin, said he recognised he had no EU mandate for the trip, but that peace could not be made \"from a comfortable armchair in Brussels\".\n\"We cannot sit back and wait for the war to miraculously end,\" he wrote on X.\nMr Orban told reporters after the talks that Hungary viewed its temporary presidency of the EU over the \"coming half a year, and the work that will be done then, as a peace mission\".\n\"This war is also reflected in the destruction of our economic development and the decline of our competitiveness. In short, I told the President (Putin) that Europe needs peace.\"\nAlthough many steps were needed to end the war and Moscow's and Kyiv's positions remained far apart, Mr Orban said his trip had been the first step to restore dialogue.\nAn EU diplomat, speaking on condition of anonymity, said Orban's trip meant that scepticism within the bloc about Hungary's presidency was \"unfortunately justified - it's all about promoting Budapest's interests\".\nLithuanian President Gitanas Nauseda accused Mr Orban of undermining the EU presidency. \"If you truly seek peace, you don't shake hands with a bloody dictator, you put all your efforts to support Ukraine,\" he wrote on X.\nHungarian Foreign Minister Peter Szijjarto hit back.\n\"Hungary is an independent country so I don't think we should pay attention to such kind of criticism. Time has proven... that without dialogue, without keeping the channels of communication open, there is no solution to this war,\" he said.\nHungary launched its EU presidency with a striking call to \"Make Europe Great Again\", echoing former US president Donald Trump, an Orban ally and sharp critic of the EU.\n\"We intend to leave a mark,\" Mr Orban's spokesman Zoltan Kovacs said on July 4 before reports of the Moscow trip emerged.\n\"The prime minister is going to use the presidency in a political way.\" REUTERS", "url": "https://www.straitstimes.com/world/europe/hungarys-orban-says-in-no-position-to-negotiate-between-ukraine-and-russia"}