{"authors": [], "date_download": "2024-10-12 14:04:59", "date_modify": "2024-10-12 14:04:59", "date_publish": "2022-05-28 04:10:28", "description": "Karim Khan refuses to say whether President Vladimir Putin himself could one day be a suspect. Read more at straitstimes.com.", "filename": "world_europe_icc-prosecutor-urges-russia-to-cooperate-on-ukraine-probe_1728741899.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/05/28/2022-05-22T105318Z_1454647881_RC2ACU9389Z7_RTRMADP_3_DAVOS-MEETING-UKRAINE.JPG?VersionId=CVDAMRO2SqsKhADvUIYfFUm4Sg5jw.aZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_icc-prosecutor-urges-russia-to-cooperate-on-ukraine-probe_1728741899.html", "title": "ICC prosecutor urges Russia to cooperate on Ukraine probe", "title_page": "ICC prosecutor urges Russia to cooperate on Ukraine probe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "THE HAGUE (AFP) - Russia should cooperate with the International Criminal Court's investigation into alleged war crimes carried out during Moscow's invasion of Ukraine, the tribunal's prosecutor told AFP on Friday (May 27).\nProsecutor Karim Khan said Russia, which is not a member of the Hague-based court, had declined to work with the ICC on Ukraine but added that his \"door is open\" if it wants to help.\nThe British barrister also insisted that war crimes culprits could be brought to justice although he refused to say whether President Vladimir Putin himself could one day be a suspect.\n\"The invitation is there. My door is open, and I will also keep knocking on the door of the Russian Federation,\" Karim Khan said in an interview.\n\"If there are allegations that the Russian Federation have, if there's information that they have, if they are conducting their own investigations or prosecutions or have information that's relevant - share it with us.\"\nLike Russia, Ukraine is not an ICC member, but it has accepted the court's jurisdiction and is working with Khan's office as it probes possible war crimes and crimes against humanity.\nRussia says allegations of war crimes by its troops are fake, and Russian President Vladimir Putin justified the Feb 24 invasion by saying that Ukraine was overseeing a \"genocide\" in the east of the country.\n\"If one makes those allegations, cooperate, share the information, cooperate with us,\" said Khan.\n\"If there's been fake news, we will expose the fake news.\"\n'Battlefield but a crime scene'\nThe ICC was created in 2002 to try the world's worst crimes where states are unable or unwilling to. It does not have its own police force and so relies on individual countries to enforce any arrest warrants it issues.\nKhan - who took over as the ICC's third-ever prosecutor last year - announced an investigation four days after Russia's invasion and the probe has since been backed by 42 countries.\nHe later visited Bucha, a town outside Kyiv where AFP journalists discovered 20 bodies in civilian clothing lying in a street, and where officials later said hundreds of other people had been killed.\nUkraine's chief prosecutor has suggested that the ICC could deal with higher profile cases, but Khan said the ICC was still working with Ukraine and international partners on the best path.\nHe refused to give \"artificial timelines\" for when the ICC could bring any of its own indictments, saying it was a \"recipe for a disaster\".\nHe also insisted that the court was \"not here to target a particular country\" but wanted to \"get to the truth\".\nUkrainian troops have also faced war crimes allegations over a video in which Russian soldiers appeared to be shot in the legs.\n'Difficult to hide'\nMoscow's refusal to cooperate and the fact that it is not a member of the ICC have raised questions about how any eventual suspects could be brought to trial.\nBut Khan pointed to previous \"significant successes\" by international tribunals in bringing fugitives to justice, such as Slobodan Milosevic, Radovan Karadzic and Ratko Mladic over the wars in the former Yugoslavia, and suspects in the 1994 Rwandan genocide.\n\"In this day and age we know it's difficult to hide, it needs cooperation from states to ensure warrants are executed,\" said Khan.", "url": "https://www.straitstimes.com/world/europe/icc-prosecutor-urges-russia-to-cooperate-on-ukraine-probe"}