{"authors": ["Charissa Yong"], "date_download": "2024-10-12 14:03:52", "date_modify": "2024-10-12 14:03:52", "date_publish": "2022-10-28 08:50:21", "description": "The measures aim to not only cut off China’s access to top-end chips but also choke its ability to make them. Read more at straitstimes.com.", "filename": "world_united-states_more-countries-to-join-us-ban-on-chip-exports-to-china-says-us-official_1728741832.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/03/2022-10-20T061613Z2138487025RC2ZQS9OZ4Z3RTRMADP3USA-CHINA-CHIPS.JPG?VersionId=LeoOmEakAO0Q5NWZ6.QAlRSxyuo_K54N", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_more-countries-to-join-us-ban-on-chip-exports-to-china-says-us-official_1728741832.html", "title": "More countries to join US ban on chip exports to China, says US official", "title_page": "More countries to join US ban on chip exports to China, says US official | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON — The Biden administration said that other countries will soon join the United States in limiting China’s access to cutting-edge chips and chip-making equipment, a senior US official said on Thursday.\nWashington’s latest sanctions, announced on Oct 7, restricted exports of the most advanced chips, chipmaking tools and tool components made with American technology to China.\nTaken together, the measures aim to not only cut off China’s access to top-end chips but also choke its ability to make them, dealing a heavy blow to China’s ambitions to build its own chip industry.\nBut Washington was also criticised for going at it alone instead of bringing allies on board. Analysts raised concerns that China could bypass US restrictions and buy equipment from other countries, rendering the sanctions less effective.\nUndersecretary of Commerce for Industry and Security Alan Estevez said on Thursday that America’s allies had been consulted and knew about the export controls before they were announced.\n“They all know that we are expecting them to cover likewise. And we are working on those details with specific allies around the world,” he said at an event held by Washington-based think-tank Centre for a New American Security.\nAsked what it would take to get other key players, particularly Japan and the Netherlands, to follow suit, he replied: “We expect to have a deal done in the near term.”\nThe equipment needed to make advanced chips is supplied by a handful of companies from the US, Japan and the Netherlands, while most advanced chips are manufactured in Taiwan and South Korea.\nMr Estevez added that the deal could cover “the whole gamut” and include chips and tools.\nThe rule also bans the sale of high-end chips to China if they are made with US equipment or technology, even if they are not produced in America.\nMr Estevez said he stressed the threat that China posed not only to America’s national security, but that of other countries, when convincing them to join the US.\n“We shared that threat information with our allies,” he said, adding it was advantageous for some countries for the US to take the lead in confronting China.\n“In some regards, I think some of those countries like us to be ‘the bad guy’, versus them doing it,” he said. “Especially for countries in that neighbourhood, they understand the (China) threat.”\nMr Estevez also said there could be more export controls to come in other areas of technology, with quantum computing, biotechnology and artificial intelligence on his radar.\nBut, he added, his goal was to protect America’s national security and not wreak the “economic destruction of China”.\n“We are not looking at a decoupling. That is not what our focus is,” he said.", "url": "https://www.straitstimes.com/world/united-states/more-countries-to-join-us-ban-on-chip-exports-to-china-says-us-official"}