{"authors": [], "date_download": "2024-10-12 13:48:02", "date_modify": "2024-10-12 13:48:02", "date_publish": "2024-08-10 16:15:00", "description": "Sicilians have always known drought, but global warming is accentuating its frequency and intensity. Read more at straitstimes.com.", "filename": "world_europe_in-drought-hit-sicily-rainwater-is-dumped-in-the-sea_1728740882.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/10/AGRICULTURE-DROUGHT-WATER-083836.jpg?VersionId=K1PKSPgL0PZUOjCCymfRjEhOCkPQM_RS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_in-drought-hit-sicily-rainwater-is-dumped-in-the-sea_1728740882.html", "title": "Poor water management in drought-hit Sicily sees rainwater dumped in sea while crops wither", "title_page": "Poor water management in drought-hit Sicily sees rainwater dumped in sea while crops wither | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CAMPOBELLO DI MAZARA, Italy - Sicilian lemon producer Rosario Cognata is furious: His fruit is withering due to the drought, while just a few kilometres away, rainwater is being dumped into the sea.\nThe Trinita dam, built in 1959 in the town of Castelvetrano in the west of the Mediterranean island, has not been tested and therefore has never been officially approved for use.\nSo as soon as the reservoir fills up with winter rains, the authorities open the floodgates and the blue gold pours into a canal ending in the sea.\n“Okay, the drought is due to lack of rain. But we don’t know how to manage the water we have – and it’s not the farmers’ responsibility,” said Mr Cognata, as he looked into the dam, the low water level revealing rusting steel tubes.\nThe dam was intended to supply local irrigation networks, so farmers’ wells were closed by the authorities.\nBut the infrastructure not only never got the green light, but it was also subsequently neglected.\nThe pipes are now dilapidated, leaving some desperate farmers to dig illegal wells to compensate.\nMr Cognata blames decades of incompetent local and government water management.\n“They were never interested,” he said.\nIt is an accusation repeated often by Italy’s main agricultural organisation Coldiretti, to which Mr Cognata belongs.\nOutdated network\nSicilians have always known drought, but global warming is accentuating its frequency and intensity.\nThis year, rainfall is down by about 350mm compared with an average annual rainfall of 750mm, said hydrology professor Leonardo Valerio Noto.\nIn his office at the University of Palermo, he analyses satellite images of the island’s 46 artificial reservoirs.\n“Many of these reservoirs are already in a near-critical situation. Some are practically empty while others, particularly those serving large cities, are experiencing a significant decrease in resources,” he told AFP.\nThe summer of 2025 could be even worse, with withdrawals expected to be greater than rainfall.\nSome provinces, especially in the south, are seriously lacking in drinking water and cuts are recurrent.\nLike Mr Cognata, Prof Noto deplores the lack of public investment in maintaining the distribution network.\nItaly is the leading EU country in terms of absolute volumes of fresh water drawn from the surface or underground.\nBut “out of 100 litres injected into the distribution network, 42 are lost along the way” due to the poor condition of the pipes, Prof Noto said.\nAccording to the Italian National Institute of Statistics (Istat), the wasted water would meet the annual needs of 43 million people – or three out of four Italians.\nSardinia and Sicily are the worst performers, losing 52.8 per cent and 51.6 per cent of water, respectively.\nAccording to the Fondo Ambiente foundation, 60 per cent of the national network is over 30 years old, while 25 per cent is over 50 years old.\nAt the current rate of pipeline renewal – barely 4m per kilometre a year – it would take 250 years to replace them.\nYoung people are leaving\nThe Sicily region authorities told AFP it was responding to the drought “with the greatest determination, both for agriculture and for the population”.\nIt signed an action plan with the government in July worth €1.6 billion (S$2.3 billion), which includes the aim to “reduce water losses”.\nBut local water management issues have exasperated the crisis.\nAgrigento in southern Italy missed out on nearly €50 million in funding by failing to respond in time to a call for tenders, sparking protests earlier in August.\nOn his estate in Campobello di Mazara, which he runs with his father, Mr Cognata watches helplessly as his lemons rot and drop off “stressed” trees.\nThe fruit is yellow on the outside, brown on the inside: burned by the sun, when at this time of year it should still be green.\nMr Cognata estimates his losses at between 30 per cent and 40 per cent.\n“Without water, there is no life. It is very serious. Families risk their livelihood, young people prefer to leave and the countryside is emptying,” he said.\nDespite having one of the highest birth rates in Italy – an ageing country – Sicily has been one of the most rapidly depopulating regions in the last 10 years. AFP", "url": "https://www.straitstimes.com/world/europe/in-drought-hit-sicily-rainwater-is-dumped-in-the-sea"}