{"authors": ["Nirmala Ganapathy"], "date_download": "2024-10-12 13:45:55", "date_modify": "2024-10-12 13:45:55", "date_publish": "2023-09-23 23:25:08", "description": "Justin Trudeau has linked India to the murder of a Canadian Sikh separatist activist on Canadian soil. Read more at straitstimes.com.", "filename": "world_canada-india-ties-plunge-to-lowest-level-over-sikh-separatist-murder_1728740755.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/23/yuhardeepsingh2309.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_canada-india-ties-plunge-to-lowest-level-over-sikh-separatist-murder_1728740755.html", "title": "Canada, India ties plunge to lowest level over Sikh separatist murder", "title_page": "Canada, India ties plunge to lowest level over Sikh separatist murder | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Relations between Ottawa and New Delhi are at their lowest, following a charge by Canadian Prime Minister Justin Trudeau last Monday linking Indian government agents to the June murder of a Canadian Sikh separatist on Canadian soil.\nHere are some key dates in the Khalistan movement, which aims to create an independent homeland for Sikhs in India’s Punjab state.\n1970s and 1980s\nFor some two decades, Khalistan insurgents plant bombs on buses and carry out targeted killings, mass murder and gun battles, taking the lives of tens of thousands – many of whom are moderate Sikhs.\nOct 31, 1984\nThen Prime Minister Indira Gandhi is killed by two of her Sikh bodyguards, in revenge for Operation Blue Star. The assassination triggers a pogrom of Sikhs that kills 2,146 in Delhi alone, according to the Indian government, though the death toll is generally assumed to have been much higher.\nJune 23, 1985\nA bomb explodes mid-air on Air India Flight 182 from Montreal to London, killing all 329 people on board in Canada’s worst mass murder. On the same day, another bomb about to be loaded onto an Air India flight at Tokyo’s Narita International Airport prematurely explodes, killing two baggage handlers.\nAug 10, 1986\nGeneral Arun S. Vaidya, a much-decorated army general who commanded Operation Blue Star, is killed by gunmen while in his car in the western Indian city of Pune.\nAug 31, 1995\nThen Punjab Chief Minister Beant Singh is assassinated in a suicide bombing at a government building in state capital Chandigarh. The blast claims 17 other lives.\nJuly 14, 2022\nSikh activist Ripudaman Singh Malik, who had been acquitted in 2005 over the 1985 Air India Flight 182 explosion, is shot dead in British Columbia.\nMarch 19, 2023\nKhalistan supporters pull down the national flag at the Indian High Commission building in London to protest against the month-long police search for Khalistan separatist Amritpal Singh and his associates in Punjab. Khalistan supporters also breach the security barriers, plant Khalistan flags and try to burn down the consulate in San Francisco.\nApril 23, 2023\nAmritpal Singh, chief of Waris Punjab De, or Heirs of Punjab, is arrested after a month-long manhunt for fanning communal disharmony by demanding an independent Khalistan state.\nJune 18, 2023\nMr Hardeep Singh Nijjar, a Canadian citizen and Sikh separatist leader, is killed in Surrey, British Columbia.\nSept 18, 2023\nCanadian Prime Minister Justin Trudeau tells the House of Commons that the country is “actively pursuing credible allegations” linking Indian government agents to the murder of Mr Nijjar. New Delhi calls the accusation “absurd and motivated”. Ottawa expels an Indian diplomat over the case, and New Delhi retaliates by expelling a Canadian diplomat. New Delhi also asks Canada to reduce the number of diplomats in India.", "url": "https://www.straitstimes.com/world/canada-india-ties-plunge-to-lowest-level-over-sikh-separatist-murder"}