{"authors": [], "date_download": "2024-10-12 13:38:53", "date_modify": "2024-10-12 13:38:53", "date_publish": "2024-05-06 19:57:39", "description": "VIENNA - U.N. nuclear watchdog chief Rafael Grossi flew to Iran on Monday hoping to bolster his agency's oversight of Tehran's atomic activities after various setbacks, but analysts and diplomats say he has limited leverage and must be wary of empty promises. Read more at straitstimes.com.", "filename": "world_europe_iaea-chief-seeks-tougher-nuclear-checks-in-iran-with-limited-leverage_1728740333.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/06/GM5rPDKXAAAreMA.jpg?VersionId=xilmVd3MgF8OO_fHgowIynJPDwjutiWi&h=c690dc34", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_iaea-chief-seeks-tougher-nuclear-checks-in-iran-with-limited-leverage_1728740333.html", "title": "IAEA chief in Iran as concern grows over nuclear activity", "title_page": "IAEA chief in Iran as concern grows over nuclear activity | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VIENNA - UN atomic watchdog chief Rafael Grossi arrived in Iran on May 6, where he is expected to speak at a conference and meet officials for talks on Tehran’s nuclear programme.\nThe visit comes at a time of heightened regional tensions and with the International Atomic Energy Agency (IAEA) criticising Iran for lack of cooperation on inspections and other outstanding issues.\nNews agencies reported Mr Grossi’s arrival “at the head of a delegation to participate in the nuclear conference and negotiate with top nuclear and political officials of the country”.\nHe met Foreign Minister Hossein Amir-Abdollahian and is scheduled to meet Atomic Energy Organisation of Iran chief Mohammad Eslami.\nMr Grossi later said in a post on X, formerly Twitter, that at his meeting with the foreign minister he proposed “concrete practical measures” with the “aim of restoring process of confidence building and increasing transparency”.\nMr Grossi is also expected to deliver a speech at Iran’s first International Conference on Nuclear Science and Technology, which began on May 6.\nAt its opening ceremony, Mr Eslami expressed hopes of cooperation with the IAEA, saying this was “at the forefront of the Islamic republic of Iran’s policies”.\n“We hope that the agency can play its role as an independent international institution free from political pressures,” he added.\nThe three-day event is being held in Isfahan province, home to the Natanz uranium enrichment plant and where strikes attributed to Israel hit in April.\nMonitoring devices\nIAEA and Iranian officials reported “no damage” to nuclear facilities after the reported attack on Isfahan.\nThis was widely seen as Israel’s response to Iran’s first-ever direct attack on its arch-foe days earlier, which itself was retaliation for a deadly strike on Tehran’s Damascus consulate.\nOn May 1, Mr Eslami said he was “sure that these negotiations will further help clear ambiguities, and we will be able to strengthen our relations with the agency”.\nIran has in recent years deactivated IAEA monitoring devices at its nuclear facilities and barred inspectors, according to the UN agency.\nMr Grossi last visited in March 2023, and met top officials including President Ebrahim Raisi.\nIran has suspended its compliance with caps on nuclear activities set by a landmark 2015 deal with major powers after the US in 2018 unilaterally withdrew from the agreement and reimposed sweeping sanctions.\nTensions between Iran and the IAEA have repeatedly flared since the deal fell apart, and EU-mediated efforts have so far failed both to bring Washington back on board and to get Tehran to again comply with the terms of the accord.\nIn 2023, Iran slowed the pace of its uranium enrichment, which was seen as a goodwill gesture while informal talks began with the US.\nBut the Vienna-based UN nuclear agency said Iran accelerated the production of 60 per cent enriched uranium in late 2023.\nEnrichment levels of around 90 per cent are required for military use.\nUranium stockpile\nTehran has consistently denied wanting to develop nuclear weapons, insisting that its atomic activities are entirely peaceful.\nIn February, the IAEA said in a confidential report seen by AFP that Iran’s estimated stockpile of enriched uranium had reached 27 times the limit set out in the 2015 accord.\nOn May 5, the official IRNA news agency said Mr Grossi’s visit provided “an opportunity for the two sides to share their concerns”, especially regarding IAEA inspectors.\nIran in September withdrew the accreditation of several inspectors, a move the UN agency described at the time as “extreme and unjustified”.\nTehran said its decision was a consequence of “political abuses” by the US, France, Germany and Britain.\nMr Eslami has previously said the IAEA has “more than 130 inspectors” working in Iran.\nOn May 6, he insisted that the UN body carries out more inspections in Iran than in any other part of the world.\n“Our nuclear capacity is 3 per cent of the world and the (IAEA) inspection stands at 22 per cent,” he said.\n“This level of inspection of Iran’s nuclear facilities has not been carried out in any other country throughout history.” AFP", "url": "https://www.straitstimes.com/world/europe/iaea-chief-seeks-tougher-nuclear-checks-in-iran-with-limited-leverage"}