{"authors": [], "date_download": "2024-10-12 14:07:38", "date_modify": "2024-10-12 14:07:38", "date_publish": "2022-07-29 19:06:24", "description": "Exports could start in “the coming days”. Read more at straitstimes.com.", "filename": "world_europe_zelensky-oversees-loading-of-first-grain-export-ship-at-ukraine-port_1728742058.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/Qzegk6uZ9pJ61k851_y1vzwRNapc1lqxScancFzuwD4.jpg?VersionId=eDneEbeX9MhqErfW_D.2JInRpM2Fmrfe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_zelensky-oversees-loading-of-first-grain-export-ship-at-ukraine-port_1728742058.html", "title": "Zelensky oversees loading of first grain export ship at Ukraine port", "title_page": "Zelensky oversees loading of first grain export ship at Ukraine port | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (AFP) - President Volodymyr Zelensky has visited a port in southern Ukraine to oversee grain being loaded for export onto a Turkish ship, the presidency said Friday (July 29), following a deal with Russia brokered by the United Nations and Turkey.\n\"The first vessel, the first ship, is being loaded since the beginning of the war. This is a Turkish vessel,\" Mr Zelensky said, according to a statement from the presidency.\nVideo footage from the Chornomorsk port released by the presidency showed him in front of a ship called Polarnet.\nThe statement said exports could start in “the coming days” under the plan aimed at getting millions of tonnes of Ukrainian grain stranded by Russia’s naval blockade to world markets.\n“Our side is fully prepared. We sent all the signals to our partners – the UN and Turkey, and our military guarantees the security situation.\n“The minister of infrastructure is in direct contact with the Turkish side and the UN. We are waiting for a signal from them that we can start,” Mr Zelensky was quoted as saying.\nThe presidency said the export of grain will begin with several ships that were already loaded when Russia invaded in February but unable to set sail due to the start of the war.\nThe deal to lift Russia’s blockade – the first significant accord involving the two warring sides since the assault began – is aimed at helping mitigate a global food crisis that has seen prices soar in some of the world’s poorest nations.\nUkraine – one of the world’s top grain exporters before the war – says it aims to export some 20 million tonnes of produce, worth some US$10 billion (S$13.8 billion), under the plan.\n“It is important for us that Ukraine remains the guarantor of global food security,” Mr Zelensky, who was escorted by ambassador from the G-7 nations, said in the statement.", "url": "https://www.straitstimes.com/world/europe/zelensky-oversees-loading-of-first-grain-export-ship-at-ukraine-port"}