{"authors": [], "date_download": "2024-10-12 14:04:37", "date_modify": "2024-10-12 14:04:37", "date_publish": "2023-01-27 21:24:35", "description": "In Russia, distributing “false information” about the military carries a maximum sentence of 15 years. Read more at straitstimes.com.", "filename": "world_europe_russia-blocks-cia-fbi-websites-for-spreading-false-information_1728741877.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/28/svtyping270123.jpg?VersionId=dP7SClS6DNqF607Y2RODvtA7j26dXWsh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-blocks-cia-fbi-websites-for-spreading-false-information_1728741877.html", "title": "Russia blocks CIA, FBI websites for 'spreading false information'", "title_page": "Russia blocks CIA, FBI websites for 'spreading false information' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW - Russia’s communications regulator Roskomnadzor said on Friday it had blocked the websites of the CIA and FBI, accusing the two US government agencies of spreading false information, the Tass news agency reported.\n“Roskomnadzor has restricted access to a number of resources belonging to state structures of hostile countries for disseminating material aimed at destabilising the social and political situation in Russia,” Roskomnadzor said, in a statement carried by Russian news agencies.\nTass quoted Roskomnadzor as saying that the two US websites had published inaccurate material and information that had discredited the Russian armed forces.\n“This action by Russia’s authorities is unsurprising and accompanies existing bans on many other websites,” a State Department spokesman said in an email.\nRepresentatives for the FBI, CIA and Roskomnadzor did not immediately respond to a request for comment.\nCriminal offence\nRussia has made it a criminal offence to discredit its armed forces, a crime punishable by up to five years in jail, while knowingly distributing “false information” about the military carries a maximum sentence of 15 years.\nSince Russia sent tens of thousands of troops into Ukraine in February last year, Roskomnadzor has blocked a host of independent media outlets, some foreign news websites and social media platforms including Facebook, Instagram and Twitter.\nTop10VPN, a monitoring firm that has been tracking websites blocked in Russia since Moscow sent tens of thousands of troops into Ukraine on Feb 24 last year, said Roskomnadzor has blocked over 4,300 domains, with more than 85 per cent of those relating to Ukrainian, Russian and international news sites.\n“Russian censors have previously blocked a handful of Ukraine’s government websites but with the restrictions on the FBI and CIA websites, this is the first time they have prevented Russians from accessing other international government websites,” Mr Simon Migliano, head of research at Top10VPN.com, told Reuters.\n“Aside from the big social media platforms, only a handful of major US sites have been restricted, such as NPR, Google News and AOL, which makes the timing of these latest restrictions even more intriguing.”", "url": "https://www.straitstimes.com/world/europe/russia-blocks-cia-fbi-websites-for-spreading-false-information"}