{"authors": [], "date_download": "2024-10-12 13:49:56", "date_modify": "2024-10-12 13:49:56", "date_publish": "2024-09-08 10:30:00", "description": "The country remains in the throes of a political crisis. Read more at straitstimes.com.", "filename": "world_europe_the-end-of-olympic-escapism-for-gloomy-france_1728740996.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/08/FILES-OLY-PARIS-2024-HERITAGE-121048.jpg?VersionId=usjDyprZirocTGjwYb_EQAunOIp3qQYH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_the-end-of-olympic-escapism-for-gloomy-france_1728740996.html", "title": "The end of Olympic escapism for gloomy France", "title_page": "The end of Olympic escapism for gloomy France | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – The end of the widely hailed 2024 Paralympic Games in Paris this weekend will be greeted with pride and relief, as well as trepidation, in a country in the throes of a deep political crisis.\nAfter months of gloom and self-doubt in the run-up to the start of the Olympic Games on July 26, Paris and the country at large threw themselves into the spirit of the Games, embracing new national sporting heroes along the way.\nThe closing ceremony for the Paralympics on Sept 8, when the Olympic flame will be extinguished for a final time, will mark the end of six weeks of thrilling sport and almost flawless organisation that produced a sense of escapism from the country’s divisions and woes.\n“The idea is to finish with a huge party that will prevent the tears of those who might be saying to themselves, ‘Damn it, it’s all finished’,” chief organiser Tony Estanguet said ahead of a ceremony that will see the national stadium turn into a giant nightclub.\n“We’re going to have a party and then on Monday, maybe we’ll be disappointed because it really will be all over,” he added.\nMore than 20 top French DJs, from “French touch” legend Cassius to Martin Solveig, are set to close the Games, with a line-up overseen by 76-year-old French electronic music pioneer Jean-Michel Jarre.\n“I think that we will all feel a sense of joy, pride; the impression that something is ending that has enabled us to feel good together and to show to the world how we can enjoy ourselves,” Paris Mayor Anne Hidalgo told reporters on Sept 6.\n“I will fight against the idea that we have to move on from this enchanted period to resume our lives and our sad passions,” she added.\nPolitical instability\nShe was referring to the morose national mood before the Olympics, made worse by snap parliamentary elections called by President Emmanuel Macron that produced a hung Parliament in June.\nAfter more than 50 days without a permanent government, including the entire Olympic period, Mr Macron named a new prime minister on Sept 5, 73-year-old former minister and top European Union Brexit negotiator Michel Barnier.\nAnalysts say the country is set for a period of severe instability, with Mr Barnier’s grip on power seen as fragile and dependent on tacit support from the far-right National Rally party, which is the largest single party in the new National Assembly.\n“One of the positive aspects of the Games was that the political class respected the idea of an Olympic truce,” history and sports professor Paul Dietschy at the University of Franche-Comte in France, told AFP. “There wasn’t chaos, or demonstrations or strikes, and France’s image has ended up being boosted,” he said.\nOther non-events during the Olympics and Paralymics were also cause for celebration.\nFrench security forces helped keep the more than 10 million visitors safe, preventing a much-feared terror attack. The creaking Paris metro system performed efficiently, defying predictions of travel problems, while the city’s bus drivers, garbage collectors and municipal workers kept the city moving, clean and well-organised.\n“The state is powerful in France and things worked well,” Prof Dietschy added. “The success of the event has contradicted France’s pessimism and cynicism and the idea that everything is going badly and is badly organised.”\n‘Powerful emotions’\nAlthough Mayor Hidalgo hopes the city and France more broadly can bask in the afterglow of a national triumph, most observers see signs that the country is already moving on from its sports-inspired break from reality.\nMs Hidalgo’s controversial suggestion to retain the Olympic logo on the Eiffel Tower until the next edition in Los Angeles in 2028 has already divided Parisians and local lawmakers.\n“It will remain an interlude, moments of powerful emotions that were experienced at the time,” Mr Jean-Daniel Levy, a public opinion expert from polling company Harris Interactive, told AFP of the Olympic and Paralympic periods.\nAs with all previous Olympiads, organisers are hoping for legacy achievements, which have often proved hard to measure or fleeting in the past.\nIt remains to be seen whether a short-term spike in interest in sport results in a durable increase in physical activity.\nThe majority of the public investment linked to the Games has been targeted at regenerating the Seine-Saint-Denis suburb north-east of Paris, which is the mainland’s poorest and most crime-ridden area.\n“We’ll have to wait and see,” Prof Dietschy said.\nA public audit into the cost of the Games, as well as several criminal investigations into organising committee members, including one targeting the salary of Mr Estanguet, could also tarnish the image of the event as a national success story. AFP", "url": "https://www.straitstimes.com/world/europe/the-end-of-olympic-escapism-for-gloomy-france"}