{"authors": [], "date_download": "2024-10-12 13:40:45", "date_modify": "2024-10-12 13:40:45", "date_publish": "2024-07-27 11:17:00", "description": "The uncrewed spacecraft is currently 10 million km from Earth. Read more at straitstimes.com.", "filename": "world_europe_spacecraft-to-swing-by-earth-moon-on-path-to-jupiter_1728740445.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/27/FILES-FRANCE-SPACE-EUROPE-JUPITER-010811.jpg?VersionId=.JrjAZwylbLswy70XiiPwQdXosvU6RSM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_spacecraft-to-swing-by-earth-moon-on-path-to-jupiter_1728740445.html", "title": "Spacecraft to swing by Earth, Moon on path to Jupiter", "title_page": "Spacecraft to swing by Earth, Moon on path to Jupiter | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - A spacecraft launched in 2023 will slingshot back around Earth and the Moon in August in a high-stakes, world-first manoeuvre as it pinballs its way through the solar system to Jupiter.\nThe European Space Agency’s (ESA) Juice probe blasted off in April 2023 on a mission to discover whether Jupiter’s icy moons Ganymede, Callisto and Europa are capable of hosting extraterrestrial life in their vast, hidden oceans.\nThe uncrewed six-tonne spacecraft is currently 10 million kilometres from Earth.\nBut it will fly back past the Moon, then Earth on Aug 19-20, using their gravity boosts to save fuel on its winding, eight-year odyssey to Jupiter.\nStaff at the ESA’s space operations centre in Darmstadt, Germany, began preparing for the complicated manoeuvre this week.\nJuice is expected to arrive at Jupiter’s system in July 2031.\nIt will take the scenic route. Nasa’s Europa Clipper spacecraft is scheduled to launch this October yet beat Juice to Jupiter’s moons by a year.\nLong and winding road\nJuice is taking the long way round in part because the Ariane 5 rocket used to launch the mission was not powerful enough for a straight shot to Jupiter, which is roughly 800 million km away.\nWithout an enormous rocket, sending Juice straight to Jupiter would require 60 tonnes of onboard propellant – and Juice has just three tonnes, according to the ESA.\n“The only solution is to use gravitational assists,” Dr Arnaud Boutonnet, the ESA’s head of analysis for the mission, told AFP.\nBy flying close to planets, spacecraft can take advantage of their gravitational pull, which can change its course, speed it up or slow it down.\nMany other space missions have used planets for gravity boosts, but next month’s Earth-Moon flyby will be a “world first”, the ESA said.\nIt will be the first “double gravity assist manoeuvre” using boosts from two worlds in succession, the agency said.\nJuice will cross 750km above the Moon on Aug 19, before shooting past our home planet the following day.\nThe probe will leave Earth at a speed of “3.3km a second – instead of 3km if we had not added the Moon”, Dr Boutonnet said.\nAs Juice whizzes past Earth and the Moon, it will use the opportunity to snap photos and test out its many instruments.\nDown on Earth, some people will be taking photos right back. Some lucky amateur sky gazers, armed with telescopes or powerful binoculars, may even be able to spot Juice as it passes over South-east Asia.\n‘Plate of spaghetti’\nThe move has been carefully calculated for years, but it will be no walk in the park.\n“We are aiming for a mouse hole,” Dr Boutonnet emphasised.\nThe slightest error during its slingshot around the Moon would be amplified by Earth’s gravity, potentially creating a small risk that the spacecraft could enter and burn up in Earth’s atmosphere.\nThe team on the ground will be closely observing the spacecraft – and have 12-18 hours to calculate and adjust its trajectory if needed, Dr Boutonnet said.\nHe mostly feared a scenario in which the amount of course corrections needed would erase the gains from the double-world slingshot, meaning they would be “doing all this for nothing”.\nIf all goes well, Juice will head back out into interplanetary space – for a little while at least.\nIt will first head to Venus for another boost in 2025.\nJuice will even fly past Earth twice more – once in 2026, then a final time in 2029 before finally setting off towards Jupiter.\nThen comes the really tricky part.\nOnce Juice arrives at Jupiter, it will use a whopping 35 gravitational assists as it bounces around the planet’s ocean moons.\nDuring this phase, the probe’s trajectory looks like “a real plate of spaghetti”, Dr Boutonnet said.\n“What we’re doing with the Earth-Moon system is a joke in comparison,” he added. AFP", "url": "https://www.straitstimes.com/world/europe/spacecraft-to-swing-by-earth-moon-on-path-to-jupiter"}