{"authors": [], "date_download": "2024-10-12 14:01:10", "date_modify": "2024-10-12 14:01:10", "date_publish": "2024-04-23 00:01:50", "description": "There were no casualties because workers were in shelters. Read more at straitstimes.com.", "filename": "world_europe_tv-tower-collapses-in-ukraines-kharkiv-after-russian-missile-attack_1728741670.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/23/LYNXNPEK3L0NC-1.jpg?VersionId=IsEahAofK3fwhvgxnPyHM_qZjo6B26xH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_tv-tower-collapses-in-ukraines-kharkiv-after-russian-missile-attack_1728741670.html", "title": "TV tower collapses in Ukraine’s Kharkiv after Russian missile attack", "title_page": "TV tower collapses in Ukraine’s Kharkiv after Russian missile attack | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KHARKIV – The 240m television tower in Ukraine’s city of Kharkiv broke in half and fell to the ground on April 22, footage obtained by Reuters showed, after what local officials said was most likely a Russian missile attack on television infrastructure.\nThe broadcasting signal was disrupted to Ukraine’s second-largest city, which has been pounded by Russian missile and drone strikes in recent weeks.\n“At the moment there are interruptions to the digital television signal,” regional governor Oleh Syniehubov said.\nThere were no casualties because workers were in shelters, he added.\nFootage from the scene showed the main mast of the tower breaking off and falling down as a cloud of smoke rose into the sky.\nIt was not clear from the footage what had hit the mast, but Kharkiv prosecutors said Russia had most likely used a cruise Kh-59 missile in the attack.\nThe video was verified by corroborating video footage from another angle showing the same moment the top of the tower collapsed.\nRussia first attacked Kharkiv’s television tower several times in early March 2022, soon after Moscow launched its full-scale invasion. The signal was disrupted at the time.\nMoscow has recently stepped up its attacks, while Ukraine is suffering a shortage of air defence capabilities. Kharkiv and the surrounding region have experienced the most intense strikes. REUTERS", "url": "https://www.straitstimes.com/world/europe/tv-tower-collapses-in-ukraines-kharkiv-after-russian-missile-attack"}