{"authors": [], "date_download": "2024-10-12 14:11:21", "date_modify": "2024-10-12 14:11:21", "date_publish": "2024-08-28 22:48:33", "description": "Ukraine has relied heavily on the West for weapons and financial assistance to hold out against Russia. Read more at straitstimes.com.", "filename": "world_europe_ukraine-says-fear-of-escalation-among-allies-is-major-problem__gl=1_13ru6a2__gcl_au_MTQ1NjEwODM2LjE3MjMwNDE3MzI_1728742281.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/28/US-UKRAINE-DIPLOMACY-BLINKEN-KULEBA-172535.jpg?VersionId=tSVh4BNqAKcg_GOnQL3ERRnySFq0qpFl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-says-fear-of-escalation-among-allies-is-major-problem__gl=1_13ru6a2__gcl_au_MTQ1NjEwODM2LjE3MjMwNDE3MzI_1728742281.html", "title": "Ukraine says fear of escalation among allies is major problem", "title_page": "Ukraine says fear of escalation among allies is major problem | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine’s top diplomat said on Aug 28 that the biggest problem faced by Kyiv as it battles Russia is that its allies are afraid of approving new policies to support Ukraine out of a fear of escalation.\nThe remark by Foreign Minister Dmytro Kuleba came a day after Russia’s Foreign Minister said the West was “playing with fire” by considering allowing Kyiv to strike deep into Russia, and warned of the risks of World War III.\n“Ever since the beginning of the large-scale invasion, the biggest problem Ukraine has been facing is the domination of the concept of escalation in the decision-making processes among our partners,” Mr Kuleba said.\nMore than two and a half years since Russia’s full-scale invasion of Ukraine, Kyiv is pushing the West to give it the long-range weapons – and the authorisation – to strike targets deep inside Russian territory. It also wants help shooting down incoming missiles.\nMr Kuleba made the comment during a conversation with Polish Foreign Minister Radoslaw Sikorski that was broadcast live from Poland.\n“The war is always about a lot of hardware – money, weapons, resources – but the real problems are always here, in the heads,” he said.\n“Most of our partners are afraid of discussing the future of Russia... This is something that is very upsetting because if we do not speak about the future of the source of threat, then we cannot build strategy,” he said.\nUkraine has relied heavily on the West to supply it with weapons and hardware and financial assistance to hold out against Russia and fight back against Moscow’s troops.\nKyiv launched a major cross-border offensive into Russia’s Kursk region on Aug 6 in what Russian President Vladimir Putin has called a “massive provocation”.\nRussia’s full-scale invasion has killed thousands of civilians, destroyed cities and forced millions of people from their homes. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraine-says-fear-of-escalation-among-allies-is-major-problem?_gl=1*13ru6a2*_gcl_au*MTQ1NjEwODM2LjE3MjMwNDE3MzI."}