{"authors": [], "date_download": "2024-10-12 13:35:40", "date_modify": "2024-10-12 13:35:40", "date_publish": "2023-10-23 17:05:00", "description": "The Israeli military said on Monday it had struck more than 320 targets in Gaza. Read more at straitstimes.com.", "filename": "world_middle-east_israel-bombards-gaza-as-war-spreads-to-other-fronts_1728740140.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/23/LYNXMPEJ9M042-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_israel-bombards-gaza-as-war-spreads-to-other-fronts_1728740140.html", "title": "Israel bombards Gaza as war spreads to other fronts", "title_page": "Israel bombards Gaza as war spreads to other fronts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GAZA - Israel bombarded Gaza with more air strikes on Monday ahead of an anticipated ground operation into the besieged Palestinian enclave as the United Nations warned that civilians were running out of places to seek shelter.\nIn signs that the conflict was spreading, Israeli aircraft also struck southern Lebanon overnight and Israeli troops clashed with Palestinians in occupied West Bank, residents said.\nMore aid crossed the border into Gaza on Sunday, but the UN humanitarian agency said it was just a fraction of the amount needed to help a desperate population short of food, water, medicine and fuel.\nHealth authorities in Gaza said at least 4,600 people have died in Israel's two-week bombardment after an assault on Oct 7 by Hamas militants on southern Israeli communities in which 1,400 people were killed and 212 taken as hostages.\nThe Israeli military said on Monday morning that in the past 24 hours it had struck more than 320 targets in Gaza, including a tunnel housing Hamas fighters, and dozens of command and lookout posts.\nIt said in a statement that it destroyed sites \"liable to endanger the troops who are preparing on the Gaza periphery for a ground manoeuvre\" as well as dozens of mortar and anti-tank missile launcher positions.\nPalestinian media reported that the Israeli attacks concentrated on the Gaza Strip's centre and north.\nA strike on a house near the Jabalia refugee camp in northern Gaza killed several Palestinians and wounded others, according to media reports.\nGround assault awaited\nIsraeli troops and tanks are now massed on the Israeli-Gaza border, but how soon they might launch a ground invasion aimed at rooting out Hamas was not clear.\nAsked in an interview with Army Radio if Washington was pressuring Israel to hold off on that, Israel’s deputy ambassador to the US Eliav Benjamin said: “We and the US administration have been in dialogue from Day One.\n\"They understand that we are conducting the war in accordance with our interests. In the end of the day, we will do what we need to do when we need to do it.\"\nWide areas of Gaza have been flattened by the bombing campaign.\nThe UN humanitarian office (OCHA) said about 1.4 million of Gaza's 2.3 million population were now internally displaced, with many seeking refuge in overcrowded UN emergency shelters.\nIsrael has ordered Gaza residents to evacuate the north to avoid being caught up in the fighting. But OCHA said anecdotal evidence indicated that hundreds and possibly thousands of people who had fled were now returning to the north due to bombardments in the south and lack of shelter.\nFears that the Israel-Hamas war could mushroom into a wider Middle East conflict rose over the weekend with Washington warning of a significant risk to US interests in the region and announcing a new deployment of advanced air defences.\nAlong Israel's northern border with Lebanon, the Iran-backed Hezbollah group has clashed with Israeli forces in support of Hamas in the deadliest escalation of frontier violence since an Israel-Hezbollah war in 2006.\nSpreading violence\nEarly on Monday, Israeli aircraft struck two Hezbollah cells in Lebanon that were planning to launch anti-tank missiles and rockets toward Israel, its military said. Israel's military also said it struck other Hezbollah targets, including a compound and an observation post.\nHezbollah said on Monday one of its fighters was killed, without providing details. Israel's military said seven soldiers have been killed on the Lebanese border since the latest conflict began.\nIn the West Bank, two Palestinians were killed at the Jalazone refugee camp near Ramallah, the Palestinian health ministry said on Monday.\nResidents told Reuters that Israeli forces raided the camp and made many arrests as they clashed with gunmen and some youths who threw stones. The Israeli army has not issued a statement about the incident.\nChina's Middle East special envoy Zhai Jun, who is visiting the region, warned that the risk of a large-scale ground conflict was rising and that spillover conflicts in the region were \"worrisome\", Chinese state media said on Monday.\nIranian security officials told Reuters Iran's strategy was for Middle East proxies like Hezbollah to pursue limited strikes on Israeli and US targets, but to avoid a major escalation that would draw in Tehran.\nPalestinian Prime Minister Mohammad Shtayyeh called for international unity to stop Israel's attacks in Gaza and allow aid. A second convoy of 14 aid trucks entered the Rafah crossing from Egypt into Gaza on Sunday night.\nThe White House said US President Joe Biden and Israeli Prime Minister Benjamin Netanyahu affirmed in a call there would now be a continued flow of aid into Gaza.\nThe UN humanitarian office said the volume of aid entering so far was just 4 per cent of the daily average before the hostilities and a fraction of what was needed.\nThe aid shipments did not include fuel. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/israel-bombards-gaza-as-war-spreads-to-other-fronts"}