{"authors": [], "date_download": "2024-10-12 14:16:09", "date_modify": "2024-10-12 14:16:09", "date_publish": "2022-03-08 15:32:57", "description": "But officials say Russian forces violated ceasefire on another evacuation route from Mariupol. Read more at straitstimes.com.", "filename": "world_europe_humanitarian-corridor-set-to-allow-civilians-out-of-ukraines-sumy-says-deputy-pm_1728742569.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/Ncmedk5Lue0-16Bb6Ehb2GioGrgIgFURU4TfO5ZMFVA.jpg?VersionId=IQKQffEyJuuk8xfFRhAr.jSwKRZRtA3U", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_humanitarian-corridor-set-to-allow-civilians-out-of-ukraines-sumy-says-deputy-pm_1728742569.html", "title": "Thousands escape besieged Sumy in first Ukraine evacuation corridor agreed with Russia", "title_page": "Thousands escape besieged Sumy in first Ukraine evacuation corridor agreed with Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LVIV (REUTERS) - Ukrainians boarded buses to flee the besieged eastern city of Sumy on Tuesday (March 8), the first evacuation from a Ukrainian city through a humanitarian corridor agreed with Russia after several failed attempts in recent days.\nSumy governor Dmitro Zhivitskiy said in a video statement that the first buses had already departed Sumy for the city of Poltava, 175km to the south. He said priority would be given to the disabled, pregnant women and children in orphanages.\nA short video clip released by presidential adviser Kyrolo Tymoshenko showed a red bus with some civilians on board.\nA temporary ceasefire mostly held around Sumy, allowing civilians including around 1,000 foreign students to be evacuated through a humanitarian corridor, the regional governor said.\nConvoys of 20 to 30 private cars were leaving in waves, Governor Dmytro Zhyvytsky said in televised comments.\nThe first wave of vehicles that left the city met around 160 Russian military vehicles coming towards them but the incident ended peacefully when the civilian convoy stopped to let the Russian forces pass, he said.\nBut officials accused Russia of violating another humanitarian corridor from the southern port city of Mariupol.\n\"The enemy has launched an attack heading exactly at the humanitarian corridor,\" the Ukrainian defence ministry said on Facebook on Tuesday, adding the Russian army \"did not let children, women and elderly people leave the city\".\nMr Oleksiy Kuleba, governor of the Kyiv region, said more than 150 people had been evacuated from Irpin by 0730 GMT (3.30pm, Singapore time) on Tuesday.\nDeputy Prime Minister Iryna Vereshchuk said 30 buses are en route to the besieged city of Mariupol to collect evacuees via a humanitarian corridor to Ukraine-controlled territory.\nThere were signs Russian forces were firing in the direction of one of the corridor routes for humanitarian aid, she said without providing further details.\nPresident Volodymyr Zelensky on Tuesday denounced what he called unkept “promises” by the West to protect Ukraine from Russian attacks.\n“It’s been 13 days we’ve been hearing promises, 13 days we’ve been told we’ll be helped in the air, that there will be planes, that they will be delivered to us,” he said on a video broadcast on Telegram.\n“But the responsibility for that rests also on those who were not capable to take a decision in the West for 13 days,” Mr Zelensky added. “On those who have not secured the Ukrainian skies from the Russian assassins.”\nRussia’s Interfax news agency said Moscow was opening corridors on Tuesday to allow people to leave five Ukrainian cities: Cherhihiv, Kharkiv, Mariupol and the capital Kyiv, as well as Sumy. There was no immediate comment from the Ukrainian side on evacuations from cities apart from Sumy.\nRussian and Ukrainian officials had agreed on similar corridors to evacuate residents from the besieged port of Mariupol in the south on Saturday and Sunday, but both those attempts failed, with each side accusing the other of continuing to fire.\nMoscow describes its actions in Ukraine as a “special operation” to disarm its neighbour and arrest leaders it calls “neo-Nazis”. Ukraine and its Western allies call this a baseless pretext for an invasion to conquer a country of 44 million people.\nRussia’s invasion, the biggest attack on a European state since World War Two, has sent 1.7 million refugees fleeing to other countries. Western sanctions have cut off Russia from international trade to a degree never before imposed on such a big economy.\nRussia is the world’s leading exporter of oil and gas, and both Russia and Ukraine are major suppliers of grain and metals, creating concern that the conflict could cause massive supply disruptions and derail the global recovery from the coronavirus pandemic.\nUkraine said the pace of Russia’s advances had slowed on Tuesday. Its defence ministry said Russian Major-General Vitaly Gerasimov, first deputy commander of Russia’s 41st army, had been killed on Monday, the second Russian major-general killed since the invasion began. Russia’s defence ministry could not be immediately reached for comment and Reuters could not verify the reports.\nNegotiations have so far focused mainly on allowing safe passage for civilians to escape bombardment from cities that came under Russian siege. Sumy in the east and Mariupol in the south have been among the hardest hit by Russia’s assault.\nRussia had said it would require those fleeing from Kyiv or Kharkiv to go to Russia itself or its ally Belarus, conditions rejected by Ukraine. Those leaving Sumy or Mariupol would be permitted to go to other parts of Ukraine.\nWestern countries say Russia’s initial battle plan for a rapid strike to topple the Kyiv government failed in the early days of the war, and Moscow has adjusted its tactics for longer sieges of cities.\nThe main assault force heading towards Kyiv has been stuck on a road north of the capital, an armoured column stretching for miles. To the south, Russia has made more progress along the Black and Azov Sea coasts.\nFears of an energy war between Russia and the West have grown this week, after the United States pushed its allies to ban Russian oil imports. Sanctions so far have made an exception for Russian energy exports.\nUS President Joe Biden held a video conference call with the leaders of France, Germany and Britain on Monday. The US is not a major buyer of Russian energy, but Russia supplies 40 per cent of Europe’s gas, and European allies have indicated so far that they are not in a position to halt Russian energy supplies.\nRussian Deputy Prime Minister Alexander Novak said on Monday that Russia could halt gas deliveries to Germany in retaliation for Berlin suspending a new pipeline. Oil prices could more than double to US$300 (S$409) a barrel if the US and its allies banned imports of Russian oil, he said.\nA senior US defence official said President Vladimir Putin had now deployed nearly 100 per cent of the more than 150,000 troops that he had pre-staged outside Ukraine before the invasion.\nFollow The Straits Times' live coverage on the Ukraine crisis here.", "url": "https://www.straitstimes.com/world/europe/humanitarian-corridor-set-to-allow-civilians-out-of-ukraines-sumy-says-deputy-pm"}