{"authors": [], "date_download": "2024-10-12 13:36:01", "date_modify": "2024-10-12 13:36:01", "date_publish": "2024-06-26 03:32:49", "description": "As of June 25, 8,332 pallets of aid had been delivered to residents of Gaza via the pier. Read more at straitstimes.com.", "filename": "world_middle-east_on-gaza-pier-us-troops-confront-waves-destruction-and-aid-backlog_1728740161.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/LYNXMPEK5O0US-1.jpg?VersionId=CejwMkfOQADDfAs8UhhCW5kJE7vA3wrm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_on-gaza-pier-us-troops-confront-waves-destruction-and-aid-backlog_1728740161.html", "title": "On Gaza pier, US troops confront waves, destruction and aid backlog", "title_page": "On Gaza pier, US troops confront waves, destruction and aid backlog | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "US PIER OFF GAZA COAST - Baking under the summer sun, US troops find shelter in containers stationed on what is known as the “parking lot” of a floating pier in the Mediterranean Sea that aims to boost the delivery of humanitarian aid to the Gaza Strip.\nJust over the horizon, destroyed buildings and thick black smoke can be seen rising in the enclave of 2.3 million people, more than eight months into a war between Israel and Palestinian militants Hamas.\nReuters was given rare access to the pier on June 25 and saw aid pallets being moved from a vessel onto the 370m-long pier as it bobbed around with the incoming waves. The pallets were then taken by trucks to the coast.\nFor US Army Sergeant Ibrahim Barry, who is a forklift operator on the pier, the operation is personal. Sgt Barry, who is Muslim, was in the US when war broke out and watched as families in Gaza during Ramadan in March and April had no food with which to break their fast.\n“Being in this mission (is) on a personal level for me,” he said. “Helping to help them get food... just taking care of people.”\nUS President Joe Biden announced in March the plan to put the pier in place for aid deliveries as famine loomed in Gaza. As of June 25, 8,332 pallets had been delivered via the pier.\nBut nearly 6,900 pallets of those have just been sitting on Gaza’s coast, in a marshalling area, waiting to be picked up by the United Nations for distribution. The World Food Programme paused deliveries earlier this month over security concerns.\nFor many troops working on pier operations, this is their first combat zone. Not for Captain Joel Stewart, commander of Naval Beach group 1.\n“War is a terrible thing. I don’t care where it is. I don’t care what it is. It is destruction. It is never pretty. It is certainly not something that I ever want to see again,” he said while standing on the pier.\n“The sailors, marines, merchant men, soldiers are all behind this mission because they see they are making a difference for the people of Gaza.”\nThe pier’s usage has been paused multiple times because of sea conditions and at one point was towed to the Israeli port of Ashdod for repairs.\nA senior US official said on June 25 the pier may be extended well beyond its July 31 authorisation date if the United States and aid organisations can get aid flowing again to Palestinians in the coming days and weeks.\nThe humanitarian crisis started on Oct 7 when Palestinian militant group Hamas invaded Israel and killed about 1,200 people, mostly civilians. They took around 250 hostages back to Gaza. More than 100 were released during a truce in November, but Israeli tallies estimate that there are 116 hostages left, though 40 are believed to have died.\nIsrael’s retaliatory attack in Gaza has killed more than 37,000 people, according to the Gaza Health Ministry. Much of the enclave as been destroyed, with malnutrition and the risk of disease widespread. REUTERS", "url": "https://www.straitstimes.com/world/middle-east/on-gaza-pier-us-troops-confront-waves-destruction-and-aid-backlog"}