{"authors": [], "date_download": "2024-10-12 14:01:31", "date_modify": "2024-10-12 14:01:31", "date_publish": "2023-03-23 21:27:49", "description": "Singaporean CEO's testimony before Congress does little to assuage US worries. Read more at straitstimes.com.", "filename": "world_united-states_tiktok-ceo-to-face-tough-questions-amid-calls-for-us-ban_1728741691.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/2-9WRP6VFEB6naSkXqxT2UYQGvyygG08fXJKN3oITtk.jpg?VersionId=WLq3tLVHNwLtXQR_EHfKRkTnTw72Cw8N", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_tiktok-ceo-to-face-tough-questions-amid-calls-for-us-ban_1728741691.html", "title": "TikTok attacked for China ties as US lawmakers push for ban", "title_page": "TikTok attacked for China ties as US lawmakers push for ban | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - US lawmakers on Thursday battered TikTok’s Singaporean chief executive about potential Chinese influence over the platform and said its short videos were damaging children’s mental health, reflecting bipartisan concerns over the app’s power over Americans.\nCEO Chew Shou Zi’s testimony before Congress did little to assuage US worries over TikTok’s China-based parent company, ByteDance, and added fresh momentum to lawmakers’ calls to ban the platform nationwide.\nOver five hours of testimony, Mr Chew repeatedly denied the app shares data or has connections with the Chinese Communist Party and argued the platform was doing everything to ensure safety for its 150 million American users.\nMr Chew said TikTok for more than two years has been “building what amounts to a firewall to seal off protected US user data from unauthorised foreign access”.\n“The bottom line is this: American data stored on American soil, by an American company, overseen by American personnel,” Mr Chew said.\nBut not a single lawmaker offered support for TikTok or sympathy for Mr Chew’s reassurances, as they deemed his answers on China evasive and aired concerns over the power the app holds over US children.\nOthers accused TikTok of promoting content that encourages eating disorders among children, illegal drug sales and sexual exploitation.\n“TikTok could be designed to minimise the harm to kids, but a decision was made to aggressively addict kids in the name of profits,” said Representative Kathy Castor, a Democrat, at the House of Representatives Energy and Commerce committee hearing.\nMr Chew responded to many pointed questions by saying the issues were “complex” and not unique to TikTok.\nThe company says it has spent more than US$1.5 billion (S$1.9 billion) on data security efforts under the name “Project Texas” which currently has nearly 1,500 full-time employees and is contracted with Oracle to store TikTok’s US user data.\nBut critics were not appeased as the company failed to announce any new efforts to safeguard privacy.\nMr Chew, who began his testimony by referring to his Singaporean roots, said: “We do not promote or remove content at the request of the Chinese government.”\nHe added: “It is our commitment to this committee and all our users that we will keep (TikTok) free from any manipulation by any government.”\nHe said the app strictly screens content that could harm children.\nIt is not clear how lawmakers will proceed after the hearing or how quickly they might move to pass legislation to strengthen the Biden administration’s legal powers to ban TikTok.\n‘Not about the ownership’\nSome 20 US senators - 10 Democrats and 10 Republicans - have backed bipartisan legislation giving President Joe Biden’s administration a path to ban TikTok, and the app’s fate has added a new element to tensions between Washington and Beijing.\nTikTok last week said the Biden administration demanded its Chinese owners divest their stakes or face a potential ban.\nWhen asked about a potential divestiture, Mr Chew said the issue was “not about the ownership” and argued US concerns could be addressed by moving data to its US storage centres.\nChina’s commerce ministry said that forcing TikTok’s sale “will seriously damage the confidence of investors from all over the world, including China, to invest in the United States”, and that China would oppose any sale. Some lawmakers cited China’s comments to reject TikTok’s contention that it is separate from the Chinese government.\nAt Thursday’s House hearing, Representative Neal Dunn asked Mr Chew if ByteDance has spied on Americans at Beijing’s request. Mr Chew answered, “No.”\nRepublican Mr Dunn then asked about US media reports that a China-based team at ByteDance planned to use TikTok to monitor the location of specific US citizens, and repeated his question about whether ByteDance was spying.\n“I don’t think that spying is the right way to describe it,” Mr Chew said. He went on to describe the reports as involving an “internal investigation”, but was cut off by Mr Dunn, who called TikTok’s widespread use “a cancer”.\nShares of US social media companies that compete with TikTok for advertising rose on Thursday, with Facebook parent Meta Platforms up 1.8 per cent and Snap up 2.8 per cent.\nWedbush analyst Dan Ives on Twitter he would characterise Mr Chew’s testimony “as a ‘mini disaster’ for this key moment for TikTok. TikTok is now poster child of the US/China tensions and lawmakers have a lot of q’s with not enough concrete answers”.\n‘Save our children’\nDemocratic lawmaker Tony Cardenas said Mr Chew was a “good dancer with words” and accused him of avoiding tough questions on evidence that the app has harmed children’s mental health.\nMr Chew said the company was investing in content moderation and artificial intelligence to limit such content.\nRepresentative Diana DeGette, a Democrat, said TikTok’s efforts to prevent the spread of misinformation on the platform were not working.\n“You gave me only generalised statements that you’re investing, that you’re concerned, that you’re doing work. That’s not enough for me. That’s not enough for the parents of America,” Ms DeGette said.\nRepresentative Gus Bilirakis showed the committee a collection of short TikTok videos that appeared to glorify self-harm and suicide, or outright tell viewers to kill themselves.\n“Your technology is literally leading to death,” Mr Bilirakis said. “We must save our children from big tech companies like yours, who continue to abuse and manipulate them for your own gain.”\nMr Chew told Mr Bilirakis that TikTok takes the issue of suicide and self-harm “very, very seriously”. REUTERS", "url": "https://www.straitstimes.com/world/united-states/tiktok-ceo-to-face-tough-questions-amid-calls-for-us-ban"}