{"authors": [], "date_download": "2024-10-12 13:27:39", "date_modify": "2024-10-12 13:27:39", "date_publish": "2024-08-20 17:12:12", "description": "He said the authorities know how to control the spread of the virus. Read more at straitstimes.com.", "filename": "world_europe_mpox-is-not-the-new-covid-says-who-official_1728739659.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/LYNXMPEK7J09Q-3.jpg?VersionId=XhSLQmdaFFur6hWTW8XcDrZaE476UMiO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_mpox-is-not-the-new-covid-says-who-official_1728739659.html", "title": "Mpox is not the new Covid-19, says WHO", "title_page": "Mpox is not the new Covid-19, says WHO | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN – The mpox outbreak is not another Covid-19, the World Health Organisation (WHO) said on Aug 20, because much is already known about the virus and the means to control it.\nWhile more research is needed on the Clade 1b strain that triggered the WHO into declaring a public health emergency of international concern (PHEIC), the spread of mpox can be reined in, the WHO’s European director Hans Kluge said.\nIn July 2022, the WHO declared a PHEIC over the international outbreak of the less severe Clade 2b strain of mpox, which mostly affected gay and bisexual men. The alarm was lifted in May 2023.\n“Mpox is not the new Covid,” Dr Kluge insisted.\n“We know how to control mpox and, in the European region, the steps needed to eliminate its transmission altogether,” he said during a media briefing in Geneva via a video-link.\n“Two years ago, we controlled mpox in Europe, thanks to the direct engagement with the most affected communities,” he said. “We put in place robust surveillance. We thoroughly investigated new cases contacts, and we provided sound public health advice.”\n“Behaviour change, non-discriminatory public health action, and mpox vaccination contributed to controlling the outbreak.” said Dr Kluge\nHe said the risk to the general population was low.\n“Are we going to go in lockdown in the WHO European region? Is it another Covid-19? The answer is clearly, ‘No’,” he said.\nDr Kluge said the predominant route of transmission remained close skin-to-skin contact.\nBut he said it was possible that someone in the acute phase of mpox infection, especially with blisters in the mouth, may transmit the virus to close contacts by droplets, in circumstances such as in the home or in hospitals.\n“The modes of transmission are still a bit unclear. More research is required,” he said.\nWHO spokesman Tarik Jasarevic said the WHO was not recommending the use of masks.\n“We are not recommending mass vaccination. We are recommending to use vaccines in outbreak settings for the groups who are most at risk,” he added.\nThe WHO declared an international health emergency on Aug 14, concerned by the rise in cases of Clade 1b in the Democratic Republic of Congo and its spread to nearby countries.\nA case of the variant was confirmed last week in Sweden and linked to a growing outbreak in Africa.\nMpox transmits through close physical contact, including sexual contact, but unlike previous global pandemics such as the Covid-19 one, there is no evidence it spreads easily through the air. REUTERS", "url": "https://www.straitstimes.com/world/europe/mpox-is-not-the-new-covid-says-who-official"}