{"authors": [], "date_download": "2024-10-12 14:08:43", "date_modify": "2024-10-12 14:08:43", "date_publish": "2023-03-17 12:29:48", "description": "He is contending that the Malaysian government already seized funds from 11 accounts held by his family. Read more at straitstimes.com.", "filename": "world_united-states_i-don-t-have-funds-to-pay-47m-ex-goldman-banker-roger-ng-tells-us-court-over-1mdb-case_1728742123.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/17/2023-03-09T194721Z1034526789RC2JQZ93R1BNRTRMADP3GOLDMAN-SACHS-1MDB_0.JPG?VersionId=g_QZ5fTnH9CIm5Ji5appguDqqU5gw0zj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_i-don-t-have-funds-to-pay-47m-ex-goldman-banker-roger-ng-tells-us-court-over-1mdb-case_1728742123.html", "title": "I don’t have funds to pay $47m, ex-Goldman banker Roger Ng tells US court over 1MDB case", "title_page": "I don’t have funds to pay $47m, ex-Goldman banker Roger Ng tells US court over 1MDB case | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Former Goldman Sachs Group banker Roger Ng, who was sentenced to 10 years in prison last week for his role in the 1MDB fraud, is claiming he cannot meet United States prosecutors’ demand that he also pay US$35 million (S$47 million) because the Malaysian government already took all of his money.\nFederal prosecutors had asked US District Judge Margo Brodie in Brooklyn, New York, to order Ng to forfeit that amount as ill-gotten gains from the conspiracy to loot the Malaysian sovereign wealth fund at his March 9 sentencing.\nNg’s lawyer Marc Agnifilo argued that no other penalties were needed and that his client had no funds in any case.\nJudge Brodie did not rule on the forfeiture issue last week.\nIn an order late on Wednesday, the judge directed both sides to submit arguments on whether the amount sought by prosecutors violated the Eighth Amendment, which prohibits excessive fines along with cruel and unusual punishment.\nNg, 51, contends that the Malaysian government already seized more than US$35 million from 11 accounts held by his family.\nIn a Monday court filing, Mr Agnifilo stressed that the seizure was intended as punishment rather than restitution.\n“The police officials of Malaysia were very clear that the police wanted all of the money in the different accounts; not just the return of those funds it had formally traced to 1MDB,” Mr Agnifilo wrote.\nThough Mr Agnifilo said there were other grounds to deny the US forfeiture demand, he also said it violated the Eighth Amendment.\nJudge Brodie said on Wednesday that she believed that forfeiture was “statutorily required” for the crimes of which Ng was convicted, but wanted both sides to address Ng’s argument that the US$35 million demand was “grossly disproportionate”.\nNg was found guilty in April of conspiring to violate US anti-bribery laws and launder money.\nHis former Goldman boss and 1MDB co-conspirator Tim Leissner previously pleaded guilty and was the government’s star witness against Ng.\nLeissner, who is scheduled to be sentenced on Sept 6, was ordered earlier in March to forfeit US$43.7 million in cash as well as 3.3 million shares in fitness drink company Celsius Holdings. BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/i-don-t-have-funds-to-pay-47m-ex-goldman-banker-roger-ng-tells-us-court-over-1mdb-case"}