{"authors": [], "date_download": "2024-10-12 14:06:07", "date_modify": "2024-10-12 14:06:07", "date_publish": "2023-12-21 19:20:24", "description": "Prime Minister Giorgia Meloni's party and a key ally voted in a parliamentary commission on Thursday to oppose ratification of a long-waited reform of the euro zone bailout fund, lawmakers said. Read more at straitstimes.com.", "filename": "world_europe_italian-coalition-parties-vote-against-esm-reform-in-partl-committee_1728741967.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/21/LYNXMPEJBK0BZ-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_italian-coalition-parties-vote-against-esm-reform-in-partl-committee_1728741967.html", "title": "Italian coalition parties vote against ESM reform in parliamentary committee", "title_page": "Italian coalition parties vote against ESM reform in parliamentary committee | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME - Prime Minister Giorgia Meloni's party and a key ally voted in a parliamentary commission on Thursday to oppose ratification of a long-waited reform of the euro zone bailout fund, lawmakers said.\nThe vote is non-binding, however Thursday's motion underscores deep hostility to the overhaul of the so-called European Stability Mechanism (ESM), suggesting eventual parliamentary approval cannot be taken for granted.\nItaly is the only country dragging its feet over the 2021 treaty due to concerns it could trigger a restructuring of its huge public debt.\nThe European Stability Mechanism (ESM) can offer a lifeline to euro zone governments cut off from markets, or lend to recapitalise banks and provide precautionary credit.\nThe original ESM pact remains operational, but it cannot support the Single Resolution Fund, responsible for dealing with ailing banks, without Rome signing up to the pact.\nIn its motion on Thursday, the budget committee said Italy should not back the ratification on the grounds the reform does not have a clause that would guarantee the involvement of parliament in any eventual request for help.\nA plenary vote on the issue is scheduled to take place later in the day in the full lower house.\nMeloni has repeatedly criticised the ESM for requiring countries to implement austerity or financial reform programmes in return for its help, saying this would increase the risk of a debt restructuring.\nThe ruling coalition split on the committee vote. A motion to oppose the reform was backed by Meloni's Brothers of Italy party and Matteo Salvini's League, while the more moderate Forza Italia party abstained.\nThe ESM vote came the day after EU member-states clinched a deal on more lenient fiscal rules, which Italy welcomed as positive after months of tough negotiation with its partners.\nThe Italian government indicated earlier this month that it would not approve the ESM treaty unless there was first an accord on the bloc's Stability and Growth pact. REUTERS", "url": "https://www.straitstimes.com/world/europe/italian-coalition-parties-vote-against-esm-reform-in-partl-committee"}