{"authors": [], "date_download": "2024-10-12 13:58:16", "date_modify": "2024-10-12 13:58:16", "date_publish": "2024-05-01 06:15:54", "description": "Ukrainian President Volodymyr Zelenskiy's chief of staff thanked a Vatican envoy on Tuesday for his efforts in trying to bring home thousands of children forcibly taken to Russia and asked him for help in returning prisoners of war. Read more at straitstimes.com.", "filename": "world_europe_ukrainian-official-discusses-taken-children-with-vatican-envoy_1728741496.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/01/LYNXMPEK3T0XH-1.jpg?VersionId=cPCFR6CvPw82pdIvYOpl_UynK9jp7eD0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukrainian-official-discusses-taken-children-with-vatican-envoy_1728741496.html", "title": "Ukrainian official discusses taken children with Vatican envoy", "title_page": "Ukrainian official discusses taken children with Vatican envoy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Ukrainian President Volodymyr Zelenskiy's chief of staff thanked a Vatican envoy on Tuesday for his efforts in trying to bring home thousands of children forcibly taken to Russia and asked him for help in returning prisoners of war.\nCardinal Matteo Zuppi has visited both Russia and Ukraine on a mission mandated by Pope Francis to try to help end the war in Ukraine, now more than two years old.\nHe said after the visits that his talks focused mainly on humanitarian issues rather than a specific peace plan. He also visited China to facilitate prospects for peace.\nPresidential chief of staff Andriy Yermak, quoted on Zelenskiy's website, told Zuppi by telephone that Ukraine had devoted considerable diplomatic efforts to securing the return of children taken to Russia.\n\"You are continuing to work on this matter. Thank you,\" Yermak was quoted as saying. \"This process is proceeding slowly, but it is still moving ahead.\"\nUkrainian Ombudsman Dmytro Lubinets last week handed to Qatar, which has acted as an intermediary, a list of 561 Ukrainian children whose return Kyiv was seeking from Russia.\nOfficial Ukrainian estimates say more than 19,000 Ukrainian children have been taken away to Russia. The International Criminal Court has issued an arrest warrant Russian President Vladimir Putin in connection with the illegal transfer of children.\nThe presidential website said Yermak \"also asked to help Ukraine in freeing servicemen, including military medical personnel. During the conversation, they discussed how to speed up this process of and organise an exchange ahead of (Orthodox) Easter.\"\nOrthodox Christians, who make up a majority of Ukrainian believers, celebrate Easter this coming Sunday, May 5.\nUkraine's relations with the Vatican have gone through a period of strain in recent months, particularly over Pope Francis' suggestion in an interview that Ukraine should have the \"courage\" to negotiate an end to the war with Russia. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukrainian-official-discusses-taken-children-with-vatican-envoy"}