{"authors": [], "date_download": "2024-10-12 14:02:38", "date_modify": "2024-10-12 14:02:38", "date_publish": "2023-01-26 07:01:32", "description": "The move came hours before US President Joe Biden announced that the US will send M1 Abrams tanks to Ukraine. Read more at straitstimes.com.", "filename": "world_europe_germany-confirms-it-will-send-leopard-tanks-to-ukraine_1728741758.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/31/GERMANY-UKRAINE-RUSSIA-CONFLICT-TANKS-191730.jpg?VersionId=IA25BirBslGm1J7cK_x.UOxdhb5nJuE.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_germany-confirms-it-will-send-leopard-tanks-to-ukraine_1728741758.html", "title": "Germany confirms it will send Leopard tanks to Ukraine", "title_page": "Germany confirms it will send Leopard tanks to Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - Chancellor Olaf Scholz announced on Wednesday that Germany would send an initial shipment of 14 Leopard 2 tanks to Ukraine and allow other nations to send their own, relenting after weeks of domestic and international pressure to deliver armoured vehicles aimed at helping Kyiv regain territory seized by Russia.\nThe move came hours before President Joe Biden announced that the United States will send M1 Abrams tanks to Ukraine, appearing to assuage Mr Scholz’s reluctance to send tanks without Washington also doing so.\nBerlin’s decision to send the German-made Leopard 2s follows Britain’s announcement this month that it would send 14 of its Challenger 2 tanks to Ukraine, and is a significant step in Western allies’ supply of ever heavier weapons to Kyiv.\nWhile the pledges so far fall short of the 300 tanks that Ukraine has said it needs to make a difference against Russian forces on the battlefield, Germany’s announcement immediately prompted officials in Finland, the Netherlands and Spain to say they would seek to send tanks to Ukraine, or were open to doing so.\nUkraine’s pleas for more advanced weapons have taken on added urgency in recent weeks as Russia prepares for a possible new offensive, and as Ukrainian forces are locked in a withering battle of attrition against Russian troops in the east.\nOn Wednesday, Ukraine’s military acknowledged that it had retreated from Soledar, a small salt-mining town near Bakhmut, a strategic eastern city that Russian forces have been fighting to capture in months of brutal trench warfare and artillery battles.\nThe first tanks could take several months to arrive on the battlefield, but Germany’s decision to authorise other nations to transfer their own Leopards – which are widely distributed in more than a dozen other European countries – could eventually help Ukrainian forces dent Russia’s advantage in troop numbers and equipment. Poland said on Tuesday that it had sought Germany’s permission to send Leopard tanks from its own stocks.\n“We’re talking about very effective weapons systems here, and it’s proper that we never provide those weapons systems alone, but always in close cooperation,” Mr Scholz told lawmakers in Germany’s Parliament.\nUkraine’s allies have sought to strengthen its military without prompting Russia to further escalate the war, and some leaders had worried that battle tanks might cross that line.\nMr Scholz defended the time he took making the decision. “We always have to make it very clear in everything we do that we are doing what is necessary and what is possible to support Ukraine,” he said. “But at the same time we are preventing the war from escalating into a war between Russia and Nato.”\nThe German government said that it would send 14 Leopard 2 A6 tanks directly from its army stock. It said it would send another similarly sized group in a second step, but did not say when, or specify where they would come from.\nThe Leopard 2, first introduced in 1979, is used by 13 European armies, according to the European Council on Foreign Relations, and together these militaries have an estimated 2,000 vehicles.\nIt is one of the world’s leading battle tanks and would offer a big step forward in capability for Ukraine, which has been using Soviet-era tanks. NYTIMES", "url": "https://www.straitstimes.com/world/europe/germany-confirms-it-will-send-leopard-tanks-to-ukraine"}