{"authors": [], "date_download": "2024-10-12 14:18:40", "date_modify": "2024-10-12 14:18:40", "date_publish": "2023-12-15 05:53:12", "description": "A 12th round of measures targets diamond exports and better enforces an oil price cap. Read more at straitstimes.com.", "filename": "world_europe_eu-agrees-fresh-round-of-sanctions-on-russia_1728742720.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/15/2023-12-14T132900Z1285809184RC20X4A30PD7RTRMADP3RUSSIA-PUTIN.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_eu-agrees-fresh-round-of-sanctions-on-russia_1728742720.html", "title": "EU agrees to fresh round of sanctions on Russia", "title_page": "EU agrees to fresh round of sanctions on Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS - European Union leaders on Dec 14 agreed to impose a 12th round of sanctions on Russia over the war on Ukraine, targeting diamond exports and better enforcing an oil price cap.\nThe 27 leaders said in a statement issued during their summit in Brussels that they “welcomed” the approval of the fresh sanctions on Moscow.\nThe EU has imposed an unprecedented battery of sanctions against Russia since President Vladimir Putin launched an all-out invasion of Ukraine in February 2022.\nThe latest sanctions – which still have to be formally published – are set to ban Russia’s lucrative diamond exports.\nThey also include measures aimed at tightening enforcement of an oil price cap aimed at curbing the amount of revenue the Kremlin rakes in from crude sales to non-EU countries.\nEuropean diplomats warn the EU is running out of further sectors it can agree on targeting.\nRussia’s economy has so far weathered the West’s punishment and Mr Putin boasted on Dec 14 that the country could “move forward”. AFP", "url": "https://www.straitstimes.com/world/europe/eu-agrees-fresh-round-of-sanctions-on-russia"}