{"authors": [], "date_download": "2024-10-12 13:35:02", "date_modify": "2024-10-12 13:35:02", "date_publish": "2024-10-02 07:58:00", "description": "Over 130 people across six states died as a result of the storm, and the toll was expected to rise. Read more at straitstimes.com.", "filename": "world_rescuers-push-through-helene-debris-to-find-people-and-restore-power_1728740102.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/NCHELENE42.JPG?VersionId=BLTqT8ZkbZLpaqMcsSZ2c.UxJSS91BML", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_rescuers-push-through-helene-debris-to-find-people-and-restore-power_1728740102.html", "title": "Rescuers push through Helene debris to find people, restore power", "title_page": "Rescuers push through Helene debris to find people, restore power | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NORTH CAROLINA/LOS ANGELES/WASHINGTON – Rescuers fanned out across the mountains of southern Appalachia on Oct 1, scouring the region for missing people and rushing supplies to communities still in dire need of food, water and power after Hurricane Helene.\n“The challenges are immense,” Governor Roy Cooper of North Carolina said at a news conference, adding that 92 search-and-rescue teams were working across the state.\nMore than 130 people across six states died as a result of the storm, and the toll was expected to rise. Almost a third of those killed were in the county surrounding Asheville, North Carolina, where an unknown number of people were still unaccounted for Oct 1.\nThe military has joined the relief and rescue efforts across the south-east. Major-General Todd Hunt, the head of the North Carolina National Guard, said 800 soldiers were on duty as at the morning of Oct 1, pushing into more cut-off parts of the state.\nIn South Carolina, nearly 1,000 National Guard soldiers were on the ground, along with 18 chain-saw teams, Governor Henry McMaster said at a news conference. “Things are getting better,” he said, “but we’re not out of the woods yet”.\nPersistent power outages caused by toppled trees were still a “choke point”, he added.\nRescue efforts were complicated by the many roads that had, until recently, served as lifelines for small mountain towns. Hundreds were flooded, destroyed or blocked by debris.\nIn some parts of the Carolinas, power remained scarce after flooding from the storm submerged electrical substations, and cellphone service was spotty or non-existent in some places.\nUS President Joe Biden plans to visit North Carolina and South Carolina on Oct 2. He also said he planned to visit Florida and Georgia as soon as possible.\nHelene made landfall in north-western Florida late on Sept 26 as a Category 4 storm, with winds of 225kmh. It caused record-breaking storm surges in the Tampa Bay region, flash flooding in Atlanta and power outages as far north as Cincinnati.\nAcross the south, strong winds toppled trees and tornadoes destroyed homes. Flash floods overwhelmed entire neighbourhoods and landslides destroyed public infrastructure, including for drinking water – which remains a key concern for emergency workers.\nWater systems in the rapidly growing city of Asheville were badly damaged, and officials said restoring the full system could take weeks. Emergency crews were trucking in drinkable water for the city’s 94,000 residents.\n“This crisis will likely be a sustained crisis because of water system issues,” Mr Cooper said on Oct 1.\nThe Gilded Age-era Biltmore Estate in Asheville, one of the region’s best-known landmarks and tourist attractions, was closed indefinitely to assess property damage, its owners said on Sept 30.\nBut commercial air travel had resumed at the Asheville Regional Airport as at the morning of Oct 1, though there were still some cancellations.", "url": "https://www.straitstimes.com/world/rescuers-push-through-helene-debris-to-find-people-and-restore-power"}