{"authors": [], "date_download": "2024-10-12 14:16:06", "date_modify": "2024-10-12 14:16:06", "date_publish": "2022-03-15 13:32:09", "description": "President Zelensky said Russia was beginning to realise victory would not come on the battlefield. Read more at straitstimes.com.", "filename": "world_europe_loud-explosions-heard-in-centre-of-ukraine-capital-kyiv_1728742566.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/15/mi_ukrainefire_150322.jpg?VersionId=07W8uyl10PCF0EZJlN8qwp.xKGEpe7qB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_loud-explosions-heard-in-centre-of-ukraine-capital-kyiv_1728742566.html", "title": "Russian bombardment of Kyiv kills 4, curfew called", "title_page": "Russian bombardment of Kyiv kills 4, curfew called | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (REUTERS, AFP) - Russian air strikes and shelling hit Kyiv on Tuesday (March 15) killing at least four people, authorities said, as invading forces tightened their grip on the Ukrainian capital and the mayor announced a 35-hour curfew starting at 8pm (2am Singapore time Wednesday).\nTwo large blasts echoed across the centre of the city just before dawn on Tuesday.\nLate on Monday, tracer bullets flashed across the night sky as Ukrainian forces apparently targeted an enemy drone.\n\"Today is a difficult and dangerous moment,\" mayor Vitali Klitschko said. \"The capital is the heart of Ukraine, and it will be defended. Kyiv, which is currently the symbol and forward operating base of Europe’s freedom and security, will not be given up by us.\"\nHe called on men who took wives and children to the relative safety of the west of the country earlier in the conflict to return to the capital to fight.\nSome have done so already, he and his brother Wladimir told Reuters in a recent interview.\nReuters witnesses saw a high-rise apartment block in flames after being struck by artillery. Firefighters tried to douse the blaze and rescue workers helped evacuate residents trapped inside using mobile ladders. A body lay on the ground in a bag.\nThe Artem weapons factory in central Kyiv was also hit, with footage taken by a local resident showing smoke coming from the roof.\nOutside kiosks nearby, shopkeepers and helpers swept up glass and other debris from the impact of the explosions.\nRussia said on Monday that it planned to attack Ukrainian arms factories in retaliation for what it said was a Ukrainian strike on the separatist-controlled city of Donetsk, and urged workers and local residents to stay away.\nUkraine denied launching an attack.\nKyiv has been spared the worst of the fighting since Russia invaded Ukraine on Feb 24, but the Russian military is slowly closing in on the city and the shelling has intensified.\n\"What is happening right now in Kharkiv, in Mariupol and other cities – it was understandable that sooner or later it would happen in Kyiv,\" said local resident Igor Krupa.\nSitting on the ground outside the badly damaged apartment building, he described how he had cocooned himself with furniture and metal weights before going to sleep.\n\"This actually saved me because all the windows went out and all the debris went into the apartment, and I remained unwounded. Just a couple of scratches.\"\nIn another part of the city, residents cleared debris from their homes after shelling blew out windows, ruined balconies and left wreckage strewn across the ground.\nJust hours earlier President Volodymyr Zelensky – wearing his now-signature military-green T-shirt – issued a defiant video address claiming Russia was beginning to realise victory would not come on the battlefield.\n“They have already begun to understand that they will not achieve anything by war,” Zelensky said, describing the latest round of talks between Ukrainian and Russian negotiators positively.\n“Pretty good, as I was told,” he said of Monday’s first day of discussions. “But let’s see. They will continue tomorrow.”\nThe two sides are far apart, with Moscow demanding Ukraine turn away from the West and recognise Moscow-backed breakaway regions.\nUkrainian negotiators say they want “peace, an immediate ceasefire and the withdrawal of Russian troops”.\nAlmost three weeks after vast columns of Russian forces marched across the border, Moscow’s forces have bombarded and besieged several Ukrainian towns and cities.\nFighting has intensified in recent days around Kyiv, which is almost completely surrounded by Russian forces.\nMore than half of Kyiv's three million inhabitants have fled the city.\nOnly roads to the south of the capital remain open, and city authorities have set up checkpoints and residents are stockpiling food and medicine.\nThe United Nations estimates almost 2.8 million people have fled Ukraine and some 636 civilian deaths have been recorded, including dozens of children. The true toll is likely far higher.\nThousands of people have been killed in the conflict and millions more displaced.\nRussia, which denies targeting civilians, calls its actions a “special military operation” to “denazify” the country, a claim that Ukraine and its allies reject as a pretext for an unjustified and illegal attack.\n‘Hold back’\nRussia’s military progress has been slow and costly, with Moscow apparently underestimating the strength of Ukrainian resistance.\nMany military experts believe Russia’s military now needs time to regroup and resupply its troops, paving the way for a possible pause or slowdown in fighting.\nThe head of Russia’s national guard Viktor Zolotov has reportedly admitted the operation was “not going as fast as we would like” but said victory would come step-by-step.\nMoscow has reportedly turned to Beijing for military and economic help – prompting what one US official said were several hours of “very candid” talks between high-ranking US and Chinese officials.\nRussian President Vladimir Putin has ordered his forces “to hold back on any immediate assault on large cities” according to Kremlin spokesman Dmitry Peskov, who cited “civilian losses” as the reason for stalling an attack.\nRussian troops have kept up their siege of southern Mariupol, where officials said nearly 2,200 people have been killed.\nIn a glimmer of hope for residents of the besieged port city, more than 160 civilian cars were able to leave along a humanitarian evacuation route on Monday after several failed attempts.\nUkraine plans to open nine “humanitarian corridors” on Tuesday to evacuate civilians from areas besieged by Russian forces, Deputy Prime Minister Iryna Vereshchuk said, adding that authorities will also try to deliver humanitarian supplies to Mariupol.\nVitaliy Koval, the governor of the northern region of Rivne, said separately that the death toll from a Russian air strike on a television tower in his region on Monday had risen to at least 19.\nMeanwhile, Ukraine’s allies have piled pressure on Putin’s regime with unprecedented economic sanctions, and the Kremlin faces domestic pressure despite widespread censorship of the war.\nDuring Russia’s most-watched evening news broadcast on Monday, a dissenting employee entered the studio holding up a poster saying “Stop the war. Don’t believe the propaganda.”\nAn opposition protest monitor said the woman, an editor at the state broadcaster Channel One, was detained following the highly unusual breach of security.\nShelling in Kyiv\nAcross Ukraine, Russia’s invasion has continued to take a bloody toll, destroying cities and ensuring that many lives will never be the same again.\n“They say that he is too severely burned, that I won’t recognise him,” sobbed Lidiya Tikhovska, 83, staring at the spot where a paramedic said the remains of her son Vitaliy lay following a missile strike in Kyiv.\n“I wish Russia the same grief I feel now,” she said, tears rolling down her cheeks as she clung to her grandson’s elbow for support.\nA correspondent for Fox News – Britain’s Benjamin Hall – was injured and hospitalised while reporting on the city outskirts, the network said, a day after a US journalist was shot dead in Irpin, a frontline Kyiv suburb.\nMeanwhile, Moscow-backed separatists said fragments from a shot-down Ukrainian Tochka-U missile ripped through the centre of the eastern city of Donetsk, killing 23 people.\nMoscow called it a “war crime” and rebels published images of bloody corpses strewn in the street.\nBut Ukraine’s army denied firing a missile at the city, with Ukrainian army spokesman Leonid Matyukhin saying in a statement: “It is unmistakably a Russian rocket or another munition.”\nIn the neighbouring Luhansk region Ukrainian commander Sergiy Gaiday said the whole Ukrainian-held zone was being bombarded, including “homes, hospitals, schools, water, gas and electricity networks” as well as trains evacuating civilians.\nAt the other end of the country, in a village outside the western city of Rivne, local authorities said nine people died and another nine were injured when Russian forces hit a television tower.", "url": "https://www.straitstimes.com/world/europe/loud-explosions-heard-in-centre-of-ukraine-capital-kyiv"}