{"authors": [], "date_download": "2024-10-12 13:46:00", "date_modify": "2024-10-12 13:46:00", "date_publish": "2024-06-27 20:38:02", "description": "A defunct Russian satellite has broken up into more than 100 pieces of debris in orbit. Read more at straitstimes.com.", "filename": "world_russian-satellite-blasts-debris-in-space-forces-iss-astronauts-to-shelter_1728740760.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/LYNXMPEK5Q0UQ-1.jpg?VersionId=aRVrlHkCzqftcLZ1g_c5rUwhFXaMUWIz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_russian-satellite-blasts-debris-in-space-forces-iss-astronauts-to-shelter_1728740760.html", "title": "Russian satellite breaks up in space, forces ISS astronauts to shelter", "title_page": "Russian satellite breaks up in space, forces ISS astronauts to shelter | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - A defunct Russian satellite has broken up into more than 100 pieces of debris in orbit, forcing astronauts on the International Space Station to take shelter for about an hour and adding to the mass of space junk already in orbit, US space agencies said.\nThere were no immediate details on what caused the break-up of the RESURS-P1 Russian Earth observation satellite, which was declared dead in 2022.\nUS Space Command, tracking the debris swarm, said there was no immediate threat to other satellites.\nThe event took place at around 10am Mountain Time (1600 GMT) on June 26, Space Command said. It occurred in an orbit near the space station, prompting US astronauts on board to shelter in their spacecraft for roughly an hour, Nasa's Space Station office said.\nRussia's space agency Roscosmos, which operated the satellite, did not immediately respond to a request for comment.\nRadars from US space-tracking firm LeoLabs detected the satellite releasing several fragments up until 6pm Mountain Time, the company said.\nUS Space Command, which has its own global network of space-tracking radars, said the satellite immediately created \"over 100 pieces of trackable debris\".\nLarge debris-generating events in orbit are rare but of increasing concern as space becomes crowded with satellite networks vital to everyday life on Earth, from broadband internet and communications to basic navigation services, as well as satellites no longer in use.\nRussia sparked strong criticism from the US and other Western countries in 2021 when it struck one of its defunct satellites in orbit with a ground-based anti-satellite (ASAT) missile launched from its Plesetsk rocket site. The blast, testing a weapon system ahead of Moscow's 2022 invasion of Ukraine, created thousands of pieces of orbital debris.\nIn the roughly 88-minute window of RESURS-P1's initial break-up, the Plesetsk site was one of many locations on Earth it passed over, but there was no immediate indication from airspace or maritime alerts that Russia had launched a missile to strike the satellite, space-tracker and Harvard astronomer Jonathan McDowell said.\n\"I find it hard to believe they would use such a big satellite as an ASAT target,\" Mr McDowell said. \"But, with the Russians these days, who knows.\"\nHe and other analysts speculated the break-up could have been caused by a problem with the satellite, such as leftover fuel onboard causing an explosion.\nWhat happens to old satellites\nDead satellites either remain in orbit until they descend into Earth's atmosphere for a fiery demise years later, or in widely preferred - but less common - circumstances they fly to a \"graveyeard orbit\" some 36,000km from Earth to lower the risk of crashing into active satellites.\nRoscosmos decommissioned RESURS-P1 over onboard equipment failures in 2021, announcing the decision the following year. The satellite has since appeared to be lowering its altitude through layers of other active satellites for an eventual atmospheric reentry.\nThe six US astronauts currently on the space station were alerted by NASA mission control in Houston around 9pm ET on June 26 (0100 GMT on Thursday) to execute \"safe haven\" procedures, where each crew member rushes into the spacecraft they arrived in, in case an emergency departure is required.\nNasa astronauts Butch Wilmore and Sunni Williams boarded their Starliner spacecraft, the Boeing-built capsule that has been docked since June 6 in its first crewed test mission on the station.\nThree of the other US astronauts and a Russian cosmonaut went into SpaceX's Crew Dragon capsule that flew them to the station in March, while the sixth US astronaut joined the two remaining cosmonauts in their Russian Soyuz capsule that ferried them there in September 2023.\nThe astronauts emerged from their spacecraft roughly an hour later and resumed their normal work on the station, Nasa said.\nThe prospect of satellite collisions and space warfare have added urgency to calls from space advocates and lawyers to have countries establish an international mechanism of managing space traffic, which does not currently exist. REUTERS", "url": "https://www.straitstimes.com/world/russian-satellite-blasts-debris-in-space-forces-iss-astronauts-to-shelter"}