{"authors": [], "date_download": "2024-10-12 14:06:00", "date_modify": "2024-10-12 14:06:00", "date_publish": "2022-09-07 01:42:53", "description": "It shows Moscow is suffering severe supply shortages in its war in Ukraine, say officials. Read more at straitstimes.com.", "filename": "world_europe_us-says-russia-buying-north-korea-shells-rockets-for-ukraine-war_1728741960.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/07/10164394.jpg?VersionId=iXBGLrw1DUiswXMDeW2dH_svekzeL0MV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_us-says-russia-buying-north-korea-shells-rockets-for-ukraine-war_1728741960.html", "title": "Russia could be about to buy ‘millions’ of North Korean shells, rockets, says US", "title_page": "Russia could be about to buy ‘millions’ of North Korean shells, rockets, says US | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - Russia could be about to buy “literally millions” of artillery shells and rockets from old Cold-War ally North Korea, the White House said on Tuesday, calling this further evidence of Moscow’s “desperation” amid supply shortages for its war in Ukraine.\nRussia’s ambassador to the United Nations, Vassily Nebenzia, earlier dismissed reports from US officials, which first appeared in the New York Times, citing newly declassified US intelligence that Russia was making such purchases.\n“I haven’t heard it and I think that’s another fake being circulated around,” he told reporters.\nUS State Department deputy spokesman Vedant Patel told a news briefing on Tuesday that Russia “is in the process of purchasing millions rockets and artillery shells from North Korea for use in Ukraine\".\nHowever, White House national security spokesman John Kirby said a short time later there were “no indications that that purchase has been completed and certainly no indications that those weapons are being used inside of Ukraine.”\nCalling it a “potential purchase,” Kirby told a briefing: “Our sense is it could include literally millions of rounds, rockets and artillery shells from North Korea. That’s what our information gives us – it could be on that scale.”\n“We don’t have any indication that the purchase has actually occurred yet so it’s difficult to say what it’s actually going to end up looking like,” Kirby added.\nHe said it was “just another indication of how desperate Putin is becoming... It’s an indication of how much his defence industrial establishment is suffering as a result of this war and the degree of desperation.”\nUS officials said additional Russian purchases of North Korean military equipment were expected.\nUkraine recently launched counteroffensives in several locations. In preparation for those attacks, Ukrainian forces struck Russian supply areas, including those containing artillery and ammunition.\nOfficials have said Western sanctions are limiting Russia’s ability to replace vehicles and weapons destroyed in Ukraine.\nNorth Korea’s mission to the United Nations did not immediately respond to a request for comment.\nNorth Korea experts said Pyongyang is keen to raise money from weapons sales to counter international sanctions, which Russia in the past has supported, over its nuclear and missile programmes.\nVedant said the Russian purchases would violate UN sanctions that prohibit UN member states from procuring arms from North Korea.\n“Particularly concerning here is that a permanent member of the Security Council is flouting these measures,” he said, referring to Russia.\nAlastair Morgan, Britain’s ambassador to North Korea from 2015 to 2018 and who was also coordinator for the UN Panel of Experts that monitors enforcement of sanctions on North Korea, told a webinar he had no information to verify the report about Russian purchases, but added: “If it could, I’m quite sure that (North Korea) would sell arms to whoever would take them.”\nHe noted that Pyongyang had repeatedly expressed support for Russia in Ukraine and clearly wanted to remain on good terms with Russia, as well as China, so they would continue to block any further UN Security Council sanctions against Pyongyang.", "url": "https://www.straitstimes.com/world/europe/us-says-russia-buying-north-korea-shells-rockets-for-ukraine-war"}