{"authors": [], "date_download": "2024-10-12 13:35:04", "date_modify": "2024-10-12 13:35:04", "date_publish": "2024-10-08 07:22:35", "description": "But US voting systems and election workers are reportedly the most prepared they have ever been. Read more at straitstimes.com.", "filename": "world_us-expecting-foreign-actors-to-question-validity-of-election_1728740104.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/08/LYNXMPEK960OG-1.jpg?VersionId=mi.L5jt0OlR21WaQ56tHOcbYFUBojaW7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_us-expecting-foreign-actors-to-question-validity-of-election_1728740104.html", "title": "US is expecting foreign actors to question validity of presidential election", "title_page": "US is expecting foreign actors to question validity of presidential election | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - US adversaries are preparing to stoke uncertainty about the validity of the Nov 5 presidential election results after polls close, anticipating a contested vote, a senior US intelligence official said on Oct 7.\nIn a briefing to reporters on the election influence activities of Russia, China, Iran and Cuba, US intelligence officials said “foreign influence actors” would likely work to sow doubt about the results.\nRussia and Iran have already sought to sway US voters during the 2024 presidential campaign while China has sought to influence several down-ballot races, including congressional campaigns, according to US intelligence agencies.\nForeign actors would likely seek to use the uncertainty of a contested election to undermine trust in the integrity of the election and election processes and exacerbate divisions among Americans, according to the intelligence official.\nRussia sought to encourage the US public to oppose pro-Ukrainian policies, while actors linked to China’s government were focused on “tens” of down-ballot races.\nThe intelligence official said Beijing is seeking to influence congressional races with candidates, regardless of their party affiliation, perceived by Beijing to threaten its core interests, especially in relation to Taiwan.\nThe official did not provide an assessment of what impact the efforts might have.\nChina’s embassy in Washington did not immediately respond to a request for comment. China’s government denies interference in US elections and calls such claims “malicious speculation”.\nUS support for Taiwan, the democratic island Beijing claims as its territory, is a longstanding source of friction in US-China relations.\nThe intelligence community had not yet observed Iran seeking to influence state or congressional races, but did assess its aim was to push voters towards supporting US Vice-President Kamala Harris, the Democratic Party's presidential candidate.\nThat view had not changed since September when US officials also said Russia sought to denigrate Ms Harris in favour of Donald Trump.\nCountries would seek to “launder their narratives” through witting and unwitting American voices and stoke divisions in society on issues such as immigration, abortion and gender rights, the official said.\nCuba was also likely targeting Latino and Spanish-speaking voters on social media, aiming to promote candidates it thought would be favourable to its interests.\nIntelligence officials said they had delivered three times the number of “defensive briefings” to candidates, campaigns and election officials about influence operations, compared to prior election cycles, including on efforts by Russia, China and Iran.\nBut they said US voting systems and election workers were the most prepared they have ever been.\nAn official with the Cyber-security and Infrastructure Security Agency said the US has election infrastructure that is “more secure than any prior election cycle, and we do believe the election community is more prepared for the incidents that may arise than any prior cycle”. REUTERS", "url": "https://www.straitstimes.com/world/us-expecting-foreign-actors-to-question-validity-of-election"}