{"authors": [], "date_download": "2024-10-12 13:27:47", "date_modify": "2024-10-12 13:27:47", "date_publish": "2024-07-24 20:10:37", "description": "RIO DE JANEIRO - The U.S. has pledged $667 million to the latest funding round for a global fund aimed at preventing pandemics and preparing countries to deal with them, making up one-third of a $2 billion direct funding goal, the U.S. Treasury said on Wednesday. Read more at straitstimes.com.", "filename": "world_us-pledges-667-million-to-global-pandemic-fund-but-needs-congress-approval_1728739667.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/24/LYNXMPEK6N0JX-1.jpg?VersionId=f3obGtay08A4_WGvd_mRSNPqZizvlpeB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_us-pledges-667-million-to-global-pandemic-fund-but-needs-congress-approval_1728739667.html", "title": "US pledges $667m to global Pandemic Fund, but needs Congress' approval", "title_page": "US pledges $667m to global Pandemic Fund, but needs Congress' approval | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "RIO DE JANEIRO - The U.S. has pledged $667 million to the latest funding round for a global fund aimed at preventing pandemics and preparing countries to deal with them, making up one-third of a $2 billion direct funding goal, the U.S. Treasury said on Wednesday.\nThe move, which requires approval from Congress, is aimed at encouraging other donors to double their initial pledges to the Pandemic Fund, set up in September 2022 to fill gaps in pandemic prevention, preparedness and response capacity in low- and middle-income countries.\nA U.S. Treasury official said the Biden-Harris administration would seek annual appropriations from Congress to support the pledge but declined to specify over how many fiscal years, adding that there would be \"additional announcements\".\nGiven deep divisions among Republicans and Democrats in Congress over spending, and the approach of November's U.S. presidential election fast approaching, it is unclear when the pledge could be fulfilled.\nIt was announced on the sidelines of a G20 finance leaders' meeting in Rio de Janeiro, where G20 host country Brazil is aiming to host a pledging event in October.\n\"President Biden and I believe that a fully-resourced Pandemic Fund will enable us to better prevent, prepare for, and respond to pandemics – protecting Americans and people around the world from the devastating human and economic costs of infectious disease threats,\" Treasury Secretary Janet Yellen said in a statement.\nThe Treasury official said new donors could include countries that have not previously pledged, multilateral development banks or philanthropic organisations.\nIn 2023, the Fund provided $338 million in grants across 37 countries. A second call for proposals is under way for the award of another $500 million before the end of this year, the Treasury said. REUTERS", "url": "https://www.straitstimes.com/world/us-pledges-667-million-to-global-pandemic-fund-but-needs-congress-approval"}