{"authors": [], "date_download": "2024-10-12 13:44:29", "date_modify": "2024-10-12 13:44:29", "date_publish": "2023-12-17 15:48:17", "description": "President Tharman called him a “distinguished leader who devoted his life to the service of Kuwait”. Read more at straitstimes.com.", "filename": "world_middle-east_emir-sheikh-nawaf-laid-to-rest-in-kuwait_1728740669.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/17/11032071.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_middle-east_emir-sheikh-nawaf-laid-to-rest-in-kuwait_1728740669.html", "title": "Kuwait buries late emir Sheikh Nawaf, world leaders to pay respects", "title_page": "Kuwait buries late emir Sheikh Nawaf, world leaders to pay respects | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AL-SIDDEEQ, Kuwait - Kuwait’s Emir Sheikh Nawaf al-Ahmad al-Sabah, whose six-decade career in public service primarily focused on domestic issues, was buried on Dec 17 as world leaders made their way to pay their respects and meet the new ruler of the Gulf state.\nHis successor, Sheikh Mishal al-Ahmad al-Sabah, 83, was seen shedding a tear at the prayer service attended by members of the ruling Al Sabah family and Speaker of Kuwait’s Parliament.\nSheikh Mishal had been Kuwait’s de facto ruler since late 2021, when a frail Sheikh Nawaf handed over most of his duties.\nAs he formally takes the helm of the Opec member with the world’s seventh-largest oil reserves from his half-brother, Sheikh Mishal is expected to preserve key Kuwaiti foreign policies, including support for Gulf Arab unity, Western alliances and good ties to Riyadh - a priority relationship.\nSheikh Nawaf’s three-year reign as emir, relatively short by Kuwait standards, was marred by ill-health. His predecessor and brother, Sheikh Sabah al-Ahmad al-Sabah, reigned for 14 years and shaped the Gulf state’s foreign policy for two generations.\nSheikh Nawaf, whose casket was draped in Kuwait’s flag, was buried at Sulaibikhat cemetery alongside his kin, after prayers at Bilal bin Rabah mosque. He died aged 86.\nDraped in a Kuwaiti flag, the coffin of Sheikh Nawaf, whose cause of death was not disclosed, was carried into a Kuwait mosque for prayers ahead of a burial ceremony that was broadcast on state television.\nAttendance was largely limited to ruling family members, making for an intimate farewell for the emir who reigned for three years.\n“The choice reflects the late emir’s low-profile character,” said Bader al-Saif, a history professor at Kuwait University.\nAbdullah Sabah Al-Mulla, a 56-year-old Kuwaiti professor, said the nation has lost a “great father” in Sheikh Nawaf.\n“He did not put a barrier between him and anyone. To him, all the people were equal,” he said.\nSheikh Nawaf’s six decades in public service included stints as minister of defence, interior and labour. He was also deputy chief of the national guard and a governor.\nPay respects\nDignitaries from around the world, including US Defence Secretary Lloyd Austin and Jordan’s King Abdullah, were due in Kuwait to pay their respects. Qatar’s Emir Sheikh Tamim bin Hamad al-Thani arrived in Kuwait in the afternoon.\nUS Defense Secretary Lloyd Austin also paid tribute to the late ruler he described as a “valued partner and friend” of the United States.\nIran’s Foreign Minister Hossein Amirabdollahian was also due to present condolences on behalf of President Ebrahim Raisi.\nHe would stress the importance of the development of bilateral relations in meetings with senior Kuwait officials, Iran’s foreign ministry said.\nSingapore’s President Tharman Shanmugaratnam expressed his condolence to Sheikh Mishal in a letter on Dec 17.\nCalling Sheikh Nawaf a “distinguished leader who devoted his life to the service of Kuwait”, Mr Tharman said the late leader’s contributions were “instrumental in the development and prosperity of modern Kuwait”.\nThe president of regional power the United Arab Emirates, Sheikh Mohamed bin Zayed Al Nahyan, on X wished Kuwait’s new ruler success and said he would work with Sheikh Mishal to advance cooperation in the Gulf.\nSheikh Nawaf died on Dec 16. He was 83 when he became emir in 2020, at the time the oldest ruler to take power in the Gulf state that was invaded and occupied by Iraq in 1990.\nThe late emir was perceived domestically as a consensus-builder who sought to repair a long strained relationship between the parliament and government and who pardoned dozens of dissidents and other citizens who had voiced public criticisms.\nAcross Kuwait City, large digital billboards displayed pictures of the late ruler, hailed as the “emir of wisdom, forgiveness and peace”.\nFlags where lowered to half-mast amid a 40-day mourning period that will also see government offices shut until Tuesday.\nSpeaking outside the mosque where the funeral took place, Kuwaiti citizen Ghanem al-Sulaimani said he was saddened by the death of the man he called the “emir of humility and forgiveness”.\n“He left a great legacy... distinguished by his great love for his people,” he told AFP.\nEid Abdullah Al Fraih, a 60-year-old Kuwaiti retiree, said he was captivated by the late emir’s humility and compassion and that he believed Sheikh Mishal would continue his predecessor’s efforts to improve ties between the government and parliament.\n“Kuwait will be prosperous (under his reign). The (political and economic) situation will improve, God willing,” he said.\nSuccession\nBorn in 1937, Sheikh Nawaf took over as emir in September 2020 upon the death of his half-brother, Sheikh Sabah, at the age of 91.\nHe issued numerous amnesties for political prisoners, earning him the nickname “emir of pardons”.\nOne of his last moves before his death was the signing of a draft decree approved by cabinet late last month, ordering the release of dozens of political prisoners.\nSheikh Nawaf was defence minister when Iraq invaded Kuwait in 1990, setting off a war that drew in armies from around the world to end the occupation.\nAnd he was interior minister when Kuwait faced a severe threat from Islamist militants in 2005.\nThe episodes deeply marked the country, but Sheikh Nawaf’s low-profile style meant he remained a relatively popular figure.\nHe is succeeded by his half-brother, Sheikh Meshal al-Ahmed al-Sabah, who was named crown prince in 2020.\nComing to power at the age of 83, Sheikh Meshal, a veteran of Kuwait’s security and intelligence apparatus, is not new to the duties of the emir, having assumed most of his predecessor’s key tasks in 2021.", "url": "https://www.straitstimes.com/world/middle-east/emir-sheikh-nawaf-laid-to-rest-in-kuwait"}