{"authors": [], "date_download": "2024-10-12 14:07:09", "date_modify": "2024-10-12 14:07:09", "date_publish": "2022-09-30 07:27:57", "description": "Zaporizhzhia and Kherson regions are now part of Russia, says the president. Read more at straitstimes.com.", "filename": "world_europe_putin-issues-decress-recognising-independence-of-two-ukraine-regions_1728742029.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/30/md_region3_30092022.jpg?VersionId=VoE6tWxtjo6ngsxElfljxl.7I3bz9of0&h=56d23a42", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_putin-issues-decress-recognising-independence-of-two-ukraine-regions_1728742029.html", "title": "Putin recognises independence of two Ukraine regions ahead of annexation", "title_page": "Putin recognises independence of two Ukraine regions ahead of annexation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW – Russian President Vladimir Putin has recognised the independence of Ukraine’s Zaporizhzhia and Kherson regions, according to presidential decrees issued late Thursday, on the eve of Russia finalising their annexation.\n“I order the recognition of the state sovereignty and independence” of the regions of Zaporizhzhia and Kherson, located in southern Ukraine, Mr Putin said in the decrees, as Russia prepares to formalise the annexation of the two regions, along with Donetsk and Lugansk on Friday.\nMoscow has said it will annex four occupied regions of Ukraine at a grand ceremony in the Kremlin on Friday.\nKremlin spokesman Dmitry Peskov told reporters that the annexation of the areas would be formalised at the ceremony, and that Mr Putin would deliver a major speech.\nMr Putin has threatened to use nuclear weapons to defend the territories. But the threats have not deterred a sweeping Ukrainian counter-offensive, which has been pushing back Russian troops in the east and is on the doorstep of the Donetsk region town of Lyman, which Moscow’s forces pummelled for weeks before capturing it this summer.\nThe Kremlin-installed leaders of the four regions that pleaded to Mr Putin for annexation this week were gathered in the Russian capital on Thursday ahead of the ceremony. Their nearly simultaneous requests came after they claimed that residents unanimously backed the move in hastily organised referendums that were dismissed by Kyiv and the West as illegal, fraudulent and void.\nUkraine said the only appropriate response from the West was to hit Russia with more sanctions and to supply Ukrainian forces with more weapons to keep reclaiming territory.\nPresident Joe Biden said on Thursday that “the United States will never, never, never recognise Russia’s claims on Ukraine sovereign territory”.\nUnited Nations Secretary-General Antonio Guterres also rejected the annexation plans, condemning them as “a dangerous escalation” that “has no place in the modern world”.", "url": "https://www.straitstimes.com/world/europe/putin-issues-decress-recognising-independence-of-two-ukraine-regions"}