{"authors": [], "date_download": "2024-10-12 14:18:52", "date_modify": "2024-10-12 14:18:52", "date_publish": "2022-03-09 23:37:55", "description": "MOSCOW (REUTERS) - Russia's ruling party, United Russia, said on Wednesday (March 9) that a government commission had approved the first step towards nationalising assets of foreign firms that leave the country in the wake of economic sanctions over Ukraine. Read more at straitstimes.com.", "filename": "world_europe_russia-moves-towards-nationalising-assets-of-firms-that-leave_1728742732.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/09/btbp20220309.jpg?VersionId=s91NCeWQ6K6Ys3oNzH5EmOsPq1AyS1Tu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_russia-moves-towards-nationalising-assets-of-firms-that-leave_1728742732.html", "title": "Russia moves towards nationalising assets of firms that leave", "title_page": "Russia moves towards nationalising assets of firms that leave | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW (REUTERS) - Russia's ruling party, United Russia, said on Wednesday (March 9) that a government commission had approved the first step towards nationalising assets of foreign firms that leave the country in the wake of economic sanctions over Ukraine.\nUnited Russia added in a statement on the Telegram messaging app that the commission on lawmaking activity had supported a Bill allowing for firms more than 25 per cent owned by foreigners from \"unfriendly states\" to be put into external administration.\n\"This will prevent bankruptcy and save jobs,\" it said.\nCorporate actions to censure Russia over its invasion of Ukraine vary widely, with some firms such as United States carmaker Ford temporarily shutting down factories but others like British energy company BP promising to exit the country.\nUnited Russia said according to the proposed Bill, companies that had announced they were leaving Russia could refuse to go into administration if within five days they resumed activities or sold shares, providing that the business and employees remained.\nOtherwise, a court would appoint a temporary administration for three months, after which the shares of the new organisation would be put up for auction and the old one would be liquidated, it added.", "url": "https://www.straitstimes.com/world/europe/russia-moves-towards-nationalising-assets-of-firms-that-leave"}