{"authors": [], "date_download": "2024-10-12 13:37:45", "date_modify": "2024-10-12 13:37:45", "date_publish": "2024-09-01 04:04:30", "description": "Washington has limited the use of its weapons to Ukrainian soil and defensive cross-border operations. Read more at straitstimes.com.", "filename": "world_europe_ukraines-zelenskiy-presses-us-to-greenlight-deeper-strikes-into-russia_1728740265.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/01/UKRAINE-POLAND-LITHUANIA-RUSSIA-POLITICS-DIPLOMACY-WAR-143503.jpg?VersionId=zNhjcgn2K_G2MRUineysVjc7cULVkgHB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraines-zelenskiy-presses-us-to-greenlight-deeper-strikes-into-russia_1728740265.html", "title": "Ukraine’s Zelensky presses US for green light to strike deeper into Russia", "title_page": "Ukraine’s Zelensky presses US for green light to strike deeper into Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukrainian President Volodymyr Zelensky increased pressure on the United States to let Kyiv strike military targets deep inside Russian territory after his representatives met senior US officials in Washington on Aug 31.\nWashington has provided Ukraine with more than US$50 billion (S$65 billion) worth of military aid since 2022, but has limited the use of its weapons to Ukrainian soil and defensive cross-border operations.\nMr Zelensky said guided aerial bombs killed six people and injured 97 in Kharkiv on Aug 30, with more attacks on Aug 31.\nThese could be averted only “by striking Russian military airfields, their bases, and the logistics of Russian terror”.\nIn his nightly video address, he said, “We talk about this every day with our partners. We persuade. We present arguments.”\nHe said that clearing the Ukrainian sky of Russian guided aerial bombs would be “a strong step to force Russia to seek an end to the war and a just peace”.\nAppealing to the US, Britain, France and Germany, he said: “We need the capabilities to truly and fully protect Ukraine and Ukrainians.\n“We need both the permissions for long-range capabilities and your long-range shells and missiles.”\nWithout providing specifics, he said his representatives had “provided all the necessary details” to Ukraine’s partners.\nUkrainian Defence Minister Rustem Umerov, in Washington with a delegation on Aug 30 and 31 to meet US officials and experts, said in an interview broadcast by CNN that Kyiv was showing that Russian airfields used to hit Ukrainian cities were within range of deep strikes.\n“We have explained what kind of capabilities we need to protect the citizens against the Russian terror that Russians are causing us, so I hope we were heard,” Mr Umerov said in the interview late on Aug 30.\nMr Zelensky is expected to deliver a similar plea in person in October, when he will present a plan for victory to President Joe Biden, who is nearing the end of his time in the Oval Office, and attend United Nations General Assembly meetings in New York.\nEconomy Minister Yulia Svyrydenko, who headed Kyiv’s delegation, said in a post on social media platform X that she had discussed the steps needed to restore Ukraine’s energy system, including a “significant contribution” being made by an US$800 million energy sector financing package that was announced in June.\nRussian air strikes have affected more than half of Ukraine’s power infrastructure, she said.\nThe President’s chief of staff, Mr Andriy Yermak, joined Mr Umerov in briefing US Defence Secretary Lloyd Austin about the situation on the battlefield in the first meeting of their visit on Aug 30, the presidential office said in a statement.\nSpeaking at the end of a week when Russia hit Ukraine with more than 400 missiles and drones, Mr Yermak said it was important for Ukraine to receive weapons from existing defence packages as soon as possible, the office said. REUTERS", "url": "https://www.straitstimes.com/world/europe/ukraines-zelenskiy-presses-us-to-greenlight-deeper-strikes-into-russia"}