{"authors": [], "date_download": "2024-10-12 14:03:55", "date_modify": "2024-10-12 14:03:55", "date_publish": "2022-12-27 11:08:10", "description": "The US is worried about the Chinese activity which is destabilising and risks miscalculations. Read more at straitstimes.com.", "filename": "world_united-states_us-blasts-china-s-military-drills-near-taiwan-as-provocative_1728741835.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/27/rruschinataiwan2712_5.jpg?VersionId=6rcud65N6GyMZUulrziM8sjg3jTZ3Bx_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_us-blasts-china-s-military-drills-near-taiwan-as-provocative_1728741835.html", "title": "US blasts China’s military drills near Taiwan as ‘provocative’", "title_page": "US blasts China’s military drills near Taiwan as ‘provocative’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON - The Biden administration criticised Beijing’s military drills near Taiwan this week as provocative, insisting that it will continue helping the government in Taipei defend itself.\nThe United States is worried about the Chinese activity, “which is destabilising, risks miscalculations, and undermines regional peace and stability”, the National Security Council said on Tuesday.\n“We will continue to assist Taiwan in maintaining a sufficient self-defence capability in line with our longstanding commitments and consistent with our ‘one China’ policy,” it added.\nWhile the Taiwan issue continues to be a source of tension between China and the US, it does not appear to be derailing recent efforts by the two sides to improve ties.\nUS Secretary of State Antony Blinken is still scheduled to visit Beijing early in 2023 to follow up on a meeting between President Joe Biden and his Chinese counterpart Xi Jinping on the sidelines of the Group of 20 summit in Indonesia in November.\nChina’s Ambassador to the US, Mr Qin Gang, hinted at the durability of relations in a commentary that appeared in The National Interest magazine on Monday.\n“The differences between China and the United States – in history, culture, social system and development path – will most probably remain in 100 years,” wrote Mr Qin, a top contender to become China’s next foreign minister.\n“But as residents of the same world, we should and can listen to each other, narrow our gap in perceptions of the world, and explore a way to get along based on mutual respect, peaceful coexistence and win-win cooperation,” he added.\nEarlier this week, China held its largest military drills near Taiwan since unprecedented exercises that followed a trip to Taipei by US House Speaker Nancy Pelosi in August.\nIn the 24 hours to early Monday, China sent 71 warplanes towards Taiwan – 47 of them either across the median line in the Taiwan Strait or into Taiwan’s south-west air-defence identification zone.\nChina regards Taiwan as a renegade province, to be reunified, by force if necessary. Taiwan, however, rejects China’s sovereignty claims.\nChina’s military said on Sunday it conducted the drills in response to escalating “collusion and provocations” from Taiwan and the US.\nLast week, US lawmakers agreed to a US$1.7 trillion (S$2.29 trillion) spending Bill that included US$2 billion in weapons funding for Taiwan.\nChina’s Defence Ministry has blasted the US National Defence Authorisation Act, which permits up to US$10 billion in weapons sales to Taiwan, for playing up the China threat and interfering in the nation’s internal affairs. BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/us-blasts-china-s-military-drills-near-taiwan-as-provocative"}