{"authors": [], "date_download": "2024-10-12 14:00:10", "date_modify": "2024-10-12 14:00:10", "date_publish": "2024-09-12 18:01:00", "description": "The heaviest bell weighs over 4.1 tonnes, while the lightest clocks in at a dainty 782kg. Read more at straitstimes.com.", "filename": "world_europe_8-bells-return-to-belfry-of-notre-dame-in-paris-5-years-after-devastating-fire_1728741610.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/12/FRANCE-MONUMENT-HERITAGE-RELIGION-FIRE-085833.jpg?VersionId=DVcxhzKuFc3D1rEZYYgQXL078g0gVO65", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_8-bells-return-to-belfry-of-notre-dame-in-paris-5-years-after-devastating-fire_1728741610.html", "title": "8 bells return to belfry of Notre Dame in Paris 5 years after devastating fire", "title_page": "8 bells return to belfry of Notre Dame in Paris 5 years after devastating fire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Eight bells, one weighing more than four tonnes, will be returned to the belfry of the Notre Dame cathedral in Paris on Sept 12, just months before it is due to reopen after a devastating fire five years ago.\nTeams repairing damage from the April 15, 2019, blaze had to remove the bells – from the largest, Gabriel, to the smallest, Jean-Marie – from Notre Dame’s north tower in July 2023 to complete their work.\nThe bells themselves have been cleaned of lead dust thrown off by the church’s burning roof and restored at a foundry in Normandy, northern France, before their delivery by truck back to Paris.\nNotre Dame rector Olivier Ribadeau Dumas was to bless the peal of eight bells, each named after a significant figure from the cathedral’s history, later on Sept 12.\nHeavyweight Gabriel weighs more than 4.1 tonnes, while the lightest, Jean-Marie, clocks in at a dainty 782kg.\nNotre Dame has 20 bells in total, including two massive bourdons – the largest weighing 13 tonnes – producing the lowest notes that hang in the south tower, which are rung for major Church events such as Easter, Christmas or the death or election of a Pope.\nFirst completed in 1345 after almost two centuries of construction, the cathedral is set to reopen on Dec 7 after a massive restoration effort that is still under way.\nBefore the fire, around 10 million people visited the church each year. AFP", "url": "https://www.straitstimes.com/world/europe/8-bells-return-to-belfry-of-notre-dame-in-paris-5-years-after-devastating-fire"}