{"authors": [], "date_download": "2024-10-12 14:04:47", "date_modify": "2024-10-12 14:04:47", "date_publish": "2023-01-03 13:48:40", "description": "It is the first time the 101st Airborne Division has been deployed to Europe since World War II. Read more at straitstimes.com.", "filename": "world_europe_us-troops-in-romania-train-close-to-russia-s-war-in-signal-to-moscow_1728741887.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/03/ROMANIA-NATIONAL-DAY-ARMY-140135_1.jpg?VersionId=pAiIhEJi5MjiLNZ6bDGT0jECfU238apT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_us-troops-in-romania-train-close-to-russia-s-war-in-signal-to-moscow_1728741887.html", "title": "US troops in Romania train close to Russia’s war, in signal to Moscow", "title_page": "US troops in Romania train close to Russia’s war, in signal to Moscow | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MIHAIL KOGALNICEANU AIR BASE, Romania – The soldiers of the US Army’s 101st Airborne Division train, eat and sleep on a drab, sprawling post in south-east Romania, a mere seven-minute rocket flight from where Russia has stockpiled munitions in Crimea.\nFarther north, in military exercises with Romanian troops just a few miles from the Ukrainian border, US soldiers, also from the 101st division, are firing artillery, launching helicopter assaults and digging trenches similar to those on the front lines in the region near Kherson, the Ukrainian port city from which Russian troops retreated in November.\nIt is the first time the 101st Airborne Division has been deployed to Europe since World War II, and with their presence in Romania, a member of the North Atlantic Treaty Organisation (Nato), its soldiers are now closer to the war in Ukraine than any other US Army unit.\nIts mission is considered a model for an American military that has newly stepped back from two decades of actively fighting wars and into an era of trying to deter adversaries – using a show of force as well as training, weapons shipments and other aid to drive home the point.\n“This is a regional conflict, but it has global implications,” the US Army’s chief of staff, General James C. McConville, said in a mid-December interview at the air base, which shares a runway with an adjoining commercial airport named for the former Romanian prime minister, Mihail Kogalniceanu, near the Black Sea.\nThe troop deployment in Romania is meant as a warning to Moscow, part of President Joe Biden’s pledge to defend “every single inch” of Nato territory without tempting President Vladimir Putin of Russia into escalating the conflict. But holding joint exercises is also a way of ensuring that allies in south-east Europe are ready to hold the line.\nIt is unclear what kind of footprint the US will keep at the base; the Pentagon will soon decide whether to maintain the number of U.S. troops and senior commanders there.\nSome in Congress are wary of the cost of meeting Ukraine’s continuing demands for support – with top House Republican Kevin McCarthy, suggesting in October that his party might be unwilling to write a “blank check” to Ukraine.\nBut supporters of maintaining a strong presence in Eastern Europe pointed to Russia’s invasion of Ukraine in February as proof that the US and its Nato allies did not do enough to deter Moscow last winter.\n“This is one of the most important lessons that we have to take away from Ukraine,” Representative Seth Moulton told reporters after returning from a brief trip to Ukraine in early December.\n“When we look at the other scenario that might unfold like Ukraine, in the Pacific with China and Taiwan, we have to ensure that deterrence is successful.”\nMilitary planners echoed that strategy, noting that the 101st Airborne Division was also using the Black Sea for coastal defense training – a useful skill should China become more aggressive and invade Taiwan, a self-governing island that Beijing has long claimed as its own.\nThe division was ordered to deploy about 4,000 soldiers and senior commanders just weeks after Russia invaded. They arrived at the air base, near the Romanian coastal city of Constanta, over the summer.\nThe base previously served as a sleepy outpost for training Nato troops, including several hundred US soldiers, and was known more broadly in the military as a way station with a small mess hall for US forces heading to and from Afghanistan.\nThe mission here is somewhat different from those elsewhere in Europe, where some US troops are training Ukrainian forces on advanced weapons systems that are being shipped to the Ukrainians.\nThe division’s commander, Major General J.P. McGee, said that training with other Eastern European soldiers had its own value.\n“You get a chance to train and operate on the very ground that you might have to defend,” Gen McGee said.\nHe added: “You have to work with a Nato ally, and it’s almost unimaginable in the future that we would ever go fight without allies.”\nIn addition to the troops in Romania, Gen McGee has also sent smaller teams of soldiers to train with Nato allies in Bulgaria, Germany, Hungary and Slovakia.\nThe unit prides itself on being the closest one to the combat, but it is by no means the largest: Officials said that an estimated 12,000 troops attached to the Army’s 1st Infantry Division, added after the invasion, are based mostly in western Poland and the Baltics.\nTogether, they represent a buildup of US forces in Europe since Russia invaded Ukraine, as Mr Biden promised allies at a Nato summit meeting in Madrid in June.\nGen McConville would not predict what the Biden administration might do in Romania, but broadly speaking, he said the troops at the air base had “really made a difference, and I think we will continue to provide those capabilities as required”.\nHaving a division commander and staff so close to the border with Ukraine is more than symbolic, said Ms Becca Wasser, a war analyst at the Center for a New American Security, a research institute in Washington. It allows for quick decisions about where to position thousands of troops and weapons should Russia push the war into Nato territory.\n“What you are seeing is indicative of a change in how the US military is approaching posture and deployments around the globe as the era of wars in Iraq and Afghanistan have changed,” Ms Wasser said.\n“It’s not necessarily going to be this combat deployment – what you really have is a deterrence deployment.” NYTIMES", "url": "https://www.straitstimes.com/world/europe/us-troops-in-romania-train-close-to-russia-s-war-in-signal-to-moscow"}