{"authors": [], "date_download": "2024-10-12 13:40:35", "date_modify": "2024-10-12 13:40:35", "date_publish": "2024-04-07 11:00:00", "description": "A rare total solar eclipse will sweep across North America on April 8. Read more at straitstimes.com.", "filename": "world_united-states_what-do-scientists-hope-to-learn-from-total-solar-eclipse-in-us_1728740435.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/07/2024-04-05T220111Z344687489RC2I07AR28VQRTRMADP3SOLAR-ECLIPSE-USA.JPG?VersionId=5eyY5hFVSZKNM3VWeUw5NUm1Q80HvQzt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_what-do-scientists-hope-to-learn-from-total-solar-eclipse-in-us_1728740435.html", "title": "What do scientists hope to learn from total solar eclipse in US?", "title_page": "What do scientists hope to learn from total solar eclipse in US? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – When a rare total solar eclipse sweeps across North America on April 8, scientists will be able to gather invaluable data on everything from the Sun’s atmosphere to strange animal behaviours – and even possible effects on humans.\nIt comes with the Sun near the peak of its 11-year solar cycle, setting the stage for a breathtaking display: The corona will glow spectacularly from the Moon’s silhouette along the path of totality, a corridor stretching from Mexico to Canada via the United States.\nTotal solar eclipses offer “incredible scientific opportunities,” Nasa deputy ddministrator Pam Melroy told a press conference this week about the celestial event.\nThe US space agency is one of the institutions at the ready for the eclipse, with plans to launch so-called “sounding rockets” to study the effects on Earth’s upper atmosphere.\nHere is a look at what researchers are hoping to learn from the upcoming eclipse:\nSun’s atmosphere\nWhen the Moon passes directly in front of the Sun and blocks it, the elusive outermost edge of the Sun’s atmosphere, or corona, will be visible “in a very special way,” Ms Melroy said.\n“Things are happening with the corona that we don’t fully understand,” she said.\nThe heat within the corona intensifies with distance from the Sun’s surface – a counterintuitive phenomenon that scientists struggle to fully comprehend or explain.\nSolar flares, a sudden explosion of energy that releases radiation into space, take place in the corona as do solar prominences – enormous plasma formations that loop out from the Sun’s surface.\nDuring an eclipse, the bottom most part of the corona – where a lot of this activity occurs – is more clearly visible than when using specialised instruments to block the central part of the Sun, offering a golden opportunity for study, said Dr Shannon Schmoll, director of the Abrams Planetarium at Michigan State University.\nResearchers are particularly thrilled about the Sun being near the peak of its 11-year cycle.\n“The chance we’re going to see something amazing is very high,” Ms Melroy said.\nEarth’s atmosphere\nThe total eclipse also will afford scientists a chance to study changes in part of the Earth’s upper atmosphere known as the ionosphere, important because it affects radio waves used for communication and navigation.\n“Disturbances in this layer can cause issues with GPS and communications,” said Ms Kelly Korreck, the eclipse programme manager at Nasa headquarters.\nThe ionosphere, which is where Earth’s atmosphere meets space, is affected by the Sun, which electrically charges the particles there during the day.\nNasa’s three sounding rockets will be launched before, during and just after the eclipse from Virginia to measure these changes.\nThe major decrease in sunlight provoked by the eclipse – more rapid and localised than a simple sunset – should allow researchers to learn more about how light affects the ionosphere so they can better predict potential problematic disruptions.\nAnimal behaviours\nStartling animal behaviour has been noted during eclipses: Giraffes have been seen galloping, while roosters and crickets can start crowing and chirping.\nBeyond the drop in sunlight, temperatures and wind – conditions to which animals are sensitive – can also decrease significantly during an eclipse.\nMr Andrew Farnsworth, a researcher in ornithology at Cornell University in New York state, studies how eclipses affect birds, using weather surveillance radar to detect birds in flight.\nDuring the last total solar eclipse visible from the United States in August 2017, scientists observed a “decline in the number of animals flying around,”, Mr Farnsworth told reporters.\nThe 2017 eclipse disrupted the daily activities of insects and birds, but did not trigger usual animal nocturnal behaviours such as birds migrating or bats emerging, the expert said.\nThis time around, birds might be more apt to migrate during the eclipse, given that it’s in April, he said.\n“These kinds of patterns – they’re important for understanding the ways animals perceive their worlds,” Mr Farnsworth said.\nHuman wonder\n“Eclipses have a special power. They move people to feel a kind of reverence for the beauty of our universe,” Nasa administrator Bill Nelson told reporters.\nResearchers studied this feeling of awe in 2017, using data from nearly three million users on Twitter, now called X.\nThose in the so-called “path of totality”, under which the Moon will fully block out the Sun, tended to use the pronoun “we” (as opposed to “I”) and express concern about other people, according to psychology professor Paul Piff from the University of California, Irvine.\n“What we’re finding is that experiences that bring about awe... seem to attune people and connect us to one another, to connect us to entities that are larger than ourselves,” Prof Piff said.\nIn 2024, he plans to study if the experience has any effect on political divisions in society.", "url": "https://www.straitstimes.com/world/united-states/what-do-scientists-hope-to-learn-from-total-solar-eclipse-in-us"}