{"authors": [], "date_download": "2024-10-12 13:39:47", "date_modify": "2024-10-12 13:39:47", "date_publish": "2024-10-06 01:51:41", "description": "WARSAW - Poland will need a much larger army, something that could be hard to achieve given its aging population, if it is to defend itself from what seems to be a war this generation will inevitably face, a top general was quoted as saying by state news agency PAP. Read more at straitstimes.com.", "filename": "world_europe_polish-armed-forces-chief-says-country-needs-to-boost-its-army_1728740387.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/06/LYNXMPEK94078-1.jpg?VersionId=P9yKFwh79O2ZQFM0q3nSIDF3w8xVhPUG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_polish-armed-forces-chief-says-country-needs-to-boost-its-army_1728740387.html", "title": "Polish armed forces chief says country needs to boost its army", "title_page": "Polish armed forces chief says country needs to boost its army | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WARSAW - Poland will need a much larger army, something that could be hard to achieve given its aging population, if it is to defend itself from what seems to be a war this generation will inevitably face, a top general was quoted as saying by state news agency PAP.\n\"Everything is indicating that we are the generation that will stand up in arms to defend our country. And neither I nor any of you intend to lose this war,\" armed forces chief of staff General Wieslaw Kukula was quoted as saying in an address on Friday to a military academy, the University of Land Forces, in Wroclaw.\n\"We will win it, we will come back and we will continue to build Poland, but something has to happen. We have to build armed forces prepared for this type of action.\"\nKukula said the demographic crisis would reduce the pace of recruitment.\n\"The adversary's potential is so large that we must build a much larger army, which means that we must also implement the general service model,\" Kukula was quoted as saying. General service refers to mandatory military training and service, which is currently not enforced.\nPoland's army will count over 207,500 soldiers by the end of the year, making it the third largest army in NATO in terms of personnel, after the United States and Turkey, according to data from Poland's ministry of defence.\nKukula said in July that Poland must prepare its forces for full-scale conflict. Poland's relations with Russia and its ally Belarus have deteriorated sharply since Moscow invaded neighbouring Ukraine in February 2022. REUTERS", "url": "https://www.straitstimes.com/world/europe/polish-armed-forces-chief-says-country-needs-to-boost-its-army"}