{"authors": [], "date_download": "2024-10-12 14:06:28", "date_modify": "2024-10-12 14:06:28", "date_publish": "2022-04-28 22:10:36", "description": "This would include helping Kyiv shift from Soviet-era weapons to modern ones. Read more at straitstimes.com.", "filename": "world_europe_nato-says-its-ready-to-back-ukraine-for-years-in-war-against-russia_1728741988.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/28/ads-norway-28042022.jpg?VersionId=7bsyKp6ofQxP1rsPvXC3dmBowlfTC3Bb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_nato-says-its-ready-to-back-ukraine-for-years-in-war-against-russia_1728741988.html", "title": "Nato says it's ready to back Ukraine for years in war against Russia", "title_page": "Nato says it's ready to back Ukraine for years in war against Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS (REUTERS) - Nato is ready to maintain its support for Ukraine in the war against Russia for years, including help for Kyiv to shift from Soviet-era weapons to modern Western arms and systems, Secretary-General Jens Stoltenberg said on Thursday (April 28).\nHe spoke after the Kremlin warned that Western arms supplies to Ukraine, including heavy weapons, posed a threat to the security of the European continent \"and provoke instability\".\n\"We need to be prepared for the long term,\" Stoltenberg told a youth summit in Brussels. \"There is absolutely the possibility that this war will drag on and last for months and years.\"\nThe Nato chief said the West would continue to put maximum pressure on Russian President Vladimir Putin to end the invasion of Ukraine, which Moscow calls a \"special military operation\", through sanctions and economic as well as military aid to Kyiv.\n\"Nato allies are preparing to provide support over a long period of time and also help Ukraine to transit, move from old Soviet-era equipment to more modern Nato-standard weapons and systems that will also require more training,\" Stoltenberg said.\nMost of the heavy weapons Nato countries have sent to Ukraine so far are Soviet-built arms still in the inventories of east European Nato member states, but the United States and some other allies have started to supply Kyiv with Western howitzers.\nGermany on Tuesday announced the shipment of Gepard tanks equipped with anti-aircraft guns to Ukraine, the first time Berlin has approved heavy weapons deliveries for Kyiv.\nUkraine's pleas for heavy weapons have intensified since Moscow shifted its offensive to the Donbas, an eastern region with largely flat, open terrain seen as better suited for tank battles than the areas in the north around the capital Kyiv where much of the earlier fighting took place.", "url": "https://www.straitstimes.com/world/europe/nato-says-its-ready-to-back-ukraine-for-years-in-war-against-russia"}