{"authors": [], "date_download": "2024-10-12 14:06:51", "date_modify": "2024-10-12 14:06:51", "date_publish": "2022-10-07 13:07:52", "description": "Commanders and soldiers say they have to keep pushing before the Russian side could regroup. Read more at straitstimes.com.", "filename": "world_europe_they-are-in-a-panic-ukraines-troops-size-up-the-enemy_1728742011.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/KWl9_bG7tfQGUk85qVBxKqdgsGQHiDMj1YOBWGLiqh8.jpg?VersionId=BJl9yZNpR90dei8XHeskHZasxl9fn1pO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_they-are-in-a-panic-ukraines-troops-size-up-the-enemy_1728742011.html", "title": "'They are in a panic': Ukraine's troops size up the enemy", "title_page": "'They are in a panic': Ukraine's troops size up the enemy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "STAVKY, Ukraine - Racing down a road with his men in pursuit of retreating Russian soldiers, a battalion commander came across an abandoned Russian armoured vehicle, its engine still running.\nInside there was a sniper rifle, rocket propelled grenades, helmets and belongings. The men were gone.\n\"They dropped everything: personal care, helmets,\" said the commander, who uses the code name Swat. \"I think it was a special unit, but they were panicking. It was raining very hard, the road was bad and they drop everything and move.\"\nAfter months of static fighting and holding the line under withering Russian artillery barrages, Ukrainian soldiers are exulting over their smashing of Russian lines in the northeast three weeks ago, and their recapturing of swaths of territory seized by Russian troops earlier this year.\nThey have almost retaken the whole of Kharkiv province, as well as territory in each of the four regions that President Vladimir Putin claims to have annexed for Russia.\nThere has been little time for reflection for the Ukrainians as they press their counterattack, focused on keeping the pressure on the retreating Russian army to prevent it from regrouping.\nYet after months in the trenches never seeing the faces of the enemy, Ukrainian soldiers and commanders have now engaged the Russians up close and had a chance to size up their opponent.\n\"We have the strength to do this,\" Swat said. \"Because right now they are in panic, they really are in panic.\"\nA 58-year-old career soldier, Swat came out of retirement to join the Carpathian Sich, a volunteer battalion, taking over command after his predecessor was killed in battle near Izyum in June.\nThe battalion has been in the forefront of the fighting, providing flanking support in battles for the strategically important cities of Izyum and Lyman in recent weeks.\nFour days ago the battalion seized another town farther east, helping secure a series of dams and the last settlements of northern Donetsk province for Ukraine.\nThe battles have been fast moving, and in the flight from Izyum, produced a great deal of panic on the Russian side. After the capture of Izyum, Swat said, his unit pursued Russian troops for 15 miles (24km) down the road in one day.\nA few more days and Ukrainian troops were at the gates of Lyman, 30 miles south of Izyum; Swat's group moved east to block any attempt by the Russian army to send reinforcements.\nThe day Lyman fell, his battalion was attacking another town farther east. He asked for security reasons not to disclose the location. His units captured the town in a day, without losses, although nine soldiers were wounded.\nIt has been a steep learning curve for his men, not only in survival but in humanity. A 27-year-old American platoon commander from his battalion, who uses the code name Boris, said one of his most intense moments of the war came when he held a cup of water for a Russian prisoner to drink.\nBut the fighting units had little time to chase deserters.\nIn some places, local residents told them they were sheltering Russian soldiers who had either fled their posts or been left behind, but Swat said he did not have time to stop.\nAnd in the past few days, he said, Ukrainian air reconnaissance tracked Russian units pulling out on foot through the forests using good military tactics - spreading out, moving slowly - but again his units were too tied up to pursue them.\nThe platoon commander named Boris said their units had carried out several assaults on Izyum from the southwest in the weeks before the counterattack, luring the Russians into reinforcing in that direction. When the full force of the counterattack came from the north, they were not expecting it, he said.\nThat does not mean there was not resistance.\nThe Russians were often set up in well dug-in machine gun nests, several Ukrainian commanders and soldiers said. And once Russian troops pull back, there can be heavy bombardment from Russian planes, artillery and long-range missiles.\nA powerful missile strike demolished a former Russian command post in the town they seized recently, killing five of his men, he said.\nHe and his men all voiced concern about the mobilisation in Russia, and the new strength it would bring to the Russian side.\nThe Ukrainian army is growing stronger, but it is not yet where it needs to be, Swat said.\n\"For all these small victories, it was a very, very tough time,\" he said of the last seven months of the war. \"Slowly we recover, but we are not there yet. And Russia has a lot of power, and it is unlimited in its weapons.\"\nIn the village of Stavky, some 10 miles from the front line, the sounds of the Russian bombardment of recently recaptured settlements to the east were loud enough for soldiers and civilians to stop talking and listen.\nBut commanders and soldiers seemed to agree that Ukrainian troops should keep pushing before the Russian side could regroup.\n\"We have only one month to do this right now, because right now they are in panic,\" Swat said. And winter was closing in. \"Now we need to get winter clothes, and we are going to have mud.\" NYTIMES", "url": "https://www.straitstimes.com/world/europe/they-are-in-a-panic-ukraines-troops-size-up-the-enemy"}