{"authors": [], "date_download": "2024-10-12 14:04:35", "date_modify": "2024-10-12 14:04:35", "date_publish": "2023-01-07 02:52:09", "description": "It is part of a new phase of support for Ukraine coordinated with the US. Read more at straitstimes.com.", "filename": "world_europe_germany-to-send-ukraine-40-armoured-vehicles-by-spring_1728741875.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/07/FILES-GERMANY-RUSSIA-UKRAINE-CONFLICT-DEFENCE-091950_0.jpg?VersionId=nIgI8YTG3JftrLihlQpZqL3F0bpf8Ro1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_germany-to-send-ukraine-40-armoured-vehicles-by-spring_1728741875.html", "title": "Germany to send Ukraine 40 armoured vehicles by spring", "title_page": "Germany to send Ukraine 40 armoured vehicles by spring | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - Germany will supply Ukraine with about 40 Marder infantry fighting vehicles within weeks as part of a new phase of support coordinated with the US, a government spokesman said on Friday.\nUS President Joe Biden and German Chancellor Olaf Scholz announced on Thursday that both their countries will send powerfully armed infantry fighting vehicles to help Ukraine repel Russia’s invasion.\nThe United States will supply Bradleys – which usually come armed with 25 mm autocannon, a 7.62 mm machine-gun and anti-tank missiles – and Germany the Marders, they said.\nGerman government spokesman Steffen Hebestreit on Friday said around 40 Marders would be sent, or enough to equip a battalion.\n“These 40 vehicles are to be ready in the first quarter so that they can then be handed over to Ukraine,” he said, adding that training for Ukrainian soldiers to use the vehicles would be provided in Germany.\nUkraine has long pushed for heavier weaponry, including tanks, that would allow it to go on the offensive. Western nations have been reluctant, citing fears of becoming drawn into the war or provoking Russia.\nBut the Ukrainians have built momentum and Western nations have been expanding the range of weapons being provided.\nThe US-German announcement came a day after France promised to deliver AMX-10 RC light tanks – a vehicle that is wheeled rather than tracked but which shares the much heavier cannon typical on a tank.\nGermany also said it will follow the United States in sending a state-of-the-art Patriot missile air defence system to Ukraine.\nThe Russian embassy in Berlin on Friday condemned the planned new deliveries as “a further step towards the escalation of the conflict in Ukraine”.\n“It is particularly cynical that this decision was taken shortly before the Orthodox Christmas... against the backdrop of the ceasefire declared unilaterally by the Russian President (Vladimir Putin),” it said.\nMr Putin’s order given to stop fighting for 36 hours has been slammed by Western allies and Ukrainian President Volodymyr Zelensky, who said it “cannot and should not be taken seriously”. AFP", "url": "https://www.straitstimes.com/world/europe/germany-to-send-ukraine-40-armoured-vehicles-by-spring"}