{"authors": [], "date_download": "2024-10-12 14:04:54", "date_modify": "2024-10-12 14:04:54", "date_publish": "2022-06-08 08:47:41", "description": "Investigators in the Kyiv suburb of Bucha say they have found evidence of mass executions. Read more at straitstimes.com.", "filename": "world_europe_ukraine-launching-book-of-executioners-to-detail-war-crimes_1728741894.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/08/AK_ukrwar_080622.jpg?VersionId=1Y7fBzUiSiZFkMHBOem2_V3dmiAFGxC0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-launching-book-of-executioners-to-detail-war-crimes_1728741894.html", "title": "Ukraine launching 'Book of Executioners' to detail war crimes", "title_page": "Ukraine launching 'Book of Executioners' to detail war crimes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV (REUTERS) - Ukraine is launching a \"Book of Executioners\", a system to collate evidence of war crimes Kyiv says were committed during Russia's occupation, President Volodymyr Zelensky said on Tuesday (June 7).\nUkrainian prosecutors say they have registered more than 12,000 alleged war crimes involving more than 600 suspects since the Kremlin started its offensive on Feb 24.\n\"Next week, a special publication is to be launched - 'The Book of Executioners' - an information system to collect confirmation of data about war criminals, criminals from the Russian army,\" Mr Zelensky said in a video address.\nHe said this would be a key element in his longstanding pledge to bring to account Russian servicemen who have committed what Ukrainian authorities have described as murders, rape and looting.\n\"These are concrete facts about concrete individuals guilty of concrete cruel crimes against Ukrainians,\" Mr Zelensky said.\nHe cited the Kyiv suburb of Bucha, where investigators found what they say is evidence of mass executions.\nRussia says it has gone out of its way to avoid targeting civilians in its \"special military operation\" in Ukraine.\nRussian officials have specifically dismissed pictures of events in Bucha as \"fabrications\" staged by Ukrainian authorities after Russian forces left the town at the end of March.", "url": "https://www.straitstimes.com/world/europe/ukraine-launching-book-of-executioners-to-detail-war-crimes"}