{"authors": [], "date_download": "2024-10-12 14:02:53", "date_modify": "2024-10-12 14:02:53", "date_publish": "2023-05-17 10:15:00", "description": "This comes after US President Joe Biden cancelled his attendance at the summit. Read more at straitstimes.com.", "filename": "world_australia-pm-says-quad-meeting-will-not-go-ahead-in-sydney-next-week_1728741773.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/17/2023-05-05T084151Z1083223995RC28S0AQ5NEHRTRMADP3BRITAIN-AUSTRALIA_1.JPG?VersionId=BTevn6oYGW78c1GwaGYulVBbFJPUim0_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_australia-pm-says-quad-meeting-will-not-go-ahead-in-sydney-next-week_1728741773.html", "title": "Australia cancels Quad meeting in Sydney after Biden’s trip postponement", "title_page": "Australia cancels Quad meeting in Sydney after Biden’s trip postponement | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SYDNEY – Australian Prime Minister Anthony Albanese said on Wednesday a Quad summit would not go ahead in Sydney next week without United States President Joe Biden, who postponed his trip to Australia due to debt ceiling negotiations in Washington.\nMr Albanese said the leaders of Australia, the US, India and Japan would instead meet at the G7 summit in Japan this weekend, after Mr Biden cancelled a trip to Sydney on the second leg of his upcoming Asia trip. It was also to have included a visit to Papua New Guinea.\n“The Quad leaders meeting will not be going ahead in Sydney next week. We, though, will be having that discussion between Quad leaders in Japan,” Mr Albanese told a news conference.\nA bilateral programme in Sydney with Indian Prime Minister Narendra Modi could still go ahead next week, he added.\nMr Albanese did not comment on whether Japanese Prime Minister Fumio Kishida would still visit Sydney next week.\nThe Quad is an informal group that promotes an open Indo-Pacific. Beijing sees it as an attempt to push back against its growing influence in the region.\nAsia Society Policy Institute senior fellow Richard Maude said the cancellation of Mr Biden’s visit to Papua New Guinea, which would have been the first by an American president to an independent Pacific islands nation, could set back Washington’s battle for influence with Beijing in the region.\n“The mantra in the region is all about turning up. Turning up is half the battle. China turns up all the time, and so the optics aren’t great,” Mr Maude, a former Australian intelligence chief, told a panel discussion on the Quad on Wednesday.\nIndia and Australia are not part of the G7 group of seven rich nations – Britain, Canada, France, Germany, Italy, Japan and the US – but have been invited to attend the summit in Japan.", "url": "https://www.straitstimes.com/world/australia-pm-says-quad-meeting-will-not-go-ahead-in-sydney-next-week"}