{"authors": [], "date_download": "2024-10-12 14:01:54", "date_modify": "2024-10-12 14:01:54", "date_publish": "2022-06-27 19:40:46", "description": "The move will help the alliance have more combat-ready forces ready on short notice in case of a crisis. Read more at straitstimes.com.", "filename": "world_nato-to-massively-increase-high-readiness-forces-to-300000_1728741714.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/06/27/hznato270622.jpg?VersionId=RZ9zKy9ygVqQMRTUH4H98djcuMJcpEyz&h=019f7d45", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_nato-to-massively-increase-high-readiness-forces-to-300000_1728741714.html", "title": "Nato to massively increase high-readiness forces to 300,000: Stoltenberg", "title_page": "Nato to massively increase high-readiness forces to 300,000: Stoltenberg | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MADRID (REUTERS) - Nato will increase the number of its forces at high readiness massively to over 300,000, Secretary-General Jens Stoltenberg said on Monday (June 27), with allies set to adopt a new strategy describing Moscow as a direct threat four months into the Ukraine war.\n“Russia has walked away from the partnership and the dialogue that Nato has tried to establish with Russia for many years,” Stoltenberg said in Brussels ahead of a Nato summit later this week in Madrid.\n“They have chosen confrontation instead of dialogue. We regret that – but of course, then we need to respond to that reality,” he told reporters.\nThe June 28-29 summit comes at a pivotal moment for the alliance after failures in Afghanistan and internal discord during the era of former US President Donald Trump, who threatened to pull Washington out of the alliance.\nBut Russia’s February invasion of Ukraine has sparked a geopolitical shift, prompting once neutral countries Finland and Sweden to apply to join Nato and Ukraine to secure the status of candidate to join the European Union.\nStoltenberg said Nato would transform its existing quick reaction force, the Nato Response Force, which already has some 40,000 troops on high readiness, and raise the overall number to “well over 300,000”.\nThe move is part of Nato’s work on a new force structure that will likely see national troops put on different alert levels so the alliance has more combat-ready forces ready on short notice in case of a crisis.\nAt the summit, Nato will also change its language on Russia from the current wording, enshrined at its Lisbon summit in 2010, describing Moscow as a strategic partner.\n“I expect the allies will state clearly that Russia poses a direct threat to our security, to our values, to the rules-based international order,” Stoltenberg said.\nNato combat units on the alliance’s eastern flank, especially in the Baltics, are to be boosted to brigade level, with thousands of pre-assigned troops on standby in countries further west like Germany as rapid reinforcements, he added.\n“Together, this constitutes the biggest overhaul of our collective deterrence and defence since the Cold War,” he said.\nAt the same time, Stoltenberg dampened hopes for a break-through at the summit to overcome Turkey’s opposition to the membership bids of Sweden and Finland.\n“I will not make any promises or speculate about any specific time lines, The summit has never been a deadline,” said Stoltenberg, who is scheduled to meet the leaders of all three countries in Madrid on Tuesday.", "url": "https://www.straitstimes.com/world/nato-to-massively-increase-high-readiness-forces-to-300000"}