{"authors": [], "date_download": "2024-10-12 14:01:42", "date_modify": "2024-10-12 14:01:42", "date_publish": "2024-02-18 20:51:00", "description": "Kyiv said it had withdrawn its soldiers to save troops from being fully surrounded after months of fighting. Read more at straitstimes.com.", "filename": "world_russia-takes-avdiivka-from-ukraine-biggest-gain-in-9-months_1728741702.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/18/LYNXNPEK1H00I-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_russia-takes-avdiivka-from-ukraine-biggest-gain-in-9-months_1728741702.html", "title": "Russia takes Avdiivka from Ukraine in biggest gain in 9 months", "title_page": "Russia takes Avdiivka from Ukraine in biggest gain in 9 months | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MOSCOW/KYIV – Russia on Feb 18 said it had full control of the Ukrainian town of Avdiivka after Ukraine withdrew, though Moscow said some Ukrainian troops were still holed up in a vast Soviet-era coke plant after one of the most intense battles of the war.\nThe fall of Avdiivka is Russia’s biggest gain since capturing the city of Bakhmut in May 2023, and comes almost two years to the day since President Vladimir Putin triggered a full-scale war by ordering the invasion of Ukraine.\nRussia’s Defence Ministry said its troops had advanced 8.6km in that part of the 1,000km front line, and Russian troops were pressing forward after a deadly urban battle that has left the town an almost completely depopulated wreck.\nUkraine said it had withdrawn its soldiers to save troops from being fully surrounded after months of fierce fighting.\nMr Putin hailed the fall of Avdiivka as an important victory and congratulated Russian troops.\nAfter Ukraine’s failure to pierce Russian lines in 2023, Moscow has been trying to grind down Ukrainian forces just as Kyiv ponders a major new mobilisation and President Volodymyr Zelensky appoints a new commander to run the war.\n“The head of state congratulated Russian soldiers on this success, an important victory,” the Kremlin said in a statement on its website.\nBut Russia said some Ukrainian forces were still holed up at the Soviet-era coke plant, once one of Europe’s biggest, in Avdiivka, which is key to Russia’s aim of securing full control of the industrial Donbas region.\n“Measures are being taken to completely clear the town of militants and to block Ukrainian units that have left the town and are entrenched at the Avdiivka Coke and Chemical Plant,” Russian Defence Ministry spokesman Igor Konashenkov said.\nThere was no public comment yet by the Ukrainian authorities on this.\nMr Putin sent tens of thousands of troops into Ukraine in February 2022, triggering the full-scale war after eight years of conflict in eastern Ukraine between Ukrainian forces on the one side and pro-Russian Ukrainians and Russian proxies on the other.\nAvdiivka, which is called Avdeyevka by Russians, has endured a decade of conflict.\nIt holds particular symbolism for Russia as it was briefly taken in 2014 by Moscow-backed separatists who seized a swathe of eastern Ukraine but was then recaptured by Ukrainian troops who built extensive fortifications.\nWeapons shortages\nUS President Joe Biden had warned that Avdiivka could fall to Russian forces because of ammunition shortages, following months of Republican congressional opposition to a new US military aid package for Kyiv.\nA White House statement said Mr Biden called Mr Zelensky on Feb 17 to underscore the US commitment to continue supporting Ukraine and reiterated the need for Congress to urgently pass the package.\nThe White House said the withdrawal had been forced upon Ukraine “by dwindling supplies as a result of congressional inaction”, which forced Ukrainian soldiers to ration ammunition and resulted in “Russia’s first notable gains in months”.\nMr Zelensky urged allies at a global security conference in Munich on Feb 17 to plug an “artificial” shortage of weapons and said stalled US aid was imperative.\nBoost for Russia\nCapturing Avdiivka is likely to provide a morale boost for Russia ahead of Mr Putin’s bid for re-election in March, which he is almost certain to win.\nIt is seen also as another step towards securing Moscow’s hold on the regional centre of Donetsk, about 20km to the east, held by Russian and pro-Russian forces since 2014.\nNeither Russia nor Ukraine has given details of its losses in the war or in the intense battle for Avdiivka.\nWestern intelligence assessments say hundreds of thousands of men on both sides have been killed or wounded in the war.\nMr Putin congratulated the Russian commander in charge of the assault on Avdiivka, Colonel-General Andrei Mordvichev.\n“Eternal glory to the heroes who fell in fulfilling the tasks of the special military operation!” Mr Putin said in a telegram.\nUkrainian Defence Minister Rustem Umerov said Avdiivka showed the need for modern air defence systems to counter guided bombs and long-range weapons to destroy enemy formations.\nHe said artillery shells were also needed.\nColonel-General Oleksandr Syrskyi, who took command of the Ukrainian military in a major shake-up last week, said Ukrainian forces had moved back to more secure positions outside the town “to avoid encirclement and preserve the lives and health of servicemen”.\nUkraine’s Third Assault Brigade, which officials said was deployed to Avdiivka this week, said on the Telegram messaging platform that it had pulled back to prepared positions on the outskirts of Avdiivka and evened out the front line.\n“At this time, the Russians are not slowing down their assault. We keep holding the line in the area of Avdiivka,” it said.\nSeparately, Ukrainian forces repelled a Russian offensive on the southern front in the area of Zaporizhzhia, the Ukrainian military said on Feb 18.\nThere was no comment on that yet from the Russian side. REUTERS", "url": "https://www.straitstimes.com/world/russia-takes-avdiivka-from-ukraine-biggest-gain-in-9-months"}