{"authors": ["Eileen Ng"], "date_download": "2024-10-12 13:54:09", "date_modify": "2024-10-12 13:54:09", "date_publish": "2023-11-06 17:40:00", "description": "Some activists protested outside a farm where the sheep was to be rehomed, claiming the move would make her a “spectacle”. Read more at straitstimes.com.", "filename": "world_europe_a-brand-new-look-for-britain-s-loneliest-sheep-after-rescue-from-cliff_1728741249.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/06/aisheep061123.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_a-brand-new-look-for-britain-s-loneliest-sheep-after-rescue-from-cliff_1728741249.html", "title": "Britain’s loneliest sheep gets a new look and forever home after rescue from cliff", "title_page": "Britain’s loneliest sheep gets a new look and forever home after rescue from cliff | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The ewe dubbed Britain’s loneliest sheep is looking much slimmer and sharper after her recent “makeover” following her rescue from the foot of a Scottish Highlands cliff.\nShe has also settled into her new forever home and is doing “absolutely great”, said the manager of a farm which offered to rehome her.\nRescuers sheared the thick, matted coat on the sheep, now named Fiona, which had been stranded for two years before a group of five farmers rescued her on Saturday.\nMr Cammy Wilson, one of her rescuers, said the shearers “went with the old school hand shears for this job”, so that she would be left with a reasonable layer of wool to keep her warm during winter.\n“Fiona was amazing, she sat perfectly still the whole way through. I’ve never worked with such a calm sheep. It was incredible,” said Mr Wilson, who posted an update of the ewe on Facebook on Monday.\nWhile he did not reveal the weight of the “massive fleece”, Mr Wilson said the wool will be sent to British wool company Wooldale Wool to be made into “something amazing that we can raffle off for charity”.\nFiona was first spotted by Ms Jillian Turner during a kayaking trip in 2021. During a recent trip, she was horrified to see the same sheep – which was then sporting overgrown fleece.\nDescribing the situation as “heart-rending”, Ms Turner said: “The poor ewe has been on her own for at least two years – for a flock animal that has to be torture, and she seemed desperate to make contact with us on the two occasions we’d gone past her.”\nBritish newspapers reported on this, calling the ewe “Britain’s loneliest sheep”, which prompted animal lovers to call for her rescue.\nWhile many people were happy that Fiona had finally been rescued, a group of animal activists protested on Sunday outside Dalscone Farm Fun where the sheep was supposed to be rehomed, claiming that the move would make her a “spectacle”.\n“We’re going to give Fiona a five-star home, we are going to get her some amazing friends,” he said in a Facebook video.\nHe said the farm is closed for winter for the next five months, which will allow her “loads of time to settle in”.\n“Nobody’s going to be bugging her, we’ll just get to know her, let her do her own thing,” said Mr Best, who added that their animal track record is “impeccable”.\n“We are literally giving her the best home she could possibly get – and it’s being blocked at the moment. And it’s a crying shame.”\nBut in a live video update on Monday, Mr Best said Fiona had arrived at her “forever home” in Dalscone Farm on Sunday night.\n“She got in under the cover of darkness… We have to keep everything almost under wraps while we got her here under minimal fuss,” he said, adding that the farm is the right place for her.\nHe said Fiona has a “super chilled” temperament and has settled in and is doing “absolutely phenomenal”.\n“The world’s loneliest sheep is lonely no more.”", "url": "https://www.straitstimes.com/world/europe/a-brand-new-look-for-britain-s-loneliest-sheep-after-rescue-from-cliff"}