{"authors": [], "date_download": "2024-10-12 14:05:27", "date_modify": "2024-10-12 14:05:27", "date_publish": "2022-10-15 17:41:52", "description": "Foreign minister says Teheran believes arming either side will only prolong the war. Read more at straitstimes.com.", "filename": "world_europe_iran-denies-providing-russia-with-drones-blamed-for-attacks-across-ukraine_1728741927.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/15/ads-missile-151022.jpg?VersionId=_PG7gfZleU5Kv92_d4xDFQUpm1o_Ft79", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_iran-denies-providing-russia-with-drones-blamed-for-attacks-across-ukraine_1728741927.html", "title": "Iran denies providing Russia with drones blamed for attacks across Ukraine", "title_page": "Iran denies providing Russia with drones blamed for attacks across Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TEHERAN - Iran has once again rejected allegations that it has supplied Russia with weapons \"to be used in the war in Ukraine\", its foreign ministry said on Saturday.\nKyiv and many of its Western allies have accused Moscow of using Iranian-made drones in attacks on Ukraine in recent weeks. The topic is expected to be discussed by European Union foreign ministers in a meeting in Luxemburg on Monday.\nIranian Foreign Minister Hossein Amir-Abdollahian \"emphasised that the Islamic republic of Iran has not and will not provide any weapon to be used in the war in Ukraine\", the foreign ministry said in a statement.\nSeparately, Mr Amir-Abdollahian said in a call with his Portuguese counterpart, Mr Joao Gomes Cravinho, that Iran believes \"arming of each side of the crisis will prolong the war\".\n\"We have not considered, and do not consider, war to be the right path either in Ukraine or in Afghanistan, Syria and Yemen,\" he said.\nIn a separate phone call with EU foreign policy chief Josep Borrell on Friday, he reiterated Iran's official stance of neutrality over the war that started nearly eight months ago.\n\"We have defence cooperation with Russia, but our policy regarding the war in Ukraine is not sending weapons to the conflicting parties, stopping the war and ending the displacement of people,\" he said.\nOn Monday, Ukrainian President Volodymyr Zelensky said Iranian drones were used in Russian attacks on energy infrastructure in several Ukrainian cities.\nLast month, Kyiv decided to significantly reduce its diplomatic relations with Teheran over alleged arms deliveries to Russia.\nIran said the decision was \"driven by baseless information provided by foreign media propaganda\".\nIn September, the United States slapped sanctions on a company it accused of helping deliver Iranian drones to Russia for use in Ukraine. AFP", "url": "https://www.straitstimes.com/world/europe/iran-denies-providing-russia-with-drones-blamed-for-attacks-across-ukraine"}