{"authors": [], "date_download": "2024-10-12 13:39:48", "date_modify": "2024-10-12 13:39:48", "date_publish": "2024-10-08 15:52:46", "description": "BUCHAREST - Romania's top court said a far-right candidate's pro-Russian, anti-European Union and anti-NATO opinions made her ineligible to run for president in an upcoming election in a ruling which threatened to topple the coalition government. Read more at straitstimes.com.", "filename": "world_europe_romanias-top-court-says-it-barred-candidate-from-presidential-race-over-pro-russian-views_1728740388.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/08/LYNXMPEK97089-1.jpg?VersionId=syRerltKuiRsApay8YVsf4AkPH_FvNqL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_romanias-top-court-says-it-barred-candidate-from-presidential-race-over-pro-russian-views_1728740388.html", "title": "Romania's top court says it barred presidential candidate over pro-Russian views", "title_page": "Romania's top court says it barred presidential candidate over pro-Russian views | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BUCHAREST - Romania's top court said a far-right candidate's pro-Russian, anti-European Union and anti-NATO opinions made her ineligible to run for president in an upcoming election in a ruling which threatened to topple the coalition government.\nThe Constitutional Court decided late on Saturday to remove Diana Sosoaca, leader of small ultra-nationalist eurosceptic opposition party SOS Romania from the list of candidates, but only published an explanation of its ruling late on Monday.\nThe ruling prompted politicians across the political spectrum to voice concerns the court was overstepping its powers. Dozens of civil rights groups signed an open letter saying the ruling was \"a serious turn towards illiberalism.\"\nIt has also escalated tensions in the ruling coalition of leftist Social Democrats (PSD) and centre-right Liberals, whose leaders are both running in the election, raising doubts about the two parties continuing in an alliance after polls.\nEuropean Union and NATO member Romania is due to hold a two-round presidential election on Nov. 24 and Dec. 8, with parliamentary polls in between.\nLiberal Party leader Nicolae Ciuca accused the PSD of influencing the court's decision, which the party has denied.\n\"Our coalition government with PSD stops here,\" Ciuca said on Facebook. \"We will remain in government only to prevent the complete escalation of abuses they could make to win elections.\"\nOn Tuesday, the opposition Save Romania Union (USR) said it plans to file a no confidence motion against the government and called on the Liberals to back it. USR does not have enough parliamentary seats to file a motion alone.\n\"The Liberals said they want to leave government, we are expecting their ... signatures,\" USR leader Elena Lasconi, also a presidential candidate, told reporters.\nThe court argued that Sosoaca's public opinions made her unable to uphold the presidential vow to respect the constitution and protect democracy should she be elected.\nA majority of five out of nine judges, four of whom were backed by the Social Democrats, said Sosoaca's statements were sufficient grounds to indicate that she \"questions and disregards the obligation to respect the Constitution through her public discourse calling for the removal of fundamental state values and choices, namely EU and NATO membership.\"\nSosoaca, a European Parliament member, is known for anti-Semitic and pro-Russian views. But some politicians said removing her right to stand for election undermined the rule of law and set a dangerous precedent. REUTERS", "url": "https://www.straitstimes.com/world/europe/romanias-top-court-says-it-barred-candidate-from-presidential-race-over-pro-russian-views"}