{"authors": [], "date_download": "2024-10-12 14:12:23", "date_modify": "2024-10-12 14:12:23", "date_publish": "2024-05-15 19:04:01", "description": "He has been trying to rebuild social media since 2021. Read more at straitstimes.com.", "filename": "world_united-states_real-estate-billionaire-frank-mccourt-who-wants-to-improve-the-internet-says-readying-tiktok-bid_1728742343.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/15/US20Tik.JPG?VersionId=xnGSoI3iPGm3k0q2EbWhmpfHxAiWMgcq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_united-states_real-estate-billionaire-frank-mccourt-who-wants-to-improve-the-internet-says-readying-tiktok-bid_1728742343.html", "title": "Real estate billionaire Frank McCourt, who wants to improve the internet, plans TikTok bid", "title_page": "Real estate billionaire Frank McCourt, who wants to improve the internet, plans TikTok bid | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Mr Frank McCourt, a US real estate billionaire with ambitions to improve the web, said he plans to build a consortium to buy the US arm of social media website TikTok.\n“We see this potential acquisition as an incredible opportunity to catalyse an alternative to the current tech model that has colonised the internet,” Mr McCourt said in a statement on May 15.\nMr McCourt, former owner of the Los Angeles Dodgers, has been trying to rebuild social media since 2021, when he poured US$100 million (S$135 million) into an initiative called Project Liberty to take on Facebook and other internet giants, Bloomberg News previously reported.\nDescribing the effort to buy TikTok as “the people’s bid”, Mr McCourt is working with investment bank Guggenheim Securities, legal firm Kirkland & Ellis, and a number of unnamed academics and technologists, according to the statement.\nThe bid is also supported by Mr Tim Berners-Lee, who created the World Wide Web.\nA new federal law requires TikTok’s parent, China-based ByteDance, to sell the app within a year or face a ban in the US. It is challenging the measure in court.\nTikTok did not immediately respond to a request for comment. BLOOMBERG", "url": "https://www.straitstimes.com/world/united-states/real-estate-billionaire-frank-mccourt-who-wants-to-improve-the-internet-says-readying-tiktok-bid"}