{"authors": [], "date_download": "2024-10-12 14:01:12", "date_modify": "2024-10-12 14:01:12", "date_publish": "2024-04-20 19:16:10", "description": "It comes amid a Russian airstrike campaign that has battered Ukraine’s energy system and pounded its cities in recent weeks. Read more at straitstimes.com.", "filename": "world_europe_ukraine-drone-attack-sets-ablaze-russian-fuel-depot-hits-susbtations-kyiv-source-says_1728741672.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/21/imgonline-com-ua-FrameBlurred-ntnJLSEi9IPFDP4h.jpg?VersionId=Wfgupu.ihC8OPtMIKVuK_gQev2HV0EJn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/world_europe_ukraine-drone-attack-sets-ablaze-russian-fuel-depot-hits-susbtations-kyiv-source-says_1728741672.html", "title": "Ukrainian drones strike Russian fuel depot, substations in major attack", "title_page": "Ukrainian drones strike Russian fuel depot, substations in major attack | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV – Ukraine attacked eight Russian regions with dozens of long-range strike drones, setting ablaze a fuel depot and hitting three power substations in a major attack early on April 20, an intelligence source in Kyiv told Reuters.\nThe overnight attack, which was confirmed by the defence ministry in Moscow, comes amid a Russian airstrike campaign that has battered Ukraine’s energy system and pounded its cities in recent weeks.\nFacing mounting pressure on the battlefield more than two years since Russia’s full-scale invasion, Ukraine has tried to find a pressure point against the Kremlin by targeting oil refineries and energy facilities inside Russia using drones.\n“At least three electrical substations and a fuel storage base were hit, where fires ignited,” the Ukrainian source said, citing social media videos showing fires raging at different locations.\nThe source said the facilities were targeted for supporting Russian military industrial production.\nRussia’s defence ministry said it shot down 50 Ukrainian drones, including 26 in the Belgorod region, 10 in the Bryansk region, eight in Kursk region, two in Tula region as well as one in each of the regions of Smolensk, Ryazan, Kaluga and Moscow.\nMr Vyacheslav Gladkov, the governor of Russia’s Belgorod region which borders Ukraine, said two civilians were killed as a result of the attack.\nThe strike targeted a fuel energy facility in the western Smolensk region’s Kardym district, hitting a reservoir with fuel and oil lubricants, the local governor confirmed.\n“As a result of the work of air defence forces, the aircraft were shot down. However, as a result of falling debris, a tank with fuel and oil lubricants caught fire,” he said, adding that firefighters were battling to put out the blaze.\nIt was not clear if anyone had been hurt, he said.\nAll eyes on aid Bill\nOn April 20, Ukrainians waited in anticipation for a vote in the US House of Representatives that could finally help unlock more than US$60 billion (S$80 billion) in aid for Ukraine that has been held up for months.\nThe governor of Dnipropetrovsk region, Mr Serhiy Lysak, said a Russian attack killed a man near the city of Dnipro while Russian artillery hit areas near Nikopol, a frequent target opposite the Russian-held Zaporizhzhia nuclear power plant.\nIn southern Odesa region, Governor Oleh Kiper said a missile attack on the port city injured three people, including a child. A military statement said three missiles had been intercepted.", "url": "https://www.straitstimes.com/world/europe/ukraine-drone-attack-sets-ablaze-russian-fuel-depot-hits-susbtations-kyiv-source-says"}