{"authors": ["Chantal Sajan"], "date_download": "2024-10-12 13:32:27", "date_modify": "2024-10-12 13:32:27", "date_publish": "2024-08-09 14:00:00", "description": "Leading mattress brand Sealy’s latest sleep study shows that untested mattresses bought online are more likely to cause aches and pains. Read more at straitstimes.com.", "filename": "life_home-design_global-sleep-census-shows-more-young-singaporeans-suffering-from-back-pain_1728739947.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/09/SP2220-20Talent20Lifestyle20In20Bed20V220Curtains20Open20Full20Scale20HR.jpg?VersionId=GjOA8.MsV.W4VcmBif2dYrnk.b._RMzb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_home-design_global-sleep-census-shows-more-young-singaporeans-suffering-from-back-pain_1728739947.html", "title": "Global sleep census shows more young Singaporeans suffering from back pain", "title_page": "Global sleep census shows more young Singaporeans suffering from back pain | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A sleep survey by leading mattress brand Sealy polling more than 20,000 people worldwide revealed that 92 per cent of the respondents said that most mornings, they woke up not feeling refreshed or well rested.\nIt is worse in Singapore, with 93 per cent of residents grappling with this issue.\nConducted recently by Quantum Market Research, an independent full-service Australian research firm based in South Yarra, the Sealy Global Sleep Census was done via questionnaires sent to people aged 18 to 50 and above.\nSealy is sold in the United States through Kentucky-headquartered Tempur Sealy International and in the region through Sealy Asia-Pacific, based in Brisbane, Australia.\nThe survey started on Aug 30, 2023, and ended on Sept 27, 2023, covering Britain, China, Hong Kong, Taiwan, South Korea, Australia, New Zealand, Malaysia and Singapore. Of the total polled, 49 per cent were men and 51 per cent were women.\nAmong the key local findings was that people who sleep on poor-quality mattresses that have not been personally tested prior to purchasing were more likely to suffer aches and pains.\nThe study showed that 72 per cent of Singaporeans work more than 40 hours a week, and this is among the highest rankings globally.\nAlmost half – 48 per cent – said they sleep six hours or less. This resulted in one in two Singapore respondents reporting that they have woken up experiencing back, joint or muscle pains due to the improper alignment of the spine.\nAdjunct Associate Professor Robert Labrom from Queensland University of Technology (QUT) in Brisbane, who works with Sealy on research and development (R&D) in sleep science, says sleep issues are closely related to back pain and muscular discomfort, in the lower back as well as in the cervical and shoulder blade regions.\nIn other words, it appears that there is a strong need to ensure comfortable sleep in order to manage one’s neck and back pain.\n“Treatments for back pain and sleep problems go hand in hand,” says Prof Labrom, who is also an adult and paediatric spinal surgeon at The Wesley Hospital in Queensland, Australia.\n“Sleep laboratories are also very aware of the importance of maximising respiratory function and performance in such patients through providing mattresses and sleep conditions that ideally place a person’s body, head and neck in a position that remains suitable for safe respiratory function.”\nBack pain is not just affecting the older population.\nAround 60 per cent of Singapore residents aged between 18 and 34 said they have back pain. The survey also highlighted that mattress quality played a significant role in promoting good sleep.\nIn this light, investing in a good mattress helps. Respondents willing to spend more on a mattress were more likely to be satisfied with their decision, according to the study.\nThose aged 25 and below said they were more likely to spend less than $1,499 on a new mattress. The study showed that 86 per cent in this demographic reported that they experienced significant sleep problems and 57 per cent said they suffered from back pain.\nIn Singapore, about 90 per cent of Singaporeans who spent more than $3,000 on their mattress said they were satisfied.\nThis is in stark contrast to 88 per cent of respondents, who purchased their beds online, and who reported that they had problems falling asleep and staying asleep most nights. About 65 per cent in this cohort said they experienced back pain in the mornings.\nMr Daniel Green, Sealy Asia-Pacific’s R&D manager, says the latest findings are sobering.\n“We were quite shocked to see that a growing proportion of respondents have, or may consider, purchasing their mattress online without trying it first,” he says.\nHe works with a team of engineers who use spinal alignment mannequins. The full-height humanoids are designed to simulate the way a human body moves and measure support offered by different mattress types.\nSealy Singapore stocks more than 20 types of mattresses at its flagship store, the Sealy Sleep Palace in Tanglin Road. It has six other sleep boutiques and 18 department store gallery spaces.\nMr Lee Chee Yan, Sealy Asia’s director and regional general manager, says these experiential spaces help shoppers with “test-bedding” before buying a mattress.\n“To get the right mattress will require lying down,” he says, adding that comfort is subjective and difficult to define.\n“While online websites cite information such as ‘extra firm’ or ‘plush’, who decides, and what criteria does one use to determine how a bed feels? The best way is to lie down and make sure you are happy with the mattress’ support and comfort.”\nAccording to Mr Timothy Seow, Sealy Singapore’s head of retail, staff at the flagship Tanglin store and other outlets are trained to ask questions and ascertain the needs of the customer first, such as his or her preferred comfort level.\nSome may take a shine to an extra firm bed, while others prefer a plusher, softer feel.\n“We will then show customers at least three mattresses that match their preferences and advise them to take their time to rest on their back as well as in side-sleeping positions,” Mr Seow says, adding that some customers fall asleep during test-bedding.\n“We are more like sleep facilitators than sales staff,” he quips. “It is our job to invite customers to sleep on it – literally – before making a purchase.”\nInfo: Shoppers can test mattresses at Sealy Sleep Palace at Tanglin Road, as well as the brand’s sleep boutiques and gallery spaces at department stores. Prices range from $2,399 for a Posturepedic Valour single-size mattress to $18,000 for an Exquisite Grand Princess king-size mattress. For a full list of locations, go to shop.sealy.com.sg", "url": "https://www.straitstimes.com/life/home-design/global-sleep-census-shows-more-young-singaporeans-suffering-from-back-pain"}