{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:56:14", "date_modify": "2024-10-12 13:56:14", "date_publish": "2023-06-29 15:00:00", "description": "Shop vintage luxury bags at Mint Museum of Toys’ new pop-up, Dr Dennis Gross launches non-injectable filler. Read more at straitstimes.com.", "filename": "life_style_style-news-vintage-luxury-bags-at-mint-museum-of-toys-pop-up-dr-dennis-gross-new-non-injectable-filler_1728741374.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/29/theme20design_3.jpg?VersionId=nxyiY2Bd_Eo_KmelD04aXRsnauFsmxKq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-vintage-luxury-bags-at-mint-museum-of-toys-pop-up-dr-dennis-gross-new-non-injectable-filler_1728741374.html", "title": "Style News: Vintage luxury bags at Mint Museum of Toys’ pop-up, Dr Dennis Gross’ new non-injectable filler", "title_page": "Style News: Vintage luxury bags at Mint Museum of Toys’ pop-up, Dr Dennis Gross’ new non-injectable filler | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A shopping pop-up featuring vintage luxury bags\nGet ready to be dazzled by a rare collection of vintage Chanel and Hermes bags at a pop-up shopping experience at the Mint Museum of Toys.\nOrganised by Guerrilla in collaboration with Hong Kong-based luxury e-commerce boutique My Grandfather’s Things, this three-day event will showcase a variety of discontinued styles and colourways of classic bags, such as the Chanel Diana and Hermes Kelly from the 1980s to the 2000s. The bags will be priced from $2,500 to $13,000.\nMs Stephanie Tan, My Grandfather’s Things founder and collector of these vintage handbags, will be present to offer insights, details and background of the arm candy.\nShoppers at the event can also customise their bags with housemade accessories such as bag inserts, chain wraps, scarves and more, while sipping on botanical-themed cocktails and mocktails.\nYou have heard of “Botox in a bottle”. Now, Dr Dennis Gross – a dermatologist-founded American skincare brand that was catapulted into the global limelight after the success of its Alpha Beta Peels – has come up with “fillers in a bottle”.\nIts new DermInfusions Fill + Repair Serum is a needle-free alternative to injectable fillers that promises to banish fine lines and give crepey skin a firm boost.\nThis golden elixir is packed with not just one but four types of hyaluronic acid (to target different layers of the skin), niacinamide, ectoin and a complex of four peptides.\nUsing the unique MicroCelle Delivery system, which is said to reduce the size of the ingredients, the potent formula goes deeper into the skin without leaving any sticky residue.\nPriced at $123, the DermInfusions Fill + Repair Serum is available exclusively at Sephora stores and via sephora.sg\nDrunk Elephant’s eye serum gets a retinol boost\nWhen it comes to anti-ageing creams, retinol is a good idea, even for the eyes. But, since the under-eye area is delicate, using the right retinol-infused eye product is imperative.\nAmerican beauty company Drunk Elephant has just launched the A-Shaba Eye Complex, a gentle serum with a 0.1 per cent dose of pure vegan retinol to improve skin’s elasticity and zap the appearance of fine lines and wrinkles.\nFormulated at a pH value of 5.5, which is the level of normal, healthy skin, this serum also contains 3 per cent caffeine to alleviate puffiness around the eyes, as well as copper peptides that are said to promote healthy collagen production and improve elasticity.\nOne pump, morning or night, around the eyes is all you need.\nThe Drunk Elephant A-Shaba Complex Eye Serum is priced at $98 and available at sephora.sg and Sephora stores.\nSkechers pays homage to Transformers\nTransformers fans will be excited about the Skechers X Transformers: Rise Of The Beasts shoe collection.\nInspired by the striking colours of the characters from the latest Transformers movie – such as Arcee, Bumblebee, Mirage, Optimus Prime and the leader of the Maximals, Optimus Primal – the collection features five new Skechers Stamina V3 ($159) footwear designs for adults that come with built-in Air-Cooled Memory Foam. They also have shock-absorbing soles for maximum comfort. All shoes also feature a metallic debossed print of the Transformers logo.\nChildren can choose from four designs of Skechers Foamies Hypno-Splash ($59) – Skecher’s range of light-up clogs that blink with every step – three designs of Skechers Stamina V2 ($99) and kid-size versions of the V3 range.\nThe American footwear brand’s collaboration with global entertainment leader Hasbro will also feature a range of apparel and accessories to complete the look.\nInfo: The Skechers X Transformers: Rise Of The Beasts collection is available via Skechers.com.sg, Lazada and Shopee, and at Skechers concept stores.", "url": "https://www.straitstimes.com/life/style/style-news-vintage-luxury-bags-at-mint-museum-of-toys-pop-up-dr-dennis-gross-new-non-injectable-filler"}