{"authors": ["John Tan"], "date_download": "2024-10-12 13:52:25", "date_modify": "2024-10-12 13:52:25", "date_publish": "2023-04-17 14:00:00", "description": "The Wakayama region is a respite in nature and a foodie haven near neon-lit Osaka. Read more at straitstimes.com.", "filename": "life_travel_food-and-folklore-a-journey-deep-into-japan-s-countryside_1728741145.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/18/Stamping20the20pilgrim20passport20at20shrines20of20the20Kumano20Kodo.jpg?VersionId=vkaIoauiNHGUrEKMoAdwhA4SivegEPap", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_travel_food-and-folklore-a-journey-deep-into-japan-s-countryside_1728741145.html", "title": "Food and folklore: A journey deep into Japan’s countryside", "title_page": "Food and folklore: A journey deep into Japan’s countryside | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WAKAYAMA, Japan – Borrow a spade from the hotel, dig a hole by the pebbly riverbank and hot spring water swirls up. You have just created your own mini onsen bath.\nOr go for effortless bliss. Simply sink into a milky, therapeutic hot spring set within a sea-cliff cavern carved out by the raging Pacific Ocean.\nJust as exquisite are the culinary journeys in the Wakayama countryside near Osaka.\nEnter a 180-year-old wooden building and walk on creaking floorboards past aromatic centuries-old vats. Take a deep breath: This is the birthplace of soya sauce in Japan.\nBetter still, indulge in a hotpot showcasing a fish so rare that most Japanese can only hope to savour it once in their lifetime.\nIn between these pleasurable earthly pursuits, walk in the footsteps of emperors, samurais and aristocrats who risked their lives in quest of nirvana on a thousand-year-old mountain pilgrimage trail.\nBest of all, Wakayama City, the gateway to these rewarding experiences, is just an hour’s train ride from the hustle of downtown Osaka and its flashy Glico Man.\nFor eight days during a mild winter, I trudge across twisting mountain ridges and the coastal paths of the mysterious Kii Peninsula, a rugged part of Wakayama prefecture.\nAs millions of pilgrims did before me, I weave through misty mountains shrouded in foliage, cross moss-laden log bridges over rivers, linger at shrines and feast at vibrant port cities surrounded by rich fishing grounds.\nIn the evenings, I recharge at riverside baths or windy, cinematic oceanside onsens.\nImmersed in nature, I begin to appreciate why the Japanese practise a religion that worships nature.\nMy own faith is renewed when I spot unattended roadside stands stacked with farm produce. Discreetly, a tin money box is placed at the stand for buyers to deposit their payment.\nWhen I pull over at an orchard and ask the farmer if the mandarin orange is sweet, he responds with a gift of the refreshing seedless Mikan and thanks me for visiting his home town.\nA trip to Wakayama’s countryside promises myriad uplifting experiences. Also, its inspiring Kumano Kodo pilgrimage network offers a glimpse into the Land of the Rising Sun’s complex layers of folklore, mystical practices and cultural beliefs.\nHere are five reasons the region is a feast for the eyes – and balm for mind, soul and body.\n1. Culinary delights created by ancient bacteria, and an ugly but prized fish\nI start my journey with a culinary quest to a quiet port town on the west coast called Yuasa, a pitstop for pilgrims on the ancient Kumano Kodo trail.\nThis little town made a great contribution to the culinary world when a 13th-century monk, returning from a trip to China, brought back a recipe for Kinzanji miso.\nOne day, the foodie-alchemist-monk made a chance discovery: The liquid pooled at the bottom of the vat of fermenting miso added a delicious zing to food. This was soya sauce, and Yuasa became the birthplace of the condiment.\nBreweries sprouted in Yuasa as the reputation of the condiment spread.\nToday, only a handful remain as they are squeezed out by the giant factories deploying modern food science to churn out millions of bottles of soya sauce.\nMeanwhile, the remaining Yuasa breweries steadfastly cling to their 700-year-old recipe and traditional methods. Additive-free natural soya sauce is still handmade, fermented over years in massive centuries-old wooden barrels.\nOn the way out, I pick up a bottle of aged soya sauce and a small tub of Kinzanji miso. Over the next few nights, I delight in the umami richness on plain rice or late-night instant noodles. Go to www.kadocho.co.jp\nBut there is another modern-day culinary star here: the Kue or Longtooth Grouper.\nThis is the fish most Japanese dream of eating at least once in their life. Rare and indigenous to the region, the nocturnal fish ignores baits, grows at a snail’s pace and takes decades to reach full commercial size.\nWhile it looks gruesome, the prized fish has delicate white flesh. Its light fat is balanced by a rich layer of collagen under its thick skin. Best enjoyed in a wintry hotpot, the flesh and collagen are cooked into a refined and rich broth.\nHere, the divine otoro sushi is deeply marbled with fat and looks more like a slice of raw wagyu than fish – it explodes with flavour, all at prices a fraction of what people pay in Singapore.\n2. Spiritual connections with nature\n“Congratulations, you are now one of only 3,500 hikers worldwide registered as dual pilgrims of both the Kumano Kodo and the El Camino de Santiago,” says Mr Kametani Toru, a senior official of the Kumano Hongo Heritage Centre, as he hands me the beautiful washi-paper certificate and bows deeply.\nThe Kumano Kodo pilgrimage has always been on my bucket list. Billed as a spiritual, healing and immersive journey, the network of ancient routes connects walkers with a kaleidoscope of mythical beliefs, folklore, religions and nature worship.\nIn 2004, this Asian journey joined Europe’s El Camino de Santiago hike as the world’s only two Unesco World Heritage pilgrimage routes (str.sg/i4Xt).\nMy first El Camino de Santiago pilgrimage in 2010 was the full 790km trail, from the foot of the French Pyrenees to Spain. I walked past the vineyards of fertile plains, ending at the pews of a windswept church by the Atlantic Ocean.\nThe slow journey proved to be contemplative and connected me afresh with humanity. From then on, I have been relishing purposeful, immersive travels.\nOver time, loud cities and rowdy crowds seem less attractive. Instead, I recharge better with travels closer to nature. I enjoy bonding with locals and fellow travellers, forging friendships globally.\nSimilarly, the Kumano Kodo delivers big on these values. Like the El Camino journey, I dutifully stamp my “pilgrim passport” at designated shrines and temples spaced between picturesque farmsteads, peaceful villages, misty cedar forests and serene bamboo forests.\nAnd I collect invites from new friends along the way.\nAt another nearby village is the storybook Tsubo-yu Onsen (str.sg/i4BZ). There, I persuade the tourism official to show me the famous tiny riverside wooden cabin with a mythical rock well that snugly fits only two people.\nNo, we do not share the bath, but he pulls up the blinds screening three walls and we watch kids nearby boil their breakfast eggs in a cooking bath of steaming thermal waters.\nTagged as the world’s only Unesco World Heritage Onsen, its soothing waters change colour seven times a day and is billed as Japan’s oldest bath.\nTowards the end of my journey on the east coast, I soak in Hotel Urashima’s (str.sg/i4B4) open-air bath tucked in a dramatic cathedral-like natural cave carved out by the Pacific Ocean.\nA single-occupancy room, where you will admire a spellbinding sunrise, starts at 35,000 yen, with half board.\n4. Gems of rustic inns\nWakayama’s remote mountainous landscape is dotted with lovely inns, homestays and ryokans. While the bigger onsen hamlets may offer larger hotels, the small villages have intimate wooden inns with creature comforts, and they are often family-run.\nOn the first night of my Kumano Kodo hike, I stay at the cosy, romantic Kirinosato-Takahara Lodge, in a mountain hamlet (str.sg/i4Bo) in Takahara. The little ryokan of eight rooms sits on a mountain ridge, overlooking a valley and a terraced rice field with a watermill.\nAfter a relaxing soak, I tuck into local ingredients foraged from the countryside and drink homemade plum wine by the crackling fireplace while innkeeper Jian Shino plays his flamenco guitar.\nBetween sips of sake, new friendships are made.\nA repeat Japanese guest tells me he drives his Mercedes-AMG Coupe a thousand kilometres each way from his Sendai home to this remote region twice or thrice yearly “to escape the daily grind of city living”. He takes along his miniature Schnauzer and bottles of sake.\nAnother Japanese couple from Hokkaido generously whisk out bottles of wine to share – from their own vineyard – as we exchange travel tales and tasting notes.\nTwo other local guests, a helicopter pilot and his trainee, offer a ride in their chopper the next day.\nIt is an unforgettable mountain stay where human connections are made. Single-occupancy rooms, with dinner and breakfast, start at 16,000 yen.\n5. Man-made wonders, myths and spirits of nature – and a three-legged crow\nAncient Japan’s indigenous Shinto religion emerged thousands of years ago. Adherents worship sacred spirits who take the form of natural elements such as the wind, waterfalls, stones, trees, rain and animals.\nThe earliest historical books record that mythical Japan’s first emperor Jimmu, a descendant of the Sun Goddess, got lost in the dense Kii mountains as he mounted military campaigns.\nThe heavens then sent a sacred three-legged crow to guide him to victory, and he became the first ruler to unite the country. This is the mythical birthplace of Japan, and the place of its spiritual roots.\nMillions have walked on the Kumano Kodo pilgrimage (str.sg/i4B3) to seek enlightenment.\nMillennia ago, the trail started as a network linking three Shinto shrines – Kumano Hongu Taisha, Kumano Hayatama Taisha and Kumano Nachi Taisha – in the steep, mountainous central and eastern coastal areas of the Kii Peninsula.\nCollectively known as the Kumano Sanzan, the trio have oversight of more than 3,000 Kumano shrines across Japan.\nIn a harmonious blend of syncretic faiths, the network also links the trio to Kyoto’s Koyasan (home of Shingon Buddhism) and the mountain worship centres of Yoshino and Omine with Ise, Japan’s most important shrine.\nOver time, the appeal of the pilgrimage broadened as it evolved into a journey for renewal, healing and salvation.\nAs roads replaced horse trails and buildings replaced huts, most of the coastal trails disappeared. Only some mountain trails and passes remain.\nOf the five main pilgrimage routes, the most popular is the Nakahechi Route (str.sg/i4BU) that starts from Tanabe on the west to Kii Katsuura on the east.\nThis has also been the Imperial family’s pilgrimage route of choice since the 10th century. A relatively easy route, it takes an average of five days to complete.\nHikers blessed with time and fitness can do the challenging and undulating north-south Kohechi Route that runs through the heart of the Kii Peninsula, linking Koyasan’s Buddhist temple complex and the trio of Kumano Sanzan.\nFor those hard-pressed for time, fret not. You can do part of the walk and hop on a bus – or simply hike parts of the trail that appeal to you.\nWhether it is an introductory full-day guided hike or a week-long trek, the Kumano region is a feast for the eyes while its nature and legends nourish the soul.\nTips\nThe trails are well-marked and can be done solo. Guides, however, can spice up the walk with storytelling and offer added safety.\nThe best season to hike is springtime between March and June and the winter months between November and January. Layering of clothes is critical for chilly morning starts.\nYou may send luggage ahead of you, so you carry only the minimum such as food, water and a light rain jacket in a day pack while on the trail.\nHiking poles are a must as paths may be slippery and there are sharp descents to negotiate. Wear only proper hiking or trail shoes and use outdoor wear. No cotton or heavy material such as jeans – you are not walking in a mall.\nAccommodation is very limited and must be booked in advance. You cannot walk up to an inn and expect availability.\nCombine the end of the trip with a visit to nearby Ise City, famous for its Edo-style pedestrian street that leads to Japan’s important Shinto Grand Shrine. And do not miss the photogenic Wedded Rocks Shrine by the sea.\nJohn Tan visited Japan twice in six months, indulging in its cuisine while exploring its deep countryside. He is grateful for Japanese retailer Uniqlo’s stretchy pants, fitted with elastic waistbands, that are forgiving of his expanding girth. He is writing a series on rediscovering Japan.\nThe writer’s trip was partially hosted by the Wakayama Prefectural Government.", "url": "https://www.straitstimes.com/life/travel/food-and-folklore-a-journey-deep-into-japan-s-countryside"}