{"authors": ["Ang Kai Lin"], "date_download": "2024-10-12 13:44:17", "date_modify": "2024-10-12 13:44:17", "date_publish": "2023-10-14 11:00:00", "description": "Makeover opportunities abound in this district of beauty-conscious Seoul. Read more at straitstimes.com.", "filename": "life_travel_in-quest-of-k-beauty-holiday-in-gangnam_1728740657.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/14/bttransform20231012.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_travel_in-quest-of-k-beauty-holiday-in-gangnam_1728740657.html", "title": "In Quest Of: K-beauty holiday in Gangnam", "title_page": "In Quest Of: K-beauty holiday in Gangnam | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – The South Korean beauty industry is a powerhouse. Beauty companies are innovative, while K-pop idols are walking endorsements of the K-beauty wave.\nBut little did I know that the impeccable skin of South Korean faces and bodies was not achieved through the use of creams and serums from beauty brands such as Laneige or Sulwhasoo.\nDuring a summer exchange at Korea University in Seoul in 2017, the professor told our media and popular culture class: “It is never about the products we all see and use. It is the dermatologist.”\nSouth Koreans have a reputation for being obsessed with their appearance, and they seek treatments to attain the societal norm of good looks.\nI thought: “Why not use this to my advantage? I will go on a K-beauty holiday.”\nBesides, with the strong Singapore dollar, I enjoyed a favourable exchange rate of almost 1,000 Korean won to S$1 when I visited the country earlier in 2023.\nThere was so much I could do and try. Though I did not book extensive treatments to revamp my appearance, I was impressed by the simple things I could do that made a difference.\nThese included a haircut and colour by a head stylist, two Korean facials and all sorts of facial products.\nAfter I was done, my Airbnb host joked: “Are you sure you are not Korean?”\nStarting my K-beauty quest\nSearching for clinics before my 14-day trip was not difficult.\nAnyone who Googles “Seoul facial clinic” would see countless websites and blogs with lots of recommendations.\nSussing out which was the “best” was the tough part. After all, coming home with a botched job would be horrifying.\nSouth Korea has its own search engine, Naver, and map applications for mobile phones – Naver Map and Kakao Maps – where locals post their reviews in Korean.\nWhen I was researching, I cross-referenced Google Maps, Naver Map and Kakao Maps. I looked at the majority of the reviews, reading through both one- and five-star ratings.\nThe bottom line was that any review was important, whether good or bad.\nTip: Creating a Naver account, a Kakao account or both will be helpful in bookmarking locations while researching.\nThe difference in reviews between Naver and Kakao can be quite drastic. Read blogs and reviews from the locals for a more accurate assessment, and translate the reviews through a third-party app if needed.\nOvercoming language barriers\nGoing to a foreign country for a medical procedure has to be an informed decision.\nLanguage is always the first hurdle to cross, and that was the most important factor in my choice of clinics.\nMy friend and I visited clinics with English-speaking staff.\nNavigating Korean apps can be daunting. An app’s language can be toggled to English, but only to a limited degree.\nFor example, only navigation options are shown in English. You will still have to type the clinics’ names in Korean.\nAlternatively, I would take a screenshot of the page and run the image through Papago, a helpful Naver-based translation tool similar to Google Translate. Since it is a Korean app, the translations are more accurate than Google’s.\nChrome’s Google Translate extension is also helpful for a quick overview of what a website is about.\nChoice of beauty purveyors in Gangnam\nTrendy Gangnam is the go-to location for K-beauty treatments. The K-drama series My ID Is Gangnam Beauty (2018) even highlights the district famous for plastic surgery.\nBut today, it is not just plastic surgeons who populate the area. You will also find dermatologists, ophthalmologists and other specialist clinics within walking distance of Sinnohyeon train station, which serves two lines: line 9 and the Shinbudang line.\n1. Muse Gangnam\nAddress: 2nd to 5th floors, Daeyeon Building, 809-12 Yeoksam 1-dong, Gangnam-gu, Seoul\nInfo: str.sg/ipoz\nMy friend wanted to undergo a laser vision correction procedure to fix her myopia.\nWhile chatting with the clinic, she was assured that there would be an English interpreter on hand at all times during her screening and surgery.\nShe was also recommended the triple Smile package upon a physical consultation in South Korea.\nTriple Smile surgery is a laser vision correction procedure with an extra treatment that is said to help patients to have improved vision, maintain it and reduce complications.\nAt the clinic, we were greeted by a wall plastered with the names and faces of celebrities who had walked down the same hallway. Bright Eye has been patronised by the likes of K-pop girl group Apink’s Son Na-eun and also actors and actresses such as Yoo Seung-ho, Ha Seok-jin and Lee Da-hee.\nThe entire process took less than four hours. My friend went through a battery of eye screenings on various machines and it was clear that the clinic was efficient.\nI needed a fresh look. The last time I had a proper haircut was almost a year ago.\nI researched several hair salons with English speakers on Google, and Juno Hair kept popping up.\nWhen I typed Juno Hair into Naver Map, a list of outlets all over Seoul city came up.\nI clicked on the pages of every Juno Hair salon to view the stylists on the roster and what they were good at. I also read the recommendations left by reviewers.\nFrom C-curl to short bobs, you name it, Juno Hair does it.\nThe staff were the friendliest people I have met in a hair salon. One washed my hair, while two dried it. Then the first one came back with snacks and drinks while my hair was being cut and coloured. I felt like a princess.\nI was whisked from one seat to another during my three hours there. The head stylist cut and coloured my hair while we communicated in basic English, till he realised that I could understand some Korean.\nTo end the session, they gave me a hair spa as a “service” treatment. This is a term for “free” or complimentary.\nTreatment prices were stackable. At first, I wanted to dye and highlight my hair, which meant I had to pay one fee for hair colouring and another for highlighting. In Singapore, a combination of both services can be cheaper.\nThe session cost $75 for the haircut and $220 for colouring.\n4. Olive Young\nAddress: Multiple outlets around Seoul\nInfo: global.oliveyoung.com\nHealth and beauty product store Olive Young’s annual event, the Olive Young Awards, celebrates the year’s top-selling products.\nThe awards are based on more than 100 million purchases made at the retailer over the course of the year.\nIndustry experts consider the awards a good indicator of the latest trends in K-beauty.\nSkincare and make-up were two of the main categories in the 2022 Olive Young Awards, with sub-categories such as body care and hand care. There was also healthcare, where the top-rated health supplements were listed.\nArmed with my research and TikTok recommendations, I trawled through multiple Olive Young outlets. From the best sunscreen to the top-ranked oil cleanser, I had to have them all.\nWhenever I found the coveted items, I bought multiple boxes. Then I realised that is how things go out of stock.\nTip: Buying over 30,000 won worth of goods in Olive Young allows you to get an instant tax refund at the store.\nFirst, do research on Singapore-based platforms – such as Shopee, Lazada, Watsons and Guardian – to see the brands and products that are already available locally. Do not waste precious baggage space on bottles of 500ml toner or 750ml shampoo that you can get at home.\nMany Olive Young outlets package products differently. For example, there will be a 1+1 box of serum in one outlet and a 3+1 box in another. There might even be products specially packaged for “events” or sales in different stores. Visit a few before deciding on the best buys.\nThe items recognised by the Olive Young Awards are almost always out of stock, so grab them if you see them.\nThe bigger stores have the best variety, while smaller and more obscure stores tend to have products that are out of stock elsewhere.\nI picked up Anua Heartleaf Toner 77% (500ml for $18), Aestura Atobarrier 365 Cream (80ml for $22), Isoi Bulgarian Rose Blemish Care Up Serum (20ml for $18), Torriden Dive In Mask (five pieces for $14) and Roundlab Birch Moisturizing Sunscreen SPF 50+, PA++++ (50ml for $13), among other items.\nDifference in my appearance", "url": "https://www.straitstimes.com/life/travel/in-quest-of-k-beauty-holiday-in-gangnam"}