{"authors": [], "date_download": "2024-10-12 13:55:20", "date_modify": "2024-10-12 13:55:20", "date_publish": "2023-11-18 13:05:00", "description": "SINGAPORE – In this week’s Singapore Shelf, The Straits Times looks at books hot off the local press. Buy the books at Amazon. These articles include affiliate links. When you buy through them, we may earn a small commission. Read more at straitstimes.com.", "filename": "life_arts_singapore-shelf-fantasy-and-reality_1728741320.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/18/aasgshelf18112023.jpg?h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_arts_singapore-shelf-fantasy-and-reality_1728741320.html", "title": "Singapore Shelf: Fantasy and reality", "title_page": "Singapore Shelf: Fantasy and reality | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "This is a strange and yet oddly affecting story by playwright Stella Kon that seems to defy easy classification.\nFour Singaporeans from a meditation club, stricken by increasingly debilitating daydreams, are beseeched by a goddess to travel to China, where they attempt to perform an act of remembrance that will mend a rift in the world.\nMarketed as urban fantasy by publisher Penguin Random House SEA, half of it in fact takes place in rural China – a village called Nanchiao, where the four are stuck after the road is blocked by a landslide.\nThe “fantasy” half of the equation also does not sit quite right. For one thing, the novel is a mere 172 pages and there are no warring kingdoms or obscure magic.\nREAD MORE HERE\nPioneer writer Robert Yeo’s Routes 2 memoir sequel recalls a political writer’s struggles\nSINGAPORE – Robert Yeo takes pride in being both a civil servant and a political writer, and sees no contradiction between his two roles. The 83-year-old pioneer writer has published a new memoir Routes 2.\nThe candid book, which spans 1976 to 2000, is a window into a period of Yeo’s life when he wrote some of his most political works.\nThese include the poetry collection And Napalm Does Not Help (1977), which tackled the Vietnam War, and the controversial political drama One Year Back Home (1980), which took 18 months to receive a licence to perform.\nAt the same time, Yeo chaired the Drama Advisory Committee in the then Ministry of Culture and Ministry of Community Development, and lectured at the National Institute of Education (NIE), advocating a national literary and theatrical culture in Singapore’s early decades of independence.\n“As a civil servant, I wouldn’t criticise the Government, whose policies I generally supported. But as a writer, if I felt there were things they did that I did not agree with and were harsh, then I would put them in my writing,” says Yeo in an interview with The Straits Times.\nREAD MORE HERE\nBook review: The Campbell Gardens Ladies’ Swimming Class dives into the world of middle-aged Indian housewives\nA group of Indian women learning to swim in a Singapore condominium is the subject of this novel, which is Singapore-based Indian author Vrushali Junnarkar’s debut, and which won the Epigram Books Fiction Prize in 2023.\nIt begins with a surreal dream sequence that forms an interesting entry point into the granularity of the lives of these middle-aged housewives: Protagonist Suchi is gliding along in an Olympic-size pool when the water suddenly starts draining. Then jellyfish and slimy stingray appear as she miraculously stays afloat.\nThis brief venture into an alternate aquatic universe is interrupted when her eight-year-old son jolts her awake from her siesta. Dad is watching television, so Suchi gets up. It is the first hint of the naturalised gender order that is one of the main axes along which this novel operates.\nREAD MORE HERE\nEveryone is an eight-year-old when reading Singlish: Gwee Li Sui on translating Winnie-da-Pooh\nSINGAPORE – When author Gwee Li Sui penned an op-ed for The New York Times in 2016 defending the “wacky, singsong creole” of Singlish, he was not only roundly rebutted by the Prime Minister’s press secretary, but he also received hate mail.\n“There were really very fervent people saying, ‘Because of people like you, my children’s English will suffer’,” recalls the 53-year-old literary critic and poet, who admits to feeling “quite depressed” that the conversation quickly moved on from Singlish into mud-slinging from proponents and detractors.\nThe former assistant professor at the National University of Singapore’s Department of English Language and Literature and now full-time writer has since doubled down on his view that Singlish is a language. Gwee has gone on to write in and about Singlish in his best-selling Spiaking Singlish: A Companion To How Singaporeans Communicate (2017).\nREAD MORE HERE\nThe Straits Times’ Weekly Bestsellers Nov 18\nSINGAPORE – Jumpstart your gift shopping for the 2023 Christmas season.\nIf you like the books The Straits Times has reviewed in these pages, we have a promotion code with Amazon.sg that will snag you additional discounts for your book buys. From Nov 20 to 23, get $5 off with $50 minimum spending. From Nov 24 to 27, get $10 off with $80 minimum spend.\nGo to amzn.to/3QVSLd4 for this exclusive Black Friday deal. Limited redemptions are available every day, so fastest fingers first.", "url": "https://www.straitstimes.com/life/arts/singapore-shelf-fantasy-and-reality"}