{"authors": ["Benson Ang"], "date_download": "2024-10-12 13:43:08", "date_modify": "2024-10-12 13:43:08", "date_publish": "2024-05-02 15:30:00", "description": "Every weekend, he must eat bak kut teh at one of the 13 Song Fa Bak Kut Teh outlets here. Read more at straitstimes.com.", "filename": "life_entertainment_my-perfect-weekend-with-dj-dennis-chew_1728740588.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/02/imgonline-com-ua-FrameBlurred-wS82mzMaE4r.jpg?VersionId=PRotvLN3bI7WFoA6NEgs7WfO4eNPLqry", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_my-perfect-weekend-with-dj-dennis-chew_1728740588.html", "title": "My Perfect Weekend with DJ Dennis Chew", "title_page": "My Perfect Weekend with DJ Dennis Chew | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Who: Singaporean Dennis Chew, 50, a DJ at Mediacorp’s Chinese radio station Love 972, where he is one of the five hosts of The Breakfast Quintet on weekdays from 6 to 11am, together with Chen Biyu, Marcus Chin, Mark Lee and Joe Tsoi.\nAt the Star Awards 2024 in April, The Breakfast Quintet won the Best Radio Programme award and Chew clinched the Best Audio Personality prize for the programme.\nChew, who is single, also helms the popular radio segment and podcast Mr Zhou’s Ghost Stories@Job Haunting, where he and his team of storytellers tell horror tales.\nThe stories have been turned into a television series of the same name, with the first two seasons currently streaming on mewatch. A third season, featuring 10 15-minute episodes, will be available on mewatch from Aug 16. It will premiere on Channel 8 on Aug 19 at 10.30pm and air every Monday.\n“Every weekend, I must have a meal of bak kut teh. This happens either on Saturday or Sunday, around 11am, at one of the 13 Song Fa Bak Kut Teh outlets here. I won’t tell you which one, because I do not want readers to go find me there.\nI am Teochew and am drawn to Song Fa because it serves Teochew-style bak kut teh. I have been there so many times that the staff know me.\nWhen the pork rib dish arrives, I will first drink a spoonful of soup. There is an indescribable sense of warmth at tasting piping hot soup. It feels so comforting, so fulfilling.\nThe broth is clear and peppery, and the pork is so well-simmered that when I take a bite, it falls off the bone. The meat is soft and tender, with a rich flavour enhanced by white pepper and cloves of garlic.\nI will order extra dishes, such as vegetables, braised fried beancurd, a braised egg and a bowl of white rice. I will also ask for an extra bowl of broth. If I dine by myself, the bill comes up to under $20.\nIt is all worth it because after eating, I feel so happy and will be smiling as I head home. It is as if my entire weekend has been complete, just because of this one bowl of soup. It will satisfy me all the way to dinner.\nWhen I was five or six, my family used to live near People’s Park Complex in Chinatown. On weekends, my father would take me to eat bak kut teh at a shop near our house. I have many happy memories eating with him.\nSadly, after I grew up and moved out to live on my own, I did not continue with this tradition. But I have been trying to restart this habit again since two years ago. Both my parents are retired.\nNowadays, when I wake up on the weekends, I will feel like something is missing if I do not eat bak kut teh. I am not sure why, but perhaps it is related to my childhood experiences.\nSometimes, though, I eat with my polytechnic mates. Since 2022, I have been pursuing a diploma in Chinese media and communication at Ngee Ann Polytechnic and am now in the programme’s third year.\nMy coursemates and I sometimes meet outside of class to do coursework or work on our final-year projects. Most of them are aged 18 to 23, less than half my age. I call them my ‘bao bao’ (baby in Mandarin) and they call me ‘lao ba’ (daddy in Mandarin), and we get along fine.\nOne reason I like to be around young people is because it lets me understand them better, and this affects how I approach my DJ duties to appeal to younger listeners.\nApart from studying, some of them do part-time work, such as selling shoes or bubble tea. They have inexhaustible energy and have introduced many new aspects of technology to me.\nThey have also involved me in many of their TikTok dance videos and helped me learn about many of the latest popular celebrities, such as Chinese actors Dylan Wang and Bai Jingting.\nBeing able to hang out with them is such a pleasure. Once, I ate bak kut teh with three of my coursemates and the bill came up to more than $70. I was happy to pay for everyone.\nTo me, it is not about the money. The important thing is that you are full and happy.”", "url": "https://www.straitstimes.com/life/entertainment/my-perfect-weekend-with-dj-dennis-chew"}