{"authors": ["Chin Hui Shan", "Kamaldeen Batcha"], "date_download": "2024-10-12 13:31:02", "date_modify": "2024-10-12 13:31:02", "date_publish": "2021-06-08 19:30:00", "description": "GPs are seeing more patients with known side effects from taking the Covid-19 vaccines, such as fever. Read more at straitstimes.com.", "filename": "life_getting-vaccinated-dos-and-donts-before-and-after-your-covid-19-jab_1728739862.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2021/06/08/yq-sgvaccine2-08062021.jpg?VersionId=sSPKOAHhKmyVF8J6N91D7WpNcEf_u5qt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_getting-vaccinated-dos-and-donts-before-and-after-your-covid-19-jab_1728739862.html", "title": "Getting vaccinated? Dos and don'ts before and after your Covid-19 jab", "title_page": "Getting vaccinated? Dos and don'ts before and after your Covid-19 jab | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - General practitioners (GPs) are seeing more patients with known side effects from taking the Covid-19 vaccines, such as fever, as inoculation efforts reach younger age groups.\nEight of the 10 GPs The Straits Times (ST) spoke to have seen a 15 per cent to 50 per cent increase in the number of such patients recently, compared with the first half of the year. Side effects doctors have seen include nausea, fatigue, headaches, body aches, rashes and pain and soreness at the injection site.\nThe rise in the number of such patients is expected as vaccination efforts have been ramped up, says Dr Xie Huizhuang, medical director at Unihealth 24-hr Clinic (Jurong East). Her clinic has seen an increase of about 15 per cent to 20 per cent in the number of such patients.\nIn Singapore, mass vaccinations against Covid-19 were rolled out on Feb 22, starting with seniors above the age of 70, before moving on to those aged 60 and above.\nPeople aged 45 to 49 were invited to register for vaccination from March 24, followed by those aged 40 to 44 from May 19.\nThe vaccination drive for students aged 12 and above kicked off last Thursday (June 3).\nSome GPs say patients who report side effects from vaccination are mainly adults in their 20s to 50s.\nHeartland Family Clinic's Dr Lee Kwang How says working adults may find it difficult to focus because of the side effects, so they visit the doctor for medication and medical leave.\nAbout 80 per cent of the patients he has seen were aged 30 to 50.\n\"The seniors may have self-medicated at home and don't see us as they do not need to take MCs,\" he adds, referring to certificates for medical leave.\nDr Xie has also seen more younger patients than older ones, particularly women in their 20s and 30s. \"This may be due to a more robust immune system in this group of patients, which stimulates an immune response post-vaccination,\" she says.\nOlder patients may have a higher pain tolerance and are less likely to go to the doctor for something they consider mild, she adds.\nDoctors say those who are going for the vaccination should not pre-medicate, such as by taking Panadol before the jab, to ward off the side effects.\nDoing so does not prevent side effects, which is dependent on each body's response to the vaccine, says Dr Lee.\nBut it is fine to take paracetamol to treat side effects such as fever or chills if they do occur after vaccination, doctors say.\nThere have also been reports of increased sales of coconuts here and in Johor Baru, as some believe drinking coconut water can mitigate the vaccine's side effects.\nDoctors tell ST there is no evidence that drinking coconut water can reduce the chances of developing a fever after vaccination.\nBut Dr Abdul Bashir, senior resident doctor at Thomson 24-hour Family Clinic, says that while coconut water may not prevent fever, it may help those who are feeling feverish. Its nutrients and antioxidant properties make it a good substitute for saline or glucose drinks, he adds.\nOverall, doctors say staying hydrated and getting enough rest will remain key in tackling fever.\nDr Ng Joon Hwee, a family physician from Stat Medical Clinic, says: \"Drinking lots of water to maintain the body's hydration level will not only help to reduce the chance of getting a fever after vaccination, but also reduce the degree or duration of the fever and speed up the recovery.\"\nDr Lee adds that those getting vaccinated should exercise regularly, have a balanced diet and get enough sleep.\nDoctors' tips\nBefore vaccination:\n• Ensure you are well rested and healthy before each jab. If you feel unwell, visit the doctor and postpone the vaccination if necessary.\n• Schedule a day or two of rest at home after each jab.\n• Eat nutritious, well-balanced meals with fruit and vegetables.\n• Read up on vaccines and their side effects.\n• Avoid alcohol before and after vaccination as it can cause dehydration and worsen nausea.\n• Avoid trying anything new, such as a food product or cosmetics, before and after vaccination.\n• For teenagers, talk to your grandparents or parents to find out about their vaccination experience, so you know what to expect and how to cope.\n• Prepare some paracetamol to treat side effects.\nAfter vaccination:\n• Apply a cool towel over the injection site to create a cold compress to reduce any swelling and pain.\n• Try not to strain the injected arm and keep the injection site clean.\n• Stay hydrated and get ample rest. Take one to two days off, if necessary.\n• Avoid strenuous activities, such as hiking or swimming, right after the vaccination.\n• Monitor your health and look out for any symptoms. If you feel unwell, consult a doctor.\n• Follow a balanced diet, get enough sleep and exercise regularly to boost the immune system. You can also take vitamin C to boost your immunity.", "url": "https://www.straitstimes.com/life/getting-vaccinated-dos-and-donts-before-and-after-your-covid-19-jab"}