{"authors": [], "date_download": "2024-10-12 13:36:30", "date_modify": "2024-10-12 13:36:30", "date_publish": "2024-07-05 02:51:12", "description": "The latest lawsuit brings to nine the number of claims against Combs since November 2023. Read more at straitstimes.com.", "filename": "life_entertainment_rap-mogul-sean-combs-sued-for-sex-trafficking-sex-assault_1728740190.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/05/FILES-US-CRIME-ENTERTAINMENT-DIDDY-ASSAULT-125434.jpg?VersionId=0aNfIomSWAYkz.XXeR20pK02GLv6w3Sg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_rap-mogul-sean-combs-sued-for-sex-trafficking-sex-assault_1728740190.html", "title": "Rap mogul Sean Combs sued for sex trafficking, sex assault", "title_page": "Rap mogul Sean Combs sued for sex trafficking, sex assault | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Superstar rapper and music industry mogul Sean Combs has been sued by a former adult film star for sexual assault and sex trafficking, court filings showed.\nCombs is the target of several civil lawsuits that characterise him as a violent sexual predator who used alcohol and drugs to subdue his victims, and his homes were raided earlier in 2024 by federal agents.\nThe American hip-hop artist, known as Puff Daddy or Diddy, used actress Adria English as a “sexual pawn for the pleasure and financial benefit of others” during his lavish parties in the Hamptons and Florida between 2004 and 2009, the complaint alleges.\nThe latest lawsuit, filed in Manhattan on July 3, brings to nine the number of claims against Combs since November 2023.\n“Given all the brave individuals who have come forward against Combs, (English) is doing the same,” the complaint said.\nEnglish is seeking a jury trial and undisclosed damages, according to her complaint.\n“Due to these numerous lawsuits filed against Combs alleging the same or similar acts, there is now a growing awareness that Combs was engaging in far more sinister acts than previously known, including physical abuse and sex trafficking,” the complaint says.\nIn March, armed agents entered Combs’ sprawling luxury properties in Miami and Los Angeles, a heavily publicised bicoastal operation that suggested an investigation into the rapper is under way.\nDisturbing surveillance video emerged in May showing Combs physically assaulting his then-girlfriend Casandra Ventura, corroborating allegations she made in a now-settled lawsuit in late 2023.\nVentura sued Combs in federal court last fall, a bombshell suit that was settled out of court but succeeded by a string of similarly lurid sexual assault claims against the hip-hop star.\nCombs has vehemently denied all accusations against him. His lawyer did not immediately respond to a request for comment on the latest lawsuit. AFP", "url": "https://www.straitstimes.com/life/entertainment/rap-mogul-sean-combs-sued-for-sex-trafficking-sex-assault"}