{"authors": ["Jan Lee"], "date_download": "2024-10-12 13:30:03", "date_modify": "2024-10-12 13:30:03", "date_publish": "2024-09-15 15:32:00", "description": "Lam sought out Liang on Facebook to ask for permission to cover his songs. Read more at straitstimes.com.", "filename": "life_entertainment_hk-singer-chet-lam-to-cover-xinyao-pioneer-liang-wern-fook-s-songs_1728739803.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/15/imgonline-com-ua-FrameBlurred-PJ43FOBQNw0k.jpg?VersionId=87nVPye9Me07CTBT.8Vvvmu5jOf1JQew", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_hk-singer-chet-lam-to-cover-xinyao-pioneer-liang-wern-fook-s-songs_1728739803.html", "title": "HK singer Chet Lam to cover xinyao pioneer Liang Wern Fook’s songs", "title_page": "HK singer Chet Lam to cover xinyao pioneer Liang Wern Fook’s songs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Hong Kong singer-songwriter Chet Lam is paying tribute to one of Singapore’s most well-known xinyao pioneers: Liang Wern Fook.\nThe 48-year-old Lam will be releasing an album covering 10 of the Singaporean singer-composer’s works on Sept 30.\nCity Of Longing includes well-known songs written by Liang, such as Singapore Pie (1990), named Singapore Pie 3.0 with new lyrics. The line-up also has Worries (1995), originally sung by Kit Chan, and Every Time I Wake Up (1996), originally sung by Andy Lau.\nIn an interview with Shin Min Daily News on Sept 13, Lam said he had long been a fan of Liang.\n“I often listened to songs like Worries, Every Time I Wake Up and The Feeling Of Thinking Of You (1991) play on the radio (when I was younger). The first time I heard The Feeling Of Thinking Of You, it was the Alex To version,” he recalled.\nCultural Medallion recipient Liang, 60, is a pioneer of the xinyao movement – the flourishing of Mandarin songs in Singapore in the 1980s. He also wrote many songs for top Mandopop and Cantopop artistes. The Feeling Of Thinking Of You was first sung by Malaysia-born singer Eric Moo, before it was covered by Hong Kong singer To.\nLam said he started to learn more about xinyao through the internet during the Covid-19 pandemic when he did not have any work engagements. He realised many songs in the genre were written by Liang, which gave him the idea of recording a tribute album.\nHe sought out Liang on Facebook and asked for his permission to cover his songs. Liang swiftly agreed.\nLam said he had simply picked what he felt like covering, and that Liang gave him some pointers after listening to his takes.\nLiang told Shin Min: “I’m heartened to see that he has picked a few songs that are relatively not as well-known, for example Disappear Into Ashes (1997), My Love Sinema (2016) and A Woman In The Queue (1990). These songs have truly met a kindred spirit in him.”\nDisappear Into Ashes was originally sung by Hong Kong actor-singer Andy Hui, while A Woman In The Queue was sung by former Rediffusion deejay Eeva Chang. My Love Sinema is the theme song of the 2016 local movie of the same name, which starred home-grown artiste Tosh Zhang. Zhang also sang the song.\nOf the 10 songs on the album, Singapore Pie 3.0 and Disappear Into Ashes are already available on music platforms like Spotify.\nLiang and Lam met in Singapore at the beginning of 2024, when Lam came to visit.\nOn his first impression of Liang, Lam said: “I thought he was very handsome, and looked like a learned scholar in a period drama. That was when I realised he’s actually a professor too.”\nLiang is an adjunct associate professor at Nanyang Technological University’s Chinese division.\nLam added that he loves the literary air of Liang’s works. “Wern Fook’s lyrics are well-written in a nuanced sort of way and express deep emotions. That’s something I want to learn from him.”", "url": "https://www.straitstimes.com/life/entertainment/hk-singer-chet-lam-to-cover-xinyao-pioneer-liang-wern-fook-s-songs"}