{"authors": ["Elisa Chia"], "date_download": "2024-10-12 14:01:03", "date_modify": "2024-10-12 14:01:03", "date_publish": "2024-02-07 14:00:00", "description": "She is stepping out of the shadows of her famous parents and starting anew after her split with Gavin Teo. Read more at straitstimes.com.", "filename": "life_lucky-dragons-actress-model-chen-yixin-is-at-her-most-confident-ready-to-slay-after-break-up_1728741663.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/07/chen1.jpg.JPEG?h=85d80f0c", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_lucky-dragons-actress-model-chen-yixin-is-at-her-most-confident-ready-to-slay-after-break-up_1728741663.html", "title": "Lucky Dragons: Actress-model Chen Yixin is at her most confident, ready to slay after break-up", "title_page": "Lucky Dragons: Actress-model Chen Yixin is at her most confident, ready to slay after break-up | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Actress-model Chen Yixin now embodies the confidence of a Dragon she never was able to muster previously.\nThe 23-year-old is slowly but surely stepping out of the shadows of her famous parents, veteran actress Xiang Yun, 62, and actor-turned-artist Edmund Chen, 63.\n“Growing up, I was very shy and worried about living up to expectations. Am I aesthetically pleasing enough? Especially when you’re going through puberty and people see you with pimples,” Chen Yixin recalls.\n“My confidence really took a hit back then because of random online comments.”\nStill, she took the leap to pursue her acting dream and made her debut in Channel 8 drama While We Are Young (2017).\nShe landed her first lead role in Channel 5’s Teenage Textbook: The Series (2021), but it was the Netflix series Mr Midnight: Beware The Monsters (2022) that gave her the confidence boost she needed.\nIt was an open-call audition for the drama, an adaptation of the popular Mr Midnight kids’ horror book series (2009 to present) by James Lee, the pseudonym of Australian writer Jim Aitchison.\nChen went through four rounds of selections to land the role of a teenage paranormal hunter.\n“The producer and director were from overseas and didn’t know about my background.\n“When I got the role, it gave me a sense of recognition that they chose me for who I am and not because of my family members,” says Chen, whose elder brother Chen Xi, 32, is also an actor.\nIn the last Dragon year in 2012, she was still a tween preparing for the Primary School Leaving Examination in Tao Nan School.\nWhat would she have said to her 12-year-old self if she could?\n“I’d definitely tell her to love herself a lot more and not pick herself apart,” says Chen, who later studied at Bedok South Secondary School and Singapore Polytechnic’s applied drama and psychology course.\nBut because of that insecure phase, she has learnt to better appreciate how far along she has come.\nChen shares that she used to feel “super awkward” posing for photographs, but finds it fun and exciting now. She has appeared in advertisement campaigns for Kiehl’s skincare, Dior Beauty make-up and luxury fashion house Valentino.\n“I guess caring less about what people think gave me more confidence to do what I want. The negative comments on social media still sting, but I’m definitely not as affected,” says Chen, adding that she is ready to explore opportunities in the industry and slay her next life chapter.\nAnd while she used to grumble about attending family gatherings when she was younger, she cherishes them now.\nShe and her parents recently visited Chen Xi in London, where he is pursuing his master’s degree in arts and cultural management at King’s College London.\n“It feels so good to have everyone in the same room at the same table,” she says.\nThis Chinese New Year, she is looking forward to holding mandarin oranges in her hands to “bai nian” (Chinese for “wish one another well”) with her paternal grandparents on the first day.\nBut festivities at Xiang Yun’s side of the family will be muted.\nChen Yixin’s maternal grandmother died at the age of 84 in September 2023. The extended family will head to Batam together instead.\nThe year 2024 will also feel different because Chen and her boyfriend of five years, local singer-actor Gavin Teo, 28, have broken up. He was often a fixture in social media posts of Chen’s family gatherings.\nDuring this interview with The Straits Times, she says they have “not been talking for a while” and prefers not to go into the details. “New year, new us,” she adds wistfully.\nShe announced the split in an Instagram post on Feb 6, writing: “After much reflection and deep respect for each other, Gavin and I have made the difficult decision to journey on different paths.\n“Thank you for the love and support for the past five years, and we hope that you can continue to support us as individuals as we navigate this next chapter.”\nWhen the next Dragon year rolls around, Chen will be 36.\n“By then, I hope to achieve my dreams of being financially independent enough to care for my parents and take them around the world, just like how they have gone on vacations with me since I was young,” she says.\n“I also wish that I will be proud of myself, content with life and even more confident.”", "url": "https://www.straitstimes.com/life/lucky-dragons-actress-model-chen-yixin-is-at-her-most-confident-ready-to-slay-after-break-up"}