{"authors": ["Amanda Chai"], "date_download": "2024-10-12 13:56:30", "date_modify": "2024-10-12 13:56:30", "date_publish": "2023-08-31 13:00:00", "description": "Check out Clarins’ new facial treatment and aura-inspired jewellery from Wanderlust + Co. Read more at straitstimes.com.", "filename": "life_style_style-news-comfy-collab-from-the-paper-bunny-and-cheak-le-labo-city-exclusives-return_1728741390.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/08/31/aastylenews31082023.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-comfy-collab-from-the-paper-bunny-and-cheak-le-labo-city-exclusives-return_1728741390.html", "title": "Style News: Comfy collab from The Paper Bunny and Cheak, Le Labo City Exclusives return", "title_page": "Style News: Comfy collab from The Paper Bunny and Cheak, Le Labo City Exclusives return | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Paper Bunny x Cheak collaborate\nIf you hurry, you may just be able to snap up the last few pieces of the collaboration between popular Singaporean brands The Paper Bunny and Cheak.\nIn celebration of its 10th anniversary, lifestyle brand The Paper Bunny has teamed up with activewear favourite Cheak – sister brand of Love, Bonito – for a summery capsule of activewear, accessories and lifestyle apparel.\nTitled New Moves, the collection has 33 pieces – including resort shirt-and-pants sets, bags and pouches – which transition seamlessly from workout to work and back. Prices range from $35 to $129.\nFor workout gear, find flattering pieces in a new ribbed material called BaseForm, Cheak’s proprietary fabric that is sweat-wicking and quick-drying with a medium compression.\nThe collection’s star product, however, is the Puffer Carryall ($129) – the largest and newest addition to The Paper Bunny’s viral Puffer series. This oversized gym-to-office hobo bag features an adjustable strap and pocket details that hold a laptop, shoes and other essentials securely.\nTravel around the world through your nose this September, as fragrance house Le Labo’s City Exclusives collection returns.\nPaying tribute to cities the brand’s founders love, these coveted fragrances are available only in the city they were inspired by – except for one month a year, when the collection travels to Le Labo stores around the world.\nIn 2023, there is a new addition to the 15 cities already in the collection. Myrrh 55 is Shanghai’s City Exclusive, a jasmine-forward creation blending myrrh (a spice-like ingredient smelling of licorice and incense), patchouli, oud, ambergris and musk – to evoke the binary of old and new, just like Shanghai.\nPrices start at $218 for 15ml, while a 50ml bottle goes for $520. Discovery sets (five 1.5ml bottles) are also available at $90. City Exclusives 50ml, 100ml and 500ml bottles can be refilled, year-round, in selected Le Labo stores worldwide for 20 per cent off the retail price.\nInfo: Available at Le Labo stores at B1-31 Takashimaya Shopping Centre, 391 Orchard Road, and L1-36 The Shoppes at Marina Bay Sands, 10 Bayfront Avenue\nClarins’ new Precious facial\nFrench brand Clarins’ newest facial treatment harnesses its most premium product range for a truly luxurious spa experience.\nThe Clarins Precious Spa Treatment (from $420) was created with French facialist Marie Depoulain and claims to deliver almost immediate results with its combination of Clarins expertise and traditional Asian massage techniques. Although it is an anti-ageing facial, it is suitable for women from age 25.\nNo fancy machines are used here – just tools such as those used in gua sha and seasoned hands.\nThe treatment begins with a check on pressure points, before progressing to a facial massage with rapid, firm strokes to tighten skin, relieve micro-tension and strengthen facial muscles. The eyes and frown lines receive special attention too, via an eye cream spatula and other facial tools.\nThe result is a plumped and lifted face with more defined contours and noticeable radiance, making it a great option before a special occasion.\nAdd a meaningful piece of crystal jewellery to your collection with new designs from Wanderlust + Co’s Aura Energy line, inspired by the aura energies of natural gemstones.\nAvailable in gold and silver, the Aura Locket Necklace ($94) opens up to fit a specially cut gemstone ($17).\nChoose stones based on their supposed properties – amethyst is meant to symbolise courage and mental clarity; rose quartz is for self-love and empathy; and the jade-like amazonite is said to soothe and bring in prosperity, according to the Malaysia-based brand.\nOr ditch the symbolism altogether and go with your favourite colour.\nThe brand also drops a collection titled Next Chapter on Friday, with a book-shaped locket and other intricate pieces featuring blooming flowers, to celebrate its 13th birthday.\nInfo: Available at wanderlustandco.com\nNew fuss-free eyeshadow options\nFor those days you just want a one-and-done eyeshadow look, grab Rare Beauty’s All Of The Above Weightless Eyeshadow Stick ($37).\nThe handy stick can be used as an all-over eyeshadow, eyeliner or highlighter for the inner corner of your eyes, and easily tossed into your bag for touch-ups on the go. In six shades ranging from soft pink to bronze, the product comes with a built-in sharpener.\nFrom Guerlain’s new make-up collection devoted to natural hues for the eyes and lips comes two Ombres G quads ($139 each), delivering rich pigments in easy-to-use colourways.\nEach includes three finishes: satin, metallic and a new matte formula inspired by the skin’s natural texture. Choose between Wild Nudes, appropriate for everyday wear, and Undressed Brown, with its amped-up palette that includes a deep brown and metallic copper.\nInfo: Rare Beauty is available at Sephora stores and sephora.sg; Guerlain is available at all Guerlain boutiques and counters", "url": "https://www.straitstimes.com/life/style/style-news-comfy-collab-from-the-paper-bunny-and-cheak-le-labo-city-exclusives-return"}