{"authors": ["Arthur Sim"], "date_download": "2024-10-12 13:55:13", "date_modify": "2024-10-12 13:55:13", "date_publish": "2023-11-11 12:00:00", "description": "The pet care industry is set to grow even more, with a greater number of owners treating pets to quasi-human experiences. Read more at straitstimes.com.", "filename": "life_singapore-s-pampered-pets-puppy-yoga-flights-for-cats-guinea-pig-houses-and-goldfish-staycays_1728741313.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/11/aapets09112023.jpg?h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_singapore-s-pampered-pets-puppy-yoga-flights-for-cats-guinea-pig-houses-and-goldfish-staycays_1728741313.html", "title": "Singapore’s pampered pets: Puppy yoga, flights for cats, guinea pig houses and goldfish staycays", "title_page": "Singapore’s pampered pets: Puppy yoga, flights for cats, guinea pig houses and goldfish staycays | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The pet care industry is booming with many ways to show your animal friends how much you love them.\nAccording to research by Bloomberg Intelligence earlier in 2023, the global pet industry was worth US$320 billion (S$433 billion) in March and is set to grow to US$500 billion by 2030.\nIn the report, this is attributed to a growing pet population worldwide, as well as an explosion of premium food and services for pets, resulting from the continued “humanisation of animal companions”.\nPet food and snacks form the biggest category of spending when it comes to pet care, making up about a third of total spending.\nOther categories of expenditure include veterinary care, pharmaceuticals, services, supplies, diagnostics and pet insurance.\nPet owners “humanising” their pets is part of growing awareness that animals are sentient beings.\nIn 2022, Britain passed the Animal Welfare (Sentience) Act 2022, which recognises animals – including all vertebrates and even some invertebrates, such as octopuses and lobsters – as sentient beings, which refers to their capacity to feel a range of emotions.\nIn Singapore, the Animal and Birds Act 1965 does not consider animals sentient. But, sentient or not, pet owners here are treating their pets as well as – or in some cases, better than – humans.\nHere are just some new ways they are going the whole hog.\nHyperbaric oxygen therapy\nAfter an operation for a slipped disc in August, 10-year-old pomeranian Yogi was just not himself.\n“He was very lethargic and wouldn’t walk,” says his owner and “pawrent” Clarisse Tan.\nYogi had always been an active, happy dog. Indeed, it was while he was jumping around on the sofa that he fell and injured his back, Ms Tan adds.\nThe 25-year-old, who works in financial services, was even told by the veterinarian who performed the operation that Yogi might not regain full mobility – which, including diagnostics, came up to around $20,000.\nThen, a relative told her about hyperbaric oxygen therapy (HBOT) at RehabVet, an animal rehabilitation clinic in Serangoon Road. Ms Tan did some research online and, in September, decided to give it a try.\nAfter the first session, she noticed that Yogi was more alert and in a better mood. His breathing was also less laboured.\nThe course of treatment recommended was for 10 HBOT sessions, and by the fifth one, the dog seemed back to his former playful self.\n“He would even bark at me and demand that I entertain him,” she says.\nRehabVet offers various types of treatments including physiotherapy, hydrotherapy and traditional Chinese veterinary medicine.\nIt also has its own pressurised chamber for animals that is pumped to a pressure of two bar (200,000 Pa or 200,000 N/sq m) of pure oxygen for HBOT.\nRehabilitation veterinarian Sara Lam, 36, who is the founder of RehabVet, adds that it is the only medical-grade chamber in Singapore for animals and is big enough to fit a Great Dane.\nA one-hour HBOT session in the purpose-built chamber at RehabVet costs $250.\nAt Singapore General Hospital’s Hyperbaric & Diving Medicine Centre, HBOT is used to treat various conditions, including poorly healing wounds in humans.\nSimilarly, at RehabVet, HBOT is used to speed up conditions such as wound healing, as well as neurological and respiratory disorders.\n“Most pet owners will notice that their pet will seem more alert and have a better appetite after just one session,” says Dr Lam.\nAny animal that has to be crated and put in the cargo hold of an aeroplane to be transported to another country would be unhappy.\nSo when Mr Andrew Choo got Metis, a female silver charcoal Bengal cat, from a breeder in Italy, he bought her a seat on the plane to Singapore.\nMetis’ journey started by car from the Italian coastal town of Celle Ligure to the city of Milan.\nThe breeder then flew with the animal in the cabin on a commercial flight to Istanbul, Turkey.\nIn March 2022, Mr Choo met Metis and her breeder at Istanbul Airport for the cat’s first long-haul flight to her new home in Singapore.\nMr Choo, who is the owner of Ryokan Genetique, a cat boarding facility in Desker Road, remembers Istanbul Airport as very pet-friendly.\n“I saw cats and dogs everywhere,” he recalls.\nThe passenger ticket for Metis cost around $2,000 on Turkish Airlines, which allows pets in the cabin.\nMr Choo also paid for his own seat next to her.\nMetis had to be in a pet carrier on board the flight, but, occasionally, Mr Choo would open the carrier to check on her.\n“Once in a while, I let her stretch herself. She was very calm and slept most of the time,” says Mr Choo, who also owns Genetique Bengals, a pet shop in Jalan Pelikat which sells cats, including Bengals.\nUntil Metis, the cats he imported for himself – he has 20 – and his business flew in cargo for affordability reasons. “But you can see that they are stressed when you let them out of the crates,” he says.\nHe was on the waitlist for Metis, which cost $8,000, for more than a year. And, because she would be his own cat, he decided to splurge on her airfare.\n“I also wanted to be able to tell my customers that it is possible to have their new cats fly in passenger seats instead of cargo,” he says. They will, of course, have to cover all the expenses.\nInfo: genetiquebengals.com\nBespoke pet housing\nGuinea pigs may be tiny, but some still feel they should not be confined in store-bought cages.\n“I feel that even the biggest cage you can get for guinea pigs in pet shops is too small,” says pet owner Cristina Lee.\nShe and her friend Brenda Lim have kept guinea pigs for about 10 years. They currently own seven, two of which were “rescued” from a pet shop about two years ago.\n“They were so skinny,” says Ms Lee, 31, of the two from the shop. “The only way to save them was to buy them.”\nNow, all seven guinea pigs live in an interconnected, three-level pet house made by Uncommon Goods Singapore, a local carpentry workshop which specialises in designing and building bespoke pet habitats.\nTheir timber-framed guinea pig home is made from birch plywood with solid wood accents. It is 1.5m high, 1.4m wide and 0.8m deep, and cost about $3,000.\nMs Lee’s brief to designer Ken Chan specified a number of requirements for the guinea pig house.\nApart from the three interconnected levels, she also wanted recessed lights, CCTV cameras, hay troughs and water feeders.\nIt also had to be modular so that it could be easily sectioned to suit the individual needs of the pets, and dismantled if needed.\nThe aesthetics were left to Mr Chan, 43, who was inspired by modern architecture.\nOn level two, there is an elaborate guinea pig-size, Swiss-style chalet with its own terrace.\nThe piece de resistance, however, is the minimalist-chic penthouse that cantilevers over level three.\nThe job of maintaining the house is left to the pet owners. Ms Lee, who is self-employed and works from home, usually does the cleaning and feeding.\nShe estimates that feeding the guinea pigs premium food – which includes fresh herbs and vegetables – and replacing the top-of-line hay and bedding material costs about $1,200 a month.\nAs lavish as the habitat is, the guinea pigs are often let out to roam the bedroom in the rented house in the east where their owners live. It is also when they are free-roaming that they get to bond with their owners.\nGuinea pigs are not demonstrative animals. Unlike dogs, they do not wag their tails when happy or excited.\nBut Ms Lim, 47, who works in sales and trading, believes that a guinea pig that one has bonded with will come when it is called.\n“Quality time is very important because they want to get close to you,” she adds.\nInfo: uncommon.sg\nBody language\nUsing alternative methods of healing enabled animal physiotherapist Karen Quek to alleviate a cat’s distress and aggressive behaviour.\nShe says she identified its root cause as a sterilisation operation the cat underwent, which changed the dynamic of the household it shares with five other cats.\nAggressiveness or any kind of unusual behaviour can be a sign that your pet is stressed and is acting out.\n“This behaviour is usually a manifestation of how they are feeling,” says Ms Quek, 37, co-founder of Gaia Wholistic Animal Wellness centres in Jalan Besar and Bukit Timah Road.\nOther behavioural issues she has encountered in animals include depression, phobias, marking (peeing) and disorders due to past abuse.\nShe says she usually sees about three furry patients with behavioural issues a month.\nShe is a practitioner of BodyTalk, an alternative healthcare system that was developed by Australian chiropractor John Veltheim in the 1990s for humans.\nIt is based on the belief that everyone can be healthy by balancing the energy nodes in the body, similar to the concepts of balancing yin and yang or chakras in traditional Chinese and Indian healing practices respectively\nBodyTalk techniques include the use of touch to intuit imbalances in the energy nodes. It is a modality of therapy that Ms Quek feels is well-suited for animals which cannot verbalise the pain or stress they feel.\nShe adds: “Pet owners who come for this form of therapy usually already believe in complementary healing.”\nShe also practises animal communication, which she combines with BodyTalk, to better “understand the needs” of her animal patients.\nAnimal communication is a form of non-verbal communication that requires the practitioner to enter into a higher consciousness through a form of meditation to communicate with animals. A 1½-hour session costs $205.\nAt Gaia, Ms Quek also offers physiotherapy treatments including electrotherapy, low-level laser therapy, therapeutic ultrasound and hydrotherapy to complement conventional medical treatment by veterinarians. These cost upwards of $155 a session.\nAs it is with humans, she says wellness is becoming an important aspect of healthcare in animals, too.\nMs Quek also gives courses on animal communication, priced at $680 for a three-day course. Many participants are pet owners.\n“Increasingly, pet owners want to know their pets are happy,” she adds.\nInfo: gaia-wholistic.sg\nHotel staycation\nSingapore pets must be some of the luckiest in the world because they can stay in one of the world’s top hotels, Capella Singapore.\nThe pet-friendly hotel on Sentosa was ranked 28th on the 2023 list of The World’s 50 Best Hotels, produced by British media company William Reed, which is behind top-billed food and beverage rankings such as The World’s 50 Best Restaurants and The World’s 50 Best Bars.\nRaffles Hotel Singapore was ranked 17th on the list, but it is not a pet-friendly hotel.\nIn 2021, Capella Singapore upped the ante on pet staycations by collaborating with pet grooming salon Petpawroni to include a pet-spa option with the staycation.\nThe hotel’s general manager Yngvar Stray says this was after the hotel “observed a significant increase in demand for pet-friendly stay experiences”.\nSo far, more than 200 pets have checked in under the Pet Spa-cation package.\nThe pet spa takes place at Petpawroni in Sentosa Cove, with pets chauffeured to and from the appointment.\nIt is an Ayurvedic spa session that uses herbs including boswellia, neem and guduchi.\nDescribing the experience, Petpawroni founder Bernice Chen, 40, says that after the pet is given a thorough wash, Ayurvedic herbs are gently massaged into the coat of the animal.\nAfter the massage, there is another wash to remove the herbs, then a blow-dry.\n“Some pet owners bring their pets here on a weekly basis to address skin issues, while others come to maintain their pet’s coat and prevent ticks and fleas,” she adds.\nDepending on the size of the animal, each session costs between $80 and $160.\nThe standard pet spa service is for dogs and cats, but Capella Singapore welcomes a variety of animals to enjoy a staycation without the spa package.\nWhile the majority of pets that have stayed at the hotel are dogs – the maximum weight allowed is 30kg – pets that guests have taken on vacation include cats, rabbits and hamsters. Mr Stray says the hotel has even hosted guests’ goldfish.\nThe prices of Capella Singapore rooms start at around $1,200 a night. There is no additional charge for pets.\nInfo: str.sg/iNP5\nYoga for pets\nWith yoga being a mainstay in the health and wellness regimens of many people, yoga instructor Audrey Sin decided the traditional Indian practice should be available to dogs too.\nYoga sessions at Puppy Yoga Singapore are for canines and their owners. Each session is conducted in small groups of up to eight, or privately.\nBut Ms Sin points out that not all dogs will take to it.\n“Some dogs like it and some dogs prefer to do their own thing and play. It depends on the dog’s temperament,” says the 26-year-old, who was inspired by similar practices in London.\n“I started dog yoga about two years ago as a way for pet owners and their dogs to spend time together and bond.”\nDogs may participate in a passive way by providing comfort to their owners during the exercises, or being actively involved in poses.\nFor instance, a dog might add weight resistance for some poses. One-hour classes cost $44 for groups and $250 for private sessions.", "url": "https://www.straitstimes.com/life/singapore-s-pampered-pets-puppy-yoga-flights-for-cats-guinea-pig-houses-and-goldfish-staycays"}