{"authors": ["Shawn Hoo"], "date_download": "2024-10-12 13:44:18", "date_modify": "2024-10-12 13:44:18", "date_publish": "2023-11-27 15:00:00", "description": "Here are seven galleries and museums – most of them free – that are worth your time. Read more at straitstimes.com.", "filename": "life_travel_visiting-south-korea-get-your-culture-fix-in-this-artsy-street-in-seoul_1728740658.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/27/Photo20Courtesy20of20Gallery20Hyundai.jpg?h=d4493d1f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_travel_visiting-south-korea-get-your-culture-fix-in-this-artsy-street-in-seoul_1728740658.html", "title": "Visiting South Korea? Get your culture fix in this artsy street in Seoul", "title_page": "Visiting South Korea? Get your culture fix in this artsy street in Seoul | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – A single street in Seoul is the perfect place to map out a cultural itinerary on your next vacation to South Korea, as Samcheong-ro presents a panoramic view of the capital’s exploding art scene for free, or close to free.\nJust a 20-minute bus ride from Myeongdong’s shopping streets, Samcheong-ro is Seoul’s premier arts district. Notably, it offers a different view of South Korea’s cultural ascendancy beyond K-pop, K-beauty and K-drama.\nK-art, too, is going global.\nAn ongoing exhibition of South Korean experimental artists at The Guggenheim in New York City is proof. Seoul, too, is quickly transforming itself into Asia’s next art capital with its roster of international arts events, including the annual Frieze Seoul.\nThere are other artsy neighbourhoods in Seoul.\nHannam and Cheongdam are two with a high density of art galleries. But there is something charming to me about the Samcheong area and its long history, bringing together old and new cultural gems.\nIt is likely that the area blossomed organically, following the move of Gallery Hyundai – South Korea’s longest-running contemporary art gallery – in 1975 from nearby Insa-dong to Samcheong-ro.\nThe area, surrounded on both sides by cultural landmarks, is ideal for an arts district. Gyeongbokgung Palace, built in 1395 and home to the royal family during the Joseon dynasty, sprawls across Samcheong-ro; while Bukchon Hanok Village wraps around the other side, offering an intimate view of traditional Korean houses.\nThe Korean name Samcheong refers to the three purities found in the area: pure water, pure mountains and pure humanity.\nIt is said that poets used to gather in the area to wax lyrical. With gallery rooftops offering stunning mountain views today, the place is still worthy of poetry.\nContemporary art stalwarts such as Kukje Gallery, established in 1982, line the street. But there are also new kids on the block from the international stage, including Berlin-based gallery Peres Projects, which has just opened its second location in Seoul.\nGallery founder Javier Peres says: “Our initial location within The Shilla Hotel was somewhat secluded and private, and we aspired to expand to a larger exhibition space in an even more central and dynamic neighbourhood.”\nA vibrant neighbourhood, he says, is stimulating for his team and his artists. “We feel immersed in the beating heart of one of the most active scenes in contemporary art, which is extremely inspiring.”\nWith more than 10,000 sq m of exhibition space across eight galleries, visitors can easily spend a whole day at MMCA’s Seoul location.\nThe show that steals my heart, however, is South Korean artist Jung Yeon-doo’s One Hundred Years Of Travel, which explores a century of Korean migration to the Mexican state of Yucatan. The show is on until Feb 25.\nThere are only five works on show, but each is crafted to a scale beyond the human form and effectively conveys the drama of diaspora and exile. A room that holds a 12m-high wall of blades sculpted out of sugar is a towering space to contemplate the history of plantation and extreme labour conditions.\nFor more experimental fare, artist Kim Ku-lim’s fascinating and macabre works come together in a solo exhibition that runs till Feb 12. Also, Project Hashtag – which shows collaborative works beyond art – opens till April 7.\nFor those in search of wall texts, thought-provoking curation and a well-stocked art bookshop, MMCA Seoul – which opened in 2013 and is a relative newcomer to the street – is the perfect spot.\nWhere: 30 Samcheong-ro, Jongno-gu, Seoul\nWhen: Wednesdays and Saturdays, 10am to 9pm; and 10am to 6pm on all other days\nAdmission: 2,000 won (about S$2) an exhibition, but look out for free-admission late nights on Wednesdays and Saturdays\nInfo: mmca.go.kr/eng/\n4. Hakgojae Gallery\nThe 555m-long public square holds many surprises, as I discovered on repeat trips between Samcheong-ro and my hotel in Myeongdong.\nOn one occasion, there was an outdoor library where hundreds of readers lounged on bean bags while facing the majestic facade of Gyeongbokgung Palace.\nOn another walk, I was lured by the guttural, soaring voice of music group nuMori’s lead singer during Seoul Music Week in September, and learnt that she was singing a fusion of heavy metal and pansori (a style of Korean musical storytelling).\nIf you are visiting the area in the weeks ahead, check out Seoul Lantern Festival, which will take place from Dec 19 to Jan 24.\nWhere to stay\nIn the heart of Myeongdong is The Plaza Seoul (119 Sogong-ro, nightly rates from $370), an ideal base for your art adventures. Apart from its proximity to Samcheong-ro, it is a two-minute walk from City Hall Station and offers a grand view of the City Hall building. Go to str.sg/ixsE for more information.", "url": "https://www.straitstimes.com/life/travel/visiting-south-korea-get-your-culture-fix-in-this-artsy-street-in-seoul"}