{"authors": ["Tan Hsueh Yun"], "date_download": "2024-10-12 14:03:46", "date_modify": "2024-10-12 14:03:46", "date_publish": "2024-06-06 11:00:00", "description": "Taiwanese chef Angus Chang of Sushi Hare, a 10-seat restaurant at Stanley Street, is welcoming and warm. Read more at straitstimes.com.", "filename": "life_food_food-picks-sushi-hare-kamome-bakery-and-baristart_1728741826.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/06/sushihare.jpg?VersionId=ADfe0BdEAp0UMqKADevNLIFNsueIPNlU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_food-picks-sushi-hare-kamome-bakery-and-baristart_1728741826.html", "title": "Food Picks: Sushi Hare, Kamome Bakery and Baristart", "title_page": "Food Picks: Sushi Hare, Kamome Bakery and Baristart | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Sushi Hare\nStern itamae, or sushi chefs, abound in Singapore. They are men of few words. They look serious, even with masks on. Some even look annoyed. Thank you. I see no need to darken those doors.\nChef Angus Chang of Sushi Hare, however, shows that good sushi can be had without a side helping of attitude.\nThe 38-year-old Taiwanese, whose 10-seat restaurant opened in October 2022, is welcoming and warm. There is even a metal and wood installation at the entrance that looks like the sun. More importantly, however, he listens.\nAt my meal, the first piece of nigiri sushi is ika, scored 30 times. The rice grains are softer than I like, especially with that tender squid. I pipe up, and the subsequent pieces feature firmer shari, tart, just the way I like it.\nHe uses two types of white vinegar for the white shari, and the tartness is a good contrast to torched nodoguro or blackthroat sea perch nigiri, served later in the meal. The fish could be fatter, however. His red shari features three types of aged red vinegar, and is perfect with ankimo or monkfish liver nigiri.\nSushi chefs who take the trouble to process and serve hikarimono or silver-skinned fish are the ones I support. These fish – which include mackerel, horse mackerel, sardines, Pacific saury, and gizzard shad and its younger sibling shinko – need careful treatment because they tend to be more strongly flavoured than easy-to-love tuna.\nHe starts strong pre-sushi, with sardine or iwashi rolled up with nori, shiso leaf, Japanese ginger and scallions. It is tart enough, the nori crunchy. Three perfect mouthfuls.\nLater in the meal, there is a perfect piece of aji or mackerel. Yes, you will get your botan ebi, kegani and chutoro cut into strips like noodles with a shoyu and uni dipping sauce, kinmedai and more uni. But, really, the hikarimono is what thrills me.\nWhatever meal option you choose – lunch is priced at $250, dinner at $380 a person – it will feature what I think is the best tamagoyaki I have had in Singapore. It is a marvel – puffy like a souffle, and flavourful from the Hokkaido amaebi, or sweet shrimps, and Japanese eggs.\nThe egg is never a course I look forward to because it signals the meal is ending. But this is one more reason for me to keep going back.\nWhere: 14 Stanley Street\nMRT: Telok Ayer\nOpen: Noon to 3pm, 6 to 10pm, Tuesdays to Sundays, closed on Mondays\nTel: 9737-0113\nInfo: sushihare.sg\nKamome Bakery – Simply, Daily\nJapanese bakery Kamome Bakery, which opened its first store here in 2019, is having something of a renaissance. It has taken over shop spaces vacated by another Japanese bakery brand, Asanoya, and has unleashed some new offerings.\nI used to haunt its now-closed Joo Chiat store. Aside from the pillowy soft bread pretty much all Japanese bakeries offer, I found the crusty loaves and rolls particularly flavourful.\nAt its Bukit Timah store, which seems cavernous for the current operations, I home in on the new offerings.\nAburi Mentaiko Tamagoyaki ($4.50 each) is my new favourite. Embedded in a soft bun is a tunnel of soft tamagoyaki. On top, mentaiko mayonnaise and cheese. Everything comes together well, but you must revive the bun in the toaster oven first.\nCurry Egg Danish ($4.60) also needs reviving in the oven, and that is when you get that textural contrast between crisp croissant dough and soft pork and vegetable kare filling.\nNot new but very good is a Pork Cutlet sandwich ($3.80), with tender tonkatsu stuffed in a soft bun. The filling in the Bacon & Cheese French ($6 for a quarter-loaf portion) is generous. A couple of minutes in the toaster oven makes it worth every calorie.\nOne bake, flagged as “new” on the description card, is Sesame Mochi ($4). It is not new – I had written about it in February 2023, when it was called Awfully Sesame Mochi. It is churlish to nitpick, since I am so glad it is back. The bun, covered with black and white sesame seeds, is filled with black sesame paste and a dollop of mochi. Excellent.\nNot everything thrills me, however. The Matcha Scone Sandwich ($4.50), filled with strawberry milk buttercream, is lacking in green tea oomph.\nWhere: 913 Bukit Timah Road and B1-K27 Paragon, 290 Orchard Road\nMRT: King Albert Park/Orchard\nOpen: 8.30am to 5.30pm daily (Bukit Timah) and 8.30am to 9pm daily (Paragon)\nInfo: kamomebakery.asia\nBaristart", "url": "https://www.straitstimes.com/life/food/food-picks-sushi-hare-kamome-bakery-and-baristart"}