{"authors": [], "date_download": "2024-10-12 13:55:52", "date_modify": "2024-10-12 13:55:52", "date_publish": "2024-04-05 04:00:00", "description": "Read more at straitstimes.com.", "filename": "life_handheld-laser-therapy-beauty-device-anti-ageing_1728741352.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/04/handheld%20laser%20therapy%20feature.png?VersionId=yyHirbTP.fSZeORGw2dY0cTwD4nqTFI_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_handheld-laser-therapy-beauty-device-anti-ageing_1728741352.html", "title": "This at-home handheld laser therapy device is so powerful, it can be used in professional clinics", "title_page": "This at-home handheld laser therapy device is so powerful, it can be used in professional clinics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Have you heard about the Lyma Laser Pro? It’s a handheld laser therapy device that claims to be 700 times more powerful than other at-home beauty devices.\nThis clinically proven beauty device is accordingly so effective, it’s powerful enough to be used in beauty clinics for professional-grade aesthetic treatments for the face and body.\nIt’s also priced at US$6,250 (approximately S$8,450), making it one of the more expensive beauty devices compared to other devices on the market.\nA market intelligence report by the US International Trade Administration published in June 2023 shares that Singaporeans have been investing more in quality beauty treatments that can be easily done at home.\nAnd it’s no surprise, with a bigger shift and emphasis on self-care ever since the COVID-19 pandemic, which has led to a rising popularity of home beauty tech devices that can be conveniently incorporated into daily skincare routines.\nLyma founder Lucy Goff shares: “So many clinicians use the original Lyma Laser in their treatments, and they asked if we could create something that would amplify its results.”\nThe result, after four years of development with a team of geneticists, plastic surgeons and scientists, is the Lyma Laser Pro.\nIt combines three lasers in one device for faster and more effective results and was even recently awarded Time Magazine’s Invention of the Year in 2023.\nAt the core of the product is advanced laser technology, emitting a wavelength that allows the laser to penetrate up to 10 centimetres beneath the skin without causing damage or discomfort.\nWhat makes this particularly groundbreaking is its ability to remodel and rebuild the skin from the inside out.\nRemarkably, it claims to increase skin elasticity by over 103 per cent in just 30 days, promoting collagen production and cellular renewal. Find out more about Lyma’s laser technology.\nCosmetic surgery results at home\nAs a result, the Lyma Laser Pro promises to help reduce and reverse the skin’s ageing process, addressing a myriad of skin concerns such as sagging skin, cellulite, wrinkles and uneven pigmentation.\nUnlike most clinical lasers, it requires no recovery time, making it an ideal addition to home beauty routines for professional-grade results without the hassle of clinic visits.\n“It’s fair to say that all surgery comes with some degree of pain and downtime, and this doesn’t suit everyone,” said Dr Graeme Glass, a craniofacial and plastic surgeon who also worked with the Lyma team to develop the product.\n“The Lyma Laser Pro is the closest thing you’ll get to surgery results without any of the pain or downtime, and that makes it an attractive option for everyone.”\nThe creators of the Lyma Laser Pro have also designed it to be suitable for the body, which can help to tighten skin, reduce cellulite and even ease muscular discomfort.\nIs the Lyma Laser Pro worth the investment?\nAt more than S$8,000, the Lyma Laser Pro is undeniably an eye-watering price, especially in comparison to other beauty devices on the market.\nThat being said, similar in-clinic laser treatments cost between S$50 to S$5,000 per session and require multiple visits to yield results.\nIs investing in the Lyma Laser Pro worth the price and convenience? We’ll let you be the judge of that.\nDiscover more about the benefits and technology behind the Lyma Laser Pro", "url": "https://www.straitstimes.com/life/handheld-laser-therapy-beauty-device-anti-ageing"}