{"authors": ["Tan Hsueh Yun"], "date_download": "2024-10-12 14:20:59", "date_modify": "2024-10-12 14:20:59", "date_publish": "2024-08-01 11:30:00", "description": "The curry noodles from Masala Curry Mee in Havelock Road captures Singapore in a bowl. Read more at straitstimes.com.", "filename": "life_food_food-picks-masala-curry-mee-terang-bulan-and-vietnam-kitchen_1728742859.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/rrfoodpicks0108.jpg?VersionId=iRjSzR7q7P2OQt6N3ipE.ozd9v7ahHPc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_food-picks-masala-curry-mee-terang-bulan-and-vietnam-kitchen_1728742859.html", "title": "Food Picks: Masala Curry Mee, Terang Bulan and Vietnam Kitchen", "title_page": "Food Picks: Masala Curry Mee, Terang Bulan and Vietnam Kitchen | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Masala Curry Mee\nTucking into curry noodles from Masala Curry Mee, it strikes me that it captures Singapore in a bowl.\nYes, it is inspired by Ipoh curry noodles and Sarawak laksa. But the gravy is harmonious, with no jarring notes from rempah not properly and patiently cooked – much like the melting pot of cultures that makes up Singapore. I love that thick consistency too, sort of like a bisque – courtesy of the chicken collagen in the broth, which also includes seafood.\nThe dish comes from the mind, palate and skill of food entrepreneurs Tinoq Russell Goh, 59, who, with Dylan Chan, 37, ran a private-dining business, PasirPanjangBoy, serving Peranakan food.\nNow, instead of waiting for a booking, people can rock up to Havelock Road and enjoy a bowl of Masala Curry Mee ($6, $8 or $10 a bowl).\nThe toppings, mostly made from scratch, are quite something. My $10 bowl is loaded with sweet prawns, a crunchy slice of five-spice fritter, a deep-fried wonton, chicken char siew, fish cake, a boiled egg, tofu puffs and strips of cuttlefish. A little bit of this, a little bit of that.\nAdding allure are the Thai basil leaves on the side. The fragrance enhances that already-terrific gravy. There is supposed to be mint too, but those leaves were missing from my bowl. You can choose from hor fun, bee hoon and yellow noodles. My pick, no regrets, is thin hor fun that the gravy coats beautifully.\nWhere: 01-01 Havelock Road Cooked Food Centre, 22A Havelock Road\nMRT: Havelock\nOpen: 11.30am to 8.30pm (Tuesdays to Sundays), closed on Mondays\nInfo: @pasirpanjangboy (Instagram)\nTerang Bulan\nOn days when I want to throw caution to the wind, I head to Terang Bulan, a restaurant in Wisma Geylang Serai. It serves two things dear to my overworked heart: fried chicken and martabak manis, a thicker version of mee chiang kueh.\nThe chicken is Indonesian ayam geprek – battered, deep-fried then smashed, which is what geprek means – and topped with sambal. Thankfully, at this place, the sambal is served on the side. I like all three options (sambal ijo, sambal belado or sambal berdesut), but almost always choose the green ijo because it is just spicy enough for me.\nI dab the sambal on the underside of the chicken, where the meat is, so there is nothing interfering with the phenomenal crunch of that breaded skin.\nYou can have fish, prawn or squid too, and have them with rice. But my usual order is Indomie Ayam Geprek ($8.50) because I believe in going big. The little pile of instant noodles is just plain satisfying. Served alongside is a square of fried firm tofu, a slice of tempeh and, in a concession to health, a cherry tomato and a lettuce leaf.\nThe Martabak Manis ($7.50) boasts irresistibly crisp edges. The thick middle can sometimes be undercooked and pasty. But when made well, it is pillowy soft. There are 14 fillings, but I always go for Cheesy Corn. Know, though, that you have to finish it fast – the pancake hardens as it cools.\nWhere: 02-07 Wisma Geylang Serai, 1 Engku Aman Turn\nMRT: Paya Lebar\nOpen: 10am to 9pm daily\nInfo: @terangbulansg (Instagram)\nVietnam Kitchen\nTucked in a corner of Great World is a tiny Vietnamese restaurant that shares seating space with Japanese confectionery chain Chateraise. I stumble on it during a cream puff run. Since then, I have been haunting the place.\nThe menu is small, and I’ll say that the Pho Beef ($10.90), Bun Bo ($11.90) and Fresh Spring Roll ($6.90) are serviceable. The Fried Spring Roll ($5.90) is too greasy for me. What I keep going back for is the Bun Cha ($11.90), springy rice vermicelli with a tangy and warm dipping sauce. In it are slices of carrot and green papaya, fried pork belly and juicy pork patties.\nServed alongside are greens – lettuce leaves, slices of cucumber and herbs. My latest platter featured basil leaves and very aromatic perilla leaves that look and taste like a cross between Japanese and Korean perilla.\nI appreciate the sear on those meatballs, and the fact that the meat is not ground too fine. There is chunk and texture in each bite, and the meat soaks up the peppy dipping sauce so well. In this heat, tucking into a bowl of hot noodles can be cruel and unusual. Dipping noodles and greens into a warm sauce is totally up my alley.\nWhere: 01-116 Great World, 1 Kim Seng Promenade\nMRT: Great World\nOpen: 10.30am to 8.45pm (last order) daily\nInfo: @vietnamkitchensg (Instagram)", "url": "https://www.straitstimes.com/life/food/food-picks-masala-curry-mee-terang-bulan-and-vietnam-kitchen"}