{"authors": [], "date_download": "2024-10-12 13:35:58", "date_modify": "2024-10-12 13:35:58", "date_publish": "2024-10-02 07:48:00", "description": "He has been dogged by accusations of violent abuse of women and is now sitting in jail on criminal charges. Read more at straitstimes.com.", "filename": "life_over-100-people-to-sue-sean-diddy-combs-for-sex-assault-lawyer_1728740158.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/COMBSPARTIES1.JPG?VersionId=Klvd_Y4_5WU5943Uq41DbhGFLEzFGY4E", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_over-100-people-to-sue-sean-diddy-combs-for-sex-assault-lawyer_1728740158.html", "title": "Over 100 people to sue Sean ‘Diddy’ Combs for sex assault: Lawyer", "title_page": "Over 100 people to sue Sean ‘Diddy’ Combs for sex assault: Lawyer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HOUSTON – More than 100 people, including dozens of children, who say they were victims of rape, sexual assault and sexual exploitation at the hands of Sean “Diddy” Combs are to sue the American rap star, a lawyer said on Oct 1.\nThe latest legal action will heap further pressure on a man who once bestrode American pop culture, but who has long been dogged by accusations of violent abuse of women, and who is now sitting in jail on criminal charges.\n“The biggest secret in the entertainment industry, that really wasn’t a secret at all, has finally been revealed to the world,” Texas-based attorney Tony Buzbee said, as he announced plans by 120 people, including 25 minors, to take civil action.\n“The wall of silence has now been broken, and victims are coming forward.”\nCombs, 54, was indicted in September on three criminal counts that allege he sexually abused women and coerced them into drug-fuelled sex parties using threats and violence.\nAllegations have been building against the Grammy Award winner since 2023, when American singer Cassie, whose real name is Casandra Ventura, alleged Combs subjected her to more than a decade of coercion by physical force and drugs, as well as a 2018 rape.\nA spate of similarly lurid lawsuits since has painted a picture of Combs as a violent man who used his celebrity status to prey on women.\nHe has pleaded not guilty to the criminal charges. He has been jailed while awaiting trial.\nPattern of abuse\nAt a press conference in Houston, Mr Buzbee said more than 3,000 people had come forward with allegations against Combs, and he appealed for anyone else who might have been a victim to come forward.\nHe said much of the abuse Combs and members of his entourage are alleged to have carried out followed a pattern.\n“I would say 90 per cent of the cases, these individuals were drugged,” he told reporters.\n“One individual who was 22 years at the time she was assaulted, said that... when you were handed a drink – and now we know that the drink is laced with something – if you refused to drink it, you were kicked out of the party.”\nMr Buzbee described instances of repeated rape of teenagers, allegedly carried out by Combs and his associates.\nHe said alleged abuse of minors often took place in the context of a promise of fame and fortune in the music industry.\nFears of retribution\nOne boy, who was just nine years old at the time, was taken to New York to audition for Combs’ label Bad Boy Records.\n“This individual was sexually abused, allegedly by Sean Combs and several other people at the studio, in the promise to both his parents and to himself of getting a record deal,” Mr Buzbee said.\n“Another incident, an individual, 15 years old at the time, flown to New York City to attend a party, was drugged and then taken into a private room, allegedly in the presence of Mr Combs, where this female individual, a minor, was raped, and then other individuals took turns raping her.”\nMr Buzbee praised the courage of those who had come forward despite fears of retribution or backlash from their own communities.\n“I expect that through this process, many powerful people, many dirty secrets will be revealed.\n“We know what we are potentially up against, and as is always the case in situations like this, when a celebrity is involved, people can be downright mean and nasty.” AFP", "url": "https://www.straitstimes.com/life/over-100-people-to-sue-sean-diddy-combs-for-sex-assault-lawyer"}