{"authors": ["Ong Sor Fern"], "date_download": "2024-10-12 13:58:55", "date_modify": "2024-10-12 13:58:55", "date_publish": "2024-07-05 18:10:00", "description": "Violinists David Coucheron and Kevin Lin will share duties in leading the Singapore Symphony Orchestra for multiple weeks in the season. Read more at straitstimes.com.", "filename": "life_arts_sso-appoints-two-guest-concertmasters-tours-kyoto-in-october_1728741535.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/05/hzsymphony0507.jpg?VersionId=bmu0LjpALOti864Dampo0Q2F3IZUT3yJ&h=8b3aad8b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_arts_sso-appoints-two-guest-concertmasters-tours-kyoto-in-october_1728741535.html", "title": "SSO appoints two guest concertmasters, tours Kyoto in October", "title_page": "SSO appoints two guest concertmasters, tours Kyoto in October | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Singapore Symphony Orchestra (SSO) has appointed two co-principal guest concertmasters, Norwegian violinist David Coucheron and American violinist Kevin Lin.\nThe positions have been vacant since previous co-chairs Igor Yuzefovich left in 2019 and Cultural Medallion recipient Lynnette Seah retired that same year.\nCoucheron and Lin come with impeccable credentials. When Coucheron joined the Atlanta Symphony Orchestra as concertmaster in 2010, he was the youngest concertmaster of a major American orchestra. He earned his Master of Music from The Juilliard School and his Master of Musical Performance from the Guildhall School of Music and Drama.\nLin has been a guest concertmaster with the SSO, London’s Royal Philharmonic Orchestra and the Taiwan Philharmonic. He is currently artist-in-residence at Butler University, Jordan College of the Arts and concertmaster of the Indianapolis Symphony Orchestra.\nThe duo will share duties in leading the SSO for multiple weeks in the season, even as the orchestra steps up efforts to fill the position on a permanent basis.\nCoucheron will also tour with SSO on its previously announced Australian tour in 2025.\nBefore that, in October, the SSO will also be heading to Kyoto, Japan, for its first overseas tour since 2017. The SSO is the only international orchestra invited to perform at Asia Orchestra Week on Oct 19. Organised by Japan’s Agency for Cultural Affairs, Asia Orchestra Week began in 2002 and promotes classical music.\nThe SSO will be conducted by Austrian music director Hans Graf in a performance of Beethoven’s Fifth Symphony, Mendelssohn’s Overture To A Midsummer Night’s Dream and Luciola singapura, a multi-award-winning composition by Singaporean composer Koh Cheng Jin. They will be joined by renowned French pianist Helene Grimaud for Ravel’s Piano Concerto in G Major.\nThe same programme, without the Mendelssohn, will be played in Singapore on Oct 16.\nBesides performing in Kyoto, the SSO will also take part in a symposium on Oct 20 alongside speakers from the City Of Kyoto Symphony.", "url": "https://www.straitstimes.com/life/arts/sso-appoints-two-guest-concertmasters-tours-kyoto-in-october"}