{"authors": ["Tan Hsueh Yun"], "date_download": "2024-10-12 14:04:02", "date_modify": "2024-10-12 14:04:02", "date_publish": "2024-08-29 16:15:00", "description": "It will have 130 seats indoors and outdoors. Read more at straitstimes.com.", "filename": "life_food_singapore-food-personality-violet-oon-to-open-restaurant-in-dempsey_1728741842.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/htghost.955de9a4.Attachment.173108.jpg?VersionId=8qIst07nLjMMJrgf9cVsk9WFMVNOK0Bt&h=859742e3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_singapore-food-personality-violet-oon-to-open-restaurant-in-dempsey_1728741842.html", "title": "Singapore food personality Violet Oon to open restaurant in Dempsey", "title_page": "Singapore food personality Violet Oon to open restaurant in Dempsey | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Cooking doyenne Violet Oon will be opening a restaurant with a cooking studio in the Dempsey gourmet enclave in early 2025\nThe 75-year-old, who runs three restaurants with her daughter Tay Su-Lyn, 47, and son Tay Yiming, 42, is famous for her Peranakan food as well as for putting Singapore food on the world map.\nHer latest restaurant venture was announced on the Singapore Land Authority’s Instagram page (@singaporelandauthority) on Aug 29. The post said she was awarded the tender for the space, adding that the restaurant will have indoor and outdoor seating, set against lush green surroundings.\nIt is also a historic place, dating back to 1860, when it was the British military barrack complex. Today, the low-rise buildings house restaurants, cafes, gourmet stores and other lifestyle businesses.\nRestaurants that opened there in 2024 include Torno Subito by Italian chef Massimo Bottura and Sri Lankan brand Ministry of Crab. It is also home to one-Michelin-starred Peranakan restaurant Candlenut.\nThis is Ms Oon’s first major business development after she parted ways with her former business partner, luxury and lifestyle company Group MMM and its director Manoj Murjani. Mr Murjani bought a 50 per cent share in Ms Oon’s business in 2014.\nMs Oon and her children brought a shareholder oppression suit in 2022 against Mr Murjani and Group MMM.\nIn January 2024, the family won the civil suit, with Singapore’s High Court ordering that the family buy out Mr Murjani’s 50 per cent stake in the company at fair value. The parties settled out of court in July.\nThe family said in a statement: “The Violet Oon family is happy to be in this beautiful landmark space, a location that will soon become the home of Violet Oon Singapore In Dempsey, the newest addition to the Violet Oon restaurants.\n“Embracing the natural beauty of this heritage site, we are excited to celebrate Singapore’s Peranakan culinary heritage at Dempsey, and look forward to creating a unique dining experience that will continue to showcase our vibrant flavours and traditions.”\nWhen contacted, Ms Oon says the restaurant is still in the planning stages, but adds that it will have 130 seats indoors and outdoors.", "url": "https://www.straitstimes.com/life/food/singapore-food-personality-violet-oon-to-open-restaurant-in-dempsey"}