{"authors": ["Shawn Hoo"], "date_download": "2024-10-12 13:59:57", "date_modify": "2024-10-12 13:59:57", "date_publish": "2024-08-11 10:00:00", "description": "She performs with Singapore-based cellist Qin Li-Wei at the Victoria Concert Hall on Aug 31. Read more at straitstimes.com.", "filename": "life_arts_pianist-kathryn-stott-yo-yo-ma-s-musical-partner-for-40-years-bids-farewell-in-s-pore-concert_1728741597.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/11/Kathryn20Stott.jpg?VersionId=vgEoiq4wKP1rsiWy7pKE9YU04FoalFt0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_arts_pianist-kathryn-stott-yo-yo-ma-s-musical-partner-for-40-years-bids-farewell-in-s-pore-concert_1728741597.html", "title": "Pianist Kathryn Stott, Yo-Yo Ma’s musical partner for 40 years, bids farewell in S’pore concert", "title_page": "Pianist Kathryn Stott, Yo-Yo Ma’s musical partner for 40 years, bids farewell in S’pore concert | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – British classical pianist Kathryn Stott does not know how or what she will play for leisure after she retires from her 45-year whirlwind career on stage at the end of 2024.\nShe has only ever played for work since her career took off abruptly when she was 19. Placing fifth at the Leeds International Piano Competition in 1978, Stott went from performing zero to 90 concerts a year. “I didn’t feel like I could say no to anything,” she says.\nNow, at the midpoint of her farewell tour, which ends with a final recital in Liverpool on Dec 11 – a day after she turns 66 – she wonders about the new relationship she will have with an instrument she has played since age five.\n“I’m curious to know how I will go (back) to the piano – how long it might take me. It might be a week or months later. The fact is, I have a choice,” says Stott, whose storied career includes a 40-year musical partnership with legendary American cellist Yo-Yo Ma and performing at the BBC Proms, an annual classical concert held at London’s Royal Albert Hall.\nStott – who performed in Singapore with Ma at the Victoria Concert Hall in 1993 – will make a final professional appearance in the country at the same venue on Aug 31. She plays with Chinese-Australian cellist Qin Li-Wei, who teaches at the Yong Siew Toh Conservatory of Music.\nWhile Stott’s career has allowed her to travel worldwide, her packed schedule meant she has not been able to see much of the cities she plays in, including Singapore. She says: “You arrive as late as possible in the country or city, and you leave as soon as possible to get home to your family.”\nThis time, she will arrive in Singapore a day earlier and plans to walk around the city and markets to observe everyday life. She is learning to slow down and talks about finding more time for pottery, drawing and the countryside – as well as being a grandmother.\n“To be a musician at a high level requires incredible discipline, it’s never-ending. You have to stay in shape like an athlete,” says Stott. It is not just about the strength of the fingers, she says, as pianists use muscles throughout their body and can feel tired from continuous practice.\nBut comparing professional music with athletes such as tennis players, she says: “They have all these coaches, physiotherapists, mental coaches – like eight people around them – and we have nobody.”\nShe has picked a date for her final public performance partly to make an exit when she is in top form.\nStott is expectant about playing with Qin in Singapore, having courted the collaboration with the Singapore-based cellist when she heard him play at the Sydney International Piano Festival Competition in 2023.\nAlthough the two have never played together, she knew instinctively that she could have a “great musical conversation” with Qin – who taught at the Royal Northern College of Music in Manchester, where Stott teaches now. The duo will go on to play in China after the Singapore concert.\n“I haven’t felt like that about many musicians,” she says. “I think you recognise when you have a similar spirit with someone else. It’s like if you’re talking with a person and you realise that you’re connected somehow.”\nThe programme includes works by Robert Schumann, Johannes Brahms, Sergei Rachmaninov and Zoltan Kodaly’s Sonatina For Cello And Piano, a less frequently performed piece which Stott calls “a real little gem of a piece in between things which are more core repertoire”.\nOf her final months performing in public, Stott says: “Occasionally, it feels a little bit emotional. I look at people’s faces and I think about how I’m not going to see that again.”\nStott, who will be doing a final European tour with Ma after the Singapore show, is unsure how she will feel about the end of a lifelong musical partnership. “As I’ve said to Yo-Yo, it doesn’t mean we can’t play something together – it just won’t be in front of thousands of people.”\nIn her retirement – Stott flinches at the word, adding that she fully intends to keep busy in different ways – she hopes to spend more time with her family and continue teaching at the Royal Northern College of Music.\n“It’s nice to give something back to my city. I’ve taught in many places farther away, but I want to invest in what is near to me now.”\nBook It/Cello & Piano Duo Recital: Qin Li-Wei & Kathryn Stott", "url": "https://www.straitstimes.com/life/arts/pianist-kathryn-stott-yo-yo-ma-s-musical-partner-for-40-years-bids-farewell-in-s-pore-concert"}