{"authors": [], "date_download": "2024-10-12 13:35:59", "date_modify": "2024-10-12 13:35:59", "date_publish": "2024-10-04 09:59:00", "description": "A woman who worked as a hair and make-up stylist for Brooks says he subjected her to repeated advances. Read more at straitstimes.com.", "filename": "life_garth-brooks-is-accused-of-rape-and-assault-in-lawsuit_1728740159.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/04/2024-10-04T005214Z687167283RC2OW0A4J1Z6RTRMADP3PEOPLE-GARTH-BROOKS.JPG?VersionId=.g8LS6JNq0LxwWrJ25YpsYMVZAe1TeXQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_garth-brooks-is-accused-of-rape-and-assault-in-lawsuit_1728740159.html", "title": "Country music star Garth Brooks accused of rape and assault in lawsuit", "title_page": "Country music star Garth Brooks accused of rape and assault in lawsuit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Garth Brooks, one of American country music’s biggest stars, has been accused of sexual assault by a woman who said he raped her in a Los Angeles hotel room and subjected her to repeated unwanted sexual advances over a period of about two years, according to a lawsuit filed in a California court on Oct 3.\nThe woman was not named in court papers, but was described as a hair and make-up stylist who worked with Brooks from 2017 to about 2020.\nIn that time, her suit says, he repeatedly harassed her, describing graphic sexual fantasies and, in one instance, placing her hands on his genitals when he came out of a shower.\nIn a statement late on Oct 3, Brooks said that for the last two months, he had been “hassled to no end with threats, lies and tragic tales of what my future would be if I did not write a cheque for many millions of dollars”.\n“Hush money, no matter how much or how little, is still hush money,” the 62-year-old added. “In my mind, that means I am admitting to behaviour I am incapable of – ugly acts no human should ever do to another.”\nLitigation over the woman’s accusation began three weeks ago with an anonymous suit filed in federal court in Mississippi.\nIn that case – called John Doe Vs Jane Roe – a man identified only as “a celebrity and public figure who resides in Tennessee” said that a woman residing in Mississippi had made “false and outrageous allegations of sexual misconduct she claims occurred years ago”.\nHe asked a judge to protect his identity and to declare that the woman’s accusations against him were false.\nIn a filing this week in response, the woman’s lawyers portrayed that lawsuit as a pre-emptive move to silence her, and said that she would be filing her case imminently, which would name the man.\nThe 27-page lawsuit filed by the woman on Oct 3, in Los Angeles Superior Court, says she is the same person listed as the defendant in the Mississippi action, and identifies Brooks as the John Doe plaintiff.\nThe court papers in her California case call that Mississippi case “a blatant attempt to further control and bully his sexual assault victim by utilising his multimillionaire resources to game the legal system”.\nThe suit alleges sexual assault, battery and gender violence. It was filed under California’s Sexual Abuse and Cover-Up Accountability Act, which allows sexual abuse claims to be revived that otherwise would be barred by the statute of limitations. NYTIMES", "url": "https://www.straitstimes.com/life/garth-brooks-is-accused-of-rape-and-assault-in-lawsuit"}