{"authors": [], "date_download": "2024-10-12 13:36:30", "date_modify": "2024-10-12 13:36:30", "date_publish": "2024-05-22 23:16:06", "description": "Combs is the target of several civil lawsuits that characterise him as a violent sexual predator who used alcohol and drugs to subdue his victims. Read more at straitstimes.com.", "filename": "life_entertainment_sean-diddy-combs-accused-of-sexually-assaulting-model-in-new-lawsuit_1728740190.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/22/FILES-US-CRIME-ENTERTAINMENT-DIDDY-ASSAULT-125434.jpg?VersionId=5wHrKtkm2dYehT.OiMXDeDsVa.GuGpCR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_sean-diddy-combs-accused-of-sexually-assaulting-model-in-new-lawsuit_1728740190.html", "title": "Sean 'Diddy' Combs accused of sexually assaulting model in new lawsuit", "title_page": "Sean 'Diddy' Combs accused of sexually assaulting model in new lawsuit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Another sexual assault lawsuit has been filed against Sean “Diddy” Combs, the latest in a string of allegations against the American rapper as he increasingly comes under scrutiny for his treatment of women.\nFormer model Crystal McKinney said on May 21 that Combs had forced her to perform oral sex on him at a party in 2003.\nThe assault occurred after she was “pressured to imbibe” alcohol and marijuana, including a joint she believed to be laced with another narcotic, the lawsuit said.\nCombs is the target of several civil lawsuits that characterise him as a violent sexual predator who used alcohol and drugs to subdue his victims, and his homes were raided earlier in 2024 by federal agents.\nCombs, who has denied previous accusations, has not responded to the latest allegation.\nHowever, last week he issued an apology after video surfaced of him physically assaulting his then-girlfriend Casandra Ventura in 2016.\nThe footage, which was published by CNN, shows the rap mogul hitting, dragging and kicking Ventura, who in a recent lawsuit said Combs subjected her to more than a decade of coercion by physical force and drugs, plus a 2018 rape.\nVentura sued Combs in federal court last fall in a bombshell suit that was settled out of court but succeeded by a string of similarly lurid sexual assault claims against the hip-hop star.\nMcKinney’s suit cited Ventura’s case, plus four others against Combs in New York, saying she felt “a moral obligation to speak up” after seeing the other lawsuits.\n“To this day, Plaintiff experiences bouts of depression, anxiety, body image issues, feelings of worthlessness and intimacy issues because of Combs’ assault,” the lawsuit says, while also accusing the rapper of using his influence to stifle her career. AFP", "url": "https://www.straitstimes.com/life/entertainment/sean-diddy-combs-accused-of-sexually-assaulting-model-in-new-lawsuit"}