{"authors": ["Mervin Beng"], "date_download": "2024-10-12 13:59:39", "date_modify": "2024-10-12 13:59:39", "date_publish": "2024-08-25 10:45:00", "description": "Choral directors Toh Ban Sheng and Ambroz Copi have a musical kinship. Read more at straitstimes.com.", "filename": "life_arts_concert-review-raffles-singers-ros-and-slovenia-s-kgbl-put-on-impressive-show_1728741579.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/25/Raffles20singers20credit20copyright20Hagen20Indra.jpg?VersionId=JlXTh67gFBW2ugK6_eMSnXgQYUuD7lQn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_arts_concert-review-raffles-singers-ros-and-slovenia-s-kgbl-put-on-impressive-show_1728741579.html", "title": "Concert review: Raffles Singers, ROS and Slovenia’s KGBL put on impressive show", "title_page": "Concert review: Raffles Singers, ROS and Slovenia’s KGBL put on impressive show | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Raffles Singers – Awakening\nRaffles Singers, The ROS Singers, KGBL Chamber Choir (Slovenia)\nVictoria Concert Hall\nAug 23, 7.45pm\nThe common thread linking Raffles Singers, The ROS Singers and KGBL Chamber Choir from Slovenia, apart from choral excellence, appears to be a fondness to compete in, and to win multiple prizes at, choral competitions.\nThe musical kinship of their respective choral directors Toh Ban Sheng and Ambroz Copi brought their choirs together in one of the most impressive and enjoyable choral concerts of the year.\nThe evening seemed designed for complete equity and symmetry, with no favour to the host or guest choirs. There were sets of four works for each in the first half, then three-work sets for each choir in the second half, topped off by two pieces for combined choir, one each conducted by Toh and Copi.\nTopping this off were two encores, naturally led by each of the directors.\nThe roots and choral tradition of Raffles Singers can hardly be more different than that of the KGBL choir.\nRaffles Singers began as an alumni group of the Raffles Chorale, the choir of Raffles Junior College, which itself was founded in 1982. The KGBL choir, on the other hand, can trace its history for centuries, all the way from the early 1800s Secondary Music School system in Ljubljana, Slovenia.\nThe first four pieces sung by the Raffles and ROS Singers were local or Asian works arranged by Toh, including a world premiere of Yan Zi (Swallow Song), a Xinjiang/Kazakh folk melody. Toh’s clever and sensitive use of extended vocal techniques such as throat singing, hand-rubbing sounds and adventurous harmony made this a unique, colourful opening.\nHis precise directions and careful phrasing brought out a very polished and unified sound from the choir. Through all the pieces, there was a very high level of intonation and ensemble, with every note carefully prepared and placed.\nConductor Copi and the KGBL choir followed, lifting the concert to even loftier heights.\nTrue to its name as a “chamber” choir, it performed as a top chamber group, with every singer distinctly audible, yet in full harmony with the others. Copi’s conducting was more facilitation than direction, encouraging his very capable singers to create music with one another.\nWhile it appeared that Raffles’ and ROS’ singers took much care not to deviate from the group sound, each of the KGBL choir’s 35 singers seemed empowered to bring an individual timbre and colour into the singing, coupled with brilliance and character. Copi’s genius was to blend and balance the talented voices, bringing the choir from almost nothing to rousing fortissimos.\nThe KGBL choir’s first half featured songs with themes of nature and life from its region. After the intermission, its set of liturgical songs incorporated stage movements and choreography, while Raffles and ROS Singers added variety to their songs with tuned (“singing”) glasses and handchimes.\nAt the close, the choirs combined under Toh, then Copi, in world premieres of two songs composed by members of the KGBL choir.\nEach choir brought its own strengths to the concert, but there was plenty to enjoy throughout the evening. The Raffles and ROS Singers excelled in their polish and refinement. The KGBL choir, through their energy and virtuosity, showed why they deserve the many top prizes they have won in choral competitions worldwide.", "url": "https://www.straitstimes.com/life/arts/concert-review-raffles-singers-ros-and-slovenia-s-kgbl-put-on-impressive-show"}