{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:18:11", "date_modify": "2024-10-12 14:18:11", "date_publish": "2024-04-26 15:00:00", "description": "A weekly round-up of motoring news. Read more at straitstimes.com.", "filename": "life_motoring_fast-lane-byd-top-selling-car-here-in-first-quarter-fastest-tesla-arrives-in-singapore_1728742691.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/26/Mercedes-AMG20GT63S20E20Performance.jpg?VersionId=FFq45sqoiyBternIVLQzsbSRGon_ge2H", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_fast-lane-byd-top-selling-car-here-in-first-quarter-fastest-tesla-arrives-in-singapore_1728742691.html", "title": "Fast Lane: BYD top-selling car here in first quarter, fastest Tesla arrives in Singapore", "title_page": "Fast Lane: BYD top-selling car here in first quarter, fastest Tesla arrives in Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Mercedes unveils swiftest production AMG\nMercedes-AMG has unveiled its quickest model yet – the AMG GT63S E Performance, a plug-in hybrid with 816hp and 1,420Nm of torque. The car hits 100kmh in 2.8 seconds and onto a top velocity of 320kmh.\nPower comes from a 4-litre bi-turbo V8 engine assisted by a rear-mounted 150kW permanently excited synchronous electric motor with an electrically switched two-speed transmission and a mechanical rear limited-slip differential.\nThe all-wheel drive is fitted with adaptive air suspension, roll stabilisation, rear-axle steering and ceramic composite brakes. A 6.1kWh battery can deliver 13km of pure electric propulsion.\nBYD bestseller as electric cars garner one-third of first-quarter sales\nBYD has emerged as Singapore’s best-selling car brand in the first quarter of 2024, with 1,196 units registered – a first for a solely electric brand.\nAccording to Land Transport Authority figures, BMW is second with 1,176; Mercedes is third with 1,158; Toyota a distant fourth with 821; and Nissan fifth with 425. The numbers exclude parallel imports.\nThe acceptance of electric cars continued to grow, with close to one in three new cars registered being battery powered. This was up sharply from 18 per cent at the end of 2023. Including parallel imports, the top five electric brands are BYD, BMW (410 units), Tesla (348), Hyundai (218) and MG (128).\nMini with vim and versatility\nMini has released details of its electric Aceman. Positioned between the Cooper and the Countryman, the model is available with two output variants.\nThe Aceman E has a 42.5kWh battery feeding a 135kW/290Nm motor to send the car to 100kmh in 7.9 seconds. It promises a range of 308km.\nThe Aceman SE has a 54.2kWh battery and an output of 160kW/330Nm. It is said to hit 100kmh in 7.1 seconds and packs a range of 404km.\nMeasuring 4,070mm long, 1,754mm wide and 1,514mm tall, the car is compact enough to deliver sharp handling, yet spacious enough to offer practicality. It is due to land here in the fourth quarter of 2024.\nBMW facelifts i4, 4-series Gran Coupe\nRefreshed versions of BMW’s i4 electric saloon and 4-series Gran Coupe are due here in the third quarter of 2024. The cars’ exterior and interior are given new design details, while headlights are revised, and buyers can opt to pay more for laser tail lights.\nBoth will have an infortainment system with QuickSelect, which is supposed to make accessing functions easier. Both models come with new colours and wheels. Interior trim elements and seat covers are also refreshed.\nElectric G-class with 432kW and 1,164Nm\nThe electric Mercedes-Benz G580 is powered by a 116kWh battery integrated into its ladder frame chassis and designed to deliver up to 473km of range. Mercedes says the battery is protected against the rough and tumble of off-road driving.\nThe car is powered by four individually controlled motors producing 432kW and 1,164Nm of torque. It has virtual differential locks via torque vectoring and an intelligent off-road crawl mode. The electric G-class is due here in the fourth quarter of 2024.\nLambo unleashes plug-in hybrid Urus\nLamborghini has unveiled a plug-in hybrid Urus, which is due here in April 2025. The performance sport utility vehicle (SUV) has 800hp of power and 950Nm of torque from 1,750rpm. Yet, the Audi-owned company says it produces 20 per cent less emissions than the Urus S.\nThe car sprints from 0 to 100kmh in 3.4 seconds (Urus S: 3.5 seconds) and from 0-200kmh in 11.2 seconds (Urus S: 12.5 seconds). It hits a top speed of 312kmh (Urus S: 305kmh). These figures make the SE the most powerful Urus ever and the fastest production car in the segment.\nElectric Range Rover with super-fast traction control system\nRange Rover has released preliminary information about its first electric model. The car is said to be equipped with an electric powertrain developed entirely in-house, and which is designed to cope with multiple terrain types.\nIt will have an advanced traction control system which, according to the carmaker, promises “exceptional levels of performance on icy or low-grip surfaces, reducing the torque reaction time at each wheel from around 100 milliseconds, to as little as one millisecond”.\nTesla Model 3 Performance lands", "url": "https://www.straitstimes.com/life/motoring/fast-lane-byd-top-selling-car-here-in-first-quarter-fastest-tesla-arrives-in-singapore"}