{"authors": ["Lee Siew Hua"], "date_download": "2024-10-12 13:56:46", "date_modify": "2024-10-12 13:56:46", "date_publish": "2023-03-20 12:00:00", "description": "Here are seven immersive experiences for travellers who can explore Hong Kong afresh. Read more at straitstimes.com.", "filename": "life_travel_hong-kong-reopens-new-and-shiny-nostalgic-and-timeless-the-city-is-back_1728741406.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/brightcove-thumbnails/mxW_irtR-J4jg6Lr0z4IQH53hRi5V7nvd906Te67aCQ.jpg?VersionId=eMxOVnj5k.YKey7gHY08d6n8_nwARh4M", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_travel_hong-kong-reopens-new-and-shiny-nostalgic-and-timeless-the-city-is-back_1728741406.html", "title": "Hong Kong reopens: New and shiny, nostalgic and timeless, the city is back", "title_page": "Hong Kong reopens: New and shiny, nostalgic and timeless, the city is back | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Check out lists of Top 10 vistas of the skyline and harbour, such as the Hong Kong Tourism Board’s compilation (str.sg/iZSs).\nTips\nTime your visit to The Peak at the golden hour, just before sunset. Stay on for the night illumination, when the skyline is at its most mesmerising.\nBook the Peak Tram Sky Pass (str.sg/iZSe) online. It includes a six-minute steep, scenic ride on an upgraded sixth-generation tram, plus entry to the observation deck Sky Terrace 428 for sky-high views.\nFor adults, a pass combining a return tram trip with Sky Terrace viewing access costs HK$148 (S$25).\nTry to go on a clear day. Check the weather on the Hong Kong Observatory website (str.sg/iZSn) or download its app.\n2. Arts and culture of global significance\nNew arts venues sprouted during the pandemic. These include the feted Hong Kong Palace Museum that displays Chinese culture through an interactive lens, and the M+ museum of global visual culture.\nIn a world first, a trove of 900 rare objects from Beijing’s Palace Museum are on long-term loan at the Hong Kong Palace Museum (str.sg/iZSh). Head for the standout gallery From Dawn To Dusk: Life In The Forbidden City (str.sg/iZS7).\nEnter a realm where Chinese New Year is celebrated with little imperial sons. Imagine an annual tea party in the Palace of Double Brilliance, where Emperor Qianlong composed poems with clever officials.\nI love the Dreamscape multimedia installation, inspired by the emperor’s poem Dream, which he wrote after the devastating loss of his wife, Empress Xiao Xian Chun. We recline on a cushioned platform, lost in time, as illusory images of the star-crossed royal lovers and lines of calligraphy are projected on the ceiling.\nM+ (str.sg/iZS8) is dedicated to contemporary visual culture which encompasses art, moving images, industrial design and more. The focus is on work made in and around Hong Kong, including Singapore.\nIt is a walk down memory lane in the blue-collar Yau Ma Tei district. The artisans here still produce Chinese weighing scales, chopping boards and preserved food – all the tools and tastes of traditional daily life.\nAt Liu Ma Kee (str.sg/iZSL), which specialises in fermented bean curd, I check out the range that includes plum-infused and spicy varieties, which will appeal to Singaporeans.\nThe no-frills shop has been at the same address since 1905. But it is on trend.\nI choose the creamy “carbonara” sauce (HK$50) that the owner’s wife, Madam May Tsui, 62, created for their spaghetti-loving son when he was little. It can be stir-fried with garlic for pasta and baked into cheesecake. “Spread it on bread with sugar,” she suggests.\nNearby, Mrs Ho, 75, manages Lee Wo Steelyard (345 Shanghai Street, Yau Ma Tei), which peddles hand-crafted Chinese weighing scales made of bone, wood and steel.\nHer wares go to restaurant kitchens, traditional Chinese medicine shops, goldsmiths and chic homes, she says from her hole-in-the-wall nook that spills haphazardly onto the pavement.\nI buy a punnet of fragrant strawberries (HK$50) produced by young Nara farmers in tones of white, pink and red.\nTips\nGlobally, people rediscovered cool enclaves at home during the pandemic. With three prolonged years of closed borders, Hong Kongers had comparatively more time to develop domestic tourism, and travellers should reap the new fruit.\nMy walking tour was customised by Walk in Hong Kong (walkin.hk), which focuses on the lesser-seen sides of Hong Kong. Its style is “fun, informative and celebratory of the city’s tales, past and present, in all their gritty, quirky glory”, according to its website.\nVarious operators also offer neighbourhood jaunts, such as a foodie excursion in Sham Shui Po (str.sg/iZSb). Or discover places on your own (str.sg/iZSE).\n4. Cheung Chau island: Rustic-hip respite\nBe like a Hong Konger. Hop onto a ferry to experience the unrushed island life here, which harmonises the trendy and the timeless.\nBakeries reminiscent of Old Hong Kong produce sweet and fluffy Lucky Buns. These steamed white rice-flour buns are stamped with the red Cantonese characters “ping on” (safety).\nThe Kwok Kam Kee Cake Shop (46 Pak She Street, Cheung Chau; www.kwokkamkee.com) sells the buns with a choice of sesame, lotus paste or red bean filling, among other classic baked goods.\nYou may encounter second-generation owner Martin Kwok, 41, who ditched his bright future at a financial institution to take over the family business.\nHis father was ready to close the cake shop for good, but his son had developed a deep connection to Cheung Chau where he grew up.\nThe younger Mr Kwok started to diversify the business, selling frozen dimsum and desserts to supermarkets. The Lucky Buns are also available on the website.\nHe notes that the rest of the island has been transforming as well, with hip cafes and boutiques springing up alongside curry-fishball stalls and Cantonese-style restaurants that serve inexpensive fresh-caught seafood.\nElsewhere on the island, there are rock carvings, clams to be picked on the beach, and the Cheung Po Tsai Cave that was likely the hiding place for a 19th-century pirate’s loot.\nMy sweetest moments are on the gentle 20-minute trek to a hilly high point at the North Lookout Pavilion. The metropolis feels distant when I am up here looking at the horizon, cooled by a perpetual breeze and soothed by a muted soundscape of waves.\nTips\nFerries depart for Cheung Chau island (str.sg/iZSa) from Central Pier No. 5, which is accessible from the MTR Hong Kong Station. The ferry ride is 35 to 60 minutes.\nLegend has it that the island was plague-infested a century ago and Lucky Buns were offered to appease the gods.\nThis evolved into the annual four-day Bun Carnival. The highlight is a bun tower, which brave souls climb and compete to snatch buns. The Bun Carnival (str.sg/iZSR) returns this year from April 16 to May 27 after the pandemic hiatus.\nPlan a day trip or book an overnight stay in Airbnb lodgings.\n5. A shopper’s world: From “retailtainment” to indie shops\nArchitecturally imaginative, the facade’s fluid lines echo its waterfront setting while its atrium looks somewhat galactic. Shop, dine, play and admire art in this sustainable complex that is also dotted with gardens and an urban farm.\nThe biggest mall of all is Harbour City (str.sg/iZSz), where nearly 300 shops have been busy opening or expanding during the pandemic. These include the Hermes and Ferragamo flagships, and mid-priced brands.\nHarbour City is a destination on its own with an observation deck, art gallery, three hotels and a cruise terminal under one roof. More than 90 restaurants have harbour views and special concepts.\nSince December, the mall has been rolling out tourist-exclusive gifts and privileges (str.sg/iZSK) to welcome visitors. These include a pouch with a Hong Kong map design and four felt pens. Present your passport at the information counter at level 2 to redeem the gifts.\nTips\nAlso explore around the malls, which are often set in buzzy prime zones. After visiting the Central Market, for instance, I relish my evening alone, stepping on and off the world’s longest outdoor escalator at the Mid-Levels into the lively streets below.\n6. Chinese culinary universe\nMost beguiling of all is the tea-smoked chicken. Each locally raised chicken weighs “2 catty and 12 taels”, according to the menu notes. The bird goes into Chef Saito Chau’s customised air-drying cabinet that replicates the weather of northern China, and is then smoked with osmanthus and oolong tea leaves.\nThere are also good-value Cantonese seafood joints, such as Hong Kee Restaurant (43 Pak She Street; tel: +852-2981-9916) on Cheung Chau island.\nWe order 14 dishes for the dozen diners at our table. Good eats include stir-fried clams with black bean sauce, steamed red snapper, and mantis shrimp simply fried with salt and pepper.\nOur lunch bill: HK$2,500, inclusive of several bottles of beer. The restaurant is frequented by locals, who say prices can be two or three times lower than at Sai Kung peninsula (str.sg/iZS9), another rustic spot known for its popular seafood restaurants, quaint fishing villages and hiking trails.\nTips\nIn most locales, there are Hong Kong desserts for supper or any time.\nLook for roast goose joints too. I pack boxes of Chinese sausages (lap cheong) from Ser Wong Fun restaurant to bring home, and also artisanal bars from Conspiracy Chocolate (str.sg/iZSC).\nLook out for trendy tea shops with a Hong Kong twist. The new Tea Moment (str.sg/iZSy) in Harbour City serves Hong Kong spherical egg waffles alongside hot and cold drinks, such as an energising concoction of baby chrysanthemum and wolfberry.\n7. Hong Kong Disneyland, happy again", "url": "https://www.straitstimes.com/life/travel/hong-kong-reopens-new-and-shiny-nostalgic-and-timeless-the-city-is-back"}