{"authors": ["Eunice Quek"], "date_download": "2024-10-12 14:04:29", "date_modify": "2024-10-12 14:04:29", "date_publish": "2024-06-19 15:40:00", "description": "The 41-year-old dessert queen is the first Singaporean to receive this honour. Read more at straitstimes.com.", "filename": "life_food_s-pore-s-janice-wong-wins-pastry-innovation-award-from-french-gastro-guide-la-liste_1728741869.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/19/CreditphotoMediatome-BF6I7658.jpg?VersionId=.loS_SGAaBeEscZ6cb8fz_EkTctROb2G&h=ada2b21a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_s-pore-s-janice-wong-wins-pastry-innovation-award-from-french-gastro-guide-la-liste_1728741869.html", "title": "Singapore’s Janice Wong wins Pastry Innovation Award from French gastro guide La Liste", "title_page": "Singapore’s Janice Wong wins Pastry Innovation Award from French gastro guide La Liste | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singapore’s dessert queen Janice Wong, known for her pastry perfection with artistic chocolate and cake creations, has received the Pastry Innovation Award from the prestigious French restaurant guide La Liste.\nNow in its second year, the La Liste Pastry Special Awards – held on June 17 in Paris, France – were given across 10 categories that recognised 25 pastry chefs and leaders from 14 countries.\nWong, who was in Paris for the ceremony, is the first Singaporean to receive the award, which was also given to Miami-based Puerto Rican pastry chef Antonio Bachour.\nWong – who runs 2am: dessertbar in Holland Village and an outlet in the W Sydney hotel in Australia, as well as the Janice Wong Pure Imagination brand of dessert shops here – tells The Straits Times via WhatsApp: “This recognition is a testament to the hard work and passion that my team and I put into crafting desserts and innovating confectioneries and edible art for the last decade.\n“I am grateful for the opportunity to continue pushing the boundaries of pastry innovation and to inspire fellow pastry chefs around the world.”\nThe 41-year-old chocolatier, who produces Singapore-grown chocolate in small batches, has plans to open another shop and kiosk at an undisclosed location here.\nHer win places her alongside French pastry giants including New York-based cronut creator Dominique Ansel, winner of the Pastry Game Changer Award; World’s Most Creative Pastry Chef recipient Bastien Blanc-Tailleur, known for his elaborate “haute couture” cakes; and Francois Perret for Ritz Paris Le Comptoir, lauded as the World’s Best Pastry Shop.\nOther Asian chefs who received accolades include South Korea’s Justin Lee of JL Dessert Bar and Hong Kong’s Joanna Yuen, founder of online dessert shop Otera. Both of them received the Pastry Talent of the Year Award.\nOther award categories highlighted the World’s Best Afternoon Tea, Pastry Ethical Sustainability and Pastry Discovery Gem.\nWong’s award follows that of another Singaporean chef – Damian D’Silva of Rempapa restaurant – receiving La Liste’s special award for Artisan & Authenticity in November 2023, as part of its annual Top 1000 Restaurants 2024 ranking.\nLike Wong, he was the first Singaporean to receive the award in that category.\nTwelve Singapore restaurants made it to the Top 1,000 Restaurants 2024 list – including Odette, Zen and Les Amis – the Republic’s three fine-dining establishments with three Michelin stars.\nLa Liste’s next ceremony for the Top 1,000 Restaurants and special awards for 2025 will take place in Paris on Nov 25.", "url": "https://www.straitstimes.com/life/food/s-pore-s-janice-wong-wins-pastry-innovation-award-from-french-gastro-guide-la-liste"}