{"authors": ["Eddino Abdul Hadi"], "date_download": "2024-10-12 13:58:09", "date_modify": "2024-10-12 13:58:09", "date_publish": "2024-05-14 12:30:00", "description": "He is one of 72 contestants out of 600 who made it through the Chinese reality show's auditions. Read more at straitstimes.com.", "filename": "life_entertainment_like-starting-from-zero-again-singapore-rapper-shigga-shay-takes-part-in-the-rap-of-china_1728741489.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/14/wgt-shiggashay-140524.jpg?VersionId=XcJmS1P1sGbjGAejVekNGCiiJJP3QfvK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_like-starting-from-zero-again-singapore-rapper-shigga-shay-takes-part-in-the-rap-of-china_1728741489.html", "title": "‘Like starting from zero again’: Singapore rapper Shigga Shay takes part in The Rap Of China", "title_page": "‘Like starting from zero again’: Singapore rapper Shigga Shay takes part in The Rap Of China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Home-grown rapper Shigga Shay is no stranger to big shows in Singapore, having done events such as National Day Parades.\nBut nothing compares with his current foray into the music industry in China. The 31-year-old is a contestant, the first from Singapore, in The Rap Of China 2024, the latest season of the popular Chinese reality show that looks for the country’s next rap star.\nHe is one of 72 contestants out of 600 who made it through the first round, and appeared in the second episode released on May 4 on online entertainment platform iQiyi.\nIn the 1½-minute clip, Shigga is seen rapping an a cappella verse in Mandarin and English in front of two judges: Taiwanese hip-hop artistes MC HotDog and Chang Chen-yue. Both judges praised his performance, highlighting the clarity of his delivery and lyrics, which were about his journey as a rapper.\nWhile the show also features Chinese rappers who are based outside China, Shigga says he is the only contestant this season who is a foreigner and does not hold a Chinese passport.\nThat appearance gained the rapper, whose real name is Pek Jin Shen, a new fan base. He uploaded the clip on his newly created account on Douyin, the Chinese version of TikTok, and it garnered more than a million views within a day.\n“It’s something I’m still trying to understand, it’s such a huge market,” he tells The Straits Times in a recent Zoom interview. “I’ve never been exposed to such a huge audience before. It’s like starting from zero again.”\nWhile the clip was brief, Shigga says because there were so many other hopefuls, he had to wait 28 hours for his turn to rap in front of the judges. “I had no sleep, and I was super tired. I don’t think I’ve done anything as tiring as this.”\nIt is not his first time on The Rap Of China, though.\nThe founder of music and events company Drink Entertainment appeared in the 2023 season as Taiwanese contestant E.so’s guest performer. The pair performed Boh Beh Zao, a track that they worked on together. Featuring verses in Hokkien about the pursuit of excellence, it was officially released as a single on May 8.\nThe producers of the show kept in touch with Shigga and invited him to return in 2024 as a contestant. He says he mulled over the offer for a while because it meant putting aside other commitments as long as he was a participant on the show.\n“Ultimately, I thought that it would be great because no Singaporean contestant has been on the show,” says the rapper, who was one of the home-grown artistes behind 2023 National Day Parade theme song Shine Your Light.\nFilming for The Rap Of China started in March and, since then, he has been shuttling regularly between Singapore and Chinese city Wuxi.\n“I miss my family a lot, I miss my friends, I miss chicken rice, nasi lemak and the kopi at the coffee shop,” says the bachelor. “But being on the show, I got to meet a lot of young rappers who are up-and-coming or hot right now. Communicating with them and being in a circle with them, I get to learn a lot and it’s very interesting.”\nHe adds that his Mandarin has improved since he started travelling to China.\n“Working with the producers and the artistes, filming a TV show, having to order my food in Mandarin, and doing everything in Mandarin... It helped me learn a lot faster.”\nHe is also working on a Mandarin album, which will feature collaborations with Chinese rappers and producers whom he has connected with in the past year. There is no scheduled release date yet.\nShigga is not allowed to reveal details of episodes that have not been aired. But he says he is not expecting to win The Rap Of China – being a contestant and getting through the first round is already a big win for him.\n“I’m really here to introduce myself to this new market and, at the same time, represent the country I come from. To me, how far I get doesn’t matter. The show is also part of the marketing and promotion of my Mandarin album.”", "url": "https://www.straitstimes.com/life/entertainment/like-starting-from-zero-again-singapore-rapper-shigga-shay-takes-part-in-the-rap-of-china"}