{"authors": ["Cherie Lok"], "date_download": "2024-10-12 14:03:59", "date_modify": "2024-10-12 14:03:59", "date_publish": "2024-02-22 12:00:00", "description": "Duomo Ristorante serves up fare from both northern and southern Italy. Read more at straitstimes.com.", "filename": "life_food_food-picks-new-italian-fare-at-chijmes-20-minute-omakase-dumplings-at-niu-hong-hong_1728741839.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/22/rrduomo2202.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_food-picks-new-italian-fare-at-chijmes-20-minute-omakase-dumplings-at-niu-hong-hong_1728741839.html", "title": "Food Picks: New Italian fare at Chijmes, 20-minute omakase, dumplings at Niu Hong Hong", "title_page": "Food Picks: New Italian fare at Chijmes, 20-minute omakase, dumplings at Niu Hong Hong | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "New Italian restaurant Duomo Ristorante at Chijmes\nIt is only fitting that a restaurant parked in the shadow of the magnificent Chijmes Hall should be named after the Italian term for church. And despite its Singaporean foundations, Duomo Ristorante is firmly buttressed by Italian culture.\nRun by a chef from the northern Italian region of Emilia-Romagna, it claims to offer an authentic experience of all the Mediterranean country has to offer, from the soulful flavours of the north to the refreshing dishes of the south.\nAnd yet, one of its most popular dishes is something that you will seldom find in Italy, if at all.\nThe Linguine al Granchio ($32) is, in fact, a uniquely Singaporean dish. Duomo Ristorante’s version is a beauty – slippery tendrils of linguine doused in a bright orange sauce the colour of crab roe and garnished with a sprinkling of chives.\nThe tomato-cream base – made with olive oil, tomatoes, mascarpone and chilli for that extra kick – is sweeter and lighter than other iterations of the dish, but no less satisfying. Morsels of crabmeat add a briny freshness.\nBecause Italian meals are a celebration of the wonders of carbs, I also order a pizza topped with sausage, burrata cheese, cherry tomatoes and Sicilian oregano ($36).\nIt is a white pizza, which means no tomato sauce on the base, but the meat is so juicy and flavourful that I do not find it dry at all. You may want to leave some room for the golden, springy crust too – it will come in handy when mopping up drippings from the meat.\nThe rest of the menu does not differ massively from what you might find at most Italian restaurants in Singapore. There is the usual fried seafood for starters ($28) – though the morsels of squid here are paper thin and rather dry – grilled lamb chops for mains ($46) and, of course, tiramisu for dessert ($16).\nWhere: 01-32 Chijmes, 30 Victoria Street\nMRT: City Hall\nOpen: Noon to 3pm (Tuesdays to Sundays), 6 to 11pm daily\nInfo: duomoristorante.com\nExpress omakase lunch\nIf you have only 20 minutes for lunch, yet crave the thrill of a curated omakase meal, Sushi To Sumi has just the fix for you.\nThe newly opened Japanese restaurant in Cecil Street is the first standing omakase bar in Singapore and has three menus each for lunch and dinner, ranging from $30 to $120. The lowest-priced of these is the Ume set ($30), which comes with eight pieces of sushi, a grilled dish and miso soup.\nSpace is sparse – so sparse, in fact, that there is no room for even a single chair. An L-shaped counter bisects the room, with diners on one side and chefs on the other.\nThe meal kicks off with cured mackerel sushi, wrapped in a blanket of seaweed and vinegared rice. It is a complex bite: sour and salty, with a hint of umami richness. I return to milder, more familiar territory with the next sushi: salmon from Miyazaki, gently brushed with soya sauce.\nA plate of grilled squid marks a short break from the procession of raw fish, but not for long. The chef is soon back with a small bouquet of marinated tobiko pearls, stained a deep bronze orange.\nThe final piece of sushi – a sweet, creamy raw shrimp – arrives with a concentrated shot of miso soup. I devour both with the slight regret of a diner who is not yet full.\nThe courses come fast and furious. As soon as one sushi is wolfed down, another appears like clockwork on the counter in front of me. I polish off the meal in less than 20 minutes.\nWith nothing left to do but glance around awkwardly at my fellow diners, I sense that I am not welcome to linger. I grab my bag, pay up and leave to fill my stomach elsewhere.\nWhere: 02-01 Plus, 20 Cecil Street\nMRT: Telok Ayer/Raffles Place\nOpen: 11am to 2pm, 5 to 9pm (Mondays to Fridays)\nInfo: www.sushitosumi.com\nDumpling delight in Toa Payoh\nI constantly crave a good plate of fried dumplings. As long as they are golden, crisp and juicy, there is always room in my stomach for them.\nAnd Niu Hong Hong, a new stall in Food Alley at Toa Payoh Central, knows just how to deliver. Its pot stickers ($7.80 for a plate of five, though mine comes with six) are long tubular things, unsealed at both ends.\nBut do not fret – this does not mean that the juices come rushing out. Somehow, they sit obediently encased within the wrappers.\nThe result is that you get to enjoy the best of both worlds – the crunch of the skirt and the succulent burst of flavour from the ground pork filling.\nStill not full? There are a handful of noodle dishes to pick from.\nI try the beef noodles ($8.80 for regular, $10.80 for large) and the noodles with soya bean paste, otherwise known as zhajiangmian ($7.80). Both come with hand-pulled noodles – made live at a booth near the cashier.\nThe extra effort pays off – the noodles are springy, with just the right amount of bounce and bite to them. The salt level in both the beef broth and soya bean paste could stand to be taken down a peg, though.\nSkip the Chinese Hamburger ($5.50) – ground pork and celery bits in a doughy, unevenly seasoned bun – and go straight to dessert. Or rather, the only sweet item on the menu – glutinous rice cake with brown sugar ($7.80 for six pieces). It is another winning combination of crispy and chewy, piped full with a viscous, subtly sweet syrup.\nService is brisk and so is the meal. You order, you eat, you leave. This is not the place for frills and it does not need to be – sometimes all you want is to grab a quick, tasty bite while moving between locations.\nWhere: 01-530 Food Alley, 190 Lorong 6 Toa Payoh\nMRT: Toa Payoh\nOpen: 10.30am to 9.30pm daily\nTel: 8943-4335", "url": "https://www.straitstimes.com/life/food/food-picks-new-italian-fare-at-chijmes-20-minute-omakase-dumplings-at-niu-hong-hong"}