{"authors": [], "date_download": "2024-10-12 13:33:10", "date_modify": "2024-10-12 13:33:10", "date_publish": "2022-02-04 11:00:00", "description": "CAMBRIDGE (Britain) - Fires in electric vehicles (EVs) certainly gain a lot of media attention in comparison with their internal combustion engine (ICE) counterparts. Read more at straitstimes.com.", "filename": "life_motoring_electric-vehicle-fires-less-common-but-still-problematic_1728739990.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/02/03/mi_electriccar_030222.jpg?VersionId=AKCaqC8xyV5VtYIfQgMI1umDtAtajW2D", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_electric-vehicle-fires-less-common-but-still-problematic_1728739990.html", "title": "Electric vehicle fires less common but still problematic", "title_page": "Electric vehicle fires less common but still problematic | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CAMBRIDGE (Britain) - Fires in electric vehicles (EVs) certainly gain a lot of media attention in comparison with their internal combustion engine (ICE) counterparts.\nBut a crucial question for the future of mobility is whether EVs are any more likely to catch fire than an ICE vehicle, according to business consultancy IDTechEx.\nThere is always a risk of lithium-ion batteries entering thermal runaway - when heat generated within a battery exceeds the amount of heat that is dissipated. But the key questions remain - how likely is a fire, how problematic is an EV fire and what is being done to prevent or limit them in the future?\nOne of the highest-profile incidents was the recall of General Motors' Bolt in 2020 and 2021, the cost of which has now added up to US$1.9 billion (S$2.5 billion), owing to two distinct manufacturing defects in the cells provided by South Korean battery manufacturer LG Chem.\nGM was not the only automaker with issues. Hyundai Motor has made similar recalls costing an estimated US$900 million and Ford is facing a US$400 million recall on its Kuga plug-in hybrid.\nAs to how common EV fires are, there have been several studies on the topic. Tesla released data suggesting one fire for every 328 million kilometres travelled - which is more than 10 times less common than the national average in the United States.\nTesla, of course, could have a bias here, but other sources are suggesting a similar result. The Phosphorus, Inorganic and Nitrogen Flame Retardants Association suggested about 55 fires per 1.6 billion kilometres in ICE cars, compared with five fires for EVs for the same distance.\nA recent study conducted by AutoInsuranceEZ using data from the US National Transportation Safety Board showed that electric cars in the US caught fire at a rate of 25.1 per 100,000 sales, versus 1,530 for ICE vehicles and 3,475 for hybrids.\nWhile the occurrence is lower for EVs, when one does catch fire, the consequences can be extremely problematic, the consultancy notes.\nThe mixture of chemicals in the battery can prove extremely volatile and difficult to extinguish. Several EV fires have destroyed garages and neighbouring vehicles and fire departments have had to be educated on how to deal with EVs specifically.\nEV fires can continue to reignite for days after initially being extinguished. It does not help that the occurrence of EV fires can be unpredictable, with research conducted by IDTechEx suggesting that a third of EV fires occur when the vehicle is stationary, parked and not charging.\nIn EVs, the batteries can enter thermal runaway thanks to a number of causes, including improper thermal management, manufacturing defects, overcharging or vehicle crashes.\nWhen a cell enters thermal runaway, it releases volatile gases and increases in temperature significantly and quickly.\nOnce one cell has entered thermal runaway, it can be difficult to stop that propagating to other cells. This is where material advancements and proper thermal management come into play.", "url": "https://www.straitstimes.com/life/motoring/electric-vehicle-fires-less-common-but-still-problematic"}