{"authors": ["Chantal Sajan"], "date_download": "2024-10-12 13:32:31", "date_modify": "2024-10-12 13:32:31", "date_publish": "2023-10-27 12:30:00", "description": "This regular column tracks the latest developments in architecture and design. Read more at straitstimes.com.", "filename": "life_home-design_design-news-ikea-lights-up-with-deepavali-line-up-star-living-unveils-new-furniture-hq_1728739951.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/27/Star202_2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_home-design_design-news-ikea-lights-up-with-deepavali-line-up-star-living-unveils-new-furniture-hq_1728739951.html", "title": "Design News: Ikea lights up with Deepavali line-up; Star Living unveils new furniture HQ", "title_page": "Design News: Ikea lights up with Deepavali line-up; Star Living unveils new furniture HQ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Star Living unveils regional HQ\nHome-grown furniture brand Star Living moved into its new seven-storey regional headquarters in Sungei Kadut on Tuesday.\nIt houses the company’s corporate office, fully automated warehouse and five furniture showrooms.\nThe facade features folded sheets of metal panels with contrasting hues. The space at the promenade is enhanced by landscaping and animal figurines, while an undulating ceiling connects the main entrance and the interior spaces.\nThe zones between the outdoor and indoor public spaces are visually connected by a pedestrian walkway, cycling paths and biophilic accents such as landscaping.\nThe 19,050 sq m facility in Sungei Kadut is the company’s most advanced furniture warehouse, incorporating Internet of Things (IoT) technologies such as driverless vehicles and mobile shuttles that dispense with manual labour.\nIoT refers to a network that allows communication between devices that are connected to it.\nStar International, the operator of Star Living brand, started in 1981 and is an integrated designer, retailer, manufacturer and exporter of household furniture.\nIt operates 17 retail showrooms across Taiwan, China, Malaysia and Singapore, showcasing brands such as Aartical, JotterGoods and Mondi Lifestyle. It also exports furniture to more than 30 countries.\nInfo: Star Living celebrates the launch of its new headquarters with a promotion till Nov 5, with a special carnival on Saturday and Sunday that includes storewide discounts of up to 10 per cent plus gifts with purchase. The megastore is at 21 Sungei Kadut Street 2. Go to starliving.com.sg\nIkea’s Aromatisk range\nIkea fetes light, love and laughter with its latest Aromatisk range for Deepavali, the Indian Festival of Lights, which falls on Nov 12 in 2023.\nThe Swedish furniture giant’s designers for the 2023 festive collection, Ms Hanna Grann Dalrot and Ms Luna Gil, looked at what makes the festive season distinctive – its textures, colours and scents – and tried to capture these in the new range, which includes acrylic-coated aluminium and glass tealight holders, as well as tableware, lanterns and fabrics.\n“I was inspired by the close connection in materials, techniques and colours that exists between Scandinavia and India,” says Ms Dalrot. “As a designer, it was really exciting to discover that our handicraft traditions have so much in common.”\nMs Gil, who created the textiles for the collection, looked at traditional designs in the Swedish Allmoge style and Indian murals, which both feature ornaments that look like paisley, a teardrop-shaped motif.\nDeepavali flavours are also a big part of the festivities. From Wednesday to Nov 12, Ikea Family members get offers on festive food items such as murukku campur (mixed snacks), keropok campuran (mixed crackers) and kacang campur (mixed nuts) at the Ikea Swedish Food Market.\nInfo: Prices start at $7.50 for an Aromatisk Hand Towel to $49.90 for a pair of curtains. For updates on events and promotions, go to ikea.com.sg\nLuxury bath experience Grohe Spa launches on Nov 28\nThe latest in German designs for bathrooms will be launching in Singapore on Nov 28.\nGrohe, a global brand for bathroom solutions and kitchen fittings, will be unveiling its sub-brand, Grohe Spa – a range of luxury fittings such as taps, sinks and bathtubs designed to transform ordinary washrooms into spa sanctuaries.\nThe designs, which are inspired by the Latin phrase “Salus per aquam” or “Health through water”, are aimed at architects, designers and home owners.\nThe spa range debuted at Milan Design Week and has picked up global accolades such as the iF Design Award and the Red Dot Award.\nIts Grohe Spa Atrio Private Collection of sinks and tap fittings features a wide range of lever options, Caesarstone-designed quartz inserts and colours for bespoke bathroom interiors.\nThe Rainshower Aqua Ceiling Shower is a centrepiece for the shower area. The modular shower unit can be placed horizontally, vertically or at a right angle, tailored to room conditions and the user’s preference. Its different spray patterns can be combined to create a soothing daily ritual.\nInfo: Prices are customised to the requirements of each Grohe Spa solution and are available upon request. Visit the showroom at Grohe Gallery, 24 Mohamed Sultan Road, or the soon-to-be-opened Lixil Experience Centre at 381 Joo Chiat Road, or go to grohespa.com", "url": "https://www.straitstimes.com/life/home-design/design-news-ikea-lights-up-with-deepavali-line-up-star-living-unveils-new-furniture-hq"}