{"authors": ["Rebecca Lynne Tan"], "date_download": "2024-10-12 14:21:29", "date_modify": "2024-10-12 14:21:29", "date_publish": "2017-05-28 05:05:05", "description": "(SINGAPORE)  - Nasi ulam is a traditional Peranakan herb rice salad that is usually served at special occasions including birthdays and Chinese New Year. The most important thing when it comes to making nasi ulam, says executive sous chef Shirley Tay of The Peranakan at Claymore Connect, is to make sure the rice is cool when tossing the salad. Read more at straitstimes.com.", "filename": "lifestyle_food_a-recipe-for-nasi-ulam-a-peranakan-herb-rice-salad_1728742889.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2017/05/26/nasi_ulam_final_product.png?VersionId=eAwN1MeQG9z78q9SEGV23za3aNZYZi5C", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/lifestyle_food_a-recipe-for-nasi-ulam-a-peranakan-herb-rice-salad_1728742889.html", "title": "A recipe for nasi ulam, a Malay herb rice salad", "title_page": "A recipe for nasi ulam, a Malay herb rice salad | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "(SINGAPORE) - Nasi ulam is a traditional Malay herb rice salad and in Peranakan culture, it is usually served at special occasions including birthdays and Chinese New Year.\nThe most important thing when it comes to making Peranakan-style nasi ulam, says executive sous chef Shirley Tay of The Peranakan, a Peranakan restaurant at Claymore Connect, is to make sure the rice is cool when tossing the salad.\nHot or warm rice will cook the herbs and make the dish bitter, she says.\nSome recipes call for the addition of grago or baby krill and chopped prawns, while others include herbs such as betel leaves. Personalise the dish by adjusting the proportion of each herb to taste.\n1. Cook the rice with the pandan leaves. Discard the leaves once the rice is cooked and leave the rice to cool until it is room temperature.\n2. While the rice is cooking, heat some oil in a wok, and deep-fry the ikan selar. Drain, remove the skin, debone and and flake the fish carefully. Set aside.\n3. Fry the salted dish, and chop finely. Set aside.\n4. In a dry pan, toast the grated coconut over low heat until it turns golden brown. Stir continuously so as not to burn the coconut. Set aisde.\n5. Prepare the sambal tumis. Place all the ingredients for the sambal tumis into a food processor and blitz until smooth. Heat about 3 to 4 Tbs of oil in wok over medium heat and fry the sambal tumis until it is fragrant and the oil begins to seep out. This will take about 20 minutes. Add more sugar and salt to taste. Set aside. The sambal tumis can also be made a day or two in advance, and stored in the refrigerator.\n6. Prepare the herbs. Julienne the turmeric leaves. Set aside\n7. Chop the lemongrass finely. Set aside.\n8. Remove the centre vein from the kaffir lime leaves. Julienne and set aside.\n12. To serve: In a large mixing bowl, add the cool cooked rice, followed by 3Tbs of sambal tumis (adjust to taste). Mix well. Add the chopped salted fish, flaked ikan selar, and all the other herbs and vegetables, and mix well. Adjust to taste.", "url": "https://www.straitstimes.com/lifestyle/food/a-recipe-for-nasi-ulam-a-peranakan-herb-rice-salad"}