{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:55:24", "date_modify": "2024-10-12 13:55:24", "date_publish": "2024-07-11 18:00:00", "description": "Returning from July 11 to 14, Singapore International Jewelry Expo will feature over $337 million worth of bling. Read more at straitstimes.com.", "filename": "life_style_sparkling-spectacle-10002-carat-sapphire-valued-at-4m-takes-centre-stage-at-sije-2024_1728741324.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/11/yusijecoll1107b.jpg?VersionId=ueIqHZhjNI4zPRy1n8Y9QVMBCThY9e2D", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_sparkling-spectacle-10002-carat-sapphire-valued-at-4m-takes-centre-stage-at-sije-2024_1728741324.html", "title": "Sparkling spectacle: 100.02-carat sapphire valued at $4m takes centre stage at SIJE 2024", "title_page": "Sparkling spectacle: 100.02-carat sapphire valued at $4m takes centre stage at SIJE 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The 2024 Singapore International Jewelry Expo (SIJE) is set to shine even brighter with the world-first appearance of a 100.02-carat natural royal blue sapphire by local jeweller Vihari Jewels, valued at US$3 million (S$4.04 million).\nCut and polished from a rough sapphire crystal of over 900 carats, it has been classified by international gemological research laboratory GRS GemResearch Swisslab AG as “One Magnificent Gemstone” in its authentication report.\nThere are only about five of its kind on sale in the world.\nSaid to be the exhibition’s most expensive piece, the sapphire’s journey to Singapore was a high-stakes operation, involving multiple armed guards appointed by luxury goods shipping service Malca-Amit to ensure its safe passage here.\nMs Vihari Poddar, founder of Vihari Jewels, is excited to show Singaporeans the magnitude and brilliance of this extraordinary gemstone. Mined in Sri Lanka and cut in Bangkok, its vivid cerulean hue dazzles when seen with the naked eye. Following purchase, the buyer can select the setting that will showcase it best.\nSingapore’s largest and longest-running jewellery show in the Asean region, now in its 19th edition, opens on July 11 at Marina Bay Sands and runs till July 14.\nSIJE 2024 will feature more than US$250 million worth of local and international bling from more than 335 brands representing over 30 countries, including 57 local exhibitors.\nMrs Ilaria Cicero, chief executive of trade show organiser IEG Asia and organiser of SIJE 2024, says: “The show has come a long way. SIJE has earned an international reputation as a platform for some of the world’s most important jewellery pieces to debut and be sold to collectors and buyers from around the world.\n“It also serves as an important platform for countries looking to expand their reach to regional and international markets.”\nThe Italian Pavilion takes the spotlight in 2024, with 14 master jewellers who will showcase their latest collections. This significant presence underscores Italy’s commitment to establishing a strong foothold in the regional jewellery market and highlights Singapore’s pivotal role as a leading hub in the Asean region.\nAttendees will be able to marvel at a 1960s vanity set that once belonged to the late Italian screen icon Gina Lollobrigida. This stunning set, comprising an 18-karat gold purse, a compact powder case and a lipstick holder, was crafted by Italian luxury brand Bvlgari. The actress-model’s jeweller, Lolli Gioiellieri, will be showcasing this collection at the Oro D’Italia booth, alongside other renowned Italian brands. Its price will be disclosed upon request.\nAccording to Mr Ho Nai Chuen, president of Singapore Jewellers Association, the country’s jewellery market has experienced significant growth in recent years, driven by increasing demand for high-quality, intricately designed pieces.\nHe says: “Today’s consumers prioritise jewellery that not only showcases exceptional craftsmanship, but also features unique designs and premium materials. There is a notable trend towards blending traditional artistry with contemporary aesthetics, appealing to a diverse customer base that values both heritage and innovation.”\nCustomised jewellery, he notes, has become increasingly popular, allowing customers to express their individuality through bespoke designs. “This shift is accompanied by a rising preference for sustainable and ethically sourced materials, reflecting global movements towards responsible consumption,” he adds.\nBut it is not just high-end baubles that attendees can look forward to.\nThe most affordable piece at SIJE 2024 is a New Yorker Freshwater Rice Pearl Necklace priced at $88 by home-grown pearl jewellery brand Pearly Lustre, featuring freshwater pearls that measure 4 to 5mm.\nMeanwhile, making its debut in Singapore is Hong Kong manufacturer RNP Jewelry Design with an edgy 18-karat white gold ear cuff embellished with two diamonds totalling 0.12 carats. It is priced at US$194 (before GST).\nOther items, like Simone Jewels’ The Flow Ring and Foundation Jewellers’ Nyonya Flower Motif Pendant, are going for a discount as well.\nA January report by London-based market research and consumer insight company Euromonitor International indicates that jewellery sales are expected to increase in both retail volume and value despite inflationary pressures and tax hikes.\nSharing a March market report by Statista, a global data and business intelligence platform, Mr Ho highlights that Singapore’s jewellery market is poised for significant evolution in the coming years – potentially generating a revenue of US$1.31 billion in 2024, with per-person revenue estimated at US$216.90.\nIt also projects an annual growth rate of 1.68 per cent starting from 2024.\n“As consumer preferences and shopping behaviours continue to evolve, the jewellery market in Singapore is set to adapt and innovate, emphasising sustainability, digitalisation and luxury appeal in equal measure,” he says.\nBook it/Singapore International Jewelry Expo 2024\nWhere: Sands Expo & Convention Centre, Halls A & B, Level 1, Marina Bay Sands Singapore, 10 Bayfront Avenue\nWhen: July 11 to 13, 11.30am to 8.30pm; July 14, 11.30am to 7.30pm\nAdmission: Free\nInfo: sije.com.sg\nGlitter and glam\nKeep your eyes peeled for these 10 stunning treasures at SIJE 2024.\nDong Long Ju’s Art Jewelry ($41,000)", "url": "https://www.straitstimes.com/life/style/sparkling-spectacle-10002-carat-sapphire-valued-at-4m-takes-centre-stage-at-sije-2024"}