{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:20:00", "date_modify": "2024-10-12 14:20:00", "date_publish": "2022-10-28 17:30:00", "description": "Single-motor electric SUV not as quick as its dual-motor stablemate, but makes up for that by being more efficient and more comfortable. Read more at straitstimes.com.", "filename": "life_motoring_car-review-volvo-xc40-recharge-p6-s-strength-is-its-relative-weakness_1728742800.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/28/20221021105569429e03e1493-390f-422d-af57-d81a5db3a114_1.jpg?VersionId=j3OnWsEGaxZpY66UkrjXvdds_Zlghgrj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_car-review-volvo-xc40-recharge-p6-s-strength-is-its-relative-weakness_1728742800.html", "title": "Car review: Volvo XC40 Recharge P6’s strength is its relative weakness", "title_page": "Car review: Volvo XC40 Recharge P6’s strength is its relative weakness | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The conflicting values seen in combustion engine cars continue in electric cars.\nIf you want performance, you have to sacrifice some comfort. If you want practicality, you often have to sacrifice style. And if you want driving fun, you have to sacrifice some efficiency.\nThe Volvo XC40 Recharge is a good example of this. The compact electric sport utility vehicle (SUV) was introduced early this year as a twin-motor 300kW powerhouse capable of a sizzling 4.9-second century sprint.\nIt was, at the time of its launch in January, the quickest battery-powered SUV after the significantly costlier Jaguar I-Pace.\nBut it had a rocky ride, and it did not qualify for the top-tier green rebate.\nEnter the XC40 Recharge P6, a single-motor 172kW car which does 0-100kmh in a saner 7.4 seconds. It has a more pliant ride contributed by smaller wheels (19-inchers instead of 20-inchers), and it qualifies for the top-tier green rebate.\nHaving one motor instead of two, and a smaller battery (69kWh vs 78kWh) also results in a weight reduction of 158kg, which translates into better efficiency and superior ride quality.\nThe P6 makes do with a simpler reverse camera system, and simpler headlights. Of course, it is always nice to have a 360-degree camera and active bending headlamps, but these are not strictly necessary.\nTogether with the difference in battery size and motor configuration, they make the car less costly.\nBefore factoring the difference in certificate of entitlement prices and green rebate amount, the P6 costs around $15,000 less than its dual-motor sibling.\nBut after these are taken into account, the car is $4,000 cheaper at $239,000 – a relatively palatable price level for anyone looking to buy a premium electric car.\nSo, what are the sacrifices?\nWell, it is clear that the P6 is nowhere as punchy or powerful as the dual-motor XC40 Recharge on paper. But at the wheel, the difference is not as stark. In fact, with 330Nm of instant torque going only to the front axle, the P6 can be a little scary if you floor the throttle.\nAnd even though its 7.4-second 0-100kmh timing is mediocre in the world of electric vehicles, the car is quicker across a wider speed range than most combustion engine models clocking a similar century sprint. In other words, you never feel you are in need of more power at the helm. Unless you are next to a Tesla.\nThe P6 does not have a Harman Kardon hi-fi like its more illustrious stablemate, but its sound system should still be satisfactory to all but the keenest audiophiles.\nIn terms of space, practicality and drivability, there is no difference. The car is roomy, versatile and generally friendly to use. The cabin architecture is identical, down to niggles such as a curvature in the driver footwell and its all-or-nothing brake regeneration.\nIt remains a handsome car like the dual-motor variant, with its grille-less front giving the XC40 a fresh and modern look. Its leather-free upholstery and backlit topography inlays are also nice touches.\nThe test car averages 20.1kWh/100km, which is very close to Volvo’s declared efficiency of 20kWh/100km and slightly better than the dual-motor’s real-life consumption of 25.1kWh/100km. Based on 20.1kWh/100km, the P6 is good for a range of 343km on a full battery, which is plenty in Singapore and good enough for an anxiety-free road trip to Malacca.", "url": "https://www.straitstimes.com/life/motoring/car-review-volvo-xc40-recharge-p6-s-strength-is-its-relative-weakness"}