{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:18:30", "date_modify": "2024-10-12 14:18:30", "date_publish": "2024-01-05 15:00:00", "description": "As in the past two years, electric models will figure large, spearheaded by Chinese brands. Read more at straitstimes.com.", "filename": "life_motoring_what-to-look-out-for-in-2024-more-coes-more-evs-more-chinese-car-brands_1728742710.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/05/Mercedes-AMG20GT6320CoupC3A9.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_what-to-look-out-for-in-2024-more-coes-more-evs-more-chinese-car-brands_1728742710.html", "title": "What to look out for in 2024: More COEs, more EVs, more Chinese car brands", "title_page": "What to look out for in 2024: More COEs, more EVs, more Chinese car brands | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The new year looks promising for those looking to buy a new car. More certificates of entitlement (COEs) will be available, fuelled by the cyclical upturn in supply as well as the Government’s commitment to bring forth more COEs from the peak supply years of 2026 to 2027.\nThe revised Vehicular Emissions Scheme will kick in, resulting in stricter emission standards and less generous rebates for “greener” cars. This is likely to raise the prices of many popular models by $10,000 or more, which is not all bad.\nFirst, motor dealers selling such cars will have less margin to secure COEs with, resulting in another price dampener. Second, the attraction of full electric models will grow, as these will continue to qualify for the biggest, albeit somewhat diminished, tax rebates.\nA widely expected global economic downturn will be felt here, which again should keep exuberant demand for COEs in check.\nFleet owners – which have been a major driver of stratospheric COE prices in 2022 and 2023 – will remain the dark horse in 2024.\nWill regulations be introduced to crimp their unhindered and aggressive decade-long expansion? Will their financiers adopt a more cautious approach on the back of economic headwinds?\nWhen COE prices head south, many of these companies will be holding on to substantially devalued cars, and so they may buy more cars to average downwards as well as to prop up COE prices. How they eventually behave will depend on answers to the first two questions.\nOn the flip side, softening COE prices may lead to more car owners extending the lifespan of their vehicles.\nThe opportunity cost of doing so is less punitive for those who had bought cars with tax rebates because their cars will qualify for far smaller scrap rebates when their COEs expire.\nCOE supply will shrink in tandem with the rise in COE revalidations (extensions).\nBut there are two reasons why revalidations are unlikely to reach their previous peak between 2015 and 2020.\nOne, there are significantly more high-mileage cars today, owing to an enormous fleet of for-hire cars (namely private-hire and car-share vehicles).\nSuch cars – which clock some three times the mileage of an average family car – are too worn to go for another 10 years without a major (and costly) overhaul.\nTwo, cars have become significantly more complex and, hence, foreseeably less robust, than 20 years ago. Such vehicles are expected to be more prone to costly repairs if they were to continue plying beyond 10 years.\nThe new E-class will no doubt find a loyal following among businessmen and middle-management executives. As usual, a plug-in hybrid will be among the line-up, which should arrive in the first half of 2024.\nOn the opposite end of the spectrum is the Mercedes-AMG GT 63 Coupe, which is slated to land in the second half of the year. The sports model is powered by a 4-litre bi-turbo V8 engine producing 577hp and 800Nm of torque, allowing it to sprint to 100kmh in 3.2 seconds and on to a top speed of 312kmh.\nAnd towards the end of 2024, the highly anticipated EQG – an electric version of the iconic G-wagen – should debut. It is said to offer up to 640km of range, and have motors at both axles to power the car through rough terrain.\nIn all, more than 10 new models and facelifts will be unveiled.", "url": "https://www.straitstimes.com/life/motoring/what-to-look-out-for-in-2024-more-coes-more-evs-more-chinese-car-brands"}