{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:56:15", "date_modify": "2024-10-12 13:56:15", "date_publish": "2023-07-06 13:00:00", "description": "My Perfect Weekend with influencer and entrepreneur Francesca Tan. Read more at straitstimes.com.", "filename": "life_style_my-perfect-weekend-with-influencer-and-entrepreneur-francesca-tan_1728741375.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/06/220-20Francesca20Tan2C20Founder20of20Kyssva_0.JPG?VersionId=8q9goj.GbI61n.hbwEkBsKCSutSpYxoQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_my-perfect-weekend-with-influencer-and-entrepreneur-francesca-tan_1728741375.html", "title": "My Perfect Weekend with influencer and entrepreneur Francesca Tan", "title_page": "My Perfect Weekend with influencer and entrepreneur Francesca Tan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Who: Ms Francesca Tan, 31, is a content creator, realtor and entrepreneur. In 2022, she co-founded Kyssva, a skincare brand that specialises in microbiome-friendly products.\n“I usually start my day with a cup of my favourite tea from Grand Oak TCM Clinic in East Coast that I frequent. It is said to have calming effects. I’m easily distracted and I have a lot of things to do, so the tea helps me to calm down and focus better.\nI usually work during the weekends too, so I always look forward to meeting my friends for dinner to unwind and catch up over good food and drinks.\nI am a huge foodie and I love checking out new restaurants. The most recent one I have been to is Marcy’s, a modern seafood restaurant in Duxton. The ambience is perfect for date nights or a girly night out. I really enjoy its crab toast.\nI like to go bar-hopping with my friends too. We enjoy trying different cocktails, but my favourite is still whisky sour. Some of my favourite bars are Jigger & Pony at Amara Hotel, Barood in Tras Street and Rebel Rebel in Bukit Pasoh.\nFor local delights, my favourites are Swee Guan Hokkien Mee in Lorong 29 Geylang, Mei Wei Boneless Chicken at Katong Shopping Centre and Lao San Kway Chap in Ang Mo Kio. Restaurant-wise, La Bottega Enoteca in Joo Chiat Road, Nae:um in Telok Ayer Street and Esquina in Jiak Chuan Road are some that I really enjoy.\nI enjoy going for spin, pilates reformer and barre classes. I find a sense of peace and clarity every time I am in class.\nI also enjoy watching shows on Netflix while digging into a tub of chocolate ice cream. It is my guilty pleasure. The series I’m watching now is Taxi Driver (2021 to present), a South Korean crime thriller.\nI do most of my shopping online now because it is convenient, but I enjoy strolling around Orchard Road and Marina Bay Sands sometimes. I recently stumbled upon Yang Gallery at Voco Orchard Singapore. It has plenty of art pieces and sculptures that are quirky.\nI am working on Kyssva. Apart from marketing our first product, the Aglow Dewy mask, we are also working and testing out new products.\nFor a quick getaway, I love the W hotel in Sentosa Cove. I love how it does not feel like Singapore when I am there. It is a respite from the hustle and bustle.”", "url": "https://www.straitstimes.com/life/style/my-perfect-weekend-with-influencer-and-entrepreneur-francesca-tan"}