{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:55:23", "date_modify": "2024-10-12 13:55:23", "date_publish": "2024-07-04 15:00:00", "description": "The Jo by Jo Loves Hotel Collection is available in almost 900 premier rooms and family suites at The Sands Collection. Read more at straitstimes.com.", "filename": "life_style_scent-sational-second-act-mbs-tie-up-another-notch-in-perfumer-jo-malone-s-post-cancer-comeback_1728741323.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/04/Renowned20perfumer20Jo20Malone20CBE20did20a20fragrance20demonstration20at20Marina20Bay20Sands2C20to20celebrate20the20launch20of20Jo20Loves20at20the20hotel.jpg?VersionId=yRV5ZpAYAtNC7wklTImOfOj.Pakps8Gq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_scent-sational-second-act-mbs-tie-up-another-notch-in-perfumer-jo-malone-s-post-cancer-comeback_1728741323.html", "title": "Scent-sational second act: MBS tie-up another notch in perfumer Jo Malone’s post-cancer comeback", "title_page": "Scent-sational second act: MBS tie-up another notch in perfumer Jo Malone’s post-cancer comeback | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Jo Malone stands at the in-suite bar in Marina Bay Sands hotel, shaking up a cocktail crafted not from tequila or gin, but her Jo by Jo Loves fragrance.\nOnce done, she hands over the glass, its clear liquid bubbling with enticing scents.\n“Here. Please don’t taste, just smell,” cautions the 60-year-old British perfumer, as the rest of the room bursts into laughter.\nThis writer never imagined we would be treated to an impromptu Fragrance Tapas Experience, much less by the icon herself, who has been hailed as a scent maverick after founding her eponymous fragrance brand Jo Malone London in 1990 and, more recently, Jo Loves in 2011.\nInspired by Spanish tapas bars, this olfactory experience – now available for free at many Jo Loves boutiques worldwide – has become synonymous with fun and flair, transforming the typically mundane fragrance experience into a theatrical performance.\nImagine fragrance tagines where colognes are warmed in North African earthenware pots, releasing aromatic clouds for you to savour, and spoonfuls of non-edible foams to paint onto your body with brushes. Visitors are encouraged to sniff rather than taste, because nothing is edible.\n“What I’m doing is creating a circus around everything I’m doing, so you can never forget the first time you smell Jo by Jo Loves,” says Malone.\nThis one-off Fragrance Tapas Experience at MBS held in mid-May marked the debut of Jo Loves in Singapore. The Jo by Jo Loves Hotel Collection, which is available in nearly 900 out of 1,850 newly renovated premier rooms and family suites at The Sands Collection, features fragranced bath and body care amenities.\nMBS is the first destination in Singapore to carry the Jo by Jo Loves range, which includes shampoo, conditioner, bath and shower gel, body lotion and bar soap. Expect ingredients such as grapefruit, orange, lime and spearmint, softened by hedione and black pepper and intertwined with guaiac wood, vetiver and cedar wood.\nThe introduction of new brands, products and experiences is part of the integrated resort’s ongoing transformation, anchored by a US$1.75 billion (S$2.37 billion) reinvestment.\n“Today’s guests are well-travelled and increasingly discerning in their tastes and preferences. They crave exclusive and first-in-class experiences,” says Mr Tane Picken, Marina Bay Sands’ senior vice-president of hospitality.\n“This has become a central consideration in our ongoing refurbishment of our hotel, and a guiding principle across our design aesthetic, furnishings and amenities.”\nIt is easy to see why anyone would be inspired by Malone.\nBesides being a savvy businesswoman, she is also a storyteller who weaves her life journey into the fabric of her brand, engaging and inspiring the audience with each anecdote.\nShe inherited this love of performing from her father, who was an artist and magician. Growing up in a council flat – a modest government-subsidised home rented out to those unable to afford their own place – in South East London, the family had little but found joy in their simple life.\n“On Saturdays, I’d accompany him to markets where he sold paintings just so we could eat,” she says.\n“Then on late Sunday afternoons, he’d dash off to perform as a magician at parties, and I became his assistant. I’ve seen people sawn in half and white rabbits pop out of hats. It was quite an eclectic childhood.”\nHer mother worked as a beautician. Malone, influenced by her upbringing, began her journey in the field by giving facials and creating custom oil blends for her clients in her kitchen.\nShe formulated a Nutmeg & Ginger scented lotion and body oil as gifts for her most devoted clients. It became so popular that in 1983, at the age of 21, she launched Jo Malone London, an at-home business specialising in perfumes and scented candles.\nThe brand gained widespread recognition for pioneering the art of fragrance layering, encouraging customers to blend different scents to create a custom, personalised fragrance.\nIn 1994, Malone celebrated another milestone by opening her inaugural retail store in London, and her clientele soon included the likes of British supermodel Kate Moss, American pop star Madonna, Duchess of York Sarah Ferguson and local fashion doyenne Christina Ong.\nJo Malone London caught the attention of American cosmetics group Estee Lauder Companies, which acquired the burgeoning cult brand for an undisclosed sum in 1999.\nMalone continued to lead the brand in Britain as chairwoman and creative director, guiding its creative vision and growth. Under Estee Lauder’s ownership, Jo Malone London expanded its reach, entering new markets and establishing a global presence.\nHowever, her world would soon come crashing down in 2003, when she was diagnosed with an aggressive form of breast cancer. After enduring a year of chemotherapy, multiple surgeries and intensive care visits, she emerged from the ordeal.\n“The first three things I wanted to do were kiss my husband, hug my son and create fragrance,” says Malone, who is married to her business partner Gary Willcox.\nYet, she faced a daunting new challenge – chemotherapy had robbed her of her sense of smell. For someone who thrived on synesthesia, a rare neurological condition that allowed her to perceive colours as scents, it was a devastating blow for Malone.\n“I was so afraid and ashamed,” she says. “I didn’t tell my doctor. I didn’t even tell my husband.”\nShe decided to resign from Estee Lauder in 2006, but her sense of smell eventually returned while she was on a holiday in Turks and Caicos.\nHowever, due to a non-compete clause preventing her from launching another fragrance company for five years, Jo Loves came into existence only in 2011.\n“Once those five years were up, within 48 hours, I was sitting around a table planning my comeback. But what was I going to call myself? Who are you without your name?” she says.\nAfter a brainstorming session, she settled on a name suggested by her son: Jo Loves, reflecting her deep passion for fragrance. Jo Loves’ debut fragrance Pomelo was inspired, not surprisingly, by her “creative awakening” in Turks and Caicos.\n“This is my beach fragrance for the world,” she says. “It was created on a beach and loves to live on a beach. People stop me in the street to ask what I’m wearing whenever I have this fragrance on.”\nBut the first two years of Jo Loves were, in her words, excruciatingly difficult.\n“No one would touch us, and the consumer had no idea I’d left Jo Malone London, even though there were press releases. It was an uphill battle. My spirit was really tested,” she says. “But I love what I do. I’m a warrior and I’ve beaten cancer. So step by step, I reclaimed my life.”\nIn 2017, she came up with the idea of creating travel-sized, fragrance-dispensing paintbrushes in honour of her father.\n“When I presented this idea to my marketing team, they told me it was too gimmicky and they didn’t like it. I was so heartbroken that I went outside the room and cried,” she recalls, noting that she persevered with the concept regardless.\n“It was the product that took us into the global market and captivated people’s imaginations. The Gen Zs and Gen Alphas think it’s the coolest thing ever,” she says.\nMalone’s reputation was further boosted in 2018 when she was honoured with the title of Commander of the Most Excellent Order of the British Empire from the Prince of Wales. The prestigious award acknowledges her contributions to the fragrance industry, her entrepreneurial endeavours and her role as a mentor to students and small and medium-sized enterprises.\nThe perfumer is now living her best life in Dubai with her husband. You can occasionally find her on the beach, painting strangers with her Jo Loves Fragrance Paintbrush.\n“We packed our bags two years ago and went to find adventure because we didn’t have time to sit and wait for adventure to find us,” she says, eyes twinkling.\nMeanwhile, Jo Loves is thriving, following its partnership with global supplier of luxury hotel amenities Vanity Group. Apart from its flagship boutique at 42 Elizabeth Street in London, Jo by Jo Loves can also be spotted in several prestigious London establishments, such as Shangri-La The Shard and The BoTree Hotel.\nRecognisable by its distinctive red packaging, this range serves as a personal ode, drawing inspiration from Malone’s most cherished memories and moments.\nNew frontier for fragrance\nThe next time you step into a five-star hotel, try taking a sniff. You might be surprised to find that the first impression is not just about what you see.\nIn the competitive landscape of luxury hospitality, hotels are increasingly seeking innovative ways to differentiate themselves and create memorable experiences for their guests. A burgeoning trend that has caught the noses of travellers is the partnership between hotels and renowned fragrance ateliers.\nThis collaboration not only involves offering branded toiletries but also occasionally creating a signature scent that permeates the entire property.\nAccording to Mr Joe Escobedo, an adjunct lecturer from the Department of Marketing at NUS Business School, fragrances evoke emotional responses and create lasting impressions.\n“A guest entering a hotel lobby infused with a signature scent like Le Labo’s Santal 33 can feel an immediate sense of luxury and comfort,” he says of the New York-based niche perfumery brand’s offering.\nInstead of opting for renowned fragrances from established perfumers, some hotels are going a step further by choosing scents that capture the essence of their local surroundings, using notes reminiscent of indigenous flowers, spices and culinary aromas.\nMandarin Oriental, Singapore collaborated with home-grown bespoke perfumery brand Maison 21G to create a personalised fragrance that is, in the hotel’s words, exceptionally Singapore. The fragrance was unveiled when the hotel reopened in November 2023 following a six-month refurbishment.\n“The sensory journey co-curated with a brand that originated and developed in Singapore elevates the experience we craft for our guests, creating a connection with the city in every aspect of their stay and leaving unique memories of (the hotel),” says Ms Jill Goh, general manager of Mandarin Oriental, Singapore.\nGuests can look forward to a host of customised scent amenities, from reed diffusers to pillow mist sprays, as well as scent workshops during their stay.\nLooking ahead, Mr Escobedo suggests that personalised scent experiences may soon become a reality.\n“Guests will be able to personalise the scent in their rooms. This could be done through pre-arrival preferences, where guests select their desired scent, or through customer relationship management systems that remember a guest’s favourite fragrance from previous stays and automatically prepare their room with that scent,” he says.\nHere are the fragrance brands used in some of Singapore’s top hotels:\nMandarin Oriental, Singapore", "url": "https://www.straitstimes.com/life/style/scent-sational-second-act-mbs-tie-up-another-notch-in-perfumer-jo-malone-s-post-cancer-comeback"}