{"authors": ["Shawn Hoo"], "date_download": "2024-10-12 13:55:08", "date_modify": "2024-10-12 13:55:08", "date_publish": "2023-11-18 13:00:00", "description": "He recalls writing Singapore's first overtly political play, One Year Back Home (1980). Read more at straitstimes.com.", "filename": "life_arts_pioneer-writer-robert-yeo-s-routes-2-memoir-sequel-recalls-a-political-writer-s-struggles_1728741308.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/18/airobert161123.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_arts_pioneer-writer-robert-yeo-s-routes-2-memoir-sequel-recalls-a-political-writer-s-struggles_1728741308.html", "title": "Pioneer writer Robert Yeo’s Routes 2 memoir sequel recalls a political writer’s struggles", "title_page": "Pioneer writer Robert Yeo’s Routes 2 memoir sequel recalls a political writer’s struggles | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Robert Yeo takes pride in being both a civil servant and a political writer, and sees no contradiction between his two roles. The 83-year-old pioneer writer has published a new memoir Routes 2.\nThe candid book, which spans 1976 to 2000, is a window into a period of Yeo’s life when he wrote some of his most political works.\nThese include the poetry collection And Napalm Does Not Help (1977), which tackled the Vietnam War, and the controversial political drama One Year Back Home (1980), which took 18 months to receive a licence to perform.\nAt the same time, Yeo chaired the Drama Advisory Committee in the then Ministry of Culture and Ministry of Community Development, and lectured at the National Institute of Education (NIE), advocating a national literary and theatrical culture in Singapore’s early decades of independence.\n“As a civil servant, I wouldn’t criticise the Government, whose policies I generally supported. But as a writer, if I felt there were things they did that I did not agree with and were harsh, then I would put them in my writing,” says Yeo in an interview with The Straits Times.\nIf the earlier Routes (Ethos Books, 2011) is a memoir of roots-seeking, detailing the first 35 years of his life growing up in a Peranakan family and locating his ancestry in Sarawak, Routes 2 finds Yeo a mature man – forging his route as a writer.\nHe strongly believed there was then a dearth of critical Singapore plays and wrote One Year Back Home – the second play in what would become The Singapore Trilogy, and the first overtly political Singapore play. “I think that is the role of the writer: To be able to express an alternative point of view through his creative writings.”\n“When I first broached the idea of staging One Year Back Home, people said, ‘Your career will suffer’,” says Yeo, whose script referred to contemporary politics by staging a tense friendship between Chye, from the People’s Action Party, and Workers’ Party member Fernandez, who was detained for his political activities.\nIn extensively excerpted letters included in the book, Yeo recalls the ministry had requested for his script to show “a more balanced point of view”. Yeo acquiesced and made revisions to the script, including reframing Fernandez’s arrest as part of his “pro-communist” outlook rather than his status as an opposition party member.\nThe play was eventually granted a licence in 1980 by then acting minister for culture Ong Teng Cheong, writes Yeo.\nYeo has no regrets making these compromises, adding: “If I remain uncompromising, the plays will never get done. So, I was flexible about making adjustments to accommodate the point of view of the civil servants who saw things rather differently.”\nIn 1987, when Yeo picked up a copy of ST and learnt that many of his friends – including the playwright Wong Souk Yee – were arrested without trial for an alleged Marxist conspiracy, he felt the need to speak out.\nBut he feared for his family’s safety and kept silent before realising the contradiction in doing so. “In my capacity as chair of the Drama Advisory Committee, I had told playwrights I met that they should be free to write on any topic they like, that they should not be afraid to take on dissenting themes, that they should not let the Government set the agenda for them when writing.”\nIn a handwritten letter meant for the Internal Security Department, Yeo spoke of Wong’s ability to “make a further contribution to the working of a Singaporean Theatre”.", "url": "https://www.straitstimes.com/life/arts/pioneer-writer-robert-yeo-s-routes-2-memoir-sequel-recalls-a-political-writer-s-struggles"}