{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:55:46", "date_modify": "2024-10-12 13:55:46", "date_publish": "2023-12-04 15:00:00", "description": "Adventure and history are at the heart of The Last Overland, the tale of an epic journey from Singapore to London. Read more at straitstimes.com.", "filename": "life_travel_driven-by-passion-recreating-a-once-in-a-lifetime-road-trip-in-a-64-year-old-vehicle_1728741346.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/04/Alex20and20Nat20on20top20of20Oxford20in20Eastern20Thailand20.jpg?h=ada2b21a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_travel_driven-by-passion-recreating-a-once-in-a-lifetime-road-trip-in-a-64-year-old-vehicle_1728741346.html", "title": "Driven by passion: Recreating a once-in-a-lifetime road trip in a 64-year-old vehicle", "title_page": "Driven by passion: Recreating a once-in-a-lifetime road trip in a 64-year-old vehicle | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Midway through film-maker Alex Bescoby’s 21,000km overland expedition across the globe, a wheel on his trusty old vehicle – a 1955 Land Rover, to be precise – dislodged and rolled away.\nIt happened in Turkmenistan, a Central Asian nation governed by one of the world’s most oppressive and authoritarian regimes.\n“We’re driving about 60 miles an hour (97kmh) and, about 10 minutes past the border, the car collapsed. We managed to find a mechanic, but he had never seen a Land Rover before, let alone one from the 1950s,” says the English author and documentary film-maker, who was in Singapore in November to promote his book, The Last Overland, chronicling this epic 2019 journey.\nIt did not help that Bescoby and his team had to keep moving to adhere to the government-approved itinerary.\n“We had five days to get in and out. And the paperwork for that crossing was so extensive,” he says.\n“That’s when I thought we were going to have to put this car in a box, ship it home and take a flight back.”\nFortunately, they resolved the issue in time and left the country without severe repercussions.\nHe got an idea after he was introduced to Tim Slessor, 92, a veteran British film-maker and presenter who, back in 1955, had travelled from London to Singapore in a Land Rover.\nThis remarkable feat was then considered “the unclimbed Everest of motoring”.\nSlessor’s resulting book, First Overland: London-Singapore By Land Rover, swiftly became the definitive guide for overlanders when it was published in 1957.\nInspired by this seasoned adventurer, who was 86 when they first met in 2018, Bescoby began planning a trip that was similar in scope and spirit.\nHis goal was to complete the legendary road trip in the opposite direction, with Slessor in tow.\nNot only that, but they would also do it in the same Land Rover driven by Slessor all those years ago.\nAs fate would have it, Bescoby’s friend managed to track down the original vehicle – a Land Rover 86-inch station wagon – to the tiny, remote island of Saint Helena in the mid-Atlantic.\nThe car, nicknamed the Oxford, was promptly repatriated to Britain and restored for the upcoming journey.\nOn the road\nFriends and close relatives were shocked when Bescoby announced his plans.\n“The proposition to drive an 87-year-old man across the world in a 70-year-old car was insane. A lot of people told me that this would probably kill him,” Bescoby says.\n“I probably would’ve listened to those voices, had I not known the kind of man that Tim was,” he adds.\n“Once he’d set his mind on something, he was going to do it. There is this idea that you should fade as you get older, but he was actually getting brighter.”\nPlanning the route took nearly a year and he also secured funding from several organisations, including the Singapore Tourism Board.\nWhile the original journey traversed Middle Eastern countries such as Syria, Iraq, Iran, Afghanistan and Pakistan, the team opted to swop the tumultuous region for China and Central Asia – places inaccessible to travellers in the 1950s.\nOn Aug 25, 2019, Bescoby set off from the F1 Pit Building in Singapore, accompanied by seven teammates in three Land Rovers – including the Oxford – and a police convoy.\nTheir adventure attracted a substantial group of overland enthusiasts, and 96 additional Land Rovers appeared at the start of the trip in a show of moral support.\n“The Last Overland was quite a big deal in the United Kingdom, but I didn’t appreciate how strong the memory was all through South-east Asia,” says Bescoby.\n“We had people contacting us from Indonesia, Malaysia, Thailand, Myanmar and Singapore, all wanting to participate.\n“A convoy of cars accompanied us all the way up to the Myanmar border. People were coming up to us with first-edition copies of the book, as well as letters and photographs for Tim.”\nUnfortunately, Slessor was unable to join the adventure, having caught a lung infection on his plane journey to Singapore.\nHe was replaced by his grandson Nat George who, at 21 years old, was the age Slessor had been when he embarked on his trip in 1955.\nBescoby says: “Nat didn’t want to travel. But he stepped in because he wanted to make sure that somebody from the family was there.”\nCar troubles\nWhile beautifully restored, the Oxford was still a vehicle from the 1950s.\n“It has no power steering, no heating, no air-con, barely any suspension and terrible brakes. You know, it’s the most basic form of car you can drive,” says Bescoby, adding that the Oxford’s roof also leaks whenever it rains.\n“Luckily, it was dry in Singapore. But when we got to Thailand, we got very wet,” he adds. “We had to catch water (dripping from the ceiling) in mugs.”\nThe car’s shortcomings were further amplified when the group reached Tibet.\nAs the highest region on the planet, with an average elevation of 4,380m, the country experiences harsh and unforgiving weather conditions.\n“It’s freezing during the day and minus 15 deg C at night. The car has no insulation at all, so we had to get in with two pairs of gloves and a sleeping bag,” he says.\nThere were frightening instances as well, like when the group was caught in the crossfire between two warring tribes in Nagaland, a mountainous state in north-east India.\n“The territory is incredibly hostile, with terrible roads, monsoons and avalanches. We found ourselves in the middle of a land dispute between two villages and there were armed men everywhere, burning down houses. We were stuck for quite some time,” says Bescoby. “It was nerve-racking.”\nHowever, despite these challenges, the journey had a silver lining: “Everyone we met was just incredibly kind, welcoming and mostly confused about what we were doing there.\n“But, even in those really dangerous or hostile places, it really reaffirmed my belief that humanity is genuinely kind.”\nThere was also breathtaking scenery along the way. The Tibetan plateau, in particular, left a lasting impression on Bescoby.\n“We were driving hundreds of miles a day across an endless plateau. It was like I’d been transported to another planet. It’s almost like your brain can’t compute it because it’s so big,” he says.\n“And then you drive past Mount Everest and you can see it clear as day on your left. We also went to Mount Kailash, which is one of the world’s holiest places. It’s so far from everywhere.”\nWhole new world\nOverlanding offers a unique perspective of a country, according to Bescoby.\n“If you arrive in a capital city, in an airport, that has been curated for you by the country’s tourism board. But if you turn up at the back door in a car, no one knows you’re there,” he says.\n“You actually start to understand and get a genuine feel for what a country is about. I thought I had an impression of what that country should look like – it’s very, very different,” he says.\nNeighbouring countries also have a lot more in common with one another than they think.\n“The people who live on either side of a border have so much in common with each other. They basically speak the same language, they look the same, they do the same things. And it’s only because somebody drew a line,” he says.\n“I found that really interesting, that when you’re moving slowly through these geographies, you get a sense that it’s blurred the cultures, the language and the politics.”\nDuring stretches of monotony, the team found solace in familiar tunes, including Fleetwood Mac’s 1977 album Rumours, which they played via a Bluetooth speaker.\nBescoby also developed a new-found respect for long-distance haulers.\n“We met truck drivers from western China who were driving all the way to Europe. And this is what they do for a living, with their families in the truck with them.\n“For us, it was a fun expedition for a TV show, but for them, this was life. They would just drive back and forth across the planet,” he says.\nAfter nearly three months of driving through 23 countries and surviving on mainly prepackaged foods from petrol stations, the team arrived in London on Dec 14, 2019.\nBescoby admits that the homecoming was “incredible”, and he felt a mixture of relief and some sadness that the journey was over.\nIn just a matter of months, however, the world came to a standstill as Covid-19 disrupted daily life and shuttered borders. Stuck at home, Bescoby began penning down his experiences.\n“It was a very interesting exercise to write during Covid-19, because I was writing the stories and thinking if we’ll ever be allowed to do this again. Am I writing a love letter to a world that’s gone?” he says.\nPublished in 2022, his book – The Last Overland – was named one of the Best Travel Books of 2022 by British book retailer Waterstones, and shortlisted for the Royal Automobile Book of the Year 2023.\nMeanwhile, the four-part documentary capturing the expedition will make its Asian premiere in December.\nIt is produced by Grammar Productions, a Britain-based production house that Bescoby co-founded.\nThe film-maker is now “settling down a bit” after meeting and getting engaged to his partner, an equally intrepid lawyer.\nHe is also still in touch with Slessor. The two share an “intense bond” and occasionally chat over the phone.\n“He is the kind of grandfather that everybody wants – full of stories, full of life and full of adventure,” he says.\nAsked if he has any advice for aspiring adventurers, Bescoby says: “You’ll never be ready enough. You’ll never have enough money. You’ll never have enough time. Just get out there and do it.”\nThe Last Overland: Singapore To London will premiere on Dec 21 at 9pm on BBC Earth. It will be available on StarHub TV Channel 407, Singtel TV Channel 203 and BBC iPlayer.", "url": "https://www.straitstimes.com/life/travel/driven-by-passion-recreating-a-once-in-a-lifetime-road-trip-in-a-64-year-old-vehicle"}