{"authors": ["Yamini Chinnuswamy"], "date_download": "2024-10-12 13:57:08", "date_modify": "2024-10-12 13:57:08", "date_publish": "2022-10-07 16:17:19", "description": "The film will reportedly be produced in collaboration with the Karl Lagerfeld fashion label. Read more at straitstimes.com.", "filename": "life_entertainment_actor-jared-leto-to-play-late-fashion-designer-karl-lagerfeld-in-biopic_1728741428.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/07/3106792431652769928366714867421746189832282n_2.jpg?VersionId=s02fY9z8L8CI4maqEycVJPLLOt7A4t4Q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_actor-jared-leto-to-play-late-fashion-designer-karl-lagerfeld-in-biopic_1728741428.html", "title": "Actor Jared Leto to play late fashion designer Karl Lagerfeld in biopic", "title_page": "Actor Jared Leto to play late fashion designer Karl Lagerfeld in biopic | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Oscar-winning actor Jared Leto has had several transformative roles in his nearly 30 years in Hollywood, from Batman villain Joker in Suicide Squad (2016) to a HIV-positive transgender woman in Dallas Buyers Club (2013).\nNext up is a turn as Karl Lagerfeld, the German fashion designer who was the long-time creative director of luxury fashion house Chanel. He died in 2019.\nFashion industry trade Women’s Wear Daily revealed on Thursday that 50-year-old Leto will produce and star in a new feature film about Lagerfeld.\nThe film will reportedly be produced in collaboration with the Karl Lagerfeld fashion label. A release date was not announced.\nLeto said he plans to portray Lagerfeld, who died at the age of 85 in France from pancreatic cancer complications, “as honestly as possible”.\n“Karl had a career that spanned 50-plus years, so both personally and professionally, he was close to a number of people. I can say we are going to home in on key relationships that convey different parts of his life,” he added.\nHe and his producing partner, Ms Emma Ludbrook, will work with Lagerfeld’s closest confidantes on the project, including Mr Pier Paolo Righi, who was appointed chief executive of the Karl Lagerfeld house a decade ago.\n“It has been only since we met Jared and Emma that we felt truly confident about the story being told in the artistic way Karl would have loved to see,” Mr Righi said in a release quoted by Women’s Wear Daily.\nThough Lagerfeld was best known for his association with French maison Chanel – which begun in 1983 – he also delivered collections for Fendi and his own eponymous label. He was also famed for his iconic look that comprised dark, sharply tailored suits, pony-tailed white hair, sunglasses and fingerless gloves.\nLeto, who appeared as a vampiric antihero in Morbius earlier in 2022, is a popular fixture on the men’s fashion circuit for embracing unusual looks. The Louisiana-born actor made waves in September for donning a Gucci dress at a New York Fashion Week party.\nHe is no stranger to the luxurious world of high fashion on screen. In 2021’s House Of Gucci, he metamorphosed into Italian businessman and fashion designer Paolo Gucci with the aid of a fat suit, facial prosthetics and a bald cap.", "url": "https://www.straitstimes.com/life/entertainment/actor-jared-leto-to-play-late-fashion-designer-karl-lagerfeld-in-biopic"}