{"authors": [], "date_download": "2024-10-12 13:36:19", "date_modify": "2024-10-12 13:36:19", "date_publish": "2024-07-13 23:10:49", "description": "She became a pop culture figure as she encouraged Americans to have sex safely, frequently and creatively. Read more at straitstimes.com.", "filename": "life_entertainment_american-tv-sex-therapist-dr-ruth-dies-at-96-washington-post-reports_1728740179.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/13/2024-07-13T145121Z1944166079RC2DU8AJDN4VRTRMADP3PEOPLE-RUTH-WESTHEIMER.JPG?VersionId=05vieoimMZCdV2qaQ2BNiABBEWZC4ncJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_american-tv-sex-therapist-dr-ruth-dies-at-96-washington-post-reports_1728740179.html", "title": "American TV sex therapist Dr Ruth dies at 96, Washington Post reports", "title_page": "American TV sex therapist Dr Ruth dies at 96, Washington Post reports | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES - Dr Ruth Westheimer, the chirpy, diminutive therapist who became a pop culture figure as she encouraged Americans to have sex safely, frequently and creatively, has died at the age of 96, the Washington Post reported.\nWestheimer died on July 12 at her home in Manhattan, the newspaper reported, citing her publicist.\nWestheimer, who fled Nazi Germany as a child, said she first learned about sex when she was 10 years old and took her parents’ “marriage manual” out of a locked cabinet. What she saw on those pages would lead to a career that included international fame, books, instructional videos, lectures, teaching jobs, a radio show, countless television appearances, a syndicated column and even a “Good Sex” board game.\nKnown universally as “Dr Ruth,” the 140cm tall lady with a distinctive German accent and perpetual cheerfulness preached the joys of good sex, great sex and, especially, safe sex.\nThe woman who would become one of the world’s best known sex gurus lost her virginity at 17, on a starry night in a hayloft on a kibbutz. “We spent many nights in that barn... but I remember that first time most vividly of all because it shows that when two people are in love, the first experience can be very enjoyable,” she wrote in her 2001 autobiography, All In A Lifetime.\nWestheimer, a great proponent of contraception, chided herself in the book for not being concerned with birth control in those first encounters. She also declined to say who her partner was because she remained friends with the man, as well as his wife.\nWestheimer herself was the product of an unplanned, out-of-wedlock pregnancy. Her mother was working as a housekeeper for the family of Westheimer’s father in Frankfurt, Germany, when she became pregnant. The young couple eventually married and Karola Ruth Siegel was born on June 4, 1928.\nOrphaned by Holocaust\nWestheimer was 10 when the Nazis came to her Frankfurt home and took away her father. Six weeks later, her mother sent her to an orphanage in Switzerland. In 1941, Westheimer stopped receiving letters from her parents and she later learned they had been murdered in the Holocaust.\nAt 16, she emigrated to what was then Palestine and joined Haganah, a Jewish paramilitary organisation. “I learned to assemble a rifle in the dark and was trained as a sniper so that I could hit the centre of the target time after time,” she wrote, in a 2010 New York Times opinion article that called for women to be allowed to serve in combat in the US military.\nWestheimer never tested her sniping skills against an enemy, but was injured in a bombing in Jerusalem.\nShe married an Israeli soldier and they moved to Paris and went to college. They later divorced, and she headed to New York with a boyfriend, married him, had a daughter and continued her education. After another divorce, she wed Manfred Westheimer, an engineer she met in 1961. That marriage produced a son and lasted until Manfred’s death in 1997.\nAfter earning a doctorate in education, Westheimer went to work for Planned Parenthood and caught the attention of a New York radio station executive when she lectured broadcast officials on contraception.\nThat led to a weekly 15-minute midnight radio programme in 1980 called Sexually Speaking. It was an advice show that took questions from listeners about orgasms, condoms and sexual dysfunction - very sensitive subject matter for the time - and quickly won Westheimer a following.\nShe said it was a combination of her experience, training, and her quirky voice and accent that gave her credibility with listeners. They also liked the way she would cheerily wish them “good sex!”", "url": "https://www.straitstimes.com/life/entertainment/american-tv-sex-therapist-dr-ruth-dies-at-96-washington-post-reports"}