{"authors": ["Hedy Khoo"], "date_download": "2024-10-12 14:05:24", "date_modify": "2024-10-12 14:05:24", "date_publish": "2023-10-21 14:00:00", "description": "Sink your teeth into crispy Peking duck or splash out on a seafood feast. Read more at straitstimes.com.", "filename": "life_food_4-restaurants-in-johor-worth-splurging-at_1728741924.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/21/nmfoodcollagemsia2110.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_4-restaurants-in-johor-worth-splurging-at_1728741924.html", "title": "4 restaurants in Johor worth splurging at", "title_page": "4 restaurants in Johor worth splurging at | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JOHOR – Dining and shopping in Johor Bahru are no longer as cheap as one might expect, especially at the malls. Prices are fast becoming comparable with those in Singapore, even with the advantageous exchange rate.\nHowever, there are some restaurants where you can still get excellent value for your ringgit.\nSavour delicious whole roast suckling pig at Restoran Pekin KK or sink your teeth into crispy Peking duck carved tableside at Dragon-i Peking Duck Restaurant.\nThese four eateries are worth the splurge.\nFollow Hedy Khoo on Instagram @hedchefhedykhoo. Go to straitstimesfood.com for recipes, news on the latest food trends and more. Follow our social media accounts on Instagram and Facebook @straitstimesfood.\nRestoran Pekin KK: Bewitching roast suckling pig\nWhere: Restoran Pekin KK, No. 63, Jalan Tanjong 2, Taman Desa Cemerlang, 81800 Ulu Tiram, Johor; tel: +607-571-2011, +601-6702-8325\nOpen: 11am to 10pm daily\nRestoran Pekin KK in Taman Desa Cemerlang is slightly more than 30 minutes by car from Johor Bahru’s city centre, but I brave the distance because I am besotted with the restaurant’s roast suckling pig (RM368++ or S$106 for a whole pig).\nThe restaurant chain has five outlets, including one in Taman Sentosa which is just 13 minutes by car from the city centre. But I detour to the Taman Desa Cemerlang restaurant, its largest, because I have enjoyed every one of my visits there since 2019.", "url": "https://www.straitstimes.com/life/food/4-restaurants-in-johor-worth-splurging-at"}