{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:56:15", "date_modify": "2024-10-12 13:56:15", "date_publish": "2023-07-05 15:30:40", "description": "Catherine Middleton wore it to the Trooping The Colour ceremony in London on June 17. Read more at straitstimes.com.", "filename": "life_style_princess-of-wales-andrew-gn-dress-added-to-the-singapore-designer-s-ongoing-exhibition-at-acm_1728741375.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/07/Untitled2028129.jpg?VersionId=HQ7pO..gSalxVL3hGXfRqj1vQlGnfpZ9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_princess-of-wales-andrew-gn-dress-added-to-the-singapore-designer-s-ongoing-exhibition-at-acm_1728741375.html", "title": "Princess of Wales’ Andrew Gn design added to the Singapore designer’s ongoing exhibition at ACM", "title_page": "Princess of Wales’ Andrew Gn design added to the Singapore designer’s ongoing exhibition at ACM | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Asian Civilisations Museum (ACM) is buzzing with excitement as a new dress finds its place in Andrew Gn: Fashioning Singapore And The World, its ongoing exhibition focusing on the works of the Paris-based home-grown designer to the stars.\nThere are only two pieces of this customised emerald-green outfit design.\nOne was worn by royal style icon Catherine Middleton for the Trooping The Colour ceremony in London on June 17. It marked the first time Her Royal Highness, the Princess of Wales, chose to don a design by a Singaporean designer to a public event. The second piece was donated to ACM.\nGn, 59, worked closely with renowned milliner Philip Treacy to create her striking jewel-tone dress, with its matching custom headpiece, as a tribute to her new role as honorary Colonel of the Irish Guards.\nThe piece joins over 100 other representative works by Gn – some of which have been worn by European and Middle Eastern royalty – at ACM.\nMs Jackie Yoong, the museum’s senior curator of fashion and textile, said in a press statement that this addition was meant to pay tribute to a historic fashion moment for the Princess, Gn and Singapore.\n“It is the first time Catherine has attended the occasion in her new role as Princess of Wales. It is a huge honour for a Singaporean designer and speaks to his significance on the global stage – a major focus of the exhibition,” she says.\nIn conjunction with the special exhibition, ACM is organising Fashion Playground: Weekend Festival on July 15 and 16. Expect craft workshops on pattern making, embroidery and jewellery making, as well as a fashion showcase on styling, gem appreciation and more.\nDuring this time, Singaporeans and Singapore permanent residents can enjoy free entry, while foreign visitors enjoy discounted rates at $10. For more information, go to www.acm.org.sg.", "url": "https://www.straitstimes.com/life/style/princess-of-wales-andrew-gn-dress-added-to-the-singapore-designer-s-ongoing-exhibition-at-acm"}