{"authors": ["Alison de Souza"], "date_download": "2024-10-12 13:56:58", "date_modify": "2024-10-12 13:56:58", "date_publish": "2022-11-02 10:58:25", "description": "Selena Gomez: My Mind & Me is helmed by the same director behind Madonna: Truth Or Dare. Read more at straitstimes.com.", "filename": "life_entertainment_pop-star-selena-gomez-found-it-nerve-racking-to-lift-lid-on-her-life-in-new-documentary_1728741418.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/03/SelenaPhoto0102.jpg?VersionId=cX7pep.2_bfk.EULynnxCdZFDkzSyPmk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_pop-star-selena-gomez-found-it-nerve-racking-to-lift-lid-on-her-life-in-new-documentary_1728741418.html", "title": "Pop star Selena Gomez found it ‘nerve-racking’ to lift lid on her life in new documentary", "title_page": "Pop star Selena Gomez found it ‘nerve-racking’ to lift lid on her life in new documentary | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – By any measure, Selena Gomez is one of the biggest stars in the pop culture firmament.\nA chart-topping pop singer who has sold more than 210 million singles worldwide, the former Disney Channel star is also a successful actress and television producer, picking up an Outstanding Comedy Series Emmy nomination this year for the hit show Only Murders In The Building (2021 to present).\nShe is a media darling as well, a tabloid fixture because of high-profile romances with fellow pop stars such as Justin Bieber, The Weeknd and Nick Jonas. And in 2016, she became a Guinness World Records record-holder as the first person to hit 100 million followers on Instagram.\nBut as her career soared, she was battling serious mental and physical health issues behind closed doors – including a diagnosis of lupus and bipolar disorder, which led to depression and a kidney transplant in 2017.\nNow, Gomez is lifting the lid on what happened in Selena Gomez: My Mind & Me, a documentary debuting on Apple TV+ on Friday.\nIt offers a raw and intimate look at her six-year journey to deal with those struggles, and hints at the pressure she felt from the scrutiny over the end of her relationship with Bieber in 2018.\nAt a screening in Los Angeles in early October, the 30-year-old American celebrity wrings her hands nervously as she introduces the film, which was directed and co-written by Alek Keshishian and originally meant to be a record of Gomez’s Revival tour (2015-2016).\n“I just wanted to say thank you so much for being here. It’s a little nerve-racking, to be honest. I share a lot of myself in this documentary and I hope that you guys enjoy it. I don’t want to know what you think after,” she says, laughing nervously.\n“And I want Alek to talk about his vision, and why I decided to do this because he can speak eloquently and I am just going to make jokes the whole time,” adds Gomez, who has headlined films such as Spring Breakers (2012) and Monte Carlo (2011) and also produces and stars in her own cooking show, Selena + Chef (2020 to present).\nAt a separate press event for the film, American film-maker Keshishian, 48, tells The Straits Times that the star did not ask him to delete any footage he wanted to include because of the friendship that developed between them.\nKeshishian says he shared a similar bond with American pop queen Madonna, the subject of his groundbreaking 1991 documentary Madonna: Truth Or Dare – the highest-grossing documentary of all time for more than a decade.\nWith Gomez, “that unspoken trust meant I would never put anything in that she did not want”, he says in a video call.\nAt the same time, she did not like everything shown in the film, which shadows her as she goes on tour, meets fans, deals with her health and other issues – and occasionally breaks down on camera.\n“She didn’t love everything, some stuff made her uncomfortable. But she realised that they were important,” he says.", "url": "https://www.straitstimes.com/life/entertainment/pop-star-selena-gomez-found-it-nerve-racking-to-lift-lid-on-her-life-in-new-documentary"}