{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:55:48", "date_modify": "2024-10-12 13:55:48", "date_publish": "2023-12-07 16:00:00", "description": "A weekly round-up of fashion and beauty news. Read more at straitstimes.com.", "filename": "life_style_style-news-giorgio-armani-launches-made-to-measure-service-in-singapore-guerlain-s-new-spa-drunk-elephant-holiday-sets_1728741348.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/07/01-014GAMTMANNUAL2011MDA03FPR20x30.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-giorgio-armani-launches-made-to-measure-service-in-singapore-guerlain-s-new-spa-drunk-elephant-holiday-sets_1728741348.html", "title": "Style News: Giorgio Armani launches Made to Measure service in Singapore, Guerlain’s new spa, Drunk Elephant holiday sets", "title_page": "Style News: Giorgio Armani launches Made to Measure service in Singapore, Guerlain’s new spa, Drunk Elephant holiday sets | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Giorgio Armani launches bespoke suit service in Singapore\nYou no longer have to travel to Italy for a bespoke Armani suit.\nItalian luxury fashion house Giorgio Armani has just launched its Made to Measure service at the brand’s new boutique, which opened in November at Takashimaya Shopping Centre.\nFor now, the service is available only for menswear clients.\nClients will be able to feel the fabrics and personalise every aspect of the suit, from the overall silhouette to intricate details such as the lining, buttons, lapel type, pocket positions, fastenings and trouser pleats.\nThe result – a one-of-a-kind suit shipped from Milan after four to six weeks – comes with a personalised label featuring the client’s name.\nThere is also a Made to Order service for both men and women, which allows customers to personalise details on a range of classic ready-to-wear Armani pieces.\nAs part of the launch, the brand will be flying in one of its in-house tailors from Milan from Dec 8 to 10.\nInfo: A full Made to Measure suit is priced from $6,000 and the service is available at 02-10 Takashimaya Shopping Centre, 391 Orchard Road.\nGuerlain spa opens at Ion Orchard\nGuerlain’s newly opened Ultimate Boutique at Ion Orchard is markedly different from its outlet at Raffles City, where customers can redeem facials only via a loyalty programme.\nAt the Ultimate Boutique, customers can choose from a menu of 60- and 90-minute facials, such as the Imperial Global Age Reverse Treatment, Royal Honey Repair & Renew Treatment or Imperial Face Sculpting Treatment.\nPriced from $260 an hour, the facials combine the French beauty brand’s well-loved products with a massage technique that has been refined over the past 80 years.\nThere are two spacious spa suites filled with ultra-luxe touches and decorated with its signature bee motif.\nInfo: Guerlain’s Ultimate Boutique is located at B2-32 Ion Orchard, 2 Orchard Turn.\nDrunk Elephant drops holiday sets\nDrunk Elephant, the TikTok-famous American skincare brand, is back with value-for-money skincare sets this holiday season.\nThe brand – known for products that are high-performing and bio-compatible (so you can blend any of its products to create a skincare “smoothie”) – has released seven safari-themed gift sets.\nThe highlight is The Trunk ($705), a limited-edition backpack by bag company Baboon to the Moon that is filled with 10 full-sized skincare essentials amounting to $935.\nOther sets include the Wild Night Evening Kit and Day Dazzle’s Morning Kit ($150 each), which come with full-sized products as well as minis.\nAll products are free of essential oils, silicones and fragrances.\nInfo: Drunk Elephant’s Holiday 2023 sets are available exclusively at sephora.sg and Sephora stores.", "url": "https://www.straitstimes.com/life/style/style-news-giorgio-armani-launches-made-to-measure-service-in-singapore-guerlain-s-new-spa-drunk-elephant-holiday-sets"}