{"authors": ["Sarah Stanley"], "date_download": "2024-10-12 13:43:10", "date_modify": "2024-10-12 13:43:10", "date_publish": "2024-07-04 15:00:00", "description": "Round-trip flights on full-service carriers such as Emirates and Qatar cost upwards of $2,200. Read more at straitstimes.com.", "filename": "life_travel_travel-news-airasia-x-launches-flights-to-kenya-via-kl-one-way-fares-from-332_1728740590.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/04/melissa-van-niekerk-IOJx2UIKBeA-unsplash.jpg?VersionId=64xFfVfUkfQCA7k5GhSU5SxSuz1u3L3p", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_travel_travel-news-airasia-x-launches-flights-to-kenya-via-kl-one-way-fares-from-332_1728740590.html", "title": "Travel News: AirAsia X launches flights to Kenya via KL, one-way fares from $332", "title_page": "Travel News: AirAsia X launches flights to Kenya via KL, one-way fares from $332 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Till July 7, AirAsia X – the medium- and long-haul arm of low-cost carrier AirAsia – is offering promotional fares on its new Singapore-Nairobi route, starting at $332 for one-way fares.\nLaunching on Nov 15, the route will operate via a stopover in Kuala Lumpur on AirAsia’s Fly-Thru service. Passengers will be able to transfer to a connecting flight without having to check in their bags again.\nAirAsia X will fly to Nairobi four times a week – on Monday, Wednesday, Friday and Sunday. Departure from KL is scheduled for 7pm, and it will take about nine hours to reach the Kenyan capital.\nChecks by The Straits Times found one-way flights in January 2025 starting at $303. An AirAsia spokesperson says the lower-than-advertised cost is likely due to fluctuating prices based on demand, and may be available only for a limited time.\nIncluding checked baggage and in-flight meals, the total cost of a round-trip flight in January 2025 is around $992. Flights on full-service carriers such as Emirates and Qatar, with stopovers in Dubai and Doha, cost upwards of $2,200.\nHighly acclaimed safari parks – like the Maasai Mara National Reserve – are one of the main reasons travellers flock to Kenya.\nA three-day safari tour package by the Maasai Mara National Reserve for two people in July costs US$840 (S$1,139) a person, and includes accommodation, private transport for game drives, meals and an English-speaking guide.\nThe most popular months to travel to Kenya for safari are from July to October, in the dry season and when the Great Migration is in full swing.\nDuring this period, more than a million wildebeest, and hundreds of thousands of zebras, gazelles and other antelope species move across the East African plains in search of nutrition.\nOther popular activities in Nairobi include touring coffee plantations, as Kenya is one of the world’s largest coffee producers, and visiting local markets for handmade products, such as jewellery and clothes.\nThe travel period for promotional fares is between Nov 15, 2024, and Oct 8, 2025, and can be booked only on the airline’s mobile app, MOVE. For more information, go to str.sg/nti8", "url": "https://www.straitstimes.com/life/travel/travel-news-airasia-x-launches-flights-to-kenya-via-kl-one-way-fares-from-332"}