{"authors": ["Alison de Souza"], "date_download": "2024-10-12 14:04:43", "date_modify": "2024-10-12 14:04:43", "date_publish": "2024-06-26 19:30:00", "description": "The comedy-drama won 10 Emmys for its first season, including Best Actor for Jeremy Allen White. Read more at straitstimes.com.", "filename": "life_entertainment_we-re-hyper-sensitive-now-the-bear-s-cast-help-waiters-clean-up-when-dining-at-restaurants_1728741883.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/Bear-E301Still018.jpg?VersionId=EGN1PozsB0txBg9ZujRk9yx7ADcXCXl0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_we-re-hyper-sensitive-now-the-bear-s-cast-help-waiters-clean-up-when-dining-at-restaurants_1728741883.html", "title": "‘We’re hyper-sensitive now’: The Bear’s cast help waiters clean up when dining at restaurants", "title_page": "‘We’re hyper-sensitive now’: The Bear’s cast help waiters clean up when dining at restaurants | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – The stars of the Emmy-sweeping comedy-drama The Bear (2022 to present) play the staff at a new fine-dining eatery rising from the ashes of a humble Chicago sandwich shop.\nAnd after portraying these characters for three seasons – the latest of which premieres on Disney+ on June 27 – the actors say they are far more appreciative of restaurant workers when they dine out themselves.\nJeremy Allen White won the 2023 Outstanding Lead Actor in a Comedy Series Emmy for his role as Carmy, the restaurant’s owner and hotshot head chef – one of 10 Emmys picked up by the series for its first season, along with Outstanding Comedy Series and Outstanding Writing and Directing for a Comedy.\nThe 33-year-old American actor says: “I think all of us probably have much more interest, and a hyper-sensitivity now, in restaurants and to restaurants.”\nAyo Edebiri, who plays Carmy’s chef de cuisine Sydney, reveals that she cannot stop herself from helping waiters clean up when she eats at a restaurant these days.\n“I sort of clear my plate alongside them always now, and every server is, like, ‘Stop doing that.’” says the 28-year-old American, who took home the Outstanding Supporting Actress in a Comedy gong.\n“But it’s a reflex. I’m, like, ‘I’m so sorry.’”\nAbby Elliott, who plays Carmy’s sister and the restaurant’s manager Natalie, battles the same impulse.\n“I have two little kids, and now, when I go to restaurants, I’m constantly thinking about cleaning up after them.\n“And if they drop anything on the floor, it’s kind of stressful because you just know how hard restaurant workers work. So it’s definitely changed for me,” says the 37-year-old American actress.\nBecause of her role as line cook Tina, Liza Colon-Zayas, 51, is often curious about how the real cooks are getting on behind the scenes.\n“I try to (peep) into the kitchen,” the American performer says. “I just want to see how that energy and chaos are going.”\nLike their characters, the cast members have also learnt how to work together so that the ensemble functions like a well-oiled machine.\nTheir “non-negotiables” include rules such as “be nice to each other” and “learn your lines”, Edebiri says.\nAsked what to expect in Season 3, White hints that Carmy will continue to raise the bar for himself and everyone else at the fledgling restaurant.\n“I think Carmy does what he does, which is, he sort of buries himself in his work and really tries to challenge himself.\n“And in doing so, he really challenges everybody around him – and I think he becomes quite challenging to be around.”\nBut as angsty as Carmy and the other characters often get, the actors say they have no problem keeping things light when the cameras stop rolling.\n“I think on our show, it’s almost impossible to take that stuff home,” says White, who also starred in the sports movie The Iron Claw (2023) and became a global ambassador for Calvin Klein underwear in 2024.\n“The set is such a joyful place. Everybody does laugh so frequently that even if you have to go to a dark place in the morning, two hours later, you’ll be hanging out and watching a scene and really laughing and enjoying the company.”\nBut, he adds, the pressure that comes from the show having been a sleeper hit and one of the biggest Emmy winners for 2023 “is very real”.\n“Prior to shooting seasons 2 and 3, we’d just come off the success of awards season and I was very anxious.\n“But after a couple of weeks of getting back around these guys and our beautiful crew, everything kind of falls back into place, and it all feels possible again.”\nAnd Edebiri, who voices the emotion Envy in the hit animated sequel Inside Out 2, says she and her co-stars are not thinking about awards when they show up to work.\n“We were very fortunate, and it was very beautiful and exciting, but I don’t think we make this with that in mind. The chips will fall where they may, but I’m really proud of the work that we all continue to do.”\nThe Bear 3 premieres on Disney+ on June 27.", "url": "https://www.straitstimes.com/life/entertainment/we-re-hyper-sensitive-now-the-bear-s-cast-help-waiters-clean-up-when-dining-at-restaurants"}