{"authors": [], "date_download": "2024-10-12 13:36:31", "date_modify": "2024-10-12 13:36:31", "date_publish": "2024-06-09 12:00:00", "description": "The university will also return Combs' US$1 million contribution and disband the scholarship programme in his name. Read more at straitstimes.com.", "filename": "life_entertainment_no-longer-worthy-howard-university-revokes-sean-combs-honorary-degree-over-assault-video_1728740191.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/09/FILES-US-CRIME-ENTERTAINMENT-DIDDY-ASSAULT-125434.jpg?VersionId=gHJprv710b4wDGLgZowztCyV51zurZ9A", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_no-longer-worthy-howard-university-revokes-sean-combs-honorary-degree-over-assault-video_1728740191.html", "title": "‘No longer worthy’: Howard University revokes Sean Combs’ honorary degree over assault video", "title_page": "‘No longer worthy’: Howard University revokes Sean Combs’ honorary degree over assault video | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WASHINGTON – Howard University announced on June 7 that it would revoke an honorary degree that was awarded to American hip-hop mogul Sean “Diddy” Combs in 2014.\nThe decision comes in the wake of Combs’ admission that he physically abused a former girlfriend, in addition to a slew of other allegations of abuse that have surfaced in recent months.\nAt the conclusion of a meeting of the Howard board of trustees, the body voted unanimously “to accept the return by Mr Sean Combs of the honorary degree”, according to a statement released by the university. Howard also said it would revoke all honours and privileges associated with the degree.\nCombs, 54, attended the university from 1987 to 1989, but left before graduating. In 2016, he pledged US$1 million (S$1.4 million) to establish the Sean Combs Scholarship Fund, which went to students in need of financial aid.\nVideo footage surfaced in May of Combs striking, kicking and dragging his former girlfriend, American singer Casandra Ventura, known professionally as Cassie, in 2016.\n“Mr Combs’ behaviour as captured in a recently released video is so fundamentally incompatible with Howard University’s core values and beliefs that he is deemed no longer worthy to hold the institution’s highest honour,” the statement said.\nHoward University did not immediately respond to additional requests for comment.\nIn November, Ventura filed a lawsuit accusing Combs of rape and physical abuse, but they reached a settlement the next day.\nThen, in May, CNN published surveillance footage it had acquired from a Los Angeles hotel that showed Combs attacking Ventura near the building’s lifts.\nCombs subsequently posted an apology video on Instagram on May 19 with the caption: “I’m truly sorry.”\n“I hit rock bottom – but I make no excuses,” he said in the apology video. “My behaviour on that video is inexcusable. I take full responsibility for my actions in that video.”\nHoward University was founded in 1867 in Washington to educate freed slaves. Today, it is a renowned historically black university. Notable alumni include politicians, actors and writers, such as US Vice-President Kamala Harris and Pulitzer Prize-winning author Toni Morrison.\nThe loss of the honorary degree comes amid ongoing legal troubles for Combs, founder of Bad Boy Records.\nIn March, federal agents raided his homes in Los Angeles and Miami, which the officials said were related in part to a human trafficking investigation. No charges have been filed in relation to that case.\nThe raids followed lawsuits in which four women, including Ventura, accused Combs of rape and sexual assault. A man had also accused him of unwanted sexual contact. Lawyers for Combs have begun to file motions to dismiss the sexual assault suits.\nIn June, as his legal troubles mounted, Combs sold his majority stake in his media company, Revolt. He had previously sold his half of a liquor brand, DeLeon, for roughly US$200 million, after its parent company said Combs’ reputation had been tarnished. And a New York charter school network Combs had worked to expand cut ties with him.\nIn addition to stripping Combs of the honorary degree, Howard said it would return his US$1 million contribution and disband the scholarship programme in his name. NYTIMES", "url": "https://www.straitstimes.com/life/entertainment/no-longer-worthy-howard-university-revokes-sean-combs-honorary-degree-over-assault-video"}