{"authors": ["Jan Lee"], "date_download": "2024-10-12 14:04:45", "date_modify": "2024-10-12 14:04:45", "date_publish": "2024-01-16 18:20:00", "description": "Five members from the original cast of medical drama Grey's Anatomy also reunited onstage. Read more at straitstimes.com.", "filename": "life_entertainment_the-life-list-reunions-smooches-and-pretend-beef-at-the-75th-emmy-awards_1728741885.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/16/greys20reunion.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_the-life-list-reunions-smooches-and-pretend-beef-at-the-75th-emmy-awards_1728741885.html", "title": "The Life List: Reunions, smooches and pretend beef at the 75th Emmy Awards", "title_page": "The Life List: Reunions, smooches and pretend beef at the 75th Emmy Awards | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The much-delayed 75th Primetime Emmy Awards finally took place on the night of Jan 15 in Los Angeles, coming on the heels of a months-long labour strike by writers and actors in Hollywood.\nHosted by Black-ish star Anthony Anderson, the milestone edition of the show honoured primetime television programming which aired from June 1, 2022, to May 31, 2023.\nFamily drama Succession and restaurant tale The Bear were top of the class with six wins each.\nSuccession’s wins were for its acclaimed final season, while The Bear swept the board for its debut season, which was released in June 2022. Its second season, which was released in June 2023, will be eligible for the next edition of the Emmys.\nThe comedy Beef (2023), about a bitter feud that erupts after a road-rage incident, swept the limited series category with five wins, marking a historic night for Asian Americans in television.\nIts leads Steven Yeun and Ali Wong won best actor and actress in a limited series. Wong is the first Asian to win in her category.\nSeries creator Lee Sung-jin took home three major Emmys – for outstanding limited series, directing and writing. He is the first Asian to pull off this feat.\nThe first two wins presented during the ceremony went to African-American women. The Bear’s breakout star Ayo Edebiri won in the supporting category, while Quinta Brunson, the creator and star of the elementary school-set workplace comedy Abbott Elementary, won for lead actress. This is the first time both awards have gone to black women in the same year.\nAfter five nominations, actress Niecy Nash-Betts got a standing ovation during her speech when she won her first Emmy, supporting actress in a limited series, for true-crime adaptation Dahmer – Monster: The Jeffrey Dahmer Story.\nIn one of the most rousing speeches of the night, the 53-year-old star thanked herself. “I want to thank me for believing in me and doing what they said I could not do, and I want to say to myself in front of all you beautiful people, ‘Go on, girl, with your bad self. You did that.’”\nAccording to The Hollywood Reporter, five of the 12 acting Emmys were given to performers of colour, which ties with the 1991 edition for the most number of wins awarded to minority actors.\n2. Grey’s Anatomy cast reunites\nTo celebrate its 75th anniversary, the Emmys paid tribute to television and stars through the decades. The cast of beloved comedy Cheers (1982 to 1993) returned to the series’ famous bar set, the cast of Ally McBeal (1997 to 2002) did a dance number, and cult-favourite comedy Community (2009 to 2015) co-stars Ken Jeong and Joel McHale presented together.\nBut no reunion garnered as much attention as the one of the cast of Grey’s Anatomy (2005 to present). On the cusp of its 20th season, the show’s original cast members Ellen Pompeo, Justin Chambers, James Pickens Jr, Chandra Wilson and Katherine Heigl commemorated the longevity of the hit series.\nThe appearance of Heigl was particularly noteworthy as she famously had a feud with series creator Shonda Rhimes before her exit in Season 6.\n3. The fake Kieran Culkin and Pedro Pascal beef\nAt the Golden Globes earlier in January, Succession star Kieran Culkin won best actor in a drama series for his portrayal of a media mogul’s good-for-nothing son.\nAs Pedro Pascal was also a hot favourite in the same category for apocalyptic drama The Last Of Us, Culkin joked in his winning speech then: “Suck it, Pedro.”\nWhile presenting at the Emmys, Pascal, who showed up in an arm sling, said: “Kieran Culkin beat the sh** out of me.”\nIn truth, the actor had injured his shoulder in a fall. Still, that did not stop Culkin from presenting a stone-cold face when the camera panned to him, although he eventually cracked up in laughter.\nPascal and Culkin were both nominated for best actor in a drama series at the Emmys. The win went to Culkin.\n4. Winners and smooches\nThe Emmys were marked less by tears of happiness and more by kisses of joy.\nNotable smooches included Wong sharing a sweet kiss with her beau, Barry (2018 to 2023) star Bill Hader, when she was named best actress for Beef. Wong, who announced her separation from ex-husband Justin Hakuta in 2022, had made her first public appearance with new boyfriend Hader earlier at the Golden Globes.\nWhile they might play a dysfunctional father-and-son pair in Succession, series star Brian Cox shared a quick and affectionate peck with on-screen son Culkin when the latter won his best actor trophy.\nBut the biggest and longest smooch of the night belonged to The Bear stars Matty Matheson and Ebon Moss-Bachrach. When the cast went onstage to collect their trophy for outstanding comedy series, Matheson, a real-life chef who plays a handyman in the series, thanked restaurant workers in his speech.\nHe was interrupted by Moss-Bachrach, who was so excited by the win that he grabbed Matheson by the face and kissed him, drawing cheers from the cast and audience.\n5. Goodbye to a Friend\nAmerican singer Charlie Puth took the stage and played the piano for the In Memoriam segment with a rendition of his 2015 hit See You Again.\nThe segment remembered stars like Brooklyn Nine-Nine cast member Andre Braugher, who died of lung cancer in December 2023; Dame Angela Lansbury, who died at age 96 in 2022; and Euphoria actor Angus Cloud, who died of an accidental overdose at 25 in 2023.\nWhen it came time to honour late Friends star Matthew Perry, who died of acute effects of ketamine at age 54 in October 2023, See You Again segued into a soulful rendition of the comedy’s theme song, I’ll Be There For You.\nList of winners\nBest drama series: Succession\nBest comedy series: The Bear\nBest limited or anthology series or movie: Beef\nBest comedy actor: Jeremy Allen White, The Bear\nBest comedy actress: Quinta Brunson, Abbott Elementary\nBest drama actor: Kieran Culkin, Succession\nBest drama actress: Sarah Snook, Succession\nBest actor, limited or anthology series or movie: Steven Yeun, Beef\nBest actress, limited or anthology series or movie: Ali Wong, Beef\nBest drama supporting actor: Matthew Macfadyen, Succession\nBest drama supporting actress: Jennifer Coolidge, The White Lotus\nBest comedy supporting actor: Ebon Moss-Bachrach, The Bear\nBest comedy supporting actress: Ayo Edebiri, The Bear\nBest supporting actor, limited or anthology series or movie: Paul Walter Hauser, Black Bird\nBest supporting actress, limited or anthology series or movie: Niecy Nash-Betts, Dahmer – Monster: The Jeffrey Dahmer Story\nBest directing, drama: Mark Mylod, Succession\nBest directing, comedy: Christopher Storer, The Bear\nBest directing, limited or anthology series or movie: Lee Sung-jin, Beef\nBest drama writing: Jesse Armstrong, Succession\nBest comedy writing: Christopher Storer, The Bear\nBest writing, limited or anthology series or movie: Lee Sung-jin, Beef\nBest writing, variety series: Last Week Tonight With John Oliver\nBest talk series: The Daily Show With Trevor Noah\nBest scripted variety series: Last Week Tonight With John Oliver\nBest variety special (live): Elton John Live: Farewell From Dodger Stadium\nBest reality competition: RuPaul’s Drag Race", "url": "https://www.straitstimes.com/life/entertainment/the-life-list-reunions-smooches-and-pretend-beef-at-the-75th-emmy-awards"}