{"authors": [], "date_download": "2024-10-12 13:35:12", "date_modify": "2024-10-12 13:35:12", "date_publish": "2024-09-11 13:35:00", "description": "Piece By Piece is voiced by Williams and fellow pop stars Gwen Stefani, Kendrick Lamar and Jay-Z. Read more at straitstimes.com.", "filename": "life_entertainment_tiff-2024-pharrell-williams-animated-biopic-populated-by-lego-blocks_1728740112.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/CANADA-FILM-FESTIVAL-TIFF-194346.jpg?VersionId=gfrCvE65MPfJGGSZV1so_6QgMClPTU8B", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_tiff-2024-pharrell-williams-animated-biopic-populated-by-lego-blocks_1728740112.html", "title": "TIFF 2024: Pharrell Williams’ animated biopic populated by Lego blocks", "title_page": "TIFF 2024: Pharrell Williams’ animated biopic populated by Lego blocks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TORONTO – The flesh-and-blood Pharrell Williams walked the red carpet on Sept 10 with the star of his new animated biopic – a Pharrell Williams made of Lego blocks – as Piece By Piece made its international premiere in Toronto.\nThe animated feature – voiced by Williams and fellow pop stars Gwen Stefani, Kendrick Lamar and Jay-Z – takes the audience on an unconventional journey through the musical virtuoso’s upbringing and vibrant career by casting Lego pieces as the characters in his life story.\nWilliams, a renowned American recording artiste, producer and songwriter, said Lego characters, a favourite of children around the world, gave the picture a global appeal and enabled the film to sidestep cliches in telling his story.\n“Lego helps to universalise the story so that it can be received by anyone that comes from a marginalised community,” said the 51-year-old – who has won 13 Grammy Awards, including three for Producer of the Year– on the red carpet at the Toronto International Film Festival.\n“I didn’t want to tell a story that’s like poverty porn. That’s a usual Hollywood trope and that’s not what this is.”\nAmerican director Morgan Neville said one of the reasons he tackled the project was his long-standing interest in music producers, who he said often have a larger vision.\n“Pharrell is famous for seeing the world a little differently and approaching music differently,” Neville said on the red carpet.\nThe film was not the first Neville focused on music artistes. His credits include Rolling Stones guitarist Keith Richards’ documentary Keith Richards: Under The Influence (2015) and Irish rock band U2’s Bono & The Edge: A Sort Of Homecoming With Dave Letterman (2023).\nNeville, 56, said animation was an ideal media to tell the story of Williams’ life.\n“Pharrell has synesthesia, which means when he hears music, he sees colour,” the director said. “The idea that you could see the colour and make all this stuff come alive and taking the beats he was writing and turn them into physical objects.”\nWilliams wrote an original song for the film, also titled Piece By Piece, about building a dream from the ground up.\nThe Happy (2013) singer told Reuters the diversification of the Lego characters was part of his dream.\n“There’s all kinds of people on this planet,” he said. “All of this continues to be a gift.” REUTERS", "url": "https://www.straitstimes.com/life/entertainment/tiff-2024-pharrell-williams-animated-biopic-populated-by-lego-blocks"}