{"authors": ["Lim Ruey Yan"], "date_download": "2024-10-12 13:45:49", "date_modify": "2024-10-12 13:45:49", "date_publish": "2024-09-06 16:46:00", "description": "Anchored by Quan Yifeng, Season 4 featured stars such as Julian Cheung, Ruby Lin and Eric Chou. Read more at straitstimes.com.", "filename": "life_entertainment_hear-u-out-4-crowned-best-asian-talk-show-at-contentasia-awards_1728740749.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/06/bthear20240906.jpg?VersionId=B7tNi14e9Ae_ti8KkjAQh4_gbCxHpc7z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_hear-u-out-4-crowned-best-asian-talk-show-at-contentasia-awards_1728740749.html", "title": "Hear U Out 4 crowned Best Asian Talk Show at ContentAsia Awards", "title_page": "Hear U Out 4 crowned Best Asian Talk Show at ContentAsia Awards | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Home-grown talk show Hear U Out 4 has been named Best Asian Talk Show at ContentAsia Awards 2024.\nThe winners were announced at performance venue Corner Max in Taipei on Sept 5.\nAnchored by veteran television host Quan Yifeng, the fourth season of Hear U Out featured celebrity guests such as Hong Kong actor Julian Cheung and Taiwanese actress Ruby Lin and singer Eric Chou.\nHear U Out 4 bested Taiwan’s Uncommon Cuts – Hello, Migrant Workers and Indonesia’s Kita Indonesia. They received the Silver and Bronze awards respectively.\nQuan, 50, said on Facebook late on Sept 5 that winning the regional award is recognition for the programme and the crew.\n“Being able to take the talk show abroad, gaining the trust of the guests so that they can talk freely – this is a challenge for both the crew and myself,” she wrote in Chinese. She thanked the award organisers, as well as crew members and guests who took part in the talk show.\nMeanwhile, Singapore-based actors Chantalle Ng, Duan Weiming and Zhai Siming missed out in the acting categories.\nHong Kong actress Charmaine Sheh won Best Female Lead in a TV Programme/Series for her role as news anchor Sister Man in TVB drama The Queen Of News. Ng, who was nominated for her role as visually disabled young mother Li Zhenyu in Mediacorp drama All That Glitters, received the Bronze award.\nChinese actress Zhao Lusi took the Silver award for her role as rebellious young woman Sun Toutou in Gen Z, a Chinese TV series about traditional Chinese medicine.\nThe Best Male Lead award went to Filipino actor Arjo Atayde in Philippine psychological thriller drama Cattleya Killer.\nDuan, nominated for his role as drink stall uncle Larry in Season 3 of Channel 5 hawker drama 128 Circle, received the Silver award. The Bronze awards went to India’s Gagan Dev Riar and Malaysia’s Tony Eusoff.\nThe Best Supporting Actor award went to Indonesia’s Jeremie J. Tobing in Tira, with Zhai receiving the Bronze award for his role in My One And Only. The Best Supporting Actress award went to Hong Kong’s Samantha Ko in The Queen Of News.", "url": "https://www.straitstimes.com/life/entertainment/hear-u-out-4-crowned-best-asian-talk-show-at-contentasia-awards"}