{"authors": ["Alison de Souza"], "date_download": "2024-10-12 13:56:51", "date_modify": "2024-10-12 13:56:51", "date_publish": "2024-07-09 11:00:00", "description": "Japanese actor Hidetoshi Nishijima from the Oscar-winning film Drive My Car stars with American actress Rashida Jones. Read more at straitstimes.com.", "filename": "life_entertainment_kyoto-shot-robot-drama-sunny-shows-dark-and-messy-side-of-japan_1728741411.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/09/SunnyPhoto010201.jpg?VersionId=uUTpekOFZOZ8Lt4FPYLOzV1Z6rU1UiPb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_kyoto-shot-robot-drama-sunny-shows-dark-and-messy-side-of-japan_1728741411.html", "title": "Kyoto-shot robot drama Sunny shows ‘dark and messy’ side of Japan", "title_page": "Kyoto-shot robot drama Sunny shows ‘dark and messy’ side of Japan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – In the comedy-drama series Sunny, American actress Rashida Jones takes the lead playing an American woman, Suzie, whose life in Kyoto is shattered when her husband Masa (Hidetoshi Nishijima) disappears in a plane crash along with their son.\nTo comfort her, the electronics company her spouse works for sends her Sunny, an advanced domestic robot.\nDespite her dislike of robots, Suzie develops an unexpected relationship with the device. And after discovering some troubling secrets about Masa’s life, she enlists it to help her solve the mystery of what he was hiding.\nIn a Zoom interview with The Straits Times and other press, the stars say the 10-episode show – which premieres on Apple TV+ on July 10 – captures Japan’s quirky, high-tech culture as well as the country’s “dark and messy side”.\nNishijima is an award-winning Japanese actor who starred in the drama Drive My Car (2021), which snagged the Oscar for Best International Feature and won him the Japan Academy Film Prize for Best Actor.\nHe says through an interpreter: “In Japan, we have the old traditions and values, and we have the old aesthetics.\n“At the same time, we have state-of-the-art, quirky technology.\n“Those elements are fused in Japan right now, and I think it’s a very special, esoteric culture.”\nWhen Japanese culture is portrayed abroad, it is often with iconic images of its temples and natural wonders.\n“But in this show, we’re showing this messy, complicated, underground, dark side”, says the 53-year-old, who also starred in the science-fiction hit Shin Ultraman (2022) and the slice-of-life series What Did You Eat Yesterday? (2019 to 2023).\n“At the same time, we’re portraying history.\n“And we shot right in the middle of Kyoto, so you can see the real, modern Japan. And I would like people to enjoy that part of the show,” he adds.\nJones, 48, who was also an executive producer on Sunny, says it is rare to get permission to film in the Japanese city, especially in some of the historic locations depicted, which are usually teeming with tourists.\nNishijima confirms that it is usually impossible. “That was the first time for me and I’ve done many shoots in Japan.”\nJones, who is best known for appearing in comedy series such as The Office (2005 to 2013) and Parks And Recreation (2009 to 2015), says this allowed Sunny to showcase more of the country and its unique aesthetic.\n“Just to have the opportunity to be in that really majestic, old place, and have it captured on film and look so beautiful, was so awesome. And I think people will really get the sense of the scope of Japan visually and aesthetically,” she adds.\n“It’s such an extremely rich and singular culture in that way, and part of the storytelling is seeing Japan as it is, in this kind of filmic way.”\nThe story also imagines how advanced artificial intelligence could be integrated into everyday life, and the implications this will have for mankind, especially given the growing epidemic of loneliness in many countries.\nThe attempt to develop human-like robots “feels like a weird way of doing a psychological investigation into our own humanity”, says the daughter of legendary American music producer Quincy Jones and the late American actress Peggy Lipton.\n“It’s almost like if you can create this mirror and make it feel like us, we’re trying to figure out, through that, what does it mean to be human.\n“And is it inherently lonely to be alive,” adds Jones, who has a five-year-old son with her partner, American musician Ezra Koenig, 40.\n“Is it possible to really connect with somebody else without fully opening your heart to being hurt, betrayed and lied to – and can you do that with a robot filling the place of a human being as a means of connection?”\nNishijima, who has two children aged eight and five, believes that modern society is “making people feel lonelier and lonelier”.\n“But can people live without one another?\n“Maybe you can live alone, but we are at this point where we have to think about it, and the show makes you think about those questions.”\nSunny premieres on Apple TV+ on July 10.", "url": "https://www.straitstimes.com/life/entertainment/kyoto-shot-robot-drama-sunny-shows-dark-and-messy-side-of-japan"}