{"authors": [], "date_download": "2024-10-12 13:27:43", "date_modify": "2024-10-12 13:27:43", "date_publish": "2024-04-21 13:30:00", "description": "Record Store Day is celebrated across the UK on April 20 to celebrate special vinyl releases. Read more at straitstimes.com.", "filename": "life_entertainment_vinyl-enthusiasts-spin-into-action-on-uk-s-record-store-day_1728739663.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/21/BRITAIN-CULTURE-MUSIC-RECORDSTOREDAY-094531.jpg?VersionId=ASedTyiBcnIogmbwq2LtfQ3b2oRu1Qqk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_vinyl-enthusiasts-spin-into-action-on-uk-s-record-store-day_1728739663.html", "title": "Vinyl enthusiasts spin into action on UK’s Record Store Day", "title_page": "Vinyl enthusiasts spin into action on UK’s Record Store Day | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – It was 8.30am (3.30pm, Singapore time) and the line was growing in front of Flashback Records in the Shoreditch neighbourhood of Britain’s capital.\nApril 20 marked the UK’s annual Record Store Day, created to support independent outlets, and vinyl enthusiasts were eager to get their hands on special reissues and new releases.\nThe first fans arrived at 4.45am, although the store did not open until 9am.\nThe excitement reflects a new golden age for vinyl, with sales thriving despite its predicted demise 20 years ago.\nMr Martin Wolyniec, 45, with a greying beard and blue eyes and accompanied by his niece Amelia, stood in the line outside the store, holding a list of specials released for the day.\nOn it was an album by English band Groove Armada, English duo Everything But The Girl and, if the pair were “lucky”, a record by English singer Kate Bush.\nMinutes later, after a search inside, Mr Wolyniec emerged victorious, brandishing a square bag filled with coveted album sleeves. Amelia danced ecstatically to celebrate.\nMr Wolyniec and his wife began collecting vinyl six years ago. He said: “Probably because it’s something you can still feel, touch, look at – not just something that fits in our phone.”\nMr Derek Yeboah, a 32-year-old software designer, started his own collection after inheriting his brother’s old garage and trance records. He had his eye on some jazz and blues titles.\n“Everything is digital now,” he said. “Songs are shortened because of social media, everything has to fit within four minutes” whereas vinyl offers more freedom and space, he added.\nMr Mark Burgess, founder and owner of Flashback Records, said: “This annual day is very important as it gives us a boost at this time of the year which is really needed.”\nThe number of independent record stores in the UK is at a 10-year high, totalling 461 shops – 122 more than in 1994 – largely driven by the vinyl resurgence.\nThis is despite the high cost of new LPs, which range from £20 to £40 (S$34 to S$67), amid a cost-of-living crisis.\nVinyl album sales rose by nearly 18 per cent to £177.3 million in 2023, while CDs had a modest rebound for the first time in nearly two decades, according to the ERA trade association.\nHowever, the bulk of music is consumed digitally, with only 8 per cent in “physical” formats, vinyl or CD, said the British organisation.\nGiven vinyl’s significant resurgence in the UK music scene, the Office for National Statistics has decided to include it in the basket of goods used to calculate inflation.\n“Nearly every album released by a major label comes out on vinyl, but it’s expensive to produce”, especially with the soaring cost of oil in recent years, which partly explains their high price, said Mr Burgess.\nIn front of Soho’s iconic Sister Ray record store in central London, an eclectic crowd of various ages and styles lined up around the block.\nMs Zoe Farace, 25, who works in human resources, said she inherited her passion for vinyl as a child from her father, who owns “too many to count”.", "url": "https://www.straitstimes.com/life/entertainment/vinyl-enthusiasts-spin-into-action-on-uk-s-record-store-day"}