{"authors": ["Amanda Chai"], "date_download": "2024-10-12 13:56:01", "date_modify": "2024-10-12 13:56:01", "date_publish": "2023-11-30 15:00:00", "description": "Pick up new threads or Christmas trinkets at these home-grown labels. Read more at straitstimes.com.", "filename": "life_style_new-kids-on-the-block-5-local-boutiques-for-your-festive-shopping-needs_1728741361.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/30/yaohui-aclocal30-7493_0.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_new-kids-on-the-block-5-local-boutiques-for-your-festive-shopping-needs_1728741361.html", "title": "New kids on the block: 5 local boutiques for your festive shopping needs", "title_page": "New kids on the block: 5 local boutiques for your festive shopping needs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "You will also notice that the wood hangers in-store are slightly different. To maximise the lifespan of what was available, they were sourced from Carousell and heat-stamped by the Atlas Kind team.\nThe paper bags are crafted out of Forest Stewardship Council-certified bamboo and printed with water-based ink. Even the circular handles are made from paper, for greater ease in recycling responsibly.\nCarrie K.\nLevel 3, 77B Neil Road\nAlso look out for customisable bangles (from $5,300) – made in your preferred metal, with two initials represented in Morse Code via diamond dots and dashes.\nThe newest addition is a Jewel Bar where one can customise fine jewellery pieces. The selection of necklaces, earrings, bracelets, bangles and rings features modular elements for easy mixing and matching or layering.\nIn that same vein of versatility, earrings at the Jewel Bar offer customisable components – such as removable ear studs, hoops, drops and ear jackets that can be taken apart or worn together.\nFor instance, the Lotus Jade Coin Drop ($990) crafted with Type A jadeite can easily elevate a regular ear stud.\nHead on upstairs to the mezzanine level, turned into an intimate VIP lounge for bespoke jewellery consultations. You can pore over the brand’s curation of precious gems, pearls, as well as lab-grown and natural diamonds.\nCurious Creatures\nB3-37 Ion Orchard, 2 Orchard Turn\nWomenswear label Rye, known for its chic, minimalist apparel, has brought its slow-living ethos to a heritage shophouse – built in 1929 – in Joo Chiat.\nOften favouring unconventional retail spaces, the brand opened its first boutique in Bukit Timah’s Cluny Court in June 2022. There is also a third store in the works, at The Lo & Behold Group’s upcoming lifestyle development in Kim Yam Road.\nThe Joo Chiat store has been meticulously designed to pay homage to the town’s coastal history, with elements inspired in part by founder Bessie Ye’s summer sabbatical in Sri Lanka, where she spent time at the Lunuganga Estate, the country house of renowned Sri Lankan architect Geoffrey Bawa.\nYe, 34, was inspired by its concept of quiet architecture – which focuses on the quality of space and the symbiosis with the earth – and how spaces were intentionally created for lingering and slowness.\nIn this union of local and international artists, a focus on texture is the common thread here.\nRustic clay walls and natural stone floor tiles mimic the earth and walking on raw soil – as does the rug in earthy hues in the fitting room, woven by local textile design studio Tanchen.\nEven the fitting-room chair – inspired by South Korean furniture designer Minjae Kim’s lacquered chairs – was intentionally chosen to resemble a chess piece to complement the checkerboard-like rug.", "url": "https://www.straitstimes.com/life/style/new-kids-on-the-block-5-local-boutiques-for-your-festive-shopping-needs"}