{"authors": ["Chang Tou Liang"], "date_download": "2024-10-12 13:59:08", "date_modify": "2024-10-12 13:59:08", "date_publish": "2023-12-04 11:30:00", "description": "The violin artist finals had more impressive performances compared with the Piano competition. Read more at straitstimes.com.", "filename": "life_arts_concert-review-national-piano-violin-competition-showcases-fresh-young-talents_1728741548.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/04/R610209-Joshua20Lau20Jin20Quan20-20First20Prize20Winner.JPG?h=d84cfa37", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_arts_concert-review-national-piano-violin-competition-showcases-fresh-young-talents_1728741548.html", "title": "Concert review: National Piano & Violin Competition showcases fresh young talent", "title_page": "Concert review: National Piano & Violin Competition showcases fresh young talent | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "National Piano & Violin Competition 2023\nPiano Artists Finals\nVictoria Concert Hall\nDec 2, 7.30pm\nViolin Artist Finals & Prize Winners’ Concert\nVictoria Concert Hall\nDec 3, 3.30 & 7.30pm\nThe National Piano & Violin Competition (NPVC), Singapore’s premier music competitive musical platform, returned to live concerts after the pandemic had reduced its 2021 edition to just online performances.\nThe finals of the Artist categories also saw an upgrade from mere piano accompaniment with the return of concertos performed with the NPVC Orchestra (Singapore Symphony in all but name) conducted by Joshua Tan.\nThis made for two very satisfying concerts showcasing six talented musicians in six concerto performances.\nThe piano finals held on Dec 2 were an all-Beethoven affair, opening with university undergraduate Long Jing Xuan in the Fourth Piano Concerto In G Major (Op.58). Technically and interpretively the most difficult concerto of five, it received a very musical reading despite him betraying nerves with some missed notes and the occasional brief desynchronisation with the orchestra.\nCompensate he did, by projecting a big sonority which could sound overdone at times, and this also informed Conservatory student Lee Ann’s slightly more confident performance of the Third Piano Concerto In C Minor (Op.37). Here, some over-emphatic responses to certain phrases were equated with reliving the Sturm und Drang (storm and stress) of this urgent and dramatic work.\nTheir valiant efforts were, however, eclipsed by national serviceman Joshua Lau Jin Quan, a supreme figure of composure in the Second Piano Concerto In B Flat Major (Op.19).\nCrispness of articulation, realisation of the music’s humour and unexpected but delightfully turned ornamentations made his reading the very definition of joie de vivre. The international jury of three awarded Lau with a deserved first prize, with Long and Lee sharing joint third places.\nThe violin artist finals on the afternoon of Dec 3 had the more impressive concerto performances, all from the Conservatory’s international students.\nThere were two readings of Sibelius’ Violin Concerto In D Minor, first by Ukrainian Datsiuk Leonid, who evoked a sense of mystery in its quiet opening followed by lots of pathos. There were minor intonation lapses and missed notes in the heat of the moment, but the music’s high-wire tension was maintained throughout.\nThe other Sibelius performance came from Sichuan native Zou Meng, who exuded a quiet confidence and then let rip with a searing intensity that surpassed the earlier reading. A big tone and perfect intonation certainly helped and this 20th-century concerto had seldom resounded with white-hot incandescence from the hands of students.\nThe prize-winners’ concert relived movements from the winning concertos partnered by the orchestra and also unveiled the set pieces commissioned for the Artist and Senior Categories.\nYoung composer Terrence Wong’s Life (for piano) and Death (for violin) – works recalling Arvo Part-like minimalism and Paganinian calisthenics – received glowing performances from Adrian Tang (Piano Senior) and Low Peng Guan (Violin Senior) respectively.\nNot to be ignored were seriously good solo performances from the children of the Junior and Intermediate categories, whose prowess at their tender ages has consistently impressed juries over the decades.\nThe names of violinists Chua Suen Ern and Kaleb Toh, as well as pianists Newman Tong and Ethan Peleg, may some day be as ubiquitous as NPVC’s most famous alumna: Chloe Chua.\nCorrection note: The name of violinist Kaleb Toh was misspelled in an earlier version of the story. We are sorry for the error.", "url": "https://www.straitstimes.com/life/arts/concert-review-national-piano-violin-competition-showcases-fresh-young-talents"}