{"authors": [], "date_download": "2024-10-12 13:44:23", "date_modify": "2024-10-12 13:44:23", "date_publish": "2023-12-05 05:00:00", "description": "The money will go into aiding The Straits Times School Pocket Money Fund and The Business Times Budding Artists Fund. Read more at straitstimes.com.", "filename": "life_childaid-2023-raises-over-2-million-with-interactive-musical-mystery_1728740663.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/05/202312044819567420231203201007ga33267-edit.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_childaid-2023-raises-over-2-million-with-interactive-musical-mystery_1728740663.html", "title": "ChildAid 2023 raises over $2 million with interactive musical mystery", "title_page": "ChildAid 2023 raises over $2 million with interactive musical mystery | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The stage was smaller and the cast leaner this time in 2023, but the creative risk paid off for the organisers of ChildAid 2023.\nThe 19th edition of the annual charity concert organised by The Straits Times and The Business Times raised $2,008,163, thanks in no small part to sponsors UOB, Citi Singapore and Mr Mohamed Abdul Jaleel, chief executive of MES Group.\nThe money will go into aiding The Straits Times School Pocket Money Fund, which sponsors the lunch and transport fees of children from low-income families, and The Business Times Budding Artists Fund, which supports artistically talented youth from less-privileged households.\n“For its 19th edition this year, we decided to spice things up – in this case, quite literally, with a musical dinner theatre featuring a delectable menu of Asian fusion food,” said Mr Wong Wei Kong, editor-in-chief of the English, Malay and Tamil Media Group at SPH Media Group.\n“But the heart of the event remains the same: A unique platform for nurturing young talents while raising funds for less-privileged children.”\nThe Straits Times editor Jaime Ho added: “With the rise in the cost of living, it is more important than ever that lower-income families get a leg-up.”\n2023’s ChildAid concert was held at the Singapore Chinese Cultural Centre on Dec 4.\nSet in a performing arts school in the 1930s, Mesra – A Musical Mystery steered the audience through more than two hours of song and dance, woven together by an unfolding mystery that guests were invited to help solve.\nCast members frequently went into the audience – which included Deputy Prime Minister Heng Swee Keat and SPH Media Trust chairman Khaw Boon Wan – chatting with them and inviting them to guess who had kidnapped a famous singer who disappeared during her performance.\nMr Heng, who was the guest of honour, said: “The dedication and enthusiasm displayed by these children touched the hearts of everyone present, and reflected the positive impact that our collective efforts can have on the lives of those in need.”\nSome 50 young talents between the ages of six and 19 sang, danced and acted their way through a medley of famous tunes – from P. Ramlee’s Getaran Jiwa to Meghan Trainor’s Made You Look.\nThe show opened with Downtown, a jaunty original composition by Yee Hong Shyan on the electone.\n“I was inspired by the feeling of driving down the road at midnight,” the 12-year-old said. “I wanted to compose something to mimic that feeling of freedom.”\nPerformers spent about a month rehearsing for the big day, but it was nearly all for naught for one singer.\nTara Puri, who had the daunting task of belting out Leonard Cohen’s Hallelujah, woke up with a sore throat a few days ago.\n“I was so worried. I was like, ‘No! I’ve worked so hard for this.’ But my mum told me, ‘You’ve got this.’”\nAnd thanks to her operatic training, the 12-year-old was indeed able to push through.\n“I’ve been trained to sing no matter what. So, I still have my vibrato, and I can control how nasal I sound.”\nMembers of the public can catch her performance, along with the rest of the concert, on ST’s YouTube page (str.sg/childaid23) from 6pm on Dec 8 until early March 2024.", "url": "https://www.straitstimes.com/life/childaid-2023-raises-over-2-million-with-interactive-musical-mystery"}