{"authors": ["Eddino Abdul Hadi"], "date_download": "2024-10-12 13:58:18", "date_modify": "2024-10-12 13:58:18", "date_publish": "2024-05-29 13:00:00", "description": "Hit Me Hard And Soft is the third album from Grammy-winning American singer-songwriter Billie Eilish. Read more at straitstimes.com.", "filename": "life_entertainment_life-listens-new-offerings-from-billie-eilish-the-oddfellows-zico-and-tommy-richman_1728741498.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/29/220Billie20Eilish.jpg?VersionId=kfP3z6ucI.fCVSkumTz0m3CDZrDGXi7h", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_life-listens-new-offerings-from-billie-eilish-the-oddfellows-zico-and-tommy-richman_1728741498.html", "title": "Life Listens: New offerings from Billie Eilish, The Oddfellows, Zico and Tommy Richman", "title_page": "Life Listens: New offerings from Billie Eilish, The Oddfellows, Zico and Tommy Richman | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The third and latest album by pop’s most precocious singer-songwriter reinforces the notion that Grammy- and Oscar-winner Billie Eilish is a young music star with an old soul.\nHit Me Hard And Soft – which debuted at No. 2 on the Billboard 200 chart as her highest-performing album yet with 339,000 units earned and more than 193 million streams – feels like it was meant to be experienced the old-school way before streaming took over: as a whole album in a single sitting.\nBittersuite, the chameleonic penultimate track, reinforces this by rewarding the listener with references to lines and themes present in the album’s earlier tracks.\nIt helps that this work, done with her usual collaborator and brother Finneas, is tightly edited. There are 10 songs and none of the tracks feel like they have outstayed their welcome.\nThe album title applies to the songs’ multifarious and adventurous aspects. The siblings prove once again that they are masters of the beat switch, which makes many of the tracks a compelling listen because your attention never strays.\nL’amour De Ma Vie (French for “the love of my life”) best exemplifies this with its organic jazz-inflected first half that morphs into an ultra-processed electronic pop banger in the second half.\nThere has been quite a bit of focus on Lunch’s explicitly queer lyrics, but 22-year-old Eilish covers a lot more ground on the rest of the tracks, from heartbreak to past trauma.\nThe Greatest, a slow burner that builds to a glorious finale, deals with unfulfilled expectations, while dark cabaret bop The Diner takes on the perspective of a stalker and delves into desperation and obsession. – Eddino Abdul Hadi\nMust-see MV: The Oddfellows – Stronger (Song For Jacq)\nThe new music video for Stronger (Song For Jacq) by veteran Singapore indie rock band The Oddfellows pays tribute to TNT Music Productions, a music studio that is closing down after 35 years.\nTNT owner K.K. Wong, affectionately known as Ah Boy, makes a cameo in the clip, which was filmed at the premises in Parklane Shopping Mall.\nThe studio played a significant role in the alternative rock boom in Singapore back in the 1990s, as it was where bands like The Oddfellows and hardcore stalwarts Stompin’ Ground held their practice sessions and made recordings.\nThe MV was directed by Syamsul Bahari, a member of home-grown punk band Circle Line Kid, and edited by The Oddfellows frontman Patrick Chng.\nA contender for pop music’s annual song of the summer title, Million Dollar Baby is a breakout hit that has put American singer-rapper Tommy Richman on the world map these past few weeks. Released in the last week of April, it quickly went viral, earning the top spot on Billboard’s TikTok chart.\nThe infectious hip-hop, funk and R&B banger is also making its mark on the mainstream, debuting at No. 2 on the Billboard singles chart on May 11.\nRichman’s solid falsetto and the song’s bouncy bassline have also helped it hit No. 1 in New Zealand and Australia. It currently sits at the top of Spotify’s global charts.\nWhile it may seem like Richman, who was born in Virginia, US, popped out of nowhere, he has been releasing songs since 2016.\nThe buzz around the 24-year-old picked up pace after modern R&B golden boy and fellow American singer Brent Faiyaz signed him to his label, ISO Supremacy, and brought Richman out on tour in 2023. – Eddino Abdul Hadi\nSingapore Scene: Music Lab podcast – rhyu\nThe singer, whose real name is Raine Hahn Yu, grew up with parents who are also singers. She started dabbling in writing and composing songs at the age of four.\nHer early influences were Mandopop artistes such as JJ Lin and A-mei, but her inspirations widened to include a range of acts such as American R&B singer Alicia Keys, the late American diva Whitney Houston and, of course, Laufey.\nThe artiste, who studied at School of the Arts Singapore, released her debut single Melt in 2022, a song that has since garnered close to a million streams on Spotify. She released her latest single, Quiet, in March, and is now working on an EP.\nListen to the Music Lab podcast, as well as rhyu’s live rendition of It’s Fine, at str.sg/Aqou – Eddino Abdul Hadi\nStream This Song: Zico – Spot! (featuring Jennie)", "url": "https://www.straitstimes.com/life/entertainment/life-listens-new-offerings-from-billie-eilish-the-oddfellows-zico-and-tommy-richman"}