{"authors": [], "date_download": "2024-10-12 13:59:52", "date_modify": "2024-10-12 13:59:52", "date_publish": "2023-12-07 03:02:01", "description": "Investigators are studying the complaint, from an actress who says the French star assaulted her in 2007. Read more at straitstimes.com.", "filename": "life_entertainment_actor-gerard-depardieu-accused-of-sex-assault-say-paris-prosecutors_1728741592.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/07/2017-09-05T152154Z1227451126RC1B94D8B960RTRMADP3FILMFESTIVAL-VENICE.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_actor-gerard-depardieu-accused-of-sex-assault-say-paris-prosecutors_1728741592.html", "title": "French actor Gerard Depardieu accused of sex assault: Prosecutors", "title_page": "French actor Gerard Depardieu accused of sex assault: Prosecutors | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - An actress filed a sexual assault complaint against Gerard Depardieu in September, prosecutors said on Dec 6, adding to a string of allegations targeting the French star.\nHelene Darras said that Depardieu assaulted her while filming a movie in 2007, Paris prosecutors said, confirming a report from broadcaster France 2.\nInvestigators were studying the complaint, which likely falls under France’s statute of limitations, to decide whether or not to launch a probe.\nDepardieu’s lawyer Christian Saint-Palais could not immediately be reached for comment.\n“It took me a year to go from talking about what happened (in the media) to the criminal complaint,” Darras told AFP.\n“Walking through the door of a police station, telling an officer someone touched your intimate parts, it’s not easy, you need time to think about it,” she added.\nThe actress told France 2 that Depardieu groped her when she was aged 26 and appearing as an extra in the film Disco (2008).\nHe “ran his hand over my thighs and my buttocks” then “said straight out: ‘Do you want to come to my dressing room?‘,” she added.\nDarras said she rejected his alleged advances, but “that didn’t change anything,” she went on. “He kept groping me between takes”.\nThe actress said she “couldn’t give a d***” if the allegations are too old to be investigated.\nDarras “wanted to respond to the defence that plays down our allegations by saying they’re ‘just’ witness accounts,” she told AFP.\nDepardieu in 2020 was charged in Paris after allegations of rapes and sexual assaults following a complaint by actress Charlotte Arnould.\nOther women have since accused Depardieu of sexual violence in the press.\nIn a letter to conservative newspaper Le Figaro in October, Depardieu insisted that he is “neither a rapist nor a predator”.\n“Never, but never have I abused a woman,” he wrote, saying that he would not be getting involved in “any projects” given the “context” of the allegations. AFP", "url": "https://www.straitstimes.com/life/entertainment/actor-gerard-depardieu-accused-of-sex-assault-say-paris-prosecutors"}