{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:56:12", "date_modify": "2024-10-12 13:56:12", "date_publish": "2023-09-07 13:00:00", "description": "Simone Jewels’ new gender-neutral jewellery, Marks & Spencer’s relaunches BraFit. Read more at straitstimes.com.", "filename": "life_style_simone-jewels-drops-gender-neutral-range-marks-spencer-s-relaunches-bra-fitting-service_1728741372.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/07/SimoneXTomo20Campaign20Image.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_simone-jewels-drops-gender-neutral-range-marks-spencer-s-relaunches-bra-fitting-service_1728741372.html", "title": "Style News: Simone Jewels’ gender-neutral range, Marks & Spencer’s relaunches bra-fitting service", "title_page": "Style News: Simone Jewels’ gender-neutral range, Marks & Spencer’s relaunches bra-fitting service | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Simone Jewels drops new genderless range\nLocal jeweller to the stars Simone Ng has collaborated with Japanese-American artist Tomoyuki Iwanami on a collection, part of Simone Jewels’ high jewellery line.\nInspired by the traditional art form of sumi-e, which is embodied by black ink paintings, the six-piece Simone x Tomo collection features monochromatic pieces crafted from various materials, including 18K gold, diamonds and natural black spinel.\nThe gender-neutral collection comprises rings, earrings and a bracelet, designed as ink splash motifs.\nThe United States-based artist often applies the sumi-e technique to his surfboard designs.\nMany of his projects also incorporate traditional Japanese techniques and media which he is fond of.\nHe says: “Like sumi-e, jewellery making requires attention to detail and the use of high-quality materials. Simone and I were inspired to merge these originalities to create a beautiful and meaningful collaboration collection.”\nPrices for the Simone x Tomo collection range from $880 for the Sumi Ear Stud to $7,800 for the Sumi Mono Ring. Book an appointment by calling 8886-4128. Go to www.simonejewels.com to view and shop the collection.\nMarks & Spencer’s improved lingerie section\nDid you know that you are supposed to be refitted for your bras every six months?\nMarks & Spencer has been offering bra fittings since 1975 and, to celebrate, the British multinational retailer has relaunched M&S BraFit, its expert service with a number of experienced bra advisers.\nThis free service is available at its new Lingerie Fitting Room in its Wheelock Place flagship store.\nA bra-fitting session can take up to half an hour. The fitters begin by taking precise measurements and asking your specific requirements. They will then curate a selection of bras that aligns with your needs and preferences.\nSpecialist bras such as nursing bras or post-surgery bras are also available and sizes are inclusive, going from cups A to H.\nAt the flagship store, you can also find vintage-inspired nightwear designed by London fashion label Ghost London, as well as Rosie Exclusively, the lingerie collaboration with British model Rosie Huntington-Whiteley.\nMarks & Spencer’s flagship store is at 01-01 Wheelock Place, 501 Orchard Road.\nTaiwanese make-up brand 1028 returns to Singapore\n1028, the leading cosmetics brand in Taiwan, is returning to the Singapore market after about four years. It was previously available through Hong Kong cosmetics chain Sasa, which announced it was closing its stores here in 2019.\nExpect products with great price-quality ratio, like its None Other Than Me Eyeshadow Palettes ($26.90). Its nine shades with buttery-smooth pigments can rival those of more expensive brands.\nOther highlights include the elderflower and shea butter-infused Dewy Kiss Cream Lipstick ($16.90) as well as the Extend Curl Mascara EX ($22.90), which is one of the best-selling mascaras in Taiwan, with its 3D polymer technology that is said to be able to hold the shortest and most sparse of Asian lashes.\nAll 1028 products are available exclusively in-store at Watsons or online at Watsons, Shopee and Lazada on the Mandom Official Store.\nShanghood launches capsule collection\nHome-grown streetwear brand Shanghood is celebrating its eighth anniversary with a limited-edition collection.\nIt features a fanny pack ($49.90) in black or white and a black T-shirt ($92) emblazoned with the word “hachi”, which in Japanese means eight and signifies good fortune, wisdom and intellect. A reusable bag is already sold out.\n“Being a trending fashion label, Shanghood has always been exploring new ideas to change the boundaries of a traditional fashion label ideology. As we continue to reinvent, we desire to bring fresh, exciting ideas and affordability to everyone, especially the younger consumers,” say Shanghood co-founders Jason Ng and Ruix Tan.\nThe anniversary collection is available on www.shanghoodwear.com", "url": "https://www.straitstimes.com/life/style/simone-jewels-drops-gender-neutral-range-marks-spencer-s-relaunches-bra-fitting-service"}