{"authors": ["Amanda Chai"], "date_download": "2024-10-12 13:48:50", "date_modify": "2024-10-12 13:48:50", "date_publish": "2024-05-30 17:30:00", "description": "In its 17th edition, Cartier's impact entrepreneurship programme invests in female-founded start-ups driving change. Read more at straitstimes.com.", "filename": "life_style_singapore-surgeon-and-other-female-changemakers-win-big-at-2024-cartier-women-s-initiative_1728740930.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/30/202420Cartier20WomenE28099s20Initiative20Awards20with20guest20presenter20Karlie20Kloss.jpg?VersionId=n8gCsutyhPQUZ9ff_Cv5VQAtePNpjcz4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_singapore-surgeon-and-other-female-changemakers-win-big-at-2024-cartier-women-s-initiative_1728740930.html", "title": "Singapore surgeon and other female changemakers win big at 2024 Cartier Women’s Initiative", "title_page": "Singapore surgeon and other female changemakers win big at 2024 Cartier Women’s Initiative | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHENZHEN, China – Last week, the gleaming metropolis of Shenzhen played host to hundreds of entrepreneurs from around the world.\nThey were gathered to celebrate the 2024 Cartier Women’s Initiative (CWI), French jeweller Cartier’s impact entrepreneurship programme which recognises and invests in female-founded start-ups driving change.\nAt the awards ceremony on May 22 at the Bay Opera of Shenzhen, CWI honoured 33 new fellows across nine regional awards and two thematic awards.\nAmong them was Singaporean fellow Lynne Lim, founder of medtech start-up NousQ, who clinched first place in the Science & Technology Pioneer Award category. Introduced in 2021, the award recognises disruptive solutions built around protected or hard-to-reproduce technological or scientific advances.\nIn her mission to tackle the medical condition known as glue ear, Dr Lim developed CLiKX – the world’s first handheld robotic device that allows doctors to conduct ear tube surgery with the click of a button, without the need for general anaesthesia or an operating theatre.\nShe is the initiative’s second Singaporean fellow, after CWI alumna Mint Lim, founder of social enterprise School of Concepts, who was awarded in 2023.\nThe 55-year-old ear, nose and throat surgeon said she is “grateful for the validation, recognition and lifelong community support” from CWI.\n“This amplifies NousQ’s quest to always focus on the patient’s voice. By simplifying surgery, we improve their affordability, access and safety.”\nShe had applied to CWI with the main aim of seeking mentorship. “When I started my company, I wanted to do impact work. But I didn’t know how to. I wanted to find a community that could support me so I could learn,” she told The Straits Times.\nShe could not believe it when she was selected as a fellow, after CWI’s application process which had five rounds of selection – “even more rigorous than my investors doing due diligence on me”, she said.\n“There are some life-changing moments and that was one of them,” she added.\nPlacing second and third respectively in the category were Ms Ninna Granucci from France, of Green Spot Technologies, which upcycles food waste through patented fermentation; and Ms Monika Tomecka from Scotland and Poland, whose company uFraction8 develops filter systems that help bio-manufacturers such as lab-grown meat producers produce sustainable food in energy-efficient ways.\nOpen internationally, the Science & Technology Pioneer Award is currently the most competitive category because of the volume and quality of applications, with a total of 234 applicants for the 2024 edition, said CWI’s global programme director Wingee Sin.\nEmpowering change\nIn its 17th edition, CWI was set up in 2006 to provide women impact entrepreneurs with financial, social and human capital to grow their businesses. These businesses address the United Nations’ Sustainable Development (UNSD) Goals – to improve lives, preserve the planet and create opportunities.\nAll fellows are given tailored mentoring and coaching, media visibility, networking opportunities and education courses from global business school Insead.\nCartier has also put money where its mouth is, awarding the first-, second- and third-place fellows US$100,000 (S$135,300), US$60,000 and US$30,000 in grant funding respectively.\nSince then, the number of fellows has swelled to 330 people, with a more than 300-strong community of business leaders, former jury members, mentors and investors supporting them.\nTo host 2024’s awards, Cartier chose Shenzhen for its prominence as an entrepreneur hub and its logistical infrastructure. The futuristic city, where roads teem with electric vehicles and pedestrians share overhead bridges with motorists, has earned a reputation in recent years as China’s Silicon Valley.\nOne in every five Shenzhen citizens is an entrepreneur, said Ms Sin.\n“The world would not progress if China was not also reaching the UNSD goals. China is critical for all of us. Shenzhen as an entrepreneur hub is critical in that equation,” she said.\nThe night kicked off with a performance by Zhejiang Conservatory of Music’s dance department and an opening address from Mr Cyrille Vigneron, chief executive and president of Cartier.\nAlso in attendance were guest speakers and presenters, American model Karlie Kloss – who runs a free coding camp for girls – and Chinese Olympic diving champion Guo Jingjing. They shared their experiences with entrepreneurship, and on finding success as women in the world.\nBut it was the female changemakers hailing from the nine regions who stole the spotlight.\nTheir diverse ventures addressed crucial issues across industries and geographies – from destigmatising cultural taboos to improving financial literacy for women to solving large-scale, region-specific fundamental needs such as food security.\nMs Park Ji-won from South Korea clinched the top prize in the East Asia category for her sexual wellness brand SAIB, which empowers women to take charge of their sexual and reproductive health with toxin-free, female-friendly contraceptives and intimate hygiene products in discreet packaging.\nShe founded the company after observing that in South Korea, a lot of misinformation, guilt and shame about carrying condoms is passed on from male partners.\nMeanwhile, Ms Claire van Enk from Kenya was awarded second place in the Anglophone and Lusophone Africa category for her company Farm To Feed. The start-up connects farmers to food-insecure communities, allowing smallholder farmers to sell surplus produce for additional income while feeding vulnerable communities.\nThe Cartier effect\nIn earlier roundtable interviews, many fellows agreed that they shared common pain points, such as gender bias in funding, and being put through more rigorous due diligence by investors than men.\nFunding is an important, yet neglected, piece of the puzzle for supporting a start-up’s growth, Ms Sin told ST.\n“The number one feedback that women entrepreneurs have is that they’re over-mentored but under-invested. We knew that just human capital support without financial support would not be useful – because who can scale a business with just mentoring?”\nEntrepreneurship data around the world has shown that more women are starting businesses, noted Ms Sin, who worked in venture capital before joining Cartier in 2019 to spearhead CWI.\n“But for some reason, these businesses are staying small and not reaching their full potential. We’re very focused on this segment of entrepreneurs who have at least one year of recurring revenue – which means their business is working in some dimension to solve for social or environmental change.\n“We hope that via our programme, they receive the type of support that will help them scale and create the impact they want to see, and from there attract external capital or be in a state of profitability where they don’t need it.”\nShe notes how past fellows have gone on to raise venture capital (VC) rounds of funding after being part of CWI.\nOne fellow from Egypt, retinal surgeon Noha Khater, used her US$30,000 grant to invest in product development and buy software for her business – which then snagged her a US$3 million round in VC funding.\nWhile there is no direct cause and effect the initiative can take credit for, these success stories show CWI’s impact in plugging the funding gap for women impact entrepreneurs, said Ms Sin.\nAccording to Cartier’s 2022 impact survey, 90 per cent of the businesses supported are still running and generating revenue.\nLasting change is difficult to exact quickly, but CWI has been growing in other ways, she added. The newer Diversity, Equity & Inclusion (DEI) Award, launched on a pilot basis in 2023, for instance, has been a work in progress in understanding how to support entrepreneurs creating DEI solutions.\nThe DEI Award is also the only category open to male founders.\n“The DEI ecosystem of businesses is quite nascent. The idea that you can solve DEI challenges via a business model and launch businesses that create greater accessibility, really seeing it as a market, is a more recent phenomenon,” Ms Sin said.\n“From the first two editions, we’ve learnt so much about representation and inclusion, and how to manage a fellowship and awards ceremony, taking into account accessibility challenges.”\nFirst place for the 2024 award went to Ms Sadriye Gorece from the United States, who founded BlindLook, an artificial intelligence-powered, audio-based platform that works with brands to make products and services comprehensible to the blind. Ms Gorece, who is visually disabled, wanted to create equality in daily living for the 285 million visually disabled people worldwide living independently.\nAnother new initiative introduced in 2024 is a pilot programme around parenthood. Aimed at supporting fellows in the early stage of parenthood or with young children, the programme provides them with a stipend to pay for childcare for the time spent participating in the year-long fellowship, while making elements of it more accessible for families.\nDespite Cartier’s commitment, there is still a long way to go in solving gender inequality, said Ms Sin.\n“I’m not sure we’ll have gender parity in the entrepreneurship ecosystem in my lifetime. The World Economic Forum estimates that it’ll take 130-plus years (before reaching) gender equality. And the biggest contributor to that gap is economic opportunity.”\nThe good news, she said, is that there is “a ripple effect of impact” in investing in women impact entrepreneurs.\n“This is why business should be a force for good. The truth is we have to be doing what we do for a very long time before we fix what we’re trying to change in the entrepreneurship world.”\nNousQ’s Dr Lim is most grateful for the community found in CWI.\n“First, second or third place wasn’t important to me. The fellowship was the important thing,” she said. “Now, I feel like I’m with this very brilliant group of people from around the world whom I can just WhatsApp and ask for help. That’s so amazing.”", "url": "https://www.straitstimes.com/life/style/singapore-surgeon-and-other-female-changemakers-win-big-at-2024-cartier-women-s-initiative"}