{"authors": ["Cherie Lok"], "date_download": "2024-10-12 14:03:34", "date_modify": "2024-10-12 14:03:34", "date_publish": "2024-06-13 11:30:00", "description": "Mashi No Mashi serves Singapore’s first 100 per cent wagyu ramen and a bak kut teh-inspired dish. Read more at straitstimes.com.", "filename": "life_food_food-picks-wagyu-ramen-at-mashi-no-mashi-kubo-pop-up-at-tipsy-hippo-italian-fare-at-luce_1728741814.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/13/yufoodpickscoll1206.jpg?VersionId=j.dOItFJh3FFEH2NUmJvfDUtHEqZrvkc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_food-picks-wagyu-ramen-at-mashi-no-mashi-kubo-pop-up-at-tipsy-hippo-italian-fare-at-luce_1728741814.html", "title": "Food Picks: Wagyu ramen at Mashi No Mashi, Kubo pop-up at Tipsy Hippo, Italian fare at Luce", "title_page": "Food Picks: Wagyu ramen at Mashi No Mashi, Kubo pop-up at Tipsy Hippo, Italian fare at Luce | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Mashi No Mashi\nThe new Guoco Midtown is fast becoming the go-to place for Japanese classics with a twist.\nThere is the now-viral Umai Artisanal Udon Bar, with its Miso Carbonara Udon ($19) and Himokawa Udon With Niku Shabu ($18) – both silky, luscious and worth the 30-minute wait you might have to face on a weekend.\nOr pop next door for a taste of Singapore’s first 100 per cent wagyu ramen, an offshoot of Japan’s famed members-only restaurant Wagyumafia. Mashi No Mashi promises succulent slices of premium beef and bowls of thoroughly slurpable noodles. It delivers on both counts.\nI skip the restaurant’s signature ultra wagyu ramen ($22) for the slightly more unconventional wagyu tsukemen ($30), and am rewarded with wholewheat noodles blanketed in beef, bamboo shoots, cabbage and a soft-boiled egg. You dip them in a stewed wagyu bone broth, thick with umami richness, and give thanks that the noodles have all the requisite bite and chew.\nJapanese chef-owner Hisato Hamada, who lived in Singapore for three years, also draws inspiration from local cuisine. The menu features his take on the classic bak kut teh, only – once again – sans pork. It instead features thick-cut wagyu brisket steeped in a peppery beef broth ($30). Don’t worry, it still comes with youtiao and white rice.\nWhere: 01-04 Guoco Midtown, 124 Beach Road\nMRT: Esplanade/Bugis\nOpen: 11am to 9.30pm daily\nInfo: mashinomashi.sg\nKubo pop-up at Tipsy Hippo\nFilipino chef Kurt Sombero has moved his restaurant Kubo from Robertson Quay to a pop-up concept at Tipsy Hippo, and he has taken his signature wood-fire cooking technique with him. You will now find him sizzling up a storm at the gastrobar at UE Square Shopping Mall, where Kubo is part of a limited-time pop-up.\nAmid the tropical chill of the Tiki-inspired decor, feast on vibrant dishes such as the five-spiced brisket sliders ($20 for three pieces), soya-glazed pork belly ($20), curry chicken and potatoes ($18) and Kubo’s fried chicken ($18). All come liberally seasoned and in various, delicious-looking shades of brown.\nThe highlight for me is the curry chicken and potatoes, which is topped with a crispy flatbread. Think of it as an elevated chicken pie, only with thicker, juicier chunks of chicken doused in a sweeter, more aromatic gravy.\nSpice fiends will miss the fiery punch, though. This is a curry that caresses rather than clobbers.\nIf you are looking for something with more bite, come in July for Sombero’s hot prawn cocktail ($18) instead. It is a dish with lots of flair: five prawns luxuriate in a coconut husk, surrounded by bright vegetation. The dish comes with a serving of flatbread, which can – and should – be used to mop up the delicious coconut curry.\nThe restaurant also has weekday lunch sets (from $12). Pick from six mains – including striploin with rice, fried chicken burger and KL Hokkien Mee.\nWhere: 01-15/16/17 UE Square Shopping Mall, 81 Clemenceau Avenue\nMRT: Fort Canning\nOpen: Noon to 1am, Mondays to Saturdays; noon to 11pm, Sundays\nInfo: tipsycollective.com/tipsyhippo\nLuce\nBuffets get a bad rep for their obscene amounts of middling food, but they can be lots of fun too. There is something uniquely thrilling about walking into a restaurant knowing you can have your pick of an endless line of meats, stews and soups, each more tantalisingly named than the last.\nItalian restaurant Luce, housed in InterContinental Singapore, invites diners on a gustatory tour of the Mediterranean, with brief pit stops in Asia. The buffet menu has been refreshed under the guidance of the restaurant’s new chef de cuisine Andrea Rossi, who hails from the northern Italian city of Ravenna.\nAnd like all good Italian meals, it starts with a respectable selection of cold cuts and cheeses. There is Parma ham, mortadella, salami, buffalo mozzarella and pecorino toscano, as well as various jams, nuts and dried fruit.\nLuce has an impressive array of proteins too, from mutton pepper masala to Australian Angus beef, which is carved upon request.\nThere are also Italian specialities such as oven-baked sea bass and baby pork ribs braised with red wine and wild mushrooms. All tasty enough but, as is the case with most buffets, none of it will really blow your mind.\nIf quality is what you are after, go for the a la carte options instead. The La Burrata Pugliese ($32) is a triumphant symphony of different notes: creamy Puglia burrata drizzled with aged balsamic and set on a bed of caramelised cherry tomatoes and pistachio pesto.\nThe freshly cooked pasta is also of a much higher standard than its buffet counterpart. In particular, L’Astice ($58) – ink tagliolini in a rich crustacean bisque, served with a plump lobster tail and a dollop of ikura – is decadence on a plate, though it could do with fewer kaffir lime leaves, which slightly overpower the broth.\nThe a la carte menu and the buffet are available for dinner daily and for lunch from Mondays to Saturdays (with a champagne brunch buffet on Sundays). A lunch buffet costs $29++ and $58++ for children and adults respectively. For children, the dinner buffet costs $39++ from Sundays to Thursdays and $44++ on Fridays and Saturdays, while adults pay $78++ and $89++ respectively.\nWhere: Level 1 InterContinental Singapore, 80 Middle Road\nMRT: Bugis\nOpen: Noon to 2.30pm, Mondays to Saturdays; 6 to 10pm daily; champagne brunch buffet (from $118 an adult) is available on Sundays from noon to 3pm\nInfo: singapore.intercontinental.com/dine/luce", "url": "https://www.straitstimes.com/life/food/food-picks-wagyu-ramen-at-mashi-no-mashi-kubo-pop-up-at-tipsy-hippo-italian-fare-at-luce"}