{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:56:26", "date_modify": "2024-10-12 13:56:26", "date_publish": "2023-01-12 08:00:00", "description": "Miss Zoe Gabriel was mocked by netizens for calling her dad's gift to her a \"luxury bag”. Read more at straitstimes.com.", "filename": "life_style_charles-keith-invites-viral-luxury-bag-tiktok-teen-to-meet-its-founders-tour-brand-s-headquarters_1728741386.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/12/rrck1201_7.jpg?VersionId=lA7RmzwaFnMokTch8iSTB4Ep_1qopNF.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_charles-keith-invites-viral-luxury-bag-tiktok-teen-to-meet-its-founders-tour-brand-s-headquarters_1728741386.html", "title": "Charles & Keith invites viral ‘luxury bag’ TikTok teen to meet its founders, tour brand’s headquarters", "title_page": "Charles & Keith invites viral ‘luxury bag’ TikTok teen to meet its founders, tour brand’s headquarters | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The TikTok teen who was shamed online for calling Charles & Keith a “luxury” brand will be having the last laugh.\nMiss Zoe Gabriel was mocked by some users after uploading a video on the social media platform on Sunday, thanking her father for gifting her her “first luxury bag” from the home-grown fashion brand and excitedly unboxing and modelling her new arm candy.\nThe black Double Handle Tote Bag is priced at $79.90 on Charles & Keith’s website, and is the most expensive bag she owns.\nThe 17-year-old, who told The Straits Times over e-mail her family moved to Singapore from the Philippines in 2010, replied to the trolls by posting a follow-up video in which she tearily explains her humble background and talks about privilege. She declined to say more about her parents.\nBoth clips have since gone viral, attracting 5.6 million views.\n“My family didn’t have a lot. We couldn’t buy things as simple as bread from BreadTalk… when we first moved to Singapore… Your comment spoke volumes on how ignorant you seem because of your wealth,” said the eldest of four siblings who is currently homeschooled, but will be graduating in a few months.\nZoe’s mature response did not just impress many viewers, but also the team from Charles & Keith.\nThe company’s spokesman told ST in an e-mail: “Our heart really went out to Zoe, but we were so impressed with (how gracefully) she handled the situation, displaying wisdom far beyond her years and values that resonated with us greatly.\n“Our founders believe that our products should spark joy, empower fashion lovers and give them confidence, something we believe she presented so eloquently in her video and for which we are so grateful.”\nCharles & Keith remained mum on whether it would sponsor any bags for her or collaborate with her, as urged by her online supporters.\nHowever, it has invited Zoe and her father to have lunch with its founders who, “coming from humble beginnings, were so inspired by her humility”. They also toured the Charles & Keith headquarters on Thursday.\nZoe said she was “very excited and grateful for the opportunity”.\nCharles & Keith was founded by brothers Charles and Keith Wong in 1996, who learnt about the business by working at their mother’s shoe store in Ang Mo Kio.\nStarting out as a humble outlet at the former Amara Shopping Centre, the brand morphed into a household name not long after, growing to more than 600 stores and employing about 4,000 people worldwide.\nIn 2011, French luxury giant LVMH acquired 20 per cent of the company, but the Wong brothers have since bought it back.\nThey were recently named in Forbes’ 2022 list of Singapore’s 50 Richest, with a net worth of about $1.04 billion.\nMany netizens said this viral incident highlights the ignorance of the privileged in Singapore.\nFund-raiser Ivy Wong, 31, who heard about the news on the radio, said it reminded her of a similar experience from her past.\nShe told ST: “When I was young, one thing on my wishlist on my blog was ‘Branded clothes like Topshop’. One netizen commented that it is not branded and ‘high street at most’. But Topshop was already beyond what I could afford.”\nShe added: “This incident highlights the blind spot of people who grew up with privilege and take it for granted. They can’t imagine what it is like for peers to grow up in a low-to-middle income background, much less poor.\n“However, it is also heartening to witness those who have called out the ignorance of people who shamed this teenager. They show awareness of inequalities that exist and do their part to level the playing field.”", "url": "https://www.straitstimes.com/life/style/charles-keith-invites-viral-luxury-bag-tiktok-teen-to-meet-its-founders-tour-brand-s-headquarters"}