{"authors": ["Amanda Chai"], "date_download": "2024-10-12 13:56:10", "date_modify": "2024-10-12 13:56:10", "date_publish": "2023-03-30 13:00:00", "description": "Chantecaille is also back with another philanthropic make-up collection. Read more at straitstimes.com.", "filename": "life_style_style-news-atelier-cologne-s-first-boutique-in-s-pore-new-brightening-serums-to-try_1728741370.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/30/Atelier20Cologne20Takashimaya20boutiquepic20credit20ATELIER20COLOGNE_1.jpg?VersionId=Pf2eARGt89hKXSAfpl4TViVV_vl__5Mh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-atelier-cologne-s-first-boutique-in-s-pore-new-brightening-serums-to-try_1728741370.html", "title": "Style News: Atelier Cologne’s first boutique in S’pore, new brightening serums to try", "title_page": "Style News: Atelier Cologne’s first boutique in S’pore, new brightening serums to try | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Atelier Cologne unveils first boutique\nFrench artisanal perfumery Atelier Cologne has set up shop in Singapore, with a boutique at Takashimaya Shopping Centre.\nDistributed in Singapore by Aura Prestige, the niche brand established in 2009 was previously available here only at multi-brand fragrance retailer Amaris.\nIts new boutique is housed alongside other niche brands in Aura Prestige’s portfolio such as Ex Nihilo and Roja Parfums.\nDiscover Atelier Cologne’s two perfume collections – Collection Absolue (from $115 to $230), and the more premium Collection Rare (from $190 to $380), which uses rarer and highly concentrated ingredients.\nTackle pesky pigmentation and discolouration with new spot treatments and brightening serums on the market.\nFirst up is Cle de Peau Beaute’s reformulated Concentrated Brightening Serum ($270), which now focuses on stabilising the skin’s microbiome balance to counteract skin dullness and achieve more uniform radiance.\nAn added Crystatune Complex in the new formula as well as intensive brightening ingredients such as tranexamic acid are said to target the formation of dark spots.\nFrom fellow Japanese skincare brand SK-II comes the new GenOptics Ultraura Essence (from $244 for 30ml), prompted by the discovery that sleep deprivation causes oxidative stress and yellow dullness in the skin.\nThe new proprietary blend in this brightening essence includes SK-II’s patented Pitera and SDL Pro – said to help reduce the appearance of yellowish dullness – and white lotus complex, which helps skin appear brighter.\nInfo: Cle de Peau Beaute and SK-II are available at their respective counters.\nChantecaille’s Wild Meadows make-up collection\nThe luxury beauty brand is back with another philanthropic make-up collection.\nWild Meadows rings in spring with fresh hues and flowery packaging, inspired by the first wildflower blooms after winter. The collection was created to support biodiversity via non-governmental organisation Villa Abbatis Cultural Association’s work preserving the wild spaces and landscapes of Romania.\nOn a visit to Villa Abbatis’ project restoring wildflower meadows amid threats of extinction due to agribusiness, Chantecaille founder Sylvie Chantecaille was struck by the beauty and biodiversity of the meadows, and felt compelled to help save them. A portion of the collection’s proceeds goes towards these efforts.\nWildflowers are translated to beautifully embossed powder blushes ($132) in two rosy shades – Apple Blossom and Anemone – named after flowers found in Transylvania’s Hartibaciu Valley, with florals and stones from the region depicted on the compacts.\nAlso in the collection is an eye quartet ($137) of gold, pink, mauve and taupe shades, for creating soft, shimmering eyeshadow looks. Round it up with three bright Lip Chic ($91) shades in the moisturising formula the brand is known for.\nInfo: Available at Chantecaille counters including Tangs at Tang Plaza, 310 Orchard Road.\nAldo breaks out colour for Spring\nStep out in bolder hues and add a pop of colour to your outfit with new shoes from Aldo.\nIn a departure from its usual collections, the footwear brand is highlighting mood-boosting, energetic tones for its Spring 2023 line-up. Choose from a selection of women’s shoes and handbags crafted in a mix of girlish pastels and vibrant candy colours.\nWith an expanded focus on versatile styles to suit a variety of aesthetics, designs range from strappy stiletto heels to chunky platform shoes, as well as flats and kitten mules. A small selection of handbags is included too. Prices range from $89 to $149.\nTo launch the collection, Aldo enlisted five notable content creators and tastemakers – Korean-American model and fashion blogger Irene Kim, American influencer Tinx, American basketball player Scotty Pippen Jr, Iraqi YouTuber Noor Stars and Indian musician Rishab Sharma – for a global campaign on embracing individuality and one’s authentic self.\nInfo: Available at Aldo stores including Bugis Junction, 200 Victoria Street, and Jem, 50 Jurong Gateway Road, and zalora.sg", "url": "https://www.straitstimes.com/life/style/style-news-atelier-cologne-s-first-boutique-in-s-pore-new-brightening-serums-to-try"}