{"authors": [], "date_download": "2024-10-12 14:05:56", "date_modify": "2024-10-12 14:05:56", "date_publish": "2018-05-18 13:25:32", "description": "Birkin bags, among the most highly coveted items in the luxury fashion world, are in the news again.  Read more at straitstimes.com.", "filename": "lifestyle_fashion_284-luxury-handbags-seized-from-najib-linked-apartments-5-things-about-the-hermes_1728741956.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2018/05/18/bp_birkin_180518_79.jpg?VersionId=cyv1Y5Sm7o.rkKXWx.8cmXi8ZE92np4t", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/lifestyle_fashion_284-luxury-handbags-seized-from-najib-linked-apartments-5-things-about-the-hermes_1728741956.html", "title": "284 luxury handbags seized from Najib-linked apartments: 5 things about the Hermes Birkin bag", "title_page": "284 luxury handbags seized from Najib-linked apartments: 5 things about the Hermes Birkin bag | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Birkin bags are in the news again. On Thursday night (May 17), Malaysian police raided three apartments in a luxury Kuala Lumpur condominium owned by former prime minister Najib Razak's family.\nA total of 284 boxes containing luxury handbags - including dozens and dozens of orange boxes holding Hermes Birkin bags - were loaded into trucks and carted away. Several of the orange boxes were tagged with photographs of different Birkin bags, with descriptions such as \"Brown Ostrich\".\nMadam Rosmah Mansor, Datuk Seri Najib's wife, is known for her love of Birkin bags. Over the years, stories and images have been published showing her carrying Birkins of different hues.\nIt was reported that she bought a US$200,000 (S$270,000) crocodile Birkin bag in 2015. Her aide denied it. A recent New York Times article (May 15), however, quoted a broker who estimated that the value of her Hermes Birkin handbag collection was worth at least US$10 million.\nHere are five things to know about the handbags, among the most highly coveted items in the luxury fashion world.\n1. YOU CAN'T JUST WALK INTO A HERMES STORE AND BUY THEM\nOnly a few pieces of Birkin bags are produced annually and there is no fixed schedule as to when they are sent to the stores.\nThe alternative is to buy them off the secondary market and auction houses, where they are even pricier because of the bag's high investment value.\n2. A RARE MODEL WAS AUCTIONED FOR HK$2.98 MILLION IN HONG KONG\nSo what's the big deal about these bags? Fans rave about the blemish-free quality of the leather, the gleam of the hardware and the meticulous construction. They also come in many colours and sizes, and hold their value. And, of course, the status attached to being able to afford - or be gifted - such a luxury.\nA diamond-encrusted Niloticus Crocodile Himalaya Birkin 30 was auctioned off at HK$2.98 million (S$510,000) at Christie's late last year, making it the most expensive handbag ever sold at an auction.\nThe buyer was not named, but was said to be from outside of Asia.\nIn 1984, late Hermes chairman and artistic director Jean-Louis Dumas created the bag for British-French actress, singer and model Jane Birkin after she told him that she had trouble finding the ideal weekend leather bag.\nIn 2015, Birkin asked for her name to be removed from the bag after animal rights group People for the Ethical Treatment of Animals (Peta) alerted her to the cruel slaughtering process that crocodiles went through for the production of the bags.\nShe allowed Hermes to keep using the name after the company conducted an investigation and identified the the cruel practices as an \"isolated irregularity\".\n4. A SINGAPOREAN HAS ONE OF THE WORLD'S LARGEST BIRKIN BAG COLLECTION", "url": "https://www.straitstimes.com/lifestyle/fashion/284-luxury-handbags-seized-from-najib-linked-apartments-5-things-about-the-hermes"}