{"authors": ["Arissa Ha"], "date_download": "2024-10-12 13:56:54", "date_modify": "2024-10-12 13:56:54", "date_publish": "2023-04-20 11:15:00", "description": "What are the potential dangers that come with blending a bespoke skincare concoction? Read more at straitstimes.com.", "filename": "life_style_blend-your-own-skincare-cocktail-at-your-own-risk_1728741414.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/20/iStock-1329040022_2.jpg?VersionId=185Y3zrZLUCZfKJYk1AlkUjOyNe.NsKL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_blend-your-own-skincare-cocktail-at-your-own-risk_1728741414.html", "title": "Blend your own skincare cocktail at your own risk", "title_page": "Blend your own skincare cocktail at your own risk | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "This article first appeared in Harper’s Bazaar Singapore, the leading fashion glossy on the best of style, beauty, design, travel and the arts. Go to harpersbazaar.com.sg and follow @harpersbazaarsg on Instagram; harpersbazaarsingapore on Facebook. The April 2023 issue is out on newsstands now.\nA pump of serum, a drop of AHA or alpha hydroxy acid, a dollop of moisturiser – creating your own skincare cocktail sounds like fun and games, until it is not.\nWith consumers becoming more savvy about ingredients, thanks to social media like TikTok and Instagram, mixing up your own skincare brew has grown in popularity. But there is always an inherent risk, especially since the content creators providing these tips are not skincare experts, doctors or chemists.\nWithout a proper understanding of skincare formulations, mixing your own skincare cocktail can do anything from nullifying the efficacy of the ingredients, to irritating and burning your skin.\nAccording to co-founder Shinji Yamasaki of Japanese skincare brand Re:erth, the biggest problem with skincare cocktails is that you just do not know how the mixture will turn out.\n“There is no way to guarantee specific ingredients won’t negatively interact with others, let alone negatively interact with your skin,” he says. “What many don’t realise is that formulating a product is a highly technical undertaking, requiring a deep understanding of chemistry and molecular structure. Professional formulators specialise in creating these products, taking into consideration the molecular interaction and balance of each ingredient within the formulation.”\nReiterating the point of leaving it to the experts, Dr Rachel Ho, medical director at La Clinic, says: “Mixing a skincare cocktail at home in the palm of your hand or in a bowl with a spatula is different from skincare made in a laboratory, which uses a cosmetic mixer under sterile conditions to get a homogenous product.\n“Mixing products on your own can result in unequal distribution of the individual components, and this can affect the effectiveness of the product applied to your skin.”\nMixing skincare products at home also raises hygiene concerns. Beauty educator and make-up artist Larry Yeo warns that the preservatives in different products can also be disrupted when they are mixed.\n“It can encourage germs, harmful bacteria and mould to grow in your products,” he says.\nThis increases your risk of inflammation or infection.\nSkincare products are also made with myriad ingredients, including surfactants, humectants and texturising agents, on top of skincare actives.\nMixing incompatible products can result in the product separating or a change in texture in the final skincare cocktail that affects the sensorial experience.\nWhen you apply it on your skin, it can trigger another set of issues. Without knowing the concentration of ingredients in the different products you mix together, you may accidentally pile on too many actives.\nDr Melvin Tan of Epion Clinic cautions: “Exfoliants like AHAs, BHAs and retinol can cause irritation and sensitivity, especially when combined with drying active ingredients like vitamin C and benzoyl peroxide.”\nDr Ho adds: “Combining exfoliating acids (like AHA) and retinoids together can transiently damage the skin barrier and cause irritant contact dermatitis.”\nWhile some reactions are immediate – in the form of redness or itching, or blistering or even burns in more serious case – other types of skin injury can take longer to appear.\n“There is a potential for delayed effects such as a weakened skin barrier, deeper skin damage and increased pigmentation,” observes Mr Yamasaki.\nSkincare products undergo rigorous testing to ensure the compatibility of ingredients within its formulations, stress-testing them against conditions such as light, heat and time, not to mention ensuring compliance with strict health and safety standards.\nSkincare formulations go through rounds of testing and tweaks to the formulation, sometimes over a few years before they eventually go on the market.\nRe:erth’s Multi-targeted Elixir reportedly went through over 30 iterations before Mr Yamasaki felt that the formulation “ticked all the boxes”.\nWith a do-it-yourself skincare cocktail that has not been prepared by a cosmetic chemist, the quantity and concentration of the ingredients have never been tested for safety or efficacy, making it just a dubious goop that you slather on your face.\nWhere does that leave people? Skincare experts unanimously agree that people should avoid making their own skincare cocktails.\nMr Yamasaki emphatically opposes the idea, saying: “I strongly believe that if a product is properly formulated, there should be no need for tools, devices or mixing with other products.”\nDr Ho reiterates: “You never really know how the ingredients can interact with each other to affect the safety, effectiveness and stability of the product.”\nInstead, she suggests looking for products that offer multiple benefits or products that contain several active ingredients, layering your skincare as needed.\nAlternatively, turn to skincare brands which have created products that are meant to be mixed together. Take, for example, Skin Inc’s My Daily Dose Custom-Blended Serum Cocktail – active ingredients, such as niacinamide, licorice and vitamin C, are suspended in capsules within a hydrating base, and are designed to work synergistically with one another.\nYour bespoke serum will be based on the results of an online skin-assessment, which identifies three ingredients best suited to your skin’s needs.\nKiehl’s also offers its own version of a customised skincare solution called Apothecary Preparations, where a trained beauty adviser goes through your concerns in person, and recommends two out of its five complexes.\nAt home, you add these to a hydrating base composed of 35 per cent squalane and 20 per cent skin lipid complex. That way, you can still scratch the itch of concocting your own skincare cocktail with products that are actually designed to be mixed – without running the risk of damaging your skin.", "url": "https://www.straitstimes.com/life/style/blend-your-own-skincare-cocktail-at-your-own-risk"}