{"authors": ["Jan Lee"], "date_download": "2024-10-12 13:30:04", "date_modify": "2024-10-12 13:30:04", "date_publish": "2024-09-16 16:15:00", "description": "The management trainee says he is the first Singaporean to appear on a Chinese dating show. Read more at straitstimes.com.", "filename": "life_entertainment_singaporean-jaryl-tan-25-looks-for-love-on-chinese-dating-variety-series-let-s-fall-in-love_1728739804.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/16/hztan160924.jpg?VersionId=jnr4gDShdl9mrK9_GKCJWuk6SR9L8sEs", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_singaporean-jaryl-tan-25-looks-for-love-on-chinese-dating-variety-series-let-s-fall-in-love_1728739804.html", "title": "Singaporean Jaryl Tan, 25, looks for love on Chinese dating variety series Let’s Fall In Love", "title_page": "Singaporean Jaryl Tan, 25, looks for love on Chinese dating variety series Let’s Fall In Love | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A Singaporean man who is looking for love has taken his search all the way to China.\nIn the sixth season of the Chinese dating variety series Let’s Fall In Love, which premiered on Chinese streamer Youku in China on Sept 10, one of the contestants is Jaryl Tan from Singapore.\nIn a TikTok post on his account, the 25-year-old uploaded several clips of his appearance on the show and called himself “the first true-blue Singaporean on a Chinese dating variety (show)”.\nIn one clip, he introduces himself as Chen Kang, but tells the other contestants that they can call him Kang Kang or Jay.\nHe adds: “I’ve been in three relationships, which added up to a total of five years. I think I’m quite a loyal person – all my past relationships have lasted more than a year. I’m not good at talking, and I look like someone who is slow to warm up to others. I’m the kind who gets more tongue-tied the more I like someone.\n“Being romantic is definitely not my forte, but when I’m in love, I want to see my partner every day, many times a day. So let’s start by taking a stroll on the beach together?”\nIn interviews with local media outlets, Tan said he is working as a management trainee in the supply chain industry, and graduated with a bachelor’s in commerce, international business and marketing from the University of Sydney in Australia.\nHe also runs a travel community page on Instagram called offthegrid.sg.\nTan said he adopted the English name Jay so that it will be easier for the other Chinese contestants to pronounce.\nIn several follow-up TikTok posts, Tan – who speaks Mandarin fluently and without a strong Singaporean accent on Let’s Fall In Love – explained to netizens who asked if he was born in China that he is Singaporean, with a Singaporean father and a Chinese-Malaysian mother.\nHe said he was scouted to be on the show through a private message sent to him via the Chinese social media platform Xiaohongshu. He also posted a screenshot of the message, which appeared to be from a director of Let’s Fall In Love, who explained that he “fit the vibe” of contestants the show was looking for.\nTan added that he grew up speaking Mandarin at home and learnt to “neutralise” his Singaporean accent when he made friends with Chinese international students during his university days in Australia.", "url": "https://www.straitstimes.com/life/entertainment/singaporean-jaryl-tan-25-looks-for-love-on-chinese-dating-variety-series-let-s-fall-in-love"}