{"authors": ["Chantal Sajan", "Teo Kai Xiang"], "date_download": "2024-10-12 13:32:02", "date_modify": "2024-10-12 13:32:02", "date_publish": "2024-03-29 12:00:00", "description": "Design News is a regular column on developments in architecture and design. Read more at straitstimes.com.", "filename": "life_home-design_design-news-gardens-by-the-bay-s-night-sakura-display-and-powerpuff-girls-25th-anniversary_1728739922.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/29/Night20view20of20Sakura20Blossom20into20the20Night2028729.20Image20credit20to20Gardens20by20the20Bay.jpg?VersionId=7Oi5ZooYKgSwkr.MBil5ceHXhc2pFdLC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_home-design_design-news-gardens-by-the-bay-s-night-sakura-display-and-powerpuff-girls-25th-anniversary_1728739922.html", "title": "Design News: Gardens by the Bay’s night sakura display and Powerpuff Girls’ 25th anniversary", "title_page": "Design News: Gardens by the Bay’s night sakura display and Powerpuff Girls’ 25th anniversary | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "View cherry blossoms from day to night\nFor the first time, visitors to the much-anticipated Sakura floral display at Gardens by the Bay will be able to take in the beauty of cherry blooms from day to night.\nThe installation at the ninth Sakura floral display at the Flower Dome evokes the traditional charms of the Japanese city of Kyoto with a yozakura (night sakura) viewing experience.\nThere are about 140 cherry blossom trees showcasing more than 40 varieties, including crowd favourites such as Prunus Accolade, known for its abundant clusters of pink blooms; and Prunus Kiku Shidare, with its distinctive weeping form.\nTrees are specially lit for the yozakura effect. There are also light projections designed to appear only when the sky starts to darken.\nOne of the highlights is a replica of the city’s grand Kinkakuji Temple, where visitors are invited to step in and imagine what it feels to be inside the actual Zen Buddhist landmark, which is a Unesco World Heritage Site.\nThe essence of life in Kyoto is also conveyed through a traditional thatched house reminiscent of picture-postcard ones from Miyama, a village known for its old-world charm.\nGardens by the Bay’s chief executive Felix Loh says that the affection that Singaporeans have for Japanese culture has made the Sakura floral display “a beloved event”.\nHe adds: “Together with the Japanese cultural fringe programmes and the much-anticipated return of Anime Garden, this year’s sakura season promises to be an exciting and unforgettable one.”\nInfo: Go to gardensbythebay.com.sg\nPop Mart and Crybaby celebrate 25 years of The Powerpuff Girls\nTo celebrate The Powerpuff Girls’ 25th anniversary, toy company Pop Mart teamed up with Thai artist Molly Yllom, known as Crybaby, for a merchandise launch in Singapore.\nThis collaboration features the cartoon trio – Blossom, Bubbles and Buttercup – reimagined through Crybaby’s lens and style. The March 23 event also marked the artist’s first Singapore fan meet.\nA 3D Crybaby x The Powerpuff Girls photo spot has been placed at the Pop Mart store at Level One, Plaza Singapura for fans to immerse themselves in the anniversary celebration.\nPop Mart has also announced a new Singapore membership programme, allowing customers to rack up points for every dollar spent, redeemable against future purchases.\nThe Crybaby x The Powerpuff Girls series introduces 12 figurine designs, a secret design and an assortment of accessories echoing themes of bravery, vulnerability and authenticity. Highlights include a TV Set Luminous Display Container and various blind box collectibles.\nCrybaby says that, as an artist, her collaboration with The Powerpuff Girls is a dream come true.\n“It’s about embracing our true emotions, recognising that vulnerability doesn’t diminish strength, and understanding that it’s okay to show our tears and sadness.”\nInfo: Go to www.popmart.sg\nHaworth blends style and sustainability with new office seating\nOffice furniture manufacturer Haworth International has launched its new Zody II and Zody LX models of sustainable and ergonomic office chairs.\nDesigned for modern workspaces, Zody II and Zody LX are task chairs which prioritise environmental sustainability.\nThe new models feature recycled materials aimed at extending their lifecycle and facilitating material recovery.\nTheir sustainability credentials include the Indoor Advantage Gold and Greenguard Gold industry certifications, which indicate a product with low chemical emissions.\nThe Zody II and Zody LX chairs’ dual posture modalities are engineered for ergonomic support across various postures and body types, from seated to standing transitions. The Zody LX also offers a versatile aesthetic suitable for both office and home settings.\nNotable features of both models include advanced lumbar support systems for spinal alignment and dynamic reclining to encourage natural movement and minimise fatigue.\nHaworth, founded in 1948 and based in Michigan, the United States, operates in more than 150 countries through a global network of 400 dealers and 8,000 employees.\nInfo: Go to www.haworth.com", "url": "https://www.straitstimes.com/life/home-design/design-news-gardens-by-the-bay-s-night-sakura-display-and-powerpuff-girls-25th-anniversary"}