{"authors": ["Amanda Chai"], "date_download": "2024-10-12 13:55:59", "date_modify": "2024-10-12 13:55:59", "date_publish": "2023-11-30 16:30:00", "description": "Check out waxing chain Strip's 21st birthday celebrations for a chance to win plane tickets. Read more at straitstimes.com.", "filename": "life_style_style-news-jazz-club-pop-up-by-ralph-lauren-fragrances-holiday-ready-styles-from-akinn_1728741359.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/30/Ralph27s20Club20From20Singapore20to20New20York20pop-uppic20credit20RALPH20LAUREN.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-jazz-club-pop-up-by-ralph-lauren-fragrances-holiday-ready-styles-from-akinn_1728741359.html", "title": "Style News: Jazz club pop-up by Ralph Lauren Fragrances, holiday-ready styles from Akinn", "title_page": "Style News: Jazz club pop-up by Ralph Lauren Fragrances, holiday-ready styles from Akinn | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Ralph Lauren Fragrances presents jazzy pop-up\nBe transported to a New York jazz club at this latest immersive installation.\nUntil Dec 10, Ralph Lauren Fragrances has taken over the Event Plaza at Marina Bay Sands to stage a multisensory pop-up spotlighting its new scent, Ralph’s Club Elixir ($248 for 75ml).\nIn a moody, all-black setting, Ralph’s Club: From Singapore To New York takes visitors on a journey through five interconnecting rooms that tell the story of the fragrance.\nTo begin, The Elevator Room transports you to the rooftop of a sleek nightclub in the heart of downtown Manhattan, complete with a panoramic backdrop of the city skyline.\nAt The Olfactive Bar, you can discover signature notes of the scent – lavandin, clary sage and patchouli – via interactive consoles in the shape of Ralph’s Club bottles.\nThen comes the glamorous Ralph Lauren Fashion Walkway, which showcases dapper ensembles from the Ralph Lauren Purple Label and Ralph Lauren Holiday 2023 collection in a runway set-up.\nMore photo opportunities follow at the Center Stage, along with a fragrance profiling experience. After that, you can redeem a sample vial of a Ralph’s Club fragrance at the final VIP Lounge. Cap it off with a photo at the digital photo booth for another keepsake of the day.\nInfo: Till Dec 10, from 10am to 10pm, at Event Plaza, Marina Bay Sands, 10 Bayfront Ave\nHoliday-ready threads from Akinn\nCelebrated Singaporean designer Wykidd Song has released his largest collection yet for Akinn, his label of timeless womenswear founded in 2019.\nNamed City Layers, the collection has a line-up of well-crafted designs with a focus on fit, function and daring colours.\nThe designer, best known as one-half of former fashion label Song + Kelly, drew from his archives to reinterpret conservatism with an edge.\nFor instance, the Sofia ($249) single-seam sheath dress, from his collections in 1999, returns in two new seasonal colours. Its scrunched design sits comfortably on the hip to transition easily from the office to dinner.\nThe Xia Overlap Vest Top ($189) is another archive-inspired piece – a simple yet flattering top cut from one continuous piece of Tencel, revisited in two new colours.\nShopping for a dress for your upcoming holiday parties? The Sara V-Neck Fit & Flare Micro Pleated Dress ($259) comes in a festive Kelly green shade perfect for hosting duties. For long-term versatility beyond the holidays, go for the Andi Deep V-Neck Fit & Flare Dress ($289).\nInfo: Available by appointment only at Akinn’s studio at 02-05, 36 Armenian Street, and akinn.com\nStrip’s 21st birthday promotions\nIn the blink of an eye, home-grown waxing powerhouse Strip has turned 21.\nFounded in 2002 under the Spa Esprit Group, Strip is best known for having led the conversation in grooming and intimate care in Singapore and beyond, when it was still a taboo topic. The salon chain is now in 12 major cities across the globe, such as Shanghai.\nTo celebrate, Strip has launched a specially formulated Birthday Wax, available exclusively till the end of December. Customers can opt for the aromatic hard wax with its sweet scent of warm vanilla, sugar and cream, which was formulated for the sensitive Brazilian area.\nStrip is also running a Grand Birthday Raffle with three pairs of plane tickets up for grabs to Hong Kong, Bangkok or Ho Chi Minh City. Every receipt (with no minimum spending) until Dec 31 qualifies you to one chance at the raffle. Winners will be announced on Jan 5.\nWhile you are at the brand’s new store at Ion Orchard (B3-28), check out its newest treatment. The Thermal Face Lift is a non-surgical treatment for facial rejuvenation, and – depending on where you target – is said to help achieve a more defined jawline, reduced double chin and firmer neck.\nRadio frequency energy and heat are used to activate the rebuilding of new collagen and elastin in the deeper layers of the skin, which helps with long-term firming. Prices start at $220.01 for a single session targeting laugh lines.\nInfo: strip.com.sg/strip21\nNishane launches 10th anniversary collection\nLovers of niche fragrances already know Nishane, or at least one of its most viral scents, Wulong Cha.\nThe artisanal perfumery brand from Istanbul turns 10 in 2023 and is celebrating with a capsule reimagining five of the brand’s most beloved scents. All Nishane perfumes are an extrait de parfum concentration and unisex.\nThe X Collection (from $343 for 50ml) presents enhanced versions of Ani, Fan Your Flames, Hacivat, Hundred Silent Ways and Wulong Cha. Ani X already has a growing following online, for its more complex take on the original citrus and vanilla scent.\nWulong Cha X retains the signature freshness of the original – first introduced in 2015, taking inspiration from the tranquil tea gardens of the Far East – while bringing in an elegant floral accent and amping up the tea scent.\nInfo: Available at amarisbeauty.com and Amaris boutiques including 03-10/11 Paragon, 290 Orchard Road\nSooryehan launches The Black collection\nThe never-ending quest for eternal youth continues, with a new early anti-ageing skincare and make-up range from South Korean beauty brand Sooryehan.\nRooted in Korean traditional medicine and complemented with modern dermatological technology, the brand is part of the massive LG Household & Healthcare Group portfolio.\nThe Black is its new line powered by patented “black” ingredients – Black Licorice Single EX, Black Yeast and Black Exosome – which are said to act as the first barrier of defence for preventative ageing.\nThese bio-ingredients were patented after the company discovered yeast found on orchids that form a film to protect damaged petals.\nThe products are said to help tackle hidden and visible signs of ageing, while restoring balance and adding moisture to the skin.\nThe full routine includes the Amino Cleansing Foam ($38), Single Essence Treatment ($58), Serum ($98), Essence Moisturiser ($68), Exopert Cream ($98) and Tension Fit Mesh Cushion SPF50+/PA+++ ($67), a lightweight mesh cushion foundation in two shades.\nInfo: Available at selected The FaceShop – Nature Collection stores, including B1-26/27 Plaza Singapura, 68 Orchard Road", "url": "https://www.straitstimes.com/life/style/style-news-jazz-club-pop-up-by-ralph-lauren-fragrances-holiday-ready-styles-from-akinn"}