{"authors": ["Eunice Quek"], "date_download": "2024-10-12 14:05:05", "date_modify": "2024-10-12 14:05:05", "date_publish": "2024-06-06 12:35:00", "description": "Expect Penang hawker favourites such as assam laksa and char kway teow. Read more at straitstimes.com.", "filename": "life_food_penang-branded-traditional-streetfood-hawker-event-to-run-buffet-from-june-7-to-9-at-mandala-club_1728741905.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/06/wgt-penang-060624.jpg?VersionId=SeOEhZWlQwx1a6aqOS_DJQ9UENoqI5LU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_penang-branded-traditional-streetfood-hawker-event-to-run-buffet-from-june-7-to-9-at-mandala-club_1728741905.html", "title": "Penang Branded Traditional Streetfood hawker event to run buffet from June 7 to 9 at Mandala Club", "title_page": "Penang Branded Traditional Streetfood hawker event to run buffet from June 7 to 9 at Mandala Club | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Calling all Penang food lovers.\nGet your fix of popular hawker food from the Malaysian state at a new buffet event called Penang Branded Traditional Streetfood, or Penang BTS.\nIt runs from June 7 to 9 (two-hour sessions for lunch and dinner) at Mandala Club at 31 Bukit Pasoh Road. Prices start at $73++ (adult) and $48++ (child). The 7.30pm dinner slot on June 7 is sold out.\nSix of Penang’s famed hawker brands are headlining the event, which is supported by the Malaysia Tourism Promotion Board and sponsored by the internationally renowned Penang-born Lingham & Sons, known for its Lingham’s Chilli Sauce.\nThe hawker dishes include Awesome Char Koay Teow from Penang’s Tanjung Bungah suburb, for its wok hei-laden fried noodle dish with prawns; and assam laksa from the 118-year-old Kek Seng Cafe in George Town’s Jalan Penang.\nOther highlights include the second-generation Ah Soon Kor Hokkien Mee from Jalan Macalister – known for its prawn noodles with a spicy prawn and meat broth – as well as Brothers Duck Meat Koay Teow Th’ng from Pulau Tikus Wet Market, famed since 1983 for its bouncy rice noodles topped with succulent duck slices.\nBib Gourmand-rated Nonya institution Moh Teng Pheow Nyonya Delights off Chulia Street debuts a new Nyonya salad here, while Grandpa Ong Penang Chee Cheong Fun from Jalan Trengganu offers its local variation of the regional dish with a unique combination of chilli sauce, sweet sauce and “hei ko” (prawn paste) infused with peanut butter.\nAll the hawkers are here for the event, except Grandpa Ong Penang Chee Cheong Fun.\nThe buffet spread also showcases other Penang favourites such as rojak and bee koh moy (black glutinous rice dessert), as well as original tau sar pneah and nutmeg juice from traditional food manufacturer Cheong Kim Chuan.\nThe selection of hawkers was curated by a three-person panel of hawker food connoisseurs from Penang, says Ms Irene Boay, chief executive of Branded Traditional Streetfood Enterprise, which runs Penang BTS.\nBranded Traditional Streetfood Enterprise was founded in 2022 to showcase hawkers and recipes from Malaysia through international pop-up events, with Penang BTS being the first.\nShe adds: “We created Penang BTS to provide a platform for hawkers who may be well-known locally, but deserve recognition worldwide.\n“We eventually hope to showcase famous hawkers from the rest of Malaysia through events that not only provide guests with easy access to a variety of dishes, but also pay homage to the long history of hawker culture in Malaysia.”\nFor more information and reservations, go to penangbts.com", "url": "https://www.straitstimes.com/life/food/penang-branded-traditional-streetfood-hawker-event-to-run-buffet-from-june-7-to-9-at-mandala-club"}