{"authors": [], "date_download": "2024-10-12 13:55:07", "date_modify": "2024-10-12 13:55:07", "date_publish": "2023-11-07 13:00:00", "description": "The long-awaited My Name Is Barbra hits shelves on Tuesday. Read more at straitstimes.com.", "filename": "life_entertainment_barbra-streisands-new-memoir-says-shes-still-hurt-by-insults-over-looks_1728741307.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/07/dw-streisand-231107.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_barbra-streisands-new-memoir-says-shes-still-hurt-by-insults-over-looks_1728741307.html", "title": "Barbra Streisand's new memoir says she's still hurt by insults over looks", "title_page": "Barbra Streisand's new memoir says she's still hurt by insults over looks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – American superstar Barbra Streisand is capping her storied career with a nearly 1,000-page memoir out on Tuesday, musing on her childhood, Broadway breakout and storied Hollywood love life.\nThe long-awaited My Name Is Barbra hits the shelves on Tuesday, with the 81-year-old artiste and Egot winner – that is Emmy, Grammy, Oscar and Tony – dishing on her decades in the entertainment business.\nAcross 992 pages, Streisand, beloved for her voice as well as her myriad acting roles, including Funny Girl (1968), The Way We Were (1973) and A Star Is Born (1976), discusses the pressures of the industry and double standards for women artistes.\n“Sometimes I felt like my nose got more press than I did,” she writes.\n“I wish I could say none of this affected me, but it did. Even after all these years, I’m still hurt by the insults and can’t quite believe the praise,” writes Streisand in excerpts published in People magazine.\n“I guess when you become famous, you become public property. You’re an object to be examined, photographed, analysed, dissected... and half the time I don’t recognise the person they portray. I’ve never gotten used to it, and I try to avoid reading anything about myself.”\nShe also discusses her high-profile romances with former husband, American actor Elliott Gould – with whom she shares a son, Jason – as well as late American actor Marlon Brando and Canada’s former prime minister Pierre Trudeau.\n“Deep down, I, too, wanted romance, but I had let my work take over. I tended to use work as a substitute for relationships,” she writes.\nFor a quarter-century now, she has been married to American actor James Brolin, 83.\n“Jim and I met at a point in my life when I had basically given up on finding someone. And frankly, I was all right with being on my own. I had my son, I had great friends to keep me company, my work was fulfilling, and I loved my new house in Malibu overlooking the ocean,” she writes.\nIn doing press for the memoir, Streisand has said penning her life’s story has been the only way to have some control over her life.\n“This is my legacy,” she told the BBC. “I wrote my story. I don’t have to do any more interviews after this.” AFP", "url": "https://www.straitstimes.com/life/entertainment/barbra-streisands-new-memoir-says-shes-still-hurt-by-insults-over-looks"}