{"authors": ["Cherie Lok"], "date_download": "2024-10-12 14:21:27", "date_modify": "2024-10-12 14:21:27", "date_publish": "2024-06-01 15:00:00", "description": "Twenty-five hawkers The Straits Times spoke to say their livelihood is becoming less sustainable.  Read more at straitstimes.com.", "filename": "life_doing-charity-encouraging-healthy-eating-adhering-to-onerous-rules-is-too-much-being-asked-of-hawkers_1728742887.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/01/alfchern-athawker17-1273.jpg?VersionId=.Jf.kGFTog4Ew6cXYMbirm17laaaJNFk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_doing-charity-encouraging-healthy-eating-adhering-to-onerous-rules-is-too-much-being-asked-of-hawkers_1728742887.html", "title": "Doing charity, encouraging healthy eating, adhering to onerous rules: Is too much being asked of hawkers?", "title_page": "Doing charity, encouraging healthy eating, adhering to onerous rules: Is too much being asked of hawkers? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – They have been vaunted and valorised. Held up as a paragon of the humble working Singaporean. Celebrated in film, festivals and exhibitions. Inscribed onto Unesco’s Intangible Cultural Heritage List.\nBut for some, the reality of being a hawker is far more thankless.\nAmid rising inflation and onerous contractual obligations, the 25 hawkers from Socially-conscious Enterprise Hawker Centres (SEHC) The Straits Times spoke to say their livelihood is becoming less sustainable.\nBecause of how deeply embedded hawker culture is in the fabric of Singaporean society, hawkers are often called to be in the vanguard of social change.\nAmong their many responsibilities is an obligation to encourage Singaporeans to eat healthier meals. For example, according to their contracts, tenants at Bukit Canberra Hawker Centre could be fined $30 or accumulate three demerit points for nutrition-related lapses, such as failing to display a menu without a calorie count.\nThey are also expected to help shield lower-income families from the tide of inflation.\nSix SEHCs that ST visited required stalls to offer one or two budget options. At Hawker Centre @ Our Tampines Hub, run by FairPrice Group Hawker Centre, the price limit for budget meals is currently set at $2.80, though a FairPrice Group spokesperson tells ST that the organisation is currently conducting a review of this price point.\n“I hope they can increase the budget meal cap to $3.50,” says Adam (not his real name), a hawker who, like most others in this story, spoke to ST on condition of anonymity.\nThough most hawkers say they are glad to do their part for the lower-income, rising food and energy prices, coupled with the 9 per cent GST hike, make it difficult.\n“It is impossible to make a profit from these meals,” adds Adam, who estimates he sells at least 60 of these budget meals a week, mainly carbohydrate-laden, with a small serving of meat on the side.\nOne hawker at Buangkok Hawker Centre, another SEHC run by Fei Siong Group, says she has reduced the portion size of her obligatory $3.20 budget meal – a noodle dish – to manage costs.\nAnother hawker, a 44-year-old who wants to be known only as Hasan, says his budget options are solely vegetarian, which has dissuaded some customers from picking them.\nMr Daryl Tong, 32, who runs vegetarian stall Origanics at Buangkok, says his ingredient and utility costs went up by 10 per cent in 2024. As a result, he raised the prices of his non-budget items, such as char siew kolo noodles ($4.50) and lor me ($4), by 50 cents two months ago to account for the goods and services tax hike.\n“You need the more expensive items to offset the cost of the cheaper meals,” he says.\nBut not everyone has successfully appealed to the operators for permission to increase prices. One stallholder at Yishun Park Hawker Centre says the SEHC’s management, Timbre+ Hawkers, denied his request three times.\n“I make a 50-cent loss on each $3 budget meal I sell, so I don’t display the budget meal advertisement prominently. I just can’t afford to.”\nTo this, Dr Ye Junjia, associate professor at Nanyang Technological University’s (NTU) School of Social Sciences, who researches social and economic inequality in Singapore, says: “If hawkers are taking cost-cutting measures that don’t translate to very satisfying budget meals, then it might suggest that the budget meal system isn’t very sustainable, because it’s not benefiting lower-income customers either.”\nShe adds it might be time for Singaporeans to adjust their expectations amid rising hawker prices.\nLast week, The Straits Times reported that hawker food prices rose by 6.1 per cent in 2023 – the highest since 2008 – according to a new study by the Singapore Department of Statistics.\n“People are very happy paying $20 for a bowl of ramen, but get anxious about paying $4 for a bowl of bak chor mee. As much as Singaporeans have come to expect inexpensive food, we cannot say we want our hawker food to be Michelin-recognised while demanding it stays cheap.”\nVeteran food critic K.F. Seetoh, founder of local food guide Makansutra and curator of the Urban Hawker food centre in New York City, notes: “Affordable doesn’t mean cheap. The price should be fair.”\nDr Ye suggests that there needs to be a comprehensive report on what is considered affordable for those the budget meal system is aiming to benefit.\nWho should pay for discounts?\nOn top of offering budget meals, hawkers at Yishun Park and One Punggol Hawker Centre, which is also run by Timbre+, say they have to absorb the 10 per cent discount offered to customers through the Timbre App.\n“I guess it’s like we’re paying the 10 per cent for marketing purposes. But I think they could afford to do more in terms of marketing. Footfall is quite slow this year,” says a hawker in her 50s at One Punggol Hawker Centre.\nHawkers at Bukit Canberra Hawker Centre, who also offer a 10 per cent discount through the Food Canopy App, hope more can be done to boost footfall at their centre too.\n“We get fewer than 100 customers a day and we need at least 150 to break even,” one stallholder tells ST, attributing the low footfall to the lack of outside signage promoting the hawker centre, as well as bad ventilation.\nThe FairPrice Group app also gives customers at Hawker Centre @ Our Tampines Hub a 10 per cent discount on food. Some stallholders say the discount comes at their expense and is unfair.\n“We are just a small business. When we lose 10 per cent whenever the customer pays using the app, that becomes a $30 to $50 loss every day. And over time, it adds up,” says Adam.\nWhen posed queries by ST, Timbre+ Hawkers declined to comment. FairPrice Group did not respond to questions about the discount offered through its app.\nAccording to a contract seen by ST, hawkers at Bukit Canberra Hawker Centre are obliged to offer a 10 per cent discount on regular food items to customers holding Pioneer Generation (Singaporeans aged 75 and above), Merdeka Generation (Singaporeans aged between 65 and 74) and Community Health Assist Scheme (Chas) Blue cards. Singaporeans with the Chas Blue card come from households with a monthly income of $1,200 or below per person.\nAdditionally, tenants at Bukit Canberra Hawker Centre have to participate in a “Belanja A Meal” programme, which requires them to set aside 100 meals for the needy at their own cost. However, seven tenants ST spoke to say they have not received any additional details on the programme.\n“If it’s well regulated, we are happy to help low-income families,” one of them says. He declined to give his name for fear of repercussions from the landlord. “But without a set timeframe, we’re not sure if we can afford this.”\nMr Joey Tan, who is in his 50s and the managing director of Canopy Hawkers Group (CHG), which runs the SEHC, tells ST that this is intended to be a one-off contribution, and that 90 per cent of the stallholders had expressed interest in it.\nThe programme has yet to be rolled out.\nOther hawkers from the same centre say they have tried to defray costs by requesting a cheaper gas provider and asking CHG to let them charge more than 30 cents for disposable plastic containers. However, their requests were denied.\nBut should these hawkers be made responsible for charity or lower-income support in the first place?\nAssociate Professor Walter Theseira, a labour economist from the Singapore University of Social Sciences, thinks not.\n“I don’t think they should be placed in a position of offering social assistance, because a large part of this group would ordinarily, in many societies, qualify for some kind of assistance themselves as they are at or below the median wage,” he points out.\nHe suggests that the Government picks up the tab for discounts offered to lower-income customers carrying some form of identification, such as the Chas card. Alternatively, socially conscious operators could pick up the tab by offering participating hawkers rental rebates.\nAccording to the National Environment Agency (NEA), the median stall rental at SEHCs is currently comparable with that at similar hawker centres managed by the agency.\nIn 2023, the median monthly stall rent was $1,700 at SEHCs and $1,625 for non-subsidised stalls at NEA-managed hawker centres.\nPlus, with the extra financial support, vulnerable customers could receive better meals too, instead of resorting to sparse budget options doled out under contractual obligation.\n“This is part of the bigger issue of how we address the concerns of Singapore’s lower-income residents. One complaint that has been brought up before is that we offer them services or goods of a lower quality, which can be stigmatising,” adds Prof Theseira.\nCalls to standardise operations\nThere are 12 hawker centres managed by SEHC operators as at end-2023. NEA piloted this model in 2015 and will apply it to all new hawker centres.\nAccording to NEA’s website, operators have a mission to ensure access to affordable food in a clean and hygienic environment. Their other key performance indicators (KPIs) are related to vibrancy, stall occupancy, footfall and addressing feedback in a timely manner.\nThe agency says that based on its surveys of patrons, satisfaction with the overall cleanliness, food quality and variety and dining environment at SEHCs has generally remained high over the years.\nNot everyone is a fan of this system, though. The issue of whether the SEHC model was the right way forward for the centres most prominently emerged at the end of 2018, leading to a lively debate in Parliament in November that year.\nThough it concluded that SEHCs were here to stay, NEA subsequently introduced a series of changes aimed at easing the constraints on hawkers.\nThese adjustments, implemented from January 2019, included allowing stallholders to operate five days a week and to terminate their tenancies with just two months’ notice. The changes were to comprise a standard “playbook” that SEHCs had to abide by.\nHowever, hawkers at Bukit Canberra Hawker Centre say they are entitled to only one day off, according to their contract. One tenant claims his request to work a five-day week, on account of manpower shortages, was rejected.\nCHG’s Mr Tan says stallholders have different days off based on the operational schedule they proposed during the stall application process.\nHawkers also take issue with what they describe as their operator’s overbearing style of management.\n“It’s a bit frustrating because they treat us like their employees,” says a stallholder, whose menu, suppliers and profit margins were scrutinised by management staff. They rejected more than half of his appeals to add new items to the menu, explaining that some of the proposed items were too expensive.\n“Surely that should be up to the customer to decide,” he remarks.\nHe adds that while CHG holds regular feedback sessions – Mr Tan says Hawker Feedback Group sessions are held every quarter or less – the management is slow to resolve problems faced by hawkers.\nIt is a markedly different story from the situation at Buangkok Hawker Centre, Pasir Ris Central Hawker Centre and One Punggol Hawker Centre, where hawkers that ST spoke to say they are mostly satisfied with operations so far.\nMs Jaslynn Phua, 42, whose family runs an Eng Kee Chicken Wings outlet at Buangkok Hawker Centre, says: “We have a group chat with the Fei Siong management, which allows them to provide immediate support. If we see any spillage or are running short on utensils, we just update them via the chat and they are replenished within minutes.”\nMr James Tan, 44, owner of Flying Dragon Noodles, which sells crispy egg noodles doused in gravy, has also had a good experience with FairPrice Group Hawker Centre. “They don’t fine us unnecessarily, and mostly leave us alone,” he says.\nST asked NEA to what extent SEHC contracts are standardised and how much oversight NEA exercises over such hawker centres, to which the agency replied that operators have the discretion to vary rent according to the type of food sold.\nWhen asked whether it is possible for tenants to negotiate for more favourable terms, lawyer Ronald Wong, deputy managing director of Covenant Chambers, says that depends on who has more bargaining power.\nIn a country where space is scarce and demand for stalls fiercer than ever, the tenant rarely comes out on top, he observes.\n“It also depends on whether the tenant has any presence of mind to negotiate or get advice. Terms are sometimes drafted in a way that is not always easily comprehensible by most people, especially those who don’t speak English as a first language,” he adds.\nPreserving hawkers’ interests\nBut as evinced by repeated complaints to their respective operators and e-mail to MPs, these hawkers are certainly not voiceless. But how to speak change into existence?\nMr Seetoh, who raised the issue of punitive contracts in a blog post on his Makansutra website in early May, says ad-hoc activists like himself are not enough to represent the interests of hawkers. A dedicated association is needed to champion their cause across all operating models and advise stallholders.\n“This association should consist of people who have experience in operations, experienced hawkers, suppliers, trainers from culinary schools, lawyers and financial advisers. Most hawkers are struggling to even make a living every day and have no time to think about these things. This association can be their voice,” he says.\nAcademics also stress the importance of preserving these “community dining rooms” and the cooks who continually pump life into them.\nDr Keri Matwick, senior lecturer at NTU’s School of Humanities, who studies food media discourse, says that affordable hawker meals act as an important alternative to handouts from food charities.\n“There’s no social stigma to eating at a hawker centre because it does still have this national and global acclaim of having good food. So it provides a dignified way for everyone to eat, regardless of class.”\nThey also serve an invaluable social function, adds Dr Ye. “These hawker centres are where people from different linguistic, religious, ethnic and class backgrounds interact. It is where many of us learn to engage with one another.”\nFor this to continue, she emphasises that Singapore must find practical ways to balance the various pressures on those in the trade. Otherwise, future generations might see fewer stepping into the hawker trade.", "url": "https://www.straitstimes.com/life/doing-charity-encouraging-healthy-eating-adhering-to-onerous-rules-is-too-much-being-asked-of-hawkers"}