{"authors": ["Ong Sor Fern"], "date_download": "2024-10-12 13:30:44", "date_modify": "2024-10-12 13:30:44", "date_publish": "2024-03-13 17:00:00", "description": "Both retiring CEO Chong Siak Ching and Dr Tan joined the gallery in 2013. Read more at straitstimes.com.", "filename": "life_arts_dr-eugene-tan-will-be-ceo-for-national-gallery-singapore-art-museum_1728739844.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/13/Dr20Eugene20Tan20Portrait.20Image20Courtesy20of20Singapore20Art20Museum.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_arts_dr-eugene-tan-will-be-ceo-for-national-gallery-singapore-art-museum_1728739844.html", "title": "Eugene Tan will be CEO for National Gallery, Singapore Art Museum", "title_page": "Eugene Tan will be CEO for National Gallery, Singapore Art Museum | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Dr Eugene Tan will take over as chief executive of the National Gallery Singapore and Singapore Art Museum (SAM) from April 1, when Ms Chong Siak Ching retires from the position.\nHe will also take Ms Chong’s other portfolio as head of the Visual Arts Cluster, which comprises the two museums and STPI – Creative Workshop & Gallery.\nThe handover was announced in a statement by the museums on March 13. Dr Tan, 51, was appointed director of the gallery in 2013 and director of SAM in 2019.\nIn a statement, he said: “Having been part of National Gallery Singapore’s development over the past 11 years and Singapore Art Museum for five years, I am delighted to be given the opportunity to lead these two institutions into the future.”\nUnder his stewardship, the gallery has staged blockbuster exhibitions such as the 2017 Yayoi Kusama: Life Is The Heart Of A Rainbow and the ongoing Tropical: Stories From Southeast Asia And Latin America.\nIt has also built a network of partnerships with other acclaimed institutions, including Centre Pompidou in Paris; National Museum of Modern and Contemporary Art, Korea; and the National Museum of Modern Art in Tokyo.\nBefore he joined the gallery, Dr Tan made a splash as programme director (special projects) at the Economic Development Board, where he oversaw the development of the Gillman Barracks art district.\nHe earned his PhD in art history from the University of Manchester and has curated numerous exhibitions, including the inaugural Singapore Biennale in 2006 and the recent Ho Tzu Nyen: Time & The Tiger (2023) at SAM.\nMr Edmund Cheng, chairman of SAM, said in a statement: “Eugene has championed the arts even before his time with the gallery and SAM. Working closely with Siak Ching for more than 10 years as a curator and administrator, he has helped to shape Singapore’s visual arts into a lively and vibrant scene, with much to offer in terms of beauty, creativity, rigour and enrichment in our lives.”\nMs Chong, 64, joined the gallery in 2013, shepherding the museum through its delayed opening and overseeing its development as an inclusive institution with diverse programming for both young and old.\nMr Peter Ho, the gallery’s chairman, said: “Siak Ching has been an inspiration and a driving force for Singapore’s visual arts during her tenure. We are grateful for her visionary leadership, which raised the bar for artistic excellence as the gallery and SAM became leading arts institutions in our region and the world.”", "url": "https://www.straitstimes.com/life/arts/dr-eugene-tan-will-be-ceo-for-national-gallery-singapore-art-museum"}