{"authors": ["Eunice Quek", "Tan Hsueh Yun", "Cherie Lok"], "date_download": "2024-10-12 14:04:26", "date_modify": "2024-10-12 14:04:26", "date_publish": "2024-06-25 11:18:00", "description": "Meta restaurant has been promoted from one to two-Michelin-star status. Read more at straitstimes.com.", "filename": "life_food_michelin-guide-singapore-4-restaurants-earn-one-star-meta-now-has-two-stars_1728741866.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/25/rrmeta2506.jpg?VersionId=sbxqrz7SpHeHd1AS9kYlDETpS8nNQws7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_michelin-guide-singapore-4-restaurants-earn-one-star-meta-now-has-two-stars_1728741866.html", "title": "Michelin Guide Singapore: Four restaurants earn one star; Meta now has two stars", "title_page": "Michelin Guide Singapore: Four restaurants earn one star; Meta now has two stars | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Four restaurants have been awarded one Michelin star by Michelin Guide Singapore, as announced on June 25 via its website and social media platforms.\nThey are Chilean South Pacific establishment Araya at the Mondrian Singapore Duxton, Japanese-French restaurant Chaleur in Neil Road, modern Italian restaurant Matera at The Fullerton Waterboat House and Pangium at the Singapore Botanic Gardens.\nJune 25 marks a day to remember for chef-couple Francisco Araya, 41, and Fernanda Guerrero, 37, of newly minted one-starred Araya.\nThe restaurant’s sommelier Tomas Tapia, 34, also won the guide’s Sommelier Award.\nThe icing on the cake? June 25 is the day of chefs Araya and Guerrero’s engagement, as well as her birthday.\nAraya says: “Both the proposal and receiving our first Michelin star are equally important, as one represents a personal achievement while the other represents a team effort.\n“The next step is to focus on enhancing our creativity and refining our service.”\nMoving forward, Mr Tapia plans to source for more boutique wines and producers from Chile and Argentina. He says: “Highlighting our Chilean culture and spotlighting outstanding Chilean wines is important, as these producers are creating exceptional wines that deserve more recognition.”\nFor home-grown chef Malcolm Lee of Pangium, which champions Straits cuisine, this is his second restaurant to make the guide. Peranakan establishment Candlenut in Dempsey has held one Michelin star since 2016.\nThe 40-year-old calls the accolade a “significant win for heritage cuisine”.\nMeta restaurant in Mohamed Sultan Road, helmed by South Korean chef Sun Kim, has been promoted from one to two-Michelin-star status.\nKim, 40, says: “I’ve changed direction and the food is more Korean. Meta’s food is my interpretation of Korean food, using my experience working with Japanese chefs, living in Australia and understanding French cuisine. I think it’s quite unique, but people still understand the flavours.\n“We have been working hard and Meta has been improving. Meta is nine years old and for me, we are going on to the second chapter.”\nEight former one-star recipients have fallen off the guide. Four of them – where the restaurant is still in operation – are Beni at Mandarin Gallery, Cure in Keong Saik Road, Putien in Kitchener Road and Reve in Kreta Ayer Road. Reve’s former chef Masahiko Kawano now helms the newly minted one-starred Chaleur.\nThe other four – which closed in the past year – are La Dame de Pic at Raffles Hotel, Braci in Boat Quay, Table 65 at Resorts World Sentosa and 28 Wilkie in Wilkie Road.\nBesides the Sommelier Award, two other special awards were given out.\nChef Seth Lai of fine-dining restaurant Ce Soir in Portsdown Road was lauded with the Young Chef Award. And Ms Lufianti Susetyo, from Italian restaurant Buko Nero in Tanjong Pagar, was winner of the Service Award.\nOn the accolade, Lai says: “I am extremely humbled to be chosen as the young chef of the year, I wasn’t expecting it, but can only be thankful for the recognition. Moving forward, I can only work harder to achieve greater heights.”", "url": "https://www.straitstimes.com/life/food/michelin-guide-singapore-4-restaurants-earn-one-star-meta-now-has-two-stars"}