{"authors": ["Tan Hsueh Yun"], "date_download": "2024-10-12 14:03:33", "date_modify": "2024-10-12 14:03:33", "date_publish": "2024-07-04 15:00:00", "description": "Chef Koh Han Jie of newly opened Nook is a rising talent to watch on the dining scene. Read more at straitstimes.com.", "filename": "life_food_food-picks-elevated-chicken-rice-at-nook-grilled-fare-at-setsuri-oishi-pan-bakery-s-curry-puffs_1728741813.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/04/wgt-hypicks-030724.jpg?VersionId=.Hv2gAG7FtrvGqms2xLesd.Anodaw8HY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_food-picks-elevated-chicken-rice-at-nook-grilled-fare-at-setsuri-oishi-pan-bakery-s-curry-puffs_1728741813.html", "title": "Food Picks: Elevated chicken rice at Nook, grilled fare at Setsuri, Oishi Pan Bakery’s curry puffs", "title_page": "Food Picks: Elevated chicken rice at Nook, grilled fare at Setsuri, Oishi Pan Bakery’s curry puffs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Nook: Young talent\nThe last time I had chef Koh Han Jie’s food, he was heading the kitchen team at Ce Soir in Portsdown Road. What a talent, I thought then. Such finesse.\nThose qualities are still evident at his new 80-seat restaurant, the rather more casual Nook in Craig Road, which opened in May. The menu is a la carte, which diners tired of long, drawn-out tasting menus seem to prefer these days.\nHeirloom Tomatoes & Burrata ($24) is the starter to get. Not because Singapore needs another tomato and burrata salad, but because of the lovely touches he puts on the plate.\nA quenelle of basil and tarragon sorbet is perfect with the tomatoes and cheese. The addition of tarragon, with its licorice notes, is unexpected and lifts this salad from the ordinary.\nAnd then I bite into ginger flower with a wedge of tomato, and that is another unexpected and delightfully aromatic hit. Lest you think this is a salad of soft textures, there is a little pile of puffed red quinoa, offering toasty crunch.\nA very hearty Seafood Stew ($88) features punchy prawn bisque, which cries out to be mopped up with good Sourdough ($12). Again, the 31-year-old chef pays attention to detail. Crispy scale amadai abound on restaurant menus. His stew features kinmedai with those crispy scales – the fish is sweeter and more delicate, the scales are crisp, rather than crunchy. Fat Hokkaido scallops cooked right and juicy mussels are also on the plate. The prawns have a mealy texture I do not enjoy. I trust he has found a better supplier.\nThe other main course to get is the chef’s version of chicken rice. He uses organic birds from Malaysia fed with pineapple enzymes, all in the name of raising plumper chickens with tender meat.\nThe chicken, priced at $42 for half, is brined for two hours, dry-aged seven days and roasted to order. Look, after all that, I cannot tell if it was the enzymes or the brining and dry ageing that produced a delicious roast chicken. Life is too short to eat chicken breast, I have always thought, but I will eat this one any day.\nOrder Koshihikari Rice ($18) to go with the chicken. It has the usual chicken rice aromatics you would expect. What I do not expect are the crunchy things on top. Lardons? No, better. Fried cockscomb.\nLike at Ce Soir, where one of the accompaniments to a dish was cordyceps heady with wok hei, this touch tells me a lot about this young talent and how he thinks through what he puts on the plate.\nPlace him firmly on your restaurant radar.\nWhere: 11 Craig Road\nMRT: Tanjong Pagar\nOpen: 11.30am to 3.30pm, 5.30 to 10.30pm (Tuesdays to Sundays), closed on Mondays\nTel: 8300-7274\nInfo: @nook.nowhere (Instagram)\nSetsuri Ishinomaki: From scratch\nI cannot remember the last time I had a futomaki, those large maki stuffed with too many generic ingredients, the rice packed too tight. So I did not have high hopes for the Futomaki ($28) at Setsuri Ishinomaki, a casual Japanese restaurant that opened in May at Guoco Midtown.\nBut that first bite. The perfectly seasoned, tender grains of rice. Why does it taste so different? Ah. The pink fish floss is made in-house. So is the kanpyo pickle. The dashi tamago is made with care.\nYou can choose to have the maki with prawn, Hokkaido crab meat, unagi or spicy garlic beef. I would go with prawn or crab, which will not overpower the other ingredients.\nKinzanji Miso Kyuri ($10) is another good appetiser. The miso is made with rice, soya beans and barley, and has umami in spades. Just scoop it up with crunchy cucumber.\nTsubugai, Tako Kimuchi ($12) features sea whelk and raw octopus in an addictive gochujang dressing I cannot get enough of. Mentai Dashi Maki Tamago ($14) is all wobbly and custardy, topped with chunks of spicy cod roe lightly torched.\nThe 50-seat restaurant specialises in different Japanese ways of grilling food. There is genshiyaki, where food on long skewers stuck in wood ash grill over binchotan; warayaki, where food is grilled over straw; robatayaki and rogama, where food is grilled slowly over binchotan.\nThe Hon Maguro Toro Wara Tataki ($48) grilled over straw is deliciously smoky. And although the Gindara Saikyo Genshiyaki ($38) comes looking burnt, it is not. The slight sweetness from the miso and the fattiness of the fish make me wish I had a bowl of rice to soak it all up.\nWhere: 01-03 Guoco Midtown House, 120 Beach Road\nMRT: Bugis\nOpen: 11.30am to 3pm, 5.30 to 10pm daily\nTel: 6530-3657\nInfo: ishinomaki.com.sg/#setsuri\nOishi Pan Bakery: Plain delicious\nSins against curry puffs are many. My biggest beef is that the rempah, or spice paste, is never fried long enough to mellow things out.\nTo bite into a curry puff is to often be taken aback by a mouthful of raw-ish spices. Nasty.\nWhen I want a curry puff, which is often, I swing by Oishi Pan Bakery in Toa Payoh. There is something very old school about its Curry Puff ($1.80 each).\nThe pastry is short crust, but baked rather than fried, and shiny from an egg wash before it goes in the oven.\nWhat I love about it is that most of the time, the rempah has been given the proper treatment, so there are no jagged edges to the flavour.\nThe chicken pieces are also distributed throughout the potato filling and not in one chunk somewhere in the puff. There are no Where’s Wally moments eating it.\nThis neighbourhood bakery punches above its weight. By that, I mean it does not offer only fluffy buns. Instead, there are also reliably good sourdough, rye and other crusty loaves, and even Vietnamese style rolls for DIY banh mi sandwiches.\nWhere: 01-572, 190 Lorong 6 Toa Payoh\nMRT: Toa Payoh\nOpen: 8am to 9pm daily\nTel: 6254-5994\nInfo: oishipan.sg", "url": "https://www.straitstimes.com/life/food/food-picks-elevated-chicken-rice-at-nook-grilled-fare-at-setsuri-oishi-pan-bakery-s-curry-puffs"}