{"authors": [], "date_download": "2024-10-12 14:05:02", "date_modify": "2024-10-12 14:05:02", "date_publish": "2024-01-16 10:54:52", "description": "Succession earned the prestigious best drama trophy, while The Bear dominated comedy honours. Read more at straitstimes.com.", "filename": "life_entertainment_restaurant-tale-the-bear-wins-big-in-emmy-comedy-honours_1728741902.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/16/2024-01-16T042235Z567556230HP1EK1G0BJPA5RTRMADP3AWARDS-EMMYS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_restaurant-tale-the-bear-wins-big-in-emmy-comedy-honours_1728741902.html", "title": "Emmys: Succession, The Bear win big at TV’s Emmy awards", "title_page": "Emmys: Succession, The Bear win big at TV’s Emmy awards | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Media dynasty drama Succession earned the prestigious best drama trophy and The Bear dominated comedy honours as Hollywood handed out the annual Emmy awards, the top accolades for television.\nSuccession (2018 to 2023), the HBO series about the cut-throat battle for control of a global business empire, took home six wins for its fourth and final season.\nThe Bear (2022 to present) was named best comedy at a ceremony that was delayed by four months because of last year’s labour turmoil in Hollywood. Road rage drama Beef (2023) claimed best limited series.\nEmmy voters honoured several actors and creators of colour at a ceremony coincidentally held on the U.S. holiday that commemorates civil rights leader Martin Luther King Jr.\nSuccession was named best drama series for the third time.\n“It was a great sadness to end the show, but it was a great pleasure to do it,” creator Jesse Armstrong said.\nKieran Culkin, Sarah Snook and Matthew Macfadyen won acting trophies for their roles as part of the wealthy but miserable Roy family.\nCulkin gave an emotional speech as he accepted his first Emmy, for lead drama actor, breaking into tears as he thanked his mom for a great childhood. He then told his wife he wanted more kids.\n“You said maybe, if I win,” he said to his wife, Jazz Charton, who was seated in the audience.\nSnook, also a first-time winner, recognised Armstrong, her co-stars and her parents as she accepted best actress in a drama.\n“Thank you for having a dress-up box when I was a kid. I think this is where it gets you,” Snook said.\nFor The Bear (2022 to present), star Jeremy Allen White was named best comedy actor, and his co-stars Ayo Edebiri and Ebon Moss-Bachrach won supporting actress and actor, for the first season of the FX network show.\n“I am so proud, so full of gratitude, to be standing in front of you all,” said White, who plays chef Carmen “Carmy” Berzatto. “I love the show so much.”\nJennifer Coolidge, who won her second supporting actress honour for playing a loopy vacationer on limited series The White Lotus (2021 to present) took the opportunity to thank \"all of the evil gays\", referring to characters on the show involved in a murder plot against her character.\nSeveral Black actors won awards at the show.\n“Everyone having fun at the chocolate Emmys tonight? We are killing it tonight,” said host and former Black-ish (2014 to 2022) star Anthony Anderson.\nHolding her trophy on stage, Edebiri of The Bear thanked her family for “letting me feel beautiful and Black and proud of all of that”.\nA jubilant Niecy Nash, a supporting actress winner for limited series Dahmer – Monster: The Jeffrey Dahmer Story (2022 to present), hoisted her Emmy trophy in the air and proclaimed: \"I'm a winner, baby.\"\n\"I want to thank me, for believing in me and for doing what they said I could not do.\" Nash said.\nOrganisers were using this year’s milestone – the 75th Emmys – to honour classic television shows with cast reunions and other moments.\nTed Danson, Kelsey Grammer, Rhea Perlman and other stars of Cheers (1982 to 1993) gathered around a recreation of the iconic bar set, and Grey's Anatomy (2005 to present) actors Katherine Heigl and Ellen Pompeo spoke from a hospital room set up on stage.\nThe show ended with an excerpt from King’s 1963 I Have A Dream speech. REUTERS\nList of winners at the 75th Primetime Emmy Awards\nBest Drama Series: Succession\nBest Comedy Series: The Bear\nBest Limited or Anthology Series or Movie: Beef\nBest Comedy Actor: Jeremy Allen White, The Bear\nBest Comedy Actress: Quinta Brunson, Abbott Elementary\nBest Drama Actor: Kieran Culkin, Succession\nBest Drama Actress: Sarah Snook, Succession\nBest Actor, Limited or Anthology Series or Movie: Steven Yeun, Beef\nBest Actress, Limited or Anthology Series or Movie: Ali Wong, Beef\nBest Drama Supporting Actor: Matthew Macfadyen, Succession\nBest Drama Supporting Actress: Jennifer Coolidge, The White Lotus\nBest Comedy Supporting Actor: Ebon Moss-Bachrach, The Bear\nBest Comedy Supporting Actress: Ayo Edebiri, The Bear\nBest Supporting Actor, Limited or Anthology Series or Movie: Paul Walter Hauser, Black Bird\nBest Supporting Actress, Limited or Anthology Series or Movie: Niecy Nash-Betts, Dahmer – Monster: The Jeffrey Dahmer Story\nBest Directing, Drama: Succession\nBest Directing, Comedy: Christopher Storer, The Bear\nBest Directing, Limited or Anthology Series or Movie: Lee Sung Jin, Beef\nBest Drama Writing: Jesse Armstrong, Succession\nBest Comedy Writing: The Bear\nBest Writing, Limited or Anthology Series or Movie: Lee Sung Jin, Beef\nBest Writing, Variety Series: Last Week Tonight With John Oliver\nBest Talk Series: The Daily Show With Trevor Noah\nBest Scripted Variety Series: Last Week Tonight With John Oliver\nBest Variety Special (Live): Elton John Live: Farewell From Dodger Stadium\nBest Reality Competition: RuPaul’s Drag Race", "url": "https://www.straitstimes.com/life/entertainment/restaurant-tale-the-bear-wins-big-in-emmy-comedy-honours"}