{"authors": [], "date_download": "2024-10-12 14:05:00", "date_modify": "2024-10-12 14:05:00", "date_publish": "2024-01-16 08:46:51", "description": "TV series Succession leads the Emmys with 27 nominations. Read more at straitstimes.com.", "filename": "life_entertainment_stars-glisten-on-silver-carpet-at-strike-delayed-emmys_1728741900.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/16/US-75TH-PRIMETIME-EMMY-AWARDS-ARRIVALS-001155.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_stars-glisten-on-silver-carpet-at-strike-delayed-emmys_1728741900.html", "title": "Stars glisten on silver carpet at strike-delayed Emmys", "title_page": "Stars glisten on silver carpet at strike-delayed Emmys | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Actors from Succession, Ted Lasso and other television shows walked a shiny silver carpet on Monday as Hollywood stars convened four months later than usual for the annual Primetime Emmy Awards.\nThe top TV honours were postponed from September because of labour disputes in 2023. That meant some shows in the running aired as far back as June 2022.\nHeading into the ceremony, HBO's media dynasty drama Succession led all nominees with 27 nods for its fourth and final season, the one that resolved the long-running question of who would win the battle to control a global business empire.\nOutside the Peacock Theater in downtown Los Angeles, stars including Brian Cox and Matthew Macfadyen from Succession (2018 to 2023) and Hannah Waddingham from Ted Lasso (2020 to 2023) arrived in tuxedos and floor-length gowns, with classic black and white dominating many outfits. The carpet was silver instead of the traditional red.\nSuccession was considered the favourite to win the top award of best drama series, an honour it has won twice.\n\"There's been a lot of light on our show,\" said Alan Ruck, who played Connor Roy. \"It's thrilling. I'm enjoying it.\"\nComedy series was more of a toss-up, said pundits, who were divided between Ted Lasso, the Apple TV+ show about a spirited British football club, and restaurant dramedy The Bear (2022 to present) from Walt Disney's FX.\nLasso finished its third season last year, and producers have not said whether the show will continue. Phil Dunster, who played star forward Jamie Tartt, said he was unsure. \"If it is a last hurrah, it's been a really wonderful last hurrah,\" Dunster said.\nNearly two-thirds of the Emmy-nominated shows came from streaming platforms, their highest share ever, according to data from Nielsen's Gracenote.\nSuccession stars Kieran Culkin and Sarah Snook were among the actors vying for trophies, as well as The Bear duo of Jeremy Allen White and Ayo Edebiri, and Pedro Pascal and Bella Ramsey from The Last Of Us (2023 to present).\nOrganisers planned to use this year's milestone – the 75th Emmys – to honour classic television shows with cast reunions and other moments. Cheers (1982 to 1993), Game Of Thrones (2011 to 2019), The Sopranos (1999 to 2007), and All In The Family (1971 to 1979) are among the shows that will be celebrated. Two actresses who have not been revealed will play Lucy and Ethel to commemorate I Love Lucy (1951 to 1957).\nThe awards ceremony was moved to Jan 15 (US time), which coincides with the Martin Luther King Jr. holiday in the United States as well as the Iowa caucuses, the kick-off to the American presidential election.\nComedian Anthony Anderson, who previously starred on the show Black-ish (2014 to 2022), said the broadcast was being run by an all African-American production team and emcee for the first time.\n\"I'm excited to be part of that, making history in front of and behind the camera on such a special day,\" Anderson said ahead of the event. REUTERS", "url": "https://www.straitstimes.com/life/entertainment/stars-glisten-on-silver-carpet-at-strike-delayed-emmys"}