{"authors": [], "date_download": "2024-10-12 13:35:34", "date_modify": "2024-10-12 13:35:34", "date_publish": "2024-08-21 09:21:24", "description": "People magazine said relations became strained because of their different approaches to celebrity. Read more at straitstimes.com.", "filename": "life_entertainment_jennifer-lopez-files-to-divorce-ben-affleck-us-media_1728740134.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/21/2024-08-20T233204Z515153025RC2326AJAIFRRTRMADP3PEOPLE-LOPEZ-AFFLECK.JPG?VersionId=YyPT4npHJw.bVvGYocb2P97wYI3Dggzh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_jennifer-lopez-files-to-divorce-ben-affleck-us-media_1728740134.html", "title": "Jennifer Lopez files to divorce Ben Affleck: US media", "title_page": "Jennifer Lopez files to divorce Ben Affleck: US media | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – American pop star Jennifer Lopez has filed for divorce from actor Ben Affleck, American media reported on Aug 20, two years after the Hollywood power couple officially gave love a second chance by tying the knot.\nThe pair, who were nicknamed “Bennifer” when they first dated in the frenzied tabloid celebrity days of the early 2000s, had rekindled their relationship almost two decades later.\nBut Lopez on Aug 20 filed divorce papers at a Los Angeles court, Hollywood trade outlet Variety and celebrity gossip website TMZ said.\nA representative for the pop singer-turned-actress declined to comment. Affleck’s publicist did not immediately respond to an AFP request for comment.\nIt was the fourth marriage for Lopez, 55, and the second for Affleck, 52.\nLopez was married to Cuban actor Ojani Noa, Filipino-American dancer Cris Judd and American singer Marc Anthony, with whom she shares 16-year-old twins Max and Emme.\nAffleck was married to American actress Jennifer Garner from 2005 to 2018, and they are the parents of Violet, 18, Seraphina, 15, and Samuel, 12.\nLopez and Affleck first met in 2002 on the set of the widely panned movie Gigli (2003). They became a media sensation as they started dating and announced their engagement.\nBut they postponed their planned 2003 nuptials, and announced their relationship was over in early 2004.\n“Bennifer” set the internet alight again in 2021 when photos of them together again began circulating.\n“It’s a beautiful love story that we got a second chance,” Lopez said in an interview at the time.\nLopez and Affleck announced their engagement in April 2022, and the A-list lovebirds wed in Las Vegas in July the same year.\nThey made it official again the following month in a lavish ceremony at Affleck’s 35ha estate in the south-eastern US state of Georgia.\nAmong the Hollywood types in attendance at the three-day affair were the Oscar-winning movie star and director’s long-time pal, actor Matt Damon, and director Kevin Smith.\nThe couple reportedly bought a US$60 million (S$78 million) home together in Los Angeles in 2023.\nBut rumours of marital troubles emerged in the entertainment press and on social media in early 2024.\nFans noted that Lopez celebrated her 55th birthday without her husband in July, and TMZ said they had sold their joint home, with Affleck moving into a luxury bachelor pad.\nPeople magazine said relations became strained because of their different approaches to celebrity.\n“She likes to open her heart to her fans and to the world,” the magazine quoted an unnamed source as saying. “He is more introspective and private. This has been difficult day to day.”\nDivorce papers listed the couple’s date of separation as April 26, 2024, according to TMZ, which said the pair are no longer on speaking terms. AFP", "url": "https://www.straitstimes.com/life/entertainment/jennifer-lopez-files-to-divorce-ben-affleck-us-media"}