{"authors": [], "date_download": "2024-10-12 13:57:30", "date_modify": "2024-10-12 13:57:30", "date_publish": "2023-11-09 16:37:00", "description": "Journalists say he’s not objective enough, while Swifties insist they prefer a woman for the job. Read more at straitstimes.com.", "filename": "life_entertainment_a-dedicated-taylor-swift-reporter-faces-swift-criticism-online_1728741450.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/09/fdtaylor.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_a-dedicated-taylor-swift-reporter-faces-swift-criticism-online_1728741450.html", "title": "A dedicated Taylor Swift reporter faces swift criticism online", "title_page": "A dedicated Taylor Swift reporter faces swift criticism online | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Everything has changed for Mr Bryan West.\nGannett, the largest newspaper chain in the United States, announced on Monday that Mr West would fill a much-coveted job as the company’s first-ever Taylor Swift reporter, covering all things related to the international pop sensation for USA Today and Gannett’s network of more than 200 other papers across the country.\nBut before Mr West, 35, had the chance to file his first story on his new beat, he was getting criticism from two sides: journalism watchdogs and Swift’s fans.\nThe objections started rolling in shortly after Variety broke the news of his hiring on Monday. The article included an interview with Mr West, which provided newsroom ethicists and Swifties alike with grounds for complaint.\nMr West, who was formerly a TV news reporter in Phoenix, raised hackles by describing himself as “a fan of Taylor”. That remark caused some journalists to question whether or not he could be unbiased when it came to his new beat.\nAt the same time, the singer’s fans debated whether he was a “big enough” Swiftie to capture their beloved star. Some people in both camps said the job was better suited to a woman.\nIn the Variety interview, Mr West likened himself to a sports reporter in making the case that he could maintain his neutrality.\n“I would say this position’s no different than being a sports journalist who’s a fan of the home team,” he said. “I just came from Phoenix, and all of the anchors there were wearing Diamondbacks gear; they want the Diamondbacks to win.”\nThat remark did not sit well with a number of sports writers, including Boston-based sports and culture journalist Frankie de la Cretaz.\n“Any sports journalist will tell you the No. 1 rule of sports journalism is no cheering in the press box,” said 38-year-old De la Cretaz, who identifies as “they/them”.\n“It’s one of the hallmarks of the profession. It’s one of the first things you learn. The idea, of course, being that if you are a fan of the team, that you can’t be an unbiased reporter. I don’t know that I necessarily think that’s true.\n“But I think the fact that he is making that comparison shows to me a fundamental misunderstanding of what the role of a sports journalist is.”\nMr Benjamin Goggin, an editor at NBC News, criticised the hiring of Mr West on X, formerly known as Twitter, writing that Gannett gave the job to “a full stan, rather than someone who is capable of being critical of one of the most powerful people in all of pop culture”.\n‘Haters gonna hate’\n“Haters gonna hate,” Ms Lark-Marie Anton, Gannett’s chief communications officer, wrote in an e-mail, replying to the criticism from journalists.\nThe spokesperson added Mr West’s credentials “made him the best candidate for this role”.\nMr West, who is now based in Nashville at a Gannett daily, The Tennessean, declined to be interviewed for this article.\nMs April Glick Pulito, a Swift fan who works in political communications, posted lyrics from a Swift song in response to the hiring.\n“I’m so sick of running as fast as I can, wondering if I’d get there quicker if I was a man,” Ms Pulito, 35, wrote on X, quoting The Man, which reimagines the singer’s life had she been born a man.\n“It wasn’t a statement on the chops of this reporter,” Ms Pulito said in an interview. “He seems extremely qualified. But as someone who works in communications, I think the optics of the choice are kind of undeniable.”\nShe would have preferred to see the role go to a female applicant, “someone so many Taylor fans could look up to and see themselves in”, she said.\nThe Gannett spokesperson said the company “does not discriminate”.\nIn a year when seemingly anything having to do with the singer has drawn media scrutiny, Gannett’s announcement that it planned to hire a dedicated Swift reporter generated plenty of headlines and online comments.\nThe chosen candidate, the company said when it launched the search in September, would “identify why the pop star’s influence only expands” and “what her fan base stands for in pop culture”. The company also announced a search for a similar role to cover Beyonce.\nAs part of his application, Mr West submitted a five-minute video listing the reasons he should be hired.\nThe first was his journalism experience. Mr West previously worked as a broadcast reporter and producer at an NBC affiliate in Phoenix and said he had won several awards.\nHis second reason was that he had met Swift. The opportunity to meet her arose after he reported several stories about Swift while working in Phoenix, he said. Mr West included a photo of him with the singer in the video.\nAlthough critical of Mr West’s reference to how sports journalists go about their jobs, Mx De la Cretaz said they had sympathy for Gannett’s splashy hire.\n“This is a brutal fan base, and I don’t think there was ever going to be any winning for whoever they hired into this role,” they said. “Either he doesn’t get respect from the general public because he’s a fan and seen as biased, or he doesn’t get respect from the fandom itself because he’s not the right kind of fan.”\nProfessor Bill Grueskin, former dean at Columbia Journalism school, said Mr West’s passion for his subject could yield fine reporting.\nHe also threw some cold water on Mr West’s critics within the field.\n“I think expecting journalists to completely suspend any kind of personal liking for a pop star or a baseball team is probably unworkable,” he said. “The key is kind of how you go about covering it.”\nGannett has yet to announce who will be covering the Beyoncé beat. NYTIMES", "url": "https://www.straitstimes.com/life/entertainment/a-dedicated-taylor-swift-reporter-faces-swift-criticism-online"}