{"authors": ["Tan Hsueh Yun"], "date_download": "2024-10-12 14:04:32", "date_modify": "2024-10-12 14:04:32", "date_publish": "2024-06-19 15:30:00", "description": "The Korean-American chef of three-Michelin-starred Benu is making his South-east Asian debut in Singapore. Read more at straitstimes.com.", "filename": "life_food_upscale-korean-soul-food-at-chef-corey-lee-s-na-oh-in-jurong-west_1728741872.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/19/naoh-3.jpg?VersionId=F7rJje7r0MRNoOXs7JuDejiST0uvsl5_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_upscale-korean-soul-food-at-chef-corey-lee-s-na-oh-in-jurong-west_1728741872.html", "title": "Upscale Korean soul food at chef Corey Lee’s Na Oh in Jurong West", "title_page": "Upscale Korean soul food at chef Corey Lee’s Na Oh in Jurong West | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The 40-seat restaurant is all clean lines – wood in hues light and dark, and fabric dividers offering privacy but still letting the light in.\nStep into Na Oh, and it is difficult to believe that this elegant restaurant is in Jurong West. In an industrial complex. The Hyundai Motor Group Innovation Center Singapore, to be precise.\nThis is where Korean-American chef Corey Lee, 47, of three-Michelin-starred Benu in San Francisco is making his South-east Asian debut.\nIt started with a conversation in San Francisco he had in 2020, during the Covid-19 pandemic, with Mr Euisun Chung, executive chairman and chief executive of Hyundai Motor Group.\n“There wasn’t a formal offer,” chef Lee says of their conversation. “Just casual discussion on some of the projects they were planning in various locations. When Singapore was brought up, I expressed interest because Singapore is a country I have enjoyed visiting – warm people and a food culture that’s diverse and gourmet.”\nThe chef, who opened Benu in 2010 after heading The French Laundry in Yountville, California, was in Singapore in March 2024, at the time when the finishing touches were being made to Na Oh. The name means “the journey from inside out” in Korean.\n“I was immediately relieved to see that all our planning and design sessions had materialised into a restaurant that feels comfortable, calm, both traditional and modern, and is able to harmonise with the factory,” he adds.\nHe worked with South Korean artisans to fit out the restaurant.\nBenu is known for tasting menus that marry Korean and Asian flavours with Western techniques. On the menu at Na Oh is upscale traditional Korean food that chef Lee says is “full of rustic and homey reference points”.\nThe four-course prix fixe meals are priced at $78 a person, and comprise appetisers, banchan, a choice of main dish, and dessert.\nAppetisers are housemade tofu with aged soya sauce; buckwheat pancakes with aged kimchi and leeks, to be wrapped around lettuces from the innovation centre’s Smart Farm; and mulhwe, the chef’s take on the Korean chilled raw fish soup. His features white fish, sea cucumber, seaweed, and the farm’s crunchy and briny ice plant in an icy kimchi broth.\n“I hope our diners will appreciate that the flavour of everyday Korean food can be just as artisanal and delicious as any fine-dining offering, when treated with care and reverence,” chef Lee says.\nThe fermentation jars at the entrance of Na Oh hold Korean soya sauce; doenjang or fermented soya bean paste; and gochujang or fermented chilli paste.\nChef Lee says: “They allow diners to taste ingredients they probably consume every day – soy sauce and bean paste – but made using traditional methods without preservatives or pasteurisation. The fermentations are alive and continue to change.”\nAbout half the ingredients for the restaurant come from South Korea, he says, adding that fresh supplies of Napa cabbage and freshly pressed sesame oil, for example, arrive weekly.\nThe kitchen is also equipped with made-in-South Korea machinery for shaving ice and making noodles. The ice shaving machine chills liquid just before it is shaved, resulting in very fine, needle-like ice. For the summer menu, it is makgeolli ice. The buckwheat noodles are made in a machine that extrudes the noodles directly into boiling water, and done only upon order.\n“The next noodle we are working on is a thin wheat noodle for a hot beef soup, but there are so many possibilities,” chef Lee says. “I’m excited to work with a set-up that allows us to produce noodles in a way that is usually done only in restaurants that specialise in noodles.”\nHeading the kitchen in Singapore is Younghoon Kim, 30, who has worked in Singapore for six years, at Korean restaurants Onmi in Amoy Street and Anju in Tras Street; and Jaan by Kirk Westaway at Swissotel The Stamford, among other places.\n“He’s a meticulous chef, calm in nature and exceptionally mature for his age, and eager to lead,” chef Lee says, adding that chef Kim and the restaurant’s key staff had trained at Benu. The front-of-house staff at Na Oh also trained with Benu’s director of service for two months.\nThe menu will change four times a year, and chef Lee says he expects to be in Singapore four or five times a year.\nHyundai’s Smart Farm grows nine kinds of greens, including rainbow chard, mustard greens and sorrel. He is working to add to that repertoire, saying Korean perilla leaves and red ginseng are on the list of possibilities.\n“Na Oh is about recreating the memories of our cuisine through a creative process,” chef Lee says. “We don’t try to offer the best versions of dishes we’ve had, but the best versions of traditional food that we imagine.”\nNa Oh is located at Level 3, Hyundai Motor Group Innovation Center Singapore, 2 Bulim Link. Open 11.30am to 3.30pm, and 6 to 10pm (Wednesdays to Sundays), closed on Mondays and Tuesdays. For reservations, go to hyundai.com/sg/naoh", "url": "https://www.straitstimes.com/life/food/upscale-korean-soul-food-at-chef-corey-lee-s-na-oh-in-jurong-west"}