{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:56:25", "date_modify": "2024-10-12 13:56:25", "date_publish": "2023-03-23 12:00:00", "description": "& Other Stories opens new boutique Swedish fashion label & Other Stories has opened a second South-east Asia boutique at Raffles City mall. Read more at straitstimes.com.", "filename": "life_style_style-news-other-stories-opens-second-boutique-new-e-commerce-platform-for-all-things-sri-lankan_1728741385.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/23/2620Other20StoriesLos20Angeles2032028129_0.jpg?VersionId=lniY2Uq6Th3BIVcnOf7DGQfGIZbMplt0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-other-stories-opens-second-boutique-new-e-commerce-platform-for-all-things-sri-lankan_1728741385.html", "title": "Style News: & Other Stories opens second boutique, new e-commerce platform for all things Sri Lankan", "title_page": "Style News: & Other Stories opens second boutique, new e-commerce platform for all things Sri Lankan | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "& Other Stories opens new boutique\nSwedish fashion label & Other Stories has opened a second South-east Asia boutique at Raffles City mall.\nLike its flagship boutique at Ion Orchard, the new store showcases collections designed by the brand’s ateliers in Paris, Stockholm and Los Angeles.\nDo not miss the latest Spring/Summer 2023 collection. Expect classic trench coats, trouser suits, feminine blouses and dresses – and, of course, an explosion of florals.\n“When it comes to the time between winter and spring, chic outerwear is still an important part of the look. But we also start to see glimpses of what’s underneath and this season, we’ve focused on effortless elegance,” says the brand’s head of design, Ms Malin Sone.\nAs part of the opening promotion, customers who spend $380 and above at the Raffles City boutique will receive a limited-edition scented candle hand-painted by local artists Ripple Root, while stocks last.\nInfo: The new store is located at 01-02 Raffles City, 252 North Bridge Road.\nSri Lanka calling\nOne need not fly to Sri Lanka to experience some of the best things it has to offer, thanks to Tambapanni Collective’s recent launch in Singapore.\nThe luxury e-commerce platform showcases the country’s finest products and services, from traditional and contemporary art to slow fashion from Sri Lankan batik pioneer Sonali Dharmawardena and Sri Lankan jeweller Papillon Du The.\nFounder and chief executive Shimna Chandan says: “Tambapanni Collective prides itself on being a pioneering champion of meaningful Sri Lankan luxury to global markets, fuelled by the desire to pay tribute to the rich culture and heritage of Sri Lanka.\n“Our goal is to shine the spotlight on Sri Lankan artisans and invite global audiences to celebrate their craft with us.”\nPart of the profits will go to the Tambapanni Foundation, which funds a selection of charities supporting causes such as helping victims of abuse, and providing legal support for women and children in need.\nInfo: Go to tambapannicollective.com\nSweet treats from Dove\nFor sweet indulgence without the calories, check out beauty brand Dove’s new Ice Cream Body Scrubs.\nPriced at $12.90 each, the scrubs are infused with refined exfoliating microbeads, moisturising cream and glycerin to smoothen your skin.\nChoose from three different exfoliating strengths. The Sakura Smoothie is gentle enough for dry skin, while the Pomegranate Ice Cream’s moderate exfoliation suits all skin types. Dull and rough skin types will love the Sugar Sorbet’s deep exfoliating strength, with a yummy scent to boot.\nTo cap off the experience, pair a scrub with the Dove Self-Foaming Body Wash ($10.95 each), which contains creamy foam and hydro ceramides to lock in moisture.\nInfo: The body scrubs and body wash are available at Cold Storage, Giant, RedMart, Sheng Siong, Shopee, FairPrice, Guardian and Watsons.\nFree make-up exchange for Watsons members\nMake-up mavens, if you constantly find yourself spending money on products with the wrong shades or textures, Retailssure has got you covered.\nThis free make-up exchange assurance programme by healthcare and beauty chain store Watsons is exclusive to Watsons members.\nUnder the programme, customers can exchange opened or used make-up products bought from any Watsons store or online at www.watsons.com.sg within seven days from the date of purchase, or from the date of delivery for online orders.\nFor every transaction, one make-up product can be exchanged for another – provided it is within the same category – at any Watsons store.\nThe programme is applicable to the first 5,000 exchanges till June 30.", "url": "https://www.straitstimes.com/life/style/style-news-other-stories-opens-second-boutique-new-e-commerce-platform-for-all-things-sri-lankan"}