{"authors": ["Sherlyn Sim"], "date_download": "2024-10-12 13:58:13", "date_modify": "2024-10-12 13:58:13", "date_publish": "2023-11-03 19:00:04", "description": "Some fans feel it is inappropriate for its products to feature at a festival with a largely young demographic. Read more at straitstimes.com.", "filename": "life_japanese-sex-toy-giant-tenga-to-attend-s-pore-largest-anime-festival-move-draws-mixed-reactions_1728741493.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/05/ctartJSNQ1063.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_japanese-sex-toy-giant-tenga-to-attend-s-pore-largest-anime-festival-move-draws-mixed-reactions_1728741493.html", "title": "Japanese sex toy giant Tenga to attend S’pore largest anime festival, move draws mixed reactions", "title_page": "Japanese sex toy giant Tenga to attend S’pore largest anime festival, move draws mixed reactions | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – An announcement that a Japanese sex toy manufacturer will have a booth at Singapore’s largest Japanese pop-culture event has sparked a strong debate online, with some questioning the appropriateness of the move.\nIn a Facebook post on Wednesday, Anime Festival Asia (AFA) unveiled Tenga, one of Japan’s top adult toy brands, as an exhibitor at the three-day event.\nAFA Singapore 2023 will be held at Suntec Singapore Convention Centre from Nov 24 to 26.\nMore than 70 local and international exhibitors will be showcasing their latest merchandise, some of which are exclusive to the festival.\nAccording to the post, attendees are welcome to explore Tenga’s variety of products and try a dice challenge where they can win prizes from the brand.\nBy Friday afternoon, the post had drawn 1,000 “likes”, 1,200 shares and 264 comments.\nWhen first uploaded on Wednesday at 6.36pm, the post did not indicate an age restriction for visitors to Tenga’s booth.\nHowever, following an outcry from fans, AFA stated at 9.45pm that day that visitors to the booth were required to be aged 21 and above.\nAcknowledging that some have expressed concern over the accessibility of the booth’s contents, AFA told The Straits Times that the booth will be located in a corner of the event space and walled up to ensure the exhibit is presented in a “discreet and educational way”.\nPersonnel on-site will conduct verification to ascertain the ages of attendees before they are allowed to enter the booth. This includes requesting valid photo identification when necessary, the spokesman said.\n“Tenga holds a prominent space in Akihabara – it has even launched rockets into space,” said the spokesman. Akihabara is a shopping area in Tokyo famous for its anime and electronics products.\n“The decision to include Tenga in this year’s offerings stemmed from AFA’s goal to provide our attendees with an authentic insight into what J-culture and Akihabara have to offer.”\nSome fans reacted to the announcement with amusement, while others raised concerns about children and young people being exposed to the sex toy maker’s products.\nNanyang Polytechnic student Aloysius Oh, who has attended AFA for the past few years, said that he found it inappropriate, given the event’s large young demographic.\n“AFA’s audience is mainly young teenagers and adults, so a huge percentage will be considered underage. They might be curious and may start to search for the brand,” he said.\nOthers welcomed the move.\nPhotographer Benni Matchap, 30, said that sexual wellness product booths are commonly seen at anime events overseas like those in Japan and Taiwan.\n“(Japanese drugstore) Welcia-BHG and Don Don Donki already sell Tenga products while Watsons and Guardian sell adult products and vibrators. I don’t see what the issue is since these products are already available in public stores,” the photographer said.", "url": "https://www.straitstimes.com/life/japanese-sex-toy-giant-tenga-to-attend-s-pore-largest-anime-festival-move-draws-mixed-reactions"}