{"authors": ["Lee Nian Tjoe"], "date_download": "2024-10-12 14:19:02", "date_modify": "2024-10-12 14:19:02", "date_publish": "2023-10-13 18:10:50", "description": "The 2024 quota for motorcycle COEs will be comparable to that for 2023, said LTA. Read more at straitstimes.com.", "filename": "life_motoring_129-more-coes-available-from-nov-jan-supply-in-most-categories-set-to-rise-in-2024_1728742742.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/13/SYA09419.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_129-more-coes-available-from-nov-jan-supply-in-most-categories-set-to-rise-in-2024_1728742742.html", "title": "12.9% more COEs available from Nov to Jan; supply in most categories set to rise in 2024", "title_page": "12.9% more COEs available from Nov to Jan; supply in most categories set to rise in 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - A total of 12,774 certificates of entitlement (COEs) will be available in the November 2023 to January 2024 quota period – 12.9 per cent higher than the three-month supply from August to October.\nThe Land Transport Authority said on Friday evening that it expects the supply of COEs for cars and commercial vehicles to continue increasing in 2024, while the quota for motorcycle COEs will be comparable to that for 2023, but it did not elaborate.\nAmong the supply for the period from November to January are 1,895 car COEs slated to expire in projected peak-supply years, which have been brought forward to the current quota period.\nSuch COEs were renewed earlier for five years and cannot be revalidated further. This move was part of an extraordinary adjustment announced in May, under which about 6,000 such five-year COEs would be gradually reallocated over several quarters.\nA total of 4,967 Category A COEs, meant for smaller, less powerful cars and electric vehicles (EVs), will be available for tender between November and January.\nThis is 882 more COEs than the 4,085 in the current period – a 21.6 per cent increase. Category A received 1,570 reallocated COEs.\nThe supply of Category B COEs, which are for bigger, more powerful cars and EVs, will also climb. At 2,937 pieces, it is a 4.3 per cent increase from the 2,816 COEs in the current period.\nOf that number, 325 Category B COEs were reallocated from the pool of guaranteed deregistrations.\nAs for commercial vehicles (Category C), the supply of COEs will be cranked up to 924 pieces, a 35.1 per cent rise over the current supply of 684.\nWith a monthly supply of 3,105, there will be 5 per cent more COEs for motorcycles (Category D) between November and January.\nContributing to that figure were 267 motorcycle COEs that were returned. These expired between July and September, as they were not used to register motorcycles before the end of their one-month validity.\nThis was a 62.8 per cent increase from the 164 such COEs that expired in the previous quota period.\nIn the Open category, which can be used to register any vehicle type except motorcycles but ends up largely for bigger cars, the next quota period will have a total of 841 pieces, 8.2 per cent more than the current 777.\nThe main determinant of the COE supply for a given three-month quota period is the average number of deregistrations in the previous four quarters.\nThe higher quota comes at a time when COE premiums are at record highs, driven by robust demand and a restrictive supply.\nYet, in the immediate term, dealers said, the increased COE supply is not likely to fully satisfy the outsized demand fuelled by dealers chasing year-end sales targets.\nDealers are also likely to rush to close deals to avoid being stuck with cars that would become costlier in 2024, when incentives to encourage a switch to EVs are reduced and a stricter emissions-testing protocol is rolled out.\nKomoco Motors’ commercial director Ng Choon Wee expects COE premiums to stay high on the back of demand from The Car Expo this weekend, before the final tender exercise in October that ends next Wednesday. This is followed by a three-week gap until the first tender in November – instead of the usual two weeks – allowing dealers more time to secure orders.\nLooking ahead into 2024, Mr Neo Nam Heng, honorary adviser to the Automobile Importer and Exporter Association (Singapore) and chairman of diversified motor group Prime, said he hopes for more information on the overall supply for 2024, rather than having to react quarter to quarter.\nThis, he added, will enable vehicle importers to make plans.\n“For now, dealers should celebrate, as the higher quota announced will help ease the current (high COE price) situation. But remember, we are coming from a very small base (for quotas), so I don’t expect a big drop in COE premiums overnight.”", "url": "https://www.straitstimes.com/life/motoring/129-more-coes-available-from-nov-jan-supply-in-most-categories-set-to-rise-in-2024"}