{"authors": [], "date_download": "2024-10-12 14:00:07", "date_modify": "2024-10-12 14:00:07", "date_publish": "2022-03-10 23:22:21", "description": "Depardieu is accused of raping and sexually assaulting a young French actress at his home in Paris in 2018. Read more at straitstimes.com.", "filename": "life_entertainment_court-refuses-to-drop-rape-charge-against-french-actor-gerard-depardieu__gl=1_1cm6cm2__gcl_au_NDU5MzQ4NDI0LjE3MDAzNDQ1Njg_1728741607.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/10/FILES-FRANCE-JUSTICE-GENDER-INVESTIGATION-CELEBRITY-ASSAULT-FILM-WOMEN-110237.jpg?VersionId=3A1oCxGYgNxoUenSrgw.B_2cqbaEX_3K", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_court-refuses-to-drop-rape-charge-against-french-actor-gerard-depardieu__gl=1_1cm6cm2__gcl_au_NDU5MzQ4NDI0LjE3MDAzNDQ1Njg_1728741607.html", "title": "Court refuses to drop rape charge against French actor Gerard Depardieu", "title_page": "Court refuses to drop rape charge against French actor Gerard Depardieu | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS (AFP) - A Paris court on Thursday (March 10) rejected a bid by Gerard Depardieu to have rape charges against him dropped, the chief prosecutor in the case said, raising the prospect of a trial for the iconic French actor.\nDepardieu, 73, was charged with raping and sexually assaulting a young French actress at his home in Paris in 2018, an accusation he has called \"baseless\".\nBut Paris chief prosecutor Remy Heitz said in a statement that there was \"serious and confirmed evidence that justifies Gerard Depardieu to remain charged\" in the case brought by the actress, Charlotte Arnould.\nThe case will now go back to the prosecuting magistrate who is to resume her work on the case, Heitz said.\nArnould, who was present in the courthouse, declined to comment on the decision, but her lawyer, Carine Durrieu-Diebolt, told AFP that her client was \"relieved\".\nDepardieu's lawyer, Herve Temime, declined to comment.\nArnould filed her complaint in the summer of 2018 when she was 22, saying she had been raped twice by Depardieu in his swank Left Bank mansion in the French capital a few days earlier.\nProsecutors dropped the case in June 2019, citing lack of evidence, but it was reopened the following year after Arnould filed a new complaint.\n'Trying to survive'\nThe actor was charged in December 2020 but not jailed, or even ordered under judicial supervision.\nOne year later, Arnould revealed her identity on Twitter, saying: \"I am Depardieu's victim. He was charged one year ago. He is working, while all I am doing is trying to survive.\"\nDepardieu is a friend of Arnould's family and has known her since she was a child.\nIn 1991, Time magazine asked Depardieu about a 1978 interview in Film Comment magazine in which he described his rough childhood and was quoted as saying, \"I had plenty of rapes, too many to count\".\nAsked if he had participated in the rapes, he told Time that he had. \"But it was absolutely normal in those times,\" the actor said.\nDepardieu later denied making the remarks and threatened to sue the magazine, but Time refused to retract the passage, saying the interview had been recorded on tape.\nDepardieu became a star in France from the 1980s with roles in The Last Metro, Police and Cyrano De Bergerac, before Peter Weir's Green Card also made him a Hollywood celebrity.\nHe later acted in global productions, including Kenneth Branagh's Hamlet, Ang Lee's Life Of Pi and Netflix's Marseille series.\nIn 2013, he sparked an outcry by leaving France and taking Russian nationality to protest a proposed tax hike on the rich in his homeland.\nDepardieu, a friend of Russian President Vladimir Putin, last week came out against the war in Ukraine and called for negotiations.\n\"I am against this fratricidal war. I say 'stop the weapons and negotiate',\" Depardieu said.\nDepardieu currently stars in two films showing in French cinemas. In one, he plays the role of Maigret, the fictional police detective created by writer Georges Simenon, who investigates the murder of a young girl.\nIn the other, Robust, he plays an ageing, jaded actor who develops a relationship with a young female security guard.", "url": "https://www.straitstimes.com/life/entertainment/court-refuses-to-drop-rape-charge-against-french-actor-gerard-depardieu?_gl=1*1cm6cm2*_gcl_au*NDU5MzQ4NDI0LjE3MDAzNDQ1Njg."}