{"authors": [], "date_download": "2024-10-12 13:27:22", "date_modify": "2024-10-12 13:27:22", "date_publish": "2024-07-22 15:45:00", "description": "The rock band Nirvana sued the fashion line after it announced a Bootleg Redux Grunge collection in 2018. Read more at straitstimes.com.", "filename": "life_entertainment_who-s-smiling-now-nirvana-and-marc-jacobs-settle-logo-lawsuit_1728739642.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/22/ainirvana220724.jpg?VersionId=0KxZ3EsZLrHqgMyynTJul1ubf38kaLJ7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_who-s-smiling-now-nirvana-and-marc-jacobs-settle-logo-lawsuit_1728739642.html", "title": "Who’s smiling now? Nirvana and Marc Jacobs settle logo lawsuit", "title_page": "Who’s smiling now? Nirvana and Marc Jacobs settle logo lawsuit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Oh, that lawsuit American rock band Nirvana filed against fashion line Marc Jacobs for using their smiley face logo without permission?\nNever mind. After more than half a decade, the sides have agreed to settle.\nThe corporate entity representing Nirvana sued Marc Jacobs International in 2018 after the fashion line announced it would release a Bootleg Redux Grunge collection of clothing featuring a smiley face logo that the lawsuit called “virtually identical to Nirvana’s copyrighted image”.\nNirvana’s smiley face has an uneven head, X’s for eyes and a wavy smile with a tongue sticking out on the right side of its face. Marc Jacobs’ smiley face, which was part of clothing designs and general marketing promotion for the collection, looks the same but swops in an “M” and “J” for the X’s.\nThe rock band have used their smiley face logo since the early 1990s. In addition to the poster for the release party for the Nevermind album (1991), the symbol has been included on T-shirts, hoodies, shot glasses and other merchandise.\nThe Marc Jacobs collection was a callback to the eponymous designer’s 1992 grunge collection for Perry Ellis, which both got him fired from the company and announced his arrival as a major force in the fashion world.\nMarc Jacobs’ 2018 campaign also included several references to Nirvana songs. “This bootleg sure smells like teen spirit,” read the webpage for each product.\nOne promotional photo for the collection included in the lawsuit shows Jacobs wearing a smiley face T-shirt above the text “Come As You Are”.\nThe yellow-on-black styling of the logo and the typeface used on the shirts were also similar to Nirvana’s recognisable designs, the band’s lawyers argued.\nThe compounding similarities were part of a campaign to associate the collection with Nirvana without permission, “so as to make the Grunge association with the collection more authentic”, the lawsuit reads.\nIn response, Marc Jacobs International pursued a counterclaim alleging that the band had not filed proper copyright registration for the logo and questioning their lawyer’s story that Nirvana frontman Kurt Cobain had drawn it.\nThe terms of the settlement, which was announced in a July 9 filing, have not been disclosed in court documents, and lawyers for Nirvana and Marc Jacobs International did not respond to requests for comment.\nThe settlement also resolved a legal challenge from Robert Fisher, a former artist for Geffen Records, who claims that he created the smiley face logo.\nCopyright litigation is common in the entertainment world.\nThe United States Supreme Court ruled in 2023 that American artist Andy Warhol did not have the right to use a photographer’s portrait of the musician Prince in Warhol’s own work, limiting the scope of a fair-use defence against copyright infringement, especially for commercial purposes.\nMarc Jacobs did not pursue a fair-use case, which Mr Daniel Lifschitz, a litigator who specialises in copyright law, said would have been challenging because of the company’s commercial purpose of selling clothes.\nMr Lifschitz, who works for the Beverly Hills law firm Johnson & Johnson and teaches the Nirvana-Marc Jacobs case as part of a course at University of California, Los Angeles’ extension school, said the key issue at hand was selection and arrangement.\nYou cannot hold a copyright for the idea of a smiley face, he said, but you can have a copyright for specific characteristics arranged in a certain way.\n“Marc Jacobs overplayed its hand in the designing phase, thinking that, ‘Oh, this is just a basic smiley face, this couldn’t be protectable by copyright,’” he said. “That was dumb advice.” NYTIMES", "url": "https://www.straitstimes.com/life/entertainment/who-s-smiling-now-nirvana-and-marc-jacobs-settle-logo-lawsuit"}