{"authors": ["Tan Hsueh Yun"], "date_download": "2024-10-12 14:03:33", "date_modify": "2024-10-12 14:03:33", "date_publish": "2024-06-29 15:00:00", "description": "For Japan's Royal Host and Malaysia's Choy Kee Bakery and Oriental Kopi, Singapore is the first stop in their expansion plan. Read more at straitstimes.com.", "filename": "life_food_4-big-overseas-brands-take-on-tough-singapore-food-scene_1728741813.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/29/rrfood2906.jpg?VersionId=_Unw4qT4jTV3aA.U5NYkM.fcnVousxSv&h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_4-big-overseas-brands-take-on-tough-singapore-food-scene_1728741813.html", "title": "4 big overseas brands take on tough Singapore food scene", "title_page": "4 big overseas brands take on tough Singapore food scene | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – They have made a name for themselves in their home countries. And like many other food brands before them, this newest wave is looking to win over Singaporeans too.\nFor three of the brands – Royal Host from Japan, and Choy Kee Bakery and Oriental Kopi from Malaysia – Singapore is the first stop in their expansion plan. The fourth, Sri Lanka’s Ministry Of Crab, is setting up its sixth overseas restaurant – first one in Singapore – and is eyeing expansion into other South-east Asian cities.\nNever mind the tight labour market, high rents and fierce competition that food and beverage operators contend with here.\nMr Dharshan Munidasa, the 53-year-old founder of Ministry Of Crab, is unfazed. Aside from the flagship in Colombo, he also has restaurants in Bangkok, Chengdu, Maldives, Mumbai and Shanghai.\n“Every country has different challenges,” he says.\nMr Daisuke Fujii – chief executive and managing director of Royal Food Services (Singapore), which runs the Royal Host restaurant here – says the brand is eyeing Indonesia and the Philippines next.\n“We thought the best idea was to open the flagship store in Singapore first,” the 46-year-old says. “Perfect everything in Singapore.”\n1. Royal Host: Family-friendly yoshoku\nWhere: 03-219 Jewel Changi Airport, 78 Airport Boulevard\nOpen: From July 2, 10.30am to 10pm (Sundays to Thursdays), 10.30am to 11pm (Fridays and Saturdays). From July 20, 8.30am to 10pm (Sundays to Thursdays), 8.30am to 11pm (Fridays and Saturdays)\nTel: 6908-5591\nInfo: @royal_host_sg (Instagram)\nThis 53-year-old Japanese food brand, established in Fukuoka in 1971, is nothing if not serious.\nA year ago, Royal Host – a chain of family restaurants serving yoshoku, or Japanese takes on Western food – set up a Singapore company to run its operations here.\nTeams in Singapore and Japan worked on replicating the chain’s famous hamburg patties using beef sourced here, among other things. Ingredients flew back and forth between Singapore and Japan, and the team over there perfected recipes using ingredients from here to achieve that Royal Host taste. They also created sauces, black pepper and snow crab and chilli, for the Singapore menu.\nUnlike many overseas brands, which train a local crew to run the operations, Royal Host has a five-member Japanese team stationed here permanently: chief executive Daisuke Fujii; head chef Yasuhiro Makishima, who has worked more than 20 years at Royal Host; chief financial officer Mitsuri Takaya; operations manager Kota Nagatsuka; and operations staff Mai Sakai. Two staff members recruited in Singapore are training in Japan for a month.\n“The reason we came to Singapore is to build the brand in Asia,” Mr Fujii says. “Honestly, it was not necessary to do that before. We focused just on the domestic market, but the Japanese market is shrinking.”\nEven the location for the first restaurant, Jewel Changi Airport, is significant. Royal Host founder Kyoichi Egashira had got his start in 1951 at the Fukuoka airport, providing in-flight meals and operating a cafe there. The empire he built now includes 223 Royal Host restaurants in Japan, and other food brands, such as Standard Coffee. It also has the Richmond Hotel chain, runs restaurants at airports, highway rest stops and hospitals, and has a food manufacturing arm.\nAll of that food and hospitality know-how is now being trained on its 90-seat restaurant, which will open on July 2.\nAlthough many of the sauces come frozen from Japan, important components are made here. The housemade Royal Hamburg Steak patties are a mix of coarsely and finely ground beef, kneaded using a technique the chain developed. Fu, or wheat gluten, acts as a binder to keep the meat juices in. It is priced at $29.80 and diners can choose to have it with brown butter, wafu or black pepper sauces. The 250g Royal Sirloin Steak is priced at $64.80.\nAnother signature is the Omelette Rice, or omu rice, enveloped in a soft omelette made with Japanese eggs. It is priced at $26.80 with demiglace sauce; $28.80 with Hiroshima Oyster & White Cream sauce; and $30.80 with Snow Crab & Chilli Sauce.\nThese dishes can be had with baguette for $3.40, Japanese rice for $3.80 or Onion Gratin Soup for $7.80. The soup is said to be a favourite of the late American actress Marilyn Monroe, who had it when she dined three times at the founder’s French restaurant, Royal Nakasu Honten. This was when she visited Fukuoka in the 1950s with her then husband, baseball player Joe DiMaggio.\nRoyal Host is starting with a smaller menu of signatures, with the full menu available from July 20. Still to come, Mr Fujii hopes to be able to offer fruit parfait featuring Japanese fruit picked at the peak of the season.\nAfter operations stabilise, he will look at opening more Royal Host restaurants here, perhaps in the Orchard Road area, on Sentosa, or at Raffles City or Marina Bay Sands.\nHe knows the food scene in Singapore well, having worked here five years for another Japanese food brand. The father of three children, aged 12, 10 and five, says his youngest, a girl, speaks Singlish and missed her Singapore friends when the family returned to Japan.\nNow, they are back – not to stay but to live. And he is ready to widen the reach of Royal Host. The stakes are high.\n“I bet my life,” he says.\n2. Ministry Of Crab: Crab-tivating shellfish\nWhere: 6 Dempsey Road\nOpen: From July 3, 6 to 11pm (Wednesdays to Mondays), closed on Tuesdays\nTel: 8389-0948\nInfo: ministryofcrab.com\nSri Lankan mud crabs are everywhere on seafood restaurant menus in Singapore. They are cooked in black or white pepper sauces, with butter, with that very Singaporean chilli sauce, or steamed.\nWhen Sri Lankan brand Ministry Of Crab opens on July 3, at a standalone colonial building in the Dempsey lifestyle enclave, it will serve live, wild-caught Sri Lankan crab cooked in ways that reflect founder Dharshan Munidasa’s Sri Lankan-Japanese parentage.\nThere is the best-selling Garlic Chilli, as well as Black Pepper Dashi, Original Recipe Spicy, Sri Lankan Curry, Garlic and Garlic Pepper. The crabs are flown in three times a week from one supplier he has used for more than 20 years.\nThe flavours, the 53-year-old says, do not come from pre-made sauces. Instead, the wok cooking process creates sauces which can be mopped up with cubes of kade paan, a traditional Sri Lankan bread with a texture and taste that is a cross between Japanese shokupan and local perancis, or French loaves.\nDiners can also opt for Pure Crab, which needs to be pre-ordered. The crustacean is steamed then chilled, and is served with warm butter, housemade calamansi ponzu and chilli vinegar.\nPrices start at $75 for a 500 to 600g crab, cycling through small, medium, large, XL, Kilo Krab, Jumbo, Colossal and OMG!!!, before topping out at $350 for a 2kg Crabzilla.\nThe menu also includes freshwater prawns of different sizes, which can be cooked with sauces such as Butter Soy, Pepper, Garlic Chilli and Olive Oil & Soy, among others. Also on the menu are Crab Chawanmushi ($15), Crab Liver Pate ($25) and Oyster Sixers ($40 for six), Japanese oysters served with housemade hot sauce and aged soya sauce.\nChef Munidasa has also put his “soupless ramen” on the Singapore menu. It is a dish he created and which is served at Nihonbashi, his first restaurant in Colombo. Shirunashi Ramen ($40) is a dry ramen featuring freshwater prawns. He developed it for the tropics, as “it’s challenging having hot soup in hot weather”.\nHe is well acquainted with Singapore food, having visited the city since his childhood days. So he is working on Hokkien mee for the menu, featuring freshwater prawns.\nWhen The Straits Times shows up to interview chef Munidasa, he is conferring with his bread supplier and looking at the crumb of several test loaves of kade paan.\n“I’m looking for more holes in the crumb,” he says.\nDetails matter in the 68-seat restaurant, which cost $1.5 million to set up. So intent is he on nailing down every detail that he is getting heliconias flown in to Singapore. They are the signature flower decoration for Ministry Of Crab restaurants. Are there no heliconias here? His team searched far and wide but did not find any with long enough stems, he says.\nThe bone china plates are made in Sri Lanka by Japanese company Noritake, another detail that reflects his heritage.\nIn the kitchen are a charcoal grill and a wok station, with steel woks from Japan that are used in all the restaurants. There is also a traditional Sri Lankan grinding stone, for making Pol Sambol ($8), a made-to-order coconut relish with dried bonito, what the Sri Lankans call Maldive fish.\nHe is credited with serving export quality Sri Lankan crab in his home country. Before Ministry Of Crab started, most of the crustaceans were exported. Now, some 50,000 crabs a year are served at his Colombo restaurant, which he opened in 2011 with Sri Lankan cricketing giants Mahela Jayawardene and Kumar Sangakkara.\nChef Munidasa acknowledges that the manpower crunch here is a challenge. Two Sri Lankan chefs will be stationed in Singapore to run the kitchen.\n“We have also found some young talent here,” he says. “We flew them to Sri Lanka and they spent two weeks with us, going on team-building adventures such as river rafting. They got to play in nature a lot, and connected with our suppliers. They got to experience the mothership, we showed them who we are. We are lucky we can do that.”\nOnce business settles down, he will introduce lunch service. There are also plans to open another restaurant in Singapore, and he is eyeing Sentosa.\n“Regionally, we are hoping to open in cities around us,” he says, adding that he is looking to Malaysia, Indonesia and Hong Kong. “They are closer to the crab supply.”\n3. Choy Kee Bakery: Secret recipe egg tart\nWhere: Ipoh Town, B1-299 Jewel Changi Airport, 78 Airport Boulevard\nOpen: 11am to 10pm daily\nInfo: @ipohtown.asia (Instagram)\nChoy Kee Bakery, a family business in Ipoh, is famous for its egg tarts. On weekends, more than 2,000 of them land in the hot hands of fervent fans, who, it is said, include Hong Kong celebrity chef Hugo Leung and actress-singer Ella Koon.\nA selection of its pastries, including the famous egg tarts, is available at Ipoh Town, a restaurant in Jewel Changi Airport serving Ipoh dishes, such as Fragrant Curry Toast With Soft Boiled Egg, Fried Turnip Cake and Ipoh Overjoy White Coffee, the foamy crema spilling over the rim of the cup.\nChoy Kee, which has been around since 1982, was started by Mr Lau Hon Choy, who had worked in dim sum restaurants. His children now run the business, which has three shops in Ipoh. Singapore is its first foray overseas, and a spokesman said the family decided to do it because they are friends with the owners of Ipoh Town.\nThere is no queue – yet – for the egg tarts in Singapore, judging by a visit to the restaurant, but customers in Ipoh have been known to wait 40 minutes or longer.\nWhat makes them worth queuing for?\n“The egg tart recipe is a family secret, perfected by Mr Lau from his years of experience in dim sum restaurants,” says the spokesman. He adds that fresh ingredients go into the pastries, and they are baked throughout the day for optimal flavour and a flaky crust.\nThe tarts, priced at $2.40 each, are baked here using the same recipe.\nThe spokesman adds: “Business has been positive since we opened in Singapore. We are currently selling around 100 to 150 egg tarts a day.”\nOther offerings include Fried Char Siew Bao ($6.90 for three), Rendang Pie ($3.50 each), Lo Mai Gai ($4.90), Dang Gui Siew Mai ($6.90 for three), Golden Lava Bao ($6.90) and Fried Beancurd Skin Prawn Roll ($6.90 for three).\nThe brand is set to grow along with Ipoh Town. The owners have plans to open five to six more restaurants in Singapore, as well as elsewhere in South-east Asia.\n4. Oriental Kopi: 128-layer egg tarts\nOpens: Third quarter of 2024\nEpic queues have been known to form outside Oriental Kopi’s 14 outlets in Malaysia, especially in Johor Bahru, which Singaporeans frequent. About 15 per cent of its weekday customers are from Singapore and that number goes up to 30 per cent on weekends, the chain says.\nLater in 2024, some of those people might find themselves queuing at an “iconic location in a prime area” in Singapore for those famously thick and flaky egg tarts, when the chain opens its first store here, with the Paradise Group as partners.\nThe brand is a young one. Datuk Calvin Chan, an entrepreneur in the mobile phone business and one of the winners of Malaysia’s Top Ten Outstanding Youth Award in 2020, started it in 2021. Singapore is the brand’s first foray outside Malaysia.\nHe says: “Singapore is a vibrant hub for food lovers, with a growing appreciation for diverse cuisines. We believe our unique Malaysian breakfast concept will be a welcome addition. Singaporeans also have a reputation for appreciating high-quality food. We’re confident our commitment to authentic flavours and high-quality ingredients will resonate with them.”\nDiners here will be able to order the brand’s signatures, such as Oriental White Coffee, made with a blend of Arabica, Robusta and Liberica beans. Hardy Liberica beans are grown mostly in South-east Asia, in the Philippines, Malaysia and Indonesia. The combination of beans, which Oriental says is roasted for hours at medium-low temperatures, makes its coffee rich and aromatic, and not overly bitter.\nAlso on the menu – Oriental Egg Tart with 128 layers. The pastry is made with high-gluten flour and butter, then hand-folded to get a light and crispy pastry. The tarts, with a caramelised egg filling, are baked over low heat. Other offerings include Oriental Polo Bun stuffed with cold butter and honey or condensed milk, nasi lemak, mee siam, Nanyang curry chicken rice and chicken hor fun.\nPrices are still being worked out. A cup of Oriental Kopi is priced at RM10.49 (S$3.02) in Malaysia. The egg tart is RM39.86 and the polo bun costs RM8.37.\nMr Chan says: “We will do our best to ensure it is priced competitively among local coffee joints.”\nMiss Lin Sifang, 39, director of marketing and communications for the Paradise Group, says of its partnership: “Since Paradise Group operates in Malaysia, we’ve become familiar with Oriental Kopi, a well-regarded F&B concept there. With travel restrictions easing after Covid-19, it has also gained more exposure among Singaporeans travelling to Malaysia.\n“What impresses us most about Oriental Kopi is its focus on Malaysian-style breakfast cuisine, along with its high-quality food offerings and signature items. We believe Singaporeans would likely appreciate this type of cuisine.”\nAt the very least, Choy Kee Bakery and Oriental Kopi’s entry to the Singapore market might well spark an egg tart war.", "url": "https://www.straitstimes.com/life/food/4-big-overseas-brands-take-on-tough-singapore-food-scene"}