{"authors": ["Yamini Chinnuswamy"], "date_download": "2024-10-12 14:05:44", "date_modify": "2024-10-12 14:05:44", "date_publish": "2023-02-05 15:30:00", "description": "He claimed he was also sexually abused by a youth pastor when he was 13. Read more at straitstimes.com.", "filename": "life_entertainment_actor-armie-hammer-contemplated-suicide-after-sex-abuse-allegations_1728741944.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/05/aiarmie0502_6.jpg?VersionId=eUVFisbWiaXlviMnZbHE7jFQYnJ5UoGv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_actor-armie-hammer-contemplated-suicide-after-sex-abuse-allegations_1728741944.html", "title": "Actor Armie Hammer contemplated suicide after sex abuse allegations", "title_page": "Actor Armie Hammer contemplated suicide after sex abuse allegations | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – American actor Armie Hammer gave his first interview in two years, after a series of sexual abuse allegations derailed his film career.\nIn the new interview, published in Air Mail, a digital newsletter co-founded by former Vanity Fair editor Graydon Carter, Hammer said he attempted suicide in February 2021, in the wake of the first round of allegations.\nHe said: “I just walked out into the ocean and swam out as far as I could and hoped that either I drowned, or was hit by a boat, or eaten by a shark. Then I realised that my kids were still on shore, and that I couldn’t do that to my kids.”\nHammer, 36, shares an eight-year-old daughter and six-year-old son with American television personality Elizabeth Chambers, 40, whom he married in 2010. They separated in 2020.\nIn January 2021, it was reported that multiple women alleged the star of Call Me By Your Name (2017) sexually and emotionally abused them.\nAt least one accused Hammer of cannibalistic fantasies. Ms Courtney Vucekovich told United States tabloid Page Six: “He said to me he wants to break my rib and barbecue and eat it.”\nSoon after, Hammer exited multiple film projects – including Shotgun Wedding (2022) with Jennifer Lopez, in which he was replaced by Josh Duhamel – and was dropped by his talent agency.\nThen in March, a young woman accused Hammer of raping her in 2017 in Los Angeles. At the time, the police said they were investigating the claim.\nBut in the new interview, Hammer claimed that the “alleged rape was a scene that was her idea”.\n“She planned all of the details out, all the way down to what Starbucks I would see her at, how I would follow her home, how her front door would be open and unlocked and I would come in, and we would engage in what is called a ‘consensual non-consent scene’.”\nHammer added that the woman, known as Effie, turned on him after realising that he would not leave his wife. “I think she just realised that my marriage was always going to be in the way of us being together.”\nThe article went on to highlight that Effie did not initiate legal proceedings against Hammer, and claimed Effie continued to contact Hammer with “sexually explicit” text messages more than three years after the rape allegedly occurred.\nMeanwhile, Hammer explained that his interest in “consensual non-consent” could be traced back to his own experience of sexual abuse as a child.\nHe said that at the age of 13, he was sexually abused by a youth pastor at the church frequented by his family.\n“What that did for me was it introduced sexuality into my life in a way that it was completely out of my control. I was powerless in the situation. I had no agency in the situation. My interests then went to: I want to have control in the situation, sexually.”\nHammer added that Chambers has yet to sign their divorce agreement, and that “no one (in Hollywood) will hire me”.\n“And no one will touch me because if they hire me, then they are the people who support abusers.,” he said.\nStill, Hammer denies criminal wrongdoing, and boils down his behaviour and subsequent accusations to being “an a**hole”.\nHe said: “I’m here to own my mistakes, take accountability for the fact that I was an a**hole, that I was selfish, that I used people to make me feel better, and when I was done, moved on.\n“I’m now a healthier, happier, more balanced person. I’m able to be there for my kids in a way I never was… I’m truly grateful for my life and my recovery and everything. I would not go back and undo everything that’s happened to me.”", "url": "https://www.straitstimes.com/life/entertainment/actor-armie-hammer-contemplated-suicide-after-sex-abuse-allegations"}