{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:17:19", "date_modify": "2024-10-12 14:17:19", "date_publish": "2023-01-06 16:00:00", "description": "The new year unleashes a flurry of latest models, several delayed by the global supply chain crisis. Read more at straitstimes.com.", "filename": "life_motoring_new-cars-galore-in-2023_1728742639.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/08/dw-cars-230105.jpg?VersionId=rnPsHGhwb4v_wuqKgEqX_iQ.IKTX8PsV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_new-cars-galore-in-2023_1728742639.html", "title": "New cars in 2023: More green options among choices galore", "title_page": "New cars in 2023: More green options among choices galore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Certificate of entitlement (COE) prices are likely to remain firm in 2023, which is generally bad news for those looking to buy a new car.\nBut on the bright side, incentives to nudge consumers towards greener choices – such as hybrid and electric models – will remain unchanged for the year.\nThe greenest cars stand to qualify for rebates of up to $45,000. On the one hand, high COE prices dull the attractiveness of this sizeable carrot.\nOn the other hand, should incentives be pared down from 2024 (which can well happen), buyers waiting for COE prices to soften may end up at square one.\nBut for those who need or want to buy a new car in 2023, many new offerings will be in store, as usual. Here are some of them.\nAudi\nIf you are in the market for a high-powered car with practicality, the first-ever M3 Touring will arrive in the first quarter. The new M2, with its polarising design and 460hp of oomph, will follow in the second quarter. It will be accompanied by the radical XM – a 750hp and 1,000Nm beast slated to be the fastest sport utility vehicle (SUV) on the market. There will also be facelifts for the 3-series, 5-series, X5, X6 and Z4.\nBYD\nThe Dolphin is a tall subcompact five-door that should prove interesting for those looking for a budget-friendly electric car.\nAlso known as the Atto 2, the Dolphin has less room than the Atto 3, with less performance as well as a smaller battery.\nBut with its diminutive size, its range should be decent enough for Singapore.\nThe new Mustang (available in coupe or convertible form) may be the final combustion variant of the iconic model. The latest pony is touted as the most track-ready naturally aspirated Mustang ever, with an upgraded suspension, improved aerodynamics and a 5-litre V8 paired with a 10-speed autobox. It will also be the first new Ford model Singapore has seen in a long while.\nHyundai\nThe Emira sports car will first arrive with a supercharged 3.5-litre V6 paired with a six-speed manual. It has 400bhp and 420Nm, and hits 100kmh in 4.3 seconds before peaking at 290kmh. It is also available with a six-speed autobox, which boasts a 4.2-second century sprint. A 2-litre turbocharged variant with 360bhp and 430Nm should follow next.\nMazda\nThe MX-30 is a stylish electric subcompact with rear suicide doors, just like BMW’s first battery-powered car, the i3. Measuring slightly less than 4.4m long and 1.8m wide, the MX-30 is powered by a 35.5kWh battery, which gives it just under 200km of real-world range. While that may not be extraordinarily long, it is ideal as an urban runabout because the smallish battery means the car is relatively light and also, hopefully, wallet-friendly.\nMercedes-Benz\nMercedes says it plans to launch more than 10 new models across all segments in 2023. But it does not give a lot of details.\nIt does say, however, that the sexy Mercedes-AMG SL will arrive. As will the second-generation GLC sport utility vehicle (SUV), the EQE electric SUV and its upsized sibling, the EQS electric SUV. So there is a good mix for EV supporters as well as those who still yearn for the sound and fury of a combustion engine.\nMG\nThe new MG4 EV, a rear-wheel-drive compact crossover promising a 50-50 weight distribution, will debut. This is the first MG built on a modular scalable platform. Looking like a real winner, the MG4’s battery structure has a height of just 110mm, enhancing roadholding and driver engagement. Initially available with battery capacities from 51kWh to 64kWh, the MG4 will be capable of a range of between 349km and 450km.\nNissan\nThe new e-308 electric hatch should be a hoot. It promises a range of 397km from its 51kWh battery, and packs 115kW of power and 260Nm of torque, giving it almost enough punch to qualify as a hot hatch. And if the peachy Peugeot e-2008 is anything to go by, the e-308 will be pleasing to both driver and passengers.\nPolestar\nThe Polestar 3 electric SUV will initially be available with a dual-motor, rear-biased drivetrain producing 360kW and 840Nm of torque. And if that is not enough for power-hungry folks, there is an optional Performance Pack which ups output to 380kW and 910Nm. A 111kWh battery pack provides a range of up to 607km. The car is slated to arrive by the end of 2023.\nRange Rover\nThe Megane E-Tech, due in the third quarter of 2023, is a hip-looking electric five-door which kicks off Renault’s all-electric offensive. It is powered by a 160kW motor, which takes it to 100kmh in 7.5 seconds. The French car promises a range of 448km and, with the appropriate charger, it can regain nearly 300km within half an hour.\nSubaru\nSubaru’s new WRX is here at long last. The car will be powered by a 2.4-litre direct-injection turbocharged four-cylinder Boxer engine with 271hp and 350Nm. This will be paired with either a six-speed manual gearbox or an eight-step continuously variable transmission. The six-speed manual gearbox takes six seconds to reach 100kmh, while the eight-step continuously variable transmission achieves that in 6.1 seconds, according to provisional figures.\nSuzuki\nThe Corolla Cross is the first crossover to bear the Corolla name. It is already on the road in a number of markets in the region. This model should be tempting for those who feel the Yaris Cross is too small.\nThe GR86 is on the other end of the spectrum, being made for driving pleasure alone. With 228hp going to the rear wheels, the GR86 hits 100kmh in 6.1 seconds and a top speed of 224kmh.\nOver at Toyota luxury arm Lexus, buyers can look forward to the fifth-generation RX, which boasts a substantially longer wheelbase and improved driving dynamics.\nAfter a couple of false starts, the ID4 electric crossover is finally poised to arrive in 2023.\nProduced in 2020, the ID4 is about the size of a VW Tiguan and is expected to be priced in the same ballpark, starting at around $220,000 at current certificate of entitlement rates. It has a declared range of 400km while the Golf-size ID3, which should follow later, has a range of around 420km.\nBut before that, the Skoda clone of the ID4 – the Enyaq iV – will debut. So, too, will the VW ID Buzz, an electric version of the beloved Kombi minivan.\nEditor’s note: An earlier version of this article said the Corolla Cross is Thai-made. It is made in Japan. We are sorry for the error.", "url": "https://www.straitstimes.com/life/motoring/new-cars-galore-in-2023"}