{"authors": [], "date_download": "2024-10-12 14:04:28", "date_modify": "2024-10-12 14:04:28", "date_publish": "2024-07-08 11:30:00", "description": "Since the show's 2022 debut, it has become a fixation for some to parse out what chef character Carmy is wearing. Read more at straitstimes.com.", "filename": "life_entertainment_some-people-love-the-hit-restaurant-set-series-the-bear-for-the-clothes_1728741868.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/09/Bear-E30700081101.Still02120.jpg?VersionId=OyaqP4ojW4YFhEGoHfR2gZyX9hrZFdvI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_some-people-love-the-hit-restaurant-set-series-the-bear-for-the-clothes_1728741868.html", "title": "Some people love the hit restaurant-set series The Bear - for the clothes", "title_page": "Some people love the hit restaurant-set series The Bear – for the clothes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – The hit comedy-drama The Bear (2022 to present) is about many things: complicated family dynamics, grief, toxic workplace environments, Chicago, vocational obsession and, of course, food.\nBut for some people, it is really just a show about clothes set in and around a Chicago restaurant.\nNow available on Disney+, the show’s third season has given style-obsessed viewers plenty of fodder.\nIn the first episode, Carmen “Carmy” Berzatto (Jeremy Allen White) wears a weathered Barbour Ogston jacket in olive during a flashback. Later in the season, he wears a cotton deck jacket from the workwear-inspired Ralph Lauren sub-label RRL.\nJ. Crew released a capsule collection – a hat, T-shirt, sweatshirt and workwear jacket – emblazoned with the logo of the fictional business belonging to the Fak brothers from the show, played by Matty Matheson and Ricky Staffieri.\nUnlike the romance comedy series Sex And The City (1998 to 2004), which had Carrie Bradshaw’s Fendi baguette bags, and family drama Succession (2018 to 2023) on HBO that had its “ludicrously capacious” Burberry bag, The Bear was not conceived with any major ties to the fashion world.\n“I didn’t expect this. Not at all,” said the show’s costume designer Courtney Wheeler. “Our show isn’t outwardly about fashion, like Sex And The City or Emily In Paris. It’s what we think the world where these characters inhabit would feel like. That people respond to it is really awesome, but it wasn’t necessarily our intention.”\nBut since The Bear’s debut in 2022, it has become a fixation for some to parse out what the characters are wearing, particularly the main character Carmy, a wounded yet fiery chef who turns his dead brother’s humble Italian beef sandwich shop into a temple of fine dining.\nOnline sleuths, for example, tracked down the exact plain white T-shirt that White wears on the show for all three seasons – the 215 men’s loopwheeled T-shirt made by Merz b. Schwanen, which costs about US$85 (S$115).\nThe German company, which opened its first US store in 2024, was unaware the shirt would be featured and experienced a surge in interest, which led to the company’s website crashing temporarily.\nSimilarly, a wool jacket with a patchwork design from the cult Danish brand NN.07 that White wore in the first season has since become a fetishised menswear item. Ms Wheeler recalled having a sales associate at Bloomingdale’s take it off a mannequin so that she could present it during a fitting, and White gravitated towards it.\nOnce it was identified on a Reddit menswear forum, the jacket – a style known as the Gael – sold out. It has since been restocked twice, selling out both times within 30 minutes, wrote Mr Mikkel Hammershoj, a spokesman for the brand. “I would say there’s a very direct effect,” he added.\nAlthough character and plot are what drive costume design, fashion becoming a leitmotif of The Bear is not a stretch, as, by virtue of the profession, aesthetics and craftsmanship rank high in the fine-dining world.\n“I do think Carmy is the type of person who always had an itch to get out,” Ms Wheeler said. “He’s the type of person who seeks out quality.”\nThe cast and creators also seem to be exploring their own styles, including White, whose personal style has been followed closely and who recently modelled in a much-talked-about Calvin Klein underwear advertisement; his co-star Ayo Edebiri, who plays Sydney “Syd” Adamu, a red-carpet favourite in part because she worked with stylist Danielle Goldberg and is on the cover of the most recent issue of Vanity Fair; Matheson, a chef and an executive producer on the show who has his own clothing line, Rosa Rugosa; and the show’s creator Christopher Storer, who has a penchant for Thom Browne and the label Drake’s.\n“Sometimes, I’ll go up to his room just to ask a quick question, and we’ll end up spending 45 minutes talking about loafers,” Ms Wheeler said of working with Mr Storer.\nCertain fashion items have even become plot points, such as a stash of “Big E” Levi’s jeans so valuable that Carmy uses them to pay off a debt, or a Thom Browne-designed chef’s jacket that has been given to Syd in a dramatic reveal in the second season.\nWhen asked if she has been playing more to those who watch the show for the fashion, Ms Wheeler said: “There’s a little bit of that, but we don’t want to force it.”\nWhile these pieces may engender online fodder, Ms Wheeler said the important thing was for the clothes to be in service of the story. “When you’re in a fitting and trying on clothes, and everything comes together – everything clicks and it starts to feel like a real character – that’s where you think, oh, yeah, this one’s it,” she said.\nAnd while menswear aficionados may continue to clamour, searching for the exact style of pants, T-shirts and outerwear that Carmy wears on the show, Ms Wheeler pointed out one important detail. “A lot of the stuff you see on TV, we’ve tailored it,” she said. NYTIMES\nThe Bear 3 is now available on Disney+.", "url": "https://www.straitstimes.com/life/entertainment/some-people-love-the-hit-restaurant-set-series-the-bear-for-the-clothes"}