{"authors": [], "date_download": "2024-10-12 13:35:35", "date_modify": "2024-10-12 13:35:35", "date_publish": "2024-09-04 13:27:00", "description": "The 56-year-old English actor plays a drug addict who indulges in sexual escapades and heroin use. Read more at straitstimes.com.", "filename": "life_entertainment_actor-daniel-craig-gets-explicit-and-romantic-in-italian-filmmaker-luca-guadagnino-s-queer_1728740135.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/daniel04.jpg?VersionId=x4M6FTxtE3G8vMRZ8U2VGz27k3_7jQmN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_actor-daniel-craig-gets-explicit-and-romantic-in-italian-filmmaker-luca-guadagnino-s-queer_1728740135.html", "title": "Actor Daniel Craig gets explicit in Italian film-maker Luca Guadagnino’s Queer", "title_page": "Actor Daniel Craig gets explicit in Italian film-maker Luca Guadagnino’s Queer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VENICE – If you know Daniel Craig only as James Bond, Queer is liable to throw you for a loop.\nIn this new film from Italian director Luca Guadagnino, which premiered at the Venice Film Festival on Sept 3, the 56-year-old English actor plays a drug addict whose sexual escapades and heroin use are filmed with matter-of-fact candour.\nBut if you knew Craig even before he was pressed into Her Majesty’s Secret Service – when he was an up-and-coming young actor who appeared in risky, sexually explicit films like Love Is The Devil (1998) and The Mother (2003) – then you might guess that Queer is more in line with his sensibilities than some of the big studio fare he has made recently are.\nAt the film’s Venice news conference, he all but confirmed that hunch. “If I wasn’t in the movie and saw this movie, I’d want to be in it,” Craig told reporters. “It’s the kind of film I want to see, I want to make, I want to be out there. They’re challenging but hopefully incredibly accessible.”\nAdapted from the novel of the same name by William Burroughs, Queer follows Lee (Craig), an American expatriate wasting away in Mexico City. Most of Lee’s waking hours are spent pursuing some sort of high, whether that means drinking to excess in dive bars, cruising any handsome man to cross his path or shooting up heroin while alone in his apartment.\nHe lurches through life like a zombie until he meets Allerton (Drew Starkey), a beguiling young drifter whose sexuality seems up for grabs. As the older man’s romantic obsession grows, he entices Allerton to help him search for a drug that can supposedly induce a type of telepathy.\nWritten in the early 1950s but not published until 1985, the novel is slight and scuzzy.\nGuadagnino takes a different approach to the source material, building lavish sets – the film’s Mexico City was erected at Rome’s Cinecitta Studios – and imbuing the story with a sweeping romanticism.\n“Daniel, in our first Zoom, was adamant that this would be a love story vaster than empires,” Guadagnino said at the news conference. A24 has picked up the film for distribution.\nStill, Lee’s sexual escapades are hardly given short shrift. Before he links up with Allerton, he has two encounters with a hustler played by singer Omar Apollo, whose film debut is spent mostly in the nude.\nCraig was unfazed by the explicit encounters. “There’s nothing intimate about filming a sex scene on a movie set,” he said. “We just wanted to make it as touching, real and natural as we possibly could. We kind of had a laugh, we tried to make it fun.”\nThough Guadagnino has directed films like Call Me By Your Name (2017) and Challengers (2024), which are shot through with eroticism, he acknowledged that in some ways, he is an unlikely interpreter of all this sexually forward material. “I can count on two hands the lovers I’ve had in my life,” he said.\nLee’s other addictions hold little appeal for him too. “I am a gentleman who goes to sleep very early, never takes drugs in my life, never smoked a cigarette.”\nStill, when it comes to his art, Guadagnino has never been afraid to take risks. The director makes films that push a little further than most, and if that charge leads Guadagnino and Craig to portray people who operate in the margins of society, it is a place they are happy to explore.\n“I love the idea of seeing people and not judging them, of making sure that even the worst person is the person you identify with,” Guadagnino said.\nCraig added: “If I was writing a part and trying to tick off things I wanted to do, this would fulfil them.” NYTIMES", "url": "https://www.straitstimes.com/life/entertainment/actor-daniel-craig-gets-explicit-and-romantic-in-italian-filmmaker-luca-guadagnino-s-queer"}