{"authors": ["Jan Lee"], "date_download": "2024-10-12 13:42:56", "date_modify": "2024-10-12 13:42:56", "date_publish": "2024-09-26 15:20:00", "description": "The radio host mentioned in an ST interview that he eats at Song Fa Bak Kut Teh every week. Read more at straitstimes.com.", "filename": "life_entertainment_dennis-chew-lands-marketing-internship-at-song-fa-bak-kut-teh-after-st-interview_1728740576.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/26/2023082880129832jlms7682.jpg?VersionId=ZyzijlQuV6zdoxUuflTZUmGye1GoExa2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_dennis-chew-lands-marketing-internship-at-song-fa-bak-kut-teh-after-st-interview_1728740576.html", "title": "Dennis Chew lands marketing internship at Song Fa Bak Kut Teh after ST interview", "title_page": "Dennis Chew lands marketing internship at Song Fa Bak Kut Teh after ST interview | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singaporean DJ Dennis Chew has a new job.\nAside from being a regular host of The Breakfast Quintet on Chinese radio station Love 972, the 51-year-old recently landed a marketing internship with famed bak kut teh chain Song Fa Bak Kut Teh.\nIn an interview with Chinese news outlet Lianhe Zaobao, Chew, who is pursuing a diploma in Chinese media and communication at Ngee Ann Polytechnic, said he got the gig after The Straits Times interviewed him in May for a My Perfect Weekend column.\nIn the column, which speaks to local personalities about how they spend their weekend, Chew told ST that he dines at Song Fa Bak Kut Teh every weekend. That caught the eye of Song Fa’s boss, who invited him out for a meal.\nChew told Zaobao that he was then applying for internships as part of his polytechnic studies and spontaneously volunteered himself as an intern at Song Fa.\n“I asked the boss: ‘Why don’t you consider me? Interns are very affordable.’ She said she had to speak with the other members of management, because the company had never hired an intern before and if they hired me, I would be their first.”\nChew, who also hosts television programmes such as Season 2 of the baking competition Creme De La Creme, has been working at Song Fa for around three weeks. He is currently on a term break and the internship will last for six months.\nHe said: “This is the first time in my life having an office desk. The first day of work, my new colleagues placed a Labubu toy, which I love, on my desk to welcome me. I also printed out some pictures to decorate my work station, including a cover of U-Weekly (magazine) I did with my idol (local actress) Fann Wong.”\nLabubu is a character in a series of stories called The Monsters by Hong Kong-born artist Kasing Lung. Chew also decorated his office space with pictures of his cats.\nInstead of menial errands such as making coffee or buying lunch, Chew said he was given a set of tasks to complete by the end of his six months with Song Fa, though he did not elaborate on what these were.\n“My boss feels a bit embarrassed because it is quite a bit of work, but I am confident I can finish it. I’ve already presented a proposal for the first time and was praised for it.”\nHe added that he has yet to be reprimanded in the workplace and has not had to work overtime so far.\n“As long as I finish my work, it’s quite hard to get scolded. And to be honest, I would like to work overtime because I’m the kind of person who is much more active at night, but I think the company cares about work-life balance, because it turns off the office’s air-conditioning at 6.30pm.”\nChew is slated to graduate from Ngee Ann Polytechnic in May 2025.\nAside from his internship and radio gigs, he also recently travelled to Genting Highlands, Malaysia, for a cameo in an upcoming Chinese New Year movie, Blooms Of Happiness, which stars local veteran actress Hong Huifang and Malaysian singer Ah Niu.", "url": "https://www.straitstimes.com/life/entertainment/dennis-chew-lands-marketing-internship-at-song-fa-bak-kut-teh-after-st-interview"}