{"authors": [], "date_download": "2024-10-12 13:29:41", "date_modify": "2024-10-12 13:29:41", "date_publish": "2024-06-17 16:00:00", "description": "The idea is that a collective action by parents can make their kids feel less isolated about not having a mobile phone. Read more at straitstimes.com.", "filename": "life_sign-right-here-the-parents-across-the-us-pledging-to-keep-kids-phone-free-until-they-turn-14_1728739781.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/17/IMGL6699.JPG?VersionId=NvOOMgDIjf2vsQB165YtN27V6NEBNdbm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_sign-right-here-the-parents-across-the-us-pledging-to-keep-kids-phone-free-until-they-turn-14_1728739781.html", "title": "Sign right here: The parents across the US pledging to keep kids phone-free until they turn 14", "title_page": "Sign right here: The parents across the US pledging to keep kids phone-free until they turn 14 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Ms Kiley DeMarco recently attended Safety Night at her children’s public elementary school on Long Island in New York.\nAs she walked around different booths learning about how to protect her children from accidentally taking a cannabis gummy, about a local violence-prevention programme, about how police officers would respond to an emergency on campus, one station caught her eye. A parent was asking other parents to take a pledge not to give their children smartphones until the end of eighth grade (the equivalent of Secondary 2).\nMs DeMarco has two children – one in kindergarten and one in first grade. But like many parents, she has already read books and research arguing that smartphones, and the social media apps on them, drastically increase anxiety, depression and suicidal thoughts in teenagers.\nAsking parents in the same school to commit to holding back phones until a certain age made sense to her. “It means there is no grey area,” she said. “There is a clear grade level when they get the phone.”\nThe idea of acting collectively, in lockstep with other parents, made her feel more confident that she could keep her commitment. “It totally takes the pressure off of us as parents,” she said. “Down the road, when my kids start begging for phones, we can say we signed this pledge for our community and we are sticking to it.”\nIn schools and communities across the United States, parents are signing documents pledging not to give their children smartphones until after middle school (the equivalent of lower secondary). The idea, organisers say, is that if parents take action together, their children are less likely to feel isolated because they are not the only ones without TikTok in their pockets.\nConsidering the prevalence of smartphone use among young people, it is a bold step. Research from Common Sense, a non-profit organisation that provides technology reviews for families, shows that half of children in the US own mobile phones by age 11.\nAccording to Mr Zach Rausch, an associate research scientist at New York University who studies child and adolescent mental health, case-by-case decisions not to have a smartphone or social media can be “risky” for individual children, socially speaking.\n“They are saying, ‘I might be banished from all my friends and my social network’, and it’s a pretty big cost to make that choice,” he said. “But if the parents collectively work together to set the boundary, it will reduce a lot of conflict. It won’t be, ‘My friend has this, but I don’t.’”\nMany groups of parents are drawing on a playbook created by Wait Until 8th, an organisation that helps parents collect no-phone pledges from their children’s classes at school. Fifty-four pledges in 16 states were created in April alone, each of which had at least 10 families signed up, said Ms Brooke Shannon, the initiative’s founder and executive director.\n“I think we’re getting a flood of pledges now because the Anxious Generation book came out, and it’s getting a lot of traction,” Ms Shannon said, referring to a new book by American social psychologist Jonathan Haidt that argues the rise of smartphones has led to an increase in mental illness.\n“There are also hearings with the Senate judicial committee and the rules coming out of Florida.”\nIn March, the state of Florida enacted a bill banning social media accounts for children younger than 14.\nIndeed, some parents are organising these pledges because they believe their local governments or schools are not taking enough action.\nMs Kim Washington, 47, an occupational therapist in Boise, Idaho, has a third grader and a fifth grader who both have classmates with smartphones. Her own children do not, and she plans to keep it that way until they are in high school (the equivalent of upper secondary school).\nMs Washington has read research about the impact of phone use on children, and knows that teenagers in her community have struggled with mental illness, including four students who died by suicide in their local school district. “After that,” she recalled, “five or six parents got together and said, ‘What do we need to do? Our kids are struggling.’”\nThe parents first appealed to the school board to ban smartphones during the school day. The board said it would look into the matter, but that it might take some time, Ms Washington said.\n“If the school district had implemented a policy, I probably would not have to be as forceful and active doing something on my own because our kids would have much less screen time during the day.”\nShe and her peers felt compelled to “do something from the bottom up until the top down does something”, as she put it.\nSo, earlier in 2024, they started approaching parents to sign a Wait Until 8th pledge. Ms Washington has now secured pledges in three grades, including both of her children’s classes. “I’m just happy my son will have some friends who don’t have smartphones in school next year,” she said.\nMr Dan Hollar, a spokesman for the Boise School District, said in April that the district was conducting an audit of mobile phone use in classrooms and working with a parent group to address their concerns with student phone use at school.\nIn Summit, New Jersey, a group of five parents accumulated 200 commitments in less than two weeks. They now have more than 350, they said, spread across five elementary schools and two kindergarten primary centres.\n“No school has got 100 per cent,” Ms Shannon said. “We have seen some schools out there that are 85, 90 per cent, but that isn’t the point. The key to remember is that as long as your kid has seven or eight or nine families waiting with them, they don’t feel alone or strange or weird.”\nMuch of the resistance comes from parents who feel the need to be in touch with their children all day. “Parents say, ‘I need to get in touch with my child because the school isn’t safe anymore, and there are all these school shootings,’” Ms Shannon said.\nTo address those concerns, the organisation includes a list of devices on its website that allow parents to text their children, but do not allow access to social media.\nIf smartphones are off the table, the thinking goes, dumber devices may be the solution.\nNYTIMES", "url": "https://www.straitstimes.com/life/sign-right-here-the-parents-across-the-us-pledging-to-keep-kids-phone-free-until-they-turn-14"}