{"authors": [], "date_download": "2024-10-12 14:00:05", "date_modify": "2024-10-12 14:00:05", "date_publish": "2023-09-08 05:50:26", "description": "Prominent Scientologist Masterson was convicted in June of raping two women about 20 years ago. Read more at straitstimes.com.", "filename": "life_entertainment_that-70s-show-actor-danny-masterson-sentenced-to-30-years-to-life-in-prison-for-rapes_1728741605.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/08/2023-09-07T185922Z782102139RC2T33AX1E2KRTRMADP3PEOPLE-DANNY-MASTERSON.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_that-70s-show-actor-danny-masterson-sentenced-to-30-years-to-life-in-prison-for-rapes_1728741605.html", "title": "That ’70s Show actor Danny Masterson sentenced to 30 years to life in prison for rapes", "title_page": "That ’70s Show actor Danny Masterson sentenced to 30 years to life in prison for rapes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – That ’70s Show actor Danny Masterson was sentenced to 30 years to life in prison for raping two women, who on Thursday said the Church of Scientology sought to protect the actor and intimidate them into silence.\nThe 47-year-old actor and prominent Scientologist, who starred in the retro television comedy for eight seasons until 2006, was convicted in May in a second trial.\nA jury deadlocked on a charge that he raped a third woman.\nJudge Charlaine Olmedo of Los Angeles Superior Court imposed the maximum sentence allowed by law. Masterson, who has been in jail since his conviction, will be eligible for parole in 25½ years.\nThe case drew attention in part because Masterson met the women through the Church of Scientology, and his accusers said the organisation discouraged them from contacting law enforcement.\nThe group denied that claim and said Masterson’s religion should not have been an issue in the case, calling it “an unprecedented violation of the First Amendment”.\nProsecutors based the case on Scientology and “fabrications about the church to introduce prejudice and inflame bigotry”, the organisation said after the sentencing.\nThe women said Masterson drugged and raped them in separate incidents between 2001 and 2003 at his house in the Hollywood Hills.\nWith his actress-wife Bijou Phillips and his brother, Malcolm In The Middle (2000 to 2006) actor Christopher Masterson, seated nearby, Danny Masterson showed little reaction on Thursday as the women gave victim impact statements.\nHe was offered the chance to speak, but declined.\n“I forgive you. Your sickness is no longer mine to bear,” said one victim, identified as Jane Doe 2 in the case.\nThe woman, who was a member of the Church of Scientology when she met Masterson, described the religious organisation as an “enabler and protector” for him and said she was “terrorised and harassed” by the church when she tried to speak out about her rape.\n“Rape is a theft of the spirit,” she said, adding that she developed post-traumatic stress disorder and her promising acting career withered.\nThe other victim, identified as Jane Doe 1, said her mother is a Scientologist who disowned her after she criticised the group during the trial.\n“I didn’t choose to be born in Scientology just like I didn’t choose to be raped,” she said, accusing the organisation of seeking to silence and intimidate her in the rape case.\nThe King Of Queens (1998 to 2007) actress Leah Remini, a former Scientologist and vocal critic of the organisation, stood with her arms around Jane Doe 1 as she spoke in court.\nThe victims told the judge that Masterson ruined their lives and asked that he receive a sentence of life in prison.\nThe victims were “strong, they were committed to making sure that justice gets served and today they got it”, said Deputy District Attorney Reinhold Mueller after the sentencing.\nDefence attorney Shawn Holley said Masterson planned to appeal based on what she described as substantial errors in the case. REUTERS", "url": "https://www.straitstimes.com/life/entertainment/that-70s-show-actor-danny-masterson-sentenced-to-30-years-to-life-in-prison-for-rapes"}