{"authors": ["Amrita Kaur"], "date_download": "2024-10-12 13:59:04", "date_modify": "2024-10-12 13:59:04", "date_publish": "2023-09-09 12:00:00", "description": "Over eight months, Joanna Poon suffered two critical illnesses and fell victim to two scams costing her $100,000. Read more at straitstimes.com.", "filename": "life_surviving-cancer-stroke-and-scams-joanna-poon-faced-it-all-when-she-was-33_1728741544.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/09/eugenetan-akjoanna10-3628.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_surviving-cancer-stroke-and-scams-joanna-poon-faced-it-all-when-she-was-33_1728741544.html", "title": "Surviving cancer, stroke and scams: Joanna Poon faced it all when she was 33", "title_page": "Surviving cancer, stroke and scams: Joanna Poon faced it all when she was 33 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – At the age of 32, Ms Joanna Poon thought she led a perfect life.\nShe had a fulfilling job, loving family, wonderful friends and maintained a healthy and active lifestyle.\nThen a triple whammy hit her.\nShe was diagnosed with advanced breast cancer, suffered a major stroke and then lost $100,000 to online scams, all within the span of eight months.\nIt began in February 2022 when Ms Poon, a manager in a non-governmental organisation, felt a lump in her right breast while showering.\nSince her breasts tended to ache during her menstrual cycle, she thought the lump was just a symptom of her period, which had come.\nShe hoped it would disappear by the end of it. But it did not.\nShortly after, she contracted Covid-19, which delayed a medical check.\nIt took two months before Ms Poon consulted a general practitioner. That same afternoon, she was referred to a surgeon who specialises in breast cancer at Mount Elizabeth Novena Hospital for further examination.\nA battery of tests later, she was diagnosed with advanced stage triple-negative breast cancer, a rare and aggressive form of the disease. This was in May 2022 and the cancer had spread to multiple lymph nodes in the breast region.\n“I was shocked, upset and tearing uncontrollably. I was expecting the doctor to tell me it was a cyst and it was nothing to worry about,” says the 34-year-old, who was with her parents when she was told of the diagnosis.\nThat same day, she broke the news to her two elder siblings and close friends.\nAlthough it is not fully clear why, the number of people under 50 diagnosed with cancer has surged worldwide in the last three decades by nearly 80 per cent, according to a study published in the journal BMJ Oncology last week.\nThe deadliest cancers were breast, windpipe, lung, bowel and stomach cancers, said the researchers.\nDue to the aggressive form of cancer she had, Ms Poon, who is single, was advised to start on a combination of chemotherapy and immunotherapy immediately.\nHowever, as treatment affects fertility and she dreamt of having a family of her own one day, she chose to delay treatment by one to two weeks to freeze her eggs.\nInitially, her family did not agree with her decision.\nHer father, Mr Poon Mun Wai, was worried that postponing treatment would impact her recovery.\n“We advised her to think carefully. At that point of time, I felt that other things could take a back seat and the focus should be on treating her. But ultimately, we accepted her decision,” says the 70-year-old retiree, who used to work in information technology project management.\nBefore Ms Poon’s first chemotherapy and immunotherapy session at the end of May, she searched online for possible side effects to steel herself. But nothing prepared her for what was about to come.\nFour days after her first cancer treatment, she suffered a stroke.\nIt was most likely a result of the cancer, and not chemotherapy, according to the doctors who treated Ms Poon.\nIt happened late at night at home, when she tried to get up from her bed to go to the toilet and realised she could not move the left side of her body.\nShe called her siblings, but their phones were on silent mode.\nThe next morning, they found her on the floor in her bedroom – she had tried to drag herself from the bed to the door to get her parents’ attention.\n“At that time, I was lost and confused, and unaware of what was happening to me,” says Ms Poon.\nHer father, on the other hand, knew she was having a stroke and drove her to the hospital immediately.\n“Throughout the car journey, I kept insisting on finding my shoes, oblivious to the fact that they were already on my feet and that my limbs were numb and unresponsive,” she says.\nIt was an ischaemic stroke, caused by reduced blood flow to a part of the brain due to a blood clot in an artery.\nShe immediately underwent surgery to remove two blood clots from the blood vessels in her brain, and was admitted into the intensive care unit.\nSays Mr Poon: “The doctors told us that she had to be monitored to see how the stroke had affected her, so we were very concerned about how she was doing.\n“Then, one of her friends came to visit and assured her, ‘Joanna, don’t worry, you’re not walking alone.’\n“She responded by asking, ‘Are you a Liverpool fan?’\n“It comforted me to know that she could still think, respond and do so in a light-hearted manner.”\nHer stroke was followed by a two-month stay in the hospital, which she now jokingly describes as “a staycation”.\n“The side effects of chemotherapy would worsen the situation. Joanna worked very hard with her rehabilitation physician, physiotherapist and occupational therapist and slowly improved day by day,” says Dr Ngo.\nIt was during that time that Ms Poon pulled herself together and worked towards recovery.\n“I learnt the importance of cultivating a resilient mindset, a strength I never knew I had until I was dealt with challenging circumstances. I also felt very cherished by my family and friends, which encouraged me to push on,” she says.\nMs Poon resumed cancer treatment two weeks after the stroke and went on to complete six months of chemotherapy and immunotherapy by November.\nBut it was not without challenges.\nFaced with two critical illnesses and coping with physiotherapy and chemotherapy at the same time took a toll on her.\n“I felt very lethargic and had low blood pressure, which forced me to cancel some physiotherapy sessions to allow my body to adapt and recover,” she says.\nThe side effects of chemotherapy also caused her to lose her appetite, which led to a 10kg weight loss in six months.\nTo motivate her to eat, her mother, Madam Koh Meng Eng, a 67-year-old housewife, bought and borrowed books from the library on recipes for cancer patients so she could whip up palatable meals for her.\nMs Poon’s elder brother and sister also went out of their way to buy food she craved.\nHaving had long hair for most of her life, Ms Poon found it distressing to see it fall out in clumps after chemotherapy. Eventually, she decided to shave her head.\nHer sister and best friend joined her in shaving their heads at the hospital.\n“Even though I missed my long hair, I managed to find some positives in it. My head felt much cooler in the hot weather and my sister also jokingly compared my bald head to a kiwi,” says Ms Poon.\nShe also encountered an unexpected challenge – temporary menopause.\nAs her period did not come for six months during treatment, she started having hot flashes every night and had to sleep with the air-conditioning switched on.\nShe also felt moody and more emotional, adding to the already demanding effects of chemotherapy.\nHer period returned in February 2023, albeit irregularly.\nAfter her chemotherapy and immunotherapy ended in November 2022, she underwent a lumpectomy the following month to remove the lump in her right breast, and several cancerous lymph nodes in the breast region.\nShe then underwent radiation therapy and was declared cancer-free a month later.\nMs Poon thought that was the end of her nightmare. After battling two illnesses, she wanted to regain some normality in her life, find a partner and settle down.\nIn December 2022, she met a man on Instagram and thought she had found “the one”.\nWithout meeting him, she trusted and lent him money. But he turned out to be a scammer and cheated her of $50,000.\nWithin the same month, she was entangled in a second scam, which caused her to lose another $50,000.\nShe made a police report, but managed to claw only about $3,000 back. She had already spent a six-figure sum on her medical bills. Part of it was covered by insurance and MediSave.\nThe incident caused her to spiral into depression, and she thought of ending her life.\n“I was very disappointed in myself and I felt very guilty towards my family. I had read news on scams, but I didn’t expect myself to fall for one. I should have been more sceptical,” she says.\nThe thought of suicide scared Ms Poon, pushing her to seek help. With the support of her sister, she went to a psychiatrist and was prescribed antidepressants.\nShe started off seeing a psychiatrist once a week and now goes every two months. She also no longer takes medication for depression.\nHer numerous setbacks inspired her to write and self-publish a book. It took her a week to put her story into words and she released Glimpse Into Jo Battle in June.\nShe has sold 85 copies of the e-book, making $1,685 so far, and intends to donate sales proceeds to a different charity each year.\nIn 2023, she will be giving the money to the Singapore National Stroke Association and Breast Cancer Foundation.\nShe also printed physical copies that she gives out as gifts to friends and family.\n“I wanted to write a book to help patients who feel lost. I hope that by sharing my story and providing my perspectives, I can inspire people in a similar situation not to give up,” she says.\nMs Poon returned to her job in March after a 10-month hiatus, working mostly from home.\nShe has regained most of her mobility, but her left ankle and wrist are still weak.\nIn January, she got a tattoo of a sakura, her favourite flower, on her left hand to remind herself of renewal and optimism.\nShe continues to have physiotherapy twice a week and goes for daily walks with her family near their Serangoon North home.\nMs Poon says her experiences have changed her perspective on life and she no longer takes things for granted.\n“The diagnoses came as a shock because I ate healthily and maintained an active lifestyle. So it was an eye-opener. We shouldn’t assume that just because we’re young and healthy, we will be fine,” she says.\nHer father adds: “We didn’t expect to hear one piece of bad news after another. Joanna was a fighter through it all, she never gave up and she always looked forward to good things coming her way.”\nTo buy a copy of Ms Poon’s book, go to payhip.com/b/HKDX3. People can pay what they want above a minimum of $5.\nDoctors say rare breast cancer caused stroke\nMs Poon, who suffered a severe stroke after her cancer diagnosis, had an army of doctors looking after her as she battled two critical illnesses at the same time.\nThe doctors agree that the stroke was most likely due to her advanced stage triple-negative breast cancer.\nAmong the team of specialists are Dr Ngo; Dr Tan Yia Swam, a surgeon who specialises in breast cancer at Mount Alvernia Hospital; and Dr Charles Siow, a consultant neurologist at Mount Elizabeth Novena Hospital’s The Brain Center.\nIt is a recognised fact that cancer increases the clotting potential of blood, says Dr Siow. “It is not a common occurrence, although it is thought that up to 15 per cent of cancer patients will get strokes. Some of these are minor and the patient may have no symptoms. I have seen this in fewer than 10 patients in the past 15 years.”\nDr Ngo notes that the chance of getting cancer and stroke together is very rare.\n“I have a few patients in similar situations, but it’s in the single digits. I would say about five patients over more than 15 years of practice,” she says.\nAmong the different subtypes of breast cancer, the triple-negative breast cancer subtype is most prone to blood clot formation, adds Dr Ngo.\nIn addition, when the specialists were working out why Ms Poon developed a stroke, they found that she had a large intrapulmonary shunt.\nDr Ngo says: “If the lungs are a big filter to help the body get rid of carbon dioxide and other waste, an intrapulmonary shunt is like a shortcut that skips part of this process. Hence, any blood clots would pass directly into the arteries supplying the brain and cause a stroke.”\nBecause of the stroke, Ms Poon had to stop chemotherapy, which she had just started.\nSome patients, Dr Ngo says, have mild strokes affecting just their speech or movements, but Ms Poon had a severe one with significant paralysis of half her body.\n“The first week after a stroke can be life-threatening and strokes can recur. The treatment and stabilisation of her stroke took precedence over the cancer treatment. At that point, the side effects of chemotherapy and immunotherapy would cause more harm than benefit,” says Dr Ngo.\n“However, it was also a chicken-and-egg situation. If the cancer was not treated, it could cause another stroke,” she adds.\nDue to the serious nature of Ms Poon’s stroke and cancer, Dr Ngo and the team of specialists treating her met daily to plan her treatment.\nApart from surgery to remove two blood clots in her brain to restore normal blood flow, Ms Poon also took antiplatelet medication to reduce the risk of further blood clots.\nWhen her condition was stable, she restarted chemotherapy, in combination with immunotherapy, surgery and radiotherapy.\nThe treatment was successful and Ms Poon has been cancer-free since December 2022, although her left wrist and ankle are still weak from the stroke.\nHer doctors commend her bravery and positivity in the face of so many setbacks. “Her never-say-die attitude and perpetual smiling face when we see her every day inspire the medical professionals,” says Dr Siow.\nAdds Dr Ngo: “There was roadblock after roadblock, and Joanna doggedly and patiently overcame them.” She also applauds Ms Poon’s family, describing them as a “wonderful support system” on her road to recovery.\n“Her family accompanied her to every clinic and hospital visit, as well as all her physiotherapy sessions, and have been strong pillars of support for her.”", "url": "https://www.straitstimes.com/life/surviving-cancer-stroke-and-scams-joanna-poon-faced-it-all-when-she-was-33"}