{"authors": ["Amanda Chai"], "date_download": "2024-10-12 13:32:12", "date_modify": "2024-10-12 13:32:12", "date_publish": "2024-03-14 12:00:00", "description": "A round-up of beauty and style news. Read more at straitstimes.com.", "filename": "life_style_style-news-k-fashion-brand-mardi-mercredi-debuts-here-beyond-the-vines-and-casetify-collaborate_1728739932.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/14/tc-acstyle14.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-k-fashion-brand-mardi-mercredi-debuts-here-beyond-the-vines-and-casetify-collaborate_1728739932.html", "title": "Style News: K-fashion brand Mardi Mercredi debuts here, Beyond The Vines and Casetify collaborate", "title_page": "Style News: K-fashion brand Mardi Mercredi debuts here, Beyond The Vines and Casetify collaborate | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Cult K-fashion brand Mardi Mercredi debuts at SocietyA\nIf hearing the name “Mardi Mercredi” does not ring a bell, seeing its shirts certainly will.\nThe cult label from South Korea, instantly recognisable by its Flowermardi blossom graphic, is a favourite among in-the-know fashionistas in or heading to Seoul.\nFounded in 2018 by husband-and-wife team “Peace” Park Hwa-mok and Valerie S. Lee, its Flowermardi blossom is said to have been created by Park for his wife in the belief that “every woman loves flowers”.\nThe brand quickly took the street style scene by storm and has been worn by K-pop idols including NewJeans’ Minji and IVE’s Jang Won-young.\nYou need not hop on a flight to bring its coveted tees home. The brand is retailing in Singapore via a one-month pop-up held exclusively at home-grown multi-label retailer SocietyA.\nThe well-loved skincare brand has a new launch to help skin work overtime while you sleep.\nThe Lotus Youth Preserve Resurfacing Dream Serum ($98) is said to combine multiple steps of skin renewal – exfoliating, infusing antioxidants and moisturising – in a single product.\nAn AHA (alpha hydroxy acid) night serum targeting uneven texture and dark spots, it contains glycolic and citric acids to break down and remove dead skin cells from various layers in the skin. Prickly pear flower extract was added for its resurfacing properties that support skin renewal activity.\nDespite it being Fresh’s first chemical exfoliant, the creamy serum is gentle on skin. Polyglutamic acid in the formula helps deliver comfort and hydration, while Fresh’s signature antioxidant-rich Super Lotus is said to help smooth the look of fine lines and boost radiance.\nPair it with the Lotus Youth Preserve Dream Face Cream for well-rested, plush skin.\nInfo: Available at Fresh boutiques, Tangs stores, Sephora stores and fresh.com\nBeyond The Vines and Casetify collab\nThe home-grown fashion and design studio has teamed up with Hong Kong phone accessories brand Casetify for an exclusive collection, making it the first South-east Asian brand to do so.\nThe collaboration draws inspiration from a boutique hotel, with details recalling a relaxing vacation: porter hats, concierge desks and poolside lounging.\nLaunching on March 15, the line-up includes phone cases in six whimsical designs that are also available as free wallpaper that can be downloaded from the brand’s Instagram highlights.\nTech accessories include cardholder stands, snappy grip stands and AirPods cases for Apple users. Prices for the collection range from $50 to $99.\nThere will also be a range of complementary Beyond The Vines merchandise with similar designs, comprising T-shirts, water tumblers, key tags and bedroom slippers, priced from $18 to $79.\nInfo: Available from March 15 at Beyond The Vines stores and beyondthevines.com\nLaneige launches pink sleeping mask and cafe pop-up\nThe South Korean brand’s cult favourite sleeping mask range has a new addition.\nIt is all in the name. The Bouncy & Firm Sleeping Mask ($56) claims to visibly plump and firm skin, while boosting the skin barrier.\nFormulated with peptides and a peony and collagen complex, it is said to help boost and preserve collagen, revitalising lifeless skin to restore its bounce.\nThe mask’s sorbet-like texture is also packed with Hydro-Melt Glow Capsules that are said to create a protective moisture barrier to nourish tired skin overnight, so you wake up with a more radiant complexion.\nTo celebrate the launch, Laneige has collaborated with local cafe Rise Bakehouse at TripleOne Somerset. Until March 17, customers can purchase an exclusive dessert set ($17) comprising a Bouncy Blossom Tart and Collagen Strawberries and Creme Milk drink, inspired by the sleeping mask.\nEvery purchase of the set gives you a shot at a pink-themed photo booth and gachapon machine to redeem Laneige samples.\nInfo: Available at Laneige boutiques, Lazada, Shopee, Sephora stores and sephora.sg\nHues of blue for Chanel Spring ’24 make-up\nThe luxury fashion house has unveiled its first make-up collection created by Cometes Collective. This is the collective of international make-up artists that was formed in 2022 to drive the creative vision for Chanel’s beauty arm.\nChinese make-up artist Valentina Li takes the lead with this debut drop for Spring 2024.\nInspired by the ocean, she chose chromatic blue for the main palette – reflected in the Les 4 Ombres Rivage eyeshadow quad ($116), with a satiny turquoise shade and embossed with curved ridges resembling ripples on water; Bleu Abysse Stylo Yeux Waterproof ($43), an electric blue eyeliner; and Lagune nail polish ($46).", "url": "https://www.straitstimes.com/life/style/style-news-k-fashion-brand-mardi-mercredi-debuts-here-beyond-the-vines-and-casetify-collaborate"}