{"authors": [], "date_download": "2024-10-12 14:05:23", "date_modify": "2024-10-12 14:05:23", "date_publish": "2024-01-16 09:46:28", "description": "Brunson was named best actress in a comedy for Abbott Elementary. Read more at straitstimes.com.", "filename": "life_entertainment_actresses-quinta-brunson-ayo-edebiri-win-early-emmy-trophies_1728741923.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/16/2024-01-16T013343Z1425211831HP1EK1G04C41ORTRMADP3AWARDS-EMMYS.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_actresses-quinta-brunson-ayo-edebiri-win-early-emmy-trophies_1728741923.html", "title": "Actresses Quinta Brunson, Ayo Edebiri win early Emmy trophies", "title_page": "Actresses Quinta Brunson, Ayo Edebiri win early Emmy trophies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – The Bear star Ayo Edebiri and Quinta Brunson of Abbott Elementary scored some of the early awards at the Emmys on Monday as Hollywood celebrated the best of television.\nEdebiri won best supporting actress for her role as a chef trying to help open a fine-dining restaurant on dramedy The Bear (2022 to present).\nHolding her trophy on stage, Edebiri thanked her family for “letting me feel beautiful and Black and proud of all of that”.\nBrunson was named best actress in a comedy for playing an optimistic teacher on Abbott Elementary (2021 to present), a show she created. She shed tears as she took the stage and was handed the honour by comedy legend Carol Burnett.\n“I don’t know why I’m so emotional. I think it’s the Carol Burnett of it all,” Brunson said. “I’m so happy to be able to live my dream.”\nThe top TV honours were broadcast live on the Fox broadcast network. The show was postponed from September because of labour disputes in 2023.\nOrganisers were using this year’s milestone – the 75th Emmys – to honour classic television shows with cast reunions and other moments.\nHost Anthony Anderson opened the show with a choir singing theme songs from shows such as Good Times (1974 to 1979) and The Facts Of Life (1979 to 1988).\nBlink-182 drummer Travis Barker joined to play the drum solo from In The Air Tonight, a song that aired during a pivotal moment in 1980s hit Miami Vice. REUTERS", "url": "https://www.straitstimes.com/life/entertainment/actresses-quinta-brunson-ayo-edebiri-win-early-emmy-trophies"}