{"authors": [], "date_download": "2024-10-12 13:33:35", "date_modify": "2024-10-12 13:33:35", "date_publish": "2024-07-31 16:45:00", "description": "Richard Gadd said Fiona Harvey harassed him in real life but that the hit series is a dramatic retelling. Read more at straitstimes.com.", "filename": "life_entertainment_creator-of-baby-reindeer-calls-netflix-drama-emotionally-true-but-fictionalised_1728740015.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/Baby20Reindeer.jpg?VersionId=OvGaE4tqYIvpUBbTGi7AmSTmT0zLqNVX&h=ada2b21a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_creator-of-baby-reindeer-calls-netflix-drama-emotionally-true-but-fictionalised_1728740015.html", "title": "Baby Reindeer creator calls Netflix drama ‘emotionally true’ but ‘fictionalised’ in court papers", "title_page": "Baby Reindeer creator calls Netflix drama ‘emotionally true’ but ‘fictionalised’ in court papers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES - After Netflix was sued by a woman who claimed that she inspired the stalker character on the hit series Baby Reindeer (2024), the show’s creator and star, Richard Gadd, said in court papers filed on July 29 that he had been stalked by the woman in real life but that the series was a “fictionalised retelling”.\nIn a declaration filed in federal court in Los Angeles, Gadd said the woman, Ms Fiona Harvey, harassed him in many of the same ways the character Martha stalks Gadd’s character, Donny, on Baby Reindeer, which claims to be “a true story.”\nGadd, 35, said that in real life, Ms Harvey visited him constantly at the bar where he worked and sent him “thousands of emails, hundreds of voicemails and a number of handwritten letters”, some which were sexually explicit or threatening. But he also argued that Baby Reindeer is “a dramatic work”.\n“It is not a documentary or an attempt at realism,” Gadd wrote in the filing. “While the series is based on my life and real-life events and is, at its core, emotionally true, it is not a beat-by-beat recounting of the events and emotions I experienced as they transpired. It is fictionalised, and is not intended to portray actual facts.”\nGadd gave his declaration in support of a motion filed by Netflix seeking to dismiss the defamation lawsuit Ms Harvey filed in June.\nMs Harvey claimed in the suit that the character Martha was based on her, and that the series defamed her by portraying the character as a convicted stalker who at one point sexually assaults the character played by Gadd. In her lawsuit, Ms Harvey said she had never been convicted of a crime and had never sexually assaulted Gadd.\nMs Harvey’s lawsuit calls particular attention to a statement that appears on-screen at the beginning of Baby Reindeer: “This is a true story.”\nThat statement, her lawsuit claims, is “the biggest lie in television history”.\nThe show’s credits state: “This programme is based on real events: However certain characters, names, incidents, locations and dialogue have been fictionalised for dramatic purposes.”\nMr Richard Roth, a lawyer for Ms Harvey, said: “Netflix’s motion ties itself in knots.”\n“Netflix and Richard Gadd indisputably admit Baby Reindeer is not a true story – the very essence of Ms Harvey’s claims,” he said in a statement to The New York Times. “After asserting – under oath – that Martha is not Fiona Harvey, it then engages in more attacks of Ms Harvey, allegations that are irrelevant and have nothing to do with the litigation or the ‘true story’ of Baby Reindeer.”\nIn his court documents, Gadd describes growing fearful of Ms Harvey and losing sleep over the “exhausting and extremely upsetting” ordeal.\nHe describes confrontations in which he said Ms Harvey threatened him and includes numerous quotations from emails he said she sent him, some of which included racist and homophobic language.\nThe 21-page declaration does not suggest Ms Harvey was a convicted stalker, but Gadd says that he was fearful enough that he went to the police. Nor does the filing suggest that Ms Harvey sexually assaulted him in the way the Martha character assaults Donny on the show.\nBut Gadd describes one “particularly intense period of time when Harvey often attempted to touch me in inappropriate (and sometimes sexual) ways”, including pinching and touching “various parts of my body, including my bum”.\n“The series is not a documentary representing literally true details and imagery,” Gadd wrote in his declaration. “It is a fictionalised retelling of my emotional journey through several extremely traumatic real experiences.”\n“I did not write the series as a representation of actual facts about any real person, including Fiona Harvey,” he added. “Harvey is never mentioned in the series.”\nBefore filing her lawsuit, Ms Harvey went public with her complaints about Baby Reindeer, airing them in an hour-long interview on YouTube with television personality Piers Morgan.\nIn its own court filings, Netflix argues that Baby Reindeer is “a skillful exploration of sexual identity, sexual abuse, harassment and stalking”, notes that “it was Harvey who thrust herself into the spotlight and identified herself as the supposed inspiration for Martha” and argues that Ms Harvey’s claims “are a baseless attack on Netflix’s exercise of free speech”.\nThe company’s court papers call on the court to “strike Harvey’s complaint in its entirety”.\nIn an interview with The New York Times in July, English actress Jessica Gunning, who played the Martha character in the show, declined to comment on the lawsuit.\nBut she said that while she was aware that much of Gadd’s work “touched on real life experience”, she said: “I’m playing the character of Martha, so I’m not doing an interpretation of anybody.” NYTIMES", "url": "https://www.straitstimes.com/life/entertainment/creator-of-baby-reindeer-calls-netflix-drama-emotionally-true-but-fictionalised"}