{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:55:47", "date_modify": "2024-10-12 13:55:47", "date_publish": "2023-12-14 15:00:00", "description": "A weekly round-up of fashion and beauty news. Read more at straitstimes.com.", "filename": "life_style_style-news-birkenstock-opens-in-traditional-shophouse-chantecaille-launches-viral-collection-here_1728741347.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/14/042A0187.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-birkenstock-opens-in-traditional-shophouse-chantecaille-launches-viral-collection-here_1728741347.html", "title": "Style News: Birkenstock opens in traditional shophouse, Chantecaille launches viral collection here", "title_page": "Style News: Birkenstock opens in traditional shophouse, Chantecaille launches viral collection here | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "House of Birkenstock features exclusive collections\nGerman footwear company Birkenstock has unveiled the House of Birkenstock in a traditional shophouse in Duxton.\nA unique retail concept spanning several floors, the store draws inspiration from old Peranakan homes and features elements such as vintage tiles and water features.\nVisitors can find a premium assortment of footwear collections not available anywhere else in South-east Asia, including highly coveted Birkenstock collaborations and exclusive 1774 collections.\nNamed after the year that Birkenstock was founded, 1774 is Birkenstock’s special projects and collaborations division. Past projects included collaborations with Valentino, Dior, Manolo Blahnik, Jil Sander, Fear of God and Rick Owens. These collaborations have given rise to pieces that redefine the boundaries of luxury and style, showcasing the brand’s commitment to innovation and design excellence.\nApart from shopping, visitors will soon be able to access an array of services here, including customisation and repair.\nHouse of Birkenstock at 79 Duxton Road is open from 11am to 8pm, from Tuesdays to Sundays. The opening hours have been extended to 10pm from Dec 21 to 23.\nBalenciaga incorporates music into clothing\nLuxury fashion house Balenciaga has partnered with digital identity company Eon to launch the Archive Series, a new line of interactive hoodies and tees.\nWearers can scan a tag on the garment with a smartphone to unlock an exclusive 8min 30sec track, Patterns – which is not available via any other channel – and a seven-hour playlist from trip-hop group Archive.\nArtistic director Demna explains that music is an “integral part of Balenciaga’s culture”.\n“Balenciaga Music was created to share my favourite musical artists and their personal tastes and influences. We have now expanded this project to give a more personal and complete music experience with exclusive content and interactive technology,” he says.\nThis collection signifies the next phase of Balenciaga Music, a platform conceived to offer a “360 experience” via limited-edition merchandise and playlists curated by the brand.\nPrices range from $1,050 for the T-shirts to $1,750 for the hoodies. The Archive series is available at 01-01 Paragon, 290 Orchard Road.\nChantecaille launches viral make-up collection in Singapore\nFrench cosmetic brand Chantecaille’s limited-edition Precious Metal Collection received so many rave reviews online that some items sold out weeks after its October launch.\nInspired by the “opulence of pure gold”, the collection arrived in Singapore in the beginning of December and features two opulent compact powders embellished with gold leaf accents – Precious Gold Illuminating Powder and Radiant Glow Blur Powder ($172 each) – as well as a shimmery eyeshadow ($128), among other things.\nA hot favourite, the Lip Cristal in Rose Quartz ($88) is a highly pigmented lipstick with a glittery nude-pink finish. Proceeds from the sale of Lip Cristal will be dedicated to tree-planting initiatives in collaboration with the Sheldrick Wildlife Trust, an orphan elephant rescue and wildlife rehabilitation programme in Kenya.\nThe Precious Metal Collection is available at Chantecaille counters at Tangs at Tang Plaza and Takashimaya Department Store.\nBeyond Cosmetics unveils sensitive skincare range\nFor centuries, chervil has been used by herbalists in their medicinal tonics. This plant is now being tapped by Beyond Cosmetics, the sustainable hair and body care brand by South Korean cosmetics retailer The Face Shop, for its new skincare line.\nFormulated with wild chervil that is cultivated on the pristine Ulleung Island, 120km off the Korean Peninsula, the Angel Aqua skincare comprises a Moisture Cream, Sun Cream (sunscreen) and Tone Up Sun Cream (tinted sunscreen), priced at $19 each.\nRanked the No. 1 moisturiser in 2022 by health and beauty product store Olive Young, the Angel Aqua Moisture Cream is said to have a cooling effect – able to reduce skin temperature – and is suitable for sensitive and acne-prone skin, moisturising it for up to 24 hours.\nApart from wild chervil, the Angel Aqua skincare range also contains a Tri-SAP Complex, which is made up of a unique combination of three natural saps – birch tree sap, bamboo sap and vine tree sap – to hydrate skin while reducing inflammation.\nAll Beyond Angel Aqua products are available online at Beyond Official Stores on Lazada and Shopee.\nSigi Skin debuts bodycare line\nLocal skincare brand Sigi Skin has launched the first product in its new body care line.\nSupercharged with antioxidant-rich alfalfa and hydrating ceramides, the Calming Breeze Body Wash ($49) claims to ease irritation, strengthen and repair the skin barrier, and improve skin texture in sensitive, eczema and acne-prone skin.\nThe brand has also launched several deals that will be available until Dec 31.\nShoppers will receive free personalised calligraphy and gift wrapping with every purchase of the brand’s Dew Potion, Youth Beam, Idyllic Fields and Dream Capsule, while those who spend $350 and above will receive a free Garden Party Deep Cleansing Clay Mask worth $72.\nSigi Skin is available at www.sigiskin.com", "url": "https://www.straitstimes.com/life/style/style-news-birkenstock-opens-in-traditional-shophouse-chantecaille-launches-viral-collection-here"}