{"authors": [], "date_download": "2024-10-12 13:59:34", "date_modify": "2024-10-12 13:59:34", "date_publish": "2023-12-17 05:02:25", "description": "It comes after a documentary on French TV shows the actor in North Korea, repeatedly making explicit sexual remarks. Read more at straitstimes.com.", "filename": "life_entertainment_actor-gerard-depardieu-stripped-of-belgian-honorary-citizen-title_1728741574.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/17/FILES-FRANCE-FILMN-WOMEN-DEPARDIEU-122206.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_actor-gerard-depardieu-stripped-of-belgian-honorary-citizen-title_1728741574.html", "title": "Actor Gerard Depardieu stripped of Belgian honorary citizen title", "title_page": "Actor Gerard Depardieu stripped of Belgian honorary citizen title | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRUSSELS – A Belgian municipality on Dec 16 stripped French cinema legend Gerard Depardieu of the title of honorary citizen over misogynistic comments broadcast in a French documentary early in December.\nDepardieu, 74, was charged with rape in 2020 and has also faced 13 accusations of sexual harassment or assault, all of which he denies.\nThe documentary, The Fall Of The Ogre, aired on French public television on Dec 7, showed clips of the actor during a 2018 trip to North Korea.\nHe repeatedly makes explicit sexual comments in the presence of a female interpreter, sexualising a small girl riding a horse.\nThe actor’s lawyers criticised the documentary in a statement on Dec 16, saying that it was “a contested and questionable programme which broadcast a montage of images captured in the intimate and private sphere”.\nBut the Belgium municipality of Estaimpuis announced it was revoking the title given to Depardieu when he lived there in 2013.\nThe local authorities said the actor’s comments broadcast on television “run counter to the values promoted by the municipality of Estaimpuis”.\nThe Belgian decision comes a day after France’s culture minister denounced Depardieu’s behaviour.\nMs Rima Abdul Malak said a “disciplinary procedure” was being launched to decide whether to strip him of the country’s top honour, the Legion of Honour.\n‘Manhunt’\nThe French film star’s lawyers told AFP on Dec 16 that he was putting his Legion of Honour award at the disposal of the minister.\nHowever, Depardieu’s lawyers, Ms Beatrice Geissmann Achille and Mr Christian Saint-Palais, suggested in a statement that such a move could deal “a further blow to an already dying presumption of innocence”.\nThey also questioned whether it was part of Ms Abdul Malak’s role to participate “so actively in the manhunt” and “media lynching” to which they believe their client is being subjected.\nThe actor – who has more than 200 roles to his name, including in the 1990 comedy Green Card and the Netflix series Marseille (2016 to 2018) – has denied any wrongdoing.\nIn the face of the growing controversy in France, Belgian media has reported that Depardieu has returned to live in the country in a village close to the French border.\nDepardieu’s initial move to Belgium back in 2012 was heavily criticised in his homeland as it was viewed as a way of dodging the French tax system.\nThe Canadian province of Quebec on Dec 13 stripped Depardieu of its top honour over his “scandalous” comments against women in the France 2 report. AFP", "url": "https://www.straitstimes.com/life/entertainment/actor-gerard-depardieu-stripped-of-belgian-honorary-citizen-title"}