{"authors": [], "date_download": "2024-10-12 13:28:49", "date_modify": "2024-10-12 13:28:49", "date_publish": "2024-10-01 15:00:00", "description": "The 58-year-old was a leading sex symbol of Hong Kong cinema in the late 1980s and early 1990s. Read more at straitstimes.com.", "filename": "life_entertainment_former-hong-kong-actress-amy-yip-visits-malaysia-for-first-time-opens-boutique-hotel-in-penang_1728739729.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/01/amyyip1001.jpg?VersionId=IxQIq1vhH113jwFLs5Wn5VSk0pNNx4t4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_former-hong-kong-actress-amy-yip-visits-malaysia-for-first-time-opens-boutique-hotel-in-penang_1728739729.html", "title": "Former Hong Kong actress Amy Yip visits Malaysia for first time, opens boutique hotel in Penang", "title_page": "Former Hong Kong actress Amy Yip visits Malaysia for first time, opens boutique hotel in Penang | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PENANG – Former actress Amy Yip has marked her first visit to Malaysia with a trip to Penang.\nShe was in the Malaysian state on Sept 29 for the grand opening of The Leith Hotel, a boutique hotel in which she has an investment.\nIn an interview with Malaysian media, Yip said this is her first business venture in the country, and she plans to invest in three more hotels in Penang.\nThe 58-year-old, a leading sex symbol of Hong Kong cinema in the late 1980s and early 1990s, said she will visit Malaysia more often now that she has a business stake in the country.\nYip revealed that she had not taken a flight in nearly 20 years due to a past incident that left her afraid of flying.\nHowever, she made an exception for this trip.\n“Many friends invited me to Malaysia a year ago, but I refused many times due to my fear of flying,” she said.\n“That’s because I took a plane to Taiwan and encountered a No. 10 hurricane signal.\n“The plane circled in the sky for almost an hour, unable to land. The pilot eventually had to turn back because there was not enough fuel.”\nDuring her time in Penang, Yip indulged in various cuisines. She also tried durian, and said she will ask friends to ship the king of fruits to her in Hong Kong.\nThe star, whose last film was Underground Judgement (1994), joked that she gained 4.5kg from eating so much and has to exercise once she returns to Hong Kong.\nYip made the news in September when she ordered a 1.8kg empurau fish from Malaysia for a dinner party in Hong Kong.\nTouted as the most expensive freshwater fish in Malaysia, the empurau, also known as “tor tambroides”, can fetch a price of up to RM1,800 (S$560) a kilogram.\nYip, whose doctor boyfriend Sammy Lui died of a heart attack in 2018, said that many friends have urged her to find love in Malaysia.\nShe listed “chemistry” as the most important factor when looking for a partner.\n“They should also treat me well. Ideally, they should be able to take care of me instead of me having to take care of them,” she said. THE STAR/ASIA NEWS NETWORK", "url": "https://www.straitstimes.com/life/entertainment/former-hong-kong-actress-amy-yip-visits-malaysia-for-first-time-opens-boutique-hotel-in-penang"}