{"authors": ["Lim Ruey Yan"], "date_download": "2024-10-12 13:28:48", "date_modify": "2024-10-12 13:28:48", "date_publish": "2024-10-02 15:10:00", "description": "The celebrity couple tied the knot in the Himalayan kingdom in 2008. Read more at straitstimes.com.", "filename": "life_entertainment_actors-tony-leung-and-carina-lau-return-to-wedding-destination-bhutan-after-16-years_1728739728.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/hzbhutan021024.jpg?VersionId=ql52p56s.2nGp65WwF.wyCOnZbnITyec&h=8b3aad8b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_actors-tony-leung-and-carina-lau-return-to-wedding-destination-bhutan-after-16-years_1728739728.html", "title": "Actors Tony Leung and Carina Lau return to wedding destination Bhutan after 16 years", "title_page": "Actors Tony Leung and Carina Lau return to wedding destination Bhutan after 16 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Hong Kong celebrity couple Tony Leung Chiu Wai and Carina Lau have returned to the Himalayan kingdom of Bhutan, where they held their wedding in 2008.\nThe actress shared three photos of herself with her husband on social media on Oct 1, with the caption “16 years later”.\nWhile she did not state the location, the couple were most likely in Bhutan, based on the colourful prayer flags and buildings in the photos.\nLeung, 62, and Lau, 58, tied the knot in Bhutan in July 2008 after dating for almost 20 years. Hong Kong media reported heavily on the star-studded wedding ceremony, attended by celebrities such as Hong Kong singer Faye Wong, former Taiwanese actress Lin Ching-hsia and Hong Kong singer Kenny Bee.\nBefore their latest trip to Bhutan, Lau and Leung were in Bangkok, where they bumped into Hong Kong veteran actors Bowie Wu and John Chiang, who were also travelling in the Thai capital.\nWu, 92, posted a video of their meeting on Chinese social media platform Xiaohongshu on Sept 29, while Chiang, 77, shared on Instagram a photo of himself with his actress wife Maggie Li and Leung.\nLau and Leung will be busy with work after the Bhutan trip, with the award-winning actor serving as president of the International Competition jury at the Tokyo International Film Festival 2024, which will be held from Oct 28 to Nov 6.\nMeanwhile, Lau will be starring opposite Hong Kong actor Dayo Wong in The Truth About Lying, a play that will run at the Hong Kong Academy for Performing Arts from Dec 13 to Feb 23.", "url": "https://www.straitstimes.com/life/entertainment/actors-tony-leung-and-carina-lau-return-to-wedding-destination-bhutan-after-16-years"}