{"authors": ["Stephanie Yeo"], "date_download": "2024-10-12 13:29:22", "date_modify": "2024-10-12 13:29:22", "date_publish": "2024-09-28 10:05:00", "description": "Some doctors are seeing more younger patients with breast cancer, but it is not the curse you think it is. Read more at straitstimes.com.", "filename": "life_beating-breast-cancer-how-these-women-in-their-20s-30s-and-40s-survived-and-thrived_1728739762.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/28/btcancer20240926.jpg?VersionId=G9wvRVb7ZT5KI0as46CEbATnvukkGy5X", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_beating-breast-cancer-how-these-women-in-their-20s-30s-and-40s-survived-and-thrived_1728739762.html", "title": "Beating breast cancer: How these women in their 20s, 30s and 40s survived and thrived", "title_page": "Beating breast cancer: How these women in their 20s, 30s and 40s survived and thrived | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Ms Jamie Ng was just 23 when she was diagnosed with breast cancer. Ms Dawn Chua was 30 and mother of a one-year-old baby when she received the same shocking news.\nWhile breast cancer is the most common cancer among women – one in 13 in Singapore will get it in her lifetime – it is commonly thought of as a disease that strikes women in midlife and beyond.\nThat may be changing. Recent studies show cancer is on the rise among younger people below the age of 50. Among women, breast cancer’s reach is getting younger too.\nAn American study published in the Jama Network Open journal in 2024 showed that since 2016, the incidence of breast cancer among women aged 20 to 49 in the US increased dramatically to 3.76 per cent a year from 0.24 per cent a year previously, notes Dr Tang Siau-Wei, a senior consultant and breast surgeon at Solis Breast Care & Surgery Centre, a private practice here.\nAbout 10 per cent of breast cancer patients at the National Cancer Centre Singapore (NCCS) – more than 100 annually – are women below the age of 40, says Dr Ma Jun, an associate consultant in NCCS’ Division of Medical Oncology.\nKK Women’s and Children’s Hospital (KKH) has seen a slight increase in the percentage of breast cancer patients aged below 40, from 8 per cent to 10 per cent between 2019 and 2022, says Associate Professor Lim Geok Hoon, head and senior consultant in the KK Breast Department.\nDuring the same period, KKH saw a 33 per cent rise in breast cancer patients across all groups, with the majority of cases in women aged 50 to 59, Prof Lim adds.\nOverall, the hospital saw about 360 new breast cancer patients in 2022. Its KK Breast Centre offers a dedicated service to support younger patients aged 40 and below, including fast-tracked consultations with fertility and genetics specialists.\nDr Tang says that while she has seen an anecdotal increase in younger women with breast cancer, especially those in their late 30s to 40s, there does not seem to be a specific cause for it. Solis Breast Care & Surgery Centre saw slightly over 400 cases of newly diagnosed breast cancer in 2023, of which 13 per cent were women aged 40 and younger.\nDr Ong Kong Wee, a general surgeon at Mount Elizabeth Novena Hospital, says the proportion of breast cancer patients he has seen has been stable over the last five years. Of the almost 500 newly diagnosed cases he saw during this period, 11.7 per cent were under the age of 40.\n“This is almost three times the proportion in the US, which stands at 4 per cent. It is well established that Asian women tend to develop breast cancer about 10 years younger than women in the West.”\nAmong the factors that may affect younger women, Dr Tang says, are lifestyle ones such as alcohol consumption, an increase in obesity, a more sedentary lifestyle and a delay in the age of their first pregnancy.\nNon-lifestyle factors also play a part, she adds. Genetics and early menarche (the first period), giving birth past age 30, not having kids, less breastfeeding and prolonged oral contraceptive use all increase the risk of breast cancer.\nDr Ma says breast cancer patients below age 40 tend to be diagnosed with more aggressive forms of breast cancers, such as triple-negative breast cancer.\nNCCS and Singapore General Hospital run a Young Women with Breast Cancer programme for patients aged 18 to 45, which supports them during their treatment journey and beyond.\nBut with greater awareness and more treatment options, Dr Ma notes that outcomes for young breast cancer patients are now better. “This means they are also living longer with the lingering effects of cancer treatment. Young women with breast cancer often struggle to reintegrate into society to rebuild their careers, familial relationships and social network, while going for treatment and dealing with lasting side effects of surgery and chemotherapy. Greater awareness, support and understanding are needed to help them on their journey.”\nAs Breast Cancer Awareness Month approaches in October, three breast cancer patients in their 20s, 30s and 40s share their stories about overcoming breast cancer and living boldly.\nDiagnosed at just 23, she started a vlog to help other young patients", "url": "https://www.straitstimes.com/life/beating-breast-cancer-how-these-women-in-their-20s-30s-and-40s-survived-and-thrived"}