{"authors": ["Clement Yong"], "date_download": "2024-10-12 13:54:36", "date_modify": "2024-10-12 13:54:36", "date_publish": "2023-12-27 17:00:00", "description": "GST rates will go up from 8 per cent to 9 per cent come Jan 1, 2024. Read more at straitstimes.com.", "filename": "life_arts_2024-gst-hike-bookshops-art-dealers-and-theatre-companies-worry-people-will-cut-non-essential-spending_1728741276.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/27/202307167245952220230716-ga38082.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_arts_2024-gst-hike-bookshops-art-dealers-and-theatre-companies-worry-people-will-cut-non-essential-spending_1728741276.html", "title": "2024 GST hike: Bookshops, art dealers and theatre companies worry people will cut ‘non-essential’ spending", "title_page": "2024 GST hike: Bookshops, art dealers and theatre companies worry people will cut ‘non-essential’ spending | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – From the price of art to how much theatre tickets and books will cost, the imminent 1 percentage point rise in the goods and services tax (GST) is making arts companies anxious.\n“Non-essential” spending, after all, tends to be the first in people’s budgets to be axed when times are lean.\nBooksellers, already struggling with diminishing profits after years of increasing rentals and printing costs, are most apprehensive about the GST hike from 8 per cent to 9 per cent come Jan 1.\nAnd though they have more breathing room, art dealers and theatre companies are suffering the jitters too.\nWith reports of a fall in real median income due to inflation, they accept that whether people will continue spending on pricier indulgences will depend on 2024’s economic outlook. Singapore’s gross domestic product for now is still expected to grow between 1 and 3 per cent.\nThe country’s reading public has always been small. A surge in online sales during the pandemic has largely been wiped out with borders reopening and people making less time for the written word.\nThe upcoming GST increase, though, feels momentous for a different reason – one flagged by several booksellers.\nIt inches the already increasing prices of fiction titles dangerously close to $30, a psychological barrier that, once breached, will cause many people to think twice about their book purchase.\nThe ubiquity of convenient online platforms, such as e-commerce retailer Amazon and online marketplace Carousell, does not help booksellers.\nLawyer Yap Shi Kai, 28, says: “Books becoming more expensive in stores will make buying there less appealing for the casual reader like me. Carousell is also more environmentally friendly because the books are second-hand.”\nAmong the GST-registered bookstores that will charge readers more from 2024 is Books Kinokuniya, which will not be adjusting the prices of its existing inventory, but will do so for its new books.\nMajor home-grown publishers Epigram Books, which also runs a bookshop, and Ethos Books are also GST-registered. Epigram’s fiction titles will cost $29.30 with tax in 2024, after it raised prices by $2 two years ago to help offset the climbing cost of operations.\nEthos Books, after announcing a staff cut of 50 per cent in December, is also preparing for readers to “gravitate towards titles deemed to be more necessary”.\nEthos publisher Ng Kah Gay says higher prices mean that publishers have to be “even more conscious of the zeitgeist so that they can bring out titles that appeal to readers”.\nBut more often overlooked are the smaller, non-GST-registered booksellers who cannot pass on cost pressures to consumers, says Mr Alex Chua, co-founder of Book Bar in Duxton Road.\nThe bookshop, which opened in July, does not have a taxable turnover of more than $1 million and so does not need to charge GST.\nBut Mr Chua adds that businesses with small turnovers are not immune to the pain of rising taxes and cost of living.\nWith the GST hike, Book Bar will have to absorb the higher taxes charged by publishers and suppliers along the production chain, depleting the bookshop’s profit share from the pre-tax 40 per cent of each book sold to 29 per cent.\nAs a bookshop specialising in SingLit titles, Mr Chua knows he can ill afford to make home-grown offerings less affordable.\n“When book prices go up, people will choose between local and international books, and we know they will go for international bestsellers. It’s a whole industry thing – local publishers have to choose titles worth reading. The quality has to be there,” he says.\nMs Tan Waln Ching, co-founder of Chinese book store City Book Room, likewise feels the sense of being caught between a rock and a hard place.\nPointing to the price of a Ya Kun Kaya Toast set, which now costs upwards of $6 – a particular source of ire for netizens in December – Ms Tan says inflation has affected expenditure across the board, which City Book Room, as a non-GST-registered entity, cannot pass on to readers.\nCity Book Room bid farewell to its erstwhile home at North Bridge Centre in 2022, moving to the third floor of an apartment and office complex in Joo Chiat, drawn in part by the cheaper monthly mortgage.\nSince then, as a publisher, it has had to cope with steeper printing costs – estimated to have gone up by 30 to 35 per cent in 2023 – as well as higher salaries paid to designers to meet rising costs of living.\nUnable to raise the prices of its books in the near future due to the inherent challenges of the dwindling Chinese book market, Ms Tan can only lament that “people do not hesitate to pay more for food” while, for her, “books are food for the human mind”.\nBoth Book Bar and City Book Room will continue to hold book launches to entice readers to spend in their spaces. In February, Mr Chua is looking to supplement sales by retailing Chinese New Year gifts and pastries at Book Bar.\nIndependent art dealers in Singapore are also fretting about the chillier economic outlook, with gallery Artualize founder Low Sok Leng noticing a palpable quiet in the market and people starting to be more cautious with their spending.\nMs Low is the daughter of second-generation Singapore artist Low Hai Hong, and she has been primarily marketing works by home-grown Chinese artists.\nShe says general increases in business costs are likely to force even non-GST-registered galleries to up their prices, without profiteering from tax hikes.\nHere, the non-essential nature of art is a double-edged sword: more disposable, but also with less price-elastic demand.\n“Items like art will definitely be less popular when the budget is tight from the high cost of living,” says Ms Low. “But art, especially in Singapore, is bought by those with more disposable income. It’s less tied to prices and more to emotions. It’s still about finding an artwork that they can connect with.”\nShe concedes that the GST hike, however, does not bode well for her ongoing efforts to broaden the base of art buyers in Singapore.\nIn the past year, she has held several exhibitions in spaces such as Grantral Mall@MacPherson and Tan Tock Seng Hospital to take art to the community.\nShe also came up with the innovative idea of renting original art to people unused to having art in their homes, starting from as low as $24 a week.\nDetails of a nascent “fractionalisation ownership programme”, where the cost and ownership of a piece of art is split among multiple parties, are being worked on.\nMs Low says: “Singaporeans already perceive art as only for the rich. There are cheaper options such as buying art in Vietnam or from (Chinese online shopping platform) Taobao. Hence, education is important, so people can see the value of paintings by Singapore artists.”\nAmong the three arts genres, the show of quiet confidence is greatest in theatre, where companies have successfully expanded their audience base over the years through an active social media presence and willingness to tackle contemporary issues.\nThe industry practice is for ticket prices to be sold at prices inclusive of GST. For now, many companies such as The Theatre Practice (TTP) and Singapore Repertory Theatre (SRT) have chosen to keep ticket prices as they are, reducing their “take-home amount”.\nSing’theatre artistic director Nathalie Ribette observes that the general price of theatre tickets has trended upwards since the end of the Covid-19 pandemic, as companies aim for a bigger bang to draw in more discriminating audiences. Sing’theatre’s ticket prices for the musical Cabaret in October started at $50.\nThe difficulty of persuading people to spend money on “non-essential” entertainment is not new, though it is becoming “more and more challenging”, she says, adding emphatically: “We cannot raise the ticket prices more.”\nBut there are still many devotees, such as Ms Tay Rui Lin, 28, who are willing to pay more. The manager in the legal industry watches three to five theatre shows a year, and believes that home-grown productions are already reasonably priced compared with Broadway musicals imported from overseas.\nShe would be willing to pay up to 5 per cent more for shows she is keen to watch. She says companies can make their shows more appealing with early-bird prices or advance booking discounts.\nAmid the gloom, economist Song Seng Wun, an economic adviser for CGS-CIMB Securities, offers a note of cautious optimism and, perhaps, some perspective, as he believes people and the economy “can take” the GST increase.\nAs long as people are gainfully employed with a stable income, that “will give them a certain comfort and confidence despite what they see and read about the higher cost of living”, he says.\nThe many sold-out theatre shows in 2023 should also give the arts sector some comfort, he adds. Even if people are more discerning about their spending, what is important is that they are still buying.\n“As with most things, it comes down to the perception of value,” he says. “The difficult question is: What will make an experience worth it? The impact of the GST hike may not be as dramatic as it is being made out to be.”", "url": "https://www.straitstimes.com/life/arts/2024-gst-hike-bookshops-art-dealers-and-theatre-companies-worry-people-will-cut-non-essential-spending"}