{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:19:48", "date_modify": "2024-10-12 14:19:48", "date_publish": "2022-11-04 16:00:00", "description": "The mid-sized electric crossover offers plenty of clever features and unrivalled battery warranty. Read more at straitstimes.com.", "filename": "life_motoring_car-review-toyota-s-bz4x-is-brilliant-johnny-come-lately_1728742788.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/04/202210271067961883d279d6e-5b02-4c94-bf5b-b7bd0ecef980.jpg?VersionId=uSsmgp6s1kguUz.iv9eVVQbUgMPAMJb6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_car-review-toyota-s-bz4x-is-brilliant-johnny-come-lately_1728742788.html", "title": "Car review: Toyota’s bZ4X is brilliant Johnny-come-lately", "title_page": "Car review: Toyota’s bZ4X is brilliant Johnny-come-lately | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – When you buy a petrol-powered car, do you ask how far a full tank of fuel will take you? Probably not, because you know refuelling is a non-issue.\nPetrol stations are plentiful and conveniently located, and filling up rarely takes more than five minutes.\nBut with an electric car, range is a major consideration. Because, unlike petrol stations, chargers for electric vehicles (EVs) are not plentiful nor conveniently located (unless you live in a landed home and have your own), and charging time often takes more than an hour, excluding waiting time if the nozzles are occupied.\nToyota’s bZ4X addresses this consideration elegantly. The first mass-produced EV designed from the ground up by the Japanese automotive giant – long accused of being late in the electrification game – offers a real-world range of more than 400km.\nYou may say that is nothing extraordinary, since several new EVs promise a range of more than 500km.\nHere is the thing: The bZ4X has a relatively small battery of 71.4kWh, and if you compare the actual range of cars with batteries of a similar size, the Toyota is among the most efficient.\nThe test car averages 17.1kWh/100km, which is close to Toyota’s stated 16.9kWh/100km. Based on this, the car should be good for up to 418km on a full charge. This compares well with the Lexus UX300e, a hurried conversion introduced here last year, which had a real-life range of around 310km.\nThe bZ4X is a noticeably bigger car. At 4,690mm by 1,860mm by 1,650mm tall, it is a bit smaller than the full-sized Toyota Harrier, but its wheelbase of 2,850mm is substantially longer. Like most electric models, it is hefty, tipping the scales at 1,925kg.\nDespite that, it is commendable in the ride-and-handling department, betraying just a slightly harder edge at the end of each rebound over an uneven surface, and almost negligible weight-induced lean into corners. In fact, the bZ4X conveys a well-planted feel uncommon in the crossover genre.\nCombined with a steadfast steering and a chassis which feels sportily rigid, the car offers stress-free fun at any speed. Braking feels natural, with not a hint of the initial pedal travel void seen in a number of other EVs.\nAlso, unlike most EVs, the Toyota’s brake regeneration is thoughtfully engineered. In the default coasting mode, the car still has some power recovery and does not feel like a runaway train. A conveniently located button activates a higher recovery rate, but without the jerkiness seen in others with a one-pedal driving mode.\nInstead of a sunroof, the bZ4X offers a useful solar roof, which gives the car up to 1,650km of free range a year. This seems to work because, despite the recent overcast skies and some 20 per cent of heavy-footed driving (which degrades the car’s efficiency noticeably), its overall power consumption is enviable among EVs of its size. Only the BMW iX3 is appreciably more efficient.\nDespite having an estimated price which is some $50,000 lower than the iX3’s, the Toyota does not lose out in fit and finish nor in equipment level. In fact, the bZ4X is closer to Lexus than it is to Toyota in this respect.\nIts cockpit is refreshingly different, with a large infotainment touchscreen supplemented by physical buttons flanking a rotary gear selector sitting atop a floating centre console, a tablet-style instrumentation panel set up like the head-up display of a jet-fighter, and an intuitive multi-function steering wheel.\nPremium features include an adaptive cruise control system which is cleverer than most (it adjusts speed in a bend without a vehicle in front, and it works in heavy rain), lane-keeping, 360-degree camera depicting a see-through image of the car, climate control with PM2.5 filter, memory seats with cooling and heating functions, a powered tailgate and even a superfluous notification which pops up when a window is not closed fully, with a prompt asking if you want to close it.", "url": "https://www.straitstimes.com/life/motoring/car-review-toyota-s-bz4x-is-brilliant-johnny-come-lately"}