{"authors": ["Chantal Sajan"], "date_download": "2024-10-12 13:32:25", "date_modify": "2024-10-12 13:32:25", "date_publish": "2024-08-02 18:00:00", "description": "Spread over 22,000 sq m, the ninth Singapore Garden Festival is designed as a tropical wonderland. Read more at straitstimes.com.", "filename": "life_home-design_singapore-garden-festival-blossoms-poised-to-be-world-s-biggest-flower-show_1728739945.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/Azmi-cssgf02-18.JPG?VersionId=qAbT3JWRLN53Eb.ZZ1qMrr0zBOhlQHQE", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_home-design_singapore-garden-festival-blossoms-poised-to-be-world-s-biggest-flower-show_1728739945.html", "title": "Singapore Garden Festival blossoms: Poised to be world’s biggest garden show", "title_page": "Singapore Garden Festival blossoms: Poised to be world’s biggest garden show | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Singapore Garden Festival (SGF) is poised to be the premier tropical garden and flower show on the global stage in 2024, gathering leading designers under one roof and showcasing more than 60 displays.\nBy sheer scale, the ninth edition of the biennial festival – which will take place at the Suntec Singapore Convention and Exhibition Centre from Aug 3 to 11 – is staggering.\nThe festival covers about 22,000 sq m, or about 2ha, on Levels 4 and 6. This is nearly the size of 18 Olympic-size swimming pools.\nUnlike in 2022 when the festival was held in two locations – Orchard Road and the Singapore Botanic Gardens – 2024’s garden and flower show will be kept entirely indoors and air-conditioned for cool comfort and barrier-free access for all.\nSGF attracted more than 700,000 visitors at the double venues two years ago.\nSince its inception in 2006, SGF – organised by the National Parks Board (NParks) – has grown steadily and now ranks among the most anticipated horticultural events globally.\nMr Dennis Lim, coordinating director of festivals, events and exhibitions at NParks, says the hope is to attract at least 300,000 visitors in 2024.\nThis projection is based on past SGF editions at Suntec since the festival’s inception.\nIn comparison, some of the world’s most prestigious floral festivals are smaller, such as the Melbourne Flower Show in Australia that drew about 103,000 visitors over five days in 2022.\nThe Chelsea Flower Show, established in 1913 in London, the United Kingdom, has a maximum attendance of 157,000 visitors over five days every year. The attendance is limited by the capacity of the 4.5ha estate.\nThe 2024 edition of SGF coincides with Singapore playing host to the 8th Global Botanic Gardens Congress, jointly organised by the Singapore Botanic Gardens and Botanic Gardens Conservation International.\nIt will be held for the first time in South-east Asia at Suntec Singapore from Aug 6 to 9, and is the only global congress dedicated to botanic gardens.\n“We decided to co-locate SGF with the congress at Suntec, which is a centrally accessible venue,” Mr Lim tells The Straits Times.\n“This will allow participants of the congress to visit SGF with more convenience and vice versa, further amplifying SGF’s significance as a gathering for horticulturists and garden enthusiasts.”\nOver close to two decades, several key factors have contributed to SGF’s prominence and appeal.\n“SGF attracts top-tier landscape and garden designers, florists and horticulturists from around the globe, making it a significant event in the horticultural calendar,” says Mr Lim.\nThe festival features award-winning professionals who compete in various categories, including the popular Best of Show Designer Gardens Competition and Floral Windows to the World Championship, which showcase the skills of leading garden and floral designers globally.\nThe 2024 SGF features 44 garden and floral designers from 18 countries including Singapore.\nThere are also more than 50 stage programmes for visitors, with talks ranging from caring for plants and indoor gardening to floral arrangement and hydroponics.\nMr Lim says that beyond showcasing floral artistry, SGF also plays a crucial role in engaging the community. This includes competitions and highlights aimed at various groups, from community gardeners to hobbyists to students.\nFor example, this edition of the community-led Singapore Gardeners’ Cup – a crowd favourite – involves more than 200 gardeners from 40 community gardens.\nDisplays by young talent will also be showcased in the Landscape Design Challenge, Floral Harmony Competition and Floral Fantasies: Where Nature Meets Fashion segment, which features wearable floral art.\n“The festival serves as an educational platform that promotes gardening appreciation among the public,” says Mr Lim.\n“It includes various outreach initiatives aimed at encouraging residents to engage with gardening as a lifestyle. This aligns with Singapore’s vision of transforming into a City in Nature.”\nAs part of the festival’s community highlights, there is a photography exhibition showcasing the talent of migrant workers here, in collaboration with social enterprise Holdinghands Studio.\nIts founder, Mr Tan Chin Hock, says the SGF installation, titled Singapore Flora: Through The Lens Of Our Migrant Workers, celebrates their talent through a curation of 30 photographs.\nThe shots are taken by hobbyist migrant photographers such as foreign domestic workers and construction workers, who come from the Philippines, Bangladesh, Indonesia, India and China.\nAlso on Level 4 is the Floral Table-Top contest section featuring whimsical tablescapes dreamed up by designers to woo judges. Part of this section is taken up by a non-competition centrepiece by Mr John Lim, founder of home-grown botanical design studio This Humid House, which sets the tone for the competition.\n“Bukit Bulu” playfully evokes a topography of low hills on a table using tropical ingredients with furry textures, such as the heliconia vellerigera, which is covered in fine hairs. The work is inspired by the warm, earthen colours of local tableware-maker Luzerne’s stoneware range.\n“We designed a low, decagonal table at coffee-table height, paired with batik-upholstered legless chair backs, to seat diners low – as is the tradition in many Asian cultures,” says Mr Lim, a botanical designer who studied architecture at the Cooper Union in New York City, in the United States.\nThe setting showcases a sprawling, fecund display of tropical flora in shiny brass vessels, deliberately kept low to maintain sight-lines between diners.\nMr Lim, who has practised architecture in New York, Tokyo and Beijing, says the gestural composition of the tabletop arrangement engages in vivid conversation with the playful batik print.\nHe adds: “Eschewing greens entirely, the fiery reds and oranges of heliconia vellerigera and marigold blaze through a thicket of dried palm inflorescence, glowing brightly in the absence of foliage.”\nInfo: Those looking for more in-depth tips can register for paid floristry demonstrations and workshops as part of the SGF Master Series at sgf.nparks.gov.sg. SGF tickets are on sale at str.sg/iJtM2 and can also be purchased on-site at Suntec Singapore Convention and Exhibition Centre, Levels 4 and 6.\nEliam Eng and Andy Eng (Singapore)\nCategory: Best of Show Designer Gardens – Landscape Garden\nSingaporean uncle-nephew duo Eliam Eng and Andy Eng won three accolades at SGF in 2022: the Gold Award, Best of Show and Best Construction Award. They have returned to defend their titles in the Landscape Garden category in 2024.\nMr Eliam Eng, 70, is the director and principal designer of landscape architecture company Nyee Phoe Flower Garden, which was founded in 1911. Mr Andy Eng, 48, is the fourth generation in the family-owned business.\nTheir installation for 2024 is titled Nature’s Nest and celebrates the harmonious relationship between humans and the environment.\n“We’re seeing a rise of the ‘Singapore Garden’ concept, which is a fusion of Asian heritage and Western design sensibilities,” says Mr Eliam Eng.\nMr Andy Eng recounts that since the Covid-19 pandemic in 2020, Nyee Phoe has been working to nurture a greater appreciation for nature.\nThe company’s facility in Neo Tiew Crescent in Lim Chu Kang includes a farm-to-table bistro and farmstay villas, as well as features preserved moss and foliage called Mosscape, which can be used as perennial decor accents.\n“We’ve introduced MossArt workshops and curated several Mosscape pop-up stores, bringing hands-on nature experiences directly to urban dwellers,” says Mr Eng.\n“These initiatives not only educate people about different forms of greenery, but also allow them to create their own natural art pieces, deepening their connection with nature.”\nMr Eliam Eng and Andy Eng won two awards for Nature’s Nest: Gold Award in the Landscape Garden category; and Best Construction Award.\nLeon Kluge (South Africa)\nCategory: Best of Show Designer Gardens – Fantasy Garden\nGlobally recognised and award-winning landscape designer Leon Kluge is also an artist, botanist, presenter and writer.\nHe has bagged several prizes at world-class competitions, including gold awards for his gardens at the prestigious Chelsea Flower Show in 2018 and 2019.\nHe has built a substantial body of work centred on his contemporary approach to designing landscapes, vertical gardens and sustainable community projects.\nHe says that now, more than ever, cities need to incorporate more greenery as temperatures soar globally.\n“If there is one thing Covid-19 taught us, it is that green spaces are so important to the human conditioning of the mind,” he says.\nHis SGF installation is based on Singapore’s mangroves and forests, which he finds “magical”.\n“When I close my eyes and think of lying underneath the forests, my imagination goes into different worlds,” says Mr Kluge, 44, who graduated in 2009 with a bachelor’s in technology, horticulture and landscape design from Tshwane University of Technology, Pretoria.\n“That is why I decided to name my garden Between Two Worlds. It captures the moment in reality when you rest under the forest and then fall asleep to be transported into another world of your imagination.”\nHe is also quick to point out he has long admired Singapore’s vision in implementing greenery in architecture and city planning.\n“Singapore has a balanced approach – it has ‘wild areas’ for local wildlife to be undisturbed,” he says.\n“The city also preserves ‘tame’ natural habitats for future generations, allowing for greenery for its inhabitants to enjoy. It is the melding of the ‘wild’ and ‘tame’ that makes Singapore so unique.”\nMr Kluge won three awards for Between Two Worlds: Best of Show in the Fantasy Garden category; Gold Award for Fantasy Garden; and Best Lighting.\nJules Moore (New Zealand)\nCategory: Best of Show Designer Gardens – Fantasy Garden\nThe inspiration for celebrated New Zealand landscape designer Jules Moore came from the moment she saw an internet image of a golden timber dragon reflected on the surface of a water body.\nThe watery image formed a double “8” motif, which she decided to incorporate into her design, titled Portals To Paradise.\n“Within the ‘8 x 8’ garden, I included a path that reflects this motif,” says Ms Moore, 61.\n“The motif reminded me of a DNA strand, so I built it up from there and created a tree of life design that integrates into the DNA strand, encompassing the entire garden space.”\nShe started her journey in horticulture at the age of 18 and qualified as a horticulturist seven years later. Her formal training was in the Parks Department in New Plymouth, New Zealand, where she trained as an apprentice.\nAfter qualifying, she founded her own business, Touch Of The Tropics, as an architectural landscape designer.\nMs Moore notes that SGF’s scope and ambitions are “truly impressive”.\n“It offers a unique platform for showcasing innovative garden designs and promoting diverse horticultural practices,” she adds.\n“The festival’s commitment to excellence, sustainability, creativity and community in garden design is in keeping with my own passion for creating inspiring and meaningful landscapes. Being part of the fantasy division has been particularly exciting.”\nMs Moore won the Gold Award in the Fantasy Garden category for Portals To Paradise.\nAlan Rudden (Republic of Ireland)\nCategory: Best of Show Designer Gardens – Landscape Garden\nAward-winning Dublin garden designer Alan Rudden likes to create gardens that can be used and enjoyed, and this is why he chose the Landscape Garden design category at SGF. His show garden is named The Green Pavilion.\nHe says it is also what he does in his own garden design practice back home in Ireland.\nHis installation is a restful architectural space that feels grounded in and connected to nature. The garden is formed around a contemporary pavilion, nestled within verdant planting that is not confined to the plant beds, but also exends to the walls, roof and terrace floor.\n“I like to create mostly contemporary-style gardens that are both comfortable and functional with a good balance between the hard elements and planting,” says Mr Rudden, 40.\n“I try to give two-thirds of any garden space that I work with to planting and always try to use native plants as much as possible. I used bamboo orchid (Arundina graminifolia) and red hot poker (Uvaria grandiflora) as part of my show garden for SGF 2024. Bamboo orchid is the main flower I used in the garden.”\nHe graduated with a diploma in horticulture in 2006 from the Institute of Technology, Blanchardstown, Ireland. He has taken part in several garden shows in Ireland and the United Kingdom, and has a haul of nine gold medals since he first competed in 2014.\nHe says: “SGF is a truly amazing garden festival that attracts the best designs from all over the world, in turn creating a unique show with a diverse collection of gardens – all under one roof.\n“There is nothing like it anywhere else in the world, which makes it very special.”\nMr Rudden won the Silver Award in the Landscape Garden category for The Green Pavilion.\nDenmy Lam (Singapore)\nCategory: Floral Table-Top Competition\nWhile preparing for her Floral Table-Top Competition entry for SGF, Ms Denmy Lam says she had inadvertently transformed the living room of her terrace house in the eastern part of Singapore into a makeshift botanical labyrinth.\nHer family members had to gingerly navigate through the overgrown vines, much to their amusement – and occasional frustration.\n“Their playful complaints about getting tangled up were a light-hearted reminder of the creative chaos that often accompanies the artistic process,” recalls the 51-year-old, with a laugh.\nShe named her tablescape Wild Symphony: Nature’s Everlasting Overture, an ode to quiet contemplation.\nHer inspiration came from a recent retreat in Spain where she escaped the urban hustle to find introspection in solitude.\n“Each encounter and the ever-changing moods of nature taught me that every experience is unique, just like every floral creation. I aimed to capture this essence of fleeting beauty and unique experiences in my work,” says Ms Lam.\nShe graduated in fine arts from Central Saint Martins in London in 1999. About seven years ago, she developed a keen interest in floral design and pursued further studies at the Nobleman School of Floral Design in Singapore.\n“Creating Wild Symphony has taught me resilience and humility,” adds Ms Lam, who runs a floral business online (@flowersatkew on Instagram).\n“Each stage of the process presented challenges that pushed me to adapt and persevere, while also reminding me to remain humble in the face of nature’s unpredictability.”\nMs Lam won two awards in the Floral Table-Top Competition: Best of Show and Gold Award for Wild Symphony: Nature’s Everlasting Overture.\nDesmond Toh (Singapore)\nCategory: Floral Table-Top Competition\nSelf-taught floral designer Desmond Toh is brewing up a very different tablescape design for his installation in the Floral Table-Top Competition.\nHis work is eponymously titled Kopi Toh: The Coffee Connection and, yes, it is centred on the idea of local coffee.\nOr, more precisely, kopi that forms part of the Nanyang culture. Taking cues from kopitiam (coffee shop) floor tiles and vintage metal shutters, Mr Toh designed a playful dining experience that aims to rekindle a fresh connection with Singapore’s kopitiam heritage.\n“I am inspired by the curiosity to create something new with everyday things,” says the 27-year-old freelancer who is a Chinese studies graduate from Nanyang Technological University.\nHis installation is a retro-contemporary structure featuring an abundance of scarlet, interspersed with cobalt blue and glossy green botanicals.\n“My floral design approach is to create beauty with simplicity, as I believe that floral design ought to be an art form that can still be cost-effective and sustainable,” he adds.\n“With good visual planning, I am able to achieve a better overall outlook that presents a clear visual narrative.”\nMr Toh won the Silver Award in the Floral Table-Top Competition for Kopi Toh: The Coffee Connection.\nFor the complete list of SGF 2024 award winners, go to sgf.nparks.gov.sg/Resources/sgf2024-results\nSingapore Garden Festival 2024\nWhere: Levels 4 and 6 Suntec Singapore Convention and Exhibition Centre, 1 Raffles Boulevard\nWhen: Aug 3 to 11, 10am to 10pm daily (last admission at 9.30pm)\nAdmission: Adults (residents from $17, non-residents $33), child aged three to 12 (residents from $9, non-residents $21); tickets available at sgf.nparks.gov.sg and str.sg/iJtM2 or on-site\nInfo: Those looking for more in-depth tips can register for paid floristry demonstrations and workshops as part of the SGF Master Series at sgf.nparks.gov.sg", "url": "https://www.straitstimes.com/life/home-design/singapore-garden-festival-blossoms-poised-to-be-world-s-biggest-flower-show"}