{"authors": ["Yamini Chinnuswamy"], "date_download": "2024-10-12 14:00:12", "date_modify": "2024-10-12 14:00:12", "date_publish": "2022-09-25 15:45:00", "description": "The Crazy Rich Asians star claims her Fresh Off The Boat co-worker molested her in 2015. Read more at straitstimes.com.", "filename": "life_entertainment_actress-constance-wu-alleges-sexual-harassment-by-tv-show-producer_1728741612.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/25/svcwu250922_0.jpg?VersionId=KMpE4qpmQlLlOeiW_dNVtJIvaPhPiK2T", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_actress-constance-wu-alleges-sexual-harassment-by-tv-show-producer_1728741612.html", "title": "Actress Constance Wu alleges sexual harassment by TV show producer", "title_page": "Actress Constance Wu alleges sexual harassment by TV show producer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – American actress Constance Wu has opened up about her time on Fresh Off The Boat (2015 to 2020), alleging she was sexually harassed by a senior producer on the sitcom.\nThe 40-year-old, whose parents are Taiwanese immigrants, spoke about the experience in her upcoming memoir, Making A Scene.\nIn the book, the star of romantic comedy film Crazy Rich Asians (2018) alleges that the producer – identified only as M – exhibited controlling behaviour and coerced her into running all business decisions by him.\nWu further alleges that he molested her at a Los Angeles Lakers basketball game in 2015.\nShe also addressed the topic at an event last Friday.\n“I kept my mouth shut for a really long time about a lot of sexual harassment and intimidation that I received the first two seasons of the show,” Wu said at the Atlantic Festival in Washington.\nShe added that she was initially too afraid to push back against the harassment, but felt braver once Fresh Off The Boat was a success about two seasons in.\n“Once I was no longer scared of losing my job, that’s when I was able to start saying no to the harassment, no to the intimidation, from this particular producer,” she said.\nHowever, she chose not to speak publicly about the experience so as to protect the show and her community.\n“I thought, ‘You know what? I handled it. Nobody has to know. I don’t have to stain this Asian-American producer’s reputation. I don’t have to stain the reputation of the show.’”\nWu’s allegations shed new light on the social media controversy that erupted in 2019, when she expressed her frustrations over Fresh Of The Boat’s renewal of its sixth and final season.\n“So upset right now that I’m literally crying. Ugh,” she had tweeted at the time.\nHer reaction triggered accusations of arrogance among netizens.\nBut during the Atlantic Festival event, Wu said of the controversy: “I wanted to have a fresh slate where I didn’t have to start a show with all these memories of abuse. A few people knew (the harassment) was happening, and to go to work every day and see those people who knew that he was sexually harassing me being ‘buddy-buddy’ with him felt like a betrayal every time.”\nShe added: “I loved everybody on that crew, and I loved working on that show, but it had that history of abuse... and even though I handled it after two years, I was looking forward to a clean slate.”\nWu, who has a two-year-old daughter with her boyfriend, musician Ryan Kattner, recently appeared on the TV series The Terminal List (2022), alongside Chris Pratt and Taylor Kitsch.", "url": "https://www.straitstimes.com/life/entertainment/actress-constance-wu-alleges-sexual-harassment-by-tv-show-producer"}