{"authors": ["John Lui"], "date_download": "2024-10-12 13:44:19", "date_modify": "2024-10-12 13:44:19", "date_publish": "2023-04-24 15:00:00", "description": "A four-day trip sees the writer pedal up Jeju Island's coasts and down the banks of Seoul's Han River, collecting stamps as he goes. Read more at straitstimes.com.", "filename": "life_entertainment_on-the-road-secret-to-cycling-fun-in-seoul-and-jeju-island_1728740659.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/25/20230321100704.jpg?VersionId=WdN.vDYQYIgz_HIP7v.00huk4T4PRRjt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_on-the-road-secret-to-cycling-fun-in-seoul-and-jeju-island_1728740659.html", "title": "On The Road: Secret to cycling fun in Seoul and Jeju Island", "title_page": "On The Road: Secret to cycling fun in Seoul and Jeju Island | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SOUTH KOREA – Touring beautiful Jeju Island on a bicycle gives one plenty of time for reflection.\nThoughts that cross my mind include “yellow fields of canola, wow, brilliant splashes of colour”, “skyscraper-size windmills, jutting out of the misty waters, majestic” and “my lungs – they are about to explode”.\nForgive me for being dramatic. It is just my middle-aged body talking. It is angry at the wet sea gusts, blowing the bike backwards. My legs have not shut up since we hit the hills a few kilometres back.\nI notice that on the southern island, the members of my tour group are the only ones on bikes, because the locals and domestic tourists are not insane.\nInstead of fighting the coastal wind and rain, they are inside the coffee bars that proliferate along the coastal route, each looking cosier and more adorable than the last. I make a mental note to come back and do a cafe tour. In a rental car.\nI am on a cycling tour of Seoul and Jeju at the invitation of the Korea Tourism Organization. A small group of participants from around South-east Asia is here to see if cycling can be a tourism draw.\nMy answer is: Absolutely, but go at the right time of the year. And if you meet an unexpected hill or strong gusts, do not kill yourself keeping to a schedule.\nIn contrast to Jeju’s rough-going rides, the cycling paths along Seoul’s Han River are a dream.\nThere are over 100km of dedicated bike lanes along the Hangang Bike Path network. A cyclist could not ask for more. In March, the air is a crisp 15 deg C, there is no wind, the tarmac is pristine and the terrain is mostly flat.\nThe river path, an infrastructural wonder built in 2012, rarely intersects with street traffic.\nMost of the time, riders are cloaked in nature, hearing only insects, the click of the bike chain and, occasionally, the boomboxes of hiking retirees. Like in Singapore, the auntie and uncle hikers use them to alert distracted adults and teens on bikes.\nTo encourage ridership, the South Korean government offers a certification book, unofficially called a passport. It costs 4,500 won (about S$4.50) and is available at several centres on the trail.\nTips for going to South Korea for a bike tour\nJoin a bike tour group or rent bikes for a self-guided tour – either option is doable. One offers peace of mind and the other, flexibility.\nFor group tours, companies to consider are Shangrila Cycling Tours (str.sg/iook) and Travel Wander (str.sg/iooZ).\nShangrila has a six-day round-island Jeju cycling package that starts from $2,290 a person. It includes accommodation, airport transfers, meals, a safety-support vehicle and a cycling guide. The company also offers cycling tours of other regions in South Korea.\nTravel Wander offers a six-day self-guided ride of Jeju Island, from $898 a person. As cyclists are self-guided, there are no guides, support vehicles or meals, but the package does include accommodation, bike rental and hotline assistance. Cycling tours of other regions of South Korea are also available.\nFor those who prefer a self-guided cycling trip, consider Biketotal (tel: +82-31-977-6147), a bicycle rental company. It has various locations, such as at Jeju Airport and key subway stops in Seoul.\nWhen calling, ask if it has English-speaking staff or contact the Korean Tourism Organization in Singapore (tel: 6533-0441 or e-mail singapore@knto.or.kr) before leaving.", "url": "https://www.straitstimes.com/life/entertainment/on-the-road-secret-to-cycling-fun-in-seoul-and-jeju-island"}