{"authors": ["Lynda Hong"], "date_download": "2024-10-12 13:50:48", "date_modify": "2024-10-12 13:50:48", "date_publish": "2023-10-01 12:26:00", "description": "The Meatable sausage would likely be sold here from 2024 after the Singapore Food Agency gives the go-ahead. Read more at straitstimes.com.", "filename": "life_food_cultivated-pork-hard-to-tell_1728741048.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/01/MeatableCultivated20Pork20ProductsSausages3.jpg?h=b4ba2b36", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_cultivated-pork-hard-to-tell_1728741048.html", "title": "Cultivated pork? Hard to tell", "title_page": "Cultivated pork? Hard to tell | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – It can be hard for someone to tell the difference between traditional pork and cultivated pork from the labs of Dutch start-up Meatable.\nThat was my first thought as I sank my teeth into a hotdog prepared with cultivated meat sausage, which comprises one-third meat grown from cells in a lab and two-thirds plant-based proteins.\nThe company held its world’s first media tasting session at Love Handle Labs Innovation Centre at The Arts House last Wednesday.\nFor comparison, reporters were also served a non-pork sausage made entirely from plant-based protein. It was more apparent that this was not meat as most people know it – it was springy like a fishball, with a taste very similar to the beancurd skin commonly found in Chinese vegetarian dishes.\nThe Meatable sausage would likely be sold here from 2024 after the Singapore Food Agency gives the go-ahead.\n“We think the product is already very good,” said the firm’s chief commercial officer Caroline Wilschut. “But we also have nine months, we see what can happen in the nine months to make the product better,” she added, referring to the company’s timeline to launch the sausage for sale.\nWhen the sausage is rolled out here, Singapore will be Meatable’s first market in the world. The Republic is also the company’s first production site outside of its home base in the Netherlands.\nMeatable is also developing cultivated pulled pork, which was also served during the media tasting. This lab-grown version of the American pork dish is made up of one-third cultivated pork and two-thirds plant-based proteins.\nMade from pork shoulder, pulled pork is usually put into a slow cooker, shredded and then cooked again. The end result is usually flossy, and it takes awhile to chew the pork.\nMeatable’s cultivated pulled pork – served in a taco at the tasting – lacks the fibrous texture, dissolving in the mouth faster than traditionally farmed pork.\nBut this subtle difference was masked by the cooking sauce, the porky flavour of the cultivated meat, and the taco wrap with mustard sauce.\nMeatable and its product development partner Love Handle, a plant-based butchery in Singapore, are collecting feedback from industry partners like restaurants to further refine the hybrid pork and develop new products.\nLove Handle will sell Meatable items at its outlets once they are available.", "url": "https://www.straitstimes.com/life/food/cultivated-pork-hard-to-tell"}