{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:55:22", "date_modify": "2024-10-12 13:55:22", "date_publish": "2024-07-18 12:00:00", "description": "There will be make-up consultations and giveaways at the Kylie Cosmetics pop-up at Ion Orchard. Read more at straitstimes.com.", "filename": "life_style_style-news-kylie-cosmetics-debuts-at-sephora-mugler-celebrates-50th-anniversary-with-fragrance_1728741322.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/18/btkylie20240718.jpg?VersionId=OuLmh1fVbdNQFkbYTGDp_Ak3Dz9gI_mK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-kylie-cosmetics-debuts-at-sephora-mugler-celebrates-50th-anniversary-with-fragrance_1728741322.html", "title": "Style News: Kylie Cosmetics debuts at Sephora, Mugler celebrates 50th anniversary with fragrance", "title_page": "Style News: Kylie Cosmetics debuts at Sephora, Mugler celebrates 50th anniversary with fragrance | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Kylie Cosmetics lands in Singapore\nKylie Cosmetics has officially arrived in Sephora Singapore and, to celebrate, the brand by American reality television star Kylie Jenner is holding a pop-up at Ion Orchard from July 19 to 28.\nThere will be interactive make-up consultations and exclusive giveaways at the event, and highlights include chances to win iconic Lip Kits and indulge in Kylie Cosmetics-inspired treats, as well as free tarot readings and bottle engraving on weekends.\nThe first 100 shoppers who spend a minimum of $50 at the pop-up will also receive a $30 voucher and exclusive gifts with their purchase.\nKylie Cosmetics was established in 2015 as Kylie Lip Kits, debuting with a liquid lipstick and lip liner set. After multinational beauty conglomerate Coty acquired a controlling stake in 2019, the brand blossomed into a powerhouse, boasting a diverse portfolio of over 400 products across eye, complexion and lip categories.\nThis Singapore debut also coincides with the launch of Jenner’s first fragrance. Packaged in a sculptural bottle, Cosmic Kylie Jenner is a floral eau de parfum that comes in 30ml ($75), 50ml ($95) and 100ml ($120) – as well as a portable 10ml ($40) pen spray.\nInfo: The pop-up at Level 1 Outdoor, Ion Orchard, 2 Orchard Turn, will be open from 10am to 10pm daily.\nMugler marks 50th anniversary with fragrance launch\nMugler recently marked its 50th anniversary at the ArtScience Museum with the debut of its newest fragrance, Alien Hypersense Eau de Parfum.\nKnown for its Angel Eau de Parfum, the French fashion and fragrance house has introduced this new scent in time for summer. Available in 30ml ($138), 60ml ($180) and 90ml ($230), this light, summery fragrance is a blend of floral, fruity and woody notes, starting with refreshing green mandarin and pear, and transitioning to jasmine sambac. Like all of its predecessors, it is also refillable, at $196 for 100ml.\nInfo: The fragrance is available at Takashimaya, BHG Bishan, BHG Bugis, Isetan Scotts, Isetan Nex and Isetan Tampines.\nLa Roche-Posay unveils anti-pigmentation solution\nThe French dermo-cosmetic brand has unveiled a new product range targeting pigmentation: the Mela B3. It claims to reduce inflammation from ultraviolet exposure and pollution, promote cell renewal to lighten dark spots and protect against free radicals that trigger melanin production. It comprises a cleanser ($42.90 for 200ml), a serum ($88.90 for 30ml) and sunscreen ($69.90 for 40ml).\nThe hero ingredient in this line-up is melasyl, a multi-patented molecule that was first presented at the World Congress of Dermatology in 2023. Studies have shown that melasyl outperforms other brightening ingredients such as vitamin C and kojic acid, as it intercepts excess melanin before it even reaches the skin’s surface by trapping melanin precursors.\nThe range – which boasts 10 per cent niacinamide and La Roche-Posay’s signature thermal spring water to boost product efficacy – is said to deliver visible results in a week.\nInfo: La Roche-Posay’s Mela B3 range is available at pharmacies such as Watsons and Guardian, both in stores and online.\nWella Professionals transitions from in-salon to at-home products\nThe OG hair salon brand is making it easier to achieve professional-quality locks without leaving your house.\nThere are four product ranges designed to cater to various hair needs. For example, the Fusion range ($37.80 to $55.50) focuses on repairing and strengthening damaged hair using silk amino acids, reducing breakage and enhancing manageability. For a more natural approach, the Elements range ($30 to $58.90) uses botanical extracts and is free from sulphates, parabens and artificial colourants.\nThe Oil Reflections range ($20 to $55.50) is said to bring shine and softness to hair with nourishing camellia seed oil and white tea extract, while the Invigo range ($30 to $55.50) features different colour-coded products to rejuvenate and revitalise different hair types.\nInfo: Available from Wella Professionals’ official e-stores on Lazada and Shopee.", "url": "https://www.straitstimes.com/life/style/style-news-kylie-cosmetics-debuts-at-sephora-mugler-celebrates-50th-anniversary-with-fragrance"}