{"authors": [], "date_download": "2024-10-12 13:35:22", "date_modify": "2024-10-12 13:35:22", "date_publish": "2024-09-08 14:00:00", "description": "The pop star made her first red-carpet appearance since the announcement of her divorce from Ben Affleck. Read more at straitstimes.com.", "filename": "life_entertainment_jennifer-lopez-slays-tiff-red-carpet-as-she-unveils-unstoppable_1728740122.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/08/ailopez080924.jpg?VersionId=9Ar1LNkUFoO.3B2PWyXnUjjXiD6um3MG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_jennifer-lopez-slays-tiff-red-carpet-as-she-unveils-unstoppable_1728740122.html", "title": "Jennifer Lopez slays TIFF red carpet as she unveils Unstoppable", "title_page": "Jennifer Lopez slays TIFF red carpet as she unveils Unstoppable | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TORONTO – American pop star Jennifer Lopez infused the Toronto film festival with a dose of A-list glamour on Sept 6 at the world premiere of her new movie, true-story sports drama Unstoppable, which earned a rousing ovation.\nThe 55-year-old actress, singer and dancer was making her first red-carpet appearance since the announcement of her divorce from American actor Ben Affleck, who co-produced the film with best friend Matt Damon, but was not in attendance.\nAnd she did not disappoint, wearing a skin-baring metallic silver gown with seemingly nothing but giant black velvet bows holding it together, her hair long and loose. Sky-high silver platform heels finished the look.\nIn Unstoppable, Lopez plays Judy, the mother of high-school wrestler Anthony Robles (Jharrel Jerome) who, though born with only one leg, doggedly pursued – and achieved – his dream of becoming an American university champion.\nOscar nominee Don Cheadle and Michael Pena play his demanding coaches, and American actor Bobby Cannavale plays his abusive stepfather, who repeatedly puts the family in jeopardy.\nUnstoppable tells Robles’ inspiring story while also delving into the difficulties of his family life, and showcasing his close relationship with his mother.\nThe film had several applause moments in the build-up to Robles’ winning run to a college championship for Arizona State University. Then, as the credits rolled, the 36-year-old himself, in the theatre, earned a standing ovation from the crowd at Roy Thomson Hall.\n“When I read the script, I felt like so many women, including myself, could relate to the struggles that she had gone through in her life,” Lopez said in a question-and-answer session after the screening. “This story being a Latino story, being so inspiring – it was just something that kind of grabbed me.”\nJerome, 26, said he trained for five months, including with Robles on the wrestling mat. “As an actor, it is one of the most daunting tasks to portray somebody that is real,” Jerome said.\nUnstoppable was one of the marquee events of Day 2 at the Toronto International Film Festival (TIFF), the largest in North America, which offers a mix of Oscar-bait movies, feel-good family fare and searing documentaries.\n2024 marks a return to normal for the event, after twin strikes by actors and writers kept top talent from promoting their work here in 2023.\nLopez is just one of the major stars visiting Canada’s biggest city for the festival. Ben Stiller, Orlando Bloom and Katy Perry hit the red carpet on Sept 5. Also expected are Angelina Jolie, Bruce Springsteen, Salma Hayek, Cate Blanchett and Nicole Kidman.\nThe Last Showgirl\nEarlier, American director Gia Coppola debuted her latest effort behind the camera, The Last Showgirl, starring actress Pamela Anderson as Las Vegas veteran performer Shelley, who is left in despair when her show is abruptly cancelled.\nAfter a 30-year run dancing half-naked in sequins and high heels in a traditional Sin City show, Shelley must figure out what the future holds.\nCoppola – granddaughter of legendary director Francis Ford Coppola and niece of director Sofia Coppola – goes beyond the bright lights of America’s favourite gambling playground to show the harsh realities of the entertainment industry and what happens to those it discards, especially women.\n“I think I’ve been getting ready my whole life for this role,” Anderson, 57, told the audience after the screening. The Baywatch (1989 to 2003) actress quipped that it was the first time she had been offered a script that was “coherent”.\nAmerican actress Jamie Lee Curtis teared up as she spoke about the film. She plays Annette, a one-time dancer and Shelley’s best friend who ends up waitressing to make ends meet – and frittering away her hard-won earnings on bets.\n“It’s a movie about dreams and going after your dreams”, only to discover they may never be realised, said the Oscar winner.\nElton John: Never Too Late\nMeanwhile, a bespectacled Elton John rolled down the red carpet at the film festival in a purple golf cart adorned with stars, displaying a brand of showmanship befitting the world premiere of the documentary, Elton John: Never Too Late.\nAmplified by archival footage and photographs, the film is an intimate look at the singer-songwriter’s life and career through the lens of his Farewell Yellow Brick Road tour, which culminated with a 2022 performance at Dodger Stadium in Los Angeles.\nThe documentary’s co-directors – R.J. Cutler and David Furnish, a Toronto native and Sir Elton’s husband – hope fans learn something new about a celebrated megastar who has sold millions of albums and packed arenas worldwide since the 1970s.\nSir Elton, 77, is one of a rarified group known as EGOT winners, having taken home an Emmy, Grammy, Oscar and Tony award in his career.\nThe Britain-born Sir Elton, who started life as Reginald Dwight, began his rise to stardom in 1967 when he answered an ad for Liberty Records and joined forces with English lyricist Bernie Taupin.\nThe movie, a co-production of Disney+ and Rocket Pictures, has something for everyone, said Cutler, whose directorial credits include Belushi (2020) and Billie Eilish: The World’s A Little Blurry (2021).\n“If you grew up with his music as I did, you’re going to recognise this era, this remarkable five-year period from 1970 to 1975, where Elton released 13 albums, seven of which went to No. 1 on the charts,” he said. “If you’ve come to Elton’s music in recent years, you’re going to learn about that period in a way that you probably didn’t even imagine.”\nThe documentary will appear on Disney+ later in 2024.\nSir Elton, who was knighted by Britain’s Queen Elizabeth II in 1998 for his contribution to music and charity, recently announced that he was recovering from a severe eye infection. On Sept 6, he declined to do red-carpet interviews, but Furnish assured Reuters that the singer was on the road to recovery. AFP, REUTERS", "url": "https://www.straitstimes.com/life/entertainment/jennifer-lopez-slays-tiff-red-carpet-as-she-unveils-unstoppable"}