{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:19:19", "date_modify": "2024-10-12 14:19:19", "date_publish": "2023-12-15 15:30:00", "description": "The Seal and Ioniq 5 are full-electric cars, while the Vellfire is a petrol-electric hybrid. Read more at straitstimes.com.", "filename": "life_motoring_st-car-of-the-year-top-three-contenders-are-byd-seal-hyundai-ioniq-5-and-toyota-vellfire_1728742759.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/15/tc-ctcoty14-1223.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_st-car-of-the-year-top-three-contenders-are-byd-seal-hyundai-ioniq-5-and-toyota-vellfire_1728742759.html", "title": "ST Car of the Year: Top three contenders are BYD Seal, Hyundai Ioniq 5 and Toyota Vellfire", "title_page": "ST Car of the Year: Top three contenders are BYD Seal, Hyundai Ioniq 5 and Toyota Vellfire | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The BYD Seal, Hyundai Ioniq 5 and Toyota Vellfire are into the final lap of an annual race to be crowned Straits Times Car of the Year 2023.\nThe Seal and Ioniq 5 are full-electric cars, while the Vellfire is an efficient petrol-electric hybrid multi-seater. They are among nine contenders selected out of some 40 all-new models launched by authorised agents in 2023.\nThe Seal, Ioniq 5 and Vellfire have emerged the top three scorers in the race, beating the BMW i7, Citroen e-C4, Lotus Eletre, MG 4, Nissan X-Trail and Peugeot 408 (the only pure combustion-engine model among the nine finalists).\nTwelve judges weighed in on the various attributes of each car. A total of nine qualities are assessed: performance, handling, ride quality, build quality, practicality, efficiency, styling, value for money and X-factor.\nOf these, practicality and value for money are assigned extra weightage as they are deemed to be crucial elements considered by consumers.\nContenders are judged according to their peers and not against one another. The top three contenders remaining happen to fall into three price brackets. The Ioniq 5 starts at $183,800, the Seal starts at $209,888 and the Vellfire is priced at $408,888 – all with certificate of entitlement.\nThe three are also well represented across nationalities. The Seal is Chinese, the Ioniq 5 is South Korean (but assembled in Singapore) and the Vellfire is Japanese.\nIn 2022, the top three contenders were two Toyotas (the Sienta and the bZ4X) and a Kia (the Niro Hybrid). The Sienta eventually won, making it the first Toyota to be crowned ST Car of the Year in 20 years.\nThe ST Car of the Year will be announced on Dec 22.", "url": "https://www.straitstimes.com/life/motoring/st-car-of-the-year-top-three-contenders-are-byd-seal-hyundai-ioniq-5-and-toyota-vellfire"}