{"authors": [], "date_download": "2024-10-12 13:56:44", "date_modify": "2024-10-12 13:56:44", "date_publish": "2023-07-23 13:00:00", "description": "Rare Beauty has succeeded by creating affordable make-up and leveraging Gomez’s immense popularity. Read more at straitstimes.com.", "filename": "life_style_selena-gomez-sells-93-million-worth-of-blush-a-year-as-her-beauty-brand-booms_1728741404.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/23/wgt-selena-220723.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_selena-gomez-sells-93-million-worth-of-blush-a-year-as-her-beauty-brand-booms_1728741404.html", "title": "Selena Gomez sells $93 million worth of blush a year as her beauty brand booms", "title_page": "Selena Gomez sells $93 million worth of blush a year as her beauty brand booms | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Selena Gomez keeps beating the odds.\nThe 30-year-old American singer-actress has avoided the potential pitfalls of child stardom to become an even bigger celebrity as an adult, with a career that has spanned nine Top 10 pop hits, more than two dozen platinum or gold singles and starring in the hit comedy series Only Murders In The Building (2021 to present).\nAnd her make-up line is earning the big bucks as well.\nRare Beauty has surged in popularity since its debut less than three years ago, despite a fallout at many celebrity-backed cosmetic lines.\nThe company has succeeded in the US$250 billion (S$332 billion) global beauty industry by creating simple, moderately priced make-up and leveraging Gomez’s immense popularity on platforms such as TikTok.\n“People are looking for performance and value in their products, which Rare does really well,” says Ms Sable Yong, a beauty writer based in New York.\n“Yes, it’s cute. Yes, Selena Gomez is the founder. But even if she wasn’t in the picture, they’re well-formulated products that perform really well at a fairly attainable price point.”\nThe brand is on pace in 2023 to triple last year’s sales. In 2022, the company moved 3.1 million units of its best-selling blush. The product retails for US$23, which means it alone generated about US$70 million in revenue. (The company declined to provide additional financial details, including its investor roster.)\nCelebrity attachment is no guarantee of a hit. Consumers can be fickle, and lots of brands tied to famous people have fizzled after a strong start.\nEarlier this year, American actress Kristen Bell, 43, shut down her skincare line.\nSephora stopped selling the brands of American TikTok celebrities Addison Rae, 22, and Hyram Yarbro, 27.\nAmerican singer-actress Ariana Grande, 30, paid US$15 million to buy the physical assets of her company, r.e.m. beauty, from Forma Brands, whose big bet on celebrity influencers soured and pushed it into bankruptcy.\n“There’s less forgiveness for a celebrity brand,” says Mr Rich Gersten, co-founder and managing partner at True Beauty Ventures, a private equity firm specialising in beauty and self-care. “If the product wasn’t good, it wouldn’t have scaled or stayed scaled.”\nRare Beauty, which said Gomez was not available for an interview, did not focus on chasing trends, such as a gimmicky eyeshadow palette with dozens of colours.\nIt instead created accessible and easy-to-use items, including a lip liner for US$15 and a liquid foundation in 48 shades for US$30.\nThe brand was also founded with a social cause at its core, a hallmark of younger brands but not for industry heavyweights.\nGomez has been an advocate for mental health, including publicly discussing her own struggles.\nRare Beauty pledged to dedicate 1 per cent of sales to its in-house fund, having raised at least US$5 million so far, per the company’s 2022 social impact report.\nThe label is part of a growing collection of business ventures for Gomez.\nShe also co-founded Wondermind, a start-up focused on improving mental health that was valued last year at US$100 million, has executive produced shows on Netflix and HBO Max and formed partnerships with brands such as Puma.\nA lot of Rare Beauty’s success is credited to Gomez’s fan base, which includes more than 400 million Instagram followers, but the brand also has an executive team made of industry veterans.\nMs Joyce Kim, Rare Beauty’s chief product officer and a former executive at L’Oreal’s Nyx Professional Makeup, was tasked by Gomez with creating a line that could hold up at one of her red-carpet appearances as well as in her customers’ everyday lives.\n“It has to feel weightless and be easy to apply,” Ms Kim says. “But it’s got to hold up for events.”\nOn the marketing side, Rare Beauty has excelled at creating social media buzz. The brand has more than three million followers on TikTok and six million on Instagram, and tailors content across its platforms.\nGoogly-eye stickers appear on a blush tube for the TikTok audience, and posts focusing on mental health have particular resonance on Instagram.\nNot being afraid to experiment has helped, according to Ms Katie Welch, Rare Beauty’s chief marketing officer.\nGomez also touts the brand and gives tutorials on her accounts.\nIn the early months following the launch, she recorded hours and hours of herself doing her make-up for one of her TV shows, the HBO Max cooking series Selena + Chef (2020 to present).\nThe team then cut those sessions down to clips that often last no longer than a minute. Other snippets feature Gomez lip-syncing to popular TikTok sounds, with commentary about Rare Beauty’s products.\n“The reception from influencers and online users has been overwhelmingly positive,” says Ms Artemis Patrick, Sephora’s global chief merchandising officer.\nThe brand continues to add products, such as a gel eyeliner, and expanding. Distribution recently reached Indonesia and India.\nOther hits include a powder highlighter, which served as a throwback to the gleaming highlighters of the 2010s.\nWhen it began selling, Mr Mehdi Mehdi, Rare Beauty’s chief digital officer, realised the brand can revive trends, not just create new ones.\n“We had been told the era of powder highlighter was over,” Mr Mehdi says. “We have the ability to buck the trends.” BLOOMBERG", "url": "https://www.straitstimes.com/life/style/selena-gomez-sells-93-million-worth-of-blush-a-year-as-her-beauty-brand-booms"}