{"authors": ["Eddino Abdul Hadi"], "date_download": "2024-10-12 13:58:07", "date_modify": "2024-10-12 13:58:07", "date_publish": "2024-06-20 14:15:00", "description": "Local artistes like Stefanie Sun, Tanya Chua, Jasmine Sokko and Shazza were previously featured. Read more at straitstimes.com.", "filename": "life_entertainment_singaporean-singer-iman-fandi-appears-on-nyc-s-times-square-billboard-for-spotify-campaign_1728741487.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/20/Iman20Fandi20EQUAL20Times20Square20Billboard202.jpg?VersionId=Lw7bC6w931bzvD2_yntT2H_Jdm3ttvDD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_singaporean-singer-iman-fandi-appears-on-nyc-s-times-square-billboard-for-spotify-campaign_1728741487.html", "title": "Singaporean singer Iman Fandi appears on NYC’s Times Square billboard for Spotify campaign", "title_page": "Singaporean singer Iman Fandi appears on NYC’s Times Square billboard for Spotify campaign | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singaporean singer and model Iman Fandi is the latest home-grown female artiste to be featured on a billboard at Times Square in New York City on June 19.\nThe 24-year-old is an ambassador for music streaming service Spotify’s Equal campaign for Singapore and Malaysia. The programme celebrates female artistes from around the world.\nShe joins Stefanie Sun, Tanya Chua, Jasmine Sokko and Shazza, who were featured on the billboard as part of the previous years’ Equal campaign.\nThe only daughter of local football icon Fandi Ahmad and former model Wendy Jacobs, Iman, a former athlete, made her professional music debut as a singer and songwriter in 2021.\nHer first single Timeframe (2021) and another track Love Me Little More (2021) have clocked more than one million streams on Spotify.\nThe pop-R&B singer released her latest single, Leave You On Read, in April and is working on her debut album.\nIn 2023, Iman was one of the home-grown musicians who sang the National Day Parade theme song Shine Your Light.\nShe kicked off her modelling career at age 14, has appeared on the covers of magazines such as Elle Singapore and Harper’s Bazaar Singapore, and works with brands such as Adidas and Celine.\nIman, who is signed to record label Universal Music Singapore, wrote in an Instagram post that “10-year-old me never saw this coming”. The post included a photo of herself as a child superimposed in front of the Times Square billboard.\n“As a young girl, being on a billboard was something I had always dreamed of. Never in a million years did I think I’d be on one in NYC with @spotify!”\nShe added: “Having the support of @spotify, @spotifyasia and Equal has not only inspired me as a female artiste, but also many others to keep creating music and make a mark in the industry.”", "url": "https://www.straitstimes.com/life/entertainment/singaporean-singer-iman-fandi-appears-on-nyc-s-times-square-billboard-for-spotify-campaign"}