{"authors": ["Amanda Chai"], "date_download": "2024-10-12 13:55:36", "date_modify": "2024-10-12 13:55:36", "date_publish": "2023-07-07 13:00:00", "description": "Just like with clothing, treat your fragrance as a wardrobe that you can switch up depending on the weather. Read more at straitstimes.com.", "filename": "life_style_scents-of-summer-seven-new-fragrances-for-the-hottest-time-of-the-year_1728741336.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/07/Amouage20Odyssey20collectionpic20credit20AMOUAGE_3.jpg?VersionId=yww32Al4Gn1RWnjPegWmWb7vzuK7igDd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_scents-of-summer-seven-new-fragrances-for-the-hottest-time-of-the-year_1728741336.html", "title": "Scents of summer: Seven new fragrances for the hottest time of the year", "title_page": "Scents of summer: Seven new fragrances for the hottest time of the year | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Summer is arguably one of the most delightful seasons for fragrance.\nThe perfumes are light and fresh, not overly cloying and easy to wear in Singapore’s weather. Think scents evoking the Mediterranean, or with grassy green notes and zesty bursts of citrus.\nJust like with clothing, treat your fragrance as a wardrobe that you can switch up depending on the weather and mood. Here are some new launches to try.\n1. Amouage Odyssey Collection, $543\nIn the world of niche perfumery, Oman-born luxury fragrance house Amouage has grown a cult following for its distinct Middle Eastern sensibilities and beautiful bottles.\nThe brand was established in 1983 by the Sultan of Oman. Bottles for its women’s scents are said to recall the shape of the Palace Ruwi Mosque in Muscat, while those for the men’s fragrances are shaped like a Khanjar, the traditional dagger of Oman.\nThe third and latest chapter of its Odyssey Collection is built around royal frankincense, with four new fragrances ($543 each) inspired by escapism and a journey to find oneself.\nIn a bottle fit to be collected by The Little Mermaid’s Ariel, Lineage sings a song of salty incense and mineral warmth, with notes of Sichuan pepper, ginger and a whiff of sea spray that bring to mind beach holidays.\nGuidance, a luxurious feminine scent which has gone somewhat viral on TikTok, seduces with its opening of pear and hazelnut that settles into a creamy, lingering whisper.\nTwo men’s scents round up the collection. Search is zesty lemon and lime – a fitting counterpart to Lineage – while Purpose, spicy and woody with notes of bergamot, sand vetiver and papyrus, is an addictive green option for night-time.\nInfo: Available at Escentials stores including at Paragon, Tangs at Tang Plaza, escentials.com and tangs.com\n2. Dior Dioriviera, from $215\nThe first Dior fragrance from legendary perfumer Francis Kurkdjian, who was appointed the luxury house’s perfume creation director in 2021, is a sun-drenched creation that screams summer by the sea. The French nose is best known for his own eponymous luxury brand.\nFrom Dior’s prestige line La Collection Privee, Dioriviera (from $215 for 40ml) was inspired by Kurkdjian’s time spent in the French Riviera.\nBut it is not salty oceanic notes as one might imagine. Instead, green notes of fig and rose make up this floral fruity fragrance, with a fresh opening sure to appeal to those hankering after the “clean girl” aesthetic.\nInfo: Available at La Collection Privee Christian Dior, B2-52 Ion Orchard, 2 Orchard Turn, and shop.dior.com.sg\n3. The Body Shop Full Flowers, $75\nFor an eau de parfum that will not break the bank, get a whiff of The Body Shop’s new collection of floral fragrances.\nFull Flowers is the British brand’s premium fragrance range, conjuring up summer-approved images of soft petals, green leaves and juicy fruits. Designed to be unisex, the four perfumes ($75 each) are made of at least 90 per cent natural ingredients.\nEach is composed around the scent of a natural flower oil – rose, iris, ylang ylang and orange blossom. Full Iris is soft and woody with notes of juniper berry, while Full Orange Blossom blends fresh bergamot and the crisp greenness of vetiver.\nThe bottles are made from recycled glass, and the caps from naturally renewable wood and cork.\nInfo: Available at select The Body Shop stores, including at Plaza Singapura, Causeway Point, Ion Orchard and Bugis Junction\n4. Kilian Paris Blue Moon Ginger Dash, $390\nThis niche brand’s claim to fame may be that it makes superstar Rihanna’s rumoured signature scent (Love, Don’t Be Shy), but did you know that the French label’s founder is also a descendant of the Hennessy alcohol empire?\nKilian Hennessy (who shares his name with his grandfather, former chief executive of the cognac company) founded his eponymous perfume line in 2007 to chart his own path away from the family business. However, he eventually launched an alcohol-inspired range called The Liquors in 2020 to pay tribute to his heritage.\nEnter the latest Blue Moon Ginger Dash, inspired by the 51-year-old’s summer cocktail of choice, the 1990s party drink Blue Lagoon – a potent mix of lemon, vodka and blue curacao liquor.\nA dash of organic ginger essence and ambroxan give it more body, so it carries well as a night-time scent too.\nThe juice is fittingly encased in a cocktail glass-like bottle, its chiselled design inspired by Art Deco crystal cocktail tumblers.\nInfo: Available at bykilian.com and escentials.com\n5. Penhaligon’s Solaris Eau de Parfum, $310\nThe British perfume house’s star scent has a new partner to complete its cosmic tale.\nInspired by the sun, Solaris Eau de Parfum ($310) was designed in poetic opposition to Luna Eau de Toilette, Penhaligon’s bestseller inspired by the light of a crescent moon. Luna is also the scent of the toiletries in the amenities kit on Singapore Airlines’ business class flights.\nIf Luna is the moon, mysterious and airy with its powdery notes of juniper berry and ambergris, Solaris is bold sunshine, with sparkling notes of blackcurrant, neroli and sensual vanilla that bring to mind an indulgent day at a beach club.\nAnd while Luna is decidedly feminine, both men and women will be able to enjoy the warmth of Solaris.\nInfo: Available at Sephora Ion Orchard, sephora.sg, escentials.com and Penhaligon’s stores\n6. Bvlgari Man Rain Essence, from $165\nAs its name suggests, Bvlgari Man Rain Essence (from $165 for 60ml) imagines the olfactory trail of rain, tracing the cycle of a rainstorm from start to finish through the top, heart and base notes.\nFret not, for this fresh woody musk scent is nothing like the muggy, humid Singapore showers you might be thinking of.\nAt first spray, it begins with a citrusy burst of energising green tea and sparkling orange – to characterise the change in the air signalling the onset of rain. After the first drops fall, white lotus accord and crystal musks accord give the fragrance a more vegetal and watery quality.\nWhen the storm passes, what lingers is a quiet vigour that comes through via mineral amber and guaiac wood notes in the dry down – a fresh yet mossy skin scent perfect for post-shower.\nIt completes the Italian brand’s collection of male fragrances inspired by natural elements.\nInfo: Available at major department stores and Sephora stores\n7. Gucci Bloom Eau de Parfum Intense, from $175\nFor an enchanting sweet white floral that is suitable for the night, there is the new Gucci Bloom Eau de Parfum Intense (from $175 for 30ml) from the Italian brand.\nThe latest addition to the Gucci Bloom family was made for hot summer nights. Building atop the original tuberose-centric perfume, this one has more depth – grounded with patchouli essence and coconut base notes for added sensuality and creaminess.\nGinger, pear and mandarin orange keep the scent, which was blended by the same perfumer behind Bvlgari Man, fruity and light.\nInfo: Available at Gucci Beauty boutiques including B2-44/46, Ion Orchard, 2 Orchard Turn; Sephora stores; and counters at Takashimaya Shopping Centre, BHG and Metro", "url": "https://www.straitstimes.com/life/style/scents-of-summer-seven-new-fragrances-for-the-hottest-time-of-the-year"}