{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:19:34", "date_modify": "2024-10-12 14:19:34", "date_publish": "2022-12-23 16:00:00", "description": "The other nine contenders have winning attributes too. Read more at straitstimes.com.", "filename": "life_motoring_the-straits-times-car-of-the-year-2022-how-the-contenders-fared_1728742774.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/23/2022122010971961673f037c7-8d21-4345-871e-2cbab152be06_1.jpg?VersionId=0B.xnsZwfvhHP4vZU1BD59MrtFNQ7rax", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_the-straits-times-car-of-the-year-2022-how-the-contenders-fared_1728742774.html", "title": "The Straits Times Car of the Year 2022: How the contenders fared", "title_page": "The Straits Times Car of the Year 2022: How the contenders fared | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Toyota Sienta Hybrid beat nine other contenders to clinch the coveted Straits Times Car of the Year award. But one winner does not mean nine losers. Making it to the final shortlist is already winning. This is how each of the contenders fared.\nBYD Atto 3\nAmong electric cars, the Atto 3 compact crossover scored the highest for Efficiency. Its real-life power consumption of 15.1kWh/100km is impressive – even more so with a mix of urban and sporty driving.\nThe car also has several novel features, including musical door pockets. Judge Lionel Seah says the Atto 3 is a “sharp-looking SUV with a funky cabin vibe... better equipped than most cars in its segment”.\nBMW i4\nThis electric executive saloon clinched the highest marks for Handling, Build Quality and the elusive X-Factor, making it as decorated as this year’s Car of the Year.\nIt is not too shoddy in the Ride department either, ranking after the Toyota bZ4X and the far costlier Mercedes-Benz EQS450+.\nJudge Kong Yongyao says the car is “everything you expect an electric 3- or 4-series to be – holistic, deft and sophisticated”.\nBMW 218i Active Tourer\nIt may have the lowest overall score, but this BMW fared reasonably well for Build Quality and Practicality. Like the Toyota Sienta Hybrid, the 218i compares very favourably against its predecessor.\nIt looks sharper, has better fit and finish, packs more features and offers a cushier ride all round.\nMr Seah says: “What it lacks in out-and-out performance, it makes up for with an engaging drive and a level of polished refinement.”\nBMW M240i Coupe\nThis power-packed two-door BMW takes the cake when it comes to Performance, narrowly pipping the BMW i4. It fared relatively well in Handling, Ride and X-Factor too.\nFor those who still yearn for the grunt of a beefy combustion engine, this BMW still satisfies more than most. With a 4.3-second century sprint and a regulated top speed of 250kmh, it compares well even against the steroidal i4 M50.\nKia Niro Hybrid\nThe second runner-up was boosted by above-average marks for Ride, Practicality, Build Quality, Styling and Value for Money. The variant with the lowest trim level, at around $164,000, is actually only slightly more expensive than the Toyota Sienta ($158,500).\nDr Kong says: “The Niro is a good all-round effort with consistent competence across the board.”\nMercedes-Benz EQS450+\nThis electric limo outpaced the field in Ride comfort. As the costliest contender (priced at nearly $560,000), it had better.\nBut even when compared with peers in its price bracket, the EQS450+ still impresses with its obviously comfort-biased air suspension. Its cottony soft ride, however, comes at some expense to Handling, which the car does not fare too well in.\nAnd even though it promises a range in excess of 700km, it does not shine particularly brightly in the Efficiency department.\nPeugeot e-2008 GT\nThe only attributes which this peachy electric subcompact did not fare too well in are Performance and X-Factor.\nBut for the other seven attributes, the Peugeot had more-than-decent innings, which helped it secure fifth place. It had the third highest score for Value for Money, which is saying a lot for an electric car.\nIts petrol-powered sibling – the Peugeot 2008 1.2 – also had a decent showing in last year’s ST Car of the Year, where it ranked sixth.\nPolestar 2\nIf cars were students, the Polestar 2 would qualify as a solid B+ performer. It fared reasonably well for all the attributes, except for Ride.\nAmong electric contenders, it came in third for X-Factor, trailing behind the BMW i4 and Toyota bZ4X. This is not surprising, given its Scandinavian minimalistic design.\nUnlike minimalism which can appear bare and dull, Polestar’s execution is stylish and chic. To boot, the car had the longest real-world range during a return trip to Penang taken by The Straits Times in June, alongside the MG 5 and Audi e-tron S Sportback.\nJudge Toh Yong Chuan says: “The Polestar 2 will change how drivers see made-in-China cars. Its build quality is on a par with that of the established German and Japanese luxury cars made elsewhere.”\nToyota bZ4X\nThe bZ4X had the highest score for Styling, which is a double feat of sorts because a good-looking SUV is hard to come by and a handsome electric model is equally rare.\nIt pips the Polestar 2 in two areas – Practicality and Ride – and that was enough to propel the Toyota to the runner-up position.\nDr Kong says “there is an uncommon grace” to the car, with its electric powertrain “tuned to be progressive and precise rather than snappy and nauseating”.\nFollow Christopher Tan on Instagram @chris.motoring", "url": "https://www.straitstimes.com/life/motoring/the-straits-times-car-of-the-year-2022-how-the-contenders-fared"}