{"authors": ["Venessa Lee"], "date_download": "2024-10-12 13:54:46", "date_modify": "2024-10-12 13:54:46", "date_publish": "2024-05-04 13:00:00", "description": "Mr Samuel Ng pens memoir on caring for his dementia-stricken mum, whom he had “abandoned” in his rebellious youth. Read more at straitstimes.com.", "filename": "life_dementia-has-brought-me-back-to-my-mother-one-man-s-journey-from-runaway-son-to-caregiver_1728741286.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/04/yihsin-vldementia-07.jpg?VersionId=C2Wxts3V24EwvR4rE1KYYkoyGhIYF2oR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_dementia-has-brought-me-back-to-my-mother-one-man-s-journey-from-runaway-son-to-caregiver_1728741286.html", "title": "‘Dementia has brought me back to my mother’: One man’s journey from runaway son to caregiver", "title_page": "‘Dementia has brought me back to my mother’: One man’s journey from runaway son to caregiver | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Charity boss Samuel Ng, 57, was once a rebellious teen who ran away from home. Decades later, however, he became a caregiver for his dementia-stricken mother, whom he “abandoned” for eight years.\nMr Ng, founder and chief executive of Montfort Care social service agency, touches on this episode in his life in his caregiver memoir, Can I Hold You A While Longer? Mum And Our Slow Dance With Dementia.\nHis book delves into various facets of the caregiving experience, such as the role of domestic help and institutional care, and how memory loss is far from being the most challenging aspect of the disease’s debilitating toll.\nPublished in Chinese in 2022, the memoir was recently translated into English and launched at the end of March. Published by Montfort Care and distributed by Focus Publishing, it retails at $20.27 at major bookstores.\nMr Ng says his mother’s dementia, which used to drive him to entertain thoughts of ending his life, has been, paradoxically, a “blessing in disguise”. It allowed him to fully reconcile with her.\nHe and his elder sister, Ms Lynda Ng, a 58-year-old real estate agent, are unmarried, and they cared for their mother, together with a domestic helper, in a rented four-room HDB flat in Bedok for most of the last 12 years since the onset of her dementia. They have another sister, Margaret, 59, a married housewife with an adult son.\nTheir 87-year-old mother, Madam Tan Joo Im, now resides in a nursing home which they sent her to in 2019. She uses a wheelchair and can no longer speak coherently.\n“A pastor friend told me that dementia is a long goodbye. My mum has had it for 12 years and the toll on the caregivers is heavy. But because of this long goodbye, dementia has brought me back to my mother,” says Mr Ng, who is Catholic.\nHis mother, he adds, has been influential in his lifelong career in social work. Among the many programmes targeted at families, children and seniors at Montfort Care, which Mr Ng started in 1998 as a family service centre under a different name, is YAH! community college.\nThe programme stands for Young-At-Heart and offers life skills and other courses for seniors. It was inspired by his mum, who “graduated” from it at age 70.\nMr Ng says: “I wanted to set up YAH! community college because my mum always considered her lack of education to be her biggest regret in life. Before she had dementia, I told her, ‘Mum, you’re very smart. If you had been born in this era, you would have a master’s degree.”\nHis mother, one of 10 children, sneaked off for night classes as a teen. Her father was infuriated when he found out and put an end to her nascent efforts at educating herself. She later became a seamstress.\nHer husband’s sudden death at age 49 from a heart attack caused their family to unravel. Mr Ng was just 13 years old. His two sisters soon left school and found work, while extended family members helped support them.\nAt 16, Mr Ng ran away from home, effectively “abandoning” his widowed mother, who used to wait for him daily outside Anglican High School, so he could eat the lunch she had prepared before going for afternoon classes to improve his English.\nHe says: “I didn’t understand why I did it. I was rebellious and experiencing a deviant, adolescent phase. My sisters had to work, my dad had died and my own life was a mess. We all drifted apart emotionally. I thought: Why am I so suay (unlucky in Singlish) to end up in this family?”\nHe packed his belongings while his mother was out playing mahjong and went to an aunt’s place. He stayed with her family for about eight years, during which he had minimal contact with his mother.\nNo one in his traditional Chinese family spoke in depth about this rupture, not even when he decided to end the standoff and return home for good, he says.\nBy that time, he was around 24 years old and working as a social worker after graduating from National University of Singapore.\n“People say I’m very xiao shun (filial in Chinese) in caring for my mum, but I tell them they don’t know the whole story,” Mr Ng says, relating a common reaction he got from his memoir.\nFocusing on social issues, current affairs and his own plight as a caregiver, he used to have a long-running Lianhe Wanbao column and is a frequent guest on Chinese radio show, City Train, on 95.8FM.\n“If my mother had not got dementia, we would all probably have led our own separate lives. We never said ‘I love you’ before. Now I give her massages and hug her.\n“The caregiving journey has played a part in my reconciliation with her. This long goodbye also allows me to work through my personal issues with her. My relationship with her changed and I learnt to get closer to her emotionally when I lived with her every day. It was a precious breakthrough when I could hold her hand, which I couldn’t imagine before.”\nHis mother started behaving oddly more than 10 years ago. She gave out hongbao (red packets) to the same people repeatedly one Chinese New Year, forgetting she had already done so.\nWhen she played Four Colour Cards, a traditional Chinese game of cards, she accused others, without cause, of cheating.\nShe was no longer sociable, preferring to stay home after she got lost on her way back from the nearby market, a route she had taken countless times.\nThe doctor they consulted confirmed her diagnosis without sending her for an MRI scan, saying it was evident she had dementia.\nMr Ng says: “Through media influence, we equate dementia with memory loss. But caregivers will tell you that memory loss is the easiest thing. It’s the destructive behaviour, the irrational thinking, that is so challenging.”\nEarly on, his mother accused his sister of stealing her jewellery, which Lynda herself had given her. The siblings turned their flat upside down trying to hunt down the gold pieces, even looking in the rice bin.\nMonths later, Mr Ng grabbed an umbrella on his way out on a rainy day. Gold chains and rings, carefully stashed by his mother within its folds and spokes, spilled out.\nDisruptive behaviour was part of living with dementia. Their mother once had to go to hospital briefly. The nurses called in the middle of the night because she kept screaming, unable to understand where she was.\nShe had insomnia, going without sleep for up to three days. Mr Ng, his sister and their helper took turns doing six-hour shifts, staying up with her and holding her upright as she shuffled unsteadily from the kitchen to every room of their flat and back again in a ceaseless loop. The constant clunking of her walking frame kept them awake.\nMr Ng and his sisters sometimes refrained from speaking to one another – the tension was so thick in the flat they felt like they might explode.\nPieces of their mother’s identity and memory gradually faded away. Mr Ng, the favoured only son, was devastated when she forgot his name – he kept asking her, “Do you know me? I’m your son, Ah Tee (little brother, a nickname).”\nIt was a wrenching moment for the siblings when the time came to check her into a nursing home, when they realised she needed professional care they could not provide. They visit her at least once a week now.\nMr Ng recalls: “It’s very bittersweet. It’s painful on the one hand, but you also realise you can still spend time with her. A Catholic nun I know told me that my mum is living in her own world and there’s no ‘you’ in her world. My mother is here, but my mother is gone.\n“Till today, I sometimes feel that this whole thing is made up. Sometimes I tell my mother: ‘Ma, ni ke yi xing lai ma?’ (Mum, can you wake up?)\n“But I also feel happy for her. She’s at her happiest now. That destructive period, when it was possible for me to think of jumping and ending it all, is over.\n“I suspect that she is back in her childhood; at one point, she kept asking about her mother. She has forgotten about everything, but she keeps laughing and is very talkative, although nobody understands her. Today, my mother is so lovable.”\nHe knows first-hand how dementia “splits the family”, bringing to the surface unresolved and fresh family tensions, which take the form of caregiver quarrels or, in extreme cases, siblings going to court.\nWhile there are many resources devoted to dementia care in Singapore, there is a great need for more “family therapy” for those living with the degenerative condition, he says.\nMr Ng says: “Amid the heavy toll of caregiving, I hope caregivers can find some light in the form of healthier relationships. Remember that this, too, shall pass. I am now in a better position to let go of my mother with no regrets.”", "url": "https://www.straitstimes.com/life/dementia-has-brought-me-back-to-my-mother-one-man-s-journey-from-runaway-son-to-caregiver"}