{"authors": ["Jan Lee"], "date_download": "2024-10-12 14:04:28", "date_modify": "2024-10-12 14:04:28", "date_publish": "2024-07-02 15:10:00", "description": "Her daughter's Facebook post detailed how they were turned away from two hospitals before being admitted. Read more at straitstimes.com.", "filename": "life_entertainment_former-celebrity-chef-lisa-fong-89-hospitalised-for-20-days-for-urethritis-and-pneumonia_1728741868.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/02/imgonline-com-ua-FrameBlurred-n07ePyUyWVH2RZ.jpg?VersionId=JeqFhErzxjYwjikCguMt2ncRZoBklXpR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_former-celebrity-chef-lisa-fong-89-hospitalised-for-20-days-for-urethritis-and-pneumonia_1728741868.html", "title": "Former celebrity chef Lisa Fong, 89, hospitalised for 20 days for urethritis and pneumonia", "title_page": "Former celebrity chef Lisa Fong, 89, hospitalised for 20 days for urethritis and pneumonia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Former celebrity chef Lisa Fong, who is also known as Fang Tai, was hospitalised for 20 days in May for urethritis and pneumonia.\nThe 89-year-old Singaporean had a popular cooking programme on local television in the 1980s and 1990s, but has since retired from the small screen. Her daughter, known as Ah Bao, still gives updates on the beloved personality via Fong’s Facebook page.\nOn June 30, Ah Bao posted a photo of herself with her mother after a lunch outing and wrote a post of over 3,000 words in Chinese that revealed Fong’s recent bout of ill health. The pair live in Hong Kong.\nAh Bao said: “Today is June 30, which is a day worth celebrating to me because a month ago, on May 30, Fang Tai was discharged from the hospital and came home. Forgive me for not having the time nor the mood to update everyone when things were happening, because for the 20 days Fang Tai was in the hospital, I was by her side and did not return home.”\nShe added that she first observed Fong going to the toilet more than usual at the end of April. Ah Bao took her mother to the doctor, where she was diagnosed with urethritis, an inflammation of the urethra, and prescribed a week’s worth of antibiotics. A planned trip to Japan over the Labour Day period was cancelled, so Fong could rest.\nWhile the antibiotics seemingly worked in the first few days, Ah Bao said her mother began complaining of feeling “unwell all over” on the fifth day, but thought it was because she was still recovering from urethritis.\nBut on May 10, Ah Bao returned home to find Fong lying on the sofa and unable to stand. Soon after, Fong threw up while resting in bed and could only lie on the soiled sheets with her vomit.\nWhile Ah Bao wanted to take her mother to the hospital immediately, it took some time to find a hospital that would take Fong in. The first hospital Ah Bao called declined to admit Fong because it no longer had available wards.\nShe then went with Fong to another hospital’s outpatient clinic and waited for more than two hours before being told that because Fong had a high fever, she could stay only in a private room. However, as there were none left, the hospital could not receive her.\nAh Bao was told that they could receive a referral and seek treatment on their own at another hospital, or the hospital could call an ambulance for them.\nShe recalled: “At that moment, I had a bit of a breakdown. I thought I was browsing a travel site to book a hotel. A hospital that doesn’t prioritise treatment when faced with someone who is gravely ill?”\nEventually, the third hospital the pair turned to, Union Hospital, took Fong in. Doctors there found that the bacteria from her bout of urethritis was resistant to her prescribed antibiotics and so entered her bloodstream, causing sepsis, a serious condition that can lead to death.\nA week into her stay in hospital, Fong was also diagnosed with respiratory syncytial virus, which gave her pneumonia.\nIn total, she spent 20 days in the hospital for her urethritis and pneumonia, but is recovering well now.\nAh Bao also shared health and recipe tips on taking care of her mother during this time.\nShe wrote: “In these 20 days, I lost 3kg. I joke that all my hair turned white overnight. I was by her side the whole time she was in the hospital. I was worried, but it’s also important for the family to be by her side because medical resources are so strained in Hong Kong. It’s better to keep an eye on the patient yourself than to lodge a complaint later.”\nShe added: “I want to thank my mum. Because of her hard work, we are heading into a healthier life. She’s always felt like she’s made of iron and will never break, but through this ordeal, she understood that health is something that needs to be maintained. I hope she remembers this lesson.”", "url": "https://www.straitstimes.com/life/entertainment/former-celebrity-chef-lisa-fong-89-hospitalised-for-20-days-for-urethritis-and-pneumonia"}