{"authors": ["Clara Lock"], "date_download": "2024-10-12 13:44:57", "date_modify": "2024-10-12 13:44:57", "date_publish": "2023-02-24 20:30:00", "description": "Japan, South Korea and Taiwan continue to be popular among travellers. Read more at straitstimes.com.", "filename": "life_travel_east-asian-destinations-popular-at-natas-fair-paving-the-way-for-full-recovery-of-global-travel_1728740697.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/25/20230224834850610e60f4d1-b131-4f32-bbe5-6d2d2025d1bd.jpg?VersionId=UvacXnTVqDOQJe9ty4J56ow30kNR9glV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_travel_east-asian-destinations-popular-at-natas-fair-paving-the-way-for-full-recovery-of-global-travel_1728740697.html", "title": "East Asian destinations popular at Natas fair as global travel heads for full recovery", "title_page": "East Asian destinations popular at Natas fair as global travel heads for full recovery | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Top destinations Japan, South Korea and Taiwan continue to be popular among travellers shopping at this year’s National Association of Travel Agents Singapore (Natas) fair.\nIt runs from Friday to Sunday, 10am to 9.30pm at Singapore Expo Hall 5.\nWith 51 exhibitors and a projected attendance of 75,000 visitors over three days, the fair has grown since the 2022 edition six months ago. It had around 40 exhibitors and 68,787 visitors then.\nThere is some way to go before the fair returns to its pre-Covid-19-pandemic heyday, when 80 or so exhibitors set up booths in 2019.\nBut East Asia’s reopening to leisure travel will pave the way for a full recovery. Since the last fair in August 2022, there has been a surge of interest in Japan, Taiwan and, more recently, China.\nTravel agencies such as Chan Brothers Travel and EU Holidays have reinstated tour packages to China, with scenic spots drawing the most interest.\nAmong them are the Jiuzhai Valley National Park, known for its striking turquoise lakes, and Zhangjiajie National Forest Park, where towering mountain pillars are said to have inspired the Hallelujah floating mountains of the 2009 epic fantasy movie, Avatar.\nMr Jeremiah Wong, senior marketing communications manager at Chan Brothers Travel, said customers do not have any significant concerns about the Covid-19 situation in China.\nHe added that the company’s Travel Safe Travel Smart initiatives, such as reduced group sizes and the inclusion of Covid-19 protection benefits, have helped reassure customers.\nTours to China now comprise a maximum of 30 people, compared with 40 before the pandemic.\nEU Holidays director Ong Han Jie said travel agencies view China as an important destination due to its sheer size and number of itineraries the country can offer.\nBeyond China, travellers are looking for experiences other than shopping and sightseeing, he added. These include leisure activities such as classes on making kimchi or tteok-bokki (rice cake) in South Korea, and skiing and hiking trips.\nA Gold Coast Marathon trip, happening this June, has drawn around 40 passenger bookings, he says.\nMeanwhile, freelance tour guide Lincy Kwan, 58, was looking to book a trip to Japan with a group of friends. The seven women have known one another for more than three decades and travelled together regularly before the pandemic. This will be their first group trip since then.\nNatas president Steven Ler said the travel industry is in the midst of a “huge comeback”.\nHe added: “The appetite for overseas travel is high as many desire to explore the world again and go ‘revenge travelling’, in hopes of making up for lost time.”\nAdmission to the fair is free. Go to natastravelfair.travel for more information.", "url": "https://www.straitstimes.com/life/travel/east-asian-destinations-popular-at-natas-fair-paving-the-way-for-full-recovery-of-global-travel"}