{"authors": [], "date_download": "2024-10-12 13:57:11", "date_modify": "2024-10-12 13:57:11", "date_publish": "2022-10-27 12:54:47", "description": "It is her first solo single since 2016's Love On The Brain. Read more at straitstimes.com.", "filename": "life_entertainment_rihanna-to-make-music-return-with-track-for-black-panther-wakanda-forever_1728741431.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/27/2022-10-27T043208Z2127725130RC2E9X90JMWLRTRMADP3FILM-BLACK-PANTHER-WAKANDA-FOREVER-PREMIERE_4.JPG?VersionId=rgIh6cAR.8.e8DeI65FCDGahNdL_CMqf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_rihanna-to-make-music-return-with-track-for-black-panther-wakanda-forever_1728741431.html", "title": "Rihanna to make music return with track for Black Panther: Wakanda Forever", "title_page": "Rihanna to make music return with track for Black Panther: Wakanda Forever | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – After launching high-fashion collections, a lingerie line, a make-up brand, becoming a billionaire and having a baby, megastar Rihanna is making a highly anticipated return to music this week, her representatives said on Wednesday.\nAfter six years without releasing a new solo song, the 34-year-old on Friday will drop a new single titled Lift Me Up, which will be on the soundtrack for the Marvel sequel Black Panther: Wakanda Forever. The movie is set to open in Singapore on Nov 10.\nLift Me Up is Rihanna’s first solo single since 2016’s Love On The Brain.\nShe is releasing the new song on her Westbury Road label in conjunction with Roc Nation, Def Jam Recordings and Hollywood Records.\nThe singer behind the hits Diamonds (2012) and Umbrella (2007) posted a brief preview of the new track, which featured humming over strings.\nThe news comes only weeks after the National Football League announced Rihanna would be headlining the coveted Super Bowl half-time show in February, a long-awaited return to the stage for the pop star.\nRihanna’s fierce fan base has been clamouring for her ninth album, which she has said will be “reggae-infused” and has hinted since 2019 is nearly finished.\nBut the Barbadian-born artiste has focused on other ventures, including becoming the first black woman to head a fashion brand for the French powerhouse LVMH, which owns legacy brands including Fendi and Givenchy.", "url": "https://www.straitstimes.com/life/entertainment/rihanna-to-make-music-return-with-track-for-black-panther-wakanda-forever"}