{"authors": ["Eunice Quek"], "date_download": "2024-10-12 14:04:14", "date_modify": "2024-10-12 14:04:14", "date_publish": "2024-07-18 12:00:00", "description": "Chefs Sam and Forest Leong have come out of retirement to work alongside Min Jiang's master chefs. Read more at straitstimes.com.", "filename": "life_food_food-picks-chefs-sam-and-forest-leong-at-min-jiang-summer-palace-relaunch-on-trend-ingleside_1728741854.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/18/Min20Jiang20Reimagined20An20Exquisite20Showcase20By20Four20Culinary20MastersE2809920-20Chef20Goh2C20Chef20Sam20Leong2C20Chef20Forest20Leong2C20Chef20Chan.jpg?VersionId=NPk_DvBm3vmulZQgs_vYXS1BNCc.._9U", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_food-picks-chefs-sam-and-forest-leong-at-min-jiang-summer-palace-relaunch-on-trend-ingleside_1728741854.html", "title": "Food Picks: Chefs Sam and Forest Leong at Min Jiang, Summer Palace relaunch, on-trend Ingleside", "title_page": "Food Picks: Chefs Sam and Forest Leong at Min Jiang, Summer Palace relaunch, on-trend Ingleside | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Chefs Sam and Forest Leong x Min Jiang collaboration\nChinese restaurant Min Jiang continues its successful streak of collaborations with guest chefs.\nThis time, it is with husband-and-wife chefs Sam and Forest Leong, who have come out of retirement to work alongside master chefs Chan Hwan Kee of Min Jiang and Goh Chee Kong from the restaurant’s outpost in Dempsey.\nTwo set menus are available – a six-course lunch at $148++ a person and a seven-course dinner at $188++ a person.\nTwo standout dishes on both menus are from chef Sam Leong, showing he still has what it takes to dish out comfort Chinese cuisine.\nOne is a rich pumpkin broth with a spoonful of uni and jamon iberico on the side. I am told to pop the spoon into my mouth before savouring the soup. That umami burst whets my appetite, and I continue to slurp every drop of the soup made with old hen that has been simmered over low heat. It is served with abalone, sea cucumber and wild-caught eel maw.\nHis other star item is barley pearl congee with housemade shrimp balls and dried scallops, with extra crunch from the addition of cubed celtuce and a side of salted egg yolk salmon skin.\nChef Goh offers a classic Hong Kong-style “typhoon-shelter” turbot fish fillet and soft-shell crab fried with a crisp medley of breadcrumbs, scallions, garlic, curry leaf, dried chillies and dried shrimp.\nChef Forest Leong rounds off both menus with a dessert of crispy crepes, meringue and gold-laced “threads” with assorted berries gelato. Consider this a deconstructed version of khanom bueang, a Thai street snack given a modern spin.\nYou will also get a taste of chef Chan’s highlights in both menus. The dinner showstopper is his slow-braised wagyu beef cheek with Japanese daikon, while the lunch highlight is slow-braised kurobuta pork cheek with organic kabocha.\nWhichever menu you pick, you cannot go wrong.\nWhere: Min Jiang, Goodwood Park Hotel, 22 Scotts Road\nMRT: Orchard\nWhen: July 22 to 28, 11.30am to 2.30pm (weekdays), 11am to 2.30pm (weekends), 6.30 to 10.30pm daily\nTel: 6730-1704\nInfo: E-mail min_jiang@goodwoodparkhotel.com or make a booking at str.sg/wA5q\nWood-fired restaurant Ingleside\nModern European restaurant Ingleside ticks several boxes in on-trend dining. Wood-fired concept – check. Dry-ageing – check. Use of fermentation – check.\nThe 36-seat restaurant brings together the expertise of a local husband-and-wife team – head chef Louis Chan and head fermentation specialist Jana Jusman.\nSince opening in May, it has been off to a good start and I expect a lot more to come once its lacto-fermented ingredients, garums (typically known as fermented fish sauce) made of chicken and squid, and housemade miso and shoyu continue to develop deeper flavour profiles.\nLunch is priced from $58++ for two courses (top up $15 to $25 for dessert). The six-course Experience dinner menu, which includes three snacks, is priced from $128++.\nThe snacks are tuna tartare tartelette with maitake shoyu, truffle toast and sweet prawn arancini with smoked kelp vinegar, along with housemade bread and lacto-fermented tomato butter.\nI pick the Tajima MBS 6-7 Wagyu Picanha (add $21), with its rich beefy flavour enhanced with shio koji. It is served with pomme puree and slow-roasted banana shallot.\nFor a refreshing end to the meal, the deconstructed lemon meringue tart offers a medley of textures with yuzu granita, smoked vanilla ice cream, toasted meringue, lavender lemon curd and thyme crumb.\nSelected dinner dishes are also on the lunch menu, and I am hoping the additional top-up cost for desserts during lunchtime will be scrapped soon.\nWhere: Ingleside, 49 Tras Street\nMRT: Tanjong Pagar\nOpen: Noon to 3pm (Wednesdays to Fridays), 6 to 11pm (Tuesdays to Saturdays), closed on Sundays and Mondays\nTel: 8839-4393\nInfo: www.instagram.com/ingleside.sg\nSummer Palace’s relaunch\nOne-Michelin-starred Summer Palace – known for its fine Cantonese cuisine – has relaunched at the recently revamped Conrad Singapore Orchard and it is worth returning to.\nNot only have the interiors been refreshed, but the dining experience has also been elevated with a drink programme that focuses on Chinese tea, as well as Chinese wines by the hotel’s wine bar Park90.\nTea sommelier Liu Tian guides diners through a tableside tea ceremony. If you prefer a tea-based cocktail, there is the signature Summer Palace Martini ($28) with Brass Lion Summer Palace Edition Gin, dancong oolong, pomelo, white peony tea and house-infused goji berry liqueur.\nThe restaurant’s executive chef Liu Ching Hai continues to helm the kitchen, dishing out favourites such as Peking duck ($138), roast meats (from $32 for roast pork belly) and dim sum (lunch only).\nChef Liu’s soups, of course, are a must. The lighter Chen Yu Luo Yan soup ($68) includes bird’s nest, fish maw, sea whelk and garoupa, while the robust Qi Yu Xuan Ang soup ($68) has abalone, venison tendon, maca and sea cucumber.\nHis skills in refined simplicity show in the perfectly steamed east star garoupa with fungus and red dates ($26 for 100g). There is also a soon hock version, priced at $30 a portion.\nThe fragrant claypot rice (add $30, good for four people), cooked with the remaining Peking duck meat, is delicious.\nDesserts include almond cream with ginkgo nut and egg white ($13), mango pomelo sago ($13) and, for a luxurious treat, double-boiled superior bird’s nest with almond cream and young coconut ($88).\nBesides the extensive a la carte offerings, set menus are available from $228 a person.\nWhere: Summer Palace, Level 3 Conrad Singapore Orchard, 1 Cuscaden Road\nMRT: Orchard Boulevard\nOpen: Noon to 2.30pm (weekdays), 11.30am to 2.30pm (weekends), 6 to 10.30pm daily\nTel: 6725-3288\nInfo: str.sg/dCfe", "url": "https://www.straitstimes.com/life/food/food-picks-chefs-sam-and-forest-leong-at-min-jiang-summer-palace-relaunch-on-trend-ingleside"}