{"authors": ["Tan Hsueh Yun"], "date_download": "2024-10-12 14:04:02", "date_modify": "2024-10-12 14:04:02", "date_publish": "2024-09-14 14:00:00", "description": "Restaurants are bringing in better cuts and brand names to tantalise taste buds. Read more at straitstimes.com.", "filename": "life_food_meat-on-the-menu-restaurants-beef-up-their-offerings_1728741842.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/14/btsteak20240912.jpg?VersionId=bugqRMMSaors16TZoeq0Pwm2cPG0L8iD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_meat-on-the-menu-restaurants-beef-up-their-offerings_1728741842.html", "title": "Meat on the menu: Restaurants beef up their offerings", "title_page": "Meat on the menu: Restaurants beef up their offerings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – This is a meat lover’s time to indulge.\nCompetition is rife in a city filled with meat-centric restaurants, and owners have had to source more widely for better cuts and brand names to keep diners interested.\nTwo new steakhouses – Wild Blaze in Tras Street and Cygnet by Sean Connolly at the new QT Singapore hotel in Robinson Road – are adding to the restaurants where diners can go for seriously good meat.\nThen there is the casual Gyukatsu Kyoto Katsugyu, which serves steaks breaded and deep-fried like tonkatsu. The brand draws queues in Japan, and has franchised restaurants overseas. It hopes to open at least five restaurants here.\nSo, offering interesting cuts of meat at good prices has become essential to stay afloat. Plus, there is something about meat that draws diners.\nChef Daniele Sperindio, 37, chef-owner of I’Wa Group, which runs one-Michelin-starred Art di Daniele Sperindio and steakhouse Gemma, both at the National Gallery Singapore, says: “There’s something primordial about it. Sharing meat often symbolises a moment of celebration and community, rooted in times when it was a rare treat reserved for special occasions.”\nNew meat specials at Gemma include dry-aged A5 Omi wagyu ($70 for 100g), Miyazaki wagyu A4 striploin ($50 for 100g), and dry-aged T-bone Fiorentina steak ($26 for 100g) and sirloin on the bone ($24 for 100g), both from Australia.\nMs Joey Quek, 30, chief marketing officer of House Of Swiss Butchery in Holland Village, says: “There has been a noticeable increase in demand for red meat options, especially premium cuts like Angus and wagyu beef. Additionally, with the rising trend of diets which emphasise protein-rich meals, we’ve seen a surge in the purchase and consumption of cuts such as sirloin and ribeye.”\nThe butchery-restaurant has new meat offerings that include Beef Brisket with Signature O’Connor Sauce ($24) and Wagyu Meatball Provencal ($19).\nFor September, its specials include one-for-one ribeye steak ($32) and one-for-one sirloin steak ($29), using beef from Australia. Both options come with two side dishes.\nBedrock Bar & Grill at Pan Pacific Serviced Suites Orchard in Somerset Road is showcasing Sir Harry Wagyu by Elbow Valley Beef from Queensland, Australia, in its World Meat Series, which runs till Oct 31.\nThe beef is featured in a five-course dinner tasting menu priced at $138 a person. The beef, from cattle fed with grain and citrus pulp, features in dishes such as striploin carpaccio, smoked beef tartare and tenderloin grilled over applewood.\nChef Isaac Tan, 52, head of culinary and product innovations for Commonwealth Concepts, which runs the 96-seat restaurant, says citrus in the diet “enhances the flavour profile of the beef” and increases levels of vitamin E and antioxidants in the cattle, which prevents the fat from oxidising.\nAnother of Commonwealth’s restaurants, the 70-seat Fat Cow at Camden Medical Centre in Orchard Boulevard, will debut a new 10-course Wagyu Omakase menu ($290 a person) on Oct 16. It will feature Kurohana wagyu from Kumamoto prefecture in a sukiyaki course, and Akune Gold Wagyu from Kagoshima prefecture served as a nigiri sushi.\nBarossa Steak & Grill at VivoCity recently launched some new meat options. Among them are its Meat Platter ($138, serves four to five), with 500g of Australian Angus grass-fed ribeye, a full slab of St Louis pork ribs glazed with shoyu and garlic, pork and lamb sausage, macaroni and cheese, and straight-cut fries.\nThe 150-seat restaurant has also added to its selection of meats cooked in its Josper grill – Australian Black Angus porterhouse ($158 for 1kg, serves two to three) and Tasmania grass-fed lamb rump cap ($42 for 200g).\nRevolver, a 41-seat meat-centric grill restaurant in Tras Street, has just debuted a slew of a la carte options which diners can opt for instead of its tasting menu. Options include Kurobuta pork belly with smoked naga chilli ($22), black pepper venison ($24), Iberico pluma vindaloo ($48), Mayura Station flank steak ($88) and Tajima striploin ($68 for 100g).\nChef Jitin Joshi, 48, says: “As we are transitioning into an a la carte-focused restaurant, we want to offer a wider range of options for our diners.\n“Meats appeal to the diners, especially in a place like Revolver, where open-fire cooking is the main draw. All our proteins are cooked on coals, wood fire and embers. It is the most natural and most primitive way of cooking food known to mankind. The charring of meat and fat creates the smoke that is a natural magnet for the olfactory senses and taste buds.”\nOver at Boeuf, a 75-seat steakhouse in Telok Ayer Street, chef Carlos Gan, 28, is bringing back wet ageing for meat. While dry ageing has been all the rage here, and Boeuf also serves dry-aged beef, he wants to offer diners another option. In wet ageing, the meat is vacuum-sealed in bags, to allow the enzymes to break down connective tissue and make the steak more tender, while retaining juiciness.\nOn weekends, the restaurant offers its Weekend Unlimited Ribeye & Wagyu Brisket deal, priced at $49.90 until the end of 2024. Diners get unlimited helpings of Argentinean Black Angus ribeye steak and barbecued Australian wagyu brisket, with truffle fries, toasted sourdough and housemade coleslaw. The 90-minute dining blocks are at 11.30am and 1.30, 5.30 and 7.30pm on weekends.\nThe chef, who is from Malaysia, says he started eating beef at the age of 18. His family does not eat it for religious reasons.\n“After trying it, I asked myself, ‘Why is beef so different from the other proteins I have eaten my whole life?’,” he says, adding that he then started to try different cuts from different countries. “For me, personally, when I dine out, steaks are expensive. When we started Boeuf, we wanted to change the mindset of people – focus on quality and fair pricing.”\nThe prices and the fact that Wild Blaze is open every day are part of chef Wong’s plan to get people to appreciate good meat.\nUsing the Malay term for “high class”, he says of his restaurant: “It looks atas, but I want everyone to be able to afford to eat here.”\nHe did not eat beef until he came to Singapore to work when he was 16. His family does not eat it because of religious reasons. But a burger in 2005 opened his eyes.\n“It was amazing,” he says. “The flavour was like a bomb going off in my mind.”\nSo, as he built his career – from grilling bak kwa at Bee Cheng Hiang to working in the kitchens of casual restaurant Billy Bombers and Brasserie Gavroche, he built his knowledge about beef. At the restaurant, he grills the meat over lychee, apple and cherry wood logs.\nDuring the soft launch, he says, some diners who ordered the Rubia Gallega steak polished off even the yellow fat on it. They asked the kitchen to take it back to heat it up on the grill before tucking in.\n“They don’t want to waste it,” he says. “When I see that, I’m very happy.”\nFried steak\nGyukatsu Kyoto Katsugyu\nWhere: B1-63/64 Raffles City, 252 North Bridge Road\nOpen: 11am to 10pm daily\nInfo: gyukatsu-kyotokatsugyu.com.sg\nIn Japan, where tonkatsu – breaded and deep-fried pork cutlets – is soul food, one food entrepreneur wondered what would happen if he did the same to steak.\nA decade ago, Mr Taeki Hon did just that. Cue long queues and copycats.\nNow, Gyukatsu Kyoto Katsugyu has more than 60 restaurants in Japan, and has sprouted franchised overseas offshoots in Canada, South Korea, Taiwan, Hong Kong, Thailand and Indonesia. Singapore is the seventh place to get its steak cutlets, and the Philippines is next.\nMr Hon, 44, is president of Golip, a company that started with Korean barbecue restaurants serving samgyeopsal or pork. It later launched brands including Nick Stock Hotdog Steak Cafe, Gottie’s Beef and Hamburg Conel.\nSpeaking through an interpreter, he tells The Straits Times: “We went into dry-ageing beef and found the best cuts of beef and how to enjoy them. The idea for gyukatsu came to us then. We created this beef cutlet. It’s not steak, it’s a new style of Japanese cuisine.”\nThe company teamed up with Singaporean restaurateur Jason Lam, 54, who owns kappo restaurant Nishikane in Stanley Street, to open the 50-seat restaurant in Raffles City.\nMr Lam says: “I live in Tokyo, and I saw the brand there. The restaurants draw a lot of lines, especially in Harajuku, Ginza and Shinjuku. So I approached Hon-san and said, ‘Please give me a chance.’”\nHe and Mr Hon think there is potential to open five outlets here, although they would like to have seven or eight.\nThe beef for the Singapore restaurant comes from the US, Australia and Japan.\nMr Hon says: “We don’t use wagyu from Australia. When we say wagyu on the menu, we use wagyu only from Japan.”\nIts A5 Miyazaki sirloin set, which comes with rice, miso soup, cabbage, onsen egg, Kyoto curry dashi and dipping sauces, is priced at $55.\nThe chain uses the sirloin, tenderloin, chuck tail flap and tongue cuts of beef. Prices of its beef sets start at $25, for sirloin with rice, miso soup, cabbage, onsen egg, curry dashi and dipping sauces. For Singapore, there is also Yasai Tempura Zen ($25) featuring vegetables given the katsu treatment.\nDiners are encouraged to enjoy the meat in different ways: by topping with wasabi and dipping it into dashi shoyu or the chain’s housemade gyukatsu sauce, with a sprinkle of sansho pepper salt, or by dipping into the onsen egg or its housemade dashi curry, made with beef stock. At the end, they can mix what is left of the egg and curry into the rice to finish off the meal.\nMr Hon says the chain uses very fine panko crumbs for breading the steaks, and fries them in a vegetable oil blend it developed. All the gyukatsu are cooked to medium rare, and diners wanting them more cooked can sear the pieces themselves on a hot plate placed at each table.\n“We have more women customers in Japan,” he says. “We get feedback from them that it’s lighter than tonkatsu, and crispier.”\nSteak library\nCygnet by Sean Connolly\nWhere: QT Singapore, 35 Robinson Road\nOpen: Noon till late, daily\nInfo: @cygnetsingapore (Instagram) or call 6701-6800\nGrass-fed, grain-fed, eye fillet, ribeye, rump, tomahawk, T-bone, New York strip, from Argentina and all over Australia – the steak selection at Cygnet by Sean Connolly, a steakhouse at QT Singapore, a new hotel in Robinson Road, is vast.\nBut even ahead of its Sept 16 opening, chef Connolly, 57, is already looking to add to his library of steak. He wants to bring in beef from retired dairy cows in New Zealand.\nAccording to The New York Times, this practice of letting mature dairy cows graze after their milk-producing days are over, is common in Europe and has been gaining ground in other parts of the world. Putting the cows out to pasture allows the fat, which has gone into milk, to return to the muscles. This makes the meat richer and more tender.\nChef Connolly, originally from Yorkshire and who now calls himself a “proud Aussie”, has had success serving the meat in his restaurants. He has five restaurants in Australia and New Zealand, including Gowings at QT Sydney and Esther at QT Auckland.\n“It eats well,” he says. “I want to create a library of primal cuts in this steakhouse. And I want it to be constantly morphing.”\nOther meats that might show up on the Cygnet menu include venison from New Zealand, and “we are also working on lamb and veal”, he adds.\nThe beef, dry aged for the restaurant by suppliers, is grilled over applewood logs and two kinds of Japanese charcoal at the 98-seat restaurant. Prices start at $60 for a 300g New York strip steak from Australia, and top out at $388 for a 1.8kg Stockyard F1 wagyu tomahawk from Australia.\n“On the bone, in the shell, over the coals,” says chef Connolly about his cooking philosophy.\nOther menu offerings include oysters ($54 for six), caviar (from $105 for 30g), Caesar salad ($32) and steak tartare ($34) prepared tableside, and side dishes such as creamed spinach ($14) and smoked mashed potatoes ($14).\n“I feel like Willy Wonka,” he says. “I’m in a land of amazing food, with the greatest ingredients in the world. We have great stuff in Australia, but there is a bigger variety here. So many shades of caviar. All the great caviar houses in the world are in Singapore.”\nUnlike many brand-name chefs who open restaurants in Singapore and then leave, he plans to stay here for three months, until mid-November.\nAnd after that, he says he will be hands-on. Every week, he has hour-long meetings with his restaurants in Australia and New Zealand over Zoom.\n“I’m really committed,” he says. “If you’re not, it all turns to custard.”", "url": "https://www.straitstimes.com/life/food/meat-on-the-menu-restaurants-beef-up-their-offerings"}