{"authors": ["Amanda Chai"], "date_download": "2024-10-12 13:56:23", "date_modify": "2024-10-12 13:56:23", "date_publish": "2023-03-16 13:00:00", "description": "Bottega Veneta launches poofy pop-up storeAn inflatable fun house for bag lovers has appeared outside Ion Orchard, filled with treasures from Bottega Veneta. Read more at straitstimes.com.", "filename": "life_style_style-news-bottega-veneta-launches-poofy-pop-up-store-new-perfumes-for-world-fragrance-day_1728741383.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/03/16/Bottega20Veneta20Ion20pop-uppic20credit20Amanda20Chai_0.jpg?VersionId=UNucl5jajLgOOskIU6Bwahs78KUxmpUs", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-bottega-veneta-launches-poofy-pop-up-store-new-perfumes-for-world-fragrance-day_1728741383.html", "title": "Style News: Bottega Veneta launches poofy pop-up store, new perfumes for World Fragrance Day", "title_page": "Style News: Bottega Veneta launches poofy pop-up store, new perfumes for World Fragrance Day | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Bottega Veneta launches poofy pop-up store\nAn inflatable fun house for bag lovers has appeared outside Ion Orchard, filled with treasures from Bottega Veneta.\nThe pop-up store by the Italian luxury fashion house arrives in Singapore in an all-new colourway, after debuting in the brand’s signature parakeet green in Chengdu, China.\nA singular material was used to create the completely soft pavilion, inspired by Bottega’s use of soft leather – and calls to mind some of its popular bags including the Cassette (from $1,560) and Arco (from $2,920).\nThe first major regional pop-up by the brand, known for its quiet approach to luxury, will travel to Thailand next.\nIt is not just for photo-taking either. Until March 27, visitors can shop the brand’s iconic accessories and pieces from the new Summer 2023 collection here.\nAside from best-selling shapes such as the Jodie bag (from $2,370), there are ready-to-wear collections for men and women, and shoes including the Knot ($2,550), a statement heeled sandal balanced on a gold knot element; as well as the genderless Alfie range of woven mules, sandals and slip-ons.\nExclusive to the pop-up store are vanity cases and miniature bags – including the Sardine (from $4,570), featuring Bottega’s signature intrecciato weave and a sinuous brass handle, now in a petite size with a crossbody strap.\nWorld Fragrance Day, which falls on March 21, is a good excuse to add new scents to your collection.\nTo celebrate its 10th anniversary, French fragrance house Ex Nihilo has launched Vesper Glitz ($300 for 50ml), which aims to capture the excitement of a Parisian night out in a bottle. Think nighttime views of the Eiffel Tower and a rendezvous in luxury shopping street Rue Saint-Honore before cocktails in a buzzy club.\nThe first spritz of this feminine fragrance brings out bright top notes of pink pepper, mandarin and neroli before the floral heart notes of ylang-ylang, jasmine and mimosa come through.\nIt then settles into an ambery base of cedarwood, tonka bean, vanilla and musks – smelling almost exactly like what you would expect at the end of a gratuitous girls’ night out.\nOn the other end of the fragrance spectrum, find a new daytime scent in Penhaligon’s Highgrove Bouquet Eau de Parfum ($310).\nCreated in collaboration with and inspired by England’s Highgrove Gardens, the home of King Charles III and Queen Consort Camilla, the uplifting fragrance evokes warm summer days in an English garden.\nWeeping silver lime is the star heart note in a tribute to the Gardens’ trees, which perfume the grounds when in bloom between July and August. You also get notes of mimosa, geranium, lavender, hyacinth and tuberose.\nTen per cent of proceeds go to The Prince’s Foundation, to help fund the educational charity’s training and education programmes for students.\nInfo: Ex Nihilo is available at B1-12 Takashimaya Shopping Centre and Amaris stores, including at 03-10/11 Paragon Shopping Centre. Penhaligon’s is available at all Penhaligon’s boutiques, Sephora Ion Orchard, sephora.sg and escentials.com\nCharlotte Tilbury’s matte blush wands\nIf you are a fan of British make-up maestro Charlotte Tilbury’s best-selling Beauty Light Wands, you will love her eponymous brand’s newest addition.\nIn four “fool-proof” shades, the Pillow Talk Matte Beauty Blush Wands ($62) are a matt blush version of the TikTok-viral liquid highlighters and come in the same easy-to-use, twist-up wand packaging.\nChoose from Pink Pop, Peach Pop, Dream Pop and Pillow Talk (the last shade is exclusive to Charlotte Tilbury’s website) to add a buildable, beautifying pop of colour to cheeks. The blushes are infused with blurring technology and light-reflecting pigments for a smoothing, soft-focus finish.\nThe launch builds on the brand’s ever-expanding Pillow Talk range, which celebrates a decade in 2023 since the launch of its first product in that shade.\nInfo: Available at Sephora stores and sephora.sg\nLevel up your skincare with luxury launches\nFrom Lancome comes the Renergie H.C.F. Triple Serum ($217), with a new formula that combines three active ingredients in one triple dose, said to aid the skin’s regeneration.\nHyaluronic acid helps plump and smoothen skin with moisture, C+Niacinamide (a Vitamin C derivative and niacinamide complex) combats dark spots, and ferulic acid neutralises free radical damage and strengthens the skin barrier.\nThese are combined with gluco-peptides to further strengthen skin barrier and improve the structure of the dermis.\nMeanwhile, Sisley has reformulated its best-selling Ecological Compound Advanced Formula ($320).\nThe moisturiser, first created in 1980 to strengthen the skin barrier via plant extracts, has been updated with new active ingredients – burdock extract and meadowsweet extract – that are said to improve the skin’s microbiota (promoting good bacteria) and skin immunity.\nSisley has also upped the concentration and efficacy of existing actives – centella asiatica and hops extract – to better support the skin’s barrier function. Its lightweight texture and botanical scent remain largely unchanged.\nInfo: Available at the respective brands’ counters in department stores", "url": "https://www.straitstimes.com/life/style/style-news-bottega-veneta-launches-poofy-pop-up-store-new-perfumes-for-world-fragrance-day"}