{"authors": [], "date_download": "2024-10-12 13:35:47", "date_modify": "2024-10-12 13:35:47", "date_publish": "2024-07-12 17:15:00", "description": "Miss Violet Affleck, the eldest child of the divorced American actors, contracted a post-viral condition in 2019. Read more at straitstimes.com.", "filename": "life_entertainment_hollywood-stars-ben-affleck-and-jennifer-garner-s-daughter-denounces-mask-bans_1728740147.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/35764146926277024373728311054462297974025238n.jpg?VersionId=3GnQCKXyZZsi_LDay3PcLMTo1Q6Sh2DO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_hollywood-stars-ben-affleck-and-jennifer-garner-s-daughter-denounces-mask-bans_1728740147.html", "title": "Hollywood stars Ben Affleck and Jennifer Garner’s daughter denounces US mask bans", "title_page": "Hollywood stars Ben Affleck and Jennifer Garner’s daughter denounces US mask bans | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Violet Affleck, daughter of Hollywood stars Jennifer Garner and Ben Affleck, was photographed by the paparazzi in June walking in Los Angeles with her mother.\nIn the photos, she was wearing an N95 face mask, as she often does in public. Perhaps not remarkable in and of itself, but some online had questions.\n“Why does Violet Affleck always wear a mask? Explained,” promised one recent headline.\nThe article speculated that privacy, an indeterminate medical condition and “personal expression” could be among the reasons for her choice.\nOn July 9, the 18-year-old appeared to offer an answer. Speaking during the public comment portion of a meeting of the Los Angeles County Board of Supervisors, she revealed why she wears a mask while also demanding greater public access to masks.\n“I contracted a post-viral condition in 2019,” she said. “I’m okay now, but I saw first-hand that medicine does not always have answers to the consequences of even minor viruses.”\nSpeaking briskly – her whole speech clocked in at just 59 seconds – she warned about the risks of long Covid-19, a serious medical condition that can cause brain fog, chronic fatigue and other health issues, and is thought to affect millions of Americans.\nViolet, a recent high school graduate who appears to be bound for Yale University in autumn, called on officials to make masks available in government buildings, hospitals and jails.\n“I demand mask availability, air filtration and far UV-C light in government facilities, including jails and detention centres, and mask mandates in county medical facilities,” she said.\n“We must expand the availability of high-quality free tests and treatment and, most importantly, the county must oppose mask bans for any reason.”\nIt is unclear if this was the first time Violet addressed her concerns publicly to an elected body.\nRepresentatives for American actors Ben Affleck and Garner – who married in 2005 and divorced in 2018 – did not immediately respond to requests for comment on July 10. The pair share two other children aged 12 and 15.\nPhotographers captured her carrying a face mask in June, when she was having lunch with American singer-actress Jennifer Lopez, her father’s wife. And in 2023, the teen was spotted by a fan wearing an N95 mask while attending a Broadway play with her father and Lopez, who did not appear to be wearing masks.\nViolet may be responding to recent discussion about potential mask bans that local leaders across the country have been weighing out of concern that people are using them to conceal their identities.\nGovernor Kathy Hochul of New York said in June that she and her team had begun to consider reinstating a pre-pandemic ban on face masks on the subway to combat crime, citing a recent increase in anti-Semitism.\nMayor Karen Bass of Los Angeles also announced in June that officials were looking at possibly banning masks at protests in response to pro-Palestinian protests in the city, despite a recent rise in Covid-19 cases in the area. NYTIMES", "url": "https://www.straitstimes.com/life/entertainment/hollywood-stars-ben-affleck-and-jennifer-garner-s-daughter-denounces-mask-bans"}