{"authors": ["Arthur Sim"], "date_download": "2024-10-12 13:32:14", "date_modify": "2024-10-12 13:32:14", "date_publish": "2023-12-15 17:00:00", "description": "Design is subjective, even when it comes to Christmas decorations. Read more at straitstimes.com.", "filename": "life_orchard-road-s-light-ups-through-the-years-the-ghosts-of-christmas-illuminations-past_1728739934.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/15/light3.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_orchard-road-s-light-ups-through-the-years-the-ghosts-of-christmas-illuminations-past_1728739934.html", "title": "Orchard Road Christmas light-up: 40 years on, a look back at some hits - and misses", "title_page": "Orchard Road Christmas light-up: 40 years on, a look back at some hits - and misses | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – It is the end of the year again and there is always some seasonal nostalgia for the good old days – like when A.I. Artificial Intelligence was just a 2001 movie, certificates of entitlement were $1 and Christmas decorations in Orchard Road were simply light bulbs strung between lamp posts.\nLooking back, the first Christmas lights in Singapore’s shopping street debuted in December 1984. That was a very simple affair with 100,000 light bulbs adorning the stretch of Orchard Road from the junction at Orange Grove Road to the Istana in Dhoby Ghaut.\nThere was also a shorter stretch of lights between the Scotts Road junction at Goodwood Park and Orchard Road.\nOn Christmas Eve that year, the size of the crowd on the streets reportedly numbered 30,000, and some businesses registered an uptick in trade of between 10 and 20 per cent.\nSince then, the Christmas light-ups have attracted much larger crowds. The last edition was staged from Nov 12, 2022, to Jan 2, 2023, attracting more than four million visitors.\nThe increasingly creative and elaborate designs certainly added to the appeal.\nIn 2010, the light-up design, which was attributed to Mr Edward Tang, creative director of design firm ModernAge, was even picked by travel guide Frommer’s as one of the World’s Best Holiday Lights.\nOver the years, the light-ups have won accolades from the international travel industry community, including Lonely Planet and TripExpert.\nOther notable designers have included French lighting consultant Louis Clair, who was appointed for the 2000 and 2001 light-ups. Singaporean Dick Lee, whose many appellations include singer-songwriter, was also creative director for several light-ups, most recently in 2015.\nThe 2023 year-end design is the creative work of two landscape artists: Andy Cao, who is based in the United States and Vietnam, and Xavier Perrot, who is based in France. The duo also conceptualised the designs in 2020 and 2021.\nAs emphasis on new designs increased, so did the public’s expectations. In some years, the designs have been criticised for being too lacklustre or even too commercialised.\nThe Orchard Road Business Association (Orba) has been organising the light-up since 2009. Its chairman, Mr Mark Shaw, says Orba endeavours to make the light-ups an inclusive event every year.\nHe adds: “We select the design theme for the Orchard Road Christmas light-up by way of a tender which takes into account Singapore’s multiracial, multicultural society.”\nThe light-ups have also become bigger over the years. Orba does not comment on budgets, but says that the year-end design for 2023 has more stakeholders and partners involved than in previous years.\nNow called Christmas On A Great Street, the 2023 light-up is an experiential and immersive event that includes an augmented-reality projection show and six zones with music.\nThere are also three Christmas Villages compared with just one in 2022, plus the first Christmas Eve street party in Orchard Road.\nThe Singapore Tourism Board is a key supporter of the event, and Hitachi Asia has been the main sponsor for 33 consecutive years, with Mastercard the official credit card for 11 years running.\nMr Shaw says: “This year, we are recycling and reusing many elements of the installations. We also chose wire mesh instead of single-use plastics for the clouds to ensure that more of the decor can be repurposed next year.”\nThe predominant design motif in 2023’s decorations is the cloud, which Mr Shaw says evokes children’s dreams of “imagination and innocence”.\nI liked the 2018 Disney-themed light-up for its production quality and thought it was fantastic, even if it was controversial.\nI remember one part looked more like Halloween than Christmas, but I loved the different zones and the various treatments.\nBecause it is supposed to be a festive light-up, I prefer the years with more reds and greens, and streamers across the roads – such as the light-up in 1998 – as well as those with overt Christmas elements, such as the 2016 light-up with the reindeer charging across the road, and 2019’s Christmas trees lining the road.\nThere were reds in 2012, too, but the hearts reminded me of Valentine’s Day.\nThe lights in 2001 looked the saddest, as there were few Christmas elements, compared with previous years. It could have been mistaken for any other festive celebration.\nA white Christmas does capture the imagination of many in Singapore, since we are in the tropics, but the cosy feeling did not quite translate with the white themes of 2017 and 2020.\nMs Xin Xiaochang, 41, head of special projects unit, projects and planning office, Nanyang Academy of Fine Arts\nDespite critiques, expressing gratitude to the designers of Orchard Road Christmas light-ups for their thoughtful concepts is essential. Designing a display for a diverse audience is a challenging task, and it is inevitable that not everyone will be pleased with the outcome.\nThe light-ups have transcended individual opinions to become interwoven with shared and personal narratives, and I feel the significance endures beyond any specific year’s theme or design.\nThis year, I am captivated by the enchanting light-up, which has sparked the inner child in me, evoking memories of Christmases past.\nThe designers have also prioritised sustainability by repurposing LED lights and decor from previous years, creating a visually stunning cotton candy-like mesh of clouds that is appealing even in daylight, when the lights are off.", "url": "https://www.straitstimes.com/life/orchard-road-s-light-ups-through-the-years-the-ghosts-of-christmas-illuminations-past"}