{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:19:20", "date_modify": "2024-10-12 14:19:20", "date_publish": "2023-12-22 16:11:19", "description": "The Singapore-assembled electric crossover is the first Hyundai to win coveted title. Read more at straitstimes.com.", "filename": "life_motoring_st-car-of-the-year-2023-hyundai-ioniq-5-streets-ahead-of-shortlisted-pack_1728742760.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/17/202312167499403120231211212542cjl2058-edit.jpg.JPEG?h=6c34ae2a", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_st-car-of-the-year-2023-hyundai-ioniq-5-streets-ahead-of-shortlisted-pack_1728742760.html", "title": "ST Car of the Year 2023: Hyundai Ioniq 5 streets ahead of shortlisted pack", "title_page": "ST Car of the Year 2023: Hyundai Ioniq 5 streets ahead of shortlisted pack | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Hyundai Ioniq 5 electric crossover has been crowned Straits Times Car of the Year 2023 – the first Hyundai to win the coveted title and the second South Korean model since the Kia Stinger received the honours in 2018.\nThe fact that the Ioniq 5 is the first car in four decades to be assembled in Singapore has nothing to do with it being picked. As always, contenders are put through a rigorous judging process and scoring matrix.\nOnly all-new models launched by authorised agents in the 12 months between mid-November 2022 and mid-November 2023 were considered. Around 40 cars were rounded up, with nine contenders making the final cut.\nA panel of 12 judges with a combined road-testing experience of 250 years sat through three rounds of deliberations before arriving at a shortlist. The finalists were then put through a point-based voting system which gauged nine crucial attributes of each car.\nLike in 2022, the categories of practicality and value for money have a higher weightage than the other seven attributes, namely performance, handling, ride quality, build quality, efficiency, styling and X-factor (an intangible quality which sets a car apart).\nThe BYD Seal, an electric saloon, clinched the No. 3 point, ceding to the Vellfire by only 1.5 points, and beating the fourth-placed Lotus Eletre – an electric performance sport utility vehicle (SUV) – by just seven points.\nIt is easy to see why the Ioniq 5 is such a strong winner.\nThe mid-sized car offers plenty of space with its 3,000mm wheelbase and 527-litre boot. It is chock-full of useful features, many of which can be accessible on the mobile phone as well as the car’s logical, crisp and well-laid-out infotainment system.\nInstead of overly clever functions which consumers hardly use, the Ioniq 5 has sensible ones such as rear seats which can slide forward to free up more stowage, easy-to-fold rear seat backs and a hands-free powered tailgate.\nAnd starting at $182,800, it is among the least costly electric vehicles (EVs) in town. In fact, it costs less than some non-electric equivalents.\nOne of the judges, freelance writer Lynn Tan, described it as an “all-rounder of a car”.\n“I love the Hyundai Ioniq 5’s retro-futuristic look and how incredibly practical it is,” she said. “It is one of very few cars whose centre console can fit a medium-sized handbag. It doesn’t hurt that it is assembled in Singapore, so we can all share in that proud parent moment.”\nDr Kong Yongyao, another panellist and a frequent contributor to these motoring pages, called the Hyundai “a resounding triumph of imagination, ambition and execution”.\n“It’s a big box with big windows and is great in every regard,” he said. “If I could give it a 10 for X-factor, I would. It does phenomenally well in many intangibles that are not fully represented on the score sheet.”\nAccolades abound for other contenders. Lawyer Edric Pan, who was on the panel of judges, singled out the Lotus Eletre, which scored highest for performance and X-factor.\n“It’s as far removed from Lotus founder Colin Chapman’s ‘simplify and add lightness’ mantra as you can get, but the car is brilliant in its own right,” he said.\n“Unlike most other ultra-SUVs, it doesn’t bludgeon its way down a snaking road – it waltzes through with a level of poise, precision and involvement that defies its 5.1m, 2.5-tonne form.\n“All the while cosseting its occupants in limo-level comfort, refinement and luxury. With its first SUV, Lotus has knocked it out of the park.”\nAlthough a distant No. 2, the Toyota Vellfire was the only contender to have top scores for three attributes: ride quality, efficiency and practicality.\nMs Tan said: “For a car of this size, the Toyota Vellfire is surprisingly manageable, be it in terms of handling, staying in lane or parking.\n“What impresses me the most is how this boxy, Japanese multipurpose vehicle has managed to transcend brand snobbery and vehicle segment, squaring up against the likes of continental flagship limousines.”", "url": "https://www.straitstimes.com/life/motoring/st-car-of-the-year-2023-hyundai-ioniq-5-streets-ahead-of-shortlisted-pack"}