{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:19:51", "date_modify": "2024-10-12 14:19:51", "date_publish": "2022-12-23 16:00:00", "description": "Chinese brand makes its debut in the top 10 contenders’ list six years after its arrival. Read more at straitstimes.com.", "filename": "life_motoring_the-straits-times-car-of-the-year-2022-byd-atto-3-is-readers-choice_1728742791.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/23/WJ9912_0.jpg?VersionId=VcfmlybzihOS.vxh_JLoYCIzR.WZtNxI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_the-straits-times-car-of-the-year-2022-byd-atto-3-is-readers-choice_1728742791.html", "title": "The Straits Times Car of the Year 2022: BYD Atto 3 is readers’ choice", "title_page": "The Straits Times Car of the Year 2022: BYD Atto 3 is readers’ choice | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – While it came in second last in The Straits Times Car of the Year 2022, the battery-powered BYD Atto 3 was the overwhelming readers’ choice.\nAhead of the results, readers were asked to vote in a poll for the car they think should be crowned in the annual award.\nThe BYD compact crossover – the first Chinese car to make it to the top 10 contenders’ list – clinched 2,819, or 47 per cent of the 5,991 votes, cast.\nAs always, the readers’ poll has no bearing on the results of the award, which was decided by a panel of 10 judges who have a combined road-testing experience of more than 200 years.\nAt $176,888, the Atto 3 is the least costly electric vehicle (EV) in its size segment. The Peugeot e-2008 GT is slightly cheaper at $167,391, but is a smaller vehicle. It received 410 votes to rank fourth in the readers’ poll.\nMr Lionel Seah, one of the judges, says: “Not only is the Atto 3 comfortable and refined, it’s better equipped than most cars in this mass-market segment. It’s also pretty quick when required and has a practical driving range of over 400km when fully charged. It is undeniably bang for your buck.”\nValue for Money – one of nine scoring components – has been given more weightage this year, along with Practicality, a new attribute which expands on the previous Ergonomics.\nComing in a distant second in the readers’ poll is the BMW M240i Coupe with 1,050 votes. It is the only two-door and one of two pure combustion-engined cars on the list. The other is the BMW 218i Active Tourer (130 votes).\nAnother judge, ST executive photojournalist Chong Jun Liang, says: “With its tremendous power, superb handling and throaty exhaust, the M240i is every driver’s dream. The sports coupe elicits joy with every squeeze of the throttle. In an increasingly crowded field of EVs, the M240i is proof that the internal combustion engine cars can still have their day in the sun.”\nThe third most popular choice among readers is the ST Car of the Year – the Toyota Sienta Hybrid (652 votes). It is one of two Toyota models in this year’s shortlist – the other being the electric Toyota bZ4X crossover (200 votes).\nPolestar, which made its debut on the shortlist, came in at a respectable No. 5 in the poll. The Polestar 2 clinched 250 votes.\nThe Kia Niro Hybrid, which judges ranked third, was the least popular among readers – garnering 125 votes.\nHow readers voted\nBYD Atto 3: 2,819 votes\nBMW M240i Coupe: 1,050 votes\nToyota Sienta Hybrid: 652 votes\nPeugeot e-2008 GT: 410 votes\nPolestar 2: 250 votes\nBMW i4: 205 votes\nToyota bZ4X: 200 votes\nMercedes-Benz EQS450+: 150 votes\nBMW 218i Active Tourer: 130 votes\nKia Niro Hybrid: 125 votes", "url": "https://www.straitstimes.com/life/motoring/the-straits-times-car-of-the-year-2022-byd-atto-3-is-readers-choice"}