{"authors": ["Christopher Tan"], "date_download": "2024-10-12 14:17:34", "date_modify": "2024-10-12 14:17:34", "date_publish": "2022-12-30 16:30:00", "description": "The buyer’s guide has been compiled for several decades now and includes newly launched and existing models. Read more at straitstimes.com.", "filename": "life_motoring_pick-of-the-crop-the-straits-times-best-car-buys-of-2022-from-100000-to-1-million_1728742654.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/30/hzcars301222.jpg?VersionId=kxEOxdfiRPIZyd_MKkyVbqkViqEuRrnz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_motoring_pick-of-the-crop-the-straits-times-best-car-buys-of-2022-from-100000-to-1-million_1728742654.html", "title": "Pick of the crop: The Straits Times’ best car buys of 2022 from $100,000 to $1 million", "title_page": "Pick of the crop: The Straits Times’ best car buys of 2022 from $100,000 to $1 million | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – For car buyers and sellers alike, 2022 will be remembered for two things.\nOne, an unprecedented global supply chain crisis which disrupted or delayed the arrival of new cars, while also affecting the equipment level of cars when they arrived.\nTwo, record certificate of entitlement (COE) prices, which have pushed up the prices of the cheapest cars to well above $100,000. The premium of bigger cars is now above $115,000, while the premium for smaller cars is hovering around $90,000 – double what they were a year ago.\nHence it has become more important than ever to look to a consumer’s guide such as The Straits Times’ Best Buys, an unbiased annual selection of the choicest cars you can spend your hard-earned money on.\nThe buyer’s guide has been compiled for several decades now, and includes both newly launched and existing models on the market.\nNot unexpectedly, electric vehicles (EVs) continue to loom large – driven by tax incentives and stricter emission standards. In fact, every other new model launched this year was battery-powered.\nST understands EVs are not for everyone yet, given that the majority of the population still does not have easy access to charging infrastructure. Hence, while there are EV recommendations here, they do not make up the bulk of cars in the list.\nHappy shopping.\nFollow Christopher Tan on Instagram @chris.motoring\nPrices include COE (December first tender) unless stated, and are correct at press time.\nCoupe/convertible\nToyota’s bZ4X (estimated $250,000) is a brilliant electric crossover from a manufacturer accused (unfairly) of dragging its feet over electrification.\nDetractors may not know this, but Toyota has been making petrol-electric hybrids for more than 30 years now. And if the bZ4X is any indication, its full-electric cars are going to be a hit.\nIts battery, for one thing, has an unrivalled warranty of at least 90 per cent of charge after 10 years or 240,000km of use. The car is not for public sale yet, but if you badger the agent hard enough, who knows?\nThe BMW i4 ($340,888) is an electric car made for car lovers. It is a blend of cold electric efficiency, and warm BMW values, resulting in a machine which looks, feels and drives like a car. You can choose the single-motor rear-wheel variant or the sizzling M50 twin-motor all-wheel drive. Both come with a beautiful soundtrack.\nThe only combustion-engined pick in this category is the Skoda Octavia RS ($222,900). It is powered by a well-tuned 2-litre 245hp/370Nm turbocharged engine paired with a seven-speed dual-clutch transmission. Squeeze the throttle and the engine delivers a deep, lovely note which fills the cabin, but does not interfere with conversation or the car’s hi-fi system. It is quite a joy at the wheel too.", "url": "https://www.straitstimes.com/life/motoring/pick-of-the-crop-the-straits-times-best-car-buys-of-2022-from-100000-to-1-million"}