{"authors": ["Elisa Chia"], "date_download": "2024-10-12 14:00:49", "date_modify": "2024-10-12 14:00:49", "date_publish": "2024-02-07 15:05:00", "description": "Five local and Singapore-based stars born in the Year of the Dragon talk about the zodiac animal traits they embody.  Read more at straitstimes.com.", "filename": "life_entertainment_lucky-dragons-what-kind-of-dragons-are-li-nanxing-vivian-lai-henry-thia-jeffrey-xu-and-chen-yixin_1728741649.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/07/tcdragon070224.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_lucky-dragons-what-kind-of-dragons-are-li-nanxing-vivian-lai-henry-thia-jeffrey-xu-and-chen-yixin_1728741649.html", "title": "Lucky Dragons: What kind of ‘dragons’ are Li Nanxing, Vivian Lai, Henry Thia, Jeffrey Xu and Chen Yixin?", "title_page": "Lucky Dragons: What kind of ‘dragons’ are Li Nanxing, Vivian Lai, Henry Thia, Jeffrey Xu and Chen Yixin? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Dragon is a perennial symbol of power, fortune and prosperity in Chinese culture. Five local and Singapore-based stars born in the extra-auspicious Year of the Dragon share how huat their lives have been and the dragon traits they embody.\nLi Nanxing\nBorn: Nov 7, 1964\nActor Li Nanxing does not want to be known as a perfectionist, a typical trait associated with those born in the Year of the Dragon.\nHe much prefers to think that he is passionate about his work.\n“I make sure I perform to the best of my abilities in whatever I do. And where I fall short, I learn to do better,” the 59-year-old says.\nREAD MORE HERE\nVivian Lai\nBorn: Dec 18, 1976\nLike the quintessential Dragon, actress-host Vivian Lai is always full of energy and ready to take on challenges.\nShe is also focused and driven, which usually describe those born under this Chinese zodiac sign.\n“I like to do things fast and efficiently. Give me a task and I’ll do it for you now, if I can.”\nREAD MORE HERE\nHenry Thia\nBorn: Feb 25, 1952\nActor Henry Thia is not sure if he is “naturally charismatic”, a common description of those born in the Year of the Dragon.\n“I only know people always smile when they see me on the street. Not just in Singapore, but Johor Bahru too,” says the 71-year-old, who is known for his roles as the bumbling, imperfect everyman.\nHis latest film Money No Enough 3, which is showing in Singapore cinemas, reunites him with Jack Neo and Mark Lee. The trio play long-time buddies navigating a rapidly evolving digital age.\nREAD MORE HERE\nJeffrey Xu\nBorn: Oct 3, 1988\nWill Jeffrey Xu and Felicia Chin welcome a baby in the Year of the Dragon?\nThe Shanghai-born, Singapore-based actor certainly hopes so.\n“My 59-year-old father and I are born in the Year of the Dragon. It would be perfect if a baby comes along and we can have three generations of Dragons,” he says.\n“We will let nature take its course. Having a baby is a blessing and joy, Dragon Year or not.”\nREAD MORE HERE\nChen Yixin\nBorn: April 26, 2000\nActress-model Chen Yixin now embodies the confidence of a Dragon she never was able to muster previously.\nThe 23-year-old is slowly but surely stepping out of the shadows of her famous parents, veteran actress Xiang Yun, 62, and actor-turned-artist Edmund Chen, 63.\n“Growing up, I was very shy and worried about living up to expectations. Am I aesthetically pleasing enough? Especially when you’re going through puberty and people see you with pimples,” Chen Yixin recalls.\n“My confidence really took a hit back then because of random online comments.”\nREAD MORE HERE", "url": "https://www.straitstimes.com/life/entertainment/lucky-dragons-what-kind-of-dragons-are-li-nanxing-vivian-lai-henry-thia-jeffrey-xu-and-chen-yixin"}