{"authors": ["Eunice Quek"], "date_download": "2024-10-12 14:04:13", "date_modify": "2024-10-12 14:04:13", "date_publish": "2023-05-25 12:00:00", "description": "Chef Tamara Chavez starts her day off with a one-hour English class on Zoom. Read more at straitstimes.com.", "filename": "life_food_my-perfect-weekend-with-mexican-chef-tamara-chavez-of-spanish-restaurant-tinto_1728741853.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/05/25/actamara250523_0.jpg?VersionId=i2qOuGJO2Lp8Exc6xxr9PIJMqb_jX5wg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_my-perfect-weekend-with-mexican-chef-tamara-chavez-of-spanish-restaurant-tinto_1728741853.html", "title": "My Perfect Weekend with Mexican chef Tamara Chavez of Spanish restaurant Tinto", "title_page": "My Perfect Weekend with Mexican chef Tamara Chavez of Spanish restaurant Tinto | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Who: Ms Tamara Chavez, 33, is the chef-owner of Spanish restaurant Tinto and Canchita Peruvian Cuisine, both in Dempsey. She runs the restaurants with her Peruvian chef-husband Daniel Chavez, 43. She has lived in Singapore for nine years, while her husband – they married in October 2020 – has lived here for 17 years. They have no children.\n“For the past 15 years of my life as a chef, I’ve never had my weekend fall on a Saturday and Sunday. That is a good thing because, on Mondays and Tuesdays, I don’t have to fight for reservations at restaurants and there’s less traffic everywhere.\nWith a cup of black coffee and a glass of water, I start my day at 6.30am with a one-hour English class on Zoom. I have been doing these one-on-one sessions with a Jamaican teacher for one year to improve my English.\nAfter class, I go to Virgin Active gym for yoga or pilates.\nBy the time I get home, Daniel will be up and he likes to prepare breakfast. He’ll make soup or I’ll have an avocado.\nMy home garden grew a lot during the pandemic, so I’ll spend the rest of the morning looking after my plants. I like that my monstera reminds me of the jungle, while palms are easy to take care of.\nWe then head out for lunch and take a walk in the malls or along green paths. Some of our favourite trails are at MacRitchie Reservoir and Labrador Nature Reserve.\nWe love our jobs, and even on our days off, Daniel and I will still be talking about food. In the evening, we’ll watch a movie at home.\nWe recently watched Mississippi Burning (1988) – where Federal Bureau of Investigation agents investigate the disappearance of a group of civil rights workers – and I was crying a lot. I can relate a lot to movies based on real life and feel bad for those suffering injustice in the world. I can’t cry much at the cinema in Singapore – it is too cold and everyone is very serious and will be staring at me.\nI’m usually very active on the weekend while Daniel loves to just relax. He likes to rest, go for a massage and cut his hair. He will remind me to rest more on the second day of my weekend – sometimes there’s no need to squeeze so many things in.\nSo if I have nothing to do, I’ll work on 3,000-piece jigsaw puzzles, a habit that started during the pandemic. It helps me to destress and become very sensitive to focusing on details. I can apply this to when I’m in the kitchen and also need to pay attention to the smallest details.\nI’ll also catch up with my mother and grandmother on the phone, and they will be updating me about the family and their lives in Mexico. Plans for upcoming weekends include going to Bali for a quick holiday, and spending one day at the spa.\nDaniel’s parents will be visiting soon, so we’ll be spending time with them too.\nHe created a long ‘Day Off’ list. I think we have enough activities for the next three years. It includes restaurants we hope to visit, such as Kubo in Mohamed Sultan Road, Euphoria in Tras Street and Braci in Boat Quay. Movies on the list include Hot Rod (2007) and The White Lotus (2021 to 2023) series on HBO. We also want to go to The Projector cinema.\nWho knows, maybe one day, we’ll be getting tattoos – that’s on our list too. I would get a tattoo of the logo of our (now-defunct) restaurant Tono Cevicheria. It reminds me of how I started my adventure in Peruvian gastronomy.”", "url": "https://www.straitstimes.com/life/food/my-perfect-weekend-with-mexican-chef-tamara-chavez-of-spanish-restaurant-tinto"}