{"authors": ["Shawn Hoo"], "date_download": "2024-10-12 13:44:39", "date_modify": "2024-10-12 13:44:39", "date_publish": "2024-08-01 10:11:14", "description": "Learn about the national anthem's composer Zubir Said this National Day though Wild Rice's restaging of Don’t Call Him Mr Mari Kita. Read more at straitstimes.com.", "filename": "life_arts_arts-picks-don-t-call-him-mr-mari-kita-lim-tze-peng-and-chua-ek-kay-exhibition-seal-carving-show_1728740679.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/Majulah20Singapura1.jpg?VersionId=2bEATQzsEkDtAnEvRUsrCSqzQmR2uIiu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_arts_arts-picks-don-t-call-him-mr-mari-kita-lim-tze-peng-and-chua-ek-kay-exhibition-seal-carving-show_1728740679.html", "title": "Arts Picks: Don’t Call Him Mr Mari Kita, Lim Tze Peng and Chua Ek Kay exhibition, seal carving show", "title_page": "Arts Picks: Don’t Call Him Mr Mari Kita, Lim Tze Peng and Chua Ek Kay exhibition, seal carving show | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Don’t Call Him Mr Mari Kita by Wild Rice\nEveryone knows the words to the national anthem Majulah Singapura, but how many Singaporeans have heard the story of its composer and lyricist Zubir Said? As National Day approaches, Wild Rice is bringing back its popular Don’t Call Him Mr Mari Kita for the third time and what it calls a “strictly limited final season”.\nEvoking the old-school glamour of a 1960s television variety show, Young Artist Award recipient Julian Wong pays tribute to the local music pioneer who composed close to 1,500 songs including classics such as Semoga Bahagia, Sayang Disayang and Orang Singapura.\nWong, who is writer, music director, arranger and performer, has a personal connection to the subject matter – and weaves it deftly into the show. He was mentored by the late musician Iskandar Ismail, who was trained by Zubir.\nIskandar was the eldest son of Cultural Medallion recipient Nona Asiah, one of the most popular singers during the golden era of the silver screen in the 1950s and 1960s, who died on July 30. Her popular songs, in turn, included her mentor Zubir’s compositions.\nDo not miss your chance to catch this landmark and beloved work, which is directed by Wild Rice’s founding artistic director Ivan Heng.\nWhere: The Ngee Ann Kongsi Theatre @ Wild Rice, Funan, 107 North Bridge Road\nMRT: City Hall\nWhen: Aug 6 to 31; 7.30pm (Tuesdays to Fridays); 2.30 and 7.30pm (Saturdays); 2.30pm (Sundays); there will be no show on Aug 9\nAdmission: From $40\nInfo: str.sg/cRQE\nIn August Company\nWorks by two esteemed Cultural Medallion recipients – Chua Ek Kay and Lim Tze Peng – will be on display at Confluence Art Space. Both artists worked with Chinese ink, but their approach could not be more different.\nAhead of 102-year-old Lim’s anticipated solo exhibition at the National Gallery Singapore slated for the later part of 2024, In August Company is a glimpse into a range of the centenarian’s work, which often renders iconic Singapore scenes. On show are early works such as Street Hawkers In Chinatown (1980s), as well as more recent ones including Along The Singapore River (2013), which is done on gold paper.\nThe late Chua, on the other hand, has harnessed the medium for its abstract and expressive properties. He is represented in the show by a special selection of paintings from his lotus series. A highlight is the 154.5cm-long Reflections (2007), a freewheel of slender brushstrokes and wet blooms of ink that skilfully blurs the boundaries between object and reflection.\nWhere: Confluence Art Space, Havelock 2, 2 Havelock Road\nMRT: Chinatown/Clarke Quay\nWhen: Till Aug 23; 1 to 6pm (Wednesdays to Sundays); by appointment on Mondays, Tuesdays and public holidays\nAdmission: Free\nInfo: www.confluenceartspace.com\nCarving Possibilities Revisited: An Exhibition By The Siaw-Tao Seal Carvers\nCarving Possibilities, the first major seal exhibition that took stock of the form’s practice in Singapore, was first done as an exhibition featuring more than 300 seals in 2023. Now in its second run, Carving Possibilities: Revisited will feature 29 artists showing 35 works in a more compact show.\nLike the first exhibition, this second run will feature a range of seals that hew closer to tradition as well as veer from the seal carving tradition. Not limited to just the Sinitic script, many of the seals play with multilingual elements. There are also seals which engage more with printmaking traditions, such as artist Toh Chee Hao’s rendition of the Old National Library Building.\nAs a companion to this exhibition, learn the art of seal carving in two workshops on Aug 17 and Aug 31 (2 to 4pm). Under the guidance of experienced seal carvers, participants will get to carve their own seal.\nWhere: library@orchard, orchardgateway, 277 Orchard Road\nMRT: Somerset\nWhen: Aug 5 to Sept 5, 11am to 9pm\nAdmission: Free\nInfo: To sign up for the workshop, go to str.sg/axCf", "url": "https://www.straitstimes.com/life/arts/arts-picks-don-t-call-him-mr-mari-kita-lim-tze-peng-and-chua-ek-kay-exhibition-seal-carving-show"}