{"authors": ["Louisa Lim"], "date_download": "2024-10-12 13:56:00", "date_modify": "2024-10-12 13:56:00", "date_publish": "2023-09-21 11:00:00", "description": "Check out this guide for your weekly shopping hit list. Read more at straitstimes.com.", "filename": "life_style_style-news-societya-launches-custom-clothing-range-more-fenty-x-puma-shoes_1728741360.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/21/23AWPRSPFentyQ3Main-Talent2937.jpg?h=cc2b2e13", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_style-news-societya-launches-custom-clothing-range-more-fenty-x-puma-shoes_1728741360.html", "title": "Style News: SocietyA launches custom clothing range, more Fenty x Puma shoes", "title_page": "Style News: SocietyA launches custom clothing range, more Fenty x Puma shoes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Singapore-based multi-label retailer SocietyA has launched its inaugural made-to-order line, SocietyAtelier, which features detailed craftsmanship and is fully customisable.\nGuided by the creative vision of SocietyA’s creative director Jonathan Liang and SocietyAtelier’s head designer Daniel Lau, the debut collection for women is based on the concept of elevated daywear and workwear which transition effortlessly between casual and formal settings.\nThe collection showcases eight versatile ensembles, designed to transcend seasons and seamlessly integrate into one’s everyday wardrobe. The pieces, which include pants, dresses and blouses, boast precision tailoring and impeccable finishing.\nClients can draw inspiration from the collection to customise each piece or design their items from scratch by making an appointment with Liang or Lau. Every aspect of an ensemble can be tailored to individual preferences, from measurements to details such as buttons, feathers and drawstring cords.\nThe SocietyAtelier line is available for purchase through custom order or by appointment via SocietyA’s Concierge on 9655-5161. Prices start at $1,200 for a two-piece sheer collar shirt and flared pants made from glass thread taffeta.\nFenty x Puma returns\nPop icon and make-up mogul Rihanna is returning as creative director in a multi-year partnership with German sportswear giant Puma.\nFans can look forward to several product launches as a result of this collaboration. The first of these to drop is the Fenty x Puma Avanti unisex shoes for both adults and kids.\nRihanna, 35, has put her own spin on the iconic Avanti football shoe design from 2001. This Puma classic now features supple vintage leather and eye-catching Fenty and Puma Cat logos.\n“I wanted to bring something iconic from the archives to the street and the late great Pele made the Avanti shoe so iconic,” said Rihanna.\nThis is not the first time Rihanna has worked with Puma. Their collaboration has spawned a number of ready-to-wear and footwear collections, including the popular Puma Rihanna Creeper shoes.\nThe new collection is priced at $149 and $159 for kids, and $249 and $269 for adults. It will be available at Puma 313@somerset, Limited Edt Marina Bay Sands and puma.com.\nSwarovski to launch fine jewellery line globally\nSwarovski will be launching its laboratory-grown diamond jewellery collection globally, following a successful debut in the United States and Canada in November 2022.\nA Swarovski Created Diamond is virtually indistinguishable from a naturally mined diamond, differing only in its source of origin, according to the Austrian jewellery brand.\nIt has joined forces with the International Gemological Institute, which will certify all laboratory-grown diamonds in its Galaxy collection that will be launched in New York later in September.\nThis independent organisation, which boasts nearly five decades of expertise in diamond evaluation and grading, will assess and certify the quality of each lab-grown diamond in the collection.\nThe certification process will evaluate the diamonds based on four key aspects – cut, colour, clarity and carat weight – and enhance consumer trust and confidence, according to the brand’s chief executive Alexis Nasard.\nSupergoop! drops lipsticks with SPF\nWhen it comes to adequate sun protection, no spot is more overlooked than the lips. SPF specialist Supergoop! has come to the rescue by launching its first lipstick range.\nPriced at $38, the Lipshade 100% Mineral SPF 30 is highly pigmented and has built-in SPF or sun protection factor. Available in five shades to suit a wide range of skin tones, the lipsticks are infused with natural peppermint oil, peptides, shea butter and rosehip oil to hydrate and nourish lips for a fuller and smoother appearance.\nWear on its own for an intensive pop of colour or apply a thin layer of the product and blend it out with your fingertip or a lip brush for a sheer and natural look.\nSupergoop! is available at Sephora stores, www.sephora.sg and LazMall on Lazada (lazada.sg).", "url": "https://www.straitstimes.com/life/style/style-news-societya-launches-custom-clothing-range-more-fenty-x-puma-shoes"}