{"authors": ["Walter Sim"], "date_download": "2024-10-12 13:51:06", "date_modify": "2024-10-12 13:51:06", "date_publish": "2022-09-24 15:00:00", "description": "Yamakei Residences, a new 12-unit development in Niseko by Singapore real estate developer Temak Treehouse, offers a premium luxury experience Read more at straitstimes.com.", "filename": "life_travel_indulge-in-niseko-s-rich-nature-at-yamakei_1728741066.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/25/Yotei20Penthouse_0.jpg?VersionId=iQBirpDYmuIiOGhzfnRGJooZeK98QT1r", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_travel_indulge-in-niseko-s-rich-nature-at-yamakei_1728741066.html", "title": "Indulge in Niseko’s rich nature at Yamakei", "title_page": "Indulge in Niseko’s rich nature at Yamakei | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NISEKO, Hokkaido – I step out of the lift right into a spacious cosy living room with an open-concept kitchen, furnished with bespoke furniture and artwork by Hokkaido artisans.\nThe natural light casts a warm inviting glow in the apartment, where the floor-to-ceiling windows reveal lush green forests of a hill right next to the development.\nYamakei Residences, a new 12-unit development in Niseko by boutique Singapore real estate developer Temak Treehouse, offers a premium luxury experience.\nDuring my three-day, two-night visit this summer, I stay in a 177 sq m unit and find myself unwilling to leave.\nYamakei, which was completed in 2021, is gearing up to receive its first foreign guests this winter with the reopening of Japan’s borders.\nJapan will relax its border controls and allow visa-free, individual free-and-easy travel from Oct 11, Prime Minister Fumio Kishida said on Thursday, thus putting an end to the dearth of foreign visitors that has befallen Niseko for two winters.\nStepping out onto the balcony – spacious enough for yoga – I am greeted by the crisp cool fresh air of the great outdoors and entranced by the soothing sounds of a cascading creek nearby.\nAll units come equipped with a private onsen tub with mineral-rich water tapped from 17 storeys below ground.\nThe tubs, made of Japanese hinoki cedar wood, are transportive. Taking a bath feels akin to the healing Japanese practice of shinrin-yoku (forest bathing); wood like the hinoki contains the substance phytoncide, which has been proven to significantly increase human “natural killer” cells that boost immunity functions.\nBeing close to nature also has the reported benefits of an improvement in mood, creativity and sleep quality, among others.\nDespite the sense of seclusion being in a natural sanctuary, Yamakei Residences is within walking distance from the hub that is Hirafu Village with an eclectic mix of restaurants and bars.\nTemak Treehouse director Tong Shuh Lan, 51, describes Yamakei – which comprises the kanji characters for mountain (yama) and creek (kei) – as a labour of love. Niseko holds a special meaning in her heart.\nUntil the Covid-19 pandemic broke the streak, she had been hitting the ski slopes in Niseko every year since 2008 with her family.\nIt was where her three children, now aged 21, 18 and 15, learnt to ski. Their daredevilry, however, meant they often left Ms Tong and her husband in the dust.\n“We’re here because of our love of Niseko and its abundant nature,” says Ms Tong, a former public servant. “We took a lot of pains to find this location. We wanted to be near the action, but yet totally tucked away in nature and apart from the crowds.”\nYamakei is located in an area known as Lower Hirafu, about 400m from the Hirafu Junction and 750m from the nearest ski-lift. While not a “ski-in ski-out” establishment located immediately on the slopes, there are many conveniences, not least the izakaya (Japanese eateries) and bars within walking distance.\nThe 12 apartment units, which range between 110 sq m and 354 sq m, are for sale at a price tag starting at US$1.8 million (S$2.5 million). Two have been sold – one to a Filipino and another to a Taiwanese – while another two have been reserved.\nAll but one penthouse come fully furnished with high-end appliances such as 65-inch smart televisions, Bose speakers, Miele ovens and Liebherr fridges. The only unfurnished apartment, Ms Tong says, is to cater to potential demand from those who want to add their own touch. The property is managed by Niseko Portfolio, which handles short-stay reservations and on-site concierge services.\nMs Tong could oversee the construction of Yamakei only remotely, given the border restrictions that have shut out even business travel to Japan for the large part of the Covid-19 pandemic. Yamakei was completed in January 2021, but it was not only until June 2022 that she first stepped foot on the property.\nThis is her second property in Niseko, following the nearby seven-apartment Kozue (Japanese for “treetops”) that was completed in 2016 and has won international architectural awards.\nBoth properties were designed by Tokyo-based Seshimo Architects, which is led by a husband-and-wife team. The company is also behind two other Singaporean projects in Niseko, including The Maples in Hirafu Village.", "url": "https://www.straitstimes.com/life/travel/indulge-in-niseko-s-rich-nature-at-yamakei"}