{"authors": ["Tan Hsueh Yun"], "date_download": "2024-10-12 14:03:21", "date_modify": "2024-10-12 14:03:21", "date_publish": "2024-08-15 16:05:00", "description": "The entrepreneur's first overseas Chateraise store opened in Singapore in 2015. Read more at straitstimes.com.", "filename": "life_food_founder-of-japanese-cake-chain-chateraise-dies_1728741801.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/15/CHiroshi20SaitoEFBC88ChairmanEFBC89.jpg?VersionId=aRG4d2WCC6Nb6XBn8TueWH5Wsf8xOTV8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_founder-of-japanese-cake-chain-chateraise-dies_1728741801.html", "title": "Founder of Japanese cake chain Chateraise dies at age 90", "title_page": "Founder of Japanese cake chain Chateraise dies at age 90 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The founder of Japanese cake chain Chateraise, Mr Hiroshi Saito, died on Aug 10 at age 90. The company announced his death on Aug 13 in a statement on social media platform X. It added that the wake and funeral would be for close relatives only.\nThe company’s statement also said: “Although his passing is a great loss to us, the company will continue to uphold the founder’s guiding principle of ‘threefold management’, and will continue to uphold that spirit in order to meet the expectations of our customers.”\nMr Saito’s business philosophy was to manage the company in a way that brings joy to customers, business partners and employees.\nChateraise started in 1967, selling cream puffs for 10 yen. The name comes from Mr Saito’s roots: a portmanteau of “chateau” and “raisin” – French for “castle” and “grape” – as he was the oldest son of a grape farmer.\nOver the years, he built an empire of more than 700 stores in Japan and more than 170 stores in Singapore, Taiwan, Malaysia, Indonesia, Hong Kong, the United Arab Emirates, Thailand, Vietnam and China.\nIts first overseas store was in Singapore. Mr Saito had wanted to open outside of Japan, and with his core team, visited 10 countries to figure out where best to open. They settled on Singapore, opening the first store in 2015 in Jurong. There are more than 35 stores here now.\nMs Takako Saito, his daughter, now runs Chateraise Holdings, which oversees the group’s confectionery chains, wineries, ski resorts, golf and country clubs and hotels.", "url": "https://www.straitstimes.com/life/food/founder-of-japanese-cake-chain-chateraise-dies"}