{"authors": ["Christie Chiu"], "date_download": "2024-10-12 13:27:49", "date_modify": "2024-10-12 13:27:49", "date_publish": "2023-10-26 18:45:00", "description": "Sales of the dolls in September 2023 have tripled from a year earlier, said one retailer. Read more at straitstimes.com.", "filename": "life_sonny-angels-the-tiny-cherub-dolls-that-have-stolen-countless-gen-z-girls-hearts_1728739669.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/26/HES6997.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_sonny-angels-the-tiny-cherub-dolls-that-have-stolen-countless-gen-z-girls-hearts_1728739669.html", "title": "Sonny Angels: The tiny cherub dolls that have stolen countless Gen Z girls’ hearts", "title_page": "Sonny Angels: The tiny cherub dolls that have stolen countless Gen Z girls’ hearts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Student Jolie Lim got her first Sonny Angel doll out of plain curiosity.\nAfter one of the 8cm-tall naked cherub angel figurines caught her eye at Tokyu Hands in Jewel Changi Airport in December 2020, she just had to get it.\n“I thought they were really silly. They bring me joy,” said Ms Lim, who purchased a doll donning a crimson apple on its head.\nHer best friend, Ms Jade Wee, who was with her when she made the purchase, grew so enamoured with her friend’s new trinket that she soon went back to get her own Sonny Angel – hers wears a red rose as a hat.\nThe two 17-year-olds have since become Sonny Angel fanatics. Their collection consists of more than 100 figurines, but Ms Lim and Ms Wee told The Straits Times that their first ones are among their most cherished.\nFirst rolled out in 2004 by Japanese lifestyle company Dreams, the pocket-size doll has gained renewed popularity in recent months, both internationally and in Singapore.\nPriced from $12.50 to $16.50 each at retailers such as Japanese bookshop Books Kinokuniya and department store Hands – which Tokyu Hands was renamed to in 2022 – sales have skyrocketed.\nDemand is so great that there are listings for some Sonny Angels on e-commerce platform Carousell that reach about 50 times the usual retail price.\nA doll that brings “happiness”\nThe figurines are the brainchild of Dreams founder Toru Soeya, who named the dolls after his nickname, Sonny.\nModelled after the Kewpie doll – which inspired the Japanese mayonnaise brand well known to Singaporeans – Mr Soeya designed Sonny Angels as a companion to working women in their 20s and launched them with the catchphrase, “He may bring you happiness”.\nEach Sonny Angel has a pair of tiny wings and colourful, whimsical headgear, sometimes with a matching outfit.\nEach doll is typically part of a set of 12 within the same series, which follow themes such as types of animals, flowers or food.\nSome series are available in a form called hippers, which can be stuck onto vertical surfaces such as computer desktops and mobile phones.\nSold in blind boxes, customers do not know which doll they are getting until opening the packaging – which Ms Wee said is a big draw of the collecting fad.\nShe said: “Because you don’t know what you’re going to get when unboxing, it gets really exciting to try and guess. And when you get the one you want, you’ll be really happy.”\nThis, however, can also make the experience frustrating, said Ms Lim and Ms Wee, as it can mean they may end up with designs they already own, or ones they do not like.\nGrowing community, growing demand\nIn order to sell and trade dolls with other fans, they set up a group on messaging platform Telegram in April.\nThe group has swelled to 865 members – about 250 of them joined since the end of September – and they discuss all things Sonny Angel, such as when restocks of the dolls are spotted at physical shops.\nAn acquired taste for some\nMany, however, still cannot wrap their heads around the craze.\nMs Lim’s mother, Ms Pinpin Jap, said that while she does not understand her daughter’s fixation with the figurines, she is supportive of the hobby as it makes Ms Lim happy.\nShe added that she often buys them for her daughter on her travels abroad as there are designs not available in Singapore. Aside from Japan, Sonny Angels can be found in about 30 countries, such as Malaysia, China and Australia.\nEven some fans were not instantly drawn to the dolls.\n“I thought they were weird and disconcerting because they’re just naked staring into your soul,” said Ms Yasmin Mohd Sani, who was introduced to Sonny Angels by a friend.\nBut things changed in June when the friend gifted her a Raccoon Dog Sonny Angel from the Japanese Good Luck series. Ms Yasmin even brought it along on her first day of work to calm her nerves, and has continued keeping it in her pocket almost everywhere she goes.\nWhile she is not yet an avid Sonny Angel collector, she said that she has come to appreciate them as charismatic little guys.\nShe said: “I’m convinced everyone has their own Sonny. You just need to find the right one. It’s like having a friend to accompany you when you’re anxious.”\nMs Yasmin added that she enjoys coming up with storylines for the dolls with her friends and that they give people a chance to reconnect with their inner child.\nIt is one of the activities those immersed in the Sonny Angel subculture enjoy.", "url": "https://www.straitstimes.com/life/sonny-angels-the-tiny-cherub-dolls-that-have-stolen-countless-gen-z-girls-hearts"}