{"authors": ["Amanda Chai"], "date_download": "2024-10-12 13:56:41", "date_modify": "2024-10-12 13:56:41", "date_publish": "2023-07-06 14:00:00", "description": "In a saturated market, a handful of dissatisfied beauty enthusiasts are creating their own innovative solutions. Read more at straitstimes.com.", "filename": "life_style_tired-of-the-usual-beauty-products-meet-3-new-to-s-pore-brands-disrupting-the-industry_1728741401.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/07/rrmodules0707.jpg?VersionId=lz1kjwi6S9YVpyQwlT1OeoofkPG5YcS1&h=40abc946", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_style_tired-of-the-usual-beauty-products-meet-3-new-to-s-pore-brands-disrupting-the-industry_1728741401.html", "title": "Tired of the usual beauty products? Meet 3 new-to-S’pore brands disrupting the industry", "title_page": "Tired of the usual beauty products? Meet 3 new-to-S’pore brands disrupting the industry | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – In a saturated beauty market, how does a new player stand out?\nBy swiftly addressing needs a customer may not even be aware of yet, a strategy especially pertinent in a post-pandemic climate where skincare consumers are getting smarter and have more exacting demands.\nA first-mover advantage helps.\nDissatisfied with existing options that did not work for them, a handful of beauty enthusiasts have taken it upon themselves to create innovative solutions.\nSerial entrepreneur Jeremy Cheung launched skin technology brand Naiian in April – aiming to offer products that give the efficacy of medical treatments. After decades in the beauty industry, the 54-year-old predicts that technology will play a big role in shaping the future landscape.\n“I think just having money to spend on marketing will no longer be (enough to be) successful. Personalisation – through a combination of topical products and supplements – and focusing on technology instead of just marketing will be the trend,” he says.\nThe Straits Times meets three new-to-market brands disrupting the beauty industry in their own ways.\nModules: Skincare on doctor’s orders\nPrescription, subscription, tele-dermatology service. New skincare brand Modules (modules.skin) is many things, but the one thing it is not – or so it claims – is fluffy marketing.\nThe brand even emphasises this on slogans blazoned on its order boxes, such as “made by pharmacists, not celebrities” and “forget trends, follow the science”.\nFounded in 2023, Modules is the region’s first online dermatology experience giving access to prescription ingredients and personalised products.\nIt is part of larger telehealth platform Ora – a Singaporean start-up which also owns telehealth brands andSons and Ova, for male health solutions and female reproductive healthcare respectively. Established in 2020 to increase accessibility to healthcare for the modern patient, Ora recently closed a $10M Series A round of funding, raising US$17 million (S$23 million) in total.\nModules was founded after the group saw “an enormous appetite for online dermatology” during the pandemic, says Ora brand manager Tom Reynolds, 35.\n“Covid-19 made people a lot more comfortable consuming everything online. People wanted a digital solution for something as important as healthcare.”\nAdditionally, there was a “captive audience” taking skincare and ingredient research into their own hands, a trend spearheaded by front-runners such as Canadian brand The Ordinary, which put the spotlight on ingredients, he adds.\n“It allowed customers to get more comfortable with ingredients that were previously guarded by big beauty brands, which just said ‘you need this complex’,” he adds.\nEven then, there is only so much off-the-shelf products can do.\nEnter the doctors. In line with its bullish brand message, the founding team behind Modules – a mix of former beauty, tech and retail executives – is kept largely private, “with the microphone given to the experts”.\nThe brand was built with a medical advisory board including cosmetic scientists and dermatologists.\nThis is how it works: Every customer begins with an online consultation with one of the local general practitioners Modules works with. The doctor provides a prescription based on the customer’s needs, and the product can then be customised to his or her preferences, before being made to order and delivered to the doorstep within five days.\nAll the 676 different formulations available are professionally mixed by chemists in a compound pharmacy in Singapore, which also formulates for local dermatology clinics.\nThe doctor consultation is integral to the process. A group of Singapore-based GPs on Ora’s payroll were trained by dermatologists to diagnose skin concerns and prescribe active ingredients.\n“The access to these prescription ingredients was previously out of reach to many,” says Mr Reynolds, a former marketeer at beauty conglomerate L’Oreal.\n“I had the experience of seeing what happens in big beauty – and I started to ask why can’t you access this ingredient that I know is the best possible ingredient? The reason is they’re so potent and powerful that they require a doctor to assess suitability and triage a patient accordingly.”\nFor instance, he continues, many retail products on the market targeting eczema are great at managing its symptoms, “but can’t actually target the causation of eczema and what causes a flare-up”.\nTretinoin, a stronger alternative to retinol which can be obtained only via prescription, is another example. “There’s a limit to how much off-the-shelf stuff can do.”\nModules also has three non-prescription products to complement its treatments: 3% Niacinamide Cleanser ($29), 23% Ascorbic Acid Serum ($39) and 16 Amino Acid Moisturiser ($29).\nNow a key trend in beauty, the concept of personalisation, says Mr Reynolds, actually went through multiple evolutions – from packaging and picking bottles or labels, to fragrance and, most recently, mixing one’s own serums at home.\n“That’s great, but we wanted precision,” he adds. “Everyone’s skin is different; it changes based on your environment and lifestyle. That personalised approach – that can change over time – is the best way to get the results you want.”\nOn why a customer would choose Modules over a conventional dermatologist, he says the $20 online consultations provide accessibility and convenience. No more waiting for and travelling to a booking.\nThe company chose to debut in Singapore as it is a “skin-savvy market” – where the consumers are “highly educated, tech-savvy, socially progressive and comfortable trying things digitally”, says Mr Reynolds, adding that Modules’ target consumers are aged 25 to 35.\n“It’s for the person who’s tried everything but hasn’t seen results; who wants that personalised experience and recognises that his or her skin is unique. If you’re a skincare expert, what will resonate with you is the fact that we don’t try and beautify or over-claim.”\nTaking the romance out of beauty marketing is a risk, but Modules believes it has found the right balance between efficacy, price and packaging “you can still be proud to have on display”.\nThe company also cannot rely on discounts and freebies to sell its medical-grade products.\nIn May, the team seeded skin test kits in Orchard Road to give quick, basic skin diagnosis and get people interested in understanding their skin.\nThe first customers have already turned in “powerful reviews”, says Mr Reynolds.\nEven with 676 formulas, there is plenty of room to scale – in addressing new conditions, areas of the body, bases and boosters.\nMeanwhile, regional expansion hinges on identifying local pharmacies and doctors to write prescriptions in those markets.\nModules is riding a movement from clean beauty into “clean clinical”, Mr Reynolds predicts. “Clean beauty was a marketing trend. Skincare customers now are not afraid to call brands out on products, marketing or spokesmen. The customer is going to demand more.\n“We can touch an efficacy that off-the-shelf can’t. We’re probably making big beauty brands uncomfortable.”\nMelixir: Vegan beauty ahead of the curve\nIt might be hard to imagine a beauty landscape without vegan options today, but that was a reality Ms Hana Lee struggled with just five years ago.\nVeganism had begun trending within the food scene, but not in beauty – and especially not in South Korea, recalls the Korean founder of vegan beauty brand Melixir. “I had to knock on more than 20 doors of manufacturers. They asked, ‘What is vegan beauty and how do you make it?’”\nMany turned her away, citing high production costs to source alternative, plant-based ingredients just for her small batch.\nShe eventually convinced a small manufacturer to support her vision. Via a crowdfunding platform, the 33-year-old launched her first product in 2018 – a vegan squalane face oil made with plant-derived squalane in place of squalane usually derived from shark liver oil.\nSlowly but steadily, the brand began gaining attention for its unique proposition, eventually snagging a stockist in Sephora Korea as one of the retailer’s few small, local cult brands.\nMelixir launched in Sephora Singapore in March, marking its gradual expansion into the rest of the region. Prices start at $21 for a lip butter.\nBefore starting her company, Ms Lee worked for a beauty tech start-up in San Francisco. The fine art and graphic design major got her feet wet in beauty retailing, e-commerce and building new brands.\nWhen a customer asked if the products were vegan in 2014, it got her thinking about the untapped market. To her knowledge, no vegan K-beauty brands existed then.\n“California was more advanced in sustainability,” she recalls. “Food trends had moved into lifestyle, fashion and beauty. realised there were a lot of needs from people looking for healthier and more sustainable options, and thought we could adopt that into the beauty industry.”\nEthical concerns aside, Ms Lee herself had flaky and sensitive skin, which she noticed improved after she switched to products that were fully plant-based or vegan.\nShe sat on the idea for a few years, working her way up the company in business development roles – where she headed expansion into the United States and China markets.\nIt also helped that the company was backed by acclaimed start-up accelerator Y Combinator, so she benefited first-hand from the intensive three-month programme and learnt how to scale a business.\nShe left in 2017 to start her own outfit. Finding solutions from medicinal herbs used in Korean traditions, she believes Melixir is the first fully vegan skincare brand in South Korea.\nTo commit to its claims, the brand has in place three promises to customers.\nFirst, that its products are 100 per cent free from animal ingredients and are not tested on animals; that they are designed for sensitive skin and hence free of harmful and artificial ingredients; and, lastly, that the packaging is made from glass or recycled materials, to reduce carbon emissions.\nNow a B Corp (a globally recognised certification for companies that meet high standards of social and environmental impact), Melixir also set up a recycling programme, encouraging customers to return empty bottles. These are turned into a new reusable material via its partner, waste management company TerraCycle.\nStanding out in K-beauty\nBut even after finding a manufacturer, the challenges did not end. In the saturated K-beauty market, it was difficult educating consumers on vegan beauty and why it was “better” for their skin.\nHer slow approach to developing new products, marketing and minimalist packaging also went against the fast production pace and cute packaging of conventional K-beauty, Ms Lee adds.\n“It was hard to keep up with the fast trends and heavy marketing, but what I wanted was to create a brand with a longer-term view of the value we create; that had a better philosophy of people and nature, in terms of sustainability.”\nShe signed up to host an Airbnb Experience cosmetic-making class, where she taught people to custom-make products, and shared about ingredients and formulations. She ran classes out of an office in Seoul’s Hannam-dong area for 1½ years, until the pandemic hit.\nWord of the classes spread and she realised the demand for vegan beauty was higher than expected.\n“People really enjoyed the process. We realised that people who look for vegan brands also look for clean ingredients and gentle formulas. They think ‘vegan’ equals a higher standard of ingredients and ingredient safety. Even non-vegans look for vegan cosmetics because of skin sensitivity issues.\n“It was a hidden need and no one initiated it,” she says.\nSince then, more vegan brands have joined the K-beauty market.\nMs Lee had feared in the beginning that her offering was too niche, but the pandemic accelerated interest in veganism, sustainability and health, she says. Sales tripled from 2020 to 2021 and is still growing.\nA shift in generational preferences has also been in her favour. Melixir’s young customer base – mostly aged 20 to 30, and from South Korea and the US – is more into naturalism and minimalism, she says. Some customers have told her the brand represents their identity.\n“Consumers are different now. The older generation looked for (a set way) of aesthetics and values; the younger generation cares more about diversity and being true to themselves.\n“People look for a brand they can relate to – it’s not just about corporations any more. They want to know the story behind the company. We’re transparent about how our products are made, and people can follow the process of creating a product and growing with a brand.\n“When we started, we were unique – but nowadays, it’s so saturated, even in the vegan beauty market,” adds Ms Lee, who has seen numerous up-and-coming brands from South Korea launch and disappear within two to five years.\nAs trends continue to shift, Melixir’s strategy is to double down on its values – by staying aligned to its vision and having “a limited number of promises but keeping to them”.\nAnother conscious choice has been to stock with Sephora rather than the city’s home-grown health and beauty retailer Olive Young, popular with both locals and tourists to Seoul. The French retailer would be a better channel for Melixir to meet more global audiences, Ms Lee notes.\n“It means we can listen to a wider range of people in different countries and increase the quality of our products. We want to create a brand that lasts really long and not just grows really fast.”\nNaiian: Injecting medical skincare tech into products\nTired of not seeing results from your usual topical beauty products? Mr Jeremy Cheung was too – which is why he created Naiian (naiianbeauty.sg), a skin technology brand aiming to bridge the gap between products and medical procedures.\nThe consumer arm under his skincare tech start-up Jubilee Skincare Inc launched here in April, with Singapore as its first market outside the US.\nFor now, there are just three products – an eye and face serum ($299), an eye lifting serum (not available in Singapore) and a roll-to-dissolve microneedling device ($209) – which tap stem cell technology and a proprietary skincare delivery system Naiian calls DNA Water.\nThe new frontier of skincare will focus on medical beauty technologies incorporated into products, says Mr Cheung, 54.\nTake it from him. With 26 years in the beauty industry, the Harvard Business School alumnus has a proven track record of trend forecasting.\nHe was the first to distribute South Korean brand The Face Shop in China (before it was acquired by conglomerate LG Household & Health Care) and the first to bring Korea-made BB creams to China in 2010, ahead of the product category’s global rise in popularity.\nNow based in South Korea, regarded as the skincare innovation hub of the world, he also has first dibs on new technologies and concepts that are substantially trialled before being launched to the public.\nThe Hong Kong-born Canadian has been living in Seoul with his Korean wife since 2000. They have a son, 25, and a daughter, 23.\nYou could say he was born into the beauty business. His father founded a company doing original equipment manufacturing for hair and beauty products, which exposed him to the production side of things.\nAfter Harvard, he dabbled in distributing women’s shoes and apparel for American brands Nine West and Theory respectively, but found himself drawn back to the beauty industry.\nOf his many business school classmates who ended up in investments and private equity, one approached him with the opportunity to distribute The Face Shop.\nIt was 2005, and China as a beauty market was still “raw” and focused on “super high-end luxury brands”, Mr Cheung recalls. K-culture had just taken off, thanks to the drama Jewel In The Palace (2003 to 2004), and he saw more Chinese consumers “trying to find the secret to Korean women’s beauty”.\nHe successfully launched The Face Shop in Shanghai, before the company was sold to LG in 2009.\nIn his line as a beauty brand distributor and creator, he has tried all kinds of brand-name products, says Mr Cheung. But, over time, he “needed more”.\nWhile searching for solutions, he noticed a growing demand for medical beauty spas. With easy access to the industry in Seoul, he tried every procedure short of plastic surgery – from Botox to lasers. They did for him what products could not.\nSimilarly, many consumers in recent years have become discontented with off-the-shelf beauty products and are turning to medical procedures for results, he says. “I knew that medical beauty technology would be the next step above beauty products. Skin technology is the key.”\nCommercialising science\nThe industry has evolved rapidly, he notes. Beauty spas in the past were a place for massages and facials, but today are where one can get a quick filler or Botox fix. “But even then, not that many people can afford the time and price for a medical beauty service.”\nEnter Naiian and Mr Cheung’s ambition to “commercialise science”.\nSouth Korea is rife with independent scientists creating new technologies in skincare delivery systems and application, he says.\n“But in the beauty business, marketing money is so important – so a lot of these new tech cannot survive.\n“The scientists are very good at what they do, but don’t have the budget or marketing savvy to maintain it. There’s plenty of proven tech waiting to be commercialised.”\nJubilee Skincare hopes to discover these new technologies, connect them and develop them into user-friendly products to be distributed to the world market.\nHe is currently harnessing two main technologies – microneedling systems and stem cell technology.\nThe first employs a single-use microneedle (for hygiene purposes) made of hyaluronic acid that dissolves in the skin, preparing the skin for skincare absorption. This is paired with DNA Water, Naiian’s processed water using a magnetic field said to enhance the absorption ability of any ingredient into the skin.\nThe stem cell technology banks on the nutrient solution used to culture human stem cells – known as stem cell-conditioned media, or food for the stem cells to multiply. During cultivation, growth factors that retain the renewing powers of the original cells are generated. The leftover cultured solution containing these growth factors is then turned into products.\nMr Cheung, who is an executive adviser for medical beauty clinic chain Apex Medical Center in Thailand, is betting on this lofty technology after personal experience with it.\nSeven years ago, he faced hair loss issues. He tried platelet-rich plasma technology, using plasma from his own blood to generate growth factors to reinject back into his hair and face. Seeing results boosted his confidence in the science.\nNaiian now works with a life science partner in South Korea to scale stem cell technology – from collection and extraction to bottling into products.\nThe company is already on the lookout for more partners with promising tech – including one from New Zealand, which developed a delivery system used for air cleaning that can be adapted for beauty. Naiian’s product range also has room to grow, with a cleanser in the works, adds Mr Cheung.", "url": "https://www.straitstimes.com/life/style/tired-of-the-usual-beauty-products-meet-3-new-to-s-pore-brands-disrupting-the-industry"}