{"authors": ["Cherie Lok"], "date_download": "2024-10-12 13:30:02", "date_modify": "2024-10-12 13:30:02", "date_publish": "2024-09-09 18:30:00", "description": "Local entrepreneur Pearlyn Lee’s store has fed one of Paris’ trendiest neighbourhoods for three years. Read more at straitstimes.com.", "filename": "life_s-pore-founded-paris-store-nonette-banh-mi-donuts-to-open-here-in-2026_1728739802.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/09/BC3A1nh20mC3ACs2028Photo20credit2040socialfood29.jpeg?VersionId=ko5vYf9CZBLn1ur29liaqwsbzKaotZGX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_s-pore-founded-paris-store-nonette-banh-mi-donuts-to-open-here-in-2026_1728739802.html", "title": "S’pore-founded Paris store Nonette Banh Mi & Donuts to open here in 2026", "title_page": "S’pore-founded Paris store Nonette Banh Mi & Donuts to open here in 2026 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Home-grown entrepreneur Pearlyn Lee’s peach-coloured banh mi store has fed one of Paris’ trendiest neighbourhoods for three years, and counts celebrities like Singaporean actress Sharon Au and the cast of hit Netflix series Emily In Paris (2020 to present) among its clientele.\nSoon, Singaporeans will be able to get a taste of Nonette Banh Mi & Donuts’ innovative flavours too, when its flagship outlet opens here in early 2026.\nThe menu is still in the works, but could feature combinations inspired by local dishes – for instance, a roast chicken iteration that comes with a reduced chicken broth dip that is modelled on chicken rice.\nMs Lee may also experiment with a beef rendang banh mi, introduce a vegan option and collaborate with urban farms. Her ethos revolves around sustainable sourcing and prices will range from $10 to $12.\nShe hopes to situate the store in the Central Business District, to feed hungry office workers.\n“When I was working for a French bank in Singapore about 15 years ago, I loved to grab a sandwich for lunch and sit by Boat Quay. It was so nice to get away from the air-conditioning and enjoy some time in the sun,” says the 41-year-old Singaporean, who has been based in Paris since 2016.\nShe moved to Geneva in 2011 for a commodities trading job, but grew bored of the Swiss city. Paris, on the other hand, had the food and culture she desired – everything, that is, except for Asian cuisine.\nBack then, it was limited to caterers and a handful of take-out places. She remembers that ingredients were often frozen, and dishes subpar. Unsurprisingly, Asian food did not have the best reputation.\n“People used to say awful things about Asian food on social media. It was associated with cheap, low-quality or frozen food. And if anyone got food poisoning, their first instinct was to blame Asian food.\n“As a minority, I couldn’t sit back and do nothing,” says Ms Lee, who was feeling the prick of cultural prejudice for the first time in her life.\nArmed with a dream to change Parisians’ perception of Asian food and a handful of Singaporean recipes she picked up in Geneva, she set up a South-east Asian restaurant, The Hood, in Paris’ 11th arrondissement in 2016, together with Khanh-Ly Huynh, winner of reality cooking series MasterChef France 2015.\nInitially, business was slow. “People were reluctant to try something they weren’t familiar with,” says Ms Lee.\nBut their coffee and Asian dishes – Singaporean staples like kaya toast, chicken rice and laksa – caught the attention of a group of international diners, who brought their friends and spread the word. The team also took to the streets, handing out spoonfuls of pandan cream in an attempt to educate the French public.\n“They would ask us, is this matcha or pistachio? Pandan was so unknown as an ingredient in Paris. It was only used in cocktails, but not really in desserts.”\nGradually, The Hood’s client base grew, and the restaurant started filling up.\nOscar-winning Malaysian actress Michelle Yeoh has popped by for a plate of nasi lemak and chicken rice – she reportedly loved the sambal, though said it was slightly too sweet.\nThen the pandemic hit. Out of the hush of Paris’ shuttered restaurant scene emerged a new star: The Hood’s banh mi. As one of the most delivery-friendly items on the eatery’s menu, demand for the sandwich spiked, driven in part by a surge in media attention.\nMs Lee and her team were by no means the first people to introduce the Vietnamese dish to France, but set themselves apart from the rest of the competition through housemade ingredients. Their charcuterie is made in-house, as is their sriracha sauce.\nThey also rolled out unusual flavours like duck and turkey pastrami. Instead of mayonnaise, each banh mi is smeared with a layer of butter and pate made from chicken liver, shallots, chicken fat and soya sauce.\nDespite the slightly steeper prices – the banh mi start at €8 (S$11.50), nearly double that of some other options in the city – the sandwiches got so popular that people started dropping into The Hood just to order banh mi to take away.\nQueues were starting to form outside the restaurant – which was when the founders realised it might make more sense to set up a separate kiosk for their star item.\nAnd so Nonette was born in July 2021, across the street from The Hood. It borrows its name from the musical term that refers to a composition made up of nine instruments or voices.\nJust like an ensemble of ingredients coming together in harmony, Ms Lee’s aim has always been to strike a balance between East and West, between all the components that make the banh mi great.\n“It’s a really versatile sandwich that you can adapt as long as you respect the core banh mi codes. There needs to be a coat of fat, some crunch, pickles and the freshness of the herbs,” she says.\nMs Lee last brought her banh mi to Singapore in 2022 through a three-day pop-up at Tiong Bahru Bakery’s Fort Canning Park outlet, where she toyed with flavour-packed combinations like soya and garlic roast chicken thigh, as well as minced jackfruit with lemongrass.\nShe will launch another, longer pop-up here in the first half of 2025 to better understand local consumer preferences.", "url": "https://www.straitstimes.com/life/s-pore-founded-paris-store-nonette-banh-mi-donuts-to-open-here-in-2026"}