{"authors": ["Sarah Koh"], "date_download": "2024-10-12 14:16:48", "date_modify": "2024-10-12 14:16:48", "date_publish": "2024-02-28 07:00:00", "description": "Police were even called in, but organisers have promised a full refund to all ticket buyers. Read more at straitstimes.com.", "filename": "life_absolute-shambles-willy-wonka-event-in-scotland-leaves-bad-taste-for-attendees-kids-in-tears_1728742608.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/28/GHS35EyXoAA5WnA.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_absolute-shambles-willy-wonka-event-in-scotland-leaves-bad-taste-for-attendees-kids-in-tears_1728742608.html", "title": "‘Absolute shambles’: Willy Wonka event in Scotland leaves bad taste for attendees, kids in tears", "title_page": "‘Absolute shambles’: Willy Wonka event in Scotland leaves bad taste for attendees, kids in tears | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "It was supposed to be a fun-filled, colourful and tasty weekend for attendees of a Willy Wonka-inspired event in Glasgow on Feb 24 and 25.\nBut children and fans of the beloved fictional chocolatier found themselves in a sticky situation instead, after arriving at the event in the Scottish capital to find a sparsely decorated warehouse, with backdrops that barely covered the drab walls.\nAfter early attendees complained about the event leaving a bitter taste, organisers House of Illuminati pulled the plug on the entire setup halfway through its first day on Feb 24, according to British media reports.\nTickets to the event titled ‘Willy’s Chocolate Experience’ cost up to £35 (S$59.60) each, and promised “a day of pure imagination and wonder”, “where dreams come to life”, reported Sky News.\nAdvertisements for the self-described family-friendly event claimed that visitors could look forward to activities such as navigating an enchanted garden while collecting “delicious beans”, journeying through a “twilight tunnel”, and watching live performances.\nHowever, photos taken by attendees showed a minimally decorated warehouse instead, with some tables and benches scattered about, and a small bouncy castle in one corner.\nOfficers from Police Scotland arrived at the event, after receiving complaints from attendees, said the reports.\nOne disgruntled attendee, Mr Stuart Sinclair, told Sky that the event was far from what the advertisements had shown.\nThe 29-year-old had travelled two hours to get to the event, with his two sons and four-year-old daughter.\nHe said his children received a few jelly sweets and a cup of soda at the event.\nDescribing the event as an “absolute shambles”, Mr Sinclair added that he had never seen anything like it.\nAnother attendee, Mr Jack Proctor, told Scottish media outlet STV News that he and his family found at the event “a disorganised mini-maze of randomly placed oversized props, a lacklustre candy station that dispersed one jelly bean per child, and a terrifying chrome-masked character that scared many of the kids to tears”.\nMr Paul Connell, an actor who had been hired by House of Illuminati to perform at the event, told STV News: “My heart sank looking around… I just felt sad because I was aware of how many kids were going to be coming through.”\nIn a Facebook post on Feb 24 that has since been deleted, House of Illuminati said that they were “truly sorry” for the “very stressful and frustrating day for many”.\n“Unfortunately, last minute we were let down in many areas of our event and tried our best to continue on and push through, and now realise we probably should have cancelled first thing this morning instead,” it said.\n“We fully apologise for what has happened and will be giving full refunds to each and every person that purchased tickets.”", "url": "https://www.straitstimes.com/life/absolute-shambles-willy-wonka-event-in-scotland-leaves-bad-taste-for-attendees-kids-in-tears"}