{"authors": ["Alison de Souza"], "date_download": "2024-10-12 14:04:43", "date_modify": "2024-10-12 14:04:43", "date_publish": "2022-09-14 11:30:00", "description": "If you are not a foodie, this new show might just make you one. Read more at straitstimes.com.", "filename": "life_entertainment_binge-worthy-the-bear-is-a-salty-sweet-restaurant-comedy-drama_1728741883.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/15/Bear101427059202107070043_0.jpg?VersionId=spfKOULA9.aSyaHIix0HckaAxGrQgy.q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_binge-worthy-the-bear-is-a-salty-sweet-restaurant-comedy-drama_1728741883.html", "title": "Binge-worthy: The Bear is a salty-sweet restaurant comedy-drama", "title_page": "Binge-worthy: The Bear is a salty-sweet restaurant comedy-drama  | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Bear\nDisney+\n4 stars\nIf you are not a foodie, the comedy-drama The Bear might just make you one.\nIt follows a hotshot young chef, Carmy Berzatto (Jeremy Allen White), as he leaves behind a career in some of the world’s top fine-dining establishments in order to run a greasy old Chicago sandwich shop he inherits.\nHere are three reasons to watch this deliciously tense and funny series:\n1. The little sandwich shop that could\nCarmy cut his teeth at fancy restaurants such as Noma and The French Laundry, but when his brother dies, he takes over The Original Beef of Chicagoland, an old-school spot serving Italian beef sandwiches and a handful of other dishes.\nBut the place is a mess – literally, financially and functionally.\nWhen Carmy decides to overhaul the menu and kitchen – hiring new staff and retraining the blue-collar cooks in the system used at fancy restaurants – he ruffles everyone’s feathers and constantly flirts with disaster. But he eventually earns his staff’s respect and, like them, the audience starts to cheer him on.\n2. Salty-sweet kitchen politics\nThe tiny kitchen in The Bear holds several outsized egos: the volatile manager Richie (Ebon Moss-Bachrach); soft-spoken but fiercely capable sous chef Sydney (Ayo Edebiri); and stubborn veteran line cook Tina (Liza Colon-Zayas).\nWorking in such proximity, they chafe at one another but also develop a family-like bond and camaraderie that is infectious.\nAnd in the background, there is the slow-moving car crash of Carmy’s mental health unspooling.\n3. High or low cuisine, it is art\nThere are the requisite shots of hands conjuring up exquisite food, but the show goes beyond mere food porn to try and capture the hypnotic sensory pleasures of preparing a meal.\nOne could think this is overly dramatic when talking about sandwiches and diner fare.\nBut the show makes the point that whether it is a 48-hour plum wine reduction or a simple side of mash, there is art – and pride – in a dish done well.", "url": "https://www.straitstimes.com/life/entertainment/binge-worthy-the-bear-is-a-salty-sweet-restaurant-comedy-drama"}