{"authors": ["Chantal Sajan"], "date_download": "2024-10-12 13:32:30", "date_modify": "2024-10-12 13:32:30", "date_publish": "2023-10-13 12:00:00", "description": "This regular column tracks the latest developments in architecture and design. Read more at straitstimes.com.", "filename": "life_home-design_design-news-baccarat-launches-dragon-year-crystal-range-royal-selangor-unveils-festive-collection_1728739950.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/13/Pic201Baccarat..jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_home-design_design-news-baccarat-launches-dragon-year-crystal-range-royal-selangor-unveils-festive-collection_1728739950.html", "title": "Design News: Baccarat launches Dragon Year crystal range, Royal Selangor unveils festive collection", "title_page": "Design News: Baccarat launches Dragon Year crystal range, Royal Selangor unveils festive collection | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Baccarat roars into 2024 with Dragon Year collection\nAhead of its 260th anniversary in 2024, French luxury house Baccarat has lined up a series of events worldwide and will launch a range of 2024 Dragon Year crystal home decor accents in Singapore.\nThe sculpted dragon creations can be found at Baccarat’s boutique at The Shoppes at Marina Bay Sands, which also showcases entire collections of the House of Baccarat, including its Mille Nuits tableware and Zenith chandeliers.\nOne of the highlights of the new range is the Dragon Legendaire ($67,000), which features the majestic creature on an ebony base.\nRequiring a different mould for each of its 50 components, it is inspired by the Chinese concept of harmony – yin and yang – which can be seen in the accurate proportions, the fine detailing and the reflection of light from its scales on the dragon’s undulating body.\nThe range features the dragon motif in vases and figurines. Prices start at $600 for a Zodiac Dragon sculpture from the new collection.\nInfo: The Baccarat boutique is at B1-68, The Shoppes at Marina Bay Sands, 8 Bayfront Avenue. Go to baccarat.sg\nRoyal Selangor unveils festive collection\nThe lifestyle brand has released its Christmas gift guide, featuring pewter collections curated to appeal to all age groups, just in time for the year-end festivities.\nFrom the Domaine Martini Glass Pair for raising Christmas toasts at the dinner table to the Teddy Bears’ Picnic Library Bookends for supporting children’s books on shelves, there is something for everyone.\nRoyal Selangor, which was founded in 1885 in Malaya, is headquartered in Kuala Lumpur and has standalone stores in the United Kingdom, Hong Kong and Singapore.\nIt exports to more than 20 countries, and its designs can be found in major department stores such as Wako in Japan, Harrods in London and Hudson Bay in Toronto, Canada.\nIts collections highlight the craftsmanship of its pewter artisans, who forge new designs while upholding Royal Selangor’s rich heritage.\nThe Mulberry Silk paint is said to make walls feel like natural silk fibres to the touch after drying, while the Pumice Stone paint transforms surfaces to look like natural sandstone. The artistic relief texture features three-dimensional granules and fragments.\nThe Snowflake Rock paint looks like natural rocks that have been hand-polished by craftsmen, and comes in a palette of vibrant colours.\nInfo: The Interior Texture Paint series’ full range will be available by December 2023. Go to nipponpaint.com.sg", "url": "https://www.straitstimes.com/life/home-design/design-news-baccarat-launches-dragon-year-crystal-range-royal-selangor-unveils-festive-collection"}