{"authors": ["Chantal Sajan"], "date_download": "2024-10-12 14:20:52", "date_modify": "2024-10-12 14:20:52", "date_publish": "2024-04-05 15:00:00", "description": "Check out bazaars in HDB estates during the final week of the fasting month. Read more at straitstimes.com.", "filename": "life_home-design_celebrate-ramadan-at-heartland-bazaars_1728742852.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/05/2024040264474547bum2756-01.jpg?VersionId=WUBFj6KypGNSEsKj33uKsaXKHvV0WS19", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_home-design_celebrate-ramadan-at-heartland-bazaars_1728742852.html", "title": "Celebrate Ramadan at heartland bazaars", "title_page": "Celebrate Ramadan at heartland bazaars | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – As the Ramadan fasting month comes to a close, the celebrations are moving to Singapore’s Housing Board estates.\nWhile the Gemilang Kampong Gelam bazaar – one of the most popular bazaars in the Kampong Glam area with 116 stalls – closes on April 5, those in the heartland are still going strong.\nThe year’s biggest heartland Ramadan bazaar, showcasing about 500 stalls, is the Bazaar Raya Geylang Serai, which ends in the early morning of April 10.\nThe HDB heartland celebrations are organised annually by the People’s Association (PA), while the Gemilang Kampong Gelam is organised by One Kampong Gelam and supported by the Singapore Tourism Board and Urban Redevelopment Authority.\nMuslims in Singapore started their holy month of dawn-to-sunset fasting on March 12. Hari Raya Puasa, or Hari Raya Aidilfitri, marks the end of the fasting month and falls on April 10 in Singapore in 2024.\nRamadan bazaars are a draw for the whole community as they offer an immersive experience featuring Malay cuisine and live performances, as well as festive attire and home decor.\nThe Straits Times checks out the highlights at the ongoing bazaars in Geylang, Tampines and Marsiling.\nGeylang Serai\nFrom crafts to Malay fashion to rousing performances, the Bazaar Raya Geylang Serai, which is on until the wee hours of Hari Raya Puasa on April 10, has lined up an immersive experience for visitors.\nOrganised by Wisma Geylang Serai, which is a part of the People’s Association, there will be a craft workshop on April 6 designed for family fun. Participants will get to take home a personalised pot with a plant to add a green touch to their Hari Raya home decor.\nThere is also a Bazaar Raya Geylang Serai Fashion Show on April 6 put together by vendors to showcase various traditional apparel available for purchase only at the bazaar.\nTo spice things up, popular Malaysian music artiste Imran Ajmain and girl group Dolla will take the stage to perform their latest hits.\nThere will also be daily performances on the last few days of the bazaar to capture the festive spirit of Hari Raya.\nBesides performances by cultural groups such as Arjunaseni, Orkes Engku Aman and Kirana Seni, there will also be the perennial crowd favourite dikir barat shows.\nDikir barat is a distinctive style of Malay choral singing popular in Singapore and Malaysia, which incorporates synchronised movements and singing of Malay poetry. It is traditionally performed during the harvest season, weddings and festive occasions.\nUnity in diversity is the overarching theme for Our Tampines Hub’s Hari Raya Bazaar in 2024, with international booths from Jordan, Indonesia and Turkey alongside familiar local favourites.\nThe event, which started on March 23 and will go on till April 14, aims to bridge the diversity of cultures by helping to build an inclusive, cohesive and vibrant community in Tampines.\nThere are more than 35 booths at the Hari Raya Bazaar located at the Central Plaza. Several resident home bakers living in Tampines will also set up free sampling booths at the Festive Market for their homemade cookies, cakes and other delicacies.\nThe Malay Heritage Board has also installed exhibition panels to help residents and visitors explore Malay culture and heritage till April 14.\nThese panels explain why Muslims fast during the month of Ramadan, how Hari Raya is celebrated in the Malay community and traditional aspects of Malay food culture.\nThere are also free workshops and handicraft activities for children to create and decorate ketupat (rice parcels) and money envelopes, as well as tutorials on traditional Malay games.\nInfo: Our Tampines Hub’s Hari Raya Bazaar is open daily till April 14, from 3 to 10pm (Monday to Thursday) and noon to 10pm (weekends from Friday and public holidays). Go to facebook.com/OurTampinesHub\nTampines Changkat\nOne of the highlights of the Ramadan Food Bazaar organised by Tampines Changkat Community Club Malay Activity Executive Committee is its air kathira or kathira drink, a traditional Malay remedy said to cool the body in hot weather.\nFeaturing malva nuts, kathira gum and basil seeds which are soaked in pandan-flavoured water and allowed to swell to form a jelly-like mass, the drink is also a Hari Raya staple that goes well with festive dishes and desserts.\nThere are 11 food stalls at the Ramadan Food Bazaar@Tampines Changkat, offering an array of traditional favourites such as rice flour dessert kuih jongkong and a Middle Eastern version of nasi briyani called nasi bukhari.\nIn addition to the culinary selections, the bazaar also showcases a rich tapestry of cultural activities.\nTampines Changkat Youth Network has orchestrated a diverse range of engaging experiences, including traditional game stalls such as congkak – a traditional Malay board game using perforated planks – that provide an immersive platform for Tampines Changkat’s residents to delve into and appreciate Malay culture and heritage.\nThe bazaar is designed to not only foster a sense of community and inclusivity, but also to serve as an educational opportunity for residents to gain insights into the vibrant traditions of Singapore’s Malay community.\nInfo: The Ramadan Food Bazaar is on till April 7. It is held daily from 5 to 8pm at the void deck of Block 301 Tampines Street 32. Go to str.sg/ueBt\nMarsiling\nBazaria Marsiling is abuzz with something for everyone in the family.\nIts 128 stalls at the open field next to Causeway Point near Woodlands MRT station showcase almost everything one needs to celebrate Hari Raya Puasa – festive food, games and children’s rides.\nOne of its highlights is the signature prawn vadai by Mr Vadai, one of Singapore’s most popular hawker food brands. The savoury snacks are sold in batches of five for $5.", "url": "https://www.straitstimes.com/life/home-design/celebrate-ramadan-at-heartland-bazaars"}