{"authors": ["Suzanne Sng"], "date_download": "2024-10-12 14:05:25", "date_modify": "2024-10-12 14:05:25", "date_publish": "2023-04-23 07:00:00", "description": "The artist-actor claims he fabricated the story, which he told nine years ago on a podcast. Read more at straitstimes.com.", "filename": "life_entertainment_beef-s-creator-and-stars-address-co-star-david-choe-s-controversy-over-a-rape-story-he-made-up_1728741925.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/23/acDavid230423_0.jpg?VersionId=2.EaEJUkOBeaM9SW7Jk_5DPrksV2HR.Z", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_beef-s-creator-and-stars-address-co-star-david-choe-s-controversy-over-a-rape-story-he-made-up_1728741925.html", "title": "Beef’s creator and stars address co-star David Choe’s controversy over a rape story he made up", "title_page": "Beef’s creator and stars address co-star David Choe’s controversy over a rape story he made up | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – The creator and lead actors of hit Netflix series Beef have addressed the recent controversy over co-star David Choe, who came under fire for a rape story he told on a podcast nine years ago.\nThe show’s executive producers – actor Steven Yeun, actress Ali Wong and series creator Lee Sung-jin – released a statement to Vanity Fair magazine, which published it last Friday.\n“The story David Choe fabricated nine years ago is undeniably hurtful and extremely disturbing. We do not condone this story in any way and we understand why this has been so upsetting and triggering,” they said.\nThey added: “We’re aware David has apologised in the past for making up this horrific story, and we’ve seen him put in the work to get the mental health support he needed over the last decade to better himself and learn from his mistakes.”\nA 2014 episode of Choe’s now-defunct podcast DVDASA resurfaced last week, following the success of Beef, a dark comedy starring a primarily Asian-American cast.\nReleased on Netflix on April 6, Beef climbed to No. 2 on Netflix’s Top 10 list of English-language shows.\nChoe, 46, who is also an artist, plays a volatile troublemaker with a criminal past in the show.\nIn the podcast, he recounts an explicit story of an interaction he had with a masseuse, including numerous non-consensual sexual acts, and joked that he was a “successful rapist”.\nHe faced backlash for the anecdote, but denied that he was a rapist, saying in a statement that the podcast was “a complete extension of his art” as a storyteller and artist.\nHe said: “I never thought I’d wake up one late afternoon and hear myself called a rapist. It sucks. Especially because I am not one. I am not a rapist. I hate rapists, I think rapists should be raped and murdered.\n“If I am guilty of anything, it’s bad storytelling in the style of douche.”\nHe revealed in 2017 that he went through three years of recovery and rehabilitation, and apologised again, saying: “I have zero history of sexual assault. I am deeply sorry for any hurt I’ve brought to anyone through my past words.”", "url": "https://www.straitstimes.com/life/entertainment/beef-s-creator-and-stars-address-co-star-david-choe-s-controversy-over-a-rape-story-he-made-up"}