{"authors": ["Alison de Souza"], "date_download": "2024-10-12 14:04:42", "date_modify": "2024-10-12 14:04:42", "date_publish": "2023-07-18 14:00:00", "description": "The critically beloved comedy-drama about a fine-dining chef is back for another season. Read more at straitstimes.com.", "filename": "life_entertainment_hit-show-the-bear-captures-post-pandemic-restaurant-struggles-in-season-2_1728741882.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/07/18/THEBEAR2021111R.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_hit-show-the-bear-captures-post-pandemic-restaurant-struggles-in-season-2_1728741882.html", "title": "Hit show The Bear captures post-pandemic restaurant struggles in Season 2", "title_page": "Hit show The Bear captures post-pandemic restaurant struggles in Season 2 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – With a 100-per-cent critics’ approval rating on review-aggregation site Rotten Tomatoes, The Bear was one of the most acclaimed new series of 2022.\nIt also earned 13 Emmy nominations, including for Outstanding Comedy Series.\nThe comedy-drama – which follows fine-dining chef Carmy Berzatto (Jeremy Allen White) as he takes over his late brother’s sandwich shop – is back for a second season on Disney+ on Wednesday.\nSpeaking at a virtual press event earlier in 2023, creator and showrunner Christopher Storer, 41, recalls making the first season of the show – which is set and shot in Chicago – when almost no one had heard of it.\n“When we started making the show together, it was so under the radar in Chicago that it felt almost like a student film, in the best possible way.\n“We felt like it was honest to the restaurant industry, which also is kind of funny and absurd and gnarly and intense,” says the American writer-producer, who worked on the Emmy-nominated comedy series Ramy (2019 to 2022).\nStorer’s sister Courtney – who has worked at top restaurants in Los Angeles and Paris – serves as a culinary producer on the show, which has been praised for its gritty portrayal of the restaurant business as well as the personal and financial strains behind the scenes.\nThe 38-year-old says her job went beyond making sure the food looks beautiful.\nShe says: “It’s a little bit deeper into, you know, what do people look like when they’re cooking? How are they holding a knife? Where are they standing?\n“Movement in a kitchen is something that’s super important in the show. It’s choreographed, almost – and in a kitchen, it feels that way.”\nWhite prepared for his role as Carmy, who has worked in some of the world’s top kitchens, by attending culinary school in California and shadowing real chefs.\nAnd the 32-year-old American actor says he quickly realised he would not come close to their skill level.\n“I wanted to become as good as Carmy – and that’s not realistic,” says the star, who appeared in the comedy-drama Shameless (2011 to 2021).\nBut the chef consultants on the show helped him learn the “dance and movement” that the professionals exhibit in the kitchen. “That’s something that can be learnt and kind of faked. And so it took some of the pressure off.”\nThere is a different kind of pressure, though, to making the second season of a hit show.\nWhite says: “It is a little nerve-racking, just having other people’s ideas and opinions about the show that aren’t our own. But we’re trying to make something as true and pure as we did the first time around.”\nIn that sense, reviews of a TV show are not that different from reviews of a restaurant, says Courtney Storer.\n“I was shocked to feel the similarities between what it’s like to create a show and what it’s like opening a restaurant,” she says. “You have so much pressure, but you can’t pay attention to it. You just have to execute, right? So I hope that mentality carries on for Season 2.”\nThe new season will see a fresh set of challenges for Carmy and his restaurant crew, something that is more topical than ever as many restaurants are still recovering from the pandemic.\nChristopher Storer says: “We have a lot of friends and family in this business who got wiped out during Covid-19 and they’re still trying to get back on their feet.\n“These are chefs that have three Michelin stars or smaller restaurants. Courtney and I ate at one of our dear friends’ restaurants last night. He’s one of the best chefs in the world, and he’s still hustling to pay the bills.”", "url": "https://www.straitstimes.com/life/entertainment/hit-show-the-bear-captures-post-pandemic-restaurant-struggles-in-season-2"}