{"authors": ["Chantal Sajan"], "date_download": "2024-10-12 13:32:26", "date_modify": "2024-10-12 13:32:26", "date_publish": "2024-08-09 11:00:00", "description": "In this monthly series, The Straits Times speaks to newsmakers, designers and residents about urban places that inspire them. Read more at straitstimes.com.", "filename": "life_home-design_places-of-the-heart-minister-desmond-lee-relaxes-by-kayaking-at-macritchie_1728739946.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/09/Desmond20Lee27s20favourite20places20Pic2022028129.jpg?VersionId=ygl8tKB5EWpQLX.hvgpPawcpFw6rnQ6r", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_home-design_places-of-the-heart-minister-desmond-lee-relaxes-by-kayaking-at-macritchie_1728739946.html", "title": "Places Of The Heart: Minister Desmond Lee relaxes by kayaking at MacRitchie", "title_page": "Places Of The Heart: Minister Desmond Lee relaxes by kayaking at MacRitchie | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Mr Desmond Lee, 48, is Minister for National Development (MND) and Minister-in-Charge of Social Services Integration. He served as an MP for Jurong Group Representation Constituency (GRC) before being elected a Member of Parliament (MP) for the West Coast GRC in July 2020. He graduated in 2001 with a bachelor’s degree in law from the National University of Singapore and holds a master’s degree in law from Oxford University. He is married with three children.\n“After a packed work schedule during the week, I try to find time to unwind whenever I can.\nMacRitchie Reservoir is one of my favourite places in Singapore, and a good place for families to enjoy nature and the outdoors. Its lush greenery and tranquil waters provide a serene escape to find some quiet, peace and space.\nBuilt in 1867 by colonial municipal engineer James MacRitchie, it is the oldest and biggest reservoir in Singapore, surrounded by the Central Catchment Nature Reserve. Both the reservoir park and nature reserve are ideal places for nature lovers, joggers, hikers, bird-watchers and anyone wanting to escape life in the busy city.\nWhen I was in my 20s, I would run the trail regularly. Nowadays, when I can, I do brisk walks along the trail or the boardwalk at the reservoir.\nTrees at MacRitchie tell a story about old Singapore. One can find native forest giants such as Dipterocarps, a family of hardwood trees that can grow up to 80m, some of which may have been around since Singapore was founded.\nThere are also Tembusu trees, one of Singapore’s most distinctive trees. It is prized for its resilience, especially the strength of its wood and its resistance to termites.\nI have also gone kayaking there with friends from Singapore Canoe Federation and nature groups. Apart from providing a good workout, kayaking at MacRitchie also offers a fresh perspective on nature.\nWhile kayaking, I often encounter a wide variety of wildlife that adds to the experience: white-bellied sea eagles circling overhead, kingfishers along the shoreline and the occasional blue-rumped parrot.\nMacRitchie is also home to the banded woodpecker, hill myna, slender squirrel, long-tailed macaque and the shy Sunda pangolin.\nThese close encounters with wildlife, combined with the serene environment, never fail to evoke a sense of peace.\nWe live in a busy city, so it’s good to be able to ‘unplug’ once in a while. MacRitchie Reservoir is a good place for this, and I always feel energised after walking, running or kayaking there.\nThese breaks are not just good for our physical health. They also refresh our minds and spark new ideas.\nI encourage fellow Singaporeans to step out and enjoy our city’s natural treasures in nature reserves and parks such as Sungei Buloh Wetland Reserve, Labrador Nature Reserve, Windsor Nature Park and Rifle Range Nature Park.\nSoon, you will also be able to learn more about our marine biodiversity when Singapore’s first marine park, Sisters’ Islands Marine Park, reopens later in 2024.\nPerhaps you can kayak there too!”", "url": "https://www.straitstimes.com/life/home-design/places-of-the-heart-minister-desmond-lee-relaxes-by-kayaking-at-macritchie"}