{"authors": ["John Lui"], "date_download": "2024-10-12 14:05:06", "date_modify": "2024-10-12 14:05:06", "date_publish": "2023-04-26 12:00:00", "description": "Sometimes, Netflix makes magic. This beautifully written, well-acted series is proof. Read more at straitstimes.com.", "filename": "life_entertainment_binge-worthy-beef-is-about-a-quarrel-that-exposes-the-lies-that-make-life-bearable_1728741906.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/26/BEEF110Unit02367RC.jpg?VersionId=C.3___5i_aNbcUQJGcvIhGOP1Q2Cu9ZN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_binge-worthy-beef-is-about-a-quarrel-that-exposes-the-lies-that-make-life-bearable_1728741906.html", "title": "Binge-worthy: Beef is about a quarrel that exposes the lies that make life bearable", "title_page": "Binge-worthy: Beef is about a quarrel that exposes the lies that make life bearable | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Beef (M18)\nNetflix\n4 stars\nIn a supermarket carpark, businesswoman Amy Lau (Ali Wong) and building contractor Danny Cho (Steven Yeun) almost crash into each other. That road rage encounter escalates into a conflict that will slowly consume their lives.\nSometimes, Netflix makes magic. This beautifully written, well-acted 10-episode dark comedy drama series is proof. Here are three reasons to sink your teeth into Beef.\n1. It is never sentimental\nThe feud of the title exposes the lies that make life bearable for the central pair. Their flaws make them relatable, but neither is likeable. Both are anxious, suspicious people looking to boost their self-esteem in any way they can.\nIt is the same with the secondary characters. Each person in Danny’s and Amy’s circles sees others as pawns in games they think that only they can see. Amy has a young daughter, but the girl is never milked for adorability or to reveal Amy’s softer, nurturing side.\n2. It is funny\nThe show gets viewers to laugh at its main characters, then to pity them. Amy is flailing, trying to maintain the facade of the woman who has it all. Danny pretends to be doing okay when his business is sinking.\nMeanwhile, Danny’s shady cousin Isaac (David Choe) and his stoner bros hatch get-rich-quick plans. Isaac, a former convict, has bitter musings about the Korean-American community, especially its cliquishness and the games of one-upmanship in church.\nAmy’s husband George (Joseph Lee) is the son of a famous artist, and believes everyone is laughing at him and his attempts at making art. He and Amy struggle to maintain the front required to sell products to the city’s elite. In Los Angeles, a town where you fake it till you make it, only the best fakers survive.\n3. The Asian-American dream, de-romanticised\nThe problem with movies like the Oscar-winning Everything Everywhere All At Once (2022) and other stories about the Asian-American experience is that the premise of the West being the promised land of opportunity is never questioned.\nIt is as if ambition and smarts mean nothing in Seoul or Singapore, and as though Vancouver or San Francisco offer an escape from the feudal oppression of Asia.\nBoth Danny and Amy are riddled with economic anxiety. Danny scrounges for work and fears losing everything, while Amy is desperate to live among the carefree rich.\nBoth carry the burden of fulfilling their immigrant parents’ dreams. That expectation takes a toll on Danny and Amy, breeding toxicity which, one day in that supermarket carpark, causes a moment of rudeness to flare into a vendetta.", "url": "https://www.straitstimes.com/life/entertainment/binge-worthy-beef-is-about-a-quarrel-that-exposes-the-lies-that-make-life-bearable"}