{"authors": ["Lim Ruey Yan"], "date_download": "2024-10-12 13:43:08", "date_modify": "2024-10-12 13:43:08", "date_publish": "2024-08-25 16:43:00", "description": "This was the first look of Chew's role for the movie Blooms Of Happiness. Read more at straitstimes.com.", "filename": "life_entertainment_dj-actor-dennis-chew-called-cute-in-nezha-get-up-for-upcoming-film_1728740588.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/25/dennischewnezha2.jpg?VersionId=FOpnO15H8btCRUl2WvuEXbDrMPNIKMq4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_entertainment_dj-actor-dennis-chew-called-cute-in-nezha-get-up-for-upcoming-film_1728740588.html", "title": "DJ-actor Dennis Chew called ‘cute’ in Nezha get-up for upcoming film", "title_page": "DJ-actor Dennis Chew called ‘cute’ in Nezha get-up for upcoming film | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Local radio DJ-actor Dennis Chew has been praised for his new look in the upcoming Chinese New Year movie Blooms Of Happiness.\nOn Aug 23, the 51-year-old posted on Instagram photos of himself in the costume of Chinese child deity Nezha, also known as Third Prince, from Chinese folk religion. “Blooms Of Happiness arriving during Chinese New Year,” he wrote. “Filming happily.”\nHis show-business pals such as actresses Hayley Woo, Celest Chong and Jernelle Oh and several netizens commented that he looked cute in the photos.\nChew told Chinese-language daily Lianhe Zaobao that he was playing a medium-like character in the movie, which also stars Singaporean actress Hong Huifang and Malaysian singer Ah Niu as mother and son.\nIn the film directed by Malaysian film-makers Ryon Lee and JY Teng, Ah Niu plays a convenience store owner whose business and marriage suffer due to the Covid-19 pandemic. With Chinese New Year approaching, he and his wife, who are in the midst of a divorce, take their children and their parents for a vacation, only for more drama to ensue.\nChew, a DJ at Mediacorp’s Chinese radio station Love 972, told Malaysian newspaper China Press that there are several outfits for his role in Blooms Of Happiness, with Nezha the first to be unveiled.\n“I was a bit reluctant initially when the director mentioned the role of Nezha to me, as Nezha is agile and able to do somersaults, something which I can’t do,” Chew told China Press. “However, I knew I could play the role after the director explained things to me.”\n“I have tried all kinds of looks after having been in show business for more than 30 years,” he added. “Being able to dress like this at my age, (I treat it as) a small and happy sacrifice.”\nHe told Zaobao on Aug 23 that he had completed his scenes after filming in Genting Highlands for five days and was on his way back to Singapore. He added that the other actors were still filming in Malaysia, with shooting expected to last till September.", "url": "https://www.straitstimes.com/life/entertainment/dj-actor-dennis-chew-called-cute-in-nezha-get-up-for-upcoming-film"}