{"authors": ["Eunice Quek"], "date_download": "2024-10-12 14:04:01", "date_modify": "2024-10-12 14:04:01", "date_publish": "2024-09-21 13:00:00", "description": "This three-part video series features the food chefs eat in and outside of their restaurant. Read more at straitstimes.com.", "filename": "life_food_chef-onchef-off-video-series-what-canchita-chefs-daniel-and-tamara-chavez-eat_1728741841.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/brightcove-thumbnails/GTLpVEwX_ko8QtOXYJ6zPsizQR8S5bG5P4mwohDYBbU.jpg?VersionId=okU0NWfzXk9mCRlzSr02M0TUjrO1nf5y", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_chef-onchef-off-video-series-what-canchita-chefs-daniel-and-tamara-chavez-eat_1728741841.html", "title": "Chef On/Chef Off video series: What Canchita chefs Daniel and Tamara Chavez eat", "title_page": "Chef On/Chef Off video series: What Canchita chefs Daniel and Tamara Chavez eat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Ever wondered what chefs eat in and out of their restaurants?\nChef On/Chef Off is a new three-part video series by The Straits Times that features the food which chefs make in their restaurants, as well as what they eat outside of work, on their days off.\nIt kicks off with Peruvian chef Daniel Chavez, 44, and his Mexican wife and fellow chef Tamara, 34. They run Canchita Peruvian Cuisine and Spanish restaurant Tinto, both of which are located in Dempsey.\nThey have another restaurant, tapas wine bar Vino Tinto, slated to open in November in the Central Business District.\nIn recent years, the duo – Mr Chavez with more than 20 years and Mrs Chavez with over 10 in the industry – have become a lot more mindful about what they eat and its effects on their well-being the next day.\nThey have cut down on drinking alcohol and having supper after work.\nConstantly having to taste food is a genuine job hazard, they say.\nMrs Chavez says: “As chefs, we need to try food. When we are working, we are always tasting, so we feel full all the time.”\nThey try to have their last meal for the day by 5.30pm, before dinner service commences.\nStaff meals – usually rice with stir-fried vegetables and a chicken dish – are more than just sustenance.\n“I love eating in the restaurant because it builds relationships with the team. They are more relaxed and chat more about their lives,” she adds.\nHe laments that people do not cook much at home any more, and believes that everyone – chefs included – should return to the stove.\n“It’s important that chefs cook at home and that they don’t see it as another version of their work,” he says.\nWatch ST’s video till the end for a bonus clip of Mrs Chavez’s jazzed-up “night chips”, doused with hot sauce and tajin (ground and dried chilli powder) from her well-stocked larder, which has no fewer than 10 kinds of peppers and hot sauce.\nThe next two videos will feature pastry chef Louisa Lim of the three-Michelin-starred Odette restaurant at the National Gallery Singapore, and chef Manjunath Mural of modern Indian restaurant Adda in Beach Road.\nInfo: Canchita Peruvian Cuisine at 9A/B Dempsey Hill opens from 11.30am to 3pm (Thursdays to Sundays), 5.30 to 10.30pm daily. For more information, go to canchita.sg", "url": "https://www.straitstimes.com/life/food/chef-onchef-off-video-series-what-canchita-chefs-daniel-and-tamara-chavez-eat"}