{"authors": ["Chantal Sajan"], "date_download": "2024-10-12 13:32:27", "date_modify": "2024-10-12 13:32:27", "date_publish": "2024-08-16 14:00:00", "description": "Designers and businesses are co-creating new experiences for people with disabilities so they can work, live and play better. Read more at straitstimes.com.", "filename": "life_home-design_creatives-craft-fun-thoughtful-ways-to-boost-designs-for-an-inclusive-society_1728739947.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/17/rrtheresa1708.jpg?VersionId=Jbpbeit6XN0mRCYY.18bpTS1pRiGf.Zt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_home-design_creatives-craft-fun-thoughtful-ways-to-boost-designs-for-an-inclusive-society_1728739947.html", "title": "Creatives craft fun, thoughtful ways to boost designs for an inclusive society", "title_page": "Creatives craft fun, thoughtful ways to boost designs for an inclusive society | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Creatives in Singapore and around the world are working imaginatively to shape more inclusive communities.\nAccording to the latest numbers from the World Economic Forum (WEF), more than 1.3 billion people live with some form of disability, representing not only 17 per cent of the global population but also the largest minority group worldwide.\nWEF aims to close the disability inclusion gap through a slew of initiatives, including getting 500 of the world’s biggest companies to commit to helping people with disabilities.\nSome of the big names leading the charge are chief executives like Mr Tim Cook from Apple, Mr Sundar Pichai from Google and Mr Kenichiro Yoshida from Sony Group.\nThe forum adopts the United Nations’ social model of disability, which is the globally recognised way to address disability.\nThis is when the focus is shifted from the individual’s impairment to societal barriers preventing people with disabilities from fully participating in society.\nIn Singapore, home-grown multidisciplinary firm Stuck Design partnered SG Enable in 2022 to help produce the agency’s ground-breaking Design Playbook for Inclusive Spaces.\nSG Enable, the focal agency for disability and inclusion in Singapore, enables those with disabilities to live, learn, work and play in an inclusive society. It was set up by the Ministry of Social and Family Development in 2013.\nThe e-book, which is free on SG Enable’s website (sgenable.sg), is designed to guide businesses in creating inclusive spaces and experiences.\nStuck Design’s co-founder and principal designer Tze Lee, who helmed the six-member design team that worked on the project, says inclusive design goes beyond physical accessibility.\n“It considers the experience of the place for everyone and is a great starting point for inspiring new experiences that benefit the community,” he says.\nHe adds that Stuck is looking at ways for companies to easily do a spatial scan of their existing spaces – based on SG Enable’s playbook principles and in partnership with people with disabilities – to uncover more opportunities for inclusive design.\n“The Playbook is built on insights from various people with disabilities, caregivers and businesses with an inclusive slant,” says Mr Lee.\n“We engaged this diverse set of participants through in-depth conversations and co-creation sessions, to uncover their needs and aspirations for more inclusive spaces.”\nSwimming ace Theresa Goh, who flew the Singapore flag at the Paralympics in Athens in 2004, is looking forward to watching the 2024 Summer Paralympics in Paris – to be staged from Aug 28 to Sept 8 – from the comfort of the airy living room of her newly renovated home in Tampines.\nShe collaborated with local architect and interior designer Charmaine Wong on revamping her four-room Housing Board flat to allow her to move around easily on her wheelchair, as well as reach for essential items without straining.\n“After the redesign, the space is cooler with cross-ventilation due to the absence of barriers,” says Goh, adding that she looks forward to “coming home to the laid-back vibe and to just chill out”.\nAfter a nine-month design gestation period which ended in November 2023, Ms Goh’s dream home in Tampines – with “lots of space, accessibility and cats” – was born.\nThe 1,048 sq ft HDB corridor flat, featuring dramatic black flooring and monochromatic walls, is almost double the size of her previous two-bedroom unit in The Tapestry condominium complex, also in Tampines.\n“In my 700 sq ft condo, there was hardly any wiggle room,” recalls Ms Goh, 37. She lives in the flat with her partner, Ms Kethlyn G, and two immaculately groomed cats named Sebastian and Cosmo.\nMs Goh, who retired from competitive sports in September 2019, works as a sports officer at the Singapore Disability Sports Council (SDSC), where she helps athletes work out their pathways in sports.\nHer duties include managing training schedules, working with the coaches to select competitions to help athletes progress and planning the annual sports budget.\nIn 2004, she became Singapore’s first female Paralympic swimmer, competing at the 2004 Paralympic Games in Athens.\nBesides winning a Paralympic Bronze Medal, she is also the most bemedalled Singapore athlete at the Asean Para Games, having snagged 33 medals, 30 of which are gold.\nIn 2008, Ms Goh was conferred the Pingat Bakti Masyarakat (Public Service Medal) at the National Day Awards. In 2016, she was presented the Bintang Bakti Masyarakat (Public Service Star) at the National Day Awards.\nHer dazzling sports career has inspired other young Singaporeans with disabilities to venture into competitive sports.\nShe says she is living a “normal” life far from the rigours of the sporting arena and surrounded by loved ones.\n“After months of searching for a place since late 2022, we finally found this unit, which ticked all the boxes for us,” she says.\nShe commissioned Ms Charmaine Wong, founder and principal architect of home-grown design ateliers Chalk Architects and Chark, to design the place. Ms Wong leads a team of designers and consultants for projects ranging from architecture to interior design.\nWhile other designers were quoting her up to $120,000 for the renovation, Ms Wong agreed to work with Ms Goh’s revised budget of around $95,000, which was still more than the $50,000 Goh had initially budgeted.\nSince March 2023, Ms Wong, 42, and her design partner Isjacob Ishak, 33, worked closely with Ms Goh and her able-bodied partner to come up with a design that focused on the little details of daily life that made all the difference for a wheelchair user.\nThe designers spared no effort to create a barrier-free environment inside the flat.\nFor example, Ms Goh says, the old kitchen countertop – which impeded movement from the living room to the kitchen – was dismantled.\nSpecial kitchen shelving units and storage racks by German home fittings and architectural hardware brand Hafele were also installed for easy access.\n“From pulling down the clothes dryer in the kitchen balcony area to pulling out the shelving units for my condiments and spices for cooking, I have everything I need in the kitchen within arm’s reach,” she says.\nAfter a detailed survey of the flat, Ms Wong focused on the need to address basic functions such as a user-friendly threshold detail between bathrooms and the dry areas, and enlarging key spaces to allow for easy manoeuvring of Ms Goh’s wheelchair.\n“We envisioned a characteristic home design that matches their vibrant personalities through colours and playfulness; energising and never dull or sterile,” says Ms Wong.\nShe says the success of inclusive design is when barrier-free, wheelchair-friendly features are well integrated into the home’s overall flow and aesthetic.\nSeveral challenges were identified during the planning process for the tour, which started in November 2023.\nFor instance, the cable car could not accommodate motorised wheelchairs due to battery-pack fire safety concerns. Also, some routes were not fully accessible for wheelchair users.\nTo overcome these obstacles, Mr Law worked with Sentosa’s teams to develop multiple iterations of the tour before finalising the current route.\nThe Sentosa Wheel Venture Accessibility Tour starts from HarbourFront MRT station, where guests are greeted by tour docents who are wheelchair users. They arrive at Imbiah Station via the Sentosa Express monorail line.\n“In our conversations, it was clear that people with disabilities crave simple experiences, such as being close to nature and enjoying meals against a breathtaking backdrop of the beach and sea,” adds Mr Law.\nInfo: Tours are priced at $120, which includes admission tickets to SkyHelix Sentosa, UltraGolf, an alfresco-style casual dinner (shared main course and drink) by Palawan Beach and a tour guide. E-mail Tribe Tours at bookings@tribe-tours.com or go to str.sg/dMFQ\nAscott’s accessible rooms\nHospitality group The Ascott Limited marks four decades in 2024 by going “unlimited”.\nTo create “unlimited good” and positively impact the future of travel, the home-grown global player – established in 1984 as a wholly owned business unit of CapitaLand Investment – explored ways to deepen its commitment to the public.\nHaworth’s wheelchair-friendly work pods\nOne of the latest designs in leading global furniture brand Haworth’s ergonomic office solutions is its HushAccess work pods.\nThe free-standing acoustic pods are a flexible alternative to built-in meeting rooms.\nThey can be set up in building lobbies or malls to allow everyone – including wheelchair users and other people with disabilities – to work in comfort and privacy.\nThe acoustic booths are designed with noise reduction in mind, so users’ conversations are inaudible beyond the booth, and they hear minimal noise from outside.\nThe pods arrive flat-packed, can be set up quickly and are designed as a plug-and-play addition to existing furniture, requiring only a power outlet to be fully functional.\nFor users with limited arm movement, lighting and ventilation inside can be activated by motion sensors, eliminating the need to manually adjust the controls. All pods come in modules with customisable finishes.\nThere is a range of designs for viewing at Haworth’s Singapore showroom in Anson Road.\nHaworth, which was established in 1948 and is headquartered in Michigan in the United States, operates in more than 150 countries.\nOver the years, it has collaborated with acclaimed names such as Spanish designer and architect Patricia Urquiola and Dutch master Marcel Wanders.", "url": "https://www.straitstimes.com/life/home-design/creatives-craft-fun-thoughtful-ways-to-boost-designs-for-an-inclusive-society"}