{"authors": ["Cherie Lok"], "date_download": "2024-10-12 14:04:30", "date_modify": "2024-10-12 14:04:30", "date_publish": "2024-07-11 11:30:00", "description": "Get a taste of food from Ipoh without the journey to the Perak capital. Read more at straitstimes.com.", "filename": "life_food_food-picks-ipoh-town-for-kopitiam-dishes-raw-seafood-at-bucketta-regional-thai-food-at-jungle_1728741870.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/11/Nasi20Ayam20Goreng20Berempah.jpg?VersionId=c7Lp03dw89OhH9wCzk2t8utHiJFfSt4o", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/life_food_food-picks-ipoh-town-for-kopitiam-dishes-raw-seafood-at-bucketta-regional-thai-food-at-jungle_1728741870.html", "title": "Food Picks: Ipoh Town for kopitiam dishes, raw seafood at Bucketta, regional Thai food at Jungle", "title_page": "Food Picks: Ipoh Town for kopitiam dishes, raw seafood at Bucketta, regional Thai food at Jungle | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Ipoh Town: Kopitiam dishes with a kick\nIt takes non-east-siders about an hour or more to get from their homes to Changi Airport. From there, you can reach the Malaysian town of Ipoh in another hour by hopping on a plane.\nBut if your journey to the east has sapped your appetite for further travel, ditch the Changi-to-Ipoh leg and settle for the next best thing – Ipoh Town Kopitiam at Jewel Changi Airport.\nFounded by two Ipoh-raised sisters, this restaurant is a tribute to the culinary jewels of the Perak capital, inspired by the traditional dishes they used to sell alongside their mother in Ipoh’s bustling markets.\nThat includes the Nasi Ayam Goreng Berempah ($12.90) – a massive deep-fried chicken thigh served with fragrant coconut rice, boiled eggs, ikan bilis and, of course, sambal. The chicken has been marinated with over 10 spices, such as old ginger, lemongrass and cumin seeds, which infuse each bite with warm, aromatic depth.\nFor something milder, try the Ipoh Chicken Prawn Hor Fun ($12.90). Succulent prawns and strips of chicken are steeped in a moreish broth that is just light enough to avoid being overpowering. Be sure to soak it up quickly because if you do not, the noodles will.\nIf you are there for breakfast, go for the fragrant curry toast ($4.90), doused in a vividly spiced gravy and crowned with a soft-boiled egg that oozes out right on cue.\nOr opt for one of the snacks. The rendang pie ($3.50) strikes a nice sweet-savoury balance and you cannot go wrong with the Choy Kee egg tarts ($2.40 each). These creamy treats hail from one of Ipoh’s most beloved bakeries – as indicated by the long queues that form wherever they set up shop – and are making their first foray outside Malaysia with this collaboration.\nNo Ipoh meal is complete without the town’s classic white coffee ($3.50 for hot version; $4.90 for iced version). This rendition is the result of an arduous process of trial and error that involved the sisters trying over 40 recipes around their home town.\nBut their hard work has paid off and their cup now runneth over. Get the tissues ready – this overflowing mug of coffee can make for a messy sip.\nWhere: B1-299 Jewel Changi Airport, 78 Airport Boulevard\nMRT: Changi Airport\nOpen: 11am to 10pm daily\nInfo: @ipohtown.asia on Instagram\nBucketta: Fresh raw seafood\nThere is something so liberating about doing away with utensils. When presented with an epic mound of seafood, the only appropriate response is to roll up your sleeves and dig right in.\nThat is how I spend two hours at seafood restaurant Bucketta’s new Downtown East outlet one Thursday afternoon. Its signature seafood bucket (from $39.90++) comes in five sauces, including Thai cajun and garlic butter, and overflows with prawns, squid, crayfish, scallops and even Alaskan crab legs, though premium ingredients will cost you more.\nSeafood restaurants live and die by the freshness of their produce, and Bucketta’s ingredients thankfully pass the test. It gives me the confidence I need to devour the raw prawns and slices of salmon that appear next on my table, luxuriating in a savoury marinade ($35).\nThis uncooked combination, which is flecked with slices of chilli and garlic and served with seaweed, leafy greens and rice, turns out to be my favourite. If the seafood bucket is too heavy for you, this lighter, sweeter dish will perk you up.\nThough most of the menu draws on Thai cuisine, chef Wisit Sophon – formerly of one-Michelin-starred Thai restaurant Le Du in Bangkok – has put an Italian spin on some of the offerings.\nThe green curry penne with Thai herb chicken ($18), for instance, is a heavy blend of cross-cultural influences laced with the kind of lethal spiciness that creeps up on you.\nNot a fan of fusion food? Stick to the MaMa tom yum stew ($45), which simmers with familiar Thai flavours – sweet-sour soup, flavour-soaked seafood and silky instant noodles.\nWhere: 02-125 E!Hub Downtown East, 1 Pasir Ris Close\nMRT: Pasir Ris\nOpen: 11.30am to 11pm daily\nInfo: bucketta.sg\nJungle: Regional Thai fare\nAt first glance, new Thai restaurant Jungle in Ann Siang Hill appears to be having some sort of identity crisis.\nThere is little about Jungle that resembles the dense forests it borrows its name from. Not its sleek, wood-accented interior. Not its soundtrack, which cranks out funk and soul tunes. Not even its menu, which is a compact collection of modestly proportioned plates, rather than an overgrown sprawl. There is not even a Thai Jungle Curry on the list.\nTo make matters more confusing, the restaurant says it draws inspiration from the watering holes of Bangkok. And yet, it eschews their sweaty, neon-hued thrum for a laid-back dining experience.\nBut subversion, I come to realise, is the name of the game at Jungle. Do not expect the standard dishes you might find at any other Thai restaurant.\nIn place of the usual pad thai and pad kra pow, there are regional delicacies like the northern-style grilled pork sausage ($15). Perfumed with coriander, lemongrass, galangal, dried chilli and a host of other spices, it has a piquant depth most other sausages can only dream of.\nOther grilled highlights include the melt-in-your-mouth sugarcane smoked pork jowl ($28) and the equally succulent southern-style charcoal grilled chicken ($17), cloaked in a vibrant red curry glaze.\nThe southern crab yellow curry ($30) gives you a break from the procession of meat, but not the onslaught of lively flavour. Imbued with gentle heat and a briny fragrance, it is best eaten with rice.\nFor some added zing, get the pomelo lemongrass salad. Chunks of pomelo are interspersed with dried shrimp and candied coconut, layering sour on sweet on salty in a distinctly Thai symphony of notes and textures.\nWhere: 10 Ann Siang Hill\nMRT: Maxwell\nOpen: 6 to 11pm, Tuesdays to Thursdays; 6pm to midnight, Fridays and Saturdays\nInfo: @jungle.thai on Instagram", "url": "https://www.straitstimes.com/life/food/food-picks-ipoh-town-for-kopitiam-dishes-raw-seafood-at-bucketta-regional-thai-food-at-jungle"}