{"authors": [], "date_download": "2024-10-12 13:32:00", "date_modify": "2024-10-12 13:32:00", "date_publish": null, "description": "Former transport minister S. Iswaran faced eight new charges, involving items worth almost $19,000. Here are the charges.", "filename": "multimedia_graphics_2024_03_iswaran-8-charges_index.html_shell_1728739920.html", "image_url": "https://www.straitstimes.com/multimedia/graphics/assets/facebook_images/2024/03/iswaran-27-charges/iswaran-8charges.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/multimedia_graphics_2024_03_iswaran-8-charges_index.html_shell_1728739920.html", "title": "Golf clubs, whisky and a Brompton bicycle: What are the 8 new charges Iswaran faces?", "title_page": "Golf clubs, whisky and a Brompton bicycle: What are the 8 new charges Iswaran faces? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The charges are listed in order of the approximate date the items were allegedly obtained by Iswaran. The first charge is for four bottles of Gordon & MacPhail Caol Ila whisky worth $1,084.46 in total, around November 2021. He allegedly accepted another 4 bottles of this whisky in January and May 2022.\nThe second charge is for around January 2022, when he allegedly obtained a total of 12 wine and 2 whisky bottles totalling $3,255.75.\nThe third charge includes the first of the golf clubs, a TaylorMade golf driver worth $749 that was said to have been obtained also in January 2022.\nIn the fourth charge, in May 2022, he is alleged to have obtained two more bottles of whisky, of the same type he is said to have obtained in November 2021 and January 2022.\nIn June 2022, he allegedly obtained a set of Honma Beres BE-08 Black AQ MX golf clubs worth $4,420.\nAround the same time, June 2022, he is also said to have obtained a Brompton T Line bicycle worth $7,907.50.\nAround July 2022, he is said to have obtained two bottles of M&H Elements Sherry Cask whisky worth $198 in total.", "url": "https://www.straitstimes.com/multimedia/graphics/2024/03/iswaran-8-charges/index.html?shell"}