{"authors": [], "date_download": "2024-10-12 13:27:34", "date_modify": "2024-10-12 13:27:34", "date_publish": "2024-03-17 00:00:00", "description": "Dr Ong Pang Yeow owns more than 2,500 pieces of Singapore Airlines memorabilia in his house in Kent Ridge. He inherited the collection from his father, who was a former employee of the airline, and it continued growing after his father’s death in 2020.", "filename": "multimedia_graphics_2024_07_54f761012bdc592fd8a955fd16d67165_index.html_shell_1728739654.html", "image_url": "https://www.straitstimes.com/multimedia/graphics/assets/facebook_images/2024/07/sia-memorabilia-collector-singapore/sia-memorabilia-collector-singapore.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/multimedia_graphics_2024_07_54f761012bdc592fd8a955fd16d67165_index.html_shell_1728739654.html", "title": "The accidental collector:", "title_page": "The accidental collector: A peek into the history of SIA in a three-storey home", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The accidental collector:\nA peek into the history of SIA in a three‑storey home\nDr Ong Pang Yeow owns more than 2,500 pieces of Singapore Airlines (SIA) memorabilia in his three-storey house in Kent Ridge.\nSCROLL DOWN\nHis house is a great way to fly – down memory lane, that is.\nStep into the three-storey abode in Kent Ridge, and one is greeted by a treasure trove of memorabilia from SIA.\nNumbering more than 2,500, the items, ranging from soft toys to model airplanes, are displayed in cabinets around the house.\nThey are the property of avid collector Ong Pang Yeow, 52, whose late father was a former employee of SIA.\nThe pride of his collection?\nA plaque that took him 20 years to find.\nThe commemorative item was given to the first passengers to fly SIA after its split from Malaysia-Singapore Airlines (MSA) on Oct 1, 1972. He first saw it in Outlook – an internal newsletter for SIA employees – some 20 years ago.\nAfter years of searching for it online, he eventually found the plaque on eBay Australia in 2022. He bid successfully for it for less than $100 and had a friend help ship it back to Singapore.\n“I was amazed that I could even get hold of it because I’d never seen it for sale before,” said Dr Ong, a former physician who is now the director of a global pharmaceutical company.\nAside from commemorative items, he also owns items such as mugs, toiletries bags, coasters, files, paperweights and eyeshades that he uses regularly.\n“A memorable item that I’ve kept would be an SIA cup that I used every morning from Primary 3 till Primary 6,” he said, pointing to a crack that was visible on the handle of the porcelain cup.\nDr Ong, who proudly noted that he was born in the same year as SIA, has accumulated his fair share of keepsakes since his teenage days.\nOther treasured items include sliding puzzles that he received on a plane as a child, which his mother still plays with today, and a pair of teddy bears given by his father’s colleague when Dr Ong and his father visited Bangkok together in the 2000s. He said they remind him of happy times with his father on that trip.\nMenus presented to passengers on board the carrier are also part of his collection.\nOne of the dishes featured on the menus – stir-fried prawns in preserved bean curd sauce – was created by a restaurant in Shanghai. Dr Ong tried it while on a business class flight from Taipei to Singapore in 2017 and liked it so much that he and father recreated it at home.\nIt is now a staple of family meals.\nHis late father, Mr Ong Whee Kiat, joined the airline in 1965, when it was known as Malaysian Airways.\nIn 1966, Malaysian Airways was renamed MSA. When MSA later split into two airlines, Malaysian Airline System and SIA in 1972, Mr Ong remained with the latter till his retirement.\nThe late Mr Ong frequently bought tableware and plane models at discounted prices for his family at staff sales.\nHe also kept old soft toys, a portable clock, cufflinks and keychains from the airline.\nDr Ong, who lives with his mother and a helper, inherited the collection and continued growing it after his father’s death in May 2020. He has a younger sister.\n“I was clearing my father’s stuff after his death and each time I tidied the house, I would find SIA items from the 70s and 80s that I never knew existed in our home,” said Dr Ong. It felt like a treasure hunt.\nToday, he continues to look out for things to add to the collection.\nOne of his recent acquisitions is a $350 plaque – the most expensive item he has bought thus far – which was given to passengers on the first non-stop flight from New York to Singapore in 2004. This was to complement the celebratory pewters he already owned for the first flight from Singapore to the US in 1979, the first flight from Singapore to New York and the first flight from New York to Singapore in 1992.\nTo overcome his grief for his father’s death, Dr Ong started an Instagram account, singapore21a, in October 2020 to document the collection in his home. The account has since amassed more than 2,000 followers.\n“I did not grow up obsessing over SIA items,” said Dr Ong.\n“But when we started putting together the knick-knacks that were collected over the years after my father’s death, I thought, ‘Since we have all these nice things, why not showcase them?’”\nBut before his love for SIA took root in his heart, Dr Ong’s interest in aviation stemmed from collecting plane models while working as a doctor in his younger days.\nAs he had been unable to travel much then, he turned to building a model of Changi Airport.\nHe painted its runway and taxiway, and populated it with buildings, accessories and die-cast aircraft models of the major airlines flying into Singapore. The model was at 1:500 scale and occupied a 2.5m-long table.\n“But when I changed my job to regional and later global roles and was given the opportunity to travel more often for work, things started to get more interesting, and I was able to feel reconnected to the airline,” he said. “The airline feels like home once you’re on board the plane even if I was in a foreign country.”\nDr Ong’s fascination with SIA has earned him new friendships with like-minded collectors such as Mr Jason Lin, a secondary school teacher in Taiwan.\nMr Lin, 50, told The Straits Times that he got to know Dr Ong through Instagram in 2020 and the pair met for the first time in Singapore in July 2023, when he was invited to Dr Ong’s home to see his collection. They met again in April and walked Henderson Waves together.\n“Dr Ong and I also exchanged items such as aircraft models and inaugural flight gifts that each of us did not have before the meeting,” said Mr Lin, who owns more than 700 SIA items, including plane models, postcards, toys and playing cards.\n“Beyond our hobbies, I’m grateful for the friendship I share with Dr Ong and the mutual support and appreciation we have towards each other. I’m glad I found a true friend in him.”\nWhen asked what SIA item he dreams of owning some day, Dr Ong said it would be a 1:36 scale cutaway B747-400 model aeroplane about the size of a two-seater sofa. Such cutaway models are usually imported from Europe. He missed a chance to buy it from a local seller, who sold it for about $3,000.\n“It’s too cumbersome to ship this from Europe, as it will probably break by the time it reaches Singapore,” he said.\n“But I do hope to visit the SIA Training Centre in Upper Changi Road East one day to see the collection of items they have and appreciate what goes on behind the scenes, as I had not had the chance to do so in the past.”\nProduced by:\nElaine Lee\nJovin Liew\nLee Pei Jie\nMarisa Yeo\nNeo Xiaobin\nSharon Loh\nShintaro Tay\nTrixia Ferguson\nMain photographs by:\nShintaro Tay", "url": "https://www.straitstimes.com/multimedia/graphics/2024/07/sia-memorabilia-collector-singapore/index.html?shell"}