{"authors": ["KRIST BOO", "Joelyn Tan", "Ng Min Min", "Sandy Ng"], "date_download": "2024-10-12 13:53:32", "date_modify": "2024-10-12 13:53:32", "date_publish": null, "description": "It is their turn to be the leaders at the workplace, but no matter how hard they paddle, there seems no end to the race, and no end to making more money.", "filename": "multimedia_graphics_2023_10_1f6950197806fd8fcde13010aadf25d3_index.html_shell_1728741212.html", "image_url": "https://www.straitstimes.com/multimedia/graphics/assets/facebook_images/2023/10/sg-millennials-feelings-about-work/sg-millennials-feelings-about-work.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/multimedia_graphics_2023_10_1f6950197806fd8fcde13010aadf25d3_index.html_shell_1728741212.html", "title": "Mood: How Singapore millennials feel about work", "title_page": "Mood: How Singapore millennials feel about work | The Straits Times | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "We are expected to be hungry in our careers but at the same time, we are labelled as the strawberry generation.\nWe are expected to be caregivers for our parents, as well as young children. We are expected to have some sort of online presence, to be influencers, to be thought leaders. So there are many things that we have to give attention to.\nWe are in between two generations, a bridge between two pretty mismatched sets of expectations.\nWhat defines success? Would it mean that you have more time to play golf? Does it mean that you live in a condo, you have the five Cs, which is what the previous generation was touting? That’s the older generation benchmark of success.\nFor me, it's a mix of both time and the different opportunities that I get to experience. Being part of corporate work, giving back to society, or helping the next generation become more knowledgeable.", "url": "https://www.straitstimes.com/multimedia/graphics/2023/10/sg-millennials-feelings-about-work/index.html?shell"}