{"authors": [], "date_download": "2024-10-12 13:27:46", "date_modify": "2024-10-12 13:27:46", "date_publish": "2024-04-17 00:00:00", "description": "Going cuckoo over clocks? This retired teacher has painstakingly collected and maintained about 200 clocks from dealers, auction houses and online sellers.", "filename": "multimedia_graphics_2024_04_clock-collector-singapore_index.html_shell_1728739666.html", "image_url": "https://www.straitstimes.com/multimedia/graphics/assets/facebook_images/2024/04/clock-collector-singapore/clock-collector-singapore.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/multimedia_graphics_2024_04_clock-collector-singapore_index.html_shell_1728739666.html", "title": "Keeping time: One man and his passion for vintage and antique clocks", "title_page": "Keeping time: One man and his passion for vintage and antique clocks", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Going cuckoo over clocks? This retired teacher regularly winds his collection of 200 mechanical clocks, including a timepiece from one of Asia’s finest hotels at the turn of the century.\nSCROLL DOWN\nFor more than four decades, Mr Mun Chor Weng has kept a clock thought to have decorated one of Asia’s finest hotels at the turn of the 20th century.\nAt the crack of dawn every Sunday, the 83-year-old collector religiously winds the timepiece that once belonged to the Europe Hotel, a palatial edifice that had overlooked the Padang.\n“The moment I wake up, between 6.30am and 7am, I wind the clock,” he said.\nThe habit – once common in an era before clocks were powered by batteries – dates back to Mr Mun’s years as a teenager helping out in his father’s clock shop, where he would wind dozens of mechanical clocks on Sunday to show that they were in working condition.\nUnlike their battery-powered counterparts, mechanical clocks have to be wound consistently, as they run on energy stored in their springs.\nThe timepiece, crafted by British clockmaker H. Williamson in 1910, hangs next to Mr Mun’s bed. It is one of his most prized possessions in his 200-strong collection of mechanical clocks.\nThe retired teacher said: “Because of its size, the clock is likely to have been displayed in the hallways of the hotel, which was once as famous as Raffles Hotel and was even featured in a short story by acclaimed writer Somerset Maugham.”\nThe hotel ran into financial troubles in the late 1920s. Its assets were sold off, and it was demolished in 1934. The site is now occupied by the former Supreme Court building.\nHis late father, Mr Mun Sah, had a friend who bought the clock. It was later acquired by the older Mr Mun, a clock dealer, who liked the timepiece so much that he traded one of his clocks to get his hands on it, his son recalled.\nMr Mun Sah, who died at the age of 92 in 1992, came to Singapore when he was 12 years old. Like thousands of Chinese immigrants in the 19th and 20th centuries, he came in search of a better life.\nBy the late 1940s, he had earned enough money through odd jobs and as a clock dealer’s apprentice to start his own shop near Newton Circus.\nThe shophouse was also where the family lived. They made ends meet not just by selling clocks, but also peddling drinks from a soda fountain.\nWith the aim of continuing the family business, Mr Mun, the youngest of three brothers, learnt how to repair clocks.\nBut when the Victoria School student received a government teaching bursary in 1960 to study science at the then University of Singapore, he exchanged clock repairing for a career in education. At New Town Secondary School, where he taught biology, he met his wife, Madam Tan Ling Cheng, a Chinese language teacher.\nMr Mun said: “My father did not object to my wish to study in the local university, as it was not easy during the 1960s for working-class children to do so.\n“He had no plan to pass the business to anyone else, and the shophouse was eventually acquired by the Government and demolished.”\nIt was only in 1976 that Mr Mun’s passion for clocks was revived, when a schoolmate handed him a wedding gift to fix – a 400-day clock that had been deemed irreparable.\nThe clock, also known as a torsion pendulum clock, was named for its ability to run for about 400 days.\nHe said: “It was probably given to me because no clock repairers at the time wanted to bother with these timepieces, which were usually regarded as novelty clocks.”\n“This seemed like a great opportunity to test my skills.”\nOn his first try, the clock ticked for about half an hour before it stopped.\nInstead of being deterred, he was determined not to be beaten, tinkering with every part of the clock until it sprang back to life.\n“That experience gave me a sense of accomplishment and taught me a valuable lesson: The world of clocks is a constant voyage of discovery, as each clock presents its own unique set of puzzles waiting to be solved,” he said.\nWord soon spread among dealers with a similar enthusiasm for 400-day clocks, who began contacting Mr Mun whenever they chanced upon interesting and rare pieces.\nIT’S ABOUT TIME\nAs he bought horological books and magazines, his interest and knowledge in clocks grew.\nBy striking deals with overseas dealers over the phone and through mail, Mr Mun expanded the range of his collection.\nThis included French table clocks, German-made Vienna regulators and marine chronometers, which helped to pinpoint ships’ locations at sea.\nMr Mun said: “Once you’re bitten by a collecting bug, the condition becomes like a terminal disease, it can only get more serious as time goes on.\n“So one thing led to another, and before I realised it, I had about 200 (clocks).”\nThese now occupy nearly every wall of his two-storey semi-detached house in Bukit Timah, where he has lived since 1989.\nThe clocks have become such an important part of him that when the family moved into the house before the clocks were brought over, it felt weirdly foreign.\nHe said: “It was unusually quiet without the ticking sound of the striking clocks.\n“I felt more at ease when I brought my clocks in.”\nIn the living room, visitors are greeted by a golden timepiece embellished with the Chinese mythical creature qilin and other Chinese motifs.\nThe 19th-century creation by French clockmaker A.D. Mougin is an indication of how the European product had a market in China.\nEncased in a clear plastic box, the 40kg clock was purchased by Mr Mun in the late 1980s from a dealer in Britain for a few thousand dollars.\nThe walls by the stairs leading up to the second floor of his house are lined with pendulum clocks, including the Vienna regulator, a wooden antique whose resonant chime once told the time to owners of European mansions.\nStill, Mr Mun retains a soft spot for 400-day clocks, which have their own cupboards on both floors of his house.\nThe 83-year-old bought the carpark sign of the first clock company to mass produce 400-day clocks, Jahresuhrenfabrik.\nThe factory in Germany was one of the victims of the quartz revolution, when more accurate and affordable quartz clocks supplanted mechanical ones. It went bankrupt in 1986 and has since been demolished.\nMr Mun said: “Being a 400-day clock collector, I like to own a piece of 400-day clock history.”\nNearly half a century after discovering these clocks, his painstaking research into clocks and how to repair them, especially 400-day strikers, has led him to write many articles in publications on clocks.\nHe is one of the founding members of the International 400-Day Clock Chapter 168 with the US-based National Association of Watch and Clock Collectors for enthusiasts committed to preserving the art form.\nHis family is supportive of his passion, which has become part of their home.\nHis three adult children will inherit the collection, which includes many rare and historically significant pieces.\nMadam Tan, who will be married to Mr Mun for 50 years in November, quipped: “It’s good that he’s interested in old things rather than sweet young things.”\nProduced by:\nAileen Teo\nAndrea Wong\nAng Qing\nAng Kai Yan\nGin Tay\nJananee Yegambaram\nKimberly Jow\nLee Pei Jie\nLeonard Lai\nNeo Xiaobin\nSharon Loh\nMain photographs by:\nGin Tay", "url": "https://www.straitstimes.com/multimedia/graphics/2024/04/clock-collector-singapore/index.html?shell"}