{"authors": [], "date_download": "2024-10-12 14:16:41", "date_modify": "2024-10-12 14:16:41", "date_publish": "2023-10-23 08:46:47", "description": "FIA had reported them to stewards after their cars failed post-race checks on the under-floor wooden planks. Read more at straitstimes.com.", "filename": "sport_formula-one_hamilton-and-leclerc-disqualified-from-us-grand-prix_1728742601.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/23/2023-10-22T223741Z296070384MT1USATODAY21712814RTRMADP3FORMULA-ONE-FORMULA-1-UNITED-STATES-GRAND-PRIX.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_hamilton-and-leclerc-disqualified-from-us-grand-prix_1728742601.html", "title": "Lewis Hamilton and Charles Leclerc disqualified from US Grand Prix", "title_page": "Lewis Hamilton and Charles Leclerc disqualified from US Grand Prix | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AUSTIN – Mercedes accepted their punishment after Formula One stewards disqualified Lewis Hamilton from second place in Sunday’s United States Grand Prix along with sixth-placed Ferrari driver Charles Leclerc.\nThe governing body FIA had reported both drivers to stewards after their cars failed post-race checks on the under-floor wooden planks at Austin’s Circuit of the Americas. Stewards imposed the standard penalty after both teams acknowledged the measurements carried out were correct.\nMercedes had stated that the high wear on the skid pads was probably due to the bumpy track and the race being run to a sprint format for the first time.\nThat meant a 100km race on Saturday and only one practice session instead of the usual three.\n“Set-up choices on a sprint weekend are always a challenge with just one hour of free practice, and even more so at a bumpy circuit like (Circuit of the Americas) and running a new package,” said Mercedes principal Toto Wolff.\n“In the end, all of that doesn’t matter. Others got it right where we got it wrong and there’s no wiggle room in the rules.\n“We need to take it on the chin, do the learning and come back stronger next weekend.”\nFerrari’s sporting director Diego Ioverno also alluded to the bumpy track and only one practice session, saying there was “very little time” to prepare the car.\nThe race was won by Red Bull’s Max Verstappen, the 50th victory of the three-time world champion’s career and record-equalling 15th of the season.\nMercedes had brought an upgraded car to Texas and Hamilton, whose teammate George Russell moved up to fifth, had looked more competitive.\n“We can take a lot of positives from the car performance today,” added Wolff. “This is a circuit where only a few races ago we wouldn’t have performed well because of the fast, sweeping corners. The upgrade seems to have made the car happier in those areas and it is working well.”\nThe disqualifications meant McLaren’s Lando Norris, in his 100th grand prix, was promoted to second, while Leclerc’s teammate Carlos Sainz moved up to third.\nVerstappen, who started sixth on the grid, completed a hat-trick of Texan victories as he worked his way through the field to take control before he came home 2.225 seconds ahead of Hamilton.\nThe Dutchman, who won his third straight title last time out in the sprint at Qatar, said: “Starting from sixth position made things a little more difficult.\n“Fifty wins is incredible and to do it here I am very proud. Now we keep on pushing for more.”\nVerstappen’s runaway lead in the drivers’ championship now stands at 226 points ahead of teammate Sergio Perez (240).\nMeanwhile, Williams rookie Logan Sargeant celebrated a surprise first point in Formula One, thanks to the disqualifications of Hamilton and Leclerc, and ended a 30-year wait for an American driver to score.\nHe was classified 10th, and the 22-year-old Florida native became the first US driver to score in a grand prix since Michael Andretti with McLaren in 1993.\n“It’s amazing to score my first point in F1 on home turf after the challenging weekend I’ve had,” said the Williams youngster, who failed to finish the previous race in Qatar after suffering exhaustion in the heat.\n“I’m so proud of this team and myself for the hard work and progress we’ve been making this season. We worked hard overnight to find a direction with the car that was going to be positive, and we found that... The pace was so much better today, and I was driving really well.”\nWilliams also had Alex Albon finish in ninth place, with the team having two drivers in the top 10 for the first time since the 2021 Hungarian Grand Prix. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/formula-one/hamilton-and-leclerc-disqualified-from-us-grand-prix"}