{"authors": [], "date_download": "2024-10-12 13:42:06", "date_modify": "2024-10-12 13:42:06", "date_publish": "2024-08-13 13:13:13", "description": "England will be monitoring the status of Chris Woakes ahead of the three-test series against Sri Lanka after the all-rounder withdrew from The Hundred due to injury, the news coming after captain Ben Stokes had to be helped off the pitch on Sunday. Read more at straitstimes.com.", "filename": "sport_woakes-another-england-injury-worry-after-pulling-out-of-the-hundred_1728740526.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/13/ST-logo-placeholder_37.jpg?VersionId=bNeccrkt_Ew.YnqbU2dXAEfrBh4Vo5SD", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_woakes-another-england-injury-worry-after-pulling-out-of-the-hundred_1728740526.html", "title": "Woakes another England injury worry after pulling out of The Hundred", "title_page": "Woakes another England injury worry after pulling out of The Hundred | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "England will be monitoring the status of Chris Woakes ahead of the three-test series against Sri Lanka after the all-rounder withdrew from The Hundred due to injury, the news coming after captain Ben Stokes had to be helped off the pitch on Sunday.\nWoakes, 35, has been named in England's test squad and was also set to play in the remaining two group stage matches for Birmingham Phoenix in the 100-ball tournament.\nTest skipper Stokes suffered a suspected hamstring injury while playing in the 100-ball tournament and is doubtful for the opener against Sri Lanka on Aug. 21 at Old Trafford.\n\"Chris Woakes has withdrawn from the competition with injury. The England bowling all-rounder will no longer be a part of this year’s competition,\" Birmingham Phoenix said on Instagram late on Monday.\nEngland's squad depth would be tested if they lose both all-rounders for the Sri Lanka series. REUTERS", "url": "https://www.straitstimes.com/sport/woakes-another-england-injury-worry-after-pulling-out-of-the-hundred"}