{"authors": ["Jonathan Wong"], "date_download": "2024-10-12 14:17:08", "date_modify": "2024-10-12 14:17:08", "date_publish": "2023-09-17 21:51:09", "description": "His win ended Red Bull’s unbeaten streak this season but Verstappen extends lead over Perez despite fifth place. Read more at straitstimes.com.", "filename": "sport_formula-one_carlos-sainz-wins-singapore-grand-prix_1728742628.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/17/photo2023-09-1722-19-02.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_carlos-sainz-wins-singapore-grand-prix_1728742628.html", "title": "Ferrari’s Carlos Sainz ‘over the moon’ after winning Singapore Grand Prix for second race victory", "title_page": "Ferrari’s Carlos Sainz ‘over the moon’ after winning Singapore Grand Prix for second race victory | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Amid the sea of bodies in scarlet red jumpsuits, Carlos Sainz almost disappeared. However, that triumphant roar was unmistakeable. After all, the Ferrari speedster had just done the impossible.\nNot only did he win the Formula One Singapore Airlines Singapore Grand Prix on Sunday night, but Sainz also ended Red Bull’s unbeaten streak this season.\nThe Spaniard, 29, started on pole and, despite pressure from the chasing pack, held on for his second career victory after the 2022 British Grand Prix.\nHe took the chequered flag at the Marina Bay Street Circuit after 1hr 46min 37.418sec, finishing 0.812sec ahead of McLaren’s Lando Norris, with Lewis Hamilton of Mercedes barely half a second further back.\nIt is the ninth time in 14 editions of the night race that the driver on pole has gone on to win. Sainz, who finished an impressive third two weeks ago in Monza, said: “An incredible feeling, an incredible weekend.\n“I want to thank everyone in Ferrari for a huge effort to turn things round, we did everything right. It was all about knowing our limitations managing the race, making sure I made it to target lap (for pitting).\n“It was all about keeping our limitations with tyre wear and degradation, and all about managing the stints to make sure I made it to the target laps we wanted to do in each compound. Obviously a safety car caused us to pit even earlier than we wanted and I knew it was going to be a long stint on hard.\n“I felt under control to be honest, I always felt like I had the head space and the pace in hand to do whatever I wanted to do. I’m not going to lie, you are under pressure obviously, you are very close to making any kind of mistake but I felt under control and that I could manage well. We brought it home and that’s the best feeling, I’m over the moon right now.”\nHamilton was gracious in defeat, praising the strategy of Sainz and Norris. He added: “We rolled the dice this weekend, we went with a different amount of tyres into qualifying with the option to be able to do what we’ve done today.\n“But the team did an amazing job today to get us back up there, it’s a bit of a shame the first corner (where he overan the turn) but nonethless I just kept my head down and kept pushing.\n“Of course it’s unfortunate for George, we were pushing so hard to catch these guys and our tyres were so hot but we will bounce back, he’s been phenomenal all weekend.”", "url": "https://www.straitstimes.com/sport/formula-one/carlos-sainz-wins-singapore-grand-prix"}