{"authors": [], "date_download": "2024-10-12 14:01:13", "date_modify": "2024-10-12 14:01:13", "date_publish": "2024-07-28 00:41:47", "description": "PARIS - Matthew Ebden had not expected to last long against Novak Djokovic in the first round of the Olympics on Saturday and he was not wrong - but it left the Serbian wondering why the Australian doubles specialist was competing in the singles. Read more at straitstimes.com.", "filename": "sport_tennis_unamused-djokovic-questions-olympic-eligibility-rules-after-53-minute-romp_1728741673.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/28/LYNXMPEK6Q079-1.jpg?VersionId=UPZUnPC605aecAc1FMAiL5TIQLP_tgJT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_unamused-djokovic-questions-olympic-eligibility-rules-after-53-minute-romp_1728741673.html", "title": "Tennis-Unamused Djokovic questions Olympic eligibility rules after 53-minute romp", "title_page": "Tennis-Unamused Djokovic questions Olympic eligibility rules after 53-minute romp | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Matthew Ebden had not expected to last long against Novak Djokovic in the first round of the Olympics on Saturday and he was not wrong - but it left the Serbian wondering why the Australian doubles specialist was competing in the singles.\nThe 36-year-old Ebden was routed 6-0 6-1 by the top seed in 53 minutes and jokingly offered his racket to a fan inside Court Phillipe Chatrier after losing the first eight games.\nHe then earned the biggest cheer of the match when he celebrated winning a game at 4-0 down in the second set.\nThree-time Grand Slam doubles champion Ebden, who will be a doubles medal contender in Paris alongside John Peers, was only placed in the singles draw after a raft of leading singles players pulled out due to illness or injury, including world number one Jannik Sinner.\nEbden posted a humorous message on Instagram after Thursday's draw pitted him against the 24-time Grand Slam champion for the first time in his career. But the 37-year-old Djokovic questioned why he faced a player who had not played a top-level singles match for two years.\n\"There were a lot of singles players that had plenty of time, there were alternates, that could have been told to come,\" Djokovic, bidding for his first Olympic title, told reporters.\n\"So this part I don't get and I really hope that the (tennis governing body) ITF along with the Olympics will consider changing this rule because it's tough on Matthew.\n\"He told me it's been over two years (since) he played an official singles match and he said this was his last singles match, he's officially retired. So as I said, it's not a great feeling for him being on the court like that.\"\nThe International Tennis Federation had negotiated with the International Olympic Committee to extend the deadline for changes to its entry lists until July 19 -- later than most other sports in the Games.\nBut with top seed Sinner, Andy Murray and Holger Rune all pulling out of the singles, the options for replacements was limited to doubles specialists already in Paris.\n\"Tennis is one of 32 sports at the Olympic Games, and with 10,500 athletes and 206 National Olympic Committees, it's logistically extremely difficult, and there has to be a cut-off point for off-site replacements,\" an ITF spokesperson said.\nSpanish second seed Carlos Alcaraz, who also faced an easy opener against Lebanese alternate 275th-ranked Hady Habib, was also left questioning why Ebden was playing singles.\n\"I think it should be different, because if the next single player decides to be here, if someone withdraws from the tournament, the rules are the rules, we have to follow it,\" the 21-year-old French Open and Wimbledon champion said.\n\"But it's a shame that (Matteo) Berrettini couldn't play here.\"\nItalian former Wimbledon runner-up Berrettini was below the ranking cut off for entry into the singles on June 10. (This story has been refiled to add the dropped word 'champion' in paragraph 13) REUTERS", "url": "https://www.straitstimes.com/sport/tennis/unamused-djokovic-questions-olympic-eligibility-rules-after-53-minute-romp"}