{"authors": [], "date_download": "2024-10-12 14:11:58", "date_modify": "2024-10-12 14:11:58", "date_publish": "2024-05-10 03:14:06", "description": "Patrick Beverley forcefully threw a basketball multiple times at spectators. Read more at straitstimes.com.", "filename": "sport_basketball_nba-bans-bucks-guard-beverley-four-games-for-tossing-balls-at-fans_1728742318.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/10/FILES-BASKET-NABA-BUCKS-BEVERLEY-185846.jpg?VersionId=I3BKQqGpdBA3I0HhR4gFwp6TJ2sAM.Dv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_nba-bans-bucks-guard-beverley-four-games-for-tossing-balls-at-fans_1728742318.html", "title": "NBA bans Bucks guard Beverley four games for tossing balls at fans", "title_page": "NBA bans Bucks guard Beverley four games for tossing balls at fans | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Milwaukee Bucks guard Patrick Beverley was suspended four games without pay by the NBA on May 9 for forcefully throwing a basketball multiple times at spectators, the league announced.\nBeverley’s actions came during and just after Milwaukee’s 120-98 loss to Indiana on May 2 at Indianapolis, which gave the Pacers a 4-2 victory over the Bucks in their best-of-seven Eastern Conference first-round playoff series.\nThe ban would come at the start of the 2024-25 campaign for Beverley.\nHe was also punished for what the league called an “inappropriate interaction with a reporter” after the contest. Beverley rejected answering a reporter’s question for not subscribing to his podcast.\nIn the fourth quarter, Beverley twice hurled basketballs and Pacers supporters seated behind the Milwaukee bench.\nBeverley said the Bucks had asked for help earlier in dealing with hecklers and added that the comments directed at Milwaukee players involved more than a reported, “Cancun on three,” remark when the team was preparing to exit a huddle late in the blowout loss.\nOn his podcast, Beverley called it “an unfortunate situation that never should have happened” and added, “I have to be better and I will be better.”", "url": "https://www.straitstimes.com/sport/basketball/nba-bans-bucks-guard-beverley-four-games-for-tossing-balls-at-fans"}