{"authors": [], "date_download": "2024-10-12 13:59:59", "date_modify": "2024-10-12 13:59:59", "date_publish": "2023-12-09 03:45:54", "description": "The country was a sporting outcast for having implemented a state-sponsored doping programme. Read more at straitstimes.com.", "filename": "sport_doping-russian-athletes-back-in-doping-spotlight-after-paris-green-light_1728741599.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/09/LYNXMPEJB70PU-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_doping-russian-athletes-back-in-doping-spotlight-after-paris-green-light_1728741599.html", "title": "Russian athletes back in doping spotlight after Paris green light", "title_page": "Russian athletes back in doping spotlight after Paris green light | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MONTREAL – The doping spotlight is once again on Russia, after the International Olympic Committee (IOC) on Dec 8 cleared the way for the country's athletes to compete at the 2024 Paris Games as neutrals.\nRussians and Belarusians had initially been banned from competing internationally following Russia’s invasion of Ukraine in 2022, for which Belarus has been used as a staging ground.\nIn March, however, the IOC issued a first set of recommendations for international sports federations to allow Russian and Belarusian competitors to return and they have since done so in most events.\nOut of 4,600 athletes globally who have qualified for the July 26-Aug 11 Paris Olympics, eight are Russians and three hold Belarusian passports.\nLong before Russia’s invasion of Ukraine, the country was already a sporting outcast for having implemented a state-sponsored doping programme that resulted in bans from competitions, including the Olympics.\nThe Russian Anti-Doping Agency (Rusada) remains non-compliant, raising new concerns about the testing of Russian athletes ahead of Paris.\nIn challenging conditions, the World Anti-Doping Agency (Wada) said more than 10,500 samples from Russian athletes had been collected in 2023, most of those in out-of-competition tests.\n“Despite this and given the history, Wada remains sceptical and wary when it comes to Russia,” it said.\n“We must remain vigilant and ensure that no stone is left unturned when it comes to ensuring that all the proper testing has taken place in advance of Paris.\n“We encourage anti-doping organisations to implement a biological passport for all athletes from Russia that may potentially compete in Paris as neutrals.”\nWith no accredited laboratory in Russia, samples – both blood and urine – are transported with a strict chain of custody to Wada-approved laboratories outside the country.\nAny Russian athlete competing must provide proof of testing through a biological passport.\nUnited States Olympic & Paralympic Committee chair Gene Sykes said he had discussed the situation with both Wada and the International Testing Agency (ITA), and expressed cautious confidence that American athletes would compete on level-playing fields against Russian participants.\n“Wada and the ITA were both at the Olympic Summit and spoke very directly about exactly what they know about testing of all Russian athletes,” Sykes said on Dec 7. “That report was very thorough.\n“An athlete biological passport is a concept that is well understood and requires more work, more evidence.\n“In order to get to that point, once the athletes are identified, then there needs to be a lot of work done to make the entire system confident that the athletes are fully compliant.”\nREUTERS", "url": "https://www.straitstimes.com/sport/doping-russian-athletes-back-in-doping-spotlight-after-paris-green-light"}