{"authors": ["Deepanraj Ganesan"], "date_download": "2024-10-12 14:12:50", "date_modify": "2024-10-12 14:12:50", "date_publish": "2024-02-08 19:01:40", "description": "With five months to the Paris Games, none of the Republic's shooters has qualified for the event. Read more at straitstimes.com.", "filename": "sport_back-on-target-singapore-shooting-chief-confident-that-athletes-can-secure-an-olympic-spot_1728742370.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/08/junliang-rbshoot21-Teh20Xiu20Hong-Shooter-00004.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_back-on-target-singapore-shooting-chief-confident-that-athletes-can-secure-an-olympic-spot_1728742370.html", "title": "Back on target, Singapore shooting chief confident that athletes can secure an Olympic spot", "title_page": "Back on target, Singapore shooting chief confident that athletes can secure an Olympic spot | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Not since the 1984 Los Angeles Olympics have Singapore’s shooters missed out on sport’s biggest and most prestigious event.\nIt is a scenario that Singapore Shooting Association (SSA) president Michael Vaz wants to avoid for the Paris 2024 Games – though with the event just five months away, none of the Republic’s athletes has sealed an Olympic shooting berth.\nBut he is not sweating yet, as he is confident that Singapore’s flag will be flying at the Chateauroux Shooting Centre in July.\nVaz, who has been president since 2013, said: “We are confident of having at least one (quota) spot at the Olympics. There is one more qualifier and we have focused on our shooters obtaining world ranking points through the various World Cups and competitions that they have entered during this qualifying campaign.\n“So let’s see, I am hopeful that we will be represented in Paris.”\nA total of 170 men and 170 women will compete across 15 shooting events in the Olympics. Qualification began in August 2023 and ends on June 9, with 312 quota spots available through designated International Shooting Sport Federation (ISSF) championships. There are also 16 wildcard slots and the remaining berths will be determined by qualification rankings.\nAt the Asian Rifle/Pistol Championships on Jan 11, Teh Xiu Hong narrowly missed out on an Olympic quota spot after finishing sixth in the women’s 25m pistol final, while teammate Teo Shun Xie was seventh. Chinese Taipei’s Wu Chia-ying, who finished fifth, qualified as some of the medallists had already secured their places in Paris at previous events.\nThe Singaporeans will get one last competition to earn their tickets to Paris at the Rifle and Pistol ISSF Olympic Qualification Championship in Rio de Janeiro, Brazil, from April 11 to 19.\nIf they miss out in Rio, they could still qualify via the Olympics qualification rankings. Teo is currently world No. 10 in the 25m pistol, while Teh is 13th and 24th in the 25m and 10m air pistol events respectively.\nIn the women’s 10m air rifle, Fernel Tan is ranked 20th.\nTeh, 29, said: “I have been working hard to get to the Olympics and getting a quota will be a reward for my journey so far. Every athlete wants to be among the best and the top shooters will be at the Olympics and I want to be one of them.”\nWhile Tan wants to follow in the footsteps of her elder sister Adele Tan – who competed in Tokyo – she is mindful not to let the pressure affect her love for the sport.\nOver the past two years, the 21-year-old, who won an Asian Championships air rifle team silver last October, has been on a gruelling competition schedule in a bid to qualify for the Olympics.\nShe said: “The pressure has been intense for a while now so it is important for me to reflect and enjoy the process even as we are in the Olympics qualification window. The selections for the various competitions and the competitions we have been to have been back-to-back with almost no break in between.\n“So I have to keep going and keep giving my best (to achieve qualification) but also enjoy the sport more while I am at it.”", "url": "https://www.straitstimes.com/sport/back-on-target-singapore-shooting-chief-confident-that-athletes-can-secure-an-olympic-spot"}