{"authors": [], "date_download": "2024-10-12 13:44:00", "date_modify": "2024-10-12 13:44:00", "date_publish": "2024-06-22 02:06:24", "description": "Gernot Trauner, Christian Baumgartner and Marko Arnautovic all get on the scoresheet. Read more at straitstimes.com.", "filename": "sport_football_austria-ease-past-poland-3-1-to-renew-knockout-stage-hopes_1728740640.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/22/FBL-EURO-2024-MATCH19-POL-AUT-182051.jpg?VersionId=HEhebyDzL3ICeR1R4zemwjOLViJ7f8sf", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_austria-ease-past-poland-3-1-to-renew-knockout-stage-hopes_1728740640.html", "title": "Austria ease past Poland 3-1 to renew Euro knockout stage hopes", "title_page": "Austria ease past Poland 3-1 to renew Euro knockout stage hopes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - A superb second-half performance by Austria kick-started their hopes of making the Euro 2024 knockout stage with a 3-1 win over Poland on June 21, with Gernot Trauner, Christian Baumgartner and Marko Arnautovic all getting on the scoresheet.\nThe Austrians, who lost to France in their opener, survived a spirited first-half comeback in which Poland equalised and came close to taking the lead before the wheels came off in the second half as they slumped to a second loss in the tournament.\nUndeterred by news that record scorer Robert Lewandowski was still not fit to start, Polish fans lit a handful of flares as they belted out the national anthem, with a cloud of smoke wafting towards the goal Austria defended in the first half.\nThat was about as close as the Poles got in the opening exchanges, with Austria dominating possession through repeated attacks up the left flank and going ahead in the ninth minute.\nPhilipp Mwene's long throws were a threat from the start and Austria's goal came when one of them was headed back into his path, allowing the left back to cross for Trauner to score with a bullet header into the top corner after nine minutes.\nHowever, Poland levelled on the half-hour mark as Austria failed to clear a corner satisfactorily and when Trauner blocked a shot from Jan Bednarek, the ball fell kindly for Krsysztof Piatek to control and then steer into the net.\nAustria goalkeeper Patrick Pentz had to pull off a superb one-handed save in first-half stoppage time and when Lewandowski finally entered the fray on the hour Polish hopes rose, only to be quickly dashed.\nAustria's second goal in the 66th was beautiful in its simplicity as they switched play from right to left before Alexander Prass picked out Baumgartner with a pinpoint pass and the midfielder's cool finish gave Wojciech Szczesny no chance.\nWhen Marcel Sabitzer then tore through the middle, Szczesny had no choice to bring him down and Marko Arnautovic drilled the resulting spot kick low to the keeper's left to make it 3-1 after 78 minutes and leave the Poles with a mountain to climb.", "url": "https://www.straitstimes.com/sport/football/austria-ease-past-poland-3-1-to-renew-knockout-stage-hopes"}