{"authors": ["David Lee"], "date_download": "2024-10-12 14:09:31", "date_modify": "2024-10-12 14:09:31", "date_publish": "2024-06-28 17:39:52", "description": "A privatised local team, like the Singapore Slingers, are likely to play in a new league from end-2024. Read more at straitstimes.com.", "filename": "sport_basketball_singapore-team-target-a-spot-in-taiwanese-pro-basketball-league_1728742171.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/20200214158168475760622015504893533754a2hhblkzuann.jpg?VersionId=T5gVYVnHAePxkC3OM4jFzDlzmuWr08MK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_singapore-team-target-a-spot-in-taiwanese-pro-basketball-league_1728742171.html", "title": "Singapore team target a spot in Taiwanese pro basketball league", "title_page": "Singapore team target a spot in Taiwanese pro basketball league | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Less than a year after the Singapore Slingers went into dormancy, the Republic is aiming to have a professional basketball outfit again, with plans to field a team in a league in Chinese Taipei in 2024.\nPlans are afoot to merge two existing basketball leagues in Chinese Taipei – the six-team P.League+ (PLG) and the five-team T1 League – and sources say a Singaporean team may join the new competition from November 2024 to May 2025.\nIf things fall in place, the development is a positive sign for Singapore basketball, after hitting a low in November 2023, when the Asean Basketball League (ABL) and Slingers went into a period of quiescence.\nThe Straits Times understands that this new team will be privately funded and comprise national and developmental players like the Slingers. But they will have a new name and will play home and away games in Singapore and various Taiwanese cities.\nNational shooting guard and former Slinger Larry Liew said: “The closure of the Slingers affected young players by creating uncertainty about the next step in their journey to compete at a higher level, as the Slingers were the only professional basketball club in Singapore for almost 20 years.\n“For national players, the lack of exposure is a concern. Competing against top players from around the region could significantly enhance their skills and experience.”\nThe 31-year-old, who is now a freelance basketball coach, added that the new league will also “open up new opportunities for young athletes, giving them a higher goal to strive towards”.\nWalter Wang, chairman of PLG champions New Taipei Kings, announced in a press conference on June 22 a proposal for a new league featuring at least 10 teams, including a South-east Asian outfit.\nAccording to news agency Focus Taiwan, he noted interest from Singapore and shared that the Kings, three other PLG sides and all the T1 teams were on board. Two other PLG teams, Fubon Braves and Taoyuan Pauian Pilots, signed on later after some initial resistance.\nFor Singapore basketball, joining the Taiwanese league will provide local players a professional platform to play more competitive and higher-intensity games on a regular basis – on top of the National Basketball League (NBL) that takes place for three months a year.\nPreviously, the national team recruited their players mostly from the Slingers, who were founded in 2006 to compete in Australia’s National Basketball League until 2008 and the ABL from 2009.\nIn 11 seasons, the Singapore outfit qualified for three ABL Finals but did not win the trophy.\nOver the years, they placed more focus on fielding local players, which resulted in Singapore winning two SEA Games bronze medals in 2013 and 2015. The return to professional basketball will also be a boost to their medal hopes when the Games are held here in 2029.\nNational basketball coach Neo Beng Siang, who led the men’s team to two SEA Games bronzes, noted that playing in the Taiwanese league is a good move as “the NBL alone is not enough”.\nHe added: “We can then have players train and play full time again at a higher level to gain exposure and experience from going up against strong opponents and imports. This will definitely help the national team, like how the Slingers did before.\n“There will be challenges to starting such a full-time programme again, as we may have to look for players from scratch, but we have to try. If there is no clash with the national 3x3 programme, we will also look to use some of their players.”", "url": "https://www.straitstimes.com/sport/basketball/singapore-team-target-a-spot-in-taiwanese-pro-basketball-league"}