{"authors": [], "date_download": "2024-10-12 13:41:20", "date_modify": "2024-10-12 13:41:20", "date_publish": "2024-08-21 22:02:24", "description": "Pakistan overcame a jittery start on a rain-hit opening day of the first test against Bangladesh in Rawalpindi as Saim Ayub and Saud Shakeel scored fighting half-centuries to guide the hosts to 158-4 at stumps on Wednesday. Read more at straitstimes.com.", "filename": "sport_ayub-shakeel-help-pakistan-to-158-4-against-bangladesh_1728740480.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/22/CRICKET-PAK-BAN-TEST-145503.jpg?VersionId=5MMzRwj4gcBKLfpFKpxZIXGaw7HRNGOG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_ayub-shakeel-help-pakistan-to-158-4-against-bangladesh_1728740480.html", "title": "Saim Ayub, Saud Shakeel help Pakistan to 158-4 against Bangladesh in day 1 of first cricket Test", "title_page": "Saim Ayub, Saud Shakeel help Pakistan to 158-4 against Bangladesh in day 1 of first cricket Test | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Pakistan overcame a jittery start on a rain-hit opening day of the first test against Bangladesh in Rawalpindi as Saim Ayub and Saud Shakeel scored fighting half-centuries to guide the hosts to 158-4 at stumps on Wednesday.\nOpener Ayub fell for 56 while Shakeel was unbeaten on 57 as the duo steadied the ship with a 98-run stand after Bangladesh won the toss and wreaked havoc through their pace bowlers on a helpful pitch.\nAs batting conditions improved under the sun, the pair led the hosts to 81-3 at tea before continuing to milk runs in the final session until Bangladesh struck back by removing the dangerous Ayub in the 32nd over.\nIn a momentary lapse of concentration, the left-hander attempted an expansive drive against Hasan Mahmud but edged the ball to Mehidy Hasan Miraz in the slip cordon.\nShakeel, who earlier became the joint-fastest Pakistan batsman to 1,000 test runs alongside Saeed Ahmed, marked his 20th innings with his seventh half-century.\nMohammad Rizwan was unbeaten on 24 at stumps, as Pakistan gave themselves a good platform to build on in new head coach Jason Gillespie's first match in charge of the red-ball team.\nA soggy outfield ensured there was no action in the morning and Pakistan suffered a setback shortly after play began at 2.30 p.m local time when Abdullah Shafique's loose shot was plucked out of thin air by Zakir Hasan at gully.\nShoriful Islam struck twice in as many overs to reduce the hosts to 16-3 with captain Shan Masood and Babar Azam both back in the pavilion after being caught behind by Litton Das.\nMasood was fuming following his controversial dismissal as TV replays showed the ball had clipped his pad after going past the bat without contact. REUTERS", "url": "https://www.straitstimes.com/sport/ayub-shakeel-help-pakistan-to-158-4-against-bangladesh"}