{"authors": [], "date_download": "2024-10-12 14:03:43", "date_modify": "2024-10-12 14:03:43", "date_publish": "2024-05-17 00:38:27", "description": "This will be the fifth time they meet in a final, all of which have been on clay with Swiatek winning three of the previous four. Read more at straitstimes.com.", "filename": "sport_tennis_swiatek-downs-gauff-to-reach-italian-open-final_1728741823.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/17/LYNXMPEK4F0O9-1.jpg?VersionId=bGigvJ7aQmFPiEk.pIw1krURsvZQFOvG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_swiatek-downs-gauff-to-reach-italian-open-final_1728741823.html", "title": "Iga Swiatek to face Aryna Sabalenka in bid for Madrid-Rome clay double", "title_page": "Iga Swiatek to face Aryna Sabalenka in bid for Madrid-Rome clay double | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME – Once again, it will be Iga Swiatek up against Aryna Sabalenka, but this time there will be more at stake.\nOn May 16, world No. 1 Swiatek swept past Coco Gauff to reach the Italian Open final on May 18 when second-ranked Sabalenka stands in her way of a third title and her bid to match a Serena Williams record.\nThe Pole eased to a 6-4, 6-3 win over US Open champion Gauff for an 11th straight clay-court victory, while Sabalenka of Belarus defeated Danielle Collins 7-5, 6-2.\nSwiatek, a four-time Grand Slam champion, defeated third seed Gauff for the 10th time in 11 encounters.\nShe ended with 26 winners and broke her American opponent four times and is now one victory away from duplicating the Madrid-Rome clay trophy double achieved by Williams 11 years ago.\n“I’m not thinking about statistics or history,” insisted Swiatek, the 2021 and 2022 champion in Rome.\n“I’m just playing day by day. It’s easier that way, it lets you play more freely.”\nWhen asked about her dominance and if there are times she feels unbeatable, she added: “No. If I would feel that way, I wouldn’t play so well. I always try to remind myself that I shouldn’t expect anything, take anything for granted.\n“Usually when I feel like I’m going to win this game, it doesn’t happen.”\nThe title decider will be a repeat of the Madrid final earlier in May won by Swiatek.\nThis will be the fifth time Swiatek and Sabalenka meet in a final, all of which have been on clay with Swiatek winning three of the previous four.\nSabalenka is looking to change that, while also taking care of her lower back injury.\n“Playing Iga always gives me extra motivation. I really like our tough battles. It’s always high-level tennis. Hopefully you guys enjoy watching us play,” she said.\n“And hopefully this time I’m going to get this title with your support.”\nBut the Belarusian also said that she will not hesitate to pull out of the final if her back issue flares up and threatens her French Open participation.\n“It’s getting better. I’m doing everything to recover to be ready for Paris. Right now I’m not in pain during matches,” she added.\n“But if something is going to happen in the match I’m going to pull out, because Paris is around the corner.”\nIn the men’s semi-finals, third-seeded German Alexander Zverev rallied to beat Chilean Alejandro Tabilo 1-6, 7-6 (7-4), 6-2. Zverev will face the winner of the Tommy Paul-Nicholas Jarry match in the final on May 19. AFP, REUTERS", "url": "https://www.straitstimes.com/sport/tennis/swiatek-downs-gauff-to-reach-italian-open-final"}