{"authors": [], "date_download": "2024-10-12 14:17:07", "date_modify": "2024-10-12 14:17:07", "date_publish": "2023-09-24 19:18:34", "description": "Max Verstappen romped home to win the Japanese Grand Prix and give Red Bull the Formula One constructors’ championship on Sunday. Read more at straitstimes.com.", "filename": "sport_formula-one_christian-horner-says-repeating-red-bull-success-almost-impossible_1728742627.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/24/2023-09-24T104945Z1287791588UP1EJ9O0OLF9ARTRMADP3MOTOR-F1-JAPAN.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_christian-horner-says-repeating-red-bull-success-almost-impossible_1728742627.html", "title": "Christian Horner says repeating Red Bull phenomenal 2023 success ‘almost impossible’", "title_page": "Christian Horner says repeating Red Bull phenomenal 2023 success ‘almost impossible’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SUZUKA – Red Bull boss Christian Horner said it would be “almost impossible” for his team to better this season’s performance after they won the Formula One constructors’ championship on Sunday.\nMax Verstappen’s win at the Japanese Grand Prix, their 15th victory in 16 races this season, gave Red Bull 623 points and an unassailable 318-point lead in the standings.\nTheir advantage over second-place Mercedes (305) is so big that they were able to clinch the title even though Verstappen’s teammate Sergio Perez retired from the race.\nRunaway championship leader Verstappen has been in imperious form with 13 victories this season, while Perez chipped in with two.\nAlthough defeat by Carlos Sainz at the Singapore GP the week before ended Red Bull’s hopes of an unprecedented unbeaten season, Horner thinks what they have achieved may never be repeated.\n“It’s a golden moment – for the team to do better than we’re doing, I think it’s almost impossible.\n“We’re riding a wave and of course we want to try and ride that wave as long as we can, but Formula One is a fast-moving business. We see how quickly teams move up and move down,” he said.\nThe win gave Red Bull their second straight constructors’ championship and put Verstappen within touching distance of his third consecutive drivers’ title.\nHorner said the Dutch driver was “at the top of his game”.\n“I think he’s just got this inner hunger and determination and huge ability,” he said.\n“He channels it, he doesn’t get distracted by some of the trappings of Formula One – he’s just an out-and-out racer.”\nMercedes’ seven-time world champion Lewis Hamilton, meanwhile, summed things up by saying that the team need the greatest six months ever to catch up with Red Bull. Mercedes won eight consecutive constructors’ crowns from 2014 to 2021.\nSky Sports quoted him as saying: “I have no idea where the car is going to be next year but we are a long, long way away.\n“The next six months have got to be the greatest six months of development that we’ve ever, ever had to close that gap. To be really banging on the door.”\nHorner, meanwhile, had sympathy for Perez, who retired early in the race, telling his team that “the car doesn’t feel right”.\nPerez had already picked up two penalties by then and later came back out onto the track to ensure he would not have to serve them at the Oct 8 Qatar Grand Prix.\n“I think this is a big confidence circuit,” said Horner. “Where Sergio was struggling was mainly in the high-speed corners compared to Max.\n“You could tell with Max, the confidence that he had, the speed that he was able to carry through the high-speed stuff was mind-boggling.” AFP", "url": "https://www.straitstimes.com/sport/formula-one/christian-horner-says-repeating-red-bull-success-almost-impossible"}