{"authors": [], "date_download": "2024-10-12 14:17:17", "date_modify": "2024-10-12 14:17:17", "date_publish": "2023-12-14 13:43:30", "description": "The Dutchman and his team rewrote the record books in retaining their drivers’ and constructors’ championships. Read more at straitstimes.com.", "filename": "sport_formula-one_for-red-bull-and-max-verstappen-2023-was-a-dominant-year_1728742637.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/14/2023-12-08T162201Z1334094761RC22L4A8MSCQRTRMADP3MOTOR-F1-GALA.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_for-red-bull-and-max-verstappen-2023-was-a-dominant-year_1728742637.html", "title": "For Red Bull and Max Verstappen, 2023 was a totally dominant year in F1", "title_page": "For Red Bull and Max Verstappen, 2023 was a totally dominant year in F1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Following a season in which they broke multiple records, Red Bull ace Max Verstappen and team principal Christian Horner have agreed that the team’s 2023 achievements will be very hard to repeat.\nVerstappen – who won his third consecutive Formula One world title – and his team rewrote the record books in retaining their drivers’ and constructors’ championships.\nHe set the record for most wins in a season, 19 from 22 grands prix; for consecutive number of victories, 10; and the highest percentage of wins in a season, 86.36 per cent, beating the previous best of 75 per cent by Alberto Ascari in 1952, an era when there were only eight races.\n“It will be very hard to have another season like this, we know that,” said Verstappen, who also became the first driver to lead for more than 1,000 laps in a season, with 1,003.\nAs a constructor, Red Bull won 21 grands prix, overhauling Mercedes’ record of 2016 when they won 19 of 21 races. With a 95.5 per cent success rate, they also beat the 93.8 per cent of McLaren in 1988 when they won 15 of 16.\nHorner said their feats “would take a while to sink in”.\n“You have to bear in mind what we have achieved hasn’t been done in more than 70 years of Formula One,” he said. “Will it be achieved again in my lifetime? I don’t think we will be able to better what we’ve done this year.”\nVerstappen dominated to such an extent that his record for most points in a season, 575, was enough to win the constructors’ title on his own. Second-place Mercedes scored 409.\nMercedes’ seven-time champion Lewis Hamilton praised Verstappen for his achievements.\n“He’s done an amazing job with the package he has,” he said. “He and the team have been phenomenal this year, faultless. They’ve raised the bar.”\nVerstappen collected his third championship with five races to spare, all of which he won to end the season on a run of seven straight victories.\nThe Dutchman said his hunger to succeed was “just how I grew up”. He added: “My mindset didn’t change after winning the championship. I can’t go into a weekend not giving it my all. I would just get annoyed with myself.”\nThere is a rule of thumb in Formula One that to be one of the greats, a driver has to win three world titles.\nVerstappen has now earned his place among the likes of Ayrton Senna, Niki Lauda, Jackie Stewart, Jack Brabham and Nelson Piquet.\nOnly Michael Schumacher, Hamilton, Juan Manuel Fangio, Alain Prost and Sebastian Vettel have won more. With 54 grand prix wins – his last in 2023’s final race in Abu Dhabi – to take him past Vettel, Verstappen is third on the all-time list behind Hamilton (103) and Schumacher (91).\nAt 26, and contracted to Red Bull till the end of 2028, Verstappen could still challenge Hamilton and Schumacher for their record seven titles, and Hamilton’s grand prix victory record.\n“The hunger and the fire still burn brightly within him, and we don’t see that diminishing,” Horner said.\nRed Bull’s rivals, Mercedes and Ferrari, were never in the hunt. Mercedes finished second in the constructors’ championship, just three points ahead of Ferrari, but their combined total still did not match Red Bull’s with Mercedes 451 points behind the champions.\nMercedes team principal Toto Wolff said: “You’ve got to have a lot of respect for their achievements on the engineering side, and also the driver.”\nHis driver George Russell is aware of the challenge. “The task for everybody is massive,” he said. “We’re all trying to catch up to the most dominant car in F1 history.”\nThe Silver Arrows finished the year without a win for the first time since 2011. It is now two years since Hamilton last won a race. Instead, it was Ferrari and Carlos Sainz, who won in Singapore, that denied Red Bull a perfect season.\nFerrari boss Frederic Vasseur said that he was not satisfied with his first year in charge.\n“It wasn’t the season we expected, mainly because we were too far away at the beginning,” he said. “But we had a good reaction, step by step we came back. Overall, we did a good job.” NYTIMES", "url": "https://www.straitstimes.com/sport/formula-one/for-red-bull-and-max-verstappen-2023-was-a-dominant-year"}