{"authors": [], "date_download": "2024-10-12 14:08:55", "date_modify": "2024-10-12 14:08:55", "date_publish": "2024-09-09 20:15:34", "description": "All-Star rookie Reese was ruled out for the rest of the season with a wrist injury. Read more at straitstimes.com.", "filename": "sport_basketball_without-angel-reese-chicago-sky-handle-dallas-wings-with-ease_1728742135.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/09/BKP-SPO-WBA-INDIANA-FEVER-V-CHICAGO-SKY-024219.jpg?VersionId=paoFN7FufD1aBhTprQv6gqwEN3XxQWqP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_without-angel-reese-chicago-sky-handle-dallas-wings-with-ease_1728742135.html", "title": "Without Angel Reese, Chicago Sky handle Dallas Wings with ease", "title_page": "Without Angel Reese, Chicago Sky handle Dallas Wings with ease | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CHICAGO – The day after losing All-Star rookie Angel Reese for the rest of the Women’s National Basketball Association (WNBA) season with a wrist injury, the Chicago Sky defeated the Dallas Wings 92-77 on Sept 8 in a dominating home performance.\nChennedy Carter led Chicago (13-22) with 28 points and six assists. Starting in place of Reese, Isabelle Harrison scored 21 points and added nine rebounds, while Kamilla Cardoso had 10 points and 11 boards, helping fill in the rebounding void left by Reese’s absence.\nSaid Harrison: “I do always want to remain aggressive. I have belief in myself. I wanted to for sure step up with Angel being out today and still show that we can be a solid team. Just continue to stay aggressive.”\nDespite starting the fourth quarter with a 24-point deficit, Dallas (9-26) battled back and cut 10 points off that with 3min 49sec remaining.\nHowever, Chicago kept the game out of reach for the Wings, never allowing their lead to dip below 13 the rest of the way.\nOverall, the Wings’ defence could not handle Chicago or adjust to its blistering pace of 23 fast-break points to 14 for Dallas.\nIt was not all positive for the Sky as former All-Star Diamond DeShields suffered an injury early in the fourth quarter. After a lay-up by Kalani Brown, DeShields fell to the court holding her ankle and sat out the rest of the game.\nChicago came out of the gate quickly, building a two-possession lead within the first three minutes. The Sky achieved it by attacking the basket, especially Carter, who scored 11 points in the first quarter.\nThose drives to the basket also put the Sky at the foul line 12 times in the first half, compared to five for the Wings.\nMeanwhile, Chicago’s defence was too strong for the Wings, were outshot 52.8 per cent to 37.8 per cent in the first half and would have trailed by 20 if not for back-to-back jumpers by Arike Ogunbowale before the break.\nOgunbowale posted 23 points for Dallas while Natasha Howard scored 17 points and Satou Sabally added 12 points, with both adding six rebounds apiece.\nWith the win and the Atlanta Dream’s loss to the Indiana Fever earlier on Sept 8, the Sky hold a one-game lead over the Dream for the eighth and final play-off spot with five games remaining.\nMeanwhile, Caitlin Clark recorded her franchise-record 14th double-double of 2024 with 26 points and 12 assists to lead the Fever to a dramatic 104-100 comeback win in overtime on Sept 8 over the visiting Atlanta.\nThe Dream lost despite a 36-point effort by Rhyne Howard, who missed a shot in the final minute that would have tied the game for the 13th time. REUTERS", "url": "https://www.straitstimes.com/sport/basketball/without-angel-reese-chicago-sky-handle-dallas-wings-with-ease"}