{"authors": [], "date_download": "2024-10-12 14:15:31", "date_modify": "2024-10-12 14:15:31", "date_publish": "2024-03-24 19:15:59", "description": "With Hamilton retiring early and Russell crashing out late, Mercedes suffered their first double DNF at a F1 race in over five years. Read more at straitstimes.com.", "filename": "sport_red-bull-reliability-run-ends-with-max-verstappen-s-car-in-flames_1728742531.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/24/TOPSHOTS-TOPSHOT-AUTO-PRIX-F1-AUS-095329.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_red-bull-reliability-run-ends-with-max-verstappen-s-car-in-flames_1728742531.html", "title": "Red Bull reliability run ends with Max Verstappen’s car in flames", "title_page": "Red Bull reliability run ends with Max Verstappen’s car in flames | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MELBOURNE – Red Bull’s remarkable two-year run of reliability ended at the Australian Grand Prix on March 24, with Formula One world champion Max Verstappen rolling back to the pits as flames leapt from the rear of his car.\nThe Dutchman’s run of nine successive wins was also snapped as he broke down on lap 4 with a brake problem, two years after his and Red Bull’s last retirement due to a mechanical issue at the 2022 Albert Park race.\nRed Bull’s reliability has underpinned Verstappen’s run to the last three drivers’ championships and the team’s two successive constructors’ titles.\nThe setback for pole-sitter Verstappen was a sobering moment for the Milton Keynes-based team, now just four points clear of Ferrari in both title races following Carlos Sainz’s triumph in Australia. Sergio Perez, runner-up behind Verstappen at both Bahrain and Saudi Arabia, was fifth for Red Bull.\n“We are all one team and that DNF (did not finish) hurts everybody in the same way. It’s a matter of learning from it. We’ve had two years of no mechanical DNFs which has been remarkable,” Red Bull boss Christian Horner said.\n“(It’s) remarkable after three races that he’s still leading the championship even with that DNF,” added Horner of Verstappen.\nThe driver said his car had felt fine during the formation lap, but the right-rear brake was stuck from the start of the race. “The temperature kept on increasing. It was also basically driving with the handbrake on and that’s why already it felt the car was really weird to drive in some corners.”\nPerez complained his car was lacking pace and proved troublesome throughout the weekend.\nHorner said Perez was probably not aware he had picked up some damage when passing Aston Martin’s Fernando Alonso during the race.\n“He lost a significant amount of downforce from the floor of the car,” added Horner.\n“Then as soon as you get that, your tyre degradation gets worse and we were just not good at the end of the stints, which is a bit of an unusual trait for our car.”\nFerrari celebrated maximum points, with runner-up Charles Leclerc also clocking the fastest lap.\nPerez said Ferrari “absolutely” had the pace to win, even if Verstappen had stayed on track to the finish. “It’s a very bad weekend. We never managed to get in the window (of performance) with the car and look after the tyres,” added the Mexican driver.\nThe agony was probably much worse for rivals Mercedes.\nWith Lewis Hamilton retiring early and George Russell crashing out late, Mercedes suffered their first double DNF at a Formula One race in over five years, piling on yet more early-season gloom.\nSeven-time world champion Hamilton lasted 17 laps in Melbourne before rolling to halt with a power unit failure, while Russell took a skid into gravel at turn 6 before smashing into a barrier at the end of the race.\nIt was the first double DNF for Mercedes since Hamilton and Valtteri Bottas retired with technical troubles at the 2018 Austrian Grand Prix. The Silver Arrows are now fourth in the constructors’ championship behind leaders Red Bull, Ferrari and McLaren.\n“Tough to take, super tough,” downcast team boss Toto Wolff said. “I would be lying if I said I feel positive about the situation and optimistic, but you just need to overcome the nagging, negative thoughts and say, ‘we will turn this around’. But today it feels very, very brutal.”\nHamilton, who won six of his world titles with Mercedes, will join Ferrari in 2025 and may be counting down the days until his exit. With only eight points from the first three races, he has never had a worse start to an F1 season.\nThe Briton’s setback came a day after qualifying 11th, his worst at Albert Park since 2010. He did his best to put on a brave face, saying things could be worse, but admitted the struggles of Mercedes’ W15 car were tough on the spirit.\n“I think for everyone in the team, when so much work is going on throughout the winter for everybody, you come in excited, motivated and driven, and then you’re with the mindset that you’re going to be fighting for wins,” he added.\n“Obviously that’s not the case. And then you’re like, ‘OK, maybe second, third’. No, it’s not the case, and it cascades a bit further down. You just go through the motions. It’s challenging.” REUTERS", "url": "https://www.straitstimes.com/sport/red-bull-reliability-run-ends-with-max-verstappen-s-car-in-flames"}