{"authors": [], "date_download": "2024-10-12 13:27:05", "date_modify": "2024-10-12 13:27:05", "date_publish": "2024-10-10 05:04:22", "description": "It will be broadcast by TNT Sports, as previous versions have been, and will be an 18-hole event. Read more at straitstimes.com.", "filename": "sport_golf_the-showdown-is-set-pga-liv-exhibition-on-dec-17_1728739625.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/10/btgolf20241010.jpg?VersionId=l3m5rQLEsj3Bf5HBxECvnnDlQPpfAeO3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_the-showdown-is-set-pga-liv-exhibition-on-dec-17_1728739625.html", "title": "The Showdown is set: PGA-LIV exhibition on Dec 17", "title_page": "The Showdown is set: PGA-LIV exhibition on Dec 17 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LAS VEGAS - Four superstars from the PGA Tour and LIV Golf will tee off Dec 17 in Las Vegas in what has been dubbed The Showdown.\nThe exhibition match will pit World No. 1 Scottie Scheffler and No. 3 Rory McIlroy on the PGA side against LIV golfers Bryson DeChambeau and Brooks Koepka. All four are multiple major winners, but the LIV golfers have limited opportunities to gain rankings points.\nThe made-for-TV event had been previously announced, but Front Office Sports on Oct 9 confirmed the date and the location – Shadow Creek Golf Course. That course hosted the first version of The Match – the predecessor to The Showdown – between Phil Mickelson and Tiger Woods and potentially could host as many as 5,000 fans for the December event.\nThe format has yet to be finalised, per the report.\nIt will be broadcast by TNT Sports, as previous versions have been, and will be an 18-hole event.\nSome celebrity-driven versions of The Match were reduced to 12 holes.\n“The Match turned into celebrity golf,” Hollywood producer Bryan Zuriff, who started The Match, told Front Office Sports. “And 12 holes is good for celebrity golf. This is 18 holes of real golf and could even potentially expand in the future.”\nHe said he also envisions expanding beyond four players down the road.\nFront Office Sports said there is a six-year deal to continue The Showdown both in Las Vegas at Shadow Creek and at international locations, rotating annually. An event in the Middle East is under consideration for 2025.\nZuriff said he expects interest in The Showdown, given it’s the only time outside of major tournaments that the PGA and LIV golfers can go head-to-head.\n“I don’t think we have to market or play that up,” Zuriff told the publication. “I think it speaks for itself.” REUTERS", "url": "https://www.straitstimes.com/sport/golf/the-showdown-is-set-pga-liv-exhibition-on-dec-17"}