{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 13:42:51", "date_modify": "2024-10-12 13:42:51", "date_publish": "2024-06-23 16:16:47", "description": "The national men's team claimed a bronze at the Koni Badung Sports Tourism 2024 Indonesia Open International Kabaddi Championships. Read more at straitstimes.com.", "filename": "sport_s-pore-s-kabaddi-community-hopes-to-build-on-first-international-medal_1728740571.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/23/WhatsApp20Image202024-06-2220at201.58.4720PM.jpeg?VersionId=mby8izpv5m5ilRzJYImAUyJbBqr_lmeB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_s-pore-s-kabaddi-community-hopes-to-build-on-first-international-medal_1728740571.html", "title": "S’pore’s kabaddi community hopes to build on first international medal", "title_page": "S’pore’s kabaddi community hopes to build on first international medal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – When Anbu Navin N. Annadurai first got into kabaddi in 2018, he and his teammates encountered many challenges such as securing venues for practice and a lack of training equipment.\nBut they made do with the circumstances, training on hard surfaces when they did not have enough proper mats. The absence of cushioning often resulted in injuries and abrasions, and stopped them from practising at full intensity.\nThey were also forced to settle for any available spaces to train, often booking multi-purpose halls designed for basketball or badminton. Sometimes, they even trained in open fields or common outdoor spaces.\nBut there have been significant improvements since then, noted Anbu, with players now having access to better training facilities at Kranji Recreation Centre, which allowed them to develop their skills more effectively.\nThe national men’s team started competing internationally in 2023 and on June 16, won their first medal on the international stage after securing a bronze at the Koni Badung Sport Tourism 2024 Indonesia Open International Kabaddi Championships.\nThe 21-year-old said: “It validated our hard work and dedication throughout our journey in kabaddi.\n“For the team, this accomplishment serves as a powerful motivator, boosting morale and highlights our potential on the international stage, inspiring us to set higher goals for future competitions.\n“It also signifies a milestone in our collective effort to promote kabaddi and attract more enthusiasts to the sport.”\nThere were three formats contested at the tournament in Bali: National style (seven-a-side), super five (five-a-side) and three star (three-a-side).\nAt the Lotring Indoor Stadium, Anbu captained the super five team, who earned a bronze by progressing to the semi-finals after a 38-20 loss to Indonesia and 29-24 victory over Timor-Leste.\nIn the last four, they were defeated 40-25 by the Indonesian Under-22 side.\nKabaddi Association (Central SG) deputy chairman Southri Kumaravadivel acknowledged that Singapore is still relatively new in the regional kabaddi scene, compared to countries like Thailand and Malaysia who have a long history in the sport.\nBut he said that the association, which was officially founded in 2019, has been collaborating with their regional counterparts to improve their standards.\nSouthri said: “Over the past five years, we have been diligently building our infrastructure and training hard.\n“This medal is a tremendous boost for the association, encouraging us to double our efforts in promoting kabaddi and nurturing more talents.\n“It is also a recognition of the hard work and dedication of every individual involved.”\nOriginating from India, kabaddi is a contact sport involving two teams.\nThe objective of the game is for a single player on offence – known as a raider – to run into the opposing team’s half of the court, touch as many of their players as possible to score points and return to their own half of the court in 30 seconds.\nThe raider is required to carry out each raid in a single breath while repeatedly chanting the word “kabaddi”, as the defending team try to capture the raider with various wrestling-style trips, traps and tackles to score a point.\nKabaddi, in its seven-a-side form, has been a medal sport at the Asian Games since 1990, but has never been on the SEA Games’ roster.\nIt was not included in the preliminary list of 40 sports that was recently released by 2025 SEA Games hosts Thailand, but Southri shared that there are ongoing efforts to get the game included at the biennial event, highlighting that it would provide more opportunities for kabaddi athletes to represent their nations.\nSingapore are also looking to take part in the Asian Indoor and Martial Arts Games scheduled for November in Thailand.\nAnbu, who just completed his national service and will begin his university education soon, has also noticed a change in perception towards kabaddi.\nHe has observed that this niche sport has grown in appeal and attracted athletes from other sports such as boxing and hockey.\nIn fact, he was part of the floorball and cricket co-curricular activities in secondary school and junior college and played football leisurely, but was drawn to kabaddi due to the dynamic nature of the game.\nAnbu said: “Overall, kabaddi is steadily gaining recognition and popularity in Singapore, and I’m optimistic about its continued growth and development in the coming years.”", "url": "https://www.straitstimes.com/sport/s-pore-s-kabaddi-community-hopes-to-build-on-first-international-medal"}