{"authors": [], "date_download": "2024-10-12 13:40:18", "date_modify": "2024-10-12 13:40:18", "date_publish": "2024-05-10 18:51:18", "description": "LONDON - Chelsea defender Reece James could make his long awaited return to the pitch away at Nottingham Forest on Saturday five months after having surgery on his hamstring, manager Mauricio Pochettino said. Read more at straitstimes.com.", "filename": "sport_football_chelseas-james-in-contention-for-forest-clash-after-missing-five-months_1728740418.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/10/LYNXMPEK490A3-1.jpg?VersionId=JPfaW1ExZ1DKgpha0bDbU88ZKbhGqemJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_chelseas-james-in-contention-for-forest-clash-after-missing-five-months_1728740418.html", "title": "Chelsea's James in contention for Forest clash after missing five months", "title_page": "Chelsea's James in contention for Forest clash after missing five months | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Chelsea defender Reece James could make his long awaited return to the pitch away at Nottingham Forest on Saturday five months after having surgery on his hamstring, manager Mauricio Pochettino said.\nJames has made eight appearances in the league this season and last played on Dec. 10 against Everton.\n\"We need to see today (at training) but maybe he can be available in the squad, yes,\" Pochettino told reporters on Friday regarding James. \"The most important thing is Reece James is going to be there for us. We have an amazing relationship and of course he is an amazing player.\n\"It is not easy when you comeback from a long-term injury. The most important thing is he can be available and be part of the squad. It is important to finish (the season) with good feelings.\"\nThe return of James could be a big boost for Chelsea in their final three games as they chase European competition next season and also fuels hope the 24-year-old could feature for England at Euro 2024.\nChelsea are seventh in the standings on 54 points, while relegation-threatened Forest are three points above the drop zone in 17th with two games remaining.\n\"It's true it's going to be hard (to qualify for European competition),\" Pochettino said. \"Of course, we know very well we need to win games in the last three games. We then have a possibility to move into a place to play in Europe.\n\"The team is ready to face the last three games and it is important for us to be in Europe.\"\nMidfielder Lesley Ugochukwu, who has not played since injuring his hamstring on Christmas Eve, also returned to training, while goalkeeper Robert Sanchez is nearing a return to full training.\n\"(I'm) Happy,\" Pochettino said on the return of injured players. \"This is the last week of the season and nearly all the players will be fit and available -- it's a good time. It's good to see the future and be more optimistic.\"\nThe fact he will only have a fit squad for the final week, he added, is disappointing.\n\"I think to increase the level and improve everyday we need to assess why we need to do better and improve,\" Pochettino said. \"I think it's a good challenge for next season... we need to increase the availability of the players.\"\nChelsea head to Brighton & Hove Albion on Wednesday before hosting Bournemouth on the final day on May 19. REUTERS", "url": "https://www.straitstimes.com/sport/football/chelseas-james-in-contention-for-forest-clash-after-missing-five-months"}