{"authors": [], "date_download": "2024-10-12 13:41:04", "date_modify": "2024-10-12 13:41:04", "date_publish": "2024-08-28 07:38:14", "description": "TAROUBA, Trinidad & Tobago - West Indies bludgeoned their way to an eight-wicket win over South Africa in Tuesday's rain-affected Twenty20 international to sweep the three match series. Read more at straitstimes.com.", "filename": "sport_west-indies-sweep-t20-series-against-south-africa_1728740464.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/CRICKET-WIS-RSA-3RD-T20I-233239.jpg?VersionId=usxAVVaG9IQdhxHaVY2rFCJQZkcTVlM0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_west-indies-sweep-t20-series-against-south-africa_1728740464.html", "title": "West Indies sweep T20 cricket series against South Africa", "title_page": "West Indies sweep T20 cricket series against South Africa | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "TAROUBA, Trinidad & Tobago - West Indies bludgeoned their way to an eight-wicket win over South Africa in Tuesday's rain-affected Twenty20 international to sweep the three match series.\nThe Windies comfortably reached the revised target of 116, adjusted on the Duckworth-Lewis system, with 22 balls to spare after South Africa scored 108 for four in their 13 overs.\nShai Hope hit an unbeaten 42 off 24 balls, securing victory with a six to emphasise the home side's dominance.\nRain delayed the start of play by an hour and South Africa, who were put into bat, struggled to deal with the sticky wicket as the home side opened with a spin attack.\nThey were 23 without loss in 4.3 overs when the rain returned, leading to another hour's delay, after which the match was reduced to 13 overs each.\nTristan Stubbs' 40 runs off 15 balls at the end of the innings saw South Africa get to three figures but it was a target quickly chased down by the home side, who had won the previous two T20 clashes on Friday and Sunday, also at the Brian Lara Cricket Academy ground.\nNicholas Pooran smacked four sixes in his 13-ball 35 while Hope and Shimron Hetmyer put on a winning unbeaten partnership of 56.\nHetmyer marked his return to the Windies side with an unbeaten 31 off 17 balls. REUTERS", "url": "https://www.straitstimes.com/sport/west-indies-sweep-t20-series-against-south-africa"}