{"authors": ["Deepanraj Ganesan"], "date_download": "2024-10-12 13:44:49", "date_modify": "2024-10-12 13:44:49", "date_publish": "2023-01-04 11:22:08", "description": "The Singaporean, 73, is a veteran sports administrator and has served the IOC as a member since 1998. Read more at straitstimes.com.", "filename": "sport_ng-ser-miang-warned-fined-after-being-found-guilty-of-interfering-in-world-sailing-election_1728740689.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/01/10/20200817105919975a0bbeeba-0bb5-44c0-a313-bcb212d2fd3d_0.jpg?VersionId=P56sGZ.h5lphYEiyoXpaOhSDxI7KRIhN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_ng-ser-miang-warned-fined-after-being-found-guilty-of-interfering-in-world-sailing-election_1728740689.html", "title": "S’pore’s IOC vice-president Ng Ser Miang warned, fined for interfering in World Sailing election", "title_page": "S’pore’s IOC vice-president Ng Ser Miang warned, fined for interfering in World Sailing election | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – International Olympic Committee (IOC) vice-president and Singapore National Olympic Council (SNOC) board member Ng Ser Miang has been fined €1,000 (S$1,400) and served with an official warning after being found guilty of interfering in a World Sailing election.\nWorld Sailing said on its official website last Friday that Mr Ng and former World Sailing Ethics Commission chairman Dieter Neupert had been found guilty of failing to act with integrity and interfering in the 2020 election.\nWhen contacted by The Straits Times, Mr Ng, 73, said on Wednesday: “I resigned from the World Sailing Ethics Commission in December 2020. I served the World Sailing Ethics Commission as a volunteer and have done so without fear or favour, and in full compliance with its rules and regulations.\n“World Sailing has no jurisdiction over me after December 2020. I have not taken part in any of their proceedings and reject any allegations and sanctions made against me by World Sailing.”\nThe Singaporean, who was vice-president of the International Sailing Federation (World Sailing’s predecessor) from 1994 to 1998, is a veteran sports administrator and has served the IOC as a member since 1998.\nHe was vice-president of the SNOC from 1990 to 2014 (he is now chairman of its games appeals committee and finance committee) and chairman of the Singapore Sports Council – now national agency Sport Singapore – from 1991 to 2002. He was also president of the 2010 Youth Olympic Games organising committee.\nMr Ng was accused of failure to act with utmost integrity, honesty and responsibility, and of acting in a manner that was likely to compromise the impartiality of the ethics commission.\nThe decision was reached by a three-member independent panel, chaired by London-based lawyer and former English Premier League footballer Gareth Farrelly. The other two members were Mr John Shea and Ms Laura McCallum.\nIn November 2020, China’s Quanhai Li was elected the new World Sailing president after narrowly defeating incumbent Kim Andersen of Denmark.\nMr Li’s victory came after a bitter election campaign where Mr Andersen faced three ethical complaints against him.\nThe World Sailing Ethics Commission dismissed two, while the third was withdrawn.\nMr Andersen, however, claimed that the complaints were part of a smear campaign against him prior to the election.\nIn September 2020, prior to the election result, Mr Andersen lodged complaints against Mr Neupert, a Swiss lawyer, and Mr Ng, relating to their conduct while they were members of the World Sailing Ethics Commission.\nMr Andersen alleged that their conduct was in breach of the world governing body’s regulations. He said they should not have taken part in judging his cases, as they were members of the ethics commission. Mr Andersen also accused Mr Ng of misusing his IOC membership to interfere in the presidential election.\nThe independent panel said in its judgment that both Mr Ng and Mr Neupert should have stepped aside once accusations of conflict of interest had been made.\nInstead, Mr Neupert managed correspondence from Mr Andersen and continued to consult with his representatives, as well as other members of the ethics commission, despite the fact that the complaint was against him and Mr Ng.\nMr Ng resigned from the ethics commission in December 2020, and Mr Neupert in January 2021.\nThe independent panel also said Mr Ng failed to answer questions from two different disciplinary investigation officers (DIO) as they conducted their inquiries.\nIn its judgment, finalised on Nov 29, 2022, the panel said: “This case was by no means straightforward. It is clear that this case was highly politicised within World Sailing and related to governance issues in relation to the operation and functioning of the ethics commission.\n“The DIO noted that the allegations against Mr Andersen at the time, which were not substantiated, but which caused damage to his reputation, and which Mr Andersen complained with good cause, showed that there had been a campaign to influence the election and damage his reputation.”", "url": "https://www.straitstimes.com/sport/ng-ser-miang-warned-fined-after-being-found-guilty-of-interfering-in-world-sailing-election"}