{"authors": [], "date_download": "2024-10-12 13:41:42", "date_modify": "2024-10-12 13:41:42", "date_publish": "2024-04-16 14:47:17", "description": "Everton's latest points deduction for breaching Profit and Sustainability Rules (PSR) has ramped up fears they may be relegated from the Premier League but midfielder Dele Alli said they can beat the drop if they keep their focus on football. Read more at straitstimes.com.", "filename": "sport_football_alli-backs-everton-to-finish-strong-amid-relegation-worries_1728740502.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/LYNXNPEK3F06U-1.jpg?VersionId=1LN3.cX7_ZwKO2rBXiHKy6ggqghw65mM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_alli-backs-everton-to-finish-strong-amid-relegation-worries_1728740502.html", "title": "Alli backs Everton to finish strong amid relegation worries", "title_page": "Alli backs Everton to finish strong amid relegation worries | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Everton's latest points deduction for breaching Profit and Sustainability Rules (PSR) has ramped up fears they may be relegated from the Premier League but midfielder Dele Alli said they can beat the drop if they keep their focus on football.\nEverton have been charged twice this season for PSR violations and docked a total of eight points. The club said on Monday they had lodged an appeal against a two-point deduction handed out on April 8.\nSean Dyche's side, who suffered a 6-0 thrashing at Chelsea on Monday, are 16th in the table with 27 points, two points above Luton Town who occupy the final relegation berth.\n\"We can only focus on the games - we can't get caught up in what's going on,\" Alli told Sky Sports.\n\"They've done an unbelievable job. I can feel it when I walk around the place - a real focus and not getting caught up in everything that's going on.\n\"They're an unbelievable group of players and I hope they'll finish the season strong. The chances they create, they can win most games. I think they'll be fine.\"\nAlli, who has not played since February 2023 due to injury, spoke in an interview last year about being sexually abused as a child, mental health issues and time spent in rehab.\nThe midfielder has made 37 appearances for England and said he is aiming to return to Gareth Southgate's squad.\n\"I have a reminder on my phone every day at 11 o'clock that says World Cup 2026,\" he added. \"That's my aim.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/alli-backs-everton-to-finish-strong-amid-relegation-worries"}