{"authors": [], "date_download": "2024-10-12 14:08:39", "date_modify": "2024-10-12 14:08:39", "date_publish": "2024-09-26 15:18:54", "description": "Coach J.J. Redick said earlier this week that he expected the historic moment to come “sooner rather than later”. Read more at straitstimes.com.", "filename": "sport_basketball_lakers-ponder-when-lebron-james-will-share-court-with-son-bronny_1728742119.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/26/hzlakers260924.jpg?VersionId=jUSjfZQdhWPEuaTShxu6K72GF4lR2xnS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_lakers-ponder-when-lebron-james-will-share-court-with-son-bronny_1728742119.html", "title": "Lakers ponder when LeBron James will share court with son Bronny", "title_page": "Lakers ponder when LeBron James will share court with son Bronny | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Los Angeles Lakers great LeBron James and son Bronny are poised to become the first father-son duo on a National Basketball Association (NBA) court this season, but the Lakers are still formulating plans for that moment, new coach J.J. Redick said on Sept 25.\n“We don’t have anything planned per se in terms of commitment to do it this way,” Redick said, as he and Lakers general manager Rob Pelinka met with reporters at the team’s training facility.\n“We obviously have talked about it as a staff, and we’ve gotten into some specifics of what that might look like, but we haven’t committed to anything.\n“And obviously there’s a discussion to be had once we’re all together with Bronny and LeBron, too. They should be a part of that discussion as well.”\nRedick told The Lowe Post podcast on Sept 24 that he expected the historic moment to come “sooner rather than later”.\nBut it is likely that Bronny, who turns 20 in October, will spend a significant amount of time playing in the developmental G League as four-time Most Valuable Player LeBron, Anthony Davis and other Lakers stars try to position the club for a title run.\nLeBron, 39, is heading into his 22nd NBA campaign, having averaged 25.7 points, 7.3 rebounds and 8.3 assists per game last regular season.\nOver the summer, he led the United States to Olympic gold in Paris.\nRedick said utilising James’ vast skills while maintaining the superstar’s health throughout the punishing season would be key.\n“I think everyone in this building is cognizant of the fact that he’s almost 40,” Redick said.\n“But when we’ve watched the pick-up games, he’s going full tilt. He’s on the court, he’s going.”\nThat includes against Bronny, Pelinka said, describing a recent team pick-up game where Bronny “got switched onto LeBron, and LeBron took him baseline and up and under off the glass.\n“The words exchanged afterwards were probably more challenging than anything else,” said Pelinka.\nThe Lakers finished last season with a 47-35 record but were unable to threaten the Denver Nuggets in the opening round of the play-offs.\nCoach Darvin Ham was fired shortly after that post-season defeat.\nRedick, who spent 15 years in the NBA as a player before joining ESPN in 2021 as an analyst, was hired in June.\nRedick has a long association with James, but said their new coach-player relationship is still developing.\n“I think it’s at the early stages of that relationship, particularly because LeBron was doing USA Basketball for most of the summer,” Redick said.\nAcross town, Los Angeles Clippers star forward Kawhi Leonard will not participate in drills at training camp next week as he recovers from the knee inflammation that plagued him during last season’s play-offs.\nLeonard, 33, played just two games in the Clippers’ first-round series with the Dallas Mavericks, who prevailed 4-2 and went on to reach the NBA Finals.\nThe Athletic reported on Sept 24 that Leonard then underwent a knee procedure during the off-season.\nEven though the swelling in Leonard’s knee has gone down “significantly”, according to Clippers president Lawrence Frank, they are still unsure if he will be good to go for Los Angeles’ season opener against the Phoenix Suns on Oct 23. AFP, REUTERS", "url": "https://www.straitstimes.com/sport/basketball/lakers-ponder-when-lebron-james-will-share-court-with-son-bronny"}