{"authors": [], "date_download": "2024-10-12 13:35:59", "date_modify": "2024-10-12 13:35:59", "date_publish": "2024-10-06 12:58:03", "description": "Hugo Auradou, 21, was arrested along with La Rochelle flanker Oscar Jegou in July. Read more at straitstimes.com.", "filename": "sport_french-rugby-player-on-rape-charge-whistled-but-serene-on-return_1728740159.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/06/RUGBYU-FRA-TOP14-PERPIGNAN-PAU-170155.jpg?VersionId=h1un.Bgw_Nlt7KBsPgEwQHLYtrOlJRt_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_french-rugby-player-on-rape-charge-whistled-but-serene-on-return_1728740159.html", "title": "French rugby player on rape charge whistled but ‘serene’ on return", "title_page": "French rugby player on rape charge whistled but ‘serene’ on return | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – France lock Hugo Auradou was described as being “serene” by Pau head coach Sebastien Piqueronies on Oct 5, despite being whistled off the pitch in his first match since being accused of rape in Argentina.\nAuradou, 21, was arrested along with La Rochelle flanker Oscar Jegou in July after winning their first French caps against Argentina in Mendoza. Both men deny rape and were allowed to return home in September.\nOn Oct 4, Argentinian prosecutors recommended dismissing the charges against the two players.\n“He was serene and determined,” Piqueronies told reporters after Pau lost 11-10 in a French Top 14 match at Perpignan.\n“He played very well, efficient like he was last season. The crowd’s welcome? We had no specific worries about it.”\nDespite his frosty reception, some Perpignan fans were indifferent over Auradou’s return to action.\n“As long as he’s presumed innocent, I don’t see why he can’t play again,” said long-time Perpignan season-ticket holder Robert, who gave only his first name.\n“Nothing stops him from doing his job and his job is to play rugby.”\nAuradou started the game and his first real contribution came when he caught a 10th-minute lineout five metres from the Perpignan line but Pau were penalised and the hosts cleared.\nSeven minutes later, he had his first touch in open play but was tackled by Perpignan’s English prop Kieran Brookes.\nWith six minutes to go, Auradou was replaced by Thomas Jolmes with the traditionally vocal Perpignan crowd whistling from the stands as their side trailed 10-8.\nWith Auradou off the field, the home side’s Antoine Aucagne kicked an 84th-minute penalty to claim victory.\nMeanwhile, Jegou’s La Rochelle beat Lyon 43-22 on Oct 5 but the back-rower has yet to make his playing return despite training with the two-time Champions Cup winners.\nEarlier, Fiji winger Vinaya Habosi scored as Racing 92 beat promoted Vannes 27-24, three weeks after he was arrested following allegations of domestic violence.\nHabosi was quizzed after witnesses claimed the 24-year-old had pushed and hit his wife. The allegations were confirmed to the police by his wife at the time.\nHe was disciplined by the Parisian club and ordered to attend a domestic violence course.\nA second win in five games this season reduced the pressure on Racing coach Stuart Lancaster, the former England boss.\nVannes, in their maiden top-flight season, stay bottom after their fourth defeat of the campaign.\nElsewhere, Antoine Dupont’s former side Castres came from behind to beat the superstar scrum-half’s current club Toulouse 28-23 as the 27-year-old remained absent.\nDupont has spent the final week of his post-Olympic gold medal holidays in the United States, where he met Argentina football icon Lionel Messi in Miami.\nToulouse led 20-11 at the break as the champions lost a second straight game following their surprise home defeat by Bordeaux Begles on Sept 29. AFP", "url": "https://www.straitstimes.com/sport/french-rugby-player-on-rape-charge-whistled-but-serene-on-return"}