{"authors": ["Maximilian Oh"], "date_download": "2024-10-12 13:43:26", "date_modify": "2024-10-12 13:43:26", "date_publish": "2024-07-10 16:53:32", "description": "The 16-year-old is being lauded as 'a genius' after scoring against France in their Euro 2024 semi-final clash. Read more at straitstimes.com.", "filename": "sport_football_5-things-to-know-about-spanish-football-sensation-lamine-yamal_1728740606.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/10/11469350.jpg?VersionId=uqvqu.0r0pLBFU4glpzFB3lA4b5JzGAP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_5-things-to-know-about-spanish-football-sensation-lamine-yamal_1728740606.html", "title": "5 things to know about Spanish football sensation Lamine Yamal", "title_page": "5 things to know about Spanish football sensation Lamine Yamal | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Teenager Lamine Yamal has been lauded as “a genius” by Spain coach Luis de la Fuente after the 16-year-old stepped up to deliver the equaliser in their Euro 2024 semi-final against France.\nThe Barcelona winger scored a sensational goal to level matters after Randal Kolo Muani gave Les Bleus an early 1-0 lead with an eighth-minute header. His performance on the pitch also earned him the Man of the Match accolade, after the Spaniards went on to win 2-1.\nWho is this Spanish sensation who is making headlines for his Euro 2024 feats?\n1. Young history maker\nYamal’s strike in the 21st minute made him the youngest-ever goalscorer in the history of the European Championship. But the youngster already had a place in the history books even before Euro 2024.\nThe La Liga player became the league’s and Barcelona’s youngest goalscorer on Oct 8, 2023, scoring his maiden goal in a 2-2 draw against Granada.\nHis performance also earned him Tuttosport’s Golden Boy The Youngest accolade for 2023 as the youngest player nominated for the Under-21 award. Fittingly, he missed the ceremony as he had to go to school. He is in contention to clinch the Golden Boy title in 2024 – previous winners include Lionel Messi, Erling Haaland and Kylian Mbappe.\n2. Sensational Euro debut\nThe young winger received his first international call-up to the senior team in the Euro 2024 qualifiers, making his debut in their 7-1 victory against Georgia, where he scored in the 74th minute.\nHis performance in the qualifying stages earned him a spot on the 26-man Euro 2024 squad – making him the youngest player to feature in the tournament.\n3. Mini Messi\nYamal’s technical abilities and La Masia background have earned him comparisons to former Barcelona superstar Lionel Messi.\nBoth players also share a unique connection. A picture of Messi, then 20, cradling a six-month-old Yamal has recently surfaced online. It was taken during a calendar photoshoot in 2007 for a charity drive by a local newspaper and Unicef.\nYamal’s father posted the photo on Instagram last week, with the caption “The beginning of two legends”.\n4. Juggling school and football\nThe teenager has also been working hard on his studies during the tournament, and he has a tutor who assigns him homework.\nDuring Euro 2024, it was reported that he had passed his school exams and can now pursue the Spanish Baccalaureate, if he chooses to go to university.\n5. Remembering his roots\nYamal grew up in Mataro, Catalonia, before moving to Barcelona with his family when he was seven.\nHis goal celebrations, making the number “304” with his fingers, is a tribute to his home town — the neighbourhood of Rocafonda in Mataro has the postal code 08304.", "url": "https://www.straitstimes.com/sport/football/5-things-to-know-about-spanish-football-sensation-lamine-yamal"}