{"authors": [], "date_download": "2024-10-12 13:42:50", "date_modify": "2024-10-12 13:42:50", "date_publish": "2023-12-31 01:13:15", "description": "Everton suffered their third defeat in a row, to sit one point above the relegation zone in 17th. Read more at straitstimes.com.", "filename": "sport_football_wolves-end-2023-on-high-with-3-0-win-over-everton_1728740570.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/31/2023-12-30T163059Z1698173150UP1EJCU19VMGPRTRMADP3SOCCER-ENGLAND-WLV-EVE-REPORT.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_wolves-end-2023-on-high-with-3-0-win-over-everton_1728740570.html", "title": "Wolves end year on high with 3-0 win over Everton", "title_page": "Wolves end year on high with 3-0 win over Everton | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "WOLVERHAMPTON, England - Wolverhampton Wanderers outclassed Everton 3-0 in the Premier League on Dec 30 to extend their unbeaten run at home to eight games with goals from Maximilian Kilman, Matheus Cunha and Craig Dawson.\nThe victory moved 11th-placed Wolves to 28 points from 20 matches while Everton suffered their third defeat in a row, to sit one point above the relegation zone in 17th.\nWolves took the lead in the 25th minute when Cunha’s cross into the box found Dawson, whose attempt was blocked by Everton keeper Jordan Pickford.\nA goalmouth scramble ensued before Kilman slotted home and he celebrated his first goal of the season by holding up the jersey of team mate Mario Lemina, who missed the game following the death of his father.\n“That game was for (Lemina). He has been brilliant and it’s really tough what he’s going through. He deserved it,” Kilman said.\n“I’m happy to score of course, but the main thing is the win and the clean sheet. We have a long way to go and we can still improve so we just need to keep going.”\nWolves doubled their lead early in the second half when Pablo Sarabia’s defence-splitting diagonal pass found Hwang Hee-chan darting into the box and the South Korea international set up Cunha with a cross for a close-range finish.\nCunha, who has scored six goals league goals this season, then turned provider as he set up Dawson for the third on the hour-mark.\nWolves found the net twice more, but both Hwang and Pedro Neto had their efforts chalked off for offside.\nEverton failed to have a single shot on target, their best chance coming in the second half when Dwight McNeil’s long-ranger hit the woodwork.\nEverton, who started December with a four-match win streak, ended an exhausting month, in which they also exited the League Cup, with three straight league losses.\n“They have turned into a good side and have worked hard to become one, especially at home. We have asked a lot of the players. The fixture list is unkind,” Everton boss Sean Dyche said.\n“We have just come off the back of a run of games with injuries. We lacked that bit of fizz and energy to take the game on. We fell short with the physicality of the game.\n“They played really well and exposed moments when we looked jaded. We’ve done it to others ourselves and they did it to us today.” REUTERS", "url": "https://www.straitstimes.com/sport/football/wolves-end-2023-on-high-with-3-0-win-over-everton"}