{"authors": [], "date_download": "2024-10-12 13:41:32", "date_modify": "2024-10-12 13:41:32", "date_publish": "2024-08-18 06:01:21", "description": "Keshav Maharaj took three wickets to lead South Africa to a 40-run win over West Indies in the second test in Georgetown on Saturday and become his country’s most successful spin bowler. Read more at straitstimes.com.", "filename": "sport_maharaj-leads-s-africa-to-series-win-over-west-indies_1728740492.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/18/CRICKET-RSA-WIS-2NDTEST-153301.jpg?VersionId=tzbCy8yTDkUwrYEoe7vdF6WROKHGWTOm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_maharaj-leads-s-africa-to-series-win-over-west-indies_1728740492.html", "title": "Three wickets from Keshav Maharaj help South Africa to cricket series win over West Indies", "title_page": "Three wickets from Keshav Maharaj help South Africa to cricket series win over West Indies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Keshav Maharaj took three wickets to lead South Africa to a 40-run win over West Indies in the second test in Georgetown on Saturday and become his country’s most successful spin bowler.\nSouth Africa completed victory inside three days after bowling West Indies out for 222, having set them a target of 263 to win the match.\nThe rain-affected first game in Trinidad was drawn but the second test victory means South Africa have won 10 successive series against the Windies.\nMaharaj, named man of the series, finished with 3-37, going past Hugh Tayfield’s tally of 170 test wickets to set a new standard for South African spin bowling.\nFast bowler Kagiso Rababa, who also took three wickets, is now on 299 test victims.\nIt was a close call for the touring side in a low scoring match as the Windies fell agonisingly short.\nThey begun their chase with more than two days to play, but lost opener Mikyle Louis cheaply for four as he nicked a catch to Wiaan Mulder at slip off Rabada.\nCaptain Kraigg Brathwaite was the next man out but not before adding 42 runs with Keacy Carty for the second wicket.\nWhen the experienced Jason Holder fell without scoring to leave west Indies on 104-6, it looked an uphill task for the home team.\nJoshua da Silva and Gudakesh Motie, however, shared the best Windies partnership of the series, adding 77 runs to reduce the target to 82, before Motie was lbw to Maharaj for a test-best 45.\nMaharaj trapped Da Silva lbw for 27 and a brilliant one- handed diving catch from skipper Temba Bavuma sent back Shamar Joseph before Maharaj had Jayden Seales was caught by close-in fielder David Bedingham.\nSouth Africa had resumed in the moring on 223-5 with a 239-run lead but the 22-year-old Seales ran through the tail to return test best figures of 6-61 as the last five wickets fell for 22 runs. REUTERS", "url": "https://www.straitstimes.com/sport/maharaj-leads-s-africa-to-series-win-over-west-indies"}