{"authors": ["David Lee"], "date_download": "2024-10-12 13:42:00", "date_modify": "2024-10-12 13:42:00", "date_publish": "2024-07-31 18:05:03", "description": "She fell 4-2 (9-11, 12-10, 11-4, 11-5, 10-12, 12-10) to India’s Sreeja Akula. Read more at straitstimes.com.", "filename": "sport_singapore-out-of-olympic-table-tennis-after-zeng-jian-loses-in-round-of-32_1728740520.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/btzeng20240731.jpg?VersionId=PM_3R.8ZHp.eiLFO8AMlSHJR4Q71XfyS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-out-of-olympic-table-tennis-after-zeng-jian-loses-in-round-of-32_1728740520.html", "title": "Singapore out of Olympic table tennis after Zeng Jian loses in round of 32", "title_page": "Singapore out of Olympic table tennis after Zeng Jian loses in round of 32 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Twice, Singapore’s Zeng Jian squandered game points during her Olympic round-of-32 table tennis match against India’s Sreeja Akula on July 31.\nThe world No. 52, who led 10-9 in the second and sixth games, ended up losing both in a 4-2 defeat, which spelled the end of the Republic’s run in the sport at Paris 2024.\nZeng had beaten Akula 3-0 at the 2023 Asian Championships, but lost 9-11, 12-10, 11-4, 11-5, 10-12, 12-10 at the South Paris Arena and fell short of her last-16 target.\nThe 27-year-old had pipped Croatia’s 73rd-ranked Ivana Malobabic 4-3 on July 28, but found it tougher against long-pimple blocker Akula.\nZeng said: “I settled down faster but couldn’t adapt fast enough to the changes she made, when her short and long shots restricted me and put me in awkward positions.\n“It is always not easy against the Indians who play with unorthodox rubbers, and my opponent has improved tremendously to move up from 88th to 25th in the world rankings. I found a way back in the fifth but she was more decisive at the crucial points.”\nAdding that her weaknesses were “magnified” on sport’s biggest stage, the Olympic debutante said she hopes to get another shot at the Games.\nWith fellow debutants Izaac Quek and Zhou Jingyi having also exited in their respective round-of-64 matches, national women’s coach Jing Junhong is looking ahead to Los Angeles 2028.\nSingapore has three Olympic table tennis medals, from Beijing 2008 (silver in women’s team) and London 2012 (bronzes in women’s singles and team), but these were fuelled by the Foreign Sports Talent Scheme.\nIn recent years, the Singapore Table Tennis Association has moved away from this approach to groom home-grown talent, with Zeng the last of the naturalised China-born players.\nThere has been some success at the South-east Asian level, while Zhou and Quek also qualified for Paris 2024 as teenagers. For the women’s team, there are also up-and-comers like Ser Lin Qian, 18, and Loy Ming Ying, 14.\nBut there have also been speed bumps, such as the retirement of 22-year-old Wong Xin Ru, a key member of the women’s team and mixed doubles.\nJing said: “We have established developmental pathways but while the ecosystem has already improved a lot, we can still do better to create an even more conducive environment where players do not have much to worry about. But there are still things that are out of our control, such as injury and family pressure.”\nAdding that “you do not always reap what you sow”, she said: “Look at China, they can invest and train so much, but their world No. 1 can also lose. We need to give our youngsters time and opportunities, but I hope they will have dreams and persistence.”\nShe was referring to China’s top-ranked Wang Chuqin, who lost 4-2 (12-10, 11-7, 5-11, 7-11, 11-9, 11-6) to Sweden’s world No. 26 Truls Moregard in the men’s singles earlier in the session.\nMoregard, 22, had lost all their previous eight meetings, but stunned his more illustrious opponent and whipped the crowd into a frenzy as a dejected Wang walked off alone.\nHe must have wondered if things would have been different had a photographer not accidentally stepped on his bat and damaged it after he won the mixed doubles gold with Sun Yingsha a day earlier.\nHis compatriot Fan Zhendong reached the last 16 after beating Hong Kong’s Wong Chun Ting 4-1 (11-5, 11-5, 9-11, 11-6, 11-3). But for a powerhouse that has won 33 out of 38 Olympic table tennis gold medals since the sport was introduced at Seoul 1988, this is the first time they will not have two men’s singles medallists at a Games since Barcelona 1992.\nWang, who lost his cool after losing his main bat and had to be held back by his coach, said after his defeat: “It’s because I wasn’t good enough today. It’s got nothing to do with the bat. I’ll reflect on this loss, and come back strong for the team event.”", "url": "https://www.straitstimes.com/sport/singapore-out-of-olympic-table-tennis-after-zeng-jian-loses-in-round-of-32"}