{"authors": [], "date_download": "2024-10-12 13:42:42", "date_modify": "2024-10-12 13:42:42", "date_publish": "2024-01-31 21:42:31", "description": "He missed training on Jan 26 after reportedly being spotted at nightspots in Belfast. Read more at straitstimes.com.", "filename": "sport_football_case-closed-on-rashford-incident-says-ten-hag_1728740562.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/01/2024-01-14T170622Z457127490UP1EK1E1BIKSJRTRMADP3SOCCER-ENGLAND-MUN-TOT-REPORT.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_case-closed-on-rashford-incident-says-ten-hag_1728740562.html", "title": "Case closed on Rashford incident, says Man United’s Ten Hag", "title_page": "Case closed on Rashford incident, says Man United’s Ten Hag | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANCHESTER, England - Manchester United Erik ten Hag wants to draw a line under the Marcus Rashford story, saying the forward has taken ownership of the behaviour that had him dropped from their Jan 28 FA Cup match.\nThe 26-year-old missed training on Jan 26 and was absent from the Jan 28 4-2 FA Cup fourth-round win against Newport County, after he had reportedly been spotted at nightspots in Belfast earlier in the week.\n\"He has taken responsibility and for the rest it is an internal matter,\" Ten Hag told reporters on Jan 31. \"Case closed.\"\nUnited will have goalkeeper Andre Onana on Feb 1 when they play at Wolverhampton Wanderers. Onana featured in just one of Cameroon's four games at the Africa Cup of Nations, where they went out in the last 16.\nRashford has had a difficult season, scoring four goals after his career-high 30 in 2023. Ten Hag was asked if the player's behaviour shows a lack of respect for the club.\n\"It is nothing to do with that,\" the manager said. \"Let's focus on the game... we have to focus on winning football games.\n\"In football you need discipline on the pitch but also off the pitch -- there is a line between. Every professional knows what is required. We have to focus on winning football games, that's all that matters. Every top professional knows what is required.\"\nOn the plus side, Ten Hag highlighted the fact that Rashford has scored in each of their last two league games -- a 2-1 loss to Nottingham Forest and 2-2 draw with Tottenham Hotspur -- in addition to getting an assist.\n\"He is developing a strong bond with (fellow forward) Rasmus Hojlund and we want to continue that process,\" Ten Hag added.\nUnited slipped to ninth in the Premier League standings after Newcastle United's win over Brighton & Hove Albion on Jan 30, and they are languishing 11 points back of fourth-place Aston Villa. Wolves are 11th.\nDespite their struggles, Ten Hag said his side does not lack confidence.\n\"On our best days we can beat anyone, but on our worst days we go down to certain limits that aren't acceptable,\" he said. \"We have to push our limits to higher levels so that also on our worst days we can get results in.\n\"Everyone in the squad is very convinced about this and they know that players are returning from long-term injuries so the team will be stronger. That helps motivation, mood and spirit in the team.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/case-closed-on-rashford-incident-says-ten-hag"}