{"authors": [], "date_download": "2024-10-12 13:40:55", "date_modify": "2024-10-12 13:40:55", "date_publish": "2024-04-03 04:42:23", "description": "NOTTINGHAM, England - Three first-half goals earned Nottingham Forest a vital 3-1 victory over Fulham in their battle to stay away from the Premier League relegation zone on Tuesday. Read more at straitstimes.com.", "filename": "sport_football_forest-edge-away-from-drop-zone-with-vital-win-against-fulham_1728740455.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/03/LYNXNPEK310SL-1.jpg?VersionId=XaMjFqDVa29VKgUFPyGMyJiNSMTaNQVv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_forest-edge-away-from-drop-zone-with-vital-win-against-fulham_1728740455.html", "title": "Forest edge away from drop zone with vital win against Fulham", "title_page": "Forest edge away from drop zone with vital win against Fulham | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NOTTINGHAM, England - Three first-half goals earned Nottingham Forest a vital 3-1 victory over Fulham in their battle to stay away from the Premier League relegation zone on Tuesday.\nThe hosts were irrepressible in the first period with Callum Hudson-Odoi opening the scoring after nine minutes and Chris Wood doubling Forest's advantage in the 19th minute.\nStunned Fulham manager Marco Silva made a triple substitution but it got worse for the visitors before the interval as the outstanding Morgan Gibbs-White made it 3-0 in stoppage time with a clinical finish.\nFulham reacted well in the second half and threw themselves a lifeline when Tosin Adarabioyo headed in from a corner.\nBoth sides hit the woodwork but despite a few jitters Forest held firm to move to 25 points, three ahead of Luton Town who occupy the last relegation place.\nForest were left deep in trouble when they were docked four points last month for breaching Premier League financial rules.\nBut they have responded impressively to that setback with a draw against Crystal Palace at the weekend followed by Tuesday's win over Fulham courtesy of a barnstorming first half.\n\"One of the best starts we've had in terms of the way we attacked and the overall balance,\" Forest manager Nuno Espirito Santo said. \"We still have to regret some aspects but let's not ignore the things we did very well.\"\nEspirito Santo praised Gibbs-White, saying he is the complete midfielder, and the Forest fans who roared their team on from the first minute to the last.\n\"It's too bad we can't always play at City Ground!\" he said. \"The noise they make and the help they give us, they deserve this moment so much. We've been trying hard to give them this happiness so let's try to enjoy it.\n\"But there's a long way to go.\"\nForest were fired up by a vociferous crowd and took the lead inside 10 minutes as Gibbs-White's ball released Hudson-Odoi down the left and the former Chelsea player cut back inside to dispatch a shot past Fulham keeper Bernd Leno.\nHudson-Odoi wasted another chance shortly afterwards after more good work by Gibbs-White but Forest extended their lead when Wood caught Leno off guard with a cleanly-struck shot from the edge of the area.\nAnthony Elanga should have made it 3-0 after yet more clever approach play by Forest and with Fulham being overwhelmed, manager Marco Silva hauled off Alex Iwobi, Sasa Lukic and Harry Wilson with Adama Traore, Tom Cairney and Willian coming on.\nForest were relentless going forward though and Gibbs-White rounded off a sensational half with a shot into the far corner to send the Forest fans into raptures.\nAdarabioyo's header soon after the restart caused some concern in the home ranks but Forest were soon firing again with Neco Williams having a shot deflected against the crossbar.\nFulham were much improved though and had Kenny Tete's header gone in instead of glancing off the crossbar it would have ensured a nerve-jangling finale.\nWhile Forest have opened up a little gap on Luton who travel to Arsenal on Wednesday, they are still in trouble.\n\"We've had good performances before and not been able to sustain them so let's take that into this game and try to sustain the performance,\" Espirito Santo said. REUTERS", "url": "https://www.straitstimes.com/sport/football/forest-edge-away-from-drop-zone-with-vital-win-against-fulham"}