{"authors": [], "date_download": "2024-10-12 13:40:29", "date_modify": "2024-10-12 13:40:29", "date_publish": "2024-04-29 01:44:16", "description": "City's final four games are against Wolverhampton Wanderers, Fulham, Tottenham Hotspur and West Ham United. Read more at straitstimes.com.", "filename": "sport_football_manchester-city-keep-pressure-on-arsenal-with-2-0-win-over-forest_1728740429.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/29/LYNXMPEK3R07D-1.jpg?VersionId=8X1VIb1WSfYYEI6yJ4fErIWH4gNu4EaR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_manchester-city-keep-pressure-on-arsenal-with-2-0-win-over-forest_1728740429.html", "title": "Manchester City keep pressure on Arsenal with 2-0 win over Forest", "title_page": "Manchester City keep pressure on Arsenal with 2-0 win over Forest | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NOTTINGHAM, England - Manchester City took another step in their bid to win a fourth consecutive Premier League title with a 2-0 victory over relegation-threatened Nottingham Forest on April 28, with Josko Gvardiol and Erling Haaland on target.\nPep Guardiola's men kept the pressure on leaders Arsenal, pulling to within a point of the Gunners -- who held on to win 3-2 at Tottenham Hotspur earlier in the day -- in the table with a game in hand.\n\"I think the most important thing is to not think (about the title race), especially these moments, but take it day by day,\" Haaland told Sky Sports. \"Honestly if you overthink, you're going to be crazy in your head, so relax now, enjoy, focus on the next one.\"\nForest had matched City in a nervous first half at the sundrenched City Ground before Gvardiol got the holders on the scoreboard with his second career league goal when he headed in Kevin De Bruyne's corner kick from the near post in the 32nd minute. Forest had only 10 men on the pitch at the time following an injury to Neco Williams.\n\"We need to be focused on ourselves, and that's what we're doing,\" Gvardiol told Sky of the title race. \"Four more finals until the end.\"\nHaaland made a quick impact when he entered the game as a substitute in his first action since missing two matches with a muscle injury.\nThe Norwegian took a pass from De Bruyne in the 71st minute, took three steps, then launched it into the far corner for a league-leading 21st goal of the season. He had previously been level with Chelsea's Cole Palmer.\nForest, who are a point above the drop zone in 17th, looked little like a team facing potential relegation and had travelling City fans -- including musician Noel Gallagher -- breathing sighs of relief at several times.\nThe home side had 14 shots to City's 11, including an absolute sitter that a wide open Chris Wood missed when he got his feet tangled up in front of the net.\nForest have won just two of their last 15 league games, going back to Dec. 30.\nCity's Stefan Ortega replaced keeper Ederson at halftime. The visitors were also missing Phil Foden, who scored five goals in his previous two league appearances, to illness.\nCity's final four games are against Wolverhampton Wanderers, Fulham, Tottenham Hotspur and West Ham United. REUTERS", "url": "https://www.straitstimes.com/sport/football/manchester-city-keep-pressure-on-arsenal-with-2-0-win-over-forest"}