{"authors": [], "date_download": "2024-10-12 13:52:31", "date_modify": "2024-10-12 13:52:31", "date_publish": "2024-01-29 08:36:41", "description": "Tajikistan coach Petar Segrt is warm and affable with a booming voice but after gaining popularity for his charm at the Asian Cup, he is now turning heads after his side's dream run to the quarter-finals. Read more at straitstimes.com.", "filename": "sport_football_from-small-fry-to-dark-horses-coach-segrt-makes-tajikistan-dream-at-asian-cup_1728741151.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/29/LYNXMPEK0S00D-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_from-small-fry-to-dark-horses-coach-segrt-makes-tajikistan-dream-at-asian-cup_1728741151.html", "title": "From small fry to dark horses, coach Segrt makes Tajikistan dream at Asian Cup", "title_page": "From small fry to dark horses, coach Segrt makes Tajikistan dream at Asian Cup | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA - Tajikistan coach Petar Segrt is warm and affable with a booming voice but after gaining popularity for his charm at the Asian Cup, he is now turning heads after his side's dream run to the quarter-finals.\nThe only team making their debut at the tournament in Qatar, Tajikistan were the competition's minnows and were barely given a second look when the 24-team group stage got underway.\nBut they shocked the continent by first reaching the knockout stage before delivering the upset of the tournament by eliminating the United Arab Emirates on penalties in the last 16 on Sunday.\n\"We are now the dark horses in this tournament. Nobody knows how far we can go. I have no limits for my players, they've surprised me again,\" the 57-year-old Segrt told reporters.\nA well-travelled coach who has taken charge of teams such as Georgia, Afghanistan and Maldives, the Croatian has become a national hero in Tajikistan in the past week.\nHis demeanour and showmanship came across as a ploy to shift the limelight away from his young squad, and the tactic has clearly worked.\n\"It's like when you have children, you must wait for the right moment,\" Segrt had said when he was asked whether his personality protected his team during the group stage.\n\"Now they are ready... I will still try to put all the pressure on me, but they must work like adults and do it themselves.\"\nConceding only one goal against Qatar, a comeback win over Lebanon and nearly beating UAE in 90 minutes before dumping them out in the shootout is proof that his team is perhaps better than their ranking of 106 would suggest.\n\"We are among the eight best teams in Asia,\" said Segrt, whose side will next face either Iraq or Jordan.\nCENTRE OF ATTENTION\nCroatia's Segrt makes a point of shaking everyone's hand in the room before his press conferences.\nIt is something he says he has done out of respect for 27 years.\n\"I come from a very poor (background), a very difficult situation in old Yugoslavia and in Germany. I learned to respect everybody because for me, as a child it was very difficult,\" he said.\n\"I never forget where I come from... I think I have an honest soul, this is my most important thing.\"\nHis style of management has clearly struck a chord with his young players, who engulfed him and broke his glasses when they qualified for the last-16.\n\"He's very positive every time, very kind. But he knows when he has to be friendly and kind, and when he has to be hard and strict towards us,\" Tajikistan defender Zoir Dzhuraboev said.\nWhen some players sat on the turf in the dugout before the shootout against the UAE, Segrt sternly asked them to get back on their feet and present a united front, standing shoulder to shoulder.\n\"I think the most important thing is to make harmony between people,\" he said. \"A coach who can make and bring harmony to the people, this is a good coach and a successful coach.\"\nSegrt's contract runs out after the Asian Cup but there is no question where his loyalty lies.\n\"We'll see in the next few days but I must say that Tajikistan is my first country,\" he said. REUTERS", "url": "https://www.straitstimes.com/sport/football/from-small-fry-to-dark-horses-coach-segrt-makes-tajikistan-dream-at-asian-cup"}