{"authors": [], "date_download": "2024-10-12 14:00:39", "date_modify": "2024-10-12 14:00:39", "date_publish": "2024-08-04 02:45:14", "description": "PARIS - Croatia's Donna Vekic had so many misadventures on her way to the Olympics, including \\\"pain everywhere\\\", a plane delay and illness, that she said walking away with the Olympic tennis women's singles silver medal on Saturday was \\\"incredible\\\". Read more at straitstimes.com.", "filename": "sport_tennis_tennis-croatias-vekic-calls-silver-medal-incredible-after-series-of-mishaps_1728741639.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/04/LYNXMPEK7209B-2.jpg?VersionId=U5Gsze5c0TCJYvBoFP8GIv84um8ptCyY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_tennis-croatias-vekic-calls-silver-medal-incredible-after-series-of-mishaps_1728741639.html", "title": "Tennis-Croatia's Vekic calls silver medal 'incredible' after series of mishaps", "title_page": "Tennis-Croatia's Vekic calls silver medal 'incredible' after series of mishaps | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Croatia's Donna Vekic had so many misadventures on her way to the Olympics, including \"pain everywhere\", a plane delay and illness, that she said walking away with the Olympic tennis women's singles silver medal on Saturday was \"incredible\".\nThe 21st-ranked Vekic, who reached the Wimbledon semi-finals, lost 6-2 6-3 to China's Zheng Qinwen in a tense final.\nVekic, who had knee surgery in 2021, was so disillusioned before this year's French Open that she nearly quit the sport and then considered pulling out of the Olympics.\n\"After the Wimbledon semi-finals, I had so much pain everywhere that I was debating going to the Olympics because I thought 'in these conditions, there is no way I can win a medal',\" Vekic told reporters.\n\"I had pain in my arm, pain in my ankle. I was sick. Everything was happening all at once, and when we came here, first our flight was cancelled. We arrived late. Everything was going wrong,\" the 28-year-old Croat added.\n\"When we had our first practice, I told my coach I was coughing so bad I couldn't hit two shots in a row. One week later, we have a medal. So it's been absolutely, absolutely incredible,\" she said.\nThe motivation came from trying to get on the podium for her country, she said.\nZheng and Vekic were bidding to bring home their country's first tennis singles gold medal.\n\"When you play for your country, it's definitely a little bit more special. It's completely giving it 200 percent,\" Vekic said.\nThe Croat had lost in the singles third round in her first Olympic appearance in Tokyo. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/tennis-croatias-vekic-calls-silver-medal-incredible-after-series-of-mishaps"}