{"authors": ["David Lee"], "date_download": "2024-10-12 13:43:46", "date_modify": "2024-10-12 13:43:46", "date_publish": "2023-11-20 17:36:45", "description": "He won gold in the men's gunshu to add to a silver, S'pore claim best-ever haul at the tournament. Read more at straitstimes.com.", "filename": "sport_singapore-wushu-exponent-jowen-lim-overcomes-calamity-to-become-gunshu-world-champion_1728740626.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/20/8df87f11-c5f2-4549-97c8-0fcabfe78b77.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-wushu-exponent-jowen-lim-overcomes-calamity-to-become-gunshu-world-champion_1728740626.html", "title": "Singapore wushu exponent Jowen Lim overcomes calamity to become gunshu world champion", "title_page": "Singapore wushu exponent Jowen Lim overcomes calamity to become gunshu world champion | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – For six years, Singapore wushu exponent Jowen Lim had not put a foot wrong in international competitions, but a poor landing in the men’s changquan (long fist) event at the World Wushu Championships ended his hopes for a medal on Nov 18.\nAlready a silver medallist in the men’s daoshu (broadsword), he was attempting a difficult 720-degree turn when it went awry and a poor score of 9.470 sent him tumbling down the rankings to 28th in the event.\nThe 24-year-old was moody and withdrawn for the rest of the day, but bounced back in style in the men’s gunshu (cudgel) at the Fort Worth Convention Centre in Texas, United States, on Nov 19 to claim his first world championship title.\nLim scored 9.823 points in the event and managed to fend off Indonesia’s Seraf Siregar via the tie-breaker after both posted identical scores, while Malaysia’s Clement Ting took the bronze in 9.803. Another Singaporean Ong Zi Meng was eighth (9.776).\nThe Asian Games daoshu and gunshu silver medallist told The Straits Times: “I’m beyond happy and I’m so relieved. Ever since I joined the national team at the age of 10, it has always been my goal to win a medal at the Asian Games and become a world champion, and I achieved both this year.\n“I’ve had very good momentum building up to this point, and I made no mistakes during the warm-up, which I was able to replicate during the actual performance.\n“This was a big difference from the disappointment I felt after the changquan event as that was my first mistake in competition since 2017. But I told myself I still have the gunshu, which is more of a pet event than the changquan, so I needed to get back into the zone, and I’m glad I managed to do so.\nLim had picked up wushu when he was six, after being enthralled by martial art films, and grew to enjoy practising and travelling around the world for competitions.\nIn 2023, the business undergraduate and Sport Excellence Scholarship holder took a leave of absence after one semester to focus on training and competing full-time.\nHe said: “I’m blessed to be getting paid to do what I love. Even though I am the gunshu world champion now, the daoshu is also one of my pet events, so I would like to work towards becoming the daoshu gold at the next world championships.”\nBack to his bubbly self after completing his final competition of the year, Lim will extend his stay in the US for a well-deserved holiday in Las Vegas with his fiancee, Vera Tan, who clinched a bronze in the women’s taijijian.\nTheir medals are part of Singapore’s record haul of two golds, two silvers and two bronzes, topping the previous best of 1-3-3 in 1995.\nZeanne Law had earlier picked up a gold in the women’s taijiquan, while Tay Yu Xuan and Kimberly Ong claimed a silver in the men’s taijijian and a bronze in the women’s changquan respectively.\nBefore this edition, Singapore had won only four gold medals at the meet. Vincent Ng was Singapore’s first wushu world gold medallist when he won the men’s daoshu event in 1995.\nHe was followed by women’s duilian trio Emily Sin, Tay Yu Juan and Tao Yi Jun in 2011, women’s taijiquan winner Ho Lin Ying in 2013 and men’s xingyiquan champion Tan Xiang Tian in 2015\nSingapore Wushu Dragon and Lion Dance Federation president Ang Mong Seng said: “This best-ever performance at the world championships is the result of the effort and hard work put in by the athletes, team coaches and judges, as well as the unwavering support from the athletes’ parents.\n“We hope that this success will inspire more to be aware of and pick up wushu, and also help give us a good lead up to hosting next year’s world taiji competition in August 2024.”", "url": "https://www.straitstimes.com/sport/singapore-wushu-exponent-jowen-lim-overcomes-calamity-to-become-gunshu-world-champion"}