{"authors": [], "date_download": "2024-10-12 13:43:15", "date_modify": "2024-10-12 13:43:15", "date_publish": "2023-12-17 01:23:05", "description": "Premier League champions stay fourth in the standings after slipping up yet again by squandering two-goal lead. Read more at straitstimes.com.", "filename": "sport_football_olises-late-penalty-gives-crystal-palace-unexpected-2-2-draw-with-manchester-city_1728740595.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/17/LYNXMPEJBF05A-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_olises-late-penalty-gives-crystal-palace-unexpected-2-2-draw-with-manchester-city_1728740595.html", "title": "Michael Olise’s late penalty gives Crystal Palace unexpected 2-2 draw with Man City", "title_page": "Michael Olise’s late penalty gives Crystal Palace unexpected 2-2 draw with Man City | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANCHESTER, United Kingdom - Michael Olise scored a stoppage-time penalty as Crystal Palace clawed back from two goals down to draw 2-2 with Manchester City in the Premier League at the Etihad Stadium on Dec 16.\nThe draw kept City, who were without their league-leading scorer Erling Haaland due to a foot injury, in fourth place in the table on 34 points after a run of six games with only one win, and manager Pep Guardiola covered his face in frustration as the final whistle blew.\nPalace are 15th with 17 points, eight above the drop zone.\n“I think it was an unbelievable result,” keeper Dean Henderson, who was playing his first league game for Palace, told the BBC.\n“Manchester City are a world-class team and you’ve just got to try to stay in the game as long as you can and hopefully catch them on the break which we did.\n“We stuck to the game plan. The manager (Roy Hodgson) was unbelievable with the messages through the week. The boys deserve all the credit because it’s hard work against them.”\nWith the visitors trailing 2-0, Jean-Philippe Mateta pulled one goal back for them when he scored from close range in the 76th minute.\nPalace were awarded a penalty in the 95th minute, to boos from the Etihad crowd, after Mateta was taken down by Phil Foden. Olise slotted the ball past City keeper Ederson for the unexpected draw.\n“It’s really unfortunate but we’ve got to look at ourselves and look at our individual decisions and then look at us as a group,” City defender Rico Lewis said.\n“We can’t blame anyone else. We can only blame ourselves for it.”\nCity’s Jack Grealish scored for the third consecutive Premier League match for the first time in his career, in the 24th minute, collecting the ball from Foden and putting it to the left of keeper Dean Henderson. A lengthy VAR review ruled it narrowly onside.\nCity doubled their lead in the 54th minute when the ball was bundled through to Lewis who thumped it into the bottom left corner.\nCity had 19 shots to Crystal Palace’s two, keeping Henderson busy in only his second game of the season after he picked up a thigh injury in September.\n“I loved every minute of it, being back on the pitch,” Henderson said. “It’s been emotional but I’m delighted to be back.”\nJulian Alvarez had a terrific chance with a glancing header that Henderson did well to tip around the post, while Josko Gvardiol sneaked in behind City’s defence for a one-on-one chance but could not put it past Henderson.", "url": "https://www.straitstimes.com/sport/football/olises-late-penalty-gives-crystal-palace-unexpected-2-2-draw-with-manchester-city"}