{"authors": ["David Lee"], "date_download": "2024-10-12 14:12:48", "date_modify": "2024-10-12 14:12:48", "date_publish": "2024-08-01 18:53:18", "description": "The French capital has been nothing short of charming. Read more at straitstimes.com.", "filename": "sport_not-all-gloom-as-parisians-warm-up-to-olympics_1728742368.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/hzpostcard010824.jpg?VersionId=14o4Nf6JCQNx8IQitLkoikkfzjmLPVZg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_not-all-gloom-as-parisians-warm-up-to-olympics_1728742368.html", "title": "Not all gloom as Parisians warm up to Olympics", "title_page": "Not all gloom as Parisians warm up to Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Even before setting foot on French soil, I had been warned about Parisians being aloof, arrogant and unwilling to communicate in English. My friends also told tales of being pickpocketed and robbed.\nMaybe I’m naive, but I’ve always found it unnecessary to be too cautious in a foreign land, as I feel it takes the joy out of visiting a new place. Perhaps it is luck but in assignments in New York, Bahia (Brazil) and Phnom Penh, I loved these places and returned unscathed.\nI’d like to keep my lucky streak and so far, Paris has been nothing short of charming. After enduring a rain-drenched opening ceremony, the gloomy weather has given way to the summer sun.\nIt is by no means perfect. Some metro stations reek of urine, some service staff look like they would rather be elsewhere, and there are volunteers who are not well-versed with information or directions.\nBut there have been redeeming encounters.\nMy colleagues and I appreciated the Uber driver who didn’t cancel on us and patiently waited 15 minutes for us to walk from the swimming arena to his car as some roads were blocked. Another Bolt driver took the initiative to offer water to a coughing colleague.\nAt Porte de la Chapelle, a meeting place for drug addicts that has been spruced up to host the badminton and rhythmic gymnastics, I met Sofian, an Algerian who runs L’arena Pizza that has a Google rating of 4.9 but should be a full five.\nBesides a delectable chicken curry and kebab wrap, he offered me a free serving of frites plus a swig from his personal collection of ginger beer. He also reminded me to not leave my spare phone on the table in a rough neighbourhood.\nThere was the tram driver who stretched his head out of the window to point me in the right direction, and the bus driver who told me I was heading the wrong way but tried to get me back on track as best as he could despite his limited English.\nWith some messy durian – that’s how I butcher the French words merci (thanks) and de rien (it’s nothing, or you’re welcome) – I wasn’t having such a bad time after all.\nAt the nearby Adidas Arena, the capacity home crowd was fully behind Lucas Corvee and Ronan Labar despite the French badminton men’s doubles duo’s thrashing by their Indonesian opponents. They lost, the fans groaned, and promptly gave their players an ovation.\nCandidly, Corvee told me: “Paris is a big city. There’re some bad sides, but there’re also some very good sides. Since the beginning of the Olympics, we can see many happy people and a different view of Parisians, and it is important to remember this. The French fans are patriotic and proud and we are thankful because we can really feel their support.”\nI also had an illuminating chat with a local official at the South Paris Arena, who attributed the unusual uplifting spirit to the “magic of the Games”.\nHowever, this official, who wanted to be known only as Tristan, acknowledged that “every stereotype starts from some truth”, although it can be blown out of proportion.\nHe gave hilarious examples of friends getting told off by a waiter for ordering Coca-Cola after a nice meal, or asking for ketchup to go with an expensive steak.\nHe said: “We can be proud about our food and just don’t want to spoil a meal with the wrong pairing. We can laugh about it, but it can be shocking for some tourists to be at the receiving end.\n“As for the cold vibe, language also plays a part, as we are not excellent in English compared to the Germans and Scandinavians. We are proud of our language and outspoken, but we also engage in less chit-chat compared to Americans. We find it hard to get too close, too casual too quickly when we don’t know someone.\n“We are also regularly ranked one of the most pessimistic countries in the world. We often see things as a glass half-empty, and it is just an environment that we grew up in and pass on.”\nAs if to prove his point, when asked if the positive vibes will linger after the Games, he replied: “Non. All Parisians will fully enjoy this special summer, but two or three weeks of the Games won’t change centuries of culture.”\nBut for now, let me get that half-full glass of Bordeaux to go with my filet mignon.", "url": "https://www.straitstimes.com/sport/not-all-gloom-as-parisians-warm-up-to-olympics"}