{"authors": [], "date_download": "2024-10-12 13:43:03", "date_modify": "2024-10-12 13:43:03", "date_publish": "2024-08-26 20:46:02", "description": "The Swede took charge in 2001 and led them to the quarter-finals of the 2002 and 2006 World Cups, and to the 2004 European Championship. Read more at straitstimes.com.", "filename": "sport_football_former-england-manager-sven-goran-eriksson-dies-at-76_1728740583.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/26/FILES-FBL-SWE-ENG-ERIKSSON-121200.jpg?VersionId=SPXQjGjQ4mE9B3bDcQZUwWCHRhpLyRjd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_former-england-manager-sven-goran-eriksson-dies-at-76_1728740583.html", "title": "Former England football manager Sven-Goran Eriksson dies at 76", "title_page": "Former England football manager Sven-Goran Eriksson dies at 76 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "STOCKHOLM – Swedish football manager Sven-Goran Eriksson, who became the first foreigner to lead the England national team, died on Aug 26 at the age of 76.\nEriksson, a charismatic coach who led Swedish, Portuguese and Italian clubs to major trophies in the 1980s and 1990s during 42 years in the dugout, announced in January that he was terminally ill with pancreatic cancer.\nHis long-time agent Bo Gustavsson said the former Manchester City boss had lost his battle with cancer early on Aug 26, surrounded by his family.\n“We knew it was going to end bad, it all went really fast in the last few weeks,” said Gustavsson.\n“I have been fascinated by him for a long time.\n“He has always been so positive and has had time for others and never thought of himself, and he was that until the very end,” the agent added.\nEriksson took charge of England in 2001 and led the Three Lions to the quarter-finals of the 2002 and 2006 World Cups and 2004 European Championship, managing a golden generation of players, including David Beckham, Paul Scholes, Frank Lampard, Wayne Rooney and Steven Gerrard.\nIn his role as president of the English Football Association (FA), Prince William met Eriksson on many occasions.\n“Sad to hear about the passing of Sven-Goran Eriksson. I met him several times as England manager and was always struck by his charisma and passion for the game. My thoughts are with his family and friends. A true gentleman of the game,” he wrote on X.\nAdded Mark Bullingham, chief of England’s FA, in a statement: “This is a very sad day.\n“He gave all England fans such special memories.\n“Sven will be rightly recognised and forever remembered for his significant work with the England team, and for his wider contribution to the game.”\nIn his native Sweden, where he is known simply as “Svennis”, Eriksson was praised as a great sports leader.\n“Svennis was a soccer innovator and a very popular person who maintained his core values despite all his international success,” Sweden’s Minister of Social Affairs Jakob Forssmed said in a post on X.\nAfter leaving the England job in 2006, Eriksson coached Man City and Leicester City as well as the national sides of Mexico, Ivory Coast and the Philippines, in addition to clubs in China.\nHe fulfilled a career ambition to take charge of a Liverpool team at Anfield when he coached the Reds Legends in a charity match in March.\n“Rest in peace, Sven-Goran Eriksson. The thoughts of everyone at the club are with Sven’s family and friends at this extremely sad time,” Liverpool said on X. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/football/former-england-manager-sven-goran-eriksson-dies-at-76"}