{"authors": ["David Lee"], "date_download": "2024-10-12 14:09:33", "date_modify": "2024-10-12 14:09:33", "date_publish": "2022-11-14 18:36:15", "description": "Nobody was hurt in the incident but the Basketball Association of Singapore wants to ensure the facility is safe before resuming play there. Read more at straitstimes.com.", "filename": "sport_basketball-women-s-national-league-suspended-after-ceiling-light-falls-and-shatters-at-singapore-basketball-centre_1728742173.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/15/svbasketball131122_0.jpg?VersionId=eazgF65roPq_D2oLT6Kf3._VH2t1mlg9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball-women-s-national-league-suspended-after-ceiling-light-falls-and-shatters-at-singapore-basketball-centre_1728742173.html", "title": "Basketball: Women’s national league suspended after ceiling light falls and shatters at Singapore Basketball Centre", "title_page": "Basketball: Women’s national league suspended after ceiling light falls and shatters at Singapore Basketball Centre | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The Women’s National Basketball League (WNBL) literally came to a crashing halt last Saturday night after a spotlight fell from the ceiling during a match between Radin Mas CSC and Siglap White.\nNobody was hurt in the incident but the WNBL has been suspended as organisers search for an alternative venue to resume play.\nThe incident happened in the fourth quarter with Radin Mas leading 43-37 at the Singapore Basketball Centre in Aljunied.\nThe facility is owned by Sport Singapore and is leased to the Basketball Association of Singapore (BAS) for national team training and national league competitions.\nShortly after Siglap’s Jasmin Toh had missed her second free throw and the ball was tipped out of play, the spotlight crashed to the ground just outside the half-court line near the scoring station, to the shock and horror of the players.\nThe officials then halted play before calling off the match. SG Basketball had beaten Blazers 82-69 in an earlier game that passed without incident, while the later match between Kembangan Chai-Chee CSC White and Whye Nam was postponed.\nIn a Facebook post, the BAS wrote: “There was a malfunction with the facilities at the Singapore Basketball Centre. Due to its imposition of risk to spectators and players, we will be rescheduling the rest of the WNBL 2022 until further notice.”\nIt added that ticket holders for Saturday’s matches can get a refund at the BAS office.\nIn response to The Straits Times’ queries, BAS general manager James Soh confirmed the incident, adding that “investigation and rectification work commenced promptly” on Saturday and is still ongoing.\nHe said: “There were approximately 80 people on-site, comprising players, technical officials, spectators and volunteers.\n“Six technical officials and a competition manager were stationed near the scene. No one was injured in the incident.”\nThe WNBL had started on Oct 5, with the first and second rounds scheduled to take place at the Singapore Basketball Centre until Wednesday, before the tournament moves to the Toa Payoh Sports Hall on Sunday for the semi-finals and Nov 27 for the final and third-place play-offs.\nWith the competition now suspended, the fixtures originally slated for last Sunday and Wednesday at the Singapore Basketball Centre have been postponed.", "url": "https://www.straitstimes.com/sport/basketball-women-s-national-league-suspended-after-ceiling-light-falls-and-shatters-at-singapore-basketball-centre"}