{"authors": [], "date_download": "2024-10-12 13:50:08", "date_modify": "2024-10-12 13:50:08", "date_publish": "2024-09-03 02:04:14", "description": "The giant logo was a popular backdrop for selfies by visitors to Paris during the July 28-Aug 11 Games. Read more at straitstimes.com.", "filename": "sport_plan-to-keep-olympic-rings-on-eiffel-tower-sparks-criticism_1728741008.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/bteiffel20240902.jpg?VersionId=MDLvj_Cti108yy1lELgxP_aAm7Gal2ND", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_plan-to-keep-olympic-rings-on-eiffel-tower-sparks-criticism_1728741008.html", "title": "Plan to keep Olympic rings on Eiffel Tower sparks criticism", "title_page": "Plan to keep Olympic rings on Eiffel Tower sparks criticism | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Plans by Paris’ mayor to keep the Olympic rings on the Eiffel Tower have been condemned by designer Gustave Eiffel’s descendants and provoked a backlash from some Parisians.\nThe giant logo was a popular backdrop for selfies by visitors to the French capital during the July 26-Aug 11 Olympic Games, which were widely hailed as a triumph.\nMayor Anne Hidalgo then announced on Aug 31 that she intended to take down the interlocking rings, which are too heavy to remain on the beloved monument, but replace them with new lighter versions.\n“It does not seem appropriate to us that the Eiffel Tower, which has become the symbol of Paris and the whole of France since its construction 135 years ago, has the symbol of an outside organisation added to it in a permanent way, whatever its prestige,” a statement from the Association of Gustave Eiffel’s Descendants said.\nThe association’s chairman Olivier Berthelot-Eiffel, a great-great-grandson of Eiffel, told AFP that his family did not see any problem with the rings staying “just a little longer” than the Paralympic Games which wrap up on Sept 8.\n“But the Eiffel Tower should not become an advertising outpost. Anne Hidalgo should have said that she wanted to keep the Olympic rings, not that she had decided it, and then discussed the idea with the Paris council and relevant individuals,” he explained.\nCulture Minister Rachida Dati, a long-time critic and opponent of Hidalgo, also cast doubt over the idea, saying the Socialist city leader would need to follow procedures protecting historic buildings.\n“The Eiffel Tower is a protected monument, the work of an immense engineer and designer,” Ms Dati said.\nReaction on social media was mixed, but many Parisians appeared dubious about modifying the symbol of the city that is also a Unesco World Heritage Site.\n“The Eiffel Tower has a history of 135 years and surpasses a sports and media event of 17 days,” commented the SOS Paris group, which campaigns to protect Paris landmarks and environment.\nThe chairman of the association Friends Of The Champs de Mars, the park around the Eiffel Tower, also said the idea “needed to be the subject of a wider consultation”.\n“We consider that the biggest priority is maintenance of the tower,” Gerard der Agobian told AFP.\nThe tower’s workers launched a five-day strike in February to protest against its state of disrepair and to urge the city to spend more on painting and anti-rust protection.\n“For me, this is a mistake,” Paris MP Sylvain Maillard, from President Emmanuel Macron’s centrist party, told France Bleu Paris radio of Hidalgo’s idea.\n“The Games were a very powerful moment, but the Eiffel Tower embodies something timeless.”\nMs Hidalgo had already announced her intention to retain some of the symbols of the Olympics, including the innovative cauldron placed in front of the Louvre museum as well as statues used during the opening ceremony.\nShe told the Ouest-France newspaper on Aug 31 that she wanted to keep the rings and “the decision is up to me and I have the agreement of the IOC (International Olympic Committee)”.", "url": "https://www.straitstimes.com/sport/plan-to-keep-olympic-rings-on-eiffel-tower-sparks-criticism"}