{"authors": [], "date_download": "2024-10-12 13:40:52", "date_modify": "2024-10-12 13:40:52", "date_publish": "2024-08-25 01:48:43", "description": "LONDON - Tottenham Hotspur have banished any self-doubt they may have had going into the season after a dominant 4-0 home Premier League victory over Everton on Saturday, said manager Ange Postecoglou, who believes there is more to come from his side. Read more at straitstimes.com.", "filename": "sport_football_tottenham-find-renewed-belief-after-thumping-everton_1728740452.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/25/LYNXMPEK7N06S-1.jpg?VersionId=W0.S02YAG_BobiLU_DTn5K7OLqIK_OP4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_tottenham-find-renewed-belief-after-thumping-everton_1728740452.html", "title": "Tottenham find renewed belief after thumping Everton", "title_page": "Tottenham find renewed belief after thumping Everton | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Tottenham Hotspur have banished any self-doubt they may have had going into the season after a dominant 4-0 home Premier League victory over Everton on Saturday, said manager Ange Postecoglou, who believes there is more to come from his side.\nTottenham were held to a 1-1 draw by Leicester City in their season opener on Monday, much to the frustration of Postecoglou and his players, but were creative and clinical to ease past Everton with an accomplished performance.\n\"I always have hope and I am optimistic at heart. You need to be in our game, there is plenty that can bring you down,\" Postecoglou told reporters.\n\"The performance (at Leicester) was really good but when you don't get the result there is always a bit of doubt there.\n\"We played well last (match) and dominated the game, today was a bit different. The lads had a strong mindset and we got a really good goal early on and didn't let off after that.\n\"The performance was good. It's really encouraging for us. There is more (improvement). We want to keep performing.\"\nYves Bissouma netted his first Tottenham goal to open the scoring against Everton after he had been suspended by the club for the trip to Leicester having been caught on video inhaling nitrous oxide.\n\"It is a good start (to the season for Bissouma),\" Postecoglou said. \"He has still got work to do. I'm not doubting his footballing quality. We want to make him the best version of himself. That starts off the field as much as on it.\"\nWith under a week remaining in the transfer window before it closes on Friday, Postecoglou suggested there may still be players arriving and leaving the club.\nTottenham have already spent a club record 65 million pounds ($86 million) to sign striker Dominic Solanke from Bournemouth in this window.\n\"I think we have spent wisely,\" Postecoglou said. \"The players we have brought in are going to be fantastic for this club. We will see. There are still a couple of players we will look to move on. We'll stay alert.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/tottenham-find-renewed-belief-after-thumping-everton"}