{"authors": ["David Lee"], "date_download": "2024-10-12 13:41:23", "date_modify": "2024-10-12 13:41:23", "date_publish": "2024-08-10 00:26:04", "description": "She carded a one-over 73 for a five-over total of 221, 14 shots behind the co-leaders. Read more at straitstimes.com.", "filename": "sport_s-proe-s-shannon-tan-stays-joint-36th-after-third-round-of-olympic-golf-event_1728740483.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/10/IMGGOLF-OLY-PARIS-2024-11ELBNAEF.jpg?VersionId=tLygxbQ78UHyKxu4LrK5.tALU_oMDKLb", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_s-proe-s-shannon-tan-stays-joint-36th-after-third-round-of-olympic-golf-event_1728740483.html", "title": "S’pore’s Shannon Tan stays joint-36th after third round of Olympic golf event", "title_page": "S’pore’s Shannon Tan stays joint-36th after third round of Olympic golf event | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Getting off to a shaky start with a double bogey on the par-four first hole, Singapore’s Shannon Tan recovered to card a one-over 73 in the third round of the Paris Olympics women’s golf tournament on Aug 9.\nThe 20-year-old would make birdies on the fifth and 13th holes to sandwich a bogey on the sixth to remain tied for 36th place out of 60 players after three rounds at Le Golf National. She is on five-over 221.\nTan, who played on the same flight as Austrian Sarah Schober and Filipina Dottie Ardina, said: “It is never ideal to start the round with a double bogey, but I reminded myself that it is not a shot that I can re-do and that there are 17 more holes to play so it is still possible to make up for it if I remain focused.\n“It is Le Golf National so birdies are definitely hard to come by. The plan was to keep putting it on the green in regulation to give me the best chance. The birdie on the fifth was a little bounce back and provided some momentum as well.”\nIn testing conditions, there have been new names atop the leaderboard after every round.\nTwo-time Major champion, New Zealand’s Lydia Ko, vaulted to the top with a four-under 68 for a nine-under 207 total.\nShe was later joined by overnight leader Megane Metraux of Switzerland, who closed with a brilliant eagle on the 18th.\nJapan’s Miyu Yamashita (68) and American Rose Zhang (67) were joint-third, two shots adrift on 209.\nThailand’s Atthaya Thitikul continued to carry South-east Asian hopes by putting herself in contention with a 69 to climb to fifth on a six-under 210, while defending champion Nelly Korda of the United States continued to improve with another 70 to join a four-way tie for seventh place on 212.\nAustralian Hannah Green chalked up one eagle, seven birdies against three bogeys for a 66 that was the best round of the day that took her up to joint 11th on 213.\nBarring an improbable turn of events, Tan is unlikely to make a medal charge in the final round on Aug 10, but is looking forward to finishing strong and soak in the experience of becoming the first Singaporean golfer to compete at the Olympics.\nShe said: “Sticking to the game plan will be the goal. It is going to be an exciting final round, the atmosphere and crowd has been great all week, so I will also try to take it all in.”", "url": "https://www.straitstimes.com/sport/s-proe-s-shannon-tan-stays-joint-36th-after-third-round-of-olympic-golf-event"}