{"authors": [], "date_download": "2024-10-12 14:17:15", "date_modify": "2024-10-12 14:17:15", "date_publish": "2019-11-12 15:00:00", "description": "LONDON (REUTERS) - Formula One set out its first ever sustainability plan on Tuesday (Nov 12) with the aim of achieving a net zero-carbon footprint for the sport by 2030. Read more at straitstimes.com.", "filename": "sport_formula-one_formula-one-f1-aims-for-zero-carbon-footprint-by-2030_1728742635.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/11/12/rk_formulaone_121119.jpg?VersionId=EaoB0sAxydyDCTLN52N1pCUBe8LZPVSj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_formula-one-f1-aims-for-zero-carbon-footprint-by-2030_1728742635.html", "title": "Formula One: F1 aims for zero carbon footprint by 2030", "title_page": "Formula One: F1 aims for zero carbon footprint by 2030 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON (REUTERS) - Formula One set out its first ever sustainability plan on Tuesday (Nov 12) with the aim of achieving a net zero-carbon footprint for the sport by 2030.\nThe Liberty Media-owned championship, which will have a record 22 grands prix next year with the 10 teams flown around the world, said carbon reduction projects would start immediately.\nIt also promised that all Formula One events would be sustainable by 2025.\n\"We recognise the critical role that all organisations must play in tackling this global issue,\" said chairman Chase Carey in a statement.\n\"By leveraging the immense talent, passion and drive for innovation held by all members of the F1 community, we hope to make a significant positive impact on the environment and communities in which we operate.\"\nCarey said the current V6 turbo hybrid power engines, in use since 2014, were the most efficient in the world and delivered more power from less fuel than any other car.\n\"We believe F1 can continue to be a leader for the auto industry and work with the energy and automotive sector to deliver the world's first net zero-carbon hybrid internal combustion engine,\" added the American.\nOther initiatives include moving to ultra-efficient logistics and 100 per cent renewable powered offices, facilities and factories.\nMcLaren were certified as Formula One's first carbon-neutral team as long ago as 2011, but the sport has also struggled to shrug off a gas-guzzling reputation dating back to the long-gone days of V12 engines.\nUnfavourable comparisons have been made to the all-electric Formula E series, which now has a significant manufacturer presence.\nFormula One said sustainable materials will be used at all events, with all waste reused or recycled, and single-use plastics would be barred.\nThere would also be incentives offering fans a greener way to get to the races.\nSix times Formula One world champion Lewis Hamilton, who has gone vegan, has spoken out this year about his own efforts to reduce his carbon footprint.\nThe Mercedes driver told reporters last month that he had sold his private jet and was flying less for pleasure, had banned single-use plastic from home and office and aimed to be carbon neutral by the end of 2019.\n\"It is not the easiest because, yes, we are travelling around the world and we are racing Formula One cars. Our carbon footprint for sure is higher than the average homeowner that lives in the same city,\" he said then.\n\"But it doesn't mean you should be afraid to speak out about things that can be for a positive change.\"", "url": "https://www.straitstimes.com/sport/formula-one/formula-one-f1-aims-for-zero-carbon-footprint-by-2030"}