{"authors": [], "date_download": "2024-10-12 13:42:12", "date_modify": "2024-10-12 13:42:12", "date_publish": "2024-07-02 04:59:40", "description": "LEIPZIG, Germany - Turkey manager Vincenzo Montella knows that without his captain Hakan Calhanoglu and defender Samet Akaydin he will have to work wonders with his lineup in their last-16 clash on Tuesday against an Austria team he believes is the best at Euro 2024. Read more at straitstimes.com.", "filename": "sport_football_montella-will-have-to-work-magic-with-depleted-turkey-squad-v-austria_1728740532.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/02/LYNXMPEK6013O-1.jpg?VersionId=zHzD.VB7mGbjgy4hAXkkyCiZAXmF8UKn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_montella-will-have-to-work-magic-with-depleted-turkey-squad-v-austria_1728740532.html", "title": "Montella will have to work magic with depleted Turkey squad v Austria", "title_page": "Montella will have to work magic with depleted Turkey squad v Austria | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LEIPZIG, Germany - Turkey manager Vincenzo Montella knows that without his captain Hakan Calhanoglu and defender Samet Akaydin he will have to work wonders with his lineup in their last-16 clash on Tuesday against an Austria team he believes is the best at Euro 2024.\nTurkey's last outing was a hot-tempered group game against the Czech Republic that saw Montella's men receive a whopping 11 bookings - and Calhanoglu and Akaydin suspended for Tuesday for their accumulation of yellow cards.\n\"I always want everyone available for selection,\" Montella said. \"We'll be without two players, they're irreplaceable. Of course it does bother me a little bit ... but I do believe that there will be players who are ready to step in and do their job.\"\nMontella pointed to his team's offensive output in the group stage as a reason for optimism. They scored five goals -- joint third-best at the tournament -- from five different players. None were own goals or penalties. Turkey were also third in total shots, averaging 16.67 per game.\n\"So I think in possession we're doing excellently, we're doing excellently in front of goal as well,\" Montella said.\nStill, the former Roma striker knows what a formidable foe Austria are. They thrashed his side 6-1 in a friendly in March and topped a European Championship group containing France, the Netherlands and Poland.\n\"They're a complete team, they're perhaps the best team as a team unit, they're a team that presses very aggressively high up the pitch very consistently, they're excellent in transition,\" Montella said.\n\"They remind me of a club team because they're able to recognise all different match situations,\" he added.\nMontella will be hoping for another big game from \"the Turkish Messi\" Arda Guler, who became the youngest player to score on his Euro debut at 19 years and 114 days, an accolade previously held by Cristiano Ronaldo.\n\"He's a very talented player. And that's there for all to see,\" Montella said. \"Of course, there are certain areas of his game that he needs to improve, but it's difficult to leave him out because as you see on the training ground, when you see those that take shots and score goals, he's amongst the best of the lot.\n\"When you are playing without Arda, you feel his absence.\"\nTurkey, who reached the Euro 2008 semi-finals in their best run yet, arrived in Germany optimistic about going deep again.\nBut after beating Georgia 3-1 they were thumped 3-0 by Portugal and struggled to beat the 10-man Czech Republic 2-1 in their group stage finale. All three matches were highly charged.\nTurkey defender Mert Muldur, speaking after the team's walkabout on the Leipzig Stadium pitch on Monday, is optimistic the team will be roared on by a huge crowd on Tuesday night.\n\"As soon as we stepped out onto the pitch each one of the players, we were all thinking what kind of an atmosphere we will have,\" Muldur said. \"In previous games, we've been very well-loved and supported by our supporters. And hopefully, it'll be the same tomorrow, we'll go through similar emotions.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/montella-will-have-to-work-magic-with-depleted-turkey-squad-v-austria"}