{"authors": [], "date_download": "2024-10-12 14:17:55", "date_modify": "2024-10-12 14:17:55", "date_publish": "2024-08-26 10:07:53", "description": "Half of the U.S. Team and half of the International Team for the 2024 Presidents Cup are now secured while some Americans are making a late push for their captain's consideration. Read more at straitstimes.com.", "filename": "sport_golf_presidents-cup-qualifiers-locked-in-for-us-international-teams_1728742675.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/26/LYNXMPEK7P011-1.jpg?VersionId=vYr2ZEOCjJCqk8tAgacGhZ4cV0d_MDfa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_presidents-cup-qualifiers-locked-in-for-us-international-teams_1728742675.html", "title": "Presidents Cup qualifiers locked in for U.S., International teams", "title_page": "Presidents Cup qualifiers locked in for U.S., International teams | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Half of the U.S. Team and half of the International Team for the 2024 Presidents Cup are now secured while some Americans are making a late push for their captain's consideration.\nSix players for both the U.S. and International teams qualified for the biannual team event Sunday following the conclusion of the BMW Championship.\nTo no one's surprise, World No. 1 Scottie Scheffler led the U.S. Team qualifying standings by more than 4,000 points over Xander Schauffele. Collin Morikawa, Wyndham Clark, Patrick Cantlay and Sahith Theegala rounded out the top six. It will be the first Presidents Cup appearances for Clark and Theegala.\nThe International Team will be led by Japan's Hideki Matsuyama, a veteran of five previous Presidents Cups. Joining him among the qualifiers were Tom Kim of South Korea, Sungjae Im of South Korea, Jason Day of Australia, Adam Scott of Australia and Byeong Hun An of South Korea in the Nos. 2-6 positions.\nU.S. captain Jim Furyk and International captain Mike Weir of Canada will announce their captains' picks on Sept. 3. The event will be played Sept. 26-29 at Royal Montreal Golf Club.\nFuryk will have plenty to consider when making his six selections. Sam Burns tied for second at the BMW Championship and rose four spots to seventh place in the qualifying standings. It wasn't enough to unseat Theegala, but Burns made one of his final auditions for the team count.\nThen there's Keegan Bradley, who last month was named the captain of the 2025 U.S. Ryder Cup team. At just 38 years old, he was an unexpected choice, as the job usually goes to an older player who will not play in the competition. On Sunday, Bradley showed he can still hang with the best of them, as he won the BMW Championship by a single stroke to cap off a stellar week of golf.\nBradley flew up eight spots to 10th in the U.S. points standings and now may garner a look by Furyk. Other options on the American side include Tony Finau, Russell Henley, Brian Harman, Max Homa, Chris Kirk and Justin Thomas.\nFor the International team, Weir can choose any non-European players, and he's highly likely to select one or more Canadian players as his country plays host to the event. Corey Conners, Nick Taylor, Adam Hadwin, Taylor Pendrith and Mackenzie Hughes are Canadians all likely to be under consideration for a captain's pick. Australians Min Woo Lee and Cam Davis, South Africa's Christiaan Bezuidenhout and South Korea's Si Woo Kim are also options.\n--Field Level Media REUTERS", "url": "https://www.straitstimes.com/sport/golf/presidents-cup-qualifiers-locked-in-for-us-international-teams"}