{"authors": [], "date_download": "2024-10-12 14:12:05", "date_modify": "2024-10-12 14:12:05", "date_publish": "2024-05-08 16:29:58", "description": "The new dad credited his Minnesota Timberwolves teammates and was also grateful for the birth of his son. Read more at straitstimes.com.", "filename": "sport_basketball_rudy-gobert-named-2024-nba-defensive-player-of-the-year_1728742325.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/08/2024-05-04T232236Z1942012541MT1USATODAY23189258RTRMADP3NBA-PLAYOFFS-MINNESOTA-TIMBERWOLVES-AT-DENVER-NUGGETS.JPG?VersionId=hKSdihbHhRI_IBRPCTVkbF898SLH_Ubg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_rudy-gobert-named-2024-nba-defensive-player-of-the-year_1728742325.html", "title": "Rudy Gobert named 2024 NBA Defensive Player of the Year", "title_page": "Rudy Gobert named 2024 NBA Defensive Player of the Year | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Minnesota Timberwolves centre Rudy Gobert had too much to be grateful for in just two days.\nOn May 7, he won the 2024 National Basketball Association (NBA) Defensive Player of the Year award, matching a league record by taking the honour for the fourth time.\nThe 31-year-old Frenchman previously captured the award in 2018, 2019 and 2021 while with the Utah Jazz and this season was a key player in a Minnesota squad who were the NBA’s top-ranked defensive side.\nGobert matched the all-time record four Defensive Player of the Year awards won by Detroit’s Ben Wallace (2002, 2003, 2005, 2006) and Dikembe Mutombo in 1995, 1997, 1998 and 2001 with Denver, Atlanta and Philadelphia.\nThe 2.16m star missed Minnesota’s play-off victory at Denver on May 6 so he could be with girlfriend Julia Bonilla, who gave birth to their son earlier in the day.\n“Romeo is the name and he’s doing great,” he told broadcaster TNT. “A lot of blessings. Just really grateful.”\nGobert received 72 first-place votes from a media panel with fellow Frenchman Victor Wembanyama – the 20-year-old San Antonio Spurs prodigy named on May 6 as the NBA Rookie of the Year – second with 19 first-place votes and Miami’s Bam Adebayo third with three.\nHe averaged 14.0 points, 12.9 rebounds and 2.1 blocked shots a game this season for the Timberwolves.\n“Rudy has driven the defensive culture here,” Timberwolves coach Chris Finch said. “It’s a testament to his impact, his presence and what he has infused into the team of how important defence is and how great it can be when we play it.”\nGobert said the secret to that success was building a group of players determined to dominate defensively.\n“It’s great teamwork,” he insisted.\n“We love to get individual awards, but we can’t do it alone and I really have a lot of gratitude for all my teammates believing in me, allowing me to do what I do best every day and just try to change the culture here in Minnesota.\n“It’s great for the guys for buying in and coming every single night with the same mindset. We wanted to be a defensive-minded team and we’ve been able to do that.”\nThe Timberwolves led the NBA in fewest points allowed per game and kept foes to the league’s lowest shooting percentage.\nMinnesota swept Phoenix in the first round of the NBA play-offs and lead defending champions Denver 2-0 in their best-of-seven battle. New dad Gobert watched from home their last game, a blowout 106-80 win.\nHe also said he never doubted the team could contend even after last season’s first-round play-off exit.\n“I always said great things take time. Winning is never something that happens overnight,” Gobert said. “You need to overcome adversity. You need to have some ups and downs as a group and build that resilience.\n“Now we’re here with one goal in mind and that’s to try and get this championship.” AFP", "url": "https://www.straitstimes.com/sport/basketball/rudy-gobert-named-2024-nba-defensive-player-of-the-year"}