{"authors": [], "date_download": "2024-10-12 14:11:19", "date_modify": "2024-10-12 14:11:19", "date_publish": "2024-08-12 05:47:55", "description": "The 62-year-old brought a heavy dose of Hollywood to the closing ceremony of the Paris Games. Read more at straitstimes.com.", "filename": "sport_tom-cruise-leaps-into-action-as-los-angeles-takes-on-olympic-mission_1728742279.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/12/LYNXMPEK7A0AR-1_0.jpg?VersionId=V6mJpZqhxpm6kwrJwAYqBynmvBD_jt7W", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tom-cruise-leaps-into-action-as-los-angeles-takes-on-olympic-mission_1728742279.html", "title": "Tom Cruise leaps into action as Los Angeles takes on Olympic mission", "title_page": "Tom Cruise leaps into action as Los Angeles takes on Olympic mission | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – American movie star Tom Cruise rappelled from the roof of France’s national stadium and received the Olympic flag, bringing a heavy dose of Hollywood to the closing ceremony of the Paris Games as the French capital handed over to the next host, Los Angeles.\nGrammy-winning R&B artiste H.E.R. teased the Mission: Impossible soundtrack as Cruise made his leap, drawing gasps from spectators as he dropped 50m to the floor of the Stade de France in the finale to a ceremony that blended the traditional, the obscure and the razzle-dazzle of Tinseltown.\nWhile Paris used landmarks such as the Eiffel Tower and the Palace of Versailles to win the hearts of Olympians and spectators, LA was swift to turn to its star draw: A-list celebrities.\nA beaming Cruise high-fived athletes after making the descent and took the flag from LA mayor Karen Bass, who was accompanied by American gymnast Simone Biles.\nCruise then disappeared beneath the stage before re-emerging on a motorcycle with the flag affixed to the back and exited as the crowd at the 80,000-seat stadium roared.\nThe actor’s exit during the closing ceremony transitioned to a pre-recorded video of the 62-year-old skydiving down to the Hollywood sign, where a wide shot showed the Olympic rings incorporated into the LA landmark.\nThe flag was then passed from American Olympians past and present as it traversed the city before reaching a beach party, where LA music icons – rock band Red Hot Chili Peppers, singer Billie Eilish, and rappers Snoop Dogg and Dr Dre – performed.\nParis was bringing down the curtain on an Olympic Games that brought scintillating sport to the heart of the capital, breathing new life into an Olympic brand hurt by the difficulties of Rio de Janeiro’s 2016 Games and the soulless spirit of Tokyo’s Covid-19-hit event.\nEven Parisians were carried away by the Olympic fervour.\n“We wanted to dream. We got Leon Marchand,” Paris 2024 chief Tony Estanguet told the crowd, referring to the French swimmer who won four golds.\n“From one day to the next, Paris became a party and France found itself. From a country of grumblers, we became a country of frenzied fans.”\nMs Bass has acknowledged Paris has set a high standard. But the City of Angels has billed itself as a beacon of diversity and will have Hollywood to fall back on.\n“They’ve got a high bar to reach. A lot of work to do,” said Mr James Rutledge, 59, a former banker wearing a Team USA T-shirt outside the Stade de France. “Hollywood next? That’s something to play with.” REUTERS", "url": "https://www.straitstimes.com/sport/tom-cruise-leaps-into-action-as-los-angeles-takes-on-olympic-mission"}