{"authors": [], "date_download": "2024-10-12 13:40:53", "date_modify": "2024-10-12 13:40:53", "date_publish": "2024-04-03 02:52:14", "description": "English Championship club Leicester City on Tuesday posted a pre-tax loss of 89.7 million pounds ($112.73 million) for the 2022-23 season, which ended with the East Midlands side being relegated from the Premier League. Read more at straitstimes.com.", "filename": "sport_football_leicester-report-losses-worth-897-million-pounds-in-latest-account_1728740453.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/03/LYNXNPEK310QI-1.jpg?VersionId=k_RJRjkalBACERo5aurKlGX7NusRELfx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_leicester-report-losses-worth-897-million-pounds-in-latest-account_1728740453.html", "title": "Leicester report losses worth 89.7 million pounds in latest account", "title_page": "Leicester report losses worth 89.7 million pounds in latest account | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "English Championship club Leicester City on Tuesday posted a pre-tax loss of 89.7 million pounds ($112.73 million) for the 2022-23 season, which ended with the East Midlands side being relegated from the Premier League.\nLeicester could face a points deduction after the top flight referred them to an independent commission in March over alleged breaches in the league's spending rules. They have issued two legal proceedings against the Premier League and the English Football League (EFL).\nLeicester had posted a club-record loss of 92.5 million pounds for the 2021-22 season while announcing a pre-tax loss of 33.1 million pounds the year before.\n\"After a sustained period of growth and success for the club during the last decade, the 2022-23 season was a significant setback, the consequences of which will be felt for some time,\" Leicester Chief Executive Susan Whelan said in a statement.\n\"Our targets and associated budgets for 2022-23 were entirely reasonable. However, for a club such as ours, whose sustained sporting achievements have justified the levels of investment required to compete with the most established clubs...\n\"A season of such significant under-performance on the pitch presents financial challenges, particularly from the perspective of the game's current Profitability and Sustainability rules.\"\nPremier League clubs are allowed to lose 105 million pounds over three seasons.\nIf found guilty, Leicester could become the third club to face a points deduction for breaching Premier League spending rules after Everton and Nottingham Forest.\nLeicester were Premier League champions in 2015-16. They are now third in the Championship, two points behind leaders Ipswich Town and one less than second-placed Leeds United but with a game in hand. REUTERS", "url": "https://www.straitstimes.com/sport/football/leicester-report-losses-worth-897-million-pounds-in-latest-account"}