{"authors": [], "date_download": "2024-10-12 13:42:27", "date_modify": "2024-10-12 13:42:27", "date_publish": "2024-01-28 01:31:25", "description": "LIVERPOOL, England - Cauley Woodrow scored a last-gasp goal as Luton Town knocked out Everton and sixth tier Maidstone United upset Championship Ipswich Town in the FA Cup fourth round on Saturday. Read more at straitstimes.com.", "filename": "sport_football_luton-knock-out-everton-sixth-tier-maidstone-stun-ipswich_1728740547.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/28/2024-01-27T202706Z757518495UP1EK1R1KT4Y2RTRMADP3SOCCER-ENGLAND-FUL-NEW-REPORT.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_luton-knock-out-everton-sixth-tier-maidstone-stun-ipswich_1728740547.html", "title": "Newcastle, Luton win, as sixth-tier Maidstone stun Ipswich", "title_page": "Newcastle, Luton win, as sixth-tier Maidstone stun Ipswich | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Sean Longstaff and Dan Burn scored as Newcastle United knocked Fulham out of the FA Cup with a 2-0 fourth-round victory and sixth-tier Maidstone United stunned Championship Ipswich Town on Jan 27.\nCauley Woodrow netted a last-gasp goal as Luton Town won 2-1 at Everton and Brighton & Hove Albion crushed Sheffield United 5-2 in all-Premier League clashes.\nNewcastle, runners-up in last season’s League Cup, will play in the FA Cup fifth round for only the second time in 18 years.\n“It would be incredible to (reach Wembley) in the FA Cup,” manager Eddie Howe told ITV.\n“The (League) Cup whetted the appetite for us, it was an incredible day, the scenes beforehand, the support we had. Hopefully, we can go a long way in this competition this year.”\nLongstaff scored in the 39th minute at Craven Cottage, pivoting to plant a shot into the net after Fulham struggled to clear a corner. Fulham players screamed for a handball in the build-up, but the goal stood.\nBurn doubled Newcastle’s lead in the 61st minute after keeper Marek Rodak did well to push away Sven Botman’s header, but the ball fell to the left back who fired home to the delight of the visiting support including former Newcastle great Alan Shearer.\n“It has been such a long time since the club has won something, we’ve made a big thing over the last two seasons about that and we have four games to either get to the final or win it so let’s see who we get in the next round and hopefully push on,” Burn said.\nStunned crowd\nLuton’s Woodrow, who broke his hand during the match, netted in the 96th minute when he smashed a close-range shot past keeper Joao Virginia to seal their 2-1 victory in front of a stunned Goodison Park crowd.\n“To be fair I don’t really remember much. It just fell to me and I managed to tap it in,” Woodrow told the BBC. “It was a tough game and at the end it was like a basketball match.\n“I’m really pleased with myself because I’ve been waiting a long time for a goal, and also for the travelling fans – they were unbelievable today.”\nVitaliy Mykolenko’s 39th-minute own goal had put Luton ahead before Jack Harrison cheered the Everton faithful with an equaliser in the 55th minute, hammering in a low shot that Luton keeper Tim Krul allowed to let slip through his hands.\n“We believe we can go anywhere and win. We were confident coming into the game,” Luton manager Rob Edwards said. “I didn’t enjoy many cup runs as a player. We will enjoy this, it does mean a lot and it is important that we enjoy these moments.”\nJoao Pedro netted a hat-trick including two goals from the penalty spot to lead Brighton to an emphatic win at Sheffield United.\nLeicester City knocked out Championship rivals Birmingham City 3-0 thanks to goals by Jamie Vardy, Yunus Akgun and Dennis Praet. Adam Randell scored the equaliser for Plymouth Argyle to force a replay with fellow Championship side Leeds United after a 1-1 draw.", "url": "https://www.straitstimes.com/sport/football/luton-knock-out-everton-sixth-tier-maidstone-stun-ipswich"}