{"authors": ["David Lee"], "date_download": "2024-10-12 13:42:03", "date_modify": "2024-10-12 13:42:03", "date_publish": "2024-08-01 22:15:16", "description": "The Singaporean badminton world No. 12 will play defending champion Viktor Axelsen next. Read more at straitstimes.com.", "filename": "sport_loh-kean-yew-beats-china-s-li-shifeng-qualifies-for-quarter-finals-at-olympics_1728740523.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/dw-lky1-240801.jpg?VersionId=mVsl6zJTtCnJBpwC1FO7EITxUCgapVsp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_loh-kean-yew-beats-china-s-li-shifeng-qualifies-for-quarter-finals-at-olympics_1728740523.html", "title": "Loh Kean Yew beats China’s Li Shifeng, qualifies for Olympic quarter-finals", "title_page": "Loh Kean Yew beats China’s Li Shifeng, qualifies for Olympic quarter-finals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Loh Kean Yew loves a good chase and his hunt for a historic Olympic badminton medal for Singapore remains alive, after he beat China’s sixth-ranked Li Shifeng 23-21, 21-15 at the Porte de la Chapelle Arena on Aug 1.\nThe victory sets up a tantalising quarter-final clash on Aug 2 against his good friend, defending champion and world No. 2 Viktor Axelsen, who received a last-16 bye.\nThe Dane leads 8-2 in their head-to-head, but the underdog tag suits world No. 12 Loh just fine.\nHe laughed as he told The Straits Times: “Yup, I enjoy the chase because the pressure is on him, not me. He has an extra day’s rest and he wants to defend his title. I’m just going to enjoy and give my best.”\nHe had the same mentality against Li. The 27-year-old had lost his previous two encounters against Li, 24, but was able to produce the goods to extend his head-to-head advantage to 5-2 when he needed it most.\nWhile Axelsen was watching the match from the comforts of his room after celebrating his wife’s birthday, Loh was slogging.\n“The pressure is on, but it helps me focus,” said Loh, who noted that the arena was not as boisterous as before. The stakes were nevertheless high and the tension palpable as theirs was the only match across the three courts.\nIn his Group M wins over El Salvador’s Uriel Canjura and Czech Jan Louda, Loh trailed before mounting a comeback.\nIt was the same against Li as he fell behind numerous times in the first game, even down a game point at 19-20. But, even though the net shots were not going his way, he kept scrapping and fighting.\nHe won a 49-shot rally; slipped and recovered for a winner at 16-19; and won on his second game point with a cross-court net shot.\n“It’s better to start slower and get used to the condition earlier than try to do that at a more crucial time,” said Loh.\nTrailing 2-5 in the second game, Li tried to slow things down by tying his laces. Loh was having none of it, catching his rival off guard with a flick serve and forcing him into poor returns, racing to a 20-12 lead. A lift to the back court on his fourth match point was enough to seal victory.\nLi admitted: “I was not as decisive as my opponent in the first game, and it was downhill from there. Perhaps I lack the experience he has.”\nSince he was eliminated at the group stage in his Olympic debut in Tokyo in 2021, Loh has won an unprecedented world title, qualified for the BWF World Tour Finals, beaten Axelsen twice, and is now Singapore’s first man to make the Olympics quarter-finals since Ronald Susilo at Athens 2004.\nYet, armchair analysts have criticised his lack of mental strength as he fell out of the top 10 from No. 3 and went on an 833-day title drought that was snapped only in March.\nBut he has been in the zone in Paris, as he said: “I don’t care about the critics.\n“They wouldn’t understand what we have been through and I don’t need them to understand because everyone has their own life and their journey.\n“I just focus on myself and do whatever I can.”\nThis is why his celebrations were restricted to fist pumps and a warm hug with his parents outside the arena.\n“I can’t be too overjoyed because the job is not done,” said Loh.\nMeanwhile, Thailand’s world champion Kunlavut Vitidsarn beat Japan’s Kenta Nishimoto 16-21, 21-14, 21-12 and faces China’s world No. 1 Shi Yuqi in the last eight.\nMalaysia’s Lee Zii Jia dashed home hopes by beating Toma Junior Popov 21-13, 24-22 to set up a meeting with Denmark’s Anders Antonsen, while Taiwanese cancer survivor Chou Tien-chen overcame Japan’s Kodai Naraoka 21-12, 21-16 and will meet India’s Lakshya Sen, who eased past compatriot H.S. Prannoy 21-12, 21-6.\nIn the women’s singles on Aug 1, Singapore’s world No. 20 Yeo Jia Min was defeated 11-21, 21-14, 24-22 by Japan’s 10th-ranked Aya Ohori in a last-16 tie.", "url": "https://www.straitstimes.com/sport/loh-kean-yew-beats-china-s-li-shifeng-qualifies-for-quarter-finals-at-olympics"}