{"authors": [], "date_download": "2024-10-12 13:41:07", "date_modify": "2024-10-12 13:41:07", "date_publish": "2024-08-27 00:58:03", "description": "England have included five uncapped players for their Twenty20 series against Australia and Gus Atkinson, Harry Brook, Matthew Potts and Jamie Smith have been named for the one-day internationals, the country's cricket board said on Monday. Read more at straitstimes.com.", "filename": "sport_england-call-up-five-uncapped-players-for-australia-t20s_1728740467.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/27/2024-08-20T093401Z1411515327UP1EK8K0QKMJ1RTRMADP3CRICKET-TEST-ENG-LKA.JPG?VersionId=1EuZesf4OWiXQSvFQJF9dOr.IlOEo.2Q", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_england-call-up-five-uncapped-players-for-australia-t20s_1728740467.html", "title": "England call up five uncapped players for cricket T20 internationals against Australia", "title_page": "England call up five uncapped players for cricket T20 internationals against Australia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "England have included five uncapped players for their Twenty20 series against Australia and Gus Atkinson, Harry Brook, Matthew Potts and Jamie Smith have been named for the one-day internationals, the country's cricket board said on Monday.\nBatters Jordan Cox, Jacob Bethell and Dan Mousley, and fast bowlers Josh Hull and John Turner are the uncapped players in the 15-man T20 squad.\nExperienced batter Jonny Bairstow and all-rounder Moeen Ali were left out of both squads.\nAtkinson, Brook, Potts and Smith will be part of the ODI squad after helping England win the first match in the current test series against Sri Lanka.\n\"Josh Hull... is included alongside uncapped players (Jacob) Bethell and (John) Turner,\" the England and Wales Cricket Board said in a statement.\nSeamer Brydon Carse, 29, will return to the senior squads after completing his three-month suspension from all cricket over historical betting on matches following an anti-corruption investigation by the Cricket Regulator.\nEngland host Australia in a three-match T20 series, starting on Sept. 11. The five-match ODI series begins on Sept. 19. Wicketkeeper-batter Jos Buttler will captain both teams.\nENGLAND T20 SQUAD:\nJos Buttler (captain), Jofra Archer, Jacob Bethell, Brydon Carse, Jordan Cox, Sam Curran, Josh Hull, Will Jacks, Liam Livingstone, Saqib Mahmood, Dan Mousley, Adil Rashid, Phil Salt, Reece Topley and John Turner.\nENGLAND ODI SQUAD:\nJos Buttler (captain), Jofra Archer, Gus Atkinson, Jacob Bethell, Harry Brook, Brydon Carse, Ben Duckett, Josh Hull, Will Jacks, Matthew Potts, Adil Rashid, Phil Salt, Jamie Smith, Reece Topley and John Turner. REUTERS", "url": "https://www.straitstimes.com/sport/england-call-up-five-uncapped-players-for-australia-t20s"}