{"authors": [], "date_download": "2024-10-12 13:42:30", "date_modify": "2024-10-12 13:42:30", "date_publish": "2024-02-09 23:35:34", "description": "Rashford missed a training session after reportedly being seen at nightspots in Belfast. Read more at straitstimes.com.", "filename": "sport_football_rashford-can-use-wake-up-call-to-improve-united-form-says-solskjaer_1728740550.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/09/LYNXMPEK180JA-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_rashford-can-use-wake-up-call-to-improve-united-form-says-solskjaer_1728740550.html", "title": "Rashford can use 'wake-up call' to improve United form, says ex-manager Solskjaer", "title_page": "Rashford can use 'wake-up call' to improve United form, says ex-manager Solskjaer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BENGALURU, India - Manchester United's Marcus Rashford has had a \"wake-up call\" after being dropped over a disciplinary issue and must spur himself on to be more consistent, the Premier League club's former manager Ole Gunnar Solskjaer said on Feb 9.\nThe 26-year-old England international missed a training session after reportedly being seen at nightspots in Belfast and was absent from United's 4-2 FA Cup fourth-round victory at Newport County last month.\nUnited said they had dealt with the \"internal disciplinary matter\" and Rashford scored on his return to Erik ten Hag's starting side in last week's 4-3 league win at Wolverhampton Wanderers.\nRashford scored a career-best 30 goals last season but has only netted six times in all competitions this term and 50-year-old Solskjaer said he needed to rediscover his best form.\n\"Obviously, I managed Marcus for three years and I know him. It's not my job to go out and discuss his performances, but last season he was fantastic and it's about consistency in football,\" Solskjaer told Reuters, in the south Indian city of Bengaluru.\n\"Marcus and many others haven't hit the heights this season. I'm sure he had a wake-up call last week and hopefully that will spur him on.\n\"Is it the manager's job to get the best out of him, or is it mostly himself or any player's responsibility to get the best out of yourself? I think that's more it.\"\nSpeaking during the first leg of his India tour, which also includes visits to Mumbai and New Delhi, Solskjaer, who won the Champions League, six Premier League titles and two FA Cup trophies playing for United, said he had full faith in Rashford.\n\"He's had a fantastic career, some ups and downs,\" added the Norwegian, who is being hosted by Tilak Gaurang Shah of quizzing company Ace of Pubs.\n\"Now we hope he's going to hit that consistency, because I know and we all know there's a top player there. It's difficult to be at the top all the time, but it takes sacrifice.\"\nGlory days\nSolskjaer, sacked by United in November 2021 after a run of poor results, hoped Ten Hag could guide them back to glory.\nUnited won the League Cup and finished third in the table under the Dutchman last season but are currently sixth with 38 points from 23 games, eight points off the top four, with their only realistic chance of silverware being the FA Cup.\n\"I know exactly what he's going through in the good times and the more difficult times,\" Solskjaer said. \"We want to get to the top again and I hope it's with Erik.\"", "url": "https://www.straitstimes.com/sport/football/rashford-can-use-wake-up-call-to-improve-united-form-says-solskjaer"}