{"authors": [], "date_download": "2024-10-12 14:14:48", "date_modify": "2024-10-12 14:14:48", "date_publish": "2024-03-27 04:25:45", "description": "He was handed a 20-second penalty after he braked unusually early into Turn 6 at Albert Park on the penultimate lap. Read more at straitstimes.com.", "filename": "sport_formula-one_aston-martin-accept-alonsos-australian-gp-penalty_1728742488.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/27/LYNXNPEK2P0TC-2.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_aston-martin-accept-alonsos-australian-gp-penalty_1728742488.html", "title": "Aston Martin accept Fernando Alonso’s Australian Grand Prix penalty", "title_page": "Aston Martin accept Fernando Alonso’s Australian Grand Prix penalty | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Aston Martin will not appeal against a penalty that dropped Fernando Alonso from sixth to eighth at last weekend’s Australian Grand Prix for “potentially dangerous” driving just before George Russell crashed.\nThe two-time Formula One world champion was handed a 20-second penalty after he braked unusually early into turn 6 at Albert Park on the penultimate lap, with Mercedes driver Russell close behind and losing control.\nRussell ended up with his car on its side in the middle of the track, with the British driver calling urgently for the race to be stopped for fear of further crashes.\nAston Martin team boss Mike Krack said in a letter to fans on social media on March 26 that while everyone was relieved that Russell walked away unhurt, he wants them to know that the team “fully support Fernando”.\n“He is the most experienced driver in Formula One. He has competed in more grands prix than anyone else and has more than 20 years of experience. He is a multiple world champion in multiple categories,” he added.\n“To receive a 20-second time penalty when there was no contact with the following car has been a bitter pill to swallow, but we have to accept the decision.\n“We made our best case, but without new evidence we are unable to request a right of review.”\nKrack also said that Alonso had been “using every tool in his toolbox” to finish ahead of Russell, but said the Spaniard would “never put anyone in harm’s way”.\nMeanwhile, website F1-Insider has reported that Red Bull team principal Christian Horner is in talks with Alonso to replace Sergio Perez and form a partnership with three-time world champion Max Verstappen next season.\nPlanet F1 has said that Alonso could even take the place of Verstappen, should the Dutchman decide to leave.\nThe rumours have not been addressed by any party and Alonso, who is in the final term of his current deal with Aston Martin, has been on record as stating that he wants to be “the owner of my destiny” regarding his F1 future.\nGiven that he is now 42, a place at the dominant Red Bull could be his last chance to claim a third world title.\n“Horner has always been a very, very big fan of Alonso,” said former F1 driver Ralf Schumacher.", "url": "https://www.straitstimes.com/sport/formula-one/aston-martin-accept-alonsos-australian-gp-penalty"}