{"authors": [], "date_download": "2024-10-12 14:08:40", "date_modify": "2024-10-12 14:08:40", "date_publish": "2024-09-28 15:51:45", "description": "The No. 1 draft pick broke the records for assists both in a season (337) and in a single game (19). Her 769 total points (19.2 per game) marked the most a rookie has ever had. Read more at straitstimes.com.", "filename": "sport_basketball_caitlin-clark-wins-wnba-rookie-of-the-year-napheesa-collier-dpoy-reports_1728742120.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/28/2024-09-26T000007Z1408147612MT1USATODAY24322390RTRMADP3WNBA-PLAYOFFS-INDIANA-FEVER-AT-CONNECTICUT-SUN.JPG?VersionId=skMLjHJcYPgzk251ExCu1zjKY9kuWb49", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_caitlin-clark-wins-wnba-rookie-of-the-year-napheesa-collier-dpoy-reports_1728742120.html", "title": "Caitlin Clark wins WNBA Rookie of the Year, Napheesa Collier Defensive Player of the Year: Report", "title_page": "Caitlin Clark wins WNBA Rookie of the Year, Napheesa Collier Defensive Player of the Year: Report | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Indiana Fever star Caitlin Clark is the Women’s National Basketball Association’s (WNBA) Rookie of the Year, while Minnesota Lynx forward Napheesa Collier won the league’s Defensive Player of the Year award, The Athletic reported on Sept 27.\nClark’s honour was widely expected after she set multiple records in her first season in the league.\nThe No. 1 draft pick broke the records for assists in a season (337) and in a single game (19).\nShe was also the first player to record two triple-doubles in her rookie season, and her 769 total points (19.2 per game) marked the most a rookie has ever had.\nThe WNBA has yet to announce the awards, but it appeared to be confirmed by the Women’s National Basketball Players Association (WNBPA) in a statement that targeted USA Today columnist Christine Brennan for interview questions it found unsavoury.\n“This week was dedicated to celebrating and amplifying A’ja (Wilson), Caitlin, DiJonai (Carrington) and Napheesa for their hard work and truly exception performances all season long,” the union’s statement began, before going on to air complaints about questions Brennan asked Carrington about accidental contact the Connecticut Sun player made with Clark during their first-round play-off series.\nIt had been previously revealed that Wilson of the Las Vegas Aces was the league’s Most Valuable Player and Sun’s Carrington was named Most Improved Player.\nCollier averaged 9.7 rebounds, 1.9 steals and 1.4 blocks per game (all career highs) to go with her 20.4 points per game in 34 starts in the regular season. The 28-year-old also dropped 38 and 42 points, a WNBA play-off record for points in a game, in the Lynx’s two first-round games against the Phoenix Mercury, leading to a 2-0 sweep.\nWhile these players, among others, have contributed to the surging popularity of the WNBA, unfortunately, it has also opened the door for harassment, and the league’s veterans are calling for officials to do more to address racist and sexist abuse.\nThe addition of collegiate media sensation Clark to the WNBA in 2024 helped drive record viewership and attendance, and the league found itself more firmly embedded in mainstream US sports culture, where racism and misogyny remain prevalent.\nThe issue has come to a head during the ongoing WNBA play-offs.\n“I don’t appreciate the new fans that sit there and yell racial slurs at myself, my teammates and the people that I play against. I do appreciate the new fans that respect the game that are here to grow our league,” Brittney Griner said after her side Mercury were eliminated from the post-season.\nThe 22-year-old Clark said it was “definitely upsetting” and no one should have to face racist threats or hurtful remarks.\n“Those aren’t fans, those are trolls, it’s a real disservice to the people in our league... I think continuing to uplift this league in a very positive light is the best thing that we can do,” she said.\nOn Sept 25, the WNBA condemned the behaviour of fans accused of racism.\n“The WNBA will not tolerate racist, derogatory, or threatening comments made about players, teams and anyone affiliated with the league,” the league said in a statement. “League security is actively monitoring threat-related activity and will work directly with teams and arenas to take appropriate measures to include involving law enforcement as necessary.”\nThe WNBA has to prepare to tackle more of these issues with the growing stature of the league.\nThe regular-season attendance was up 48 per cent over the 2023 season. The league said 2,353,735 fans attended WNBA games, the most in 22 years, while WNBA teams combined for 154 sell-outs this season after having 45 in 2023. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/basketball/caitlin-clark-wins-wnba-rookie-of-the-year-napheesa-collier-dpoy-reports"}