{"authors": [], "date_download": "2024-10-12 13:47:46", "date_modify": "2024-10-12 13:47:46", "date_publish": "2024-07-12 14:11:37", "description": "LONDON - English pubs, supermarkets and restaurants are set for a weekend bonanza as fans prepare to tune in to watch England play Spain in the final of the Euro 2024 soccer championship in Germany and before that the Wimbledon tennis men's singles final in London. Read more at straitstimes.com.", "filename": "sport_football_english-pubs-and-shops-gear-up-for-euro-2024-final-bonanza_1728740866.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/LYNXMPEK6B061-1.jpg?VersionId=yg5LyCwpbTx2GhGA4c5tZ9jLJldzyiK8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_english-pubs-and-shops-gear-up-for-euro-2024-final-bonanza_1728740866.html", "title": "English pubs and shops gear up for Euro 2024 final bonanza", "title_page": "English pubs and shops gear up for Euro 2024 final bonanza | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - English pubs, supermarkets and restaurants are set for a weekend bonanza as fans prepare to tune in to watch England play Spain in the final of the Euro 2024 soccer championship in Germany and before that the Wimbledon tennis men's singles final in London.\nThe events will provide a much-needed fillip to the hospitality and retail sector after wet weather meant a subdued start to summer trading.\nItems from beer, wine and snacks, barbecue food and pizzas to large screen TVs and England shirts, are being snapped up ahead of the major sporting weekend, supermarkets Tesco, Sainsbury's and Asda said and data from Adobe showed.\nSainsbury's, Britain's No. 2 grocer, forecast weekend beer sales would increase 200% year-on-year, with sales of sparkling wine and ready-to-drink cocktail cans both up 30%.\nBritain's third-biggest supermarket Asda has sold over 20,000 large screen ultra-high-definition TVs during Euro 2024, with more sales expected ahead of Sunday, it said after England beat the Netherlands 2-1 in the semi-final on Wednesday thanks to a dramatic last minute winner.\nEngland face Spain on Sunday for a chance to become the first England men's team to win a major tournament since the 1966 World Cup and the first on foreign soil.\n\"Victory for England would certainly be one of the biggest football payouts of all time for the business, deep into seven figures,\" bookmaker William Hill spokesperson Lee Phelps said.\nA spokesperson for JD Sports said its England merchandise sales jumped over six-fold for the semi-final, having already risen by almost three times around last Saturday's quarter final victory on penalties against Switzerland.\nData from Adobe forecast England fans' spending on team merchandise will have spiked by as much as 1,500% above normal levels the day after the semi-final.\nU.S. online sports retailer Fanatics said that the Euro 2024 was the best selling ever for official England merchandise and expects a huge spike in sales if England takes the cup home.\nBritish pubs and bars are set for a 120 million pound ($155 million) sales boost from the final, trade body UKHospitality said.\nBars and restaurants in Spain are also set to see a boost, with Spanish Hospitality Association forecasting sales of 117.6 million euros ($128 million) on Sunday, up more than 15% compared to Sundays this year.\nBritain's biggest supermarket group Tesco said it would shut its more than 1,800 Express stores across England early on Sunday to allow its staff to get home or to the pub in time for the kick-off at 1900 GMT.\n\"Based on our learnings from England reaching the final last time round (in 2021), and also from increasing demand through this tournament, we have a well-rehearsed supply plan in place to make sure all our stores are stocked for the extra demand,\" Jason Binks, store ordering manager at Tesco, said.\nThe Wimbledon women's final will take place on Saturday afternoon and the men's final will start at 1300 GMT on Sunday.\nSurveys published on Tuesday showed British consumer spending contracted in June, with wet weather hitting sales of key seasonal items. However, the consumer outlook is improving, with lower UK inflation, rising real living standards and the promise of a period of political stability with a new Labour government.\nYoung & Co Brewery said its pubs were \"nearly\" fully booked but it still had the option for walk-ins and London-based Fullers had seen a jump in advance bookings.\nWhile JD Wetherspoon, which would not regularly show games at their pubs except the big tournaments, have been screening the Euros from the start of the tournament.\nA Domino's Pizza Group spokesperson said the group was stocking up on its cheese & tomato and pepperoni pizzas and will be offering a 50% discount on web and app orders from Friday through to Sunday.\nNot all retailers will be happy though. Away from the supermarkets spending could be compressed as people stay at home ahead of the match instead of visiting the high street, shopping centres and retail parks. REUTERS", "url": "https://www.straitstimes.com/sport/football/english-pubs-and-shops-gear-up-for-euro-2024-final-bonanza"}