{"authors": [], "date_download": "2024-10-12 14:16:42", "date_modify": "2024-10-12 14:16:42", "date_publish": "2024-01-17 01:07:17", "description": "The former champions were fourth overall in 2023, with Lando Norris and Oscar Piastri increasingly challenging the Red Bulls. Read more at straitstimes.com.", "filename": "sport_formula-one_mclaren-confident-they-can-keep-improving-in-2024_1728742602.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/17/LYNXMPEK0F0Q9-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_mclaren-confident-they-can-keep-improving-in-2024_1728742602.html", "title": "McLaren confident they can keep improving in 2024", "title_page": "McLaren confident they can keep improving in 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – McLaren’s preparations for the 2024 Formula One season are going to plan with the outfit confident they can continue last term’s impressive performance gains, according to team principal Andrea Stella.\nThe eight-time constructors’ champions were fourth overall in 2023 after a slow start to the campaign, with Britain’s Lando Norris and Australian rookie Oscar Piastri increasingly challenging the dominant Red Bulls.\nA new wind tunnel and race-car simulator are now in use at the Woking factory, while Rob Marshall and David Sanchez have joined from Red Bull and Ferrari respectively in senior technical roles.\n“The preparation so far has been relatively smooth. Smooth in the Formula One sense, which means pushing everything last minute, to the limit. But so far we are on plan,” Stella said at a livery presentation.\n“So far, we don’t see diminishing returns. This obviously will have to be proven once we put the car on the ground but when it comes to the wind tunnel development of this year... (it) seems like we can maintain it.\n“We are already starting to work on the further developments that we hope to bring relatively soon in-season and they also seem to be quite interesting.”\nThe season starts in Bahrain on March 2 after testing from Feb 21-23 and Red Bull will again be the clear favourites, with Max Verstappen chasing his fourth world championship in succession.\nStella cautioned that, while confident about the rate of progress, a lot depended on how much Red Bull had improved their car after the most dominant season on record with 21 wins in 22 races.\nMcLaren chief executive Zak Brown recognised it could be an “unpleasant surprise” when Red Bull showed their true hand.\n“I would say Red Bull should be extremely competitive and we will see where we are, what kind of challenge we will be able to set on track,” said Stella.\n“For us, it’s important that we see we are doing a good job out of our own performance development and we are confident that, if we keep doing this, over time we have an opportunity to close the gap.”\nNorris, 24, will be starting his sixth season in Formula One still chasing a first win but boosted by seven podium finishes last season, including six runner-up placings.\n“When Lando wins his first race, it will be a beautiful moment. He is ready for that. It’s more about us being ready and delivering that car that allows him to take the opportunities,” added Stella.\nBrown stressed that the team see Norris and Piastri, 22, as their long-term driver pairing and believe they can convince the Briton to stay beyond next season.\nRed Bull have made no secret of their interest in Norris, whose contract at McLaren expires at the end of 2025 with the sport entering a new engine era and general reset in 2026. Piastri’s contract runs until the end of 2026.\n“We have Lando under contract for another couple of years, of course we are in dialogue with him on a continuous basis,” Brown said.\n“We’re very focused now here on the short term, but 2026 is not far away and we recognise that being able to retain Lando and Oscar for the foreseeable future is definitely a key element and something that is a high priority.”\nBrown added that his approach was to take care of all his employees, sponsors and drivers so that they wanted to be part of McLaren.\n“I tend to focus on making sure McLaren’s the best environment and people want to be with us because you ultimately cannot control external approaches to those various people,” he explained.\nREUTERS", "url": "https://www.straitstimes.com/sport/formula-one/mclaren-confident-they-can-keep-improving-in-2024"}