{"authors": [], "date_download": "2024-10-12 13:41:13", "date_modify": "2024-10-12 13:41:13", "date_publish": "2024-07-31 01:19:07", "description": "PARIS - Tiana Echegaray was eliminated from the Paris Olympics following a loss to Turkey's Hatice Akbas on Tuesday, but the Australian said she is still proud of herself for making it this far in such a short space of time. Read more at straitstimes.com.", "filename": "sport_combat-sports_boxing-from-office-job-to-games-aussie-echegaray-proud-of-tremendous-feat_1728740473.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/LYNXMPEK6T0US-1.jpg?VersionId=rxajj5Ll_sgTguAsKAcbHG19x7aDD.ws", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_combat-sports_boxing-from-office-job-to-games-aussie-echegaray-proud-of-tremendous-feat_1728740473.html", "title": "Boxing-From office job to Games, Aussie Echegaray proud of 'tremendous feat'", "title_page": "Boxing-From office job to Games, Aussie Echegaray proud of 'tremendous feat' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Tiana Echegaray was eliminated from the Paris Olympics following a loss to Turkey's Hatice Akbas on Tuesday, but the Australian said she is still proud of herself for making it this far in such a short space of time.\nUntil 2019, the 30-year-old worked an office job for a music rights company, before quitting and taking up boxing as a way to keep fit.\n\"I was just working a pretty mediocre 9-to-5 job for the majority of my life, and it felt really meaningless. Everything that I was doing was just going to the abyss and having no value or benefit to anyone in my life,\" bantamweight Echegaray said.\n\"I decided to do something different and do a full 360 of my life. I started boxing for fitness and it felt good to move, to have exercise is really an incredible thing.\n\"I met some people in boxing, particularly women, who just looked really badass, like hitting the bag. I was just watching them and I thought, there's obviously so much more to this sport.\"\nJust five years after she began boxing, the Sydney native found herself on the plane to Paris following her victory in the Pacific Games.\nWhile her time at the Games was short-lived, she said the unanimous defeat by former world champion Akbas had taught her a lot.\n\"Anytime I fight someone that is incredibly skilled like that, it just makes me realise there's so much more to learn. It's a never-ending learning curve in the sport of boxing, and that's why I love it. It's so challenging,\" Echegaray said.\n\"I didn't grow up dreaming of going to the Olympics. I started boxing really late. I had my first fight in 2021, and to even make it to the Olympics is a tremendous feat.\n\"I'm so proud of myself for making it this far, and just being here, representing myself, my family, my coaches, my gym, it's as much a big deal for me as it is for them.\" REUTERS", "url": "https://www.straitstimes.com/sport/combat-sports/boxing-from-office-job-to-games-aussie-echegaray-proud-of-tremendous-feat"}