{"authors": [], "date_download": "2024-10-12 14:02:48", "date_modify": "2024-10-12 14:02:48", "date_publish": "2024-06-05 22:36:52", "description": "She is the fourth Italian woman to make the Roland Garros semi-finals in tennis' Open era. Read more at straitstimes.com.", "filename": "sport_tennis_paolini-upsets-rybakina-to-reach-french-open-semis_1728741768.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/05/LYNXMPEK540MX-1.jpg?VersionId=3On33kY3.ONfEZxxjHWf9kSmUrp0eqEl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_paolini-upsets-rybakina-to-reach-french-open-semis_1728741768.html", "title": "Jasmine Paolini upsets Elena Rybakina to reach French Open semi-finals", "title_page": "Jasmine Paolini upsets Elena Rybakina to reach French Open semi-finals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Italian surprise package Jasmine Paolini coped with being “too emotional” in the second set to stave off a fightback from fourth seed Elena Rybakina and seal a stunning 6-2, 4-6, 6-4 win on June 5 and advance to the French Open semi-finals for the first time.\nThe 12th seed set up a last-four showdown with Russian 17-year-old Mirra Andreeva, who stunned Belarusian world No. 2 Aryna Sabalenka 6-7 (5-7), 6-4, 6-4 in another quarter-final on Court Philippe-Chartrier.\n“It’s an unbeatable feeling. It was a tough match,” said Paolini, who become the fourth Italian woman after Francesca Schiavone, Sara Errani and Martina Trevisan to make the Roland Garros semi-finals in the Open era. “I was too emotional in the second set. I said to myself, ‘It’s okay she’s a great champion. It can happen. Just fight and try to hit every ball’.\n“And it worked, I’m here, I won! (The key was) to forget what happened in the second set because it can happen. It’s tennis. It’s normal. I managed to come back, to stay there and stay focused.\n“Even if I had the break two times again. But it’s okay, I just accept that and fight again.”\nHer result comes just a day after compatriot Jannik Sinner got confirmation that he will become the first Italian man to top the men’s singles rankings, after outgoing No. 1 Novak Djokovic had to pull out of Roland Garros due to injury.\nPlaying in her first Grand Slam quarter-final, Paolini got off to a confident start by winning the opening two games and forcing her opponent to work hard to hold serve, before breaking again en route to taking the first set.\nA sublime backhand winner gave the 28-year-old another break in the third game of the next set but 2022 Wimbledon champion Rybakina responded with one of her own and slowly came to grips with the Italian’s power and precision.\nRussian-born Kazakh Rybakina exchanged breaks with Paolini again before the 24-year-old held firm to level the contest at one set apiece and recovered after surrendering her serve at the start of the decider.\nPaolini secured a hold to love to make it 4-4, playing at the level she showed early in the match.\nThe world No. 15 took advantage of Rybakina’s errors to close out a famous victory to huge cheers inside the main showcourt.\nRybakina finished with 48 unforced errors to 35 winners while Paolini produced 22 winners as well as 22 unforced errors.\n“It’s my first time playing on this beautiful court. It’s a pleasure. It’s really a privilege,” Paolini added after prevailing in two hours and three minutes.\n“I’m happy I got the win in my first match here, because this is one of the best courts I think in tennis.”\nWith Sinner also reaching the last four, there will be Italians in the semi-finals of the men’s and women’s singles at a Major for the first time in the Open era.", "url": "https://www.straitstimes.com/sport/tennis/paolini-upsets-rybakina-to-reach-french-open-semis"}