{"authors": [], "date_download": "2024-10-12 13:42:21", "date_modify": "2024-10-12 13:42:21", "date_publish": "2024-06-28 22:38:34", "description": "LEIPZIG, Germany - Four Austria defenders missed team training on Friday ahead of their last 16 clash with Turkey next Tuesday, leaving the rest of the squad to wrestle with how to prepare for one eventuality the country has never faced at a major finals - a penalty shoot-out. Read more at straitstimes.com.", "filename": "sport_austria-defenders-miss-team-training-ahead-of-turkey-clash_1728740541.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/LYNXMPEK5R0KE-1.jpg?VersionId=gk7rGFHjiRUCFhPcco5AJB.dHr4C1qX_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_austria-defenders-miss-team-training-ahead-of-turkey-clash_1728740541.html", "title": "Austria defenders miss team training ahead of Turkey clash", "title_page": "Austria defenders miss team training ahead of Turkey clash | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LEIPZIG, Germany - Four Austria defenders missed team training on Friday ahead of their last 16 clash with Turkey next Tuesday, leaving the rest of the squad to wrestle with how to prepare for one eventuality the country has never faced at a major finals - a penalty shoot-out.\n\"Sure, you can practice it, but this pressure situation, if it should arise, is difficult to recreate,\" midfielder Florian Grillitsch told reporters.\nThe 28-year-old revealed that every goal at Friday's training session had to be \"confirmed\" by a successful penalty - otherwise, it didn't count.\nGernot Trauner (thigh injury) and Phillipp Mwene (head cold) did not train at all, while Philipp Lienhart and Leopold Querfeld trained individually as the team got back to work following their famous 3-2 victory over Netherlands on Tuesday.\nThat win, which saw them top the group, was followed by a training session for the substitutes on Wednesday and a day off on Thursday, but on Friday the serious work began, with an added focus on spot kicks.\nA victory over Turkey on Tuesday would set the Austrians up for a quarter-final tie against Romania or their recent foes, the Dutch. REUTERS", "url": "https://www.straitstimes.com/sport/austria-defenders-miss-team-training-ahead-of-turkey-clash"}