{"authors": [], "date_download": "2024-10-12 13:41:18", "date_modify": "2024-10-12 13:41:18", "date_publish": "2024-05-28 13:10:29", "description": "The former Manchester United and England captain was appointed manager of the English second-tier club on May 25. Read more at straitstimes.com.", "filename": "sport_football_wayne-rooney-wants-plymouth-youngsters-to-follow-his-teenage-dream_1728740478.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/28/2024-05-12T151258Z406256833UP1EK5C169KC5RTRMADP3SOCCER-ENGLAND-MUN-ARS-REPORT.JPG?VersionId=i4Byy6SEUaACvH_JKGKvNmNG2GVt7ivq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_wayne-rooney-wants-plymouth-youngsters-to-follow-his-teenage-dream_1728740478.html", "title": "Wayne Rooney wants Plymouth youngsters to follow his teenage dream", "title_page": "Wayne Rooney wants Plymouth youngsters to follow his teenage dream | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Wayne Rooney has said he will give Plymouth Argyle’s young players the chance to follow his example, by allowing them to make their senior debuts as teenagers.\nThe former Manchester United and England captain, who burst onto the English Premier League scene as a 16-year-old striker at Everton, was appointed manager of the English second-tier club on May 25 – less than five months after being sacked by then Championship rivals Birmingham City.\nThe 38-year-old, when asked about his management style, told Argyle TV on May 27: “Obviously I had my playing career, which I loved, but if you want to go into management, you quite quickly have to move on from there.\n“I’ve put a lot of work in, a lot of time in to try to develop myself as a coach, try to improve, try to get better. And I want to be a coach who helps players, helps teams, develops players, academy players.\n“Academy players are really important as well, to try to improve them, because I was a player who came into the first team at 16. I think a lot of young players are good enough, but maybe don’t get the chance, so I’ve got a real passion for that as well.”\nSouth-west side Plymouth marks the fourth managerial role of Rooney’s coaching career, which has so far failed to live up to his stellar playing days.\nHe was sacked after just 83 days in charge of Birmingham earlier in 2024, winning just two of his 15 matches in charge – a record which contributed to the Blues’ relegation to League One.\nHe previously had a short spell with DC United in Major League Soccer.\nBut Rooney, United’s all-time record scorer with 253 goals, did thrive in difficult circumstances during his first job at Derby County as the club entered administration.\nHe will now link up again at Home Park with Plymouth director of football Neil Dewsnip, who was the head of Everton’s academy when Rooney was rising through the ranks on Merseyside.\n“I think ultimately the important thing in that is we’re both trying to do the right thing,” added Rooney.\n“We both want the right thing, we’re both on the same wavelength now to make sure the club moves forward on players coming into the football club, style of play, how we want to move forward.” AFP", "url": "https://www.straitstimes.com/sport/football/wayne-rooney-wants-plymouth-youngsters-to-follow-his-teenage-dream"}