{"authors": [], "date_download": "2024-10-12 14:10:33", "date_modify": "2024-10-12 14:10:33", "date_publish": "2024-06-26 16:22:03", "description": "With 11 players under contract and negotiations expected towards a new deal with Derrick White, their roster is fairly set. Read more at straitstimes.com.", "filename": "sport_basketball_nba-champions-boston-celtics-enter-draft-free-agency-with-few-needs_1728742233.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/11429188.jpg?VersionId=m02dr_3wl6Utck.OhmOJWXWyKyejBd21", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_nba-champions-boston-celtics-enter-draft-free-agency-with-few-needs_1728742233.html", "title": "NBA champions Boston Celtics enter draft, free agency with few needs", "title_page": "NBA champions Boston Celtics enter draft, free agency with few needs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BOSTON – Boston Celtics president Brad Stevens faces a short turnaround from the National Basketball Association (NBA) championship celebration to the first round of the draft on June 26.\nBut with 11 players under contract and negotiations expected towards a new deal with Derrick White, acquired by Stevens and the Celtics in 2022, their roster is fairly set for next season.\nStevens said on June 25 that he is ready to use the two picks the Celtics have to add depth for the future, implying an international player to be stashed or a G League candidate could be on the radar with the final pick in the first round – No. 30.\n“It’ll be hard for any draft pick to crack our rotation when healthy,” he said.\n“And so we’ll think about how we can best continue to invest in our young players and their development and growth. If we’re able to continue to move forward with this group, these guys are going to be on the court. This’ll be a good opportunity to bring in somebody who can help us down the road.”\nThe Celtics also pick 54th, five picks from the end of the second round in this draft, on June 27. The 2024 NBA Draft is a two-night event with the first round held on June 26 in Brooklyn and the second round, consisting of picks 31-58, the following night.\nWhile Stevens confirmed expected surgery was imminent for centre Kristaps Porzingis, ruling the Latvian out of the Olympics, the Celtics are not in a position to be shoppers when free agency starts on June 30.\nThat is in part because of the planned commitment to Jayson Tatum and White, who has only one year remaining on a four-year, US$70 million (S$95 million) contract.\nTatum, a five-time All-Star, has one year left on his contract.\nHe is eligible for a five-year, US$315 million contract that would make him the NBA’s highest-paid player. ESPN reported last week the contract is expected to be finalised in July.\nAdding Tatum’s record contract to the books along with the US$304 million deal signed by Jaylen Brown last summer would not leave Stevens much room to find an insurance policy for Porzingis.\nBoston signed Porzingis to a two-year extension through the 2025-26 season and gave Jrue Holiday a new deal that expires in 2027.\nStevens has said multiple times the Celtics plan to retain White. He can be offered up to 140 per cent of his salary which would approach the four-year, US$135 million extension Boston gave Holiday in April. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/basketball/nba-champions-boston-celtics-enter-draft-free-agency-with-few-needs"}