{"authors": [], "date_download": "2024-10-12 14:18:29", "date_modify": "2024-10-12 14:18:29", "date_publish": "2024-05-21 00:19:44", "description": "Liverpool confirmed on May 20 that the Dutchman will replace Jurgen Klopp. Read more at straitstimes.com.", "filename": "sport_liverpool-confirm-slot-as-new-manager-to-replace-klopp_1728742709.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/21/LYNXMPEK4J0KT-1.jpg?VersionId=_Dt625gnaIVsAI6EJ0Am13s.jmtASC2n", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_liverpool-confirm-slot-as-new-manager-to-replace-klopp_1728742709.html", "title": "New Liverpool boss Arne Slot admits he could not resist lure of Anfield club", "title_page": "New Liverpool boss Arne Slot admits he could not resist lure of Anfield club | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Arne Slot said the chance to work at one of the world’s biggest clubs was “difficult to ignore” after Liverpool confirmed on May 20 that the Feyenoord coach would be their new manager.\nJust 24 hours after Jurgen Klopp’s emotional farewell at Anfield, the English Premier League club said in a statement that the Dutchman would take up the managerial position on June 1, subject to a work permit.\nThe length of Slot’s contract was not specified, but it was widely reported in the British press that he had signed a three-year deal.\nHis arrival was an open secret, with Liverpool reportedly agreeing a compensation deal worth up to £9.4 million (S$16.1 million) with Feyenoord.\nSlot had been in charge of the Dutch side since 2021, winning the Eredivisie title in 2022-23 along with the Dutch Cup in the 2023-24 season, when they finished second in the league, seven points behind PSV Eindhoven.\nFeyenoord also reached the Europa Conference League final in his first season at the club.\nThe 45-year-old confirmed Anfield was his next destination at his final pre-match press conference at the Eredivisie club on May 17.\n“It is certainly not an easy decision to close the door behind you at a club where you have experienced so many wonderful moments and worked successfully with so many wonderful people,” he added on Feyenoord’s website on May 20.\n“But as a sportsman, an opportunity to become a head coach in the Premier League, at one of the biggest clubs in the world, is difficult to ignore.”\nKlopp, 56, announced in January that the 2023-24 season would be his last at Anfield, and took charge of his final game on May 19, a 2-0 win against Wolverhampton Wanderers. In his farewell speech to the crowd, the German urged fans to throw their full support behind his successor, leading them in a chant of “Arne Slot, la la la la la”.\n“You welcome the new manager like you welcomed me. You go all in from the first day. And you keep believing and you push the team,” he said.\nOn the same day, Slot was given a rousing send-off by the Feyenoord fans after their final league game of the season, a 4-0 home win over Excelsior.\nSlot, linked with a move to Tottenham Hotspur a year ago, became Feyenoord boss after impressing in his first managerial role at AZ Alkmaar.\nFeyenoord’s inaugural Europa Conference League final ended with a 1-0 loss to Jose Mourinho’s AS Roma. Slot then delivered just a second league title in 24 years to De Kuip last season before penning a new three-year deal.\nHis Feyenoord side have delighted fans with an attacking brand of football, winning praise from Klopp himself.\n“I like the way his team plays football. If he is the one, I like that he wants it,” Klopp said in April.\nLiverpool captain and fellow Dutchman Virgil van Dijk has hailed Slot’s attacking mindset, saying it would suit the philosophy at Anfield.\nSpeaking about the future under the new boss, he said: “It is all about sticking together and giving him the chance of showing what he is capable of with the other guys who will come in.\n“He probably knows already but everyone knows our expectations are always huge and it is about managing that in the right way and getting the maximum out of all of our players.”\nSlot has huge shoes to fill at Anfield after Klopp restored Liverpool to the elite of English and European football during his nine-year reign.\nHe led the Reds to their sixth Champions League crown and a 19th league title, as well as a clutch of other trophies. They finished third in the Premier League this season, nine points behind champions Manchester City.\nInitially, Bayer Leverkusen boss and former Liverpool midfielder Xabi Alonso was the favourite to succeed Klopp. However, Alonso committed to staying at Leverkusen after leading them to their first Bundesliga title. AFP, REUTERS", "url": "https://www.straitstimes.com/sport/liverpool-confirm-slot-as-new-manager-to-replace-klopp"}