{"authors": [], "date_download": "2024-10-12 13:34:49", "date_modify": "2024-10-12 13:34:49", "date_publish": "2024-09-11 12:12:49", "description": "It was sweet revenge for Colombia, who were beaten 1-0 by Argentina in a bitterly disappointing Copa America final. Read more at straitstimes.com.", "filename": "sport_football_colombia-down-argentina-brazil-stunned-in-world-cup-qualifiers_1728740089.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/FBL-WC-2026-SAMERICA-QUALIFIERS-COL-ARG-220204.jpg?VersionId=.LnwVjSNrzl7DGOWnkliaIQoZNtdlJwj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_colombia-down-argentina-brazil-stunned-in-world-cup-qualifiers_1728740089.html", "title": "Colombia down Argentina, Brazil stunned in South American World Cup qualifiers", "title_page": "Colombia down Argentina, Brazil stunned in South American World Cup qualifiers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MONTEVIDEO – Colombia avenged their Copa America final defeat with a 2-1 victory over Argentina on Sept 10, while Brazil crashed to a 1-0 loss to Paraguay in South American qualifiers for the 2026 World Cup.\nSkipper James Rodriguez buried a nerveless 60th-minute spot kick to seal a hard-fought win for Colombia over the world champions, who were without injured captain Lionel Messi.\nIt was sweet revenge for Colombia, who were beaten 1-0 by Argentina in a bitterly disappointing Copa final loss in Miami in July.\n“I don’t think I’ve ever scored against them – there’s a first time for everything,” Rodriguez said of his winning goal.\n“We want to get used to playing finals. Today was just another game, but against a team that has won everything – this victory tastes even better.”\nThe victory at Barranquilla’s Estadio Metropolitano lifted Colombia into second place in South America’s 10-team qualifying competition with 16 points from eight games, just two points behind leaders Argentina.\nColombia, backed by a passionate home crowd, took the lead in the 25th minute when Rodriguez chipped a cross to the back post, where Yerson Mosquera rose to head home.\nBut three minutes after the interval, the visitors drew level when a misplaced pass from Rodriguez was pounced upon by Nicolas Gonzalez, who raced away and slotted past advancing Colombia goalkeeper Camilo Vargas.\nTwelve minutes later, though, Colombia restored their lead in controversial fashion.\nNicolas Otamendi clattered into Daniel Munoz with a wild challenge and after several minutes, Chilean referee Piero Maza was sent to the pitch-side monitor and he awarded a penalty.\nRodriguez stepped up and confidently slotted home to win the game.\nDespite the defeat, Argentina remain comfortably on course for a place at the next World Cup, which is being co-hosted by the United States, Canada and Mexico.\nWith the tournament expanded to 48 teams, the top six finishers in South American qualifying will bag a berth. The seventh-placed team goes into an inter-confederation play-off, with the bottom three sides eliminated.\nFive-time world champions Brazil, meanwhile, continued their unconvincing campaign with a loss to Paraguay in Asuncion.\nInter Miami midfielder Diego Gomez – who is reportedly set to join English Premier League side Brighton & Hove Albion in January – scored the game’s only goal, crashing a long-range shot in off the post in the 20th minute to give seventh-placed Paraguay only their second win in the qualifiers.\nThe defeat leaves Brazil fifth in the standings on 10 points, with only goal difference keeping them above sixth-placed Venezuela, who drew 0-0 at home against third-placed Uruguay.\nFourth-placed Ecuador saw off cellar-dwellers Peru 1-0. AFP", "url": "https://www.straitstimes.com/sport/football/colombia-down-argentina-brazil-stunned-in-world-cup-qualifiers"}