{"authors": [], "date_download": "2024-10-12 14:02:49", "date_modify": "2024-10-12 14:02:49", "date_publish": "2024-06-06 01:42:02", "description": "Sabalenka was hampered by illness throughout the match, losing 6-7(5) 6-4 6-4. Read more at straitstimes.com.", "filename": "sport_tennis_teenager-andreeva-stuns-ailing-sabalenka-to-make-french-open-semis_1728741769.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/06/11391777.jpg?VersionId=4rOxPHqZuOL.aQwcMH5idkIOmGaRrCpv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_teenager-andreeva-stuns-ailing-sabalenka-to-make-french-open-semis_1728741769.html", "title": "Teenager Mirra Andreeva stuns ailing Aryna Sabalenka to make French Open semis", "title_page": "Teenager Mirra Andreeva stuns ailing Aryna Sabalenka to make French Open semis | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Second seed Aryna Sabalenka was sent crashing out of the French Open after a shock 6-7(5) 6-4 6-4 quarter-final loss to Russian teenager Mirra Andreeva on June 5 after being hampered by illness throughout the contest.\nVictory made the 17-year-old Andreeva, who will face 12th seed Jasmine Paolini in the last four, the youngest Grand Slam semi-finalist since a 16-year-old Martina Hingis at the US Open in 1997 and the youngest at Roland Garros since the Swiss great that same year.\nIt also snapped Australian Open champion Sabalenka's 11-match winning run at the Grand Slams in 2024 and ensured her earliest defeat at the majors since the French Open in 2022.\n\"It feels amazing. It was a thriller of a match and we both played good,\" Andreeva said.\n\"I'm really happy that I managed to win the match and go to my first semi-finals.\"\nAndreeva said she came into the match full of nerves and her main goal was to win more than the five games she did during her defeat by Sabalenka in the Madrid quarter-finals in May.\n\"After I lost the first set, I was like, 'well, now I have to go for the set at least to make it three sets. Afterwards, I just tried to play point by point and win as many points as I can,\" Andreeva said.\n\"I would say that in the beginning I didn't really believe it, because she's very experienced. She has two Grand Slams in her pocket. She's a great player, very aggressive.\n\"So it was like, 'we'll see what will happen... I'll try to enjoy the atmosphere and try to play the best way I can'.\"\nHaving won her last two meetings with Andreeva comfortably, Belarusian Sabalenka wasted little time getting to work as the Australian Open champion cranked up her big shots to go ahead 3-1 before her serve came undone in the opening set.\nA suddenly out-of-sorts and unwell Sabalenka called the trainer out after Andreeva, sensing a real opportunity to cause a massive upset on the biggest stage, cruised to a 5-3 lead.\nBut Sabalenka regrouped to force a tiebreak where the 2023 semi-finalist seized the advantage with a stunning drop shot on set-point.\nShe appeared to struggle physically again at the start of the next set and got a time violation for taking too long between games.\nShe crouched down to recover at one point, and looked agitated at 4-2 down, eventually allowing her Russian opponent to take the match into a decider.", "url": "https://www.straitstimes.com/sport/tennis/teenager-andreeva-stuns-ailing-sabalenka-to-make-french-open-semis"}