{"authors": [], "date_download": "2024-10-12 13:40:54", "date_modify": "2024-10-12 13:40:54", "date_publish": "2024-03-31 01:26:37", "description": "NOTTINGHAM, England - Nottingham Forest's Chris Wood rescued a point against Crystal Palace with a second-half equaliser to help his relegation-battling side move out of the drop zone after a 1-1 home draw in the Premier League on Saturday. Read more at straitstimes.com.", "filename": "sport_football_fighting-forest-salvage-1-1-home-draw-against-palace_1728740454.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/31/LYNXNPEK2T04Y-1.jpg?VersionId=8HUF.VR8kP9FCHsHXooWpqTcbI9Ib7Eg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_fighting-forest-salvage-1-1-home-draw-against-palace_1728740454.html", "title": "Fighting Forest move out of drop zone with draw against Palace", "title_page": "Fighting Forest move out of drop zone with draw against Palace | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NOTTINGHAM, England - Nottingham Forest's Chris Wood rescued a point against Crystal Palace with a second-half equaliser to help his relegation-battling side move out of the drop zone after a 1-1 home draw in the Premier League on Saturday.\nForest, plunged into the bottom three last week after having four points deducted for breaking financial rules last season, sit in 17th place with eight games to go.\nThey are level on 22 points with Luton Town, who lost at Tottenham Hotspur, but have a better goal difference after 30 games. Palace are 14th on 30 points from 29 matches.\nBefore kick off, Forest fans gave their view on the club's points deduction when they held up banners saying: \"We shall fight and we shall overcome\".\nPalace went ahead in the 11th minute with a well-worked team goal when Eberechi Eze found Jean-Philippe Mateta with a pinpoint cross and the Frenchman found the top corner to take his tally to four goals in his last seven games.\nTowards the end of the first half, Eze nearly doubled the visitors' lead but was denied by a brilliant Matz Sels save.\nForest equalised when Wood headed home Morgan Gibbs-White's cross from the left in the 61st minute, with the goal standing after the VAR checked for offside.\n\"At the moment it feels like we lost two points,\" Palace manager Oliver Glasner told the BBC.\n\"I was told a point away in the Premier League is a good point, so we respect a point here in Nottingham because they are in very good shape, especially at home.\n\"We took the lead and had three or four very good chances but we didn't decide the game. There were moments in the game where we were under pressure and in this phase they scored.\"\nForest continued to threaten Palace's defence after they levelled but were unable to finish their chances.\nForest boss Nuno Espirito Santo said he expected more from his side at home but was happy with the reaction shown after going down early.\n\"We wanted another result, in these games at home we expect more, we wanted more,\" he said. \"The game started badly, so the reaction was a positive but, at the same time, I think we did enough. We were more dominant, we controlled the game.\n\"We showed character, the City Ground was there for us again and we get a point. We wanted three, we get one but it is one that has to be valuable.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/fighting-forest-salvage-1-1-home-draw-against-palace"}