{"authors": [], "date_download": "2024-10-12 13:41:41", "date_modify": "2024-10-12 13:41:41", "date_publish": "2024-04-16 07:17:15", "description": "Noni Madueke and Nicolas Jackson wrestle each other for the ball as regular taker Cole Palmer stands bemused alongside them. Read more at straitstimes.com.", "filename": "sport_football_chelsea-manager-pochettino-fumes-over-penalty-taker-mayhem_1728740501.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/LYNXNPEK3E0U3-1.jpg?VersionId=Dlm0PukBFTgtjIMlW2ISZ5KH0_VWlhER", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_chelsea-manager-pochettino-fumes-over-penalty-taker-mayhem_1728740501.html", "title": "Chelsea manager Mauricio Pochettino furious over penalty-taker mayhem", "title_page": "Chelsea manager Mauricio Pochettino furious over penalty-taker mayhem | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Chelsea manager Mauricio Pochettino should have been beaming after his team destroyed Everton 6-0 on April 15, but, rather than celebrating Cole Palmer’s four-goal display, he fumed about his players arguing on the pitch.\nThe Blues were leading 4-0 after Palmer’s first-half hat-trick and a goal for Nicolas Jackson when they were awarded a penalty, after Noni Madueke was tripped in the English Premier League clash at Stamford Bridge.\nMadueke and Jackson then wrestled each other for the ball as the referee awaited a VAR (video assistant referee) confirmation, with regular taker Palmer standing bemused alongside them.\nEventually, captain Conor Gallagher had to intervene to shove the pair away, grab the ball and give it to Palmer, who duly despatched it to make it nine out of nine from the spot in the league.\n“The players know that the taker is Palmer. I am so upset about the situation,” Pochettino said.\n“It’s a shame and I want to apologise. I was telling the players... we cannot behave in this way. I told them this is the last time I accept this type of behaviour.\n“Players need to show that they are hungry to score but not in this type of situation. If we want to be a big team fighting for big things we have to think more of the collective... I won’t accept that this happens again.”\nPochettino also praised Gallagher for his intervention and left the players involved in no doubt that they are on thin ice.\n“Sometimes for young players the personal things are ahead of the team, but they need to know they need to perform for the team and learn quick,” he added.\n“If they don’t learn then yes, we’ll take some decisions. When you ask me why we have no consistency or are not performing, sometimes it is because of the standards and they need to learn quick because the demand is so high.”\nWhen he did eventually get around to discussing Palmer, he seemed to feel that the midfielder’s incredible night, and season, was almost to be expected.\n“He was a player always with the capacity to score when at Manchester City but the way he has adapted himself is fantastic,” he said as Palmer moved alongside Erling Haaland at the top of the Premier League scoring charts on 20 strikes.\n“He is amazing for the team, and he is showing that the club made the right decision in signing him.”\nAlfie Gilchrist scored the sixth goal for the Blues but, despite an eight-game unbeaten league run, Chelsea remain in ninth.\nStill, they are just three points adrift of sixth-placed Newcastle with a game in hand. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/football/chelsea-manager-pochettino-fumes-over-penalty-taker-mayhem"}