{"authors": [], "date_download": "2024-10-12 14:15:27", "date_modify": "2024-10-12 14:15:27", "date_publish": "2024-02-12 16:16:36", "description": "Fernando Alonso feels he could be fit enough to race in Formula One until he is 50, with Aston Martin already keen on extending his contract to 2026, but is unsure how long he wants to continue. Read more at straitstimes.com.", "filename": "sport_formula-one_alonso-feels-he-can-be-fit-to-race-until-50-if-motivated_1728742527.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/12/LYNXNPEK1B067-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_alonso-feels-he-can-be-fit-to-race-until-50-if-motivated_1728742527.html", "title": "Alonso feels he can be fit to race until 50, if motivated", "title_page": "Alonso feels he can be fit to race until 50, if motivated | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Fernando Alonso feels he could be fit enough to race in Formula One until he is 50, with Aston Martin already keen on extending his contract to 2026, but is unsure how long he wants to continue.\nThe 42-year-old Spaniard is signed to the end of 2024 but already talked of as a possible successor to Lewis Hamilton at Mercedes when the seven-times champion joins Ferrari next year.\nFew Formula One drivers have competed in their 40s in the modern era, although 1992 champion Nigel Mansell was a race winner at 41 in 1994.\nDouble world champion Alonso is the most experienced of all time and the oldest on the current grid, starting his 22nd season and 378th race in March. He told reporters ahead of Monday's launch of Aston Martin's AMR24 F1 car that he was fitter than ever.\n\"The numbers we achieve in all the physical tests that we do every season, they were the best ever this year,\" said the winner of 32 grands prix, who has added a nutritionist to his team.\nHe said he needed to prepare himself better than ever to be fully ready if he were to commit to a project for years to come.\n\"I will not drive a few more years in Formula One just to drive and to have fun. I am not that kind of driver, I'm not that kind of person,\" he said.\nOne of three active world champions but the only one still on the market for 2025, Alonso said he would talk first with Aston Martin if he decided to continue.\n\"A few years ago I would say that maybe 42 or 41 was the limit. Now after I saw myself last year motivated and performing well, I was thinking maybe that I can keep racing a few more years,\" he said.\n\"Now this winter I've been exceeding a little bit the expectations in terms of all the physical tests and everything that I did, so I would say that if you are motivated and if you want to commit you can drive maybe until 48 or 49 or even 50.\n\"But at the same time you have to give up everything in life. Formula One needs total dedication... and I gave my life for 24 years to this sport, which I'm happy and okay with.\n\"I can keep doing it for a few more years but I don't know if I will be racing until 50 with such a demanding calendar and things like that. Not for the ability, but because there are other things in life that I am curious (about).\"\nAlonso ended last season fourth overall and stood on the podium eight times -- three second places and five thirds.\nAston Martin team boss Mike Krack recognised Hamilton's move had made the driver market more complicated but told reporters: \"We love Fernando, we have a very good relationship... we would be delighted, honestly, to continue with Fernando into 2025 and the year after.\" REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/alonso-feels-he-can-be-fit-to-race-until-50-if-motivated"}