{"authors": [], "date_download": "2024-10-12 14:02:36", "date_modify": "2024-10-12 14:02:36", "date_publish": "2024-06-08 04:17:35", "description": "Zverev makes a slow start, but finds his range in the second set to win 2-6 6-2 6-4 6-2. Read more at straitstimes.com.", "filename": "sport_tennis_zverev-downs-ailing-ruud-to-set-up-alcaraz-final-at-roland-garros_1728741756.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/08/11396686.jpg?VersionId=BNk1NXmVCH7SqAUjR571vXx.tQKSjXDe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_zverev-downs-ailing-ruud-to-set-up-alcaraz-final-at-roland-garros_1728741756.html", "title": "Alexander Zverev downs ailing Casper Ruud to set up French Open final with Carlos Alcaraz", "title_page": "Alexander Zverev downs ailing Casper Ruud to set up French Open final with Carlos Alcaraz | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Alexander Zverev wobbled early on but steadied himself to get past ailing seventh seed Casper Ruud 2-6 6-2 6-4 6-2 on June 7 and reach the French Open final, where he will take on Carlos Alcaraz for an elusive maiden Grand Slam title.\nThe fourth seed, competing in his fourth straight Roland Garros semi-final, finally broke through to become the second German man to make the title clash in the Open Era and match Michael Stich’s feat from 1996.\n“I’m obviously extremely happy. I have so much history on this court, some of my best and my worst memories are on this court,” said Zverev, who sustained a serious ankle ligament injury during his semi-final against Rafa Nadal in 2022.\n“I’m happy to be in the final in my fourth attempt. I’m going to give it my all in the final on Sunday.”\nZverev made a slow start as Ruud grabbed an early break and the first set with some clean ball-striking in front of a sparse crowd on Court Philippe Chatrier, as fans were still recovering from a four-hour epic between Alcaraz and Jannik Sinner.\nHaving found his range in the second set, Zverev squandered the opportunity to grab a double break with a wayward volley but the 27-year-old pulled away to level the match and broke in the fifth game of third set before extending his advantage.\nThe 25-year-old Ruud slowly looked like himself again after dealing with a stomach issue but his hopes of a third successive Paris final faded when Zverev struck in the Norwegian’s opening service game in the fourth set and ran away with the match.\n“I knew I had to be much more aggressive. The first two sets were a high level, then I saw he was struggling,” Zverev said.\n“Credit to him to play until the end and fight until the end. He’s a great champion and person and definitely he’s going to be back.”\nHaving lost to Dominic Thiem in the 2020 US Open final, Zverev said he was ready to push for a first major title.\n“I was two sets to love and a break up and two points away from winning,” Zverev said of his Flushing Meadows title clash.\n“But I wasn’t ready to win my first Grand Slam final. I was too much of a kid. I’m 27 now, definitely not a kid anymore. If not now, then when? I’m in my first Roland Garros final and hopefully I can win my first Grand Slam.” REUTERS", "url": "https://www.straitstimes.com/sport/tennis/zverev-downs-ailing-ruud-to-set-up-alcaraz-final-at-roland-garros"}