{"authors": [], "date_download": "2024-10-12 13:43:16", "date_modify": "2024-10-12 13:43:16", "date_publish": "2024-10-02 09:44:03", "description": "The Gunners rose to eighth in the 36-team table, the last of the automatic-qualifying spots for the round of 16. Read more at straitstimes.com.", "filename": "sport_arsenal-boss-mikel-arteta-praises-unbelievable-kai-havertz-after-champions-league-win-over-psg_1728740596.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/11636441.jpg?VersionId=1f7pCXMFAOSdMblInfuaty8Mhn3.JLwR", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_arsenal-boss-mikel-arteta-praises-unbelievable-kai-havertz-after-champions-league-win-over-psg_1728740596.html", "title": "Arsenal boss Mikel Arteta praises ‘unbelievable’ Kai Havertz after Champions League win over PSG", "title_page": "Arsenal boss Mikel Arteta praises ‘unbelievable’ Kai Havertz after Champions League win over PSG | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Twelve months ago, Kai Havertz looked like a spare part at Arsenal after his big-money move across town from Chelsea, but now the German forward is fully justifying his £65 million (S$83.9 million) fee with a sensational start to the season.\nThe 25-year-old put Arsenal on the path to a 2-0 home win against Paris Saint-Germain in the Champions League on Oct 1 with a header off Leandro Trossard’s cross in the 20th minute, before Bukayo Saka’s free-kick goal 15 minutes later.\nAfter taking 10 games to get off the mark for the Gunners last season, it was Havertz’s fifth goal for the club in the current campaign and he deservedly picked up the Man of the Match award.\n“He has been unbelievable. His football brain, the way he understands space, his timing, he brings people together,” said Arsenal manager Mikel Arteta, who showed great faith in Havertz, even when he was struggling last season.\n“His work ethic is incredible and now he is a real threat around the box. He is one of our main players at the moment.”\nHavertz added: “We’ve learnt from last season, when we went out in the quarter-final. We’ve grown up as a team... I think we showed that we are ready for these kinds of matches.”\nIt was a satisfying night for Arteta, whose men dominated one of Europe’s heavyweights in the first half and then comfortably contained them after the break.\n“Really, really happy with the performance. We played an opponent that has a lot of personality, is really difficult to deal with when you don’t have the ball,” he said.\n“The first half was very dominant and we created a lot of chances and then the second half was a different story. We suffered much more than we should have done. The Champions League brings different demands but I think we handled it really well.”\nVictory at the Emirates Stadium, following the 0-0 draw away to Atalanta, propelled Arsenal to eighth in the 36-team table. Arteta said it was far too early to predict how many more wins his side will need to qualify automatically for the last 16.\n“I’m not even looking at the table,” he said. “But I think it will be a long journey.”\nThis was also Arsenal’s 17th clean sheet in 32 games in all competitions in 2024, the most of any Premier League side. In Europe’s big-five leagues, only Real Madrid have a better record (18).\nAnother boost for Arsenal was the sight of new signing Mikel Merino coming off the bench in the second half for his first appearance after missing the start of the season with injury.\nBut fullback Jurrien Timber was taken off at half-time as a precautionary measure after picking up a muscle issue.\nBut such is the confidence in the Gunners squad that Saka told CBS Sports: “I don’t want to put too much pressure on us, but I do think that this is the year (that we can win the Premier League title).\n“We’ve been close the last two years and we’re getting closer, but this hopefully will be the year.”\nPSG coach Luis Enrique, meanwhile, said he has no idea how long it will take to turn his side back into a European force after the suffering their first defeat of the season.\nThe French champions, who lost their talisman Kylian Mbappe to Real Madrid in the summer, look like a side in transition. They hit the woodwork twice but were comfortably contained by their hosts.\nEnrique, who left out forward Ousmane Dembele for disciplinary reasons, accepted his share of responsibility for the defeat but appeared to question his side’s fighting spirit.\n“Today we were far away from the standards you need in this kind of match. Arsenal were much better in terms of pressure, intensity, they won every duel,” he said.\nThe Spaniard led PSG to last season’s Champions League semi-finals as they beat his former club Barcelona in the quarter-finals.\nThey are top of Ligue 1 and beat Girona in their opening Champions League group game, but Arsenal were a big step up in quality for Enrique’s men.\n“Arteta has been here for five years, I’ve been at Paris for one year and two months,” added Enrique. “I don’t know where we are. I have a clear idea where I want us to be, but I don’t know how much time I will need.” REUTERS", "url": "https://www.straitstimes.com/sport/arsenal-boss-mikel-arteta-praises-unbelievable-kai-havertz-after-champions-league-win-over-psg"}