{"authors": [], "date_download": "2024-10-12 13:35:42", "date_modify": "2024-10-12 13:35:42", "date_publish": "2024-08-29 04:00:03", "description": "Team Singapore have 10 athletes competing in Paris, including veteran swimmer Yip Pin Xiu. Read more at straitstimes.com.", "filename": "sport_paris-paralympics-open-in-city-of-light_1728740142.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/29/TOPSHOTS-TOPSHOT-OLY-PARIS-2024-PARALYMPICS-OPENING-220923.jpg?VersionId=A1UiYuy4kwGQfMDg4QhLN9cPWXuCpssZ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_paris-paralympics-open-in-city-of-light_1728740142.html", "title": "Paralympics opening ceremony lights up Paris as athletes parade along Champs-Elysees", "title_page": "Paralympics opening ceremony lights up Paris as athletes parade along Champs-Elysees | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The opening ceremony of the Paris Paralympics got under way on Aug 28 in the centre of the French capital, firing the starting gun on 11 days of intense competition.\nJust as for the opening ceremony of the Olympics on the River Seine in July, it took place away from the main stadium for the first time at a Paralympics.\nIn balmy weather - in contrast to the heavy rain which blighted the opening of the Olympics - the Games opened in Place de la Concorde, in the presence of French President Emmanuel Macron.\nThe 4,400 athletes from 168 delegations paraded down the adjoining Champs-Elysees avenue in front of thousands of spectators before entering the historic square as the sun set.\nParalympic powerhouse China dominated the last Paralympics in Tokyo with 96 golds and has again sent a strong delegation, which cut a red swathe through the arena as it performed a lap of the stage soundtracked by a DJ set of French and global hits.\nThe ceremony will culminate with the lighting of the cauldron in the Tuileries Gardens, which has become a huge attraction since its debut at the Olympics.\nA total of 18 of the 35 Olympic venues will be used for the Paralympics, which run until Sept 8, including the ornate Grand Palais and the Stade de France.\nTicket sales have picked up since the Olympics and organisers say more than two million of the 2.5 million available have been sold, with several venues sold out.\nTheatre director Thomas Jolly, who also oversaw the Olympics opening ceremony, said there was a clear symbolism in holding the Paralympics ceremony in the centre of the French capital - a city whose Metro system, in particular, is completely unadapted to the needs of wheelchair users.\n“Putting Paralympic athletes in the heart of the city is already a political marker in the sense that the city is not sufficiently adapted to every handicapped person,” Jolly said earlier this week.\nOrganisers say wheelchair users can take Paris buses and they have laid on 1,000 specially adapted taxis as well.\nAway from the track, more established names go in search of glory.\nIranian sitting volleyball legend Morteza Mehrzad, who stands 2.46m tall, will attempt to take gold again and Beatrice “Bebe” Vio, the Italian fencer who had to have all four limbs amputated when she contracted meningitis at the age of 11, is aiming for the third Paralympic title of her career.\nThe Paralympics always have a far wider message than simply sport, and International Paralympic Committee president Andrew Parsons told AFP earlier this year he hopes the Paris edition will restore the issues facing disabled people to the top of the list of global priorities.\nParsons believes the Games “will have a big impact in how people with disability are perceived around the world”.\n“This is one of the key expectations we have around Paris 2024; we believe that we need people with disability to be put back on the global agenda,” the Brazilian said.\n“We do believe people with disability have been left behind. There is very little debate about persons with disability.” AFP", "url": "https://www.straitstimes.com/sport/paris-paralympics-open-in-city-of-light"}