{"authors": ["David Lee"], "date_download": "2024-10-12 13:44:49", "date_modify": "2024-10-12 13:44:49", "date_publish": "2023-10-03 18:07:22", "description": "The world No. 9 was eliminated in the round of 32 by Malaysia’s Ng Tze Yong. Read more at straitstimes.com.", "filename": "sport_loh-kean-yew-falls-at-first-hurdle-of-asian-games-badminton-men-s-singles-event_1728740689.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/03/photo2023-10-0318-11-00.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_loh-kean-yew-falls-at-first-hurdle-of-asian-games-badminton-men-s-singles-event_1728740689.html", "title": "Loh Kean Yew falls at first hurdle of Asian Games badminton men’s singles event", "title_page": "Loh Kean Yew falls at first hurdle of Asian Games badminton men’s singles event | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANGZHOU – Despite some kids chanting his name and a few male fans trying to will him into a decider, Singapore’s Loh Kean Yew just could not mount a comeback as he lost 21-12, 21-14 to Malaysian Ng Tze Yong in the badminton men’s singles round of 32 on Tuesday.\nThe world No. 9 was visibly disappointed at the end of the match as he hung his head at the net while shaking the 19th-ranked Ng’s hand.\nReflecting on the premature end to his Asian Games debut, Loh, 26, said: “There are a lot of emotions now, mostly negative. Results matter and I’m also not happy with my processes during the match. It sucks because this is far apart from what I want to achieve and, in this match, I was far apart from him.\n“He played a very steady game and I didn’t. I’ve been trying to work and improvise my game and I haven’t been in good form. I tried to do what I can, but it wasn’t enough.”\nIt has been a roller-coaster year for Loh, who is still looking for a follow-up title after his 2021 world championships triumph. While he made the finals of the Asian Championships and Korea Open, he also fell at the first hurdle in five out of 13 BWF World Tour tournaments in 2023, and now the Asian Games.\nTrailing from the start against a defensively sound Ng, who now leads their head-to-head record 3-1, Loh looked subdued and never really got going with his trademark smashes, while his opponent managed to score with angled drives.\nFrom 10-11 down in the opener, Loh won just two of the next 12 points. In the second game, he strung together four points to reduce the deficit to 14-18 but Ng, 23, proved to be the more consistent player as he earned a last-16 tie against Thailand’s Kantaphon Wangcharoen on Wednesday.\nNational singles coach Kelvin Ho said: “We did not create enough momentum to put Tze Yong on the back foot. We were planning for more consistency and variation to make the opponent uncomfortable, but the shot quality wasn’t good enough.”\nThe luck of the men’s singles draw also threw up other tantalising clashes as Taiwanese world No. 13 Chou Tien-chen eliminated Indonesia’s defending champion and world No. 5 Jonatan Christie 21-17, 21-17, while Thailand’s world champion Kunlavut Vitidsarn was also taken to a decider by Vietnam’s Nguyen Hai Dang before winning 17-21, 21-18, 21-15.\nMalaysia would end up with the bragging rights after they won both Causeway derbies at the Binjiang Gymnasium on Tuesday, with 27th-ranked Jin Yujia and Crystal Wong losing 21-12, 21-16 to world No. 9 Pearly Tan and Thinaah Muralitharan.\nThe Singaporeans put up a stronger fight in the second game and caught up to 16-16, but their opponents’ strong defence and Tan’s formidable smashes – the 23-year-old holds the world record for the fastest female smash at 438kmh – helped them seal victory.\nWong said: “We tried to be more aggressive in attack, and confident in our defence, and that helped in the second game.”\nJin added: “We played a decent game but there are more areas to work on and learn from our opponents, like how they set up and follow up on their attacks with very smooth rotations that make it very threatening for opponents.”\nEarlier in the day, compatriot Jason Teh made it to the last 16 after beating Maldivian Ahmed Nibal 21-8, 21-12. The world No. 83 faces Indonesia’s top seed and world No. 2 Anthony Ginting on Wednesday.\nIn the women’s singles, world No. 22 Yeo Jia Min beat Kazakh Kamila Smagulova 21-7, 21-7 and will meet China’s Olympic champion and third-ranked Chen Yufei for a place in the quarter-finals.\nFormer world No. 1 juniors Nge Joo Jie and Johann Prajogo are also in action in the men’s doubles. The 106th-ranked pair take on Nepal’s Jivan Acharya and Bishnu Katuwal while 30th-ranked mixed doubles pair Terry Hee and Jessica Tan face Hong Kong’s world No. 20 Tang Chun Man and Tse Ying Suet.", "url": "https://www.straitstimes.com/sport/loh-kean-yew-falls-at-first-hurdle-of-asian-games-badminton-men-s-singles-event"}