{"authors": [], "date_download": "2024-10-12 14:15:25", "date_modify": "2024-10-12 14:15:25", "date_publish": "2024-02-12 16:11:36", "description": "Aston Martin launched their new AMR24 Formula One car on Monday with technical director Dan Fallows making a bold claim about the Silverstone-based team's prospects against dominant champions Red Bull. Read more at straitstimes.com.", "filename": "sport_formula-one_aston-martin-see-red-bull-as-absolutely-beatable_1728742525.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/12/LYNXNPEK1B063-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_aston-martin-see-red-bull-as-absolutely-beatable_1728742525.html", "title": "Aston Martin see Red Bull as 'absolutely beatable'", "title_page": "Aston Martin see Red Bull as 'absolutely beatable' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Aston Martin launched their new AMR24 Formula One car on Monday with technical director Dan Fallows making a bold claim about the Silverstone-based team's prospects against dominant champions Red Bull.\n\"We take the approach that Red Bull are absolutely beatable,\" the Briton, who joined Aston Martin from Red Bull where he was in charge of aerodynamics, told reporters on a video call.\n\"That's what we're chasing after. We're focusing on them and that's what we're aiming for.\"\nRed Bull won a record 21 of 22 races last year with Max Verstappen securing his third drivers' title in a row in the most dominant season yet.\nMercedes-powered Aston Martin finished fifth overall after being Red Bull's closest challengers in the opening races, with double world champion Fernando Alonso on the podium in four of the first five.\nInformed of Fallows's comment, the Spanish driver told reporters: \"It's a good thing he says that. It put a smile on my face... we have to be optimistic at this part of the season.\n\"I think we have to be regularly in the points first, fighting for podiums as we did last year and then if we are in that position it will be lovely to achieve the first victory in green for Aston Martin and hopefully I can be behind the wheel at that moment.\"\nAsked whether he thought Red Bull could be beatable over the entirety of a season, rather than just in a grand prix, Fallows said Red Bull were the benchmark in terms of performance.\n\"Whoever's the fastest car is the focus for us and that's what we're looking at,\" he said.\n\"Rather than thinking about individual races, from an engineering point of view we have to make a car that's capable of operating at any circuit and being competitive.\"\nThe new car, in racing green colours, is the first to emerge from Aston Martin's new Silverstone factory and was presented on the same day as the sportscar maker's new Vantage road car and Vantage GT3 racer.\nThe chassis design, nose, front wing and suspension of the Formula One car are all new with a focus on producing a more all-round car that can be developed through the season.\n\"We're very pleased with the step that we've made over the winter, we think we have made a step on last year's car, which is what we wanted,\" said Fallows, who described the car as a \"strong evolution\".\nTeam boss Mike Krack said the team had two great drivers, with Alonso and Canadian Lance Stroll -- son of owner Lawrence -- now well integrated.\nThe season starts in Bahrain on March 2. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/aston-martin-see-red-bull-as-absolutely-beatable"}