{"authors": [], "date_download": "2024-10-12 14:03:31", "date_modify": "2024-10-12 14:03:31", "date_publish": "2024-05-06 14:27:34", "description": "The duo made their relationship official on social media during the 2023 French Open. Read more at straitstimes.com.", "filename": "sport_tennis_tsitsidosa-era-ends-as-badosa-announces-split-with-tsitsipas_1728741811.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/07/hztennis070524.jpg?VersionId=JYp.BZL2.vDOSi7k0l7FvDJLnwxj8aHH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_tsitsidosa-era-ends-as-badosa-announces-split-with-tsitsipas_1728741811.html", "title": "Paula Badosa announces split with Stefanos Tsitsipas", "title_page": "Paula Badosa announces split with Stefanos Tsitsipas | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME – Former world No. 2 Paula Badosa is no longer in a romantic relationship with fellow tennis player Stefanos Tsitsipas after nearly a year together in the spotlight, the Spaniard said.\nThe duo made their relationship official on social media during the 2023 French Open and have often been seen at each other’s matches, while also posting pictures on their joint Instagram account.\nBut the 26-year-old Badosa, who has fallen to No. 126 in the world with a string of injuries derailing her career, said that the sport’s power couple dubbed “Tsitsidosa” by fans had split amicably.\n“After careful consideration and many cherished moments together, Stefanos and I have decided to amicably part ways,” Badosa wrote in an Instagram story on May 5.\n“We have shared a journey filled with love and learning, and it is as friends with immense mutual respect that we now choose to move forward on our own paths.\n“We are grateful for the support of our friends, family, and all who have been part of our story. As we transition into this new chapter of our lives, we continue to wish each other nothing but the best in all our endeavours.”\nThe former French Open quarter-finalist said recently that doctors had told her it would be complicated to continue her career because of her chronic back pain, but she vowed to “keep fighting”.\nOn May 7, she defeated 17-year-old Russian sensation Mirra Andreeva 6-2, 6-3 in the first round of the Italian Open.\nBadosa was almost at her best in the 1hr 34min victory, hitting 23 winners while committing 13 unforced errors.\nThe Spaniard will face American Emma Navarro in the second round.\nTwo-time Grand Slam runner-up Tsitsipas, who is also competing in Rome, crashed out of his Madrid Masters opener in April but the 25-year-old has otherwise had a good run of form on clay.\nThe Greek won the Monte Carlo Masters and finished runner-up in Barcelona to prime himself for the French Open.\nOne player whose participation in the second Grand Slam of the year is in doubt is world No. 5 Jessica Pegula.\nThe American said she is feeling better after shaking off an injury that derailed her clay-court season but is unsure if she will play at Roland Garros.\nThe 30-year-old was one of the most consistent players on the WTA Tour last season, winning the Montreal title in the build-up to the US Open, but has struggled in the 2024 campaign due to illness and injuries.\nHaving withdrawn from Stuttgart and Madrid, Pegula confirmed she was also skipping Rome and said she may have to miss the French Open.\n“Hi guys – quick update – will miss Rome and possibly RG. I actually feel really good but have to work back into training at a snail’s pace,” Pegula said on Instagram.\nShe did not specify what the latest injury was.\nPegula, who also missed tournaments in the Middle East in February due to a neck issue, last competed in the Billie Jean King Cup in April. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/tsitsidosa-era-ends-as-badosa-announces-split-with-tsitsipas"}