{"authors": [], "date_download": "2024-10-12 14:01:23", "date_modify": "2024-10-12 14:01:23", "date_publish": "2024-06-19 22:00:57", "description": "Formula One statistics for Sunday's Spanish Grand Prix at Barcelona's Circuit de Catalunya, round 10 of the 24 race season: Read more at straitstimes.com.", "filename": "sport_formula-one_formula-one-statistics-for-the-spanish-grand-prix_1728741683.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/19/LYNXMPEK5I0FE-1.jpg?VersionId=UWHF0tlsn1qmqUW_RT1VW303ebRmJYUJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_formula-one-statistics-for-the-spanish-grand-prix_1728741683.html", "title": "Formula One statistics for the Spanish Grand Prix", "title_page": "Formula One statistics for the Spanish Grand Prix | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Formula One statistics for Sunday's Spanish Grand Prix at Barcelona's Circuit de Catalunya, round 10 of the 24 race season:\nLap distance: 4.657 km. Total distance: 307.236 km (66 laps)\n2023 pole position: Max Verstappen (Netherlands) Red Bull One minute 12.272 seconds\n2023 race winner: Verstappen\nStart time: 1300 GMT (1500 local)\nRace lap record: Verstappen 1:16.330 (2023)\nSPAIN\nThe 14-turn Circuit de Catalunya is hosting what will be the 54th world championship Spanish GP.\nLewis Hamilton has won the Spanish GP six times (2014, 2017, 2018, 2019, 2020, 2021), a record he shares with Michael Schumacher.\nOther past winners on Sunday's grid are Fernando Alonso (2006, 2013) and Verstappen (2016, 2022, 2023).\nVerstappen took his first F1 win in Spain.\nThe winner at the Circuit de Catalunya, which has a mix of fast and slow corners with two long straights, has started on pole 24 times in 33 races.\nThe only drivers to win in Barcelona and not start on the front row were Schumacher (third on the grid in 1996), Alonso (from fifth in 2013) and Verstappen (fourth in 2016).\nAlonso and Ferrari's Carlos Sainz are the only Spanish drivers in the race.\nFerrari are the most successful team at the Circuit de Catalunya with eight wins. Since 1951, the Italian team have won 12 times in Spain.\nCHAMPIONSHIP LEAD\nVerstappen has led the championship for a record 48 successive races dating back to Spain in May 2022 and arrives in Montreal 56 points clear of Ferrari's Charles Leclerc after nine rounds.\nRed Bull are 49 points clear of Ferrari.\nWINS\nVerstappen has won six of nine races this season, with Ferrari's Carlos Sainz triumphant in Melbourne, McLaren's Lando Norris in Miami and Ferrari's Charles Leclerc in Monaco.\nFerrari are the only team to have had two winning drivers this season.\nHamilton has a record 103 career victories from 341 starts. He has now gone 54 races without a win, a run dating back to 2021.\nRed Bull won 21 of 22 races last year, with Verstappen victorious in a record 19, and have won 37 of the last 42.\nThe team have won 119 races and are fourth in the all-time list of winners. Ferrari lead with 245, McLaren have 184 and Mercedes 125.\nVerstappen has won 60 grands prix and is third on the all-time list. Michael Schumacher is second on 91.\nPOLE POSITION\nHamilton has a record 104 career poles, his most recent in Hungary last year.\nVerstappen took the first seven poles of the season, equalling Alain Prost's 1993 record, and eight in a row including the last race of 2023 -- equalling Ayrton Senna's 1988-89 record.\nLeclerc ended that run with pole in Monaco and George Russell was on pole for Mercedes in Canada.\nPODIUMS\nVerstappen has 105 career podiums, Hamilton 197.\nThe Red Bull driver set a record of 21 podiums in a season last year but Michael Schumacher remains the only driver to have stood on the podium in every race of a season (2002).\nVerstappen has been on the podium seven times this season.\nMILESTONE\nThe race will be Sainz's last outing with Ferrari in front of his home crowd. Aston Martin's Fernando Alonso will be starting his 21st home grand prix. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/formula-one-statistics-for-the-spanish-grand-prix"}