{"authors": [], "date_download": "2024-10-12 14:15:29", "date_modify": "2024-10-12 14:15:29", "date_publish": "2024-01-23 18:16:31", "description": "Madrid will host the Spanish Formula One Grand Prix from 2026 to 2035 on a new circuit around the capital's IFEMA exhibition centre, the sport announced on Tuesday. Read more at straitstimes.com.", "filename": "sport_madrid-to-host-spanish-gp-from-2026_1728742529.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/23/LYNXMPEK0M0BH-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_madrid-to-host-spanish-gp-from-2026_1728742529.html", "title": "Madrid to host Spanish GP from 2026", "title_page": "Madrid to host Spanish GP from 2026 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MADRID -Madrid will host the Spanish Formula One Grand Prix from 2026 to 2035 on a new circuit around the capital's IFEMA exhibition centre, the sport announced on Tuesday.\nBarcelona's Circuit de Catalunya currently hosts the country's grand prix and has a contract until after the 2026 race. There was no mention of that circuit in the Formula One statement.\nSources indicated talks were continuing with Barcelona about the circuit's future, however, with a possibility of Spain having two races in 2026.\nThe country currently has two Formula One drivers -- Carlos Sainz at Ferrari and double world champion Fernando Alonso, now 42 but still a frequent podium finisher last season, at Aston Martin.\n\"Madrid is an incredible city with amazing sporting and cultural heritage, and today’s announcement begins an exciting new chapter for F1 in Spain,\" said Formula One chief executive Stefano Domenicali.\nThe race proposal, he added, \"truly epitomises Formula One’s vision to create a multi-day spectacle of sport and entertainment that delivers maximum value for fans and embraces innovation and sustainability.\"\nMadrid last hosted a grand prix at Jarama to the north of the city in 1981, with the Circuit de Catalunya near Barcelona becoming the home of the Spanish race in 1991.\n\"Modern Formula One cars racing on a new circuit in the Spanish capital city of Madrid is an enticing prospect,\" said Mohammed Ben Sulayem, president of the governing FIA, in a statement.\n\"As we build towards the introduction of the FIA 2026 Formula One regulations, which have been framed with Net Zero carbon by 2030 in mind, it is pleasing to see that the local organisers have placed a sharp focus on environmental sustainability in their plans for the event.\"\nThe proposed 5.47km circuit, using both street and non-street sections, remains subject to FIA homologation and safety checks as well as calendar approval by the World Motor Sport Council.\nThe layout, near the city's Barajas airport and with 90% of fans expected to access the venue by public transport links, will feature 20 corners.\nThe venue's projected capacity is more than 110,000 spectators per day with plans to increase that to 140,000 over the first half of the agreement, making Madrid one of the largest venues on the calendar.\n\"This event, which we expect to be followed on a global scale by 70 million people, will represent an increase of more than 450 million euros ($489.92 million) in Madrid's GDP per year and the creation of 8,200 jobs,\" said the president of the Madrid region Isabel Diaz Ayuso. REUTERS", "url": "https://www.straitstimes.com/sport/madrid-to-host-spanish-gp-from-2026"}