{"authors": [], "date_download": "2024-10-12 13:43:38", "date_modify": "2024-10-12 13:43:38", "date_publish": "2024-07-07 16:43:43", "description": "They beat Switzerland 5-3 in a shoot-out success to advance to the Euro 2024 semi-finals. Read more at straitstimes.com.", "filename": "sport_football_gareth-southgate-s-england-no-longer-fear-football-s-death-penalty_1728740618.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/07/FBL-EURO-2024-MATCH48-ENG-SUI-190834.jpg?VersionId=yCXJEg.F5gzQGXw88xRj2XE5G3ml5nO9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_gareth-southgate-s-england-no-longer-fear-football-s-death-penalty_1728740618.html", "title": "Gareth Southgate’s England no longer fear football’s death penalty", "title_page": "Gareth Southgate’s England no longer fear football’s death penalty | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUSSELDORF – England have suffered plenty of penalty shoot-out heartache but showed composure against Switzerland on July 6 to seal a Euro 2024 semi-final place and prove their spot-kick improvement under manager Gareth Southgate.\nThere was not much to enthuse over in the 120 minutes as the teams played to a 1-1 draw in Dusseldorf. And ahead of the shoot-out, England may have had flashbacks to the Euro 2020 final at Wembley where they lost to Italy in another shattering defeat.\nBut Southgate, driven by his own personal failure at Euro 96 on home soil, has worked to improve the mentality of his team in shoot-outs.\nThey netted all five kicks against the Swiss with confidence. After the 5-3 shoot-out success, he said: “In a penalty shoot-out their composure was impeccable.”\nThe comments from his team at the Merkur Spiel-Arena highlight this belief.\nWhen asked how he felt about taking the pressure-laden final kick, Trent Alexander-Arnold said: “Excitement, to be honest. It’s a moment I prepared for. They’re the moments that all players want to have. To be on the final penalty and win it for your country was something I’ll never forget.”\nBukayo Saka, who was racially abused after missing a penalty against Italy, added: “You can fail once but you have a choice of whether or not you gonna put yourself in that position again. I’m a guy that’s gonna put myself in that position, I believed in myself.”\nEven those who did not step up had great confidence in their teammates who did. Said Ezri Konsa: “Never in doubt, especially with the boys that took them. Very confident. It’s something that we’ve been working on for quite a while now.”\nThe victory was another step forward in banishing a demon that has followed England for 34 years, since the semi-final of the 1990 World Cup when they lost on spot kicks to West Germany.\nIt was England’s third shoot-out success at the World Cup or European Championship in 10 attempts. Some of those losses have become engrained in the nation’s football psyche. After the heartache of Italia 90, the Germans inflicted another semi-final shoot-out disappointment at Euro 96, when Southgate missed England’s sixth kick at Wembley.\nHis personal heartbreak was repeated when England lost five shoot-outs in a row in major competitions. And when he became manager of the side in 2016, Southgate made it his ambition to change the mentality of the team around penalties. He recognised it was not a lack of ability, but a mental battle and something that could be improved through changing how the team train.\nIn the pressure-filled moment of taking the penalty, with tired legs and the weight of a nation on their shoulders, it was as much about how they would deal with the situation as a test of skill.\n“All I wanted was the ball: put it on the spot, get it over and done with,” Southgate said of his 1996 experience.\nHe knew he needed his players to be more focused, and England finally ended their run of shoot-out losses when they beat Colombia 4-3 in the last 16 at the 2018 World Cup.\nSouthgate had made his tired players practise penalties over and over at the end of training sessions, trying to replicate what their legs may feel like after 120 minutes of a game. He tried to improve their technique and made them more confident in trusting their ability to pick the right spot.\nPlace the ball where the goalkeeper cannot get it, even if he guesses right. He asked the players to slow down their process once the referee blew his whistle for the penalty to be taken and not rush.", "url": "https://www.straitstimes.com/sport/football/gareth-southgate-s-england-no-longer-fear-football-s-death-penalty"}