{"authors": [], "date_download": "2024-10-12 13:40:41", "date_modify": "2024-10-12 13:40:41", "date_publish": "2024-04-12 19:55:45", "description": "Wrexham AFC can clinch promotion for the second successive year if results go their way on Saturday in what would be the latest thrilling chapter in the Welsh team's Hollywood story. Read more at straitstimes.com.", "filename": "sport_football_the-sequel-wrexham-tantalisingly-close-to-second-straight-promotion_1728740441.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/12/LYNXNPEK3B0GH-1.jpg?VersionId=ITIDIjrmrNvDorBb.Zog0a52xgKXP0BG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_the-sequel-wrexham-tantalisingly-close-to-second-straight-promotion_1728740441.html", "title": "The sequel: Wrexham tantalisingly close to second straight promotion", "title_page": "The sequel: Wrexham tantalisingly close to second straight promotion | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Wrexham AFC can clinch promotion for the second successive year if results go their way on Saturday in what would be the latest thrilling chapter in the Welsh team's Hollywood story.\nWrexham need five points from their final three games to guarantee promotion to League One and their return to the third tier of English football for the first time since 2004-05.\nThey have never been promoted in back-to-back seasons in their 159-year history and if they achieve the feat it would be a script that owners and Hollywood A-list actors Ryan Reynolds and Rob McElhenney could only have dreamed of acting out.\nWrexham, who are in second place in the standings, must beat visiting bottom side Forest Green Rovers on Saturday and hope there are no wins for MK Dons, who host Mansfield Town, and Barrow, who visit Gillingham, to clinch promotion.\n\"Our aim is to focus on the game and what we've got to do ourselves,\" Wrexham manager Phil Parkinson told the BBC. \"We can't control anything outside and our destiny is ultimately in our own hands.\n\"We're just preparing to play as well as we can at the weekend and see if that's good enough to get the points against a Forest Green team who are obviously fighting for their lives.\n\"We're going to go out and win the game and see what happens at the end. Whatever happens elsewhere we've got to go out and get the three points.\"\nWrexham, who scripted a fairytale return to the EFL last season when they won the National League with a record 111 points, have gained global acclaim thanks to the documentary \"Welcome to Wrexham\" that chronicles the club's rise since its purchase by Reynolds and McElhenney.\nDuring Wrexham's 4-1 win over Crawley Town on Tuesday, Reynolds posted a picture of himself on social media watching the game on a huge screen while on a movie set, writing \"Watching the @wrexham_afc game at work: new level unlocked.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/the-sequel-wrexham-tantalisingly-close-to-second-straight-promotion"}