{"authors": [], "date_download": "2024-10-12 13:40:19", "date_modify": "2024-10-12 13:40:19", "date_publish": "2024-05-10 20:56:19", "description": "LONDON - Luton Town are still in the fight and will stick to their attacking philosophy in a must-win Premier League game at West Ham United on Saturday, according to manager Rob Edwards. Read more at straitstimes.com.", "filename": "sport_football_were-in-the-fight-says-proud-luton-boss-edwards_1728740419.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/10/LYNXMPEK490E9-1.jpg?VersionId=ZXHqB69x_rZgI2DKCjGclZ8X0xc_SXrA", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_were-in-the-fight-says-proud-luton-boss-edwards_1728740419.html", "title": "We're in the fight, says proud Luton boss Edwards", "title_page": "We're in the fight, says proud Luton boss Edwards | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Luton Town are still in the fight and will stick to their attacking philosophy in a must-win Premier League game at West Ham United on Saturday, according to manager Rob Edwards.\nWith two games left, 18th-placed Luton are clinging to their top-flight status by their fingernails but if they do go straight back down it will be on their own terms.\n\"We are third from bottom, we are on the verge, but we are also on the verge of staying up as well,\" Edwards told the BBC. \"We have evolved, we've changed and that gives me heart.\"\nDespite winning many fans with style of their football, Luton's survival is out of their hands.\nThey are three points behind 17th-placed Nottingham Forest who also have a far superior goal difference.\nA Luton defeat by West Ham would effectively seal their fate and even if they win, a Forest victory over Chelsea later in the day would all but send Luton down.\nBut having returned to the top flight for the first time in 31 years, Edwards says Luton will not go down with a whimper.\n\"We can cope with the pressure, we have dealt with that before,\" he said. \"The game at West Ham is a final, we will give it a go, there is no other way.\n\"We are in the fight, and I keep getting messages from people or fans in the street saying we can do this.\"\nWhatever the outcome of their battle for survival, humble Luton have impressed with their approach this season.\nAsked about what had changed, Edwards said: \"At first we wanted to block things off, work things out, but we quite quickly worked out that this isn't the best way for us to win football matches and it's not me.\n\"We wanted to go for it. So I can take a lot of pride in the fact that we have developed the team and moved the team forward and the players forward.\n\"But the level and quality of the Premier League, the difference is vast, it's a chasm.\n\"If Man City play well they win, with us if we play well we don't necessarily win because the levels are different.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/were-in-the-fight-says-proud-luton-boss-edwards"}