{"authors": [], "date_download": "2024-10-12 14:17:54", "date_modify": "2024-10-12 14:17:54", "date_publish": "2024-08-25 14:15:28", "description": "Australia's Adam Scott (74) is in second, while Ludvig Aberg (71) is tied for third with fellow Swede Alex Noren (70) at 10 under. Read more at straitstimes.com.", "filename": "sport_golf_keegan-bradley-holds-one-shot-lead-at-bmw-championship_1728742674.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/25/GLF-SPO-USP-BMW-CHAMPIONSHIP-ROUND-THREE-223141.jpg?VersionId=iT4U8dxycwC.XpyvZOvDM0BMbbP87EZI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_keegan-bradley-holds-one-shot-lead-at-bmw-championship_1728742674.html", "title": "Keegan Bradley holds one-shot lead at BMW Championship, entering final round at 12 under", "title_page": "Keegan Bradley holds one-shot lead at BMW Championship, entering final round at 12 under | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CASTLE ROCK – A strong finish on Aug 24 has Keegan Bradley in the lead by one stroke after the third round of the BMW Championship at Castle Pines Golf Club.\nThe 2025 United States Ryder Cup captain birdied the last two holes to post a round of two-under 70, putting him at 12-under 204 for the tournament heading into the final round on Aug 25. The last man to secure a spot in the 50-player field, Bradley also led after the first round of the FedEx Cup play-offs’ penultimate event.\nIt was a wild, up-and-down round for the 2011 PGA Championship winner, who had eight birdies and six bogeys and hit only 50 per cent of greens in regulation. But Bradley’s putter bailed him out, as he ranked No. 1 on the day with 1.11 putts per green in regulation.\n“It was tough out there today,” the 38-year-old said.\n“It was really windy, a lot of elevated tees that were into the wind, which makes it really tough. Proud of the way I fought today. I played some brilliant golf, but I hit also some terrible shots, too. I guess that’s the way of the world. But I’m proud of the way I fought there in the end.”\nSecond-round leader Adam Scott is second a shot back after a 74. The Australian was four over after four holes and shot a 40 on the front nine, then bounced back with a two under on the back nine.\n“I kind of felt like I made a meal of (the start), and I didn’t feel like I did that much wrong. A couple of drives were just not quite right, and a three-putt, and all of a sudden I’m kind of chasing,” Scott said.\nLudvig Aberg (71), in the hunt for his second career PGA Tour win, is tied for third with fellow Swede Alex Noren (70) at 206. Noren fired a bogey-free back nine and birdied his last three holes.\nNoren’s tee shot on the 193-yard, par-three 16th was almost a hole-in-one, as it settled nine inches from the cup for a tap-in birdie.\nXander Schauffele (67) posted the second-lowest round and was second with 129 feet of made putts. He is tied for fifth with Wyndham Clark (69) at 209.\nA two-time Major winner, Schauffele rode a hot putter to a bogey-free back nine that featured four birdies. He also had birdies at Nos. 2, 7, 8 and 9 but a double-bogey at No. 3 and a bogey at No. 6.\nClark, a native of nearby Denver, made a late move into the top five by eagling the 524-yard, par-five 17th. He estimated that he knew a “couple hundred” people in the gallery, one being fellow Colorado native Derrick White, fresh off an NBA championship with the Boston Celtics and a Paris Olympics gold. White hyped up the crowd on the 18th hole after Clark’s round.\n“It’s pretty cool. It’s great to see where Derrick has gone in his career,” Clark said.\n“It’s honestly one of those pinch-yourself moments because we were third grade all the way to high school playing basketball against each other, and you would almost never think that he’d be at the highest level and I would be at the highest level at my sport, and two kids coming out of Colorado, it doesn’t happen very often.”\nSouth Korean Kim Si-woo (71) and Canadian Taylor Pendrith (73) were tied-seventh at 210.\nAfter a double bogey on the par-four No. 2, Sepp Straka (69) had four straight birdies from No. 7 to 10 to move up the leaderboard. The Austrian is tied for ninth at 211 with eight others, including 2021 FedEx Cup winner Patrick Cantlay (72) and Rory McIlroy (70). REUTERS", "url": "https://www.straitstimes.com/sport/golf/keegan-bradley-holds-one-shot-lead-at-bmw-championship"}