{"authors": [], "date_download": "2024-10-12 14:16:54", "date_modify": "2024-10-12 14:16:54", "date_publish": "2023-10-08 15:55:23", "description": "He finished second in a 19-lap sprint race in Qatar as his sole title rival and teammate Sergio Perez crashed out after 11 laps. Read more at straitstimes.com.", "filename": "sport_formula-one_third-title-is-the-best-says-formula-one-champion-max-verstappen_1728742614.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/08/AUTO-PRIX-F1-QAT-SPRINT-184858.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_third-title-is-the-best-says-formula-one-champion-max-verstappen_1728742614.html", "title": "Third title is the best, says Formula One champion Max Verstappen", "title_page": "Third title is the best, says Formula One champion Max Verstappen | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA – Max Verstappen crowned a season of domination by securing his third Formula One world championship on Saturday, and said it was the best yet.\nThe Red Bull driver won his first in highly controversial circumstances after a battle with Lewis Hamilton went down to the wire in 2021, the second with 15 wins in 22 races and the third with six grands prix to spare.\n“This one is the best one,” he said, after finishing second in a 19-lap sprint race in Qatar, as his sole title rival and teammate Sergio Perez crashed out after 11 laps.\n“The first one was the most emotional one, because that’s when your dreams are fulfilled in F1.\n“But this one has definitely been my best year for consecutive wins and stuff like that, the car itself has been probably in the best shape as well.\n“So for me, this one is probably the one I’m the most proud of in a way, because of the consistency.”\nVerstappen won a record 10 races in a row from Miami in May to Singapore in September and has taken 13 victories from 16 grands prix.\nUntil Singapore, when he was fifth, he had been second in the two races he had not won.\nAsked how many more championships he could win, Verstappen said it depended on the package but he definitely had “quite a few years in me to be able to operate at my best”.\n“We’ll see how long that is, to be honest,” he added. “I think it’s more about how long I want to be here. That’s different.”\nRed Bull team boss Christian Horner hailed the 26-year-old Dutchman as “the most competitive driver I’ve ever seen”.\n“He’s been by far the most dominant, so it’s come as no surprise to see Max join some of the great names,” said Horner.\n“He’s in that bracket now. The way he’s driven this year has been out of this world... I think you have to take a moment to reflect and be in the moment and everything he’s done this year is phenomenal.\n“That’s his make up and I think he’s the most competitive driver that I’ve ever met or seen. The determination that he drives with, the passion, the heart, the commitment and of course, the abundance of skill that he has.\n“He’s up there with the very best, some of the greatest the sport has seen and I think this season has just surpassed anything we’ve seen.”\nVerstappen is one of only five drivers to have won at least three consecutive drivers’ world titles – drawing alongside Juan Manuel Fangio, Michael Schumacher, Sebastian Vettel and Lewis Hamilton.\nHe has also joined an elite group of three-time champions – the rest are Jack Brabham, Niki Lauda, Nelson Piquet, Ayrton Senna and Jackie Stewart.\nVerstappen said it was a very proud moment for him, his family and the entire team.\n“I don’t know how long this is going to last,” he said. “I’m enjoying the moment and I think that’s also very important. I achieved more than I could have ever even dream of... It’s perfect.”\nHis father Jos, a former teammate of seven-time champion Schumacher at Benetton, added: “It’s also the way he did it. He was so dominant this year and he delivered really well and I’m very proud of that.”\nOn spotting his potential, Verstappen senior said: “I knew it, his talent, a long time ago when he was in go-karts and I think we made the right decision in the beginning of his career and now it’s up to him what he does. I’m just very happy with how he does it and how strong he is and the way he works for that.”\nIn a telling moment, in a season in which he has crushed all rivals, Verstappen paused when asked where he had felt most pressure.\n“It’s a good question,” he replied, before suggesting his home race in Zandvoort and racing on slicks in wet conditions while feeling the expectation of the crowd. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/formula-one/third-title-is-the-best-says-formula-one-champion-max-verstappen"}