{"authors": [], "date_download": "2024-10-12 13:40:10", "date_modify": "2024-10-12 13:40:10", "date_publish": "2024-09-02 19:49:50", "description": "Bangladesh remained on course for a 2-0 series whitewash over Pakistan after pace duo Hasan Mahmud and Nahid Rana bowled out the hosts for 172 in the second innings of the second test on Monday. Read more at straitstimes.com.", "filename": "sport_bangladesh-sense-series-sweep-as-pakistan-crumble-in-second-innings_1728740410.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/CRICKET-PAK-BAN-TEST-111331.jpg?VersionId=RKOzfbIHEkQvI89nOhBDlDNPGwoNy1Xw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_bangladesh-sense-series-sweep-as-pakistan-crumble-in-second-innings_1728740410.html", "title": "Bangladesh sense cricket test series sweep as Pakistan crumble in second innings", "title_page": "Bangladesh sense cricket test series sweep as Pakistan crumble in second innings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Bangladesh remained on course for a 2-0 series whitewash over Pakistan after pace duo Hasan Mahmud and Nahid Rana bowled out the hosts for 172 in the second innings of the second test on Monday.\nChasing 185 for victory, Bangladesh cruised to 42 for no loss in seven overs before bad light and subsequent rain forced early stumps on the penultimate day at the Rawalpindi Cricket Stadium.\nZakir Hasan was unbeaten on 31, which included two sixes, with Shadman Islam on nine at the other end and Bangladesh needing 143 runs for victory.\nEarlier, Hasan (5-43) and Nahid (4-44) impressed with the ball once Pakistan resumed on nine for two.\nAfter Taskin Ahmed removed overnight batter Saim Ayub (20), Nahid ripped the heart out of the Pakistan lineup by claiming three wickets in three overs.\nA leaden-footed Shan Masood (28) slashed at a wide delivery while Babar Azam's run drought continued as he edged a Nahid delivery to Shadman at first slip on 11.\nNew man in Mohammad Rizwan (43) could have fallen for a first ball duck but Shadman spilled a regulation catch. Rizwan also got smacked in the helmet by a bouncer from Nahid who bowled at a lively pace in that fiery spell.\nThe seamer removed Saud Shakeel but Rizwan counter-attacked.\nHasan dealt a double blow after the lunch break by dismissing Rizwan and Mohammad Ali with successive deliveries and also claimed the wicket of Abrar Ahmed.\nSalman Agha made 47 not out but Hasan removed Mir Hamza to claim his maiden five-wicket haul in his third test.\nBangladesh claimed the opening test by 10 wickets on Aug. 25 in their first ever test victory against Pakistan. REUTERS", "url": "https://www.straitstimes.com/sport/bangladesh-sense-series-sweep-as-pakistan-crumble-in-second-innings"}