{"authors": [], "date_download": "2024-10-12 13:40:44", "date_modify": "2024-10-12 13:40:44", "date_publish": "2024-09-07 10:56:24", "description": "England fast bowler Mark Wood will be out for the year with an injured right elbow, the England and Wales Cricket Board (ECB) and the player said on Friday. Read more at straitstimes.com.", "filename": "sport_englands-wood-out-for-the-year-with-injured-elbow_1728740444.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/07/LYNXMPEK86016-1.jpg?VersionId=O8LZsPKVWnWtRc0XLEbE0poVCUoH.f61", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_englands-wood-out-for-the-year-with-injured-elbow_1728740444.html", "title": "England's Wood out for the year with injured elbow", "title_page": "England's Wood out for the year with injured elbow | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "England fast bowler Mark Wood will be out for the year with an injured right elbow, the England and Wales Cricket Board (ECB) and the player said on Friday.\nWood, who injured his right thigh during last month's first test against Sri Lanka and was ruled out from the rest of the series, discovered that he had some bone stress in his elbow during a medical check-up.\n\"I was shocked,\" Wood wrote on Instagram.\n\"I'd put that down to the normal niggles every fast bowler gets and which I was playing through. I'm especially surprised because I've been playing test cricket and kept my speeds up.\"\nWood, who has taken 119 wickets in 37 tests, will miss England's test tours of Pakistan in October and New Zealand in December, the ECB said in a statement.\n\"He aims to return to full fitness by early 2025, in time for England’s white-ball tour of India and the ICC Champions Trophy in Pakistan, scheduled to begin in February 2025,\" the ECB added.\nWood, 34, said he had been down this path before.\n\"See you for some rockets in 2025,\" he wrote. REUTERS", "url": "https://www.straitstimes.com/sport/englands-wood-out-for-the-year-with-injured-elbow"}