{"authors": [], "date_download": "2024-10-12 14:17:44", "date_modify": "2024-10-12 14:17:44", "date_publish": "2023-09-01 02:30:03", "description": "MONZA, Italy - Formula One championship leader Max Verstappen dismissed on Thursday the suggestion that his Red Bull car was designed to suit his driving style more than the team mates he has \\\"destroyed\\\". Read more at straitstimes.com.", "filename": "sport_formula-one_verstappen-denies-his-car-is-designed-to-suit-his-style_1728742664.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/01/LYNXMPEJ7U0XV-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_verstappen-denies-his-car-is-designed-to-suit-his-style_1728742664.html", "title": "Verstappen denies his car is designed to suit his style", "title_page": "Verstappen denies his car is designed to suit his style | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MONZA, Italy - Formula One championship leader Max Verstappen dismissed on Thursday the suggestion that his Red Bull car was designed to suit his driving style more than the team mates he has \"destroyed\".\nMercedes team boss Toto Wolff told reporters at last weekend's Dutch Grand Prix that he struggled to understand the single lap gap between Verstappen and his team mate Sergio Perez.\nVerstappen is heading for his third world title and leads the Mexican, his closest rival, by a hefty 138 points after 13 races.\n\"We’ve seen that Max has destroyed every single team mate that was with him,\" said Wolff after Verstappen qualified on pole position with a lap 1.313 seconds faster than Perez.\n\"Whether or not it's his ability to create a car around himself that is just very tricky to control, but fast when you can, and that creates those gaps. But 1.3?\"\nVerstappen, chasing a record 10th win in a row in Sunday's Italian Grand Prix, dismissed the comments when asked about them at Monza.\n\"I just drive the car the fastest way possible. I’m not there to tell the guys to give me more front end because that’s how I like it,\" he said.\n\"I just say ‘Design me the fastest car and I’ll drive around that’ because every single year, every car drives a little bit different.\n\"People ask ‘What is your driving style?’ My driving style is not something particular. I adapt to what I need for the car to go quick.\"\nRed Bull have won every race this season and 14 in a row in total. Perez has won twice this year.\nVerstappen said he just trying to do the best he could and win as much as possible while he had the opportunity, rather than being driven by records.\n\"It's for sure a very enjoyable time to be driving the car. But every single weekend there are always a lot of things that come up, and you have to optimise,\" he added. \"It's never a straightforward weekend.\" REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/verstappen-denies-his-car-is-designed-to-suit-his-style"}