{"authors": [], "date_download": "2024-10-12 14:02:01", "date_modify": "2024-10-12 14:02:01", "date_publish": "2024-07-15 20:22:25", "description": "He was well beaten by Carlos Alcaraz 6-2, 6-2, 7-6 (7-4) in the final. Read more at straitstimes.com.", "filename": "sport_tennis_novak-djokovic-vows-wimbledon-return-despite-clock-ticking_1728741721.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/15/11477963.jpg?VersionId=c90SfZhu90V2hyNOMR9YMNoh2Ac6dhlw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_novak-djokovic-vows-wimbledon-return-despite-clock-ticking_1728741721.html", "title": "Novak Djokovic vows Wimbledon return despite clock ticking", "title_page": "Novak Djokovic vows Wimbledon return despite clock ticking | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Novak Djokovic insists he will return to Wimbledon in 2025 and attempt to clinch an eighth All England Club title despite a shattering straight-set defeat by Carlos Alcaraz in the final on July 14.\nDjokovic saw his hopes of a record-setting 25th Grand Slam title ruthlessly brushed aside by the 21-year-old Spanish star, who had also defeated the Serb in the 2023 championship match.\nEven though the clock is ticking on Djokovic’s career, he said he will keep playing into 2025, when he will turn 38.\n“As far as coming back here, I would love to. I don’t have anything else in my thoughts right now that this is my last Wimbledon,” he said after his 6-2, 6-2, 7-6 (7-4) loss.\n“I don’t have any limitations in my mind. I still want to keep going and play as long as I feel like I can play on this high level.”\nSo far this season, Djokovic has seen his Australian Open title go to Jannik Sinner, the 22-year-old Italian who has also taken his world No. 1 ranking.\nAlcaraz succeeded him as French Open champion in Paris in June, days after Djokovic was forced to withdraw before his quarter-final due to a knee injury which required surgery.\nDjokovic is due to return to the French capital in under two weeks’ time, when he will try to win an elusive Olympic Games gold medal. After that, he will attempt to retain his US Open title in New York.\n“I have intentions to play the Olympic Games, hopefully have a chance to fight for a medal for my country,” he said.\n“On a completely different surface (clay) obviously, going back to the place where I got injured some weeks ago. Let’s see how physically and mentally I’m going to feel.”\nDespite the upbeat forecast on his plans, Djokovic is enduring a sub-par year by his standards.\nHe is without a title since winning the ATP Finals in November 2023 and has yet to defeat a top-10 opponent in 2024.\nOn July 14, he was out-hit by Alcaraz, who clubbed 42 winners to 26 and created 14 break points, five of which he converted.\n“To beat these guys (Alcaraz and Sinner) in Grand Slam latter stages or the Olympics, I’m going to have to play much better than I did today and feel much better than I did today,” admitted Djokovic.\n“I’m going to work on it. It’s not something I haven’t experienced before ever in my life. I’ve had so many different experiences throughout my career. In the face of adversity, normally I rise and I learn and get stronger. That’s what I’m going to do.”\nHowever, Nick Kyrgios, who lost the Wimbledon final to the Serb in 2022, questioned if Djokovic would ever add to his Grand Slam tally.\nThe Australian said on the BBC: “Physically he is not 100 per cent but he decided to play it and he has said time and time again how important this event is to him.\n“Look, he just came out a little bit flat, understandably at 37. He has won this championship seven times but Alcaraz was just a bit too much today.\n“He threw everything at Carlos in the third set and he just kept coming up with answers time and time again. Me and Tim (Henman) have had this conversation. It is a conversation all tennis fans need to have – is there one more Slam left for Djokovic on the calendar?\n“With the coming up of Alcaraz, and obviously two times in a row beating him in the final, does Djokovic have enough left in the tank to get one more Slam?” AFP", "url": "https://www.straitstimes.com/sport/tennis/novak-djokovic-vows-wimbledon-return-despite-clock-ticking"}