{"authors": [], "date_download": "2024-10-12 14:17:22", "date_modify": "2024-10-12 14:17:22", "date_publish": "2023-09-02 23:36:36", "description": "The pole was the Italian team’s third of the season but Sainz’s first since Texas last October. Read more at straitstimes.com.", "filename": "sport_formula-one_carlos-sainz-on-pole-position-for-ferrari-s-home-italian-grand-prix_1728742642.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/02/2023-09-02T143048Z1080228408UP1EJ9214B9IJRTRMADP3MOTOR-F1-ITALY.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_carlos-sainz-on-pole-position-for-ferrari-s-home-italian-grand-prix_1728742642.html", "title": "‘Goosebumps’ as Carlos Sainz secures pole position for Ferrari’s home Italian Grand Prix", "title_page": "‘Goosebumps’ as Carlos Sainz secures pole position for Ferrari’s home Italian Grand Prix | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MONZA – Carlos Sainz admitted on Saturday he had “goosebumps” after he put Ferrari on pole position for their home Italian Grand Prix, with Red Bull’s Formula One leader Max Verstappen, chasing a 10th consecutive win, alongside him on the front row.\nSainz lapped Monza’s “Temple of Speed” with a fastest time of 1min 20.294sec, which was merely 0.013sec quicker than Verstappen’s final flying lap, while Ferrari’s Charles Leclerc qualified third.\nThe pole was the Italian team’s third of the season but Sainz’s first since Texas last October.\n“Wow, honestly. It was such an intense qualifying. We were very on the limit and on that last lap, I knew I had some lap time to come and I went for it,” said the Spaniard, whose result brought cheer to Ferrari’s passionate army of fans.\n“Goosebumps since I crossed the finish line and watched the crowd.\n“Everywhere we go it is just noise, encouragement, support – the best feeling you can have as an athlete.”\nHe added: “Tomorrow I will give it everything to get that P1. Let’s see if we can battle Max. Normally in the long run he is quicker but I am going to give it my all.”\nVerstappen, meanwhile, admitted that it was a “very tight” qualifying session, so he did not have much complaints.\n“It was good, I think we made some good improvements compared to yesterday,” the two-time world champion said.\n“You could see in every qualifying session it was very tight, so I’m happy to be second today.\n“It’s nice to see (Ferrari on pole in Monza), but of course, tomorrow we’ll try to win the race. Normally we have a quicker race car, but let’s just enjoy today and then we’ll focus on tomorrow.”\nSainz trails Verstappen by 237 points in the drivers’ championship and is yet to claim a podium finish this season.\nBut he shone in qualifying in front of loud home support after already showing his speed by topping the times in two practice sessions, and celebrated with delighted Ferrari fans after snatching pole in the final moments.\nVerstappen still has a great chance to break the record of nine straight race wins he shares with four-time world champion Sebastian Vettel after winning a dramatic race on home soil in Zandvoort last weekend.\nThe Dutchman has won 11 of the 13 races so far this season and leads Red Bull teammate Sergio Perez by 138 points in the standings. Perez, who is the only other driver to win this season, qualified 0.394sec back in fifth.\nThere was a scare for Sainz, and Leclerc as well, as both Ferrari drivers were investigated by the stewards for allegedly driving too slowly in Q1, but they escaped punishment in the end.\n“On my side, I am a bit disappointed, I obviously wanted to be first. But seeing that Carlos is P1 is great for Ferrari, he has done an incredible job all weekend,” said Monegasque Leclerc.\n“I managed to put everything together, so I am really happy, especially on my side I have been struggling a lot. The (fans) are just incredible. I don’t smile often when I am P3 but when I have this support, it is an amazing feeling.”\nMercedes’ George Russell will join Leclerc on the second row after qualifying fourth.\nBehind the Briton, Perez, Williams’ Alex Albon, McLaren’s Oscar Piastri, Mercedes’ seven-time world champion Lewis Hamilton, McLaren’s Lando Norris and Aston Martin’s Fernando Alonso complete the top 10. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/formula-one/carlos-sainz-on-pole-position-for-ferrari-s-home-italian-grand-prix"}