{"authors": [], "date_download": "2024-10-12 14:11:17", "date_modify": "2024-10-12 14:11:17", "date_publish": "2024-05-14 16:32:26", "description": "Boston will try to finish off the series at home on May 15 after taking a 3-1 lead. Read more at straitstimes.com.", "filename": "sport_basketball_celtics-push-cavs-to-brink-of-elimination-thunder-pull-level-with-mavs_1728742277.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/14/2024-05-14T020316Z1438092476MT1USATODAY23266871RTRMADP3NBA-PLAYOFFS-BOSTON-CELTICS-AT-CLEVELAND-CAVALIERS.JPG?VersionId=06F99MnT0eKrTGfCgij8uJou4oECHjh9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_celtics-push-cavs-to-brink-of-elimination-thunder-pull-level-with-mavs_1728742277.html", "title": "Celtics push Cavs to brink of elimination, Thunder pull level with Mavs", "title_page": "Celtics push Cavs to brink of elimination, Thunder pull level with Mavs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CLEVELAND – The Boston Celtics were not “perfect” but they still fought off the short-handed Cleveland Cavaliers to take a stranglehold in their National Basketball Association (NBA) semi-final, play-offs on May 13, as the Oklahoma City Thunder levelled their series with the Dallas Mavericks.\nJayson Tatum scored 33 points and grabbed 11 rebounds and Jaylen Brown added 27 points for the Celtics, who beat the Cavaliers 109-102 for a 3-1 lead in their best-of-seven clash in the Eastern Conference.\nBoston will try to finish off the series at home on May 15.\nThe Cavaliers were dealt a blow when Donovan Mitchell, who had averaged more than 35 points over the six earlier games, was ruled out with a calf injury, joining starting centre Jarrett Allen on the sidelines.\nWith Mitchell absent, Cleveland ultimately did not have enough firepower at Rocket Mortgage FieldHouse.\nThe Celtics led by 10 going into the final period and the Cavaliers, on the back of 30 points from Darius Garland, pulled within five points three times in the final four minutes. However, Brown, fed by Tatum, connected on a three-pointer with 1min 9sec left that effectively sealed it.\n“It’s a game of runs. It’s not going to be perfect every single time. They’re going to make shots, but it’s our job to figure it out,” Tatum said after the Celtics – who took control early with a 12-0 spree in the first quarter – struggled to put the depleted Cavaliers away.\nBrown avoided a flagrant foul call in the second quarter after he fell backwards into Max Strus and grabbed Strus’ ankle as the Cleveland player – himself struggling to stay upright – stepped over his head.\nCavaliers coach J.B. Bickerstaff was more concerned at the fact that Boston went to the free-throw line 24 times compared to his team’s seven.\n“I’ll be honest with you, I was disappointed with the way the whistle blew tonight. I don’t think we got an equal opportunity at it tonight from that standpoint,” he said.\nGarland also called the free-throw discrepancy “ridiculous”.\n“I’m not one of those guys with the striped shirt, but I know how many times I get hit, I know how many times my teammates get hit, put on the floor. And we can’t reciprocate,” he added.\nWestern Conference top seeds Oklahoma City head home tied 2-2 with the Mavericks after a furious fourth-quarter rally carried them to a 100-96 victory at American Airlines Centre.\nThe Thunder trailed most of the night in the face of a stout Dallas defensive effort that included 13 blocked shots. But they broke through in the fourth quarter, tying it at 86-86 on Shai Gilgeous-Alexander’s fadeaway jump shot with 4:02 to play.\nRookie Chet Holmgren followed with a three-pointer that gave the team the lead for good.\n“We just stuck to it. We just plugged away, took it possession by possession and eventually the game turned for us,” said Gilgeous-Alexander, who scored 22 of his 34 points in the second half.\nHolmgren finished with 18 points and Luguentz Dort had 17 for the Thunder, who made 23 of their 24 free throws and withstood a triple-double of 18 points, 12 rebounds and 10 assists from Dallas star Luka Doncic. AFP", "url": "https://www.straitstimes.com/sport/basketball/celtics-push-cavs-to-brink-of-elimination-thunder-pull-level-with-mavs"}