{"authors": [], "date_download": "2024-10-12 14:07:56", "date_modify": "2024-10-12 14:07:56", "date_publish": "2022-07-27 23:09:11", "description": "(AFP) - US basketball star Brittney Griner said at her trial on Wednesday (July 27) she had no intention of smuggling drugs into Russia and that she came to the country despite US warnings so as not to let down her Russian team. Read more at straitstimes.com.", "filename": "sport_basketball_basketball-american-star-griner-says-didnt-intend-to-smuggle-drugs-into-russia_1728742076.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/27/ads-griner-270722.jpg?VersionId=QWLtlOlqanaEcE2EsQvNP0P72WSEXOd_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_basketball-american-star-griner-says-didnt-intend-to-smuggle-drugs-into-russia_1728742076.html", "title": "Basketball: American star Griner says didn't intend to smuggle drugs into Russia", "title_page": "Basketball: American star Griner says didn't intend to smuggle drugs into Russia | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "(AFP) - US basketball star Brittney Griner said at her trial on Wednesday (July 27) she had no intention of smuggling drugs into Russia and that she came to the country despite US warnings so as not to let down her Russian team.\nGriner, a two-time Olympic basketball gold medallist and Women's NBA champion who had played in Russia, was detained in February, just days before Moscow launched its offensive in Ukraine.\nShe was charged with drug smuggling for possessing vape cartridges with cannabis oil and is standing trial in the town of Khimki just outside Moscow.\nSpeaking at the trial, Griner, who is 2.06m, said she still did not know how the cartridges ended up in her bag.\n\"I did not think of or plan to bring banned substances into Russia,\" Griner said.\n\"I did not intend to break Russian law,\" she added, saying that she was in a rush packing.\nShe also said she had \"no intention to use\" a substance banned in Russia. \"I wouldn't do anything that would hurt my team.\"\nGriner was detained when she came to Russia to play club basketball with UMMC Ekaterinburg during the US off-season - a common path for American stars seeking additional income.\nShe has pleaded guilty and faces up to 10 years in a Russian prison.\nThe 31-year-old WNBA star said she had permission from a US doctor to use medicinal cannabis to relieve pain from her many injuries - \"from spine to cartilages.\" \"I was in a wheelchair for four months. I had a sprained ankle,\" she said.\nShe said she used medicinal cannabis \"only during breaks and when there are no competitions\". \"It helps me a lot,\" she said.\nGriner added that she did not want to use other painkillers because they have \"really bad side effects\".\nShe said she had arrived in Russia despite US authorities recommending against travel to the country and said that she would \"never\" risk the championship.\n\"My career is my whole life. I've dedicated everything, my body, time away from my family,\" she said. \"I played with injuries. There is nothing I wouldn't do for my career.\"", "url": "https://www.straitstimes.com/sport/basketball/basketball-american-star-griner-says-didnt-intend-to-smuggle-drugs-into-russia"}