{"authors": [], "date_download": "2024-10-12 13:42:49", "date_modify": "2024-10-12 13:42:49", "date_publish": "2023-12-28 07:57:23", "description": "His side conceded a crucial second-half spot kick in their 3-1 defeat by Manchester City. Read more at straitstimes.com.", "filename": "sport_football_i-must-be-from-different-planet-says-dyche-after-penalty-decision_1728740569.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/28/LYNXMPEJBQ0JF-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_i-must-be-from-different-planet-says-dyche-after-penalty-decision_1728740569.html", "title": "I must be from a different planet, fumes Sean Dyche after penalty decision", "title_page": "I must be from a different planet, fumes Sean Dyche after penalty decision | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Everton manager Sean Dyche labelled the handball laws a farce after his side conceded a crucial second-half penalty in their 3-1 English Premier League home defeat by Manchester City on Dec 27.\nThe Toffees were level at 1-1 just past the hour mark when Amadou Onana lunged to try and block a shot by City’s Nathan Ake. The ball struck his arm from point-blank range and referee John Brooks pointed to the spot after being instructed by his assistant on the touchline.\nThe VAR (video assistant referee) opted not to reverse the decision and Julian Alvarez tucked away the penalty to make it 2-1 before Bernardo Silva wrapped up the points for City late on.\nHandball decisions have come under the spotlight since the introduction of the controversial VAR, with the interpretation of whether or not the arm is in a “natural” position often very subjective.\n“We can debate the penalty all day. It’s a farce but that’s the way it goes,” Dyche told Amazon Prime.\n“That’s completely natural. He’s not putting his arm up to save it, he’s literally jumping in to try to block the ball. How that is given as a penalty is bizarre in my world but I must be from a different planet.\n“Tonight the linesman gives that and he’s 18 yards away so I don’t know who is giving what any more. Who knows? All the managers are debating it. Someone needs to stand up at some point and realise that can’t be a penalty because he’s just throwing himself in front of it to try to block the ball.”\nBut former Premier League referee Mark Clattenburg, speaking to Amazon Prime, said Brooks made the right decision. The problem is more of how the rules are determined.\n“No one is saying that the decision is wrong but we are saying that by the way the law is written, it is wrong and therefore that is something that needs changing,” he said.\n“We are seeing some given and some not given every week.”\nThe decision was a vital moment in the game.\nPep Guardiola’s men were in trouble when trailing 1-0, courtesy of a first-half strike from former City player Jack Harrison. But Phil Foden fizzed a shot past Jordan Pickford in the 53rd minute and then came the penalty which put the visitors ahead.\nCity, who had won just one of their previous six league games, are now back in fourth spot, although they could drop down to fifth should Tottenham Hotspur beat Brighton & Hove Albion on Dec 28.\n“I remind them (of their abilities) every day,” Guardiola said of his players, while he did not speak about the penalty call.\n“We have standards to keep. That makes us have more responsibility so the standards cannot go down.\n“They showed again how special they are. We know after six games with just one win the people were commenting, which is normal because it is all about results, but we are close.” REUTERS, AFP", "url": "https://www.straitstimes.com/sport/football/i-must-be-from-different-planet-says-dyche-after-penalty-decision"}