{"authors": [], "date_download": "2024-10-12 14:01:12", "date_modify": "2024-10-12 14:01:12", "date_publish": "2024-07-26 17:21:11", "description": "PARIS - Rafa Nadal practised alongside doubles partner Carlos Alcaraz at Roland Garros on Friday as doubts continued about the Spaniard's fitness ahead of the Olympic tennis competition. Read more at straitstimes.com.", "filename": "sport_tennis_nadal-trains-ahead-of-doubles-opener-despite-injury-worries_1728741672.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/26/LYNXMPEK6P0AX-1.jpg?VersionId=DkxqHKQC1HWBOARzb39SjE9QrJAHCEhJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_nadal-trains-ahead-of-doubles-opener-despite-injury-worries_1728741672.html", "title": "Nadal trains ahead of doubles opener despite injury worries", "title_page": "Nadal trains ahead of doubles opener despite injury worries | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Rafa Nadal practised alongside doubles partner Carlos Alcaraz at Roland Garros on Friday as doubts continued about the Spaniard's fitness ahead of the Olympic tennis competition.\nThe 38-year-old had missed his training slot on Thursday with Germany's Alexander Zverev with Spain's coach Carlos Moya saying he was struggling with a thigh injury.\nFourteen-time French Open champion Nadal wore a strapping on his right thigh on Friday as he practised under the closed roof of Court Phillipe Chatrier but appeared untroubled.\nSpain's so-called dream team partnership are scheduled to begin their quest for gold on Saturday against Argentine seeds Maximo Gonzalez and Andres Molteri.\nNadal, who won the Olympic singles in 2008 and doubles in 2016, is drawn against Hungary's Marton Fucsovic in the singles with a potential blockbuster clash against old rival and top seed Novak Djokovic in the second round.\nMoya, who was supervising the practise session, gave an optimistic update on Nadal's fitness late on Thursday, although he suggested that he could yet prioritise the doubles.\n\"It is practically confirmed that he will play, unless the recovery is going very badly,\" Moya was quoted by SER.\n\"He is going to try out and we are optimistic that he will play on Saturday. I don't know how it's going to go any further. As of today, it is that on Saturday he will go out on the court to play doubles with Alcaraz.\"\nWhile doubles might be possible even with a niggle, Nadal would be reluctant to play singles with an injury and risk then scuppering his doubles chances with French Open and Wimbledon champion Alcaraz.\n\"The idea of giving up one of the competitions has not been raised, but if the time comes and he is limited for the singles, it can be raised without any doubt,\" Moya said.\n\"Doubles is much less demanding and there are real options, if they play well, of a medal.\" REUTERS", "url": "https://www.straitstimes.com/sport/tennis/nadal-trains-ahead-of-doubles-opener-despite-injury-worries"}