{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 13:27:04", "date_modify": "2024-10-12 13:27:04", "date_publish": "2024-10-09 22:36:52", "description": "With the help of a nutritionist, he has been paying attention to the kinds of food that he should avoid or consume more of. Read more at straitstimes.com.", "filename": "sport_golf_s-pore-golfer-ryan-ang-focuses-on-the-small-details-as-he-gears-up-for-professional-debut_1728739624.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/09/GU47304.JPG?VersionId=xDfg8HlF_2r0BdizVewIYQopdvj2ZjR9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_s-pore-golfer-ryan-ang-focuses-on-the-small-details-as-he-gears-up-for-professional-debut_1728739624.html", "title": "S’pore golfer Ryan Ang focuses on the small details as he gears up for professional debut", "title_page": "S’pore golfer Ryan Ang focuses on the small details as he gears up for professional debut | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singaporean golfer Ryan Ang knows how small details can make a big difference.\nIn preparation for his professional debut this week, the 25-year-old has been paying equal attention to things off the golf course over the last few months to improve his performance on it.\nSince securing his PGA Tour of Australasia (PGATA) tour card in April, Ang has been working with a team that includes a nutritionist, physical trainer, coach and physiotherapist, as he takes a holistic look at the factors that can influence his performance.\nOne thing he has gained a deeper understanding of is his body type and what kinds of food he should eat or avoid to help maintain a stable weight, something he used to find difficult.\nConsultations with a nutritionist from the National Youth Sports Institute made him realise that he was sensitive to eggs and too much lactose and fat – which would affect his stomach whenever he travelled.\nHe also began to incorporate more meat into his lunch and dinner so that he could maintain his weight while travelling, and added a protein shake or drink at breakfast to get the sufficient calorie intake he needed.\nSaid Ang: “It’s (the last few months) helped me establish the five to 10 people who will be in my small circle as I turn pro and I believe that will help me go a long way. The whole ecosystem around my team is really healthy, everyone’s talking to each other.\n“That’s what is going to help my game progress to a more solid level. Everyone’s working together to help me push my game to a better standard and my body and mind to a better state.”\nAng believes all this, plus competing in several major amateur tournaments to sharpen his skills, have prepared him well for his professional bow at the WA PGA Championship at the Kalgoorlie Golf Course in Western Australia from Oct 10 to 13.\nOnce lacking belief that he would be good enough to turn professional when he started his competitive golf journey 3½ years ago – later than many of his peers – Ang now feels ready to begin the new chapter of his career.\nHe signed off his amateur career on Oct 6, with a tied-13th finish at the Asia-Pacific Amateur Championship in Japan, his best result in three appearances at the region’s most prestigious amateur golf tournament.\n“I always wanted to play professional golf. I just didn’t think I was good enough when I first started,” said Ang, who won the Kuala Lumpur Amateur Open in May.\n“But the last few years of seeing a lot of my friends on tour and competing alongside them, I’ve grown more comfortable and believed in myself a lot more.”\nAng acknowledged that there is the added pressure to make the cut, but he is relishing the challenge as he aims to keep his PGATA card for next season.\nHe will also be trying out for the Asian Tour’s final stage of qualifying school in December as he eyes a spot at the 2026 Asian Games and 2028 Olympics.", "url": "https://www.straitstimes.com/sport/golf/s-pore-golfer-ryan-ang-focuses-on-the-small-details-as-he-gears-up-for-professional-debut"}