{"authors": [], "date_download": "2024-10-12 14:03:01", "date_modify": "2024-10-12 14:03:01", "date_publish": "2024-06-02 10:35:43", "description": "The third-round tie ended at 3.06am local time, the latest-ever finish at Roland Garros. Read more at straitstimes.com.", "filename": "sport_tennis_djokovic-credits-crowd-with-getting-him-through-french-open-late-late-show_1728741781.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/02/LYNXMPEK5100Y-1.jpg?VersionId=_tstKHAx6QcIUaewj_X0i1ETmmuG9XTi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_djokovic-credits-crowd-with-getting-him-through-french-open-late-late-show_1728741781.html", "title": "Novak Djokovic credits crowd with getting him through French Open late, late show", "title_page": "Novak Djokovic credits crowd with getting him through French Open late, late show | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Novak Djokovic credited a wave of support from the French Open crowd for helping him avoid an upset at the hands of Lorenzo Musetti in a third-round thriller that ended 7-5, 6-7 (6-8), 2-6, 6-3, 6-0 in the early hours of June 2 morning.\nThe world No. 1 is renowned for his willpower and stamina but conceded his title defence had been on shaky ground when his Italian opponent took a two sets to one lead during the 4½-hour match.\n“I was in real trouble on the court and he was playing some really amazing tennis. I didn’t know really what to do,” the 37-year-old said.\n“From both hands, he was getting a lot of balls back, winners from both corners. Good serves, running every ball down the court. It didn’t feel great playing him that third set and the beginning of the fourth.\n“The (crowd) start chanting my name and I just felt a great new wave of willpower and energy. I really needed that push, I really needed that energy.\n“I think I was a different player from that moment onwards. And I think from that moment, I probably lost only one game in the rest of the match. I was on a high, riding that wave.”\nDefeat would have ended the Serb’s quest for a record-extending 25th Grand Slam singles title and resulted in him losing the No. 1 ranking to Musetti’s compatriot Jannik Sinner later in June.\nDjokovic might have had grounds for complaint after organisers had wedged another contest into the evening schedule, pushing the completion of his match to 3.06am local time, the latest finish at the French Open.\nOrganisers had squeezed in extra matches onto the two main show courts, which both have retractable roofs, to counter the scheduling chaos caused by a seventh day of rain in Paris.\n“I don’t want to get into this debate,” said Djokovic initially, before adding: “I think certain things could have been handled differently.\n“There is a certain beauty in winning the match at three in the morning if it was the last of the tournament, but this isn’t the case.”\nDjokovic’s victory after four hours and 29 minutes allowed him to equal Roger Federer’s record of 369 Grand Slam singles match wins.\n“Physically, I really went to my limits to win this match. When you play rallies of more than 20 shots, at two in the morning... Who plays at two in the morning?” he added.\n“We play few matches in our life at this time. The conditions were very heavy, it was very cold. You didn’t have many free points behind your serve.”\nDjokovic, who said on court that he would not able to sleep because of the adrenaline rush, will be back in action on June 3 in the fourth round against Argentinian 23rd seed Francisco Cerundolo.\nHe said: “I’m going to have to switch on all my young genes and try to recover as quickly as possible.” REUTERS, AFP", "url": "https://www.straitstimes.com/sport/tennis/djokovic-credits-crowd-with-getting-him-through-french-open-late-late-show"}