{"authors": ["Deepanraj Ganesan"], "date_download": "2024-10-12 13:43:32", "date_modify": "2024-10-12 13:43:32", "date_publish": "2023-10-24 19:26:23", "description": "Singapore's wushu exponents won a silver and bronze medal in Saudi Arabia on Sunday. Read more at straitstimes.com.", "filename": "sport_celebrations-on-hold-after-jowen-lim-bags-wushu-bronze-at-world-combat-games_1728740612.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/24/WhatsApp20Image202023-10-2420at2016.17.335b713938.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_celebrations-on-hold-after-jowen-lim-bags-wushu-bronze-at-world-combat-games_1728740612.html", "title": "Celebrations on hold after Jowen Lim bags wushu bronze at World Combat Games", "title_page": "Celebrations on hold after Jowen Lim bags wushu bronze at World Combat Games | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The champagne is still on ice for national wushu exponent Jowen Lim, even after back-to-back successes at the Asian Games and World Combat Games.\nAt the Hangzhou Asiad in September, the 24-year-old claimed a historic silver in the men’s daoshu and gunshu all-round event. He followed up with a bronze at the World Combat Games in Riyadh, Saudi Arabia, on Sunday.\nCelebrations are on hold because of a hectic schedule that will see the athletes competing in three events in as many months, with the season finale at the Nov 16-20 World Wushu Championships in Texas.\nLim said on Tuesday: “I think this is the first time I have had back-to-back competitions so close together. There’s definitely no time for rest now.\n“Usually after competitions, we would have a week of rest before we go into training again but, this time around, we don’t have that luxury. In fact, I just got back to Singapore today and tomorrow I am back at training.\n“My family is arranging for a short trip overseas in December after the world championships. I will celebrate then.”\nOn his bronze medal at the World Combat Games, Lim said he is “ticking one off the list” as it is the only competition that he had yet to win a medal in, until now.\nIt has been a rewarding 2023 for Lim, who won a SEA Games gold in May and chased his Asiad silver with another achievement in Saudi Arabia, where his combined score of 19.516 helped him capture a bronze in the men’s daoshu and gunshu all-round event.\nFormer world champions, China’s Wu Zhaohua (19.583) and Indonesia’s Seraf Naro Siregar (19.519), won gold and silver respectively.\nSingapore also bagged a silver in the men’s taolu taijiquan and taijijian, courtesy of Tay Yu Xuan. In the women’s taolu jianshu and qiangshu, Le Yin Shuen was fourth, while Vera Tan was fifth in the women’s taijiquan and taijijian.\nWith his latest triumph, Lim plans to bank on his winning momentum and is targeting gold at the world championships.\nLim, who has three bronzes from previous editions, said: “Gold is quite a realistic target. I’m still constantly improving and, in wushu, the more you do it, the more you understand the movements, the more experience you have.\n“The movements, the tempo and the choreography of your routines are definitely going to get better because you have more experience and a better understanding of the sport.”\nFor his teammate Tay, his silver medal was the perfect response to a disappointing debut at the Asian Games, where he succumbed to nerves and finished 15th in the men’s taijiquan and taijijian all-round event.\nThere were no butterflies in his stomach this time as he notched a combined score of 19.453 to finish second. An Hyeon-gi (19.493) of South Korea took the gold, while the Philippines’ Jones Llabres Inso (19.339) won the bronze.\nTay said: “At the Asian Games, I didn’t meet the expectations I had of myself. So that motivated me quite a lot for this upcoming competition because I wanted to prove to myself that I could do it in front of everyone.\n“This silver medal has definitely sparked some confidence in myself and I now have faith in my abilities to perform at stressful events like this.”", "url": "https://www.straitstimes.com/sport/celebrations-on-hold-after-jowen-lim-bags-wushu-bronze-at-world-combat-games"}