{"authors": [], "date_download": "2024-10-12 13:43:14", "date_modify": "2024-10-12 13:43:14", "date_publish": "2024-07-13 17:06:38", "description": "The sides will meet in the Euro 2024 final on July 14. Read more at straitstimes.com.", "filename": "sport_football_a-rare-rivalry-past-spain-v-england-clashes_1728740594.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/13/euro24-eng-spa1307a.jpg?VersionId=Uz5ZSBkVDUuO0aJBaDCIbQ_RFejja4wh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_a-rare-rivalry-past-spain-v-england-clashes_1728740594.html", "title": "A rare rivalry: Past Spain v England clashes", "title_page": "A rare rivalry: Past Spain v England clashes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN – Spain and England meet in the Euro 2024 final in Berlin on July 14 in what will be a rare encounter between the nations at a major tournament.\nAFP looks back at their most notable past clashes.\nFirst competitive clash\nThe first competitive meeting of Spain and England came at the 1950 World Cup in Brazil, where they were drawn together in the same group.\nBoth teams had won their opening match at the tournament, with England defeating Chile 2-0 and Spain beating the United States 3-1.\nHowever, while Spain then got the better of Chile, England suffered one of their most humiliating defeats, losing 1-0 to the US. The clash between Spain and England in Rio de Janeiro on July 2 was therefore crucial, with the latter having to win.\nSpain came out on top 1-0 thanks to a goal by legendary forward Telmo Zarra.\nEngland went out, while Spain advanced to the four-team final round, in which they drew 2-2 with eventual champions Uruguay before losing 6-1 to Brazil and 3-1 to Sweden to end fourth.\nWorld Cup hopes end in Spain\nEngland beat Spain in a home-and-away quarter-final to qualify for the final tournament of Euro 1968, and the sides also met at the 1980 Euro, where both went out in the group stage.\nTheir next competitive clash came at the 1982 World Cup, where they were drawn alongside West Germany in the second group stage.\nThe Germans had drawn with England and beaten Spain, results which meant the hosts were already eliminated before taking on Ron Greenwood’s English side in Madrid.\nThe match ended in a 0-0 draw, an outcome which meant England were knocked out without losing a game. West Germany progressed to the semi-finals and were eventually defeated in the final by Italy.\nPearce’s penalty at Euro ’96\nMeetings between the nations may have been rare, but their quarter-final match-up at Euro ’96 led to one of the most iconic moments in English football history.\nThe game at Wembley ended 0-0 after extra time, meaning a penalty shoot-out. Fernando Hierro blasted Spain’s first kick off the bar.\nEngland converted four out of four, with Stuart Pearce – who had missed in their 1990 World Cup semi-final shoot-out loss to West Germany – among their scorers.\nDavid Seaman’s save from Miguel Angel Nadal, uncle of tennis star Rafael, allowed England to win the shoot-out 4-2 and advance to the semi-finals. England went on to lose on penalties to Germany with current manager Gareth Southgate missing the decisive kick.\nFriendly controversy\nA 1-0 Spain victory over England in a friendly at the Santiago Bernabeu in November 2004 was overshadowed by racist abuse directed at several visiting players.\nAsier del Horno’s early goal gave Spain the win despite Raul Gonzalez having a penalty saved, but it was an unsavoury night. Ashley Cole and Shaun Wright-Phillips were the targets of “clear racist chanting”, according to the BBC’s report on the night.\nEngland’s Wayne Rooney was also substituted before half-time to avoid a red card after he clashed with several Spain players.", "url": "https://www.straitstimes.com/sport/football/a-rare-rivalry-past-spain-v-england-clashes"}