{"authors": [], "date_download": "2024-10-12 13:42:20", "date_modify": "2024-10-12 13:42:20", "date_publish": "2024-07-12 21:01:34", "description": "LONDON - James Anderson signed off from international cricket with his 704th and final wicket on Friday, ending a glittering 21-year career during England's emphatic win over West Indies and prompting tributes from teammates and fellow greats. Read more at straitstimes.com.", "filename": "sport_england-great-anderson-retires-with-one-final-flourish_1728740540.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/LYNXMPEK6B0GQ-1.jpg?VersionId=HHsDgjNjvr7Z.WYvt0crk.6Ev3.H2H7C", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_england-great-anderson-retires-with-one-final-flourish_1728740540.html", "title": "England great Anderson retires with one final flourish", "title_page": "England great Anderson retires with one final flourish | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - James Anderson signed off from international cricket with his 704th and final wicket on Friday, ending a glittering 21-year career during England's emphatic win over West Indies and prompting tributes from teammates and fellow greats.\nThe seamer, aged 41 years and 348 days, had Joshua Da Silva caught behind on his final day of test cricket. He spurned a golden opportunity to make it 705 wickets, shelling a simple catch from Gudakesh Motie and smiled ruefully at the miss.\n\"I am still gutted I dropped that catch,\" he told Sky Sports as he sat in the England dressing room with a pint.\nIt was the only negative for Anderson on a day in which he demonstrated his skill one final time for an appreciative Lord's crowd, repeatedly beating the outside edge with seam and swing.\nAnderson, who finished with match figures of 4-58, said he would miss competing at the highest level, adding that there was \"no better feeling\" than winning a test match.\nAsked what he was going to do next, Anderson – who is joining the England coaching set-up – added: \"I've not really thought that far ahead.\n\"I'm going to stick around with these guys for the rest of the summer, try and help the bowling group out as much as I can and we'll see where life takes us after that.\"\nAnderson has certainly earned a rest, having sent down his 40,000th delivery in test cricket late on day two, more than any other seam bowler and putting him fourth on the all-time list.\nEngland captain Ben Stokes described Anderson as \"an incredible inspiration for so many people\", adding: \"He's really keen to help the fast bowlers (in his coaching role). I don't think I could think of a better person to be able to do that.\"\nWest Indies skipper Kraigg Brathwaite said he was a \"legend of the game\", but understandably would not miss facing him.\nEngland & Wales Cricket Board chief executive Richard Gould said in a statement: \"Jimmy has rightly earned a place as one of the all-time iconic names from world cricket.\n\"It is testament to the way he has combined his rare talent with outstanding professionalism and work ethic that he bows out still bowling so well more than 20 years after his Test debut.\"\nIndia great Sachin Tendulkar said on X: \"It has been a joy to watch you bowl - with that action, speed, accuracy, swing and fitness. You've inspired generations with your game.\"\nWhile Anderson leaves big shoes to fill, Gus Atkinson took 12 wickets in an impressive performance on debut as England cruised to victory by an innings and 114 runs.\nAnderson was full of praise for Atkinson, despite the paceman's wickets denying him a chance to catch Shane Warne (708) in second on the list of all-time test wicket takers.\n\"He's going to be an amazing cricketer for England,\" Anderson said.\nAnd Stokes told reporters that Atkinson had even apologised to Anderson for taking the final wicket, which led to one last example of the 41-year-old's competitive spirit.\n\"Jimmy told him to eff off,\" Stokes said. REUTERS", "url": "https://www.straitstimes.com/sport/england-great-anderson-retires-with-one-final-flourish"}