{"authors": [], "date_download": "2024-10-12 14:10:13", "date_modify": "2024-10-12 14:10:13", "date_publish": "2024-07-11 17:16:14", "description": "They are playing alongside each other for the first time as international teammates. Read more at straitstimes.com.", "filename": "sport_basketball_lebron-james-stephen-curry-impress-as-us-romp-past-canada-in-olympic-basketball-warmup_1728742213.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/11/BKO-OLY-SPO-CANADA-V-UNITED-STATES-050747.jpg?VersionId=W.6L..FqO8Xv0BaLzqo7_uzDinuuELUX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_lebron-james-stephen-curry-impress-as-us-romp-past-canada-in-olympic-basketball-warmup_1728742213.html", "title": "LeBron James, Stephen Curry impress as US romp past Canada in Olympic basketball warmup", "title_page": "LeBron James, Stephen Curry impress as US romp past Canada in Olympic basketball warmup | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – LeBron James and Stephen Curry made a winning start as United States teammates in an 86-72 victory over Canada in a pre-Olympics exhibition game in Las Vegas on July 10.\nThe two National Basketball Association (NBA) superstars are part of a formidable US basketball team that will be chasing a fifth consecutive gold medal when the Paris Olympics get under way later in July.\nThe game marked the first meeting between the nations since Canada topped the US 127-118 in overtime in the bronze-medal game at the Fiba World Cup in Manila, Philippines, in September.\nJames and Curry are playing alongside each other for the first time as international teammates, and showed glimpses of a near-telepathic understanding on July 10 at the T-Mobile Arena.\nCurry finished with 12 points, while James had seven as the US recovered from an early 11-1 deficit to cruise to victory in their final game at home before the Paris Games.\nAnthony Edwards scored 13 points, Jrue Holiday had 11 and Bam Adebayo grabbed seven rebounds. Tyrese Haliburton contributed six assists and Anthony Davis posted a double-double of 10 points and 11 rebounds to help the US improve to 35-3 in pre-Olympic exhibition games.\nR.J. Barrett (12 points), Dillon Brooks (10), and Shai Gilgeous-Alexander (10) finished in double figures for Canada.\nThe US travel to the United Arab Emirates for exhibition games against Australia and Serbia on July 15 and July 17 respectively.\nLos Angeles Lakers ace James gathered the US team for a huddle following a win which suggested the Americans will, unsurprisingly, be red-hot favourites for the gold in France.\n“We know we can be a lot better but we’ve been together only four days,” James said. “All the miscues offensively and the turnovers, we’ll get better with that – but it starts on the defensive end.\n“As long as we defend, we’ll give ourselves a good chance to win every night.”\nCurry agreed that defence would be the key to the Olympic campaign.\n“We can work out the kinks and the timing on offence, but if we compete like that and commit to playing defence, we’ll be fine against anybody,” Curry said.\nJames, the NBA’s all-time leading points scorer, said he had enjoyed joining forces with Golden State Warriors star Curry.\n“We’re just two guys who love to play the game of basketball,” he said.\n“It’s fun. We play the game at a high level but more importantly, we just play the game that we love the right way.”\nCurry said winning gold would be a team effort.\n“We just want to win gold, whatever that takes,” he said. “No matter what your stats are, no matter how many minutes you play – if everybody on the floor commits to just doing what you’re asked to do, we’ll be good.”\nKevin Durant, the US’ all-time leading scorer in Olympic play, missed the game due to calf soreness.\nThe US elected to send Kawhi Leonard home from training camp as he contends with a knee injury amid preparation for the NBA season. His replacement, Derrick White, has not yet joined the team. AFP, REUTERS", "url": "https://www.straitstimes.com/sport/basketball/lebron-james-stephen-curry-impress-as-us-romp-past-canada-in-olympic-basketball-warmup"}