{"authors": [], "date_download": "2024-10-12 14:11:22", "date_modify": "2024-10-12 14:11:22", "date_publish": "2024-08-08 22:31:36", "description": "PARIS - Britain's reigning Modern Pentathlon champion Joe Choong choked back tears and said he was 'gutted' after finishing the opening fencing ranking round 29th of 36 competitors at the Paris Olympics on Thursday. Read more at straitstimes.com.", "filename": "sport_modern-pentathlon-champion-choong-gutted-after-opening-setback_1728742282.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/ST-logo-placeholder_123.jpg?VersionId=nyyRkXZaVXtWVtBT1pUzhvnSQqZ0GHkV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_modern-pentathlon-champion-choong-gutted-after-opening-setback_1728742282.html", "title": "Modern pentathlon-Champion Choong 'gutted' after opening setback", "title_page": "Modern pentathlon-Champion Choong 'gutted' after opening setback | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Britain's reigning Modern Pentathlon champion Joe Choong choked back tears and said he was 'gutted' after finishing the opening fencing ranking round 29th of 36 competitors at the Paris Olympics on Thursday.\nChoong led from the start at Tokyo three years ago in an arcane sport featuring fencing, equestrian show jumping, swimming, laser pistol shooting and running.\nThe 29-year-old has had injury problems and has also been outspoken about his opposition to pentathlon dropping the equestrian element after Paris and switching to obstacle courses.\nHis preparations for Paris were further unsettled when girlfriend Olivia Green was not selected for the British team.\n\"It felt like a battle,\" said Choong at the North Paris Arena, where a lively crowd cheered loudly for the home athletes.\n\"I wanted to come here and do it for Liv, who’s not here. A couple of days ago I was just in my room sort of teared up, crying.\n\"I’ve found the last couple of months really difficult and I thought I’d battled through it, got here in really good condition but I’m just so disappointed. I feel like I’ve let Liv down and let a lot of people...\"\nUnable to complete the sentence, he was led away.\nThe Briton had made a strong start to the round before his form slipped away.\n\"I thought physically I was in a really good place but I was getting cramp really early on which is not ideal, makes it a lot tougher to focus on what you’re trying to do,\" said Choong.\n\"I just feel like from a mental side of things I’ve not been happy with a lot of things behind the scenes. We’ll obviously go away and review that after this but today’s been really tough to take. I’m gutted.\"\nUkraine's Oleksandr Tovkai and Egypt's Ahmed Elgendy, the silver medallist in Tokyo three years ago, led the way with 24 victories each and 11 defeats for 245 points. Choong managed 14 wins and 21 losses for 195 points.\nThose points, from sessions in which all competitors faced each other in minute-long one-to-one bouts, come into play later in the competition which switches to the palace gardens at Versailles on Friday.\n\"It (the round) shapes the entire competition,\" said Switzerland's Alexandre Dallenbach, who was fifth. \"But again, everything can change because with the horse riding you can get an elimination.\n\"But it's going to be difficult for positions 30-36 to go and win the competition, if not impossible.\" REUTERS", "url": "https://www.straitstimes.com/sport/modern-pentathlon-champion-choong-gutted-after-opening-setback"}