{"authors": [], "date_download": "2024-10-12 13:42:04", "date_modify": "2024-10-12 13:42:04", "date_publish": "2024-03-03 01:24:06", "description": "LIVERPOOL, England - Tomas Soucek and Edson Alvarez scored stoppage time goals as West Ham United defeated a wasteful Everton 3-1 at Goodison Park in the Premier League to keep the home side in relegation trouble as they were booed off by fans on Saturday. Read more at straitstimes.com.", "filename": "sport_football_two-late-goals-lift-west-ham-to-3-1-win-at-everton_1728740524.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/03/LYNXNPEK2107D-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_two-late-goals-lift-west-ham-to-3-1-win-at-everton_1728740524.html", "title": "Two late goals lift West Ham to 3-1 win at wasteful Everton", "title_page": "Two late goals lift West Ham to 3-1 win at wasteful Everton | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LIVERPOOL, England - Tomas Soucek and Edson Alvarez scored stoppage time goals as West Ham United defeated a wasteful Everton 3-1 at Goodison Park in the Premier League to keep the home side in relegation trouble as they were booed off by fans on Saturday.\nStriker Beto had a first-half penalty saved by West Ham goalkeeper Alphonse Areola, who was excellent throughout, but put his side ahead in the 56th minute before Kurt Zouma equalised for the visitors.\nEverton had several opportunities to regain the lead, before Soucek struck a superb shot past Jordan Pickford, and Alvarez ensured the three points with his first Premier League goal following a lightning counter-attack.\nEverton, who this week regained four points from their appeal against a financial rule breach, are in 16th place with 25 points, five above the relegation zone but having played two games more than 18th-placed Luton Town.\nWest Ham are in seventh with 42 points from their 27 matches.\n\"We have to take ownership, we create chances and defend well but we don't put the ball in the back of the net,\" Everton defender James Tarkowski told Premier League Productions.\n\"We can't just keep saying their keeper has played well, it's on us to score goals. We cause teams problems, win the ball back high but if we don't score, we don't win football matches.\"\nEverton have some breathing space between themselves and the bottom three, but with another Profit and Sustainability (PSR) charge looming before the end of the campaign, will view this as a missed opportunity.\nThe hosts won their first penalty of the season late in the first half when Beto’s attempted cross struck the arm of Zouma, but the Portuguese forward had his effort saved by Areola with a dive low to his left.\nHowever, Beto would not be denied as James Garner delivered a superb deep cross from the right wing and he rose unmarked to head the ball into the net little more than 10 minutes after halftime.\nWest Ham equalised as former Everton defender Zouma headed in James Ward-Prowse’s corner just past the hour-mark.\nSoucek cleared off the line for the visitors from Abdoulaye Doucoure and Everton had several other excellent opportunities to score, before they were hit by a sucker-punch from the visitors.\nThe hosts gave Soucek too much space at the back post to fire past Pickford, before Alvarez finished off a sweeping counter-attack.\n\"One of the best of my career, a special one. Another winning goal for West Ham especially special after this tough game,\" Soucek said.\n\"Brilliant game from him (Areola), especially the penalty save. I had one or two clearances on the line too. A great game for both of us.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/two-late-goals-lift-west-ham-to-3-1-win-at-everton"}