{"authors": [], "date_download": "2024-10-12 13:40:44", "date_modify": "2024-10-12 13:40:44", "date_publish": "2024-09-06 21:31:13", "description": "Former India captain and coach Rahul Dravid has been appointed Rajasthan Royals' head coach on a multi-year contract ahead of the 2025 Indian Premier League (IPL) season, the IPL franchise said on Friday. Read more at straitstimes.com.", "filename": "sport_rajasthan-royals-appoint-dravid-as-head-coach-ahead-of-ipl-2025_1728740444.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/06/LYNXMPEK850IJ-1.jpg?VersionId=flUhpOkXTtW1JUtq3oNmUBe1KSCQwWVx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_rajasthan-royals-appoint-dravid-as-head-coach-ahead-of-ipl-2025_1728740444.html", "title": "Rajasthan Royals appoint Dravid as head coach ahead of IPL 2025", "title_page": "Rajasthan Royals appoint Dravid as head coach ahead of IPL 2025 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Former India captain and coach Rahul Dravid has been appointed Rajasthan Royals' head coach on a multi-year contract ahead of the 2025 Indian Premier League (IPL) season, the IPL franchise said on Friday.\nDravid will begin his tenure immediately, working with the team's Director of Cricket Kumar Sangakkara.\nThe 51-year-old will return to Rajasthan after spending five seasons with the team from 2011 to 2015, having captained the side in 2012 and 2013 and working as their mentor in 2014 and 2015.\n\"We are delighted to be bringing Rahul back to the franchise. His exceptional coaching capabilities are evident with the transformation he's driven in Indian cricket,\" Jake Lush McCrum, Royals' Chief Executive Officer, said.\n\"Rahul has already got to work with Kumar (Sangakkara) and the rest of the team, as we prepare for this exciting new period for the franchise starting with IPL retention and the auction just around the corner.\"\nDravid led Rajasthan to a third-place finish in IPL 2015 and soon after took charge as the head coach of the India Under-19 and India A teams, leading the U-19 team to victory in the 2018 World Cup final.\nAfter four years as coach of the junior teams, Dravid was named Head of Cricket at the National Cricket Academy (NCA) in July 2019, followed by his appointment as head coach of the Indian National Cricket team in Nov. 2021.\nDravid led the national team to the top of the test, one-day internationals and Twenty20 rankings during his tenure and then stepped down from his role in June after India's T20 World Cup triumph. REUTERS", "url": "https://www.straitstimes.com/sport/rajasthan-royals-appoint-dravid-as-head-coach-ahead-of-ipl-2025"}