{"authors": [], "date_download": "2024-10-12 14:13:31", "date_modify": "2024-10-12 14:13:31", "date_publish": "2024-07-28 15:28:29", "description": "Recent heavy rain in Paris have hit pollution levels in the Seine, organisers say. Read more at straitstimes.com.", "filename": "sport_triathlon-swimming-training-session-cancelled-after-rain-lifts-pollution-levels-in-seine_1728742411.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/28/LYNXMPEK6R025-1.jpg?VersionId=h5w7sq46R4lqxmFSQv3QDfF7Ok_x3XG1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_triathlon-swimming-training-session-cancelled-after-rain-lifts-pollution-levels-in-seine_1728742411.html", "title": "Olympics’ triathlon training cancelled for second day over Seine pollution", "title_page": "Olympics’ triathlon training cancelled for second day over Seine pollution | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The Olympics' triathlon swimming training session scheduled for Juy 28 has been cancelled after recent heavy rain in Paris affected pollution levels in the Seine, organisers said in a statement.\nA lot is riding on Olympic triathletes being cleared to swim in Paris' central waterway when the competition kicks off on July 30, with France investing €1.4 billion (S$2.04 billion) in new wastewater infrastructure to cut sewage levels and make the river swimmable for residents as a key legacy of the Games.\nParis Mayor Anne Hidalgo took a dip in the Seine on July 17 to try to convince doubters that the water will be clean enough for athletes to compete in the river, as they did during the 1900 Olympics.\n\"We have had some rainfall but everything that has been put in place has worked, it prevents overflows from occurring so I think we will reach a satisfying quality of the water very soon, but it will depend on the weather forecast as well,\" Pierre Rabadan, the city's deputy mayor for sports, told a press conference on July 28.\nTests carried out in the Seine on July 27 \"revealed water quality levels that in the view of the international federation, World Triathlon, did not provide sufficient guarantees to allow the event to be held,\" organisers Paris 2024 said in a statement.\n\"This is due to rain that has fallen on Paris on July 26-27.\"\nOrganisers said that, given the forecast for sunshine and higher temperatures over the next 48 hours, they were \"confident\" water quality would improve again before the triathlon events begin on July 30 with the men's race.\nWorld Triathlon meets with Paris city authorities at 4 am each morning ahead of triathlon training or competition events to analyse the latest water test results and decide whether the Seine is clean enough for athletes to swim.\nThe running and cycling course familiarisation sessions were going ahead as planned on July 28.\nIn May, the city unveiled a new 46,000 cubic metre storage basin meant to contain rainwater and waste water to reduce pollution levels in the river. REUTERS", "url": "https://www.straitstimes.com/sport/triathlon-swimming-training-session-cancelled-after-rain-lifts-pollution-levels-in-seine"}