{"authors": [], "date_download": "2024-10-12 14:03:46", "date_modify": "2024-10-12 14:03:46", "date_publish": "2024-04-14 16:23:59", "description": "He missed out on a 41st Masters title after a maiden career loss to Casper Ruud at the Monte Carlo Masters. Read more at straitstimes.com.", "filename": "sport_tennis_not-great-admits-tennis-world-no-1-novak-djokovic-as-2024-slump-continues_1728741826.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/14/TENNIS-ATP-MONTECARLO-174129.jpg?VersionId=Ge0VNWUEqqzHg.tMzPmMwSramtRMf9BB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_not-great-admits-tennis-world-no-1-novak-djokovic-as-2024-slump-continues_1728741826.html", "title": "‘Not great’, admits tennis world No. 1 Novak Djokovic as 2024 slump continues", "title_page": "‘Not great’, admits tennis world No. 1 Novak Djokovic as 2024 slump continues | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MONTE CARLO – Novak Djokovic admitted he was “not having a great season at all” after he was knocked out of the Monte Carlo Masters by Casper Ruud in the semi-finals on April 13.\nThe 10th-ranked Norwegian won 6-4, 1-6, 6-4 for a first win in six attempts against the record 24-time Grand Slam singles champion.\nDjokovic insisted, however, that he will not panic despite seeing a golden opportunity to go on to capture a 41st Masters title snatched away by a player he swept off court in the 2023 French Open final.\n“There are positives to take away for sure, but I’m used to a really high standard in terms of expectations and results,” said 36-year-old world No. 1.\n“Not having a title is – compared to the last 15 years – not a great season at all.”\nDjokovic has played in only four events this season but expects to pick up his pace as his clay-court campaign heads to Madrid and Rome before a return to Roland Garros.\nHe arrived in Monte Carlo having skipped Miami after a shock loss to then 123rd-ranked Luca Nardi at Indian Wells.\n“I had semis in Australia, the semis here. It’s normal to expect that you have some seasons where you don’t start well – this is the one,” the Serb added.\n“Hopefully, I can pick up. In terms of results, I can build from here.\n“I’ve played some good tennis. Hopefully, in the next tournaments I’ll be able to play even better.”\nRuud and Djokovic traded breaks in the final set, with the Norwegian having the final word when Djokovic blinked first after 2hr 17min.\n“I’m super-happy, this is a day I will remember for a really long time,” said Ruud, who had never taken a set off Djokovic in their five previous meetings.\n“I’ve never beaten Novak and I’ve never beaten a world No. 1. I’m still in a little bit of shock.\n“I was up and he came back, the top guys are good under pressure. I was just hoping the match would not slip away.\n“In the last game I was hoping something or someone up above was listening... I was so happy to see that last ball sail long.”\nSaid Tsitsipas: “It has been very difficult, so to be back on the podiums, winning tournaments just feels amazing... I am extremely grateful for every person behind this journey.\n“The third time is even more special than the first or second time. This is an unbelievable win for me.\n“Capturing that win today was nerve-racking. I really wanted this trinity. I am extremely happy today...\n“I had to go out there and show my tennis as I promised every single of them (my team) I will make the most out of it.\n“I am glad I presented on court and showed some ruthless tennis. From the beginning to the end, my play was cohesive and I was able to blend in a lot of different shots.”\nRuud was magnanimous in defeat, telling Tsitsipas: “You love this tournament. Very, very well played all week.\n“I know you fell out of top 10 a few weeks ago but you’re back again where I think you belong. You’re a fantastic player and especially on clay and Monte Carlo.” AFP, REUTERS", "url": "https://www.straitstimes.com/sport/tennis/not-great-admits-tennis-world-no-1-novak-djokovic-as-2024-slump-continues"}