{"authors": [], "date_download": "2024-10-12 13:43:27", "date_modify": "2024-10-12 13:43:27", "date_publish": "2024-07-11 06:10:59", "description": "The Three Lions play their best game of the tournament to see off the Dutch 2-1. Read more at straitstimes.com.", "filename": "sport_football_soccer-england-s-positive-approach-pays-off-as-they-head-to-euros-final_1728740607.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/11/LYNXMPEK690V2-1.jpg?VersionId=iyXUciNLcajA675aeBYfSfQEM4vnNtKM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_soccer-england-s-positive-approach-pays-off-as-they-head-to-euros-final_1728740607.html", "title": "England’s positive approach pays off as they head to Euro 2024 final", "title_page": "England’s positive approach pays off as they head to Euro 2024 final | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DORTMUND – England finally showed their true colours at the European Championship on July 10, putting on a convincing and effective performance when it mattered most to book themselves a final berth in Berlin on July 14.\nOllie Watkins’ late winner to secure the 2-1 win over the Netherlands was as much as they deserved, after dominating the encounter in a display their supporters had been eagerly awaiting but barely daring to hope for.\nXavi Simons had opened the scoring at the Signal Iduna Park in Dortmund on seven minutes, before Harry Kane netted a controversial penalty 11 minutes later after he was fouled by Denzel Dumfries.\nThe result was an emphatic answer after the criticism heaped on the Three Lions for some languid showings against underwhelming opposition earlier in the tournament, and sets up a mouth-watering final against a slick-looking Spain.\n“We all want to be loved, right?” said manager Gareth Southgate. “When you are doing something for your country and you are a proud Englishman, when all you read is criticism, it is hard.\n“To be able to celebrate a second final is very, very special. We have given people some amazing nights, some of the best nights in 50 years.”\nEngland had frustrated their followers, looking pedestrian at times in the group phase as well as in their knockout-round games.\nIt was as if they were suffocating at times under a heavy burden of expectation, a feeling Southgate said on July 9 that they learnt to leave behind as they progressed further in the tournament.\nTheir last-16 performance as they edged out Slovakia bordered on the miraculous, snatching victory minutes from being eliminated, and there was a nervy showing as they fought back, again, to beat Switzerland on penalties in the quarter-final.\nThis time, however, there was a positivity about their play from the start, even if it was a third successive game where they went behind.\nKane’s equaliser was followed by a sustained period of pressure on the Dutch defence, with England shaking off the cobwebs and properly greasing the wheels of their attack.\nThe individual quality of their players was on full display and they had their opponents pegged back, looking dangerous every time they entered the final third. Phil Foden was exceedingly unlucky not to have them ahead at half-time with some sublime skill but had his effort cleared off the line.\nThe second period was not as dominant as fatigue set in and the Dutch enjoyed their fair share of possession.\nEven then, whenever England moved menacingly forward, a goal looked on the cards.\nIt was almost to script that they engineered victory just before the final whistle, as Watkins emerged an unlikely hero not long after coming on.\nHe was set up by fellow substitute Cole Palmer, after Southgate – who is often criticised for his in-game management – made the brave call to take off Kane and Foden.\nSaid Watkins: “I said to Cole that we were both going to go on the pitch and he was going to set me up, at half-time.\n“It happened, I manifested it and as soon as he turned, I knew I needed to make a move. You don’t get that opportunity very often, so I had to be greedy. I had to take it.”\nThe confidence boost cannot be underestimated, especially as the in-form Spain await on July 14 at the Olympiastadion.\n“We will have to get the ball off them first,” Southgate said of La Roja.\n“It is not as simple as us having the ball and making them run. We have to be exceptional with the ball and without it. They have been the best team.\n“We are starting to show a better version of ourselves. But we are in there with what we have shown to this point. We have as good a chance as they do.”", "url": "https://www.straitstimes.com/sport/football/soccer-england-s-positive-approach-pays-off-as-they-head-to-euros-final"}