{"authors": ["Rohit Brijnath"], "date_download": "2024-10-12 14:13:26", "date_modify": "2024-10-12 14:13:26", "date_publish": "2023-10-01 22:08:48", "description": "In merely the women’s section in the history of the Asian Games, they have won all five 1m golds, the last 12 golds in 3m springboard and 10m platform, all five golds in the 3m synchronised and 10m synchronised and both golds in Hangzhou so far. Read more at straitstimes.com.", "filename": "sport_the-diving-has-begun-yes-china-are-winning_1728742406.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/02/2023100154404487img0236.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_the-diving-has-begun-yes-china-are-winning_1728742406.html", "title": "The diving has begun. Yes, China are winning", "title_page": "The diving has begun. Yes, China are winning | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANGZHOU – As the piano-playing surfer from Guangdong and the biography-reading photographer from Hubei launch themselves off the 3m diving board at precisely the same time, elegant mirror images of each other, one thing is immediately clear on Sunday.\nThis women’s synchronised 3m springboard event is only theoretically a competition. In polite fact, it is an exhibition. A gold medal has to be awarded and so by the rules an event must be run, judges summoned, teams gathered, multiple dives done, marks given.\nThen, when it’s over, China will win.\nDominance is a flimsy word to describe China in diving. In merely the women’s section in the history of the Asian Games, they have won all five 1m golds, the last 12 golds in the 3m springboard and 10m platform, all five golds in the 3m synchronised and 10m synchronised and both golds in Hangzhou so far.\nOf course, in table tennis, India won a women’s doubles match against China at these Games, so you may wonder, this is sport, nothing can be taken for granted. So did Chen Yiwen and Chang Yani win the women’s synchronised event on Sunday? Yes. Even miracles at these Games have quotas.\nIn the first dive Macau scored 37.80, South Korea 44.40, Malaysia 47.40 and Singapore 42. China scored 53.40. The gap had commenced. By the end, the distance between third-place South Korea (253.56 points) and second-place Malaysia (270.27) was 16.71 points. But the chasm between Malaysia and China was 65.46 points.\nThe Singaporeans, Fong Kay Yian and Ashlee Tan, came fourth and confessed to “not having the best day”. Their melancholy was written on their faces, for circumstance had got in the way. Tan had the flu and Fong was fighting injuries. Furthermore, the first is studying medicine, the second is working, and as Fong said, “we have very different styles of diving individually”. Finding time, the very key to synchronicity, has been hard.\nChina’s divers are extraordinary because they are polished by time. By hours and years of falling to water. Between them, Chen (five world championship golds) and Chang (three) have 29 years of diving experience. Tan could see that. “We had the opportunity to go to China to train. They spend 70 per cent of their time at the pool and maybe have two lessons a week. And the coaches are very strict.”\nTwo people in flight can only give the illusion of being duplicates. Land people, after all, can’t be perfect in air. “The secret,” says the retired Timothy Lee, who with his twin Mark constructed fine careers in synchronised diving, “is accepting you’ll never be perfect.”\nOne diver may spin at a slightly different speed, another may bounce too low. The solution is adjustment. As Tan said, “Kay is injured which prevents her from jumping too high.” So Tan’s coach tells her to use her peripheral vision to “adjust the height of my jumps”.\nA dive is compressed art, a sort of aerial haiku, which takes less than five seconds. At their best, divers can make you feel you have double vision. The pairs do five dives each which translate to years of labour for 25 seconds of work. Flawlessness is a tough business. As Timothy said of the Chinese, “They execute difficult dives consistently well.”\nOf course on this day, the Chinese weren’t impressed with themselves. In matters of rhythm, Chang used the word “shortcomings” and then so did Chen. Perhaps it was why the scoresheet showed that China did not score a single perfect 10.\nBut then, maybe they’re just keeping that for the Olympics.", "url": "https://www.straitstimes.com/sport/the-diving-has-begun-yes-china-are-winning"}