{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 13:41:50", "date_modify": "2024-10-12 13:41:50", "date_publish": "2024-08-03 22:41:01", "description": "While Gan Ching Hwee broke two national records, other swimmers endured tougher campaigns. Read more at straitstimes.com.", "filename": "sport_mixed-olympic-debuts-for-singapore-s-young-swimmers_1728740510.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/03/2024080354127642img2537.jpg?VersionId=4FIL.yUb0gkCNVRVpZ6Bt_iV_a2nCJsQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_mixed-olympic-debuts-for-singapore-s-young-swimmers_1728740510.html", "title": "Mixed Olympic debuts for Singapore’s young swimmers", "title_page": "Mixed Olympic debuts for Singapore’s young swimmers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – It was a mixed campaign at the Paris Olympics for Singapore’s swimming debutants as their involvement in the quadrennial event concluded on Aug 3.\nWhile distance swimmer Gan Ching Hwee, 21, broke the women’s 800m and 1,500m freestyle national records at the Paris La Defense Arena, Singapore’s ‘A’ qualifiers Letitia Sim and Jonathan Tan endured tougher outings as their timings were some way off their personal bests.\nIn an assessment of the swimmers’ Paris 2024 campaign, National Training Centre assistant coach Gustavo Schirru said: “Ching Hwee had a really good meet and result.\n“The relay if you compare with Doha, it’s different, not our best time, not the national record or anything like this. But the splits were not far off – the first two splits were close, the last two were far from what we did.\n“For Johnny and Letitia, I was expecting better results, but I feel like it’s a learning curve. The bad part will be if we don’t learn anything from this.\n“The result is the result, it’s done already, there is not much that we can do to change it.”\nLetitia, who had hoped to make it to the semi-finals of her individual events, had earlier expressed disappointment at her times.\nIn the women’s 100m breaststroke, she swam 1min 07.75sec, while her national record stands at 1:06.36.\nThe 21-year-old then clocked 2min 29.46sec in the 200m breast, over five seconds off her national record of 2:24.15.\nTan, 22, also felt like he could have gone faster. In the men’s 50m free, he touched the wall in 22.26sec. His personal best is the national record of 21.91sec.\nBut Schirru noted that the Olympics are unlike any other swimming meets, saying that it was “very hard, very different, very loud, way bigger”.\nThe Brazilian also highlighted that while everyone comes in physically ready, what sets individuals apart at a meet like the Olympics is their mentality which often comes with more experience.\nRecalling a conversation he had with Singapore Aquatics technical director Sonya Porter, he said: “She said one thing that I hadn’t realised – there is no other training for Olympics, no other competitions this size.\n“It’s here that they have to have the experience, it’s how you learn, how you notice the points that you need to keep working on and improve. Getting the experience is the way to get this information and working on it.”\nThere was also history made as the quartet of Letitia Sim, Levenia Sim, Quah Jing Wen and Gan became the first women’s relay team to represent Singapore at the Olympics.\nThe spotlight had been on the team ahead of the Games due to a selection controversy involving Quah Ting Wen and Gan, but they pushed past it to clock 4min 05.58sec and finish seventh in Heat 2 and 14th out of 16 teams overall, with Australia (3:54.81) coming in first, while Italy and Denmark were disqualified.\nWhile it was initially tough not having her sister Ting Wen on the team, Jing Wen was proud of how the relay quartet performed in Paris.\nJing Wen, 23, said: “Obviously she’s my sister so that does hit differently but we’re all here to do a job and ultimately, this is a relay (team) that was sent.\n“We’re still a team and all I had to do was focus on myself and trust my teammates to bring that same level and I think they really did.\n“I’m really proud of the whole team... Circumstances like sports you really never know, it’s not going to take away from my experience.”\nAmid the disappointment for Letitia, she believes her Olympic debut has provided invaluable lessons for her to take into future meets.\nShe said: “I learnt a lot from the environment, the crowd, my races, the pool, and overall just my mindset – how I should be handling myself throughout the races.”", "url": "https://www.straitstimes.com/sport/mixed-olympic-debuts-for-singapore-s-young-swimmers"}