{"authors": [], "date_download": "2024-10-12 14:08:37", "date_modify": "2024-10-12 14:08:37", "date_publish": "2023-11-14 19:45:43", "description": "LONDON - Former England forward Andros Townsend is hoping chewing on chicken feet can help him excel on the wing and give his flagging football career a second wind. Read more at straitstimes.com.", "filename": "sport_football_townsend-hopes-chewing-chicken-feet-will-lift-him-up-lutons-pecking-order_1728742117.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/14/LYNXMPEJAD0GT-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_townsend-hopes-chewing-chicken-feet-will-lift-him-up-lutons-pecking-order_1728742117.html", "title": "Townsend hopes chewing chicken feet will lift him up Luton's pecking order", "title_page": "Townsend hopes chewing chicken feet will lift him up Luton's pecking order | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Former England forward Andros Townsend is hoping chewing on chicken feet can help him excel on the wing and give his flagging football career a second wind.\nThe 32-year-old joined Premier League newcomers Luton Town last month on a short-term deal, having sat out the whole of last season and the end of the 2021-22 campaign while injured as an Everton player.\nThe winger has turned to natural remedies as he looks to repair his body and avoid a recurrence of the serious knee injury that had kept him sidelined.\n\"One of the best natural sources of collagen is chicken feet. It is simple,\" the player told BBC Radio 5 Live's Monday Night Club.\nWhile a popular snack in many parts of the world, chicken feet do not commonly appear on a Premier League footballer's menu, but Townsend is convinced the food is helping him become fitter than ever, along with other marginal gains he is adopting.\n\"It tastes exactly like a chicken wing. It is low on meat, it has a lot of cartilage close to the bone. It's got skin around it. It's very nice. In China, South Africa and in Portugal, it is eaten quite commonly. It's 20 minutes in the steam oven and get it down you.\n\"Mouth taping, I am doing that. All I know is that I am 32 years of age, I've been out of the game for two years and I feel absolutely amazing.\n\"I don't know what it is specifically but I think all these little one percents are adding up. Nutrition and recovery, the hyperbaric chamber, red-light therapy, flow therapy... all these things I am doing seem to be working.\"\nHaving played four times for the Hatters since joining, Townsend is under contract until January. REUTERS", "url": "https://www.straitstimes.com/sport/football/townsend-hopes-chewing-chicken-feet-will-lift-him-up-lutons-pecking-order"}