{"authors": [], "date_download": "2024-10-12 13:38:26", "date_modify": "2024-10-12 13:38:26", "date_publish": "2024-06-14 01:16:02", "description": "LAUSANNE, Switzerland - Afghanistan will field a gender equal team at the Paris Olympics with three women and three men in a largely symbolic move, while no Taliban official will be allowed at the Games, the International Olympic Committee said on Thursday. Read more at straitstimes.com.", "filename": "sport_afghanistan-to-have-gender-equal-team-in-paris-no-taliban-allowed-ioc_1728740306.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/14/LYNXMPEK5C0P0-1.jpg?VersionId=x_dt2zljbE6kyhSjEdwFOhfG4IWAxTRJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_afghanistan-to-have-gender-equal-team-in-paris-no-taliban-allowed-ioc_1728740306.html", "title": "Afghanistan to have gender equal team in Paris, no Taliban allowed, says IOC", "title_page": "Afghanistan to have gender equal team in Paris, no Taliban allowed, says IOC | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LAUSANNE, Switzerland - Afghanistan will field a gender equal team at the Paris Olympics with three women and three men in a largely symbolic move, while no Taliban official will be allowed at the Games, the International Olympic Committee said on Thursday.\nThe Olympic body said fielding a gender equal team was a message to both Afghanistan, which under Taliban rule has restricted women's and girls' access to sports and gyms, and to the rest of the world of what is possible.\nBoth the head of Afghanistan's national Olympic committee (NOC) recognised by the IOC and its secretary general are currently in exile, the IOC said.\n\"We have been working with the NOC president and the secretary general, who we recognise in exile, over some time,\" IOC spokesperson Mark Adams told a press conference.\n\"We made it clear we wanted a gender equal team. That was the demand and that is what we achieved.\"\n\"The clear idea is we want to get Afghan athletes and a gender-based team in Paris because of the demonstration that it gives to the world, at home in Afghanistan and also to the rest of the world.\"\nThe Taliban - who say they respect women's rights in line with their interpretation of Islamic law and local customs - have closed girls' high schools, placed travel restrictions on women without a male guardian and restricted access to parks and gyms since seizing power in August 2021.\nAdams said no Taliban official would be accredited for the Games.\n\"There will be no place for Afghan authorities, the Taliban, in Paris itself,\" he said. \"No representative of the de facto authorities, the Taliban government, will be accredited for the Olympic Games 2024.\"\nThe IOC has said recently it was in talks with both the Afghan NOC as well as sport authorities \"with the aim to reverse the current restrictions on access to sport for women and young girls in Afghanistan\".\nAfghanistan's male athletes will be competing in athletics, swimming and judo in Paris, while the women will take part in the athletics and cycling competitions, Adams said.\nIn February, a United Nations expert described the Taliban's disrespect for the rights of women and girls as \"unparalleled in the world\", and said their takeover had \"exacerbated a high prevalence of gender-based violence against women and girls\".\nThe IOC suspended Afghanistan's NOC in 1999, and the country was barred from the 2000 Sydney Games. Afghanistan was reinstated after the fall of the Taliban in 2001. REUTERS", "url": "https://www.straitstimes.com/sport/afghanistan-to-have-gender-equal-team-in-paris-no-taliban-allowed-ioc"}