{"authors": [], "date_download": "2024-10-12 13:59:28", "date_modify": "2024-10-12 13:59:28", "date_publish": "2024-06-15 19:21:30", "description": "A total of 25 athletes from Russia and Belarus were cleared for 41 quota places, amid Moscow's invasion of Ukraine. Read more at straitstimes.com.", "filename": "sport_some-russians-make-the-cut-for-paris-olympics-but-others-fail-vetting-process_1728741568.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/15/FILES-OLY-PARIS-2024-RUSSIA-UKRAINE-CONFLICT-111537.jpg?VersionId=URj7CDQZicytU8rUZqQK5_SvFzzmxImL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_some-russians-make-the-cut-for-paris-olympics-but-others-fail-vetting-process_1728741568.html", "title": "IOC issues first list of Russians and Belarusians eligible for Olympics", "title_page": "IOC issues first list of Russians and Belarusians eligible for Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LAUSANNE – A total of 14 Russian and 11 Belarusian athletes were included on June 15 by the International Olympic Committee (IOC) on an initial list of “Individual Neutral Athletes” eligible to compete at the Paris Games.\nThe athletes had to qualify for the Games and pass a double check, first by their international sports federation and then by the IOC, to prove they did not actively support the war in Ukraine or have any links with their countries’ military forces.\nThe athletes named on June 15 compete across four sports.\nSixteen are wrestlers. The IOC has also approved two weightlifters, three trampoline gymnasts and four road cyclists, including Aleksandr Vlasov, who was fourth in the 2021 Giro d’Italia.\n“Our cyclists passed the ‘test’,” Viatcheslav Ekimov, the president of the Russian Cycling Federation, told the country’s state-run Tass news agency.\n“The IOC allowed us to the Olympics, although I did not expect a different development.\n“As for Vlasov, despite all his past statements, I think he will participate in the Olympics. And with great pleasure,” Ekimov said of the 28-year-old, who has called for an end to the war in Ukraine.\nNikolai Makarov, the president of the Russian Trampoline Federation, told Tass he was not entirely happy.\n“The fact that the IOC has decided to admit Angela Bladtseva to the Olympics is very good news,” he said.\n“But I don’t understand why another one of our contenders for the only ticket – Yana Lebedeva – is not on the list. I hope that her name will be on the next list.”\nThe IOC statement also listed taekwondo, but that section included no names.\n“It is absolutely true – none of our taekwondo exponents will perform at the Olympic Games in Paris,” Vadim Ivanov, Russia’s taekwondo head coach, told the state-run RIA Novosti news agency.\nUkraine acting sports minister Matviy Bidnyi welcomed the absence of “outspoken propagandists” from the Games.\n“The IOC listened to our evidence, which we, together with the Ukraine national Olympic committee and sports federations, submitted to the IOC...\n“We are very grateful for the help of investigative journalists and colleagues from the relevant government agencies in finding and verifying the evidence.”", "url": "https://www.straitstimes.com/sport/some-russians-make-the-cut-for-paris-olympics-but-others-fail-vetting-process"}