{"authors": [], "date_download": "2024-10-12 13:43:49", "date_modify": "2024-10-12 13:43:49", "date_publish": "2024-06-22 05:01:27", "description": "France captain Kylian Mbappe was on the bench, after suffering a broken nose in their opening match. Read more at straitstimes.com.", "filename": "sport_football_france-and-netherlands-scoreless-draw-leaves-group-wide-open_1728740629.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/22/11429433.jpg?VersionId=8LJHsCIm8S4NPJ7cGXR3o6wScFuMrvvH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_france-and-netherlands-scoreless-draw-leaves-group-wide-open_1728740629.html", "title": "Netherlands and France draw 0-0 to edge closer to Euro 2024 last 16", "title_page": "Netherlands and France draw 0-0 to edge closer to Euro 2024 last 16 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LEIPZIG, Germany - France and the Netherlands played it safe in a 0-0 draw in Group D at Euro 2024 on June 21 that left them within sight of a place in the last 16 and made Poland the first team to be eliminated.\nWith France captain Kylian Mbappe on the bench after suffering a broken nose in their opener, the game sparked into life in fits and starts, without ever threatening to turn into a classic.\nNetherlands' Xavi Simons had the ball in the net in the second half but the goal was disallowed because Denzel Dumfries, standing offside next to keeper Mike Maignan, was penalised with the decision eventually confirmed by VAR after a lengthy delay.\nThe result leaves the group open, although with four points in the bag both France and the Netherlands will think they have most likely done enough to reach the last 16.\nFrance next face Poland, who have no points after losing 3-1 to Austria earlier on June 21, while the Netherlands meet the Austrians, who have three points, also on June 25.\nThe saga around Mbappe's selection dominated the build-up, with his appearance at training on June 20 wearing a tricolore mask seen as a sure sign he was set for inclusion.\nThe first half was at times frenetic, with the Dutch going close within the first minute as Jeremie Frimpong's effort was tipped around the post by Maignan before Antoine Griezmann had an early shot palmed over at the other end.\nFrance should have taken the lead minutes later when Adrien Rabiot was played through on goal but inexplicably chose to pass to Griezmann, who was so stunned by his generosity that he miscontrolled, stumbled and lost possession.\nWith Mbappe out of the picture, Griezmann slotted into the role as France's main man, firing another chance wide and heading straight at keeper Bart Verbruggen from a Rabiot cross.", "url": "https://www.straitstimes.com/sport/football/france-and-netherlands-scoreless-draw-leaves-group-wide-open"}