{"authors": [], "date_download": "2024-10-12 14:00:55", "date_modify": "2024-10-12 14:00:55", "date_publish": "2024-07-31 01:19:35", "description": "PARIS - Italy's world number 5 Jasmine Paolini was knocked out by unseeded Slovakian Anna Karolina Schmiedlova in a tight Paris Olympics tennis singles match, 7-5 3-6 7-5, becoming the second major upset on Tuesday after American Coco Gauff. Read more at straitstimes.com.", "filename": "sport_tennis-italys-paolini-blames-lack-of-focus-for-early-paris-singles-exit_1728741655.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/LYNXMPEK6T0SW-1.jpg?VersionId=0ne.w2iMia5CBf6iPlemWnYuwtCs9aDd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis-italys-paolini-blames-lack-of-focus-for-early-paris-singles-exit_1728741655.html", "title": "Tennis-Italy's Paolini makes early exit in Paris singles", "title_page": "Tennis-Italy's Paolini makes early exit in Paris singles | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Italy's world number 5 Jasmine Paolini was knocked out by unseeded Slovakian Anna Karolina Schmiedlova in a tight Paris Olympics tennis singles match, 7-5 3-6 7-5, becoming the second major upset on Tuesday after American Coco Gauff.\nPaolini's dream of an Olympic medal after reaching the finals of both the French Open and Wimbledon this year was still alive, however, after she joined up with Sara Errani and marched past France's Caroline Garcia and Diane Parry 5-7 6-3 10-8 in the second round of the doubles competition.\n\"(Schmiedlova) was definitely more consistent than me today, more focused as well and I'm a bit disappointed with the match, but it's tennis it can it can happen, so now I have to focus on doubles,\" she said in Roland Garros.\nAfter leading 5-3 on the red clay in the first set, the Italian had a dip in form, having a hard time returning some of Schmiedlova's long groundstrokes in losing the next four games and the set.\nPaolini won the second set easily, but a fresh load of unforced errors - 52 against 32 for the whole match - and a lack of focus caused her to lose the third despite having served for the match at 5-4.\n\"Unfortunately, mentally I didn't feel 100% clear and I think the emblem is the 5-4 serve,\" she said. \"There was definitely a bit of nervousness, I really wanted to do well and I think this made me put a little more tension.\"\nMeanwhile Schmiedlova cheered what she said was one of the biggest wins of her career.\n\"It was very tough, very hot. I didn't have a lot of power at the end, but I made some brave decisions and it worked out,\" she said. \"I had nothing to lose.\"\nThe two women experienced the extreme weather rule introduced by the International Tennis Federation on Tuesday due to a heat wave hitting Paris, allowing them a 10-minute break between the second and third sets in singles matches. REUTERS", "url": "https://www.straitstimes.com/sport/tennis-italys-paolini-blames-lack-of-focus-for-early-paris-singles-exit"}