{"authors": ["Lin Tianbao"], "date_download": "2024-10-12 13:42:06", "date_modify": "2024-10-12 13:42:06", "date_publish": "2024-08-09 18:27:32", "description": "She beat compatriot Cherie Tan 212-206 in the stepladder final at the Greater Detroit Open. Read more at straitstimes.com.", "filename": "sport_singapore-bowler-new-hui-fen-wins-first-pwba-title-in-eight-years_1728740526.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/09/VLT5pdJBE9KYRA9.jpg?VersionId=wafMraCAa3mbnX7RSyKQd1heFLYqiLf4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-bowler-new-hui-fen-wins-first-pwba-title-in-eight-years_1728740526.html", "title": "Singapore bowler New Hui Fen wins first PWBA title in eight years", "title_page": "Singapore bowler New Hui Fen wins first PWBA title in eight years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – National bowler New Hui Fen finally broke her duck on the Professional Women’s Bowling Association (PWBA) Tour on Aug 8, claiming her first title in eight years at the Greater Detroit Open.\nThe 32-year-old had been winless in over 30 stops on the tour, and was still in shock hours after beating compatriot Cherie Tan – who has five PWBA titles to her name – 212-206 in the stepladder final at Thunderbowl Lanes.\nNew, who pocketed US$10,000 (S$13,200) for her win, last won on the PWBA circuit in 2016 at the Smithfield Tour Championship.\nThe veteran player said: “It feels amazing.\n“I’m not sure I can find the exact words to fully describe how I’m feeling right now.\n“I’m still processing what happened. I feel very happy winning (this), felt like my hard work has paid off and I’m heading (in) the right direction.”\nWhile New suffered a long drought on the competition circuit, she came agonisingly close on several occasions. This included finishing second at the PWBA BowlTV Classic in June, when she lost to Tan in the final.\nNew admitted that while she has learnt from those losses, she is grateful to rediscover her winning touch.\nShe added: “Of course, winning validates my effort and lets me know that I’m doing and thinking the right things.\n“I was aiming for this result, I wouldn’t say I was expecting it.\n“Expecting the result would give me a perspective that it is already mine, and I prefer to have the mindset of earning it.”\nAnd earn it she did, as New rebounded from third spot in the first matchplay round – Tan was first – to top the standings after completing the second round with nine wins and three losses to qualify for the stepladder final.\nTan, who had seven wins and five losses, defeated American Bryanna Cote 203-194 to reach the final, but was eventually beaten by her teammate.\nSingapore Bowling Federation technical director Jason Yeong-Nathan said: “I’m very happy for her.\n“She has been working very hard the past few years and this result is a reward of the hard work that she has put in.\n“She has shown consistent performance at all the competitions that she went to this year.\n“She may not have had won any, but because of how consistent she was performing, I was very confident that it was just a matter of time that she would win.”\nDespite the loss, Tan remains in high spirits.\nShe said: “It’s a great start for the week and I came really close. It’s also a great finish for Singapore.”\nNew and Tan will next feature at the two-day Pepsi Open from Aug 9 (Aug 10, Singapore time) and the Tour Championship from Aug 11 to 13.\nNew will hope to carry her winning momentum into the next two competitions, noting that making good shots consistently will be key to another win on the tour.\nShe added: “Every day plays differently and being adaptable... is important.\n“I hope to keep an open mind and keep making good shots and decisions.”", "url": "https://www.straitstimes.com/sport/singapore-bowler-new-hui-fen-wins-first-pwba-title-in-eight-years"}