{"authors": [], "date_download": "2024-10-12 14:01:49", "date_modify": "2024-10-12 14:01:49", "date_publish": "2024-07-20 21:57:07", "description": "The Spaniard reached his first title decider since winning the 2022 French Open for the 14th time. Read more at straitstimes.com.", "filename": "sport_tennis_rafael-nadal-makes-first-final-in-two-years-at-bastad_1728741709.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/20/TENNIS-ATP-SWE-123309.jpg?VersionId=RKxK6d0X9MPJPAaFiAJqQ4hJEJzKcxsP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_rafael-nadal-makes-first-final-in-two-years-at-bastad_1728741709.html", "title": "Rafael Nadal makes first final in two years at Bastad", "title_page": "Rafael Nadal makes first final in two years at Bastad | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BASTAD – Rafael Nadal has won 22 Grand Slam titles but getting to any final now – even at an ATP 250 event – at the age of 38 is a “great feeling” for him, especially after his injury problems.\nOn July 20, the Spaniard reached his first title decider since winning the 2022 French Open for the 14th time, defeating Croatian qualifier Duje Ajdukovic in a three-set semi-final tussle in Bastad, Sweden.\n“I think it was a tough match. He came here with a lot of confidence. It was very difficult, but I found a way to survive and be through to the final after a long time without being in a final,” Nadal said.\n“It’s always a great feeling to be in a final. I wasn’t able to make that happen since two years ago. A lot of things happened. That’s the truth. Still in this process of recovering a lot of things I lost because I had a very important hip surgery almost one year ago... so things aren’t going that easy.”\nA day after his four-hour quarter-final victory over Mariano Navone, he was again tested to the limit by 23-year-old Ajdukovic, the world No. 130 who had progressed to his maiden ATP Tour semi-final.\nNadal, now ranked 261st, rebounded from dropping the opening set to prevail 4-6, 6-3, 6-4, returning to the final of a tournament he won as a teenager in 2005.\nHe will play Portuguese seventh seed Nuno Borges, who beat Argentina’s Thiago Agustin Tirante 6-3, 6-4, on July 21 as he goes in search of a 93rd career singles title.\n“I’m fighting. I fought the whole tournament to be where I am today. Let’s see if I’m able to play a little better tomorrow,” Nadal added, pleased with his comeback from his fitness issues.\nHe is using the event in Bastad as a tune-up for the Paris Olympics, where the tennis tournament will be played on clay at his beloved Roland Garros.\nBefore this week, he had not played since losing in the French Open first round in late May.\nElsewhere in Hamburg, Alexander Zverev claimed a season-leading 43rd win on July 19 with a straight-set victory over Zhang Zhizhen of China to edge closer to back-to-back titles at his hometown tournament.\nThe world No. 4 needed just 66 minutes to secure a 6-4, 6-3 win and reach the semi-finals for the fourth time. His 43rd win of 2024 took him past the mark of world No. 1 Jannik Sinner.\n“I’m extremely pleased with the level of tennis today,” said Zverev, who showed no sign of the knee injury he suffered in his fourth-round exit at Wimbledon earlier in July. “I’m happy to be in the semi-finals, but I don’t want to stop here. I want to continue and hopefully defend my title.”\nThe German then beat Spain’s Pedro Martinez 6-2, 6-4 in the last four on July 20 and will face fifth-seeded Frenchman Arthur Fils in the July 21 final.\nLike Nadal, French Open runner-up Zverev is playing his last tournament before heading back to Roland Garros to defend his Olympic title. AFP", "url": "https://www.straitstimes.com/sport/tennis/rafael-nadal-makes-first-final-in-two-years-at-bastad"}