{"authors": [], "date_download": "2024-10-12 14:08:54", "date_modify": "2024-10-12 14:08:54", "date_publish": "2024-09-19 16:44:56", "description": "Portland will be the third expansion franchise the WNBA adds over the next two years with Golden State and Toronto having previously been awarded teams. Read more at straitstimes.com.", "filename": "sport_basketball_wnba-awards-portland-expansion-team-that-will-start-play-in-2026_1728742134.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/19/BKP-SPO-WBA-PHOENIX-MERCURY-V-LOS-ANGELES-SPARKS-050343.jpg?VersionId=dLbDko7szRtR.T.kURRlZwIuOheSrQhD&h=9f7dee20", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_wnba-awards-portland-expansion-team-that-will-start-play-in-2026_1728742134.html", "title": "WNBA awards Portland expansion team that will start play in 2026", "title_page": "WNBA awards Portland expansion team that will start play in 2026 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Portland, Oregon has become the latest city to benefit from the Women’s National Basketball Association’s (WNBA) rapid expansion plans after being awarded a franchise on Sept 18 that will begin play in 2026.\nPortland will be the third expansion franchise the WNBA adds over the next two years, with Golden State and Toronto having previously been awarded teams.\nThe new team will be owned and operated by Raj Sports and led by Lisa Bhathal Merage and Alex Bhathal. It also marks the WNBA’s return to Portland, which was home to the Portland Fire from 2000 to 2002.\n“As the WNBA builds on a season of unprecedented growth, bringing a team back to Portland is another important step forward,” WNBA commissioner Cathy Engelbert said in a media statement.\n“Portland has been an epicentre of the women’s sports movement and is home to a passionate community of basketball fans.\n“Pairing this energy with the Bhathal family’s vision of leading top-flight professional sports teams will ensure that we deliver a premier WNBA team to the greater Portland area.”\nPortland will be the WNBA’s 15th franchise.\nThe WNBA is proud of this latest development, while reiterating on its website of its achievements: “The league in recent months has added its most anticipated rookie class ever; signed a groundbreaking new media rights deal; and shattered records for viewership, attendance, merchandise sales, social media engagement, digital subscriptions (WNBA League Pass) and app downloads.”\nBhathal Merage, meanwhile, said at a press conference: “The business potential in women’s sports is undeniable.\n“We are witnessing unprecedented growth, investment and fan interest. We believe that Portland, with its forward thinking and innovative spirit, is the perfect city to lead this charge.”\nRaj Sports, which is run by Bhathal Merage and her brother Alex, also own the National Women’s Soccer League’s Portland Thorns.\nBhathal Merage added that the franchise would provide a boost to the city beyond the court.\n“We see this team not only as an investment in basketball but an investment in this city’s future,” she said.\n“We will create jobs, contribute to the local economy and give back.”\nBhathal Merage also said that a team name would be announced in due course with input from the community.\nThe team will play their home games at downtown Portland’s Moda Centre, which is home to the National Basketball Association’s Portland Trail Blazers. REUTERS", "url": "https://www.straitstimes.com/sport/basketball/wnba-awards-portland-expansion-team-that-will-start-play-in-2026"}