{"authors": [], "date_download": "2024-10-12 13:59:43", "date_modify": "2024-10-12 13:59:43", "date_publish": "2023-12-09 05:15:52", "description": "World Athletics, meanwhile, said there would be no Russians or Belarusians competing as neutrals in its programme in Paris. Read more at straitstimes.com.", "filename": "sport_athletes-risk-becoming-russian-propaganda-after-ioc-decision-on-paris-games-ukrainian-sportsman-says_1728741583.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/09/LYNXMPEJB70RB-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_athletes-risk-becoming-russian-propaganda-after-ioc-decision-on-paris-games-ukrainian-sportsman-says_1728741583.html", "title": "Athletes risk becoming ‘Russian propaganda’ after IOC decision on Paris Games: Ukrainian sportsman", "title_page": "Athletes risk becoming ‘Russian propaganda’ after IOC decision on Paris Games: Ukrainian sportsman | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Olympic competitors risk being used as “Russian propaganda” after the International Olympic Committee’s (IOC) decision to allow Russian and Belarusian athletes to compete as neutrals at the 2024 Paris Games, Ukrainian skeleton racer Vladyslav Heraskevych said on Dec 8.\n“I don’t really understand why the IOC are acting like they are blind or something,” he said.\n“I am fully okay if they compete but I am not okay if they use their achievements and their participation in Russian propaganda. Because if they use it, then we have more victims in this war.\n“It’s basically the IOC saying that they’re okay if international sport will be used in Russian propaganda.”\nHeraskevych used his own moment in the spotlight at the 2022 Beijing Winter Olympics to hold up a paper sign reading “No War in Ukraine” to a television camera in between runs at the skeleton event.\nRussian and Belarusian athletes were initially banned from competing internationally, following Russia’s invasion of Ukraine in February 2022 days after the Games ended.\nHowever, the IOC announced on Dec 8 that athletes who qualified in their sport would be able to participate as neutrals without flags, emblems or anthems in Paris.\n“Let’s pretend that I’m competing and I won a medal and Russian guy (was) second,” Heraskevych added.\n“IOC make a photo and then Russian propaganda use this photo in some advertising. I don’t want to be used in Russian propaganda. IOC should guarantee me this because that’s how it works now.\n“If we give this opportunity to use international sport as Russian propaganda... then more people (are) going on the front line. And more innocent people (are) dying.\n“The IOC should understand and take responsibility for that.”\nIts decision also drew an angry response from Ukrainian Foreign Minister Dmytro Kuleba.\n“The IOC essentially gave Russia the green light to weaponise the Olympics because the Kremlin will use every Russian and Belarusian athlete as a weapon in its propaganda warfare,” he said.\nIn a statement, the IOC said that neutral athletes would compete only in individual and not team sports. It said those who actively supported the war were not eligible, nor were those contracted to the Russian or Belarusian military.\nOut of 4,600 athletes globally who have qualified for the Games, there are eight Russians, three Belarusians and more than 60 Ukrainians.\nUkraine was backed by World Athletics president Sebastian Coe, who said that there would be no Russians or Belarusians competing as neutrals in the athletics programme in Paris.\n“You may well see some neutral athletes from Russia and Belarus in Paris, it just won’t be in athletics,” he said. “The position that our sport took and has consistently taken is unchanged.\n“It’s a settled position. It’s a position the (World Athletics) council took, it’s one endorsed by the executive board and has been endorsed almost unanimously by the athletics family.”\nCoe said the IOC’s decision “points to the primacy of international federations” to make their own judgment.\n“I think it’s right that international federations should make the judgments that they feel are in the best interest of their sport. And that’s what our council has done,” he added.\n“We have made the judgment there will be no neutral athletes.” REUTERS, AFP", "url": "https://www.straitstimes.com/sport/athletes-risk-becoming-russian-propaganda-after-ioc-decision-on-paris-games-ukrainian-sportsman-says"}