{"authors": [], "date_download": "2024-10-12 14:16:08", "date_modify": "2024-10-12 14:16:08", "date_publish": "2024-02-02 04:02:59", "description": "More than half of the current starting grid will be out of contract at the end of the 2024 season. Read more at straitstimes.com.", "filename": "sport_formula-one_who-might-replace-hamilton-at-mercedes_1728742568.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/02/FILES-AUTO-PRIX-F1-HAMILTON-FERRARI-192630.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_who-might-replace-hamilton-at-mercedes_1728742568.html", "title": "Who may replace Lewis Hamilton at Mercedes?", "title_page": "Who may replace Lewis Hamilton at Mercedes? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Lewis Hamilton’s move to Ferrari for the 2025 Formula One season, which was confirmed on Feb 1, gives Mercedes plenty of time to look for a suitable candidate to replace the seven-time world champion.\nBut the big question is, who will step into the shoes of the most successful driver of all time?\nMore than half of the current starting grid will be out of contract at the end of the 2024 season, but inevitably some stand out more than others.\nSeveral potential candidates are not even in Formula One at present and look like long shots, but Formula One is never short of surprises.\nThe following looks at the possible options for Mercedes and the questions raised.\nCarlos Sainz, 29\nThe Ferrari driver, whose place would be taken by Hamilton, would be a straight swop.\nThe Spaniard, however, has been considered a top target for Audi, who are taking over Sauber and entering as a works team in 2026.\nHe would be the likely No. 1 there, and Audi have strong connections with his father who won the Dakar Rally in January with them. Would either he or Mercedes be willing to do a deal for just one year or would he be open to a longer one and forgo the opportunity with Audi?\nAlex Albon, 27\nThe former Red Bull driver has been a big hit with Mercedes-powered Williams, scoring all but one of their points last season and hauling them up to seventh overall.\nWilliams are run by James Vowles, who was previously a close confidant of Mercedes team principal Toto Wolff as the German outfit’s head of motorsport strategy.\nA deal for Thailand’s Albon, who is an old friend and rival of Mercedes driver George Russell who also graduated from Williams, would surely be straightforward.\nAndrea Kimi Antonelli, 17\nThe 17-year-old Italian is yet to debut in Formula Two, but he is considered a big talent for the future and already under contract with Mercedes. Inexperience may be an issue. If not ready for the former champions, he might be offered to Williams to get experience.\nMick Schumacher, 24\nMichael Schumacher's son is the official reserve at Mercedes. His seasons with Haas were difficult and the German is on the roster of endurance drivers with Renault-owned Alpine.\nFerrari great Michael raced for Mercedes – his place was taken by Hamilton in 2013 – but Mick is far from potentially reaching the heights of his father’s achievements and looks a long shot compared to other options.\nEsteban Ocon, 27\nA Mercedes-backed junior driver and reserve, Ocon is preparing for his eighth season in Formula One and fifth with Renault/Alpine. The team rated the Frenchman very highly, but he may have slipped down the list of options by now.\nValtteri Bottas, 34\nHamilton's teammate before Russell replaced the Finn, who will be out of contract at Sauber at the end of 2024 and whose place could go to Sainz. He knows all the people at Mercedes, but a return would surely be unlikely.\nFernando Alonso, 42\nThe evergreen two-time world champion is also out of contract at Aston Martin at the end of the season. Despite his age, the Spaniard has shown no sign of wanting to stop and still looking highly competitive.\nSebastian Vettel, 36\nCould Germany’s four-time world champion be persuaded to come out of retirement and make a comeback, just as Schumacher did in 2010? Vettel, at 36, is younger than Hamilton. He did not entirely rule out a return when he left Aston Martin in 2022. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/who-might-replace-hamilton-at-mercedes"}