{"authors": ["David Lee"], "date_download": "2024-10-12 13:43:46", "date_modify": "2024-10-12 13:43:46", "date_publish": "2023-10-08 21:54:25", "description": "The hosts finished top of the medal standings with 201 golds and momentum heading into the Summer Games. Read more at straitstimes.com.", "filename": "sport_china-take-plaudits-after-successful-hangzhou-asian-games-set-sights-on-paris-olympics_1728740626.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/08/2023100818682902img0590.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_china-take-plaudits-after-successful-hangzhou-asian-games-set-sights-on-paris-olympics_1728740626.html", "title": "China take plaudits after successful Hangzhou Asian Games, set sights on Paris Olympics", "title_page": "China take plaudits after successful Hangzhou Asian Games, set sights on Paris Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANGZHOU – With a dazzling array of lights and well-choreographed dance sequences that deserve a gold medal in itself, the Big Lotus – or the Hangzhou Olympic Sports Centre Stadium – bloomed once more to bring the Asian Games to a close on Sunday.\nIn front of 80,000 spectators, including Chinese Premier Li Qiang, the stunning giant virtual torch-bearer which lit the cauldron with Olympic champion swimmer Wang Shun at the opening ceremony returned to witness the flame being extinguished.\nAgain there were no fireworks as Hangzhou 2022 stuck to its green philosophy.\nBut the hosts concluded the Games with a bang, topping the standings with a record 201 golds from 481 events, two more than their 2010 mark achieved in Guangzhou.\nWinning medals in all but one of 32 sports offered at Paris 2024 – surfing was not in this Asiad – will also give China, in their return to staging a major sporting event post-pandemic, a boost heading to the next Olympic Games.\nAs they dominated the pool, and track and field, Chinese swimmers Zhang Yufei (six golds) and Qin Haiyang (five golds), were named the Games’ female and male MVPs respectively.\nWang Chuqin also shone with an unprecedented quadruple of mixed doubles, men’s singles, doubles and team table tennis titles, while 13-year-old Cui Chenxi won the women’s skateboarding gold.\nHowever, there were also disappointments as they dropped the men’s basketball and table tennis women’s doubles gold, failed to make inroads in football, and were surpassed by North Korea as both countries returned to the weightlifting platform.\nA Chinese journalist, who wanted to be known only as Li, said: “Extending its dominance to an 11th straight Games is no longer a surprise or in question.\n“At this level, China tends to do well in sports we have a strong tradition in, and perhaps those sports that do have not such a high participation rate.\n“But what China is chasing now is closing the gap on world powerhouses in the bigger Olympic sports, just as others are trying to catch up with us in other events.\n“We have done well in the pool and gymnastics, but are still a way off in some team sports – football, basketball and volleyball.”\nJapan (52 golds) and South Korea (42) finished second and third, while fourth-placed India had their most successful Asiad with 28 golds and crossed the 100-medal mark for the first time with 107 podium finishes.\nSingapore, led by flag-bearer and marathon swimmer Chantal Liew, had 41 athletes and officials at the closing ceremony.", "url": "https://www.straitstimes.com/sport/china-take-plaudits-after-successful-hangzhou-asian-games-set-sights-on-paris-olympics"}