{"authors": [], "date_download": "2024-10-12 13:43:13", "date_modify": "2024-10-12 13:43:13", "date_publish": "2023-12-27 23:25:20", "description": "A programme of 10 games in 30 days in December has stretched a Newcastle squad beset by injuries. Read more at straitstimes.com.", "filename": "sport_football_eddie-howe-puts-faltering-newcastle-stars-on-notice_1728740593.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/27/2023-12-26T143431Z1473846239UP1EJCQ14HI5WRTRMADP3SOCCER-ENGLAND-NEW-NTG-REPORT.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_eddie-howe-puts-faltering-newcastle-stars-on-notice_1728740593.html", "title": "Eddie Howe puts faltering Newcastle stars on notice", "title_page": "Eddie Howe puts faltering Newcastle stars on notice | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Eddie Howe has warned his Newcastle squad that no-one is assured of a place in the team as he looks to halt a decline in the Magpies’ form.\nNewcastle’s 3-1 loss at home to Nottingham Forest in the Premier League on Dec 26 was their fifth defeat in seven games across all competitions, a run that has included the end of their first Champions League campaign in two decades and the finish of their bid to make a second successive appearance in the League Cup final.\nA programme of 10 games in 30 days in December stretched a Newcastle squad beset by injuries, with Howe hoping to have several players back in action soon, although he is ready to enter the January transfer window.\n“I’ll be prepared to make any change that I think can benefit either the performance or the result and of course players are accountable for what they deliver,” Howe said.\n“No amount of credit in the bank is big enough, you have to earn everything you get from the game. I’m a firm believer in that, so players know they have to perform and we have to change our short-term form for sure.”\nDefeat by Forest ended Newcastle’s run of seven straight Premier League wins at St James’ Park and was made worse by former Magpies’ striker Chris Wood scoring a hat-trick for the visitors.\nIt also came immediately after a 1-0 loss to Luton and cast doubt on Newcastle’s ability to repeat last season’s top-four finish in the Premier League, with tough fixtures against Liverpool, Manchester City and Aston Villa to come either side of an FA Cup trip to local northeast rivals Sunderland.\nBut Howe, who has overseen Newcastle’s rise since taking charge in 2021 and retains the backing of the club’s Saudi owners, explained mental fatigue had taken a toll on his squad.\n“The difficulty for the players that have played the majority of the minutes in recent weeks has been they just haven’t been on the grass,” he said.\n“They have been in between games, of course, resting and then building up for another game three days later, and possibly we’ve suffered from not having that training ground time.\n“That’s the schedule, we knew that that was going to be the case, but I just think that our inability to rotate the team has maybe caught up with us in that respect.” AFP", "url": "https://www.straitstimes.com/sport/football/eddie-howe-puts-faltering-newcastle-stars-on-notice"}