{"authors": ["Deepanraj Ganesan"], "date_download": "2024-10-12 13:43:17", "date_modify": "2024-10-12 13:43:17", "date_publish": "2024-07-13 17:41:05", "description": "Over the last month, fans have been starved of real moments of quality. Read more at straitstimes.com.", "filename": "sport_england-are-one-win-away-from-being-champions-how-awful-has-this-euro-2024-been_1728740597.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/13/2024-07-06T160222Z2034359928UP1EK7618JW9HRTRMADP3SOCCER-EURO-ENG-SWI-REPORT.JPG?VersionId=.t3b9ZqinDAmmsmE_YixYawX5JLmHzyI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_england-are-one-win-away-from-being-champions-how-awful-has-this-euro-2024-been_1728740597.html", "title": "England are one win away from being champions: How awful has this Euro 2024 been?", "title_page": "England are one win away from being champions: How awful has this Euro 2024 been? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Sleepwalking is not often associated with sport, though now it can be used to describe England’s journey to the Euro 2024 final.\nPerhaps it’s a reflection of the wee hours fans here have had to endure, but this tournament has been more of a snoozefest than a thriller.\nAnd now, the uninspiring Three Lions are just one victory away from ending their 58-year heartbreak.\nFootball’s pride is at stake when England and Spain face off at Berlin’s Olympiastadion on July 14.\nEngland – who have relied on penalties or fleeting moments of skill to win – being crowned champions will most certainly damn this tournament as one of the worst in recent history.\nOver the last month, fans have been starved of real moments of quality and – with the exception of Spain – most teams have flattered to deceive and an English triumph will be the final yawn. Standout strikers have been missing with “Own Goal” leading the golden boot race with 10 goals to date.\nTeams have chosen defence and flair has been outlawed. Hyrox may be the latest fitness trend but trying to stay awake during this tournament has been the ultimate endurance test.\nEngland kick-started their campaign with a dire 1-0 win over Serbia before failing to find a way past Denmark and Slovenia, drawing 1-1 and 0-0 respectively. Gareth Southgate’s men then looked set to suffer an embarrassing last-16 exit at the hands of Slovakia before Jude Bellingham’s last-ditch leveller and Harry Kane’s winner in extra time. In the quarter-final, they drew against Switzerland but ultimately progressed after a win in the penalty shoot-out.\nThe semi-final against the Netherlands looked destined for extra time until substitute Ollie Watkins scored at the death.\nWhile the adrenaline rush can be intoxicating, England have had less rhythm than a drunken night out on the dance floor.\nThe same can be said for other top teams like France, defending champions Italy, Croatia, Belgium, and Portugal.\nThere has been plenty of perspiration but few moments of inspiration.\nUnderdogs like Austria and Turkey have delivered some high notes, but if that is what we’re taking away from this tournament, it feels like a one-hit wonder trying to be the headline act of a sold-out concert.\nThe proof is also in the data.\nThere have been 114 goals scored in 50 matches before the final – which works out to 2.28 goals per match​. At Euro 2020, that figure was 2.79. At the Qatar World Cup in 2022, it was 2.69 while Russia 2018 served up 2.64.\nFrance coach Didier Deschamps suggested “changing the channel” if you were not enjoying their games – maybe we should have listened and stayed in bed.\nFans waited for a footballing spectacle, but it never arrived.\nThe tournament has trudged along thanks to breakout stars like Spain’s 17-year-old sensation Lamine Yamal, Turkey’s Arda Guler and England’s Kobbie Mainoo. There were rare moments of brilliance like Jude Bellingham’s stunning overhead kick in the last minute against Slovakia, and Yamal’s long-range goal against France in the semi-finals.\nMost of the best moments have belonged to Spain, whether it is their refreshing attacking approach, Yamal’s brilliance or their dramatic winner in the final minute of extra time against hosts Germany in the quarter-finals. And who can forget Scotland’s Tartan Army and the dancing, leaping Oranje party?\nPerhaps expectations were raised after Qatar and Euro 2024 has not been able to live up to the pre-tournament hype. Maybe this is a cautionary tale about footballers playing too much, with too few breaks.\nThey are weary, and so are we.\nThere is one last lifeline for this lifeless Euro 2024. Spain head into the final with the swagger of a matador, and logic suggests it’s their trophy to lose.\nBut stranger things have happened on the pitch. Terrible teams have beaten far more talented sides and if that happens come Sunday, it will be the most apt finale for one of the more forgettable football tournaments in recent memory.\nVamos, La Roja!", "url": "https://www.straitstimes.com/sport/england-are-one-win-away-from-being-champions-how-awful-has-this-euro-2024-been"}