{"authors": [], "date_download": "2024-10-12 14:09:11", "date_modify": "2024-10-12 14:09:11", "date_publish": "2024-08-12 19:37:56", "description": "While the men won comfortably, the women endured a nail-biting finish to scrape through by a single point. Read more at straitstimes.com.", "filename": "sport_basketball_basketball-double-bill-finale-sets-up-worthy-france-us-rivalry-after-paris_1728742151.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/12/TOPSHOTS-TOPSHOT-BASKETBALL-OLY-PARIS-2024-FRA-USA-221146.jpg?VersionId=MaMUVyyV411xSKkZ2FCoSOM8HFw8HbjY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_basketball-double-bill-finale-sets-up-worthy-france-us-rivalry-after-paris_1728742151.html", "title": "Double-bill basketball finale sets up worthy France-US rivalry after Paris Olympics", "title_page": "Double-bill basketball finale sets up worthy France-US rivalry after Paris Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Defending champions the United States took gold at a memorable Olympics in both the men's and women's basketball competition as top NBA talent thrilled fans at the Games in Paris to create a healthy rivalry with France.\nThe group stage in northern France became a basketball oasis as teams battled for a place in the quarter-finals, with the Pierre Mauroy stadium in Lille packed full of frenzied fans.\nSouth Sudan and Nigeria demonstrated the skills of the African continent, while Latin America was represented by Brazil and Puerto Rico and Asia by Japan and China.\nThe real battle, however, began at the Bercy Arena in Paris, where France fought hard to deny the USA further glory.\nThe U.S. men's team showed their superiority with victory over Brazil in the last eight only to have a tough time getting past three-time NBA Most Valuable Player Nikola Jokic's Serbia, needing a stirring fourth-quarter rally to tame their feisty rivals.\nVictor Wembanyama, the first French player to be selected number one overall in the NBA draft, was a major factor in the hosts' path to the final, defeating Canada and Germany.\nMeanwhile in the women's race, France reached the semi-finals after a convincing win over Germany, with Marine Johannes and Gabby Williams shining as they then beat Belgium.\nThe U.S. women faced stiff resistance from Nigeria, who became the first African team to reach the quarter-finals, and then rallied with a brilliant performance from Breanna Stewart to beat Australia in the semis.\nThe stage was set for a blockbuster double-header, with the United States taking on a determined France in two nail-biting finals.\nThe American women scraped a 67-66 win over France in the final to claim a historic eighth consecutive Olympic crown, with Diana Taurasi earning her sixth Olympic gold.\nA day earlier, the U.S. men's team lived up to expectations by beating France 98-87, led by an on-fire LeBron James and a superb performance from Stephen Curry, who hit four three-pointers in the closing minutes to secure their fifth consecutive gold medal.\nThe Paris Games may have been a challenge for the American greats, but they proved their mettle and remain the hot ticket for gold in Los Angeles. REUTERS", "url": "https://www.straitstimes.com/sport/basketball/basketball-double-bill-finale-sets-up-worthy-france-us-rivalry-after-paris"}