{"authors": [], "date_download": "2024-10-12 13:42:16", "date_modify": "2024-10-12 13:42:16", "date_publish": "2024-02-10 01:15:34", "description": "Manchester City can provisionally return to the top of the table with a home win over Everton. Read more at straitstimes.com.", "filename": "sport_football_citys-guardiola-says-no-point-looking-at-table-until-schedule-evens-out_1728740536.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/10/2024-02-05T202436Z1750065561UP1EK251KOYCVRTRMADP3SOCCER-ENGLAND-BRE-MCI-REPORT.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_citys-guardiola-says-no-point-looking-at-table-until-schedule-evens-out_1728740536.html", "title": "Man City's Guardiola says no point looking at table until schedule evens out", "title_page": "Man City's Guardiola says no point looking at table until schedule evens out | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANCHESTER, England - Manchester City can provisionally return to the top of the table with a home win over Everton in the early Premier League match on Feb 10, although manager Pep Guardiola said he preferred to see where his team stood once the schedule evened out.\nThe champions are second on 49 points and will climb above leaders Liverpool, who have 51, for a few hours at least with a victory. City have played 22 matches and have a game in hand of Liverpool, who welcome Burnley later on Feb 10.\nAsked what it would mean to be leaders, Guardiola told reporters on Feb 9: \"I will answer this after the Brentford game in 11 days', then it will be same games for everyone.\"\nCity's Norway striker Erling Haaland, the league's joint top scorer with Liverpool's Mohamed Salah on 14, and Belgium midfielder Kevin De Bruyne started their first game together this season in a Feb 5 3-1 win at Brentford.\nHamstring surgery sidelined De Bruyne for five months, while Haaland missed almost two months with a broken bone in his foot.\nGuardiola scoffed when asked about the impact of having both players back at his disposal.\n\"When one player scores 60 goals it helps you to win games. When you have a player with a thousand million assists and goals it helps you win games,\" the Spaniard said tersely. \"You don't have to study at Harvard or Yale to understand that.\"\nFinancial regulations\nThe Feb 10 game comes on the heels of Everton boss Sean Dyche complaining about how his club have been punished for breaching the Premier League's Profitability and Sustainability Rules before charges against City have been ruled on.\nEverton were docked 10 points in November, a decision they are appealing. City face 115 charges for alleged breaches of financial regulations and the Premier League has said the complexity of the case has led to a longer investigation.\nCity have denied any wrongdoing.\n\"I know my opinion about that,\" Guardiola said, when asked about Dyche's comments. \"I spoke many times. I don't have anything else to add. We will wait.\"\nDyche had been asked on Feb 8 about the difference in timing between the Everton and City cases.\n\"Just like everyone else, we are all wondering what makes one rule for one and one rule for the other,\" Dyche told reporters. \"The people in the street are asking that: Why is it particularly Everton?\"\nDyche, who will be serving a touchline ban on Feb 10, can celebrate taking charge of his 300th Premier League game.\n\"I have huge respect for Sean and the work he does in his career and the players he has at his disposal,\" Guardiola said.\nGuardiola has never lost a game against a team managed by Dyche, winning 16 of the 17 matches contested. REUTERS", "url": "https://www.straitstimes.com/sport/football/citys-guardiola-says-no-point-looking-at-table-until-schedule-evens-out"}