{"authors": [], "date_download": "2024-10-12 13:41:27", "date_modify": "2024-10-12 13:41:27", "date_publish": "2024-04-25 05:07:52", "description": "Jarrad Branthwaite and Dominic Calvert-Lewin score, in a pulsating 2-0 home victory over the Reds. Read more at straitstimes.com.", "filename": "sport_football_everton-deal-liverpool-big-blow-with-shock-2-0-derby-victory_1728740487.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/25/2024-04-24T210720Z1546536185UP1EK4O1KMRECRTRMADP3SOCCER-ENGLAND-EVE-LIV-REPORT.JPG?VersionId=vYbCwHEkSz9BfZBd5nDXswX.N14AvV6A", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_everton-deal-liverpool-big-blow-with-shock-2-0-derby-victory_1728740487.html", "title": "Everton deal Liverpool big blow with shock 2-0 derby victory", "title_page": "Everton deal Liverpool big blow with shock 2-0 derby victory | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LIVERPOOL, England - Everton's Jarrad Branthwaite and Dominic Calvert-Lewin scored in a pulsating 2-0 home victory over Liverpool in the Merseyside derby on April 24 that could prove to be the death of the visitors' withering Premier League title hopes.\nEverton's first derby victory at Goodison Park in more than 13 years prevented Liverpool from climbing level with Arsenal at the top of the league table.\nJuergen Klopp's men are three points behind the Gunners (77) with four games to play.\nHolders Manchester City remain in the driver's seat on 73 points but with two games in hand. Everton's victory has them breathing easier, eight points above the relegation zone in 16th.\nBranthwaite had the old stadium shaking in the 27th minute when he capitalised on poor defending from Liverpool, slotting home from close range after the Reds missed several attempts to clear the ball.\nCalvert-Lewin leapt to head home from a corner kick to double the Toffees' lead in the 58th minute, and while Liverpool have mounted some masterful comebacks this season, Everton held strong to hand Klopp, who is leaving Liverpool at the season's end, his first defeat at Goodison in his final derby. REUTERS", "url": "https://www.straitstimes.com/sport/football/everton-deal-liverpool-big-blow-with-shock-2-0-derby-victory"}