{"authors": [], "date_download": "2024-10-12 14:02:59", "date_modify": "2024-10-12 14:02:59", "date_publish": "2024-09-11 05:02:51", "description": "DUBLIN - Greece's Fotis Ioannidis scored his third goal in two games to help them make a perfect start to their Nations League campaign with a comfortable 2-0 win away to toothless Ireland on Tuesday. Read more at straitstimes.com.", "filename": "sport_football_greeces-ioannidis-and-tzolis-secure-2-0-victory-in-ireland_1728741779.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/LYNXMPEK890SB-1.jpg?VersionId=5vpTSmvfUE.P7AGgadqrulWuD6TAEmpI", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_greeces-ioannidis-and-tzolis-secure-2-0-victory-in-ireland_1728741779.html", "title": "Greece's Ioannidis and Tzolis secure 2-0 victory in Ireland", "title_page": "Greece's Ioannidis and Tzolis secure 2-0 victory in Ireland | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUBLIN - Greece's Fotis Ioannidis scored his third goal in two games to help them make a perfect start to their Nations League campaign with a comfortable 2-0 win away to toothless Ireland on Tuesday.\nChristos Tzolis added a late second with a fine run and finish as Group B2 leaders Greece took six points from their opening two matches. It was Ireland's second defeat.\nThe visitors led after 50 minutes when Ioannidis was given far too much time and space to pick his spot from 25 metres and brilliantly curled the ball into the back of the net.\nHe scored twice in the 3-0 home win over Finland on Saturday, which should have been a warning for Ireland but one that was not heeded.\nThe points were safe when Tzolis used his pace to get behind the Ireland defence three minutes from time and showed composure in the box before drilling the ball low into the net.\nIreland winger Chiedozie Ogbene had netted a superb strike from 25 metres four minutes before halftime but was offside in the build-up.\nIreland travel to Finland and Greece for their next two games in October, while the latter also play England, who are in second place also with six points, at Wembley. REUTERS", "url": "https://www.straitstimes.com/sport/football/greeces-ioannidis-and-tzolis-secure-2-0-victory-in-ireland"}