{"authors": [], "date_download": "2024-10-12 13:42:38", "date_modify": "2024-10-12 13:42:38", "date_publish": "2024-06-25 03:32:18", "description": "FREIBURG, Germany - Belgium fullback Thomas Meunier became the last player to arrive at the European Championship in Germany on Monday – some 10 days after the tournament kicked off. Read more at straitstimes.com.", "filename": "sport_football_belgiums-meunier-makes-belated-arrival-at-euro-2024_1728740558.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/25/LYNXMPEK5N0PR-1.jpg?VersionId=qCISER6LM4YcXvIrufv7CnnudyGVfydi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_belgiums-meunier-makes-belated-arrival-at-euro-2024_1728740558.html", "title": "Belgium's Meunier makes belated arrival at Euro 2024", "title_page": "Belgium's Meunier makes belated arrival at Euro 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "FREIBURG, Germany - Belgium fullback Thomas Meunier became the last player to arrive at the European Championship in Germany on Monday – some 10 days after the tournament kicked off.\nMeunier, 32, joined up with the rest of the squad at their base in Freiburg after treatment on a hamstring strain he suffered just days before the finals kicked off playing for Belgium in a warm-up friendly against neighbours Luxembourg.\nHe had remained behind in Antwerp for treatment and missed the team's opening two matches. Meunier will likely also miss their third when they conclude their Group F fixtures against Ukraine on Wednesday in Stuttgart.\nThe Belgians will clinch a place in the last 16 if they avoid defeat, while Ukraine need a win to guarantee progress.\nBelgium coach Domenico Tedesco took a gamble on the right back being available, previously saying: “I didn't want to drop Thomas for this tournament. You not only have Meunier the footballer, you also have Meunier the human being.\n“He has made so many sacrifices to reach this European Championship. He went to play football in Turkey specifically to get playing minutes under his belt. That shows motivation.”\nDefensive midfielder Axel Witsel, who came out of international retirement to play in the tournament, missed training again on Monday as he struggles with a groin injury. REUTERS", "url": "https://www.straitstimes.com/sport/football/belgiums-meunier-makes-belated-arrival-at-euro-2024"}