{"authors": [], "date_download": "2024-10-12 14:03:42", "date_modify": "2024-10-12 14:03:42", "date_publish": "2024-05-16 22:40:02", "description": "In an earlier quarter-final on May 15, Alexander Zverev suffered a nasty fall before rallying to beat Taylor Fritz 6-4, 6-3. Read more at straitstimes.com.", "filename": "sport_tennis_tommy-paul-downs-hubert-hurkacz-to-make-italian-open-semi-finals_1728741822.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/16/TENNIS-ITA-OPEN-2024-114843.jpg?VersionId=1plGBWVrVjHZlCLWsRl3w_Bgz.RMhmVg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_tommy-paul-downs-hubert-hurkacz-to-make-italian-open-semi-finals_1728741822.html", "title": "Tommy Paul downs Hubert Hurkacz to make Italian Open semi-finals", "title_page": "Tommy Paul downs Hubert Hurkacz to make Italian Open semi-finals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME – When things got a little topsy-turvy at the Italian Open quarter-finals on May 16, Tommy Paul told himself that he had to up the “intensity” to win.\nThe American did just that, booking a last-four spot in Rome after battling through a see-saw encounter with Poland’s Hubert Hurkacz in a match that featured 13 breaks of serve.\nThe 14th-seeded Paul won 7-5, 3-6, 6-3 and reached his first ATP Masters 1000 semi-final on clay.\n“I started off pretty well, but things got away from me in the second set and beginning of the third,” said the 26-year-old, who clinched his 150th win of his tour career.\n“I just had to stick around. I started looking for my forehand, hitting my forehand bigger and playing with a little more intensity. That was probably the key for me in the end.”\nPaul trailed 2-0 early in the third set before he then got in his groove to bounce back.\nThe world No. 16 fended off six break points from Hurkacz, but failed to convert three match points of his own.\nOn his fourth, however, his Polish opponent hit a forehand long and Paul could finally celebrate.\nHe has now won back-to-back matches against top-10 opponents (world No. 4 Daniil Medvedev in the last 16 and No. 9 Hurkacz) for the first time in his career.\nPaul takes on the winner of the clash between Stefanos Tsitsipas, the sixth seed, and 21st seed Nicolas Jarry in the semi-finals – the result of that match was unavailable at press time.\nHe is also aiming to become the first American finalist in Rome since Andre Agassi in 2002.\nIn an earlier quarter-final on May 15, Alexander Zverev suffered a nasty fall before rallying to beat Taylor Fritz 6-4, 6-3.\nThe third-seeded German fell on his stomach and suffered cuts to his wrist and finger after hitting a backhand return to his American opponent in the third game.\nHe was treated on court before play resumed after a short delay and he returned to attack Fritz’s serve, converting three of his five break-point chances and hitting 20 winners en route to victory.\n“I still have a little bit of pain, so once the adrenaline settles I’m going to check out tomorrow what it is. But definitely happy with the win,” said Zverev.\n“Taylor has been one of the best players on clay this year. To have a win like that is great for me, especially after the fall.”\nHe will meet 29th seed Alejandro Tabilo in the last four, after the Chilean beat China’s Zhang Zhizhen 6-3, 6-4.\nIn the women’s draw, Iga Swiatek advanced to the final after overcoming Coco Gauff 6-4, 6-3.\nThe Polish world No. 1 will face the winner of the other semi-final between Danielle Collins and Aryna Sabalenka. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/tommy-paul-downs-hubert-hurkacz-to-make-italian-open-semi-finals"}