{"authors": [], "date_download": "2024-10-12 14:12:31", "date_modify": "2024-10-12 14:12:31", "date_publish": "2024-08-09 13:58:34", "description": "Kim Ye-ji gained global fame for her confidence and style during the Paris Games. Read more at straitstimes.com.", "filename": "sport_south-korea-olympic-shooter-treated-in-hospital-after-fainting_1728742351.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/09/wgt-KIMYEJISHOOTER-090824.jpg?VersionId=CtKF69FPEm31XlVKwz88g8CRNJ5rXOos", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_south-korea-olympic-shooter-treated-in-hospital-after-fainting_1728742351.html", "title": "South Korea Olympic shooter treated in hospital after fainting", "title_page": "South Korea Olympic shooter treated in hospital after fainting | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL – South Korean pistol shooter Kim Ye-ji, who gained global fame for her confidence and style during the Paris Olympics, was taken to a hospital after fainting during a press conference, officials said Aug 9.\nThe 31-year-old won silver in the women’s 10-metre air pistol event in Paris last week, and her ultra-calm demeanour, combined with her wire-rimmed shooting glasses and baseball cap, made her a worldwide online sensation – drawing praise from celebrities such as X owner Elon Musk.\nThe star shooter suddenly collapsed while speaking to reporters in a southern town on Friday and was sent to hospital, local officials said.\nA spokesman for Imsil County told AFP that Kim had “recovered” after the incident and has since been transferred to a general hospital in Jeonju, approximately 29 kilometres north of Imsil.\n“We have been informed by emergency aid workers that she does not require serious treatment,” the spokesman said.\nAnother official said she would undergo a medical check up.\nHer coach, Kwak Min-su, told local reporters that Kim had no underlying health issues and had been dealing with “accumulated fatigue” along with a very hectic schedule since mid-July.\nSince her silver-medal win, a short clip showing Kim – which in fact shows her at the Baku World Cup in May, not Paris – has gone viral, spawning fan art as well as multiple edits setting the clip to K-pop music, and endless memes, including some discussing her unique “aura”.\nDespite being a strong favourite for gold in the 25-metre event, an error during the qualifying round – failing to take her shot within the required three-second window and scoring zero – prevented her from advancing to the finals.\nShe has since apologised for making a “big mistake” and “disappointing” her fans. AFP", "url": "https://www.straitstimes.com/sport/south-korea-olympic-shooter-treated-in-hospital-after-fainting"}