{"authors": [], "date_download": "2024-10-12 13:44:30", "date_modify": "2024-10-12 13:44:30", "date_publish": "2023-10-04 13:24:03", "description": "The IOC’s ethics commission said that the IOC should not recognise Sheikh Talal’s appointment as OCA chief for now. Read more at straitstimes.com.", "filename": "sport_olympics-sheikh-ahmad-brother-file-cases-against-ioc-at-cas-over-election_1728740670.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/04/btsheikh20231004.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_olympics-sheikh-ahmad-brother-file-cases-against-ioc-at-cas-over-election_1728740670.html", "title": "Sheikh Ahmad and brother file cases against IOC at CAS over election", "title_page": "Sheikh Ahmad and brother file cases against IOC at CAS over election | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANGZHOU – Kuwait’s Sheikh Ahmad Al-Fahad Al-Sabah has lodged a case against the International Olympic Committee (IOC) at the Court of Arbitration for Sport (CAS), following his ban for “influencing” the election of his brother to a key Olympic post.\nSheikh Ahmad was banned from the IOC for three years in July after the organisation found that he had an “undeniable impact” on Olympic Council of Asia (OCA) elections in which his brother, Sheikh Talal Al-Fahad Al-Sabah, was appointed president.\nThe IOC’s ethics commission said that the IOC should not recognise Sheikh Talal’s appointment until a full review of the OCA elections process was carried out.\nIn the meantime, CAS confirmed that both Sheikh Ahmad and Sheikh Talal had filed separate cases against the IOC at the Switzerland-based court.\nSheikh Ahmad, a former OCA president, travelled to Bangkok ahead of the OCA election in July and was in the city when it took place, which was “interpreted as interference in the election process” by the IOC’s ethics commission.\nHe has denied any wrongdoing.\nSheikh Talal was due to take over from India’s Randhir Singh, who was appointed acting president of the OCA in 2021 when Sheikh Ahmad stepped down after being convicted by a Swiss criminal court of forgery.\nSheikh Ahmad denied all the charges in the case and appealed against the conviction.\nHe is awaiting the outcome of the appeal.\n“Following the IOC executive board decision of July 27, 2023 in relation to the provisional suspension of the IOC member in Kuwait, Sheikh Ahmad... and in particular the point relating to not recognising the OCA’s elections of July 8, 2023 until a full review of these elections by the IOC,” an IOC spokesperson said.\n“The IOC will continue to work with the acting OCA president, Mr Randhir Singh, and OCA executive board that was in place prior to the Bangkok elections.\n“We will not comment further during the ongoing review.”\nSingh remains acting head of the OCA after being asked to stay in the role by the IOC following the election decision.\nThe OCA declined to comment on the CAS cases and has not responded to requests for updates on the review of its presidential election.\nThe Asian body was created by Sheikh Ahmad’s father in 1981 and organises the Asian Games, which are usually held every four years. The 19th edition started in Hangzhou, China on Sept 23 and runs to Sunday. REUTERS", "url": "https://www.straitstimes.com/sport/olympics-sheikh-ahmad-brother-file-cases-against-ioc-at-cas-over-election"}