{"authors": ["David Lee"], "date_download": "2024-10-12 13:40:37", "date_modify": "2024-10-12 13:40:37", "date_publish": "2024-09-02 17:17:08", "description": "'I’m proud of this achievement. I was nervous but overall this was a good experience for me.' Read more at straitstimes.com.", "filename": "sport_singapore-s-jeralyn-tan-clinches-historic-paralympic-silver-medal-in-boccia_1728740437.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/202409022024PGBOCCIAJERALYN20TAN20YEE20TINGCREDITSNPCGOH20SI20WEI-25.jpg?VersionId=TiiaP93kE3SolurVLJEmWgHG3X_IxfuQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-s-jeralyn-tan-clinches-historic-paralympic-silver-medal-in-boccia_1728740437.html", "title": "After boccia silver, Singapore’s Jeralyn Tan ‘going for gold’ at 2028 Paralympics", "title_page": "After boccia silver, Singapore’s Jeralyn Tan ‘going for gold’ at 2028 Paralympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – With a historic Paralympic gold on the line, nerves took hold of boccia player Jeralyn Tan on Sept 2, when she ran a 5-0 deficit halfway through her women’s individual BC1 final against Frenchwoman Aurelie Aubert.\nThe Singaporean, 35, rallied bravely at the South Paris Arena 1 and almost forced a tiebreak. But she eventually lost 5-4 in a tearful and thrilling encounter that kept spectators in Paris and back home on the edge of their seats.\nStill, there were happy tears at the end for Tan, who claimed a historic Paralympic silver in the sport. In doing so, she became the Republic’s fourth Paralympic medallist after swimmers Yip Pin Xiu and Theresa Goh, and equestrienne Laurentia Tan.\nTan said: “I’m proud of this achievement. I was nervous but overall this was a good experience for me. Learning from the mistakes will only make me a stronger player.”\nYip won two golds at these Games, taking her tally to seven, while Laurentia will compete alongside teammates Gemma Foo and Hilary Su from Sept 3.\nSwimmer Toh Wei Soong also kicks off his Paris campaign in the 100m backstroke S7 heats on the same day.\nBoccia means “to bowl” in Italian. The aim of the game, played by wheelchair-using athletes with motor-skill impairment, is to bowl balls as close as possible to a white target ball known as the jack.\nAt the end of each of the four rounds for individual matches, the player whose ball is closest to the jack scores one point. He or she receives an additional point for every ball that sits nearer to the jack than the opponent’s closest ball.\nTan, who has cerebral palsy, has been in superb form at these Paralympics – she beat Aubert in the preliminary round, Brazil’s world No. 1 Andreza Oliveira in the quarter-finals and then Japan’s Hiromi Endo to reach the final.\nBut she made a shaky start to the final as the home favourite had a great first throw to put her opponent under pressure.\nThe Singaporean could not get any closer to the jack, allowing Aubert to take a 2-0 lead using just five balls. Despite a poor first throw in the second round, the Frenchwoman managed to extend her lead to 5-0.\nWith her back against the wall, world No. 2 Tan managed to regroup by holding hands with her coach Yurnita Omar. After regaining her composure, she adopted a more aggressive approach in the third round to claw back to 5-3, tearing up as she set up a grandstand finish.\nAs the crowd reached fever pitch with cheers of “Jeralyn jiayou” and “allez Aurelie”, drama ensued as the latter miscounted and decided to give up her last three balls, thinking that her opponent had completed her six throws for just one point.\nTearing up when she realised her mistake – Tan had one more ball to play – Aubert then broke into a bright grin when her opponent’s throw was deflected wide.\nAubert, 27, who also won her nation’s first Paralympic boccia medal, said: “I’m feeling too many emotions right now to make sense of any of them. The support I had from the crowd today was unbelievable.\n“I was in tears after the match when I saw them all clap, sing and wave the French flags with such joy.”\nAdmitting the occasion and raucous home support got to her, Tan said: “I hope to take back some of the different strategies I learnt here for future play, and we will continue to work on my nerves and mental conditioning to ensure it affects me less.\n“As a Games debutante, I’m happy with my overall performance, and we will definitely be going for gold in 2028. I hope Singaporeans can be more aware of boccia as a sport and this win can help shine light on para-sports in Singapore.”\nYurnita, who has coached Tan since 2016, hailed the athlete for her work ethic – beyond training five days a week, they also had a two-week stint with the South Korea national team in Incheon in June.\nShe said: “Being able to achieve this medal has been a long and hardworking journey for Jeralyn. I am very proud to have achieved this on her debut at the Paralympics.\n“Being able to win this medal is a great opportunity but the learnings we had here will help us improve and come back stronger. We will celebrate this win with our families and the boccia community in Singapore.”\nTan’s silver will see her collect $300,000 as part of the Singapore National Paralympic Council’s Athletes Achievement Awards scheme.\nIn 2022, the cash incentive for a Paralympic silver medal was raised from $200,000 to $300,000 for the Paris Games.", "url": "https://www.straitstimes.com/sport/singapore-s-jeralyn-tan-clinches-historic-paralympic-silver-medal-in-boccia"}