{"authors": [], "date_download": "2024-10-12 14:13:30", "date_modify": "2024-10-12 14:13:30", "date_publish": "2024-07-17 18:29:00", "description": "Triathletes and marathon swimmers will be swimming at the Seine for their events. Read more at straitstimes.com.", "filename": "sport_paris-mayor-swims-in-seine-to-show-it-s-safe-for-olympic-races_1728742410.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/oembed_thumbnails/36Ioi2r4ubneITR3aOOo2XeJbd-WtCL-fg1dGl3aa8o.jpg?VersionId=KyQETVtrRtnzmggFMtuGudT39kvsx94D", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_paris-mayor-swims-in-seine-to-show-it-s-safe-for-olympic-races_1728742410.html", "title": "Paris mayor swims in Seine to show it’s safe for Olympic races", "title_page": "Paris mayor swims in Seine to show it’s safe for Olympic races | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Paris Mayor Anne Hidalgo finally swam in the Seine early on July 17, seeking to show that the river was clean and ready for the 2024 Olympic and Paralympic Games that kick off later in July.\nMs Hidalgo took the plunge at around 10am local time on a glorious summer’s day in Paris, with visitors crowding on nearby bridges to catch a glimpse of her after several postponements due to heavy rain and doubts about water quality.\nMs Hidalgo, clad in a wetsuit and goggles, was joined in the Seine by Mr Tony Estanguet, head of the Paris Olympics Organising Committee, among others.\nAt first she paddled and then swam front crawl with her face in the water.\n“We have worked very, very hard, and then you go down into the water and it seems natural,” Ms Hidalgo said after the swim. “The water is very, very good, a little bit cool.”\nThe triathlon and marathon swimming legs of the Olympics, which run from July 26 to Aug 11, are due to be held in the Seine.\n“We will allow Olympic events to take place, and allow people to swim after. But, in cleaning the river, we also avoid trashing the ocean,” said Ms Hidalgo. “We have to adapt our cities to climate change and rivers are part of it.”\nFrance has earmarked €1.4 billion (S$2 billion) for the river’s clean-up amid lingering concerns that the overflows from the city’s sewage system bring waste waters and their bacteria into the Seine, making it unswimmable.\nAccording to the most recent July 12 Seine water quality bulletin, based on the Eau de Paris water analysis, the water quality would be suitable for swimming in six out of seven days at the Olympics swimming sites.\nDecisions on whether to run Olympics events will be taken the night before, and early that same morning, with a technical committee, including athletes, international federation, regional authorities and Meteo France making the call.\n“The first athletes are arriving tomorrow, and so this is a very important message that, finally, the Seine is swimmable, and the triathlon and swimming events can be held here,” Mr Estanguet said.\nParis has been working on cleaning up the Seine so that people can swim in it again, as was the case during the 1900 Paris Olympics.\nFormer Paris mayor Jacques Chirac in 1988 promised he would swim in the Seine “in the presence of witnesses”, but his plunge never materialised.\nThe city has built a huge storage basin capable of holding 46,000 cu m of waste water before it flows through a tunnel to a treatment plant. When the water meets the required health criteria, it will then be poured into the Seine.\nIf the river is not deemed to be suitable, organisers have contingency plans: The marathon swimming event will take place at Vaires-sur-Marne, where the rowing and canoeing events are held, and the triathlon will be turned into a duathlon.\nMs Jenn Fluet, a 21-year-old tourist visiting from New York, said Ms Hidalgo was brave. Asked if she would follow suit, Ms Fluet said: “Hell no! It’s dirty.”\nMr Quentin Mazars, a 33-year-old swimming club member who joined Ms Hidalgo in the Seine, said he “was careful not to swallow any water”.\nMr Pierre Suzeau, a 66-year-old member of an outdoor swimming group, emerged from his dip energised.\n“We are very happy to finally see swimming in an urban environment become a reality,” he said. “We hope that the Seine and the canals will soon all be swimmable.”\nFrench Sports Minister Amélie Oudéa-Castéra already took a swim in the river on July 13.\nGetting the river cleaned for the races and for the French capital’s residents once the games are over is something of a heritage project for France.\nThe gigantic undertaking, which effectively puts an end to a century-old ban on swimming in the Seine, has drawn attention from across the globe.\nAnnounced as part of the city’s bid to host the Games, the project’s challenges mirror those faced by large metropolises like London and Sydney that sit on a body of water they cannot always fully capitalise on. REUTERS, BLOOMBERG", "url": "https://www.straitstimes.com/sport/paris-mayor-swims-in-seine-to-show-it-s-safe-for-olympic-races"}