{"authors": [], "date_download": "2024-10-12 13:41:54", "date_modify": "2024-10-12 13:41:54", "date_publish": "2024-03-31 01:16:20", "description": "BOURNEMOUTH, England - Everton defender Seamus Coleman's stoppage-time own goal handed his side a 2-1 Premier League loss at Bournemouth on Saturday, deepening the woes of the relegation-threatened Merseysiders. Read more at straitstimes.com.", "filename": "sport_football_coleman-own-goal-condemns-everton-to-defeat-at-bournemouth_1728740514.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/31/LYNXNPEK2T04S-1.jpg?VersionId=jMVeDefBJzHsV4iOszDqm0nzQgMhBDa6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_coleman-own-goal-condemns-everton-to-defeat-at-bournemouth_1728740514.html", "title": "Coleman own goal condemns Everton to defeat at Bournemouth", "title_page": "Coleman own goal condemns Everton to defeat at Bournemouth | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BOURNEMOUTH, England - Everton defender Seamus Coleman's stoppage-time own goal handed his side a 2-1 Premier League loss at Bournemouth on Saturday, deepening the woes of the relegation-threatened Merseysiders.\nEverton's defeat leaves them in 16th place on 25 points, three above Nottingham Forest, who drew, and Luton Town, who lost and are in the drop zone. The Toffees have a game in hand. Bournemouth are 13th in the table on 38 points.\nHaving had a 10-point deduction for financial irregularities cut to six, Everton arrived on the south coast under the cloud of another charge and they struggled to create opportunities in a scoreless first half.\nThe visitors went close from a cleverly-worked corner in the 59th minute as the Bournemouth defence switched off, allowing Dwight McNeil to cut down the right and fire in a cross that struck the near post before being cleared.\nEverton held out until the 64th minute when Bournemouth substitute Lloyd Kelly, who had joined the fray a minute earlier, crossed for Dominic Solanke to rise between two defenders and score the opener with a superb cushioned header.\nThat put Solanke level with Joshua King on a record 16 league goals in a single season for the Cherries and it looked set to be the winner until a dreadful error by Bournemouth goalkeeper Neto.\nAn innocuous cross in the 87th minute looked like it would be simple to deal with but the Brazilian dropped the ball into the path of Everton substitute Beto, who fired home to trigger wild celebrations among the away fans.\nFour minutes later, however, Everton were plunged into crisis again as Coleman was fooled by a bouncing ball in the box, chesting it into his own net to condemn the Toffees to their third defeat in a row.\nFellow strugglers Forest drew 1-1 at home to Crystal Palace, while Luton lost 2-1 at Tottenham Hotspur, but the nature of Everton's defeat - their 12th league game in a row without a win - meant it was cold comfort.\n\"As a team we are always trying to create our own luck but we have been a bit unfortunate and today there were parts of the game we need to improve on,\" Everton winger Jack Harrison said.\nBournemouth's Solanke, meanwhile, sent out a warning to Premier League defences, saying he's targeting even more goals.\n\"I go into every game looking to score and I get a bit disappointed when I don't. I've set small targets, 20 is the next target I'd like to hit,\" he told Sky Sports. REUTERS", "url": "https://www.straitstimes.com/sport/football/coleman-own-goal-condemns-everton-to-defeat-at-bournemouth"}