{"authors": ["Nicole Chia"], "date_download": "2024-10-12 14:21:02", "date_modify": "2024-10-12 14:21:02", "date_publish": "2020-06-06 18:35:42", "description": "SINGAPORE - Whenever Elfred Ang found certain exercises difficult to do, the nine-year-old, who is hearing-impaired and autistic, used to simply give up and move on to another activity. Read more at straitstimes.com.", "filename": "sport_playbuddy-programme-for-children-with-disability-moves-online_1728742862.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/06/06/rk_playbuddy_060620.jpg?VersionId=u3qsZfzELL5fnEh5_RpKb2fzJIn3PzcP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_playbuddy-programme-for-children-with-disability-moves-online_1728742862.html", "title": "PlayBuddy programme for children with disability moves online", "title_page": "PlayBuddy programme for children with disability moves online | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Whenever Elfred Ang found certain exercises difficult to do, the nine-year-old, who is hearing-impaired and autistic, used to simply give up and move on to another activity.\nBut after he joined the PlayBuddy programme for children with disabilities to meet and play sport every Saturday morning, the group setting has helped in building resilience, observed his mother Jocelyn Tan.\nEven though the course is now online and conducted via Zoom due to the coronavirus pandemic, Tan feels the weekly sessions still benefit her son.\nElfred is the newest addition to the group, and had only attended three sessions since joining in March before the activities were stopped for about a month as circuit breaker measures were introduced.\nTan, a homemaker, said: \"Before, when I asked him to do exercises like running on the spot, he would walk a few steps then go to the room and take out his toys and ignore me. With this Saturday morning routine now, he knows all of (the other children in the programme) are there and the session isn't over, so he has to continue and can't give up.\n\"Even for the online sessions he may have some small issues following the exercises, but he copes well because he can see the others on screen still doing the workout, so he knows he has to keep going.\"\nThe idea of moving PlayBuddy online came after a parent suggested a group meeting via Zoom to catch up with one another, said Shanice Chia, one of the project's lead volunteers.\nSaturday (June 6) was the seventh week of online workouts. These sessions comprise low-impact interval training, during which household items like towels are sometimes used as equipment.\nThe free, volunteer-based programme was started by Dr Teoh Chin Sim, who has been Singapore's chief medical officer at several major sports competitions, including the 2012 London Paralympics and last year's SEA Games.\nEach online session, which lasts one hour, has between 11 and 15 children aged from three to 14 participating, together with their parents or caregivers and PlayBuddy volunteers.\nDr Teoh, director and senior consultant at Khoo Teck Puat Hospital's Sports Medicine Centre, said one challenge was designing a curriculum with exercises that children with varied abilities can follow.\n\"We have to give instructions to two or three different groups of children within the same setting, so we brief the parents at the beginning,\" she added.\n\"We want them to continue to be active and have something to look forward to every Saturday.\"\nA further hurdle, Chia pointed out, was the lack of physical interaction, which makes it more difficult to maintain the children's attention through a screen.\nShe and another volunteer, Andy Loe, usually take turns leading the sessions while the other monitors the children.\nChia, a 36-year-old primary school teacher, added: \"Some children need sensory engagement, so we just keep encouraging them and giving the parents tips on what to do.\n\"We'll also encourage them by calling out their names.\"\nFor 13-year-old Tan Shu Wei, seeing familiar faces on screen and having the volunteers engage with her is one of the highlights of these sessions.", "url": "https://www.straitstimes.com/sport/playbuddy-programme-for-children-with-disability-moves-online"}