{"authors": [], "date_download": "2024-10-12 14:15:52", "date_modify": "2024-10-12 14:15:52", "date_publish": "2024-02-02 03:12:52", "description": "Hamilton is set to replace Spanish driver Carlos Sainz at Ferrari alongside Charles Leclerc. Read more at straitstimes.com.", "filename": "sport_formula-one_hamilton-to-leave-mercedes-at-end-of-2024-f1-season_1728742552.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/02/11118609.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_hamilton-to-leave-mercedes-at-end-of-2024-f1-season_1728742552.html", "title": "Lewis Hamilton leaving Mercedes for Ferrari in 2025", "title_page": "Lewis Hamilton leaving Mercedes for Ferrari in 2025 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Seven-times world champion Lewis Hamilton, Formula One’s most successful driver of all time, will race for Ferrari from 2025 after activating a release option in the Mercedes contract he signed in August.\nThe bombshell news, confirmed first by Mercedes and then in a one-line statement from Ferrari, came after a day of mounting speculation with the world awaiting news from Maranello and Brackley.\n“Scuderia Ferrari is pleased to announce that Lewis Hamilton will be joining the team in 2025, on a multi-year contract,” Ferrari said.\n“I have had an amazing 11 years with this team and I’m so proud of what we have achieved together. Mercedes has been part of my life since I was 13 years old,” said Hamilton, in the Mercedes statement.\n“It’s a place where I have grown up, so making the decision to leave was one of the hardest decisions I have ever had to make.\n“But the time is right for me to take this step and I’m excited to be taking on a new challenge.”\nHamilton said he wanted to finish his time at Mercedes on a high and was “100% committed to delivering the best performance I can this season and making my last year with the Silver Arrows, one to remember”.\nThe 39-year-old Briton is set to replace Spanish driver Carlos Sainz at Ferrari alongside Charles Leclerc and gives the Italian team a world champion in one of their cars for the first time since Germany’s Sebastian Vettel left in 2020.\nThe biggest driver move since Hamilton left a winning McLaren for then-unproven Mercedes at the end of 2012 came as a surprise despite regular chatter that it could one day happen.\nFerrari are the oldest, most glamorous and successful team but without a driver’s title since 2007 and like Hamilton hungry to get back to the top. The Briton has not won a race since December, 2021.\nHis seven crowns are matched only by German Michael Schumacher, who raced for Ferrari from 1996 to 2006 during a golden era at Maranello and made a comeback at Mercedes.\nMany questions\nHamilton’s switch raised plenty of questions about why he had decided to leave, a month before the start of the season, but it extends his career into the sport’s new engine era in 2026 and keeps him firmly in the limelight.\nDespite his loyalty to Mercedes, Hamilton has remained close to Ferrari boss Fred Vasseur after winning Formula Three and GP2 (now Formula Two) championships with the Frenchman’s ART team as a junior in 2005 and 2006.", "url": "https://www.straitstimes.com/sport/formula-one/hamilton-to-leave-mercedes-at-end-of-2024-f1-season"}