{"authors": [], "date_download": "2024-10-12 13:58:36", "date_modify": "2024-10-12 13:58:36", "date_publish": "2024-07-22 15:32:28", "description": "Even the water quality of the river Seine – which is set to be used for outdoor swimming events – has also improved dramatically since the start of July. Read more at straitstimes.com.", "filename": "sport_we-re-ready-say-paris-olympics-organisers_1728741516.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/22/11490008.jpg?VersionId=BgtHRXHpuTtTo3_UHwvQdDlSgY6ueRYX&itok=nm3G7IKq", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_we-re-ready-say-paris-olympics-organisers_1728741516.html", "title": "President Emmanuel Macron says France is ready to host Paris Olympics", "title_page": "President Emmanuel Macron says France is ready to host Paris Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – President Emmanuel Macron said on July 22 that France is ready to host the Paris Olympics as he visited the Athletes’ Village four days before the Games begin.\n“We are ready and we will be ready throughout the Games,” he said.\n“We have been working on these Games for years now and we are at the start of a decisive week which on Friday will see the opening ceremony and then the Olympiad which will be held in Paris, 100 years since the last one.”\nHe added: “This is the fruit of an immense amount of work which has profoundly changed the country, in particular the area” of Seine-Saint-Denis where the Athletes’ Village is situated.\nThe message comes a day after Paris Olympics supremo Tony Estanguet expressed a similar sentiment while playing down complaints from some residents and businesses about the impact of the event.\n“We are ready as we head into the final phase,” he told a press conference in Paris, five days from the opening ceremony on July 26.\n“For as long as the closing ceremony hasn’t finished, we need to remain vigilant. But today we are exactly where we would have dreamed of being a few years ago.”\nFinishing touches are being applied to the venues across the City of Light, and thousands of athletes and officials are pouring in, while the weather has brightened up after months of rain.\nIn a further boost for organisers, the water quality of the river Seine – which is set to be used for outdoor Olympic swimming events – has also improved dramatically since the start of July.\n“All the indicators for the Seine are positive at this stage,” Estanguet added.\nThe river is set to host the opening ceremony, which will see 6,000 to 7,000 athletes sail down on 85 barges and boats.\nIt will be the first time the Summer Olympics have opened outside the main athletics stadium, with up to 300,000 ticketed spectators set to watch from stands and on the river banks and another 200,000 expected to watch from the overlooking apartments.\nAround 4,000 tickets are still available for the ceremony, Estanguet said, adding: “We’ve always tried to maintain as high a level of ambition as possible so that these Games make France shine.”\nThe vast security operation for the opening ceremony is causing some friction, however.\nLarge parts of central Paris along the banks of the river and around Olympic venues are strictly off-limits for most people.\nTrade groups representing Paris shops, restaurants, bars and clubs complained on July 19 that they were facing an “unprecedented slump in business and footfall”, blaming in part the “heavy security measures”.\n“It was always a choice made in full conscience that the success of Paris 2024 would mean having the Games in the city. That was the completely unprecedented concept for Paris 2024,” Estanguet explained.\nAs well as the opening ceremony, much of the sport is set to take place at temporary venues around Paris, with beach volleyball at the Eiffel Tower, archery at the Invalides and skateboarding at the Place de la Concorde.\n“We can’t do it without some disruption. We can’t do it without some restrictions,” Estanguet said.\nHe thanked “those who have understood this because it’s really to honour our country in the most beautiful way”.\nAround 45,000 members of the French security forces are set to be on duty on July 26 when the Olympics kick off at 7.30pm.\n“Security was the No. 1 priority for Paris 2024,” Estanguet said.\nCybersecurity is also a major concern, with a global IT outage on July 19 after an update to CrowdStrike software causing temporary disruption to the accreditation system for the Games.\nThe International Olympic Committee has said it is bracing itself for disinformation attacks targeting the Paris Games following recent incidents blamed on Russia, in response to a near-ban on Russian athletes because of Moscow’s invasion of Ukraine.", "url": "https://www.straitstimes.com/sport/we-re-ready-say-paris-olympics-organisers"}