{"authors": ["Lin Tianbao"], "date_download": "2024-10-12 14:10:40", "date_modify": "2024-10-12 14:10:40", "date_publish": "2024-06-28 16:00:14", "description": "The 19-year-old is set to play in the NBA alongside his dad. Read more at straitstimes.com.", "filename": "sport_basketball_six-things-about-bronny-james-son-of-los-angeles-lakers-legend-lebron_1728742240.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/2024-05-14T184324Z1022080193MT1USATODAY23271353RTRMADP3NBA-COMBINE.JPG?VersionId=N3GItkXKYIW7txVOgZIN9Zk5AEi4sFSa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_six-things-about-bronny-james-son-of-los-angeles-lakers-legend-lebron_1728742240.html", "title": "Six things about Bronny James, son of Los Angeles Lakers legend LeBron", "title_page": "Six things about Bronny James, son of Los Angeles Lakers legend LeBron | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Basketball superstar and four-time National Basketball Association (NBA) Most Valuable Player LeBron James is set to achieve his dream of playing alongside his son Bronny, after the 19-year-old was picked in the second round of the draft by the Los Angeles Lakers on June 27.\nThey are set to become the first father-son duo to play in the league at the same time and on the same team. But who exactly is Bronny, and can he take over LeBron’s mantle in the future?\nSupportive dad and mum\nBronny was born on October 6, 2004, to a 19-year-old LeBron and his now-wife Savannah in Cleveland, Ohio. Then, LeBron was the reigning Rookie of the Year and heading into his second season with the Cleveland Cavaliers.\nBronny has two younger siblings – Bryce, 17, and Zhuri, nine. While he comes from basketball royalty, LeBron has been protective of his son and gives him constant encouragement.\nIn February, he said in a now-deleted social media post to “let the kid be a kid and enjoy college basketball”. Even before that, college coaches were offering scholarships to Bronny when he was just 10.\nCardiac arrest shock\nBronny received a health scare in July 2023, when he suffered a sudden cardiac arrest while working out at the University of Southern California (USC) during pre-season. While he was discharged from hospital three days later, there were concerns about his future.\nHe returned to pre-game warmups with the team on Nov 19, with his family releasing a statement 11 days later to announce that he had been cleared to play basketball. Bronny finally made his USC debut and return to competition on Dec 10.\nChip off the old block\nBronny enrolled into Sierra Canyon School in 2019 and made his high school debut in November. Throughout his four years there, he put in memorable performances.\nThese included scoring the basket to put his team ahead against his father’s alma mater, St. Vincent–St. Mary High School – he was named MVP in the 59-56 win. LeBron later said on Instagram that it was a “story book moment” for him.\nIn March 2023, Bronny featured in the McDonald’s All-American Game, an annual all-star match for high school graduates. He wore the no. 23 jersey and scored 15 points in that game – 20 years after LeBron starred in the same exhibition contest.\nAccording to a 2022 scouting report, the guard has high basketball IQ, and is strong on the defensive end. His passing and unselfishness also make up his playing style.\nVideo game fanatic\nWhile Bronny spends much of his time playing basketball, he also loves playing video games.\nHe started streaming on video platform Twitch during the Covid-19 pandemic, and now has 622,000 followers despite having his last stream three years ago.\nLeBron even made a special appearance on one of Bronny’s live streams in 2020, when the latter was playing video game NBA 2K. Bronny also plays the military video game series Call of Duty, among others.\nSocial media hit\nTwitch is not the only online platform where Bronny has a significant presence. The teenager is also active on Instagram and TikTok, where he has 7.8 million and 5.8 million followers respectively.\nHe started his Instagram account in May 2019 and gained more than 1.3 million followers in one day. While he usually posts highlight reels on the platform, his TikTok videos show his lighter side, including his dance moves.\nWho he loves\nWhile Bronny has not officially revealed his favourite player, there are hints of the stars he looks up to. In a 2016 interview, LeBron said that Bronny took up the jersey no. 0 after current Los Angeles Clippers guard Russell Westbrook.\nLater in 2020, he was asked who his top five favourite players were besides his father while he was streaming. He named James Harden, Giannis Antetokounmpo, Damian Lillard, Anthony Davis and Kevin Durant.", "url": "https://www.straitstimes.com/sport/basketball/six-things-about-bronny-james-son-of-los-angeles-lakers-legend-lebron"}