{"authors": [], "date_download": "2024-10-12 13:43:02", "date_modify": "2024-10-12 13:43:02", "date_publish": "2023-12-28 07:42:22", "description": "The win was the third in a row at home in the Premier League for the Blues. Read more at straitstimes.com.", "filename": "sport_football_stop-start-chelsea-edge-out-palace-but-still-not-firing_1728740582.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/28/LYNXMPEJBQ0IY-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_stop-start-chelsea-edge-out-palace-but-still-not-firing_1728740582.html", "title": "Stop-start Chelsea edge out Crystal Palace but still not firing in EPL", "title_page": "Stop-start Chelsea edge out Crystal Palace but still not firing in EPL | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – The Stamford Bridge sound system blared the old disco hit Ain’t No Stopping Us Now after Chelsea’s hard-fought 2-1 English Premier League win over Crystal Palace on Dec 27, but momentum is still sorely lacking for Mauricio Pochettino’s team.\nAn 89th-minute penalty earned and converted by substitute Noni Madueke unleashed a wave of relief around the stadium, where fans have endured a hugely disappointing 2023, despite massive spending on new players by the club’s American owners.\nPochettino knows it all too well that there is still a lot of work to be done, saying: “It was really tough, but I’m pleased with the performance overall.\n“We didn’t start well, we were a little bit nervous and we struggled because we were thinking too much about a game we really needed to win.\n“We created chances to score, we scored, but I wasn’t so happy we conceded in the last minute (of the first half).\n“The second half we started well again, played a bit more, and I’m so happy the players from the bench had a good impact.”\nPalace’s Michael Olise had punished Chelsea just before the break when he took advantage of lax marking to cancel out winger Mykhailo Mudryk’s simple finish from a cross by defender Malo Gusto in the 13th minute.\nMadueke then saved the day for the Blues with a penalty awarded after a VAR (video assistant referee) review.\nThe win was the third in a row at home in the Premier League for Chelsea, after victories over Sheffield United and Brighton & Hove Albion.\nBut those successes have contrasted with away losses at Newcastle United, Manchester United, Everton and Wolverhampton Wanderers in the same period, leaving Chelsea firmly stuck in mid-table.\nAt this stage last season, when Graham Potter was in charge, they sat in the same 10th spot, a far cry from the form that saw them crowned champions of Europe in 2021.\nPochettino said he expected more from his expensively assembled side, who saw France attacker Christopher Nkunku make his first start and Romeo Lavia come off the bench for his debut.\n“The Premier League is really tough and we need to be consistent,” he added.\n“We were talking at the end about mentality. Mentality is about preparing yourself, competing in the best way.\n“The first half of the season has been really up and down and it’s been tough and difficult. But we’re positive and we need to show that we can compete.”\nPochettino also praised Madueke for overcoming his disappointment at not featuring much for Chelsea to come off the bench and play a decisive role in the win.\n“We are not a charity,” he said. “We are a football club and we need to perform. The first thing is to have the right mentality and to go there on the pitch and to show respect to the history of the club.”\nPalace manager Roy Hodgson, meanwhile, acknowledged his team’s position – just three points off the relegation zone – posed a problem.\nBut he took comfort from his players’ performances, even if they are now without a win in eight league matches.\n“We aren’t winning matches... But if we weren’t showing the spirit we are showing, that would be more of a concern,” he said.\nWhat he did have an issue with was the refereeing in matches nowadays, but Hodgson did not elaborate on whether he thinks having VAR is good for the game.\n“We just have to accept there’s two referees every game,” he said.\n“Every time something happens on the field of play and the referee makes the decision, you still have to wait several minutes just in case somebody in the studio... has whispered in his ear that he’s seen something different.” REUTERS, AFP", "url": "https://www.straitstimes.com/sport/football/stop-start-chelsea-edge-out-palace-but-still-not-firing"}