{"authors": [], "date_download": "2024-10-12 14:02:32", "date_modify": "2024-10-12 14:02:32", "date_publish": "2024-06-08 00:57:33", "description": "Alcaraz recovers from a woeful start to seal a 2-6 6-3 3-6 6-4 6-3 win against an inconsistent Sinner. Read more at straitstimes.com.", "filename": "sport_tennis_alcaraz-downs-sinner-to-reach-french-open-final_1728741752.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/08/2024-06-07T170014Z507702758UP1EK671B8DE7RTRMADP3TENNIS-FRENCHOPEN.JPG?VersionId=2dfd2ewVx9YrOSZaZEj7BkFfMVzruyjL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_alcaraz-downs-sinner-to-reach-french-open-final_1728741752.html", "title": "Alcaraz downs Sinner, to face Zverev in French Open final", "title_page": "Alcaraz downs Sinner, to face Zverev in French Open final | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Carlos Alcaraz outlasted Jannik Sinner in an engrossing five-set battle on June 7 to reach his first French Open final, where he will face Alexander Zverev.\nThe two-time Grand Slam champion trailed 2-1 in sets to incoming world number one Sinner, but rallied in the Paris sunshine to win 2-6, 6-3, 3-6, 6-4, 6-3 after four hours and nine minutes on Court Philippe Chatrier.\nIt was another gripping chapter in the pair’s burgeoning rivalry, with Alcaraz now leading their head-to-head 5-4.\n“I hope to play many, many more matches like this one against Jannik but it’s one of the toughest I’ve played for sure,” said Alcaraz.\n“I’m really happy about everything I did today. I waited for my moment until I took it.”\nThe 21-year-old will be the favourite heading into the June 9 final as he aims to become the youngest man to win Grand Slam titles on clay, grass and hard courts.\nHe has won both of his two previous major finals - at Wimbledon in 2023 and the 2022 US Open.\nItalian Sinner, playing in his first Roland Garros semi-final, put up a brave fight but came up just short as he suffered only his third defeat of the season and his first at a Slam in 2024 after winning the Australian Open.\nAlcaraz was not at his best for long periods, but found his form at the right time late in the fourth set, powering to victory on the back of 65 winners.\nSinner flew out of the blocks, breaking in the first game of the match en route to a 4-0 lead.\nAlcaraz started to find his rhythm, but too late to recover in the opener as Sinner took it on his third set point.\nWorld number three Alcaraz looked in trouble when he quickly fell 2-0 behind in the second set, but Sinner’s level markedly dropped as the Spaniard reeled off five straight games before levelling the match.\nSinner was starting to struggle with his serve - making eight double-faults across the second and third sets - and Alcaraz struck first with an early break in the third.\nBut Sinner upped his game again, breaking Alcaraz twice, either side of a crucial hold in which he saved four break points himself, before moving a set in front.\nAfter 10 breaks across the first three sets, both players stabilised on serve in the fourth, with nine successive comfortable holds.\nBut Alcaraz found some magic when he needed it most as, leading the set 5-4 but 30-0 down on Sinner’s serve, he produced a series of sparkling shots and forced a decider with a backhand winner on the stretch.\nThe momentum was all with Alcaraz and a wonderful lob helped him bring up break point in the second game of the fifth.\nThe duelling duo were bringing the best out of each other, but although Sinner produced a perfect drop shot to save that break point, Alcaraz powered away a forehand shortly afterwards to secure a 2-0 advantage.\nSinner steadied the ship to keep the pressure on his opponent, but Alcaraz successfully served out for a place in the final in a tense ninth game, clinching victory on his third match point as Sinner blazed long.\nZverev awaits\nZverev defeated Norwegian Casper Ruud 2-6, 6-2, 6-4, 6-2 in the other semi-final after a German court dropped a case against the 27-year-old German over allegations he assaulted an ex-girlfriend earlier on June 7.\nRuud is still searching for a first major trophy, having lost all three of his Slam finals, including in each of the past two years in Paris – against Rafael Nadal in 2022 and Djokovic 12 months ago.\nOn June 8, Iga Swiatek will continue her bid for a third straight women’s title against surprise challenger Jasmine Paolini.\nWorld number one Swiatek has a remarkable 34-2 winning record at Roland Garros, drawing comparisons with Nadal.\n“We’ll see in 14 years if the journey is similar. That’s obviously really nice for me,” said Swiatek.\nOn June 7, Paolini also reached the women’s doubles final alongside fellow Italian Sara Errani. AFP", "url": "https://www.straitstimes.com/sport/tennis/alcaraz-downs-sinner-to-reach-french-open-final"}