{"authors": [], "date_download": "2024-10-12 14:12:08", "date_modify": "2024-10-12 14:12:08", "date_publish": "2024-05-09 14:50:19", "description": "He beat out Oklahoma City Thunder star Shai Gilgeous-Alexander and Luka Doncic of the Dallas Mavericks in final voting. Read more at straitstimes.com.", "filename": "sport_basketball_denver-nuggets-nikola-jokic-scoops-third-nba-most-valuable-player-award_1728742328.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/09/BKN-SPO-MINNESOTA-TIMBERWOLVES-V-DENVER-NUGGETS-GAME-TWO-110915.jpg?VersionId=cudo_T3nDMRo48B0J2ZN9Nfdl9Rfa48U", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_denver-nuggets-nikola-jokic-scoops-third-nba-most-valuable-player-award_1728742328.html", "title": "Denver Nuggets’ Nikola Jokic scoops third NBA Most Valuable Player award", "title_page": "Denver Nuggets’ Nikola Jokic scoops third NBA Most Valuable Player award | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Nikola Jokic thanked his “one big circle” at the Denver Nuggets after he was named National Basketball Association (NBA) Most Valuable Player for the third time in four seasons on May 8.\nThe 29-year-old Serbian star, who won the award in 2021 and 2022, finished runner-up in the voting in 2023 to Joel Embiid of the Philadelphia 76ers but had the satisfaction of leading the Nuggets to a first NBA title.\nThis season he averaged 26.4 points, 12.4 rebounds and 9.0 assists in the regular season and beat out Oklahoma City Thunder star Shai Gilgeous-Alexander and Luka Doncic of the Dallas Mavericks in final voting for the award.\n“We’ve got to start with the teammates. Without them I cannot do anything,” Jokic said in the MVP announcement broadcast on TNT when asked to reflect on yet another MVP.\n“Coaches, players, organisation, medical staff, across time coaches, development coaches – it’s all one big circle that I cannot be wherever I am without them.”\nIn another season in which he managed to make brilliance almost look routine, he became the second player, after Oscar Robertson, to record 2,000 points, 900 rebounds and 600 assists in a season.\nHis 25 triple-doubles and 68 double-doubles were both second in the league to the Sacramento Kings’ Domantas Sabonis (26 and 77 respectively).\nWith a third MVP crown, Jokic also enters elite territory.\nKareem Abdul-Jabbar’s six MVPs are the most ever. Bill Russell and Michael Jordan won five apiece and Wilt Chamberlain and LeBron James four.\nJokic joins Moses Malone, Larry Bird and Magic Johnson as three-time winners after earning 79 first-placed votes compared to 15 for Gilgeous-Alexander and four for Doncic.\nAs always, the MVP award offered plenty of scope for argument.\nBut Jokic was not offended during the TNT interview when it was suggested that Gilgeous-Alexander might have been a more worthy winner.\n“There are a lot of players who deserve it,” he said. “It’s probably the details and the small things.”\nGilgeous-Alexander, a 25-year-old Canadian, averaged 30.1 points, 5.5 rebounds, 6.2 assists and 2.0 steals per game for upstarts Oklahoma City and had a league-high 51 30-point games.\nSlovenia’s Doncic led the league in scoring with 33.9 points per game and ranked second in assists with 9.8 per game, behind the Indiana Pacers’ Tyrese Haliburton (10.9).\nBut Nuggets coach Mike Malone was in no doubt that Jokic’s third MVP was richly deserved.\n“I don’t know if I can put that into words what his greatness means,” he said.\n“When he gets up in the morning... he’s not doing it for the individual accolades and recognition. He’s doing it for the collective to win and hopefully win another championship. That’s what he’s all about.\n“That is what I marvel at. Just the consistent greatness and how he finds ways to every single night, no matter who is available around him, to bring that level of excellence.”\nThe Nuggets, meanwhile, dropped the first two games of their Western Conference semi-final series to the Minnesota Timberwolves, and face the tough task of trying to claw back on the Timberwolves’ home court starting on May 10. AFP, REUTERS", "url": "https://www.straitstimes.com/sport/basketball/denver-nuggets-nikola-jokic-scoops-third-nba-most-valuable-player-award"}