{"authors": [], "date_download": "2024-10-12 13:42:25", "date_modify": "2024-10-12 13:42:25", "date_publish": "2024-06-27 18:13:19", "description": "FRANKFURT, Germany - When Cenk Tosun fired Turkey to victory over the Czech Republic in their European Championship Group F match on Wednesday, he secured second place in the pool for his side and set a new record for the tournament. Read more at straitstimes.com.", "filename": "sport_football_euro-2024-is-already-the-ultimate-late-show_1728740545.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/27/LYNXMPEK5Q0CN-1.jpg?VersionId=pXr7RsYseHW.OgNf05bo1P70h0iw1uzG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_euro-2024-is-already-the-ultimate-late-show_1728740545.html", "title": "Euro 2024 is already the ultimate late show", "title_page": "Euro 2024 is already the ultimate late show | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "FRANKFURT, Germany - When Cenk Tosun fired Turkey to victory over the Czech Republic in their European Championship Group F match on Wednesday, he secured second place in the pool for his side and set a new record for the tournament.\nStriker Tosun rattled the back of the net from the edge of the box in the 94th minute, the 10th stoppage-time goal of the group phase in Germany, a record for the Euros with 15 more games to play in the knockout rounds.\nIt has been a finals for late drama, with one more added-time goal scored than the previous record of nine in 2016, the first tournament to be expanded to 24 teams, and double the number of three years ago.\nPerhaps the most dramatic one was netted by Italy’s Mattia Zaccagni, his first in international football, as he curled a shot into the top corner in the 98th minute of their final Group B clash with Croatia to claim a 1-1 draw.\nIt sealed an early exit for Croatia as their two points was not enough to finish as one of the best third-placed teams.\nGermany clinched top spot in Group A with a 92nd-minute equaliser from Niclas Fuellkrug in their 1-1 draw with Switzerland, denying the latter top spot. Portugal ultimately finished first in Group F thanks to Francisco Conceicao’s 92nd- minute winner against the Czechs in their opener.\nThe latter conceded two stoppage-time goals at the end of their games, and one deep into first-half added time as their weakness just before the whistle blows to end a half was exposed.\nThe latest goal scored in the tournament was after 100 minutes by Hungary’s Kevin Csoboth in their 1-0 victory over Scotland, though it was not enough to see them advance to the last 16.\nThese finals may have seen the most added time goals, but there have been famous instances in the past that have proved decisive.\nSpain were losing 3-2 to Yugoslavia and heading out in the pool stages in 2000 when Gaizka Mendieta equalised with a penalty in the 94th minute before Alfonso Perez grabbed a winner 60 seconds later.\nIn 2004, England led 1-0 in stoppage-time of their pool game against France, but Zinedine Zidane netted twice before the final whistle to seal a French victory. Both teams advanced to the knockout stages. REUTERS", "url": "https://www.straitstimes.com/sport/football/euro-2024-is-already-the-ultimate-late-show"}