{"authors": [], "date_download": "2024-10-12 13:43:25", "date_modify": "2024-10-12 13:43:25", "date_publish": "2024-07-10 12:18:10", "description": "'Spain played better than us, they deserved to go to the final and we are going home.' Read more at straitstimes.com.", "filename": "sport_football_we-didnt-do-enough-says-france-captain-mbappe-after-euro-2024-exit_1728740605.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/10/FBL-EURO-2024-MATCH49-ESP-FRA-211203.jpg?VersionId=761JAc21.7VZHV2S6yAqISdadXLs9jhS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_we-didnt-do-enough-says-france-captain-mbappe-after-euro-2024-exit_1728740605.html", "title": "'We didn't do enough', says France captain Mbappe after Euro 2024 exit", "title_page": "'We didn't do enough', says France captain Mbappe after Euro 2024 exit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MUNICH - France captain Kylian Mbappe said his side “didn’t do enough” in the 2-1 semi-final loss to Spain on July 9 and admitted he was disappointed after underperforming at Euro 2024.\n“We didn’t do enough to get to the final,” Mbappe told reporters. “They (Spain) played better than us, they deserved to go to the final and we are going home.”\nMbappe set up Randal Kolo Muani’s ninth-minute opener, but Spain hit back to take the lead with two strikes in four minutes midway through the first half.\n“I had the ambition of becoming European champion. I had the goal of having a good Euros. I did neither. It’s a disappointment,” said Mbappe.\nFrance scored just four goals at the tournament, with Mbappe’s only strike coming from the penalty spot.\nThe haul was in stark contrast to France’s run to the World Cup final in Qatar, where Mbappe scored eight of Les Bleus’ 16 goals.\nMbappe had a late chance to level the scores when he cut inside from the left flank with just goalkeeper Unai Simon to beat, but blasted over the bar.\n“I got past the defender and it went well. Afterwards, I thought I just have to score or at the very least get it on target.\n“It went over the bar. That’s the harsh reality of football. 2-1 and we’re going home.”\nThe France captain had played in a protective mask after breaking his nose in the opening match against Austria, but removed it for the semi-final, saying he was “fed up”.\n“I couldn’t see well with it. I spoke to the doctor to see if I could play without it.\n“He told me to make the decision like a man. And there you go, I played without it and I don’t regret it.” AFP", "url": "https://www.straitstimes.com/sport/football/we-didnt-do-enough-says-france-captain-mbappe-after-euro-2024-exit"}