{"authors": [], "date_download": "2024-10-12 14:18:14", "date_modify": "2024-10-12 14:18:14", "date_publish": "2024-04-19 04:10:49", "description": "Third-seeded Casper Ruud defeated 14th-seeded Jordan Thompson 6-1, 6-4 to advance to the quarterfinals of the Barcelona Open Banc Sabadell on Thursday in Spain. Read more at straitstimes.com.", "filename": "sport_tennis_atp-roundup-casper-ruud-moves-on-in-barcelona_1728742694.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/19/LYNXNPEK3H0V2-1.jpg?VersionId=LsNNWQcANvDNgnQ6CWKQ8Tkgz5LJUa_R", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_atp-roundup-casper-ruud-moves-on-in-barcelona_1728742694.html", "title": "ATP roundup: Casper Ruud moves on in Barcelona", "title_page": "ATP roundup: Casper Ruud moves on in Barcelona | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Third-seeded Casper Ruud defeated 14th-seeded Jordan Thompson 6-1, 6-4 to advance to the quarterfinals of the Barcelona Open Banc Sabadell on Thursday in Spain.\nRuud, of Norway, won the first five games of the first set and overcame four aces by the Australian to capture the match in 73 minutes. Ruud will face Italian Matteo Arnaldi in the next round.\nFourth-seeded Alex de Minaur of Australia was unable to follow up the momentum of his victory over Rafael Nadal on Wednesday, as he dropped a 7-5, 6-2 decision to 16th-seeded Arthur Fils of France.\nOther seeded winners included No. 5 Stefanos Tsitsipas of Greece, No. 12 Cameron Norrie of Great Britain and No. 13 Tomas Martin Etcheverry of Argentina.\nEleventh-seeded Alejandro Davidovich Fokina of Spain and 17th-seeded Fabian Marozsan were not as fortunate. The former dropped a 7-6 (10), 3-6, 6-1 decision to Dusan Lajovic of Serbia, while the latter fell 3-6, 6-3, 6-1 to Facundo Diaz Acosta of Argentina.\nTiriac Open\nMarton Fucsovics of Hungary recorded a 7-5, 6-1 win over second-seeded Tallon Griekspoor of the Netherlands to advance to the third round in Bucharest, Romania.\nFucsovics fired five aces and overcame two double faults to dispatch Griekspoor in 91 minutes. In the quarterfinals, he will face Frenchman Corentin Moutet, who upended seventh-seeded Nuno Borges of Portugal 6-2, 6-7 (3), 6-2.\nWild card Joao Fonseca of Brazil defeated Moldovan qualifier Radu Albot 7-6 (2), 6-2, as he broke Albot's serve three times in four chances.\nBMW Open\nSecond-seeded Holger Rune of Denmark notched a 6-4, 6-2 win over Daniel Elahi Galan of Colombia to advance to the third round in Munich.\nRune benefited from seven aces and won 92.9 percent of his first-serve points (26 of 28) to capture the match in one hour, 39 minutes.\nNo. 3 seed Taylor Fritz, No. 4 Jan-Lennard Struff of Germany and No. 5 Felix Auger-Aliassime of Canada were also victorious. Fritz breezed to a 6-3, 6-1 win over Alejandro Moro Canas of Sapin, Struff outlasted Botic Van De Zandschulp of the Netherlands 7-6 (0), 6-4 and Auger-Aliassime notched a 6-3, 6-2 win over Taro Daniel of Japan.\nCristian Garin of Chile and Swiss qualifier Marc-Andre Huesler also won their matches.\n--Field Level Media REUTERS", "url": "https://www.straitstimes.com/sport/tennis/atp-roundup-casper-ruud-moves-on-in-barcelona"}