{"authors": [], "date_download": "2024-10-12 13:35:18", "date_modify": "2024-10-12 13:35:18", "date_publish": "2024-07-16 02:42:38", "description": "NEW YORK - Chaos at the Copa America final on Sunday night - as soccer fans rushed security at the final in Florida - capped a tournament rife with discord just two years before the World Cup is set to take place in the United States. Read more at straitstimes.com.", "filename": "sport_football_copa-america-chaos-in-us-frustrates-fans-and-teams_1728740118.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/16/LYNXMPEK6E0MT-1.jpg?VersionId=bQQvzrWRZaU0liD8qZIBKw0.Z5GD1y4I", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_copa-america-chaos-in-us-frustrates-fans-and-teams_1728740118.html", "title": "Copa America chaos in US frustrates fans and teams", "title_page": "Copa America chaos in US frustrates fans and teams | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Chaos at the Copa America final on Sunday night - as soccer fans rushed security at the final in Florida - capped a tournament rife with discord just two years before the World Cup is set to take place in the United States.\nAs some fans without tickets tried to enter, police closed the gates and initiated a lockdown that left hundreds of fans stuck outside the Hard Rock Stadium in Miami Gardens in sweltering heat. South American football's governing body CONMEBOL repeatedly delayed the match between Argentina and Colombia, and it finally kicked off over an hour late.\nIt was a stunning scene from the home of the National Football League's Miami Dolphins, which is used to welcoming massive crowds at sport's biggest events, including the Super Bowl four years ago.\nThe venue will host matches at the 2026 World Cup, which is organized by the sport's global governing body, FIFA.\nHard Rock Stadium said in a statement that it had \"more than double\" the personnel on Sunday than at a typical capacity event. The stadium has a capacity of over 65,000.\n\"We understand there are disappointed ticket holders who were not able to enter the stadium after the perimeter was closed, and we will work in partnership with CONMEBOL to address those individual concerns,\" it said.\n\"Ultimately, there is nothing more important than the health and safety of all guests and staff.\"\nCONMEBOL, CONCACAF, FIFA and U.S. Soccer did not immediately respond to requests for comment.\nSimilar incidents have happened in several recent major soccer matches in places including London and Paris.\nBut it was a bitter disappointment nonetheless for fans at a tournament that had been intended to showcase inter-confederation camaraderie, with the United States hosting South America's most important national team tournament for the second time.\nInstead the affair slumped across the starting line. Empty seats were in sight at several group matches, with fans complaining about high prices and far-flung stadiums.\nThe U.S. team were unable to get out of the group stage and split with their head coach Gregg Berhalter as a result.\nThen, security personnel came under fire after Uruguay players clashed with Colombia fans following their Copa America semi-final defeat.\nUruguay coach Marcelo Bielsa later told reporters that his players' family members were assaulted in the stands and ripped Copa organizers for failing to protect them.\nCanada coach Jesse Marsch also criticized the tournament organizers ahead of his team's third-place clash with Uruguay, calling the event unprofessional at every level and saying that his players were treated as \"second-class citizens.\"\n\"We've had our players be head-butted. We've had racial slurs thrown at our players live and through social media,\" he said.\nHe also accused referees of bias against CONCACAF players.\n\"There's so many things I could say.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/copa-america-chaos-in-us-frustrates-fans-and-teams"}