{"authors": [], "date_download": "2024-10-12 13:42:40", "date_modify": "2024-10-12 13:42:40", "date_publish": "2024-01-04 12:24:46", "description": "Everton manager Sean Dyche said the Premier League should scrap its winter break to ease the packed fixture schedule over the festive period and lessen the advantage enjoyed by bigger clubs with deeper squads. Read more at straitstimes.com.", "filename": "sport_football_everton-manager-dyche-calls-for-premier-league-to-scrap-winter-break_1728740560.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/04/LYNXMPEK0303J-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_everton-manager-dyche-calls-for-premier-league-to-scrap-winter-break_1728740560.html", "title": "Everton manager Dyche calls for Premier League to scrap winter break", "title_page": "Everton manager Dyche calls for Premier League to scrap winter break | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Everton manager Sean Dyche said the Premier League should scrap its winter break to ease the packed fixture schedule over the festive period and lessen the advantage enjoyed by bigger clubs with deeper squads.\nThere are no Premier League matches this weekend, with the FA Cup third round taking precedence, while all clubs will have one of the two following weekends off in a mini winter break.\nEverton played eight games in all competitions in December but will play a maximum of just four this month, beginning with their trip to Crystal Palace in the FA Cup later on Thursday.\n\"I don't see the point of it when you've just had so many games in December. It's not that beneficial,\" Dyche told reporters on Wednesday.\n\"It would be better to lose one or two of these games in December and put them in there to spread it out. That's a better scenario. It's a more level playing field then. With more games, the big clubs are bound to gain because of their big squads.\n\"But when you haven't got a big squad, like us, and you get injuries, you're bound to be stretched. If you put a couple of games in that break then it is more level across the season.\n\"I'll be surprised if that break doesn't disappear, just from the scheduling.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/everton-manager-dyche-calls-for-premier-league-to-scrap-winter-break"}