{"authors": [], "date_download": "2024-10-12 13:43:00", "date_modify": "2024-10-12 13:43:00", "date_publish": "2023-12-23 04:15:49", "description": "Victory was never in doubt once Julian Alvarez opened the scoring inside the first minute. Read more at straitstimes.com.", "filename": "sport_football_manchester-city-beat-fluminense-to-capture-club-world-cup_1728740580.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/23/FBL-FIFA-WCLUB-FLUMINENSE-MANCITY-203010.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_manchester-city-beat-fluminense-to-capture-club-world-cup_1728740580.html", "title": "Manchester City cruise to first Club World Cup triumph", "title_page": "Manchester City cruise to first Club World Cup triumph | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JEDDAH, Saudi Arabia - Manchester City won the Club World Cup for the first time to end 2023 with five trophies after a 4-0 win over Fluminense in Jeddah on Dec 22.\nCity’s victory extended European clubs’ domination of the competition since 2012 and was never in doubt once Julian Alvarez opened the scoring inside the first minute.\nNino’s first-half own goal realistically ended the Brazilians’ dreams of an upset, before Phil Foden and Alvarez rounded off the scoring in the final 20 minutes.\nCity’s poor Premier League form before flying out to Saudi Arabia had raised Fluminense hopes that Pep Guardiola’s men could be vulnerable.\nBut the growing chasm between Europe’s elite clubs and the rest of the world thanks to huge financial imbalances in the global game was instead exposed.\nEuropean clubs have won 22 consecutive games at the Club World Cup.\nCity laboured for 45 minutes to break down Japan’s Urawa Reds in the semi-final before cruising to a 3-0 win.\nThis time, they needed less than 45 seconds.\nFluminense’s old guard saw them through a tricky semi-final against African champions Al Ahly.\nBut it was one of their experienced heads that was at fault for the opening goal as former Real Madrid captain Marcelo gifted possession to Nathan Ake with a wayward pass.\nThe Dutch defender strode forward and curled a fine effort off the post from outside the box. The rebound fell for Alvarez to chest into an unguarded net.\nAt just 23, Alvarez added to his remarkable haul of silverware that includes the World Cup and Copa America with Argentina at international level, the Copa Libertadores during his time at River Plate, plus Premier League, Champions League, FA Cup and Uefa Super Cup medals during just over a year at City.\nRodri injury worry\nFluminense were then dealt the killer blow when captain Nino turned Foden’s cross into his own net after Rodri’s pass opened up the Brazilian defence.\nEderson was called into action to maintain City’s two-goal lead before the break as the Brazilian international made a stunning save from Jhon Arias’ header.\nBut his opposite number Fabio was the busier goalkeeper. The 37-year-old kept the score down and saved Fluminense’s blushes.\nFabio turned Jack Grealish’s fiercely struck effort behind before half-time and twice denied Foden early in the second half.\nCity were able to coast through the second period to end a glorious year on a high, but victory could come at a cost.\nRodri was forced off with an injury 20 minutes from time. City have lost all three Premier League games this season when the influential Spanish midfielder has been absent and they travel to in-form Everton on Dec 27.\nHowever, that did not take the shine off a marquee 12 months that marks the high-point in a trophy-laden 15 years since City’s fortunes were transformed by a takeover from Abu Dhabi’s Sheikh Mansour bin Zayed Al Nahyan.\nAfter clinching the treble of the club’s first ever Champions League, Premier League and FA Cup last season, City also lifted the Uefa Super Cup for the first time in August.", "url": "https://www.straitstimes.com/sport/football/manchester-city-beat-fluminense-to-capture-club-world-cup"}