{"authors": [], "date_download": "2024-10-12 14:00:54", "date_modify": "2024-10-12 14:00:54", "date_publish": "2024-07-30 23:54:07", "description": "PARIS - Spain's raging bulls Rafa Nadal and Carlos Alcaraz blazed into the quarter-finals of the Olympics men's doubles but a host of women's singles medal contenders were knocked out as the heat was turned up at Roland Garros on Tuesday. Read more at straitstimes.com.", "filename": "sport_tennis_tennis-zverev-stays-cool-to-reach-third-round-gauff-exits-in-tears_1728741654.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/LYNXMPEK6T10I-1_0.jpg?VersionId=vG2nqpqNN0DxYKqXWhsbdMzhVLFwR2O3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_tennis-zverev-stays-cool-to-reach-third-round-gauff-exits-in-tears_1728741654.html", "title": "Tennis-Nadal and Alcaraz turn up the heat, Gauff knocked out", "title_page": "Tennis-Nadal and Alcaraz turn up the heat, Gauff knocked out | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Spain's raging bulls Rafa Nadal and Carlos Alcaraz blazed into the quarter-finals of the Olympics men's doubles but a host of women's singles medal contenders were knocked out as the heat was turned up at Roland Garros on Tuesday.\nOnce again the dynamic duo received top billing on the schedule and they did not disappoint a fevered crowd as they fought off Netherlands' Tallon Griekspoor and Wesley Koolhof to claim a 6-4 6-7(2) 10-2 victory.\nEarlier, as the mercury soared into the mid-30s Celsius (90s Fahrenheit) leaving spectators and players wilting, the women's singles was blown apart as second seed Coco Gauff, fourth seed Jasmine Paolini and seventh seed Maria Sakkari all perished.\nWomen's top seed Iga Swiatek of Poland stayed on course for gold though with a 6-3 6-4 win against injury-hampered Chinese player Wang Xiyu to reach the quarter-finals.\nDefending men's singles champion Alexander Zverev of Germany stayed cool in the oven-like heat as the third seed kept on track for a repeat of his Tokyo title with a 6-3 7-5 defeat of Czech player Tomas Machac to reach the third round.\nThere was only one place to be on a tropical evening alongside the Bois de Boulogne though -- the claustrophobic Court Suzanne Lenglen for the latest 'Nadalcaraz' show.\nUp against a former doubles world number one in Koolhof, the Spaniards found themselves involved in a red-dirt dogfight as the Dutch showed scant regard for reputations and threatened to spoil the party by deservedly levelling the match.\nBut the 38-year-old Nadal and Alcaraz, 21, have 26 Grand Slam singles titles between them for a reason, and they caught fire again in the deciding tiebreak, with some electrifying tennis moving them within three wins of a dream gold medal.\n\"Our goal to try to get a medal is closer. So I'm really, really happy about it and let's see tomorrow,\" said Alcaraz.\nThe Spaniard plays a third-round singles against Roman Safiullin on Wednesday before joining Nadal to take on Americans Austin Krajicek and Rajeev Ram in the doubles.\n\"I'm trying to enjoy every single second out there.\"\nSHOCK EXIT\nGauff, like Alcaraz an Olympic debutant, still has medal hopes but not in the singles after her shock exit to Croatia's 13th seed Donna Vekic.\nThe American was in tears in the second set when an over-ruled line call saw her slip 4-2 behind and became embroiled in an argument with umpire Jaume Campistol and the tournament supervisor in which she was heard to say \"I'm being cheated\".\nGauff had grounds for complaint as a call of \"OUT\" on a Vekic shot was quickly overruled but the American insisted it put her off. Vekic remained focussed to seal a superb victory and become the first Croatian woman to reach the Olympic singles quarter-finals since 1996.\n\"Afterwards they apologise, but 'Sorry' doesn't help you once the match is over,\" Gauff said.\nItalian Paolini, runner-up at the French Open and Wimbledon in the build-up to the Olympics, lost 7-5 3-6 7-5 to Slovakian Anna Karolina Schmiedlova while Sakkari lost a lengthy battle against Ukraine's Marta Kostyuk.\nZverev reached the French Open final this year and looked perfectly at home on the Parisian clay as he maintained a strong start to his bid to repeat his Tokyo gold.\nHe was pushed hard by Machac but turned on the afterburners at 5-5 in the second set with two searing forehands earning a break of serve before he ended the contest a game later.\nGermany's Angelique Kerber, a singles silver-medallist in Rio, will retire after the Olympics but stayed on course for a golden farewell by beating Canada's Leylah Fernandez 6-4 6-3 to reach the last eight where China's Zheng Qinwen awaits.\nThe lineup for the women's quarter-finals is complete with Kostyuk to face Vekic, Schmiedlova up against Czech Wimbledon champion Barbora Krejcikova and Swiatek playing American Danielle Collins.\nIn the men's singles, two Americans reached the third round with Taylor Fritz beating Britain's Jack Draper 6-7(3) 6-3 6-2 and Tommy Paul overcoming Czech Jakub Mensik 6-3 6-1.\nFritz will face Italy's 11th seed Lorenzo Musetti, who beat Argentina's Mariano Navone. Felix Auger-Aliassime also reached round three by thrashing Germany's Maximilian Marterer 6-0 6-1 but Swiss three-times Grand Slam champion Stan Wawrinka lost to Australia's Alexei Popyrin.\nBritain's Andy Murray kept his career going for one more match at least as he and Dan Evans saved match points for the second contest in a row -- beating Belgians Sander Gille and Joran Vliegen in a cliffhanger to reach the quarter-finals. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/tennis-zverev-stays-cool-to-reach-third-round-gauff-exits-in-tears"}