{"authors": [], "date_download": "2024-10-12 14:13:29", "date_modify": "2024-10-12 14:13:29", "date_publish": "2024-07-20 20:03:55", "description": "PARIS - The Paris Olympics, which open on Friday, will feature a new sport in breaking, plus three young sports returning from the Tokyo Games -- climbing, skateboarding and surfing. These are the changes to the sports programme: Read more at straitstimes.com.", "filename": "sport_what-are-the-changes-to-the-sports-programme-at-the-paris-2024-olympics_1728742409.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/20/LYNXMPEK6J03A-1.jpg?VersionId=12kfdZCWQcOpkWluGUh._nuPMxau2_LF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_what-are-the-changes-to-the-sports-programme-at-the-paris-2024-olympics_1728742409.html", "title": "What are the changes to the sports programme at the Paris 2024 Olympics?", "title_page": "What are the changes to the sports programme at the Paris 2024 Olympics? | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The Paris Olympics, which open on Friday, will feature a new sport in breaking, plus three young sports returning from the Tokyo Games -- climbing, skateboarding and surfing. These are the changes to the sports programme:\nBREAKING TO MAKE OLYMPIC DEBUT\nA competitive form of breakdancing that blends artistry and dance with acrobatic moves, breaking will debut at the Paris Olympics. The urban dance style, which originated in the Bronx borough of New York in the 1970s, was announced as part of the Paris 2024 programme in late 2020.\nTwice World DanceSport Federation (WDSF) championship winner Victor Montalvo and Canadian Phil Wizard (Philip Kim) will be the favourites in the B-Boy category.\nMontalvo, 30, held off Wizard in the final to take the WDSF World Breaking Championship title last year and became the first American to qualify for breaking at the Olympics.\nWizard, 27, won the WDSF championship in 2022.\nIn the B-Girl category, the 2023 world champion, 17-year-old Nicka (Dominika Banevic) of Lithuania, and Japanese Ami (Ami Yuasa) will be the ones to watch out for.\nNEW CANOE SLALOM EVENT KAYAK CROSS\nHaving made its Olympic debut at Munich 1972, canoe slalom will see a new event added to its roster with kayak cross making its debut at Paris 2024.\nKayak cross is an extreme canoe slalom, which sees competitors in kayaks race on white water, jostling each other with their paddles for pole position.\nThe Olympic event will begin with timed solo runs before introducing a frenetic element of head-to-head competition as four racers face off against each other, vying for position on the course with placings changing rapidly and contact almost inevitable.\nBritain's world champion Joe Clarke and Australia's Jessica Fox are among the favourites to win inaugural gold medals in the event, but the chaotic nature of the four-person races makes them almost impossible to predict.\nThere will be six medals up for grabs, and an equal number of men and women competing.\nWHICH NEW SPORTS ARE RETURNING FROM TOKYO?\nThe Paris organisers have included sport climbing, skateboarding and surfing — all of which also featured as additional events at Tokyo 2020.\nClimbing: There will be two events for male and female competitors in Paris -- speed climbing and a combined bouldering and lead competition.\nSkateboarding: Skateboarding will have two disciplines, street and park.\nSurfing: Almost 16,000 km from the main Games venues, 48 surfers will compete in the shortboard events in Teahupo'o in Tahiti.\nWHICH SPORTS HAVE BEEN DROPPED?\nHaving made its Olympic debut at Tokyo 2020, karate was not included in the 2024 Games. Baseball-softball has also been dropped for Paris but will return at Los Angeles 2028. REUTERS", "url": "https://www.straitstimes.com/sport/what-are-the-changes-to-the-sports-programme-at-the-paris-2024-olympics"}