{"authors": [], "date_download": "2024-10-12 13:40:51", "date_modify": "2024-10-12 13:40:51", "date_publish": "2024-08-23 14:53:02", "description": "Everton manager Sean Dyche said he faces an early-season selection crisis with only 14 recognised first team players available for Saturday's Premier League trip to Tottenham Hotspur. Read more at straitstimes.com.", "filename": "sport_football_everton-squad-stretched-for-trip-to-spurs-dyche-says_1728740451.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/23/LYNXMPEK7M09A-1.jpg?VersionId=wkqWftripgxnYPi6pRidLdpjM9mBBodT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_everton-squad-stretched-for-trip-to-spurs-dyche-says_1728740451.html", "title": "Everton squad stretched for trip to Spurs, Dyche says", "title_page": "Everton squad stretched for trip to Spurs, Dyche says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Everton manager Sean Dyche said he faces an early-season selection crisis with only 14 recognised first team players available for Saturday's Premier League trip to Tottenham Hotspur.\nDespite generating some 70 million pounds ($91 million) from the sales of Amadou Onana, Lewis Dobbin and Ben Godfrey, Dyche says Everton may also have to consider offers for striker Dominic Calvert-Lewin.\n“We are stretched, unfortunately,\" Dyche told reporters on Thursday. \"We are down to around 14 recognised first-team players at the minute - that is not perfect.\"\nInjuries have hit the squad hard but Everton, who have spent around 40 million pounds on new signings, do not have the funds to bring in new faces.\n\"We have not got much financially to correct the situation,\" added Dyche. \"We have just got to work with the players and hope their fitness gets back to being fully fit and then staying fit.\"\nEverton may also have a big decision to make over Calvert-Lewin should a big offer come in.\n\"Any offer of a certain level would have to be looked at by the club. We are in a better position because of player trading and how much we have lowered the wages but it is not solved,\" said Dyche.\nEverton managed to escape relegation last season despite having points deducted twice for breaching the Premier League's Profitability and Sustainability Rules (PSR).\nEverton's takeover agreement with prospective owner 777 Partners expired in June while the Friedkin Group abandoned its plans to purchase a majority stake in the club last month.\nEverton were beaten 3-0 at home by Brighton & Hove Albion in their Premier League opener. REUTERS", "url": "https://www.straitstimes.com/sport/football/everton-squad-stretched-for-trip-to-spurs-dyche-says"}