{"authors": ["David Lee"], "date_download": "2024-10-12 13:44:50", "date_modify": "2024-10-12 13:44:50", "date_publish": "2023-10-04 19:54:34", "description": "He was knocked out in the round of 16 at the Asian Games by Malaysian Lee Zii Jia. Read more at straitstimes.com.", "filename": "sport_thailand-s-badminton-world-champion-kunlavut-vitidsarn-is-zen-like-even-in-defeat_1728740690.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/04/2023092939687010img0038.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_thailand-s-badminton-world-champion-kunlavut-vitidsarn-is-zen-like-even-in-defeat_1728740690.html", "title": "Thailand’s badminton world champion Kunlavut Vitidsarn is zen-like even in defeat", "title_page": "Thailand’s badminton world champion Kunlavut Vitidsarn is zen-like even in defeat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANGZHOU – Kunlavut Vitidsarn occasionally celebrates by sitting on the ground, legs crossed, as he closes his eyes and presses his fingers against his thumbs, a la Manchester City striker Erling Haaland’s meditation pose. Other times, he sticks his fingers in his ears, copying former Liverpool star Philippe Coutinho.\nThe 22-year-old is a massive Reds fan, but is more handy wielding a racket.\nEither way, the ability to tune out distractions has been key on his road to becoming a badminton world champion, in addition to the Thailand and India Open crowns in 2023.\nCalmness is especially key when his matches tend to go to the wire – each of his victories at the World Championships from the round of 16 came after three games, and his final against Japan’s Kodai Naraoka took a gruelling 109 minutes.\nAlmost always, Kunlavut prevails. Even when he does not – he fell 10-21, 21-19, 21-6 to Malaysian Lee Zii Jia in the Asian Games men’s singles round of 16 on Wednesday – he is unfazed.\nAfter his defeat at the Binjiang Gymnasium in Hangzhou, the world No. 4 told The Straits Times: “If I lose because my opponent played well with a good strategy, it’s okay.\n“I feel I have done well at this tournament because before I came here, I was down with influenza and hospitalised for four days, and trained only four days.”\nIt helps his zen-like mentality when Kunlavut is able to move around in Thailand without being recognised and mobbed like some Thai footballers are. After his Asiad elimination, only one journalist was at the mixed zone to interview him.\n“I like it this way because I don’t need the attention,” he said. “Even though I am a world champion, I have to start from zero, learn more from top players, don’t think so much, don’t put pressure on myself.”\nBut if there is one thing that sometimes stresses him out, it is his knack for marathon matches. He has played 44 matches this season and 20 of them have gone to a deciding third game, with Kunlavut prevailing on 18 occasions.\nHe laughed as he said: “No, no, no, I don’t enjoy playing three games because it is very tiring playing more than one hour. If possible, I will always want to win in two games.\n“I don’t need to play three games, but sometimes with the wind conditions, it is necessary because it is difficult to control and win on one side of the court. So, I have to be fitter and stronger than my opponent.”\nBesides training up to six hours a day, working on his fitness in the morning and technique on the court in the afternoon, the three-time world junior champion is also clear-headed to realise he cannot rely only on his trademark defence to outlast opponents.\nA call from his idol, Malaysian great Lee Chong Wei, affirmed his thinking, as Kunlavut shared: “He told me that when I’m on top in my matches, I need to assert my authority and kill off the points quickly. No need to play rallies and long matches, because I will be tired for the rest of the tournament.\n“To achieve my dreams, I need to change my playing style because now everyone knows how I play. I have three dreams – winning the world championships, All England and the Olympics.\n“I can try the All England every year, and the Olympics will be the most difficult because it happens only once every four years, but I will try my best, and I believe I can.”", "url": "https://www.straitstimes.com/sport/thailand-s-badminton-world-champion-kunlavut-vitidsarn-is-zen-like-even-in-defeat"}