{"authors": [], "date_download": "2024-10-12 13:42:33", "date_modify": "2024-10-12 13:42:33", "date_publish": "2024-07-05 15:21:03", "description": "LAHORE - The Champions Trophy headlines Pakistan's home 2024-25 season but doubts remain whether neighbours India will make the trip across the border for the elite 50-overs tournament, which is being held for the first time since 2017. Read more at straitstimes.com.", "filename": "sport_champions-trophy-headlines-pakistans-home-season-but-india-uncertainty-remains_1728740553.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/05/LYNXMPEK6409N-2.jpg?VersionId=FVT3IBL3R26YtXhLmoyZzMU.Iak7sUPl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_champions-trophy-headlines-pakistans-home-season-but-india-uncertainty-remains_1728740553.html", "title": "Champions Trophy headlines Pakistan's home season but India uncertainty remains", "title_page": "Champions Trophy headlines Pakistan's home season but India uncertainty remains | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LAHORE - The Champions Trophy headlines Pakistan's home 2024-25 season but doubts remain whether neighbours India will make the trip across the border for the elite 50-overs tournament, which is being held for the first time since 2017.\nThanks to their soured political relations, India have not visited Pakistan since 2008 and the cricket-mad countries play each other only at multi-team events.\nPakistan hosted the Asia Cup last year but eventual winners India were allowed to play all their matches in Sri Lanka under what the organisers called a \"hybrid model\".\nIndia said they did not get permission from their government to tour Pakistan for the Asia Cup last year.\nPakistan's home fixtures, released on Friday, also include test series against Bangladesh, England and West Indies followed by a 50-overs tri-series also involving New Zealand and South Africa in February next year.\nPakistan's cricket board (PCB) is revamping Lahore's Gaddafi Stadium for the 2025 Champions Trophy and has proposed hosting the tournament between Feb. 19 and March 5.\nThe governing International Cricket Council will announce dates and venues for the tournament \"in due course\", the PCB said in a statement.\nPCB chairman Mohsin Naqvi said the upcoming visits of five top cricket playing nations as well as several other countries participating in the Champions Trophy over the next eight months highlighted Pakistan's standing in the sport.\n\"We deeply value the participation of these teams and players, who will bring immense talent and competitive spirit to our fields,\" he added.\nOfficials at the Board of Control for Cricket in India were not immediately available for comment but BCCI vice president Rajeev Shukla recently said they would only go if the Delhi government gives the go ahead.\nPakistan won the last edition of the Champions Trophy when it was held in England in 2017 before it was discontinued due to a crowded calendar. However, it is being reintroduced with the ICC keen to stage a big event every year. REUTERS", "url": "https://www.straitstimes.com/sport/champions-trophy-headlines-pakistans-home-season-but-india-uncertainty-remains"}