{"authors": [], "date_download": "2024-10-12 14:00:53", "date_modify": "2024-10-12 14:00:53", "date_publish": "2024-07-30 21:54:04", "description": "PARIS - Tennis players at the Olympics will be allowed a 10-minute break between the second and third sets in singles on Tuesday due to extreme heat, the International Tennis Federation (ITF) said. Read more at straitstimes.com.", "filename": "sport_tennis_tennis-singles-players-allowed-10-minute-break-due-to-extreme-heat_1728741653.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/30/LYNXMPEK6T0MP-1.jpg?VersionId=b2P_gW39B4xlrIDnczn594pX8B3LYAeP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_tennis-singles-players-allowed-10-minute-break-due-to-extreme-heat_1728741653.html", "title": "Tennis-Singles players allowed 10-minute break due to extreme heat", "title_page": "Tennis-Singles players allowed 10-minute break due to extreme heat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Tennis players at the Olympics will be allowed a 10-minute break between the second and third sets in singles on Tuesday due to extreme heat, the International Tennis Federation (ITF) said.\nWith the Paris temperature expected to reach 35 degrees Celsius (95°F) the decision was based on the so-called \"Wet Bulb Globe Temperature\" which measures potential heat stress in direct sunlight.\nDuring the break, to be granted at the request of either player, players can take a shower, change their outfit, have something to eat or drink or go to the bathroom but they cannot have medical treatment or talk with their coach, under ITF rules.\nDoubles matches, which are settled with a match tiebreak at one set all, would not feature the 10-minute break, the ITF said.\nIf the temperature at Roland Garros continued to rise, a panel including the tournament referee and medical professionals, could decide to suspend play.\nThe women's tennis has reached the third round while the men were playing second-round matches on Tuesday. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/tennis-singles-players-allowed-10-minute-break-due-to-extreme-heat"}