{"authors": [], "date_download": "2024-10-12 13:39:16", "date_modify": "2024-10-12 13:39:16", "date_publish": "2024-09-24 01:53:33", "description": "Rodri’s loss would be a huge blow to City’s hopes of winning a fifth consecutive Premier League title. Read more at straitstimes.com.", "filename": "sport_football_man-citys-rodri-out-for-season-after-acl-injury-reports_1728740356.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/btrodri20240924.JPG?VersionId=G95Jq6iPyS2gNfi.Ggh2jFwY_bNei79s", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_man-citys-rodri-out-for-season-after-acl-injury-reports_1728740356.html", "title": "Man City’s Rodri ‘out for season’ after ACL injury: Reports", "title_page": "Man City’s Rodri ‘out for season’ after ACL injury: Reports | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Manchester City’s influential midfielder Rodri could miss the rest of the season due to an anterior cruciate ligament injury (ACL), according to reports on Sept 23.\nThe 28-year-old limped off during City’s 2-2 draw against Arsenal in the English Premier League a day earlier after going down holding his right knee.\nESPN and Spanish sports daily Marca reported that tests have confirmed an ACL tear. Rodri’s loss would be a huge blow to City’s hopes of winning a fifth consecutive league title and ambitions of reclaiming the Champions League.\nSince his Premier League debut in August 2019, City have lost a third of their games without Rodri in the side (seven of 21).\nHe has been touted as a potential Ballon d’Or winner in 2024 after his influential role in City’s latest league title and Spain’s success at Euro 2024.\n“Rodri is strong. He leaves the pitch in this action because he felt something, otherwise Rodri stays there,” City boss Pep Guardiola said after the Arsenal match.\n“He’s the best holding midfielder in the world. He is a potential Ballon d’Or winner. I would love for him to win (the Ballon d’Or).”\nCity were already light in cover for Rodri and his absence leaves a gaping hole in the middle of Guardiola’s midfield.\nMateo Kovacic has deputised in the holding midfield role early in the season as Rodri was bedded in slowly after his exertions in winning Euro 2024’s player of the tournament.\nCity were in League Cup action on Sept 24 against Watford, a little over 48 hours after facing Arsenal. The match kicked off after press time.\nIn other news, former Arsenal great Ian Wright has called City striker Erling Haaland cowardly for throwing the ball at Gunners centre-back Gabriel Magalhaes during their draw at the Etihad Stadium.\nHaaland threw the ball against the back of Gabriel’s head after City’s John Stones scored deep in added time to salvage a point against 10-man Arsenal and keep his side top of the table.\nA Football Association spokesperson said the incident involving Haaland and Gabriel was checked by the video assistant referee at the time and no further action was deemed necessary.\n“The one thing that boiled me up properly was Haaland’s coward’s move,” Wright posted on Instagram. “Throwing the ball in Gabi’s head when he’s not looking. When Gabi’s back’s turned to him. Real coward’s move.\n“I’m looking at this as a really good defender v striker for the years to come, them two. I love watching them two. And then you’re doing a coward’s move like that... I thought you was bigger than that, bro.” AFP, REUTERS", "url": "https://www.straitstimes.com/sport/football/man-citys-rodri-out-for-season-after-acl-injury-reports"}