{"authors": [], "date_download": "2024-10-12 13:43:28", "date_modify": "2024-10-12 13:43:28", "date_publish": "2024-09-20 10:46:01", "description": "The goalkeeper saves Mateo Retegui’s penalty and then springs across goal to claw out the same player’s headed rebound effort. Read more at straitstimes.com.", "filename": "sport_football_david-raya-s-save-was-best-i-ve-seen-in-my-career-says-mikel-arteta_1728740608.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/20/2024-09-19T205353Z1927031554UP1EK9J1KA1QBRTRMADP3SOCCER-CHAMPIONS-ATA-ARS-REPORT.JPG?VersionId=9sdykPkhn4Lp6LhA7tkqFCy8URJhRlO5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_david-raya-s-save-was-best-i-ve-seen-in-my-career-says-mikel-arteta_1728740608.html", "title": "David Raya’s save was best I’ve seen in my career, says Mikel Arteta", "title_page": "David Raya’s save was best I’ve seen in my career, says Mikel Arteta | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERGAMO – Arsenal manager Mikel Arteta hailed his goalkeeper David Raya, after the Spaniard’s miraculous double save earned his side a 0-0 draw away to Atalanta in the Champions League on Sept 19.\nBut for Raya saving Mateo Retegui’s 51st-minute penalty and then somehow springing across his goal to claw out the same player’s headed rebound effort, the Gunners could have begun their campaign with a damaging defeat.\n“I witnessed two of the best saves I’ve ever seen in my career from David in that moment,” Arteta said.\n“If you can’t win, you have to take the point. We started well, then we lost control and were very inconsistent. We didn’t suffer defensively, apart from the penalty.”\nAtalanta coach Gian Piero Gasperini was equally in awe.\n“He’s a cat. The first save is good but the rebound is unbelievable. The goalkeeper has been crucial,” the Italian said.\nRaya was modest about his efforts, saying he had been lucky, while also paying tribute to Arsenal’s goalkeeping coach Inaki Cana, whom he consulted as the video assistant referee checked the penalty decision.\n“It was a long time to decide if it was a penalty, so I took the decision to go to the side and I went to speak with the goalie coach about where to go and where not to go,” he said.\n“He helped me a lot in every aspect, so credit to him.”\nWhile it was a decent start by Arsenal, Arteta was less happy with his team’s performance, as they offered little in the way of attacking threat against last season’s Europa League winners.\n“We had moments with the ball but we never got it into dominance or threat,” he added.\n“The first 25 minutes, we read their approach really good. After that, we lost control of the game.”\nIn another match, Barcelona coach Hansi Flick is not worried about his side’s display despite, a 2-1 defeat by Monaco.\nMonaco exploited their man advantage after Barcelona’s Eric Garcia, who was deputising in midfield, was sent off only 11 minutes in, before goals from Maghnes Akliouche and George Ilenikhena secured the win for the French side. Lamine Yamal scored Barca’s goal.\nFlick, who has led Barcelona to a five-match winning run in La Liga, remained positive after his first defeat in charge.\n“With (Garcia’s) red card, the game changed totally, but I can see the positives. We tried to defend as a team and attack as a team. We had chances, but they deserved to win,” he said.\n“I have told the team to lift their heads up because they are disappointed... It’s the time to recover, hopefully players will be back with a lot of energy.” REUTERS", "url": "https://www.straitstimes.com/sport/football/david-raya-s-save-was-best-i-ve-seen-in-my-career-says-mikel-arteta"}