{"authors": [], "date_download": "2024-10-12 14:16:52", "date_modify": "2024-10-12 14:16:52", "date_publish": "2023-10-06 16:48:48", "description": "The Dutchman requires just three points to seal his third consecutive Formula One world title. Read more at straitstimes.com.", "filename": "sport_formula-one_lewis-hamilton-praises-phenomenal-max-verstappen-for-raising-the-bar_1728742612.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/06/AUTO-PRIX-F1-HUN-QUALIFYING-153733.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_lewis-hamilton-praises-phenomenal-max-verstappen-for-raising-the-bar_1728742612.html", "title": "Lewis Hamilton praises ‘phenomenal’ Max Verstappen for ‘raising the bar’", "title_page": "Lewis Hamilton praises ‘phenomenal’ Max Verstappen for ‘raising the bar’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA – Lewis Hamilton on Thursday praised his erstwhile title rival Max Verstappen for “raising the bar” this season, while Fernando Alonso compared the Dutchman to Formula One great Michael Schumacher.\nSpeaking ahead of this weekend’s Qatar Grand Prix, where Red Bull’s Verstappen is poised to clinch his third consecutive world title, seven-time champion Hamilton hailed the 26-year-old for his phenomenal year.\n“I wouldn’t rank him,” said the Mercedes driver, when asked to do just that. “Ranking people is an opinion-based thing. But I do think he’s earned his position and he’s done an amazing job with the package that he has.\n“He and the team have been phenomenal this year. Faultless. And I think they’ve raised the bar.”\nOn what his team can learn from Verstappen and Red Bull, the Briton added: “As a team, we have to look at that and say... ‘Okay, these are the areas that we need to develop to be able to match that and compete’.\n“I do hope at some stage we can fight them and actually have them in a defending position, but they should definitely enjoy the moment, they’ve worked for it.”\nRed Bull have secured their second consecutive constructors’ title.\nVerstappen, who has won 13 races so far with six left in this 22-race season, requires just three points to seal another drivers’ triumph and is expected to do that in Saturday’s sprint race at the Lusail International Circuit.\nHe has very rarely received praise from Hamilton since their ferocious rivalry during the 2021 season, when some unexpected decisions by officials at the Abu Dhabi Grand Prix appeared to deprive the Briton of an eighth title in controversial fashion as Verstappen claimed victory.\nAston Martin’s two-time champion Alonso, meanwhile, divided opinions in the paddock when he suggested that Verstappen was Formula One’s best driver since Schumacher, overlooking Hamilton’s achievements.\nWhen asked if Verstappen deserved a place among the sport’s modern greats, the Spaniard said: “I’ve only been wheel-to-wheel with Michael, but with Michael maybe, yes.\n“And for the next few years, he will keep adding championships, so we will compare him with Michael even closer.”\nSchumacher won seven titles, a record the German shares with Hamilton.\nHe was also Alonso’s main rival – the pair were involved in many thrilling battles when the latter won his titles with Renault in 2005 and 2006.\nAlonso’s omission of Hamilton raised eyebrows, but was no great surprise as the duo endured a highly strained season as teammates at McLaren in 2007, Hamilton’s rookie year.\n“Michael’s achievements were incredible,” said Verstappen, in response to Alonso’s praise.\n“But when he was achieving these kind of things, it was seen as normal because he was an amazing driver, with an amazing team and everything came together.\n“I don’t think about reaching seven (titles). We will see year by year what happens, but I am very proud. I live in the moment – and I want to achieve more.” AFP, REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/lewis-hamilton-praises-phenomenal-max-verstappen-for-raising-the-bar"}