{"authors": [], "date_download": "2024-10-12 13:42:25", "date_modify": "2024-10-12 13:42:25", "date_publish": "2024-01-17 03:32:19", "description": "Everton made mistakes but have taken steps to do things correctly, manager Sean Dyche said on Tuesday after the club were charged with breaking the Premier League's spending rules. Read more at straitstimes.com.", "filename": "sport_football_there-were-mistakes-but-everton-took-steps-to-do-the-right-thing-dyche_1728740545.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/17/LYNXMPEK0F0U5-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_there-were-mistakes-but-everton-took-steps-to-do-the-right-thing-dyche_1728740545.html", "title": "There were mistakes but Everton took steps to do the right thing: Dyche", "title_page": "There were mistakes but Everton took steps to do the right thing: Dyche | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Everton made mistakes but have taken steps to do things correctly, manager Sean Dyche said on Tuesday after the club were charged with breaking the Premier League's spending rules.\nThe Merseyside club, who have appealed against a previous 10-point deduction from earlier this season, are potentially facing a second points penalty due to the fresh charges brought on Monday.\n\"Certainly in the recent stats and facts I think we are in the bottom three or four net spends in the last three or four seasons,\" Dyche told reporters ahead of Wednesday's FA Cup third round replay against Crystal Palace.\n\"So there is a start point of the club motioning to doing things correctly... there were mistakes, I'm sure, down the years... but that's a natural part of football. It's not an exact science.\"\nDyche said the club had been \"cutting resources\" in an effort to adhere to the league's rules.\n\"Since I have been here we have let players go out of contract. We have been working hard. We sold three young players in the timelines we were given to make sure the money was in,\" he said.\nThe manager said Everton would remain focused on their appeal against the 10-point deduction.\n\"It's an on-pitch sanction and we've actually been cutting the idea of being on-pitch powerful by resources to do the right thing... it is a strange situation,\" Dyche said.\n\"I don't think it was just me who was shocked. The pundits, the media were all shocked so we have to wait and see what the appeal brings.\"\nEverton are 17th in the league with 17 points after 21 matches, just one above the relegation zone. REUTERS", "url": "https://www.straitstimes.com/sport/football/there-were-mistakes-but-everton-took-steps-to-do-the-right-thing-dyche"}