{"authors": [], "date_download": "2024-10-12 13:39:17", "date_modify": "2024-10-12 13:39:17", "date_publish": "2024-08-27 20:43:16", "description": "Newcastle United midfielder Sandro Tonali will be included in the squad to play Nottingham Forest in the League Cup second round after completing a 10-month ban for breaching betting rules, manager Eddie Howe said on Tuesday. Read more at straitstimes.com.", "filename": "sport_football_newcastles-tonali-will-be-in-squad-to-face-forest-says-howe_1728740357.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/27/LYNXMPEK7Q0HQ-1.jpg?VersionId=ylvrqrFXo1kS02CycRuPaGga10ac_fKm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_newcastles-tonali-will-be-in-squad-to-face-forest-says-howe_1728740357.html", "title": "Newcastle's Tonali will be in squad to face Forest, says Howe", "title_page": "Newcastle's Tonali will be in squad to face Forest, says Howe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Newcastle United midfielder Sandro Tonali will be included in the squad to play Nottingham Forest in the League Cup second round after completing a 10-month ban for breaching betting rules, manager Eddie Howe said on Tuesday.\nThe 24-year-old Italian was banned by the Italian Football Federation in October last year, and was given a two-month suspended ban by the Football Association for contravening betting rules following his move to the Premier League.\nThe former AC Milan player attended treatment sessions for problem gamblers and has given talks to warn about the dangers of gambling addiction.\n\"He'll definitely be in the squad (on Wednesday) providing he comes through training today,\" Howe told reporters.\n\"He's fit. He just hasn't had the match time, the 11 v 11, which players will tell you is the most important thing within the game.\n\"He's done everything else. He's worked incredibly hard with the sports science team to be on top of his fitness and to make sure he's fitter than he was when he was banned.\"\nTonali scored on his league debut with Newcastle last season, his only goal in 12 appearances with the club before his ban started in ate October. He was also ineligible to play for Italy at the European Championship.\n\"When you have a long time out, you have a long time to analyse and reflect. Now it is just back to doing what he loves. It will be an incredible release for him,\" Howe added.\n\"The microscope is on everybody and it will be on him for a period of time. He understands that and we understand that. It is just about small steps.\n\"He has to play to his strengths and not do anything too out of the ordinary.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/newcastles-tonali-will-be-in-squad-to-face-forest-says-howe"}