{"authors": [], "date_download": "2024-10-12 13:42:29", "date_modify": "2024-10-12 13:42:29", "date_publish": "2024-02-15 23:38:26", "description": "British media reports have suggested Hodgson, 76, is about to be sacked by Palace. Read more at straitstimes.com.", "filename": "sport_football_crystal-palace-cancel-press-conference-after-manager-roy-hodgson-is-taken-ill_1728740549.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/15/2024-02-15T115812Z1730918230RC22V5ADEOU4RTRMADP3SOCCER-ENGLAND-HODGSON.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_crystal-palace-cancel-press-conference-after-manager-roy-hodgson-is-taken-ill_1728740549.html", "title": "Crystal Palace cancel press conference after manager Roy Hodgson is taken ill", "title_page": "Crystal Palace cancel press conference after manager Roy Hodgson is taken ill | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Crystal Palace cancelled a press conference on Feb 15 after under-pressure manager Roy Hodgson was taken ill during training earlier in the day.\nThe 76-year-old former England boss was due to speak at 1330 GMT (9.30pm Singapore time) to preview the Feb 19 Premier League game away to Everton.\nBritish media reports have suggested Hodgson is about to be sacked by Palace, who are currently 15th in the Premier League table and five points above the relegation zone, with ex-Eintracht Frankfurt manager Oliver Glasner tipped to take over at the south London club.\nPalace confirmed the briefing would not go ahead with a short statement that said: “Unfortunately, today’s press conference will no longer take place as scheduled, as Roy Hodgson was taken ill during this morning’s training session.”\nHodgson, took charge of his 200th match as Palace manager earlier this week, but his side were beaten 3-1 at Selhurst Park by London rivals Chelsea.\nPalace have won three league games since beating Manchester United at Old Trafford in September and have lost 10 of their past 16 top-flight matches.\nHodgson, a boyhood Palace fan, is in his second spell in charge at Selhurst Park after returning for the final 10 games of last season when he signed a short-term deal to take over from Patrick Vieira.\nHe guided the Eagles to an impressive 11th-place finish in the table before agreeing to continue as manager for the 2023/24 season.\nBut recent weeks have seen supporters displaying banners calling for the much-travelled and vastly-experienced Hodgson to be sacked, with fans also venting their anger at the Palace board. AFP", "url": "https://www.straitstimes.com/sport/football/crystal-palace-cancel-press-conference-after-manager-roy-hodgson-is-taken-ill"}