{"authors": [], "date_download": "2024-10-12 13:42:08", "date_modify": "2024-10-12 13:42:08", "date_publish": "2024-07-24 00:55:08", "description": "PARIS - Brisbane Olympic chief Andrew Liveris has implored local politicians to stop using the 2032 Games as a political football and start embracing the \\\"great gift\\\" of the global sporting showpiece. Read more at straitstimes.com.", "filename": "sport_brisbane-wrangles-with-political-flip-flops-on-long-road-to-2032_1728740528.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/24/LYNXMPEK6M0RW-1.jpg?VersionId=.gQkoeIwrK3s_3YPGv1TKmWCmSGvOAAY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_brisbane-wrangles-with-political-flip-flops-on-long-road-to-2032_1728740528.html", "title": "Brisbane wrangles with political flip-flops on long road to 2032", "title_page": "Brisbane wrangles with political flip-flops on long road to 2032 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Brisbane Olympic chief Andrew Liveris has implored local politicians to stop using the 2032 Games as a political football and start embracing the \"great gift\" of the global sporting showpiece.\nLiveris said his team of organisers had been challenged by changing targets as they plan the delivery of the Games after a row over what venues would be built or refurbished for the Olympics became a key issue in recent elections.\nThe rows have negatively impacted local sentiment towards the Games and although Liveris was confident that would change over the next eight years, he asked politicians to play their part in making it happen.\n\"I really ask them to stop making the Olympics a political football. Please,\" Liveris, the president of the organising committee, told reporters in Paris on Tuesday.\n\"This is a gift. This is a great gift. Let's get the enthusiasm for what we've been given right and then whatever ends up happening on venues, we will deliver.\n\"We're a nation that can deliver this very well. And Brisbane is not a hillbilly town. It's not the strange place up north. It's a very cosmopolitan.\"\nOrganisers originally planned to revamp Brisbane's Gabba cricket stadium to host the opening and closing ceremonies as well as the athletics but the local government blanched at the cost and ordered a review of plans last December.\nThe Quirk review reported in March and proposed a new purpose-built 55,000-seat Olympic stadium be constructed in an inner city park at a cost of A$3.4 billion ($2.25 billion).\nQueensland State Premier Steven Miles rejected that recommendation on the grounds of cost and decided rugby stadium Lang Park would host the ceremonies with the track and field shunted to QSAC in southern suburbs of the city.\n\"I think we just got to let the good stuff come out and let it come out for good reasons. Once you let the good stuff out and you say, 'I'm going to deliver this', you deliver that, yeah?\" Liveris added.\n\"Don't whiplash the population. Don't change things for the sake of experience in the moment. This is a long term project, right? (Eight) years and I think adding an overlay of positive goodwill, I think that's in our future.\"\nLiveris earlier made a presentation to the International Olympic Committee (IOC) in which he said his team was on track to deliver \"a great Games\" in 2032.\nHe added that he was keen to learn as much as possible from the Paris Games, which open on Friday, and the Los Angeles Olympics in 2028. REUTERS", "url": "https://www.straitstimes.com/sport/brisbane-wrangles-with-political-flip-flops-on-long-road-to-2032"}