{"authors": [], "date_download": "2024-10-12 14:03:16", "date_modify": "2024-10-12 14:03:16", "date_publish": "2024-06-03 03:36:03", "description": "PARIS - Highlights of the eighth day at the French Open on Sunday (times GMT): Read more at straitstimes.com.", "filename": "sport_tennis_french-open-day-eight_1728741796.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/03/LYNXMPEK5109G-1.jpg?VersionId=lq_IYMtxbfC_6iky7rIe8tN4kXdfzbjF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_french-open-day-eight_1728741796.html", "title": "French Open day eight", "title_page": "French Open day eight | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Highlights of the eighth day at the French Open on Sunday (times GMT):\n1925 DIMITROV SEES OFF HURKACZ\nTenth seed Grigor Dimitrov defeated Polish eighth seed Hubert Hurkacz 7-6(5) 6-4 7-6(3) on Court Suzanne-Lenglen. The Bulgarian reached the quarter-finals after a fall caused his hand to bleed and required on-court treatment.\nREAD MORE:\nJabeur ends Tauson's run to reach French Open quarters\nSwiatek speeds into French Open quarters, scheduling comes under criticism\nFrench Open order of play on Monday\nAlcaraz glides past Auger-Aliassime into French Open quarter-finals\nSwiatek demolishes Potapova in 40 minutes to reach French Open quarter-finals\nTsitsipas beats Arnaldi to reach French Open quarter-finals\nGauff cruises past Cocciaretto to French Open quarter-finals\nSwiatek, Gauff not in favour of late matches after Djokovic marathon\nFreedom and flair, Jabeur's name of the game in French Open hunt\nMarathon man Djokovic hangs on in latest ever finish at French Open\nDjokovic credits crowd with getting him through French Open late, late show\nZverev survives Griekspoor marathon to advance at French Open\nMedvedev overcomes fearless Machac to move into last 16\nSabalenka keeps up good-luck ritual of signing trainer's bald head\nUmpire swoops to rescue injured pigeon at French Open\nDe Minaur tries to track down young superfan\n1608 JABEUR MOVES PAST TAUSON INTO QUARTERS\nTunisian eighth seed Ons Jabeur beat Clara Tauson of Denmark 6-4 6-4 to reach the quarter-finals at Roland Garros for the second successive year, where she will play American third seed Coco Gauff.\n1430 ALCARAZ SETS UP TSITSIPAS QUARTER-FINAL CLASH\nThird seed Carlos Alcaraz had little trouble in beating Felix Auger-Aliassime, sealing a 6-3 6-3 6-1 victory over the Canadian to move into the quarter-finals where he will face Stefanos Tsitsipas.\n\"He's said in the past he likes playing against me, so I hope he likes it a little bit less this time,\" Tsitsipas said. \"I hope I can get him to that stage of feeling that it's not so comfortable playing against me.\"\n1405 TSITSIPAS THROUGH TO QUARTERS\nGreek ninth seed Stefanos Tsitsipas overcame an early blip to beat Italy's Matteo Arnaldi 3-6 7-6(4) 6-2 6-2 on Court Suzanne-Lenglen to move into the quarter-finals.\n1113 GAUFF EASES PAST COCCIARETTO\nAmerican third seed Coco Gauff comfortably beat Italy's\nElisabetta Cocciaretto 6-1 6-2 to reach the quarter finals.\nGauff will play the winner of the fourth round match between Tunisian eighth seed Ons Jabeur and Denmark's Clara Tauson.\n1029 VONDROUSOVA DOWNS DANILOVIC\nCzech fifth seed Marketa Vondrousova eased to a 6-4 6-2 fourth round victory over Serbian qualifier Olga Danilovic.\nThe former finalist will play three-time champion Iga Swiatek in the quarter-finals.\n0950 SWIATEK STORMS PAST POTAPOVA WITH DOUBLE BAGEL\nThree-time French Open champion and world number one Iga Swiatek crushed Russian Anastasia Potapova 6-0 6-0 to reach the quarter-finals.\nThe Polish top seed looked in a hurry as she rattled off the double-bagel win in 40 minutes.\n0908 PLAY UNDER WAY\nPlay began under sunny skies at Roland Garros, with the temperature hovering around 14 degrees Celsius (57.2°F).\nWorld number one Iga Swiatek faces Anastasia Potapova in the opening match on Court Philippe-Chatrier, with two-times Grand Slam champion Carlos Alcaraz in action against Canada's Felix Auger-Aliassime later. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/french-open-day-eight"}