{"authors": [], "date_download": "2024-10-12 13:41:15", "date_modify": "2024-10-12 13:41:15", "date_publish": "2024-05-17 21:38:36", "description": "Arsenal boss Mikel Arteta said he hopes his former manager David Moyes can give them a helping hand in the Premier League title race when West Ham United travel to leaders Manchester City on the final day of the season. Read more at straitstimes.com.", "filename": "sport_football_optimistic-arteta-hopes-for-helping-hand-from-moyes-in-title-race_1728740475.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/17/LYNXMPEK4G0HS-1.jpg?VersionId=jko.kR6UHW5ehsdmeVolt4F.RYFE4gJS", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_optimistic-arteta-hopes-for-helping-hand-from-moyes-in-title-race_1728740475.html", "title": "'Optimistic' Arteta hopes for helping hand from Moyes in title race", "title_page": "'Optimistic' Arteta hopes for helping hand from Moyes in title race | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Arsenal boss Mikel Arteta said he hopes his former manager David Moyes can give them a helping hand in the Premier League title race when West Ham United travel to leaders Manchester City on the final day of the season.\nArsenal, who face Everton at home, are two points behind City heading into Sunday's final round of fixtures. While Arsenal must win to have a chance, City can secure a fourth title in as many seasons if they beat West Ham.\nMoyes signed Arteta in 2005 when he was Everton manager, bringing the Spanish midfielder to England where he spent the rest of his playing career before going into management.\n\"He's been instrumental and so important in my career, as a footballer and a person. He could help us to fulfil our dream and my personal dream to win the Premier League,\" Arteta told reporters on Friday.\n\"The only thing we've discussed is to give ourselves an opportunity to live a beautiful day. It's possible, it's football. We have to play like every single week.\n\"We have to win, then hope West Ham to help us achieve us our dream. That first part is on us, it's the only thing we can focus on.\"\nArsenal fell short by five points last season when their title challenge collapsed in May but this time they have been with City every step of the way in the closest title race in Premier League history.\nAnd Arteta said he cannot afford to think about what would happen if they lose the title to City again.\n\"I can't think like this. We have to win the game and we hope something beautiful is going to happen,\" he said.\n\"If I don't believe today, imagine how much I could believe in August. From August, 38 games against Man City after what they've done in 12 or 13 years, and what we've done in that time... we can't think like this.\"\nArsenal's last league title came in the 2003-04 season when Arsene Wenger's side went the entire season unbeaten but the north London club have never been in this position in a title race since their move from Highbury to Emirates Stadium in 2006.\nA Premier League trophy will also be at the Emirates in case Arsenal manage to win the title.\n\"We are in the last day of the season playing for the Premier League trophy, which has not been at the Emirates which was built 20 years ago,\" Arteta said.\n\"The trophy is going to be there, it's possible. We have to do our duty, then hope what happens. Let's wish that's the case.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/optimistic-arteta-hopes-for-helping-hand-from-moyes-in-title-race"}