{"authors": [], "date_download": "2024-10-12 13:30:31", "date_modify": "2024-10-12 13:30:31", "date_publish": "2024-10-09 13:51:21", "description": "The global sports industry has a huge carbon footprint and also finds itself on the frontline of climate change. Read more at straitstimes.com.", "filename": "sport_sport-must-punch-its-weight-in-fight-against-climate-change-says-chris-boardman_1728739831.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/09/FRANCE-OLY-PARIS-2024-POLITICS-ENVIRONMENT-094122.jpg?VersionId=y14wsQiRq8N6.ijT3QZY5gJzcauK3UeX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_sport-must-punch-its-weight-in-fight-against-climate-change-says-chris-boardman_1728739831.html", "title": "Sport must punch its weight in fight against climate change, says Sport England chairman", "title_page": "Sport must punch its weight in fight against climate change, says Sport England chairman | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Sports clubs and organisations must raise their game and become leaders in the battle to prevent catastrophic climate change, Sport England chairman Chris Boardman said on Oct 8.\nOpening the Sport Positive Summit at the Oval cricket ground in London, the 1992 Olympic cycling gold medallist praised work being done by grassroots and professional clubs in Britain, but said sport is still not punching its weight.\n“If climate change is a ‘threat multiplier’, sport can be a ‘solution multiplier’. And as a sector, we can choose to help society use this unique gift,” Boardman told delegates from across the world of sport.\n“But despite some passionate pioneers, as a sector, we aren’t yet punching our weight. So, my call to action today is for a mindset shift, and a lifting of our ambition... We must leverage the unique platform of sport and physical activity to win hearts and minds.”\nThe global sports industry has a huge carbon footprint and also finds itself on the frontline of climate change with rising temperatures, flooding and droughts already having damaging impact across multiple events.\n“Sport’s carbon footprint and contribution to waste are massive,” added Boardman, who in July cycled from Manchester to the Paris Olympics to highlight environmental sustainability work being done by sports clubs.\n“We need to rewire the system so there are suitable incentives to do the right thing, and more consequences for doing the wrong thing.”\nThe 56-year-old praised the progress being made by some professional football clubs in England but said expanded Uefa and Fifa competitions and money-spinning pre-season tours were forcing teams and fans to fly huge distances.\n“I don’t believe in outright bans on flying, but we all need to strike a much better balance,” he said. “It is time for all of our top football clubs to step up, and put themselves on the right side of history.”\nBritish rower Imogen Grant, who won a gold medal at the Paris Olympics and on Oct 7 was named BBC Green Sports Awards Athlete of the Year for her role in highlighting clean water initiatives, said athletes were often placed in an awkward position by the demands of their chosen sport.\n“It is one of the really tricky things about being an athlete as part of a wider organisation, you’re not always the one pulling the strings,” the 28-year-old said.\n“As an individual it’s a lot easier to make those personal choices, but the more impactful ones are the ones that are made collectively.” REUTERS", "url": "https://www.straitstimes.com/sport/sport-must-punch-its-weight-in-fight-against-climate-change-says-chris-boardman"}