{"authors": [], "date_download": "2024-10-12 13:42:04", "date_modify": "2024-10-12 13:42:04", "date_publish": "2024-03-01 13:28:26", "description": "Sanctions for breaches of financial rules should be applied during the close season break to protect the competitive integrity of the Premier League, Everton manager Sean Dyche said. Read more at straitstimes.com.", "filename": "sport_football_everton-boss-dyche-calls-for-sanctions-to-be-applied-in-off-season_1728740524.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/01/LYNXNPEK2014H-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_everton-boss-dyche-calls-for-sanctions-to-be-applied-in-off-season_1728740524.html", "title": "Everton boss Dyche calls for sanctions to be applied in off-season", "title_page": "Everton boss Dyche calls for sanctions to be applied in off-season | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Sanctions for breaches of financial rules should be applied during the close season break to protect the competitive integrity of the Premier League, Everton manager Sean Dyche said.\nEverton were docked 10 points in November for violating the Premier League's profit and sustainability rules. The penalty was reduced to six points on Monday following an appeal.\nDyche said the deduction of points halfway through the season was not fair.\n\"What I've learned from the process and what I would suggest is they can't judge you in the middle of the season,\" the English manager told reporters ahead of his side's home league game with West Ham United.\n\"Surely it's better to do it at the end of the season and going into the new season? Any sanction won't be taken off you there and then but will be for the new season...\n\"You then have roughly three months (in pre-season) to do whatever you need to be the best competitive outfit you can be even with your sanctions.\"\nEverton face another potential points deduction after being charged with a separate breach of the league's financial rules in January. REUTERS", "url": "https://www.straitstimes.com/sport/football/everton-boss-dyche-calls-for-sanctions-to-be-applied-in-off-season"}