{"authors": [], "date_download": "2024-10-12 13:42:29", "date_modify": "2024-10-12 13:42:29", "date_publish": "2024-02-16 01:37:57", "description": "British media reports have suggested Hodgson is about to be sacked by Palace, who are 15th in the Premier League. Read more at straitstimes.com.", "filename": "sport_football_hodgson-in-stable-condition-after-falling-ill_1728740549.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/16/FBL-ENG-PR-BRIGHTON-CRYSTALPALACE-151246.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_hodgson-in-stable-condition-after-falling-ill_1728740549.html", "title": "Crystal Palace manager Roy Hodgson ‘stable’ in hospital after illness", "title_page": "Crystal Palace manager Roy Hodgson ‘stable’ in hospital after illness | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Roy Hodgson was in a “stable” condition in hospital, said Crystal Palace in a statement, after he was taken ill at a training session on Feb 15.\nThe club cancelled their under-pressure manager’s pre-match press conference.\nThe 76-year-old former England boss was due to speak at 1330 GMT (9.30pm Singapore time) to preview Palace’s Feb 19 Premier League game away to Everton.\nPalace confirmed the briefing would not go ahead with a short statement that said: “Unfortunately, today’s press conference will no longer take place as scheduled as Roy Hodgson was taken ill during this morning’s training session.”\nA later Palace statement: “Following news that Roy Hodgson was taken ill during today’s training session, we can confirm that he is now stable and is currently undergoing tests in hospital. “Everybody at the club sends their best wishes to Roy for a speedy recovery.”\nBritish media reports have suggested Hodgson is about to be sacked by Palace, who are 15th in the Premier League, five points above the relegation zone.\nEx-Eintracht Frankfurt manager Oliver Glasner has been tipped to take over at the south London club.\nHodgson took charge of his 200th match as Palace manager earlier this week but his side lost 3-1 at Selhurst Park by London rivals Chelsea.\nPalace have won just three league games since beating Manchester United at Old Trafford in September and have lost 10 of their past 16 top-flight matches.\nHodgson, a boyhood Palace fan, is in his second spell in charge after returning for the final 10 games of last season when he signed a short-term deal to take over from Patrick Vieira.\nHe guided the Eagles to an impressive 11th-place finish before agreeing to continue as manager for the 2023/24 season.\nIn recent weeks, supporters have displayed banners calling for Hodgson to be sacked, with fans also venting their anger at the Palace board. AFP", "url": "https://www.straitstimes.com/sport/football/hodgson-in-stable-condition-after-falling-ill"}