{"authors": [], "date_download": "2024-10-12 14:17:13", "date_modify": "2024-10-12 14:17:13", "date_publish": "2023-10-18 12:19:15", "description": "The season will start in Jeddah on March 7 and end at Yas Marina on Dec 8. Read more at straitstimes.com.", "filename": "sport_formula-one_women-s-f1-academy-to-support-seven-grands-prix-in-2024-including-in-singapore_1728742633.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/18/aagrandprix18102023.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_women-s-f1-academy-to-support-seven-grands-prix-in-2024-including-in-singapore_1728742633.html", "title": "Women’s F1 Academy to support seven grands prix in 2024, including in Singapore", "title_page": "Women’s F1 Academy to support seven grands prix in 2024, including in Singapore | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Formula One’s all-female F1 Academy will support seven grands prix next season with races on three continents starting in Saudi Arabia and ending in Abu Dhabi, the organisers announced on Tuesday.\nThe season will begin in Jeddah on March 7 and finish at Yas Marina on Dec 8. Other races will be in Miami (May 5), Barcelona (June 23), Zandvoort in the Netherlands (Aug 25), Singapore (Sept 22) and Qatar (Dec 1).\nThese seven races will double as support series to the Formula One world championship.\n“This global platform, combined with the support of all 10 F1 teams, will take the series to the next level, providing not only the opportunity for the drivers to develop their skills on F1 tracks, but to inspire young girls around the world to pursue a future in motorsport,” said F1 chief executive Stefano Domenicali.\nFormula One teams all agreed in July to each nominate a driver and have their livery on a car in the Academy from 2024. The series uses 1.4 litre-engined Tatuus F4 cars with a top speed of 240kmh.\n“This calendar cements our ambition to become a truly global series, expanding our reach and improving visibility for our mission,” said F1 Academy boss Susie Wolff.\n“We want to inspire young girls and women across the globe and show them that there’s a place for them in our sport, and racing alongside F1 will help us achieve this.”\nThe last woman to start a Formula One grand prix was the late Italian Lella Lombardi in 1976.\nPreviously, the all-female W Series ran for three seasons in 2019, 2021 and 2022 but its final year was cut short with three races remaining due to financial reasons.\nBritain’s Jamie Chadwick claimed the championship in all three editions.\nThe F1 Academy boasts five teams – ART Grand Prix, Campos Racing, MP Motorsport, Prema Racing and Rodin Carlin – who each have three drivers on the grid.\nIt is backed by the governing body FIA and F1 while the W Series was funded by several sponsors such as Puma, Heineken and Hankook. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/women-s-f1-academy-to-support-seven-grands-prix-in-2024-including-in-singapore"}