{"authors": [], "date_download": "2024-10-12 13:41:20", "date_modify": "2024-10-12 13:41:20", "date_publish": "2024-08-21 15:22:18", "description": "The Pakistan Cricket Board (PCB) has shot down media reports that the redevelopment of three stadiums to be used at next year's Champions Trophy will not be completed in time, saying only bilateral tests and domestic matches may be affected. Read more at straitstimes.com.", "filename": "sport_pakistan-board-says-stadium-revamps-wont-disrupt-champions-trophy_1728740480.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/21/CRICEKT-BAN-PRACTICE-110117.jpg?VersionId=Xj.T.gVMHurWU0DXN9zQbrTaQksLUFgH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_pakistan-board-says-stadium-revamps-wont-disrupt-champions-trophy_1728740480.html", "title": "Pakistan Cricket Board says stadium revamps won’t disrupt Champions Trophy", "title_page": "Pakistan Cricket Board says stadium revamps won’t disrupt Champions Trophy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Pakistan Cricket Board (PCB) has shot down media reports that the redevelopment of three stadiums to be used at next year's Champions Trophy will not be completed in time, saying only bilateral tests and domestic matches may be affected.\nThe Gaddafi Stadium in Lahore, National Stadium in Karachi and Rawalpindi International Cricket Stadium are being revamped for the Feb 19 to March 9 tournament next year.\nOngoing construction work may affect Pakistan's bilateral commitments this season, including the test against England in Karachi. The second test between Pakistan and Bangladesh has already been shifted from Karachi to Rawalpindi.\nPCB chairman Mohsin Naqvi spoke to the media following his inspection of the Gaddafi Stadium renovations in Lahore on Monday and said much work is still to be done as none of the stadiums currently meet international standards.\n“It is disappointing that certain media outlets have misrepresented PCB chair Mohsin Naqvi’s comments,\" the PCB said in a statement on Tuesday.\n\"The PCB chair clearly stated that the redevelopment and redesign of the three designated stadiums would be completed on schedule, ensuring readiness to host the ICC Champions Trophy 2025.\n\"While some domestic matches may need to be shifted to facilitate uninterrupted construction work, this in no way pertains to the ICC Champions Trophy, which remains a priority for the PCB as a premier eight-team international event.\"\nThe PCB have also appointed UK's BDP Pattern to improve the infrastructure of its cricket stadiums, the architecture company announced on Tuesday.\nPakistan won the last edition of the Champions Trophy when it was held in England in 2017 before it was discontinued due to a crowded calendar. However, it is being reintroduced with the ICC keen to stage a big event every year. REUTERS", "url": "https://www.straitstimes.com/sport/pakistan-board-says-stadium-revamps-wont-disrupt-champions-trophy"}