{"authors": ["Lin Tianbao"], "date_download": "2024-10-12 14:09:08", "date_modify": "2024-10-12 14:09:08", "date_publish": "2024-08-18 22:24:31", "description": "Players say the issue not only causes injuries, but also prevents them from training at the highest intensity. Read more at straitstimes.com.", "filename": "sport_basketball_more-work-ahead-to-fix-singapore-basketball-centre-s-slippery-courts_1728742148.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/18/tbbas18-02.jpg?VersionId=d5EnJcjL5UcqFVLyyI.Bj3XCSKKdcyuU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_more-work-ahead-to-fix-singapore-basketball-centre-s-slippery-courts_1728742148.html", "title": "More work ahead to fix Singapore Basketball Centre’s slippery courts", "title_page": "More work ahead to fix Singapore Basketball Centre’s slippery courts | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – In recent months, the two courts at the Singapore Basketball Centre in Aljunied, home of the Basketball Association of Singapore (BAS) and national teams, have sparked concerns.\nPlayers have found the floors to be slippery on rainy days, with the issue not only causing injuries, but also preventing them from training to their full capabilities.\nWhile the problem has been there over the years, it is only recently that those in the fraternity have spoken up about it.\nThey include former men’s national captain and ex-Singapore Slingers guard Leon Kwek, who told The Straits Times: “A lot of times, either we have to cut short our training or we cannot train to the most optimal level.\n“Basketball is a high-demand sport, and if we have a venue that doesn’t cater to safety, then injuries are bound to happen, especially at the level (we) play.”\nThe 28-year-old added that the issue existed even back when he was with the youth team and training sessions had to be toned down because of the courts’ condition.\n“(But) we’ve had a lot of cases where, when it’s raining, because we have important competitions coming up, we have no choice but to continue pushing training at the intensity that we hope we can go at,” he added.\nCurrently, National School Games and National Basketball League (NBL) Division One matches for both men and women’s teams are held there. The facility is owned by Sport Singapore and leased to BAS. When ST visited the venue on Aug 18, Team Nila volunteers were seen wiping the courts during timeouts.\nWhile he is not blaming anyone, Kwek emphasises that prevention is better than cure.\n“My concern is that we cannot wait for something to happen, then we make an action to correct it,” he added.\n“A lot of these (youth) athletes are the latest stars of the national team, and we don’t want them to compete in one of the competitions and due to a mishap… have a major injury that changes the trajectory of their careers.”\nA player from the women’s 3x3 national team, who declined to be named, has come across similar issues.\nThe player, who has training there every week night, said: “Because it’s slippery, the training intensity cannot be as high, because everybody just doesn’t want to fall down, right? Sometimes we just get around it by doing different drills and going to the gym.”\nSome of her friends have also injured their knees and ankles because of the slippery courts.\n“I know a few of my friends who got injured while they slipped on court, so I think it’s just a known thing,” she said.\nA player who has succumbed to injury at the facility is actor Chase Tan, who tore his anterior cruciate ligament while playing for the Eng Tat Hornets in an NBL Division One match in September 2022.\nThe 34-year-old said: “I was running back and trying to get a block when I stepped on the slippery ground. When I took my first step, my right knee twisted.”\nHe was upset by the non-contact injury, with the setback forcing him to miss filming for a variety show, while even daily activities such as showering became a challenge.\nWhile he has returned to club action, he now has a “phobia of certain actions such as sprinting back to defend”.\nThe female player hopes that more can be done to solve the problem. She said: “I believe the management are aware of it, because they did try and redo the surface of the court floor, but I think… the effect wasn’t as good as maybe they had hoped.”", "url": "https://www.straitstimes.com/sport/basketball/more-work-ahead-to-fix-singapore-basketball-centre-s-slippery-courts"}