{"authors": [], "date_download": "2024-10-12 13:41:51", "date_modify": "2024-10-12 13:41:51", "date_publish": "2024-07-05 20:36:06", "description": "BERLIN - Many Dutch fans at Euro 2024 have turned down the allure of Berlin's downtown hotels, preferring instead the camaraderie of campsites on the outskirts of the city ahead of their quarter-final against Turkey. Read more at straitstimes.com.", "filename": "sport_dutch-fans-turn-campsites-orange-ahead-of-turkey-quarter-final-clash_1728740511.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/05/LYNXMPEK640JB-1.jpg?VersionId=XVyYbd4uuBJPyqNkaET7wFN7smDOdRTt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_dutch-fans-turn-campsites-orange-ahead-of-turkey-quarter-final-clash_1728740511.html", "title": "Dutch fans turn campsites orange ahead of Turkey quarter-final clash", "title_page": "Dutch fans turn campsites orange ahead of Turkey quarter-final clash | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - Many Dutch fans at Euro 2024 have turned down the allure of Berlin's downtown hotels, preferring instead the camaraderie of campsites on the outskirts of the city ahead of their quarter-final against Turkey.\nAt one such site in Kleinmachnow, a 25-minute drive from Berlin's Olympiastadion, supporters of the \"Oranje\" sipped their morning coffee on Friday as they awaited an influx of fellow fans.\n\"It's a holiday for the four of us, my friends. The four of us are on the road for almost three weeks, and we hope to make it four and a half weeks,\" Gert Grimmius told Reuters outside a motorhome.\nGrimmius, his friend Fienus Baas and their wives are confident that the Dutch can beat Turkey and extend their stay, and they have enjoyed the chance to meet other fans as they camped.\n\"That is also the sport, connecting with each other... on a campsite, then you also connect with each other, just having a chat, just this and that,\" Grimmius, 71, said.\n\"Analysing the match before it's time - what are we going to do? We (Dutch) are supposedly 18 million national team coaches, everyone has their opinion about that, (but) ultimately, of course, our great friend Koeman decides,\" he added.\nGrimmius has followed the team for decades and was at the final when the Dutch won Euro 88 in Munich, beating the Soviet Union 2-0.\nWith many of Turkey's fans expected to come from the local diaspora, campsites around Berlin were preparing on Friday for a huge influx of Dutch fans ahead of Saturday's game.\n\"I think that the Dutch will also be inspired by the singing of the Turks, they are all friends in sport, of course,\" Grimmius said.\nNetherlands jerseys and orange t-shirts and shorts fluttered in the breeze outside the motorhomes and tents, washed and ready for Saturday's game, as more and more Dutch-registered vehicles pulled into the campsite to begin their stay.\nBefore their clash with Turkey, the Netherlands fans at the campsite plan to gather on Friday evening to watch the game between Germany and Spain, which will see one of their most-feared rivals for the title go home.\nAfter that, a good night's sleep and what they expect will be a clear victory over Turkey.\n\"You don't have any guarantees, but we are winners, so we are positive, and we believe in it,\" Grimmius said.\nAs the quarter-finals get underway on Friday evening, excitement is rising, even in the laid-back atmosphere of the campsite.\n\"The so-called strong countries, everyone is there, but Germany, France, Portugal, Spain, we avoid them all the way to the final. So tonight yes, it's the day of reckoning, as we say in the Netherlands,\" Grimmius said. REUTERS", "url": "https://www.straitstimes.com/sport/dutch-fans-turn-campsites-orange-ahead-of-turkey-quarter-final-clash"}