{"authors": [], "date_download": "2024-10-12 14:09:12", "date_modify": "2024-10-12 14:09:12", "date_publish": "2024-08-13 13:23:40", "description": "The lawsuit claims that Aces coach Becky Hammon accused Hamby of signing a contract extension while knowingly pregnant. Read more at straitstimes.com.", "filename": "sport_basketball_sparks-dearica-hamby-sues-wnba-aces-over-pregnancy-discrimination_1728742152.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/13/2024-08-03T172517Z1772899740UP1EK831CE4NNRTRMADP3OLYMPICS-2024-BASKETBALL3X3.JPG?VersionId=yO788ejE3aS2dYR.XbuNegWZ4ViI5TFQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_sparks-dearica-hamby-sues-wnba-aces-over-pregnancy-discrimination_1728742152.html", "title": "Dearica Hamby sues Las Vegas Aces, WNBA for discrimination over her pregnancy", "title_page": "Dearica Hamby sues Las Vegas Aces, WNBA for discrimination over her pregnancy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Los Angeles Sparks forward Dearica Hamby sued her former team, the Las Vegas Aces, and the Women’s National Basketball Association (WNBA) in federal court on Aug 12, alleging workplace discrimination and retaliation stemming from her pregnancy.\nThe lawsuit, filed in the US District Court of Nevada, claims that Aces coach Becky Hammon accused Hamby of signing a contract extension with the team while knowingly pregnant.\nHamby, on the other hand, argued that she found out she was pregnant with her second child only a month after signing the extension during the 2022 season.\nShe also alleges Hammon said the Aces staff believed she would “get pregnant again for a third time”. When Hamby asked Hammon if she was being traded because she was pregnant, Hammon did not deny it, per the lawsuit.\n“The WNBA is, at its core, a workplace, and federal laws have long shielded pregnant women from discrimination on the job,” Hamby’s legal team said in a statement. “The Aces exiled Dearica Hamby for becoming pregnant and the WNBA responded with a light tap on the wrist. Every potential mother in the league is now on notice that childbirth could change their career prospects overnight.\n“That can’t be right in one of the most prosperous and dynamic women’s professional sports leagues in America.”\nThe Aces traded Hamby to the Sparks in January 2023 after eight seasons with the San Antonio/Las Vegas franchise. She was the Sixth Player of the Year Award winner in 2019 and 2020 and an All-Star in 2021, 2022 and 2024.\nHamby also accuses the WNBA of not adequately investigating her complaint when she initially brought it to the league office. After she levelled the complaint, her marketing contract with the league was not renewed.\n“We are aware of today’s legal filing and are reviewing the complaint,” the WNBA said in a statement to The Athletic.\nThe Aces have not commented on the suit.\nHammon denied mistreating Hamby at a news conference before the 2023 season, saying that “once I made the phone call that the decision has been made to move her – you know, that’s when everything kind of fell apart”.\nThat year, the WNBA suspended Hammon for two games for violating its Respect in the Workplace policies over private comments the coach made about Hamby’s pregnancy.\nThe Aces also forfeited their 2025 first-round draft pick due to impermissible benefits offered to Hamby during extension negotiations.\nThe Aug 12 lawsuit revealed that the Aces allegedly agreed to cover private school tuition for Hamby’s elder child in the form of a “donation” to the school.\nHamby, 30, was named to her third career All-Star team this season. She is averaging 19.2 points, 10.0 rebounds and 3.5 assists – all career highs – through 24 games (all starts).\nShe has put up averages of 10.0 points, 6.0 rebounds and 1.6 assists in her 306-game career (128 starts). REUTERS", "url": "https://www.straitstimes.com/sport/basketball/sparks-dearica-hamby-sues-wnba-aces-over-pregnancy-discrimination"}