{"authors": [], "date_download": "2024-10-12 13:43:19", "date_modify": "2024-10-12 13:43:19", "date_publish": "2024-10-03 05:22:56", "description": "Slot becomes the first Liverpool manager to win eight of his opening nine matches. Read more at straitstimes.com.", "filename": "sport_football_arne-slot-makes-liverpool-history-as-reds-beat-bologna-in-champions-league_1728740599.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/03/11638793.jpg?VersionId=zM9LuCNIj2h7ti8Jenj9aWphUFjw1isT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_arne-slot-makes-liverpool-history-as-reds-beat-bologna-in-champions-league_1728740599.html", "title": "Arne Slot makes Liverpool history as Reds beat Bologna in Champions League", "title_page": "Arne Slot makes Liverpool history as Reds beat Bologna in Champions League | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LIVERPOOL, United Kingdom - Arne Slot became the first Liverpool manager to win eight of his opening nine matches as Mohamed Salah’s brilliant strike sealed a 2-0 victory against Bologna in the Champions League on Oct 2.\nSlot has made a flying start to his reign after replacing Jurgen Klopp and Liverpool’s second successive victory in this season’s Champions League was another landmark moment for the Dutchman.\nAlexis Mac Allister put Liverpool ahead in the first half at Anfield and Salah bagged his 49th Champions League goal in the closing stages.\nAlready sitting top of the Premier League six matches into the season, the understated Slot has deftly ensured Liverpool haven’t missed a beat since the end of Klopp’s successful reign.\nEven Klopp, Kenny Dalglish, Bill Shankly and Bob Paisley were unable to muster as many wins at the start of their spells in charge of the Reds.\nLiverpool began their European campaign with a 3-1 win against AC Milan and this was another confident display in Slot’s first taste of a Champions League evening at Anfield.\nSlot, who managed in the Champions League with Feyenoord, said he wanted to create a “special night” and the history-making win surely lived up to that billing.\nKlopp led Liverpool to the Champions League crown in 2019 and also reached the 2018 and 2022 finals, producing countless iconic moments in the process.\nSlot’s assured start already has the six-time kings of Europe dreaming of another memorable Champions League campaign.\nWith one point following a goalless draw with Shakhtar Donetsk in their first Champions League match for 60 years, Bologna’s trip to Anfield was described as a dream come true by their sporting director Marco Di Vaio.\nAfter coming fifth last season - their highest Serie A finish since 1971 - Bologna have won just once in the league this term, hampered by a lack of cutting edge following Joshua Zirkzee’s move to Manchester United.\nThey competed gamely but couldn’t find the finishing touch to produce a fairytale upset.\nMac Allister makes his point\nLiverpool quickly seized the momentum and by the 11th minute they had the lead.\nMac Allister had spoken this week of his pleasure at being given more freedom by Slot’s tactics than he enjoyed in Klopp’s more rigid system.\nAnd the Argentine underlined the point as he started the move that led to Liverpool’s opener and finished it with a perfectly-timed run into the Bologna area to meet Salah’s cross with a close-range strike.", "url": "https://www.straitstimes.com/sport/football/arne-slot-makes-liverpool-history-as-reds-beat-bologna-in-champions-league"}