{"authors": [], "date_download": "2024-10-12 14:02:32", "date_modify": "2024-10-12 14:02:32", "date_publish": "2024-06-10 01:43:22", "description": "He became the seventh man and the youngest to capture Grand Slam titles on all three surfaces. Read more at straitstimes.com.", "filename": "sport_tennis_alcaraz-outlasts-zverev-to-claim-maiden-french-open-title_1728741752.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/10/LYNXMPEK58075-1.jpg?VersionId=PWJ1qWYqRuQdY2j_Uq4QUsf3ZGPeRjgC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_alcaraz-outlasts-zverev-to-claim-maiden-french-open-title_1728741752.html", "title": "Alcaraz outlasts Zverev to claim maiden French Open title", "title_page": "Alcaraz outlasts Zverev to claim maiden French Open title | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Spain's Carlos Alcaraz was made to sweat but clinched his first French Open title by beating Germany's Alexander Zverev 6-3 2-6 5-7 6-1 6-2 in June 9's final.\nThe world number three has now won three Grand Slams, after his Wimbledon title last year and his US Open triumph in 2022, and he has a perfect record in major finals.\nThe 21-year-old also became the seventh man and the youngest to capture Grand Slam titles on all three surfaces.\nAlcaraz shrugged off an early break and blazed through the first set, which he finished with a big forehand winner, but he allowed Zverev to turn the tide and level the match as his unforced errors crept up.\nHaving steadied himself, Alcaraz was serving for the third set at 5-3 before another dip allowed Zverev to take the lead in the contest, but the Spaniard raced through the next set despite a thigh issue and raised his game to prevail in the decider. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/alcaraz-outlasts-zverev-to-claim-maiden-french-open-title"}