{"authors": ["David Lee"], "date_download": "2024-10-12 14:17:26", "date_modify": "2024-10-12 14:17:26", "date_publish": "2023-09-03 22:54:37", "description": "Manpower Minister and Second Minister for Trade and Industry Dr Tan See Leng added that \"everything is moving at full speed\" for the Sept 15-17 Formula One Singapore Grand Prix. Read more at straitstimes.com.", "filename": "sport_singapore-gp-show-will-go-on-despite-cpib-probe_1728742646.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/03/2023090310886871120230903194421bang2993.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-gp-show-will-go-on-despite-cpib-probe_1728742646.html", "title": "Singapore GP ‘show goes on’ despite CPIB probe into rights owner and minister", "title_page": "Singapore GP ‘show goes on’ despite CPIB probe into rights owner and minister | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Despite an ongoing corruption probe into Singapore Grand Prix chairman Ong Beng Seng and Transport Minister S. Iswaran, the Sept 15-17 show will go on.\nOn the sidelines of the Italian Grand Prix live screening at the HDB Hub in Toa Payoh on Sunday, Manpower Minister and Second Minister for Trade and Industry Tan See Leng said: “The show goes on. And I can tell you that if you look at all of the events, everything is moving at full speed.\n“There’s no holding back of any other events whatsoever. Based on our ticket sales, it is very promising. I think this is going to be an exciting event moving forward.”\nOng and Mr Iswaran were arrested in July and subsequently released on bail as part of a Corrupt Practices Investigation Bureau probe. Both are key figures in making Singapore’s pitch to become a part of the Formula One circuit, with the tycoon owning the rights to the Singapore GP.\nRace promoters Singapore GP announced on Tuesday that 16 out of 23 categories for the night race are sold out, while nearly all hospitality packages have been taken up.\nSome 250,000 spectators are expected over the three days – a 17 per cent drop from the record turnout of 302,000 in 2022.\nThis is due to the closure of the 27,000-seat Bay grandstand as part of redevelopment of The Float @ Marina Bay. The new site is expected to be ready by end-2026.\nBut Dr Tan, who took over as minister-in-charge of the F1 event, is confident “an exciting slew of activities” will make up for the dip in capacity and make the event one to remember, even as the organisers managed to add 10,000 tickets back into the inventory.\nHe pointed to entertainment acts such as English pop star Robbie Williams and American band Kings Of Leon, and highlighted live screenings of the race at six community clubs at Our Tampines Hub, Jurong Spring, One Punggol, Bishan, Nee Soon Central and Heartbeat@Bedok.\nDr Tan felt the Singapore GP’s international reputation will remain strong, with about 28 Mice (Meetings, Incentives, Conventions and Exhibitions) events in the Republic from next weekend up till the week after the race.\nCiting how Singapore has hosted the race since 2008, bringing in more than 550,000 unique foreign visitors and contributing over $1.5 billion in tourism receipts, he said: “It is an ongoing franchise, an ongoing show.\n“It has brought significant spillover effects in terms of our economy and also raised the profile for our country significantly... we will continue with it.\n“If you look at it, 90 per cent of all of the outsourced work goes to local enterprises.\n“On top of that, I understand that many of the big private equity firms, hedge funds... they are all converging and alongside with the Mice events, there are also many business deals happening, and negotiations are undergoing at the same time. So there’s a lot of spillover effects.”\nDr Tan does not expect any manpower shortages, however, noting that there are support schemes and temporary quotas in place through the Economic Development Board and the Singapore Tourism Board for hotels and hospitality service businesses.", "url": "https://www.straitstimes.com/sport/singapore-gp-show-will-go-on-despite-cpib-probe"}