{"authors": [], "date_download": "2024-10-12 14:03:56", "date_modify": "2024-10-12 14:03:56", "date_publish": "2024-05-15 20:48:15", "description": "In the men’s draw, Daniil Medvedev’s title defence came to an early end after he was knocked out in the last 16 by Tommy Paul. Read more at straitstimes.com.", "filename": "sport_tennis_aryna-sabalenka-breezes-past-jelena-ostapenko-and-into-rome-open-semis_1728741836.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/15/2024-05-15T114807Z85282790UP1EK5F0WS5ZXRTRMADP3TENNIS-ROME.JPG?VersionId=BwbFgHYdP6qjDR4uFSOYki2Q5rvBwidG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_aryna-sabalenka-breezes-past-jelena-ostapenko-and-into-rome-open-semis_1728741836.html", "title": "Aryna Sabalenka breezes past Jelena Ostapenko and into Italian Open semis", "title_page": "Aryna Sabalenka breezes past Jelena Ostapenko and into Italian Open semis | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME – World No. 2 Aryna Sabalenka is ready to give herself a little sweet treat after progressing to the semi-finals of the Italian Open in Rome on May 15.\nThe Belarusian cruised into the last four after comfortably defeating Jelena Ostapenko 6-2, 6-4.\n“I’ve been dreaming of gelato for I don’t know how many days. I really think this is the day to go for it,” Sabalenka said, referring to the frozen dessert of Italian origin.\nThe second seed needed one hour and 12 minutes to see off Ostapenko and improve her record against the Latvian to three wins and no defeats.\nIn the last four, Sabalenka will face the winner of the clash between two-time Australian Open champion Victoria Azarenka and Danielle Collins, the reigning Miami Open winner, who faced off in the later match.\nSabalenka, who has won back-to-back Australian Opens, could get a rematch of the recent Madrid final which she lost in dramatic fashion – 7-5, 4-6, 7-6 (9-7) – to world No. 1 Iga Swiatek earlier in May.\n“Yeah, I’m super happy to be back in Rome, one of my favourite tournaments,” the 26-year-old added.\n“Madrid was tough. I fought back. I found my game. I bring everything back together and start playing on a high level.”\nRome is the first time since the 2013 French Open that the top three women have reached the last four of a WTA event, excluding the Tour Finals, with Swiatek and world No. 3 Coco Gauff in the other semi-final.\nIn the men’s draw, Daniil Medvedev’s title defence came to an early end on May 14 after the world No. 4 Russian was knocked out in the last 16 by Tommy Paul.\nThe second seed has never retained an ATP Tour crown and was well below his best, stunned 6-1, 6-4 by his American opponent, who claimed his first win against the former US Open champion.\n“Mentally I had to be much better. I started to calm myself down and focus on the match only at the end of the match, and it was too late,” Medvedev admitted.\n“It’s disappointing, to be honest. I wanted to do better here.”\nPaul barely broke sweat as he dashed Medvedev’s hopes, wrapping up a one-sided contest in 73 minutes, hitting 18 winners and winning 16 points at the net.\nHe will next play Hubert Hurkacz, who knocked out Rafael Nadal earlier in the tournament, in his first Masters 1000 quarter-final on clay.\n“I had a bit of training before the clay-court season this year and it really helped. I’m really comfortable and I’m having fun out here,” Paul said on court. AFP, REUTERS", "url": "https://www.straitstimes.com/sport/tennis/aryna-sabalenka-breezes-past-jelena-ostapenko-and-into-rome-open-semis"}