{"authors": [], "date_download": "2024-10-12 14:00:17", "date_modify": "2024-10-12 14:00:17", "date_publish": "2024-09-02 13:24:52", "description": "NEW YORK - Alexei Popyrin was left ruing a missed opportunity after being knocked out of the U.S. Open in the fourth round on Sunday, a couple of days after ousting 24-times Grand Slam champion Novak Djokovic. Read more at straitstimes.com.", "filename": "sport_tennis_giant-killer-popyrin-rues-opportunity-lost-after-us-open-exit_1728741617.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/LYNXMPEK81042-1.jpg?VersionId=xZt6n.0kHWyJR251OLkNGo6ULQzkz4Ry", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_giant-killer-popyrin-rues-opportunity-lost-after-us-open-exit_1728741617.html", "title": "Giant-killer Popyrin rues opportunity lost after US Open exit", "title_page": "Giant-killer Popyrin rues opportunity lost after US Open exit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Alexei Popyrin was left ruing a missed opportunity after being knocked out of the U.S. Open in the fourth round on Sunday, a couple of days after ousting 24-times Grand Slam champion Novak Djokovic.\nThe big-serving Australian has been in career-best form over the last few weeks but was unable to contain an inspired Frances Tiafoe on Sunday and earn a place in his first Grand Slam quarter-final.\n\"It definitely does feel like a little opportunity lost,\" the 25-year-old told reporters after his 6-4 7-6(3) 2-6 6-3 loss.\n\"I think this match it was changed by I think one, two, or three points. I think he won three more points than I did all match, and he won three sets. That just shows you how close it was.\"\nPopyrin landed his first Masters title on the back of a string of upsets at the Canadian Open in Montreal last month to reach a career high ranking of world number 23.\nGiven that and his stunning defeat of Djokovic, Popyrin was not about to get too upset by exiting the U.S. Open in a hard fought contest in the last 16.\n\"I'm telling everybody now, if you would have told me at the start of the summer I would have been 23 in the world with a Masters title and second week of a slam for the first time, I probably would have taken it considering the position I was in,\" he added.\n\"If I hadn't won a match in Montreal or (Cincinnati), I probably would have dropped to outside 90 in the world. So considering all that, I think it was a very successful summer.\"\nWhile Tiafoe will move on to try to end his country's long wait for a homegrown U.S. Open men's singles champion, Popyrin's success will have his compatriots thinking they might have a contender to do the same at the Australian Open.\nWith Nick Kyrgios showing no signs of an imminent return to the court, Australia is desperate for credible candidates to end a 48-year drought since Mark Edmondson triumphed in 1976.\n\"I haven't even thought about that yet,\" Popyrin said with a laugh.\n\"We've got Davis Cup, Asian swing, indoor swing. We still have a lot of tennis left to play this year. I'm going to take some time off I think now. I'm quite knackered.\" REUTERS", "url": "https://www.straitstimes.com/sport/tennis/giant-killer-popyrin-rues-opportunity-lost-after-us-open-exit"}