{"authors": [], "date_download": "2024-10-12 14:03:17", "date_modify": "2024-10-12 14:03:17", "date_publish": "2024-05-31 22:31:39", "description": "The Russian has reached 10 Grand Slam quarter-finals without ever going further. Read more at straitstimes.com.", "filename": "sport_tennis_sixth-seed-andrey-rublev-knocked-out-of-french-open_1728741797.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/31/2024-05-31T134607Z63395476UP1EK5V128U4BRTRMADP3TENNIS-FRENCHOPEN.JPG?VersionId=LuLxqMq_s7yzRfHYAgwcGftP5uaTXRlH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_sixth-seed-andrey-rublev-knocked-out-of-french-open_1728741797.html", "title": "Sixth seed Andrey Rublev knocked out of French Open", "title_page": "Sixth seed Andrey Rublev knocked out of French Open | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Italy’s Matteo Arnaldi played “the best tennis” of his life to produce a sensational performance on May 31, taking out sixth seed Andrey Rublev and reaching the last 16 of the French Open.\nThe 23-year-old saved a set point in the opening set and went on to dominate his emotionally charged Russian opponent for a 7-6 (8-6), 6-2, 6-4 victory to equal his best Grand Slam run.\nRublev ranted and raged at himself as the match began to slip away, thumping his racket into his legs and kicking his courtside bench as another chance at a deep Grand Slam run came to a bitter end on the Parisian dust.\nArnaldi, who also reached the fourth round of last season’s US Open, was rock solid throughout and barely put a foot wrong as he posted one of the biggest wins of his career.\n“I have to thank everyone for coming today. Merci beaucoup (thank you in French),” the Italian, ranked 35th, said after his victory to loud cheers from the French crowd on Court Suzanne-Lenglen.\n“It’s incredible. I played the best tennis for sure in my life, I would say.\n“And to do it for three sets... it’s easy to do it for two, but in a Slam playing three sets at this level, I wasn’t expecting it.\n“He didn’t play his best, for sure. But I used the right tactic to put him under pressure. Today it worked very well.”\nRublev has reached 10 Grand Slam quarter-finals without ever going further, but on this occasion even that proved beyond him, as he could find no answer to the accuracy and power of Arnaldi, who hit 47 winners to his 37.\nHe is the highest-seeded casualty so far in the men’s draw.\nKnown for his fiery temperament and on-court tantrums, the Russian admitted only a few weeks ago at the Madrid Open that he had been warned many times that he needed to calm down for his own good.\nIn the end, though, it was simply a frustrating day for the 26-year-old. He has now lost in the third round to an Italian on the same court for the second straight year, following his defeat by Lorenzo Sonego 12 months ago.\nArnaldi advanced to play either Greece’s Stefanos Tsitsipas or China’s Zhang Zhizhen for a place in the quarter-finals.\nLater, world No. 2 Jannik Sinner eased into the fourth round with a ruthless 6-4, 6-4, 6-4 victory against Russian Pavel Kotov.\nHe will next face local hope Corentin Moutet or Sebastian Ofner of Austria.\nIn the women’s draw, third seed Coco Gauff showed some second-set resilience in a 6-2, 6-4 victory over Ukraine’s Dayana Yastremska to advance to the fourth round and move closer to ending a three-year clay-court title drought.\nThe US Open champion, who reached the final in Paris in 2022 and last won a title on the red dirt at the Emilia-Romagna Open in 2021, was in solid form in the first set against surprise Australian Open semi-finalist Yastremska, before struggling briefly in the second.\nThe American prevailed in the end and will next face Italy’s world No. 51 Elisabetta Cocciaretto.\n“I played her in Madrid and she plays really well from behind,” said Gauff, who clinched a 6-4, 6-1 third-round win over Yastremska in the Spanish capital in April.\n“I knew closing the match would be difficult. I definitely could have closed it out on my serve (in the previous game).”\n“The last game, she hit three or four balls on the edge of the line... it was difficult to stay focused and not get too mad. But I’m glad I was able to push through.”\nGauff has a good chance of progressing far in Paris. Besides her 2022 final, in which she lost to world No. 1 Iga Swiatek, she has reached two quarter-finals, in 2021 and 2023.\nThe Polish defending champion celebrated her 23rd birthday on May 31 with a routine 6-4, 6-2 win over Czech Marie Bouzkova on Court Philippe-Chatrier. Next up for her is a fourth-round clash against Russian Anastasia Potapova. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/tennis/sixth-seed-andrey-rublev-knocked-out-of-french-open"}