{"authors": [], "date_download": "2024-10-12 13:41:50", "date_modify": "2024-10-12 13:41:50", "date_publish": "2024-07-05 19:11:14", "description": "HAMBURG/ISTANBUL - Europe's football body UEFA handed a two-match ban on Friday to Turkish soccer player Merih Demiral for his politically charged \\\"wolf\\\" celebration and fined England's Jude Bellingham 30,000 euros ($32,470) for a crotch-grabbing gesture at Euro 2024. Read more at straitstimes.com.", "filename": "sport_turkeys-demiral-banned-for-two-games-englands-bellingham-fined_1728740510.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/05/LYNXMPEK640FD-1.jpg?VersionId=Af8BmYmwYddDl4nJOBv3xjRVP7XVab5c", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_turkeys-demiral-banned-for-two-games-englands-bellingham-fined_1728740510.html", "title": "UEFA bans Turkey's Demiral for two games, fines England's Bellingham", "title_page": "UEFA bans Turkey's Demiral for two games, fines England's Bellingham | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HAMBURG/ISTANBUL - Europe's football body UEFA handed a two-match ban on Friday to Turkish soccer player Merih Demiral for his politically charged \"wolf\" celebration and fined England's Jude Bellingham 30,000 euros ($32,470) for a crotch-grabbing gesture at Euro 2024.\nCentre back Demiral, 26, will now miss Turkey's quarter-final on Saturday against the Netherlands, prompting his outraged government to call for the punishment to be rescinded.\nMidfielder Bellingham, 21, is, however, clear to play for England in their quarter-final against Switzerland on the same day. He got a one-match ban too but it was suspended depending on good behaviour for one year.\nDemiral, 26, mimicked the shape of a wolf's head with his fingers after his second goal in Turkey's 2-1 win over Austria in the last 16. The symbol dates back centuries but has in recent times been linked to Turkey's far-right \"Grey Wolves\" group and was condemned as racist by Germany.\nUEFA said Demiral was punished \"for violating the basic rules of decent conduct, for using sports events for manifestations of a non-sporting nature and for bringing the sport of football into disrepute\".\nDemiral said he had planned the gesture and was proud of it as an expression of patriotism. Turkey's football association plans to appeal the decision, Turkish media said.\n\"The beauty and excitement of football should not be overshadowed with political decisions,\" said Turkey's Vice President Cevdet Yilmaz on X, urging an overturning of the ban.\nIn Bellingham's case, he kissed his hand and lowered it to his groin when walking off after a 2-1 last-16 win over Slovakia. That, UEFA said in its statement, was \"violating the basic rules of decent conduct.\"\nIn the latest of a slew of sanctions against participating countries for fan misbehaviour, UEFA also fined the English Football Association 11,000 euros for crowd disturbances and fireworks during the Slovakia game.\nBellingham, previously praised for maturity beyond his years, said his gesture was a laugh with friends.\n\"An inside joke gesture towards some close friends who were at the game. Nothing but respect for how that Slovakia team played tonight,\" he said hours after the game.\nTURKISH ANGER\nAmid the furore over Demiral's gesture, Turkey's President Tayyip Erdogan plans to attend his nation's game in Berlin. \"Does anybody ask why the German national jersey has an eagle, or the French jersey a rooster?\" he said on Thursday.\nThe \"Grey Wolves\" are an ultra-nationalist youth branch of the Nationalist Movement Party (MHP), an ally of Erdogan's AK Party. They were involved in violence between leftists and nationalists that killed some 5,000 people around a 1980 coup.\nFrance has outlawed the group, Austria has banned its symbol and Germany has the \"Grey Wolves\" under surveillance.\nTurkey's foreign ministry has defended the gesture as \"a historical and cultural symbol\" that Demiral used without targeting anyone. The symbol goes back to use by some Turkic tribes of Central Asia and also by Turkey after its foundation in 1923, but of late the gesture has been adopted by the MHP.\nIn Turkey, where the mood is at fever pitch over the team's success, some said Europe was showing its prejudice.\n\"He did not do anything wrong, he did not insult anyone. Whatever we do, it is always wrong. They never liked Turkey,\" said Suna Belkavli, 56. \"Everyone does the cross sign and there aren't any problems but we can't express our Turkish pride with joy,\" added Abdullah Erturhan, 58.\nBut others said it was incorrect to mix a provocative symbol with sport. \"I think it is wrong to do a political thing there,\" said resident Ahmed Ozdil, 63. \"MHP uses this. It is its favourite thing ... I am against it.\" REUTERS", "url": "https://www.straitstimes.com/sport/turkeys-demiral-banned-for-two-games-englands-bellingham-fined"}