{"authors": [], "date_download": "2024-10-12 13:41:30", "date_modify": "2024-10-12 13:41:30", "date_publish": "2024-08-19 21:36:49", "description": "England's Dan Lawrence will open the batting in place of the injured Zak Crawley in the first test against Sri Lanka and seamer Matthew Potts will replace Ben Stokes, the England and Wales Cricket Board said on Monday. Read more at straitstimes.com.", "filename": "sport_lawrence-potts-named-in-england-team-to-face-sri-lanka_1728740490.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/19/2024-07-17T100233Z223002373UP1EK7H0RW80SRTRMADP3CRICKET-TEST-ENG-WIN-PREVIEW.JPG?VersionId=yqG7TREzGjjonn1t7_XLddqytLirKTHQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_lawrence-potts-named-in-england-team-to-face-sri-lanka_1728740490.html", "title": "Dan Lawrence, Matthew Potts named in England cricket team to face Sri Lanka", "title_page": "Dan Lawrence, Matthew Potts named in England cricket team to face Sri Lanka | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "England's Dan Lawrence will open the batting in place of the injured Zak Crawley in the first test against Sri Lanka and seamer Matthew Potts will replace Ben Stokes, the England and Wales Cricket Board said on Monday.\nAll-rounder Stokes was ruled out for the rest of the English summer after the 33-year-old picked up a hamstring injury last week with batter Ollie Pope taking over the captaincy.\nMiddle-order batter Harry Brook, 25, has been named vice-captain for the three-match series starting at Old Trafford on Wednesday.\nCrawley will also miss the three-match test series after he sustained a fractured finger.\nEngland team\nDan Lawrence, Ben Duckett, Ollie Pope (captain), Joe Root, Harry Brook (vice-captain), Jamie Smith (wicketkeeper), Chris Woakes, Gus Atkinson, Matthew Potts, Mark Wood and Shoaib Bashir. REUTERS", "url": "https://www.straitstimes.com/sport/lawrence-potts-named-in-england-team-to-face-sri-lanka"}