{"authors": [], "date_download": "2024-10-12 13:41:53", "date_modify": "2024-10-12 13:41:53", "date_publish": "2024-04-01 13:56:43", "description": "Everton posted a loss of 89.1 million pounds ($112.52 million) for the 2022-23 season on Sunday, almost double the figure from a year earlier, as they await the outcome of an appeal against a second charge of breaching profit and sustainability rules (PSR). Read more at straitstimes.com.", "filename": "sport_football_everton-post-112-million-loss-for-2022-23-season_1728740513.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/01/LYNXNPEK300DV-1.jpg?VersionId=SpIZ3rnX7YGRIhg7R7xdMb2galu2tyRK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_everton-post-112-million-loss-for-2022-23-season_1728740513.html", "title": "Everton post $112 million loss for 2022-23 season", "title_page": "Everton post $112 million loss for 2022-23 season | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Everton posted a loss of 89.1 million pounds ($112.52 million) for the 2022-23 season on Sunday, almost double the figure from a year earlier, as they await the outcome of an appeal against a second charge of breaching profit and sustainability rules (PSR).\nIn their latest accounts report released on Sunday, Everton attributed part of the losses to the suspension of all commercial sponsorship arrangements with Russian companies USM Holdings, MegaFon and Yota following Russia's invasion of Ukraine.\nIt marks the sixth straight year of losses for the Merseyside club, who posted a loss of 44.7 million pounds for 2021-2022, with their losses for the past three seasons amounting to just under 255 million pounds.\nAccording to Premier League guidelines, clubs are at risk of breaching PSR if they incur more than 105 million pounds in losses over three seasons, or 35 million pounds annually.\nEverton were deducted 10 points in November for a breach of PSR relating to the 2020-21 season, though the penalty was reduced to six points following an appeal.\nThe club were charged once again in January for violations of PSR in their financial records for a period beginning in 2019-20 and ending in 2022-23, with the hearing for that charge taking place last week.\nEverton, who have played every season since 1954-55 in the top flight, narrowly avoided relegation in the 2022-23 season with a final-day victory over Bournemouth.\nThey are currently 16th with 25 points, three points above the relegation zone, and next travel to face Newcastle United on Tuesday.\nEverton are also in the midst of protracted takeover talks with U.S. investment fund 777 Partners and are aiming to move to their new stadium ahead of the 2025-26 season. REUTERS", "url": "https://www.straitstimes.com/sport/football/everton-post-112-million-loss-for-2022-23-season"}