{"authors": [], "date_download": "2024-10-12 13:41:56", "date_modify": "2024-10-12 13:41:56", "date_publish": "2024-08-15 14:28:58", "description": "India have appointed Morne Morkel as their new bowling coach with the former South Africa international paceman officially joining head coach Gautam Gambhir's staff next month, local media reported. Read more at straitstimes.com.", "filename": "sport_south-african-morkel-appointed-indias-bowling-coach-media-reports-say_1728740516.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/15/ST-logo-placeholder_36.jpg?VersionId=BvZR6Z9NvGHuRBfeV4yi9OfUcV03RVPY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_south-african-morkel-appointed-indias-bowling-coach-media-reports-say_1728740516.html", "title": "South African Morkel appointed India's bowling coach, media reports say", "title_page": "South African Morkel appointed India's bowling coach, media reports say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "India have appointed Morne Morkel as their new bowling coach with the former South Africa international paceman officially joining head coach Gautam Gambhir's staff next month, local media reported.\nMorkel resigned from his role as Pakistan's bowling coach in November last year, a few days after they finished fifth in the 50-overs World Cup in India.\nThe 39-year-old has previously played alongside Gambhir at Indian Premier League side Kolkata Knight Riders and was part of the former India opener's coaching team at Lucknow Super Giants.\nReports in the Indian media on Wednesday said that Morkel's appointment was confirmed by Indian cricket board secretary Jay Shah.\nReuters has contacted the Board of Control for Cricket in India (BCCI) for comment.\nMorkel's first assignment will be the test series against Bangladesh starting on Sept. 19 in Chennai, media said.\nHe will join Abhishek Nayar, Ryan ten Doeschate and fielding coach T Dilip as Gambhir's assistants.\nGambhir took over from Rahul Dravid last month and guided India to a 3-0 win over Sri Lanka in their Twenty20 series in Pallekele. The tourists were then beaten 2-0 in the one-day international series that followed in Colombo. REUTERS", "url": "https://www.straitstimes.com/sport/south-african-morkel-appointed-indias-bowling-coach-media-reports-say"}