{"authors": [], "date_download": "2024-10-12 13:35:11", "date_modify": "2024-10-12 13:35:11", "date_publish": "2024-09-11 08:02:50", "description": "He parted ways with Premier League side Chelsea in May after one season in charge. Read more at straitstimes.com.", "filename": "sport_football_pochettino-named-new-us-mens-coach_1728740111.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/11/LYNXMPEK8A000-2.jpg?VersionId=CL1SANILKSdNuT5rezoT3_g5qs_0vM7r", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_pochettino-named-new-us-mens-coach_1728740111.html", "title": "Mauricio Pochettino named new US men’s football coach", "title_page": "Mauricio Pochettino named new US men’s football coach | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CHICAGO – If Mauricio Pochettino had any illusions about the scale of the task that awaits him as the newly appointed coach of the United States, the 1-1 draw with lowly New Zealand on Sept 10 would have set him straight.\nThe friendly in Cincinnati, against the 94th-ranked team in the world, continues a miserable run of form for the Americans, who have now managed just one win in their last seven games – all held on home soil.\nPochettino, who parted ways with English Premier League side Chelsea in May after one season in charge, will take the reins in the US with a view to the 2026 World Cup, which will be co-hosted by Mexico, Canada and the United States.\nThe Argentinian, a former Paris Saint-Germain and Tottenham Hotspur manager, said his decision to join US Soccer was not just about football, but also about the journey the country was on, adding that he could not pass up the opportunity.\n“The energy, the passion, and the hunger to achieve something truly historic here – those are the things that inspired me,” he said in a statement.\n“I see a group of players full of talent and potential, and together, we’re going to build something special.”\nUS Soccer sporting director Matt Crocker, meanwhile, said Pochettino was a “serial winner with a deep passion for developing players”.\n“His track record speaks for itself, and I am confident that he is the right choice to harness the immense potential within our talented squad,” he said.\n“We are thrilled to have Mauricio on board as we embark on this exciting journey to achieve success on the global stage.”\nThe US have been without a coach since a humiliating early exit from the Copa America on home soil in July led to the sacking of Gregg Berhalter after his second stint as coach.\nThe 51-year-old was first appointed in 2018, and led the team to the knockout stages of the 2022 World Cup, but just weeks later found himself embroiled in a bitter public row with one of the team’s brightest emerging talents, Giovanni Reyna.\nUS Soccer’s search for a new coach when Berhalter’s contract expired at the end of 2022 included names such as Canada coach Jesse Marsch, but it ultimately rehired Berhalter in June 2023 with the full support of the players.\nHowever, it proved unsuccessful, as the US failed to progress beyond the group stage of the Copa.\nPochettino will take over from interim coach Mikey Varas, who oversaw the friendlies against Canada on Sept 7 and New Zealand.\nThe US will play their next series of friendlies against Panama on Oct 12 and Mexico three days later. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/football/pochettino-named-new-us-mens-coach"}