{"authors": [], "date_download": "2024-10-12 13:41:05", "date_modify": "2024-10-12 13:41:05", "date_publish": "2024-08-28 19:03:29", "description": "Dawid Malan, a former top-ranked batter in T20 internationals, has retired from international cricket, the England and Wales Cricket Board (ECB) said on Wednesday. Read more at straitstimes.com.", "filename": "sport_england-batter-malan-retires-from-international-cricket_1728740465.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/28/LYNXMPEK7R0DO-1.jpg?VersionId=3OyHNxsTGDbIwcSrsPIIIMz0.Srssa3L", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_england-batter-malan-retires-from-international-cricket_1728740465.html", "title": "England batter Malan retires from international cricket", "title_page": "England batter Malan retires from international cricket | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Dawid Malan, a former top-ranked batter in T20 internationals, has retired from international cricket, the England and Wales Cricket Board (ECB) said on Wednesday.\nMalan, who turns 37 next week, played 30 One-Day Internationals (ODIs) and 62 Twenty20 internationals (T20Is). He last appeared for England in November during the 50-over World Cup.\nThe Roehampton-born left-handed batter scored six centuries in ODIs and one each in tests and T20Is. He is one of two England men's cricketers to score centuries in all three formats of the game, along with Jos Buttler.\n\"It has been an incredible journey since July 2017. I am so grateful to have had the opportunity to play for England in all three formats,\" Malan said in a statement.\n\"I am so grateful to so many people: to the coaches and staff of the various England teams, to everyone who helped and supported me along the way, and to all my England teammates over these seven years.\"\nEngland men's cricket managing director Rob Key said Malan played an integral role in the team's T20 World Cup win in 2022.\n\"His legacy will be remembered as one of tenacity and achievement on the international stage—traits any player would be extremely proud to have,\" Key said. REUTERS", "url": "https://www.straitstimes.com/sport/england-batter-malan-retires-from-international-cricket"}