{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 13:43:23", "date_modify": "2024-10-12 13:43:23", "date_publish": "2023-12-03 20:39:19", "description": "The Singapore teen won all three legs of the competition in Austria, Italy and China. Read more at straitstimes.com.", "filename": "sport_maximilian-maeder-crowned-kitefoil-world-series-overall-champion_1728740603.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/03/Max20Maeder20Trophy.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_maximilian-maeder-crowned-kitefoil-world-series-overall-champion_1728740603.html", "title": "Maximilian Maeder crowned KiteFoil World Series overall champion", "title_page": "Maximilian Maeder crowned KiteFoil World Series overall champion | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – It has been a long season for Singaporean kitefoiler Maximilian Maeder, but what has kept him going is his love of competing.\nThis was evident as the reigning world champion and Asian Games gold medallist clinched yet another title on Dec 3, this time winning the Zhuhai leg of the KiteFoil World Series to be crowned overall winner.\nThe victory in the coastal Chinese city earned Maximilian, who had won the previous two legs in Austria and Italy, 500 points and took his total tally in the overall standings to 1,100 points.\nCypriot Denis Taradin was second with 1,060 points, followed by Croatia’s Martin Dolenc (1,059).\nMaximilian, 17, said: “I really just enjoy high-level competition, the same way anyone wants to do their hobby every day... and they don’t get tired of it or they don’t want to stop doing it.\n“I love competing, I love kiting and I want to compete against my competitors and have this field where we show each other what we’ve been working on.\n“That constant competition is something I enjoy.”\nIn Zhuhai, Maximilian directly qualified for the medal series after finishing second in the opening series with 15 net points, just behind Slovenia’s former world champion Toni Vodisek (14).\nThey were joined by China’s newly minted Asian champion Huang Qibin and his compatriot Zhang Haoran in the medal series after the duo finished first and second respectively in the semi-final.\nMaximilian won the first race of the medal series, leaving him and Vodisek one victory away from the title. The second race was tightly contested, with Maximilian emerging as the victor, pipping Vodisek to the title. Huang was third.\nMaximilian said: “I’m feeling very fortunate. There’s a sense of bliss from all the racing, I’m very happy.\n“It doesn’t change at all. I’m just filled with positive energy every time something like this happens.\n“I’m grateful for all the people who’ve helped me and all those who have supported me.\n“I want to say an excellent ‘thank you’ to all my competitors – I can’t express how fun it was, how respectful they were, how much of a joy it was to compete with them.”\nHe credited Vodisek, 23, for bringing out the best in him, saying competing against him is always tough.\nMaximilian said: “Unfortunately this position (qualifying second) against Toni is a common one because it’s very hard to get an edge on him any time. It’s a real intense situation whenever I’m up against him.\n“In the medal series, I have to bring my best. I have to be the most focused because anything less wouldn’t be enough against a competitor like him.”\nKitesurfing Association of Singapore president Ong Rong Quan praised Maximilian’s performance, saying: “It’s a good weekend of racing for him and equally important he gets strong competition that brings the best out of him.”\nThe teenager’s season ends with the Dec 8-16 Youth Sailing World Championships in Buzios, Brazil and Maximilian hopes that his last appearance at the world youth event will be a memorable one.\nOng said: “As with all things related to sailing, the weather and sea conditions will vary across different locations, allowing him to fine-tune his skills and work on the multiverse of techniques and tactics that come in a competition setting.”", "url": "https://www.straitstimes.com/sport/maximilian-maeder-crowned-kitefoil-world-series-overall-champion"}