{"authors": [], "date_download": "2024-10-12 14:17:43", "date_modify": "2024-10-12 14:17:43", "date_publish": "2023-09-04 20:45:04", "description": "MONZA, Italy - Max Verstappen made Formula One history with his 10th win in a row on Sunday but the Red Bull driver's all-time record forms part of a bigger success story that is even more remarkable. Read more at straitstimes.com.", "filename": "sport_formula-one_verstappens-record-is-part-of-something-even-more-impressive_1728742663.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/04/LYNXMPEJ830D3-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_verstappens-record-is-part-of-something-even-more-impressive_1728742663.html", "title": "Verstappen's record is part of something even more impressive", "title_page": "Verstappen's record is part of something even more impressive | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MONZA, Italy - Max Verstappen made Formula One history with his 10th win in a row on Sunday but the Red Bull driver's all-time record forms part of a bigger success story that is even more remarkable.\nFerrari team boss Fred Vasseur, who had Carlos Sainz and Charles Leclerc third and fourth behind Verstappen and his team mate Sergio Perez at the Italian Grand Prix, highlighted that fact afterwards.\n\"I think the most impressive for me is that Max, it's not just about the last 10 races but it's about the last two years,\" said the Frenchman.\n\"I would say that he didn't do a single mistake ... for sure it's easier to not do mistakes when you have a margin on the others and so on but even in these kind of circumstances he's able to manage the situation very well.\n\"To not do a single mistake over two seasons, it's just mega.\"\nVerstappen did not take pole position at Monza on Saturday, missing out to Sainz by a mere 13 thousandths of a second, but the pressure was all on the Ferrari driver rather than the potential record man.\nSuch is the Red Bull's race pace advantage, even if Sainz held him off for longer than expected on Sunday, that Verstappen could afford to play a waiting game and trust in his car and team.\n\"He put some pressure on Carlos but never too much, he didn't take risks and knew that he had a difference of pace and he was convinced that if it's not possible during the first stint it will be around the pitstop,\" said Vasseur.\nThe win was Verstappen's 12th of the season and stretched Red Bull's record unbeaten run to 15 races, dating back to last season's Abu Dhabi finale.\nVerstappen is now a hefty 145 points clear of Perez with eight races remaining and his inevitable third title fast approaching.\n\"That's a nice stat,\" the 25-year-old said over the radio when he was congratulated on the record win, taking him one beyond the nine in a row of now-retired Sebastian Vettel, but the statistics from the last two seasons are also pretty tasty.\nTEAM EFFORT\nSince the start of the 2022 season Verstappen has won 27 of 36 races and 21 of the last 25.\nThe Dutch driver has taken 37 of his 47 career victories since the start of the 2021 season.\nIn the last 26 races Verstappen has finished lower than second only twice and in the last 36 he has ended up off the podium only five times.\nHis last retirement was in Australia in April 2022 -- 34 races ago -- and that was through no fault of his own, with the Red Bull rolling to a halt at Melbourne's Albert Park with smoke billowing from it.\nIt is also very much a team effort and Red Bull have won 24 of the last 25 races.\n\"I wouldn’t say he was nervous this weekend but you could definitely feel that his focus was razor sharp, more than usual. You could see that it (the record) definitely meant something to him,\" said Red Bull boss Christian Horner.\n\"What Max is doing is breaking records and driving at an unbelievable level and I don’t think there is anybody in the world at the moment that can beat Max Verstappen in this car, that’s for sure.\n\"You have to recognise and applaud what Max is doing.\n\"In sport it is very rare that something like this happens and it is a golden moment for him and certainly a golden moment for the team.\" REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/verstappens-record-is-part-of-something-even-more-impressive"}