{"authors": ["Lin Tianbao"], "date_download": "2024-10-12 14:09:07", "date_modify": "2024-10-12 14:09:07", "date_publish": "2024-08-20 22:12:01", "description": "NYGH's winning team featured twins, who combined to score 30 points in their win over Raffles Girls' School. Read more at straitstimes.com.", "filename": "sport_schools_double-trouble-as-nanyang-girls-high-retain-c-div-basketball-title-national-jc-clinch-1st-c-boys-title_1728742147.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/20/tbbas20.c952ce4a.Attachment.100559.jpg?VersionId=CxLMaCltsvt03srBJ3iyOpX3N2fagGND", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_schools_double-trouble-as-nanyang-girls-high-retain-c-div-basketball-title-national-jc-clinch-1st-c-boys-title_1728742147.html", "title": "Double trouble as Nanyang Girls’ High retain C Div basketball title; National JC clinch 1st C boys’ title", "title_page": "Double trouble as Nanyang Girls’ High retain C Div basketball title; National JC clinch 1st C boys’ title | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Players from Raffles Girls’ School (RGS) could be forgiven for thinking they were seeing double during the National School Games C Division girls’ basketball final at the OCBC Arena on Aug 20.\nThe reason for their confusion? Nanyang Girls’ High School featured a pair of twins, Jovia and Jovie Teo, who terrorised their opponents all afternoon as they helped their school win a fourth straight title by beating RGS 53-37.\nThe 14-year-old guards admitted that opposing players tend to be left perplexed when playing against them, which they use to their advantage. Jovie, who scored 14 points and won the Most Valuable Player (MVP) award, quipped: “If they try not to let one of us get the ball, there’ll be another one to support and help the team bring the ball forward.”\nTeacher-in-charge Toh Lin Sin revealed that even referees and teachers cannot tell them apart sometimes. “We need to double-check before we praise or scold them,” she added.\nThe pair started playing basketball when they were nine, following in the footsteps of their now 16-year-old elder sister, who had picked up the sport.\nJovie says it is “a pleasure” to share the court with her twin, while Jovia, who scored a team-high 16 points, said: “I feel very blessed because not everybody has this opportunity to play with her sister, especially of the same age and in the same division.”\nWhile they are competitive during training, the duo said that off the court, they bond well as they lead similar lifestyles.\nWhen asked about their on-court partnership, Jovia said: “It’s quite telepathic, especially on fast breaks because we’re able to locate each other.”\nDespite finishing second, RGS captain Lim Jing En was proud of her team’s progress. “The result doesn’t matter, as long as we put in our 100 per cent,” she said.\nIn the C boys’ final, National Junior College (NJC) beat Jurong Secondary School 52-32 to complete a stunning comeback.\nThey had been eliminated in the quarter-finals of the South Zone competition in 2023, failing to even reach the national stage.\nBut they dug deep in 2024 and reached the semi-finals of the competition for the first time in the school’s history, before claiming their maiden championship.\nCaptain David Ho says the win has been a “long time coming”. The 14-year-old added: “We’ve trained hard for the whole year, and we finally showed up and played very well together today, and most importantly won as a team.\n“Since our elimination in the South Zone (in 2023), we were all fixated on one goal, which is winning the championship today.”\nHe believes the catalyst to the team’s change in fortunes is their willingness to work on their weaknesses, including their communication and defence.\nHe explained: “We started training for this season right after last season. From the end of last year, we just decided to focus on the mistakes we made and why we got eliminated.\n“Most importantly, we were able to fix what we did wrong, such as having bad starts, which caused us to lose from the start.”\nNJC started more aggressively, adopting a full-court press from the get-go. The strategy paid dividends as they took an 18-9 lead after the first quarter and never relinquished it, even outscoring Jurong 17-5 in the third.\nDavid revealed that they knew the importance of starting well. He said: “We’ve always struggled to make a statement in the earlier games. Today, we... finally made a statement at the start, then we slowly pulled away.”", "url": "https://www.straitstimes.com/sport/schools/double-trouble-as-nanyang-girls-high-retain-c-div-basketball-title-national-jc-clinch-1st-c-boys-title"}