{"authors": [], "date_download": "2024-10-12 13:40:42", "date_modify": "2024-10-12 13:40:42", "date_publish": "2024-04-14 00:11:20", "description": "NOTTINGHAM, England - Matheus Cunha scored twice for Wolverhampton Wanderers in his first start in two months as relegation-threatened Nottingham Forest let a second-half lead slip in their 2-2 Premier League draw at the City Ground on Saturday. Read more at straitstimes.com.", "filename": "sport_football_wolves-cunha-punishes-struggling-forest-with-brace-in-2-2-draw_1728740442.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/14/LYNXNPEK3C05C-1.jpg?VersionId=_J86rW_shWLLuGXSQbRT4j2AWi6aQ.Yu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_wolves-cunha-punishes-struggling-forest-with-brace-in-2-2-draw_1728740442.html", "title": "Wolves’ Cunha punishes struggling Forest in 2-2 draw", "title_page": "Wolves’ Cunha punishes struggling Forest in 2-2 draw | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NOTTINGHAM, England - Matheus Cunha scored twice for Wolverhampton Wanderers in his first start in two months as relegation-threatened Nottingham Forest let a second-half lead slip in their 2-2 Premier League draw at the City Ground on Saturday.\nCunha gave Wolves a first-half lead with a superb solo goal, before the excellent Morgan Gibbs-White equalised on the stroke of halftime and Danilo put Forest in front before the hour-mark.\nBut a mistake by goalkeeper Matz Sels allowed Cunha to score his second and while the home side dominated much of the contest through possession and chances, they were unable to find a winner.\nForest, who are appealing a decision to deduct four points from them for breaching Premier League Profit and Sustainability rules, have 26 points from 33 games, one more than 18th placed Luton Town in the relegation zone.\n\"I think we'll all agree that we came off the pitch just now disappointed to have not taken the three points,\" Gibbs-White said. \"Again we have gone up in a game and we've conceded. We have to reflect on what happened, a point is still a point but we are disappointed not to take all three.\"\nWoeful Forest defending as they attempted to play out from the back forced Murillo to head off the line from Joao Gomes’ shot and with the goal gaping, Pablo Sarabia put the rebound wide.\nBut Wolves took the lead five minutes before halftime thanks to a fantastic goal from Cunha.\nHe picked up the ball on the halfway line and looked to have nothing on until he turned Forest defender Andrew Omobamidele and curled a wonderful shot into the far corner of the net.\nBut that joy was short-lived as Gibbs-White equalised when he glanced in a header from Gio Reyna’s corner, though goalkeeper Jose Sa will feel he should have done better.\nForest were rewarded for their dominance in the opening stages of the second half with a scrappy goal on 57 minutes. The visitors had several chances to clear the ball but it fell kindly for Danilo to finish from eight yards.\nWolves’ equaliser was also down to poor defending. Sels chose to punch a header when he should have caught the ball and as it rebounded off his own defender, it fell kindly for Cunha to poke home from close range.\n\"I think a draw is probably a fair outcome,\" Wolves manager Gary O'Neil told BBC. \"They had more shots and territory, we had more of the ball. Probably a fair result, but I am guessing Forest will be disappointed.\n\"They had some late pressure without troubling Jose Sa too much.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/wolves-cunha-punishes-struggling-forest-with-brace-in-2-2-draw"}