{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 13:43:12", "date_modify": "2024-10-12 13:43:12", "date_publish": "2024-02-15 20:36:00", "description": "A quarter-final finish will earn them a spot at the Paris Olympics. Read more at straitstimes.com.", "filename": "sport_singapore-eye-olympic-berths-at-world-team-table-tennis-championships_1728740592.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/15/QUEK20Izaac2028SGP29WTT20Grand20Smash202023SingaporeDay1232.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-eye-olympic-berths-at-world-team-table-tennis-championships_1728740592.html", "title": "Singapore eye Olympic berths at World Team Table Tennis Championships", "title_page": "Singapore eye Olympic berths at World Team Table Tennis Championships | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – National table tennis player Izaac Quek had a year to remember in 2023, when he made a name for himself on the international stage.\nThe 17-year-old won the men’s singles, doubles and team golds at the Cambodia SEA Games, broke into the top 100 in the world rankings, and recorded upsets over a list of higher-ranked players that included world No. 21 Frenchman Alexis Lebrun, Commonwealth Games champion Sharath Kamal Achanta, and Sweden’s men’s doubles world champion Mattias Falck.\nThat is all in the past now, as the teenager aims for a big goal in 2024 – qualifying for the Paris Olympics.\nHe said: “The good performances gave me more confidence and the motivation to work harder, but what is important for me is to try and have a mental reset, to not think about all those good matches and try to play as if I’m the underdog in every game, just like last year.\n“All my opponents will be older than me and have much more experience than me, so I still have to learn match by match.”\nHis experiences in 2023 have also given him more self-belief in his skills and he has learnt what it takes to get through crucial moments and points in matches.\nIzaac added: “Having all those good tournaments last year, I know very clearly what I have to work on. What’s important for me is hard work during training and trying to focus on my weaknesses and playing every match without pressure.”\nAn Olympic qualifying spot awaits him and his teammates at the Feb 16-25 World Team Table Tennis Championships in Busan, South Korea.\nBut with 80 teams vying for only 16 Olympic berths – eight each for the men and women’s teams – the Singaporeans acknowledged that the odds are stacked against them.\nThe world No. 22 men’s team comprising Izaac, Clarence Chew, Koen Pang and Josh Chua have been drawn into Group 7 with Brazil (No. 8), Slovenia (12), Canada (24) and Malaysia (70).\nThe 10th-ranked women’s team of Zhou Jingyi, Ser Lin Qian, Zeng Jian and Wong Xin Ru are in Group 7 with Romania (7), Sweden (22), Canada (26) and Serbia (45).\nThe top three teams in each group will progress to the knockout stage with the eight winners going directly into the last 16. The second and third-placed teams will compete in the next round for the remaining eight spots.", "url": "https://www.straitstimes.com/sport/singapore-eye-olympic-berths-at-world-team-table-tennis-championships"}