{"authors": ["Jonathan Wong"], "date_download": "2024-10-12 14:22:00", "date_modify": "2024-10-12 14:22:00", "date_publish": "2019-09-24 12:27:01", "description": "SINGAPORE - Olympic fever will hit next year's SMBC Singapore Open with Justin Rose, Henrik Stenson and Matt Kuchar set to star at the US$1 million (S$1.38 million) tournament. Read more at straitstimes.com.", "filename": "sport_golf_golf-olympic-medallists-justin-rose-henrik-stenson-and-matt-kuchar-coming-for-singapore_1728742920.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/09/24/ak_golf_2409.jpg?VersionId=ZDCOmEYbjlMtCpxecLgBrTz9wCOynjV5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_golf-olympic-medallists-justin-rose-henrik-stenson-and-matt-kuchar-coming-for-singapore_1728742920.html", "title": "Golf: Olympic medallists Justin Rose, Henrik Stenson and Matt Kuchar coming for Singapore Open", "title_page": "Golf: Olympic medallists Justin Rose, Henrik Stenson and Matt Kuchar coming for Singapore Open | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Olympic fever will hit next year's SMBC Singapore Open with Justin Rose, Henrik Stenson and Matt Kuchar set to star at the US$1 million (S$1.38 million) tournament.\nThe trio had won the gold, silver and bronze medals at the 2016 Rio Olympic Games - which saw the return of golf to the Summer Games programme since 1904 - and will be part of an elite field at the Sentosa Golf Club (SGC).\nFor the fifth straight edition, the Jan 16-19 event will be jointly sanctioned by the Asian Tour and Japan Golf Tour Organization.\nSingapore Golf Association president Ross Tan said on Tuesday (Sept 24): \"The SMBC Singapore Open has attracted many world class players over the years but it is fair to say the 2020 edition will be an extra special tournament with the calibre of players competing and their list of achievements.\n\"We look forward to welcoming them to Singapore for what is one of the biggest and most important golf tournaments in Asia. It is also the perfect way to start a year when the Olympics returns to Asia (Tokyo is the 2020 host).\"\nWorld No. 4 Rose and 34th-ranked Stenson played at the 2011 Singapore Open. The Englishman finished ninth while the Swede missed the cut. American Kuchar, 41, is world No. 21 and a nine-time PGA Tour winner including the 2012 Players Championship. He will be making his debut in the Republic.\nSGC's general manager and director of agronomy Andrew Johnston said: \"Sentosa has staged Singapore's national Open since 2005 and we are proud the tournament has grown to become one of the region's showpiece events that draws the finest players in the game.\"\nRose, 39, is a former world No. 1 and captured last year's FedEx Cup which earned him the US$10 million prize. He also won the 2013 US Open.\nFellow European Stenson, 43, is also a Major champion after his victory at the 2016 British Open and won the PGA Tour's FedEx Cup in 2013 as well as the European Tour's Race to Dubai that year.\nPatrick Feizal Joyce, senior vice president of golf(Asia) at Lagardere Sports, organiser of the Singapore Open, said: \"This is certainly an exceptional line-up of star players particularly as they were the medallists at the last Olympics.\n\"All three have won nearly every accolade in golf and are known for being true ambassadors of the game, so it will be an outstanding start to the year for everyone involved.\"\nLast year's champion Thai Jazz Janewattananond is also expected to return to defend his Singapore Open title.", "url": "https://www.straitstimes.com/sport/golf/golf-olympic-medallists-justin-rose-henrik-stenson-and-matt-kuchar-coming-for-singapore"}