{"authors": [], "date_download": "2024-10-12 13:42:14", "date_modify": "2024-10-12 13:42:14", "date_publish": "2024-02-10 22:46:00", "description": "The win lifted Pep Guardiola's men provisionally into top spot in the Premier League. Read more at straitstimes.com.", "filename": "sport_football_haaland-nets-first-goals-since-layoff-as-man-city-beat-everton-2-0_1728740534.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/10/LYNXNPEK1904C-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_haaland-nets-first-goals-since-layoff-as-man-city-beat-everton-2-0_1728740534.html", "title": "Haaland nets first goals since layoff as Manchester City beat Everton 2-0", "title_page": "Haaland nets first goals since layoff as Manchester City beat Everton 2-0 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANCHESTER, England - Erling Haaland announced his return to the scoresheet in emphatic fashion with a brace to lift Manchester City to a 2-0 home victory over relegation-threatened Everton on Feb 10 and provisionally into top spot in the Premier League table.\nHaaland, who recently missed almost two months with a broken bone in his foot, netted his 15th and 16th of the season in the second half to break down some stubborn Everton resistance and go clear at the top of the Premier League scorers’ list.\nHe also added another record to his collection with the 23-year-old bagging 51 goals in 50 league starts – more goals in 50 starts than any other player in the competition.\nPep Guardiola’s team have 52 points after 23 games, while Liverpool – who can reclaim the lead with a win over Burnley later on Feb 10 – have 51 points, also from 23 games.\nEverton are in the relegation zone in 18th.\nHaaland’s return to form was perfect timing for City who had 72.5 per cent possession against Everton but mustered just three shots on target.\n“The changes in the second half gave us another rhythm and of course Erling is back. To have this player, when the ball is there from a corner... and the finishing was amazing,” Guardiola said.\n“In the first half our body language was not good, we were always complaining. In the second half they were more positive If you want to give the best of yourself the body language has to be in the right position and finally we took a massively important three points.”\nThe Toffees’ stifling defence frustrated City before the Norwegian striker finally broke the deadlock with City’s first effort on target in the 71st minute when he fired home a blistering shot after a corner kick.\nIt was his first goal for City since their 3-2 Champions League win over RB Leipzig on Nov 28.\nHaaland, who previously shared top spot in the scorers chart with Liverpool’s Mohamed Salah, completed the brace when he ran onto a pass from Kevin De Bruyne in midfield before beating Jarrad Branthwaite and then coolly slotting it past keeper Jordan Pickford.\nIt was the first time City have failed to produce a shot on target in the first half of a home league game since August 2022 against Crystal Palace. They went on to win that game 4-2.\n“I think the first goal came out of their first shot on target, they only had three shots on target so that shows our defensive side of the game,” Everton manager Sean Dyche said.\n“I thought we were organised, I thought the discipline was good. The truth of it is when you turn the ball over, can you keep it, can you ask enough questions? We didn’t.”", "url": "https://www.straitstimes.com/sport/football/haaland-nets-first-goals-since-layoff-as-man-city-beat-everton-2-0"}