{"authors": [], "date_download": "2024-10-12 14:14:20", "date_modify": "2024-10-12 14:14:20", "date_publish": "2024-09-13 03:50:54", "description": "Newey, whose cars have claimed more than 200 Grand Prix victories and 25 championships, turned down the Briton's new team Ferrari. Read more at straitstimes.com.", "filename": "sport_formula-one_hamilton-not-disappointed-by-star-designer-newey-s-move-to-aston-martin_1728742460.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/13/HAMILTON-AZERBAIJAN.JPG?VersionId=NG8.FDsDfSTDEYsEVVx2A9TpgL2k4c83", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_hamilton-not-disappointed-by-star-designer-newey-s-move-to-aston-martin_1728742460.html", "title": "Lewis Hamilton not disappointed by star designer Adrian Newey’s move to Aston Martin", "title_page": "Lewis Hamilton not disappointed by star designer Adrian Newey’s move to Aston Martin | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BAKU – Lewis Hamilton on Sept 12 dismissed suggestions that he felt disappointed, or snubbed, by star designer Adrian Newey’s decision to join Aston Martin in 2025 instead of leaving Red Bull for Ferrari.\nThe seven-time champion insisted he felt “privileged” to have worked with two title-winning teams at McLaren and Mercedes, without Newey, but added that it would have been an “honour” to work with him in Italy next season.\n“Any team probably would have been happy to have had him,” said Hamilton of the 65-year-old Briton who confirmed on Sept 10, at a glitzy announcement ceremony, that he will move to Aston Martin next season.\n“At the end of the day, he had to do what was best for him. It doesn’t change anything for me.\n“It doesn’t change my goal, or my focus with the next move (to Ferrari). So, I still believe 100 per cent that there’s lots we can do there.”\nNewey, whose cars have claimed more than 200 Grand Prix victories and 25 drivers’ and constructors’ championships, revealed earlier in 2024 he intended to leave Red Bull and had been in discussions with several teams, including Ferrari, before deciding to go to Silverstone-based Aston Martin.\nHamilton, winner of six titles with his current Mercedes team and one with McLaren, said that Newey was the person he had most wished to work with in Formula One.\nSpeaking in Baku ahead of this weekend’s Azerbaijan Grand Prix, he was asked if he felt disappointed at seeing Ferrari miss out on signing Newey.\n“Honestly, no. I feel like... while I’ve mentioned before that it would be an honour to work with Adrian, I have been privileged to work with two championship-winning teams that didn’t have Adrian,” he said.\nHis prospective Ferrari teammate Charles Leclerc said he also did not feel disappointment.\n“It’s not like we haven’t tried or spoken to Adrian,” he said. “I know that there were talks and he made his decision. I respect his decision.\n“At the end, as Ferrari, we have always considered more the group than the individual.\n“Of course, Adrian has an incredible record and has done amazing things, but we have an amazing group and I have no doubt that we have an extremely strong team to come back at the top.”\nTwo-time world champion Fernando Alonso, who will work with Newey at Aston Martin in 2025, hinted that he may not stay in F1 beyond 2026 to see the full fruits of team owner Lawrence Stroll’s investments.\nThe Spaniard will be 45 in 2026 when the first original Newey-designed Aston Martin is set to race in the championship and it is also then that his current four-year contract ends.\n“I will be driving in 2026. And after 2026, I will be in F1 or another series with Aston Martin,” he said, with a touch of typical enigmatic humour.\n“I will enjoy that bright future – the Valkyrie (sportscar) programme for Le Mans is taking shape next year and who knows for 2027, 2028 and 2029?”\nA possible replacement down the line could be three-time world champion Max Verstappen, with pit-lane speculation linking him with a move away from Red Bull, who have struggled recently.\nThe Dutchman would not be drawn on the subject on Sept 12, but said it was a possibility.\n“I have other worries at the moment that I’m paying a lot of attention to, that I’m working on. So that is something maybe for the future that I think about, but not now,” said Verstappen.\nAston Martin team boss Mike Krack, however, made no bones about his desire for the 26-year-old to join the team.\n“The door for Max Verstappen is always open... for everything,” he said. “When you manage to appoint Adrian Newey, it’s proof that the project is credible.” AFP", "url": "https://www.straitstimes.com/sport/formula-one/hamilton-not-disappointed-by-star-designer-newey-s-move-to-aston-martin"}