{"authors": [], "date_download": "2024-10-12 13:42:19", "date_modify": "2024-10-12 13:42:19", "date_publish": "2024-07-12 19:41:29", "description": "LONDON - England's James Anderson brought down the curtain on his stellar international career by taking a wicket against West Indies on the third day of the first test at Lord's on Friday as he helped his side wrap up a comfortable win by an innings and 114 runs. Read more at straitstimes.com.", "filename": "sport_retiring-anderson-helps-england-wrap-up-innings-win-over-windies_1728740539.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/12/LYNXMPEK6B0FI-1.jpg?VersionId=0rzvrnLzMCLFeMe92aW0VwodYzGV_Crs", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_retiring-anderson-helps-england-wrap-up-innings-win-over-windies_1728740539.html", "title": "Emotional Anderson bows out as England wrap up innings win over Windies", "title_page": "Emotional Anderson bows out as England wrap up innings win over Windies | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - England's James Anderson brought down the curtain on his stellar international career by taking a wicket against West Indies on the third day of the first test at Lord's on Friday as he helped his side wrap up a comfortable win by an innings and 114 runs.\nAnderson looked uncharacteristically emotional before the start of play as he walked out to a guard of honour and a standing ovation from the crowd in his 188th and final test.\nBut the seamer quickly got to work and had Joshua Da Silva (9) caught behind in his second over of the day, finding just enough movement to draw the outside edge and pick up his 704th test wicket to finish with match figures of 4-58.\nThe 41-year-old retires with a record number of test wickets by an England bowler and the most by any seam bowler. He is third on the all-time list for test wickets behind Australian Shane Warne (708) and Sri Lanka's Muttiah Muralitharan (800).\nAnderson, clutching a pint of Guinness in the dressing room, told Sky Sports he was still trying to hold back tears at the end of his final match.\n\"This morning was quite emotional with the two teams lined up and the reaction from the crowd was pretty special,\" he said.\n\"Playing for England is the best job in the world. I've been privileged to do it for a long time.\"\nEngland captain Ben Stokes said the match was a near-perfect start to the summer, particularly with debutants Gus Atkinson and Jamie Smith turning in impressive performances.\n\"We dominated the game,\" Stokes said. \"But we had to work really hard for that. We went through periods where we had to make things happen. So we are very pleased.\"\nHEAVY DEFEAT\nAnderson's farewell would always have drawn the headlines, but there was not much competition given the lack of any real contest in a little more than two days of play.\nHis fourth wicket of the match dented West Indies' slim chances of making England bat again, though the match was really lost on the first day when the visitors slumped to 121 all out.\nIt was Atkinson who did the damage with a man of the match performance, bowling with genuine pace and looking very much at home in international cricket with a pair of five-wicket hauls.\nWith an unlikely 171 runs needed at the start of play just to make England bat again, Alzarri Joseph (8) decided to go down swinging, clubbing Atkinson back over his head for four amid some wild swipes.\nHe then top-edged Atkinson to Ben Duckett on the leg-side boundary, taking Atkinson to 10 wickets on his test debut.\nShamar Joseph (3) was not far behind, clean bowled by Atkinson as the tailender missed a straight yorker with an ugly hack across the line.\nGudakesh Motie put up the only resistance and his 31 not out was West Indies' highest individual score in the match.\nMotie was involved in two of the highlights of the day, first driving Atkinson to the cover boundary to draw a long chase and full-length dive from Anderson to save a single run.\nMotie then seemingly handed Anderson his 705th test wicket on a plate, driving the ball straight back to the bowler but he spilled it.\nAnderson did not get a better chance for a final wicket and Atkinson – who finished with a match total of 12-106 – wrapped things up when Jayden Seales (8) holed out to Duckett as West Indies were all out for 136.\nWest Indies skipper Kraigg Brathwaite said his team did not have a lot of time to reflect ahead of the second test starting at Trent Bridge next Thursday.\n\"Disappointed, but it's gone now,\" he told reporters. \"We have two test matches left in this series and we have got to look ahead and we have got to stay mentally tough.\" REUTERS", "url": "https://www.straitstimes.com/sport/retiring-anderson-helps-england-wrap-up-innings-win-over-windies"}