{"authors": [], "date_download": "2024-10-12 14:15:53", "date_modify": "2024-10-12 14:15:53", "date_publish": "2024-03-21 12:52:26", "description": "The 2.5-month stint is at the team's headquarters in Milton Keynes and ends at the Singapore Grand Prix on Sept 22. Read more at straitstimes.com.", "filename": "sport_formula-one_world-s-fastest-job-ad-two-singaporeans-to-get-opportunity-to-intern-at-formula-one-champions-red-bull-racing_1728742553.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/21/RBICIMAGEMAX.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_world-s-fastest-job-ad-two-singaporeans-to-get-opportunity-to-intern-at-formula-one-champions-red-bull-racing_1728742553.html", "title": "‘World’s fastest job ad’: Two S’poreans to get chance to intern at F1 champions Red Bull Racing", "title_page": "‘World’s fastest job ad’: Two S’poreans to get chance to intern at F1 champions Red Bull Racing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Two Singaporean motor racing fans will get to see and experience the fast-paced world of Formula One with the Red Bull Racing team this season.\nPokka, the official distributor of Red Bull in Singapore, on March 21 launched the Red Bull Intern Championship to offer two individuals a once-in-a-lifetime opportunity to work with the world championship team.\nTouted as the “world’s fastest job ad”, applications for the internship programme are open.\nThe winners will be selected for a 2½-month stint at the team’s headquarters in Milton Keynes, England, culminating with the Singapore Grand Prix on Sept 22.\nRed Bull Racing is targeting Singaporeans aged 18 and above.\nThe interns will get invaluable hands-on experience and witness the inner workings of a successful racing team through their roles in the marketing department.\nRed Bull, winners of six constructors’ titles and seven drivers’ championships, have started the 2024 season dominantly.\nThree-time world champion Max Verstappen is top of the leaderboard with 51 points from two race wins and teammate Sergio Perez second on 36. Ferrari’s Charles Leclerc is third on 28 points.", "url": "https://www.straitstimes.com/sport/formula-one/world-s-fastest-job-ad-two-singaporeans-to-get-opportunity-to-intern-at-formula-one-champions-red-bull-racing"}