{"authors": [], "date_download": "2024-10-12 14:11:19", "date_modify": "2024-10-12 14:11:19", "date_publish": "2024-05-12 15:57:16", "description": "Doncic scored 22 points and grabbed 15 rebounds in the most physical contest of the best-of-seven West s-final series so far. Read more at straitstimes.com.", "filename": "sport_basketball_luka-doncic-kyrie-irving-lead-mavericks-over-thunder-for-2-1-lead_1728742279.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/12/11334192.jpg?VersionId=cVxrdqsR18hbKGpEqXjeelL90qNl_RRl", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_luka-doncic-kyrie-irving-lead-mavericks-over-thunder-for-2-1-lead_1728742279.html", "title": "Luka Doncic, Kyrie Irving lead Mavericks over Thunder for 2-1 lead in NBA play-offs", "title_page": "Luka Doncic, Kyrie Irving lead Mavericks over Thunder for 2-1 lead in NBA play-offs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Luka Doncic fell hard on his back while battling defensive star Luguentz Dort for a loose ball, had a sore left ankle and tweaked his sprained right knee as the game ended.\nBut Doncic and the Dallas Mavericks walked off the American Airlines Centre court with a 105-101 win over the Oklahoma City Thunder on May 11 to take a 2-1 lead in their National Basketball Association (NBA) Western Conference semi-final series.\nDoncic scored 22 points and grabbed 15 rebounds in the most physical contest of the best-of-seven series so far.\n“We got the win, that’s all that matters,” said the Slovenian.\n“I think I’m battling,” he said, adding that a bit of extra rest without travel before the Mavs host Game 4 on May 13 was welcome.\nDallas dug deep in the second half to erase a double-digit deficit, even as Kyrie Irving left it a bit late to make a scoring push.\nHe scored 14 of his 22 points in the second half, including a floater with 39.3 seconds left that pushed Dallas’ lead to five points.\nP.J. Washington led the Mavs’ scoring with 27 points and Dereck Lively added 12 off the bench to help Dallas withstand a 31-point performance from Thunder guard Shai Gilgeous-Alexander.\nGilgeous-Alexander added 10 rebounds and five blocks, but was called for a charge with Doncic defending on a drive with 29 seconds left.\nBoth teams struggled to get their offences firing in the first quarter, but Dallas outrebounded Oklahoma City 17-5 and dominated in the paint to take a three-point lead through one period.\nDallas continued to control the boards, but Oklahoma City connected on 60 per cent of their shots in the second to take a 52-51 lead at half-time, pushing their advantage to 65-55 with an 11-0 scoring burst in the third.\nThe Mavs responded with a 16-0 run that featured a huge dunk by Washington and was capped by his three-pointer that pushed the hosts’ lead to 71-65.\nThe run energised the crowd, but Oklahoma City quickly cut the lead to one before the Mavs responded again, Irving connecting on a pair of three-pointers and feeding Daniel Gafford for a dunk before Tim Hardaway Jr closed the period with a three-pointer that put Dallas up 82-78 going into the final quarter.\n“We started to get some stops and then we started to run,” Mavericks coach Jason Kidd said. “We relied on our defence, we made some shots and our energy picked up.”\nThunder coach Mark Daigneault said his young team – with an average age of just over 23 – got a little sloppy in the third quarter to squander a golden chance to grab a win in Dallas.\n“We were up by 10 and had a pretty good grip on it and just didn’t stack quality-enough possessions,” he said. “There are a lot of things we can learn from.”\nOklahoma City, the top seeds in the Western Conference, have now lost consecutive games after starting 5-0 in the play-offs.\n“It’s extremely competitive,” said Thunder centre Chet Holmgren. “Both teams really want it. If you take the result out of it, it’s everything that you want to be going through in a basketball game.”\nIn the Eastern Conference, Jayson Tatum and Jaylen Brown combined to score 61 points to fire the Boston Celtics to a bounce-back NBA play-off win over Cleveland.\nTatum scored 33 points and Brown 28 as overall top seeds Boston, stunned by the Cavaliers on their home court in Game 2, beat the Cavs 106-93 in Cleveland to take a 2-1 lead in their best-of-seven semi-final.\nThe Celtics emerged from a nip-and-tuck first quarter with a two-point lead and never trailed again.\n“We just wanted to bounce back,” Tatum said. “Our back was against the wall, so it was a good test for us to see how we respond. We were up for the challenge.” AFP", "url": "https://www.straitstimes.com/sport/basketball/luka-doncic-kyrie-irving-lead-mavericks-over-thunder-for-2-1-lead"}