{"authors": [], "date_download": "2024-10-12 13:42:24", "date_modify": "2024-10-12 13:42:24", "date_publish": "2024-06-27 13:40:21", "description": "The tournament is a platform for the rising stars of the game to showcase their talents with all of Europe watching. Read more at straitstimes.com.", "filename": "sport_football_five-young-players-shining-at-euro-2024_1728740544.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/27/11434931.jpg?VersionId=dPQEyJONSC8iAMzGkWnsgkmvf84ommAB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_five-young-players-shining-at-euro-2024_1728740544.html", "title": "Five young players shining at Euro 2024", "title_page": "Five young players shining at Euro 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HERZOGENAURACH – As the Euro 2024 group phase came to an end on June 26 and the remaining 16 teams prepare for the knockout stage, the tournament has so far provided a platform for the rising stars of the game to showcase their talents with all of Europe watching.\nHere are five players aged 21 and under who have shone during the group stage.\n1. Nico Williams, 21 (Spain)\nSpain’s perfect group-stage performances – three wins and no goals conceded – have rocketed the three-time winners to hot favourites to win the tournament, and nobody has impressed more than Williams.\nThe winger turns 22 on July 12, just two days before the Euro 2024 final in Berlin.\nFresh from helping boyhood side Athletic Bilbao lift the Spanish King’s Cup, their first piece of silverware for 40 years, Williams has shown he belongs on the international stage as part of an impressive Spain outfit.\nHe was a constant attacking threat for the Spaniards, particularly in the 1-0 win over Italy where he was named player of the match.\nEntering the dressing room after that match, Williams was personally congratulated by the Spanish King, later telling the media: “I’ve dreamt of moments like this all my childhood.”\n2. Lamine Yamal, 16 (Spain)\nBarcelona winger Lamine Yamal became the youngest European Championship player during Spain’s 3-0 win over Croatia, aged 16 years and 338 days.\nHe also became the youngest player to lay on a Euro assist in that match and impressed against Italy, before starting from the bench versus Albania.\nSpain coach Luis de la Fuente said he was trying to ease the burden on the young star by restricting the minutes of the teenager “touched by God’s magic wand”.\n3. Jamal Musiala, 21 (Germany)\nThe advanced midfielder has been the hosts’ most effective attacking force so far at Euro 2024, scoring a goal in each of the first two games as Germany won Group A.\nHe was the only shining light as the Germans were eliminated at the group stage of the 2022 World Cup, and two years later he is becoming the complete package and has added goalscoring to his creative attacking game.\nAt this Euro, Musiala has put an inconsistent season with Bayern Munich behind him and linked well with fellow 21-year-old Florian Wirtz of Bayer Leverkusen despite the two playing similar roles for their respective clubs.\nAfter a Man-of-the-Match performance in the 5-1 demolition of Scotland in the tournament opener, Musiala was asked if he had just played the best match of his young career.\n“You could say that, yes,” the Germany-born, England-raised midfielder said, laying down a warning to the other teams at the tournament.\n4. Jude Bellingham, 20 (England)\nDespite being just 20 years of age, the England midfielder has arguably become the central component of the Three Lions since his star turn at the 2022 World Cup.\nScorer of the only goal against Serbia that gave England their lone victory of the tournament so far, Bellingham came into Euro 2024 off the back of a La Liga and Champions League double with Real Madrid.\nAlongside captain Harry Kane, he will be crucial to England’s fortunes should they shake off more than half a century of heartbreak at major tournaments.\n5. Arda Guler, 19 (Turkey)\nThe forward has picked up where he left off for his club, having finished the La Liga season in excellent form with Real, scoring five goals in his last five league appearances.\nWith the score at 1-1 in Turkey’s opener against Georgia, Guler scored a long-range screamer that is a contender for goal of the tournament. At 19 years, 114 days, he became the youngest player to score on his Euro debut – breaking the record held by Cristiano Ronaldo. Guler was not yet born in 2004 when Ronaldo, now 39, set the mark, a fitting tribute given the Portuguese is likely playing his last Euro before handing the baton to the new generation.\nTurkey beat Georgia 3-1 on the way to finishing second in Group F behind Portugal. AFP", "url": "https://www.straitstimes.com/sport/football/five-young-players-shining-at-euro-2024"}