{"authors": ["Nicole Chia"], "date_download": "2024-10-12 14:21:33", "date_modify": "2024-10-12 14:21:33", "date_publish": "2020-01-07 14:30:21", "description": "SINGAPORE - Joseph Wong and his two friends Amir Syariqul Haekal Amir Razif Shari and Benjamin Ng were so determined to be the first three to sign up for the May 9-10 OCBC Cycle that they decided to queue well ahead of the event's launch - 23 hours early to be precise. Read more at straitstimes.com.", "filename": "sport_cycling-trio-queue-for-23-hours-to-sign-up-for-ocbc-cycle-are-rewarded-with-handsome-prizes_1728742893.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/01/07/ak_ocbc_0701.jpg?VersionId=25VUYF_BTdy44TIK3b95NO8NYltsbsqr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_cycling-trio-queue-for-23-hours-to-sign-up-for-ocbc-cycle-are-rewarded-with-handsome-prizes_1728742893.html", "title": "Cycling: Trio queue for 23 hours to sign up for OCBC Cycle, are rewarded with handsome prizes", "title_page": "Cycling: Trio queue for 23 hours to sign up for OCBC Cycle, are rewarded with handsome prizes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Joseph Wong and his two friends Amir Syariqul Haekal Amir Razif Shari and Benjamin Ng were so determined to be the first three to sign up for the May 9-10 OCBC Cycle that they decided to queue well ahead of the event's launch - 23 hours early to be precise.\nThey were rewarded for their patience on Tuesday (Jan 7) when they left the OCBC Square at the Singapore Sports Hub with some handsome prizes.\nWong, the first to sign up, took home a Garmin Performance GPS cycling computer and an Aleoca mountain bicycle.\nHaekal received the same computer and Herschel merchandise.\nNg, the third registrant, got a DJI Osmo Action camera and an Aleoca mountain bike.\nWellbeing consultant Ng told The Straits Times: \"We knew what we wanted so once we decided, we decided to come together and be the first three.\n\"The both of them wanted the Garmin (training computer) and I wanted the camera.\"\nThe 34-year-old Ng, who has attended the OCBC Cycle every year since 2015, became friends with Joseph, 17, when both were queuing to register for the event last year.\n\"Based on last year, the (first) person came at 2pm so we came slightly earlier than that today,\" said the ITE College Central student, who recalls being fifth in last year's queue. \"When you've been queuing for 20 hours here, you will remember these things.\"\nThe trio will participate in the 42km Sportive Ride at the Singapore Sports Hub on May 10, the same day that the 23km The Straits Times Ride takes place.\nHaekal, 17, is already looking forward to his race despite the event being four months away. But he has a reminder to himself ahead of his second OCBC Cycle outing: \"Don't go fast, just enjoy the scenery. That was my mistake (the first time)... there's no point in going too fast.\"\nThis year's event is the 12th edition but in keeping with tradition, organisers have rolled out new features. This year, one of them is the option to go \"freestyle\". This means those joining both categories can opt not to receive the event apparel in their event packs if they prefer to wear their own attire. But all participants of the Mighty Savers Kids and Family Ride will receive an event T-shirt.\nAnother new feature is the introduction of a new race category for women, with up to five amateur competitive women's cycling teams taking part in the OCBC Cycle Speedway Women's Championships.\nIt is the fourth competitive race in the event, in addition to the OCBC Cycle Speedway Southeast Asia, Club and Corporate Championships.\nCyclist Elizabeth Hodges, who raced in the OCBC Cycle Speedway Club Championship last year as part of the all-women Fahrenheit Performance Development Team club, will race in the inaugural Women's Championship with local women's cycling club Not My Boyfriend's Team.\nThe 35-year-old said: \"We are thoroughly excited to hear that OCBC Cycle is keen to support women and women's racing.\n\"The female riding community is growing and while change is slow, it cannot be doubted that there are more women riding together more often than before.\"\nOCBC Bank's Group chief executive officer Samuel Tsien noted the rise in interest in cycling among women, adding that having the first two all-women club teams at last year's OCBC Cycle encouraged organisers to introduce an all-women category this year.\n\"OCBC Cycle has evolved to keep up with cyclists' interests and passions,\" he said. \"The key to our event's success has always been a result of support not only from the cycling community, but also from the local authorities, our partners, our sponsors and the general public.\"\nThose who need bicycles for the event can rent an SG Bike for $15, but this is limited to the first 200 participants on a first-come-first-served basis. Each rental comes with a one-month SG Bike pass worth $15.\nOnline registration for the 2020 OCBC Cycle starts on Wednesday (Jan 8) at 10am. Visit www.ocbccycle.com for more information.", "url": "https://www.straitstimes.com/sport/cycling-trio-queue-for-23-hours-to-sign-up-for-ocbc-cycle-are-rewarded-with-handsome-prizes"}