{"authors": [], "date_download": "2024-10-12 14:17:44", "date_modify": "2024-10-12 14:17:44", "date_publish": "2023-09-22 17:28:10", "description": "He is looking to bounce back from a disappointing fifth-place finish last week, which ended his winning streak of 10 straight races. Read more at straitstimes.com.", "filename": "sport_formula-one_red-bull-boss-christian-horner-hails-max-verstappen-s-maturity-after-singapore-setback_1728742664.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/22/AUTO-PRIX-F1-BEL-QUALIFYING-150934.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_red-bull-boss-christian-horner-hails-max-verstappen-s-maturity-after-singapore-setback_1728742664.html", "title": "Red Bull boss Christian Horner hails Max Verstappen’s ‘maturity’ after Singapore setback", "title_page": "Red Bull boss Christian Horner hails Max Verstappen’s ‘maturity’ after Singapore setback | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SUZUKA – Red Bull chief Christian Horner on Friday hailed a more mature Max Verstappen as the Formula One world champion looks to take a step closer to retaining his title at the Japanese Grand Prix.\nThe Dutchman, who won at Suzuka in 2022 after a chaotic race shortened by rain, is poised to claim his third straight championship, having won 12 of 15 races so far this season.\nMore importantly, he is looking to bounce back from a disappointing fifth-place finish at last week’s Singapore Grand Prix, which ended his record winning streak of 10 straight races.\nHorner has been impressed by Verstappen’s response, saying that the 25-year-old had been “very constructive” in reviewing what went wrong in Singapore.\n“I think he’s shown great leadership, great maturity in the way that he handled it,” he said.\n“Everybody was disappointed last weekend – you get used to winning, and it’s a good reminder of how much it hurts to lose. And if it doesn’t hurt to lose, then you’re in the wrong business.”\nVerstappen made what Horner called a “statement of intent” by clocking the fastest times in both practice sessions in Suzuka on Friday, laying down a marker with his first lap out of the pits before staying on top throughout the day.\nHe lapped with a best time of 1min 31.647sec – 0.626 seconds quicker than Ferrari’s Singapore winner Carlos Sainz – in the first session and went on to do a lap of 1:30.688.\nFerrari’s Charles Leclerc, who was fourth in the first practice when he was testing a new floor on his car, was second in the second session and 0.320sec slower than Verstappen.\nHorner said that his driver “just gets sharper and sharper”.\n“It’s still early days but certainly Max laid down a statement of intent with his first flying lap of the weekend, which was truly impressive,” he said.\n“The raw speed and ability have been there from day one, and that hunger and passion that he drives with.\n“Now he couples that with experience and the way he reads the race, the way he manages tyres, the way he reads the situation. He pushes the team, we push him and we both go to new levels.”\nMcLaren boss Zak Brown, who saw his driver Lando Norris finish second in Singapore, could only agree, jokingly telling Sky Sports: “Max back to the front again, so it was fun while it lasted.”\nVerstappen, who holds a whopping 151-point lead over teammate Sergio Perez with seven races to go, was in no mood to dwell on last weekend’s failure, and was ready to “move on and try again”.\n“No emotion, we stopped winning for one race – s**t happens, we won 10 in a row before that,” he said.\n“There’s a lot of degradation on this track so it will be quite tough on tyres in the race, but so far it’s a good start to the weekend. We focus on ourselves and try to optimise our performance.\n“If we do that, then I’m confident we fight for pole (on Saturday).” AFP, REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/red-bull-boss-christian-horner-hails-max-verstappen-s-maturity-after-singapore-setback"}