{"authors": [], "date_download": "2024-10-12 14:13:57", "date_modify": "2024-10-12 14:13:57", "date_publish": "2024-08-10 02:07:09", "description": "PARIS - Chen Yiwen won the 3-metre springboard title on Friday to give China a seventh diving gold and keep alive their hopes of a Paris Olympics sweep. Read more at straitstimes.com.", "filename": "sport_diving-paris-medallists-share-precious-moments-on-and-off-the-podium_1728742437.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/10/ST-logo-placeholder_16.jpg?VersionId=cuzNHJSWqK4HEFUk.CDQOTBzxxFPdPyB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_diving-paris-medallists-share-precious-moments-on-and-off-the-podium_1728742437.html", "title": "Diving-Paris medallists share precious moments on and off the podium", "title_page": "Diving-Paris medallists share precious moments on and off the podium | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Chen Yiwen won the 3-metre springboard title on Friday to give China a seventh diving gold and keep alive their hopes of a Paris Olympics sweep.\nAs her name was announced at the victory ceremony, Maddison Keeney and Chen's teammate Chang Yani, who won silver and bronze, raised their arms in the air to give Chen a guard of honour as she mounted the podium with a big grin on her face.\n\"When we finished the dives, I was cleaning up my stuff by the jacuzzi pool and Maddie was there too. We just came up with this idea on a whim,\" Chen told reporters after the ceremony.\nThe three have been competing in international events for a number of years, Chen said, and have forged a strong friendship.\n\"I've known her for some eight years. It is really rare to come by a friend in the international arena to have competed with you for eight years,\" Chen said.\n\"And this time the three of us stood on the podium together. This moment was just incredible and really, really precious for us.\"\nAt 28, Australian Keeney is the oldest of the trio and while she participated in the Rio Games in 2016, both Chen and Chang debuted in Paris.\n\"I feel like these girls they are like sisters, and I was really lucky to be able to have, you know, a really positive, competitive relationship with them,\" Keeney said.\n\"No matter what happens on the board, that doesn't affect our relationships outside the board.\"\nFriendships between Chinese athletes and their rivals have been relatively rare, often due to language barriers, sometimes due to political tension, and always due to the enormous pressure on them to win gold medals.\nAs their Olympic journey has come to an end, the three diving medallists said they would try to spend some time together outside competition.\n\"I'll come hang out. I'm very excited to hang out,\" Keeney said as Chen asked her what her plans were.\nChang said they were looking to take a trip together.\n\"It was fate that brought us together and we had a similar temperament and really get along,\" she said. \"If we are all on holiday and have time, we will go travel together.\" REUTERS", "url": "https://www.straitstimes.com/sport/diving-paris-medallists-share-precious-moments-on-and-off-the-podium"}