{"authors": [], "date_download": "2024-10-12 14:11:35", "date_modify": "2024-10-12 14:11:35", "date_publish": "2024-05-13 14:45:15", "description": "The defending champions Denver were fuelled by 35 points from NBA Most Valuable Player Jokic. Read more at straitstimes.com.", "filename": "sport_nuggets-outgun-timberwolves-pacers-thrash-knicks-to-level-nba-play-off-series_1728742295.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/13/2024-05-13T035520Z1727902502MT1USATODAY23258998RTRMADP3NBA-PLAYOFFS-DENVER-NUGGETS-AT-MINNESOTA-TIMBERWOLVES.JPG?VersionId=UvwOQbbXLudRyEyKEHKQc..fUorpXeko", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_nuggets-outgun-timberwolves-pacers-thrash-knicks-to-level-nba-play-off-series_1728742295.html", "title": "Nuggets outgun Timberwolves, Pacers thrash Knicks to level NBA play-off series", "title_page": "Nuggets outgun Timberwolves, Pacers thrash Knicks to level NBA play-off series | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Defending champions Denver Nuggets outgunned the Minnesota Timberwolves 115-107 to level their NBA play-off series on May 12, as the Indiana Pacers also pulled even with the New York Knicks.\nThe Nuggets – fuelled by 35 points from NBA Most Valuable Player Nikola Jokic, Aaron Gordon’s 27 points and 19 points from Jamal Murray – claimed a second straight road win at Target Centre to tie their best-of-seven Western Conference semi-final series at two games apiece.\nThe Pacers dismantled the Knicks 121-89 at Gainbridge Fieldhouse to level their Eastern Conference semi-final series at 2-2.\n“Now it’s best of three,” Jokic said, adding that the Timberwolves’ stunning victories in Games 1 and 2 in Denver had only strengthened the defending champions.\n“We took a hit and we bounced back and hopefully we can defend the home court now,” said Jokic, looking forward to Game 5 at Ball Arena in Colorado on May 14.\nThe Nuggets withstood a 44-point performance from Anthony Edwards, but the Timberwolves star just did not have enough scoring support despite an energetic effort from the hosts.\nKarl-Anthony Towns finished with 13 points but was 0 for 7 in the first quarter, when the Nuggets closed the period on a 14-2 run to seize a five-point lead.\nEdwards’ dunk with less than a minute left in the first half cut what had been a 16-point deficit to seven.\nJokic then came up with a steal and fed Michael Porter Jr for a dunk. Murray grabbed a steal, turned and unleashed a buzzer-beating shot from beyond the half-court line that swished through and sent the Nuggets into the break with a 64-49 lead.\nMurray scored 12 points in the third quarter to keep the Nuggets in control as early foul trouble sent Jokic to the bench. Jokic returned to score 16 in the fourth and the Nuggets, who shot 57 per cent (45 of 79) from the field, kept the Timberwolves at bay.\n“Never underestimate the heart of a champion. They were quick to write us off, but these guys, we won a championship a year ago. You know what I mean? This team has been tested time and time again, and we’ve found a way to solve whatever has been thrown at us,” Nuggets coach Michael Malone said.\nIn Indianapolis, Tyrese Haliburton scored 20 points as the Pacers connected on 56.8 per cent of their shots, drilling 14 three-pointers and dominating in the paint. T.J. McConnell scored 15 points off the bench for Indiana, who had six players score in double figures.\nThe Pacers led as many as 23 points in the first quarter. The domination continued in the second quarter, Haliburton sending the crowd into a frenzy with a three-pointer over Donte DiVincenzo that put the Pacers up by 30 with 5.9 seconds left in the first half.\nThey would lead by as many as 43 before it was over but, despite the rapturous ovation from fans, Haliburton said the Pacers must remain focused on the task ahead at Madison Square Garden on May 14.\n“We did our job. They did their job and won two at home, we did our job and won two at home. We understand the magnitude of Game 5 and we’ll be prepared for that one,” he said.\nThe Knicks were again without O.G. Anunoby, who injured a hamstring in Game 2 to join key contributors Julius Randle, Mitchell Robinson and Bojan Bogdanovic on the sidelines.\nThe strain was telling on Jalen Brunson, who is playing through a right foot injury. He connected on six of 17 attempts to score 18 points with three rebounds and five assists before checking out late in the third quarter.\nNew York coach Tom Thibodeau would not point to injuries to explain the Knicks struggles.\n“Everyone’s got something – it’s the play-offs. Whether you lose by one or lose by 30, it’s a loss. You’ve got to respond,” he said.\nElsewhere, the Atlanta Hawks will have the top selection in the 2024 NBA Draft in June after topping the draft lottery in Chicago on May 12.\nThe 14 teams that failed to make the play-offs took part in the lottery to determine the early draft selection order. After the Hawks are the Washington Wizards, followed by the Houston Rockets and San Antonio Spurs. AFP, REUTERS", "url": "https://www.straitstimes.com/sport/nuggets-outgun-timberwolves-pacers-thrash-knicks-to-level-nba-play-off-series"}