{"authors": [], "date_download": "2024-10-12 14:10:34", "date_modify": "2024-10-12 14:10:34", "date_publish": "2024-06-28 08:49:00", "description": "LeBron was 19 and the reigning NBA Rookie of the Year when his wife gave birth to Bronny in 2004. Read more at straitstimes.com.", "filename": "sport_basketball_bronny-and-lebron-james-team-up-for-los-angeles-lakers-in-historic-first-for-nba_1728742234.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/FILES-BASKET-NBA-DRAFT-225814.jpg?VersionId=DZLNTRsOdlEqG_pJ2Lx9XegaIHmIixOU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_bronny-and-lebron-james-team-up-for-los-angeles-lakers-in-historic-first-for-nba_1728742234.html", "title": "Bronny and LeBron James team up for Los Angeles Lakers in historic first for NBA", "title_page": "Bronny and LeBron James team up for Los Angeles Lakers in historic first for NBA | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Bronny James, 19, is ready to play with his famous father while starting his own legacy in the National Basketball Association (NBA).\nAfter going undrafted in the first round on June 26, the oldest son of four-time NBA Most Valuable Player LeBron James was selected 55th overall by the Los Angeles Lakers towards the end of the second round of the 2024 NBA Draft on June 27.\nThe Lakers’ selection creates the first father-son duo in NBA history.\nOn Instagram, Bronny posted “Beyond Blessed (prayer hands emoji)” and his 39-year-old father, who had said for years he dreamt of playing alongside his son, replied with “History (crown emoji)”.\nLeBron, on his own account, wrote a one-word caption “LEGACY!!!!!!” and posted images of himself with Bronny as a child, of both of them dunking and another with father and son side by side in Lakers jerseys.\nLeBron was 19 and the reigning NBA Rookie of the Year when his now wife Savannah gave birth to LeBron Raymone “Bronny” James Jr in Akron, Ohio, in 2004.\nBronny, a guard, played 25 games in college at the University of Southern California (USC) after suffering a cardiac arrest during a summer workout in July 2023. He was seen as a fringe second-round pick and was highly expected to join his future Hall-of-Fame father in Los Angeles.\nThe teenager had private workouts with only the Lakers and the Phoenix Suns before the draft.\nLakers general manager Rob Pelinka said in a statement: “In the history of the NBA, there’s never been a father and a son that have shared an NBA basketball court and that feels like something that could be magical.\n“We know, and have to respect of course, that LeBron has a decision (due by June 29) on his opt-out... but if it worked out that he was on our team next season, NBA history could be made.\n“And NBA history should be made in a Lakers uniform.”\nHe added that new Lakers coach J.J. Redick is already planning how to make Bronny better.\n“Coach Redick is already excited about putting a development plan around him to increase his basketball skills and turn him into a player we think can impact and help this franchise,” Pelinka said.\nThe Lakers’ other superstar, Anthony Davis, endorsed the club selecting his teammate’s son.\n“He’s very good defensively,” he said of Bronny to ESPN.\n“He can read the floor very well. I think he’s a really good playmaker. I saw him work out a couple times – his reads, reading the defence, making the right passes – that was really impressive to me. I think he’s going to be fine. Obviously, it’s a lot of pressure on him with his dad being who he is.”\nLakers great Magic Johnson also congratulated Bronny and called it a “historic moment”.\nLeBron, a four-time NBA champion, worked out with Bronny on June 26 before they watched the first round of the draft, consisting of 30 total picks. The Lakers drafted Tennessee star Dalton Knecht with the 17th overall pick.\nThe team, like Pelinka said, are waiting for LeBron to decide his plans for next season.\nHis deadline to exercise his player option with the Lakers is June 29. He is expected to opt out of the deal and enter free agency before signing a short-term deal for his 22nd season.\nThere were questions about Bronny’s readiness for the NBA after his cardiac episode and ensuing unspectacular season at USC. He averaged 4.8 points per game in 2023-24.\nHis medical matter, modest production and height – he measured 1.88m at the draft combine – all complicate his draft grade. But he shot very well in combine drills and posted a 40.5-inch (1.03m) vertical, indications there is more than genetics to his skill set.\nRepresented by Klutch Sports and Rich Paul like his father, the agency made clear before the draft that Bronny and LeBron are not planning to be a package deal. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/basketball/bronny-and-lebron-james-team-up-for-los-angeles-lakers-in-historic-first-for-nba"}