{"authors": [], "date_download": "2024-10-12 14:08:25", "date_modify": "2024-10-12 14:08:25", "date_publish": "2024-10-04 14:29:45", "description": "He joins along with Donte DiVincenzo and Keita Bates-Diop, who were acquired in the deal that sent Karl-Anthony Towns to the New York Knicks. Read more at straitstimes.com.", "filename": "sport_basketball_julius-randle-feels-fortunate-to-be-wanted-by-minnesota-timberwolves_1728742105.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/04/FILES-BASKET-NBA-USA-TV-220217.jpg?VersionId=YUHxeMvibWKuzb6FDwrUMwBz_x1..tLK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_julius-randle-feels-fortunate-to-be-wanted-by-minnesota-timberwolves_1728742105.html", "title": "Julius Randle feels fortunate to be ‘wanted’ by Minnesota Timberwolves", "title_page": "Julius Randle feels fortunate to be ‘wanted’ by Minnesota Timberwolves | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Once he got over the initial shock of being traded from the New York Knicks to the Minnesota Timberwolves this week, Julius Randle was excited to join another NBA (National Basketball Association) title contender.\n“You want to be somewhere where you feel wanted. I feel wanted here,” the power forward said on Oct 3.\n“At this point in my career, I’ve accomplished a lot of great things on an individual level, but I want to win a championship. This is a perfect opportunity to do that.”\nSpeaking at a news conference, Randle was introduced along with Donte DiVincenzo and Keita Bates-Diop, who were acquired in the deal that sent Karl-Anthony Towns to the Big Apple.\nThe Timberwolves also landed a future first-round pick in the blockbuster deal.\nRandle, 29, was a three-time All-Star in his five seasons with the Knicks, but a shoulder injury kept him out of their play-off run this spring.\nHe averaged 24 points, 9.2 rebounds and 5.0 assists per game in 2023-24. He is due to make US$28.9 million (S$37.5 million) in the 2024-25 season, has a US$30.9 million player option for the following season.\n“It was a breath of fresh air,” Randle added of the trade.\n“I’m excited to bring everything I’ve learnt here over the past five years and help these guys out. My only thing here is I just want to help.\n“I want to help (Anthony Edwards). I want to help Rudy (Gobert), Naz (Reid) – all those guys. I want to help win a championship, and that’s the only thing that matters.”\nMinnesota coach Chris Finch, who coached Randle in 2018-19 at the New Orleans Pelicans, said the veteran is expected to be among the starting five.\n“We feel we could end up one of the deeper teams in the league,” said Finch, whose team finished third in the previous regular season before falling 4-1 to the Dallas Mavericks in the Western Conference Finals.\nDiVincenzo improves that depth, joining a reserve corps highlighted by Reid, the NBA’s Sixth Man of the Year last season. DiVincenzo, who shot 40 per cent from three-point range last term, gives the Timberwolves a boost in that department as well, after they finished 15th last season in made three-pointers.\nThe Villanova University product is also looking forward to the various line-ups that Minnesota employ.\n“That was a big part of why I’m so excited,” said the 27-year-old DiVincenzo, who has three years remaining on his contract for a total of almost US$36 million. “You can play so many different line-ups. Small, big, it doesn’t matter.”\nDiVincenzo produced a career-high 15.5 points per game last season, while adding 3.7 rebounds and 2.7 assists. REUTERS", "url": "https://www.straitstimes.com/sport/basketball/julius-randle-feels-fortunate-to-be-wanted-by-minnesota-timberwolves"}