{"authors": [], "date_download": "2024-10-12 14:03:57", "date_modify": "2024-10-12 14:03:57", "date_publish": "2024-05-15 21:08:02", "description": "German Zverev is the highest-ranked man left in the event after Daniil Medvedev’s elimination. Read more at straitstimes.com.", "filename": "sport_tennis_sabalenka-strolls-to-italian-open-semis-with-win-over-ostapenko_1728741837.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/16/2024-05-15T204939Z1161896670UP1EK5F1LUOQGRTRMADP3TENNIS-ROME.JPG?VersionId=81yYGLA1CdAFx32kz9H.9F_Ko5RaAuR_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_sabalenka-strolls-to-italian-open-semis-with-win-over-ostapenko_1728741837.html", "title": "Alexander Zverev beats injury scare to reach Rome semis, as Danielle Collins sets up Aryna Sabalenka clash", "title_page": "Alexander Zverev beats injury scare to reach Rome semis, as Danielle Collins sets up Aryna Sabalenka clash | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME - Alexander Zverev reached his 18th Masters semi-final in Rome on May 15, but only after a worrying fall which sparked memories of the horror injury he suffered at the French Open two years ago.\nThe world number five from Germany defeated Taylor Fritz 6-4, 6-3 to set-up a last-four duel with Alejandro Tabilo, the Chilean journeyman who had stunned Novak Djokovic earlier in the tournament.\nZverev’s moment of concern came in just the third game on centre court at the Foro Italico when he fell on the clay and landed on his front.\nThe 2017 champion cut his left wrist and a finger in the tumble and required treatment from the tournament physio before he continued the match.\nZverev, 27, suffered a serious ankle injury at the 2022 French Open after falling on the clay of Roland Garros during his semi-final against Rafael Nadal and missed the rest of the season.\nOn May 15, however, he was able to dust himself down to defeat Fritz in 90 minutes, firing 20 winners with six aces and not facing a single break point.\nZverev is the highest-ranked man left in the event after Daniil Medvedev’s elimination on May 14.\nAs well as Djokovic’s exit, Italian world number two Jannik Sinner and third-ranked Carlos Alcaraz both dropped out injured before the tournament.\nHolger Rune, who lost last year’s final to Medvedev, Madrid champion Andrey Rublev – ranked sixth in the world – and beaten finalist Felix Auger-Aliassime have also been eliminated.\nChile’s Tabilo will play his first-ever Masters 1000 semi-final at the age of 26, after seeing off unseeded Zhang Zhizhen of China 6-3, 6-4 in one hour and 26 minutes.\n“I just can’t believe it right now, still trying to soak this in... Definitely an unforgettable two weeks for me,” said a delighted Tabilo, the 29th seed who knocked out top-ranked Djokovic on May 12.\n“It’s definitely the best tennis of my life right now, trying to keep a poker face there because inside I’m just so nervous, every time trying to close out the match gets a little bit tighter.”\nTabilo, in fact, had far less trouble on May 15 than he did in his battle with Karen Khachanov in the previous round, not facing a single break point on his way to the biggest match of his career at the last major tournament before the French Open.\nCollins wins 19th of 20 matches\nWomen’s second seed Aryna Sabalenka needed just an hour and 13 minutes to see off Jelena Ostapenko 6-2, 6-4 on her way to the semis, improving her record against her Latvian opponent to three wins and no defeats.\nSabalenka will next take on Miami Open winner Danielle Collins who eased past Victoria Azarenka 6-4, 6-3.\n“With this amazing atmosphere and with this amazing support... that’s why I’m super motivated here and that’s why I always say that this is the dream tournament for me to win,” said Sabalenka.\nThe 26-year-old could get a rematch of the Madrid final which she lost in dramatic fashion to world number one Iga Swiatek earlier in May.\nSabalenka, who has won the two most recent Australian Opens, was in a different class to Ostapenko, a former French Open winner, who could do nothing in the face of some punishing hitting.\nRome is the first time since the 2013 French Open that the top three women have reached the last four of a WTA event of 250 level or higher, with Swiatek and world number three Coco Gauff in the other semi-final on May 16.\nThe 30-year-old Collins, ranked 15 in the world, announced in January that this would be her final season on the tour before retiring.\nShe now has 19 wins in her last 20 matches, dating back to the start of Miami where she captured her first WTA 1000 title.\nHer only loss since came against Sabalenka in three sets in the fourth round of the Madrid Open. AFP", "url": "https://www.straitstimes.com/sport/tennis/sabalenka-strolls-to-italian-open-semis-with-win-over-ostapenko"}