{"authors": [], "date_download": "2024-10-12 13:40:01", "date_modify": "2024-10-12 13:40:01", "date_publish": "2024-09-03 17:55:15", "description": "Bangladesh cruised to a six-wicket victory in the second test against Pakistan on Tuesday to complete a 2-0 series sweep and provide a healing touch to a nation recovering from a political upheaval. Read more at straitstimes.com.", "filename": "sport_bangladesh-ease-to-series-sweep-of-pakistan_1728740401.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/ST-logo-placeholder_25.jpg?VersionId=eE2ZUkEwxbCHvk7d2WW7azuAOb8wO3S0", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_bangladesh-ease-to-series-sweep-of-pakistan_1728740401.html", "title": "Bangladesh sweep test series in Pakistan in healing touch for troubled nation", "title_page": "Bangladesh sweep test series in Pakistan in healing touch for troubled nation | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Bangladesh cruised to a six-wicket victory in the second test against Pakistan on Tuesday to complete a 2-0 series sweep and provide a healing touch to a nation recovering from a political upheaval.\nChasing 185 for victory, Bangladesh rode a string of cameos to seal their third test series victory away from home with more than one session left at the Rawalpindi Cricket Stadium.\nOpener Zakir Hasan (40), skipper Najmul Hossain Shanto (38) and Mominul Haq (34) chipped in with useful cameos.\nVeterans Mushfiqur Rahim (22) and Shakib Al Hasan (21) combined to guide the visitors to a memorable victory.\n\"It means a lot, I can't express it in words,\" an emotional Shanto said at the presentation ceremony.\n\"We were looking to win here and I'm very happy with the way everyone has done their job.\"\nAll-rounder Mehedy Hasan Miraz dedicated his player-of-the-series award to a victim of the recent anti-government protests in Bangladesh, which culminated with ousted Prime Minister Sheikh Hasina fleeing to India last month.\nThe country's interim leader Muhammad Yunus called Shanto to congratulate the team on their series victory.\nBangladesh arrived last month having failed to beat Pakistan in a test match in their previous 13 attempts and then went on to win two in a row.\nThey won the series opener by 10 wickets, their first ever test victory against Pakistan, after the home side had declared their first innings on 448-6.\nBangladesh showed similar resilience in the second test when they slumped to 26-6 in the first innings before player-of-the-match Litton Das smashed 138 to rescue them.\nFor the first time, Bangladesh seamers claimed all 10 wickets as they skittled out Pakistan for 172 in the second innings to lay the foundation of their victory.\n\"Extremely disappointed, especially at the start of the home season,\" rued Pakistan captain Shan Masood.\n\"We had two opportunities to bowl them out, especially here when they were 26-6, but we let them back in the game.\" REUTERS", "url": "https://www.straitstimes.com/sport/bangladesh-ease-to-series-sweep-of-pakistan"}