{"authors": [], "date_download": "2024-10-12 14:14:00", "date_modify": "2024-10-12 14:14:00", "date_publish": "2022-12-17 21:21:42", "description": "The match was called off after a fan protest turned violent. Read more at straitstimes.com.", "filename": "sport_football-goalkeeper-injured-as-fans-invade-pitch-in-melbourne-derby_1728742440.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/12/17/10369811_1.jpg?VersionId=9WTy0Me9iPiI_kWJuSUck7PVN9GQShhk", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football-goalkeeper-injured-as-fans-invade-pitch-in-melbourne-derby_1728742440.html", "title": "Football: Goalkeeper injured as fans invade pitch in Melbourne derby", "title_page": "Football: Goalkeeper injured as fans invade pitch in Melbourne derby | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MELBOURNE – The A-League clash between Melbourne Victory and Melbourne City was abandoned on Saturday after “shocking” scenes when fans stormed the pitch and attacked a goalkeeper, who suffered a suspected concussion.\nThe match was called off in the first half after a fan protest against a decision on Monday by league bosses to award the grand finals series to Sydney for the next three years turned violent.\nSupporters of both sides were planning to walk out at the 20-minute mark, but Victory fans turned on City goalkeeper Tom Glover after he appeared to throw a flare back towards them.\nMoments earlier a flare had hit a television cameraman on the back, local reports said.\nScores of fans invaded the pitch and one grabbed a metal bucket and threw it into Glover’s face as scuffles broke out and a group of men swung on the crossbar.\nPlay was halted and both sides left the field with the game abandoned.\n“Tom Glover is receiving medical treatment in the dressing room and likely has a concussion,” tweeted City, who were leading 1-0 at the time, with pictures showing a bloody gash on his face.\nReferee Alex King was also injured, Football Australia said.\n“Following shocking scenes... where fans from the Melbourne Victory end entered the field of play, Football Australia match officials have abandoned the match,” it said.\n“Such behaviour has no place in Australian football, with a full Football Australia investigation is to commence immediately, where strong sanctions will be handed down.”\nMelbourne Victory said the club were “devastated” and apologised.\n“The club unequivocally condemns the actions of fans at Saturday night’s match against Melbourne City,” they said.\n“The club would like to formally apologise to Tom Glover, match official Alex King and the camera operator as well as all players, officials and those who witnessed the appalling behaviour.”\nThe scenes sparked a scathing response from football pundits.\n“I can’t believe what has happened! Not the way to protest! Very sad that it has come to this,” said former Australian international and English Premier League player Robbie Slater.\nFormer A-league goalkeeper Clint Bolton added that “I’ve never felt as embarrassed and as empty as I feel right now”.\nSocial media also lit up with one fan tweeting: “Truly shameful scenes that will be seen around the world,” while another added: “There’s a way to make your point and this ain’t it. Disgrace.” AFP", "url": "https://www.straitstimes.com/sport/football-goalkeeper-injured-as-fans-invade-pitch-in-melbourne-derby"}