{"authors": [], "date_download": "2024-10-12 13:41:28", "date_modify": "2024-10-12 13:41:28", "date_publish": "2024-04-25 06:37:48", "description": "The 2-0 loss at Everton left the Reds three points behind leaders Arsenal (77) with four games remaining. Read more at straitstimes.com.", "filename": "sport_football_klopp-apologises-to-liverpool-supporters-after-huge-blow-to-title-hopes_1728740488.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/25/LYNXNPEK3N0YB-1.jpg?VersionId=xIYyqarhrC3l79E1c0i38k.FMIjLD3C2", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_klopp-apologises-to-liverpool-supporters-after-huge-blow-to-title-hopes_1728740488.html", "title": "Jurgen Klopp apologises to Liverpool supporters after huge blow to title hopes", "title_page": "Jurgen Klopp apologises to Liverpool supporters after huge blow to title hopes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Liverpool manager Jurgen Klopp has apologised to fans, after a 2-0 loss to Everton in the Merseyside derby on April 24 that all but extinguished their faint hopes of winning the English Premier League title.\nThe Reds are three points behind leaders Arsenal (77) with four games remaining.\nHolders Manchester City remain in the driver’s seat – they could be on 76 points with one game in hand on the Gunners should they beat Brighton & Hove Albion on April 25, in a match that kicked off after press time.\nKlopp, who is leaving Anfield at the end of the season, had never lost on his previous seven visits to Goodison Park.\nBut his final taste of the Merseyside derby was a bitter one.\n“You can read the table. We need a crisis at City and Arsenal and we need to win football games,” said a completely shattered Klopp, when asked about his team’s chances.\n“I don’t know. I can only apologise for today to the people.\n“Everybody who is with us knows how hard this was for us as well. We should have done better but we didn’t.”\nJarrad Branthwaite and Dominic Calvert-Lewin scored in the win that will not soon be forgotten by the Everton faithful, who serenaded the visitors with “You lost the league at Goodison Park” after the final whistle.\nIt was the Toffees’ first home derby win since 2010 and it essentially prevented Liverpool from climbing level with Arsenal at the top of the league table.\n“Obviously very disappointed with a lot of things. We let it happen exactly the game that Everton wanted,” added Klopp, when asked to assess the match.\n“Two goals from set pieces. We created a lot but didn’t score. We were in a rush, we were not good enough; that’s what we have to admit, absolutely.\n“Of course, I didn’t expect that today but it happened anyway. Obviously it’s not the greatest moment we are in. In the end, it’s not good enough. When you win, you have 500 reasons. When you lose, it’s just not good enough.”\nKlopp could only shake his head in response to Calvert-Lewin’s 58th-minute goal from a corner kick, saying Everton have had that set piece in their playbook all season and his players were actually prepared for it.\nAccording to reports, Feyenoord boss Arne Slot is being lined up as Klopp’s successor and the past few weeks have exposed weaknesses that need addressing in a huge summer for the Liverpool hierarchy.\nThe Reds, who claimed the League Cup in February, have won just one of their last four league games and have also bowed out of the FA Cup and Europa League in recent weeks.\nLiverpool captain Virgil van Dijk was also blunt in his assessment, telling Sky Sports: “We weren’t good enough. We all have to do much better. We can’t let the season go out like tonight. We have to do much better in every sense.\n“If we play like today, we have no chance to consider ourselves in the title (race).”\nLiverpool next travel to West Ham United on April 27. They face Tottenham Hotspur, Aston Villa and Wolverhampton Wanderers in their final three games.\nFor Everton, their win took them eight points clear of the relegation zone.\nThe Toffees now look certain to extend their 70-year stay in the English top flight, despite being deducted eight points on two charges of breaching financial rules.\nBuoyed by last weekend’s 2-0 win over Nottingham Forest, Sean Dyche’s side are transformed from the one that went 13 Premier League games without a win between December and April.\n“Delighted with the performance of our players and delighted for the Evertonians,” said Dyche.\n“They’re a good side, we know that. The commitment and energy from us had to be there.” REUTERS, AFP", "url": "https://www.straitstimes.com/sport/football/klopp-apologises-to-liverpool-supporters-after-huge-blow-to-title-hopes"}