{"authors": [], "date_download": "2024-10-12 14:17:09", "date_modify": "2024-10-12 14:17:09", "date_publish": "2023-09-03 23:47:28", "description": "Red Bull hailed a \"stroll in the park” after a brilliant one-two which extended Verstappen’s lead on teammate Sergio Perez at the top of the drivers’ standings to 145 points. Read more at straitstimes.com.", "filename": "sport_perfect-10-for-max-verstappen-with-record-win-in-italian-grand-prix_1728742629.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/03/LYNXMPEJ8204R-1_0.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_perfect-10-for-max-verstappen-with-record-win-in-italian-grand-prix_1728742629.html", "title": "Perfect 10 for Max Verstappen with record win in Italian Grand Prix", "title_page": "Perfect 10 for Max Verstappen with record win in Italian Grand Prix | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MONZA – Runaway Formula One championship leader Max Verstappen celebrated an “impossible” record 10th win in a row by leading Red Bull teammate Sergio Perez to a one-two finish at Ferrari’s home Italian Grand Prix on Sunday.\nThe Dutch driver’s victory on a sunny afternoon at Monza’s “Temple of Speed” outside Milan was also Red Bull’s 15th in succession – another Formula One record that looks set to continue.\nSaid the 25-year-old Verstappen: “I never would have believed that it (the record) was possible but we had to work for it today. That definitely made it a little bit more tough,” he said.\n“I was just trying to stay patient. It was a very long race. I could see they were sliding a lot with the rear tyres so I just had to pick my moment.”\nTeam principal Christian Horner added: “We had to do it the hard way. The Ferraris were quick today. Carlos (Sainz) was defending like his life depended on it so first Max had to get that pass done then we were able to pull out a gap. It gives Max 10 victories in a row which is an incredible moment.\n“Formula One is the biggest team sport in the world and you need every single member of that team doing their job. This victory is down to everybody in the Red Bull team.”\nSpaniard Sainz was third for the Italian team, his first podium of the season cheered by the passionate fans, after starting on pole position and holding off Verstappen until the 15th of 51 laps.\nVerstappen stretched his lead in the standings over Perez to 145 points with eight rounds remaining. Red Bull lead Mercedes in the constructors’ championship by 310 points with Ferrari moving up to third.\nCharles Leclerc was fourth for Ferrari with George Russell fifth for Mercedes. Teammate and seven-time world champion Lewis Hamilton was sixth, with both Britons collecting five-second penalties.\nAlex Albon took seventh for Williams ahead of McLaren’s Lando Norris, Aston Martin’s Fernando Alonso and Valtteri Bottas of Alfa Romeo, who denied New Zealand rookie Liam Lawson (11th) his first point for AlphaTauri.\nAustralian Oscar Piastri took the fastest lap for McLaren but finished 12th so no bonus point was awarded.\nVerstappen had equalled now-retired German Sebastian Vettel’s 2013 record of nine wins in a row, also achieved with Red Bull, at his home Dutch Grand Prix the previous weekend and can expect to add further to the tally.\nHe now has 12 wins from the 14 races in 2023, with Red Bull’s astonishing run of success dating back to Abu Dhabi at the end of last season, and a career tally of 47.\nFew had expected Sainz to hold on to the lead for long, given the Red Bull's race pace, but the Spaniard fought hard, with Verstappen showing some frustration at being unable to scythe past after a clean start. “That was naughty,” he said over the radio as Sainz shut the door on one attempt on lap 6. “Good move,” Ferrari told Sainz in response.\nVerstappen was commenting on Ferrari's top speed three laps later and still had to wait for his chance, before seizing it around the outside at the Curva Grande. Once done, he pulled away and was already 3.8 seconds clear by lap 18.\nPerez, meanwhile, had to come from fifth on the grid, after the start was aborted and delayed after Yuki Tsunoda’s AlphaTauri pulled over on the first formation lap, and it took him 32 laps to move into third spot by passing Leclerc.\nSainz again made it hard but the Mexican finally found joy on lap 46 to cement Red Bull’s sixth one-two finish of the season.\nThe two Ferraris then went wheel to wheel in a thrilling final few laps that could have ended in disaster as they ignored any question of playing safe and banking the points.\n“It was tough. It does not get tougher than it was out there today,” said Sainz. “I spent the whole race trying to keep the Red Bulls behind. In the end, I paid a bit of a price with the rear tyres.” REUTERS", "url": "https://www.straitstimes.com/sport/perfect-10-for-max-verstappen-with-record-win-in-italian-grand-prix"}