{"authors": [], "date_download": "2024-10-12 14:10:42", "date_modify": "2024-10-12 14:10:42", "date_publish": "2024-10-02 17:49:13", "description": "Swimming clubs have registered around 10,000 new members, while table tennis clubs are expecting around 20 per cent more players. Read more at straitstimes.com.", "filename": "sport_frustrated-french-clubs-turn-away-players-in-post-olympics-sports-boom_1728742242.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/02/TOPSHOTS-TOPSHOT-FRANCE-OLY-PARIS-2024-RINGS-015758.jpg?VersionId=y8abWlDDhl6_DtMDGzcxFZLp.QCM5QH4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_frustrated-french-clubs-turn-away-players-in-post-olympics-sports-boom_1728742242.html", "title": "Frustrated French clubs turn away players in post-Olympics sports boom", "title_page": "Frustrated French clubs turn away players in post-Olympics sports boom | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Many amateur French sports clubs are struggling to cope with a wave of enquiries and a boom in wannabe players sparked by the Paris Olympics.\n“We’re a bit overwhelmed,” Catherine Groc, president of a fencing club in the trendy Marais district of the French capital, told AFP.\n“It’s been 10 days now that I’ve been turning people away.”\nShe says around 50 people came to try out the sport during two separate beginners’ sessions in October, meaning she expects to end up with around 30 per cent more duellists compared to 2023.\nFencing was given top billing on French TV during the July 26-Aug 11 Games, with the home nation continuing its medal-winning tradition in the spectacular Grand Palais, which hosted the competition.\n“After each Olympics there’s an effect, but this time the Games were in Paris, of course, but I think above all there is the Grand Palais effect,” Groc said.\n“It was an absolutely incredible place, extraordinary.”\nOther sports too have seen an influx of people eager to explore a new discipline or resume playing after years of inactivity – sometimes with disappointing results.\nSwimming clubs have registered around 10,000 new members, while table tennis clubs are expecting around 20 per cent more players.\nThe head of the French Handball Federation, Philippe Bana, said last week that there was a “tidal wave” of new inscriptions in his sport, with demand up 18 per cent in 2024 compared to 2023.\n“But indoor sports are near saturation point with their facilities,” he explained, saying that around 100,000 people would be turned down by handball clubs alone.\n“The Olympics Games should be a springboard, not a closed door.”\nEach modern Olympics have ambitions of using the competition to generate interest in grassroots sport and physical activity, which produces a range of health benefits.\nThe French government and Paris 2024 organisers were no different in promising to leave a legacy that would help tackle the problem of people spending too much time on screens and doing too little exercise.\nAmong French children aged 11 to 17, three out of four do not meet recommended levels of physical activity, according to data from the National Observatory of Physical Activity and Sedentary Behaviour, while obesity is also on the rise.\nThe country is classed 119 out of 146 countries when ranked by the amount of physical activity done by its adolescents, according to figures from the World Health Organisation.\nFor those in the sports world, having to turn away prospective players is frustrating – and runs counter to stated public health objectives and the goals of the Games.\n“We haven’t got the means to welcome the mass of young people who are coming forward, and we’re talking about a mass,” Yves Bouget, head of the French national volleyball league, said last week.\n“That’s the real problem at the moment: facilities are full for handball, basketball, volleyball and badminton, which use the same ones.”\nMost of the Paris 2024 budget was spent on renovating existing sports facilities in the Paris region or building temporary infrastructure such as the stadium inside the 19th-century Grand Palais, which was used for fencing and taekwondo.\nBouget called for a “Marshall Plan” of infrastructure-building to help increase capacity.\nBut with France’s new right-wing government under immense financial pressure, investment in sports is widely expected to be cut in the next budget later in 2024.\nPierre Rondeau, a sports expert at the Fondation Jean-Jaures think-tank in Paris, said that academic research indicated that demand for organised sport typically increased by 15 to 25 per cent after an Olympic Games in the host country.\n“That’s in the short term, and you need to make a distinction between the short term and long term,” he told AFP.\nSome post-Olympics sports enthusiasts quickly lose their motivation, meaning clubs need to be careful about investing in new equipment.\nBut Rondeau stressed that the availability of infrastructure was crucial, as well as qualified coaches.\n“If everyone suddenly wants to go swimming or do judo and you don’t have pools or a dojo near you, then you’re going to have difficulty,” he said.\nHe cites the example of football’s landmark 2019 Women’s World Cup across nine cities in France as a cautionary tale.\n“There was a surge in interest afterwards among women to play football, but it didn’t translate into an increase (in players) because there wasn’t enough capacity to absorb the increase in demand.” he said. AFP", "url": "https://www.straitstimes.com/sport/frustrated-french-clubs-turn-away-players-in-post-olympics-sports-boom"}