{"authors": [], "date_download": "2024-10-12 13:59:45", "date_modify": "2024-10-12 13:59:45", "date_publish": "2023-12-09 23:17:49", "description": "Russian and Belarusian athletes can compete in 2024 as neutrals, outside of team events and if they do not actively support Russia's invasion of Ukraine. Read more at straitstimes.com.", "filename": "sport_ukrainian-swimmer-deplores-big-shame-of-allowing-russians-at-olympics_1728741585.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/09/11015999.jpg?h=d2c40237", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_ukrainian-swimmer-deplores-big-shame-of-allowing-russians-at-olympics_1728741585.html", "title": "Ukrainian swimmer deplores 'big shame' of allowing Russians at Olympics", "title_page": "Ukrainian swimmer deplores 'big shame' of allowing Russians at Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "OTOPENI, Romania - Ukrainian swimmer Mykhailo Romanchuk on Dec 9 slammed as a “big shame for the world of sport” the IOC’s decision to allow Russian and Belarusian athletes to take part in next year’s Paris Olympics under a neutral banner.\n“The Russians attacked Ukrainian cities, Ukrainian civilians, Ukrainian athletes, Ukrainian sport facilities, and now they are allowed to compete. It is not normal,” said Romanchuk, a two-time Olympic medallist in Tokyo.\n“So more than 400 athletes dead during this war. And now we take them to the Olympics? It’s not right.\n“If you’re not respecting the rules, if you’re not respecting peace in the world, why are you allowed to compete? So it’s a big, big shame for the world of sport.”\nOn Dec 8, the IOC agreed that Russian and Belarusian athletes could compete in Paris as neutrals, outside of team events and as long as they did not actively support Russia’s invasion of Ukraine.\nFinal decisions on inclusion would fall on international federations.\nThe International Swimming Federation (FINA) announced in September that Russians would be reinstated from 2024, unlike World Athletics whose president Sebastian Coe said on Dec 8 that “there will be no neutral athletes” in track and field in Paris.\n“He (Coe) said that all the Russians will not be allowed to compete until the war is finished,” said Romanchuk, who is currently in Romania for the European Short Course Championships.\n“I like his decision. In my opinion, everyone should do the same.”\nAccording to the IOC, 11 athletes – eight Russians and three Belarusians – have so far qualified by meeting the neutrality criteria, deemed “discriminatory” by Moscow. AFP", "url": "https://www.straitstimes.com/sport/ukrainian-swimmer-deplores-big-shame-of-allowing-russians-at-olympics"}