{"authors": [], "date_download": "2024-10-12 13:41:43", "date_modify": "2024-10-12 13:41:43", "date_publish": "2024-08-07 23:16:18", "description": "Avishka Fernando scored a superb 96 and Dunith Wellalage took five wickets as Sri Lanka thumped India by 110 runs in Colombo on Wednesday to seal a first bilateral one-day international series win over their south Asian neighbours in 27 years. Read more at straitstimes.com.", "filename": "sport_fernando-wellalage-guide-sri-lanka-to-rare-odi-series-win-over-india_1728740503.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/CRICKET-SRI-IND-ODI-104155.jpg?VersionId=ae7dE3TVHg7l5EV_ANhB1VTT8zdeTwVA", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_fernando-wellalage-guide-sri-lanka-to-rare-odi-series-win-over-india_1728740503.html", "title": "Avishka Fernando, Dunith Wellalage guide Sri Lanka to rare ODI cricket series win over India", "title_page": "Avishka Fernando, Dunith Wellalage guide Sri Lanka to rare ODI cricket series win over India | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Avishka Fernando scored a superb 96 and Dunith Wellalage took five wickets as Sri Lanka thumped India by 110 runs in Colombo on Wednesday to seal a first bilateral one-day international series win over their south Asian neighbours in 27 years.\nFaced with a tricky victory target of 249 to draw level at 1-1, India never built any momentum after losing their two most experienced batsmen in skipper Rohit Sharma and Virat Kohli as they folded for a disappointing 138 in 26.1 overs.\nWellalage had Rohit caught behind for 35 after the Indian skipper went on the attack early on and the spinner then trapped Kohli lbw for 20, with India unable to arrest their slide from there at the R Premadasa Stadium.\n\"I'm a happy captain right now and I think the team did all the things well throughout the series,\" said Sri Lankan skipper Charith Asalanka.\n\"We knew they have a very strong batting line-up and we just wanted to back our strength and our strength is spin bowling. We backed our spinners and they did (the job).\"\nAxar Patel and Shreyas Iyer also fell victim to Wellalage, who finished with figures of 5-27 after getting rid of last man Kuldeep Yadav. Washington Sundar mounted a late fightback for India with a well-made 30 but his effort was in vain.\nThe opening ODI finished in a dramatic tie, before Sri Lanka secured a 32-run victory in the second game. India had swept the preceding Twenty20 series 3-0 in new head coach Gautam Gambhir's first assignment in the role.\nRohit said that his team's struggles against spin were not a concern yet but needed to be addressed.\n\"It's something that we were put under pressure with in this series. It's something we need to look into, talk about and come up with a plan,\" Rohit said.\nHe bristled at a question about complacency within the team and said such a suggestion was a joke.\n\"When you're playing for India, there's no complacency. As long as I'm here captaining the team that's not going to be the case,\" Rohit added.\n\"We were outplayed throughout the series. You've got to give credit where it's due. Sri Lanka played better cricket than us.\"\nSri Lanka opted to bat first after winning the toss and made a solid start in their quest to claim a first ODI series triumph over India since 1997 as openers Pathum Nissanka and Fernando strung together an 89-run partnership.\nThe hosts shrugged off Nissanka's dismissal by Axar for 45 in the 20th over as Fernando and Kusal Mendis continued to build before Riyan Parag snapped their 82-run stand on his ODI debut and triggered a mini collapse.\nParag trapped Fernando lbw just short of his century with one that skidded off the wicket and then removed skipper Charith Asalanka and Wellalage to reduce Sri Lanka to 199-6, but Mendis scored 59 to ensure the team finished with a fighting 248-7. REUTERS", "url": "https://www.straitstimes.com/sport/fernando-wellalage-guide-sri-lanka-to-rare-odi-series-win-over-india"}