{"authors": [], "date_download": "2024-10-12 13:44:39", "date_modify": "2024-10-12 13:44:39", "date_publish": "2023-11-10 22:59:34", "description": "A decision on whether an aluminium tower for surfing judges will be built at next year's Olympics in Teahupo'o in Tahiti will be made by the end of the month, Paris 2024 president Tony Estanguet said on Friday. Read more at straitstimes.com.", "filename": "sport_decision-on-aluminium-surfing-judges-tower-by-end-november-paris-2024_1728740679.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/10/LYNXMPEJA90I4-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_decision-on-aluminium-surfing-judges-tower-by-end-november-paris-2024_1728740679.html", "title": "Decision on aluminium surfing judges' tower by end November - Paris 2024", "title_page": "Decision on aluminium surfing judges' tower by end November - Paris 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - A decision on whether an aluminium tower for surfing judges will be built at next year's Olympics in Teahupo'o in Tahiti will be made by the end of the month, Paris 2024 president Tony Estanguet said on Friday.\nResidents say the planned tower would damage the coral reef.\nThe lagoon-side village has long hosted some of the biggest events on the professional World Surf League's (WSL) championship tour using a modest wooden tower for judges on the reef that is dismantled after every event.\nAn online petition calling for the scrapping of plans for the 14-metre (45 foot) aluminium scaffolding and an 800m (half-mile) service channel through the reef had gathered almost 150,000 signatures by Wednesday.\n\"As for the judges' tower, we reopened the issue a few weeks ago to see how we could improve it and respond to the concerns and expectations of the local population,\" Estanguet told reporters, explaining that either the installation would be made or the wooden tower would be used if up to safety standards.\n\"Various options are currently being worked on by engineers, local authorities and the Polynesian government, which is responsible for building the tower.\n\"They are looking at different options for potentially reusing the foundations of the previous tower, which have not been compliant up to now for safety reasons.\"\nEstanguet said he would travel to Tahiti in the coming weeks.\n\"A decision is expected to be made by the end of November on which option will be chosen,\" he said.\nThe Mata Ara Ia Teahupo'o collective, which launched the online petition, said they were only talking to local authorities after their arguments to Paris 2024 fell on deaf ears.\n\"We were invited twice to meetings where we were put in front of the Paris 2024 representative, and each time there was a dialogue of the deaf because everyone stuck to their guns,\" the collective told Reuters in an email on Friday.\n\"Since then, we've only had discussions with the President of the country, Moetai Brotherson, and the High Commissioner of the Republic in French Polynesia, and these have been fairly calm and constructive.\" REUTERS", "url": "https://www.straitstimes.com/sport/decision-on-aluminium-surfing-judges-tower-by-end-november-paris-2024"}