{"authors": [], "date_download": "2024-10-12 13:59:14", "date_modify": "2024-10-12 13:59:14", "date_publish": "2024-06-28 02:58:36", "description": "Some have already decided against taking part. Read more at straitstimes.com.", "filename": "sport_ioc-invites-39-russian-belarus-athletes-to-compete-as-neutrals-at-olympics_1728741554.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/28/2024-06-26T224625Z1823832734RC28J8AVJ1EQRTRMADP3OLYMPICS-2024.JPG?VersionId=1BxMTBggHWQPIRtxAkTd3.8NvB7ggHCu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_ioc-invites-39-russian-belarus-athletes-to-compete-as-neutrals-at-olympics_1728741554.html", "title": "IOC invites 39 Russian, Belarus athletes to compete as neutrals at Olympics", "title_page": "IOC invites 39 Russian, Belarus athletes to compete as neutrals at Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LAUSANNE, Switzerland - The International Olympic Committee (IOC) on June 27 invited 22 Russian and 17 Belarusian athletes to compete at the Paris Olympics as neutrals, even though some have already decided against taking part.\nA second list of names authorised to compete in the July 26-Aug 11 showpiece included competitors from tennis, shooting and rowing.\nThe first list, which was published on June 15, was limited to four disciplines – wrestling, weightlifting, cycling and trampoline.\nThat also included the first refusals including Russian cyclist Aleksandr Vlasov and five Belarusians.\nEighteen athletes have, however, already confirmed their presence - three cyclists, three trampoline specialists, two weightlifters and 10 wrestlers.\nTwo Belarusian rowers and two Belarusian fencers have yet to make their response known.\nThere is similar suspense amongst the list of tennis players issued on June 27 with Russians Daniil Medvedev and Andrey Rublev, currently ranked world number five and six respectively, yet to officially respond.\nThe same applies to leading women’s players such as Belarusian duo Aryna Sabalenka, the third-ranked Australian Open champion, and former world number one Victoria Azarenka.\nHowever, Russian Tennis Federation president Shamil Tarpischev earlier in June said that Rublev, 2021 silver medallist Karen Khachanov as well as women’s 15th-ranked Liudmila Samsonova will not play at the Olympics.\nSabalenka has also said she will not take part in the Paris Olympics.\n“Especially with all the struggles I’ve been struggling with the last months, I feel I have to take care of my health,” Sabalenka told reporters last week.\n“It’s too much for the scheduling and I made the decision to take care of my health.”", "url": "https://www.straitstimes.com/sport/ioc-invites-39-russian-belarus-athletes-to-compete-as-neutrals-at-olympics"}