{"authors": [], "date_download": "2024-10-12 13:41:52", "date_modify": "2024-10-12 13:41:52", "date_publish": "2024-07-06 01:41:09", "description": "BERLIN - Turkey's pride will not be dented by the suspension handed to defender Merih Demiral for a political gesture when they take on the Netherlands in the quarter-finals at Euro 2024 on Saturday, coach Vincenzo Montella said. Read more at straitstimes.com.", "filename": "sport_football_coach-montella-promises-to-make-turkey-even-more-proud-after-demiral-ban_1728740512.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/06/LYNXMPEK640SW-1.jpg?VersionId=3ILAIeYWxr4v8viG1HfecFFzbl40sZtc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_coach-montella-promises-to-make-turkey-even-more-proud-after-demiral-ban_1728740512.html", "title": "Coach Montella promises to make Turkey even more proud after Demiral ban", "title_page": "Coach Montella promises to make Turkey even more proud after Demiral ban | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - Turkey's pride will not be dented by the suspension handed to defender Merih Demiral for a political gesture when they take on the Netherlands in the quarter-finals at Euro 2024 on Saturday, coach Vincenzo Montella said.\nEuropean soccer's governing body UEFA announced on Friday that the 26-year-old centre back, who celebrated a goal against Austria by making a \"wolf\" gesture with his fingers, would be suspended for two games, thus missing the clash with the Dutch.\nThe gesture made by Demiral is linked to the \"Grey Wolves\", an ultra-nationalist youth branch of Turkey's Nationalist Movement Party (MHP), which is an ally of President Tayyip Erdogan's ruling AK Party.\n\"We consider it unfair, this ban, because it was not a political gesture - it was interpreted as such, but it was just something that was not properly understood,\" Turkey's Italian coach Montella told reporters.\n\"But this will not put a break on the Turkish pride. Actually, we will be more passionate, more proud. We want to make the country proud, and I'm sure we will all be highly motivated, and this goes for the fans as well.\"\nWith Berlin boasting one of the biggest Turkish diasporas in the world, Montella expects strong support in the stands.\n\"Our fans have been extraordinary so far, full of passion. They really have conveyed to us all the passion and love, from the hotel to the stadium, back to the hotel.\n\"We have always been very correct as well. And that's what I expect from them tomorrow - great support.\"\nThe 50-year-old coach said players and fans alike must control their feelings on Saturday, especially when it comes to Demiral's ban.\n\"They must show that Turkish pride, they must be close to the team and support us, even when we are having hard times. Now regarding Merhi, we have to manage our emotions before the match, during the match, internal emotions, external emotions,\" he said.\n\"We are the youngest team at the tournament, and emotions factor in when you play these matches. Some players are more experienced, they're used to playing certain matches, they're used to preparing for these matches and they have a bit of an edge.\n\"So we must be able to manage all of this emotional sphere and transform it into energy and field it because we're younger, and in a way we can have more energy, and this can give us an edge,\" Montella said. REUTERS", "url": "https://www.straitstimes.com/sport/football/coach-montella-promises-to-make-turkey-even-more-proud-after-demiral-ban"}