{"authors": [], "date_download": "2024-10-12 14:13:28", "date_modify": "2024-10-12 14:13:28", "date_publish": "2024-07-19 22:36:01", "description": "Details including some of the artists taking part, who will last carry the torch and light the Olympic cauldron to mark the start of the Games, have been kept secret. Read more at straitstimes.com.", "filename": "sport_paris-2024-opening-ceremony-will-be-daring-joyful-organisers-say_1728742408.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/19/2024-07-14T222055Z924523071UP1EK7E1Q2TZ9RTRMADP3OLYMPICS-2024-RELAY-PARIS.JPG?VersionId=WhQF1Gj0ukn.ClawJKqpMFHVb_kwxkXO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_paris-2024-opening-ceremony-will-be-daring-joyful-organisers-say_1728742408.html", "title": "Paris 2024 opening ceremony will be daring, joyful, organisers say", "title_page": "Paris 2024 opening ceremony will be daring, joyful, organisers say | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – The Paris Olympics’ opening ceremony on July 26 will be a joyful, daring and atypical show in which artistes and athletes together celebrate Paris, France and the Games alongside the River Seine, the ceremony’s organisers said.\nUnlike previous Olympics, the Paris 2024 opening ceremony will not take place in a stadium. Instead, dozens of boats will carry thousands of athletes and performers on a 6km route along the Seine.\n“We know the importance of the opening ceremony for the Olympic Games. It’s key for the athletes, it’s key for the country which organises it,” Tony Estanguet, the head of the Paris Olympics organising committee, told reporters.\n“That’s why, from the start, we have been very ambitious because we really want this opening ceremony to embody all the ambition of Paris 2024: Daring, atypical Games, which shows the best of France.”\nDetails including some of the artistes taking part, who will last carry the torch and light the Olympic cauldron to mark the start of the Games, have been kept secret, and the ceremony’s artistic team said they had been rehearsing in private to keep it all under wraps.\nBut what is known is that there will be a floating parade, departing from Austerlitz bridge, sailing by Notre-Dame cathedral and arriving near the Eiffel Tower, with the show also using nearby monuments and mixing music, light and dance.\n“We’ll have some cliches (about France) but also we are going to share what is Paris, what is France today,” said Thomas Jolly, the artistic director of the opening ceremony.\nMore than 300,000 spectators will be watching from the riverbanks, with hundreds of millions more expected to watch on TV or on social media.\n“I’m very impatient... I want to share it now because (we’ve been) working on this ceremony for two years,” Jolly said.\n“About the artistes (who will take part in the ceremony), we are not going to say anything but it will be a beautiful night with a lot of important people who have something to celebrate with us about Paris.”\nJolly said the show would last about 3hr 45min and be “a large fresco” which will “interweave the parade of athletes, the artistic paintings and the elements of protocol which are staged”.\n“That is the moment to celebrate the relationship that Paris, that France maintains with the world at the moment when the world enters Paris and when the world will look at Paris,” he said.\nMaud le Pladec, the ceremony’s choreographer, said: “There will be this total show, everything will be mixed.”\n“This is a popular show, but (you’ll see) how we can make it chic also, how we can make it a la Francaise.”\nMeanwhile, the Seine has been clean enough for swimming in six of seven days tested ahead of the Olympics, Paris city hall said on July 19.\nThe quality of the water met the required standards between July 10 and 16, before the Seine hosts the swimming leg of the triathlon on July 30, 31 and Aug 5. The Aug 8-9 marathon swimming events are also scheduled to be held there.\nDespite improving water quality results since the end of June, suspense remains over whether these competitions can go ahead on the river through the French capital.\nAlthough the river’s E. coli bacterial level was below the thresholds six days a week at the sampling point on the Alexandre-III bridge, results from three other Parisian sites have been mixed.\n“This week was marked by two significant episodes of rain, particularly upstream of Paris, which had an impact on water quality and flow,” regional authorities said.\nIn the event of heavy rain, untreated sewage can be washed into the river.", "url": "https://www.straitstimes.com/sport/paris-2024-opening-ceremony-will-be-daring-joyful-organisers-say"}