{"authors": [], "date_download": "2024-10-12 14:00:25", "date_modify": "2024-10-12 14:00:25", "date_publish": "2024-08-05 22:00:51", "description": "PARIS - Two-time world champion Akane Yamaguchi of Japan stands at just over 5 feet and has faced India's PV Sindhu, who won silver at the Rio Olympics and has over 9 inches on her, on court 25 times in their careers. Read more at straitstimes.com.", "filename": "sport_badminton-does-height-matter-tall-and-small-have-tactical-advantages_1728741625.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/05/LYNXMPEK740L1-1.jpg?VersionId=JaKbGqoGDxR5.kDRwuCOY9dIUMUtTACU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_badminton-does-height-matter-tall-and-small-have-tactical-advantages_1728741625.html", "title": "Badminton-Does height matter? Tall and small have tactical advantages", "title_page": "Badminton-Does height matter? Tall and small have tactical advantages | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Two-time world champion Akane Yamaguchi of Japan stands at just over 5 feet and has faced India's PV Sindhu, who won silver at the Rio Olympics and has over 9 inches on her, on court 25 times in their careers.\nSindhu has won 14 times and Yamaguchi has won 11 times.\nElite shuttlers come in all shapes and sizes and there can be an advantage whether you are taller or shorter.\nBeing shorter makes it easier to change direction and stay agile but harder to return a well-angled smash. If you are taller, it is easier to hit a forehand smash on the shuttlecock at a sharper angle but harder to move around.\nSpeed is not necessarily a factor when it comes to smashes from a height.\nA study on the jump smash by researchers at Loughborough University showed a \"non-significant correlation” between shuttlecock speed and jump height. Eighteen male badminton players of regional, national and international standards participated in the study, each performing a series of forehand jump smashes.\n\"Akane (Yamaguchi) might have to take an extra step but she's great on defence and can bounce right up,\" said Charmaine Reid, who competed at the Athens Games in 2004 and now commentates on the sport.\nYamaguchi, who lost in the quarter-finals in Paris, is \"more flexible than taller players\", Reid said.\nTokyo men's singles Olympic champion Viktor Axelsen of Denmark towers over most of his opponents at about 6 feet 4 inches. It is no wonder that with a roughly 27-inch badminton racket in his hand he can leap into the air to make one of his signature smashes that few players in the world can return successfully.\n\"He's tall, hits very, very good angles from the back of the court so it's difficult to defend against them,\" said Ian Wright, the Badminton World Federation's director of development, who oversees the sport's science and research division. He said Axelsen could be smashing from roughly 10 feet and 6 inches off the ground.\n\"But when Viktor plays someone (shorter) with a little bit of deception, it's harder for him to turn quickly because he's tall.\"\nAxelsen will defend his title against 5-foot-ten-inches-tall Kunlavut Vitidsarn of Thailand in the Paris Olympics' men's singles gold match at the Port de La Chapelle Arena later on Monday.\n\"Vitidsarn will be trying to make Viktor turn and change direction a lot. Viktor will be trying to impose his angles in his attack.\"\n\"It will be a tactical battle,\" Wright said. REUTERS", "url": "https://www.straitstimes.com/sport/badminton-does-height-matter-tall-and-small-have-tactical-advantages"}