{"authors": [], "date_download": "2024-10-12 13:41:19", "date_modify": "2024-10-12 13:41:19", "date_publish": "2024-08-20 23:37:08", "description": "The Women's T20 World Cup scheduled for October has been moved to the United Arab Emirates from Bangladesh, which has been rocked by political turmoil and violence in recent weeks. Read more at straitstimes.com.", "filename": "sport_womens-t20-world-cup-moved-to-uae-from-strife-torn-bangladesh_1728740479.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/21/2024-07-13T195943Z1063471533UP1EK7D1JJGCHRTRMADP3CRICKET-T20-ENG-NZL.JPG?VersionId=.BkVvAYr5uFMtomAORL9uLxL0P.luOKe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_womens-t20-world-cup-moved-to-uae-from-strife-torn-bangladesh_1728740479.html", "title": "Women’s cricket T20 World Cup moved to UAE from strife-torn Bangladesh", "title_page": "Women’s cricket T20 World Cup moved to UAE from strife-torn Bangladesh | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Women's T20 World Cup scheduled for October has been moved to the United Arab Emirates from Bangladesh, which has been rocked by political turmoil and violence in recent weeks.\nWorld cricket's governing body the ICC said on Tuesday that a number of participating countries had issued travel advisories for Bangladesh, effectively preventing the country from hosting the tournament.\nBangladesh's prime minister Sheikh Hasina fled the country earlier this month amid the protests, and an interim government led by Muhammad Yunus has taken charge.\n\"It is a shame not to be hosting the Women’s T20 World Cup in Bangladesh as we know the Bangladesh Cricket Board would have staged a memorable event,\" ICC chief executive Geoff Allardice said in a statement.\n\"Travel advisories from the governments of a number of the participating teams meant that wasn’t feasible. However, they will retain hosting rights. We look forward to taking an ICC global event to Bangladesh in the near future,\" he added.\nThe Women's T20 World Cup, scheduled for Oct. 3 to 20, will be the ninth edition of the global championship, with 10 countries involved. REUTERS", "url": "https://www.straitstimes.com/sport/womens-t20-world-cup-moved-to-uae-from-strife-torn-bangladesh"}