{"authors": [], "date_download": "2024-10-12 14:17:22", "date_modify": "2024-10-12 14:17:22", "date_publish": "2023-09-23 14:30:36", "description": "Current stand-in Liam Lawson would be the reserve driver for both of Red Bull’s teams. Read more at straitstimes.com.", "filename": "sport_formula-one_alphatauri-confirm-yuki-tsunoda-and-daniel-ricciardo-for-2024_1728742642.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/23/AUTO-PRIX-F1-JPN-PRACTICE-040114.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_alphatauri-confirm-yuki-tsunoda-and-daniel-ricciardo-for-2024_1728742642.html", "title": "AlphaTauri confirm Yuki Tsunoda and Daniel Ricciardo for 2024", "title_page": "AlphaTauri confirm Yuki Tsunoda and Daniel Ricciardo for 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SUZUKA – AlphaTauri confirmed Daniel Ricciardo and Yuki Tsunoda as their 2024 Formula One line-up on Saturday and said that current stand-in Liam Lawson would be the reserve driver for both of Red Bull’s teams.\nThe announcement at the Japanese Grand Prix ended speculation about which two of the three would be racing next season and left Williams as the only team with a potential vacancy.\nNew Zealander Lawson, 21, has impressed in three races as Ricciardo’s replacement since the 34-year-old Australian broke his hand in a crash in August. He is set to continue in the driver’s seat in Suzuka on Sunday.\n“We are in a privileged position, where we have access to multiple great talent from the Red Bull world,” said AlphaTauri’s new chief executive Peter Bayer.\n“Both Daniel and Yuki have not just shown fantastic race craft, but they are also great global ambassadors for our team and our sport. Liam put himself in the spotlight of F1 in only three races and I am very happy that we can continue to prepare him for his future.”\nRicciardo, whose return to the team could still be some way off, said he was “stoked” to be continuing the career comeback he started this season.\nThe eight-time race winner had begun 2023 taking time off following a difficult period at McLaren, before he joined AlphaTauri in July.\n“Following the progress we have already made and the plans for the future, it’s an exciting time for the team. We are building and it is a great feeling... bring on 2024,” he said.\nTsunoda, Japan’s only current F1 driver, will be racing for a fourth season after joining in 2021. His best finish was fourth at the 2021 Abu Dhabi Grand Prix.\n“Next year, the technical regulations remain largely unchanged and it was therefore logical to go for continuity in our driver line-up too,” said outgoing team principal Franz Tost, who will be handing over to Laurent Mekies.\n“I am very pleased with the development that Yuki has shown over the last 2½ years with our team and, with Daniel’s great race-winning experience, we will have one of the most competitive driver pairings on the grid in 2024.”\nTsunoda, 23, is also optimistic for the future.\n“I’m looking forward to continuing to fight and collaborate with the team and Daniel.” he said. “Obviously, I’ll push as much as possible for the rest of the season and beyond, to progress as a driver.”\nLawson, the youngest driver on the grid, had a dream performance at last weekend’s Singapore Grand Prix, knocking world champion Max Verstappen out of qualifying and then finishing the race in ninth place.\nHe is also competing in Japan’s Super Formula series this season and is second with one round remaining.\nAlphaTauri, who are currently bottom of the constructors’ standings, said the Kiwi driver will attend all F1 races next term, focusing on testing, simulator and development work. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/formula-one/alphatauri-confirm-yuki-tsunoda-and-daniel-ricciardo-for-2024"}