{"authors": ["David Lee"], "date_download": "2024-10-12 13:42:47", "date_modify": "2024-10-12 13:42:47", "date_publish": "2024-06-19 22:16:45", "description": "Teens Izaac Quek and Zhou Jingyi are the youngest Singapore-born players to qualify for the Olympics. Read more at straitstimes.com.", "filename": "sport_olympic-exposure-the-objective-higher-ranked-scalps-a-bonus-says-s-pore-table-tennis-chief_1728740567.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/19/2024061965365673img0541.jpg?VersionId=8Pq60EVbaa5Y1loS9KAHj0b.czhAk0Hc", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_olympic-exposure-the-objective-higher-ranked-scalps-a-bonus-says-s-pore-table-tennis-chief_1728740567.html", "title": "Olympic exposure the objective, higher-ranked scalps a bonus, says Singapore table tennis chief", "title_page": "Olympic exposure the objective, higher-ranked scalps a bonus, says Singapore table tennis chief | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – As the unexpected Olympics singles qualification eased the disappointment of the failure to qualify for the women’s team event for the first time, Singapore Table Tennis Association (STTA) president Poh Li San has set her sights on regaining the team quotas at future Olympics and possibly even a medal.\nWith the STTA transitioning from a reliance on China-born players who delivered medals at Beijing 2008 and London 2012 to predominantly local-born teams, it missed out on the men and women’s team qualification for Paris 2024.\nHowever, teenagers Izaac Quek and Zhou Jingyi have provided the silver lining by being the youngest Singapore-born players to qualify for the Olympics, joining Hunan native Zeng Jian, 27, as Olympians-to-be.\nNear misses such as Koen Pang (men’s singles second reserve) and the mixed doubles first-reserve pair of Wong Xin Ru and Pang also give the association belief that they are on the right track.\nAt a press conference at the STTA headquarters at the OCBC Arena on June 19, Poh said there is no medal target as she did not want to heap unnecessary and unrealistic pressure on the debutants to beat a field of world-class players from China, Japan, South Korea and Europe to the podium.\nQuoting a Chinese saying that means a moment on the big stage is the result of years of hard work, she shared that in the past year, the players have been out of Singapore for 250 out of 365 days, taking part in more than 35 competitions in 20 countries in search of Olympic qualification ranking points.\nIn the lead-up to the Games, they will head to Tunisia for the June 25-30 WTT Contender Tunis, and Thailand for the July 2-7 WTT Star Contender Bangkok, before returning to Singapore for two weeks of centralised training ahead of their July 21 departure for the French capital.\nThe July 27-Aug 10 Olympic table tennis competition will be held at South Paris Arena.\nPoh added: “This is a new team as we undergo a transition. The primary objective for them is exposure and experience, especially for young players like Izaac and Jingyi, who would have the opportunity to compete in another three to four Olympics, if they continue to work hard and do well.\n“For these Olympics, we want them to learn. To do well is a bonus. I hope each of them will take this opportunity to push their own boundaries and make breakthroughs for themselves. Beating higher-ranked players will be an achievement.\n“Younger players can look up to them and know there is a pathway for them. They have the opportunity to follow in their footsteps to qualify for the Olympics in the future as well. We hope that at Los Angeles 2028, we will be able to field the men’s and women’s teams.”\nThe players themselves are looking to build on a productive year.\nWomen’s singles world No. 122 Zhou, 19, could head to Paris a Portuguese league champion, with CTM Mirandela holding a 3-0 first-leg lead in the Campeonato Nacional 1. Divisao Feminina, while 51st-ranked Zeng said she hopes “to put up my biggest performances on the biggest stage”.\nMen’s singles world No. 85 Quek showed typical teenage enthusiasm with his excitement to experience and enjoy the athletes’ village. The lack of expectation has worked for him before, as he claimed several scalps at high-profile tournaments such as the Singapore Smash, before winning three gold medals at the 2023 SEA Games.\nSaid the 18-year-old: “I’m looking to gain as much Olympic experience as I can, play with no pressure and try to create some upsets.”\nThe players also unveiled their Olympic jerseys at the media session. Following a collaboration between STTA and Hwa Chong Institution’s (HCI) Art Elective Programme, Raeanne Koh’s concept was picked from a pool of designs from eight HCI students.\nNational men’s team head coach Gao Ning hopes the players can take inspiration from the bold strokes that depict a lion, and said: “I hope Izaac can be brave to play his own game and put up a strong fight. This experience will be important in shaping them for the future.”\nNational women’s team head coach Jing Junhong added: “More than their technical level, we also need to build in them a positive mentality. Because of the success previous women’s teams have had at the Olympics, there are comparisons and expectations.\n“Our teams were stronger then, but we are now building the future. Our current players are younger and most have not played full time for long. We need to reduce unnecessary pressure and help them focus on being the best players they can be.”", "url": "https://www.straitstimes.com/sport/olympic-exposure-the-objective-higher-ranked-scalps-a-bonus-says-s-pore-table-tennis-chief"}