{"authors": [], "date_download": "2024-10-12 13:52:46", "date_modify": "2024-10-12 13:52:46", "date_publish": "2024-01-18 00:50:39", "description": "China will need to fight to reach the knock-out rounds after successive 0-0 draws. Read more at straitstimes.com.", "filename": "sport_football_afif-shines-again-as-qatar-beat-tajikistan-to-move-into-asian-cup-knockouts_1728741166.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/18/FBL-ASIA-2023-MATCH14-TJK-QAT-145944.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_afif-shines-again-as-qatar-beat-tajikistan-to-move-into-asian-cup-knockouts_1728741166.html", "title": "Hosts Qatar into Asian Cup last 16, but China made to sweat", "title_page": "Hosts Qatar into Asian Cup last 16, but China made to sweat | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AL KHOR, Qatar - Hosts and defending champions Qatar on Jan 17 were the first team to reach the Asian Cup knockout rounds, but China will need to fight it out to join them after successive 0-0 draws.\nQatar were left red-faced after losing all three games at their home World Cup in 2022, the worst performance of any host in the competition’s history.\nThey then axed Carlos Queiroz early in December and replaced the former Real Madrid coach with Tintin Marquez in a last-minute gamble.\nIt has paid off so far with Qatar following up their 3-0 win over Lebanon with a 1-0 victory over Asian Cup newcomers Tajikistan in front of 55,000 at the tent-like Al Bayt Stadium.\nLivewire forward Akram Afif, who scored twice in the opening game of the tournament, hit what turned out to be the winner with another clinical finish.\nThe forward raced onto a through ball from Almoez Ali in the 17th minute before stabbing it deftly past Tajikistan’s goalkeeper Rustam Yatimov.\n“Almoez is one of my best friends and we understand each other very well,” Afif said of his partnership with Ali, who scored a record nine goals as Qatar won the title for the first time in 2019.\n“We have been playing together for a long time so we understand what each other is going to do just with a look.\n“We hope the best is still yet to come.”\nTajikistan finished with 10 men after Amadoni Kamolov was sent off for kicking out at Ahmed Al-Ganehi’s face late in the game, the first dismissal of the competition.\nQatar’s victory put them through as Group A winners with a game to spare, but who progresses with them will go right down to the wire.\nIn the final round of matches in the group on Jan 22, Qatar play China while Tajikistan face Lebanon.\nDespite two listless 0-0 draws China are in pole position to go through with the hosts.\nChina have two points, with Tajikistan and Lebanon each on one.\nOnly the top two are sure to reach the knockouts.\n‘Long road’\nChina may benefit if the hosts decide to rest players, as coach Aleksandar Jankovic looks to avoid the ignominy of going out at the group phase.\nAfter a goalless draw with Tajikistan to start their campaign, China again failed to fire with a 0-0 stalemate against Lebanon on Jan 17.\nLower-ranked Lebanon twice struck China’s crossbar while the Chinese had an effort cleared off the line in an entertaining encounter.\nBut it was ultimately another anti-climax for Chinese football, which is reeling from a graft scandal at home.\n“At the end we did not win but we showed good mentality, excellent attitude and big fight,” said the under-pressure Serbian Jankovic.\n“The road is still long and the target is the same – to play in the knockout stage.”", "url": "https://www.straitstimes.com/sport/football/afif-shines-again-as-qatar-beat-tajikistan-to-move-into-asian-cup-knockouts"}