{"authors": [], "date_download": "2024-10-12 14:09:06", "date_modify": "2024-10-12 14:09:06", "date_publish": "2024-08-19 21:17:05", "description": "Former player Dearica Hamby filed a lawsuit saying she was the target of “repeated acts of intimidation, discrimination and retaliation from the Aces”. Read more at straitstimes.com.", "filename": "sport_basketball_las-vegas-aces-coach-becky-hammon-denies-any-wrongdoing-in-wake-of-suit_1728742146.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/19/BKP-SPO-WBA-NEW-YORK-LIBERTY-V-LAS-VEGAS-ACES-225815.jpg?VersionId=WuMZ0DbQGNTdRD66JHVIVEk3gg6QJTKh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_las-vegas-aces-coach-becky-hammon-denies-any-wrongdoing-in-wake-of-suit_1728742146.html", "title": "Las Vegas Aces coach Becky Hammon denies any wrongdoing in wake of suit", "title_page": "Las Vegas Aces coach Becky Hammon denies any wrongdoing in wake of suit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEVADA – Aces coach Becky Hammon is adamant that she never mistreated former Las Vegas forward Dearica Hamby because of her pregnancy back in July 2022.\nHamby filed a lawsuit in federal court against both the Aces and the Women’s National Basketball Association (WNBA) on Aug 12, claiming that she was the target of “repeated acts of intimidation, discrimination and retaliation from the Aces” after revealing that she was pregnant.\nThe team found out about her pregnancy just weeks after the three-time All-Star discovered that she was expecting. She was then traded to the Los Angeles Sparks in January 2023, a move she believes stemmed from the pregnancy.\nIn the lawsuit, Hamby also claims that the WNBA did not conduct a sound investigation.\nLas Vegas played Hamby and the Sparks on Aug 18 and won 87-71. Following the game, Hammon was asked about the lawsuit.\n“Here’s some facts,” Hammon said. “I’ve been in either the WNBA or the NBA for now 25 years. I’ve never had an HR complaint. Never, not once.\n“I still didn’t, actually, because Dearica didn’t file any. She didn’t file with the players’ union, she didn’t file with the WNBA. Those are facts.\n“It’s also factual that nobody made a call about trading her until Atlanta called us in January (2023). That’s a fact. So... it just didn’t happen.\n“I’m sorry, the bullying? I spoke with her every day. If she wanted to practise, she practised. If she didn’t, she didn’t. Over-the-top care, actually. Over-the-top care.”\nHamby alleges that when she asked Hammon if she was being traded because she was pregnant, Hammon did not deny it, per the lawsuit.\nHamby also accuses the WNBA of not adequately investigating her complaint when she initially brought it to the league office. And after she levelled the complaint, her marketing contract with the league was not renewed.\nOn the trade, Hammon was quoted by ESPN as saying: “It came down to math in business. That’s all it was. Nothing personal.\n“I had a great relationship with Hamby the whole time. Which is why she probably felt the way she did. You know, it feels like a betrayal. But like I said, it’s a crappy part of my job, but somebody’s got to be the bearer of bad news.”\nIn May 2023, Hammon received a two-game suspension following the WNBA’s investigation, which lasted months. The league said that Hammon had violated Respect in the Workplace policies.\nHamby, 30, spent the first eight seasons of her WNBA career with the Aces, who were known as the San Antonio Stars for her first three years in the league.\nIn 242 games (85 starts) with Las Vegas/San Antonio, Hamby averaged 9.2 points, 5.6 rebounds and 1.4 assists from 2015-22. She won a ring with the Aces in 2022 and was a two-time Sixth Woman of the Year Award winner (2019, 2020).\nThis season, Hamby has averaged career highs in points (18.3), rebounds (10.1) and assists (3.6) across 27 games (all starts).\nHamby was held to 13 points on four-of-12 shooting from the field on Aug 18. REUTERS", "url": "https://www.straitstimes.com/sport/basketball/las-vegas-aces-coach-becky-hammon-denies-any-wrongdoing-in-wake-of-suit"}