{"authors": [], "date_download": "2024-10-12 13:45:48", "date_modify": "2024-10-12 13:45:48", "date_publish": "2024-09-05 21:06:03", "description": "SAITAMA, Japan - Japan cruised to a winning start in the third phase of Asia's preliminaries for the 2026 World Cup as Hajime Moriyasu's side thrashed China 7-0 at Saitama Stadium on Thursday. Read more at straitstimes.com.", "filename": "sport_football_minamino-hits-double-as-clinical-japan-thrash-china_1728740748.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/LYNXMPEK840M3-1.jpg?VersionId=BaGGWKLskc_6Uuat3bjkVKV0joM_e79.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_minamino-hits-double-as-clinical-japan-thrash-china_1728740748.html", "title": "Minamino hits double as clinical Japan thrash China", "title_page": "Minamino hits double as clinical Japan thrash China | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SAITAMA, Japan - Japan cruised to a winning start in the third phase of Asia's preliminaries for the 2026 World Cup as Hajime Moriyasu's side thrashed China 7-0 at Saitama Stadium on Thursday.\nWataru Endo and Kaoru Mitoma gave Japan a two-goal lead at the interval in the Group C clash before Takumi Minamino hit a second-half brace.\nJunya Ito, Daizen Maeda and Takefusa Kubo added to the scoreline as China were comprehensively outplayed.\nThe Japanese have been slow starters in the final phase of Asia's qualifiers in recent years but there was little that was sluggish about Hajime Moriyasu's side against an outclassed China.\nEndo put Japan in front in the 12th minute after Chinese goalkeeper Wang Dalei had kept out Ritsu Doan's header seconds earlier.\nThe Liverpool midfielder was left unmarked at the resulting corner and he made no mistake when Kubo delivered the ball, scoring with a clinical header.\nDoan went close to adding a second in the 33rd minute while Hidemasa Morita hit the side-netting with two minutes left in the half.\nThe Japanese did manage to double their lead before the interval, Mitoma meeting Doan's curling centre to head the ball back across the helpless Wang.\nSeven minutes into the second half Moriyasu's side extended their lead when Mitoma's pass released Minamino into the penalty area and the Monaco forward bent his strike beyond Wang.\nMinamino claimed his second of the night six minutes later with a perfect finish into the bottom corner that left Wang sprawled on the Saitama Stadium turf.\nSubstitute Ito claimed the fifth 13 minutes from time when his shot was deflected past Wang by Jiang Guangtai and then set up Maeda to head in the sixth in the 87th minute.\nKubo lashed the ball into the roof of the net in injury time to complete China's embarrassment.\nThe top two finishers in the group, which also features Australia, Saudi Arabia, Indonesia and Bahrain, will advance automatically to the World Cup while the third and fourth placed teams will progress to a further round of qualifiers.\nAsia has been given eight guaranteed places at the 2026 finals, with the possibility of a further place via an intercontinental playoff. REUTERS", "url": "https://www.straitstimes.com/sport/football/minamino-hits-double-as-clinical-japan-thrash-china"}