{"authors": [], "date_download": "2024-10-12 13:43:11", "date_modify": "2024-10-12 13:43:11", "date_publish": "2024-02-11 20:09:13", "description": "The Tunisian was bidding for a 400m-800m-1,500m treble of freestyle world titles. Read more at straitstimes.com.", "filename": "sport_olympic-swimming-champ-ahmed-hafnaoui-bombs-out-of-400m-freestyle-adam-peaty-eases-through_1728740591.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/11/SWIM-WORLD-2024-082344.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_olympic-swimming-champ-ahmed-hafnaoui-bombs-out-of-400m-freestyle-adam-peaty-eases-through_1728740591.html", "title": "Olympic swimming champion Ahmed Hafnaoui bombs out of 400m freestyle, Adam Peaty eases through", "title_page": "Olympic swimming champion Ahmed Hafnaoui bombs out of 400m freestyle, Adam Peaty eases through | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA – Olympic swimming champion Ahmed Hafnaoui’s world championships got off to a poor start as the Tunisian bombed out of the 400 metres freestyle on day one, but breaststroke king Adam Peaty eased through on his return to the global event.\nBidding for a treble of the 400m-800m-1,500m freestyle world titles, Hafnaoui ranked 17th in the 400m heats in three minutes 48.05 seconds – nearly eight seconds adrift of his silver medal-winning swim at 2023’s event in Fukuoka, Japan.\nThe 21-year-old appeared nonplussed as he exited the Aspire Dome pool in Doha and declined to talk to reporters. He will bid to defend his 800m and 1,500m freestyle titles later in the meet.\nAustralia’s former world champion Elijah Winnington topped qualifying for the 400m final with a time of 3:44.37, ahead of Germany’s Fukuoka bronze medallist Lukas Martens.\nWorld record-holder Peaty cruised into the 100m breaststroke semi-finals, qualifying third behind American Nic Fink (59.19 seconds) and Italy’s Nicolo Martinenghi in a strong field, despite the absence of Chinese world champion Qin Haiyang. A slew of top swimmers have skipped Doha to focus on their Olympic preparations, but Peaty is using the event as a stepping stone to his bid for a third successive 100m gold at the Paris Games.\nThe Briton, who missed 2023’s World Championships in Fukuoka while on a mental health break, and the 2022 event in Budapest due to a broken foot, posted a time of 59.34 seconds in his heat.\n“Very good start. You never know coming into these world championships, especially in February. Obviously we’re coming off a very big winter so we’re getting it flying again. I wasn’t using much emotion this morning... I was just process-led, get the job done,” said Peaty.\nWorld champion Kate Douglass topped qualifying for the semi-finals of the women’s 200m individual medley, winning her heat with ease in a time of 2:10.01. Canada’s Sydney Pickrem was second fastest (2:10.97).\nSeven months after being disqualified at Fukuoka for a botched change-over, the British men’s 4x100m freestyle relay reached the final safely, qualifying third behind the United States and Italy.\nSingapore’s swimming contingent also kicked off their campaign on Feb 11 with Teong Tzen Wei and Letitia Sim booking their spots in the semi-finals of the men’s 50m butterfly and women’s 200m individual medley respectively.\nSim clinched a top-13 spot in the heats, clocking 2min 14.26sec during her heat.\nTeong recorded 23.53sec in the 50m butterfly heats, which saw him having to battle it out in a swim-off – where he finished first out of three with a time of 23.42sec – to advance to the semi-finals.\nIn the women’s 100m butterfly heats, Quah Jing Wen finished 18th out of 45 swimmers in 59.61sec, while Gan Ching Hwee finished 19th out of 33 swimmers in the women’s 400m freestyle heats in 4 min 14.54sec. Both failed to progress to the semi-finals.\nIn the men’s 4x100m freestyle relay, the Team Singapore quartet of Darren Lim, Jonathan Tan, Mikkel Lee and Ardi Azman finished 14th, clocking 3min 18.52sec. They failed to make the finals.\nThe results of the finals for the men’s 4x100 free, men’s 400m free, women’s 400m free and women’s 4x100 free were not available at press time, as were the semi-finals for the men’s 50m fly, men’s 100m breast, women’s 200m individual medley and women’s 100m fly.\nMeanwhile, Beijing will host the 2029 World Aquatics Championships, becoming the second Chinese city to do so after Shanghai in 2011, World Aquatics announced on Feb 12.\nChina also hosted the World Aquatics short course Swimming Championships (25m) in Hangzhou in 2018.\nThe announcement comes in the middle of the present world championships in Doha where China dominated the first week, taking 16 golds out of 29 events to top the medal table.\nSingapore and Budapest will host the 2025 and 2027 editions respectively. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/olympic-swimming-champ-ahmed-hafnaoui-bombs-out-of-400m-freestyle-adam-peaty-eases-through"}