{"authors": [], "date_download": "2024-10-12 13:41:03", "date_modify": "2024-10-12 13:41:03", "date_publish": "2024-07-19 18:23:33", "description": "The Friedkin Group has abandoned its plans to buy a majority stake in Everton after being granted a period of exclusivity last month, the Premier League club said on Friday. Read more at straitstimes.com.", "filename": "sport_friedkin-group-pulls-out-of-talks-to-buy-majority-stake-in-everton_1728740463.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/19/LYNXMPEK6I0CN-3.jpg?VersionId=sYltm5FMjtmuelwOR24sYV1XpozAZ4gr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_friedkin-group-pulls-out-of-talks-to-buy-majority-stake-in-everton_1728740463.html", "title": "Friedkin Group pulls out of talks to buy majority stake in Everton", "title_page": "Friedkin Group pulls out of talks to buy majority stake in Everton | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Friedkin Group has abandoned its plans to buy a majority stake in Everton after being granted a period of exclusivity last month, the Premier League club said on Friday.\nThe Friedkin Group, who are also majority owners of Italian Serie A club AS Roma, were in exclusive talks to buy a stake after a takeover agreement with prospective owner 777 Partners fell through.\n\"Following a period of exclusivity, discussions between Blue Heaven Holdings and The Friedkin Group over a potential sale of a majority stake in Everton have ended and The Friedkin Group will not be progressing with a purchase of the club,\" Everton said.\n\"Both Blue Heaven Holdings and The Friedkin Group entered discussions in good faith to explore whether a sale could be agreed.\n\"Those discussions have concluded. The parties agree it is in both their interests for Everton to explore alternative options.\"\nEverton said the Friedkin Group will remain a lender to the Merseyside club having played a role in the new stadium being built.\n\"Blue Heaven Holdings maintains a positive relationship with The Friedkin Group and would like to thank them for the time and effort they have put into this process,\" the club added.\nLast year, Miami-based investment fund 777 Partners said it had signed an agreement with British-Iranian billionaire Farhad Moshiri to acquire his 94.1% stake in the club in a deal reported to worth more than 550 million pounds ($710 million).\nMoshiri, a former Arsenal shareholder, first bought a 49.9% stake in Everton in 2016. By January 2022, he had increased his stake to 94.1% with a 100-million-pound capital injection.\nThe takeover was initially expected to be closed by the end of 2023.\nHowever, it was delayed as 777 Partners reportedly struggled to meet the necessary conditions outlined by the Premier League to complete their purchase, before it fell through last month when the takeover agreement expired.\nEverton flirted with relegation last season after having points deducted twice for breaching the Premier League's Profitability and Sustainability Rules (PSR).\nBut they eventually finished 15th after winning five of their last eight games to secure their top-flight status. REUTERS", "url": "https://www.straitstimes.com/sport/friedkin-group-pulls-out-of-talks-to-buy-majority-stake-in-everton"}