{"authors": [], "date_download": "2024-10-12 14:14:40", "date_modify": "2024-10-12 14:14:40", "date_publish": "2024-03-22 11:23:18", "description": "MELBOURNE - Charles Leclerc topped the timesheets for Ferrari in the second free practice at the Australian Grand Prix on Friday after Williams driver Alex Albon wrecked his car in the first session with a crash at a familiar turn at Albert Park. Read more at straitstimes.com.", "filename": "sport_formula-one_norris-fastest-as-albon-crashes-in-practice-at-australian-gp_1728742480.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/22/LYNXNPEK2L02X-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_norris-fastest-as-albon-crashes-in-practice-at-australian-gp_1728742480.html", "title": "Ferrari buoyed by pace after Australian GP practice", "title_page": "Ferrari buoyed by pace after Australian GP practice | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MELBOURNE - Charles Leclerc topped the timesheets for Ferrari in the second free practice at the Australian Grand Prix on Friday after Williams driver Alex Albon wrecked his car in the first session with a crash at a familiar turn at Albert Park.\nLeclerc posted a flying lap of one minute, 17.277 seconds on soft tyres midway through the second session (FP2), 0.381 seconds quicker than Red Bull's reigning world champion Max Verstappen.\nDutchman Verstappen, bidding for back-to-back wins in Australia and a third victory in succession this season, made a late start after damaging the floor of his car in the earlier session and was unable to do as many laps as planned.\nFerrari were nonetheless buoyed by their speed ahead of Saturday's qualifying, having been well off Red Bull's pace in the opening races in Bahrain and Saudi Arabia.\nLeclerc's team mate Carlos Sainz was third quickest in FP2 on his return to racing two weeks after appendicitis surgery.\n\"We are fast so we are enjoying it but we need to wait and see,\" Leclerc, who was third behind the two Red Bull cars in Saudi Arabia, told reporters.\n\"Red Bull weren't pushing yet (today). I think they are still ahead but we might have our best shot from the beginning of the season.\"\nVerstappen's team mate Sergio Perez was eighth fastest in FP2 on a day when most cars struggled for grip on the street circuit.\nMcLaren driver Lando Norris had set the pace (1:18.564) in FP1, which was halted in the last 20 minutes after Albon's crash triggered a red flag.\nThe England-born Thai driver locked up and took a heavy shunt into the barrier at turn six then careened into the opposite barrier to damage both sides of his car, leaving debris on a long section of the track.\nIt came a year after Albon crashed at the same turn on race-day, triggering one of three red flags.\nAlbon walked away from his car unharmed and apologised on the team radio.\nHe missed FP2 as his team worked on his car, and Williams, who do not have a spare chassis in Melbourne, may be down a driver for the rest of the race weekend if unable to repair it.\nWilliams had another fright in FP2 when Logan Sargeant, who recorded the 13th quickest lap, slid off track at the exit of turn 11.\nIt was a sobering day for Mercedes, whose early season troubles appear to have followed them to Australia.\nSeven-times world champion Lewis Hamilton posted only the 18th fastest lap in FP2 after being ninth quickest earlier.\nWolff later revealed that engineers had made a major set-up change on Hamilton's car in a bid to unlock performance but said the move massively backfired.\nRussell was sixth in FP2 and third in FP1 but also struggled for control, joining Hamilton with a skid off track in the early session and complaining about vibration in his steering rack.\n\"It didn't feel good out there today,\" said Hamilton.\n\"We made some big changes into FP2 and unfortunately, that made the car worse.\"\nAston Martin's Lance Stroll was fourth in FP2, ahead of team mate Fernando Alonso. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/norris-fastest-as-albon-crashes-in-practice-at-australian-gp"}