{"authors": [], "date_download": "2024-10-12 14:17:26", "date_modify": "2024-10-12 14:17:26", "date_publish": "2023-10-08 02:40:04", "description": "Max Verstappen's Formula One career in numbers after the Red Bull driver clinched his third successive world championship in Qatar on Saturday: Read more at straitstimes.com.", "filename": "sport_formula-one_verstappens-f1-career-in-numbers_1728742646.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/08/LYNXMPEJ9609M-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_verstappens-f1-career-in-numbers_1728742646.html", "title": "Verstappen's F1 career in numbers", "title_page": "Verstappen's F1 career in numbers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Max Verstappen's Formula One career in numbers after the Red Bull driver clinched his third successive world championship in Qatar on Saturday:\n1 - The number on his car since the start of 2022. He has otherwise raced with 33.\n3 - Championships won in 2021, 2022 and 2023. The first was controversial, Verstappen level with Mercedes Lewis Hamilton into the final race at Abu Dhabi and winning after now-departed race director Michael Masi changed the safety car procedure.\nAlso the number of 'Grand Slams' -- pole, fastest lap, led every lap and won -- achieved to date.\n10 - Record number of wins in a row in a single season, achieved this year.\n15 - Most races won in a single season, achieved in 2022. He has won 13 of 16 so far in 2023.\n17 - Verstappen was 17 years and 166 days when he became the youngest F1 driver to date. He scored his first points aged 17 years and 180 days.\n18 - Verstappen took his first win in Spain in 2016 at the age of 18 years and 228 days, becoming the youngest ever race winner and first Dutch driver to triumph in Formula One.\nAlso his most podium finishes in a single season (2021)\n26 - Verstappen's age as a triple champion, the youngest since Sebastian Vettel won his third at 25 and second youngest of all time.\n28 - Fastest laps so far\n30 - The number of pole positions to date, including for Sunday's race in Qatar.\n34 - Verstappen is the 34th driver to win a Formula One world championship.\n48 - Grand prix wins to date, not including sprints. Verstappen is fifth on the all-time list and only three behind four times champion Alain Prost.\n92 - Career podiums.\n180 - Races since his debut in Australia with Toro Rosso (now AlphaTauri) in 2015. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/verstappens-f1-career-in-numbers"}