{"authors": [], "date_download": "2024-10-12 14:12:30", "date_modify": "2024-10-12 14:12:30", "date_publish": "2024-05-01 14:12:41", "description": "The guard produced a 46-point gem as the Sixers kept their NBA Eastern Conference play-off hopes intact. Read more at straitstimes.com.", "filename": "sport_basketball_tyrese-maxey-magic-fires-philadelphia-76ers-past-ny-knicks-as-milwaukee-bucks-stay-alive_1728742350.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/01/2024-05-01T021036Z824866913MT1USATODAY23154287RTRMADP3NBA-PLAYOFFS-PHILADELPHIA-76ERS-AT-NEW-YORK-KNICKS.JPG?VersionId=fnGEDfx9YSqjA0P8sQ2KqixYg.d9cW1k", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_tyrese-maxey-magic-fires-philadelphia-76ers-past-ny-knicks-as-milwaukee-bucks-stay-alive_1728742350.html", "title": "Tyrese Maxey magic fires Philadelphia 76ers past NY Knicks, as Milwaukee Bucks stay alive", "title_page": "Tyrese Maxey magic fires Philadelphia 76ers past NY Knicks, as Milwaukee Bucks stay alive | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Tyrese Maxey was so passionate that he was shouting some things that “his grandma probably wouldn’t like”, but the Philadelphia 76ers would love him after he helped to stun the New York Knicks 112-106 in overtime.\nOn April 30, the 23-year-old guard produced a 46-point gem in New York as the Sixers kept their National Basketball Association (NBA) Eastern Conference play-off hopes alive.\nMaxey led his team back from the brink of defeat in the fourth quarter with a late burst of scoring before dominating in overtime to ensure a Game 6 back in Philadelphia.\nThe Knicks, leading the best-of-seven first-round series 3-1 heading into the game, had looked poised to progress after Jalen Brunson helped the second seeds take a six-point lead with 29 seconds remaining in the fourth quarter.\nBut Maxey drained a three-pointer and then hit a stunning long-range shot from the logo with nine seconds left to send a pulsating duel into overtime.\nIt looked as if the Knicks had reclaimed the initiative after Brunson scored five points to give New York a five-point lead before a raucous Madison Square Garden.\nYet Maxey and NBA Most Valuable Player Joel Embiid had other ideas, launching a 9-0 run to give the Sixers a 106-102 advantage. New York pegged it back to 106-106, but the Sixers regrouped and pulled clear again to seal victory.\n“Season on the line, we fought for 53 minutes and never gave up,” Maxey said.\n“Even when we were down late... guys still went out there and made plays – that was big time.”\nA pumped-up Maxey could be seen roaring in defiance after helping the Sixers take the game to overtime.\n“I was saying some things that my grandma probably wouldn’t like,” he added.\n“I’m a happy guy, but I absolutely hate losing.”\nMaxey’s 46-point haul included seven three-pointers, while Embiid posted a triple-double of 19 points, 16 rebounds and 10 assists.\nTobias Harris added 19 points for the Sixers and Kelly Oubre Jr finished with 14.\nBrunson led New York’s scoring with 40 points, while Josh Hart had 18 and O.G. Anunoby 17.\n“It was a tough way to lose because you get up six, eight and then we had a couple turnovers and we’ve got to just be better,” Knicks coach Tom Thibodeau said.\n“Play tougher with the lead, use good judgment. Fourth quarter is different, understand the difference. So we can do better and we will.”", "url": "https://www.straitstimes.com/sport/basketball/tyrese-maxey-magic-fires-philadelphia-76ers-past-ny-knicks-as-milwaukee-bucks-stay-alive"}