{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 13:43:58", "date_modify": "2024-10-12 13:43:58", "date_publish": "2023-10-08 16:35:16", "description": "The past fortnight has been a real test in Mandarin for ST sports journalist Kimberly Kwek. Read more at straitstimes.com.", "filename": "sport_hello-from-hangzhou-how-zha-dan-could-have-landed-this-singaporean-in-trouble_1728740638.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/08/file7s6l6tfq074lp3gc1nq7.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_hello-from-hangzhou-how-zha-dan-could-have-landed-this-singaporean-in-trouble_1728740638.html", "title": "How ‘zha dan’ could have landed this Singaporean in trouble", "title_page": "How ‘zha dan’ could have landed this Singaporean in trouble | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANGZHOU – Whenever it came up in conversations that I would be going to China to cover the Asian Games, it would elicit concerned looks or laughter from my friends.\n“How are you going to survive?” was the common response – because they knew my Mandarin was, at best, at primary school standard.\nIt was often my worst subject in school and my command of the language deteriorated once exams were over and I didn’t need to practise it.\nMy journey to Hangzhou did not get off to a good start when a fellow reporter from Lianhe Zaobao tried to test me and asked what fried egg was in Mandarin.\nI replied “zha dan”, which directly translates to fried egg but actually means bomb.\nThankfully I found out before I boarded the plane, or this accidental terrorist might have been on the next flight home.\nAhead of the trip, my biggest concerns were about meeting the tight deadlines and crucially, how I would get by with my Mandarin.\nThe past fortnight has been a real test – this is possibly the most Mandarin I have spoken since my days in junior college.\nOver the last two weeks, I have received some confused looks while speaking to the locals. To add insult to injury, several times the local volunteers told me that it’s okay to speak in English when they saw me struggling to form a proper sentence.\nMy two favourite phrases “ni hao” (hello) and “xie xie” (thank you) helped kick-start conversations but little did they know that all I could do after was nod.\nThis happened on cab rides to different competition venues, with drivers genuinely curious to find out more about what we thought of the city, and how Singapore compares to China.\nUnfortunately, my limited vocabulary usually would result in short exchanges, followed by awkward silence.\nMaybe I should have brought a picture book with me – the type travellers use in foreign lands where they don’t speak the language.\nI had to rely on my very patient and kind colleagues to help with translation and to teach me certain phrases. I now know what media mixed zone is in Mandarin.\nAt times, I had to use translation apps like Google Translate and the Pleco Chinese dictionary to communicate.\nOne of my colleagues joked about finding me a husband from China – that would not work out with my Mandarin at this level.\nI am not proud of my inability to speak the language fluently. In fact, I wish I was more eloquent in it and had taken it more seriously in school – sorry, Huang lao shi (teacher).\nIt is a beautiful language that feels alien to me at times, and I also felt I had missed out on opportunities to interact with the locals and to get to know the culture and city better beyond the Games.\nWhile it was challenging to have to speak Mandarin these past two weeks, the experience has also made me appreciate my mother tongue more.\nPerhaps it is time to dust off my old textbooks when I am back home.", "url": "https://www.straitstimes.com/sport/hello-from-hangzhou-how-zha-dan-could-have-landed-this-singaporean-in-trouble"}