{"authors": [], "date_download": "2024-10-12 14:02:16", "date_modify": "2024-10-12 14:02:16", "date_publish": "2024-06-11 23:29:25", "description": "Zverev lost the French Open final after over four hours on court against Carlos Alcaraz on June 9. Read more at straitstimes.com.", "filename": "sport_tennis_my-body-is-not-ready-says-alexander-zverev-as-he-withdraws-from-stuttgart_1728741736.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/11/11400477.jpg?VersionId=axpwXpQfFeKYB9UwbZG.F2MgxIRCoCtN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_my-body-is-not-ready-says-alexander-zverev-as-he-withdraws-from-stuttgart_1728741736.html", "title": "'My body is not ready' says Alexander Zverev, as he withdraws from Stuttgart", "title_page": "'My body is not ready' says Alexander Zverev, as he withdraws from Stuttgart | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "STUTTGART, Germany - Alexander Zverev withdrew from the Stuttgart Open on June 11, with the Roland Garros runner-up citing fatigue after his French Open final.\nThe ATP number four was top seed at the German event which marks the start of the grass season transition prior to Wimbledon, which begins on July 1.\nThe German lost the Paris final after over four hours on court against Carlos Alcaraz on June 9.\n“I have played a lot of tennis in the last few weeks and reached the final in Paris, where I played five tough sets,” Zverev said in a statement.\n“I feel that my body is not ready to go from clay to grass now.”\nZverev last competed in Stuttgart in 2019, losing his opening match to Dustin Brown.\nZverev was replaced in the Stuttgart draw by French veteran Richard Gasquet, who will play Brandon Nakashima after the American beat compatriot Christopher Eubanks 7-6 (7/4), 6-4 on June 11. AFP", "url": "https://www.straitstimes.com/sport/tennis/my-body-is-not-ready-says-alexander-zverev-as-he-withdraws-from-stuttgart"}