{"authors": [], "date_download": "2024-10-12 14:00:55", "date_modify": "2024-10-12 14:00:55", "date_publish": "2024-07-31 20:14:26", "description": "PARIS - Serbia's Novak Djokovic and Spain's Carlos Alcaraz stayed on collision course for a golden showdown at the Paris Olympics as they surged through to the quarter-finals on Wednesday. Read more at straitstimes.com.", "filename": "sport_tennis_tennis-djokovic-reaches-quarter-finals-in-ominous-fashion_1728741655.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/LYNXMPEK6U0Y8-1.jpg?VersionId=21BHR.lp9jXl2Ywkk4RWtSeO.q9UOpY9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_tennis-djokovic-reaches-quarter-finals-in-ominous-fashion_1728741655.html", "title": "Tennis-Djokovic and Alcaraz move closer to golden showdown", "title_page": "Tennis-Djokovic and Alcaraz move closer to golden showdown | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Serbia's Novak Djokovic and Spain's Carlos Alcaraz stayed on collision course for a golden showdown at the Paris Olympics as they surged through to the quarter-finals on Wednesday.\nDjokovic, probably in the last-chance-saloon as far as his Olympic title hopes go, beat Germany's Dominic Koepfer 7-5 6-3 to reach the last eight at the Games for a record fourth time.\nThe 21-year-old Alcaraz, seeded two, then followed suit with a 6-4 6-2 victory over Russian Roman Safiullin.\nWomen's singles top seed Iga Swiatek became the first player from Poland to reach the semi-finals in Olympic tennis although she was given a fright by American Danielle Collins who retired with a medical issue when losing 4-1 in the third set.\nWith Greece's Stefanos Tsitsipas set to play Djokovic in the last eight and Norway's sixth seed Casper Ruud through to play Canada's Felix Auger-Aliassime, the men's singles draw is still loaded with familiar faces.\nBut the women's singles continued to throw up surprises with Anna Karolina Schmiedlova stunning Wimbledon champion Barbora Krejcikova of the Czech Republic 6-4 6-2 to become the first Slovak since Miloslav Mecir in 1988 to reach the semi-finals of the Olympic singles.\nZheng Qinwen ended the stellar career of Germany's Angelique Kerber in a titanic tussle to emulate Li Na who reached the semi-finals of singles at the Beijing Games in 2008.\nZheng failed to convert three successive match points in the third set as veteran Kerber clung on grimly in stifling heat but eventually prevailed 6-7(4) 6-4 7-6(6) -- collapsing to the red clay in disbelief as Kerber's last shot struck the net.\nThree-time Grand Slam champion Kerber announced last week she would retire after the Paris event.\nSwiatek was in control as she won the opening set 6-1 but went off the boil to lose the second 6-2 against an aggressive Collins. The Pole was struck by a ball early in the decider but regained her composure to lead 4-1, at which point eighth seed Collins decided she could not continue.\nFor all his 24 Grand Slam titles and countless accolades, the Olympics has never been especially kind to the 37-year-old Djokovic and a bronze medal remains his only souvenir.\nBut he looks in the mood to fill the only unoccupied space in his bulging trophy cabinet and is yet to drop a set.\nAfter the emotions and hyperbole of Djokovic's previous round against his claycourt nemesis Rafa Nadal, the atmosphere on a muggy centre court was more sedate as he comfortably dispatched 30-year-old Koepfer after some initial trouble.\nKoepfer was matching the Serb until 5-6 in the first set when he played two bad points to hand over the opener and from then on Djokovic was comfortable as notched his 16th career singles win at the Olympics -- the most by any player since tennis returned to the Games in 1988.\nStanding in the way of Djokovic and a fourth Olympic singles semi-final is eighth seed Tsitsipas who beat Argentina's Sebastian Baez. The last time they met at Roland Garros was in the French Open final in 2021 when Tsitsipas was two sets ahead before succumbing in five.\n\"I don't expect anything less than a big fight and a tight match,\" Djokovic said of Thursday's clash. \"The goal is to get to the finals and have a battle for that gold.\"\nGames debutant Alcaraz has also been untroubled en route to the quarter-finals as he seeks to follow his French Open and Wimbledon titles with Olympic gold.\nHe was too good for Safiullin and powered to victory before preparing for his men's doubles quarter-final with Rafa Nadal later on Court Philippe Chatrier.\nNorway's Casper Ruud will be eyeing a medal as the fifth seed beat Francisco Cerundolo of Argentina to set up a quarter-final with Canada's Felix Auger-Aliassime who finally broke his losing run against Russia's Daniil Medvedev, beating the fourth seed 6-3 7-6(5) having lost their previous seven meetings.\nThere were mixed fortunes for Americans on day five of the tournament as Tommy Paul ended French hopes of a medal by beating Corentin Moutet 7-6 6-3 but doubles partner Taylor Fritz could not join him in the last eight, going down 6-4 7-5 to Italy's Lorenzo Musetti.\nThere was more disappointment for Coco Gauff as the young American and partner Jessica Pegula, the top seeds, lost in the second round of the women's doubles to Czech pair Karolina Muchova and Linda Noskova. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/tennis-djokovic-reaches-quarter-finals-in-ominous-fashion"}