{"authors": [], "date_download": "2024-10-12 14:16:13", "date_modify": "2024-10-12 14:16:13", "date_publish": "2024-02-17 18:27:04", "description": "McLaren's team principal said he expected Red Bull to start the season still “enjoying some advantage”. Read more at straitstimes.com.", "filename": "sport_formula-one_red-bull-s-new-car-may-have-moved-the-goalposts-again_1728742573.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/17/LYNXNPEK1F0IS-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_red-bull-s-new-car-may-have-moved-the-goalposts-again_1728742573.html", "title": "Red Bull’s new car may have moved the goalposts again", "title_page": "Red Bull’s new car may have moved the goalposts again | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Formula One teams head into testing with some trepidation in Bahrain, amid fears Red Bull may have again stolen a march with an aggressive evolution of the most dominant car of all time.\nThe champions’ launch of their 2024 challenger, the RB20, on Feb 15 will not have provided much comfort for rivals still playing catch up from last season when Red Bull won 21 of 22 races.\n“There will be a few other teams’ technical departments going ‘holy shit’, where do we go from here?,” commented former Jordan, Stewart and Jaguar designer Gary Anderson on www.the-race.com.\nMcLaren team principal Andrea Stella said he expected Red Bull to start the season in Bahrain on March 2 still “enjoying some advantage”, because they had been able to switch their focus to the new car early in 2023.\nRed Bull’s triple world champion Max Verstappen said his reaction on seeing the first drawings at the end of last season was “Wow, that’s quite different”.\nThe main focus concerned the new-look Red Bull sidepods, now with tall and slim vertical radiator inlets that looked similar to those attempted and ultimately abandoned by former champions Mercedes last season.\nTeam principal Christian Horner said the car was an evolution of the RB19, but acknowledged it was not conservative and contained real innovation. He said the changes were driven by performance based on simulation tools.\n“You can see they’ve been quite aggressive in certain areas and still pushing the boundaries, conscious that our opponents are still going to be pushing very hard,” he said at the presentation.\n“Some of the detail on the car is absolutely exquisite.”\nStar designer Adrian Newey said the team had made improvements to all areas – mechanical, vehicle dynamics and aerodynamics.\n“Is that enough? Who knows. That’s the thing about Formula One,” he said.\n“We know roughly what we’ve done from the shakedown at Silverstone, from what we can tell it’s behaved as we expect it to but that’s no guarantee of anything. It could be that some other team has made a bigger jump than us.\n“Last year’s car really was a total surprise in terms of its dominance.”\nThe fear is that Red Bull may have moved to another level of development while rivals – some of whom have said openly that they consider the champions to be vulnerable – launched cars clearly influenced by the RB19.\nAston Martin’s technical director Dan Fallows had said he considered Red Bull to be “absolutely beatable”.\nWhile McLaren driver Lando Norris agreed, he admitted: “The question is can we beat them over a season because... that’s going to be very difficult to do with how well they are performing.”\nRed Bull’s Mexican driver Sergio Perez, meanwhile, said: “I believe we’ve made some good steps in the right direction, so it should be another great season for the team.”\nTeams have three days of testing in Bahrain from Feb 21 to 23 before the opening race on March 2.\n“It’s a bit like waiting for Christmas. It is exciting,” said Mercedes technical director James Allison of the pre-season “phoney war” period and the uneasy mix of anticipation and trepidation.\n“You want it to arrive, and you want the days to fly by. You also know that the Christmas Day opening of those presents might not bring you all the good fortune you wish for.\n“It’s not a relaxing time of year, but it is very exhilarating.” REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/red-bull-s-new-car-may-have-moved-the-goalposts-again"}