{"authors": [], "date_download": "2024-10-12 14:03:01", "date_modify": "2024-10-12 14:03:01", "date_publish": "2024-06-02 18:20:48", "description": "The world No. 1 lost only 10 points in the shortest match of her career. Read more at straitstimes.com.", "filename": "sport_tennis_swiatek-demolishes-potapova-in-40-minutes-to-reach-french-open-quarter-finals_1728741781.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/02/LYNXMPEK5103X-1.jpg?VersionId=nR3gsTm7KfcRo40NN2D_PwRRXsConVHj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_swiatek-demolishes-potapova-in-40-minutes-to-reach-french-open-quarter-finals_1728741781.html", "title": "Iga Swiatek demolishes Anastasia Potapova in 40 minutes to reach French Open quarter-finals", "title_page": "Iga Swiatek demolishes Anastasia Potapova in 40 minutes to reach French Open quarter-finals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – World No. 1 Iga Swiatek continued her relentless march to a fourth French Open title with a 6-0, 6-0 demolition of former junior rival Anastasia Potapova in 40 minutes to reach the quarter-finals at Roland Garros after the shortest match of her career on June 2.\nPotapova was in uncharted territory, playing in the second week of a Grand Slam for the first time in her career, and Swiatek took full control of the play, giving the Russian no time to breathe between a flurry of points.\nSuch was the top seed's domination that Potapova won only 10 points in the encounter, as Swiatek extended her winning streak on clay to 16.\n“It went pretty quickly,” said the Pole. “I was really focused and in the zone. I wasn’t looking at the score so I continued working on my game.”\nThe pair had met before at the junior level, where Potapova had come out on top in what Swiatek described as “heartbreaking matches” but in their first meeting as professionals, the Russian was truly outclassed.\n“I had just a thought that times change a little bit because I remember she was always the player to beat me. I don’t think I won against her... We always played against each other (at) European championships,” said Swiatek of the battle of 23-year-olds.\n“Honestly, there’s no point thinking about that, but I had just a thought. It lasted two seconds and then I was focusing on my work because that’s the best thing I can do.\n“I’m just proud of myself and the work that I’ve put to be in this place. Everything changed because I’m just older and I play better.”\nPotapova attacked Swiatek’s serve on the odd occasion to claim a couple of winners, earning some warm applause from a crowd eager to see a contest.\nBut Swiatek’s near-perfect performance from the baseline and at the net left Potapova with no answers as the top seed wrapped up the first set in 19 minutes.\nThe crowd inside Court Philippe-Chatrier tried their best to encourage Potapova but Swiatek looked at ease, forcing her opponent into several mistakes as she consolidated her early break.\nThe only problem Swiatek had was the swirling wind on serve, with the roof finally left open after several days of rain.\n“I have someone in my team who is a sailor, so I know a little bit about the wind,” Swiatek said.\nShe eventually put Potapova out of her misery with her sixth break of serve and the crestfallen world No. 41 made a hasty exit from the court.\nSwiatek will next face Marketa Vondrousova in the quarter-finals after the fifth seed dispatched Serbian qualifier Olga Danilovic 6-4, 6-2.\nCoco Gauff took longer than Swiatek but she made light work of Elisabetta Cocciaretto, sweeping past the world No. 51 from Italy 6-1, 6-2 in an hour. Cocciaretto had taken down two seeds to reach the last 16 of a Major for the first time but was no match for the third seed and 2022 French Open runner-up.\n“This week I feel like I’ve been managing and playing well,” said Gauff. “It’s definitely, I feel, also tough conditions to play in. It’s just really slow and muggy.”\nIn the quarter-finals, Gauff, who is bidding to become the first American to win at Roland Garros since Serena Williams in 2015, will face Tunisia’s Ons Jabeur, who beat Dane Clara Tauson 6-4, 6-4.\nIn the men’s draw, third seed Carlos Alcaraz had little trouble in beating Felix Auger-Aliassime, sealing a 6-3, 6-3, 6-1 victory over the Canadian to move into the quarter-finals, where he will face Stefanos Tsitsipas.\nGreek ninth seed Tsitsipas overcame an early blip to beat Italy’s Matteo Arnaldi 3-6, 7-6 (7-4), 6-2, 6-2 on Court Suzanne-Lenglen. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/tennis/swiatek-demolishes-potapova-in-40-minutes-to-reach-french-open-quarter-finals"}