{"authors": [], "date_download": "2024-10-12 14:18:15", "date_modify": "2024-10-12 14:18:15", "date_publish": "2024-06-16 07:21:31", "description": "Toyota led the 24 Hours of Le Mans endurance race after nine hours on Sunday with Japanese driver and 2022 winner Ryo Hirakawa at the wheel of the number eight car. Read more at straitstimes.com.", "filename": "sport_formula-one_toyota-lead-24-hours-of-le-mans-into-the-morning_1728742695.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/16/11414506.jpg?VersionId=bHhJWWiM2tXIHL0Uh6lcTI19y_xoX9QH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_toyota-lead-24-hours-of-le-mans-into-the-morning_1728742695.html", "title": "Toyota lead 24 Hours of Le Mans into the morning", "title_page": "Toyota lead 24 Hours of Le Mans into the morning | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Toyota led the 24 Hours of Le Mans endurance race after nine hours on Sunday with Japanese driver and 2022 winner Ryo Hirakawa at the wheel of the number eight car.\nPoland's Robert Kubica, driving a Ferrari for the satellite AF Corse team, had enjoyed a spell at the front in a tight battle with the two factory Ferraris and the Penske Porsches.\nThe former F1 driver led after eight hours but dropped back after a clash at the end of the Mulsanne straight with the number 15 BMW driven by Dries Vanthoor that hit the barriers and retired.\nRain, with showers forecast until the morning, led to tricky conditions at the Sarthe circuit and difficult decisions on tyres.\nThe 92nd edition of the race was flagged away by French soccer great Zinedine Zidane, with the number six Porsche Penske on pole position in a field of 62 cars watched by a crowd of more than 300,000.\nFerrari dominated the first hour with Nicklas Nielsen in the number 50 car taking the early lead, before a 10-second penalty for an unsafe release from the pits.\nRenault-owned Alpine lost both their hypercars as night fell with the number 35 catching fire at Arnage after nearly five hours of racing and the 36 car also having to retire with engine trouble.\nItalian motorcycle great Valentino Rossi was competing in the LMGT3 class.\nThe race, fourth round and jewel in the crown of the world endurance championship, ends at 1600 local time (1400 GMT) on Sunday.\nFerrari won Le Mans last year for the Italian marque's first overall victory in 58 years. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/toyota-lead-24-hours-of-le-mans-into-the-morning"}