{"authors": [], "date_download": "2024-10-12 13:52:42", "date_modify": "2024-10-12 13:52:42", "date_publish": "2024-01-16 18:17:12", "description": "Tajikistan coach Petar Segrt said on Tuesday the Asian Cup debutants will take the game to hosts and defending champions Qatar in their second Group A match, aiming to earn the three points as well as the respect of the home fans. Read more at straitstimes.com.", "filename": "sport_football_asian-cup-minnows-tajikistan-plan-to-go-on-offensive-against-qatar_1728741162.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/16/LYNXMPEK0F0CR-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_asian-cup-minnows-tajikistan-plan-to-go-on-offensive-against-qatar_1728741162.html", "title": "Asian Cup minnows Tajikistan plan to go on offensive against Qatar", "title_page": "Asian Cup minnows Tajikistan plan to go on offensive against Qatar | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA - Tajikistan coach Petar Segrt said on Tuesday the Asian Cup debutants will take the game to hosts and defending champions Qatar in their second Group A match, aiming to earn the three points as well as the respect of the home fans.\nTajikistan gave a good account of themselves in their group opener when they drew 0-0 with China, earning praise for how they held up against a team 27 spots above them in the rankings.\nAlthough the coach was happy with the point, he said he wished the game had ended \"2-2 or 3-3\" instead and hopes to see his team score their first goal in the competition against Qatar at Al Bayt Stadium on Wednesday.\n\"It is not the character of Tajikistan people to play defence, the character is to play attack ... Every country, every culture has its character and for us, in this situation, we will also try to play our football against Qatar,\" the Croatian told reporters.\n\"But we must also respect that Qatar is much stronger than China and Qatar has a lot of very great players. And I don't know how big the influence of the spectators will be.\n\"All the players in the first game were only happy to be here. Now they see that maybe we can have a good result.\"\nSegrt also launched a charm offensive, praising Qatar and its people, hoping to win over the supporters with the vast majority of fans at the 68,895 capacity stadium ready to root for the hosts.\n\"The culture of Qatar is very friendly but for 90 minutes you must excuse us. I know that most of them will support Qatar in the beginning, but I hope that at the end that they will also respect (us) and give us sympathy and applause,\" he said.\n\"We will try to play our maximum football and after the game I will be not unhappy when we have four points, but what is more important is how we play because it was working against China and we are playing with much more self-confidence.\"\nFor Qatar coach Marquez Lopez, the strategy is to get an early goal to control the game.\n\"Success in attack would help a great deal but we must not forget that Tajikistan could create dangerous opportunities,\" the Spaniard said.\n\"We will use all tools available to score as early as possible so the match doesn't become complex.\n\"The objective is to stay top of the table but the most important objective is to move to the second round.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/asian-cup-minnows-tajikistan-plan-to-go-on-offensive-against-qatar"}