{"authors": [], "date_download": "2024-10-12 13:40:46", "date_modify": "2024-10-12 13:40:46", "date_publish": "2024-08-08 04:01:45", "description": "PARIS - Australia's Nina Kennedy soared to the gold medal in the Olympic women's pole vault on Wednesday, a year after she shared top spot on the world championship medal podium with American rival Katie Moon. Read more at straitstimes.com.", "filename": "sport_athletics-australias-kennedy-soars-to-womens-pole-vault-title_1728740446.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/LYNXMPEK760XD-1.jpg?VersionId=Ut4NtOvavdseIs4SxigEii7kw0.n7eCQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_athletics-australias-kennedy-soars-to-womens-pole-vault-title_1728740446.html", "title": "Athletics-All mine this time, Australian Kennedy soars to pole vault title", "title_page": "Athletics-All mine this time, Australian Kennedy soars to pole vault title | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Australia's Nina Kennedy soared to the gold medal in the Olympic women's pole vault on Wednesday, a year after she shared top spot on the world championship medal podium with American rival Katie Moon.\nThe 27-year-old Kennedy, the first Australian woman to win the event, cleared a season's best 4.90 metres, fiercely pumping her fist several times after another epic battle with Moon.\n\"I wanted that outright gold medal,\" Kennedy told reporters. \"I didn't want to share it this time. I became really confident in talking to the media, it was really scary, really vulnerable, to lay it all out there. I’m just really happy I got the job done.\"\nMoon, the Tokyo gold medallist and two-times world champion, cleared 4.85m to claim silver. Canada's Alysha Newman went over the same height but was awarded bronze due to more missed jumps.\nKennedy and Moon decided to share gold at last year's world championships in Budapest after they both vaulted 4.90m. Moon defended the decision after scathing criticism on social media, saying the danger of vaulting increases as fatigue sets in.\nKennedy made sure there was no sharing on Wednesday at Stade de France, failing on her first attempt at 4.70 before flying over the next three heights with ease.\nAfter Kennedy's successful attempt at 4.90, Moon's only chance to steal victory was by clearing 4.95 but they both failed at that height.\nKennedy said she had a sneaking suspicion victory was in the bag after she cleared 4.90.\n\"I knew first-attempt clearances at those high bars were going to take the gold. I put all my focus into that exact second, and that's how I won,\" she said.\nHer victory was some redemption for the Tokyo Olympics in which a serious quadriceps injury contributed to her elimination in the preliminary round.\nSince winning the 2018 Commonwealth Games title, the 30-year-old Newman had a string of frustrating seasons, punctuated by a serious concussion suffered in 2021.\n\"It wasn't just my mental health, I had brain problems. I had a brain health issue,\" said Newman, adding her neurologist was in the crowd on Wednesday.\n\"I wasn't happy. I didn't like the sport at that time, and it was a struggle for me. I needed to step away. I learned to love track again.\" REUTERS", "url": "https://www.straitstimes.com/sport/athletics-australias-kennedy-soars-to-womens-pole-vault-title"}