{"authors": [], "date_download": "2024-10-12 14:10:41", "date_modify": "2024-10-12 14:10:41", "date_publish": "2024-09-02 14:09:55", "description": "Yevhenii Korinets joined the army as a paramedic when Russia’s full-scale invasion started in 2022, but later lost his left leg. Read more at straitstimes.com.", "filename": "sport_paralympics-ukraine-wont-stop-fighting-adrenaline-fuelled-war-amputee-says_1728742241.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/LYNXMPEK81056-1.jpg?VersionId=16euGXLZJ_TA2hhMQIyY5iTlJznug7rL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_paralympics-ukraine-wont-stop-fighting-adrenaline-fuelled-war-amputee-says_1728742241.html", "title": "Ukraine won’t stop fighting, says adrenaline-fuelled war amputee Paralympian", "title_page": "Ukraine won’t stop fighting, says adrenaline-fuelled war amputee Paralympian | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Yevhenii Korinets is an adrenaline-fuelled man on a mission. Even if Ukraine are out of medal contention in sitting volleyball at the Paralympics, the war amputee is in Paris to deliver a message – his country will not stop fighting, on and off the battlefield.\nKorinets joined the army as a paramedic when Russia’s full-scale invasion started in February 2022. The former physiotherapist became one of thousands left with life-altering injuries when he was wounded in a fierce battle near the eastern city of Bakhmut in March 2023 and had his left leg amputated at the hip.\nSport helped him get his life back on track.\n“The most difficult time was the initial stages after the injury because the pain was severe and had to be managed with medication. The first two to three months were particularly tough,” the bulky, baby-faced 25-year-old said.\nA former volleyball player, Korinets had connections and skills that helped him make his way to the Ukrainian Paralympic team for Paris 2024.\n“Sport helped me very much. As I always say, war is the biggest drug in the world. When you experience the adrenaline of military action, you want to feel it again,” he explained.\n“Sport brings similar adrenaline, similar emotions. It’s not the same, but it’s close. For me, it’s rehabilitation – both physical and moral.\n“The team are like brothers-in-arms who support you on the front line. If one of us falls out, the whole game can be ruined, the whole training process. We are one team, one family. It’s the same as on the front line.”\nIn Paris, Ukraine lost their first two pool games against Iran and Germany. They have one more to play against Brazil before going into the classification matches.\nWhile he has been enjoying the Games, and the support of fellow athletes, Korinets is upset that some Russian and Belarusian athletes have been allowed to compete in Paris.\n“Of course, I want to go (to the next Paralympics) and represent my country. I like it here, but there are some things I don’t like,” he said.\n“For example, there are athletes from the country that attacked us, and we don’t really accept this. We don’t like it.”\nRussian and Belarusian athletes can compete only as neutrals without flags, after their participation in global sports events was severely curtailed following the invasion.\n“We feel solidarity with athletes from other countries. Our uniforms are quite similar to the Brazilian team’s. People often ask us who we are, and we say ‘Ukraine’,” Korinets said.\n“They are surprised and very happy for us. Germany also shows solidarity with us, as do the French. So many countries here understand us. I even saw some athletes from another country, though I don’t remember which one, looking at those neutral athletes with disdain.”\nKorinets, however, remains focused on his mission.\n“Even under such circumstances as our country is facing, we continue to fight for our freedom, not only on the battlefield but also on the sports field. Because by competing, we show the strength and spirit we have,” he said.", "url": "https://www.straitstimes.com/sport/paralympics-ukraine-wont-stop-fighting-adrenaline-fuelled-war-amputee-says"}