{"authors": [], "date_download": "2024-10-12 14:16:54", "date_modify": "2024-10-12 14:16:54", "date_publish": "2023-10-09 03:00:24", "description": "The victory from pole position under the Lusail floodlights was a 14th in 17 races. Read more at straitstimes.com.", "filename": "sport_formula-one_verstappen-adds-race-win-to-his-qatar-title-weekend_1728742614.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/09/LYNXMPEJ970BO-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_verstappen-adds-race-win-to-his-qatar-title-weekend_1728742614.html", "title": "Verstappen adds race win to his Qatar title weekend", "title_page": "Verstappen adds race win to his Qatar title weekend | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA - Max Verstappen took his first win as a triple Formula One world champion on Sunday after dominating a Qatar Grand Prix peppered with pitstops and penalties for a rash of track limit violations.\nThe victory from pole position under the Lusail floodlights was a 14th in 17 races, and career 49th, for the 26-year-old Red Bull driver who clinched his third successive title in a Saturday sprint.\nAustralian rookie Oscar Piastri, winner of that 19-lap sprint, finished second with McLaren team mate Lando Norris third in what became a three-stop race after Pirelli warned of the risk of blowouts.\n“It was a bit close for comfort I think in that last stint. But pace was OK. Another win, unbelievable,” said Verstappen, who finished 4.8 seconds clear of Piastri.\nThe relatively slim gap flattered the Australian, with Verstappen never looking like he was under any pressure and also setting fastest lap.\n“That was a proper quality drive,” team boss Christian Horner told his champion over the radio.\nThere was drama even before the cars had lined up on the grid when Ferrari’s Carlos Sainz, who ended Red Bull’s 100 per cent win record with victory in Singapore last month, was ruled out by a fuel system problem.\nIt continued seconds after the start when Mercedes team mates George Russell and Lewis Hamilton collided at the first corner, with the latter accusing the younger Briton of taking him out.\nHamilton later calmed down and said he did not consider his team mate at fault.\nRussell, who had started second and made four pitstops in all, ended up fourth with Ferrari’s Charles Leclerc fifth and Aston Martin’s Fernando Alonso sixth.\nEsteban Ocon was seventh for Alpine with the Alfa Romeo pair of Valtteri Bottas and Guanyu Zhou eighth and ninth and Red Bull’s Sergio Perez demoted to 10th after a five-second post-race penalty for exceeding track limits multiple times.\nVerstappen, now 209 points clear of Perez at the top of the standings, led cleanly from pole position and raced away unchallenged.", "url": "https://www.straitstimes.com/sport/formula-one/verstappen-adds-race-win-to-his-qatar-title-weekend"}