{"authors": [], "date_download": "2024-10-12 13:42:26", "date_modify": "2024-10-12 13:42:26", "date_publish": "2024-01-18 05:55:41", "description": "Both clubs were this week charged by the EPL for alleged breaches of profitability and sustainability rules. Read more at straitstimes.com.", "filename": "sport_football_everton-edge-past-palace-to-reach-fa-cup-fourth-round_1728740546.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/18/LYNXMPEK0G0V9-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_everton-edge-past-palace-to-reach-fa-cup-fourth-round_1728740546.html", "title": "Everton edge past Crystal Palace to reach FA Cup fourth round, Nottingham Forest also through", "title_page": "Everton edge past Crystal Palace to reach FA Cup fourth round, Nottingham Forest also through | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Beleaguered Everton and Nottingham Forest found some cheer in a troubling week for both clubs as they ground out “tough” victories over Crystal Palace and Blackpool respectively in FA Cup third-round replays on Jan 17.\nAn Andre Gomes free kick earned the Toffees a 1-0 home win against Palace at a freezing Goodison Park.\nForest were given a rough ride at third-tier Blackpool but eventually won 3-2 in extra time.\nEverton’s reward is a home tie against fellow English Premier League strugglers Luton Town, while Forest will visit Bristol City, who knocked out top-flight West Ham United on Jan 16.\nBoth Everton and Forest were this week charged by the Premier League for alleged breaches of profitability and sustainability rules, Everton’s second charge this season, the first of which resulted in a 10-point penalty, which the club are appealing against.\nA large crowd braved the cold and their team, putting aside all the off-pitch distractions, rewarded their fans with a dogged performance, with Gomes curling in a free kick three minutes before the interval.\nIt was Everton’s first goal since Dec 27 – when they lost 3-1 to Manchester City – after three scoreless outings.\nRemarkably, it was also their first goal from a direct free kick in 197 games, dating back to 2019.\n“These bits of news coming out are tough. Tough for the Evertonians, tough for the club and tough for myself and the team,” Everton boss Sean Dyche said of the alleged financial breaches.\n“But the mentality has been resolute all season, the way the players are going about it. We still looked solid and energised, and found a way to win the game.”\nPalace enjoyed the best of the goal-scoring chances but were thwarted on several occasions by Everton goalkeeper Joao Virginia, who was deputising for Jordan Pickford.\nFor classic FA Cup fare, however, the place to be was Blackpool’s Bloomfield Road.\nForest appeared to be cruising into the next round when midfielder Danilo punished a mistake by Daniel Grimshaw just after the break to double the lead given to them by Andrew Omobamidele in the 16th minute.\nBut Blackpool began to throw caution to the wind and when Albie Morgan halved the deficit after some poor Forest defending, the tie suddenly burst into life.\nKyle Joseph headed in from close range to make it 2-2 in the 78th minute and Blackpool should have won it deep in stoppage time, when Karamoko Dembele rounded goalkeeper Odysseas Vlachodimos but delayed his shot and Orel Mangala made a goal-saving interception.\nChris Wood then got Forest back in front with a close-range finish from a Ryan Yates cross in the first half of extra time, and this time the visitors held on to their lead.\n“We cannot take credit away from them. We had our problems, but a lot of credit goes to Blackpool,” said Forest boss Nuno Espirito Santo.\n“This is the magic of the FA Cup. That’s why I love it, because it is one chance for everybody.\n“It was tough, but we did the job. We could have done better and we made mistakes that allowed Blackpool to get back in the game, but in extra time we showed that we deserved the victory.”\nChampionship side Norwich City, meanwhile, set up a fourth-round clash away to Premier League leaders Liverpool as they came from a goal down to win 3-1 at third-tier Bristol Rovers.\nFacing Liverpool means a reunion between Reds manager Jurgen Klopp and his friend and fellow German David Wagner, the boss of Norwich.\n“I haven’t checked my messages yet, but I wouldn’t be surprised if Jurgen has already been in touch now that we’re through,” said Wagner, who was a teammate of Klopp at Mainz and best man at his wedding. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/football/everton-edge-past-palace-to-reach-fa-cup-fourth-round"}