{"authors": [], "date_download": "2024-10-12 14:10:15", "date_modify": "2024-10-12 14:10:15", "date_publish": "2024-07-16 17:34:47", "description": "The star point guard scored just three points in 21 minutes during the US’ 98-92 friendly win over Australia. Read more at straitstimes.com.", "filename": "sport_basketball_nba-star-stephen-curry-says-playing-for-the-us-an-adjustment-after-warm-up-win_1728742215.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/16/11480332.jpg?VersionId=hhCsIt7xKRe2svT9ZKfkgNAXPfIwGcUx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_nba-star-stephen-curry-says-playing-for-the-us-an-adjustment-after-warm-up-win_1728742215.html", "title": "NBA star Stephen Curry says playing for the US an ‘adjustment’ after warmup win", "title_page": "NBA star Stephen Curry says playing for the US an ‘adjustment’ after warmup win | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ABU DHABI – Stephen Curry admitted playing on a stacked United States Olympic team where he is not expected to carry the offence like he does with the Golden State Warriors in the National Basketball Association (NBA) is requiring a great deal of adjustment.\nThe star point guard scored just three points in 21 minutes during the US’ 98-92 win over Australia in a warmup game in Abu Dhabi on July 15 that saw the Americans almost blow a 20-point lead in the last 15 minutes.\nLos Angeles Lakers centre Anthony Davis came off the bench to lead the scoring for the US with 17 points while grabbing 14 rebounds. Minnesota Timberwolves’ Anthony Edwards added 14 points, four rebounds and two assists.\n“It’s an adjustment, not just for me, for everybody. Even how we’re rotating the line-ups right now, just because we’re trying to get a feel for different combinations,” said Curry, who will be making his Games debut in Paris this summer.\n“You’re going five minutes at a time, then you sit. Hockey subs, that’s different, how we’re playing with the talent around, that’s a different adjustment. It’s just a mindfulness of knowing where your shots might come and being ready for those.”\nCoach Steve Kerr had said before the game he planned on testing out different starting line-ups during these exhibition games and he tweaked the first unit he used in the 86-72 victory over Canada on July 10.\nHe kept LeBron James, Curry, and Joel Embiid, but started Edwards and Jayson Tatum instead of Jrue Holiday and Devin Booker.\nDavis, Booker, Holiday, Bam Adebayo, and Tyrese Haliburton served as the second unit that alternated with the starters throughout the game.\nKevin Durant remains sidelined with a calf strain.\nAustralia’s Jock Landale, Josh Giddey and Dyson Daniels all finished in the double digits and combined for 51 points.\nKerr said the game on July 15 – the second of five friendlies that the US will play before the Olympics – was a welcome warning against complacency and a reminder the team cannot take their foot off the gas pedal after building big leads.\nNext up for them is an exhibition clash on July 17 in Abu Dhabi against Serbia, who will be led by reigning NBA Most Valuable Player Nikola Jokic of the Denver Nuggets.\nJokic and his Serbian teammates were in the stands and watched the first half of the US-Australia game.\n“They’re a great team. They’re in our pool in Paris and we’re going to have to beat them when it counts in a couple of weeks, but it’ll be good to get a good feel for what we’re going to face,” said Curry of the 2023 World Cup silver medallists.\n“They have a very strong, big, physical team and we have to match that physicality and be able to play Team USA basketball. It would be good to get some film on it too.” AFP", "url": "https://www.straitstimes.com/sport/basketball/nba-star-stephen-curry-says-playing-for-the-us-an-adjustment-after-warm-up-win"}