{"authors": [], "date_download": "2024-10-12 14:10:14", "date_modify": "2024-10-12 14:10:14", "date_publish": "2024-07-13 23:40:01", "description": "Coach Steve Kerr downplayed Durant’s calf injury that has kept him away from training. Read more at straitstimes.com.", "filename": "sport_basketball_usa-basketball-star-durant-going-to-be-okay-for-olympics_1728742214.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/13/2024-04-29T024656Z1311790263MT1USATODAY23140866RTRMADP3NBA-PLAYOFFS-MINNESOTA-TIMBERWOLVES-AT-PHOENIX-SUNS.JPG?VersionId=0YuNJtk.zZ97i5719XrS7wuEsUVvSTfM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_usa-basketball-star-durant-going-to-be-okay-for-olympics_1728742214.html", "title": "US basketball star Kevin Durant ‘going to be okay’ for Olympics", "title_page": "US basketball star Kevin Durant ‘going to be okay’ for Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ABU DHABI – United States men’s basketball team coach Steve Kerr has downplayed Kevin Durant’s calf injury that has kept the three-time Olympic gold medallist from training with the group ahead of the Paris Games.\nTeam USA touched down in Abu Dhabi on July 12 ahead of two exhibition games against Australia (July 15) and Serbia (July 17) as they ramp up their preparations for Paris.\nDurant, who suffered a calf strain two weeks ago, was present at a July 13 session at the New York University Abu Dhabi campus, but once again did not join his teammates in practice. Kerr remains unconcerned, though, and says they have not discussed any contingency plans to replace the Phoenix Suns forward on the roster.\n“He’ll continue to do individual work,” Kerr said in the United Arab Emirates capital on July 13.\n“I know there are still a couple of weeks before we have to make a decision roster-wise, so we’re just taking it day by day.”\n“It’s not something we’ve even discussed at this point,” Kerr said when asked about a backup plan. “Because we feel good that he’s going to be okay, it’s just day to day.”\nUSA Basketball has put together a “super team” for these Olympic Games that includes LeBron James, Stephen Curry, Durant, Anthony Davis, Anthony Edwards and recently crowned National Basketball Association (NBA) champions Jayson Tatum and Jrue Holiday of the Boston Celtics.\nBut they have already had to make a replacement in the squad, bringing in a third Celtic, Derrick White, to take the spot of Kawhi Leonard, who left training camp on July 10 in Las Vegas.\nThe Americans are playing five friendly games in the build-up to Paris, the first of which saw them defeat Canada 86-72 on July 10 at T-Mobile Arena in Las Vegas.\nJoel Embiid, the 2023 NBA Most Valuable Player, fouled out midway through the third quarter but Kerr is certain the Philadelphia 76ers centre will be up for the task of guarding all the big opponents they come up against at the Olympics.\n“Joel will be fine. He’s going to get into the rhythm and the flow,” he assured. “It always takes big guys a little bit longer to get into flow in training.”\nJames is playing under Kerr for the first time in his career and described the Golden State Warriors coach as a “true leader and true student of the game”.\nChasing a third Olympic gold and fourth medal overall, James, 39, is the oldest player on the roster.\nDonning a US jersey for the first time in 12 years, James is keen to share his experience with the younger players in the team, especially knowing that this will be his final Games. He said: “It’s always a responsibility that you should hold with honour and being able to give back to the younger generation because they have to keep going when we’re done.”\nBoasting their most star-studded squad since the fabled 1992 “Dream Team”, the US are gunning for a fifth consecutive Olympic gold medal and 17th men’s title at the Games overall. AFP", "url": "https://www.straitstimes.com/sport/basketball/usa-basketball-star-durant-going-to-be-okay-for-olympics"}