{"authors": [], "date_download": "2024-10-12 13:58:52", "date_modify": "2024-10-12 13:58:52", "date_publish": "2024-03-09 00:36:41", "description": "Italy's Matteo Manassero blitzed the course as he hit an 11-under-par 61 on Friday for a one stroke lead after the second round of the DP World Tour's Jonsson Workwear Open at the Glendower Golf Club. Read more at straitstimes.com.", "filename": "sport_golf_manasseros-best-ever-round-sees-him-into-glendower-lead_1728741532.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/09/LYNXNPEK270KK-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_manasseros-best-ever-round-sees-him-into-glendower-lead_1728741532.html", "title": "Manassero's 'best-ever round' sees him into Glendower lead", "title_page": "Manassero's 'best-ever round' sees him into Glendower lead | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Italy's Matteo Manassero blitzed the course as he hit an 11-under-par 61 on Friday for a one stroke lead after the second round of the DP World Tour's Jonsson Workwear Open at the Glendower Golf Club.\nA career low round for the 30-year-old over the Johannesburg course included two eagles and seven birdies and took him to a 15-under-par two round total of 129.]\nHe is one shot ahead of South Africa's Oliver Bekker and two up Tom McKibbin from Northern Ireland, Angel Hidalgo of Spain and his compatriot Ivan Cantero, the joint first round leader.\n\"I never even came close (previously) to touching 11-under so it's the best round I’ve had in my life. I couldn't be happier,\" Manassero said.\n\"It's a target golf course and if you put yourself in position and hit some good irons then (low) scoring is really possible,\" he added.\nManassero, who won his first European Tour event aged 17 and still holds the record for the youngest victor, is back on the tour after a five year absence having qualified again through last year's Challenge Tour.\nBekker hit a second successive 65, which included 10 birdies and three bogeys.\nHidalgo and McKibbin both carded eight-under 64s while Cantero hit two eagles in his 67, but bogeyed the second last hole. REUTERS", "url": "https://www.straitstimes.com/sport/golf/manasseros-best-ever-round-sees-him-into-glendower-lead"}