{"authors": ["Melvyn Teoh"], "date_download": "2024-10-12 13:40:48", "date_modify": "2024-10-12 13:40:48", "date_publish": "2024-09-02 22:21:21", "description": "He was among about 60 people who turned up for a watch party at the Singapore Sports Hub. Read more at straitstimes.com.", "filename": "sport_youth-boccia-athlete-aloysius-gan-among-those-inspired-by-jeralyn-tan-s-paralympic-silver-win_1728740448.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/2024090252046560taym4598.jpg?VersionId=2mbVNGa4glPZ0Ts4jHfpRlPzLbqyJXfq&h=11f638b8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_youth-boccia-athlete-aloysius-gan-among-those-inspired-by-jeralyn-tan-s-paralympic-silver-win_1728740448.html", "title": "Youth boccia athlete Aloysius Gan among those inspired by Jeralyn Tan’s Paralympic silver win", "title_page": "Youth boccia athlete Aloysius Gan among those inspired by Jeralyn Tan’s Paralympic silver win | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – While his senior Jeralyn Tan blazed a historic trail at the Paris Paralympics this week, national youth boccia player Aloysius Gan followed her progress every step of the way.\nAs the journey culminated with Tan’s landmark silver medal for Singapore on Sept 2, he could not help but feel inspired.\nThe 18-year-old was among a crowd of about 60 who were at a watch party organised by the Singapore Disability Sports Council (SDSC) at the Singapore Sports Hub for Tan’s women’s BC1 final in the afternoon.\nArmed with clappers and flags, they cheered Tan on as she played against home favourite Aurelie Aubert, and Gan screamed whenever she scored points.\nEven though she lost 5-4, Gan felt lifted by Tan, who became the first Singaporean to win a Paralympic boccia medal.\nHe said: “Jeralyn has been performing very well, making history by advancing into the final, and although she lost today, she has truly inspired us.\n“I hope that from her silver medal win, it would be an inspiration for people that, if you work hard, you can one day realise your dreams.”\nAlso among the crowd was Ling Ng, a volunteer with the Singapore National Paralympic Council in 2012.\nNg, who works as an accountant, took time off from work to show her support. The 34-year-old said: “I used to volunteer with SNPC, so I know that it’s happening now, and I decided to come and support. I actually went to see their (boccia) training grounds at Pasir Ris once.”\nDespite the short notice for the watch party – which was decided after Tan’s semi-final win on Sept 1 and announced the following morning – Ng felt it was a good turnout, because “not many people know about boccia”.\nThe majority of the crowd who came down to show their support are from the sports fraternity.\nGrainne Ang, 25, who works in the Singapore Sports Institute as an associate sports specialist, said that she had heard of the watch party over the public service announcement in the morning.\nShe said: “It’s exciting to support Singapore, and watch our athletes win medals. Para sports are still sports and we’ve got to support our Singapore athletes.”\nAng, who admitted that she did not know much about the sport before the Paralympics, said she gained a clearer idea after following Tan’s campaign.\nSDSC director Kelly Fan said: “It was a tough decision whether to host a watch party after a thrilling semis last evening.\n“On one hand, it would be a historical match for Singapore while on the other, we had very little time to pull it together.\n“But since members from our community were eager for it, we did our best and invited our athletes and supporters to join us.”\nFor Anparasy Muthusamy, who works in the data hub division of Sport Singapore, it was a no brainer to come down.\nShe said: “Our Singapore athlete is competing and it is quite historic. They go through so much to compete and to come up to this level, so I think the least we can do is to show our support.”\nFan added: “We really appreciated those who made it, to celebrate this special moment together as one Team Singapore.\n“We hope that the cheers will continue strong for our Paralympians for the rest of these Games, and beyond that.”", "url": "https://www.straitstimes.com/sport/youth-boccia-athlete-aloysius-gan-among-those-inspired-by-jeralyn-tan-s-paralympic-silver-win"}