{"authors": [], "date_download": "2024-10-12 13:42:58", "date_modify": "2024-10-12 13:42:58", "date_publish": "2024-04-02 10:41:31", "description": "The swimmer has not ruled out a career in politics after retiring from competitive sport. Read more at straitstimes.com.", "filename": "sport_joseph-schooling-the-politician-never-say-never_1728740578.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/02/2024040282112538img3740.jpg?VersionId=jp_liFRuosxo9a.yUpD95kfQp1tGnWuY", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_joseph-schooling-the-politician-never-say-never_1728740578.html", "title": "Joseph Schooling the politician? ‘Never say never’", "title_page": "Joseph Schooling the politician? ‘Never say never’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Olympic champion Joseph Schooling has not ruled out a post-swimming career in politics, saying “never say never” when asked the question during his press conference at the Chinese Swimming Club on April 2.\nThe 28-year-old, who won the 100m butterfly gold at the 2016 Rio Olympics, announced his retirement from competitive swimming on April 2, and plans to work in the “venture capital space” with two partners and focus on his swim school.\nWhen asked by The Straits Times whether politics figures in his future plans, Schooling laughed and said: “I mean, never say never.\n“But for right now, I am focused on the business ventures; on the personal side. If I am lucky enough one day to be in that spot, then so be it. You can’t put a limit on anything.\n“But... I am very happy playing golf, my swim school, and helping my mum out at the office. It’s my turn to be a normal kid... or a normal guy.”\nThe former national swimmer ends his career with an Olympic gold, two bronzes at the world championships, seven Asian Games medals (three golds, a silver, three bronzes), a silver at the Commonwealth Games and 29 golds at the SEA Games.", "url": "https://www.straitstimes.com/sport/joseph-schooling-the-politician-never-say-never"}