{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 13:43:59", "date_modify": "2024-10-12 13:43:59", "date_publish": "2023-09-23 23:14:33", "description": "This is the biggest-ever Games with about 12,500 athletes from 45 participating teams. Read more at straitstimes.com.", "filename": "sport_hangzhou-asian-games-kicks-off-with-glittering-ceremony_1728740639.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/23/2023092360095789img9731.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_hangzhou-asian-games-kicks-off-with-glittering-ceremony_1728740639.html", "title": "Hangzhou Asian Games kick off with glittering ceremony", "title_page": "Hangzhou Asian Games kick off with glittering ceremony | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANGZHOU – The city of Hangzhou and its gorgeous West Lake have inspired poets and painters throughout the centuries, and it is fitting that the “romantic city” will now headline the sporting spectacle that is the Asian Games.\nAfter a one-year delay owing to Covid-19, the Games officially opened on Saturday with a grand show that wowed the crowd at the 80,000-seater Hangzhou Olympic Sports Centre Stadium.\nThis has been the year of China’s reopening in the wake of the pandemic, after the 2022 Winter Olympic Games were held in Beijing with limited spectators.\nWith its theme, Tides Surging in Asia, a nod to the city’s natural landscapes and changing times, the two-hour ceremony mixed cutting-edge technology such as 3D animation and augmented reality with cultural elements that showcased the country’s rich cultural heritage.\nThe opening ceremony began with a water show set against a backdrop of 19 drums resembling water jade congs, an artefact from the archeological ruins of the ancient Liangzhu city.\nWith the event coinciding with the Autumn Equinox, which in Chinese culture is a time to celebrate harvest, the performance symbolised China’s role as host to some 12,500 athletes from 45 countries and territories.\nArmed with China flags and clappers, the crowd were vocal in their support for the teams who marched out during the athletes’ parade, with the loudest cheers reserved for the Chinese contingent, who will be looking to continue their dominance at the quadrennial Asian Games.\nHaving topped the medal table for the past 10 editions, China’s contingent of 886 athletes – including 36 Olympic champions like swimmer Zhang Yufei – will be gunning for honours on home soil. Other stars include table tennis world No. 1s Fan Zhendong and Chen Meng, and top-ranked female golfer Yin Ruoning.\nThe competition will also feature some of the region’s best athletes across 40 sports, including India’s world champion javelin thrower Neeraj Chopra and Thailand’s badminton world champion Kunlavut Vitidsarn.\nNew sports such as breaking, which will be making its debut at the Paris Olympics, will also feature. E-sports has also been added as a medal event for the first time – it was a demonstration event at the 2018 Jakarta Games.\nSingapore are represented by its largest-ever contingent of 431 athletes, and 91 were present at the opening ceremony on Saturday. With Singapore National Olympic Council acting president Jessie Phua cheering them on in the stands, they were led by flagbearers Jowen Lim (wushu) and Amita Berthier (fencing).\nBerthier, 22, said: “The opening ceremony was simply enthralling. Marching together with my fellow Team Singapore athletes felt amazing.”\nLim, 24, added: “Being the flagbearer is one of the best experiences I’ve had as an athlete... It has been a great start to the Games in Hangzhou and I’m hoping I can do Singapore proud.”", "url": "https://www.straitstimes.com/sport/hangzhou-asian-games-kicks-off-with-glittering-ceremony"}