{"authors": [], "date_download": "2024-10-12 14:00:25", "date_modify": "2024-10-12 14:00:25", "date_publish": "2024-08-06 19:46:05", "description": "PARIS - The three green, 81.7 square-metre badminton courts temporarily put down in the Porte de La Chapelle Arena in Paris have seen so much in the past 10 days. Read more at straitstimes.com.", "filename": "sport_badminton-love-tears-upsets-underdogs-paris-badminton-had-it-all_1728741625.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/06/LYNXMPEK750F5-1.jpg?VersionId=6owgstKcP7nUVuVPRt0bDvuc5KMMREQ7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_badminton-love-tears-upsets-underdogs-paris-badminton-had-it-all_1728741625.html", "title": "Badminton-Love, tears, upsets, underdogs: Paris badminton had it all", "title_page": "Badminton-Love, tears, upsets, underdogs: Paris badminton had it all | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The three green, 81.7 square-metre badminton courts temporarily put down in the Porte de La Chapelle Arena in Paris have seen so much in the past 10 days.\nThey are scarred, scratched and storied now with PV Sindhu's sweat, Tai Tzu-ying's blood, and Huang Yaqiong's happy tears when her teammate, Liu Yuchen, proposed to her minutes after she won mixed doubles gold with partner Zheng Siwei.\nFrom China's world number one Shi Yuqi's surprising loss to Thailand's Kunlavut Vitidsarn, to Malaysia's women's doubles team's brave bid for a medal, badminton at the Paris Olympics was characterised by upsets, plucky underdogs and, ultimately, reminders that some top seeds are there for a reason.\nDefending men's singles champion Viktor Axelsen kept his crown in the final, defeating world number eight Vitidsarn, whose silver was still Thailand's first badminton Olympic medal in history and first medal in Paris across all sports.\nTournament women's singles favourite South Korea's An Se-young won gold, as did women's doubles top seeds Jia Yifan and Chen Qingchen of China.\nChina, which had 20 Olympic badminton gold medals under its belt from previous Games and leaves Paris with 22, also came in second in both the women's singles and men's doubles events.\nTaiwan's Lee Yang and Wang Chi-Lin retained their men's doubles title in front of euphoric supporters from their country.\nPrior to the Olympics, Chinese success in Paris was virtually guaranteed, but the Games showed once again that anything can happen when the pressure to perform is at an all-time high.\nSouth Korea's An put it best when speaking to reporters after her gold medal win.\n\"There's no 100% guarantee in the Olympic Games -- there are so many variables,\" she said.\nThe variables resulted in shifting power dynamics between nations in Paris compared to previous Olympics.\nWhile China was the only country to win two golds and five badminton medals overall in Paris, others like Thailand, India and Malaysia shone in events they've never done particularly well in before to hint at bigger shifts to come. REUTERS", "url": "https://www.straitstimes.com/sport/badminton-love-tears-upsets-underdogs-paris-badminton-had-it-all"}