{"authors": [], "date_download": "2024-10-12 13:39:30", "date_modify": "2024-10-12 13:39:30", "date_publish": "2024-08-18 00:21:37", "description": "NOTTINGHAM, England - Bournemouth forward Antoine Semenyo rescued a point for his side with a late equaliser as they drew 1-1 at Nottingham Forest in the Premier League on Saturday. Read more at straitstimes.com.", "filename": "sport_football_bournemouth-salvage-late-draw-at-forest_1728740370.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/18/LYNXMPEK7G05E-1.jpg?VersionId=9sbecAOhigyJPBOVIXqEWyDNRZnJIfXM", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_bournemouth-salvage-late-draw-at-forest_1728740370.html", "title": "Semenyo salvages late draw for Bournemouth at Forest", "title_page": "Semenyo salvages late draw for Bournemouth at Forest | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NOTTINGHAM, England - Bournemouth forward Antoine Semenyo rescued a point for his side with a late equaliser as they drew 1-1 at Nottingham Forest in the Premier League on Saturday.\nForest took the lead in the 23rd minute when defensive midfielder Ryan Yates' close-range shot was parried by goalkeeper Neto and Chris Wood reacted quickly to slot the ball home.\nThe hosts looked comfortable but Bournemouth equalised in the 86th minute when Semenyo smashed the ball in from close range.\n\"I'm disappointed with how we concede, we had the game under control. It was a tough game, a good game, both teams had momentum. We could have had more,\" Forest manager Nuno Espirito Santo told the BBC.\n\"Chris Wood did well, he gives us another option. Overall, I am happy. It's the first game of the season. I am satisfied with the way we played and competed against a tough team.\"\nDango Ouattara thought he had equalised for Bournemouth from a corner in the first half, but the goal was disallowed after Video Assistant Referee (VAR) confirmed Lewis Cook was offside in the build-up.\nForest had created a host of chances to double their lead but lacked quality in the final third. Morgan Gibbs-White looked lively and nearly put Forest ahead with a right-footed shot.\nBournemouth, without last season's top scorer Dominic Solanke who joined Tottenham Hotspur last week, failed to test Forest goalkeeper Matz Sels for much of the game.\n\"I am probably pleased because you score at the end and you feel like you recovered one point,\" Bournemouth manager Andoni Iraola told the BBC.\n\"We probably had more chances, but from set-pieces, they are difficult. I think, in the end, it is fair.\n\"We didn't have a specific number nine and were changing a lot of times. I think we dealt quite well, right now we have to push and everyone has to adapt to the situation.\"\nForest's Brazilian midfielder Danilo was carried off on a stretcher 10 minutes into the game with what appeared to be a serious injury following a collision with Semenyo. REUTERS", "url": "https://www.straitstimes.com/sport/football/bournemouth-salvage-late-draw-at-forest"}