{"authors": [], "date_download": "2024-10-12 13:41:39", "date_modify": "2024-10-12 13:41:39", "date_publish": "2024-07-07 17:51:54", "description": "BERLIN - Turkey narrowly missed matching their best ever European Championship finish in Germany, but the team that arrived with little reason for optimism left with something that cannot be read in statistics -- respect. Read more at straitstimes.com.", "filename": "sport_football_montella-turkey-win-respect-with-entertaining-euro-2024-run_1728740499.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/07/LYNXMPEK6603O-1.jpg?VersionId=fZ7r5ugnmvFjfwMena8_Vj2fpb8hyCzN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_montella-turkey-win-respect-with-entertaining-euro-2024-run_1728740499.html", "title": "Montella, Turkey win respect with entertaining Euro 2024 run", "title_page": "Montella, Turkey win respect with entertaining Euro 2024 run | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - Turkey narrowly missed matching their best ever European Championship finish in Germany, but the team that arrived with little reason for optimism left with something that cannot be read in statistics -- respect.\nVincenzo Montella's men bowed out in Saturday's 2-1 quarter-final loss to the Netherlands after a late own goal, capping a string of high-octane performances that had made the Turks must-watch football as one of the tournament's most entertaining teams.\n\"I look at the future with much more confidence and clarity,\" Montella said. \"My opinion after this European Championship is that Turkey will be seen with different eyes in the future, probably with more respect.\"\nRoared on by one of the largest and loudest fan bases, Turkey provided plenty of thrills, which Montella chalked up to more than simply tactics and game plans. Turkey's rip-roaring run, he said, came because of his team's spirit.\n\"Everyone gave a bit extra in terms of their soul,\" Montella said after Turkey upended Austria in the last 16, firmly wresting the dark horse tag from the Austrians. \"You can only win matches such as these if there is a soul within the squad.\"\nThere was little reason for Turkey to be optimistic before the tournament kicked off. The Euro 2008 semi-finalists had failed to advance beyond the group stage of their previous two tournaments, and have not qualified for a World Cup since they finished third in 2002.\nThey also were winless in four friendlies this year, including a 6-1 thrashing by Austria that Montella called a stain on his career, making their last-16 revenge all the sweeter.\nThey played with hunger and heart that Dutch manager Ronald Koeman said made them a tough opponent.\nTough even playing without suspended captain Hakan Calhanoglu against Austria, and missing Merih Demiral in the quarter-finals. Calhanoglu was a puddle of tears after Saturday's loss.\n\"I'm proud of my team,\" the Inter Milan midfielder said. \"They played with great spirit, the Turkish spirit. We felt the love in spite of our defeat. The Turkish people loved us.\"\nDemiral scored both goals against Austria, but was fined and suspended for two games for his politically charged \"wolf\" goal celebration. The centre back for Saudi Pro League club Al-Ahli mimicked the shape of a wolf's head with his fingers, a symbol that has been linked to Turkey's far-right \"Grey Wolves\" group.\nDemiral's suspension seemed to weld Turkey together even more tightly, and against the Dutch they threw themselves at every ball as if their lives depended on it. It also galvanized their supporters.\nGermany is home to some 3 million Turks or people with Turkish roots, making them the country's largest ethnic minority, and their Euro matches felt like home games.\nTurkey's bookings, however, were also their downfall. They collected too many cards including a whopping 11 against Czechia, forcing three changes to the starting team against the Dutch.\nThe tournament also introduced 19-year-old Arda Guler to the world. The Real Madrid attacking midfielder nicknamed the \"Turkish Messi\" made an unforgettable Euro debut when he launched a left-footed rocket from distance into the net in their opener against Georgia.\nAt 19 years and 114 days, he broke Cristiano Ronald's record for youngest player to score on debut at the tournament. But more than that, Guler orchestrated Turkey's midfield with a poise and maturity that belied his age.\nBoth of Demiral's goals against Austria came from Guler corner kicks. It was fitting that Samet Akaydin's header against the Dutch came from a smooth Guler cross.\n\"He played a great Euros,\" Montella said. \"He hasn't played regularly at this level. He was born in 2005 - he's not 20 yet. This experience will make him a far better player.\"\nGuler will still only be 27 when Turkey and Italy co-host the 2032 edition of the tournament. REUTERS", "url": "https://www.straitstimes.com/sport/football/montella-turkey-win-respect-with-entertaining-euro-2024-run"}