{"authors": ["Nicole Chia"], "date_download": "2024-10-12 14:20:48", "date_modify": "2024-10-12 14:20:48", "date_publish": "2020-07-27 13:44:53", "description": "SINGAPORE - The Singapore leg of the Fina Swimming World Cup, scheduled for Sept 4-6, is the latest sporting event here to be cancelled as a result of the coronavirus pandemic. Read more at straitstimes.com.", "filename": "sport_swimming-fina-world-cup-singapore-leg-in-september-cancelled-due-to-covid-19_1728742848.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/07/27/rk_josephschooling_270720.jpg?VersionId=gg39bnqNyZEckp8jUszX0Y33dsICG1WT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_swimming-fina-world-cup-singapore-leg-in-september-cancelled-due-to-covid-19_1728742848.html", "title": "Swimming: Fina World Cup Singapore leg in September cancelled due to Covid-19", "title_page": "Swimming: Fina World Cup Singapore leg in September cancelled due to Covid-19 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The Singapore leg of the Fina Swimming World Cup, scheduled for Sept 4-6, is the latest sporting event here to be cancelled as a result of the coronavirus pandemic.\nThe Singapore Swimming Association (SSA) said on Monday (July 27) the decision was \"in response to the continued health concerns posed by Covid-19\".\nThe annual competition, which the Republic first hosted in 2007, attracts more than 6,000 spectators and nearly 200 international swimmers. Last year's event featured Singaporean Olympic champion Joseph Schooling and Hungarian star Katinka Hosszu, who has three Olympic golds and nine world titles.\nThe SSA said with the current Covid-19 situation prohibiting mass gatherings and imposing restrictions on world-wide travel, \"it is unattainable to hold the event this year as people's safety takes precedence\".\nSSA president Lee Kok Choy said the decision was made following discussions with Fina, swimming's international governing body, and national agency Sport Singapore.\n\"The health and safety of the fans, athletes and everyone involved in the running of the event is our highest priority and we are supportive of the nation's effort to minimise the transmission of the Covid-19 and protect our people,\" he added.\n\"We are hoping that the situation will get better and looking forward to hosting the event next year. To all our swimmers, officials and fans - stay safe and keep swimming.\"\nThe Singapore event was the first of six stops in the series, which has a total prize purse of US$2.5million (S$3.45 million).\nThe decision to cancel the meet was supported by the event's presenting sponsor Yakult Singapore and Fina president Julio C. Maglione, who said: \"Fina is well aware of the issues faced by aquatics athletes around the world, and their safety and well-being is of utmost concern and importance. We look forward to returning to Singapore in 2021.\"\nMajor sporting events here that have been cancelled include golf's HSBC Women's World Championship (February), the Sundown Marathon (May), football's International Champions Cup (July), Formula One's Singapore Airlines Singapore Grand Prix (September), and the HSBC Singapore Rugby Sevens (October).\nThe schedule for the Fina Swimming World Cup 2021 will be announced at a later date.", "url": "https://www.straitstimes.com/sport/swimming-fina-world-cup-singapore-leg-in-september-cancelled-due-to-covid-19"}