{"authors": [], "date_download": "2024-10-12 14:16:11", "date_modify": "2024-10-12 14:16:11", "date_publish": "2024-02-01 01:42:31", "description": "Liberty Media-owned Formula One kept a door open for 2028 when General Motors could provide an engine. Read more at straitstimes.com.", "filename": "sport_f1-says-no-to-andretti-but-door-open-for-2028-with-gm_1728742571.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/01/LYNXMPEK0U0Q4-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_f1-says-no-to-andretti-but-door-open-for-2028-with-gm_1728742571.html", "title": "Mario Andretti ‘devastated’ after Formula One rejects his team’s entry", "title_page": "Mario Andretti ‘devastated’ after Formula One rejects his team’s entry | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Formula One announced on Jan 31 that it had blocked United States outfit Andretti’s bid to join the circuit, citing concerns over the team’s level of competitiveness.\nAndretti – headed by 1978 world champion Mario and his son, former McLaren driver Michael – had applied to become Formula One’s 11th team from 2025 or 2026.\n“Our assessment process has established that the presence of an 11th team would not, in and of itself, provide value to the championship. The most significant way in which a new entrant would bring value is by being competitive. We do not believe that the applicant would be a competitive participant,” Formula One said in a statement.\nHowever, the door was left open for 2028, when Andretti partner General Motors (GM) plans to produce its own engine. The team would have had to use engines from an existing manufacturer until then, leading to doubts over their ability to properly compete.\n“I’m devastated. I won’t say anything else because I can’t find any other words besides devastated,” said 83-year-old Mario Andretti, who raced in Formula One from 1968 to 1972 and then from 1974 to 1982 and won 12 grands prix.\nMost of the existing teams have been against expansion, put off by the prospect of sharing profits with an additional competitor.\n“We would look differently on an application for the entry of a team into the 2028 championship with a GM power unit, either as a GM works team or as a GM customer team designing all allowable components in-house. In this case, there would be additional factors to consider in respect of the value that the applicant would bring,” Formula One added.\nAndretti Global is the parent company to Andretti Autosport and other Andretti ventures, with teams currently competing in seven series worldwide. They are most prominent in the IndyCar Series, fielding four cars.\nSince Michael Andretti’s involvement, the team have won the Indianapolis 500 five times (2005, 2007, 2014, 2016, 2017) and the overall championship four times (2004, 2005, 2007, 2012).\n“While the Andretti name carries some recognition for F1 fans, our research indicates that F1 would bring value to the Andretti brand rather than the other way around,” Formula One said.\n“The addition of an 11th team would place an operational burden on race promoters, would subject some of them to significant costs, and would reduce the technical, operational and commercial spaces of the other competitors.”", "url": "https://www.straitstimes.com/sport/f1-says-no-to-andretti-but-door-open-for-2028-with-gm"}