{"authors": [], "date_download": "2024-10-12 13:40:09", "date_modify": "2024-10-12 13:40:09", "date_publish": "2024-09-01 21:34:34", "description": "Bangladesh's Litton Das hit a defiant 138 and Mehidy Hasan Miraz 78 as the tourists recovered from a precarious position to post 262 all out after Pakistan's Khurram Shahzad bagged six wickets on the third day of the second test at Rawalpindi on Sunday. Read more at straitstimes.com.", "filename": "sport_das-miraz-rescue-bangladesh-after-early-collapse-against-pakistan_1728740409.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/02/CRICKET-PAK-BAN-TEST-120215.jpg?VersionId=v1cjezlJyACW1VYS9fy1rKKaNO5lez30", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_das-miraz-rescue-bangladesh-after-early-collapse-against-pakistan_1728740409.html", "title": "Das, Miraz rescue Bangladesh after early collapse against Pakistan on day 3 of second cricket Test", "title_page": "Das, Miraz rescue Bangladesh after early collapse against Pakistan on day 3 of second cricket Test | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Bangladesh's Litton Das hit a defiant 138 and Mehidy Hasan Miraz 78 as the tourists recovered from a precarious position to post 262 all out after Pakistan's Khurram Shahzad bagged six wickets on the third day of the second test at Rawalpindi on Sunday.\nResponding to Pakistan's first innings 274, Bangladesh were reduced to 26-6 and in danger of following on amid fiery fast bowling in the morning but Das and Miraz put together a 165-run stand for the seventh wicket to steady the ship.\nDas hit 13 fours and four sixes in his 228-ball knock while Miraz, who claimed five wickets to skittle out Pakistan, showed his ability with the bat by hitting 12 fours and a six.\nAfter a hard day of toil, Pakistan were 9-2 in their second innings at stumps for a slender lead of 21 as they bid to level the two-match series after losing the first test by 10 wickets.\nHasan Mahmud dismissed Abdullah Shafique and bowled night-watchman Shahzad on the final ball of the day.\nEarlier, Bangladesh resumed on 10 for no loss having kept Pakistan quiet on Saturday after the opening day was washed out but they came under intense pressure immediately.\nGenerating plenty of pace and swing early on, Shahzad (6-90) got rid of Zakir Hasan and castled Shadman Islam and skipper Najmul Hossain Shanto in his next over while Mir Hamza also joined in with two quick strikes.\nShahzad trapped the experienced Shakib Al Hasan lbw to leave the shell-shocked tourists in dire straits, still needing 98 runs to avoid the follow-on.\nHowever, Miraz and Das staged a remarkable fightback from there as they guided Bangladesh to 75-6 at lunch and milked the Pakistan bowlers to bring up their half-centuries.\nShortly after hooking Shahzad for a huge six to take their partnership past 150 runs, Miraz offered the pace bowler an easy catch but Das kept going and brought up his fourth test century to frustrate Pakistan. REUTERS", "url": "https://www.straitstimes.com/sport/das-miraz-rescue-bangladesh-after-early-collapse-against-pakistan"}