{"authors": [], "date_download": "2024-10-12 14:09:08", "date_modify": "2024-10-12 14:09:08", "date_publish": "2024-09-05 17:19:05", "description": "She also became the fastest player in WNBA history to reach 100 three-pointers in a season, after she reached 102 following her four treys at Gainbridge Fieldhouse. Read more at straitstimes.com.", "filename": "sport_caitlin-clark-gets-second-career-triple-double-as-fever-top-sparks_1728742148.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/05/BKP-SPO-WBA-LOS-ANGELES-SPARKS-V-INDIANA-FEVER-012228.jpg?VersionId=OyTWO23TwCMcg7UioqNcouNoe5zcXjBa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_caitlin-clark-gets-second-career-triple-double-as-fever-top-sparks_1728742148.html", "title": "Caitlin Clark gets second career triple-double as Fever top Sparks", "title_page": "Caitlin Clark gets second career triple-double as Fever top Sparks | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "INDIANAPOLIS – Indiana Fever coach Christie Sides hailed the growth of Caitlin Clark, saying she was “really proud of her” as the guard on Sept 4 became the first rookie to register a second career triple-double in a Women’s National Basketball Association (WNBA) season.\nClark collected 24 points, 10 rebounds and 10 assists to help lift Fever to a 93-86 victory over the Los Angeles Sparks in Indianapolis.\nThe 22-year-old also became the fastest player in WNBA history to reach 100 three-pointers in a season, doing so in just 34 games, after she reached 102 from her four treys at Gainbridge Fieldhouse.\nClark, who is now averaging 18.9 points, 5.8 rebounds and 8.4 assists, also added three steals on a day when she was named the WNBA Eastern Conference Player of the Month for August and the league’s rookie of the month.\n“Triple-double, second one for a rookie. Just really proud of her, and her continuing to keep her teammates involved and then also just her growth has been great,” said Sides, whose team secured a play-off spot the night before when rivals Chicago Sky and Atlanta Dream lost to hand Fever their first post-season berth since 2016.\n“She’s playing really well. She’s shooting the hell out of the ball. And she’s making sure she’s finding those open players. She had some amazing assists tonight.”\nIn a league where there have been just 35 triple-doubles in 27 seasons, it is indeed a feat for Clark to reach the milestone just 22 games into her professional career.\n“Honestly, I wasn’t too aware. Everybody was a little confused as to why they were going so nuts over a rebound,” Clark was quoted as saying on the WNBA website.\n“Obviously it’s really cool. My teammates have been finishing the ball really, really at a high rate. My assist numbers, that’s because of them. Just finding them in positions to be successful…we’ve done a really good job of that.”\nAliyah Boston recorded 24 points and 14 rebounds, and Kelsey Mitchell added 18 points for the Fever (18-16), who shot 49.3 per cent from the floor to extend their winning streak to a season-high five games.\nOdyssey Sims scored 20 points and Rae Burrell and Dearica Hamby added 16 apiece for the Sparks (7-26), who have lost five in a row on the road and fell to 2-15 away from home on the season.\nClark was pleased the chase for a play-off berth did not go all the way till the end. Sixth-placed Indiana, who have won 10 of their past 11 home games, moved a full game ahead of the idle Phoenix Mercury in the standings and now have six regular-season games remaining.\n“Definitely a big moment for this place... cool that it doesn’t even have to come down to the wire for us, and that’s special,” said Clark.\n“But... I came in with the expectation this was going to happen. For me, this isn’t a party. It’s great, I feel like it’s a great accomplishment, but there’s much more left to be done. Yeah, we made the play-offs, but I’m not just happy to be in the play-offs. We have the kind of team that can and advance going one game at a time.”\nTo achieve that though, Fever would have to put in more dominant displays than that against bottom side Sparks.\nWith Indiana up 23-19 after the first quarter, Los Angeles then took advantage of 11 turnovers by their opponents to seize a 48-47 lead at half-time. The Fever remained hot on the Sparks’ heels by claiming a 22-13 edge in rebounds.\nSims’ driving layup gave Los Angeles a 55-53 lead early in the third quarter before Indiana responded with a flourish.\nMitchell made a layup before Clark drained a three-pointer and stole a pass before finishing with an uncontested layup to give them a five-point advantage.\nClark answered Kia Nurse’s three-pointer with one of her own to push Indiana’s lead to 69-64 with 1:22 remaining in the third quarter.\nIt was tight even in the fourth quarter as Burrell sank a three-pointer to pull Los Angeles within one at 69-68 early on before Indiana ignited a 7-0 run. Boston sandwiched layups around Clark’s three-pointer.\nSims’ basket in the paint trimmed Indiana’s lead to 84-81 with 3:17 left in the last period. She then answered three free throws by Indiana with a three-point play with 1:51 remaining.\nLexie Hull, however, reeled in an offensive rebound and sank two free throws with 55.6 seconds left for the Fever. Boston added a driving layup to put the game out of reach. REUTERS", "url": "https://www.straitstimes.com/sport/caitlin-clark-gets-second-career-triple-double-as-fever-top-sparks"}