{"authors": [], "date_download": "2024-10-12 14:08:12", "date_modify": "2024-10-12 14:08:12", "date_publish": "2022-07-14 23:57:42", "description": "Griner's teammates share testimony during her high-profile trial outside Moscow. Read more at straitstimes.com.", "filename": "sport_basketball_basketball-russian-team-praises-us-star-brittney-griner-in-court_1728742092.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/07/14/2022-07-14T122607Z_1382333663_RC2OBV9PBWMS_RTRMADP_3_UKRAINE-CRISIS-USA-GRINER-TRIAL.JPG?VersionId=z22DcwToh0wkf5Y9pTpJcT2fBmePXrg1&h=b79d3def", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_basketball-russian-team-praises-us-star-brittney-griner-in-court_1728742092.html", "title": "Basketball: Russian team praises US star Brittney Griner in court", "title_page": "Basketball: Russian team praises US star Brittney Griner in court | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KHIMKI, RUSSIA (AFP) - US basketball star Brittney Griner's Russian team praised her contribution to the country's sport on Thursday (July 14) as they shared testimony during her high-profile trial.\nGriner, a two-time Olympic basketball gold medallist and WNBA champion who had played in Russia, was detained in February, just days before Moscow launched its offensive in Ukraine.\nThe 31-year-old was charged with drug smuggling for possessing vape cartridges with cannabis oil.\nLast week, she pleaded guilty and now faces up to 10 years in a Russian prison.\nGriner was detained while returning to play basketball for UMMC Ekaterinburg, a team in the Russian Premier League.\n\"It's the first time we saw our basketball player. She looks good,\" Maxim Ryabkov, UMMC Ekaterinburg director, told reporters in the town of Khimki outside Moscow where the trial is being held.\n\"Our aim was to show what a big role she played in the club, in Russian basketball in general.\"\nCaptain Yevgenia Belyakova said: \"We very much miss her, her energy.\"\nBelyakova said she wanted to \"stand by her in these moments\" and hoped that the \"case will be over.\"\nMaria Blagovolina, a member of the player's defence team, said Ryabkov had told the court about Griner's \"outstanding abilities\" and that thanks to her the Russian team had been very successful in recent years.\nGriner, who is 2.06m tall, is considered one of the world's best basketball players.\nTalk of swap\nGriner's case has been enmeshed in the freeze in US-Russia relations since President Vladimir Putin sent troops into Western-backed Ukraine on Feb 24.\nUS President Joe Biden was accused of ignoring her plight until he spoke on the phone with Griner's wife last week.\nThe US leader also wrote a letter to the WBNA star, after she had sent him a hand-written message asking Biden to secure her release.\nAfter Griner's conviction, former US ambassador to Russia Michael McFaul urged the Biden administration to exchange imprisoned Russian arms dealer Viktor Bout for Griner and Paul Whelan, who was convicted of espionage in 2020 and sentenced to 16 years in prison.\nA swap \"might be the only way to get Brittney Griner out as soon as possible,\" he said.\nOn Thursday, Russian foreign ministry spokeswoman Maria Zakharova said it was premature to discuss Griner's possible swap in the middle of her trial.\n\"As if they don't understand and don't know this,\" she told reporters, referring to US statements.\nShe said US authorities should not be trying to put pressure on Moscow and instead must focus their efforts on \"practical work through established channels.\"", "url": "https://www.straitstimes.com/sport/basketball/basketball-russian-team-praises-us-star-brittney-griner-in-court"}