{"authors": [], "date_download": "2024-10-12 14:21:13", "date_modify": "2024-10-12 14:21:13", "date_publish": "2020-04-05 05:00:00", "description": "For the first time in more than four decades, the Sport of Kings has been halted for a prolonged period in Singapore. Read more at straitstimes.com.", "filename": "sport_racing-stops-for-a-month_1728742873.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/04/05/ST_20200405_SPTHOR_5576878.jpg?VersionId=BFUK3JAc1EM20jVOD4saMu7G6ryxOb9G", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_racing-stops-for-a-month_1728742873.html", "title": "Coronavirus: Racing stops for a month at Turf Club", "title_page": "Coronavirus: Racing stops for a month at Turf Club | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "For the first time in more than four decades, the Sport of Kings has been halted for a prolonged period in Singapore.\nThe Singapore Turf Club (STC) said yesterday that it will be suspending all local race meetings until May 4 in line with the Ministry of Health's latest advisory on Covid-19.\nThe Government announced stricter measures on Friday to stem the spike in local coronavirus cases. The new measures include the shutting down of most workplaces - except for those providing essential services - and schools as part of a month-long \"circuit breaker\".\nThe last time horse racing was stopped for a period of time was in 1977 - for two months from mid-September, owing to an equine flu outbreak. Singapore and Malaysia then raced as one entity under the Malayan Racing Association.\nThe STC said: \"Indeed, we are operating in unprecedented times with impact reaching far into our economy.\n\"This is part of our continuing efforts to further minimise the spread of Covid-19 and ensure the club remains free of the coronavirus for the safety and well-being of our many staff and stakeholders, including horse owners, trainers, jockeys and many others.\n\"We will continue to adapt our precautionary measures as the situation evolves and carefully evaluate and minimise impact on our business operations and stakeholders.\"\nThe STC and Singapore Pools, which also announced yesterday it will not be offering betting and wagering until further notice after MOH's newest move, are governed by the Tote Board.\nAccording to the statutory board's latest annual report, turnover for horse racing was $1.058 billion for the 2018-19 financial year, a drop from the $1.134 billion collected in the previous year.\nThe STC said it is not in a unique position, as many racing clubs around the world have adopted similar or even more rigorous measures.\nRacing has also stopped in Europe, New Zealand, South Africa and Macau, among other places .\nThere are about 1,100 thoroughbreds at the STC and owners pay about $3,500 monthly for basic training fee per horse.\nThe STC offers an incentive scheme in the form of a credit rebate of $1,350 per horse if it finishes second to fifth-last and $450 for fourth-last to second-last. This is used to offset the monthly training bill which helps lower the cost of keeping horses in Singapore.\nThe prize money for races ranges from $20,000 to $1.5 million. It is divided among owners, trainers and jockeys according to their placings.\nWilliam Chia, the director of Legion Bloodstock Syndicate which races five horses at Kranji, said he supports the Government's latest measures but the owners' main concern is training bills.\n\"We race in the hope our horses can earn stake money to cover our initial investments and training fees,\" he said. \"So, hopefully, the club can make up for the lost meetings by having a few more races per day when racing resumes and also recover some lost race days during the year-end break.\"\nThere are lean times ahead for jockeys like Australian John Powell. He said: \"We earn our money from race riding and prize money, so we'll kind of struggle a bit.\"\nAssociation of Racehorse Trainers (Singapore) president Michael Clements said: \"Obviously, it's quite a big hit for us not being able to race. But, at the same time, everyone in the country has been affected in one way or another, so we really have to support the Government's initiatives to try and get on top of this thing once and for all.\n\"For us, we have to look after the welfare of the horses, maintain their condition and fitness. Training has to be consistent and not stop-start, stop-start.\"", "url": "https://www.straitstimes.com/sport/racing-stops-for-a-month"}