{"authors": [], "date_download": "2024-10-12 13:43:04", "date_modify": "2024-10-12 13:43:04", "date_publish": "2024-09-04 11:23:56", "description": "Title holders Spain are on a high after their magnificent triumph at the Euro and their gold-medal success at the Paris Olympics. Read more at straitstimes.com.", "filename": "sport_football_what-to-look-out-for-in-the-uefa-nations-league_1728740584.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/04/11582551.jpg?VersionId=SXP2D4OfrjnTAaL2EOyXBcIPJswQuZ27", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_what-to-look-out-for-in-the-uefa-nations-league_1728740584.html", "title": "What to look out for in the 2024-25 Uefa Nations League", "title_page": "What to look out for in the 2024-25 Uefa Nations League | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – International football returns across Europe this week, less than eight weeks after Spain edged out England in the Euro 2024 final in Berlin.\nHere are five storylines to follow around the continent ahead of two rounds of fixtures over six days starting on Sept 5.\n1. Will Spain pick up where they left off?\nSpain are on a high after their magnificent triumph at the Euro and their gold-medal success at the Paris Olympics.\nLuis de la Fuente’s side are quickly back in action and have another title to defend, having won the last edition of the Nations League. La Roja are in Group 4 of League A and begin with an awkward double-header, a trip to Serbia being followed by a meeting with Switzerland in Geneva. Denmark complete the group.\nTheir squad do not feature the injured Alvaro Morata, Unai Simon or Mikel Merino, who all played in the Euro final, but young star wingers Lamine Yamal and Nico Williams are involved. There are also new faces in Oscar Mingueza, the former Barcelona right-back now at Celta Vigo, and Valencia midfielder Pepelu.\n“We will keep fighting and trying to go as far as possible in every competition,” insisted de la Fuente.\n2. England start\npost-Southgate era\nAfter just missing out on Euro glory again, England begin a new era with coach Gareth Southgate having stepped down.\nHe has been replaced on an interim basis by Lee Carsley, the Under-21 coach. Carsley, 50, is for now in charge only for this double-header of League B Group 2 matches, as England play Ireland in Dublin and host Finland at Wembley.\nThe English Football Association are buying themselves time as they search for a permanent successor to Southgate, with 2026 World Cup qualifying not beginning until next March.\nBut a good start may see them keep faith in Carsley for the rest of the Nations League campaign, in which England also play Greece after being relegated from League A following the last edition.\nCarsley’s first squad is missing Jude Bellingham, Cole Palmer, Ollie Watkins and Phil Foden due to injuries and illness, but there are call-ups for the uncapped Noni Madueke, Morgan Gibbs-White, Tino Livramento and Angel Gomes.\n3. Ronaldo plays on\nCristiano Ronaldo endured a disappointing Euro 2024, failing to score in five matches as Portugal went out in the quarter-finals. Many thought the 39-year-old might then accept it was time to retire, but coach Roberto Martinez has continued to back his star striker, naming him in the latest squad.\n“When the time comes, I’ll move on,” Ronaldo, of Saudi club Al-Nassr, insisted after teaming up with the squad to play Croatia and Scotland at home.\nPortugal will also come up against Poland in Group 1 of League A, as they aim to win the Nations League for the second time after triumphing in 2019.\nAn injury to Paris Saint-Germain striker Goncalo Ramos means Ronaldo is likely to play from the start.\n4. New, or not so new, faces\nThere are other nations beyond England starting afresh under a new coach.\nIreland’s meeting with the Three Lions will be the first game for their new Icelandic coach Heimir Hallgrimsson. Aged 57, the former Jamaica boss was appointed in July and will also lead the team in World Cup qualifying.\nWales are also under new management, with Craig Bellamy having replaced Rob Page.\nSweden play their first competitive matches under new coach Jon Dahl Tomasson, the ex-Denmark forward. Mircea Lucescu, now 79, has returned for a second stint in charge of Romania, 38 years after ending his first spell which lasted more than five years.\n5. Trying to follow\nthe format\nNew this time is the introduction of quarter-finals next March, involving the top two from each group in League A. The four-team finals will take place next June.\nTeams finishing third in League A, and second in League B, will face off in relegation/promotion play-offs, with identical play-offs between Leagues B and C.\nThere is an impact on World Cup qualifying too.\nThe 12 group winners in European qualifying will go to the World Cup, with another four places going to winners of play-offs featuring the 12 runners-up, plus the four highest-ranked teams in the Nations League who have not otherwise made it. AFP", "url": "https://www.straitstimes.com/sport/football/what-to-look-out-for-in-the-uefa-nations-league"}