{"authors": [], "date_download": "2024-10-12 13:42:15", "date_modify": "2024-10-12 13:42:15", "date_publish": "2024-02-20 00:09:30", "description": "He was taken ill during a training session last week and had tests in hospital. Read more at straitstimes.com.", "filename": "sport_football_hodgson-steps-down-as-palace-manager_1728740535.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/20/LYNXNPEK1I0ER-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_hodgson-steps-down-as-palace-manager_1728740535.html", "title": "Roy Hodgson steps down as manager at struggling Crystal Palace, Oliver Glasner appointed", "title_page": "Roy Hodgson steps down as manager at struggling Crystal Palace, Oliver Glasner appointed | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Roy Hodgson called Crystal Palace a “special club” after stepping down on Feb 19 less than a year into his second stint at the club, with Oliver Glasner appointed as his replacement.\nThe former Liverpool and England boss guided Palace to safety last season.\nBut this term has not met expectations, with the club 15th in the Premier League table after their 1-1 draw with Everton later.\nFormer Eintracht Frankfurt coach Glasner has signed a deal until the end of the 2025-2026 season.\nHodgson’s decision follows back-to-back defeats by Brighton & Hove Albion and Chelsea.\nThe 3-1 loss to Chelsea last week at Selhurst Park marked the 76-year-old’s 200th match in charge of Palace.\n“This club is very special and means so much to me and has played a big part in my footballing life,” he said in a statement on Palace’s website.\n“I have fully enjoyed my time here across six seasons, as it has given me the chance to work with top-class players and staff doing what I love every day.\n“However, I understand, given recent circumstances, it may be prudent at this time for the club to plan ahead...\n“Therefore I have taken the decision to step aside so that the club can bring forward their plans for a new manager, as intended for this summer.”\nHodgson came under criticism from Palace supporters in January’s 5-0 loss at Arsenal, during which fans expressed their anger by holding up a banner that read: “Wasted Potential. On and off the pitch weak decisions are taking us backwards.”\nFans were further angered by Hodgson bringing on Michael Olise as a substitute at Brighton, with the team losing 3-0, only for him to break down with another hamstring injury.\nHodgson’s first stint as Palace manager, from 2017 to 2021, ended after the club finished 14th in the league.\n“Roy has a special place in Crystal Palace history and this will never be forgotten,” chairman Steve Parish said.\n“After four years in which he led the club to maintaining Premier League status season after season, he once again joined us nearly a year ago to steady the ship, and worked wonders.\n“That he then agreed to continue in the summer speaks volumes about his commitment to our club. Quite simply, we owe our continued Premier League status to Roy.”", "url": "https://www.straitstimes.com/sport/football/hodgson-steps-down-as-palace-manager"}