{"authors": [], "date_download": "2024-10-12 14:01:30", "date_modify": "2024-10-12 14:01:30", "date_publish": "2024-07-22 12:04:29", "description": "Rafa Nadal may not be too pleased with the level of his tennis in his first final since winning the 2022 French Open title but the injury-plagued Spaniard said it was important to avoid any damage in Bastad ahead of the Paris Olympics. Read more at straitstimes.com.", "filename": "sport_tennis_nadal-not-satisfied-with-bastad-level-but-happy-to-avoid-injury-before-olympics_1728741690.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/22/LYNXMPEK6L02F-1.jpg?VersionId=isd0XaTaTnDbm0OMIlFMrw4vWZFyULd.", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_nadal-not-satisfied-with-bastad-level-but-happy-to-avoid-injury-before-olympics_1728741690.html", "title": "Nadal not satisfied with Bastad level but happy to avoid injury before Olympics", "title_page": "Nadal not satisfied with Bastad level but happy to avoid injury before Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Rafa Nadal may not be too pleased with the level of his tennis in his first final since winning the 2022 French Open title but the injury-plagued Spaniard said it was important to avoid any damage in Bastad ahead of the Paris Olympics.\nThe 38-year-old, who missed almost all of 2023 with a hip problem and has been limited to six events this year because of a muscle tear and fitness issues, lost 6-3 6-2 in the Swedish Open final to Portuguese seventh seed Nuno Borges on Sunday.\nAfter beating fifth seed Cameron Norrie on Thursday, Nadal won tough three-set matches against fourth seed Mariano Navone and Duje Ajdukovic in his next two rounds and appeared to feel the effects in the final.\n\"The level was so far from what it should be. Probably the energy too. It has been a long week with long matches,\" Nadal told reporters.\n\"Even if my body, I don't have damage, that's important - but mentally and physically, I'm not used to playing four days in a row and playing long matches.\n\"I need to analyse well and find the reason why I played that way, even if the energy wasn't right ... Things like this can happen, and that's the situation. I don't have to lie or hide anything.\"\nNadal opted to skip Wimbledon this month to prepare for the Olympics on the clay courts of Roland Garros, where he has won 14 of his 22 Grand Slam singles titles.\nThe former world number one, who expects to retire at the end of this year, won an Olympic singles gold medal in 2008 and the doubles gold in 2016.\nHe will team up with French Open and Wimbledon champion Carlos Alcaraz in the doubles event at Paris, where the Olympic tennis tournament runs from July 27 to Aug. 4. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/nadal-not-satisfied-with-bastad-level-but-happy-to-avoid-injury-before-olympics"}