{"authors": [], "date_download": "2024-10-12 13:41:17", "date_modify": "2024-10-12 13:41:17", "date_publish": "2024-05-18 15:23:52", "description": "Arsenal are two points behind leaders Manchester City going into the final round of fixtures on April 20. Read more at straitstimes.com.", "filename": "sport_football_arsenal-must-not-get-too-emotional-on-final-day-says-odegaard_1728740477.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/18/LYNXMPEK4H01Q-1.jpg?VersionId=5Ewt71m4yYirFVrsw0Orno39..ShdB7b", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_arsenal-must-not-get-too-emotional-on-final-day-says-odegaard_1728740477.html", "title": "Arsenal must not get 'too emotional' on final day, says Martin Odegaard", "title_page": "Arsenal must not get 'too emotional' on final day, says Martin Odegaard | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Arsenal players must not let their emotions get the better of them as they chase the English Premier League title into the final day of the season, captain Martin Odegaard said ahead of their match against Everton.\nArsenal are two points behind leaders Manchester City going into the final round of fixtures on April 20. The Gunners must win to stay in contention, while City could lift their fourth title in a row if they beat West Ham United.\nArsenal's hopes of ending their 20-year wait for the league title dwindled after City's 2-0 win at Tottenham Hotspur on Tuesday put the Manchester side at an advantage.\n\"We spoke about it the day after (City went ahead),\" Odegaard told TNT Sports. \"We have to focus on ourselves, we can't get too emotional about it.\n\"We have one more game, at home, it's the last game of the season and our goal and our task is clear, we have to win that.\n\"We'll see what happens. That's our mindset now, win that last game, give the fans a good last game and we'll see. It's out of our control, we just focus on our game.\"\nThe Norwegian midfielder said his side have been amazing this season. \"We've taken good steps and I feel like we're a much better team compared to last season,\" he added.\n\"We’ve had some really good games, some good results, and we are now there until the last day, to push for it.\"\nArsenal finished second in the 2022-23 season, five points behind City. They last won the league title under manager Arsene Wenger in their 2003-04 \"Invincibles\" season when they went the entire campaign unbeaten. REUTERS", "url": "https://www.straitstimes.com/sport/football/arsenal-must-not-get-too-emotional-on-final-day-says-odegaard"}