{"authors": [], "date_download": "2024-10-12 14:16:39", "date_modify": "2024-10-12 14:16:39", "date_publish": "2023-10-09 01:50:24", "description": "Russell continued after a pitstop but Hamilton's car ended up in the gravel minus a rear wheel. Read more at straitstimes.com.", "filename": "sport_formula-one_hamilton-out-as-mercedes-team-mates-collide-in-qatar_1728742599.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/09/LYNXMPEJ970A9-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_hamilton-out-as-mercedes-team-mates-collide-in-qatar_1728742599.html", "title": "Hamilton takes blame for collision with Russell", "title_page": "Hamilton takes blame for collision with Russell | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA - Lewis Hamilton shouldered the blame for a first-corner collision with George Russell at the Qatar Grand Prix on Sunday after earlier saying his Mercedes team mate had shunted him out.\nThe pair came together on the opening lap of a race that could have ended with a double podium after Russell qualified on the front row with Hamilton third.\n\"I got taken out by my own team mate,\" seven-times Formula One world champion Hamilton told his race engineer over the radio after ending up in the gravel with only three wheels on his car.\nRussell continued after a pitstop and finished fourth.\n\"In the heat of the moment, it was frustrating because I felt this tap from the rear but don’t think George had anywhere to go,\" Hamilton told reporters.\n\"It was an unfortunate scenario and I am happy to take responsibility because that is my role...I don’t feel like it was George’s fault.\"\nStewards looked at the incident and decided no driver was wholly at fault and took no further action.\nHamilton assured reporters the relationship was \"not broken\".\n\"I don’t have any problems with George. We have a great relationship and we always talk about things,\" he added.\nThe incident was reminiscent of the 2016 season, when Hamilton and now-retired team mate Nico Rosberg clashed in a frosty title duel that the German ultimately won.\nRosberg, now a Sky Sports television pundit, said it was \"all on Lewis\".\nHamilton had complained before the start that he was a \"sitting duck\" on soft tyres but he did not get far enough to find out.\nHe tried to go around Russell on the outside but his rear right wheel made contact with the front left of the younger Briton's car, spinning both around and bringing out the safety car.\nThe move took Russell by surprise.\n\"I was just focused ahead and he just came from nowhere,\" he said over the radio.\n\"Lost for words, honestly,\" he added later. \"I've just seen the replays on the TV screen. I couldn't do anything. I was totally sandwiched.\"\nTeam boss Toto Wolff, absent due to recent knee surgery, came on the radio from his Monaco home to tell Russell to focus on the race.\n\"We both had the possibility of standing on the podium,\" said Russell.\n\"Obviously, nothing intentional both ways. These cars are so difficult to see when you are racing, there's big blind spots. We both have so much respect for one another. We will go past this and I'm sure we will speak and everything will be OK.\"\nMercedes are battling with Ferrari for second place but the Italians lost ground with Charles Leclerc fifth and Carlos Sainz failing to start due to a fuel system problem. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/hamilton-out-as-mercedes-team-mates-collide-in-qatar"}