{"authors": [], "date_download": "2024-10-12 14:21:43", "date_modify": "2024-10-12 14:21:43", "date_publish": "2020-01-07 11:05:05", "description": "SINGAPORE - Popular Japanese golfer Ryo Ishikawa has fired a warning to his rivals ahead of the Jan 16-19 SMBC Singapore Open. Read more at straitstimes.com.", "filename": "sport_golf_golf-back-injury-behind-him-japans-ishikawa-issues-warning-to-rivals-ahead-of-smbc_1728742903.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/01/07/nz_ryo_070157.jpg?VersionId=ZEN1DmKj.9vuv3.OmI7svjZhKBDNKfEG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_golf-back-injury-behind-him-japans-ishikawa-issues-warning-to-rivals-ahead-of-smbc_1728742903.html", "title": "Golf: Back injury behind him, Japan's Ishikawa issues warning to rivals ahead of SMBC Singapore Open", "title_page": "Golf: Back injury behind him, Japan's Ishikawa issues warning to rivals ahead of SMBC Singapore Open | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Popular Japanese golfer Ryo Ishikawa has fired a warning to his rivals ahead of the Jan 16-19 SMBC Singapore Open.\nIshikawa, who had three wins under his belt last year, said that he is swinging freer than during his previous visits to the Sentosa Golf Club and predicted even better results this year.\n\"I feel very good about my physical condition now,\" said the Japanese, whose well-documented back problems restricted his movement. \"I can swing the way I want to swing.\n\"I (hope) to do much more this season.\"\nThe 28-year-old will join Major winners Justin Rose of England and Sweden's Henrik Stenson, American Matt Kuchar, a multiple winner on the PGA Tour, and in-form defending champion Jazz Janewattananond in the elite field at the event, which is co-sanctioned by the Asian Tour and Japan Golf Tour Organisation.\nIshikawa has drawn big crowds in his previous two appearances at Sentosa Golf Club and treated the fans to some inspired golf last year with rounds of 69 and 66 to lie joint second at the halfway mark before fading over the weekend.\nHe shot to fame in May 2007 when he became the youngest winner on the Japanese circuit at 15 years and eight months with his victory at the Munsingwear Open KSB Cup. Still an amateur, the event was his first on the Japan Tour.\nHe turned professional the following year, winning eight tournaments in a two-year spell, four of those victories coming in 2009.\nHis career was interrupted by a back injury in 2016 but last year appeared to herald a return to form. He claimed the Japan PGA Championship in early July, followed by the Segasammy Cup in August before sealing the season-ending Golf Nippon Series JT Cup in December.", "url": "https://www.straitstimes.com/sport/golf/golf-back-injury-behind-him-japans-ishikawa-issues-warning-to-rivals-ahead-of-smbc"}