{"authors": [], "date_download": "2024-10-12 13:43:36", "date_modify": "2024-10-12 13:43:36", "date_publish": "2024-07-08 14:59:53", "description": "La Roja are joint top scorers at this edition, while Les Bleus have conceded just one goal in five games. Read more at straitstimes.com.", "filename": "sport_football_freewheeling-spain-face-austere-french-in-euro-2024-final-bid_1728740616.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/08/2024-07-05T185204Z1924867545UP1EK751GEQ68RTRMADP3SOCCER-EURO-ESP-GER-REPORT.JPG?VersionId=DemIZ1yvDr62MniP3FaUfhAC_y_aJ4sK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_freewheeling-spain-face-austere-french-in-euro-2024-final-bid_1728740616.html", "title": "Freewheeling Spain face austere French in Euro 2024 final bid", "title_page": "Freewheeling Spain face austere French in Euro 2024 final bid | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MUNICH – The battle between the two most successful national sides of the new millennium, the Euro 2024 semi-final between France and Spain on July 9, also showcases two contrasting styles.\nSpain have dazzled, reaching the final four on the back of the attacking brilliance of wingers Lamine Yamal and Nico Williams. Their goal tally of 11 is the joint-highest at this edition, alongside hosts Germany.\nBy contrast, France, one of the pre-tournament favourites who boast one-man offensive powerhouse Kylian Mbappe, have ground their way to the semi-finals on the back of solid defence, conceding just one goal in five games.\nSpain have won five from five. Excluding wins on penalties, no team in Euro history have ever won more than five games in the same tournament.\nWhile veteran striker Alvaro Morata captains La Roja, headlining the team’s attacking prowess are young wingers Williams, 21, and Yamal, 16, providing speed and creativity from both flanks.\nWilliams has scored a goal and laid on an assist. Yamal is yet to find the net – if he does score at this tournament, he will break the record for youngest goalscorer at the Euro by almost two years – but has provided three assists, the most in Germany.\nThe team’s progress has been underpinned by the relentless positivity of coach Luis de la Fuente, who has claimed they “can go far. There is a lot of heart and soul in this team”.\nHis conviction has been transmitted throughout the squad, with defender Marc Cucurella saying Spain’s strength lies in the team rather than the sum of their parts.\n“We are a group of players that give everything for our teammates and that’s one of the secrets. We have created a great group,” the 25-year-old left-back said on July 7.\n“We have a mix of veterans and very young players, and that makes it all very enjoyable. The key is to be like a family. We may not have superstars but, as a team, we are good, we are doing well and I hope we keep that way.”\nSpain will need that heart and soul, considering three players who started in the 2-1 extra-time victory over Germany in the quarter-final will be absent. Defenders Dani Carvajal and Robin le Normand are suspended, while Pedri is out for the tournament with a knee injury.\nNacho Fernandez and Jesus Navas are the most likely candidates to fill in for le Normand and Carvajal respectively, and the 63-year-old de la Fuente, who has coached several of the players at junior levels for the three-time Euro champions, has full belief in his squad.\n“I have 26 top players, who are competitive for these matches, if one is absent, another will play. This group has exceptional human and footballing qualities. I know they won’t let me down,” he said.\nVersatile playmaker Dani Olmo has indeed shown de la Fuente that he is ready to take over Pedri’s role as chief creator, after contributing to both of Spain’s goals against Germany and setting up the winner against Albania in the group stage.\n“Olmo is a superb player, a fantastic footballer, I really value him. He thinks about the team more than himself,” the 63-year-old coach said.\nScoring has not been an issue for Spain but, surprisingly, it has for France.\nHaving topped the goal tally with 16 at the Qatar World Cup, Les Bleus qualified for the final four at Euro 2024 on the basis of strong defence, while their attack has deserted them in Germany.\nThey have made it to the semi-finals scoring just three goals – none by a French player from open play. Their run includes two 0-0 draws and two 1-0 wins, thanks to rivals’ own goals. Only seven sides at Euro 2024 have scored fewer than them.\nThe two-time continental champions have, however, conceded just one goal – a penalty by Poland’s Robert Lewandowski – and kept four clean sheets.\nSuperstar Mbappe, who scored eight of France’s 2022 World Cup goals, has scored just once in Germany – from a penalty.\nDespite the apparent lean run, Mbappe – who missed his side’s 0-0 draw with the Netherlands with a broken nose – has been crucial, with his probing run against Austria creating the only goal of the match.\n“Obviously, it would be easier to win games if we were more effective on the attacking front but, in a major tournament like the Euro or the World Cup, you can’t expect to go far if you’re not solid,” France coach Didier Deschamps, 55, said.", "url": "https://www.straitstimes.com/sport/football/freewheeling-spain-face-austere-french-in-euro-2024-final-bid"}