{"authors": [], "date_download": "2024-10-12 14:10:58", "date_modify": "2024-10-12 14:10:58", "date_publish": "2024-05-15 13:31:57", "description": "The 19-year-old insisted that his dream was always to “make a name for myself”. Read more at straitstimes.com.", "filename": "sport_basketball_mindset-is-making-nba-not-playing-with-dad-says-bronny-james_1728742258.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/15/2024-05-14T184310Z682661728MT1USATODAY23271348RTRMADP3NBA-COMBINE.JPG?VersionId=T0ChBcF8vOP1nldmZzwIn6CCH7n4edr3", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_mindset-is-making-nba-not-playing-with-dad-says-bronny-james_1728742258.html", "title": "Mindset is making NBA, not playing with dad, says Bronny James", "title_page": "Mindset is making NBA, not playing with dad, says Bronny James | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Bronny James’ name is a lot more famous than his game right now, and it is clear that he would like to change that.\nThe son of LeBron James told reporters at the NBA (National Basketball Association) Draft Combine on May 14 that his focus is simply on reaching the league, not necessarily on teaming up with his legendary father.\n“I would be happy about getting into the league instead of me thinking about playing with my dad,” the younger James said.\n“That’s not my mindset... at all. I’m just trying to put in the work and see where it takes me from there.”\nAs he attempts to launch his professional career with a good showing at the combine, the 19-year-old insisted that his dream was always to “make a name for myself”.\nNBA mock drafts do not tend to project James as one of the 58 selections this June – except in cases where he is projected to be picked by the Los Angeles Lakers, his dad’s current team.\n“I never thought about just playing with my dad, but of course he’s brought it up a couple times,” James added.\nThe teenager began his college career at the University of Southern California in 2023 but had a scary setback when he experienced cardiac arrest at a practice in July. He returned in December and averaged 4.8 points, 2.8 rebounds and 2.1 assists over 25 games.\n“It was a tough time for sure,” he said of his rehab.\n“But all this work that I’ve put in, it just really built me into someone who would never give up and it paid off.\n“I put in the work after that situation and I’m back to where I want to be.”\nJames, who entered the transfer portal after the season, also said on May 14 that he has yet to decide whether to keep his name in the draft or withdraw.\n“Everything that follows my dad, people just try to link me with that and all the greatness that he’s achieved,” James said.\n“I haven’t done anything yet, so I feel like there needs to be that divide between Bronny and LeBron.", "url": "https://www.straitstimes.com/sport/basketball/mindset-is-making-nba-not-playing-with-dad-says-bronny-james"}