{"authors": [], "date_download": "2024-10-12 13:44:31", "date_modify": "2024-10-12 13:44:31", "date_publish": "2023-10-12 04:00:00", "description": "There is something for everyone at the Takashimaya Golf Fest. There are 30 major brands to shop from, more than 2,000 products to choose from and exclusive promotions of up to 60 per cent off leading golf brands Read more at straitstimes.com.", "filename": "sport_golf_tee-off-at-takashimaya-s-golf-festival_1728740671.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/12/Putting20Green.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_tee-off-at-takashimaya-s-golf-festival_1728740671.html", "title": "Tee off at Takashimaya’s golf festival", "title_page": "Tee off at Takashimaya’s golf festival | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "American professional golfer Ben Hogan once said: “The most important shot in golf is the next one.” So take your next shot in style with a wide variety of golf products from renowned brands at the biannual golf fest at Takashimaya Department Store Level 4 this October!\nWhether you are a seasoned golfer or a novice, there is something for everyone at the Takashimaya Golf Fest.\nThere are 30 major brands to shop from, more than 2,000 products to choose from and exclusive promotions of up to 60 per cent off leading golf brands like Adidas, Callaway, FootJoy, J.Lindeberg, Le Coq Sportif, Munsingwear, TaylorMade, XXIO and many more. Every part of your golf journey is covered as you enjoy the best deals on golf balls, clubs, apparel, bags and footwear at the fair.\nCatch DJs Glenn Ong, Andre Hoeden and Juliana Yeow live on Oct 8 and 14 from 2.30pm to 4.30pm. Stand to walk away with a $50 voucher by answering a simple question. Ten to 15 vouchers are available on each of the two days.\nFor every $150 spent, you receive one chance to participate in the Golf Fest Lucky Draw. Participants stand to win a 4D3N golfing trip for two to destinations like Bali (1st prize, worth $5,388), Hanoi (2nd prize, worth $4,388) and Bangkok (3rd prize, worth $3,888).\nSpecially for ST subscribers: Enjoy $20 off with a minimum of $200 spent on golf merchandise at Takashimaya Golf Fest 2023 from now till Oct 23.\nThis promotion is limited to one redemption per transaction for the first 300 redemptions. Simply visit stsub.sph.com.sg/takagolffest to redeem the promo code and quote it at the point of payment. Other terms and conditions apply. Don’t miss this tee-rific sale!", "url": "https://www.straitstimes.com/sport/golf/tee-off-at-takashimaya-s-golf-festival"}