{"authors": [], "date_download": "2024-10-12 13:35:30", "date_modify": "2024-10-12 13:35:30", "date_publish": "2024-09-01 21:41:42", "description": "He crossed the line in third place before Australian Erik Horrie was eventually handed the bronze. Read more at straitstimes.com.", "filename": "sport_paralympic-beast-hampers-canada-s-track-cyclist-melissa-pemble-after-ski-transition_1728740130.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/01/btcheat20240901.jpg?VersionId=h4sXVMFBiTLnHmvLO_Yl6Qt3UnSFIGGP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_paralympic-beast-hampers-canada-s-track-cyclist-melissa-pemble-after-ski-transition_1728740130.html", "title": "Italian Paralympic rower denied bronze for cheating with ‘telephone’ use", "title_page": "Italian Paralympic rower denied bronze for cheating with ‘telephone’ use | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Italian Paralympic rower Giacomo Perini was disqualified from the PR1 men’s single sculls final and missed out on a bronze medal on Sept 1 for using “communication equipment”.\nPerini, 28, who had his right leg amputated due to bone cancer, crossed the line in Paris in third place before Australian Erik Horrie was eventually handed the bronze medal.\nBritain’s Ben Pritchard took gold and Ukraine’s two-time champion Roman Polianskyi claimed silver.\nWorld Rowing said Perini “was found to be using communication equipment during the race”.\n“As a result, the crew has been excluded from the event and will be ranked last,” it added.\nWorld Rowing told AFP the Italian team have appealed the decision and a reaction from the international governing body was expected by the end of the day.\nWelshman Pritchard, 32, claimed Perini had a telephone in his boat in a race where athletes row with their backs to the finish line.\n“He had an open phone on in the boat and you’re not allowed communication like that,” Pritchard said.\n“I don’t know why you would try something like that in the Paralympic final. I’ve never seen it in a race before.”\nIn the velodrome, Canadian track cyclist Melissa Pemble said on Aug 31 “the nature of the Paralympic beast” got the better of her after she finished fourth and out of the medals in the C1-3 500m individual time trial.\nPemble, who has cerebral palsy on the right side of her body, narrowly missed out on a medal at the velodrome in south-west Paris. Australian Amanda Reid took the gold, with Qian Wangwei of China snagging silver, as German Maike Hausberger rounded off the podium.\nThe 24-year-old is competing in her second Games, after featuring in the 2018 Winter Olympics in Pyeongchang in five para skiing events. Her best result in South Korea was ninth in the downhill and super combined.\n“I’ve never been more nervous in my life for a race,” Pemble said. “Coming into the stands and the pre-race lightshow, it was different.\n“I think it’s the nature of the beast, I’m bound to be nervous. Fourth is always a tough place to finish,” she added.\nPemble claimed a world-record time in qualifying for the final before finishing outside of the medal places due to the Paralympics’ disability category system.", "url": "https://www.straitstimes.com/sport/paralympic-beast-hampers-canada-s-track-cyclist-melissa-pemble-after-ski-transition"}