{"authors": [], "date_download": "2024-10-12 14:13:25", "date_modify": "2024-10-12 14:13:25", "date_publish": "2023-10-01 13:58:17", "description": "His vital signs are now stable, a spokesman for the games said. Read more at straitstimes.com.", "filename": "sport_games-athletics-official-in-stable-condition-after-being-hit-by-hammer_1728742405.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/01/LYNXNPEJ900CX-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_games-athletics-official-in-stable-condition-after-being-hit-by-hammer_1728742405.html", "title": "Athletics official suffers leg fracture at Asian Games after being hit by mis-thrown hammer", "title_page": "Athletics official suffers leg fracture at Asian Games after being hit by mis-thrown hammer | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HANGZHOU, China - An athletics official suffered a broken leg and serious bleeding after being hit by a mis-thrown hammer at the Asian Games in Hangzhou, but his vital signs are now stable, a spokesman for the Games said on Sunday.\nJust before 8pm on Saturday, Kuwait’s Ali Zankawi lined up for one of his throws in the men’s hammer final in the eastern Chinese city’s packed Olympic stadium. But instead of soaring straight onto the outfield, the hammer flew out sideways and low to the right, smashing into the leg of the sitting technical official.\nLooking horrified, Zankawi sprinted over as blood began spurting from the official’s right leg. The official, Mr Huang Qinhua, 62, grimaced and swayed dizzily as Zankawi rushed to check on him, blood shooting out of the wound.\nWithin seconds, Zankawi was using his huge hands and strength to improvise a tourniquet on Mr Huang’s thigh and halt the bleeding. Medical personnel soon took Mr Huang away on a stretcher after applying a tourniquet, then took him to a nearby hospital.\n“He arrived at the hospital at 20.15, where he was diagnosed with a right open tibiofibular fracture,” Games spokesman Xu Deqing told a news conference on Sunday. “Currently, his vital signs are stable.”\nAfterwards, Zankawi looked shaken and was seen asking after the official, according to a Reuters witness.\nThe final was won by China’s Wang Qi. Zankawi finished eighth but still managed a season’s best of 67.57m, which he threw in the second round before his mis-throw.\nAs is common in athletics competitions, the official had sat several metres from the cage-like netting that surrounds the throwing circle where the athletes spin and take their throws.\nBut the power and velocity of the 7.26kg flying metal ball meant the netting could only slightly cushion the hammer's flight, not stop it.", "url": "https://www.straitstimes.com/sport/games-athletics-official-in-stable-condition-after-being-hit-by-hammer"}