{"authors": [], "date_download": "2024-10-12 14:10:19", "date_modify": "2024-10-12 14:10:19", "date_publish": "2024-07-28 17:38:31", "description": "Van de Velde was sentenced to four years in prison in Britain in 2016 for the rape of a 12-year-old girl. Read more at straitstimes.com.", "filename": "sport_some-boos-as-convicted-dutch-rapist-makes-olympic-beach-volleyball-debut_1728742219.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/29/LYNXMPEK6R033-3.jpg?VersionId=G3ExyJrxGzKcfzK.d2ySiD5s107RXUq1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_some-boos-as-convicted-dutch-rapist-makes-olympic-beach-volleyball-debut_1728742219.html", "title": "Convicted Dutch rapist booed on Olympics beach volleyball debut", "title_page": "Convicted Dutch rapist booed on Olympics beach volleyball debut | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - There were boos, and mixed feelings amongst the crowd, as Netherlands beach volleyball player Steven van de Velde, a convicted rapist, made his Paris 2024 debut for a game in bright sunshine at the feet of the Eiffel tower on July 28.\nHis team, however, were unapologetic about van de Velde taking part in the Olympics, saying \"the past is in the past\" and that the matter should not be brought up at the Games.\nVan de Velde was sentenced to four years in prison in Britain in 2016 following the rape of a 12-year-old girl two years earlier when he was 19.\nHe spent 13 months in prison – one year in Britain and one month in the Netherlands – before being freed there after what he did was re-classified under Dutch law as a lesser offence of \"committing indecent acts\" and his sentence was reduced.\nVan de Velde has been competing in beach volleyball again since 2017.\nHe was booed several times during the match, though there was also applause from other members of the crowd.\nAmong the spectators, Melissa Gautier, a 23-year-old health worker, said she thought van de Velde should not be there.\n\"Being an athlete shouldn't give you a free pass,\" she said.\nAndrea Syslos, a 47-year-old lawyer from Italy, did not know about the case, but when told about it said: \"It's not a good thing. Sporting justice should be harsher than civil justice.\n\"Maybe he shouldn't still be in prison but it's not normal that he is playing in the Olympics where he should be an example for other people,\" he said.\nBut van de Velde's teammate Matthew Immers brushed away the criticism over the now 29-year-old taking part in the Olympics.\n\"What's in the past is in the past. He had his punishment and now he is really kind. For me it is an example that (he) grew and learnt a lot from it,\" Immers told reporters.\n\"I'm enjoying playing with him,\" he said.\nJohn van Vliet, a press officer for the Netherlands team, said: \"It's something that shouldn't be brought up through sports in a tournament that he qualified for.\n\"The general matter of sex convictions or sex-related crime is a much bigger issue than sport but in his case we have a person who has been convicted, who did his sentence and did everything afterwards that he can do to compete again.\"\nIOC satisfied\nAmong the crowd watching the match, some agreed.\n\"I read about this and I think everyone deserves a second chance. He's (legally) allowed to be here and so he can be here,\" 46-year-old German architect Alexandra Bertram said.\nVan de Velde and Immers lost 22-20, 19-21, 15-13 to Italy's Alex Ranghieri and Adrian Ignacio Carambula Raurich in their men's Pool B match.\nThe International Olympic Committee said on Saturday it was satisfied with explanations given by the Netherlands Olympic team regarding the participation of van de Velde.\nIOC spokesperson Mark Adams said the committee was not totally comfortable with the situation but that “a crime occurred 10 years ago, a great deal of rehabilitation has taken place and strong safeguarding is in place”.\nThe Netherlands team have taken steps to mitigate the impact of van de Velde's participation by moving him to alternative accommodation in Paris and not the athletes' village and asking him not to speak to the media.\nAlienor Laurent, co-president of French feminist collective \"Osez le feminisme!\" (Dare to be Feminist), mobilised against van de Velde's participation, was outraged that he was allowed to compete in the Olympics.\n\"What is the message to victims? That sporting talent has more value than their dignity,\" she told Reuters last week.\n\"And what is the message to aggressors? Assaulting (a young girl) will have no impact on your life or your career, you will be celebrated and may have medals.\"\nThe case has resonated more widely, including in Britain and the United States, where some women's rights groups have campaigned against van de Velde's participation in the Games.\n\"An athlete convicted of child sexual abuse, no matter in what country, should not be awarded the opportunity to compete in the Olympic Games,\" said Julie Ann Rivers-Cochran, executive director of The Army of Survivors NGO. REUTERS", "url": "https://www.straitstimes.com/sport/some-boos-as-convicted-dutch-rapist-makes-olympic-beach-volleyball-debut"}