{"authors": [], "date_download": "2024-10-12 13:59:28", "date_modify": "2024-10-12 13:59:28", "date_publish": "2023-12-09 23:17:57", "description": "Russian and Belarusian athletes can compete in 2024 as neutrals, outside of team events and if they do not actively support Russia's invasion of Ukraine. Read more at straitstimes.com.", "filename": "sport_kyiv-says-ioc-allowing-russian-athletes-at-olympics-is-encouraging-war-in-ukraine_1728741568.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/09/2023-12-02T051807Z568111870RC2SO4A6IVPERTRMADP3OLYMPICS-2024-SURFING.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_kyiv-says-ioc-allowing-russian-athletes-at-olympics-is-encouraging-war-in-ukraine_1728741568.html", "title": "Kyiv says IOC allowing Russian athletes at Olympics is 'encouraging' war in Ukraine", "title_page": "Kyiv says IOC allowing Russian athletes at Olympics is 'encouraging' war in Ukraine | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KYIV - Ukraine on Dec 9 criticised the decision of Olympic chiefs to allow Russian and Belarusian athletes to compete in 2024 as neutrals, outside of team events and if they do not actively support Russia’s invasion of Ukraine.\n“The members of the International Olympic Committee Executive Board who made this decision bear responsibility for encouraging Russia and Belarus to continue their armed aggression against Ukraine,” the Ukrainian foreign ministry said.\nAthletes from Russia and Belarus have faced sanctions from a multitude of sports since Moscow launched its assault on Ukraine in February 2022, but a number of sports have eased restrictions over the past year.\nMoscow denounced the conditions imposed to take part in the Paris 2024 Olympic Games as “discriminatory” but that athletes who could fulfil them would go.\nAccording to the IOC, 11 athletes – eight Russians and three Belarusians – have so far qualified by meeting the neutrality criteria for the 2024 games.\nKyiv said Russian athletes often represent “sports organisations associated with the armed forces” and that “some of them are on active duty in the Russian military.”\nThe ruling means welcoming back sportsmen and women who “not only sympathise with the murders of Ukrainian women and children, but are likely to be directly involved in these terrible crimes,” the foreign ministry said.\n“The International Olympic Committee has effectively given Russia the green light to weaponise the Olympics,” it added.\nThe committee said no athletes under contract with military or national security agencies would be allowed to compete.\nIt also said that no Russian and Belarusian flags or symbols will be displayed at the games.\n“Moscow will not be raising white neutral flags... but will be demonstrating the triumph of its ability to avoid responsibility for the largest armed conflict in Europe since World War II,” Ukraine said.\nMore than 60 Ukrainian athletes have qualified for next year’s Paris Olympics. AFP", "url": "https://www.straitstimes.com/sport/kyiv-says-ioc-allowing-russian-athletes-at-olympics-is-encouraging-war-in-ukraine"}