{"authors": [], "date_download": "2024-10-12 13:59:30", "date_modify": "2024-10-12 13:59:30", "date_publish": "2024-07-26 17:18:44", "description": "Matviy Bidnyi says the Games would for Ukraine “primarily be a big screen to the world”. Read more at straitstimes.com.", "filename": "sport_olympics-serve-as-reminder-that-ukraine-still-exists-says-sports-minister_1728741570.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/26/2024-07-23T184647Z240129941RC2419AHWPN2RTRMADP3OLYMPICS-2024-UKRAINE-DEPARTURE.JPG?VersionId=2MLn5mc6PO8E1erETJtxf2KduvH03aiB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_olympics-serve-as-reminder-that-ukraine-still-exists-says-sports-minister_1728741570.html", "title": "Olympics serve as reminder that Ukraine still exists, says sports minister", "title_page": "Olympics serve as reminder that Ukraine still exists, says sports minister | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Ukrainian acting sports minister Matviy Bidnyi says “the Russians wanted his country to cease to exist” but instead, over two years on from the invasion, “the opposite has happened” at the Paris Olympics.\n“Ukrainians are here, Ukraine is participating in the Olympic Games,” he said on July 25.\nMr Bidnyi, who replaced Vadym Gutzeit as sports minister last November, said sport’s greatest show spread over a fortnight in Paris – and televised around the globe – would for Ukraine “primarily be a big screen to the world”.\nDespite heavily disrupted preparations, with some athletes leaving Ukraine, others being killed and training facilities destroyed since Russia invaded on Feb 24, 2022, Ukraine has still sent a 140-strong team to Paris.\n“We need to remind the world that Ukraine exists, is fighting, and is capable of winning,” Mr Bidnyi told AFP via e-mail.\n“Under the coordination of the Office of the President of Ukraine, we plan a large campaign to best explain that the very fact we perform under the Ukrainian flag in Paris is a great display of willpower.”\nUkraine won 19 medals in Tokyo in 2021 but he added that under the vastly different circumstances this time, there was a different bar to be set.\n“We believe in every Ukrainian athlete and wish to win all the medals,” said the 44-year-old former bodybuilder.\n“But the truth is broader – every Ukrainian athlete at the Olympic Games is a hero who is already a winner.\n“At the beginning of Russia’s full-scale invasion of Ukraine, few believed we would stand. But we did, Ukrainian defenders stopped the Kremlin’s onslaught.”\nMr Bidnyi also said he could not be prouder that the athletes had managed to remain focused enough to qualify for Paris in their respective sports.\n“Ukrainian athletes have proudly overcome the incredible hardships brought about by the Russian war,” he said.\n“The killing of loved ones, the destruction of homes and stadiums, endless relocations – these are challenges that all Ukrainians, particularly athletes, constantly face.\n“Sports infrastructure has suffered significant losses. The Russians damaged and destroyed more than 500 sports facilities, including 15 Olympic training bases across the country.\n“But we can rebuild the sports infrastructure. However, we will never be able to bring back the killed athletes.”\nThe minister dreads waking up to new figures of dead and wounded athletes and coaches.\n“Every morning, I receive an SMS with updates on how many Ukrainian athletes and coaches the Russians have killed,” he said.\n“Almost every day, this number increases.\n“As of now, the Russians have killed 488 Ukrainian athletes and coaches.\n“Among them are dozens of world and European champions, participants of previous Olympic Games, who should have been in Paris now but were killed by Russia.”\nThose who have made it through to Paris have done so in the most trying of circumstances.\nMr Bidnyi gave an example of how rower Anastasia Rybychok lost her home and training base in Kherson.\n“They were first bombed by the Russians and then flooded after the Russians blew up the Kakhovka Hydroelectric Station,” he said.\n“Because of Russian terror, we experience power outages.\n“Our athletes have to train in gyms without air conditioning or ventilation simply because there is no electricity.”\nUltimately, he is delighted that under constant pressure from his office and others, the International Olympic Committee has vastly restricted the number of Russians and Belarusians competing in Paris and ordered them to compete under a neutral flag. They were also banned from the opening ceremony on July 26.\nUkrainian President Volodymyr Zelensky, meanwhile, praised athletes from his war-battered country for their preparations to compete at the Paris Games.\n“We are proud of our team – the men and women who, despite this war of aggression, managed to prepare for the Olympics and show the spirit of all Ukrainians.\n“They have our will to win and Ukrainian character,” he said. AFP", "url": "https://www.straitstimes.com/sport/olympics-serve-as-reminder-that-ukraine-still-exists-says-sports-minister"}