{"authors": [], "date_download": "2024-10-12 13:36:45", "date_modify": "2024-10-12 13:36:45", "date_publish": "2024-08-04 19:45:20", "description": "PARIS - A convicted sex offender who coached women’s triathlon silver medallist Julie Derron of Switzerland has left the Paris 2024 Games and the International Olympic Committee (IOC) said on Sunday it was looking into the matter. Read more at straitstimes.com.", "filename": "sport_triathlon-australian-sex-offender-has-left-the-games-ioc-looking-into-the-issue_1728740205.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/05/11511514.jpg?VersionId=AVWshvwK9cxnrJ_HtrD0nn6PmP6YxMg_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_triathlon-australian-sex-offender-has-left-the-games-ioc-looking-into-the-issue_1728740205.html", "title": "Australian sex offender who coached Swiss triathlete has left the Games, IOC looking into the issue", "title_page": "Australian sex offender who coached Swiss triathlete has left the Games, IOC looking into the issue | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - A convicted sex offender who coached women’s triathlon silver medallist Julie Derron of Switzerland has left the Paris 2024 Games and the International Olympic Committee (IOC) said on Sunday it was looking into the matter.\nAustralian Brett Sutton appeared on an interview with Swiss TV channel RTS commenting on Derron's performance after Wednesday's triathlon.\nHe was wearing an Olympic accreditation and was also seen wearing a red jacket with the Chinese flag and Olympic rings on it.\nThe Chinese Olympic Committee did not immediately respond to a request for comment.\nIn 1999, Sutton pleaded guilty to five counts of sexual abuse of a 13-year-old Australian swimmer he had been coaching and was sentenced to two years in prison.\nThe sentence was suspended for three years.\n\"I understand that this person is no longer here at the Games, they have left the Games,\" IOC spokesperson Mark Adams told a press conference on Sunday.\n\"It is an issue for the Chinese Olympic Committee and the national federation will need to get involved,\" he added, referring to reports that Sutton had been accredited by the Chinese Committee.\n\"Looking forward I can tell you we will obviously look into this issue.\"\n\"Coaches are not accredited by us but by the National Olympic Committees, and approved by the IOC,\" a World Triathlon spokesperson said on Sunday.\nNetherlands beach volleyball player Steven van de Velde, a convicted rapist, is taking part in the Paris Games and he and partner Matthew Immers have made it to the round of 16.\nThe IOC had already defended the Dutch Olympic Committee's decision to bring van de Velde to the Games and on Sunday Adams added: \"This is an issue that was discussed with the National Olympic Committee and they assured us there were many safeguarding measures.\" REUTERS", "url": "https://www.straitstimes.com/sport/triathlon-australian-sex-offender-has-left-the-games-ioc-looking-into-the-issue"}