{"authors": [], "date_download": "2024-10-12 13:40:56", "date_modify": "2024-10-12 13:40:56", "date_publish": "2024-09-03 12:50:02", "description": "Uncapped all-rounder Nathan Smith is targeting a test debut in the home summer after being awarded a New Zealand contract on the strength of a stunning domestic season. Read more at straitstimes.com.", "filename": "sport_uncapped-smith-earns-new-zealand-contract-in-big-show-of-faith_1728740456.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/03/ST-logo-placeholder_14.jpg?VersionId=jl8bKVe_6RoZelXQ2XP6O8qyqG6LHfv4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_uncapped-smith-earns-new-zealand-contract-in-big-show-of-faith_1728740456.html", "title": "Uncapped Smith earns New Zealand contract in big show of faith", "title_page": "Uncapped Smith earns New Zealand contract in big show of faith | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Uncapped all-rounder Nathan Smith is targeting a test debut in the home summer after being awarded a New Zealand contract on the strength of a stunning domestic season.\nThe 26-year-old from Oamaru in the South Island province of Otago was named New Zealand's domestic player of the year in March after leading the first class Plunket Shield competition with 33 wickets for Wellington at an average of 17.\nNew Zealand Cricket rarely offers contracts to players without a single international to their name, and Smith is eager to repay the board's faith in him.\n\"I love cricket so all formats are great, they have their own little niches,\" he told reporters on Tuesday.\n\"But for me, I'm a purist so I love the long format of the game. It's probably a format that I've had the most success in so far.\n\"That doesn't mean to say I'm not trying to become an all-format player. I definitely think I can play all three formats.\n\"For me, it's just about trying to stay on the park, stay fit and hopefully perform for whoever I'm playing for.\"\nSmith was one of two all-rounders handed a central contract for the first time in the 20-man list published on Tuesday, with Central Stags' Josh Clarkson the other after making his international debut in limited overs cricket over the last home summer.\nSmith and Clarkson effectively replaced batsmen Devon Conway and Finn Allen, who both opted out of contracts.\nWith Kane Williamson also opting out to play in South Africa's SA20 league, the exodus of formerly contracted players has alarmed some New Zealand fans and pundits.\nSmith, a zippy medium pacer, has shown great promise in white ball formats and took an eye-catching 4-5 against the Otago Volts in the best figures recorded in New Zealand's domestic T20 competition last season.\nHe spent the New Zealand winter in England, taking eight wickets and scoring 144 runs at an average of 24 for Worcestershire county in the T20 Blast competition.\nOther lucrative stints in T20 franchise cricket may beckon but Smith was adamant he could not have said \"yes\" any quicker when offered a New Zealand contract.\n\"Each guy's going to make their own decision about what they want to do for their career but for me at this stage it's about having a really good international career for New Zealand,\" he added.\n\"So I just (want to) keep building my career and hopefully it sorts itself out.\"\nNew Zealand host England in three tests from Nov. 28, and Smith will be gunning for the number seven spot in the team last occupied by South Africa-born spin bowling all-rounder Glenn Phillips.\nHe said he would be happy to open the bowling if given a chance to elbow out New Zealand's regular quicks.\n\"I like to take the new ball, I think it's a real strength of mine. But I think I can have an impact with the old ball as well.\" REUTERS", "url": "https://www.straitstimes.com/sport/uncapped-smith-earns-new-zealand-contract-in-big-show-of-faith"}