{"authors": [], "date_download": "2024-10-12 13:33:57", "date_modify": "2024-10-12 13:33:57", "date_publish": "2024-10-01 18:06:48", "description": "She retired from wrestling after she was disqualified ahead of the Paris Olympics women’s 50 kg freestyle final. Read more at straitstimes.com.", "filename": "sport_indian-olympian-vinesh-phogat-swops-wrestling-arena-for-politics_1728740037.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/01/2024-10-01T062254Z1628366440RC2H7AATDCVXRTRMADP3INDIA-POLITICS-WRESTLER.JPG?VersionId=HuGxKAyPUhk4qx5hlNlDfYcEIEf4cwzu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_indian-olympian-vinesh-phogat-swops-wrestling-arena-for-politics_1728740037.html", "title": "Indian Olympian Vinesh Phogat swops wrestling arena for politics", "title_page": "Indian Olympian Vinesh Phogat swops wrestling arena for politics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "JULANA – Indian Olympic wrestling star Vinesh Phogat was disqualified from the Paris Games, but she is determined to keep fighting for her constituency and against sexual harassment of women as she contests state elections on Oct 5.\nPhogat retired from wrestling after she was disqualified ahead of the women’s 50 kg freestyle final for failing to make weight by 100g despite starving herself for a week.\nShe now spends her days campaigning in her native state of Haryana for the main opposition Congress Party, receiving blessings from party elders and building on momentum she and other wrestlers created in 2023 by protesting against a politician who allegedly sexually harassed women athletes.\n“I’m here to bring change in all sectors and take care of everyone equally, especially the women in my constituency,” Phogat, 30, said ahead of one of her door-to-door campaigns.\n“It’s crucial that the struggle we started against sexual harassment two years ago meets a beautiful and fulfilling ending. Harassment happens in all sectors, some cases come into public light and some do not.”\nPhogat and other wrestlers including Sakshi Malik, an Olympic bronze medallist, were the faces of a months-long protest demanding criminal action against the then chief of the Wrestling Federation of India, Brij Bhushan Sharan Singh.\nA Delhi court in 2024 charged Singh, a former lawmaker from Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP), with sexual harassment and criminal intimidation. He denied any wrongdoing.\nPhogat is a celebrity in the Julana constituency of Haryana, and her family of wrestlers were the subject of Bollywood blockbuster “Dangal”.\nShe recalled how empty she felt after her disqualification from the Olympics, but said the support of her community helped her find a new purpose in politics.\n“I used to stay home all day. But hundreds of people visited me every day, asked me to not abandon the spirit of the fighter,” she said.\nHer new career will be challenging. Congress has won the Julana constituency only four times since 1967, although opinion polls predict Modi’s BJP could lose the Haryana election this time. Results will be out on Oct 8.\nSeveral voters – many of them women – predicted a landslide win for Phogat.\n“If women didn’t support women, who would,” said a young woman voting for the first time.\nAlso turning to politics is Bajrang Punia, who won the bronze in men’s 65kg wrestling at the Tokyo Olympics in 2021. He has been named working chairman of the All India Kisan Congress. REUTERS", "url": "https://www.straitstimes.com/sport/indian-olympian-vinesh-phogat-swops-wrestling-arena-for-politics"}