{"authors": [], "date_download": "2024-10-12 13:42:41", "date_modify": "2024-10-12 13:42:41", "date_publish": "2024-01-04 14:14:46", "description": "Crystal Palace boss Roy Hodgson said he was confident Wayne Rooney would be in the running for future managerial roles after the former England international was sacked by Birmingham City on Tuesday. Read more at straitstimes.com.", "filename": "sport_football_palace-manager-hodgson-backs-rooney-to-bounce-back-from-sacking_1728740561.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/04/LYNXMPEK03057-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_palace-manager-hodgson-backs-rooney-to-bounce-back-from-sacking_1728740561.html", "title": "Palace manager Hodgson backs Rooney to bounce back from sacking", "title_page": "Palace manager Hodgson backs Rooney to bounce back from sacking | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Crystal Palace boss Roy Hodgson said he was confident Wayne Rooney would be in the running for future managerial roles after the former England international was sacked by Birmingham City on Tuesday.\nRooney was appointed Birmingham manager in October when the club were sixth in the second-tier Championship, but was sacked this week after they won just two of his 15 games in charge and fell to 20th, six points above the relegation zone.\n\"He's got an outstanding football brain and was a magnificent footballer,\" Hodgson, who coached Rooney during his tenure as England manager, told reporters on Wednesday ahead of Palace's FA Cup game against Everton on Thursday.\n\"I'm sad that it happened but I know he will bounce back. I read he will take a little break from the game. That's an intelligent thing to do.\n\"There's no doubt that Wayne Rooney will always be on people's lips and minds when it comes to future jobs. He really does understand football. He's proved that as a player - he was very thoughtful and astute tactically.\"\nRooney is among a number of former England players to have struggled in managerial roles in recent years, with Frank Lampard and Steven Gerrard having unsuccessful spells at Everton and Aston Villa.\nHodgson said ex-players are often judged severely after being appointed to top roles.\n\"They will be welcomed into a club because of their name and they will be expected to suddenly take over a team that hasn't been doing brilliantly and make it fly,\" he added.\n\"That's an unrealistic demand. They all have to say they didn't really get a good chance. No one gave them two years, didn't give them three transfer windows, a chance.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/palace-manager-hodgson-backs-rooney-to-bounce-back-from-sacking"}