{"authors": [], "date_download": "2024-10-12 14:13:45", "date_modify": "2024-10-12 14:13:45", "date_publish": "2023-09-27 11:16:31", "description": "Kwon Soon-woo smashed his racket and refused to shake hands with his opponent on Monday. Read more at straitstimes.com.", "filename": "sport_tennis_games-south-korea-mulls-measures-after-tennis-player-wrecks-racket_1728742425.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/27/LYNXMPEJ8Q02H-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_games-south-korea-mulls-measures-after-tennis-player-wrecks-racket_1728742425.html", "title": "South Korea mulls measures after tennis player wrecks racket at Asian Games", "title_page": "South Korea mulls measures after tennis player wrecks racket at Asian Games | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SEOUL - South Korea's sports authorities said they will take measures to address the \"unsportsmanlike\" conduct of tennis player Kwon Soon-woo at the Asian Games after he smashed his racket and refused to shake hands with his opponent on Monday.\nVideo of Kwon's meltdown after losing 6-3 5-7 6-4 to Thailand's Kasidit Samrej went viral on social media, racking up over one million views on China's Weibo platform and drawing the ire of netizens at home in South Korea.\nThe incident came in the second round of the men's singles competition at Hangzhou Olympic Sports Center in eastern China, where 112th ranked Kwon had been expected to beat the 634th ranked Thai.\nIn a statement on Tuesday, the Korean Sport and Olympic Committee (KSOC) said Kwon's actions were \"extremely regretful\".\n\"We will take appropriate measures for the situation through a comprehensive review after the Games come to an end,\" KSOC said.\nKwon also drew criticism from South Korea's vice minister of culture, sports and tourism, who called the player's reaction to the defeat \"regretful.\"\nKwon apologised to Kasidit, and to his South Korean fans, in a handwritten note posted on social media.\n\"I behaved recklessly soon after a match ended and I shouldn't have as a national team player,\" he said. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/games-south-korea-mulls-measures-after-tennis-player-wrecks-racket"}