{"authors": [], "date_download": "2024-10-12 14:16:24", "date_modify": "2024-10-12 14:16:24", "date_publish": "2024-01-31 18:11:45", "description": "Malaysia hosted F1 races at its Sepang International Circuit (SIC) from 1999 but staged its last edition in 2017. Read more at straitstimes.com.", "filename": "sport_formula-one_petronas-aiming-to-bring-back-malaysian-formula-one-gp-in-2026-sources_1728742584.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/31/LYNXMPEK0U08B-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_petronas-aiming-to-bring-back-malaysian-formula-one-gp-in-2026-sources_1728742584.html", "title": "Petronas aiming to bring back Malaysian Formula One GP in 2026: sources", "title_page": "Petronas aiming to bring back Malaysian Formula One GP in 2026: sources | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "KUALA LUMPUR – Malaysia’s state oil company Petroliam Nasional – or Petronas – is looking to bring back Formula One races to the country in 2026 after a nine-year hiatus, according to three sources with knowledge of the matter.\nThe South-east Asian nation hosted a leg of the F1 world championship at its Sepang International Circuit (SIC) from 1999, but staged its last race in 2017 due to declining ticket sales and rising costs of hosting the event.\nPetronas, Malaysia’s only Fortune 500 company, won naming rights to the SIC for three years last October. The circuit continues to host MotoGP races and other motor sport events.\nPetronas’ plan to bring back the F1 race was revealed during a company townhall led by the firm’s president and chief executive Tengku Muhammad Taufik Tengku Aziz on Jan 30, the sources said, declining to be identified as they were not authorised to speak to the media.\nThe sources did not elaborate on the reasons for the potential return. Petronas, the SIC and the Malaysian Prime Minister’s Office did not immediately respond to requests for comment.\nIn 2023, Malaysia’s Youth and Sports Minister Hannah Yeoh said that hosting an F1 race was “very expensive” and added that: “If we could host an F1 race, we already would have done it – but for now, we can’t afford to have races.”\nF1’s office also did not immediately reply to a request for comment.\nThe sport’s popularity has widened globally in recent years, driven by the Formula 1: Drive To Survive Netflix TV series and as more countries vie to host the races to raise visibility, boost tourism and stimulate their economy.\nFormula One announced last week that Madrid will host the Spanish Grand Prix from 2026 to 2035 on a new circuit that will have both street and non-street sectors.\nThe new 5.47km circuit will be built in and around Madrid’s Ifema convention centre in the north of the Spanish capital and will feature 20 corners, organisers said in a statement.\nIt will have the capacity to receive over 110,000 spectators per day, which could increase to 140,000 and “making Madrid one of the largest venues on the F1 calendar”.\nThere is clear potential for growth in the sport and Malaysia could be looking to capitalise.\nThree-time F1 world champion Max Verstappen won the last Malaysian Grand Prix in 2017 while Lewis Hamilton, Mercedes’ seven-time champion, won the drivers’ championship that year.\nPetronas has been a sponsor of the Mercedes team since 2010, with the partnership bearing eight constructors’ and seven drivers’ world championships – including one from the retired Nico Rosberg.\nThe team ranked second in the constructors’ standings last season, with Hamilton in third and teammate George Russell in eighth in the drivers’ standings.\nPetronas is due to announce its full year 2023 and fourth-quarter earnings profit in early March.\nThe company in November posted a lower third-quarter profit on the back of softer revenue due to lower average realised oil and gas prices. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/formula-one/petronas-aiming-to-bring-back-malaysian-formula-one-gp-in-2026-sources"}