{"authors": [], "date_download": "2024-10-12 14:17:24", "date_modify": "2024-10-12 14:17:24", "date_publish": "2023-09-23 16:46:22", "description": "The McLaren duo of Oscar Piastri and Lando Norris qualified second and third respectively. Read more at straitstimes.com.", "filename": "sport_formula-one_max-verstappen-takes-pole-for-japanese-grand-prix-with-a-mighty-lap_1728742644.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/23/AUTO-PRIX-F1-JPN-QUALIFYING-081051.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_max-verstappen-takes-pole-for-japanese-grand-prix-with-a-mighty-lap_1728742644.html", "title": "Red Bull’s Max Verstappen takes pole for Japanese Grand Prix with a ‘mighty’ lap", "title_page": "Red Bull’s Max Verstappen takes pole for Japanese Grand Prix with a ‘mighty’ lap | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SUZUKA – Formula One leader Max Verstappen blew away all doubts about Red Bull’s enduring dominance on Saturday with a “mighty” pole lap in Japan ahead of McLaren’s Oscar Piastri and Lando Norris.\nThe 25-year-old had been fastest throughout all three practice sessions at Suzuka and saved the best for qualifying, lapping with a final effort of 1min 28.877sec.\nAustralian rookie Piastri joined him on the front row but was a massive 0.581 of a second off the Dutchman’s time.\nVerstappen, whose record run of 10 wins in a row ended in Singapore last weekend when he finished fifth, said it had been an incredible couple of days so far.\n“We had a bad weekend. Of course then people start talking about ‘Ah, it’s all because of the technical directives’,” he told reporters.\n“I think they can go suck on an egg. But for my side, I was just very fired up to have a good weekend here and make sure that yeah, we were strong.”\nRed Bull boss Christian Horner, whose team are set to secure the constructors’ title on Sunday for a second year in a row even if Verstappen will have to wait for his third drivers’ crown, marvelled at what he had seen.\n“I think what we’ve witnessed today is something very special,” he told Sky Sports television.\n“That first sector was absolutely mighty. That first run looked good enough to get the job done but then he just went quicker again. All his laps have been stunning today... it’s been an absolutely mind-blowing performance.”\nVerstappen, who leads teammate and nearest rival Sergio Perez by 151 points in the championship standings, cannot clinch his third title yet but a favourable result can set him up to seal the deal at the Qatar Grand Prix on Oct 8.\nPiastri, meanwhile, said that he could have done a better job at the last chicane but it had been a good weekend with an upgraded McLaren.\n“It’s the first time I’ve started on the front row for a while, it will be cool,” said the 22-year-old, who sat out last season as Alpine reserve after winning the Formula Two title in 2021.\n“There is only one car ahead to try and overtake so I’ll try and make that happen.”\nMcLaren boss Zak Brown was thrilled with both the performances of Piastri and Norris, who built on momentum from his runner-up finish in Singapore.\n“We have been strong all weekend. Oscar and Lando are driving great,” he said.\n“They are definitely getting the best out of this car...\n“It’s pretty fast and we just have to keep pushing to see if we can get that Max guy!”", "url": "https://www.straitstimes.com/sport/formula-one/max-verstappen-takes-pole-for-japanese-grand-prix-with-a-mighty-lap"}