{"authors": ["Melvyn Teoh"], "date_download": "2024-10-12 13:40:47", "date_modify": "2024-10-12 13:40:47", "date_publish": "2024-05-04 06:00:00", "description": "Success after recovering from wrist fracture was significant for Paralympic champion. Read more at straitstimes.com.", "filename": "sport_2023-st-athlete-of-the-year-nominee-yip-pin-xiu_1728740447.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/04/WJ9131.jpg?VersionId=4nOXhFXEqBYz2RZ5ylPwx_8Px8iAzM3n", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_2023-st-athlete-of-the-year-nominee-yip-pin-xiu_1728740447.html", "title": "Setting world record in S’pore was phenomenal: 2023 ST Athlete of the Year nominee Yip Pin Xiu", "title_page": "Setting world record in S’pore was phenomenal: 2023 ST Athlete of the Year nominee Yip Pin Xiu | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The Straits Times celebrates outstanding Singaporeans selected for the 2023 ST Athlete of the Year award, backed by 100Plus. To understand our nominees better, we asked them to share how songs or movies inspire them, what books or memorable quotes have left an impression on them and what was their sporting moment of 2023. This is what swimmer Yip Pin Xiu told Melvyn Teoh.\nQ. What are three songs that are meaningful to you?\nThe Fight Song by Rachel Platten. It was played at the 2015 Asean Para Games, all of us had to choose a song and that was the song that I chose and if you touch the wall first and win a gold medal, they will play that song in celebration.\nHall Of Fame by The Script. This used to be my alarm for waking up when I was younger, when I was in school and had to do a lot of 5am training. It just gave me a bit more motivation to remember what I was waking up so early for.\nWe Are The Champions by Queen. That was the song that the entire team were singing to in Beijing in 2008 when I won Singapore’s first Paralympic gold medal.\nQ. A book or quote that you like?\nA quote that I’ve always lived with is “not to worry about things that I cannot control”. It was something that my psychologist imparted to me at a pretty young age, during my first Paralympic cycle before I was 16.\nIt is extremely helpful because there are so many things in life that I can worry about. I can worry about how fast my competitors swim, whether it rains today and it affects my training, but these are things that I cannot control. So why waste the time and effort to worry about them?\nSo (you have to) really find things within your control and to work on them.\nQ. Your favourite sporting moment of 2023?\nA significant sporting moment for me in 2023 was breaking the world record on home ground – it was the 200m freestyle and the very first time I broke that record. And to do it in front of all my friends and family cheering me on, that was phenomenal.\nThe previous year was hard because I broke my hand in November 2022. I fell and broke my wrist and I was out of training for six weeks. The six weeks were difficult because I couldn’t really do any other form of sport, I still went to the gym and just really tried to do anything I could in my ability to maintain my fitness.\nTo be able to come back so strong and break the world record, it was a significant year for me. I worked really hard to make sure that I healed properly, followed every single instruction and tried to be the best athlete that I could be to recover well and to start racing again.\nQ. Advice you would give yourself in January 2023?\nThe advice I’d give myself is that every year is going to be different. Even though swimming is swimming, and the Paralympics is the Paralympics, every year will be different.\nIt would be great if I could take this learning opportunity and always learn and be better, and also be more patient with myself and everybody else.\nSometimes even if I don’t see progression, I must trust the process and know that the end is to identify my goals and then work towards them.", "url": "https://www.straitstimes.com/sport/2023-st-athlete-of-the-year-nominee-yip-pin-xiu"}