{"authors": [], "date_download": "2024-10-12 13:48:07", "date_modify": "2024-10-12 13:48:07", "date_publish": "2022-01-07 04:34:44", "description": "WHO worked with the International Olympic Committee to provide technical advice on safe hosting. Read more at straitstimes.com.", "filename": "sport_olympics-covid-19-plans-for-beijing-winter-games-look-strong-says-who_1728740887.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/01/07/2022-01-06T145213Z_377849309_RC2GTR9DAFSE_RTRMADP_3_OLYMPICS-2022_0.JPG?VersionId=rWksg5uT4u.0u6xiFrF4hV_.2t1pec6i&h=7c7a38d6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_olympics-covid-19-plans-for-beijing-winter-games-look-strong-says-who_1728740887.html", "title": "Olympics: Covid-19 plans for Beijing Winter Games look strong, says WHO", "title_page": "Olympics: Covid-19 plans for Beijing Winter Games look strong, says WHO | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "GENEVA (AFP) - Beijing's plans to ensure next month's 2022 Winter Olympics go ahead safely during the Covid-19 pandemic look strong, the World Health Organisation said on Thursday (Jan 6).\nWHO emergencies director Michael Ryan said the UN health agency had worked with the International Olympic Committee to provide technical advice on the safe hosting of the Games.\n\"The Chinese authorities have very strict measures in place, and they've released a series of different playbooks. We continue to review those playbooks with the IOC,\" he told a news conference.\n\"I'm confident that given the information we have, that the measures that are in place for the Games are very strict and very strong and we don't, at this point, see any increased risk of disease transmission in that context.\"\nHowever, he said China had witnessed some large Covid-19 outbreaks in recent weeks and Beijing would take a \"very strong approach\" to dealing with them.\n\"We will continue to monitor the situation,\" Ryan said.\n\"But certainly at this stage, given the arrangements that have been put in place for the athletes by the organisers, we don't perceive that there's any particular extra-risk in hosting or running the Games.\n\"But obviously we will keep all of the measures that are being put in place are under constant review.\"\nOlympic chiefs on Wednesday urged all participants at the Games to be \"extra vigilant\" as Covid-19 infections hit unprecedented case levels in several countries.\nAt a closed-door meeting with national Olympic committees, Beijing 2022 organisers, international federations and the IOC dismissed any idea of a postponement of the Feb 4-20 Games due to the pandemic.\nBeijing sealed up its Winter Olympic \"bubble\" on Tuesday, preparing the Games venues, transport and staff for the world's strictest mass sporting event during the global pandemic.\nChina, where the virus emerged toward the end of 2019, has pursued a zero-tolerance strategy on Covid-19 and is taking the same approach to limit the pandemic's potential impact on the Winter Olympics and subsequent Paralympics.\nWHO chief Tedros Adhanom Ghebreyesus was asked if he would be attending the Beijing Games, as he did with the Tokyo 2020 Summer Olympics, which were postponed until last year due to the Covid crisis.\nHowever, a spokeswoman said the WHO does not discuss the travel plans of its staff.", "url": "https://www.straitstimes.com/sport/olympics-covid-19-plans-for-beijing-winter-games-look-strong-says-who"}