{"authors": ["David Lee"], "date_download": "2024-10-12 13:41:48", "date_modify": "2024-10-12 13:41:48", "date_publish": "2024-08-03 04:06:31", "description": "The Singaporean injured his racket hand early in the match and eventually lost 21-9, 21-17. Read more at straitstimes.com.", "filename": "sport_loh-kean-yew-loses-to-defending-champion-viktor-axelsen-in-olympic-badminton-q-finals_1728740508.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/03/2024080345139401img2499_0.jpg?VersionId=TsgMBTjaZZ19R1ejQaXwLssa5zjFv77i", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_loh-kean-yew-loses-to-defending-champion-viktor-axelsen-in-olympic-badminton-q-finals_1728740508.html", "title": "It’s heartbreaking, says Loh Kean Yew after loss to Olympic champion in badminton q-finals", "title_page": "It’s heartbreaking, says Loh Kean Yew after loss to Olympic champion in badminton q-finals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – It was the best of times. Riding the high of beating China’s world No. 6 Li Shifeng in the Olympic Games round of 16, Singapore’s 12th-ranked Loh Kean Yew felt he had momentum.\nHe felt relaxed and confident of beating Denmark’s world No. 2 Viktor Axelsen in the next round, despite a 2-8 head-to-head record.\nIt was also the worst of times. Just 10 points into their quarter-final at the Porte de la Chapelle Arena on Aug 2, at 3-7 down, Loh dived to retrieve the shuttlecock and injured his right hand.\nSome thick bandage and tape stopped the bleeding but it also restricted his game as he lost the first game too easily.\nIn the second game, it was 8-8 when he needed another medical timeout. Axelsen, smelling blood from the disruption, never trailed after that and killed off the tie despite facing stronger resistance.\nAfter losing 21-9, 21-17, the 27-year-old said: “I couldn’t really grip my racket because there’s something in the way and it becomes sticky. I was just trying to adjust to that stupid grip. I got used to it, then they had to re-tape it, and it’s different again.”\nLegacy matters to Loh and he joins Ronald Susilo (men’s singles, Athens 2004) and Jiang Yanmei and Li Yujia (women’s doubles, Beijing 2008) as the only Singaporean badminton players to have made the last eight. But losing also hurts when he was just two wins away from a historic medal.\n“Yes, it is heartbreaking because this is the Olympics,” he said.\n“You prepared for three years for this moment. There are a lot of ups and down... it’s about peaking at the right time, at the right place, against the right opponent. The journey is a very special one.\n“I’m satisfied, but at the same time no. I’m happy I gave my all and with how far I reached, but it’s also heartbreaking that I couldn’t go further... I’m sad, especially with the first game in which I couldn’t perform very well. I was hoping to put on a better show.”\nLoh shared that he had sensed some nerves in his pal Axelsen, as confirmed by the Dane’s father, who told The Sunday Times that “he really wanted this win very badly”.\nBut the 30-year-old thrives in such situations, barely making any unforced errors in the first game as he used his 1.94m frame to counter his opponent’s attacks.\nLoh went for broke in the second game, mixing winners with wild shots as he reeled off five straight points to make it 14-14, only to lose four consecutive points and eventually the match when he hesitated on taking a shot in the back court.\nA respectful Axelsen said: “In a match like this when I play a good friend like Loh, it’s sad that there can’t be two winners. That being said, I’m obviously very, very happy about the performance. I played very confidently, I played a good game plan and I followed through with everything I wanted to do.”\nHe next faces India’s 22nd-ranked Lakshya Sen in the semi-finals on Aug 4. Sen had earlier beaten Chinese Taipei’s world No. 11 Chou Tien-chen 19-21, 21-15, 21-12.\nThe other last-four clash is between Thailand’s world champion Kunlavut Vitidsarn and Malaysia’s seventh-ranked Lee Zii Jia. They had beaten China’s top-ranked Shi Yuqi 21-12, 21-10 and Denmark’s world No. 3 Anders Antonsen 21-17, 21-15 respectively.", "url": "https://www.straitstimes.com/sport/loh-kean-yew-loses-to-defending-champion-viktor-axelsen-in-olympic-badminton-q-finals"}