{"authors": [], "date_download": "2024-10-12 13:42:28", "date_modify": "2024-10-12 13:42:28", "date_publish": "2024-02-09 23:40:34", "description": "Spaniard is again ruled out of action, having only just returned to the first team. Read more at straitstimes.com.", "filename": "sport_football_thiago-injury-not-good-news-says-liverpool-boss-klopp_1728740548.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/10/11126892.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_thiago-injury-not-good-news-says-liverpool-boss-klopp_1728740548.html", "title": "Thiago injury ‘not good news’, says Liverpool’s Klopp", "title_page": "Thiago injury ‘not good news’, says Liverpool’s Klopp | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LIVERPOOL, England - Liverpool midfielder Thiago Alcantara's injury is \"not cool\" manager Juergen Klopp said on Feb 9, after the Spaniard was ruled out of action having only just returned to the first team.\nThe 32-year-old had been out since April with a hip issue, and only came on as a late substitute in their 3-1 defeat to Arsenal on Feb 4 after he had \"looked fantastic in training\".\nHe is sidelined again, however, after suffering what Klopp called a muscle injury and will be absent for their Premier League game against relegation-threatened Burnley on Feb 10 along with the injured Mohamed Salah and Dominik Szoboszlai.\nConor Bradley is still with his family following the death of his father.\n\"The situation with Thiago is obviously not cool,\" Klopp told reporters.\n\"We don't know the extent yet. It's not good news for him or the club, on top of losing the game.\n\"It's not a big, big injury, definitely not, but it's something nobody needed.\"\nBradley's father Joe died three days after the 20-year-old scored his first Premier League goal and had two assists in an electric performance in Liverpool's 4-1 thrashing of Chelsea on Jan 31.\n\"The boy gets as long as he needs with his family,\" Klopp said.\n\"I think, from next week on, he will be back in training, but we have to see. If he doesn't feel ready for that, then that's fine as well.\n\"There's absolutely no rush from us. The only thing we want to do is to support him as much as we can.\"\nBradley had been brilliant after replacing injured Trent Alexander-Arnold in Liverpool's back line, helping them stay top of the table despite injuries to several key players.\nKlopp's team remain top on 51 points after 23 games despite their loss to Arsenal. Manchester City, who have 49 points and a game in hand, can go above Liverpool in the Feb 10 early game against Everton.\nSalah, the league's joint top scorer with City's Erling Haaland, is recovering from a hamstring injury sustained while playing for Egypt in the Africa Cup of Nations.\n\"He's going in the right direction and we hope that he will be part of training next week but we will see,\" Klopp said. \"He's going through his paces now but it's positive. It will be next week or the week after.\"\nSzoboszlai remains out after aggravating a hamstring injury.\n\"He is running outside in the winter rain but he's not ready for tomorrow,\" Klopp said. \"We have to see with tendons, the players are pain-free pretty quickly, but it's not good he's got it again.\"\nThe Arsenal loss was Liverpool's first in 16 league games. Asked if it felt like a setback, Klopp said: \"We lost a game and it felt like that, definitely ... but not because the situation with the table, just because we lost the game and we didn't play a particularly good game.\"\n\"A few days before, we played in parts our best game of the season, a complete performance against Chelsea. Top class.\n\"It's always a challenge, we don't take these things lightly and we have to show a reaction.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/thiago-injury-not-good-news-says-liverpool-boss-klopp"}