{"authors": [], "date_download": "2024-10-12 13:44:59", "date_modify": "2024-10-12 13:44:59", "date_publish": "2023-10-13 20:28:45", "description": "The Olympic Council of Asia's presidential elections must be ruled invalid following interference of former president, Kuwait's Sheikh Ahmad Al-Fahad Al-Sabah, the International Olympic Committee's Chief Ethics and Compliance Officer said. Read more at straitstimes.com.", "filename": "sport_olympics-oca-elections-must-be-invalid-over-sheikh-ahmad-interference-ioc-ethics-chief_1728740699.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/13/LYNXMPEJ9C0LC-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_olympics-oca-elections-must-be-invalid-over-sheikh-ahmad-interference-ioc-ethics-chief_1728740699.html", "title": "Olympics-OCA elections must be invalid over Sheikh Ahmad interference-IOC ethics chief", "title_page": "Olympics-OCA elections must be invalid over Sheikh Ahmad interference-IOC ethics chief | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MUMBAI - The Olympic Council of Asia's presidential elections must be ruled invalid following interference of former president, Kuwait's Sheikh Ahmad Al-Fahad Al-Sabah, the International Olympic Committee's Chief Ethics and Compliance Officer said.\nIn a report to the OCA seen on Friday by Reuters, Paquerette Girard Zappelli said the July 8 vote in which the Sheikh's brother, Sheikh Talal Fahad Al-Ahmad Al-Sabah, was appointed president, should be annulled.\nShe said the OCA should \"declare the elections held on 8 July 2023 as invalid, to review the OCA Constitution, in particular to make it compliant... with regard to the election process, transparency, and checks and balances.\"\nShe also told the OCA to convene a general assembly to approve the new constitution and to organise new\nelections.\nIn an accompanying letter to acting OCA president Randhir Singh, Girard Zappelli said Sheikh Talal did not meet election criteria.\n\"It appeared from the OCA’s Election Process Review that Sheikh Talal Fahad Al-Ahmad Al-Sabah did not fulfil the eligibility conditions defined by the OCA Constitution,\" she said. \"The candidate should have been declared ineligible from the outset.\"\nSheikh Ahmad, once an extremely powerful figure in world sport and a former close ally of IOC President Thomas Bach, was banned from the IOC for three years in July after it found he had an \"undeniable impact\" on the vote that got his brother elected.\nSheikh Ahmad has since lodged a case against the IOC at the Court of Arbitration for Sport (CAS).\nHe had travelled to Bangkok ahead of the OCA election in July and was in the city when it took place, which was seen as interfering with the election process.\nHe has denied any wrongdoing.\nSheikh Talal was due to take over from India's Randhir Singh, who was appointed acting president of the OCA in 2021 when Sheikh Ahmad stepped down after being convicted by a Swiss criminal court of forgery.\nSheikh Ahmad denied all the charges in the case and appealed the conviction. He is awaiting the outcome of the appeal. REUTERS", "url": "https://www.straitstimes.com/sport/olympics-oca-elections-must-be-invalid-over-sheikh-ahmad-interference-ioc-ethics-chief"}