{"authors": [], "date_download": "2024-10-12 14:16:57", "date_modify": "2024-10-12 14:16:57", "date_publish": "2023-10-20 01:55:36", "description": "Stewards will be able to fine drivers the maximum amount - an increase from the current limit of €250,000. Read more at straitstimes.com.", "filename": "sport_formula-one_f1-drivers-risk-million-euro-fines-after-rule-change_1728742617.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/20/LYNXMPEJ9I0YH-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_f1-drivers-risk-million-euro-fines-after-rule-change_1728742617.html", "title": "F1 drivers stunned by threat of €1 million fines", "title_page": "F1 drivers stunned by threat of €1 million fines | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "AUSTIN – Formula One drivers expressed shock and amazement on Thursday after the sport’s governing body quadrupled the amount stewards can fine them to a maximum of €1 million (S$1.45 million).\nThe change to the International Sporting Code (ISC) was approved at a meeting of the FIA’s World Motor Sport Council in Geneva, Switzerland.\nIt said the previous maximum of €250,000 had not been reviewed or amended for at least the last 12 years and as a result, “does not reflect the current needs of motor sport”.\nMercedes driver George Russell, a director of the Grand Prix Drivers’ Association, said the new maximum fine “seems obscene”.\n“It’s pretty ridiculous that a driver could be fined €1 million,” he said at the United States Grand Prix. “In my first year of Formula One (at Williams), I was on a five-figure salary and actually lost over six figures from paying for my trainer, paying for flights, paying for an assistant.\n“We’re doing what we love, so we’re not complaining about that. But if you take a Year 1 driver who probably by the end of the year is losing over €100,000 because of the investments he has to make, you then fine them a million. What’s going to happen?”\nDrivers already pay FIA a fee for the super licence required to race in F1. It costs €10,400 per year plus €2,100 for every championship point scored that is added the following campaign.\nFerrari’s Charles Leclerc said he had no idea what might deserve a €1 million penalty and Haas driver Kevin Magnussen, whose team have one of the smallest budgets, said it sounded ridiculous.\n“Charles can give his watch but I would disappear, never to be found again,” added the Dane.\nLeclerc had an exclusive Richard Mille watch, which was reportedly valued at more than €2 million, stolen off his wrist in Italy last season. The Monaco driver said: “I mean, some drivers are making less than that (€1 million). So it’s a lot of money.”\nMercedes’ seven-time world champion Lewis Hamilton, who was fined €50,000 in Qatar two weekends ago for crossing a live track in an incident that the FIA is reviewing, argued that the fine should go towards positive causes.\n“If they are going to be fining a million, let’s make sure that 100 per cent of that goes to a cause,” added the Briton, whose latest contract is reportedly worth £50 million (S$83.3 million) a year.\n“There’s a lot of money in this industry and there’s a lot more we need to do in terms of creating better accessibility, better diversity, more opportunities for people who wouldn’t normally have a chance to get into a sport like this.\n“So many causes around the world. So that’s the only way they’ll get that million from me.”\nTriple world champion Max Verstappen was fined €50,000 in 2021 for touching the rear wing of Hamilton’s car after qualifying for the Brazilian Grand Prix.\nThe Red Bull driver was also perplexed by the new regulations. “If touching a rear wing is €50,000, then I would like to know what €1 million is,” said the Dutchman.", "url": "https://www.straitstimes.com/sport/formula-one/f1-drivers-risk-million-euro-fines-after-rule-change"}