{"authors": [], "date_download": "2024-10-12 13:34:52", "date_modify": "2024-10-12 13:34:52", "date_publish": "2024-09-25 17:57:10", "description": "American veteran believes it would be “fun” playing in front of a partisan crowd in Montreal. Read more at straitstimes.com.", "filename": "sport_it-s-going-to-be-fun-playing-villain-at-presidents-cup-us-team-captain-jim-furyk_1728740092.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/25/CHT-GLF-SPO-USP-BOEING-CLASSIC-ROUND-ONE-024222.jpg?VersionId=OTh_nfTJKSv_0616XA_Y33zbKKaQ4kQJ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_it-s-going-to-be-fun-playing-villain-at-presidents-cup-us-team-captain-jim-furyk_1728740092.html", "title": "It’s going to be fun playing ‘villain’ at Presidents Cup: US Team captain Jim Furyk", "title_page": "It’s going to be fun playing ‘villain’ at Presidents Cup: US Team captain Jim Furyk | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Every captain has his own personality. A lot of the guys know me very well, and I’m not a rah-rah type of guy. If I acted like that, the guys would look at me funny. I kind of lead more by example. I have played on a lot of Ryder Cup teams and Presidents Cup teams, and I believe the guys understand who I am.\nThey know how much these events mean to me, and I know it also means a lot to them. I don’t think you need to go into the team room and explain how important the event is.\nThe guys are nervous, they want to play well for our country and play alongside their buddies. It’s more about providing a great atmosphere for them, whether that’s in the team room or at the hotel, so they can play their best golf.\nAfter I was named captain, everyone talked about the pressure for our team to maintain our winning streak where we’ve won the last nine editions.\nI mean, a team change every year and it’s often a different set of 12 players competing on a different golf course.\nWhat we can do is learn from things we’ve done well as a team in the past and apply those lessons to a new group.\nWe intend to go to Canada and come back with a victory. I don’t feel any more pressure or any less pressure as a captain simply because we have had success in the past. I expect a tough fight as the International Team have become very competitive.\nI know Mike Weir (International team captain) and I are both excited for this Presidents Cup, and I’ve enjoyed some good memories of Montreal. It’s a wonderful city, Royal Montreal is a great golf course and I have fond memories of the Presidents Cup when it was played there in 2007.\nI’ve also enjoyed a long relationship with the country as I won the Canadian Open in 2006 and 2007, and winning their national championship two years in a row, the Canadian fans have always treated me very well, very friendly.\nI might have said previously I feel like an adopted son over there, but maybe not during the week of the Presidents Cup. Mike is certainly a national hero over there, having won the Masters and carrying the torch for a long time for Canadian golf.\nWhen we played the Presidents Cup at Royal Montreal in 2007, the Canadian fans were good sporting fans. Of course, they rooted really hard for their home team and for Mike, being the lone golfer from Canada on that team then.\nThey were boisterous but, by the time we got to the singles on Sunday, we were pretty far ahead. However, the noise and the exuberance that day, and having Mike play Tiger Woods in the singles, it was big.\nUltimately, this is an away game for us, and I expect Canadian fans and international fans to be cheering their team. That’s part of being on the road. I think it’s fun both ways.\nI enjoy being at home but, sometimes, it’s fun being on the road too, and playing the “villain”. I expect the fans to be boisterous. But I’m excited. I want our 12 guys to really enjoy being the away team, and we’ll take great pride in that and go in there to play hard.", "url": "https://www.straitstimes.com/sport/it-s-going-to-be-fun-playing-villain-at-presidents-cup-us-team-captain-jim-furyk"}