{"authors": [], "date_download": "2024-10-12 14:08:57", "date_modify": "2024-10-12 14:08:57", "date_publish": "2024-09-24 13:40:07", "description": "Surging interest in women’s basketball this season has ushered in a new era for the sport. Read more at straitstimes.com.", "filename": "sport_basketball_new-york-liberty-riding-wnba-boom-into-play-offs_1728742137.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/24/BKP-SPO-WBA-ATLANTA-DREAM-V-NEW-YORK-LIBERTY-012607.jpg?VersionId=ft2la_j4IUfPX6vlGZfjHcrKM19h5syX", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_new-york-liberty-riding-wnba-boom-into-play-offs_1728742137.html", "title": "New York Liberty riding WNBA boom into play-offs", "title_page": "New York Liberty riding WNBA boom into play-offs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Five years ago, the New York Liberty were used to playing games in a deserted, 2,100-capacity arena out in the suburbs, a world away from the bright lights of the Big Apple.\nBut when the star-studded Women’s National Basketball Association (WNBA) team step out at a packed Barclays Centre in Brooklyn on Sept 24 (Sept 25 morning, Singapore time), they will do so as one of the hottest tickets in town, as surging interest in women’s basketball this season ushers in a new era for the sport.\n“I go to a lot of sporting events, and nothing beats the energy here,” said long-time Liberty season-ticket holder Lolita Beckwith, a professional photographer who has been following the team since the WNBA was launched in 1997.\nHer 27-year allegiance to the Liberty has encompassed the team’s early days, when they played games at the legendary Madison Square Garden, to the bleak era when the team were exiled to the suburban city of White Plains, closer to Connecticut than Brooklyn.\n“It’s just great because for 27 years, it was looked down upon,” Beckwith added.\n“No one watched, there weren’t many fans. It was mostly women and kids. So to see it become what it is now is just absolutely amazing. I wish I had a daughter so I could bring her to the games.”\nWhile the Liberty’s success on the court has undoubtedly boosted the team’s appeal, the jump in crowd sizes are part of a broader trend in a league that has enjoyed skyrocketing interest since the arrival of rookie phenomenon Caitlin Clark. The Indiana Fever star has taken the WNBA by storm in 2024 after a record-breaking US collegiate career.\nAs for the Liberty, they have rewarded the loyalty of fans such as Beckwith with the best regular season in the franchise’s history – thanks to stars of their own.\nThe team, spearheaded by the likes of Olympic gold medallists Sabrina Ionescu and Breanna Stewart, finished top of the WNBA’s Eastern Conference with 32 wins and only eight defeats.\nWith the play-offs under way, the team are perfectly positioned to end a long wait for a first-ever WNBA championship.\nOn Sept 22, the Liberty demolished the Atlanta Dream 83-69 in Game 1 of their opening play-off series.\n“To have the crowd that we had here definitely made it a lot easier,” US Olympic team star Stewart said after the win.\nDuring the regular season, New York averaged more than 12,000 fans per game, a whopping 64 per cent increase on the 2023 average, which itself had surged 45 per cent from the 2022 campaign.\nThose kinds of ticket sales will be music to the ears of owner Joe Tsai, the Taiwanese-Canadian billionaire co-founder and chairman of Chinese multinational firm Alibaba, who purchased the team in 2019, and who also owns the Brooklyn Nets NBA team as well as the Barclays Centre itself.\n“Two years ago, we could barely fill the lower bowl,” said Liberty fan Justin Tartamella, 27.\nNow, thousands of fans flock to the arena wearing sneakers in the Liberty’s colours as well as T-shirts bearing the slogan “Everyone Watches Women’s Sports”.\nOther fans, meanwhile, line up to take photos with the team’s mascot, Ellie the Elephant, whose TikTok account has nearly 180,000 followers.\nFor some fans, Liberty games are an increasingly attractive option in a New York sporting landscape already studded with iconic men’s franchises. Baseball has the New York Yankees and the Mets, the NBA has the New York Knicks and the Brooklyn Nets, while the NFL offers New York Giants and New York Jets.\nAdam Reid, a 35-year-old computer programmer who recently opted for a Liberty game over a Mets fixture, explained the team’s appeal.\n“You can get very close-up seats for an affordable price, compared to a very high-up seat to the baseball game,” he said.\nIndiana’s Clark, meanwhile, has helped boost the Fever’s average crowds this season to more than 17,000 per game, with a record 20,000 fans turning out for one fixture.\nThose kinds of figures are translating to big business off the court. In late July, the WNBA announced a new 11-year broadcast contract worth an estimated US$200 million (S$257 million) per season – more than treble the previous amount.\nThe WNBA is also preparing to expand the league, with three new franchises joining the competition in coming seasons. AFP", "url": "https://www.straitstimes.com/sport/basketball/new-york-liberty-riding-wnba-boom-into-play-offs"}