{"authors": [], "date_download": "2024-10-12 13:40:28", "date_modify": "2024-10-12 13:40:28", "date_publish": "2024-05-01 04:00:52", "description": "Relegation-threatened Forest were left furious after being denied not one but three penalty claims at Goodison Park on April 21. Read more at straitstimes.com.", "filename": "sport_football_var-should-have-intervened-for-probable-forest-penalty-against-everton-says-webb_1728740428.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/01/LYNXMPEK3T0VG-1.jpg?VersionId=5mfSHWo3XD2TAon3f.pNv2F7FAtAd9j7", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_var-should-have-intervened-for-probable-forest-penalty-against-everton-says-webb_1728740428.html", "title": "VAR should have intervened for probable Forest penalty against Everton, says Howard Webb", "title_page": "VAR should have intervened for probable Forest penalty against Everton, says Howard Webb | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – The video assistant referee (VAR) should have intervened to recommend a penalty review in Nottingham Forest’s controversial 2-0 English Premier League loss to Everton, referees’ body Professional Game Match Officials Board (PGMOL) chief Howard Webb said on April 30.\nHe admitted that the VAR in charge, Stuart Attwell, should have recommended the review, which would likely have resulted in a penalty being awarded to Forest after Everton fullback Ashley Young challenged winger Callum Hudson-Odoi in the second half.\nRelegation-threatened Forest were left furious after being denied not one but three penalty claims at Goodison Park on April 21, all against Young.\nThe Midlands side issued a strongly worded statement just minutes after the game on social media platform X, accusing Attwell of being a fan of Luton Town, Forest’s relegation rivals.\nIn response, the league said it was “extremely disappointed” to read the comments made by Forest and that an investigation into the club’s statement is being conducted by the Premier League and the Football Association.\nYoung had clipped the foot of Gio Reyna in the penalty area in the first half, while the ball also struck his arm as he tried to block a cross.\nWebb said that those two penalty shouts by Forest were “really subjective calls” but the third incident, the challenge on Hudson-Odoi, should have led to a spot kick for the visitors.\n“The referee waves away the penalty appeal. The VAR looks at it and asks himself the question, ‘Was the non-award clearly and obviously wrong?’ and came to the conclusion it wasn’t,” the former Fifa referee said on the TV programme Match Officials Mic’d Up.\n“He doesn’t see a clear action by Young that he considers to be worthy of intervention, one that reaches the threshold of being very clear. But we would have preferred an intervention from the referee to go to the screen to make a judgment for himself in this situation and probably would have come out with a different outcome if that would’ve happened.”\nA day after the game, Forest submitted a formal request to the PGMOL to make the audio recordings between officials during the match public.\nIt was reported that the club eventually took up the offer to listen to the conversation in private and that it would not be made public.\nHaving been docked four points for financial breaches, Forest are 17th in the standings with 26 points.\nPromoted Luton are one place and one point below Nuno Espirito Santo’s side in the standings with three matches left. REUTERS", "url": "https://www.straitstimes.com/sport/football/var-should-have-intervened-for-probable-forest-penalty-against-everton-says-webb"}