{"authors": [], "date_download": "2024-10-12 13:35:20", "date_modify": "2024-10-12 13:35:20", "date_publish": "2024-07-16 05:02:28", "description": "They are accused of fighting security guards after the Copa America final. Read more at straitstimes.com.", "filename": "sport_colombia-soccer-federation-head-and-son-arrested-after-copa-america-final_1728740120.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/16/wgt-ramons-150724.jpg?VersionId=28qy9E4QZ5jzeXJ9jFyBHI4VJK2mxlWB", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_colombia-soccer-federation-head-and-son-arrested-after-copa-america-final_1728740120.html", "title": "Colombia football federation head and son arrested after Copa America final", "title_page": "Colombia football federation head and son arrested after Copa America final | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BOGOTA - The 71-year-old head of Colombia's football federation and his son were arrested in Miami, accused of fighting security guards after the Copa America final that saw chaotic scenes around the stadium, Miami-Dade police confirmed on July 15.\nSunday's final, which Colombia lost to Argentina, started over an hour late after police initiated a lockdown that left hundreds of fans stuck outside Florida's Hard Rock Stadium. Videos on social media showed security scuffling with fans attempting to breach the gates.\nBoth Ramon Jesurun, the federation president, and his 43-year-old son Ramon Jamil were arrested after an altercation at the stadium shortly after midnight, according to arrest reports by Miami police, which charged both men with battery.\nJeserun and his son were charged after fighting security guards in a tunnel where media were gathering in the aftermath of the match, according to the police reports.\nThis included a uniformed security guard tasked with holding back the crowd. According to police, Jeserun's son grabbed the guard by the neck and pulled him to the ground, where he punched him and kicked him in the head.\nThe Colombian football federation declined to comment.\nMore than two dozen fans were arrested at the Copa America final and over 50 people were kicked out from the venue, at which over 800 law enforcement officers were present.\nIt was the second time the United States has hosted the Americas' most important national team football tournament, founded over a century ago.\nIn a statement on July 15, the Hard Rock Stadium said it had prepared for the match by increasing the number of law enforcement officers and security, with \"more than double the personnel than a typical at-capacity stadium event.\"\nAfter gates were closed and reopened, the venue said, \"fans continued to engage in illegal conduct - fighting police officers, breaking down walls and barricades and vandalising the stadium, causing significant damage to property.\"\nThe stadium has a capacity of over 65,000 and is scheduled to host seven matches at the 2026 World Cup. REUTERS", "url": "https://www.straitstimes.com/sport/colombia-soccer-federation-head-and-son-arrested-after-copa-america-final"}