{"authors": [], "date_download": "2024-10-12 13:42:22", "date_modify": "2024-10-12 13:42:22", "date_publish": "2024-07-01 02:04:18", "description": "LEIPZIG, Germany - Austria's Konrad Laimer and his team mates are enjoying an extended stay in neighbouring Germany after winning their Euro 2024 group and the midfielder is looking forward to a return to Leipzig to face Turkey in their last 16 clash on Tuesday. Read more at straitstimes.com.", "filename": "sport_football_austria-feeling-at-home-in-germany-ahead-of-turkey-clash_1728740542.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/01/LYNXMPEK5T07V-1.jpg?VersionId=G2iZimjhIM4yaPIwu7R1bIlD3P_4PNDr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_austria-feeling-at-home-in-germany-ahead-of-turkey-clash_1728740542.html", "title": "Austria feeling at home in Germany ahead of Turkey clash", "title_page": "Austria feeling at home in Germany ahead of Turkey clash | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LEIPZIG, Germany - Austria's Konrad Laimer and his team mates are enjoying an extended stay in neighbouring Germany after winning their Euro 2024 group and the midfielder is looking forward to a return to Leipzig to face Turkey in their last 16 clash on Tuesday.\nThe Austrians surprised many by topping Group D ahead of France and the Netherlands to set up a tie against the Turks in the city where Laimer spent six years of his career with RB Leipzig before moving to Bayern Munich.\n\"In football things can always get better but if you finish first in your group then that's a very good achievement ... I had a lot of good and beautiful moments there,\" Laimer told reporters.\nThe Austrians will have had a full week of rest by the time they take on Turkey on Tuesday and, despite having beaten the Turks 6-1 in March, they are being meticulous in their preparations and taking nothing for granted.\n\"Now we have had a little more time and spread out the preparation a little bit more. It's always good when you have the time to adjust to your opponent, it feels like a long time since the last match,\" Laimer said.\nTurkey's chances suffered a blow when talisman Hakan Calhanoglu received his second booking of the tournament against the Czech Republic, which rules him out of Tuesday's game.\n\"We know that this is not a disadvantage for us, he is an outstanding individual player, but we are mostly looking at ourselves,\" Laimer said.\nWith their solid period of preparation and a laid-back atmosphere in the camp, Laimer said his side are determined to progress, which would see them meet either the Dutch or Romania in the quarter-finals at Berlin's Olympiastadion on Saturday.\n\"We are still here and we want to stay longer, we are very happy here,\" he said. REUTERS", "url": "https://www.straitstimes.com/sport/football/austria-feeling-at-home-in-germany-ahead-of-turkey-clash"}