{"authors": [], "date_download": "2024-10-12 14:13:14", "date_modify": "2024-10-12 14:13:14", "date_publish": "2024-07-29 14:18:48", "description": "PARIS - Paris Olympics organisers cancelled the triathlon swimming training session for the second day in a row on Monday, with 24 hours to go until the men's race, after heavy rain affected water quality levels in the Seine. Read more at straitstimes.com.", "filename": "sport_triathlon-swimming-training-cancelled-for-a-second-day-over-seine-water-quality_1728742394.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/29/11503071.jpg?VersionId=UNvUrLncpDF3GearEvkKDdyrOorOv9kp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_triathlon-swimming-training-cancelled-for-a-second-day-over-seine-water-quality_1728742394.html", "title": "Swimming training for Olympics triathlon event cancelled again over Seine water quality", "title_page": "Swimming training for Olympics triathlon event cancelled again over Seine water quality | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Paris Olympics organisers cancelled the triathlon swimming training session for the second day in a row on Monday, with 24 hours to go until the men's race, after heavy rain affected water quality levels in the Seine.\nFifty-five triathletes are scheduled to line up at 8am (2pm in Singapore) on July 30 on a floating pontoon next to the Pont Alexandre III and dive into the Seine, marking the first time athletes have competed in the river at an Olympics since 1900.\nThe women's individual race is scheduled for July 31, also at 8 am.\nOrganisers have set aside Aug 2 as a contingency day for the individual races and Aug. 6 for the mixed relay in case water quality levels do not improve in time.\n\"They still seem really hopeful for men tomorrow and women Wednesday,\" said Team Bermuda coach Dan Hugo, the husband of Tokyo gold medallist Flora Duffy.\n\"But if needs be one or both will get moved to Friday.\"\nParis 2024 has already had to rejig some schedules, with men's skateboarding delayed and pushed back two days from July 27 due to rain.\nA swimmable Seine is a key legacy Games organisers aim to leave behind for Paris residents.\nFrance has invested some €1.4 billion (S$2.04 billion) in new wastewater infrastructure to cut the amounts of sewage flowing into the river, and city authorities have announced plans for three swimming sites to open to the public by June next year.\nThe training session on July 28 was also cancelled after tests carried out the previous day showed water quality did not meet the required threshold.\nThe running and bike training sessions remain unaffected.\n\"Given the weather forecast for the next 36 hours, Paris 2024 and World Triathlon are confident that water quality will return to below limits before the start of the triathlon competitions on July 30,\" organisers said in a statement on July 29.\nThe triathlon is the first Olympic event due to be held in the Seine, before marathon swimming in the second week of the Games.\nThe quality of the Seine’s water is dependent on the amount of rain that falls in and around Paris. Due to an exceptionally wet spring and start to summer, the Seine had been consistently failing water tests until the start of July.\nLevels of the E.Coli bacteria – an indicator of faecal matter – were sometimes 10 times higher than authorised limits.", "url": "https://www.straitstimes.com/sport/triathlon-swimming-training-cancelled-for-a-second-day-over-seine-water-quality"}