{"authors": [], "date_download": "2024-10-12 14:17:10", "date_modify": "2024-10-12 14:17:10", "date_publish": "2023-10-08 04:43:43", "description": "Verstappen clinches his third title at the Qatar Grand Prix. Read more at straitstimes.com.", "filename": "sport_formula-one_red-bull-boss-hails-max-verstappen-as-most-competitive-ever_1728742630.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/08/TOPSHOTS-TOPSHOT-AUTO-PRIX-F1-QAT-SPRINT-201851.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_red-bull-boss-hails-max-verstappen-as-most-competitive-ever_1728742630.html", "title": "Red Bull boss hails Max Verstappen as 'most competitive ever'", "title_page": "Red Bull boss hails Max Verstappen as 'most competitive ever' | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA - Red Bull team boss Christian Horner hailed newly-crowned three-time world champion Max Verstappen as “the most competitive driver I’ve ever seen” on Saturday after he clinched his third title at the Qatar Grand Prix.\nAs tributes flowed and the Red Bull team celebrated in their black “champion” T-shirts, Horner described the 26-year-old Dutchman as “phenomenal” and “out of this world”.\nHis father, Jos Verstappen, a former team-mate of seven-time champion Michael Schumacher at Benetton, expressed his pride in not only his son’s achievement but the manner of them.\nVerstappen clinched his third title as he finished second in the sprint race behind rookie Australian Oscar Piastri of McLaren, who secured his maiden Formula One race win.\n“Of course, we appreciate it (the championship triumph), but it’s also the way he did it,” said Verstappen senior.\n“He was so dominant this year and he delivered really well and I’m very proud of that.\n“I knew it, his talent, a long time ago when he was in go-karts and I think we made the right decision in the beginning of his career and now it’s up to him what he does. I’m just very happy with how he does it and how strong he is and the way he works for that.”\nVerstappen began his F1 career with the Toro Rosso team in 2015 aged only 17 before securing his first win just one year later at the 2016 Spanish Grand Prix, after moving to Red Bull.\nThat was the first of his 48 races to date in 179 Grands Prix. This season he has won 13 of the 16 Grand Prix races including a series of 10 in a row.\nHis calm, consistency and work ethic were most frequently praised by those close to him and the Red Bull team with Horner adding that his innate self-confidence was his most telling characteristic.\nAmong the greats\n“He’s been by far the most dominant so it’s come as no surprise, but to see Max join some of the great names we spoke about earlier,” said Horner.\n“He’s in that bracket now. The way he’s driven this year has been out of this world and I think you have to take a moment to reflect and be in the moment and everything he’s done this year is phenomenal.\n“That’s his make-up and I think he’s the most competitive driver that I’ve ever met or seen. The determination that he drives with, the passion, the heart, the commitment and of course, the abundance of skill that he has.\n“He’s up there with the very best, some of the greatest the sport has seen and I think this season has just surpassed anything we’ve seen.”", "url": "https://www.straitstimes.com/sport/formula-one/red-bull-boss-hails-max-verstappen-as-most-competitive-ever"}