{"authors": [], "date_download": "2024-10-12 13:41:29", "date_modify": "2024-10-12 13:41:29", "date_publish": "2024-08-19 13:11:54", "description": "West Indies all-rounders Andre Russell and Jason Holder have been rested for this month's three-match Twenty20 home series against South Africa, governing body Cricket West Indies (CWI) said on Sunday. Read more at straitstimes.com.", "filename": "sport_windies-rest-russell-holder-for-south-africa-t20-series_1728740489.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/19/LYNXMPEK7I04G-1.jpg?VersionId=pnyeb4SQo8D7V5T5S8_OIosJXi7R2PN5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_windies-rest-russell-holder-for-south-africa-t20-series_1728740489.html", "title": "Windies rest Russell, Holder for South Africa T20 series", "title_page": "Windies rest Russell, Holder for South Africa T20 series | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "West Indies all-rounders Andre Russell and Jason Holder have been rested for this month's three-match Twenty20 home series against South Africa, governing body Cricket West Indies (CWI) said on Sunday.\nMedium pacer Matthew Forde and all-rounder Fabian Allen, who missed the T20 World Cup co-hosted by West Indies in June, have returned to the squad.\n\"Andre Russell requested a period of rest and recovery as well as Jason Holder who played five back-to-back tests against England and South Africa,\" CWI's director of cricket Miles Bascombe said in a statment.\n\"During this period, they will work closely with the CWI science and medicine team.\"\nFast bowler Alzarri Joseph, who was rested for the test series against South Africa this month, is absent from the 15-man squad along with injured opening batter Brandon King.\n\"I’m confident in the squad we’ve selected, and with eyes already on the next T20 World Cup in 2026, I know the guys will be keen to show their hunger for success,\" head coach Daren Sammy said.\nThe series will be played on Aug. 23, Aug. 25 and Aug. 27 at the Brian Lara Stadium in Tarouba, Trinidad and Tobago.\nWest Indies squad:\nRovman Powell (captain), Roston Chase, Alick Athanaze, Johnson Charles, Matthew Forde, Shimron Hetmyer, Fabian Allen, Shai Hope, Akeal Hosein, Shamar Joseph, Obed McCoy, Gudakesh Motie, Nicholas Pooran, Sherfane Rutherford, Romario Shepherd. REUTERS", "url": "https://www.straitstimes.com/sport/windies-rest-russell-holder-for-south-africa-t20-series"}