{"authors": [], "date_download": "2024-10-12 14:11:44", "date_modify": "2024-10-12 14:11:44", "date_publish": "2024-08-02 11:59:48", "description": "HONG KONG - Hong Kong's Cheung Ka-long's was greeted on Friday at the city's airport by hundreds of fans and journalists keen to get a glimpse of the gold medal winner who finished off Italy's Filippo Macchi 15-14 in a disputed bout at the Paris Olympics. Read more at straitstimes.com.", "filename": "sport_hong-kongs-fencing-olympian-cheung-returns-home-to-rapturous-cheers_1728742304.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/LYNXMPEK71030-2.jpg?VersionId=seCGFiL5gSeuxnMcHkl5sB4q7XiJRp6O", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_hong-kongs-fencing-olympian-cheung-returns-home-to-rapturous-cheers_1728742304.html", "title": "Hong Kong’s two-time Olympic fencing champion Cheung Ka-long returns home to rapturous cheers", "title_page": "Hong Kong’s two-time Olympic fencing champion Cheung Ka-long returns home to rapturous cheers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG - Hong Kong's Cheung Ka-long's was greeted on Friday at the city's airport by hundreds of fans and journalists keen to get a glimpse of the gold medal winner who finished off Italy's Filippo Macchi 15-14 in a disputed bout at the Paris Olympics.\nIt was the 27-year-old's second gold medal after his win at the Tokyo Olympics in 2021, making him the first Hong Kong athlete to achieve such a feat. Wearing his Hong Kong Olympics jacket and brandishing his gold medal, Cheung spoke about Italy's move to launch a formal complaint against his win and said all referees were professional.\n\"Especially the referees who judge the finals ... a referee for the finals must have some very good past experience,\" Cheung said in Cantonese.\n\"I don’t think there’s any bad or one-sided referee.\"\nCheung said his win in Paris was one of the best moments of his life. He has a French coach as well, making his win in France \"amazing\". He said he was planning a big holiday after preparing for the Olympics for the past three years.\n\"Physical and mentally I am quite tired, for now I just want to have a good rest and prepare for the next season.\"He encouraged all Hong Kong people to keep up the \"Hong Kong spirit\" of never giving up, urging everyone, especially young people to participate in sports. For now, his first task was to eat some local food after returning to his home city.\n\"I went to France very early ... so I hope to eat some Hong Kong food.\" REUTERS", "url": "https://www.straitstimes.com/sport/hong-kongs-fencing-olympian-cheung-returns-home-to-rapturous-cheers"}