{"authors": ["David Lee"], "date_download": "2024-10-12 14:21:45", "date_modify": "2024-10-12 14:21:45", "date_publish": "2019-12-20 15:58:32", "description": "SINGAPORE - He started the year out of the world's top 100 and with just two Asian Tour titles to his name since turning professional in 2010 as a prodigious 15-year-old. Read more at straitstimes.com.", "filename": "sport_golf_golf-jubilant-jazz-will-be-back-to-defend-crown-in-jan-16-19-singapore-open_1728742905.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/12/20/rk_jazzjanewattananond_201219.jpg?VersionId=IORAo2CApyiJ6Hl_XDzAbMOs2jx3J8xM&itok=hCbfESWQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_golf-jubilant-jazz-will-be-back-to-defend-crown-in-jan-16-19-singapore-open_1728742905.html", "title": "Golf: Jubilant Jazz will be back to defend crown in Jan 16-19 Singapore Open", "title_page": "Golf: Jubilant Jazz will be back to defend crown in Jan 16-19 Singapore Open | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - He started the year out of the world's top 100 and with just two Asian Tour titles to his name since turning professional in 2010 as a prodigious 15-year-old.\nBut capturing the SMBC Singapore Open in January in record fashion - he finished on 18-under 266 and also as the youngest winner - gave Jazz Janewattananond just the spark his golf career needed.\nAfter that victory, the 24-year-old Thai went on to win the Kolon Korea Open in June, as well as the BNI Indonesia Masters last week.\nWhich is why he has no qualms about returning to defend his title at Sentosa Golf Club from Jan 16-19.\nHe said: \"The last day at the SMBC Singapore Open has got to be my best round ever. I did not think I had a chance of winning - I was 111th in the world and never had a big win before.\n\"I got emotional, but happy emotional (at the victory). I was like, 'Wow, I actually did it'. I could not believe I beat Paul Casey down the stretch or Matthew Fitzpatrick, who was in my group. It boosted the confidence in me a little bit for sure.\n\"It was definitely one of the best tournaments of my life, so far. Winning that led me to break into the top 100, which gave me a lot of opportunities to play bigger events.\n\"It has been a very fulfilling year so I am excited about what lies ahead in 2020 (with the defence of the Singapore Open title coming early in the year).\"\nThis year, he also competed at the British Open, but it was at the PGA Championship where he showed that he could hold his own in a Major, as he finished tied for 14th place.\nAfter a sterling year, Janewattananond has won the Asian Tour Order of Merit, is ranked a career high world No. 45 and is a shoo-in for next year's Olympics.\nWith Rio 2016 medallists Justin Rose, Henrik Stenson and Matt Kuchar also in attendance for the Singapore Open, he has another chance to see where he stands among the world's best.\n\"I know the three Olympic medallists will be there, and it looks like I will qualify for the Olympics by this year, so I'm looking forward to meeting them and seeing how they prepare for the Olympics,\" said Janewattananond.\nNoting that he has transformed from a \"good golfer to a professional golfer\", the Bangkok native also credited his coach Pete Cowen.\nHe said: \"Playing good golf and playing professionally for a living is very different. Pete has taught me how to practise better, fixed my swing and knows what to do when I feel I need help.\n\"He is a renowned coach with so many players under his wing. He has proven time and time again that he is one of the best in the world and doesn't back down from his teachings - he never doubts and stays true to his words.\"", "url": "https://www.straitstimes.com/sport/golf/golf-jubilant-jazz-will-be-back-to-defend-crown-in-jan-16-19-singapore-open"}