{"authors": [], "date_download": "2024-10-12 13:52:58", "date_modify": "2024-10-12 13:52:58", "date_publish": "2024-01-17 03:52:22", "description": "They have three points, the same as Thailand, who beat Kyrgyzstan 2-0 in the other Group F game earlier in the day. Read more at straitstimes.com.", "filename": "sport_football_saudi-arabia-leave-it-late-to-beat-oman-in-asian-cup_1728741178.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/17/LYNXMPEK0F0UF-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_saudi-arabia-leave-it-late-to-beat-oman-in-asian-cup_1728741178.html", "title": "Saudi Arabia leave it late to beat Oman in Asian Cup", "title_page": "Saudi Arabia leave it late to beat Oman in Asian Cup | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA – Roberto Mancini’s Saudi Arabia fought back with a “gift to fans” as they defeated Oman 2-1 in the dying seconds at the Asian Cup on Jan 16, but only after some video assistant referee (VAR) confusion.\nAlso in Group F, Thailand beat Kyrgyzstan 2-0 with Supachai Chaided scoring both goals.\nThe ambitious Saudis beat eventual champions Argentina in the group phase of the 2022 World Cup and returned to Qatar as one of the favourites for the regional tournament.\nThey are seeking a record-equalling fourth Asian Cup, off the back of a big-money recruitment drive that has lured the likes of Neymar and Cristiano Ronaldo to the kingdom’s domestic league.\nSaudi Arabia is also set to host the 2034 World Cup.\nTheir opening match at the Asian Cup started badly when they conceded a penalty – and finished in farcical scenes in front of a bemused crowd of 41,987.\nDeep into injury time and with the Saudis pushing to make it 2-1, Ali Al-Bulayhi headed in following a corner to spark pandemonium for what they thought was the winner.\nThe goal was disallowed for offside by the assistant referee, and was checked by VAR. He appeared in replays to have been onside.\nThen came the confusion when it appeared that Australian referee Shaun Evans had stuck with the original offside call and the game restarted, only for him to call back play and award the goal.\nAl-Bulayhi, who celebrated by inflating a green balloon as his teammates mobbed him, afterwards called his winner “a gift to the Saudi people”.\n“Scoring at the end of the match, this is what great players do,” said the 34-year-old defender.\nMancini, who took the Saudi reins in August, said his side made mistakes in the first half “but this is normal in the first game”.\n“The second half was better than the first half – we created a lot of chances, we had more possession. If you have more possession, you have chances to score,” the Italian said.\n“Oman defended very well. We didn’t find good solutions at first but we had chances and we scored the second goal in the end. But we should have scored before.”\nHis opposite number Branko Ivankovic said the “Saudi team deserved the victory”, citing the tiredness of his players as a reason behind Oman’s late collapse.\nMancini’s men went behind in the 14th minute when Salaah Al-Yahyaei converted his spot kick to give lower-ranked Oman a surprise lead.\nAfter the break the Saudis continued to huff and puff in search of an equaliser, but had registered only two shots on target by the hour mark.\nAs the clock ran down and jeers began to ring out from the Saudi fans, the men in green needed a moment of magic.\nAnd that was what they got, substitute Abdulrahman Ghareeb – only on the pitch for three minutes – jinking his way through the Omani backline before stroking in the equaliser with 12 minutes left.\nThe Saudis then pushed for the winner, leading to Al-Bulayhi’s dramatic late intervention.\nEarlier, Buriram United striker Supachai prodded in from close range on 26 minutes to give Thailand the lead over Kyrgyzstan.\nHe got his second in similar style just after the break when the ball again fell his way with the goal gaping.\n“Supachai played very well,” said Thailand coach Masatada Ishii.\n“The connection with the rest of the team is also great. He is an important player, helping us win. Supachai proves to be one of the best strikers in Thai football at this time.”\nIn Group A, China’s hopes are on a knife edge after they were held 0-0 for the second game running against Lebanon on Jan 17.\nWhile they are second ahead of Lebanon and Tajikistan (both one point), they face group winners Qatar in their final game on Jan 22. Defending champions Qatar edged out Tajikistan through Akram Afif’s 17th-minute goal. AFP, REUTERS", "url": "https://www.straitstimes.com/sport/football/saudi-arabia-leave-it-late-to-beat-oman-in-asian-cup"}