{"authors": [], "date_download": "2024-10-12 14:11:24", "date_modify": "2024-10-12 14:11:24", "date_publish": "2024-06-05 18:16:36", "description": "HARGEISA, Somaliland - Wrapped in the tricolour flag of her homeland, 21-year old captain Hafsa Omer bounces the basketball between her legs, dribbles, lays it up off the backboard, and watches it clatter into the hoop. Read more at straitstimes.com.", "filename": "sport_basketball_somalilands-first-all-girls-basketball-team-shoot-for-recognition_1728742284.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/05/2024-06-05T103516Z202330122RC2HS7AF95CQRTRMADP3SOMALIA-SOMALILAND-BASKETBALL.JPG?VersionId=oaaRBT.yc4nB_B7Pa7GS932XRbkcHKvz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_somalilands-first-all-girls-basketball-team-shoot-for-recognition_1728742284.html", "title": "Somaliland’s first all-girls’ basketball team shoot for recognition", "title_page": "Somaliland’s first all-girls’ basketball team shoot for recognition | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HARGEISA, Somaliland - Wrapped in the tricolour flag of her homeland, 21-year old captain Hafsa Omer bounces the basketball between her legs, dribbles, lays it up off the backboard, and watches it clatter into the hoop.\nHer dream is to one day play for her nation, but there is a catch - Somaliland is not a country.\nThe breakaway territory has struggled to gain international recognition from any foreign government, despite governing itself and enjoying comparative peace and stability since declaring independence in 1991.\nOmer and her two sisters, who also play for Hargeisa Girls Basketball, the first all-girls team in the incipient country, are determined to put Somaliland on the map, by mobilising their more than 10,000 followers on social media.\n\"Somaliland is looking for their recognition and we believe that we could be part of bringing the recognition... by wearing the flags, by talking about our country, by promoting it through the short video TikToks or Instagram pictures,\" she said.\nQuestions about Somaliland's sovereignty came into sharp focus in January when local authorities said they would grant landlocked Ethiopia access to the Red Sea in return for recognition as an independent country, sparking a diplomatic row with Somalia's federal government.\nSomalia, which considers Somaliland part of its territory, rejected the deal allowing landlocked Ethiopia to lease 20km (12 miles) around the port of Berbera, with access to the Red Sea for 50 years for its navy and commercial tankers.\nSomaliland officials say they have a strong case to become Africa's 55th nation.\nThe former British protectorate has its own coast guard - run by a female admiral - police force, passports, currency and a functioning democratic political system and government institutions.\nThat record stands in contrast to large portions of the rest of Somalia where government forces have been fighting a bloody counterinsurgency against al Qaeda-linked militants from al Shabaab.\nOmer sees her devotion to Somaliland's independence as an extension of her father and uncles' armed struggle in the 1980s against the dictator Siad Barre.\n\"My dad talks about it every day, what he and his friends\nhad been through, while he watched his cousins dying in front of him,\" she said.\nWhile the territory of around 3.5 million people remains some way from attaining diplomatic approval abroad, Omer has made significant gains in pushing women's rights.\nSince she founded Hargeisa Girls Basketball in 2018, other female teams have sprung up. They now play in an all-girls league, challenging conservative social attitudes and religious beliefs in Somaliland.\nFor her sister Fatima Omer, basketball serves both goals.\n\"We just want the world to see us,\" she said. REUTERS", "url": "https://www.straitstimes.com/sport/basketball/somalilands-first-all-girls-basketball-team-shoot-for-recognition"}