{"authors": [], "date_download": "2024-10-12 14:09:34", "date_modify": "2024-10-12 14:09:34", "date_publish": "2024-07-29 12:10:31", "description": "He finishes with 23 points for the reigning champions, NBA star Nikola Jokic leads Serbia scoring with 20 points. Read more at straitstimes.com.", "filename": "sport_basketball_kevin-durant-inspires-us-in-rout-of-serbia-to-launch-olympic-basketball-defence_1728742174.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/29/11503387.jpg?VersionId=XKthX7sSczaQhvC_XISyIAC7GgsfZvK9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_kevin-durant-inspires-us-in-rout-of-serbia-to-launch-olympic-basketball-defence_1728742174.html", "title": "Kevin Durant inspires US in rout of Serbia to launch Olympic basketball defence", "title_page": "Kevin Durant inspires US in rout of Serbia to launch Olympic basketball defence | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "VILLENEUVE-D’ASCQ, France - Kevin Durant returned from injury to produce a shooting masterclass as the United States launched the defence of their Olympic basketball crown with a 110-84 win over Serbia on July 28.\nDurant, who missed the entirety of the US’ Olympic build-up with a calf injury, shot a near-perfect eight-of-nine from the field to finish with 23 points in a convincing win for the reigning champions, who are eyeing a fifth straight Olympic crown.\n“It feels good to make some shots,” Durant told reporters after the win. “Everybody played their role pretty well tonight and my role was to come in and make some space for the team – glad I was able to knock some down.\n“It’s just basketball at the end of the day. I just tried to follow the gameplan, be there for my team-mates on the defensive end, and when the ball touched my hands be aggressive.”\nThe 35-year-old Phoenix Suns ace, the all-time leader for the US in points, points-per-game and field goals, entered the game in the first quarter with the star-studded American line-up trailing 19-14.\nThe 14-time National Basketball Association (NBA) All-Star, a member of the US’ gold medal-winning Olympic teams in 2012, 2016 and in Tokyo three years ago, then proceeded to take over, raining in a succession of buckets to get the Americans back on track.\nLeBron James provided scoring support with 21 points, with Jrue Holiday adding 15 points and Devin Booker finishing on 12.\nDenver star Nikola Jokic led the Serbia scoring with 20 points.\nThe Americans are the overwhelming favourites for the Olympic crown and have arrived in France with a squad featuring a galaxy of NBA stars led by the likes of James, Durant and Stephen Curry.\nJames and Curry lavished praise on Durant after the win.\n“KD was phenomenal,” James said. “It’s almost like he never missed anything. If you watch him at practice, everything he does is at game speed. So there’s no surprise he comes out and gets right into it – it’s good to have him on our side.”\nDurant’s former Golden State team-mate Curry was similarly effusive.\n“KD was unbelievable in the first half and gave us a huge boost,” Curry said. “Nothing he does surprises me. To shoot perfect in the first half? That’s special. He’s used to this stage.\n“He’s the all-time leading scorer in USA basketball (team) history for a reason. It was great to see him get out there having fun.”\nThe Americans face South Sudan in their second group game on July 31 before wrapping up the first round in Lille against Puerto Rico on Aug 4.\nOn Sunday’s evidence Golden State coach Steve Kerr’s squad will take some stopping when the 12-team tournament moves to Paris for the knockout rounds on August 6.\nSerbia, led by three-time NBA Most Valuable Player Jokic, made a fast start in the clash at the Pierre Mauroy Stadium in Lille, sprinting into an early 10-2 lead.\nBut the arrival of Durant from the bench galvanised the US line-up, and once the Americans found their shooting touch the result was never in doubt.\nDurant was welcomed into the game with a blatant body check by Vasilije Micic which sent the 2.11m 35-year-old sprawling to the hardwood.\nDurant however took the Serbian physicality in his stride and tormented the Europeans with an exhibition of flawless shooting to help the US pull clear 25-20 at the end of the first quarter.\nDurant put the seal on the second quarter with a superb jump shot to leave the Americans up 58-49 at the break, and the champions never looked like relinquishing their grip on the game thereafter as they motored to victory. AFP", "url": "https://www.straitstimes.com/sport/basketball/kevin-durant-inspires-us-in-rout-of-serbia-to-launch-olympic-basketball-defence"}