{"authors": ["David Lee"], "date_download": "2024-10-12 13:43:32", "date_modify": "2024-10-12 13:43:32", "date_publish": "2023-11-19 17:13:48", "description": "The 18-year-old topped a 13-strong field to win gold in Texas. Read more at straitstimes.com.", "filename": "sport_singapore-s-teenage-taijiquan-exponent-zeanne-law-becomes-world-wushu-champion_1728740612.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/19/WUSHU-ASIAD-2022-2023-HANGZHOU-050711.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-s-teenage-taijiquan-exponent-zeanne-law-becomes-world-wushu-champion_1728740612.html", "title": "Singapore’s teenage taijiquan exponent Zeanne Law becomes world wushu champion", "title_page": "Singapore’s teenage taijiquan exponent Zeanne Law becomes world wushu champion | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – When she joined the national team in 2022, Singapore wushu exponent Zeanne Law would be happy just to compete alongside top foreign athletes whom she looked up to.\nBut on Nov 18, she became the subject of admiration instead, as the 18-year-old topped a 13-strong field to win the women’s taijiquan title at the Nov 16-20 World Wushu Championships in Texas in the United States.\nLaw, who delivered the Republic’s fifth gold medal at the biennial meet, described it as a “dream come true”. She told The Straits Times: “It is a surreal feeling to be standing on top of the podium at my first world championships.\n“I never thought this moment would come by so quickly as I’m relatively young compared to my competitors.\n“This success is based on the countless hours of dedicated training and constant fine-tuning of my techniques and strategies. The accumulated experience from this year’s SEA and Asian Games enabled me to have a better grasp of what to do and enhanced my confidence for these world championships.”\nWhile it was challenging to adapt to the 14-hour time difference and lower temperatures, Law said having a well-planned regimen helped her stay focused and overcome those obstacles.\nVincent Ng was Singapore’s first wushu world champion when he won the men’s daoshu event in 1995. He was followed by women’s duilian trio Emily Sin, Tay Yu Juan and Tao Yi Jun in 2011, women’s taijiquan winner Ho Lin Ying in 2013 and men’s xingyiquan champion Tan Xiang Tian in 2015.\nLaw, who finished fifth out of 13 in the women’s taijijian a day earlier, clinched her first major international title in dramatic fashion as it took the second of five tiebreak criteria to separate her from the Philippines’ Agatha Wong, 25, after both scored 9.776 points in the final at the Fort Worth Convention Centre.\nThe Singapore Sports School student was awarded the gold as she completed a move with a higher difficulty – a 450-degree turn compared with Wong’s 360-degree turn. Brunei’s Basma Lachkar, 20, was third with 9.770, while Singapore’s Vera Tan, 25, placed eighth with 9.643.\nLaw said: “When I saw Agatha’s score, my heart dropped for a moment. Thankfully, my higher difficulty level helped me secure first place. It was a close contest and I was kept on the edge of my seat until the final positions were confirmed. It was nerve-racking.”\nTaijiquan and taijijian, like daoshu and gunshu, fall under the taolu (set routine) umbrella in wushu, and athletes are awarded points on quality of movements, overall performance and degree of difficulty.\nIn the event of tied scores, a set of tiebreak criteria will be applied.\nThese are: a higher degree-of-difficulty score, successfully completing the tougher move, successfully completing the tougher move more times, a higher score for overall performance, and a higher lowest-discarded overall performance score from those awarded by the five judges.\nIf the athletes still remain inseparable, they will share the medal.\nWhile Law savoured her narrow victory, teammate Tay Yu Xuan was left to rue the final tiebreak criterion as he lost the men’s taijijian title to Chinese Taipei’s Chen Yu-wei.\nThe top three athletes in the 22-strong field were tied on 9.756, with Japan’s Tomohiro Araya taking bronze because of a lower degree-of-difficulty score.\nTay, 22, said: “Of course, it feels a bit wasted to be so near yet so far, but I have to respect the decision of the judges.\n“This shows how competitive the competition is, and how the standard has improved over the previous worlds.”\nThe second-year communications student and aspiring film-maker added: “Surely there will be a ‘sequel’ and I aim to do even better at the World Taijiquan Championships in Singapore next year, a step before the next World Wushu Championships.”\nIn the women’s changquan, Kimberly Ong claimed bronze in the field of 38 with 9.770.\nAlong with Jowen Lim’s men’s daoshu silver and Vera Tan’s women’s taijijian bronze on Nov 17, Singapore’s tally in Texas comprises one gold, two silvers and two bronzes, just behind their best haul of 1-3-3 in 1995.\nNational coach Zhang Feng said: “We have done well here overall because our athletes held nothing back and were able to execute what they have practised during training.\n“They have maintained a good mentality to focus more on the process than the results.”", "url": "https://www.straitstimes.com/sport/singapore-s-teenage-taijiquan-exponent-zeanne-law-becomes-world-wushu-champion"}