{"authors": [], "date_download": "2024-10-12 13:45:03", "date_modify": "2024-10-12 13:45:03", "date_publish": "2023-10-15 16:09:17", "description": "The decision on which city will host the 2036 summer Olympics will be taken in three years time at the earliest, the International Olympic Committee said on Sunday. Read more at straitstimes.com.", "filename": "sport_olympics-ioc-decision-on-2036-olympics-host-will-not-come-before-2026-ioc_1728740703.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/15/LYNXMPEJ9E037-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_olympics-ioc-decision-on-2036-olympics-host-will-not-come-before-2026-ioc_1728740703.html", "title": "Olympics-IOC decision on 2036 Olympics host will not come before 2026-IOC", "title_page": "Olympics-IOC decision on 2036 Olympics host will not come before 2026-IOC | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MUMBAI - The decision on which city will host the 2036 summer Olympics will be taken in three years time at the earliest, the International Olympic Committee said on Sunday.\nIndia this week declared interest in staging the Olympics in 2036, with Prime Minister Narendra Modi addressing the IOC leadership at the opening ceremony of its session in Mumbai.\nPoland, Mexico and Indonesia have also expressed interest in bidding for those Games.\n\"Any decision will be made by a new IOC leadership and not before 2026 or 2027,\" said Kolinda Grabar-Kitarovic, who chairs the IOC's future host commission.\nThe IOC is set to elect a new president in 2025.\n\"I am pleased to report that the number of the interested parties for hosting the Games is in double digits,\" she said.\nShe did not clarify whether that figure included both summer and winter Games candidacies or just the 2036 summer Olympics.\nParis is set to host the 2024 summer Olympics and Los Angeles has been picked for the 2028 Games. Brisbane, Australia, will stage the 2032 Olympics. REUTERS", "url": "https://www.straitstimes.com/sport/olympics-ioc-decision-on-2036-olympics-host-will-not-come-before-2026-ioc"}