{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 14:09:47", "date_modify": "2024-10-12 14:09:47", "date_publish": "2024-07-30 18:19:52", "description": "Budinger, 36, played in the NBA for 8 years before injuries saw him transition to beach volleyball. Read more at straitstimes.com.", "filename": "sport_basketball_from-basketball-to-beach-volleyball-former-nba-player-chase-budinger-gets-his-olympic-dream_1728742187.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/30/2024-07-29T145145Z1537597636UP1EK7T15A76GRTRMADP3OLYMPICS-2024-BEACHVOLLEYBALL.JPG?VersionId=GC1TGs2giIGFRJfdbood..0JDVajQWVm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_from-basketball-to-beach-volleyball-former-nba-player-chase-budinger-gets-his-olympic-dream_1728742187.html", "title": "Former NBA player Chase Budinger gets his Olympic dream in beach volleyball", "title_page": "Former NBA player Chase Budinger gets his Olympic dream in beach volleyball | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – Cheers, jeers and raucous crowds were all in a day’s work for Chase Budinger, in an eight-year career in the National Basketball Association (NBA).\nAnd for 32 minutes on court at the Eiffel Tower Stadium on July 29, the 36-year-old American looked perfectly at ease as the partisan crowd roared their support for the local favourites.\nBut inside, Budinger was a bundle of nerves. It was his Olympic debut, and in a different sport – beach volleyball.\n“I would compare playing in the Olympics for the first time to my first NBA game,” said Budinger, after he and his teammate Miles Evans sealed the 21-14, 21-11 victory against Frenchmen Arnaud Gauthier-Rat and Youssef Krou.\n“You’ve got ultimate nerves, the crowd is there, you’re shaking, you can’t really think straight. But you’ve just got to try to breathe and enjoy the experience because this is a game you know how to play, so we just had to settle ourselves down and get the job done.”\nIt was a lifelong dream realised for Budinger, who recalled how he had the Olympic rings on a dream board he kept when he was younger.\nGrowing up in Encinitas, California, he showed talent in both volleyball and basketball, achieving success with La Costa Canyon High School in both sports.\nThen, after a collegiate basketball career with the University of Arizona, he played for the Houston Rockets for three seasons from 2009 to 2012, before stints with Minnesota Timberwolves, Indiana Pacers and Phoenix Suns.\nHe then went to Spain in 2016 to play for Club Deportivo Saski-Baskonia in the Euro League until injuries derailed his basketball career, prompting him to call time on the hardwood court.\nBut his competitive spirit remained and he thought of a possible return to volleyball – this time on the beach.\nHe started by playing pick-up beach volleyball in Hermosa in 2017, joining four-on-four tournaments, before making his Association of Volleyball Professionals debut a year later.\nIn 2023, he won a Volleyball World Beach Pro Tour title with Evans at the Haikou Challenge in China.\nBut he had doubts about his decision at the start.\nBudinger said: “I knew this was the route I wanted to take, but I do remember asking myself if this was the right decision at the time of quitting basketball, something I’ve been doing for the last 13 years or however long it was.\n“And to question myself was, ‘Am I doing the right thing for myself?’ After sulking for three weeks or whatever, I changed my mindset and said, I’m going to do this, I’m going to go all in.\n“My ultimate goal is to make the Olympics, to work every day, grind as hard as I could.”", "url": "https://www.straitstimes.com/sport/basketball/from-basketball-to-beach-volleyball-former-nba-player-chase-budinger-gets-his-olympic-dream"}