{"authors": [], "date_download": "2024-10-12 13:40:08", "date_modify": "2024-10-12 13:40:08", "date_publish": "2024-08-31 21:19:16", "description": "Mehidy Hasan Miraz claimed five wickets as Bangladesh bowled out Pakistan for 274 on the second day of their rain-hit second test at Rawalpindi on Saturday, after half-centuries by Shan Masood, Saim Ayub and Salman Agha. Read more at straitstimes.com.", "filename": "sport_five-star-miraz-helps-bangladesh-restrict-pakistan-to-274_1728740408.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/31/CRICKET-PAK-BAN-TEST-130002.jpg?VersionId=SVmM4j4c54MCdm.EwdnCkp46eYlFY7nt", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_five-star-miraz-helps-bangladesh-restrict-pakistan-to-274_1728740408.html", "title": "Five-star Miraz helps Bangladesh restrict Pakistan to 274 in day 2 of second cricket Test", "title_page": "Five-star Miraz helps Bangladesh restrict Pakistan to 274 in day 2 of second cricket Test | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Mehidy Hasan Miraz claimed five wickets as Bangladesh bowled out Pakistan for 274 on the second day of their rain-hit second cricket test at Rawalpindi on Saturday, after half-centuries by Shan Masood, Saim Ayub and Salman Agha.\nShadman Islam was batting on six and Zakir Hasan was on zero as Bangladesh reached 10 for no loss at stumps, seeking a strong reply in their bid to secure a 2-0 series victory after winning the first game at the same venue by 10 wickets.\nMiraz (5-61) and Taskin Ahmed (3-57) were the picks of the Bangladesh bowlers as they claimed timely wickets and controlled the run-rate after the opening day was lost to incessant rain and a wet outfield.\nTaskin, drafted into the Bangladesh side after fellow pace bowler Shoriful Islam sustained a groin injury, bowled Abdullah Shafique with a swinging delivery in the first over of the day after the tourists won the toss and opted to field.\nPakistan recovered from that early setback and got to 99-1 at lunch, with Masood completing his 10th half-century, but the skipper did not last long when play resumed and was dismissed lbw by Miraz for 57.\nWith the 107-run stand for the second wicket ended, the Bangladesh bowlers grew in confidence as the day wore on and could have had more wickets but for some sloppy catching.\nAyub was stumped for 58 a few overs later after coming down the track and missing the line of a flighted delivery from Miraz while Saud Shakeel, who was dropped at slip on one, perished after chopping one from Taskin back onto his stumps.\nHaving stemmed the flow of runs, Bangladesh removed the out-of-form Babar Azam for 31 before tea and Mohammad Rizwan for 29 shortly after to leave Pakistan in a spot of bother at 211-6.\nKhurram Shahzad departed attempting a big shot and Mohammad Ali edged to slip as Miraz claimed his third and fourth victims late in the day before Ahmed removed Salman Agha for 54.\nMiraz then had Abrar Ahmed stumped to cap off a fine bowling display for the tourists. REUTERS", "url": "https://www.straitstimes.com/sport/five-star-miraz-helps-bangladesh-restrict-pakistan-to-274"}