{"authors": [], "date_download": "2024-10-12 13:41:45", "date_modify": "2024-10-12 13:41:45", "date_publish": "2024-08-11 13:52:34", "description": "Bangladesh will travel to Pakistan ahead of schedule to hold practice sessions in Lahore before their two-test bilateral series, the Pakistan Cricket Board (PCB) said late on Saturday. Read more at straitstimes.com.", "filename": "sport_bangladesh-will-travel-to-pakistan-ahead-of-schedule-pcb-says_1728740505.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/11/ST-logo-placeholder_50.jpg?VersionId=j0Zb4O4kHXIaaoQwdMIeLcLd51fh_RVp", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_bangladesh-will-travel-to-pakistan-ahead-of-schedule-pcb-says_1728740505.html", "title": "Bangladesh will travel to Pakistan ahead of schedule, PCB says", "title_page": "Bangladesh will travel to Pakistan ahead of schedule, PCB says | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Bangladesh will travel to Pakistan ahead of schedule to hold practice sessions in Lahore before their two-test bilateral series, the Pakistan Cricket Board (PCB) said late on Saturday.\nOngoing political turmoil in Bangladesh has disrupted the team's training, local media reported. Prime minister Sheikh Hasina fled the country following weeks of protests, with an interim government led by Muhammad Yunus taking charge.\nThe Bangladesh Cricket Board did not immediately reply to a request for comment on reports practice session has been disrupted by the unrest.\n\"Originally scheduled to arrive on Aug. 17 in Islamabad, the Bangladesh team will now land in Lahore on the morning of Aug. 13,\" the PCB said in a statement.\nBCB Chief Executive Nizam Uddin Chowdhury thanked the PCB for opportunity to have additional training in Pakistan.\n\"This will certainly help the players to acclimate to the conditions and prepare better for the ICC World Test Championship series,\" he said in the statement.\nBangladesh will train at Lahore's Gaddafi Stadium for three days before travelling to Islamabad, with the first test scheduled to begin in nearby Rawalpindi on Aug. 21. The second test will be played in Karachi from Aug. 30. REUTERS", "url": "https://www.straitstimes.com/sport/bangladesh-will-travel-to-pakistan-ahead-of-schedule-pcb-says"}