{"authors": [], "date_download": "2024-10-12 14:11:36", "date_modify": "2024-10-12 14:11:36", "date_publish": "2024-05-10 12:56:46", "description": "Donovan Mitchell scored 23 of his 29 points in the second half in Boston, and received plenty of support from his teammates. Read more at straitstimes.com.", "filename": "sport_basketball_cleveland-cavaliers-surge-past-boston-celtics-to-level-nba-series-at-1-1_1728742296.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/10/BKN-SPO-CLEVELAND-CAVALIERS-V-BOSTON-CELTICS-GAME-TWO-021445.jpg?VersionId=XSbrlHm7DWe7n0382LDhlARRggrwokNh", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_cleveland-cavaliers-surge-past-boston-celtics-to-level-nba-series-at-1-1_1728742296.html", "title": "Cleveland Cavaliers surge past Boston Celtics to level NBA series at 1-1", "title_page": "Cleveland Cavaliers surge past Boston Celtics to level NBA series at 1-1 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – Cleveland Cavaliers coach J.B. Bickerstaff praised his players for being “attack-minded”, as the Cavs powered past the top-seeded Boston Celtics 118-94 to level their National Basketball Association (NBA) Eastern Conference semi-final series at one game apiece on May 9.\nDonovan Mitchell scored 23 of his 29 points in the second half in Boston, and received plenty of support from his aggressive teammates as Cleveland bounced back from a Game 1 rout.\nEvan Mobley got the team going early, scoring 15 of his play-off career-high 21 points in the first half. He added 10 rebounds and five assists and reserve guard Caris LeVert had 21 points off the bench for the Cavs, who had six players score in double figures.\n“I like the way that we were just attack-minded,” Bickerstaff said. “We didn’t settle for the first quick (shot) that we saw. We were attack-minded and understanding how they’re playing with their space.”\nThe visitors did fall behind in the first two quarters but finished both of them strong and had tied it up 54-54 at halftime.\nMitchell then erupted for 16 points in the third quarter as the Cavs seized control, taking the first double-digit lead of the night for either team on Darius Garland’s three-pointer midway through the period that put Cleveland up 77-66.\nThey finished with 13 three-pointers while Boston made just eight on 35 attempts. The Celtics, who led the league with 64 regular-season wins, were zero-for-eight from three-point range in the third quarter.\nThe Cavs, up by 12 going into the fourth, pressed their advantage, as Mitchell drained three straight baskets that included a spinning drive for a hook shot that made it 99-83.\nBy the time Jayson Tatum was called for a flagrant foul – when his arm made contact with LaVert’s head on a play that pushed Cleveland’s lead to 24 points – the home fans were streaming out of TD Garden. Celtics coach Joe Mazzulla pulled his starters, with Tatum finishing with 25 points and Jaylen Brown adding 19.\nThe star of the show, Mitchell, heaped praise on Mobley, 22, who started in place of injured centre Jarrett Allen. He said: “Everybody did their job tonight, and to come out here on the road as a young player, that’s a big-time performance to set the tone for us.”\nNow, he added, the Cavs need to keep the pressure on when the series shifts to Cleveland for Game 3 on May 11.\n“At the end of the day, it’s one win,” the guard warned. “We’ve got to do it at the crib.”\nIn Western Conference action, Luka Doncic and P.J. Washington scored 29 points apiece while leading the Dallas Mavericks to a 119-110 victory over hosts Oklahoma City Thunder, evening their semi-final series at 1-1. The Mavs hit 18 three-pointers, their highest total in the 2024 post-season.\nDoncic added 10 rebounds and seven assists as he rebounded from recent shooting struggles to go 11-of-21 from the floor, including five-of-eight from three-point range.\nAFP, REUTERS", "url": "https://www.straitstimes.com/sport/basketball/cleveland-cavaliers-surge-past-boston-celtics-to-level-nba-series-at-1-1"}