{"authors": [], "date_download": "2024-10-12 14:08:24", "date_modify": "2024-10-12 14:08:24", "date_publish": "2024-10-04 13:00:34", "description": "She receives 66 of 67 votes from a panel of sportswriters and broadcasters, with Chicago Sky's Angel Reese drawing one vote. Read more at straitstimes.com.", "filename": "sport_basketball_caitlin-clark-named-wnba-rookie-of-the-year_1728742104.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/04/2024-09-27T160437Z74327489RC208AAJPB70RTRMADP3BASKETBALL-WNBA.JPG?VersionId=y_731BItILKHeBODT71vhrZD6intmNtP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_caitlin-clark-named-wnba-rookie-of-the-year_1728742104.html", "title": "Caitlin Clark named WNBA Rookie of the Year", "title_page": "Caitlin Clark named WNBA Rookie of the Year | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – Indiana Fever guard Caitlin Clark believes that everyone around her played a part, as she was named the near-unanimous 2024 Women’s National Basketball Association (WNBA) Rookie of the Year on Oct 3.\nShe received 66 of 67 votes from a national panel of sportswriters and broadcasters, with Chicago Sky forward Angel Reese drawing one vote.\nThe winner also headlined the league’s All-Rookie team. Clark was joined by Reese, Kamilla Cardoso of the Sky, Rickea Jackson of the Los Angeles Sparks and the New York Liberty’s Leonie Fiebich.\nClark, 22, is the second consecutive recipient of the award for Indiana, following forward/centre Aliyah Boston.\n“I am incredibly honoured to be named Rookie of the Year, but more than that, I am grateful to everyone that supported me throughout this past season – my family and friends, my teammates, the Fever organisation and everyone that cheered us on all season,” she said.\n“I am so proud of what we accomplished and so excited for what the future holds.”\nClark started all 40 games for the Fever, averaging 19.2 points, a league-high 8.4 assists, 5.7 rebounds and 1.3 steals, while drawing record crowds and boosting television ratings across the nation.\nShe set an WNBA single-season record with 337 assists and set WNBA rookie marks with 769 points and 122 three-pointers.\nThe No. 1 overall pick in the 2024 WNBA Draft out of the University of Iowa, Clark was a starter for Team WNBA at the All-Star Game and was named the WNBA Rookie of the Month four times (May, July, August and September).\n“Does not surprise me one bit,” Fever general manager Lin Dunn told the Indianapolis Star.\n“I mean, she broke all the records before she ever got to the WNBA. She broke the college points record, broke Pistol Pete Maravich’s record, and so we anticipated great things from her.\n“I think the assists, the passing, and then being a key part of taking our team from 13 wins to 20 wins, certainly well-deserving. And we’re thrilled. We’re thrilled for the Fever franchise.”\nClark helped the Fever finish 20-20 and earn their first play-off appearance since 2016.\nIndiana were swept 2-0 in the first round by the Connecticut Sun.\nOther highlights from her sensational debut campaign include the first two triple-doubles by a rookie in WNBA history (July 6 against New York and Sept 4 against Los Angeles), and the WNBA single-game record for assists (19 against the Dallas Wings on July 17).\nThe WNBA website said that in honour of Clark being named the 2024 Rookie of the Year, she will “receive US$5,150 (S$6,680) and a trophy designed to commemorate the achievement”.\nOff the court, Clark, Reese and their fellow rookies have been a ratings and attendance boost for the WNBA in what has been a breakthrough year for women’s basketball in the United States.\nThe Fever’s average crowds this season have increased to more than 17,000 per game, with a record 20,711 fans turning out for one fixture.", "url": "https://www.straitstimes.com/sport/basketball/caitlin-clark-named-wnba-rookie-of-the-year"}