{"authors": [], "date_download": "2024-10-12 13:41:31", "date_modify": "2024-10-12 13:41:31", "date_publish": "2024-08-19 10:21:41", "description": "The iconic venue was left off the Test calendar for the first time in half a century. Read more at straitstimes.com.", "filename": "sport_ca-chief-calls-on-queensland-to-invest-in-stadium-after-gabba-snub_1728740491.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/19/Cricket-WC-2024-T20-AUS-IND-162947.jpg?VersionId=vAmowvF_NHTH64ZvWvP0aIYwtR7DKx9f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_ca-chief-calls-on-queensland-to-invest-in-stadium-after-gabba-snub_1728740491.html", "title": "Cricket Australia chief calls on Queensland to invest in stadium after Gabba snub", "title_page": "Cricket Australia chief calls on Queensland to invest in stadium after Gabba snub | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BRISBANE – Cricket Australia (CA) chief executive Nick Hockley has called on the Queensland government to invest in a fit-for-purpose stadium that will serve fans over the long term, after the Gabba was left off the Test calendar for the first time in half a century.\nBrisbane’s Gabba Stadium received no commitment to being used as a Test venue beyond late 2025, when CA announced on Aug 18 its home international series schedule for the next seven years.\nThe 2032 Brisbane Olympics organisers had planned to revamp the Brisbane Cricket Ground, more commonly known as the Gabba, to host the opening and closing ceremonies as well as athletics.\nBut the local government blanched at the cost, leaving the future of the stadium uncertain.\n“We’re interested in the best provision for cricket and for cricket fans into the long term,” said Hockley.\n“What has become clear is that the useful economic life of the Gabba is kind of nearing an end point.\n“I would think we welcome that there’ll be further investment in the near term. But we are really interested, and we think that the sports fans of Queensland deserve a brilliant, fit-for-purpose stadium for the longer term.\n“So we’re interested to understand what that will look like.”\nSydney, Melbourne and Adelaide have all been signed up to long-term deals to host Test matches during the upcoming seven-year period.\nThe Gabba, which has a capacity of 37,000, will host a day-night Test in the Ashes Series against England late in 2025 but has been left off the schedule for the 2026-27 season, the first time in 50 years that it has been excluded.\n“Everyone’s waiting to understand what the stadia strategy is going to be going forward. So we’re in very regular dialogue with all the relevant parties up in Queensland, and those discussions will continue over the coming months,” said Hockley.\nQueensland Cricket chair Kirsten Pike and chief executive Terry Svenson said the absence of the Gabba on the Test calendar was “deeply disappointing”.\n“The state government’s decision to not progress with its commitment to rebuild the Gabba and downgrade its proposed Olympic role has resulted in direct and indirect changes to how we proceed with our business,” they said in an open letter published on the organisation’s website.\n“The lack of detail about timings, promised improvements, and actual investment in the Gabba is driving uncertainty and is likely to continue to affect our operations until it is addressed.” REUTERS", "url": "https://www.straitstimes.com/sport/ca-chief-calls-on-queensland-to-invest-in-stadium-after-gabba-snub"}