{"authors": [], "date_download": "2024-10-12 13:40:19", "date_modify": "2024-10-12 13:40:19", "date_publish": "2024-05-09 22:56:03", "description": "Nottingham Forest are disappointed after losing an appeal over a Premier League points deduction, but have moved on and are focussed on avoiding relegation, manager Nuno Espirito Santo said on Thursday. Read more at straitstimes.com.", "filename": "sport_football_forest-disappointed-at-appeal-loss-but-time-to-move-on-says-nuno_1728740419.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/09/LYNXMPEK480LY-1.jpg?VersionId=5IXQKgxxetQHaRFVyWsi2lTl32dOloFN", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_forest-disappointed-at-appeal-loss-but-time-to-move-on-says-nuno_1728740419.html", "title": "Forest disappointed at appeal loss but time to move on, says Nuno", "title_page": "Forest disappointed at appeal loss but time to move on, says Nuno | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Nottingham Forest are disappointed after losing an appeal over a Premier League points deduction, but have moved on and are focussed on avoiding relegation, manager Nuno Espirito Santo said on Thursday.\nForest received a four-point deduction for a breach of the league's profit and sustainability rules in March, and were informed on Tuesday that their appeal was unsuccessful. This leaves them 17th in the table with 29 points, three above the relegation zone with two games remaining.\n\"We were all disappointed. Because we conquered those points on the pitch we had the hope and the belief that they can give them back, but the decision is over,\" Espirito Santo said.\n\"This is the reality, this is what we have, this is what we have to face and let's focus on ourselves because it's in our hands.\n\"Since the beginning, since the possibility of the points deduction we always face it the same way, what we have to focus on is ourselves, our job. We have already moved on.\"\nA win at home to Chelsea on Saturday would almost guarantee Forest their place in next season's Premier League, and they are keen to sign off at home in style.\n\"It's our last game at home at the City Ground, it's important for our main goal and for our fans that we finish in a nice way,\" the manager said.\n\"They have been so helpful and their support is so important for us that now is the moment to give them back all that they give to us.\"\nForest, with a far superior goal difference, could be virtually assured of survival before their game with Chelsea kicks off, if Luton Town lose at West Ham United and Burnley fail to win at Tottenham Hotspur earlier on Saturday.\nTheir manager, however, does not want his side worrying about what happens elsewhere.\n\"We don't have to get distracted about what is happening in other stadiums, we have to focus on ourselves, this is the main message, let's just focus on ourselves and play a good game,\" he said. REUTERS", "url": "https://www.straitstimes.com/sport/football/forest-disappointed-at-appeal-loss-but-time-to-move-on-says-nuno"}