{"authors": ["David Lee"], "date_download": "2024-10-12 14:11:09", "date_modify": "2024-10-12 14:11:09", "date_publish": "2024-06-12 19:30:13", "description": "Trailing 2-0, Mavs could pay the price for over-reliance on Luka Doncic if his teammates don't step up. Read more at straitstimes.com.", "filename": "sport_basketball_boston-celtics-team-effort-gives-them-edge-over-dallas-mavericks-in-nba-finals-ray-allen_1728742269.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/12/2024061289568944img5073.jpg?VersionId=BJV33ebQyK9.GDhLZZP85vO.LRLuRMcm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_boston-celtics-team-effort-gives-them-edge-over-dallas-mavericks-in-nba-finals-ray-allen_1728742269.html", "title": "Boston Celtics’ team effort gives them edge over Dallas Mavericks in NBA Finals: Ray Allen", "title_page": "Boston Celtics’ team effort gives them edge over Dallas Mavericks in NBA Finals: Ray Allen | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – With a league-high regular-season scoring average of 33.9 points, Luka Doncic was one of three nominees for the Most Valuable Player of this National Basketball Association (NBA) season.\nBut despite having one of the best players on the planet in the Slovenian, the Dallas Mavericks still find themselves trailing 2-0 to the Boston Celtics in the NBA Finals.\nNotably, the Celtics do not have a single player in contention for the major awards this season, nor are they represented among the top-five season leaders in any of the key statistics in terms of points, rebounds, assists, blocks, steals or three-pointers made.\nAhead of Game 3 on June 13 (Singapore time), legendary shooting guard Ray Allen, who won the championship with the Celtics in 2008 and Miami Heat in 2013, told The Straits Times: “Whoever is leading the team in scoring is irrelevant. You got to put your ego aside because it’s not about individual statistics. It’s about who can get the job done.”\nAnd at the moment, the Celtics look most equipped to win their 18th title and move one ahead of the Los Angeles Lakers as the most successful team in NBA history, as they have brought their regular season-winning form into the play-offs.\nIn Games 1 and 2 of the Finals, the Mavericks did well to stop Celtics star forward Jayson Tatum by double- or even triple-teaming him, restricting him to a 17-point average off a poor 12-from-38 field-goal conversion rate.\nBut Allen pointed at how the rest of the team stepped up – Jalen Brown and Derrick White averaged 21.5 and 16.5 points in the two games, while Kristaps Porzingis (20 points off the bench in Game 1) and Jrue Holiday (26 points in Game 2) made timely contributions.\nMeanwhile, Doncic has averaged 31 points in the Finals but Kyrie Irving scored only 28 points over the two games.\n“Ultimately it is balance,” said the 48-year-old Allen, who is in town with fellow NBA winner Gary Payton for a series of events including a Jr NBA coaching clinic at Dover Court International School, fireside chat with the local basketball community at the Singapore Sports Institute, and a Game 3 viewing party at Funan mall.\n“Boston’s just got more scoring capabilities all round. If they are moving the ball well and attacking and working on all cylinders, they are going to be hard to beat.\n“Tatum hasn’t been great... but Porzingis killed them in Game 1. He was like a wrench in the Dallas system because he was blocking shots and making stuff mid-range and they couldn’t stop him. That took a lot of pressure off Tatum to score. And Dallas have not got someone similar to that (Porzingis or Holiday) in the first two games.\n“Dallas have Luka and Kyrie Irving, who basically have to each score 30-plus for them to win. They proved they could do that in the Western Conference Finals but they don’t really have a strong third option. They do have guys who are capable but these guys have to be very flawless and impeccable in Game 3 for them to win.”\nBut Allen and Payton refused to write off the Mavericks, saying it would be a mistake to think that the championship is Celtics’ to lose.\nWhile Payton is aware no team have come from 0-3 down to win the Finals, and only five out of 36 teams have managed to overturn a 0-2 deficit to claim the championship, he noted that the Celtics have won both their home games and the Mavericks could well do the same.\nIn fact, his Miami team in 2006 were one of the five teams to pulled off the feat as they incidentally beat the Mavericks 4-2 for his only championship ring.\nPayton, who was the 1996 NBA Defensive Player of the Year, drew on his own experience of making the game-winning shot in Game 3 back then in backing the Mavericks this time.\nThe 55-year-old said: “Everybody’s got to believe in everybody and play for themselves and the team. I hadn’t taken a shot in that whole game but coach Pat Riley put a lot of confidence in me, knowing that I was a veteran and I had been in such situations, got me the ball at the right time and I made that shot.\n“We won, our confidence skyrocketed, we won the next two games and then went into Dallas on so much of a high, we beat them there to win the championship.”", "url": "https://www.straitstimes.com/sport/basketball/boston-celtics-team-effort-gives-them-edge-over-dallas-mavericks-in-nba-finals-ray-allen"}