{"authors": ["David Lee"], "date_download": "2024-10-12 13:43:22", "date_modify": "2024-10-12 13:43:22", "date_publish": "2023-11-19 17:38:08", "description": "Tan earned a long-awaited bronze, while Lim was awarded a shared silver. Read more at straitstimes.com.", "filename": "sport_vera-tan-ends-medal-drought-at-world-wushu-championships-as-fiance-jowen-lim-wins-a-silver_1728740602.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/19/hzwushu1911.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_vera-tan-ends-medal-drought-at-world-wushu-championships-as-fiance-jowen-lim-wins-a-silver_1728740602.html", "title": "Vera Tan ends medal drought at World Wushu Championships as fiance Jowen Lim wins a silver", "title_page": "Vera Tan ends medal drought at World Wushu Championships as fiance Jowen Lim wins a silver | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – For four editions since 2013, Singapore’s Vera Tan had never stepped on a World Wushu Championships podium, although she came close after finishing fourth in the taijiquan in the last three – in 2015, 2017 and 2019.\nBut on Nov 17, the 25-year-old Singaporean was able to marry poise with performance as she claimed her first world championship bronze when she scored 9.770 with her taijijian routine, as China’s Dai Dandan (9.826) and Malaysia’s Sydney Chin (9.776) won gold and silver respectively at the Fort Worth Convention Centre in Texas.\nTan told The Straits Times: “I’m very happy and relieved to win my first world championship medal at my fifth attempt after 10 years.\n“This is our last competition (of 2023), and while it was a hectic year, it also felt like we have gotten used to the feeling and momentum of frequent competing. The difference between this year and previous editions was that I was able to block out my nerves and do what I would have done during training.\n“It was not easy to finish fourth, I felt I did well previously but just missed out on a medal. This year, I trained really hard and also worked on improving on the difficulty of my routine and I’m glad it all paid off.”\nTan’s third-place finish out of 13 athletes was all the sweeter as her fiance and fellow national exponent Jowen Lim also won a medal at the same meet, picking up a joint silver with a score of 9.750 points in the men’s daoshu alongside Malaysia’s Clement Ting. China’s Liu Zhaohe topped the 41-man field with 9.823 points.\nWith a laugh, she said: “The last time we both won medals at a major competition was at the 2015 SEA Games, and after that he would usually be the one who wins a medal, so it feels great now because we have been waiting a long time for this moment.”\nIt has been a bountiful year for the 24-year-old Lim, who won a historic Asian Games wushu silver in September in the men’s daoshu and gunshu all-round final and followed up with a bronze in the same event at the World Combat Games in October.\nIt got better at the world championships where he encountered a rare tie even after the application of all five tiebreak criteria as he shared the silver with Ting.\nLim, who won bronzes in daoshu and gunshu in 2019 and another daoshu bronze in 2017, said: “Clement was second and I was third on the scoreboard, and I’ve never seen a joint medal in my career so I’m surprised and happy because I’ve had only bronzes at the world champs and this is a personal breakthrough.\n“But more than that, I’m happier about Vera’s medal because I’ve always believed she deserves a medal. After coming so close on so many occasions, she remains so motivated and this medal is validation of her ability.\n“Her event was after mine, so I went backstage to give her a hug and I did tear up a bit because she finally got her reward for her hard work.”", "url": "https://www.straitstimes.com/sport/vera-tan-ends-medal-drought-at-world-wushu-championships-as-fiance-jowen-lim-wins-a-silver"}