{"authors": ["David Lee"], "date_download": "2024-10-12 13:43:43", "date_modify": "2024-10-12 13:43:43", "date_publish": "2023-10-15 23:34:26", "description": "National bowlers wrap up season in Kuwait with two golds, three silvers and four bronzes. Read more at straitstimes.com.", "filename": "sport_singapore-bowling-celebrates-fruitful-world-championships-and-2023-campaign_1728740623.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/16/bowl.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-bowling-celebrates-fruitful-world-championships-and-2023-campaign_1728740623.html", "title": "Singapore Bowling celebrates fruitful world championships and 2023 campaign", "title_page": "Singapore Bowling celebrates fruitful world championships and 2023 campaign | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Despite a painful semi-final defeat in the women’s team event on Sunday, the national bowlers will return from Kuwait with their heads held high after their most successful IBF World Bowling Championships outing.\nThere were contributions from senior and younger players from both the men and women’s teams as they wrapped up their campaign and their 2023 season at the Kuwait Bowling Sporting Club with two golds, three silvers and four bronzes.\nThe last time Singapore won two gold medals at the world meet was in 2006, when Remy Ong clinched the men’s singles and all events titles – their only silverware from that competition in South Korea.\nExpressing her gratitude to the bowlers’ families, supporters and sponsors, Singapore Bowling president Valerie Teo said: “Every medal at the world championships is hard fought and precious and represents the blood, sweat and tears that the athletes have put in all these years. I am very proud of the whole team... The future of our sport is bright.”\nThe highlights were the 1-2 finishes in the men’s singles and women’s doubles events, when Darren Ong beat Jaris Goh on Monday for the individual title, before sisters Cherie, 35, and Daphne Tan, 33, overcame compatriots New Hui Fen, 31, and 19-year-old Colleen Pee in the doubles final on Thursday.\nOng, 27, and Goh, 28, combined for a men’s doubles bronze on Thursday, before New and Ong also finished third in the women and men’s all events respectively on Sunday.\nA decent showing in the team events proved Singapore’s strength in depth.\nJoel Tan, Basil Ng, Timothy Tham, Nu’man Syahmi, Ong and Goh – all in their 20s – narrowly missed out on making it to the last eight of the men’s team event.\nThe aforementioned women’s bowlers, along with Shayna Ng, 33, and Charmaine Chang, 24, then claimed a creditable bronze in their team event after losing 2-1 in the semi-finals to Malaysia, who were beaten by South Korea in the final. Singapore also received a silver for the women’s team overall category.\nNotably, Nu’man and Chang were selected from the second-tier national training squad.\nSenior national head coach Jason Yeong-Nathan said: “The men’s team have grown over the years from boys to men. There was a time when they were struggling to perform, but they never gave up and continued to work hard. They have shown consistent performances this year, and we will continue to work on getting better.\n“The women’s team performance was fantastic, and it was great to see Colleen and Charmaine gelling well with their senior teammates on and off the lanes at these championships.”\nIt has been a fruitful year for Singapore bowlers on all fronts. The national players won five golds, three silvers and three bronzes at the Asian Tenpin Bowling Championships in Hong Kong in January.\nThe youth development pipeline looks healthy as they racked up two golds, one silver and four bronzes at the Asian Youth Tenpin Bowling Championships in Thailand in July.\nThis was followed by a record haul of eight golds and two silvers at the Asian Junior Tenpin Bowling Championships on home lanes in August.", "url": "https://www.straitstimes.com/sport/singapore-bowling-celebrates-fruitful-world-championships-and-2023-campaign"}