{"authors": ["David Lee"], "date_download": "2024-10-12 13:41:49", "date_modify": "2024-10-12 13:41:49", "date_publish": "2024-08-03 19:07:53", "description": "He was set to race against Italy's Marcell Jacobs but pulled out at the last minute. Read more at straitstimes.com.", "filename": "sport_singapore-s-marc-louis-misses-chance-to-race-against-olympic-100m-champion-after-hamstring-injury_1728740509.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/03/2024-08-03T083838Z1192462563UP1EK830O0B2SRTRMADP3OLYMPICS-2024-ATHLETICS.JPG?VersionId=NakrsJM2pc.RKWh17oNkssnbzuC2Goph", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-s-marc-louis-misses-chance-to-race-against-olympic-100m-champion-after-hamstring-injury_1728740509.html", "title": "Singapore’s Marc Louis misses chance to race against Olympic 100m champion after hamstring injury", "title_page": "Singapore’s Marc Louis misses chance to race against Olympic 100m champion after hamstring injury | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – A dramatic Olympic debut for Marc Louis saw him progress from the preliminary round with a 10.43sec run to earn a dream Round 1 heat against the likes of Italy’s defending men’s 100m champion Marcell Jacobs on Aug 3.\nBut when the time came, there was a gaping space in Lane 8 where Singapore’s fastest man should have been.\nLater, the 21-year-old national serviceman winced at the missed opportunity and explained he had felt discomfort in his right hamstring and decided to withdraw to prevent himself from suffering a more serious injury.\nFlashing his trademark smile, he told The Sunday Times: “It’s mixed feelings.\n“After my race, I stayed back to watch the rest of the prelims to see if I qualified. When I went back to the warmup area, I found out I qualified. I was happy, and my coach said I was going to run with Marcell Jacobs.\n“But right after my prelim run, I also felt some discomfort. I went back to the warmup area to see how bad it was, did some runs and decided not to risk it.\n“These are my first Olympics and not being able to continue through the heats was sad, but this decision was for the best.”\nEventually in Heat 5 of Round 1 at the Stade de France, Jacobs was outsprinted as he clocked 10.05sec to finish second behind Nigeria’s Kayinsola Ajayi (10.02), while Ghana’s Abdul-Rasheed Saminu (10.06) edged out South African Benjamin Richardson by just seven-thousandths of a second in a photo finish to place third.\nOnly the top three from each of the eight heats and the next three fastest athletes qualify for the three semi-finals on Aug 4.\nOverall, Americans Kenneth Bednarek and former world champion Fred Kerley had the fastest times with identical 9.97 efforts, while Briton Louie Hinchliffe, who has a Filipino mother, placed third out of 72 runners in 9.98.\nThai teen Puripol Boonson overcame a hamstring injury in 2023 to become the only South-east Asian to make it to the semi-finals when he finished third in Heat 4 in 10.13. He is also the first from the region to make the semi-finals since Indonesian Mardi Lestari at Seoul 1988.\nThe 18-year-old, who is one of the world’s fastest youngsters, told ST: “I’m happy to recover and make it so far. I want to continue to break more records and go under 10 seconds.”\nEarlier in the preliminary rounds, Louis recovered from an uncharacteristic poor start to complete the first heat in 10.43, finishing third out of seven runners behind Gambia’s Ebrahima Camara (10.29) and Malaysia’s Azeem Fahmi (10.42).\nOnly the top two in each of the six preliminary heats and the next four fastest athletes progressed to Round 1, and Louis advanced as the first of this quartet.\nLouis, who enlisted in September 2022 and is still in NS as an administrative clerk, has performed admirably in the past year. At the Asian Games in Hangzhou in September 2023, he set a national record of 10.27sec to lower U.K. Shyam’s 2001 mark by 0.10sec.\nHe then broke the national 60m record at the World Athletics Indoor Championships in Glasgow in March with a 6.69, eclipsing Gary Yeo’s 2012 mark by 0.02sec.\nFor now, he has to slow down and recover before taking off again in a busy 2025 with major meets such as the World Athletics Indoor Championships (March), Asian Athletics Championships (May), World Athletics Championships (September) and SEA Games (December) to look forward to.\nIn the longer term, Louis wants to be back on the Olympic stage. He said: “Paris 2024 has been a wonderful experience. I’m planning to race in Los Angeles 2028. I’m excited for that and I’m going to do my best to be on form and do whatever it takes to qualify for the Games again.”", "url": "https://www.straitstimes.com/sport/singapore-s-marc-louis-misses-chance-to-race-against-olympic-100m-champion-after-hamstring-injury"}