{"authors": [], "date_download": "2024-10-12 14:17:36", "date_modify": "2024-10-12 14:17:36", "date_publish": "2023-09-01 00:39:57", "description": "No financial details of the deal were given but some media reports have suggested it could be worth £50 million a year. Read more at straitstimes.com.", "filename": "sport_formula-one_hamilton-points-to-brady-and-alonso-for-career-longevity_1728742656.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/09/01/LYNXMPEJ7U0V0-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_hamilton-points-to-brady-and-alonso-for-career-longevity_1728742656.html", "title": "‘Unfinished business’ pushes Lewis Hamilton to two more years at Mercedes", "title_page": "‘Unfinished business’ pushes Lewis Hamilton to two more years at Mercedes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MONZA – Lewis Hamilton is convinced he can have a winning future in Formula One after Mercedes on Thursday renewed his contract until 2025, ahead of this weekend’s Italian Grand Prix.\nThe seven-time world champion, 38, will extend his F1 career beyond his 40th birthday alongside fellow Briton George Russell at the Silver Arrows, where he won six of his drivers’ titles from 2014 to 2020.\nNo financial details of the deal were given but some media reports have suggested it could be worth £50 million a year (S$85.6 million), while others spoke of substantially more.\n“You’re stuck with me for a bit longer!” joked Hamilton to reporters in Monza.\n“I couldn’t be happier to be extending with this team, we’ve had such an incredible journey together.\n“We still have unfinished business, so we’re in this together, we have never been hungrier to win. We’ve got a lot of work to do to get us back to the front. But there’s no place I’d rather be.\n“The goal is simple... we’re trying to win more world championships. The unfinished business is getting back to the top.”\nHamilton’s tally of seven F1 titles puts him level with the legendary Michael Schumacher and he was denied a record-breaking eighth world crown only in the final race of 2021, following a controversial safety car ruling.\nHowever, he said that his decision to continue racing was “not about revenge” for the loss to Red Bull’s Max Verstappen, who looks set to win his third straight title this season.\n“That’s in the past, there’s nothing you can do about the past,” said Hamilton.\n“I truly believe that with this team, we can win more championships together. That’s where my energy is going.”\nAge was also not an issue for the Briton, as he pointed to seven-time Super Bowl champion Tom Brady as a role model for top-level sporting longevity.\nThe National Football League quarterback, now 46, had a 23-year career before finally retiring in February.\n“I look at people like Tom Brady, who is such an incredible athlete and has shown what can be done today, so he’s the real role model in that respect,” Hamilton added.\n“I’m really, really fortunate to speak to him to understand as well what he does consistently to keep himself in shape.”\nHe also said two-time world champion Fernando Alonso, who was his McLaren teammate in his debut 2007 season, was another example. The Spaniard is still racing at 42 for Aston Martin and remains competitive, finishing second in last weekend’s Dutch Grand Prix.\nMercedes’ announcement has brought an end to speculation over Hamilton’s future as they struggle to compete with Red Bull, who have won every race so far this campaign.\nLast season, Hamilton failed to win or claim pole position for the first time in his career, while this term he is yet to add to his record 103 race victories.\nJuly’s pole in Budapest was his first in 33 races, and he finished that race in fourth after making a poor start in a race won by Verstappen.\nHe currently sits fourth in the drivers’ standings, 183 points behind the leading Dutchman, who at Monza is hunting a record-breaking 10th straight grand prix win.\nMercedes sit second in the constructors’ championship standings but trail Red Bull by a whopping 285 points.\nMeanwhile, Charles Leclerc has said that he wants to stay with Ferrari, but he is “not in a rush” to sign a new contract.\nThe 25-year-old Monaco native’s deal expires at the end of 2024.\n“I have always loved Ferrari and I would love to stay,” he told the BBC. “And I’ve always made it very clear that my goal is to try to be a world champion, with Ferrari. But for now, we are just focusing on the season. I am sure talks will arrive at one point during the season, probably a bit later on.” AFP, REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/hamilton-points-to-brady-and-alonso-for-career-longevity"}