{"authors": [], "date_download": "2024-10-12 14:10:59", "date_modify": "2024-10-12 14:10:59", "date_publish": "2024-08-13 10:40:30", "description": "The closing ceremony on Aug 11 attracted a US audience of 20.8 million, more than double that of Tokyo’s. Read more at straitstimes.com.", "filename": "sport_paris-olympics-average-306-million-viewers-a-day-82-bump-from-tokyo_1728742259.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/13/2024-08-11T221630Z224445258UP1EK8B1PVFJRRTRMADP3OLYMPICS-2024-CEREMONIES.JPG?VersionId=4LH5PLchiZ_6399yP_T1cKTrBXauMVmG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_paris-olympics-average-306-million-viewers-a-day-82-bump-from-tokyo_1728742259.html", "title": "Paris Olympics average 30.6 million viewers a day, 82% bump from Tokyo", "title_page": "Paris Olympics average 30.6 million viewers a day, 82% bump from Tokyo | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – About 30.6 million people on average watched the Paris Olympics on Comcast Corp’s American media outlets each day, an 82 per cent increase from the Tokyo Games in 2021.\nThe number includes the NBC broadcast network, and cable channels such as USA and the Peacock streaming service, NBC Sports said in a statement on Aug 12.\nThe closing ceremony a day earlier attracted a United States audience of 20.8 million, more than double that of Tokyo’s.\nIt featured aerialists and music performances from artists such as the French band Phoenix. Actor Tom Cruise rode a zip line down to the stage in a sequence that had him bringing the Olympic flag to Los Angeles, which hosts the next Games in 2028.\n“From the opening ceremony down the Seine through more than two weeks of heart-stopping competition culminating this past weekend with Team USA’s gold rush in men’s and women’s basketball, women’s soccer and track and field relays, these Olympics have captivated Americans in huge numbers across NBCUniversal platforms,” NBC Sports president Rick Cordella said.\n“Led by our best-in-class engineering and production teams in Paris and Stamford, a staff of more than 3,000 worked tirelessly to present these reimagined Games in new and innovative ways...”\nParent company Comcast used the Games as a showcase for Peacock, which trails rivals such as Netflix, Disney+ and Max in total subscribers. The service allowed viewers to stream all 329 medal events on demand, after their initial airing. Gold Zone, a daily programme that bounced around between live events, also drew praise from many viewers.\nNBC pulled out all the stops for the Olympics, which included renting a Parisian restaurant with a view of the Eiffel Tower for studio broadcasts.\nIndividual events also performed well. The US men’s basketball gold-medal victory over France on Aug 10 drew an average audience of 19.5 million, the highest for that event since 25.8 million people watched the Atlanta final in 1996, NBC said.\nThe BBC, meanwhile, said the Games were streamed 218 million times on its platforms, more than doubling Tokyo.\nWarner Bros Discovery, which has the rights in Europe, set records with 215 million viewers and a 77 per cent increase in paid streaming subscribers versus Tokyo.\nMany media outlets have compared their results to Tokyo, among the least-watched Games in recent years because of the time difference and because they were held a year late due to the Covid-19 pandemic. BLOOMBERG", "url": "https://www.straitstimes.com/sport/paris-olympics-average-306-million-viewers-a-day-82-bump-from-tokyo"}