{"authors": [], "date_download": "2024-10-12 14:13:45", "date_modify": "2024-10-12 14:13:45", "date_publish": "2023-04-03 15:40:54", "description": "Spectator suffered a cut to his arm when struck by a piece of debris from Kevin Magnussen’s car. Read more at straitstimes.com.", "filename": "sport_formula-one_fan-at-australian-grand-prix-left-bleeding-after-hit-by-car-debris_1728742425.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/03/svgrandprix030423_2.jpg?VersionId=mkODlXS8v1iofjeUdpe4HyPiwX9Rbszz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_fan-at-australian-grand-prix-left-bleeding-after-hit-by-car-debris_1728742425.html", "title": "Fan at Australian Grand Prix left bleeding after being hit by car debris", "title_page": "Fan at Australian Grand Prix left bleeding after being hit by car debris | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MELBOURNE – A spectator at the Formula One Australian Grand Prix suffered a cut to his arm when struck by a piece of debris from Kevin Magnussen’s car, putting the spotlight on the organisers’ safety protocols.\nWill Sweet told Australian radio station 3AW he was standing with his fiancee on a packed hill just off Turn 2 at Albert Park during Sunday’s race, when the Danish Haas driver’s car hit the track-side barrier sending his tyre and debris flying into the air.\n“It slapped me in the arm and I was just standing there bleeding,” he said.\n“My arm was covering where my neck would’ve been, but if that had hit my fiancee, it would’ve got her right in the head.\n“I realised how big it was and how heavy it was. Part of it was shredded and really sharp. If it had hit me from a different angle, it could’ve been horrendous.”\nAustralian media published a picture of Sweet holding a large piece of debris with blood trickling down his forearm and another showing him having treatment from a medical official at the track.\nSweet said the area where he was standing was packed, with young children around, and that no race officials came to assist him.\n“No one even came and looked,” he said. “My fiancee was pretty spooked by it and borderline shell-shocked.”\nThe race’s organisers are already under scrutiny after a large number of fans invaded the track near the end of the race.\nFootage showed a “large group” of the 131,000-strong crowd squeezing through barriers and climbing fences just metres from speeding cars, near the conclusion of a drama-packed race won by Red Bull’s Max Verstappen ahead of Mercedes’ Lewis Hamilton and Aston Martin’s Fernando Alonso.\nLate on Sunday, Formula One stewards ordered the Australian Grand Prix Corporation (AGPC) to urgently produce a “remediation plan” in response to security and safety failures that allowed fans to access the track.\nSome were able to reach the stranded Haas of Nico Hulkenberg, which was parked at the exit of Turn 2 after finishing seventh.\nThe governing body FIA said “security measures and the protocols which were expected to be in place for the event were not enforced, resulting in an unsafe environment for the spectators, drivers and race officials”.\nMeanwhile, Sweet said debris from Magnussen’s car had flown “straight up, way over the fence” and into the crowd.\nThe AGPC did not provide immediate comment on the incident but its chief Andrew Westacott vowed a full investigation on Monday on the track invasion, saying the outcome “could have been horrific”.\n“There’s a controlled allowance of people to come onto the track after the race has concluded and after the safety car passes,” he told national broadcaster the ABC.\n“Spectators had broken one of the lines. We don’t know how that’s occurred just yet.”\nWestacott said officials would trawl security cameras to try and find out how the breach occurred.\n“We’ve got a lot of CCTV and we’ve got a huge amount of footage we’re going to have to pore through over the next couple of weeks,” he said. “Motor sport is dangerous... it could have been horrific.\n“Nobody does anything malicious at motor sport. It’s an unbelievably well-behaved crowd but they, I think, had a degree of confusion. We don’t know how they got into the area without the right level of authority.”\nAt the 2001 Australian GP, a track marshal was killed when hit by the wheel of Jacques Villeneuve’s car following a crash with Williams’ Ralf Schumacher.\nThe organisers said a crowd of 131,124 were at Albert Park on Sunday and a record total of 444,631 spectators across the race week. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/formula-one/fan-at-australian-grand-prix-left-bleeding-after-hit-by-car-debris"}