{"authors": [], "date_download": "2024-10-12 13:41:57", "date_modify": "2024-10-12 13:41:57", "date_publish": "2024-08-04 14:15:23", "description": "Sri Lanka spinner Wanindu Hasaranga will miss the rest of their three-match One Day International (ODI) series against India due to a hamstring injury, governing body Sri Lanka Cricket (SLC) said on Saturday. Read more at straitstimes.com.", "filename": "sport_sri-lankas-hasaranga-out-of-india-series-with-hamstring-injury_1728740517.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/04/LYNXMPEK7301B-1.jpg?VersionId=vJbsav45UP1jxi1XHyl8rZXMNEKe4AKm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_sri-lankas-hasaranga-out-of-india-series-with-hamstring-injury_1728740517.html", "title": "Sri Lanka's Hasaranga out of India series with hamstring injury", "title_page": "Sri Lanka's Hasaranga out of India series with hamstring injury | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Sri Lanka spinner Wanindu Hasaranga will miss the rest of their three-match One Day International (ODI) series against India due to a hamstring injury, governing body Sri Lanka Cricket (SLC) said on Saturday.\nHasaranga, 27, picked up the injury during the first ODI on Friday when he claimed three wickets in a thrilling tie.\n\"He experienced pain in his left hamstring while delivering the last ball of his 10th over during the first ODI,\" SLC said in a statement. \"An MRI performed on the player, following this, confirmed the injury.\"\nHosts Sri Lanka are also without pacers Matheesha Pathirana and Dilshan Madushanka, who were injured during last month's T20 series against India.\nSri Lanka face India in the second ODI on Sunday, with the third match scheduled for Aug. 7 in Colombo. REUTERS", "url": "https://www.straitstimes.com/sport/sri-lankas-hasaranga-out-of-india-series-with-hamstring-injury"}