{"authors": [], "date_download": "2024-10-12 14:01:21", "date_modify": "2024-10-12 14:01:21", "date_publish": "2024-06-26 14:57:47", "description": "Formula One statistics for Sunday's Austrian Grand Prix at Spielberg, the 11th round of the 24-race championship and third sprint race of the season: Read more at straitstimes.com.", "filename": "sport_formula-one_formula-one-statistics-for-the-austrian-grand-prix_1728741681.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/26/LYNXMPEK5P06L-1.jpg?VersionId=7n8RkC12UDYPBIt8BmPcEiPUIIXge7a_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_formula-one-statistics-for-the-austrian-grand-prix_1728741681.html", "title": "Formula One statistics for the Austrian Grand Prix", "title_page": "Formula One statistics for the Austrian Grand Prix | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Formula One statistics for Sunday's Austrian Grand Prix at Spielberg, the 11th round of the 24-race championship and third sprint race of the season:\nLap distance: 4.318km. Total distance: 306.452km (71 laps)\n2023 pole position: Max Verstappen (Netherlands) Red Bull one minute 04.391 seconds\n2023 sprint winner: Verstappen\n2023 race winner: Verstappen\nRace lap record: Carlos Sainz (Spain) Ferrari 1:05.619, 2020\nStart time: 1300 GMT (1500 local)\nAUSTRIA\nThe circuit is owned by Red Bull and has the shortest lap, in terms of time, on the calendar with just 10 corners but aggressive kerbs.\nIt also has the second biggest difference between its highest and lowest points (69m), after Spa-Francorchamps.\nA 2.5m wide gravel strip has been added behind the kerb at the exit to turns nine and 10 after a flurry of track limits violations last year.\nThis year's Austrian race is the 37th in the history of the championship, with the first held at Zeltweg airfield in 1964 and then moving to Spielberg's Oesterreichring (a shortened version later named A1 Ring and now Red Bull Ring) in 1970.\nThe circuit also hosted the Styrian Grand Prix in 2020 and 2021, during the pandemic.\nThere have been 10 winners from pole in 19 races on the current configuration. The run from pole to turn one is 330m, with most overtakes occurring into turns three and four. Turns two, five and eight are taken at full throttle.\nVerstappen (2018, 2019, 2021, 2023), Valtteri Bottas (2017, 2020), Charles Leclerc (2022) and Lewis Hamilton (2016) are the only drivers on the current grid to have won the Austrian GP.\nHamilton won the 2020 Styrian Grand Prix, and Verstappen won in 2021, at the same circuit.\nCHAMPIONSHIP LEAD\nVerstappen has led the championship for a record 49 successive races dating back to Spain in May 2022 and arrives in Spielberg 69 points clear of McLaren's Lando Norris.\nRed Bull are 60 points clear of Ferrari.\nSPRINT\nVerstappen has won nine of the 14 sprint races held so far.\nWINS\nVerstappen has won seven of 10 races this season, with Sainz triumphant in Melbourne, McLaren's Lando Norris in Miami and Leclerc in Monaco.\nFerrari are the only team to have had two winning drivers this season.\nHamilton has a record 103 career victories from 342 starts. He has now gone 55 races without a win, a run dating back to 2021.\nRed Bull have won 120 races and are fourth in the all-time list of winners. Ferrari lead with 245, McLaren have 184 and Mercedes 125.\nVerstappen has won 61 grands prix and is third on the all-time list. Michael Schumacher is second on 91.\nPOLE POSITION\nHamilton has a record 104 career poles, his most recent in Hungary last year.\nVerstappen took the first seven poles of the season, equalling Alain Prost's 1993 record, and eight in a row including the last race of 2023 -- equalling Ayrton Senna's 1988-89 record.\nLeclerc ended that run with pole in Monaco and George Russell was fastest for Mercedes in Canada with Norris taking the top spot in Spain.\nThe last time Red Bull went three races without pole position was in 2022 (Leclerc/Russell/Sainz in France/Hungary/Belgium respectively). Leclerc had four in a row that same year.\nPODIUMS\nVerstappen has 106 career podiums, Hamilton 198.\nVerstappen has been on the podium eight times this season.\nMILESTONE\nVerstappen will have led the championship for 50 races in a row after Austria, whatever happens. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/formula-one-statistics-for-the-austrian-grand-prix"}