{"authors": [], "date_download": "2024-10-12 14:11:23", "date_modify": "2024-10-12 14:11:23", "date_publish": "2024-08-09 21:12:03", "description": "PARIS - When an Egyptian fencer picked up her sabre and an Azerbaijani archer steadied her bow, there was one thing Paris Olympics spectators may not have immediately noticed - they were pregnant. Read more at straitstimes.com.", "filename": "sport_pregnant-fencer-and-archer-send-message-of-strength-to-women_1728742283.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/09/LYNXMPEK780I4-1.jpg?VersionId=FceYCDabk33c7dB5v5PTd.I7fB_4mkFK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_pregnant-fencer-and-archer-send-message-of-strength-to-women_1728742283.html", "title": "Pregnant fencer and archer send message of strength to women", "title_page": "Pregnant fencer and archer send message of strength to women | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - When an Egyptian fencer picked up her sabre and an Azerbaijani archer steadied her bow, there was one thing Paris Olympics spectators may not have immediately noticed - they were pregnant.\nThough Nada Hafez did not walk away with a fencing medal, she said her Paris journey served as proof to herself that she could surmount challenges, as well as being a positive example for her soon-to-be-born child and a message for other women.\n\"You're not sick, you're just pregnant. And you can do whatever you want and you're really strong,\" Hafez told Reuters, in her first interview in English after revealing she was seven months pregnant with \"a little Olympian\" in an Instagram post. \"Our bodies can surprise us.\"\nAzerbaijan's Yaylagul Ramazanova was eliminated in the archery individual round of 16, but the experience validated her efforts too.\n\"This proves that women can always go for their goals, giving them strength,\" she told Reuters.\nStill, competing while in her third trimester did not come without worries for Hafez until a consultation with her doctor gave her confidence.\n\"Of course I was happy about my pregnancy as any mother, but at the same time, I was afraid to lose my dream about Paris 2024,\" she said, adding that her doctor reassured her that sport could be beneficial for both her and the baby's health.\n\"So this changed all my perspective about the Olympics and I told myself I can do it,\" Hafez said.\nThere is much for the fencer to look forward to as she settles in back home.\n\"I really can't wait to see my baby and to tell about all the stories and about all what happened at the Olympics,\" she said. \"And I think my baby would be so proud about that.\" REUTERS", "url": "https://www.straitstimes.com/sport/pregnant-fencer-and-archer-send-message-of-strength-to-women"}