{"authors": [], "date_download": "2024-10-12 13:48:14", "date_modify": "2024-10-12 13:48:14", "date_publish": "2024-09-26 13:12:20", "description": "Bidding will start Friday at an opening price of $650,000 - buyers can purchase it outright for $5.8 million Read more at straitstimes.com.", "filename": "sport_shohei-ohtani-50-50-home-run-ball-up-for-auction_1728740894.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/26/BBA-BBN-SPO-LOS-ANGELES-DODGERS-V-MIAMI-MARLINS-030018.jpg?VersionId=cAg3rPzXxGnIcPq1Dga1ngwR524F0USx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_shohei-ohtani-50-50-home-run-ball-up-for-auction_1728740894.html", "title": "Shohei Ohtani 50-50 home run ball up for auction", "title_page": "Shohei Ohtani 50-50 home run ball up for auction | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – The home run ball that saw Japanese superstar Shohei Ohtani become the first player in Major League Baseball (MLB) history to hit 50 homers and steal 50 bases in one season is for sale, auction house Goldin said on Sept 25.\nBidding will start on Sept 27 at an opening price of US$500,000 (S$643,400), although buyers have a chance to purchase the ball outright for US$4.5 million between Sept 27 and Oct 9, according to the listing on the Goldin website.\nIf bidding reaches US$3 million before Oct 9, Goldin will remove the option to purchase it privately, and interested parties must bid for the baseball.\nThe record price for a baseball is US$3.05 million paid for Mark McGwire’s 70th home run ball of 1998.\n“This offered baseball is truly a one-of-a-kind specimen, a crowning piece for any game-used memorabilia collection,” the listing says, adding that the ball “exhibits excellent game use, with black scuffing and surface abrasions present throughout the white leather surface”.\nOhtani’s 50th home run of the season came during a spectacular offensive outing for the Los Angeles Dodgers against the Marlins in Miami on Sept 19.\nHe had six hits in six at bats, including two doubles for a total of five extra-base hits.\nHe drove in 10 runs, scored four and stole two bases to help the Dodgers clinch a post-season berth that will mark Ohtani’s first trip to the MLB playoffs.\nOhtani had already stolen two bases in the first two innings to take his tally to 51 for the season when he turned up the power at the plate.\nHe smashed his 49th home run of the season in the sixth inning then established the 50-50 club with his second homer of the game in the seventh – belting a curveball from Mike Baumann into the left field stands at LoanDepot Park.\nThe fan who caught it reportedly turned down the Dodgers’ offer to purchase it for US$300,000 and wasted little time in consigning it with Goldin.\n“This was one of the easiest (consignments) ever,” Ken Goldin, founder and chief executive of the auction house, told ESPN. “Ohtani (hits 50) on Thursday, literally Friday we heard from the guy, he contacted Goldin on his own through social media, flew a security guard down to Miami on Monday with a representative from Goldin, met him, flew back Monday.”\nSo far the consigner has opted to remain anonymous. AFP", "url": "https://www.straitstimes.com/sport/shohei-ohtani-50-50-home-run-ball-up-for-auction"}