{"authors": [], "date_download": "2024-10-12 13:44:01", "date_modify": "2024-10-12 13:44:01", "date_publish": "2024-06-21 23:21:02", "description": "A Roman Yaremchuk goal 10 minutes from time sealed a come-from-behind 2-1 win over Slovakia. Read more at straitstimes.com.", "filename": "sport_football_ukraine-keep-euro-2024-hopes-alive-with-2-1-win-against-slovakia_1728740641.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/21/2024-06-21T141727Z256518972UP1EK6L13P16TRTRMADP3SOCCER-EURO-SVK-UKR-REPORT.JPG?VersionId=yUnRHzKIo._rQo9_HZVBGs8nas.SJbgx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_ukraine-keep-euro-2024-hopes-alive-with-2-1-win-against-slovakia_1728740641.html", "title": "Ukrainian spirit and a Volodymyr Zelensky pep talk keep their Euro 2024 hopes alive", "title_page": "Ukrainian spirit and a Volodymyr Zelensky pep talk keep their Euro 2024 hopes alive | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DUSSELDORF – Ukraine players knew they had to do something, perhaps step up a gear or two, following the humiliation of their 3-0 Euro 2024 Group E opening loss to Romania.\nSoon after the final whistle blew in that defeat, they requested for coach Serhiy Rebrov and his coaching staff to leave the dressing room while they held a clear-the-air meeting to talk about what went wrong during the match.\nIt was unclear if it was a fierce debate or a peaceful discussion, but it worked in their favour.\nOn June 21, Ukraine held on to that determination and fought back from a goal down to beat Slovakia 2-1 at the Merkur Spiel-Arena in Dusseldorf and claim three precious points.\nThe victory left them second in the group, level on three points with Slovakia and leaders Romania, who have a superior goal difference. The Romanians take on Belgium – who lost 1-0 to the Slovaks in their opener – on June 22.\n“We reacted very well to conceding. We changed some positions in our high press at half-time. The players who came off the bench improved us. Most importantly, we showed our spirit. We really tried to change the result and deserved the win,” said Rebrov.\nMatch winner Roman Yaremchuk added: “The key to victory was team spirit. We spoke today with Ukraine’s president (Volodymyr Zelensky). He gave us incredible motivation. You know how difficult the situation is in our country, so we must give some joy to our people.”\nThe substitute scored 10 minutes from time to beat the shell-shocked Slovaks and keep alive their hopes of reaching the next round.\nThe striker latched on to a flighted pass from Mykola Shaparenko and prodded the ball past goalkeeper Martin Dubravka to deny Slovakia an early place in the knockout phases.\nUkraine made four changes from their miserable drubbing by Romania, with winger Andriy Yarmolenko and goalkeeper Anatoliy Trubin brought into the side. They both played vital roles in the victory.\nSlovakia started strongly with Lukas Haraslin, Ivan Schranz and David Hancko forcing good early saves from Trubin early on, before Schranz broke the deadlock in the 17th minute. The forward scored his second goal of the tournament with a superb downward header from Haraslin’s cross.\nUkraine battled hard to get back into the game, with Oleksandr Tymchyk hitting the post just after the half-hour mark.\nThey finally got their reward after 54 minutes when Shaparenko found himself in space and fired coolly into the net from an Oleksandr Zinchenko cross.\nThe Ukrainians, buoyed by their equaliser, kept up the pressure throughout the second half until they snatched the winner late on.\nRebrov had urged his players to recover from the “cold shower” of their heavy opening defeat and play with more fight.\nJudging by their latest performance, they did exactly that and few would write them off when they face Belgium on June 26 in their last group game.\nMeanwhile, Slovakia skipper Milan Skriniar said: “The first half was OK from our side but we just can’t play the way we played in the second half. We didn’t follow instructions, we allowed our opponents to turn the game.” REUTERS", "url": "https://www.straitstimes.com/sport/football/ukraine-keep-euro-2024-hopes-alive-with-2-1-win-against-slovakia"}