{"authors": [], "date_download": "2024-10-12 14:13:58", "date_modify": "2024-10-12 14:13:58", "date_publish": "2024-08-10 15:22:20", "description": "PARIS - Sifan Hassan won the women's marathon, taking gold in an Olympic record time of two hours, 22 minutes and 55 seconds. Read more at straitstimes.com.", "filename": "sport_basketball_paris-olympics-2024-what-you-need-to-know-right-now-0_1728742438.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/10/LYNXMPEK7902G-1.jpg?VersionId=Kwcxyn.4OibhRw3sjbp5iqlEl49tGG2T", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_paris-olympics-2024-what-you-need-to-know-right-now-0_1728742438.html", "title": "PARIS OLYMPICS 2024: What you need to know right now", "title_page": "PARIS OLYMPICS 2024: What you need to know right now | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Sifan Hassan won the women's marathon, taking gold in an Olympic record time of two hours, 22 minutes and 55 seconds.\nHers was the first medal won on the last day of the 2024 Olympics, with more than a dozen up for grabs.\nLater, Paris will pass the baton to Los Angeles during the closing ceremony, after a successful Games for the French that helped reboot the Olympic brand.\nHere is what you need to know about the Olympics on Sunday.\nDISTANCE QUEEN HASSAN\nThe Netherlands' Sifan Hassan deployed her famous late kick to win the women's marathon, adding the gold to her bronze medals in the 5,000 and 10,000 metres earlier in the week.\nHassan battled with Tigst Assefa of Ethiopia and managed to shake her in the last stretch to win by three seconds.\nFINAL DAY\nIt might be the final day but there are still 14 gold medals on offer, including in the men's and women's wrestling, the women's basketball and on the cycling track.\nU.S. DOMINATE THE RELAYS\nThe United States won the men's and women's 4x400 metres relays, cementing a dominant performance on the track by the Americans at this Olympics.\nThe women won by more than four seconds, clocking the second-quickest time in history and stretching the country's victory streak in the event to eight in a row.\nThe men cut it a bit finer, just holding off Botswana on the finish line.\nJamaica's dominance in the women's sprinting came to an end in Paris.\nU.S. SPOIL FRENCH DREAMS OF BASKETBALL FAIRYTALE\nThere was no \"Miracle on the Seine\" for France in the basketball as the United States ground out a 98-87 win to claim a fifth consecutive Olympic gold medal.\nThe American showmen crushed Gallic hearts, led by Stephen Curry and a fired up LeBron James.\nJames, the 39-year-old LA Lakers star, said he could not imagine himself playing at the Los Angeles 2028 Games.\nTAIWAN'S LIN WINS BOXING GOLD\nTaiwan's Lin Yu-ting, 28, one of two boxers at the centre of a gender eligibility row, beat Poland's Julia Szeremeta to claim the women's featherweight title.\nIt is unclear whether boxing will feature at the next Olympics. The International Olympic Committee ran the event at Paris after it stripped the International Boxing Association of its status as the sport's global body over governance and finance issues.\nRival body World Boxing said national boxing federations needed to join its ranks to ensure the sport is included in the Los Angeles line up.\nKIPYEGON'S GOLDEN HAT-TRICK\nKenya's Faith Kipyegon won her third straight Olympic 1,500 metres gold on Saturday, surging through the final lap to finish more than a second ahead of the field.\nShe cemented her status as one of the all-time great middle-distance runners, becoming the first athlete to claim three successive Olympic 1,500m titles.\nNorway's Jakob Ingebrigtsen bounced back from his shock defeat in the 1,500 metres to win the 5,000 with a fierce final lap.\nU.S. GYMNAST CHILES MAY LOSE MEDAL\nAmerican gymnast Jordan Chiles is set to lose her bronze medal in the women’s artistic gymnastics floor exercise competition after the Court of Arbitration for Sport ruled in favour of an appeal by Romania's Ana Barbosu, who will move up to third place, it said on Saturday.\nMEDAL TABLE MACHINATIONS\nGolds in the diving, the men's 102kg weightlifting and table tennis helped get China back on top of the medals table based on number of golds.\nThe United States trail by just one gold and will be looking for wins in the women's basketball and volleyball matches on take the number one slot back.\nFrance have gone up to fifth in the standings after winning gold in the men's volleyball final against Poland.\nPresident Emmanuel Macron had set a target of a top five finish before the Games began.\nCHINA'S GOLDEN SWEEP\nCao Yuan won the men's 10-metre platform event to complete a golden sweep for China, the first time a country has won all the diving events at one Games.\nRikuto Tamai of Japan took silver to land Japan an Olympic diving medal for the first time, and Britain's Noah Williams finished in third place to claim the bronze.\nTHE PRODUCT PLACEMENT GAMES\nWinning athletes in Paris have received their medals on Louis Vuitton trays before being handed a Samsung flip phone to take a \"victory selfie\", heralding a new era of product placement at the Olympics which Los Angeles looks set to build upon. REUTERS", "url": "https://www.straitstimes.com/sport/basketball/paris-olympics-2024-what-you-need-to-know-right-now-0"}