{"authors": ["Sazali Abdul Aziz", "Nicole Chia"], "date_download": "2024-10-12 14:21:19", "date_modify": "2024-10-12 14:21:19", "date_publish": "2020-03-25 21:16:43", "description": "Private sports academies and sport facility operators scrambled to map out adjustments to be made to their operations before stiffer new measures by MOH to combat the coronavirus pandemic kicked in. Read more at straitstimes.com.", "filename": "sport_coronavirus-private-gyms-academies-clamber-in-order-to-meet-enhanced-safety-measures_1728742879.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/03/25/wh-privategym-250320.jpg?VersionId=0on4IHBi0FXsd0vooqQUfZVywq5EnAkz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_coronavirus-private-gyms-academies-clamber-in-order-to-meet-enhanced-safety-measures_1728742879.html", "title": "Coronavirus: Private gyms, academies clamber to scale down classes in order to meet enhanced safety measures", "title_page": "Coronavirus: Private gyms, academies clamber to scale down classes in order to meet enhanced safety measures | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Private sports academies and sport facility operators scrambled on Wednesday (March 25) as they mapped out adjustments that had to be made to their operations before stiffer new measures by the Ministry of Health (MOH) to combat the coronavirus pandemic kicked in at midnight on Friday.\nMOH had announced on Monday night that all sporting events, regardless of size, must be deferred or cancelled, with the measure taking effect until at least April 30.\nThe same rule applies to conferences, exhibitions, festivals, concerts and trade fairs.\nThis meant the immediate suspension of national sports leagues, like football's professional Singapore Premier League (SPL) and the Netball Super League, as well as training sessions for athletes involved.\nNational team training may proceed with training sessions limited to 10 people or fewer and with appropriate screening measures.\nSPL club officials The Straits Times spoke to said their club would prepare individual training programmes for their players to follow remotely.\nHougang United head coach Clement Teo added: \"We will track their running times... and plan to use (mobile app) platforms to connect with them during this five-week period and monitor their progress.\"\nThe picture was less clear for privately-run gyms. They grappled with the new government requirements, which also limits gatherings outside of work and school to 10 persons or fewer.\nWhen contacted, gym chains Virgin Active and Fitness First said they were exploring their next steps.\nA spokesman for True Fitness, which has eight branches islandwide, said it implemented several measures such as reducing capacity at each location, marking out the floor and equipment to comply with physical distancing requirements, and limiting its small group training programme to fewer than 10 participants.\nThe MOH guidelines on limiting gatherings are also set to have a big impact on how gyms conduct their activities with some, like boxing gym Legends Fight Sport, scrapping classes altogether.\nRun by former national boxer Muhamad Ridhwan, Legends announced on Wednesday it would shut down its regular class-based programmes, and offered personal coaching sessions at a discounted rate instead.\n\"This way, we can still give our clients the opportunity to train while controlling the crowd flow in the gym,\" he said.\nLim Yao Xiang, co-founder of Grityard, which is only eight months old, was one of several gym operators who expressed worry over rental fees.\nThe 37-year-old former national water polo player said: \"It's very hard to predict what will happen because we don't know how long this will last, and how our members will respond.\n\"The worst-case scenario is (gyms) having to close down like bars and entertainment outlets, then we have to see how long we can survive... We can only count our blessings that we still have a gym to run.\"\nPrivate sports academies have also suspended operations.\nESPZEN, which runs football classes and leagues for children and adults, halted all its programmes indefinitely on Tuesday and its general manager Lhet Salomon said the coronavirus pandemic has affected revenue and attendance, although she declined to reveal numbers.\nBut she added: \"It was a difficult decision to take, but one that we had to as we needed to ensure our customers feel safe and know that we care for their safety and welfare.\n\"As service providers, we have to manage this situation the right way now. If we manage it poorly, once business resumes we might end up with no customers.\"\nRadhika Radhakrishnan, the chief financial officer of the F-17 Academy, also said it would follow suit and suspend training sessions for about 500 kids aged between two and 17 enrolled in its programmes.\nHowever, while the mother of three said she was supportive of the MOH measures for public activities, she added: \"If an MRT cabin has more than 10 people, why can't football training continue?\n\"I am not convinced we have to stop. Most of the kids in academies playing football... lead a healthy lifestyle and they are in the sun which naturally builds their immune system.\"\nFormer Asian Games swimming champion Tao Li, who runs an eponymous swim club, said group classes for most of her 200 students have been cancelled, with only private one-on-one lessons continuing.\nThe 30-year-old, who estimated a revenue dip of at least 30 per cent, said: \"Of course I am worried for the company, but I'd rather be affected now (in terms of cancelling group lessons) rather than a student getting infected and the whole business has to be shut.\n\"We'd rather do our part to keep society healthy rather than take this risk, and it's for everybody's safety so it's fine.\"\nRecreational sports have also been disrupted. For ultimate frisbee player Victor Tan, the new guidelines mean popular national tournament Gendermah 2020, originally scheduled to take place this weekend, was cancelled.\nTan also learnt on Tuesday that the world championships in the Netherlands in July, when he would be a part of the Singapore team, were also canned.\n\"When my teammates and I heard the news, we were heartbroken,\" said the 30-year-old, who trains between two and four times a week with his club, Shiok, at Turf City or Farrer Park.\n\"But I think the general consensus is that the coronavirus pandemic is a severe issue, and obviously we don't want to affect our friends or family just because of our desire to play.\"", "url": "https://www.straitstimes.com/sport/coronavirus-private-gyms-academies-clamber-in-order-to-meet-enhanced-safety-measures"}