{"authors": [], "date_download": "2024-10-12 14:11:25", "date_modify": "2024-10-12 14:11:25", "date_publish": "2024-06-06 15:02:54", "description": "Boston, seeking their first title since 2008, have won 12 of their 14 play-off games and gone undefeated on the road. Read more at straitstimes.com.", "filename": "sport_basketball_boston-celtics-ready-to-battle-luka-doncic-and-the-dallas-mavericks-in-nba-finals_1728742285.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/06/BKN-SPO-BOSTON-CELTICS-V-INDIANA-PACERS-GAME-FOUR-012713_2.jpg?VersionId=FjNrQKAJ1fzP9BXAao_TU_MrnczVlTRw&h=4e40906f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_boston-celtics-ready-to-battle-luka-doncic-and-the-dallas-mavericks-in-nba-finals_1728742285.html", "title": "Boston Celtics ready to battle Luka Doncic and the Dallas Mavericks in NBA Finals", "title_page": "Boston Celtics ready to battle Luka Doncic and the Dallas Mavericks in NBA Finals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – A Boston Celtics team desperate for glory will face a Dallas Mavericks squad eager to play spoiler, when they clash in the National Basketball Association (NBA) Finals which tip off on June 6 (June 7, Singapore time).\nLed by stars Jayson Tatum and Jaylen Brown, the Celtics have had an easy road to the title-deciding series.\nComing out of the weaker Eastern Conference as top seeds, they breezed past the Jimmy Butler-less Miami Heat, beat the Cleveland Cavaliers and the Indiana Pacers, who were without All-Star Tyrese Haliburton for the last two games.\nBoston have won 12 of their 14 play-off games and gone undefeated on the road, but they know that none of that will matter if they fail to end a title drought that stretches back to 2008.\nThe mission is clear – hang that elusive record 18th championship banner from the TD Garden rafters and put recent post-season disappointment, including falling to the Golden State Warriors in the 2022 Finals and coming up short in the Conference Finals in 2023, firmly behind them.\n“They were the best team in the regular season and they have been the best team in the play-offs,” former NBA player and ESPN analyst J.J. Redick said ahead of Game 1 in Boston.\n“I feel strongly that they are the favourites going into this series. At the same time, I wouldn’t be surprised if Luka (Doncic) and Kyrie (Irving) and (Dallas coach Jason Kidd) win... This is going to be a phenomenal series.”\nTatum, 26, is raring to go but taking nothing for granted.\n“I hate that we had to go through it. I wish we would have won,” he said, referring to their 2022 defeat.\n“But I’m a firm believer that everything happens for a reason. There’s a lesson to be learnt in every situation. Last year we didn’t (even) make it to the Finals. Put things in perspective.\n“You could see our excitement when we won the Conference (this year). I do feel a lot different this time. I’m excited for the opportunity for us to get the job done.”\nBrown, 27, said he has watched the 2022 Finals several times to learn how to better manage his emotions and to make better decisions on the court.\n“You learn and grow from your experiences, two years later makes a pretty big difference,” he said.\n“We’ve been able to go through experiences, having success but not having success at the same time. The ultimate goal is to get over the hump and win.”\nStanding in Boston’s way are a confident Mavs team under far less pressure but equipped to ruin the Celtics’ hopes.\nThat starts with Doncic, the star Slovenian guard who is quickly becoming the face of the league.\nHe has been the best player in the play-offs and is the first to lead in points (489), rebounds (164) and assists (150) coming into a Finals.\nBy his side is veteran point guard Irving who, after turbulent stints in Brooklyn and Boston, has looked more comfortable and confident on the court than he has in years.\n“I think it’s fair to say that offensively they are as talented as any backcourt in NBA history,” Redick said.\nDoncic has built confidence, Irving has used insight and experience, and both have shown stunning skills as Dallas overcame the Los Angeles Clippers, Oklahoma City Thunder and Minnesota Timberwolves in the play-offs.\n“Amazing. First time in the NBA Finals. Hopefully not the last,” Doncic, 25, said. “Never take it for granted. You never know if you’re going to come back, so just enjoy the experience.”\nIt was much the same lesson stressed by Irving, 32, who won an NBA title with LeBron James at Cleveland in 2016.\n“His leadership is amazing,” Doncic added of his teammate.\n“He’s the one who has been to the Finals, who has won the Finals. He’s keeping us all together and motivated.”\nOne question mark hanging over the series is the health of Boston’s Kristaps Porzingis, the former Maverick who suffered a calf strain in the Heat series and has been sidelined since. REUTERS, AFP", "url": "https://www.straitstimes.com/sport/basketball/boston-celtics-ready-to-battle-luka-doncic-and-the-dallas-mavericks-in-nba-finals"}