{"authors": ["Deepanraj Ganesan"], "date_download": "2024-10-12 14:16:56", "date_modify": "2024-10-12 14:16:56", "date_publish": "2023-12-20 12:03:35", "description": "The FIA has also recognised the recovery marshals here as the 'best team of officials'. Read more at straitstimes.com.", "filename": "sport_formula-one_singapore-formula-1-grand-prix-hailed-as-best-race-of-2023-by-international-media_1728742616.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/20/2023091724194525bum2744-02.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_singapore-formula-1-grand-prix-hailed-as-best-race-of-2023-by-international-media_1728742616.html", "title": "Formula 1 Singapore Grand Prix hailed as ‘best race of 2023’ by international media", "title_page": "Formula 1 Singapore Grand Prix hailed as ‘best race of 2023’ by international media | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – The 2023 Formula One Singapore Airlines Singapore Grand Prix delivered thrills and spills under the city’s bright lights on Sept 17 and the race has now earned international recognition with several awards from numerous media outlets around the world.\nDutchman Max Verstappen and his Red Bull team left the competition in their wake en route to their drivers’ and constructors’ title double. Of the 22 races, they failed to win only at the Marina Bay Street Circuit as Ferrari’s Carlos Sainz triumphed.\nSky Sports, ESPN, the UK’s Metro, and online racing news site WTF1 named Singapore as the best race of the season, while Motor Sport magazine nominated the night race for its own accolade.\nSky Sports said: “We are not saying this because it’s the only one Red Bull didn’t win, it was genuinely a thriller to the end as Sainz, Lando Norris, George Russell and Lewis Hamilton had a big four-way scrap for the lead in the closing stages.”\nWTF1 hailed it for “some of the closest racing we have seen across the season, with both Mercedes (drivers) chasing down Sainz and Norris. Don’t forget the last-lap drama of George Russell’s Turn 10 crash”.\nFormula One’s governing body, the FIA, also recognised the Singapore team of recovery marshals as the “best team of officials”. The category is under the annual FIA Volunteers and Officials Awards, which celebrate the efforts of volunteer race officials across motorsports events around the world.\nWinners of the award – which the Singapore Grand Prix also won in 2018 – were assessed based on their achievement, leadership, ability to overcome difficulties, performance and dedication.\nThe recovery marshals at the 2023 night race carried out 17 recoveries over the race weekend, including Aston Martin driver Lance Stroll’s dramatic crash, Esteban Ocon’s retirement due to his Alpine’s gearbox failure, and Russell’s final-lap crash in his Mercedes.\nJanette Tan, race operations director of Singapore GP, said the success was a reflection of the wider teamwork and commitment of the 900-strong team of volunteer marshals.\nShe added: “I am delighted that our recovery team, which is made up of 50 volunteers from a myriad of backgrounds, have been recognised for their hard work, personal sacrifices and dedication with this award.\n“Around 90 per cent of them (volunteer marshals) return as volunteers for every edition of the race, and I feel privileged to work with such a passionate team year after year.”\nThe Singapore race drew a near sell-out crowd of 264,108 over the three days. The 2024 edition is from Sept 20-22 and will see the debut of the all-female racing category F1 Academy as a supporting race.\nEarly-bird tickets have sold out, while others are available online at www.singaporegp.sg", "url": "https://www.straitstimes.com/sport/formula-one/singapore-formula-1-grand-prix-hailed-as-best-race-of-2023-by-international-media"}