{"authors": [], "date_download": "2024-10-12 14:00:28", "date_modify": "2024-10-12 14:00:28", "date_publish": "2024-08-07 07:16:20", "description": "PARIS - Timo Boll played his last match in international competition in the same manner that has won him respect from rivals and fans in his 30-year table tennis career: calm, composed and fighting until the final point. Read more at straitstimes.com.", "filename": "sport_tennis_table-tennis-timo-boll-exits-games-but-wins-respect-in-olympic-farewell_1728741628.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/07/LYNXMPEK750YC-1.jpg?VersionId=rkg.C_mZW1qq4hiRjzYdme7ncsl1MClx", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_table-tennis-timo-boll-exits-games-but-wins-respect-in-olympic-farewell_1728741628.html", "title": "Table Tennis-Timo Boll exits Games, but wins respect in Olympic farewell", "title_page": "Table Tennis-Timo Boll exits Games, but wins respect in Olympic farewell | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Timo Boll played his last match in international competition in the same manner that has won him respect from rivals and fans in his 30-year table tennis career: calm, composed and fighting until the final point.\nThe four-time Olympic medallist bids farewell, after his Germany team were defeated 3-0 by Sweden in the men's quarter-finals at the Paris Olympics on Tuesday.\nIt was not quite the ending Boll, 43, was hoping for when he entered his seventh Olympics, but he joked that he was glad it was friend Anton Kallberg who brought down the curtain on his international career with a 3-1 win.\n\"Maybe we can talk about it when we see each other in our league next week,\" said Boll, who will play one more season for his club Borussia Duesseldorf until his contract finishes.\nHe didn't go down without a fight, taking the third game from the Swede and battling to 8-8 in the fourth before Kallberg took the next three points to wrap up victory.\n\"It makes me very sad. We are very good friends with each other and long time playing together in the same team. So he obviously meant a lot for table tennis in the whole world. We are losing a legend, but he is not going to be forgotten,\" said Kallberg.\nHis teammate at the Olympics and once rival Dimitrij Ovtcharov said he was impressed by how Boll handles losses.\n\"I’ve rarely met athletes who can so quickly process a loss or a win and then return to normal life. Timo is not only a great table tennis player but also a very good person,\" said Ovtcharov.\nBoll made his Olympic debut in Sydney in 2000, wining silver in the team event at Beijing 2008 and Tokyo 2020 and bronze in London 2012 and Rio 2016. His best Olympic singles performance came in Athens in 2004 when he reached the quarter-finals.\nHe was given a standing ovation from the crowd on Tuesday, which included NBA great Dirk Nowitzki.\nFor over two decades, he managed to stay among the top players in the world.\n\"I'm able to be resilient against everything, against the changes we had in the past. But finally, you feel that your body is slow and it's getting harder and harder to keep the level so high. So I think it was the right moment,\" said Boll, who plans to spend more time with his family in his post-competition life. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/table-tennis-timo-boll-exits-games-but-wins-respect-in-olympic-farewell"}