{"authors": [], "date_download": "2024-10-12 14:02:47", "date_modify": "2024-10-12 14:02:47", "date_publish": "2024-06-05 05:11:42", "description": "Alcaraz powers to a 6-3, 7-6 (7/3), 6-4 victory over Greece's Stefanos Tsitsipas. Read more at straitstimes.com.", "filename": "sport_tennis_alcaraz-steamrolls-tsitsipas-to-book-sinner-semi-final-at-french-open_1728741767.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/05/TENNIS-FRA-OPEN-2024-211206.jpg?VersionId=Pljsikuq6plTRhEyj7gno8xXJSsUGIMv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_alcaraz-steamrolls-tsitsipas-to-book-sinner-semi-final-at-french-open_1728741767.html", "title": "Carlos Alcaraz sets up French Open match ‘everybody wants to see’ against Jannik Sinner", "title_page": "Carlos Alcaraz sets up French Open match ‘everybody wants to see’ against Jannik Sinner | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Carlos Alcaraz saw off Stefanos Tsitsipas in straight sets on June 4 to set up a mouthwatering French Open semi-final clash with incoming world number one Jannik Sinner.\nThe reigning Wimbledon champion proved too strong for former Roland Garros runner-up Tsitsipas, powering to a 6-3, 7-6 (7/3), 6-4 victory on Court Philippe Chatrier.\n“I was really calm in the moments I had to (be),” he said. “I’m really happy to play a semi-final here again at Roland Garros.”\nAlcaraz will be desperate to right the wrongs of 2023 – when he suffered cramps in a defeat by Novak Djokovic – in his second successive French Open semi-final.\nThe 21-year-old Spaniard has now won all six of his career matches against ninth-ranked Tsitsipas, including back-to-back quarter-finals in Paris after his three-set victory at the same stage in 2023.\nHe is bidding to become the youngest man in history to win Grand Slam tournaments on hard, grass and clay courts after his Wimbledon triumph and 2022 US Open title.\nAlcaraz will face Sinner on June 7 for the ninth time, with the pair’s head-to-head record level at 4-4.\n“It’s a really difficult challenge, I’m not going to lie,” said Alcaraz of Sinner, who will usurp Djokovic at the top of the rankings next week.\n“I think right now he’s the best player in the world, the player who’s playing the best tennis right now.”\nThere will be a new name on the men’s trophy this year after Djokovic pulled out ahead of his quarter-final with a knee injury, while it will also be the first final without one of the ‘big three’ since 2004.\nThe winner of Alcaraz’s match with Australian Open champion Sinner will be favourite for the title in the final against either Alexander Zverev, Casper Ruud or Alex de Minaur.\n‘Let’s see who wins’\nAlcaraz won their only previous match in 2024 in the Indian Wells semis, while they have shared a win each in Grand Slam clashes.\n“We’ve played great matches, high level,” said Alcaraz. “I’m grateful to have him on the tour, at this level because he pushes me to be my best level... to wake up in the morning to try to get better to try to beat him.\n“It’s going to be a really good challenge, I’m ready for that challenge. It’s the match that everybody wants to watch.\n“I’m sure he’ll show his best tennis, I will as well, so let’s see who’s going to win.”", "url": "https://www.straitstimes.com/sport/tennis/alcaraz-steamrolls-tsitsipas-to-book-sinner-semi-final-at-french-open"}