{"authors": [], "date_download": "2024-10-12 13:41:14", "date_modify": "2024-10-12 13:41:14", "date_publish": "2024-05-13 02:12:04", "description": "MANCHESTER, England - Arsenal's Leandro Trossard capitalised on Manchester United's dreadful defending to secure a 1-0 win on Sunday that saw his side provisionally overtake Manchester City atop the Premier League, ensuring the title race will be decided on the final day. Read more at straitstimes.com.", "filename": "sport_football_arsenal-reclaim-provisional-top-spot-with-1-0-win-at-man-united_1728740474.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/13/LYNXMPEK4B08E-1.jpg?VersionId=FH8Gxd9DnyH_tGhkezKkT5vECo4Y3epj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_arsenal-reclaim-provisional-top-spot-with-1-0-win-at-man-united_1728740474.html", "title": "Arsenal reclaim provisional top spot with 1-0 win at Man United", "title_page": "Arsenal reclaim provisional top spot with 1-0 win at Man United | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANCHESTER, England - Arsenal's Leandro Trossard capitalised on Manchester United's dreadful defending to secure a 1-0 win on Sunday that saw his side provisionally overtake Manchester City atop the Premier League, ensuring the title race will be decided on the final day.\nWhile Arsenal, who won for just the second time at Old Trafford in their last 17 visits, have 86 points with one game left of the tightest title race in years, holders City remain in the driving seat with 85 points and two matches to play.\nCity, who are aiming for an unprecedented fourth consecutive English top-flight title, can retake the lead if they beat Arsenal's London rivals Tottenham Hotspur on Tuesday.\n\"I am going to be the biggest fan of Tottenham ever,\" Arsenal's Kai Havertz told Sky Sports. \"Let's hope for the best.\n\"We didn't have our best game but we needed the three points and we have it now so we can be happy. We have to win every single game as City are always keeping the pressure on,\" he added. \"It is so nice to be in the race and every week you have to play at your best. When you do it, it feels even better.\"\nTrossard scored in the 20th minute when Havertz sauntered barely challenged into space on the right before sending the ball into the box for Trossard to tuck home.\nHeads turned to check for an offside flag but Casemiro -- recently moved from midfield into United's injury-depleted back line -- had slowly moved out from the box and kept Havertz onside after goalkeeper Andre Onana launched the ball upfield.\nUnited manager Erik ten Hag was left shaking his head in frustration.\n\"Obviously we only have one objective to win the league,\" Trossard told Sky. \"We have done our job today and it will be up to the last game and that is what we are aiming for.\"\nThe game swung from end to end over a final tense few minutes, with Onana leaping to push away shots from Arsenal substitute Gabriel Martinelli and Declan Rice.\nUnited, who were hoping to bounce back after a woeful 4-0 loss at Crystal Palace on Monday, are eighth with two games left. They trail sixth-placed Newcastle by three points in their quest for a European berth next season, setting up a key showdown when the Magpies visit Old Trafford on Wednesday.\nTen Hag said it would be \"very damaging\" to miss Europe.\n\"That is the situation we are in, but still we can get there,\" he told reporters. \"We have to take the responsibility, we have fight for it, and everyone knows this.\"\nUnited have now conceded 82 goals this season in all competitions -- their most in a single campaign since 1970-71.\nUnited enjoyed plenty of the ball in the final third, and had 14 shots to Arsenal's 11, but struggled to create many quality chances.\nAlejandro Garnacho was United's biggest threat, particularly in the second half. He launched one shot wide and sent another into the side netting before hanging his head in frustration.\nThe visiting fans, whose singing did not let up all evening, erupted at the final whistle. Not even a torrential downpour could dampen their celebrations.\n\"We needed a result today in a really difficult place,\" Arsenal manager Mikel Arteta said. \"Our history was not in favour of a result today, there was so much at stake and we're happy with the result.\"\nArsenal claimed their 18th clean sheet in the league this season, while Sunday's victory was their 27th in the league this season -- a mark topped only in 1970-71 (29 wins) and 1930-31 (28).\nUnited have lost 19 games in all competitions this season, their most since 1978-79 (also 19).\nArsenal host Everton in their season finale, while City are at home to West Ham United. REUTERS", "url": "https://www.straitstimes.com/sport/football/arsenal-reclaim-provisional-top-spot-with-1-0-win-at-man-united"}