{"authors": [], "date_download": "2024-10-12 14:00:58", "date_modify": "2024-10-12 14:00:58", "date_publish": "2024-07-31 18:44:21", "description": "PARIS - Two-time world champion Akane Yamaguchi of Japan came close to being defeated in the final round of group play by world number 31 Michelle Li of Canada in a day of close shaves in the women's singles at the Paris Games on Wednesday. Read more at straitstimes.com.", "filename": "sport_badminton-yamaguchi-and-kim-survive-close-calls-in-final-group-games_1728741658.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/31/LYNXMPEK6U0H9-1.jpg?VersionId=.XJm_khpaFUEihWQ64tEjzPDie5syPrw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_badminton-yamaguchi-and-kim-survive-close-calls-in-final-group-games_1728741658.html", "title": "Badminton-Yamaguchi and Kim survive close calls in final group games", "title_page": "Badminton-Yamaguchi and Kim survive close calls in final group games | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Two-time world champion Akane Yamaguchi of Japan came close to being defeated in the final round of group play by world number 31 Michelle Li of Canada in a day of close shaves in the women's singles at the Paris Games on Wednesday.\nYamaguchi, ranked fifth, won a game that ended 22-24 21-17 21-12 through sheer stamina as Li tired in the third game, losing four points towards the end in quick succession.\nThe 27-year-old Yamaguchi, who suffered a hip injury in March, said she had felt no pain on Wednesday but that her long lay-off meant she was not 100% confident.\n\"I was quite behind until the second half of the second game,\" she said.\nWorld number 17 Kim Ga-eun of South Korea also looked to be in trouble against Malaysia's Goh Jin Wei, who ranks 15 places below her, until she rallied at the very end of the third game.\nKim skidded across the floor of the court on her knees to reach some shots and pull of a 21-17 20-22 23-21 win.\nIn men's singles, world number 22 Lakshya Sen of India produced some skilful returns to defeat Indonesia's Jonatan Christie, who ranks fourth, 21-18 21-12.\n\"Really tough match today,\" Sen said, adding that he was excited for the round of 16 now.\n\"I'm really pumped up to fight every match,\" he said. REUTERS", "url": "https://www.straitstimes.com/sport/badminton-yamaguchi-and-kim-survive-close-calls-in-final-group-games"}