{"authors": [], "date_download": "2024-10-12 14:10:19", "date_modify": "2024-10-12 14:10:19", "date_publish": "2024-07-19 13:31:54", "description": "ESPN reported he is expected to agree on a contract buyout with the Jazz and then sign a free agent deal with the Nuggets. Read more at straitstimes.com.", "filename": "sport_basketball_la-clippers-trade-russell-westbrook-to-utah-jazz_1728742219.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/19/2024-04-28T170626Z1852754426MT1USATODAY23137981RTRMADP3NBA-PLAYOFFS-LOS-ANGELES-CLIPPERS-AT-DALLAS-MAVERICKS.JPG?VersionId=ar5XuE..egHW1LbbSaGgHpcBsJ4HuAA8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_la-clippers-trade-russell-westbrook-to-utah-jazz_1728742219.html", "title": "LA Clippers trade Russell Westbrook to Utah Jazz", "title_page": "LA Clippers trade Russell Westbrook to Utah Jazz | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LOS ANGELES – The Los Angeles Clippers traded Russell Westbrook to the Utah Jazz on July 18, with the veteran guard reportedly in line to join the Denver Nuggets once released.\nThe Clippers acquired guard Kris Dunn in a sign-and-trade deal while offloading Westbrook, sending Utah the draft rights to centre Balsa Koprivica and adding cash considerations.\nLos Angeles also gave the Jazz the right to a second-round draft pick swop in 2030.\n“Russ is an all-time great and we were fortunate to have him here,” Clippers president of basketball operations Lawrence Frank said in a statement.\n“He lifted the energy and intensity of the group. We look forward to seeing him continue his decorated career.”\nESPN reported that Westbrook is expected to agree on a contract buyout with the Jazz and then sign a free agent deal with the Nuggets upon clearing waivers.\nThe 35-year-old was in line to make US$4.03 million (S$5.42 million) next season in the second year of a two-year deal with the Clippers.\nWestbrook joined the Clippers late in the 2022-23 season after he was traded from the Los Angeles Lakers to the Jazz and then waived. He returned to a starting role during a short 21-game stint with the Clippers, then transitioned to a bench role last season and finished seventh in the Sixth Man of the Year voting.\nHe averaged 11.1 points with 5.0 rebounds and 4.5 assists for the team last season in 68 games (11 starts).\nIn 16 NBA seasons, the nine-time All-Star and 2016-17 league Most Valuable Player has averaged 21.7 points with 7.1 rebounds and 8.1 assists in 1,162 games (1,039 starts) for the Oklahoma City Thunder (2008-19), Houston Rockets (2019-20), Washington Wizards (2020-21), Lakers (2021-23) and Clippers.\nDunn, 30, averaged 5.4 points with 2.9 rebounds and 3.8 assists in 66 games (32 starts) for the Jazz last season.\nIn eight NBA seasons with five different teams, he has averaged 7.9 points with 3.3 rebounds and 4.2 assists in 333 games (164 starts).\nKoprivica, a 2.16m centre from Serbia, was the 57th overall pick by the Charlotte Hornets and traded to the Detroit Pistons in 2021.\nHis draft rights were dealt to the Clippers in 2023 while he played professionally in Europe with Serbian club KK Partizan. REUTERS", "url": "https://www.straitstimes.com/sport/basketball/la-clippers-trade-russell-westbrook-to-utah-jazz"}