{"authors": [], "date_download": "2024-10-12 13:52:42", "date_modify": "2024-10-12 13:52:42", "date_publish": "2024-01-14 02:47:24", "description": "China were largely outplayed by debutants Tajikistan, the 106th-ranked team in the world. Read more at straitstimes.com.", "filename": "sport_football_china-stress-in-asian-cup-draw-but-no-tears-over-var_1728741162.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/14/FBL-ASIA-2023-MATCH03-CHN-TJK-162842.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_china-stress-in-asian-cup-draw-but-no-tears-over-var_1728741162.html", "title": "China 'stress' in Asian Cup draw, but no tears over VAR", "title_page": "China 'stress' in Asian Cup draw, but no tears over VAR | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA - China coach Aleksandar Jankovic said his players were feeling “stress” after they opened their Asian Cup campaign with a 0-0 draw against debutants Tajikistan on Jan 13.\nThe stalemate in Doha heaped more embarrassment on a country rocked by a football graft scandal at home, but they might have snatched an undeserved win late on.\nFinalists in 2004, China were largely outplayed by the 106th-ranked team in the world but were left fuming after a late header from Zhu Chenjie was ruled out following a VAR intervention.\nBoos from the China fans rang out briefly at the end.\nJankovic refused to blame the officials – “you don’t solve problems with tears and crying” – but admitted his players were feeling the pressure.\n“Managing the stress of a big competition is not a new topic in general,” said the Serbian.\n“Many teams have the same problem and we have been talking a lot about this. Still, we had some difficulties in the first half.”\nThe game took place five days after former China coach Li Tie appeared on national television to confess he paid bribes to get the job and was involved in match-fixing.\nThe former Everton midfielder’s confession was part of a crackdown on football corruption that has triggered the downfall of at least 10 senior Chinese Football Association officials.\nChina’s squad in Qatar were required to watch the television programme, Chinese state media said.\nJankovic said he would “make some adjustments” before his team face Lebanon in their second game.\n“We restart the engine tomorrow morning,” he said.\n“There is no eliminated team and no qualified team after one game.”\nDebut point\nChina, ranked 79 in the world, thought they had snatched victory when Zhu rose to thump a header past goalkeeper Rustam Yatimov from a corner with less than 10 minutes remaining.\nBut the goal was chalked off by VAR for offside with China’s former England youth defender Tyias Browning standing on the goal-line.", "url": "https://www.straitstimes.com/sport/football/china-stress-in-asian-cup-draw-but-no-tears-over-var"}