{"authors": [], "date_download": "2024-10-12 14:02:18", "date_modify": "2024-10-12 14:02:18", "date_publish": "2024-06-11 18:20:31", "description": "The clock is ticking, with six weeks to turn the Grand Slam site into a stage worthy of the world’s biggest sporting extravaganza. Read more at straitstimes.com.", "filename": "sport_tennis_roland-garros-in-race-to-finish-paris-2024-makeover_1728741738.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/11/LYNXMPEK5A0E1-1.jpg?VersionId=1_EQZEVBsaot6EZvp066I0ho6LVShs9V", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_roland-garros-in-race-to-finish-paris-2024-makeover_1728741738.html", "title": "Roland Garros in race to finish Paris 2024 makeover", "title_page": "Roland Garros in race to finish Paris 2024 makeover | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – As the sun set on tennis’ French Open last weekend, a new race got under way to transform the iconic red clay courts into dazzling Olympic venues in a matter of weeks.\nChosen back in 2016 to be one of the sites for the Paris 2024 Olympics, Roland Garros now faces the task of complying with the meticulous standards set by the International Olympic Committee and Paris 2024 organisers.\nThe clock is ticking, with six weeks to turn the Grand Slam arena into a stage that is worthy of the world’s biggest sporting extravaganza.\nThe transition will require a “clean venue”, where all distinctive Roland Garros marks are hidden and replaced by the Olympic rings and the host city’s logo.\nChristophe Fagniez, deputy director-general of the French Tennis Federation overseeing the Olympic project, describes the transformation as a blend of “camouflage and exhibition”.\nBy July 20, when athletes start training, the arena will be awash in the vibrant colours of the Olympic Games.\nFirst, the tournament team must dismantle food stands, entertainment corners and anything branded with Roland Garros that can be removed.\nThe Olympic makeover will ramp up until mid-July. After that, a comprehensive security check will pave the way for the arrival of the athletes.\nWhile the six-week timeline is more generous than the three weeks allotted for the transformation of Wimbledon for the London 2012 Games, the challenge remains immense.\n“We have very, very little time to do it,” Fagniez said.\n“Roland Garros spans 12 hectares with 12 courts.\n“Other venues might have a single field of play, maybe two or three, but we have 12.”\nInside the courts, over 250 items need replacing, from the umpires’ chairs to the LED advertisements, which will be swopped for tarpaulins sporting the Olympic look.\nDespite the extensive makeover, some familiar elements will remain.\nThe statue of 14-time champion Rafael Nadal will stay, a comforting sight for fans, although the Spaniard’s participation at the Games is uncertain after his early French Open exit.\nAnd even as the Court Philippe-Chatrier adopts its Olympic colours, its distinctive wall bearing the name of Roland Garros will remain visible.\nThe iconic “RG” logo will also stay on the thousands of seats across the courts.\n“It’s a stadium with great historical and sporting power, so we couldn’t erase everything,” Fagniez explained.\nAfter the tennis tournament, the Court Philippe-Chatrier will undergo yet another transformation to host the Olympic boxing finals over five evenings, marking the end of an extraordinary summer for this storied venue. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/roland-garros-in-race-to-finish-paris-2024-makeover"}