{"authors": [], "date_download": "2024-10-12 13:43:13", "date_modify": "2024-10-12 13:43:13", "date_publish": "2023-12-27 23:31:40", "description": "Liverpool defeated Burnley 2-0 on Dec 26 to move ahead on 42 points, two more than the Gunners. Read more at straitstimes.com.", "filename": "sport_football_arsenal-boss-mikel-arteta-open-to-signings-in-tricky-january-transfer-window_1728740593.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/27/11034500.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_arsenal-boss-mikel-arteta-open-to-signings-in-tricky-january-transfer-window_1728740593.html", "title": "Arsenal boss Mikel Arteta open to signings in ‘tricky’ January transfer window", "title_page": "Arsenal boss Mikel Arteta open to signings in ‘tricky’ January transfer window | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – There are only a few days left until the January transfer window opens and English Premier League managers are starting to plot the ways in which they can improve their squads for the second half of the season.\nArsenal manager Mikel Arteta, for one, has one eye on targets as he prepares for his team’s home game with fellow London side West Ham United on Dec 28.\nThe Gunners drew 1-1 with Liverpool in a top-of-the-table clash before Christmas on Dec 23, and will be seeking to return to winning ways and get their title charge back on track.\nJust when they were about to end their 11-year streak without a league win at Anfield via Gabriel Magalhaes’ fourth-minute goal, the Reds fought back with a Mohamed Salah finish just 25 minutes later.\nThat draw meant Arsenal remained top of the standings, but Liverpool then defeated Burnley 2-0 on Dec 26 to move ahead on 42 points, two more than the Gunners.\nWith such a tight race at the top, Arteta believes the transfer window is an opportunity to bolster his squad.\n“If there is something that can improve the team, we’re always going to be open to do that,” he said, without revealing any targets or positions he would like strengthening.\n“We have certain targets and ideas. But we don’t know how the squad is going to look in two weeks’ time. It’s a very tricky market that shifts quite quickly.\n“At the moment, it’s very difficult. We are really short. There are positions where we’ve been exposed in the last few weeks. Hopefully, we’ll get players back.\n“We’re just focusing on the importance of tomorrow, Fulham (Dec 31) and the FA Cup (Jan 7, also against Liverpool). Then we’ll have a break to assess and see.”\nTransfers aside, getting a win against West Ham is key for now.\nArteta can take comfort in the fact that his men are fairly confident when playing at the Emirates, even though they have won just once in their last four away games in all competitions.\nThe Gunners beat Brighton & Hove Albion earlier in December for their fifth consecutive Premier League win in front of their home fans and it has been more than two years since they last lost a home London derby in the league.\nArsenal have won eight and drew four such fixtures since Chelsea beat them by two goals in August 2021.\nArteta will be missing Kai Havertz, as the forward is suspended after picking up his fifth booking of the season. The injured Jurrien Timber, Fabio Vieira, Thomas Partey and Takehiro Tomiyasu remain out.\nAs for West Ham, their only major absentee is Michail Antonio, who is still sidelined with a knee issue.\nThe Hammers are heading into the clash in good spirits after a convincing 2-0 win over Manchester United.\nThat marked the fifth league win in seven games for David Moyes’ in-form side, although the manager would also have noted that their solitary defeat in that run was in an away London derby – they lost 5-0 to Fulham.\nWest Ham, though, have already beaten Arsenal this season, when they clinched a 3-1 victory in a League Cup fourth-round clash at the London Stadium.\nIn the Premier League, the Gunners won 3-1 in this exact same fixture on Boxing Day 2022.\n“Arsenal will be a huge challenge. They have always been a really hard team to beat,” said Moyes.\n“We had a good result at home against them in the Cup – but this is a different competition.”\nFormer Chelsea and Blackburn Rovers striker Chris Sutton believes that Arsenal will easily win this fixture 3-0, saying on the BBC: “This is a tricky one for Arsenal. West Ham are in good form... and always awkward to break down.\n“Hammers boss David Moyes is so underrated and also seemingly unappreciated by some fans, no matter how well his side do.\n“Still, I am going with Arsenal here.\n“They are at home, where they have won their past seven matches in all competitions, and although West Ham will work hard, they won’t keep them out.”", "url": "https://www.straitstimes.com/sport/football/arsenal-boss-mikel-arteta-open-to-signings-in-tricky-january-transfer-window"}