{"authors": [], "date_download": "2024-10-12 14:14:20", "date_modify": "2024-10-12 14:14:20", "date_publish": "2024-05-31 19:45:13", "description": "LONDON - Long-standing operations director Rob White has left Alpine, the under-performing Renault-owned Formula One team confirmed on Friday. Read more at straitstimes.com.", "filename": "sport_formula-one_operations-director-rob-white-leaves-struggling-alpine-f1-team_1728742460.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/31/LYNXMPEK4U0HM-1.jpg?VersionId=5Bt5rZdXeyNcAaDq4HYiii8bHY7XThHi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_operations-director-rob-white-leaves-struggling-alpine-f1-team_1728742460.html", "title": "Operations director Rob White leaves struggling Alpine F1 team", "title_page": "Operations director Rob White leaves struggling Alpine F1 team | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Long-standing operations director Rob White has left Alpine, the under-performing Renault-owned Formula One team confirmed on Friday.\nWhite had been in the role since 2016 after joining Renault two decades ago when they were chasing titles with Spaniard Fernando Alonso.\nThe BBC reported the Briton had been sacked by team principal Bruno Famin with staff at the Enstone factory told on Wednesday.\n\"As part of the team's wider operational restructure, we can confirm the departure of Rob White,\" a team spokesperson said.\n\"The team is thankful for Rob's efforts during his long career both at Enstone and at Viry-Chatillon, where he led the championship-winning engine project in 2005 and 2006. We wish him the best in his future endeavours.\"\nAlpine have scored just two points in eight races this season and are ninth of 10 in the standings after finishing sixth in 2023 and fourth in 2022.\nTheir last race in Monaco saw French drivers Esteban Ocon and Pierre Gasly collide on the opening lap, although Gasly went on to score a point. Both drivers are out of contract at the end of the season.\nAlpine recently hired David Sanchez, who started out at Renault and then moved to Ferrari and McLaren, as executive technical director and have pointed to new arrivals in the pipeline.\nA string of familiar names have meanwhile departed and joined rivals.\nPrincipal Otmar Szafnauer remains on gardening leave after leaving in the middle of 2023, with sporting director Alan Permane and Chief Technical Officer Pat Fry departing at the same time.\nPermane is now sporting director for Red Bull-owned RB and Fry is chief technical officer at Williams.\nFormer racing director Davide Brivio departed at the end of December and returned to MotoGP while technical director Matt Harman and aerodynamics head Dirk de Beer went in March.\nFormer Renault technical director Bob Bell, another team veteran who most recently had an advisory role, also left in March and joined Aston Martin as technical executive director. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/operations-director-rob-white-leaves-struggling-alpine-f1-team"}