{"authors": [], "date_download": "2024-10-12 13:44:48", "date_modify": "2024-10-12 13:44:48", "date_publish": "2022-11-29 08:39:38", "description": "The club's financial statements have received scrutiny from prosecutors and Italian market regulator Consob in recent months. Read more at straitstimes.com.", "filename": "sport_football_football-juventus-chairman-agnelli-resigns-with-entire-board_1728740688.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/11/29/FBL-ITA-SERIEA-VERONA-JUVENTUS-192311_4.jpg?VersionId=7pGW6F3i.IrgeL7ovO9RDZ6qtrrWlHP8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_football-juventus-chairman-agnelli-resigns-with-entire-board_1728740688.html", "title": "Football: Juventus chairman Agnelli resigns with entire board", "title_page": "Football: Juventus chairman Agnelli resigns with entire board | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MILAN – The board of Juventus, chaired by Andrea Agnelli, has resigned “in the best interest of the company,” the Italian Serie A team said on Monday.\nThe collective resignation comes after Juventus’ financial statements received scrutiny from prosecutors and Italian market regulator Consob in recent months for alleged false accounting and market manipulation.\nThe company had denied any wrongdoing.\nThe review of so-called salary manoeuvres led to a revision of estimates of accrual charges as of end of June 2020, June 2021 and June 2022, the team said in a statement. The team added it had amended its balance sheets, to be approved by shareholders on Dec 27.\nJuventus said their directors had discussed the issue at a meeting on Monday and concluded it would be best addressed by a new board, given “the relevance of the pending legal and technical/accounting matters.”\nThey added they would have to restate their financial statements for the fiscal year ending in June 2022.\nThe company, which is controlled by the Agnelli family’s holding company Exor, said it had asked chief executive officer Maurizio Arrivabene to maintain his position and had appointed Maurizio Scanavino as general manager.\nThe Agnelli family, which founded automaker Fiat SpA nearly 125 years ago, manages most of its properties through holding company Exor NV.\nIt also controls Ferrari, CNH Industrial and media publisher The Economist Group, and is the largest single investor in Stellantis.\nThe Agnelli family has owned Juventus, widely known as Juve, since 1923, and Exor is led by John Elkann.\nJuventus said they had called a shareholder meeting on Jan 18 to appoint a new board.\nAgnelli, who has chaired Juventus since 2010, will not seek a reappointment, a source with knowledge of the matter told Reuters.\nIn a letter to Juventus staff seen by Reuters, Agnelli described the company situation as “delicate.”\n“When the team is not cohesive it becomes vulnerable and that can be fatal,” he wrote.\n“This is when you need to keep calm and contain damages: the company is going through a delicate phase and we’re no longer cohesive. Better to quit all together, giving the chance to a new team to turn the game around.”", "url": "https://www.straitstimes.com/sport/football/football-juventus-chairman-agnelli-resigns-with-entire-board"}