{"authors": [], "date_download": "2024-10-12 14:14:18", "date_modify": "2024-10-12 14:14:18", "date_publish": "2024-08-05 20:50:50", "description": "PARIS - Puerto Rico's only diver to qualify for the Paris Olympics, Maycey Vieta, was in tears after she failed to make the semi-final of the women's 10-metre platform event on Monday when the armstand start of one of her dives went wrong. Read more at straitstimes.com.", "filename": "sport_diving-puerto-ricos-first-time-olympian-diver-in-tears-as-armstand-goes-awry_1728742458.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/05/LYNXMPEK740IO-1.jpg?VersionId=Xswd.6sxg2G7NboWP9NOY5mEQFva2bjG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_diving-puerto-ricos-first-time-olympian-diver-in-tears-as-armstand-goes-awry_1728742458.html", "title": "Diving-Puerto Rico's first-time Olympian diver in tears as armstand goes awry", "title_page": "Diving-Puerto Rico's first-time Olympian diver in tears as armstand goes awry | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Puerto Rico's only diver to qualify for the Paris Olympics, Maycey Vieta, was in tears after she failed to make the semi-final of the women's 10-metre platform event on Monday when the armstand start of one of her dives went wrong.\nShe had qualified for Paris when she achieved 15th place in the Doha world Championships in February, becoming Puerto Rico's first female diver to compete in the Olympics in 20 years.\nBut in her second dive, Vieta tried and failed to execute an armstand to kick off her routine that also involved back double somersault and one-and-a-half twists.\nSpectators gave her warm applause as the 23-year-old collected herself to re-establish her balance and complete her dive.\n\"Obviously it's not where I thought I'd be at the end of this. It's hard walking away,\" a teary Vieta told Reuters after the preliminary round.\nHer second dive landed 38.40 points, her lowest in all five dives. She ranked 24 of the 29 athletes in the event, missing the semi-final by six places.\n\"You definitely second guess, you know, why you're here, like whether you deserved it. It feels a little embarrassing, but I know my coach and my teammates, and you know my family, they all love and support me no matter what. So yeah, it's hard,\" she said.\nShe is part of the diving team of Purdue University in the U.S. coached by David Boudia, who in his career won four Olympic medals including a gold in the men's 10-metre platform in the London Games in 2012. REUTERS", "url": "https://www.straitstimes.com/sport/diving-puerto-ricos-first-time-olympian-diver-in-tears-as-armstand-goes-awry"}