{"authors": [], "date_download": "2024-10-12 13:44:15", "date_modify": "2024-10-12 13:44:15", "date_publish": "2024-05-30 20:14:48", "description": "May 30 - Blue and pink lights lit the stage as the curtain rose at the Champs de Mars puppet theatre in Paris, with audience members welcomed to the show by a Guignol marionette against a background of cheerful carnival music. Read more at straitstimes.com.", "filename": "sport_curtain-falls-on-paris-puppet-theatre-to-make-way-for-olympics_1728740655.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/30/LYNXMPEK4T0IW-1.jpg?VersionId=R8tTmOWmMRcLD4X4dOalxaQkr5RU.cRm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_curtain-falls-on-paris-puppet-theatre-to-make-way-for-olympics_1728740655.html", "title": "Curtain falls on Paris puppet theatre to make way for Olympics", "title_page": "Curtain falls on Paris puppet theatre to make way for Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "May 30 - Blue and pink lights lit the stage as the curtain rose at the Champs de Mars puppet theatre in Paris, with audience members welcomed to the show by a Guignol marionette against a background of cheerful carnival music.\nThe puppet theatre, a fixture of the park since 1902, performed one of its final shows on Wednesday before it must close for the Olympic Games.\n\"This is my life,\" the theatre's director Julien Sommer told Reuters. \"Finding out from one day to the next that months later, we'd have to pack our bags, goodbye to 25 years of life - well, 35 years, since I started coming here when I was little - erased in two months for three weeks of sports, that's really unbelievable.\"\nClose to the Eiffel Tower, the theatre offers a classic repertoire of fairy tales such as Cinderella and Sleeping Beauty, as well as new creations, with a \"troupe\" of 400 puppets.\nIn January, Sommer said he had been informed by the city government that it was terminating its contract with the theatre, which will be closed from June for Olympic preparations.\nA petition to keep the venue open drew more than 13,000 signatures in one month.\nThe Paris city council finally reversed its decision to terminate the contract, opting to suspend activity until at least October. No reopening date has yet been set.\nSommer says the city could have thought of ways to integrate the theatre into the Olympics.\n\"It's a shame to deprive tourists of Parisian life, of everything that's part of the charm of Paris, and to make something neutral, ephemeral, something without a soul,\" he said.\nOn Wednesday, the puppets gave a joyful performance of the popular fairytale Little Red Riding Hood.\nSome spectators were saddened by the decline of puppet shows, once a popular spectacle in Paris.\n\"I think there are only three Guignol puppet shows left in Paris,\" said Elvire Dauberville, who came to see Wednesday's show with her two grandchildren.\nBackstage, Sommer tidied up his theatre. Touching his Little Red Riding Hood marionette, he bade the puppets goodbye.\n\"We'll come back,\" he said. \"They're tough. Don't worry, we'll be fine.\" REUTERS", "url": "https://www.straitstimes.com/sport/curtain-falls-on-paris-puppet-theatre-to-make-way-for-olympics"}