{"authors": [], "date_download": "2024-10-12 14:13:44", "date_modify": "2024-10-12 14:13:44", "date_publish": "2023-04-14 16:55:45", "description": "MANCHESTER - Assistant referee Constantine Hatzidakis will not face further disciplinary action for allegedly elbowing Liverpool’s Andy Robertson in the face, the Football Association said on Thursday. Read more at straitstimes.com.", "filename": "sport_football_no-further-disciplinary-action-for-epl-official-after-andy-robertson-incident_1728742424.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/04/14/2023-04-09T164338Z528387421UP1EJ491AGO9TRTRMADP3SOCCER-ENGLAND-LIV-ARS-REPORT.JPG?VersionId=FdkDtJMZLI1NB_7VvGUTrakdtXBNmV8U", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_no-further-disciplinary-action-for-epl-official-after-andy-robertson-incident_1728742424.html", "title": "No further disciplinary action for EPL official after Andy Robertson incident", "title_page": "No further disciplinary action for EPL official after Andy Robertson incident | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MANCHESTER - Assistant referee Constantine Hatzidakis will not face further disciplinary action for allegedly elbowing Liverpool’s Andy Robertson in the face, the Football Association said on Thursday.\nHatzidakis stood down while the incident, which occurred at half-time during Liverpool’s draw with Arsenal in the Premier League on Sunday, was being investigated.\nThe official made contact with Robertson’s chin when the player approached him at Anfield.\n“I look forward to returning to officiating matches,” Hatzidakis said in a statement released by the Professional Game Match Officials Ltd (PGMOL).\n“I fully assisted the FA with their investigation and have discussed the matter directly with Andy Robertson during an open and positive conversation.\n“It was certainly not my intention to make any contact with Andy as I pulled my arm away from him and for that I have apologised.”\nThe FA said it had reviewed all the evidence, including detailed statements from Liverpool and PGMOL, as well as video footage from multiple angles before reaching its decision. REUTERS", "url": "https://www.straitstimes.com/sport/football/no-further-disciplinary-action-for-epl-official-after-andy-robertson-incident"}