{"authors": [], "date_download": "2024-10-12 14:03:29", "date_modify": "2024-10-12 14:03:29", "date_publish": "2024-05-16 22:53:21", "description": "Jarry joins countryman Alejandro Tabilo in the semi-finals. Read more at straitstimes.com.", "filename": "sport_tennis_paul-overcomes-hurkacz-to-reach-italian-open-semis_1728741809.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/17/2024-05-16T195822Z40866302UP1EK5G1JH8LYRTRMADP3TENNIS-ROME.JPG?VersionId=Ns9g19VMmOGEMwDWrrPzp0w_IV178eSO", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_paul-overcomes-hurkacz-to-reach-italian-open-semis_1728741809.html", "title": "Nicolas Jarry stuns Stefanos Tsitsipas to reach Italian Open semi-finals", "title_page": "Nicolas Jarry stuns Stefanos Tsitsipas to reach Italian Open semi-finals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ROME - Chile’s Nicolas Jarry powered past 2022 runner-up Stefanos Tsitsipas in three sets to reach his first Masters semi-final in Rome on May 16.\nThe 28-year-old fought back to defeat the sixth-seeded Greek 3-6, 7-5, 6-4 as the world number 24 set up a last-four showdown with Tommy Paul of the United States.\n“I think beating Stefanos on clay is a good achievement. Certainly happy with my fight today, for how I played and how I maintained myself,” said Jarry, who crunched 23 forehand winners including one timed at 166kmh.\nJarry saved 11 of the 13 break points he faced before converting a fourth match point to improve his head-to-record to 4-2 over Tsitsipas who won the Monte Carlo Masters earlier in the European clay-court season.\nJarry joins countryman Alejandro Tabilo in the semi-finals.\nThey are the first Chilean duo to reach the semi-finals of an ATP Tour event since 2006 in Vina del Mar, where Fernando Gonzalez and Nicolas Massu made the last four\nHis victory on May 16 was his third over a top 10 player in 2024, after defeating Carlos Alcaraz in Buenos Aires and Casper Ruud in Miami.\nTabilo, who knocked out Novak Djokovic last weekend, will face former champion and third seed Alexander Zverev in the other semi-final on May 17. AFP", "url": "https://www.straitstimes.com/sport/tennis/paul-overcomes-hurkacz-to-reach-italian-open-semis"}