{"authors": [], "date_download": "2024-10-12 13:41:17", "date_modify": "2024-10-12 13:41:17", "date_publish": "2024-06-01 16:30:27", "description": "Everton's takeover agreement with prospective owner 777 Partners has expired, the Premier League club said on Saturday, after the U.S. private equity firm failed to complete the acquisition of Farhad Moshiri's majority stake by the Friday deadline. Read more at straitstimes.com.", "filename": "sport_football_everton-takeover-by-us-private-equity-firm-falls-through_1728740477.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/01/LYNXMPEK500ZS-3.jpg?VersionId=IHY.uhcnN.k1p_b_W_HNppKmAay1Y495", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_everton-takeover-by-us-private-equity-firm-falls-through_1728740477.html", "title": "Everton takeover by US private equity firm falls through", "title_page": "Everton takeover by US private equity firm falls through | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Everton's takeover agreement with prospective owner 777 Partners has expired, the Premier League club said on Saturday, after the U.S. private equity firm failed to complete the acquisition of Farhad Moshiri's majority stake by the Friday deadline.\nIn September the Miami-based investment fund said it had signed an agreement with British-Iranian billionaire Moshiri to acquire his 94.1% stake in the club.\nThe deal, initially expected to be closed by the end of 2023, was delayed as 777 Partners reportedly struggled to meet the necessary conditions outlined by the Premier League to complete their purchase.\n\"The agreement between 777 Partners and Blue Heaven Holdings Limited for the sale and purchase of the majority shareholding in the club expired today,\" Everton said in a statement.\n\"The club's Board of Directors recognises the considerable level of financial support 777 Partners has provided the club over recent months and would like to take this opportunity to thank them for this.\"\nMoshiri, a former Arsenal shareholder, first bought a 49.9% stake in Everton in 2016. By January 2022, he had increased his stake to 94.1% with a 100-million-pound ($130-million) capital injection.\nBut despite investing nearly 750 million euros ($810 million) in transfers to build the squad since Moshiri's arrival, Everton have slipped out of the top half of the table to fight relegation battles in recent seasons.\nThe club finished 15th in the Premier League after being hit with two separate points deductions for breaching profit and sustainability rules.\nEverton are now free to talk to other interested investors, with the BBC reporting that Crystal Palace co-owner John Textor, who is looking to sell his majority stake in the London club, would consider Everton as an opportunity.\n\"The club will continue to operate as usual, while it works with Blue Heaven Holdings to assess all options for the club’s future ownership,\" Everton said. REUTERS", "url": "https://www.straitstimes.com/sport/football/everton-takeover-by-us-private-equity-firm-falls-through"}