{"authors": [], "date_download": "2024-10-12 13:43:24", "date_modify": "2024-10-12 13:43:24", "date_publish": "2023-12-27 18:32:10", "description": "Newcastle United have failed to live up to their standards this season, right back Kieran Trippier said, adding that his own performances had declined as his eighth-placed side suffered a fourth defeat in their last five Premier League matches. Read more at straitstimes.com.", "filename": "sport_football_newcastles-standards-have-dropped-says-off-form-trippier_1728740604.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/27/LYNXMPEJBQ06H-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_newcastles-standards-have-dropped-says-off-form-trippier_1728740604.html", "title": "Newcastle's standards have dropped says off form Trippier", "title_page": "Newcastle's standards have dropped says off form Trippier | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Newcastle United have failed to live up to their standards this season, right back Kieran Trippier said, adding that his own performances had declined as his eighth-placed side suffered a fourth defeat in their last five Premier League matches.\nHaving already exited the Champions League and League Cup, Newcastle were handed a 3-1 defeat at by a struggling Nottingham Forest side, who are 16th, at St James' Park on Tuesday.\nWhile many or their problems can be attributed to a punishing fixture schedule and lengthy injury list on their return to Europe's elite club competition after two decades, Trippier said he \"won't shy away\" from his diplays of late.\nLast week, Newcastle manager Eddie Howe stood by the 33-year-old England international after his costly errors during their League Cup quarter-final defeat at Chelsea.\n\"The standards we have set throughout the last 18 months, we have come away from them a little bit in the last few games,\" Trippier told Amazon Prime. \"My standards have dropped, and my own performances have been nowhere near recently.\n\"I have had a lot of setbacks in my career and this is just another one where I need to keep going and keep believing. I have always got that belief to bounce back.\"\nTrippier said he was confident Newcastle will get things right again.\n\"It is a lot of games and being in Europe has been a challenge for the club. The majority of the players are not used to playing in the Champions League and it's been a challenge for the team,\" he said.\n\"We've had a lot of injuries; the lads have given everything and worked hard for each other but we have to start the second half of the season strong.\n\"Teams always go through moments and we are going through one now but football changes quickly and for sure this team will bounce back.\"\nNewcastle next visit league leaders Liverpool on Monday. REUTERS", "url": "https://www.straitstimes.com/sport/football/newcastles-standards-have-dropped-says-off-form-trippier"}