{"authors": ["Deepanraj Ganesan"], "date_download": "2024-10-12 14:17:05", "date_modify": "2024-10-12 14:17:05", "date_publish": "2023-09-14 22:08:39", "description": "He also calls Mercedes team boss Toto Wolff's 'irrelevant' comment on his 10-win record probably 'a bit of a sore feeling'. Read more at straitstimes.com.", "filename": "sport_formula-one_greatest-driver-talk-bores-max-verstappen-who-wants-only-race-wins_1728742625.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/brightcove-thumbnails/9irtqmxyYzkaAfmuxnkcuiox7UWdAtMLgovKwXfX__s.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_greatest-driver-talk-bores-max-verstappen-who-wants-only-race-wins_1728742625.html", "title": "‘Greatest driver’ talk bores Max Verstappen, who wants only race wins ahead of S’pore GP", "title_page": "‘Greatest driver’ talk bores Max Verstappen, who wants only race wins ahead of S’pore GP | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Max Verstappen will turn only 26 at the end of September, but the Red Bull driver’s record on a Formula One track reads like a seasoned veteran’s – most wins in an F1 season, highest number of points in a campaign, most podiums in a season. The list, quite frankly, goes on.\nThe two-time world champion is on track for his third consecutive title, as he sits comfortably atop the drivers’ standings with a 145-point lead, buoyed by an unprecedented 10-race winning streak.\nBut suggest to Verstappen that he is one of the greatest drivers in the sport’s history and he remains unmoved, much like what his rivals have learnt while trying to dislodge him from the top of the podium.\nGreatness and talk of legacy are not what keeps this Dutchman flying.\n“I’m not really focused on these kinds of things (being the greatest),” said Verstappen on the sidelines of a Tag Heuer event on Thursday at Ion Orchard, where he and teammate Sergio Perez were special guests at the launch of the watchmaker’s latest Monaco Chronograph Night Driver timepiece.\n“I never really said to myself as a little kid that I need to be a legend of the sport or that I need to be in the ranking... because rankings are very irrelevant at the end of the day. Generations are very different, cars are very different, so to compare it as just statistics, I think it’s very difficult.”\nVerstappen’s experience, which belies his age, also showed in his demeanour and responses during the interview. Even before a question was fully posed, it seemed as if he had already formulated his answer.\nThere were no pauses or fillers, except for one instance where he pondered the most politically correct response, when asked what he made of Mercedes team principal Toto Wolff’s comments to Sky Sports that Verstappen’s record of 10 consecutive wins was “irrelevant” and that it was simply a number for a Wikipedia statistics page.\nVerstappen said: “At the end of the day... we just focus on our performances, we are very proud of what we are achieving. And for me, this kind of comment is a bit of, probably, a sore feeling... of them not winning. But he’s not part of our team, so from our side, we are not focused on that.”\nWhile Verstappen has amassed a catalogue of records and achievements on the track, there is at least one F1 list that does not feature him yet – the roll of Singapore Grand Prix winners.\nThe Dutchman has never triumphed under the streets lights of Marina Bay, where his best finish was second in 2018. In 2022, he was seventh.\nThe Marina Bay circuit is one of seven tracks Verstappen has yet to conquer, along with Sochi, Istanbul Park, Mugello, Portimao, Lusail and Nurburgring.\nTo make things harder, the 2023 edition will feature track changes due to redevelopment of The Float @ Marina Bay which has meant the removal of four 90-degree corners towards the end of the lap. The total number of corners has dropped from 23 to 19 with lap times set to be around eight seconds faster.\nVerstappen said: “It’s a street circuit, so it is very warm, very humid. It’s a very long race as well. We’ve had a really competitive car, we know that the street circuit is probably not the best scenario for our car, but it’s still going to be hopefully, a good weekend where hopefully, we can come away with a win.”\nA man familiar with winning the Singapore Grand Prix is Perez, who reigned supreme amid rain and chaos in 2022 and described it as the best race of his life. While Verstappen has a contract that ties him to Red Bull until 2028, Perez’s future is less certain, with his contract expiring in 2024.\nWhen asked how he would decide his future, Perez who is set for his 250th Grand Prix on Sunday, said: “I just want to get through this year, and I think within a couple of races, we will then think next year, or by the end of the year, who or what’s next for me and what the next chapter in my career is going to look like.”\nThe Mexican also hinted that his happy place may lie away from Red Bull. He said: “I want to be in a place where I am happy.... (and allows me to) to deliver my maximum. I cannot do this job at 90 per cent throttle. I either do it at 100 per cent throttle, or it is better that I do something else.”", "url": "https://www.straitstimes.com/sport/formula-one/greatest-driver-talk-bores-max-verstappen-who-wants-only-race-wins"}