{"authors": [], "date_download": "2024-10-12 14:02:02", "date_modify": "2024-10-12 14:02:02", "date_publish": "2024-07-19 13:06:44", "description": "The Czech has had social encounters with Tom Cruise and the British royal family and is pleased with the experiences. Read more at straitstimes.com.", "filename": "sport_tennis_pleasantly-tired-barbora-krejcikova-counts-post-wimbledon-blessings_1728741722.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/19/11473058.jpg?VersionId=x7kh2s615GnqdUALxFI85DWLfwKEpOZa", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_pleasantly-tired-barbora-krejcikova-counts-post-wimbledon-blessings_1728741722.html", "title": "Pleasantly tired Barbora Krejcikova counts post-Wimbledon blessings", "title_page": "Pleasantly tired Barbora Krejcikova counts post-Wimbledon blessings | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PRAGUE – Tired but elated, Wimbledon champion Barbora Krejcikova said on July 18 that the post-tournament duties were an enjoyable experience as she looked back on encounters with Pink, Tom Cruise and the royal family.\nThe 28-year-old Czech beat Italy’s Jasmine Paolini in three sets on July 13 to add a second Grand Slam title to her 2021 French Open trophy.\n“I haven’t held the racket since then,” she told reporters in Prague as she picked up her outfit for the Paris Olympics where she will defend the doubles title with Katerina Siniakova.\nKrejcikova had the obligatory dance with men’s singles winner Carlos Alcaraz at the Wimbledon Champions Dinner on July 14, but that was far from her only social encounter.\n“Tom Cruise asked to meet me, which was fantastic. He asked to meet me!” she exclaimed.\nThe star of Top Gun, Rain Man and Mission: Impossible was in the stands for the women’s singles final.\n“He congratulated me. He said it was great and we talked about sports because we are both passionate athletes,” added Krejcikova, who is now ranked 10th in the world.\nShe also singled out her meeting with Catherine, the Princess of Wales, following the final.\n“Ah yes, the royal family,” the Czech said dreamily before pausing to take a deep breath.\n“That was wonderful. I have really enjoyed the past few days.\n“I had so many new experiences I would never have dreamt of.\n“I find it easy to fall asleep because I’m totally worn out in the evening.\n“There are many duties now and I haven’t slept much, but all the duties are really pleasant.”\nKrejcikova will now start getting ready for the Paris Olympics, starting on July 26.\nShe will team up with Siniakova – with whom she won seven Grand Slam doubles titles before they split late in 2023 – for a WTA tournament in Prague next week to get ready.\nSiniakova, who initiated the split, has since won the 2024 French Open doubles with Coco Gauff of the United States and Wimbledon doubles with another American Taylor Townsend.\n“I’m really looking forward to this. It’s fantastic to be able to play for your country, and it will be a wonderful experience,” Krejcikova said.\nShe added she was still getting on well with Siniakova, although the split took her by surprise last November.\n“We’re good. I don’t think this has ever been personal, even though we split last year and it was Katerina who initiated the break,” she said.\n“At the personal level, it’s still the same. We have always got on well.” AFP", "url": "https://www.straitstimes.com/sport/tennis/pleasantly-tired-barbora-krejcikova-counts-post-wimbledon-blessings"}