{"authors": ["David Lee"], "date_download": "2024-10-12 13:42:59", "date_modify": "2024-10-12 13:42:59", "date_publish": "2024-04-16 19:14:43", "description": "He is the third successive member from the sailing fraternity to lead Team Singapore at the Olympics. Read more at straitstimes.com.", "filename": "sport_former-national-sailor-tan-wearn-haw-to-make-cdm-debut-at-paris-2024_1728740579.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/16/ECAxTWHFSNOC24-003.jpg?VersionId=.EjDVba6KuknLg8NQCsTG1FO_43Bwu79", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_former-national-sailor-tan-wearn-haw-to-make-cdm-debut-at-paris-2024_1728740579.html", "title": "Former national sailor Tan Wearn Haw to make CDM debut at Paris 2024", "title_page": "Former national sailor Tan Wearn Haw to make CDM debut at Paris 2024 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – It will be Tan Wearn Haw’s first chef-de-mission (CDM) assignment when he helms Team Singapore at the July 26-Aug 11 Paris Games, but as an Olympian and former national sailor, the 45-year-old is hardly a greenhorn.\nAt the SEA Games, he won the men’s 470 gold with Chung Pei Ming in 2001, as well as silvers in the boys’ optimist (1991) and fireball open (1997) and a bronze in the international optimist open (1993). He was named 1993 and 1996 Sportsboy of the Year.\nHe also landed two men’s 470 bronzes at the Asian Games, with Charles Lim in 1998 and with Chung in 2002. In between, he competed in the men’s 470 with Koh Seng Leong at the Sydney 2000 Olympics and finished 28th out of 29 pairs.\nHe will be the third successive member from the sailing fraternity to become an Olympic CDM after Low Teo Ping (Rio 2016) and Ben Tan (Tokyo 2020).\nAfter the Singapore National Olympic Council (SNOC) announced his appointment on April 16, Tan said: “It is an honour to serve in the role of chef de mission, and I am looking forward to supporting Team Singapore in Paris.”\nTrained as an aeronautical engineer in France and the United Kingdom, the Health Promotion Board director of strategic planning and collaborations has worked in various sectors including social, youth, sports, education, non-profit, finance and health.\nTan was just 32 when he started his five-year stint as Singapore Sailing Federation (SSF) chief executive officer in 2010.\nHe also volunteers with various non-profit organisations including Global Esports Federation, Singapore Olympic Foundation-Peter Lim Scholarship Committee, imPAct @Hong Lim Green and the SSF.\nOn his appointment, Tan said: “Paris 2024 will see a return to an Olympic Games without the pandemic restrictions, and exciting new sports, events and formats.\n“We will have Singaporean athletes competing in some of these new events.\n“I am looking forward to our athletes fulfilling their dreams on the Olympic stage, and inspiring fellow Singaporeans through their journeys, stories and performances.”\nOne such athlete who will be a medal contender in a new event is 17-year-old sailor Maximilian Maeder, who is the men’s Formula Kite world champion.\nTan, who was a founding director of the National Youth Sports Institute (NYSI) in 2015, recalled how the SNOC and NYSI supported a 12-year-old Maeder at his first multi-sport Games and how far the young sailor has come since finishing 18th out of 19 at the 2019 World Beach Games in Doha, Qatar.\nHe said: “It’s always great to see our athletes grow and progress, in their sport and in life. His progression is a real inspiration for all of us.\n“Our Paris-bound athletes have earned their place on the Olympic stage. This is their time, their moment. They will give their best, and go further than what they thought possible.”\nCurrently, seven individuals and one swimming relay team from Singapore have qualified for Paris 2024, with more expected to follow in the qualification period up to the end of June.\nOther than Maximilian, those who have made the cut are sprinter Shanti Pereira (women’s 200m), equestrienne Caroline Chew (individual dressage), fencer Amita Berthier (women’s foil), sailor Ryan Lo (men’s Laser), and swimmers Jonathan Tan (men’s 50m freestyle) and Letitia Sim (women’s 100m breaststroke).", "url": "https://www.straitstimes.com/sport/former-national-sailor-tan-wearn-haw-to-make-cdm-debut-at-paris-2024"}