{"authors": [], "date_download": "2024-10-12 13:51:26", "date_modify": "2024-10-12 13:51:26", "date_publish": "2024-08-01 14:01:11", "description": "Word has spread, inspiring reviews and attempts at copycat recipes by TikTok creators. Read more at straitstimes.com.", "filename": "sport_the-hottest-item-at-the-paris-olympics-is-a-chocolate-muffin_1728741086.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/aimuffin010824.jpg?VersionId=y8r4IWkZ5RJC6ZMwSBojWXH0_JVTxBpv", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_the-hottest-item-at-the-paris-olympics-is-a-chocolate-muffin_1728741086.html", "title": "The hottest item at the Paris Olympics is a chocolate muffin", "title_page": "The hottest item at the Paris Olympics is a chocolate muffin | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – The Olympic Village in Paris was built with France’s important food traditions in mind. But the runaway hit among the world’s elite athletes is not a croissant or a baguette, but something more likely to be passed over at an American cafeteria.\nThe chocolate muffin has become the go-to treat for the Olympians in the French capital.\n“They’re very rich, and I like that,” said Henrik Christiansen, a Norwegian swimmer turned unofficial Olympic Muffin Man on TikTok.\n“Some people might find it too powerful, but they’re right up my alley.”\nChristiansen, 27, came across the muffins while making a video to review meals at the Olympic Village.\nThey were the first thing he tried. They were “just so incredibly delicious” that he decided to see if a series of videos highlighting his love for the muffins would take off.\nA chocolate-smudged nose here, a love song there, Christiansen went all in. Things became a little tense when a muffin held him hostage in one video.\nNow, word has spread, inspiring other reviews, attempts at copycat recipes by TikTok creators and even a graphic designer’s take on a gold medal for the treats.\nA three-time Olympian long-distance swimmer, Christiansen said he was always on the prowl for food that would help increase his daily calorie count.\nHe just also happens to have a sweet tooth.\n“There is a lot of misconception regarding athletes and what they eat – of course, some athletes, they do sports where their weight is carefully watched and it’s a lot more important,” he said.\n“But on my most heavy training days, I can get up to almost 7,000 calories a day. It’s tough to have that many calories if you’re only having salad.”\nThat is not to say he is not following a well-rounded diet that includes vegetables, fruits, carbohydrates and proteins with any of the rotating options of pizza, pasta, dumplings or French cuisine being served at the Olympic Village.\nBut he insisted he would never tire of the “incredibly moist” muffins, with their lava centres and chocolate chunks.\nThe chocolate muffins are just some of the more than 2,000 items that are served daily at the Olympic Village boulangerie, which is operated by Sodexo.\nA spokesperson for the French company said the chefs were keeping the ingredients and recipe to themselves, but noted that they were sourcing 80 per cent of the total food supply at the Games from France and 25 per cent from farms within 250km of Paris, “so the muffins are certainly an authentic taste of France”.\nThe boulangerie is also making Olympic-ring baguettes, croissants, pain au chocolat and focaccia.\nLooking for sweets during competitions is nothing new for Christiansen. But it has also helped fuel his more creative side on TikTok.\n“As athletes, we are often portrayed as machines that are just out there – we’re swimming and that’s all we do,” he said, adding that athletes do not often get to show other sides of themselves. Social media has changed that.\n“I feel like I’m getting to showcase my personality and do stuff that I enjoy, like making funny content. I really like making people laugh.”\nIt is not all muffins all the time. He also loves ice cream – you might be able to guess his favourite flavour.\n“Any ice cream is good,” he said. “But chocolate-flavoured ice cream might be my favourite.”\nNYTIMES", "url": "https://www.straitstimes.com/sport/the-hottest-item-at-the-paris-olympics-is-a-chocolate-muffin"}