{"authors": [], "date_download": "2024-10-12 14:09:34", "date_modify": "2024-10-12 14:09:34", "date_publish": "2024-07-29 22:28:51", "description": "The Americans took to the court with all the firepower of Breanna Stewart and A'ja Wilson, who combined to pour in 46 points. Read more at straitstimes.com.", "filename": "sport_basketball_basketball-belgium-upset-by-debutants-germany-nigeria-stun-australia_1728742174.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/30/TOPSHOTS-TOPSHOT-BASKETBALL-OLY-PARIS-2024-USA-JPN-205756.jpg?VersionId=Pkh0V5XnFxxeOsxbUmOcJ2Vz85JmCtmQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_basketball-belgium-upset-by-debutants-germany-nigeria-stun-australia_1728742174.html", "title": "US women’s basketball team on target for eighth gold after beating Japan; France upset Canada", "title_page": "US women’s basketball team on target for eighth gold after beating Japan; France upset Canada | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – The United States women’s basketball team made a strong push for their eighth consecutive Olympic gold medal on July 29, as they romped to a resounding 102-76 victory over Japan at the Pierre Mauroy Stadium.\nIn their Group C opener, the Americans took to the court with all the firepower of Breanna Stewart and A'ja Wilson, who combined to pour in 46 points, and under the leadership of captain Diana Taurasi at her sixth Games.\nTaurasi, 42, said she was happy to be back in Lille, where she often played during her time in the EuroLeague Women, and said that more athletes like herself are reaching a stage of longevity in their careers.\n“The world of sports has changed a lot and we have many opportunities to improve ourselves physically, how to train and more. That’s why we see examples like Rudy (Fernandez) or LeBron (James) and Rafael (Nadal),” she said.\n“It’s happening in all sports and it’s one thing that will continue with the next generation.”\nThe Japanese, however, showed that they can also dance around the court, capitalising on seven three-point baskets in the first half by Rui Machida and Mai Yamamoto. At just 1.62m and 1.65m respectively, they proved they can still be dangerous and daring.\nHosts France pulled off a major upset in Group C, overcoming a first-quarter deficit to beat Canada 75-54.\nThe fifth-ranked Canada withered under a rally by the seventh-ranked hosts, scoring just two points in the second quarter – the fewest points ever scored by any team in a single quarter at the Olympics, men or women.\nFrench centre Marieme Badiane and forward Gabby Williams were the heroines of the evening after leading their team with 13 and 12 points, with the pair receiving a rousing post-match ovation and posing for selfies with the crowd.\nOn a day of surprises, the favoured Belgium got their bid off to a bad start, losing 83-69 to debutantes Germany in Group B as WNBA dynamic duo Nyara and Satou Sabally scored a combined 33 points to help beat the world champions.\nThe 1.93m Satou, who plays for the Dallas Wings, was ecstatic to share the dream win with her younger sister.\n“It feels great, I love playing with her and I’m happy she’s such a great player... We wanted to get that first one and I think we just put a stamp on it,” said the forward.\nDaughters of a Gambian father and German mother, the pair were born in the United States before moving to Berlin, where Satou was scouted by a coach at a playground because of her height.\n“All respect to them, Emma Meesseman, I played with her, and even Julie Vanloo, they’re great players and I always love playing against the best players in the world,” she said of the Belgian power forward and point guard.\n“The fact that we as Germany, as a country, are finally able to beat someone as good as Belgium, speaks so much for us. It means everything.”", "url": "https://www.straitstimes.com/sport/basketball/basketball-belgium-upset-by-debutants-germany-nigeria-stun-australia"}