{"authors": ["Deepanraj Ganesan"], "date_download": "2024-10-12 14:12:49", "date_modify": "2024-10-12 14:12:49", "date_publish": "2024-01-10 21:54:56", "description": "The 10m air rifle women’s team finished second but the shooters missed out on qualifying for the Olympics. Read more at straitstimes.com.", "filename": "sport_singapore-shooters-begin-2024-with-silver-medal-at-asian-championships_1728742369.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/10/aishoot100124.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-shooters-begin-2024-with-silver-medal-at-asian-championships_1728742369.html", "title": "Singapore shooters begin 2024 with silver medal at Asian Championships", "title_page": "Singapore shooters begin 2024 with silver medal at Asian Championships | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singaporean shooter Natanya Tan may not have earned her ticket to the Paris Olympics at the Asian Rifle/Pistol Championships on Jan 10 but, at least, there was a silver lining for the 19-year-old and her teammates.\nThe trio of Martina Veloso, Natanya and Fernel Tan defeated 13 other teams at the Senayan Shooting Range in Jakarta to finish second in the 10m air rifle women’s team event – a repeat of their result at the Asian Shooting Championship in Changwon, South Korea, last October.\nTeam medals are awarded after combining the individual results from the qualifying rounds and Veloso (625.8), Fernel (627.4) and Natanya (628.7) tallied for 1,881.9 points, putting them behind India’s Nancy, Elavenil Valarivan and Mehuli Ghosh (1,897.2)\nIran’s Fatemeh Karamzadeh, Fatemeh Amini Pozveh and Yalda Soleimanijafarabad were third with their score of 1,880.8.\nVeloso, who at 24 is the most senior of the trio, said: “I am proud of us because it goes to show we are consistent and that we are one of the strong contenders among women in Asia. This consistent showing does indicate that we are at a new level among rifle shooters in Asia.”\nNoting that it was a “nice boost” for them, Fernel, 21, said that “it makes us want to work harder to ensure we are able to achieve more in 2024”.\nWhile she was happy with a team silver, Natanya was disappointed to miss out on an Olympic spot. A total of 385 athletes from 26 nations are competing in the Jan 5-18 championship, with 16 quota places on offer for the 2024 Paris Games.\nAfter hitting 628.7 in the qualifying round, Natanya finished 10th out of 62 shooters. With five shooters ineligible for the final – owing to International Shooting Sport Federation rules on the number of athletes each nation can field for individual events – she was able to advance to the next stage.\nBut the teenager finished last out of eight shooters and did not earn a quota spot.\nWith shooters from India, South Korea and China having secured their places, Natanya needed to post a better score than either Vietnam’s Le Thi Mong Tuyen or Iran’s Pozveh, who finished fifth and sixth respectively to claim the two Olympic spots.\nNatanya said: “I am a little disappointed with my performance in the final and I was looking to do better after doing well in the qualification round. What I’ve learnt from it is the need to be able to control my nerves better, which is what I’ll make a priority in the coming few months before the next big competitions.”\nThe Singaporean trio will have another opportunity to secure qualification at the Rifle and Pistol ISSF Olympic Qualification Championships in Rio de Janeiro, Brazil, from April 11 to 19.\nThe qualifying battle for Singapore continues on Jan 11, when Teh Xiu Hong, Teh Xiu Yi and Teo Shun Xie will compete in the 25m pistol women’s event.\nVeloso will return to action on Jan 13 in the 50m rifle 3 positions alongside Olympians Jasmine Ser and Adele Tan.", "url": "https://www.straitstimes.com/sport/singapore-shooters-begin-2024-with-silver-medal-at-asian-championships"}