{"authors": ["Ervin Ang"], "date_download": "2024-10-12 14:11:25", "date_modify": "2024-10-12 14:11:25", "date_publish": "2024-06-05 21:30:20", "description": "The former Boston Celtics players will attend a live screening of the Finals at Funan Mall on June 13. Read more at straitstimes.com.", "filename": "sport_basketball_nba-hall-of-famers-gary-payton-and-ray-allen-in-singapore-for-nba-finals-screening_1728742285.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/05/hzbball050624.jpg?VersionId=MykBsN0hzqys6rrnfdSKnhhxK7BYSclr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_nba-hall-of-famers-gary-payton-and-ray-allen-in-singapore-for-nba-finals-screening_1728742285.html", "title": "NBA Hall of Famers Gary Payton and Ray Allen in Singapore for NBA Finals screening", "title_page": "NBA Hall of Famers Gary Payton and Ray Allen in Singapore for NBA Finals screening | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - Basketball fans are in for a treat on June 13, with National Basketball Association (NBA) champions and former Boston Celtics players Gary Payton and Ray Allen to travel to Singapore for the Finals.\nThe duo will attend a live screening at Funan mall to watch Eastern Conference winners Celtics battle 2011 winners Dallas Mavericks for their first championship title since 2008.\nThe free fan event organised by TND Global Events will begin at 7.30am ahead of Game 3, which is scheduled to start an hour later.\nFans will have opportunities to win NBA-themed prizes and catch sight of the famed Larry O’Brien Championship Trophy.\nWith Celtics stars Jaylen Brown and Jayson Tatum on fire, Boston have dropped only two games enroute to the Finals, beating the Miami Heat (4-1), Cleveland Cavaliers (4-1) and Indiana Pacers (4-0). They are aiming to end their 16-year wait for a championship title after coming close in 2022, when they fell 4-2 to the Golden State Warriors at the last hurdle.\nWestern Conference champions Mavericks, who were the fifth seed, overcame the Los Angeles Clippers (4-2), No. 1 seeds Oklahoma City Thunder (4-2) and No. 2 seeds Minnesota Timberwolves (4-1) to make the showpiece seven-game series.\nPayton said in a statement: “I’m excited to travel to Singapore to support the NBA’s efforts to grow the game and celebrate the excitement of the Finals with fans in Asia. The Finals is the culmination of the NBA season, and I can’t wait to watch the action with the passionate fans in Singapore. See you all there!”\nThe 55-year-old will also attend a Jr NBA clinic on June 11 for 50 students aged 10-12 at Dover Court International School.\nPayton played in the NBA for 17 seasons, winning his only championship ring with the Miami Heat in 2006. He was named Defensive Player of the Year in 1996 with the Seattle SuperSonics and was inducted into the Naismith Basketball Hall of Fame in 2013.\nAllen, a two-time NBA champion enshrined in the Hall of Fame in 2018, added: “The energy and excitement around the NBA Finals is truly unique, and I look forward to sharing that experience alongside fans in Singapore.”\nThe 48-year-old retired as the all-time leader in three-point field goals made (2,973) before Stephen Curry surpassed his record in 2021. He won his first title with the Celtics in 2008 and his second with the Heat in 2013.\nCeltics fan Lulu Chu, 51, cannot wait to meet the two stars. She said: “Being a lockdown defender in a day and age where most people just talk about offence, I feel that Gary would have interesting perspective on the game, plus he’s just such a personality – life-of-the-party type personality – it’d be great to have him in a watch party.\n“Having Gary at an NBA Finals watch party is the equivalent of bringing back firecrackers for Chinese New Year. It’s gonna be lit.”", "url": "https://www.straitstimes.com/sport/basketball/nba-hall-of-famers-gary-payton-and-ray-allen-in-singapore-for-nba-finals-screening"}