{"authors": [], "date_download": "2024-10-12 13:30:31", "date_modify": "2024-10-12 13:30:31", "date_publish": "2024-10-09 18:43:46", "description": "They have met four times already in 2024 in the final stages of tournaments, with Sinner winning three times. Read more at straitstimes.com.", "filename": "sport_tennis_jannik-sinner-to-face-daniil-medvedev-in-shanghai-masters-quarter-finals_1728739831.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/10/09/jannik-sinner1009a.jpg?VersionId=oPdTgqidXyInC2ziuaEAJgjH6jlNBDop", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_jannik-sinner-to-face-daniil-medvedev-in-shanghai-masters-quarter-finals_1728739831.html", "title": "Jannik Sinner to face Daniil Medvedev in Shanghai Masters quarter-finals", "title_page": "Jannik Sinner to face Daniil Medvedev in Shanghai Masters quarter-finals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SHANGHAI – World No. 1 Jannik Sinner will face Daniil Medvedev in the Shanghai Masters quarter-finals after both clinched straight-set victories on Oct 9.\nItalian star Sinner put some old demons to rest in overcoming American Ben Shelton 6-4, 7-6 (7-1), while Russia’s Medvedev took out Greece’s Stefanos Tsitsipas 7-6 (7-3), 6-3.\nWorld No. 16 Shelton knocked Sinner out at the same stage in 2023, but in their latest clash, the latter looked confident from the start as he won in 88 minutes.\nSinner pulled ahead in the ninth game of the first set, breaking when Shelton hit long, then dominated the second-set tiebreak.\n“It was very tough, you don’t have so much control when you play against him,” said the two-time Major champion.\n“I just tried to stay strong mentally.\n“But if I look at the positive picture, how I ended the match, I tried to stay a bit more aggressive, which I’ve done, and this hopefully can give me confidence for the next round.”\nWorld No. 5 Medvedev and Tsitsipas were meeting for the 14th time. Tsitsipas started the second set strongly, breaking in the first game, but Medvedev broke in the fourth and eighth to progress.\nMedvedev and Sinner have met four times already in 2024 in the later stages of tournaments.\nSinner beat Medvedev in the semi-finals at Miami, the quarter-finals at the US Open and in the Australian Open final, but the Russian ended the Italian’s hopes in the last eight at Wimbledon in an epic five-set battle.\n“I’m gonna bring the fight,” said Medvedev.\n“I could have done much better in the US Open... I didn’t explore enough my potential during this match. So I’m going to try to explore this potential tomorrow.”\nAlso through to the quarter-finals is world No. 2 Carlos Alcaraz, who beat Sinner in the China Open final on Oct 2.\nThe 21-year-old was facing off against veteran Gael Monfils, winning 6-4, 7-5 for his 12th straight victory.\nThe 38-year-old Frenchman had upset Alcaraz at their last meeting in August at Cincinnati, and the Spaniard admitted that loss “was on his mind” during the match.\n“I’m just really, really happy I won the match, and that I stayed calm through the whole match,” said the four-time Major champion.\n“Playing against Gael is never easy... You need to be focused on every ball.”\nNovak Djokovic, a four-time champion in Shanghai, made it through to the next round as well.\nThe Serbian 24-time Grand Slam champion defeated Russia’s Roman Safiullin 6-3, 6-2.\nMeanwhile, Frances Tiafoe has apologised for his foul-mouthed tirade directed at a chair umpire after the American received a time violation and then lost to Safiullin in the third round on Oct 8.\nUnseeded Safiullin beat the 13th seed 5-7, 7-5, 7-6 (7-5) in a three-hour contest, in which the latter lost his cool when he received a time violation while serving with the score tied at 5-5 during the final-set tiebreak.\n“No, no, I tossed the ball up... I was ready to serve. Dude, that’s the rule,” Tiafoe said repeatedly as he walked towards the net while trying to convince the Ecuadorian chair umpire Jimmy Pinoargote.\n“I’m not buying it, it’s the second serve,” the umpire said in response, putting an end to the discussion by announcing “second serve” on the microphone.\nTiafoe went on to lose the point and eventually the match.\nAfter shaking Safiullin’s hand at the net, Tiafoe directed his anger at Pinoargote, repeatedly hurling expletives at the umpire as he walked back to his seat.", "url": "https://www.straitstimes.com/sport/tennis/jannik-sinner-to-face-daniil-medvedev-in-shanghai-masters-quarter-finals"}