{"authors": [], "date_download": "2024-10-12 13:44:10", "date_modify": "2024-10-12 13:44:10", "date_publish": "2024-05-04 20:51:55", "description": "BERLIN - Kuwait's Sheikh Ahmad Al-Fahad Al-Sabah has been banned for 15 years from all positions within the International Olympic Committee over ethics breaches, the Olympic ruling body has decided. Read more at straitstimes.com.", "filename": "sport_football_ioc-bans-sheikh-ahmad-for-15-years_1728740650.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/04/LYNXMPEK4303Z-1.jpg?VersionId=da3akIzT.xcOKS4E1zVaovZIN4Oxmt0k", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_ioc-bans-sheikh-ahmad-for-15-years_1728740650.html", "title": "IOC bans former senior Olympic member Sheikh Ahmad for 15 years", "title_page": "IOC bans former senior Olympic member Sheikh Ahmad for 15 years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BERLIN - Kuwait's Sheikh Ahmad Al-Fahad Al-Sabah has been banned for 15 years from all positions within the International Olympic Committee over ethics breaches, the Olympic ruling body has decided.\nIn a letter seen by Reuters, IOC Director General Christophe De Kepper informed all IOC members of the Executive Board decision to sanction the once-powerful Sheikh Ahmad over a court case in Switzerland.\n\"The IOC Executive Board decided to confirm the seriousness of the breaches of ethical principles by Sheikh Ahmad Al-Sabah, including a betrayal of his IOC Member’s oath, as well as the seriousness of the damage to the IOC’s reputation, which has jeopardised its interests,\" De Kepper said in the May 3 letter.\n\"And consequently, to sanction Sheikh Ahmad Al-Sabah by suspending all the rights, prerogatives and functions deriving from his IOC membership for a period of fifteen years starting from the date of the previous sanction decision by the IOC Executive Board on 27 July 2023.\"\nA former OPEC secretary-general, Sheikh Ahmad had been found guilty in 2021 in Switzerland of forgery and a fake arbitration procedure. The decision was upheld by the Court of Appeals of Geneva.\n\"As a consequence, the IOC Ethics Commission considers that the specific behaviour of Sheikh Ahmad Al-Sabah in orchestrating a fake arbitration procedure exclusively for his own benefit constitutes extremely unethical behaviour by an IOC Member,\" the IOC Ethics Commission said in its decision.\nIt said he had also violated his oath as a member by contesting last year's IOC Executive Board decision to ban him for three years.\nSheikh Ahmed was banned for three years in 2023 over his alleged involvement in the Olympic Council of Asia (OCA) elections, after the IOC approved recommendations issued by its ethics body.\nHe was already self-suspended as a member of the IOC after being convicted by a Swiss criminal court of forgery in 2021, following which he also stepped down as president of the OCA.\nSheikh Ahmad was once one of the most influential people in sports politics, holding key positions on both the IOC as well as world soccer's governing body FIFA. He was named Kuwait's defence minister last year.\nA former close ally of current IOC President Thomas Bach around the time the German lawyer ran for office in 2013, the Kuwaiti also led the Association of National Olympic Committees.\nHe was also in charge of the IOC's purse -- Olympic Solidarity -- which financially supports athletes and national Olympic committees among others. REUTERS", "url": "https://www.straitstimes.com/sport/football/ioc-bans-sheikh-ahmad-for-15-years"}