{"authors": [], "date_download": "2024-10-12 13:42:43", "date_modify": "2024-10-12 13:42:43", "date_publish": "2024-06-27 23:48:11", "description": "Injured fast bowler Kemar Roach has been replaced by uncapped Jeremiah Louis in the West Indies test squad for July's tour of England, Cricket West Indies (CWI) said on Thursday. Read more at straitstimes.com.", "filename": "sport_injured-roach-replaced-by-jeremiah-in-windies-squad-for-england-tour_1728740563.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/27/LYNXMPEK5Q0OL-1.jpg?VersionId=InejgZTS0g4c7_Zc9k1vFMs2vIegaYn4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_injured-roach-replaced-by-jeremiah-in-windies-squad-for-england-tour_1728740563.html", "title": "Injured Roach replaced by Jeremiah in Windies squad for England tour", "title_page": "Injured Roach replaced by Jeremiah in Windies squad for England tour | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Injured fast bowler Kemar Roach has been replaced by uncapped Jeremiah Louis in the West Indies test squad for July's tour of England, Cricket West Indies (CWI) said on Thursday.\nRoach, who has taken 270 wickets in 81 tests, is undergoing rehabilitation after suffering a knee injury while playing County Cricket for Surrey.\nLouis, 28, plays first-class cricket for the Leeward Islands and has one five-wicket and seven three-wicket hauls to his name from seven matches in 2024.\n\"Kemar's skill and experience in English conditions will be missed. However, this opportunity has been long in the making for Jeremiah Louis,\" West Indies lead selector Desmond Haynes said in a statement.\nWest Indies will play three test matches against England in London, Nottingham and Birmingham.\nWest Indies Squad: Kraigg Brathwaite (Captain), Alick Athanaze, Joshua Da Silva, Jason Holder, Kavem Hodge, Tevin Imlach, Alzarri Joseph, Shamar Joseph, Mikyle Louis, Zachary McCaskie, Kirk McKenzie, Gudakesh Motie, Jeremiah Louis, Jayden Seales and Kevin Sinclair. REUTERS", "url": "https://www.straitstimes.com/sport/injured-roach-replaced-by-jeremiah-in-windies-squad-for-england-tour"}