{"authors": ["Ian Cheng"], "date_download": "2024-10-12 14:12:33", "date_modify": "2024-10-12 14:12:33", "date_publish": "2024-08-01 19:15:00", "description": "Among them is South Korean sport shooter Kim Ye-ji, who stole hearts with her unflinching demeanour in competition. Read more at straitstimes.com.", "filename": "sport_main-character-energy-5-paris-olympics-athletes-going-viral-on-social-media_1728742353.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/2024-07-28T101818Z5991723UP1EK7S0RZU8TRTRMADP3OLYMPICS-2024-SHOOTING.JPG?VersionId=tcaAAT0rulUKFrSrHEkVkoYASYIsHHij", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_main-character-energy-5-paris-olympics-athletes-going-viral-on-social-media_1728742353.html", "title": "‘Main character’ energy: 5 Paris Olympics athletes going viral on social media", "title_page": "‘Main character’ energy: 5 Paris Olympics athletes going viral on social media | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "With the Paris Olympics 2024 in full swing, demonstrations of peak human strength, athleticism and endurance have enamoured the world.\nHowever, social media has proven to be another battleground for the athletes, with many leveraging their newfound prominence to develop their online personas and presence.\nHere are five athletes who have sparked chatter on social media so far:\n1. Kim Ye-ji, South Korea (silver, women’s 10m air pistol)\nTop of the list for her “main character” energy is Korean sport shooter Kim Ye-ji, who stole hearts worldwide with her unflinching demeanour in competition.\nSocial media did its work, with images of her - decked out in futuristic eyewear, a sleek jacket and aiming for her target with a picture-perfect posture - spreading like wildfire.\nOlder videos of Kim have also begun to make the rounds online. One shows Kim “casually” breaking a world record at the women’s 25m pistol event at the International Shooting Sport Federation World Cup in May.\nSome fans dubbed her the “coolest person ever” - could you blame them?\nSpecial mention to yet another shooter, Choe Dae-han of South Korea, who came in seventh in the men’s 10m air rifle event. Choe definitely hit the mark on social media, with his arched back drawing comparisons to several characters from games and anime.\nWe’ll let the photo do the talking.\nNedoroscik, who is now known as “Mr Pommel Horse”, reportedly spent two hours waiting and taking naps while waiting for his only event, before not only capturing the judges’ attention but the hearts of people worldwide.\n“Obsessed with this guy on the US men’s gymnastics team whose only job is pommel horse, so he just sits there until he’s activated like a sleeper agent, whips off his glasses like Clark Kent and does a pommel horse routine that helps deliver the team its first medal in 16 years.” said X user MegWritesBooks.\n4. Seth Rider, USA (29th place, men’s triathlon)\nThe men’s triathlon was originally scheduled to take place on July 30 but was postponed for a day after the Seine river failed water quality tests. However, US triathlete Seth Rider had a quick and dirty way of dealing with the issue ... literally.\n“We know that there’s going to be some e.coli exposure, so I just try to increase my e.coli threshold by exposing myself to a bit of e.coli in day-to-day life,” Rider, 27, said in a press conference.\n“And it’s actually backed by science. Proven methods. Just little things throughout your day, like not washing your hands after you go to the bathroom.”\nInfectious diseases consultant Dr Chris Eades told UK newspaper Metro that he was “dismayed” that Rider’s method was given airtime, urging people to not stop washing their hands after they use the toilet.\n“You can’t immunise yourself to e.coli by being exposed to it. It doesn’t work like that,” he said.\n“If people follow that advice and don’t practise normal good hygiene practices, for example after going to the toilet or handling food, they risk exposing themselves to bacteria that could harm them.”\nFollowing his take on hygiene going viral - no pun intended - Rider reportedly then shared a video showing him washing his hands before flashing a thumbs-up.\nFortunately for Rider and his fellow triathletes, lower levels of bacteria were detected in the Seine, with the triathlons - and hopefully his hand-washing routine - resuming.\n5. Tim Elter, Germany (did not finish, men’s shortboard)\nGerman surfer Tim Elter mooned the world as he washed out in the second round of heats for surfing shortboard.\nAs he fell into the water, the camera cut to a wider shot, before zooming in again to Elter, whose shorts had fallen to his knees, leaving his posterior exposed to the world.\n“My trunks were around my knees so I was fighting for them to just get over my a** but the cameramen did me dirty. But it’s fine I find it funny,” Elter told Reuters.\nNot to be outdone by the inevitable wave of memes and jokes that followed, Elter cheekily said in an Instagram comment: “When the waves don’t deliver, then my a** does.”\nAnd no, we are not embedding the video here.", "url": "https://www.straitstimes.com/sport/main-character-energy-5-paris-olympics-athletes-going-viral-on-social-media"}