{"authors": [], "date_download": "2024-10-12 13:39:26", "date_modify": "2024-10-12 13:39:26", "date_publish": "2024-08-22 21:07:41", "description": "Mohammad Rizwan and Saud Shakeel scored centuries as Pakistan posted a commanding 448-6 declared against Bangladesh, with the tourists trailing by 421 runs after day two of their opening test in Rawalpindi on Thursday. Read more at straitstimes.com.", "filename": "sport_rizwan-and-shakeel-tons-put-pakistan-in-control-against-bangladesh_1728740366.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/22/ST-logo-placeholder_25.jpg?VersionId=a9SO1s1lZKpZ7I2Y6RvFIIHGTWWJtKta", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_rizwan-and-shakeel-tons-put-pakistan-in-control-against-bangladesh_1728740366.html", "title": "Rizwan and Shakeel tons put Pakistan in control against Bangladesh", "title_page": "Rizwan and Shakeel tons put Pakistan in control against Bangladesh | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Mohammad Rizwan and Saud Shakeel scored centuries as Pakistan posted a commanding 448-6 declared against Bangladesh, with the tourists trailing by 421 runs after day two of their opening test in Rawalpindi on Thursday.\nThe duo produced a 240-run partnership for the fifth wicket before Shakeel eventually fell for 141, but Rizwan continued to grind down Bangladesh and was unbeaten on 171 when Pakistan decided they had enough on the board.\nBangladesh were 27 for no loss at stumps with Shadman Islam batting on 12 and Zakir Hasan batting on 11.\nResuming on 158-4 after a rain-affected opening day, the hosts enjoyed a flawless first session in glorious sunshine as Rizwan and Shakeel primed themselves for big scores against a largely toothless Bangladesh attack.\nRizwan reached his half-century in the 53rd over by steering pace bowler Nahid Rana behind the wicket and followed it up with another upper cut for back-to-back boundaries as Pakistan looked to accelerate.\nHe caught up with Shakeel thanks to some sublime shot-making as Pakistan went to lunch at 256-4, after making Bangladesh toil on a Rawalpindi pitch that steadily improved for batting as the day wore on.\nHaving launched Shakib Al Hasan for a huge six over long on after the break to take the partnership past 150 runs, Rizwan brought up his third test century in style with a boundary off the spinner in his next over.\nShakeel followed suit with his third ton in the longest format and continued to heap pressure on the tourists but the vice-captain was stumped after misjudging a turning delivery from Mehidy Hasan Miraz.\nA cramping Rizwan lofted Shoriful Islam over the ropes and brought up his 150 two balls later, before Agha Salman (19) and Shaheen Shah Afridi (29) swelled the total with useful knocks lower down. REUTERS", "url": "https://www.straitstimes.com/sport/rizwan-and-shakeel-tons-put-pakistan-in-control-against-bangladesh"}