{"authors": [], "date_download": "2024-10-12 13:42:05", "date_modify": "2024-10-12 13:42:05", "date_publish": "2024-03-08 21:49:08", "description": "United's Champions League hopes are hanging by a thread as they are 11 points behind fourth-placed Aston Villa. Read more at straitstimes.com.", "filename": "sport_football_no-team-can-deal-with-so-many-injuries-laments-man-united-boss-erik-ten-hag_1728740525.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/08/FBL-ENG-PR-ASTONVILLA-MANUTD-160827.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_no-team-can-deal-with-so-many-injuries-laments-man-united-boss-erik-ten-hag_1728740525.html", "title": "No team can deal with so many injuries, laments Manchester United boss Erik ten Hag", "title_page": "No team can deal with so many injuries, laments Manchester United boss Erik ten Hag | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Manchester United manager Erik ten Hag believes his side would have “easily won more games” this season had they not been ravaged by injury.\nHe made the comment ahead of his side’s English Premier League clash with Everton at Old Trafford on March 9.\nBoth teams are seeking to return to winning ways – the Red Devils suffered a crushing 3-1 loss to rivals Manchester City last week, while the Toffees lost by the same scoreline to West Ham United.\nUnited’s Champions League hopes are now hanging by a thread as they are sixth, 11 points behind fourth-placed Aston Villa and six behind Tottenham Hotspur in fifth.\n“We want to be successful, but sometimes seasons are going like the one we are now in,” said ten Hag on March 8. “We have had problems with the squad injury-wise, but with the players available we will fight. It doesn’t matter who are the opposition, we go for the win.\n“The project is going in the right direction, when we have the players available. We want to play at maximum levels... but no team can deal with so many injuries.\n“I think we played to maximum levels, if you take in the availability of the players. We missed so many key players over the season. So imagine if we have many more players available, (we) could easily have (more) wins.”\nAs it is, the United boss will have to cope without the injured Lisandro Martinez, Tyrell Malacia, Luke Shaw, Anthony Martial, Mason Mount, Aaron Wan-Bissaka, Rasmus Hojlund and Harry Maguire.\n“The performances we have seen when the players were available in January and February were very good,” added ten Hag.\nUnited were showing signs of progress in February when they went on a four-game winning run in the Premier League, but they have since struggled in a 2-1 home loss to Fulham and the defeat by City.\nThis means that ever since minority shareholder Jim Ratcliffe’s deal was finalised on Feb 20, the team have lost both their league games. The loss to City was also their 11th of the season.\nEverton, in 16th, have failed to win their last 10 Premier League matches, including all seven in 2024.\nTheir manager Sean Dyche will also be wary about his team’s away form, having not won their last five matches and scoring just twice.\n“It’s the story of the season really – not taking chances,” he said.\nThey will be without the injured Dele Alli and Arnaut Danjuma while Idrissa Gueye is not fit.", "url": "https://www.straitstimes.com/sport/football/no-team-can-deal-with-so-many-injuries-laments-man-united-boss-erik-ten-hag"}