{"authors": [], "date_download": "2024-10-12 14:17:32", "date_modify": "2024-10-12 14:17:32", "date_publish": "2023-11-29 19:46:02", "description": "The 38-year-old Mercedes driver endured a second successive season without a win. Read more at straitstimes.com.", "filename": "sport_formula-one_hamilton-asked-himself-is-it-me-or-is-it-the-car_1728742652.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/29/LYNXMPEJAS0ER-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_hamilton-asked-himself-is-it-me-or-is-it-the-car_1728742652.html", "title": "After another poor season in F1, Lewis Hamilton is asking himself ‘is it me or is it the car?’", "title_page": "After another poor season in F1, Lewis Hamilton is asking himself ‘is it me or is it the car?’ | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Lewis Hamilton has admitted to moments of self-doubt after the 38-year-old Mercedes driver’s second successive Formula One season without a win.\nSpeaking to the BBC and others in an interview published on Nov 29, the seven-time world champion and most successful driver in the sport’s history with a record 103 wins said it was normal to ask such questions.\n“When you have difficult seasons like this, there are always going to be moments when you’re like: ‘Is it me, or is it the car? Do you still have it? Has it gone?’,” said the Briton, who ended the season third overall behind the Red Bull pair of Max Verstappen and Sergio Perez.\n“Because you’re missing that, you know... when the magic happens, when everything comes together, the car and you, and that spark, it’s extraordinary. And that’s what you’re in the search for.”\n“I’m only human,” Hamilton added. “If anyone in the world tells you they don’t have those things, they’re in denial. We’re all human beings.”\nHe last won a race in Saudi Arabia in December 2021, when he was battling Verstappen for the world championship, with the Dutch driver ultimately prevailing in controversial circumstances at the season finale in Abu Dhabi.\nVerstappen and his team won both the drivers’ and constructors’ titles in 2022 and have just enjoyed F1’s most dominant season. In 2023, Red Bull won 21 of 22 races with the now triple champion registering 19 of those wins.\nVerstappen finished 2023 with a whopping 575 points. Perez collected 285 while Hamilton managed 234.\nHamilton said he knew it would be another tough year before the 2023 season had even started when he tested the car and it felt no different.\nHe was complaining already at the opening race in Bahrain that Mercedes were on the wrong track and had not listened to him.\nThe team, who still ended the year second overall, have since changed concept for 2024 with team boss Toto Wolff saying in Abu Dhabi last weekend that almost every component was being changed.\n“I do believe we have a North Star now, which I don’t think we’ve had for two years. But still, getting there is not a straight line,” said Hamilton, who is tied with German great Michael Schumacher for the most world titles.\n“We understand the car so much better. They have developed great tools in the background. So, naturally, I’m hopeful. But I’m not going to hold my breath.”\nHe signed a new contract in August which runs till the end of 2025, meaning he will race on into his 40s if he sees it out. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/hamilton-asked-himself-is-it-me-or-is-it-the-car"}