{"authors": [], "date_download": "2024-10-12 13:42:31", "date_modify": "2024-10-12 13:42:31", "date_publish": "2024-09-10 05:57:15", "description": "CAPE TOWN - Heavyweight contenders in the Africa Cup of Nations qualifiers struggled on Monday with Ghana held to a draw while Morocco and Senegal scraped narrow wins over unfancied opposition. Read more at straitstimes.com.", "filename": "sport_football_ghana-morocco-and-senegal-struggle-in-cup-of-nations-qualifiers_1728740551.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/10/ST-logo-placeholder_4.jpg?VersionId=h3a043LBm0VaqdbIowQS1_mtrwv9Ue89", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_ghana-morocco-and-senegal-struggle-in-cup-of-nations-qualifiers_1728740551.html", "title": "Ghana, Morocco and Senegal struggle in Cup of Nations qualifiers", "title_page": "Ghana, Morocco and Senegal struggle in Cup of Nations qualifiers | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "CAPE TOWN - Heavyweight contenders in the Africa Cup of Nations qualifiers struggled on Monday with Ghana held to a draw while Morocco and Senegal scraped narrow wins over unfancied opposition.\nBut for Angola, the Democratic Republic of Congo and Uganda, victories continued their positive start to the campaign which kicked off last week.\nGhana gave away a late goal as they were held to a 1-1 draw by Niger while Senegal needed a penalty to edge Burundi 1-0.\nMorocco left it late to beat Lesotho with Real Madrid attacker Brahim Diaz scoring a superb individual effort in stoppage time for a 1-0 win in Agadir.\nMorocco will host the next finals but are still taking part in the preliminaries despite being guaranteed a place in the 24-team tournament.\nThey made nine changes from Friday’s 4-1 win over Gabon for their second game in Group B, which was played in Agadir because Lesotho do not have a stadium passed fit for use in international football and ceded home advantage.\nFrench-based Alidu Seidu put Ghana ahead one minute before halftime with a stunning long-range shot but they were unable to hold onto the lead and were caught at the near post from a set piece as Niger equalised through Oumar Sako in the 81st minute.\nGhana have one point in Group F after losing at home last week to Angola, who are top after Randy Nteka grabbed the winner nine minutes from time to beat Sudan 2-1 in Luanda.\nSENEGAL BATTLE\nSenegal took a full-strength side to neutral Malawi to play Burundi in Group L but faced a battle to break down a team 120 places below them in the FIFA rankings.\nThey eventually won a penalty when Sadio Mane was kicked in the face but he was not allowed to take the spot kick by the Egyptian referee because he went down injured and left the field for treatment and had not received permission to return.\nIsmailia Sarr converted the 71st minute penalty instead to ensure victory and leave his side top with four points.\nDR Congo have won two out of two in Group H after a 2-0 victory away to Ethiopia in a match hosted in Dar-es-Salaam. Theo Bongonda and Fiston Mayele netted the second half goals.\nUganda, who came close to upsetting South Africa away last Friday, lead with four points in Group K after a 2-0 home win over Congo in Kampala.\nTogo's Kodjo Fo-Doh Laba scored four minutes into stoppage time as they came from 2-0 down to hold Equatorial Guinea to a 2-2 draw in Malabo in Group E.\nMadagascar and the Comoros Islands drew their Group A Indian Ocean derby 1-1, which was played in Tunisia because of the lack of a stadium on either island.\nTuesday sees the conclusion of the second round of qualifiers for the 2025 finals with 15 fixtures scheduled. REUTERS", "url": "https://www.straitstimes.com/sport/football/ghana-morocco-and-senegal-struggle-in-cup-of-nations-qualifiers"}