{"authors": ["Deepanraj Ganesan"], "date_download": "2024-10-12 13:42:59", "date_modify": "2024-10-12 13:42:59", "date_publish": "2024-04-07 00:05:04", "description": "Maximilian continues his winning start to 2024 with victory at the Trofeo Princesa Sofia regatta in Spain. Read more at straitstimes.com.", "filename": "sport_singaporean-kitefoiler-max-maeder-collects-wins-and-experience-ahead-of-olympics_1728740579.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/07/maxmaeder1.jpg?VersionId=oNNR7xjqE72SWt19TIUZIyN0qCuPsy1f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singaporean-kitefoiler-max-maeder-collects-wins-and-experience-ahead-of-olympics_1728740579.html", "title": "Singaporean kitefoiler Max Maeder collects wins, and experience, ahead of Olympics", "title_page": "Singaporean kitefoiler Max Maeder collects wins, and experience, ahead of Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Singaporean kitefoiler Maximilian Maeder has had a hectic eight months clocking miles across Asia and Europe since booking his ticket to the Paris Olympics last August.\nAhead of the biggest race of his life, he has packed his travel and competition schedule with regattas – 12 of them – as he seeks to collect competition experience before setting sail in France.\nThe Singaporean athlete is also collecting medals.\nHis latest triumph was on April 6, when he continued his winning start to the 2024 season by retaining his Formula Kite title at the Trofeo Princesa Sofia in Spain.\nWhile his rivals such as France’s world No. 1 Axel Mazella and third-ranked Maxime Nocher chose to skip the regatta to focus on their training programmes, Maximilian is taking a different approach.\n“I do feel that I am lacking in experience and I would love to go and collect it. And the way to do that is to compete,” the 17-year-old said.\n“I am happy to compete in these regattas and I enjoy all the mental aspects of it which includes dealing with the pressure and the various situations such as having to wait before going out to compete.”\nCompeting in the waters off Palma de Mallorca, the teenager finished in the top four among 59 sailors after races from April 1 to 5 to qualify for the gold-medal race. Then he was taught a lesson in dealing with tension and nerves when the April 6 final was delayed for five hours due to a lack of wind. He spent the break chatting with his fellow kitefoilers, listening to music and mentally prepping for the race.\nBack on the water hours later, he finished first ahead of Italy’s world No. 2 Riccardo Pianosi, Cyprus’ Denis Taradin and 2022 Slovenian world champion Toni Vodisek.\nThis is his third win in 2024 after he triumphed in the Fuerteventura KiteFoil International Open Cup in February and Formula Kite European Championships a month later. His burgeoning medal collection includes gold at the 2023 Sailing World Championships – where he earned his spot in the Olympics – and an Asian Games gold last September.\nA favourite for the Olympic title in Marseille, Maximilian will next compete in the Semaine Olympique Francaise from Apr 20-27, before the Formula Kite World Championships from May 11 to 19.\nHe added: “I feel good and it has been a great regatta where I have had fun racing. A lot can change between now and the Olympics and I know it is important to stay diligent in what I do.”", "url": "https://www.straitstimes.com/sport/singaporean-kitefoiler-max-maeder-collects-wins-and-experience-ahead-of-olympics"}