{"authors": [], "date_download": "2024-10-12 14:11:34", "date_modify": "2024-10-12 14:11:34", "date_publish": "2024-05-11 14:40:25", "description": "Both teams avoided falling into the \"3-0 hole\", a deficit from which no franchise have ever rallied to win a play-off series. Read more at straitstimes.com.", "filename": "sport_basketball_denver-nuggets-indiana-pacers-claw-back-in-nba-conference-semi-finals_1728742294.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/11/2024-05-11T044641Z555312302MT1USATODAY23243157RTRMADP3NBA-PLAYOFFS-DENVER-NUGGETS-AT-MINNESOTA-TIMBERWOLVES.JPG?VersionId=cFdlqVAYL3z7zH6Ipm4eW3ooibPPJ.Bz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_denver-nuggets-indiana-pacers-claw-back-in-nba-conference-semi-finals_1728742294.html", "title": "Denver Nuggets, Indiana Pacers claw back in NBA conference semi-finals", "title_page": "Denver Nuggets, Indiana Pacers claw back in NBA conference semi-finals | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MINNESOTA – Teams in the National Basketball Association (NBA) are all too familiar with the “3-0 curse”, that no franchise have ever rallied from that deficit to win a play-off series.\nTo avoid falling into the undesired hole, NBA champions Denver Nuggets roared back into their Western Conference semi-final series against Minnesota with a 117-90 road victory on May 10.\nThe Indiana Pacers also clawed back a game at home against the New York Knicks in the East.\nNBA Most Valuable Player Nikola Jokic and Jamal Murray scored 24 points apiece, with Jokic adding 14 rebounds and nine assists for the Nuggets, who cut the deficit in their best-of-seven series to 2-1.\nDenver dispelled any suggestion that they would bow out quietly after they were humbled by the young Timberwolves in Games 1 and 2 in Denver.\nThe Pacers, who dropped the first two games of their Eastern semi-final series in New York, also did the same with a 111-106 victory over the Knicks in Indianapolis.\n“Everybody knows what it looks like when you go down 3-0,” Pacers star Tyrese Haliburton said. “We had to come out play desperate, play hard.”\nThe Nuggets will try to draw level on May 12 in Minneapolis, after a victory in which Jokic said his team went into the contest determined to “play like a champion”.\n“I think we played much simpler,” he told broadcaster ESPN. “But we were aggressive, more aggressive than them, and I think that’s definitely the thing that changed the game.”\nMurray, who scored just 25 points over the first two games and was fined US$100,000 (S$135,000) for letting his frustration boil over and throwing a heating pad onto the court during Game 2, connected on 11 of 21 shots and came up with three steals.\n“Our guys answered the bell,” Nuggets coach Michael Malone said. “They showed me that they still believe.”\nMichael Porter Jr added 21 points as all five Nuggets starters scored in double figures against a Timberwolves team whom coach Chris Finch called “sluggish” and “slow”.\nAnthony Edwards led Minnesota with 19 points, with Karl-Anthony Towns adding 14.\nThey trailed by as many as 34 points, to the dismay of fans at the Target Centre who were eager to see the kind of show the Timberwolves had put on when they were on the road.\n“Not a lot of good things on either end of the floor, really,” Finch added.\nIn Indianapolis, Haliburton scored 35 points and Andrew Nembhard emerged as an unlikely hero, draining a three-pointer from deep as the shot clock was running down to put the Pacers ahead 109-106 with 17.8 seconds left to play.\nIt was just his second basket of the night, but it turned the tide for good in a physical, back-and-forth battle in which the Pacers surrendered an early 12-point lead and rallied from nine down in the fourth quarter.\n“I put (Nembhard) in kind of a bad situation and he just made an unbelievable shot,” said Haliburton, who passed to Nembhard with just four seconds on the shot clock after finding himself unable to get a shot off in the face of a swarming Knicks defence.\n“Big, big shot. He really stepped up to the moment when we needed him most.”\nHaliburton had six of Indiana’s 12 three-pointers. Pascal Siakam scored 26 points and Myles Turner added 21 and 10 rebounds for the Pacers.\nThe banged-up Knicks, already missing Julius Randle, Mitchell Robinson and Bojan Bogdanovic, were also without O.G. Anunoby after he suffered a hamstring strain in Game 2.\nKnicks star Jalen Brunson, who was not confirmed to start until pre-game warm-ups were over after hurting his right foot, got off to a slow start and finished with 26 points and six assists.\nDonte DiVincenzo led the Knicks scoring with 35 points, connecting on seven of 11 from three-point range.\nGame 4 is also on May 12 in Indiana. AFP", "url": "https://www.straitstimes.com/sport/basketball/denver-nuggets-indiana-pacers-claw-back-in-nba-conference-semi-finals"}