{"authors": [], "date_download": "2024-10-12 14:17:27", "date_modify": "2024-10-12 14:17:27", "date_publish": "2023-10-09 13:05:34", "description": "F1 should welcome Michael Andretti's entry bid as good for business and the spirit of the sport, according to FIA president Ben Sulayem. Read more at straitstimes.com.", "filename": "sport_formula-one_fia-boss-ben-sulayem-wants-more-f1-teams-and-fewer-races_1728742647.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/09/2023-10-06T184546Z1448763871UP1EJA61G48SGRTRMADP3MOTOR-F1-QATAR.JPG", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_fia-boss-ben-sulayem-wants-more-f1-teams-and-fewer-races_1728742647.html", "title": "FIA boss Mohammed Ben Sulayem wants more Formula One teams and fewer races", "title_page": "FIA boss Mohammed Ben Sulayem wants more Formula One teams and fewer races | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA – Formula One needs more teams and fewer races and should welcome Michael Andretti’s entry bid as good for business and the spirit of the sport, according to FIA president Mohammed Ben Sulayem.\nThe Emirati told Reuters at the Qatar Grand Prix he was optimistic the American’s planned 11th team with General Motors’ Cadillac brand would make it to the starting grid, despite opposition from existing competitors.\nThe governing International Automobile Federation (FIA) announced last week that it had approved Andretti’s application and sent it on to Liberty Media-owned Formula One Management (FOM) for commercial discussions.\nThose detailed talks could take some time.\n“Saying no to a team which has been approved by the FIA, it’s very hard to say no,” Ben Sulayem said in his office at the Lusail circuit.\n“You can call me optimistic, I’m always optimistic. I think yes,” he added, when asked whether he thought Andretti would prevail.\nThe 61-year-old said Liberty Media’s share price had gone up when the FIA’s approval of Andretti was announced.\n“The FIA should be asking, begging, OEMs (car manufacturers) to come in. We should not just say no to them,” he said.\n“If you say what is my dream, it is to fill up the 12 (slots) and to have one US team from an OEM and a PU (power unit) and a driver from there driving. And then go to China maybe and ask for the same thing and do it.”\nTeams are opposed to increasing the grid beyond the current 10 because it would reduce their share of the prize pot and dilute their overall value, but they have no say in the decision.\nF1 chief executive officer Stefano Domenicali has sounded lukewarm and said any expansion had to be right for the business.\nMercedes team boss Toto Wolff has said anyone wanting to join the party should buy an existing team, an expensive option with the sport’s popularity surging and valuations around the US$1 billion (S$1.37 billion) mark.\nA new team must pay a US$200 million dilution fee, to be shared among existing competitors, under the current rules but some say that is not enough.\n“You cannot force Andretti/GM to buy another team just because they (the owners) want to sell,” said Ben Sulayem.\n“I won’t mention names but they were after me to go on and convince GM to do that.\n“It’s not my job. I was not elected to do that. I am not a broker.\n“We are allowed to have 12 teams (in the rules). Some of the teams said, ‘Oh, it will be crowded’. Really? We are already running a Hollywood team with us,” he said, referring to Brad Pitt’s F1 movie being filmed at some races.\nRed Bull boss Christian Horner said in May that new teams would be hard to fit in.\n“The circuits are supposed to have enough garages and space for 12 teams... I think the number of races is too much (rather) than the number of teams. We need more teams and fewer races,” continued Ben Sulayem.\n“The teams are looking at the piece of cake. I understand their worries... but our worries are different.”\nNext season will have a record 24 rounds, up from 22 in 2023 and 19 a decade ago, and staff burnout is a concern.\nBen Sulayem said Andretti could also enter without a commercial agreement, although whether they would want to is another matter.\n“We hope not. But it could happen. It can happen,” he said.\nHe dismissed talk of a power struggle between F1 and the FIA but emphasised the governing body’s position as “landlord”.\n“We are not a service provider. We own the championship. We leased it, we are the landlord. So that has to be respected also,” he said.\n“My intention was never to embarrass or to put someone in a corner, Liberty or FOM (Formula One Management). I am here for the spirit of the sport.” REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/fia-boss-ben-sulayem-wants-more-f1-teams-and-fewer-races"}