{"authors": [], "date_download": "2024-10-12 14:00:36", "date_modify": "2024-10-12 14:00:36", "date_publish": "2024-08-02 21:29:55", "description": "PARIS - Novak Djokovic snapped his Olympic semi-final jinx with a 6-4 6-2 defeat of Italy's Lorenzo Musetti on Friday to set up a blockbuster battle for gold against Spain's Carlos Alcaraz. Read more at straitstimes.com.", "filename": "sport_tennis_tennis-brutal-alcaraz-crushes-auger-aliassime-to-reach-final_1728741636.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/LYNXMPEK710K5-1.jpg?VersionId=Xy7qkNVKnlD58DZv.F_JQoHfmTwq_yBe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_tennis-brutal-alcaraz-crushes-auger-aliassime-to-reach-final_1728741636.html", "title": "Tennis-Djokovic and Alcaraz set up golden showdown", "title_page": "Tennis-Djokovic and Alcaraz set up golden showdown | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Novak Djokovic snapped his Olympic semi-final jinx with a 6-4 6-2 defeat of Italy's Lorenzo Musetti on Friday to set up a blockbuster battle for gold against Spain's Carlos Alcaraz.\nThe 37-year-old Serb had lost his three previous Olympic singles semi-finals but was in no mood to suffer more heartache as he dominated a high-quality duel at Roland Garros.\nEarlier on Court Philippe Chatrier, the 21-year-old Alcaraz thrashed Canada's Felix Auger-Aliassime 6-1 6-1.\nDjokovic needs only the Olympic gold to complete the full set of achievements in a career that has earned him 24 Grand Slam titles and the relief of reaching the final was clear as he laid on his back, arms outstretched, after match point.\n\"Three of the (previous) four Olympic Games I played I made semi-finals but failed to overcome that hurdle,\" Djokovic, whose only medal was a singles bronze in 2008, told reporters.\n\"Just to secure a higher medal for my country, whatever happens on Sunday, is a huge pride and honour. I'm going for gold, but this is a big deal.\"\nDjokovic lost to Rafa Nadal in the semi-final in Beijing, Andy Murray in the 2012 last four in London and in Tokyo it was Alexander Zverev who blocked his path.\nMusetti, bidding to emulate the Italian duo of Jasmine Paolini and Sara Errani who reached the women's doubles final, started superbly but Djokovic found another gear to break serve in the 10th game from 40-0 down and take the first set.\nDjokovic, who had concerns over his strapped-up knee ahead of the match, lost his cool in the second after twice dropping his serve, and was raging after a code violation.\nBut he responded like the warrior he is, reeling off five games to became the oldest Olympic men's singles finalist since tennis returned to the Games in 1988.\nFORMIDABLE OBSTACLE\nSecond seed Alcaraz is the youngest and judging by his demolition of Auger-Aliassime he will be a formidable obstacle.\nThe 21-year-old, who outplayed Djokovic to win his second Wimbledon title last month, was in devastating form and needed little more than an hour to earn his shot at gold.\n\"It means a lot to me being in a final at the Olympic Games and giving myself the chance to fight for a gold medal for my country. It is a special moment for my career and my life,\" Alcaraz, who like Djokovic has not dropped a set, said.\n\"I'm really happy to bring a medal to my country, and hopefully, it's going to be the gold one.\"\nAuger-Aliassime, bidding to become the first Canadian to reach an Olympic singles final, was outclassed.\n\"In every aspect, I was dominated, there's not much more to say,\" the 23-year-old said.\nRealistically, Sunday's final is Djokovic's last chance to scratch his Olympic itch but he said he has nothing to lose.\n\"Alcaraz has proved the best player in the world at the moment,\" he said. \"He's definitely favourite, but it's the Olympics, it's anybody's game.\"\nThe first gold medal of the tennis event went to Czech pair Katerina Siniakova and Tomas Machac who won the mixed doubles, beating China's Wang Xinyu and Zhang Zhizhen 6-2 5-7 10-8.\nPoland's Iga Swiatek earned some consolation for her tearful semi-final defeat on Thursday as she easily beat Slovakia's Anna Karolina Schmiedlova 6-2 6-1 to win bronze.\n\"I think if I hadn't played today I would cry for a week, so I needed to get it together,\" the world number one said.\nSwiatek's conqueror Zheng Qinwen of China plays Croatia's Donna Vekic in the women's gold medal match on Saturday.\nItaly are guaranteed their first Olympic tennis medal since 1924 after Paolini and Errani eased past Czech duo Karolina Muchova and Linda Noskova 6-3 6-2 to reach the doubles final.\nThey will play Russians Mirra Andreeva and Diana Shnaider, who are competing as neutrals, after they crushed Spain's Cristina Bucsa and Sara Sorribes 6-1 6-2.\nUnseeded Australian pair Matthew Ebden and John Peers booked their place in the men's doubles final with a 7-5 6-2 victory against Americans Taylor Fritz and Tommy Paul. They will face another U.S. duo in Rajeev Ram and Austin Krajicek for the gold medal. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/tennis-brutal-alcaraz-crushes-auger-aliassime-to-reach-final"}