{"authors": [], "date_download": "2024-10-12 14:11:22", "date_modify": "2024-10-12 14:11:22", "date_publish": "2024-08-09 02:01:44", "description": "PARIS - The fencing ranking round of the Modern Pentathlon might normally be a contender for lowest profile event of the Olympics but a sizeable Paris crowd produced plenty of noise on Thursday. Read more at straitstimes.com.", "filename": "sport_modern-pentathlon-clouvel-gets-the-crowd-cheering_1728742282.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/09/ST-logo-placeholder_17.jpg?VersionId=_ILsQ1dBVoBelXRL3R_Pw1g93303_P5g", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_modern-pentathlon-clouvel-gets-the-crowd-cheering_1728742282.html", "title": "Modern Pentathlon-Clouvel gets the crowd cheering", "title_page": "Modern Pentathlon-Clouvel gets the crowd cheering | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The fencing ranking round of the Modern Pentathlon might normally be a contender for lowest profile event of the Olympics but a sizeable Paris crowd produced plenty of noise on Thursday.\nFrench medal contender Elodie Clouvel had them stomping and cheering as she led the women's competition at the North Paris Arena, a cavernous exhibition centre out on the fringes near Charles de Gaulle airport.\nShe registered 27 wins and eight defeats from her one-to-one bouts to end up with 260 points. Hungarian Michelle Gulyas was second, on 245, with Britain's defending champion Kate French third on 240.\n\"It's magical. I took everything I could, I enjoyed it,\" said Clouvel.\nThe support surprised rivals more used to such a preliminary, in an arcane sport that rarely garners much media attention outside the Games, being held with far less fanfare.\nThe last Games in Tokyo three years ago took place without spectators due to COVID but those used to more recent World Cup events were surprised.\n\"I think we are used to just having our coaches screaming at us and our teammates and not really having a crowd,\" said American Jess Savner.\n\"It makes all the difference. You want to make the people watching you proud and you want to put a bit more oomph into it. It was really special.\"\nBritain's Kerenza Bryson, who ranked fifth, said it had been a very different experience.\n\"It was definitely a completely different atmosphere, really noisy, the whole preparation getting into the stadium. It was crazy. I struggled with that a little bit at the start, it was just very nerve-racking,\" she said.\nThe event moves on Friday to the other end of the spectrum -- the gardens of the opulent Palace of Versailles for the equestrian, swimming, laser pistol shooting and running components. REUTERS", "url": "https://www.straitstimes.com/sport/modern-pentathlon-clouvel-gets-the-crowd-cheering"}