{"authors": ["Melvyn Teoh", "Kimberly Kwek"], "date_download": "2024-10-12 13:43:11", "date_modify": "2024-10-12 13:43:11", "date_publish": "2024-02-14 19:18:27", "description": "They lost 5 out of 5 matches and their heaviest defeat was a 39-2 rout by two-time world champions Hungary. Read more at straitstimes.com.", "filename": "sport_huge-defeats-at-world-championships-an-invaluable-experience-for-singapore-women-s-water-polo-team_1728740591.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/02/14/DOH3333.jpg.JPEG?h=af8bac72", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_huge-defeats-at-world-championships-an-invaluable-experience-for-singapore-women-s-water-polo-team_1728740591.html", "title": "Huge defeats at world championships an ‘invaluable experience’ for Singapore women’s water polo team", "title_page": "Huge defeats at world championships an ‘invaluable experience’ for Singapore women’s water polo team | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – A highly anticipated debut at the World Aquatics Championships in Doha was also a sobering one for the Singapore national women’s water polo team, as they lost all five matches – their heaviest defeat was a 39-2 rout by two-time world champions Hungary.\nThey began their maiden campaign with a 32-1 thrashing by Australia, followed by losses to Hungary and New Zealand (30-4) in the group stage. The Singaporeans eventually finished last out of 16 teams after defeats by South Africa (20-6) and Brazil (18-2) in the classification round.\nIt was a tough test against the world’s best water polo teams but an “invaluable experience” that they hope to build on for the future.\nCaptain Abielle Yeo, 25, said: “This has been an invaluable experience, given the opportunity to participate in such a big-scale competition and, for us, we have been mentally and physically challenged.\n“From your instincts, you can tell a player’s level of experience, the high level of experience that these teams have and it’s something admirable and something we hope to learn from.”\nWomen’s national coach Yu Lei, 52, who took over the team in January, said: “To be honest, every team in our group are very strong, and these championships have been an eye-opener for us.\n“Despite the big scorelines, we have played better with each passing game, and the girls have given their best to fight for every ball at every opportunity.”\nWhile the national women’s water polo team have done well regionally with one SEA Games gold and three silvers from 2011 to 2019, being on the world stage gave them a chance to see how other countries train and compete.\nTop teams like Spain and Greece boast a large player base with a good foundation in the sport, noted Yeo.\nShe said: “They were definitely physically bigger, especially those from European countries. One of the biggest differences between us and those countries is that we know that they have a much more robust water polo system.\n“The player base is much larger, their whole ecosystem from the grassroots level to the national training system is more sophisticated... their skill levels, their style of play and how experienced they are.”\nIn one of their encounters with the United States, who are the Olympic champions, she was surprised to learn that their players have very few shoulder injuries even though “water polo is an aggressive and high-contact sport”.\nShe said: “They have personalised training flexibilities and adjustments that help each player get back as quickly as possible, so maybe that’s something that we can learn from.”\nThe lessons from Doha will put them in good stead for the 2025 SEA Games in Thailand, where they are aiming to snatch the crown from the hosts. A medal at the Asian Games is also on the radar for the women’s team.\nYeo added: “I only see it going up from here, now that there’s a bit more focus on building the women’s water polo ecosystem.\n“We hope that this world champs outing will expose the sport more because it’s not the most common sport for girls. So by going for such a large competition, we hope the exposure will inspire more girls to join us.”", "url": "https://www.straitstimes.com/sport/huge-defeats-at-world-championships-an-invaluable-experience-for-singapore-women-s-water-polo-team"}