{"authors": [], "date_download": "2024-10-12 13:42:02", "date_modify": "2024-10-12 13:42:02", "date_publish": "2024-03-19 23:02:27", "description": "Manchester United midfielder Kobbie Mainoo has received his first England senior call-up ahead of their two friendlies, the national team said on Tuesday, after the youngster's impressive run at the Premier League club. Read more at straitstimes.com.", "filename": "sport_football_manchester-utds-mainoo-gets-first-england-call-up_1728740522.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/03/19/LYNXNPEK2I0KL-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_manchester-utds-mainoo-gets-first-england-call-up_1728740522.html", "title": "Man Utd's Mainoo gets first England call-up", "title_page": "Man Utd's Mainoo gets first England call-up | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Manchester United midfielder Kobbie Mainoo has received his first England senior call-up ahead of their two friendlies, the national team said on Tuesday, after the youngster's impressive run at the Premier League club.\nThe 18-year-old, who was initially part of the Under-21s squad for this month's U-21 Euro 2025 qualifiers, has been drafted into manager Gareth Southgate's team for matches at Wembley against Brazil on March 23 and Belgium on March 26.\nMainoo is a graduate of United's youth academy and has made 14 appearances for the Old Trafford side in the Premier League this season.\n\"It's an honour to receive my first senior call-up,\" Mainoo posted on Instagram.\nMainoo, who has represented England at Under-17, Under-18 and Under-19 levels, reported to St. George's Park on Tuesday.\nEverton defender Jarrad Branthwaite and Newcastle United winger Anthony Gordon were also handed their first international call-ups by Southgate last week. REUTERS", "url": "https://www.straitstimes.com/sport/football/manchester-utds-mainoo-gets-first-england-call-up"}