{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 13:41:36", "date_modify": "2024-10-12 13:41:36", "date_publish": "2024-08-07 21:01:10", "description": "The Asian Games champion, who finished 25th out of 43 in the men's dinghy event at the Olympics, has been in the sport for two decades. Read more at straitstimes.com.", "filename": "sport_national-sailor-ryan-lo-to-take-a-break-from-competing-after-paris-olympics_1728740496.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/07/2024080725324780img2701.jpg?VersionId=Dej1diMHC9cxTxA1ee8.QN.Fw5nwqjQ9", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_national-sailor-ryan-lo-to-take-a-break-from-competing-after-paris-olympics_1728740496.html", "title": "National sailor Ryan Lo to take a break from competing after Paris Olympics", "title_page": "National sailor Ryan Lo to take a break from competing after Paris Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MARSEILLE – It is a long journey that has taken him around the world, to the top of the podium at the Asian Games and to two Olympics.\nAnd after two decades in the sport, Ryan Lo will be taking a “long break” from competitive sailing following the conclusion of his Paris Olympics campaign. In Marseille, he finished 25th out of 43 in the men’s dinghy event.\nThe 27-year-old Singaporean said the 2028 Los Angeles Olympics are not in his plans for now. Lo, who has won one Asian Games gold and four SEA Games titles, will make a firmer decision on his sporting future after he has had time to think and recover.\nOn his decision to step away from competing, he said: “It was getting a bit tiring to keep up with the intensity for so long periods, that’s why I felt like I needed a bit of time to step away from sailing after the Olympics to try to refresh and get some energy back.”\nNow, life off the water beckons. He will return to Singapore for a short break, before enrolling in James Cook University in September to study international business.\nFor the past eight years, sailing has kept him away from home for about seven to eight months a year – his longest stint was during the Covid-19 pandemic when he was overseas for almost a year to prepare for the Tokyo Games – and so he is looking forward to spending time with family and friends.\nLo is also relishing the time off and doing “normal people things”, like not having to control his diet.\nIn order to maintain his weight at around 81kg, he typically eats two meals before going out on the water (breakfast, light lunch) and a recovery meal, a second dinner and then supper after he is done sailing.\nWhile he is excited about starting a new chapter of his life, Lo admitted that a part of him will miss the sport.\nHe said: “I’m just fresh off sailing so I do look forward to having a break. But I’m sure once I resume with life without much sailing, I will miss it and I will definitely not be used to (not following) the routines I’ve built along these years.”\nLo picked up sailing in 2004, inspired by his sibilings Man Yi and Jun Hao. The former competed in the laser radial class at the Beijing 2008 Olympics, while the latter is a SEA Games silver medallist.\nAt 13, Ryan snagged a bronze medal in the optimist class at the 2010 Asian Games. He followed that up with another bronze at the 2018 Asian Games, before bagging gold at the Hangzhou Games in 2023, earning him qualification to his second Olympics.\nIn between, Lo also claimed four golds at the SEA Games, including three individual titles.\nIt was a tricky outing in Marseille for Lo, who started off seventh after the first day of racing but slipped down the standings. He was disqualified in one race before weather conditions on Aug 5 resulted in the cancellation of the final two races of the opening series.\nHe said: “It was a good opportunity for me to climb back as much as possible and end off on a high note for this event, but unfortunately we didn’t get in any races, so the result turned out to be not as ideal.”\nBut Lo remained proud of his progress in the sport and how it has helped him grow. He recalled how he was unsure of whether he would make it to the Olympics when he enlisted for national service and now, he has done two campaigns.\nHe said: “The experiences I’ve gained along the way, the people I’ve met, the relationships I’ve built and all these lessons I’ve learnt from sailing, it’s given me much more than what I believe university education could give me.”", "url": "https://www.straitstimes.com/sport/national-sailor-ryan-lo-to-take-a-break-from-competing-after-paris-olympics"}