{"authors": [], "date_download": "2024-10-12 14:14:18", "date_modify": "2024-10-12 14:14:18", "date_publish": "2024-08-02 23:24:54", "description": "PARIS - China's Wang Zongyuan said he had not thought about introducing harder dives in his routine on Friday after he and partner Long Daoyi won the men's synchronised 3-metre springboard event at the Paris Olympics. Read more at straitstimes.com.", "filename": "sport_diving-chinas-wang-says-no-plan-to-try-harder-dive-yet_1728742458.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/LYNXMPEK710N3-1.jpg?VersionId=tQK2RQP0PrXZoQpN_ufq6E13GZ_03SCQ", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_diving-chinas-wang-says-no-plan-to-try-harder-dive-yet_1728742458.html", "title": "Diving-China's Wang says no plan to try harder dive yet", "title_page": "Diving-China's Wang says no plan to try harder dive yet | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - China's Wang Zongyuan said he had not thought about introducing harder dives in his routine on Friday after he and partner Long Daoyi won the men's synchronised 3-metre springboard event at the Paris Olympics.\nWang and Long battled against Mexico's divers Juan Celaya and Osmar Olvera and narrowly escaped defeat by 2.07 points, to keep China's goal of sweeping all eight diving golds alive.\nThe second-placed Mexican and Britain's bronze medallists performed a 5156B forward 2-1/2 somersaults in pike position with three twists - a routine that had the highest 3.9 difficulty in Friday's competition.\n\"We've always been using our current set of routines and we haven't thought about bringing up the difficulty levels,\" Wang told reporters after Friday's event.\n\"5156B has higher difficulty but also comes with greater risks. We are able to perform our current set at a higher level even though our performance today was a bit sub-par,\" he said.\n\"We have no plans about doing 5156B in future, we are just focusing on ourselves today,\" he said.\nThe Chinese pair achieved Friday's highest score in their most difficult dive which was a forward 4-1/2 somersaults in a tucked position - the last dive that firmed up top place.\nThat dive had a difficulty level of 3.8. REUTERS", "url": "https://www.straitstimes.com/sport/diving-chinas-wang-says-no-plan-to-try-harder-dive-yet"}