{"authors": [], "date_download": "2024-10-12 13:42:42", "date_modify": "2024-10-12 13:42:42", "date_publish": "2023-12-08 22:13:13", "description": "He also urged out-of-form Marcus Rashford to follow the examples of Harry Maguire and Scott McTominay. Read more at straitstimes.com.", "filename": "sport_football_erik-ten-hag-admits-he-was-warned-off-impossible-manchester-united-job_1728740562.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/08/11014790.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_erik-ten-hag-admits-he-was-warned-off-impossible-manchester-united-job_1728740562.html", "title": "Erik ten Hag admits he was warned off ‘impossible’ Manchester United job", "title_page": "Erik ten Hag admits he was warned off ‘impossible’ Manchester United job | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Erik ten Hag said he was warned off taking on the “impossible job” of Manchester United manager, but admitted he could not forgo the challenge at Old Trafford.\nThe Dutchman, who left Ajax Amsterdam to take over at United in 2022, ended the club’s six-year trophy drought last season but has been under intense pressure in his second campaign.\nUnited beat Chelsea 2-1 at home on Dec 6, easing the strain on their beleaguered boss, but have lost 10 out of their 22 games this season in all competitions.\nTen Hag, 53, told fanzine United We Stand he was advised how tough it would be to revive the 20-time English champions, who have been in the shadow of Manchester City for a decade.\n“Everyone was telling me, ‘You can’t succeed in that job’. They said it was impossible. Me? I wanted the challenge,” he said.\nUnited beat Newcastle United in the League Cup final in February and finished third in the English Premier League in 2022-23.\nHowever, this season they are already out of the League Cup, trail Premier League leaders Arsenal by nine points and face an embarrassing group-stage exit from the Champions League.\nSince Alex Ferguson retired in 2013, five other managers have tried and failed to take United back to the top of English football – David Moyes, Louis van Gaal, Jose Mourinho, Ole Gunnar Solskjaer and Ralf Rangnick.\n“I knew it wouldn’t be easy, but it was such a great club with such a great fan base,” said ten Hag.\n“People love Man United, or they are against Man United. I like clubs like this. Ajax was like this.”\nTen Hag said this week he was confident he retains the backing of the United players after reports of rifts within the dressing room.\nUnited are expected to announce that British billionaire Jim Ratcliffe is buying a 25 per cent stake in the club in the coming days, but the deal may not make a major impact on spending in the January transfer window.\n“I don’t think we will spend a lot,” said ten Hag. “You have to look for improvements, so if you can find better and it’s realistic financially and with financial fair play, the club has to go with it. But most of the time you don’t attract the best players in the winter.”", "url": "https://www.straitstimes.com/sport/football/erik-ten-hag-admits-he-was-warned-off-impossible-manchester-united-job"}