{"authors": [], "date_download": "2024-10-12 14:12:32", "date_modify": "2024-10-12 14:12:32", "date_publish": "2024-08-12 17:48:36", "description": "Novak Djokovic, Simone Biles, Rebeca Andrade, Noah Lyles, Imane Khelif, Lin Yu-ting and Yusuf Dikec all left their mark on the Paris Games. Read more at straitstimes.com.", "filename": "sport_five-big-moments-of-the-2024-olympics_1728742352.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/12/FILES-OLY-PARIS-2024-PHOTOGRAPHY-033156.jpg?VersionId=hiLg93V3WUWTVTbu7rWuqbGqxqKklsh5", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_five-big-moments-of-the-2024-olympics_1728742352.html", "title": "Five big moments of the 2024 Olympics", "title_page": "Five big moments of the 2024 Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – From a colourful, sometimes controversial, opening ceremony to boxers caught up in a gender row to respectful bows on the gymnastics podium, the 2024 Olympics served up many memorable moments. Here are five of the best.\nDjokovic’s roar of approval\nNovak Djokovic stunned Carlos Alcaraz in a memorable men’s final to clinch tennis gold and become only the fifth player to complete the Golden Slam of all four Majors plus Olympic gold.\nThe 37-year-old celebrated with a roar which echoed around Roland Garros, before the tearful Serb clambered into the players’ box to embrace his wife Jelena and two children.\n“There is no greater inspiration than representing your country,” said the 24-time Grand Slam winner. Alcaraz was also in tears, claiming he “had let Spain down”.\nBiles bows to ‘queen’ Andrade\nSimone Biles may have been the star of the show but she was widely praised for bowing to her arch-rival Rebeca Andrade on the podium.\nBiles said it was “just the right thing to do” after she and teammate Jordan Chiles finished in silver and bronze medal positions respectively behind the Brazilian in the floor final.\n“Rebeca’s so amazing, she’s queen,” said Biles.\nRomanian Ana Barbosu was later awarded the bronze medal after the Court of Arbitration for Sport ruled that Chiles should not have been upgraded from her initial fifth-place finish.\nLyles just in time\nWorld champion Noah Lyles roared to victory in 9.79 seconds to claim gold in a dramatic men’s Olympic 100m final in the closest finish in modern history – just five thousandths of a second separated him from Jamaica’s Kishane Thompson.\n“I’m the man among all of them. I’m the wolf among wolves,” said Lyles, whose victory was confirmed only after a photo finish.\nGender-row boxer beats\n‘bullying’\nOn a raucous night at Roland Garros, the storied home of tennis’ French Open, Algerian gender-row boxer Imane Khelif claimed the 66kg gold and used her platform to hit back at “attacks” and “bullying”, before defiantly declaring: “I am a woman like any other.”\nTogether with Chinese Taipei’s Lin Yu-ting, who won the 57kg class, Khelif was disqualified from the 2023 World Championships after they failed gender-eligibility tests.\nHowever, they were cleared by the International Olympic Committee to compete in Paris, setting the stage for one of the biggest controversies of the Games.\n“I am fully qualified to take part, I am a woman like any other. I was born a woman, lived a woman and competed as a woman,” she said.\nCool hand Yusuf\nTurkish Olympic shooting silver medallist Yusuf Dikec, 51, became an overnight sensation for his casual style during competition.\nHis eye-catching posture saw the marksman wearing standard glasses, a team T-shirt and with his left hand casually tucked in his pocket.\nOther than his pistol, he notably had none of the specialised equipment used by athletes in the hyper-precise event, like headphones, special lenses or a hat.\n“The name’s Dikec. Yusuf Dikec,” said a social media post in reference to cinema icon James Bond. AFP", "url": "https://www.straitstimes.com/sport/five-big-moments-of-the-2024-olympics"}