{"authors": [], "date_download": "2024-10-12 13:42:44", "date_modify": "2024-10-12 13:42:44", "date_publish": "2024-06-28 04:08:10", "description": "A dominant India ended England's title defence by handing them a 68-run thumping in the second semi-final of the T20 World Cup on Thursday and secure their place in the final against South Africa. Read more at straitstimes.com.", "filename": "sport_india-beat-england-to-reach-t20-world-cup-final_1728740564.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/29/TOPSHOTS-TOPSHOT-Cricket-WC-2024-T20-IND-ENG-204313.jpg?VersionId=pQJXQM78m8TCvioKpy99OBPXOdSE0rrC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_india-beat-england-to-reach-t20-world-cup-final_1728740564.html", "title": "Ruthless India thump England to reach cricket T20 World Cup final", "title_page": "Ruthless India thump England to reach cricket T20 World Cup final | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "A dominant India ended England’s title defence by handing them a 68-run thumping in the second semi-final of cricket’s T20 World Cup on Thursday and secure their place in the final against South Africa.\nPut into bat in the rain-hit match, India posted a strong 171-7 with skipper Rohit Sharma (57) and Suryakumar Yadav (47) scoring bulk of the runs on a slow track at the Providence Stadium in Guyana.\nThe 2007 champions then returned to bundle out England for 103 inside 17 overs with their spin duo of Axar Patel and Kuldeep Yadav wreaking havoc with the turning ball.\nIt will be a clash of the tournament's two unbeaten sides when India lock horns with South Africa in Bridgetown on Saturday.\n\"It's very satisfying to win this game,\" an elated Rohit, playing potentially his last T20 World Cup, said.\n\"We worked really hard as a unit. To win like that was a great effort from everybody.\"\nRain and a wet outfield delayed start of the match and England captain Jos Buttler elected to field after winning the toss.\nIndia managed 46 runs from the six power-play overs and it cost them the wickets of Virat Kohli and Rishabh Pant.\nRohit began with a couple of streaky shots but soon grew in confidence.\nSuryakumar, at the other end, scooped Chris Jordan over fine leg in what has been his trademark shot for a six before rain stopped play with India 65-2 in eight overs.\nOnce play resumed more than an hour later, Rohit reached his 36-ball fifty with a six, which also brought up India's 100 in the 13th over.\nAdil Rashid bowled Rohit and Jofra Archer denied Suryakumar a fifty to temporarily peg back India.\nJordan (3-37) dismissed Hardik Pandya and Shivam Dube with successive deliveries but India still managed to post a competitive total.\nEngland began briskly but were reeling at 49-5 after a top order meltdown triggered by Axar (3-23).\nThe left-arm spinner dismissed Buttler (23) with his first ball and removed Jonny Bairstow for a duck in his next over.\nIn between, Phil Salt had his leg stump pegged back by Jasprit Bumrah.\nPlayer-of-the-match Axar returned to dismiss Moeen Ali stumped before fellow spinner Kuldeep (3-19) twisted the knife on a slow pitch where the ball occasionally kept low.\nThe left-arm wrist spinner trapped both Sam Curran and Jordan and clean bowled Harry Brook (25) to put India firmly in charge.\n\"India outplayed us, certainly,\" Buttler said.\n\"We let them maybe get 20-25 too many on a challenging surface that they played well on. They fully deserved to win.\"\nUnder Buttler, England failed to defend their 50-overs World Cup title in India last year. REUTERS", "url": "https://www.straitstimes.com/sport/india-beat-england-to-reach-t20-world-cup-final"}