{"authors": [], "date_download": "2024-10-12 14:01:46", "date_modify": "2024-10-12 14:01:46", "date_publish": "2024-07-21 22:11:28", "description": "The win could not come any sweeter for the world No. 51, as he claimed a remarkable 6-3, 6-2 triumph over the 38-year-old. Read more at straitstimes.com.", "filename": "sport_tennis_nuno-borges-clinches-first-career-title-with-victory-over-rafael-nadal-in-bastad_1728741706.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/21/2024-07-21T131320Z1742615616RC2OZ8APA56RRTRMADP3TENNIS-NORDEA.JPG?VersionId=.3l7SFF0R.6SnIMFj8f2mFHjgdtexJmd", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_nuno-borges-clinches-first-career-title-with-victory-over-rafael-nadal-in-bastad_1728741706.html", "title": "Nuno Borges clinches first career title with victory over Rafael Nadal in Bastad", "title_page": "Nuno Borges clinches first career title with victory over Rafael Nadal in Bastad | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BASTAD – Portugal’s Nuno Borges was seeking his first ATP career title, but little did he know that it would come against the great Rafael Nadal, and on the Spaniard’s favourite clay court.\nVictory could not come any sweeter for the world No. 51, as he claimed a remarkable 6-3, 6-2 win over the 38-year-old veteran in the ATP 250 Swedish Open final on July 21.\n“I don’t know what to say. I think that I was wishing for this moment for a while already,” said the 27-year-old, who dropped to his knees in celebration as he clinched the championship point.\n“I know we all wanted Rafa to win. A part of me wishes that too. But something bigger inside me pushed through. It wasn’t about playing my best today, it was about coming up in the big moments. I couldn’t have played better.\n“I’m just really happy overall. I really don’t know what to say, I’m very emotional.”\nBorges thoroughly deserved his victory, as he broke his much-heralded opponent’s serve five times in the 88-minute clash.\nUnlike Nadal’s battling three-set wins against Mariano Navone of Argentina and Croatia’s Duje Ajdukovic earlier last week en route to the final, he could not find an extra gear to raise his level this time.\nThe Spaniard admitted that the better man won and was also gracious in defeat.\n“First of all, congratulations to Nuno. You played great all week. You deserve it more than anyone else. Enjoy your moment. It’s a special moment, winning a title. I wish you all the very best for the rest of the season,” he said.\n“I really had fun on court. I played some long and good matches. Today wasn’t my best day. But all credit to Nuno. He played very, very well and it was difficult for me, so well done.”\nIt was Nadal’s first final since his triumph at the 2022 French Open, where he won Roland Garros for a record-extending 14th time.\nIn recent years, the 22-time Grand Slam champion struggled with injuries and fitness issues and only last week returned to action for the first time since losing in the first round of the French Open in late May.\nHis successful comeback in Bastad, despite not winning the title, is a boost for this week’s Paris Olympics, where tennis will be played on clay at Roland Garros.\nNadal won singles gold in Beijing in 2008 and doubles gold with Marc Lopez at Rio 2016. He will be partnering reigning French Open and Wimbledon champion Carlos Alcaraz in the French capital.\nElsewhere, French fifth seed Arthur Fils defeated German top seed Alexander Zverev 6-3, 3-6, 7-6 (7-1) to lift the Hamburg title.\nZverev was looking to add to his sole triumph in 2024 ahead of his Olympic title defence in Paris. AFP", "url": "https://www.straitstimes.com/sport/tennis/nuno-borges-clinches-first-career-title-with-victory-over-rafael-nadal-in-bastad"}