{"authors": ["Lin Tianbao"], "date_download": "2024-10-12 14:09:32", "date_modify": "2024-10-12 14:09:32", "date_publish": "2024-04-25 22:28:54", "description": "His layup with 4.3 seconds sent the crowd into a frenzy. Read more at straitstimes.com.", "filename": "sport_schools_hugo-tan-s-late-bucket-helps-swiss-cottage-end-30-year-title-drought-in-b-div-boys-basketball_1728742172.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/25/1NSL4882.jpg?VersionId=ioq.06dsMDmFDadIOrIlH368ce.qmMlK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_schools_hugo-tan-s-late-bucket-helps-swiss-cottage-end-30-year-title-drought-in-b-div-boys-basketball_1728742172.html", "title": "Hugo Tan’s late bucket helps Swiss Cottage secure first B Div boys’ basketball title since 1994", "title_page": "Hugo Tan’s late bucket helps Swiss Cottage secure first B Div boys’ basketball title since 1994 | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – With the score at 49-all, Swiss Cottage Secondary School were staring at overtime in the B Division boys’ basketball final on April 25.\nBut up stepped their guard Hugo Tan, who picked the ball up on the right and attacked the paint.\nWith 4.3 seconds left, the 16-year-old made a crucial lay-up that sent the crowd at Jurong East Sports Hall into delirium.\nThey had broken the deadlock with Jurong Secondary School and taken a major step towards their first title in 30 years. That was secured by two free throws from Jarren Lee as Swiss Cottage won 53-49.\nRecounting his late bucket, Hugo, who had a game-high 21 points, said: “I saw that the defence was in a higher position, so I drove towards the baseline.\n“The shot felt very good, because it put us in a position to win and gave us momentum all the way to the end.”\nIt was a perfect end to the season for Swiss Cottage, who also clinched the West Zone title in March after ousting the same opponents. They had lost both finals to Bukit Panjang Government High School in 2023.\nCaptain Firdaus Nur Rasyidi, who won the final’s Most Valuable Player (MVP) award after contributing 18 points, said the victory felt surreal.\nThe 16-year-old centre added: “Winning a championship is very rare for me. Losing was a big part of my 2023, so winning this year feels very special.\n“Winning MVP is special because to show up in a big game is really important but, without my team, I wouldn’t be here. We’ll treasure this moment a lot, and we appreciate everyone who got us to this stage.”\nSwiss Cottage raced to a 15-2 lead after just eight minutes, but Jurong then started firing on all cylinders and went on a 19-4 run – including four shots from beyond the arc – that gave them a 21-19 advantage.\nSwiss Cottage held a slender 29-27 lead at the interval with both teams then tied at 40-all after three quarters.\nThe teams continued neck and neck until Hugo’s late bucket gave Swiss Cottage the lead which they never relinquished.\nFirdaus admitted that losing their early advantage was a blow.\n“We feel frustrated that they came back because having an early lead is a good advantage, and once we lost that we felt pressured. Our target then was to just get the lead and the momentum to win the game,” he said.\nJaden Ng led Jurong with 16 points, while captain Du Zhuoyuan and Khoo Wei Le chipped in with 12 and 11 points respectively.\nZhuoyuan said: “We started off slow, but did well in the second half. Reaching the final wasn’t easy for everyone, we trained hard and wanted to get here. We’ve really grown as a team.”\nIn the B girls’ final, Nanyang Girls’ High School defeated Chung Cheng High School (Main) 57-31 to retain their title.\nNanyang’s MVP Karis Lau credited her teammates’ support, saying: “I knew that every one of my teammates had my back so I could perform the way I did today, but all of us did well.”\nCaptain Vennie Lee added: “Watching our seniors fight hard last year really motivated us to do the same this year. There was some pressure, but we also remembered we have nothing to lose so we just went out and play.”\nWong Xin Ni led Chung Cheng with nine points.\nCaptain Tricia Lau, who scored eight points, said: “We’ve come so far together, and everyone really stepped up and gave her all.”", "url": "https://www.straitstimes.com/sport/schools/hugo-tan-s-late-bucket-helps-swiss-cottage-end-30-year-title-drought-in-b-div-boys-basketball"}