{"authors": [], "date_download": "2024-10-12 14:17:10", "date_modify": "2024-10-12 14:17:10", "date_publish": "2023-10-08 19:25:20", "description": "Max Verstappen will have to wait until December to get his hands on the Formula One champion's trophy, after winning his third title in Qatar on Saturday, but the Red Bull driver said that was no big deal. Read more at straitstimes.com.", "filename": "sport_formula-one_verstappen-easy-about-absence-of-f1-title-trophy_1728742630.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/08/LYNXMPEJ97051-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_verstappen-easy-about-absence-of-f1-title-trophy_1728742630.html", "title": "Verstappen easy about absence of F1 title trophy", "title_page": "Verstappen easy about absence of F1 title trophy | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA - Max Verstappen will have to wait until December to get his hands on the Formula One champion's trophy, after winning his third title in Qatar on Saturday, but the Red Bull driver said that was no big deal.\nFormula One differs from other sports like soccer or tennis in handing out its silverware at a formal awards ceremony rather than at the actual moment of triumph and as part of the immediate show.\nThis year's FIA gala prizegiving is due to take place in Baku on Dec. 8, with the final race of the F1 season in Abu Dhabi on Nov. 26.\n\"It’s OK, they look the same. I have two at home so they're not changing,\" Verstappen told reporters when asked if it was a shame to have to wait for the trophy rather than be able to raise it aloft with his team mates.\n\"It's just one extra name on it. But it's OK, I can wait a little bit. I've got one next to my sim rig (race car simulator) and one next to the TV.\"\nThe Dutch 26-year-old has also won 48 grands prix so far -- making him the fifth most successful F1 driver of all time in terms of race wins -- and has plenty of other trophies in his collection.\nAll Verstappen got on Saturday, after finishing runner-up in a 19-lap sprint race that clinched the title after sole rival and team mate Sergio Perez crashed out, was a second place plaque.\nThere are no podium ceremonies for the sprint race, so as not to take lustre away from the main event on Sunday when the top three drivers are handed trophies. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/verstappen-easy-about-absence-of-f1-title-trophy"}