{"authors": [], "date_download": "2024-10-12 14:13:59", "date_modify": "2024-10-12 14:13:59", "date_publish": "2022-10-07 15:09:10", "description": "BUENOS AIRES - A football fan died in Argentina and the match between Gimnasia La Plata and Boca Juniors was abandoned on Thursday after tear gas fired by police outside the venue drifted into the stadium and made it difficult for players and spectators to breathe. Read more at straitstimes.com.", "filename": "sport_football_football-fan-dies-in-argentina-match-abandoned-as-players-forced-off-due-to-tear-gas_1728742439.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/10/07/ads-jczstadium-071022.jpg?VersionId=Ya.BdHJvqe4DyTCgQZcI5CUAlc7b04aK", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_football-fan-dies-in-argentina-match-abandoned-as-players-forced-off-due-to-tear-gas_1728742439.html", "title": "Football: Fan dies in Argentina, match abandoned as players forced off due to tear gas", "title_page": "Football: Fan dies in Argentina, match abandoned as players forced off due to tear gas | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BUENOS AIRES - A football fan died in Argentina and the match between Gimnasia La Plata and Boca Juniors was abandoned on Thursday after tear gas fired by police outside the venue drifted into the stadium and made it difficult for players and spectators to breathe.\nThe circumstances surrounding the death were unclear but Sergio Berni, security minister for Buenos Aires province, told local television that the fan died of a heart problem as he was leaving the Juan Carmelo Zerillo Stadium in La Plata.\nThe incident comes five days after a stampede at a football game in Indonesia killed at least 131 people when fans, who had invaded the pitch, tried to flee after tear gas was fired by police in one of the world's worst sporting disasters.\nAccording to authorities in Argentina, Gimnasia fans were trying to force their way into the stadium which was already full, and police used rubber bullets and tear gas to force them back.\nPlayers were seen covering their faces, while supporters entered the field as they tried to escape the tear gas. The Argentinian top-flight match was stopped after nine minutes.\nESPN quoted Gimnasia player Leonardo Morales as saying: \"My two-year-old son couldn't breathe. We feel desperate and worried about all the people in the stands.\n\"We were playing a normal football game and it turned it into this and the feeling that our relatives almost died.\"\nBerni said his ministry would open an investigation into the incident, adding that too many tickets might have been sold, but home team Gimnasia said that was not the case and they had complied with security protocols.\n\"We will demand an investigation into what happened until those responsible for this tragic day ... are known,\" the club said in a statement. REUTERS", "url": "https://www.straitstimes.com/sport/football/football-fan-dies-in-argentina-match-abandoned-as-players-forced-off-due-to-tear-gas"}