{"authors": ["Rohit Brijnath"], "date_download": "2024-10-12 13:42:10", "date_modify": "2024-10-12 13:42:10", "date_publish": "2024-07-27 23:04:00", "description": "Don’t underestimate the power of words. Coaches in Paris shout them. Athletes mutter them in call rooms. Read more at straitstimes.com.", "filename": "sport_under-a-soft-rain-at-the-paris-olympics-hardy-rowers-use-the-power-of-words_1728740530.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/27/pixparis27.792063a4.Attachment.094911.jpg?VersionId=JDzWHZWdQTj20mEkNtlbzP3.MByrUNQi", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_under-a-soft-rain-at-the-paris-olympics-hardy-rowers-use-the-power-of-words_1728740530.html", "title": "Under a soft rain at the Paris Olympics, hardy rowers use the power of words", "title_page": "Under a soft rain at the Paris Olympics, hardy rowers use the power of words | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – The name of a stranger from a foreign land is written on a sticker in Jacob Plihal’s boat.\n“Kim,” it says.\nShe isn’t Plihal’s friend, she isn’t family. This polite, 2.08m American hasn’t even ever met the Australian. But under a gently pecking rain at the Vaires-sur-Marne Nautical Stadium in Paris, as we discuss motivation, this 28-year-old with an architectural degree mentions her name.\n“I’ll put little stickers in my boat sometimes,” explains Plihal. “Like a little mantra that’s been impactful lately. So one that comes to mind is just a name, Kim Brennan.\n“She was an Australian rower, single sculler, very successful, won (gold at) the 2016 Olympics. And I think she’s a very good influence on technique. So just writing “Kim” in my boat, I see that and I visualise how she rows and that’s someone I try to model (myself on).”\nThese Games are fiercer than we can imagine and races unfold like hasty, unforgiving interrogations. Just to make it clear, the Italian fencer Luigi Samele put it bluntly: “The goal of the Olympics, of course, is not to have a nice walk around the Olympic Village, but to go home with medals”.\nBut in this festival committed to the athletic deeds, don’t underestimate the power of words. Coaches in Paris shout them. Psychologists use them as balm. Athletes mutter them in call rooms. And sometimes, as with former medal-winning gymnast Louis Smith, they even tattoo reminders onto their arms: “What I Deserve I Earn”.\nSingapore rower Saiyidah Aisyah scribbles words in her journal, a sort of raw accounting of her days. Words to rise to and go to sleep with. Words to wear like armour. Words that before Rio 2016 – the first Olympics she qualified for – she pasted to her wall almost in the thousands. Some were truths, some a plea, some an athletic prayer.\n“Train to be bulletproof”.\n“It is meant to be hard”.\n“I am *&^%^& amazing.”\nThis year, making a comeback after stepping away from the sport, Aisyah turned to words again. Filled her journal with scribbles as if writing them down was reassurance. Just before the Games she shared two pages of them with The Straits Times.\n“I am strong, lifting heavy at the gym, 11 on the chin ups. Powerful.”\n“I have done this before. Trust. Let go.”\n“I know what pain feels like. I feel it every day out there on water. This is nothing different.”\nIncredibly after barely a year back, Aisyah qualified for Paris but on July 27, under a sulky grey sky, she couldn’t find her best self. In Rio, in her quarter-finals, she timed 7min 56sec across 2,000m; in Paris, in the heats where she came fifth out of five competitors, she stopped the clock at 8:17.04.\n“I know what I can do,” she said later, being unsparing with her words “and I did not do it today. The power was just not there. The speed was not there. Rowing is simple. It’s just put the blades in and take the blades out. And sometimes you may make it more complicated.”\nRowers embody strength, as if they’re massive human engines fitted neatly into slim boats. But these gleaming bodies, these flat, competitive faces, are partly lies. In sport, toughness always resides beside insecurity. Behind everyone’s fibre, doubt rustles.\n“(I’m) definitely trying to keep strong, positive thoughts,” says Olympic first-timer Paige Badenhorst of South Africa. “Acknowledging the demons that, yes, I’m nervous, everyone else is nervous. But also reminding myself of my strengths, what you do have that will help you fight those demons.”\nTo ward off these demons is to reach for words. To remind themselves of who they are. What they’ve done. How they’ve earned their way here. And so Badenhorst, part of the 2022 Cambridge crew who won the annual Boat Race on the River Thames, has words echoing in her head.\n“Calm. Cool. Collected.”\n“Fierce. Ruthless.”\n“Just repeat those words to myself.”\nDuring a race?\n“Before, during, after,” she says with laugh.\nAnd it’s not just her, it’s champions who reach for words to achieve that perfect state they’re searching for. Emma Twigg, 37, is the defending Olympic champion in the women’s single sculls, has a licence to skipper boats, can repair cycles and has an academic degree in sports. Still for all this, for all her four Games before Paris, she needs to talk to herself at the start.\n“You’ve done this a million times.”\nTwigg is surging forward, Aisyah has one more chance on July 28 in the repechage. “It’s me just against myself and whatever is in my head,” she said a little mournfully. There’s no guarantee in sport, but there is one thing you can be sure she did after her race.\nShe went back to the Village. Pulled out her journal. And found some refuge in words.", "url": "https://www.straitstimes.com/sport/under-a-soft-rain-at-the-paris-olympics-hardy-rowers-use-the-power-of-words"}