{"authors": [], "date_download": "2024-10-12 13:41:16", "date_modify": "2024-10-12 13:41:16", "date_publish": "2024-05-18 14:03:49", "description": "Midfielder Mohamed Elneny will leave Arsenal at the end of the season after eight years at the Premier League club, the Egypt international said on Friday. Read more at straitstimes.com.", "filename": "sport_football_elneny-to-leave-arsenal-after-eight-years_1728740476.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/18/LYNXMPEK4H01H-1.jpg?VersionId=ETK8LnxtmiyPi3mWHRYabbJjwsioLcEm", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_elneny-to-leave-arsenal-after-eight-years_1728740476.html", "title": "Elneny to leave Arsenal after eight years", "title_page": "Elneny to leave Arsenal after eight years | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Midfielder Mohamed Elneny will leave Arsenal at the end of the season after eight years at the Premier League club, the Egypt international said on Friday.\nElneny joined Arsenal from Swiss side FC Basel in 2016 for 5 million pounds ($6 million) and has made 161 appearances for the London club.\nA knee injury restricted the 31-year-old to eight outings during the 2022-23 season. He has made six appearances in all competitions in Arsenal's current campaign.\n\"Gooners, I'm here today to send you a message, to say goodbye and thank you for everything you've done for me,\" Elneny said in a video posted on X on Friday.\n\"The love, the support and the kindness. I'm really going to miss you so much and you'll be in my heart forever.\"\nElneny did not say where he would go after leaving Arsenal.\nHe said he would bid farewell to fans at the Emirates on Sunday as Arsenal host Everton in their final league match, hoping for a Manchester City slip-up against West Ham United to secure their first title in 20 years. REUTERS", "url": "https://www.straitstimes.com/sport/football/elneny-to-leave-arsenal-after-eight-years"}