{"authors": [], "date_download": "2024-10-12 14:03:14", "date_modify": "2024-10-12 14:03:14", "date_publish": "2024-08-02 22:04:55", "description": "Hyundai's Ott Tanak crashed out of Rally Finland on Friday and the team said co-driver Martin Jarveoja would remain in hospital overnight for observation. Read more at straitstimes.com.", "filename": "sport_rallying-tanak-crashes-out-of-rally-finland-co-driver-in-hospital_1728741794.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/LYNXMPEK710KY-1.jpg?VersionId=sZWyvshiz4iHQYGIxiRq80C_1FSBR34f", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_rallying-tanak-crashes-out-of-rally-finland-co-driver-in-hospital_1728741794.html", "title": "Rallying-Tanak crashes out of Rally Finland, co-driver in hospital", "title_page": "Rallying-Tanak crashes out of Rally Finland, co-driver in hospital | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Hyundai's Ott Tanak crashed out of Rally Finland on Friday and the team said co-driver Martin Jarveoja would remain in hospital overnight for observation.\nThe Estonian pair extracted themselves from the car unassisted after going off the road on stage three. They received medical attention at the scene before Jarveoja was transferred to hospital.\nHyundai said the car left the road at speed in wet and slippery conditions, rolled and hit a tree. The crew were ruled out for the rest of the weekend.\nTanak started the event in second place in the championship, eight points behind Belgian teammate Thierry Neuville. Finland is the ninth round of the season.\nAt the end of the first stage, Finland's Kalle Rovanpera was leading Elfyn Evans by eight seconds, with Sebastien Ogier 0.6 seconds behind Evans, all driving Toyotas. REUTERS", "url": "https://www.straitstimes.com/sport/rallying-tanak-crashes-out-of-rally-finland-co-driver-in-hospital"}