{"authors": [], "date_download": "2024-10-12 13:53:00", "date_modify": "2024-10-12 13:53:00", "date_publish": "2024-01-17 18:10:32", "description": "United Arab Emirates coach Paulo Bento said on Wednesday he hopes his team will not be distracted by the huge support Palestine are expected to receive when the two teams meet in their second Asian Cup Group C encounter. Read more at straitstimes.com.", "filename": "sport_football_coach-bento-hopes-support-for-palestine-will-not-distract-uae-at-asian-cup_1728741180.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/17/LYNXMPEK0G0BQ-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_coach-bento-hopes-support-for-palestine-will-not-distract-uae-at-asian-cup_1728741180.html", "title": "Coach Bento hopes support for Palestine will not distract UAE at Asian Cup", "title_page": "Coach Bento hopes support for Palestine will not distract UAE at Asian Cup | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA - United Arab Emirates coach Paulo Bento said on Wednesday he hopes his team will not be distracted by the huge support Palestine are expected to receive when the two teams meet in their second Asian Cup Group C encounter.\nPalestine enjoyed massive support at the stadium during their 4-1 loss to Iran in their group opener. Iranian fans also gave the Palestine team a warm welcome in a show of solidarity, with the conflict in Gaza raging for over 100 days.\n\"For me, no. It's not going to distract me ... I hope it doesn't disturb our players as well,\" Bento told reporters ahead of Thursday's game at Al Janoub Stadium.\n\"Some of the players have some experience while others not so much since it's their first time in such a competition ... What I think all the players and coaches like is that all stadiums should be full.\n\"Maybe it's a little bit different experience because in our league there aren't many people watching the games in stadiums. Until now I didn't see many people in stadiums for games of the national team in Abu Dhabi or Dubai.\"\nUAE, semi-finalists in 2019, beat Hong Kong 3-1 in their opener and Bento is looking to secure six points and put one foot in the knockout stage.\nWhile Palestine are seeking their first ever win at the Asian Cup since making their debut at the continental championship in 2015, the Portuguese coach said he is not taking them lightly.\n\"They are strong in the physical aspect with some players who are strong in heading duels,\" Bento said.\n\"It's a team that plays offence, more often with a direct game with some similar processes like our previous opponent.\n\"So we should be aware and focused in order to control their best moments and of course try to control the game according to our characteristics ... Our ambition is to win and to reach six points.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/coach-bento-hopes-support-for-palestine-will-not-distract-uae-at-asian-cup"}