{"authors": [], "date_download": "2024-10-12 13:44:58", "date_modify": "2024-10-12 13:44:58", "date_publish": "2023-10-13 19:43:48", "description": "Former Olympic champions Yelena Isinbayeva and Shamil Tarpischev -- Russia's two International Olympic Committee members -- have no contractual links to the country's military and have not supported the invasion of Ukraine, IOC President Thomas Bach said on Friday. Read more at straitstimes.com.", "filename": "sport_olympics-russias-ioc-members-have-no-links-to-military-no-support-of-ukraine-war-ioc_1728740698.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/13/LYNXMPEJ9C0JG-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_olympics-russias-ioc-members-have-no-links-to-military-no-support-of-ukraine-war-ioc_1728740698.html", "title": "Olympics-Russia's IOC members have no links to military, no support of Ukraine war-IOC", "title_page": "Olympics-Russia's IOC members have no links to military, no support of Ukraine war-IOC | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MUMBAI - Former Olympic champions Yelena Isinbayeva and Shamil Tarpischev -- Russia's two International Olympic Committee members -- have no contractual links to the country's military and have not supported the invasion of Ukraine, IOC President Thomas Bach said on Friday.\nBach was speaking a day after the IOC's executive board suspended the Russian Olympic Committee (ROC) for recognising regional organisations from four territories annexed from Ukraine.\nAsked why the IOC members from Russia had not been banned as well, Bach said an internal ethics investigation showed no reason to do so.\n\"What we have to have in mind is the position of IOC members. They are not representatives of Russia in the IOC,\" the German said. \"They are the representatives of the IOC in Russia.\n\"In order to ensure the equal treatment between officials and athletes we have nevertheless submitted these IOC members in Russia to an assessment by the IOC ethics commission,\" Bach added.\n\"The understanding of the ethics commission is that neither Ms Isinbayeva nor Mr Tarpischev had contractual links with the Russian military or security agencies or supported the war in Ukraine.\"\nIsinbayeva, a two-time Olympic pole vault champion, has received several honours by the Russian armed forces during her career and has also been repeatedly pictured in uniform.\nOn Thursday the IOC suspended the ROC and stopped any funding after it recognised earlier this month Olympic Councils from the regions of Luhansk, Donetsk, Kherson and Zaporizhzhia.\nBach said while the decision blocked Russian Olympic officials from attending Olympic meetings or taking part in the Olympics, athletes with Russian passports could continue competing as neutrals.\nThe IOC has yet to decide if Russian and Belarusian athletes will be allowed to compete at next year's Paris Olympics following last year's invasion of Ukraine, which Moscow calls a 'special military operation'.\n\"We will keep monitoring the developments. There is no time pressure,\" said Bach when asked about a decision for next year's Games in France.\n\"We reserve the right to invite by ourselves individual, neutral athletes with Russian passports and this means the ROC will have no role to play.\n\"These will be direct invitations which we will manage with the international federations and if needed then with the respective national federations, and also in this way to make it clear that there is no representation of Russia or Russian Olympic Committee by these athletes.\" REUTERS", "url": "https://www.straitstimes.com/sport/olympics-russias-ioc-members-have-no-links-to-military-no-support-of-ukraine-war-ioc"}