{"authors": [], "date_download": "2024-10-12 13:41:30", "date_modify": "2024-10-12 13:41:30", "date_publish": "2024-08-19 14:56:59", "description": "Australia captain Pat Cummins said he expects to lean a bit more heavily on all-rounders Cameron Green and Mitchell Marsh with the ball during the five-test series against India at the end of the year. Read more at straitstimes.com.", "filename": "sport_cummins-expects-bigger-roles-for-green-marsh-in-india-series_1728740490.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/19/LYNXMPEK7I06M-1.jpg?VersionId=DdcQIfUZiBcY2xh87UAvGWcN0UfohsKH", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_cummins-expects-bigger-roles-for-green-marsh-in-india-series_1728740490.html", "title": "Cummins expects bigger roles for Green, Marsh in India series", "title_page": "Cummins expects bigger roles for Green, Marsh in India series | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Australia captain Pat Cummins said he expects to lean a bit more heavily on all-rounders Cameron Green and Mitchell Marsh with the ball during the five-test series against India at the end of the year.\nAustralia are looking to reclaim the Border-Gavaskar trophy from the visitors when the series begins on Nov. 22 in Perth, with further tests in Adelaide, Brisbane and Melbourne before the teams head to Sydney for the final match from Jan. 3.\nWith five tests to be played in just over six weeks, both sides are expected to be stretched to the limit and Cummins is backing Green and Marsh to play a bigger role with the ball.\n\"The last couple of summers have been pretty light, quick test matches,\" Cummins told reporters in Sydney on Monday.\n\"I suspect this summer might be a bit different at times. We'll be drawing on Cam Green and Mitch Marsh a bit more.\n\"Even someone like Cam Green basically started in (Sheffield) Shield cricket as a bowler, but hasn't had to bowl heaps in test matches.\n\"We're really lucky Nathan Lyon bowls plenty of overs, so you don't necessarily have to have an all-rounder.\n\"But it makes a big difference to have that fifth bowling option. We have six.\"\nIn preparation for the series, Cummins will sit out the white ball tour of England and Scotland in September to manage his workload.\nThe 31-year=old fast bowler has been granted a two-month break by Cricket Australia before playing in November's one-day series against Pakistan and in one of New South Wales' four Sheffield Shield matches.\n\"The priority at the moment is to smash out some gym work and start reassessing in a few weeks a path forward,\" he said.\n\"I'm just trying to fill up the bucket again after two years of non-stop bowling. (Hoping) come that first test in as good of a position as I have been in for a few years.\" REUTERS", "url": "https://www.straitstimes.com/sport/cummins-expects-bigger-roles-for-green-marsh-in-india-series"}