{"authors": ["Rebekah Chia"], "date_download": "2024-10-12 13:28:24", "date_modify": "2024-10-12 13:28:24", "date_publish": "2024-07-27 18:08:00", "description": "They are part of a team who will compete in the Singapore Para Open category at Pesta Sukan on July 28. Read more at straitstimes.com.", "filename": "sport_these-s-pore-dragon-boaters-have-lost-their-limbs-but-not-their-sporting-spirit_1728739704.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/27/rcboat20.aa3b54e9.Attachment.091022.jpg?VersionId=PeySuWGJ5j_0XBr44Gj.nfYSXCNMnJxU", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_these-s-pore-dragon-boaters-have-lost-their-limbs-but-not-their-sporting-spirit_1728739704.html", "title": "These S’pore dragon boaters have lost their limbs but not their sporting spirit", "title_page": "These S’pore dragon boaters have lost their limbs but not their sporting spirit | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Since losing his limbs to a Group B Streptococcus (GBS) infection, Tan Whee Boon has found a new lease on life in adaptive sports.\nIn 2016, a year after his amputations, he started participating in sports like badminton, table tennis and wheelchair rugby as well as scuba diving to relieve stress and frustration.\nThree years later, he found a new passion in adaptive dragon boating, using several custom-made devices – such as a seat with lower limb support, paddle attachments for his right and left upper limbs – designed to aid him in paddling the boat.\nTan, 59, trains for three hours every week at the Water Sports Centre in Kallang.\nHe plans to keep going in the sport until he physically cannot paddle, saying: “When I am in the water, I feel like something impossible has become possible.”\nHe is part of Alita Initiative, a non-profit organisation dedicated to creating adaptive dragon boating devices for persons with disabilities (PWDs). He will be in the team participating in the Singapore Para Open category at Pesta Sukan 2024 on July 28.\nThe 21-man crew will consist of six PWDs – two quad amputees, one lower limb amputee, and three stroke survivors – alongside 13 volunteers, one drummer and one steerer.\nAmong them is Henry Seah, who lost his legs and seven of his fingers after contracting pneumonia in 2017.\nThe devices created for him include a similar seat to Tan’s for securing his lower limbs, plus paddle attachments for his left and right arms to support his remaining fingers.\nSeah, 29, said: “The competition will be a good opportunity to drum up interest for para-dragon boating in Singapore, and showcase the fruits of the effort put in by the students who made the devices.\n“I think dragon boating is one of the more unique sports out there because everybody on the team has to move as one. It’s fascinating.”\nBoth he and Tan’s water sport journeys began in 2019, when their Amputee Support Group was approached by former national dragon boater Jason Chen, the founder of Alita Initiative.\nAlthough the project went on a hiatus in 2020 due to the pandemic, it restarted in 2023.\nChen said he was inspired by the movie Alita: Battle Angel, which is based on Japanese manga and features cyborgs with prosthetic limbs, to create the initiative.\nHe said: “I was thinking about how I can show the community that we can get paddlers with impairments to do dragon boating. So I started doing research, which led me to Boon and his community of friends.”\nThe long-term goal is to participate at the IDBF World Dragon Boat Racing Championships in Germany next July and the IDBF Club Crew World Championships in Taiwan in September 2026, he added.\nAlita Initiative now works with a team of six students from the Singapore University of Technology and Design (SUTD) to create the adaptive devices.\nLai Si Yuan, 23, a third-year student, said one challenge they faced was fitting the comfort and needs of the users.\nHe noted: “We work closely together with Boon and Henry to understand what is truly comfortable for them, and how it feels for them.\n“Although they are both quad amputees, they have specific requirements and preferences for how they would like to hold the paddles.\n“For Boon, he prefers to wrap the paddle around his upper arm rather than his lower arm, while Henry still has part of his hand, so we adapted the device to grip onto his digits.”", "url": "https://www.straitstimes.com/sport/these-s-pore-dragon-boaters-have-lost-their-limbs-but-not-their-sporting-spirit"}