{"authors": ["David Lee"], "date_download": "2024-10-12 13:41:38", "date_modify": "2024-10-12 13:41:38", "date_publish": "2024-08-08 03:29:11", "description": "Home favourite Celine Boutier leads with a superb seven-under 65. Read more at straitstimes.com.", "filename": "sport_singapore-golfer-shannon-tan-finishes-joint-50th-after-first-round-of-olympic-women-s-competition_1728740498.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/08/2024-08-07T083144Z2062825434UP1EK870NOT0CRTRMADP3OLYMPICS-2024-GOLF.JPG?VersionId=F1i3MoUDTmurOSHBmgPkaSPpy07t.r_o", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-golfer-shannon-tan-finishes-joint-50th-after-first-round-of-olympic-women-s-competition_1728740498.html", "title": "Singapore golfer Shannon Tan finishes joint-50th after first round of Olympic women’s competition", "title_page": "Singapore golfer Shannon Tan finishes joint-50th after first round of Olympic women’s competition | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – On a tough day when only 12 players broke par, Singapore’s Shannon Tan shot a six-over 78 on her Olympic debut to place joint-50th out of 60 golfers in the first round of the Paris 2024 women’s individual competition on Aug 7.\nThe 20-year-old, who qualified by world ranking to become the first Singaporean golfer to play at the Olympics, shot double bogeys on the 10th and 15th holes, as well as bogeys on holes No. 1, 4 and 7. She made her sole birdie on the 18th.\nLocal favourite Celine Boutier thrilled the crowd as she tamed the Le Golf National course with a sizzling seven-under 65 that included eight birdies against one bogey.\nSouth Africa’s Ashleigh Buhai was three strokes behind, while a clutch of four golfers – Mexican Gaby Lopez, Swiss Morgane Metraux, Colombian Mariajo Uribe and American Lilia Vu – are joint-third after firing two-under 70.\nDefending champion Nelly Korda of the United States fought back from three bogeys on the first eight holes to finish on even par at joint-13th, along with 12 other players.\nPlay continues on Aug 8 with competitors involved in all four rounds as there is no cut for the tournament.", "url": "https://www.straitstimes.com/sport/singapore-golfer-shannon-tan-finishes-joint-50th-after-first-round-of-olympic-women-s-competition"}