{"authors": ["Lin Tianbao"], "date_download": "2024-10-12 13:43:01", "date_modify": "2024-10-12 13:43:01", "date_publish": "2024-04-20 09:32:50", "description": "Geraldine Lee was the first Singaporean to compete in the sport (K1 500m) in London 2012. Read more at straitstimes.com.", "filename": "sport_singapore-kayaker-stephenie-chen-qualifies-for-paris-olympics_1728740581.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/20/WhatsApp20Image202024-04-2020at2013.44.17.jpg?VersionId=V9g_ULK3Roz.XE26oqnFVQ.LLi2hbr3m", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_singapore-kayaker-stephenie-chen-qualifies-for-paris-olympics_1728740581.html", "title": "Singapore kayaker Stephenie Chen earns quota spot for Paris Olympics", "title_page": "Singapore kayaker Stephenie Chen earns quota spot for Paris Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – It has taken Stephenie Chen three years but the national kayaker’s hard work and doggedness paid off on April 20, when she finally earned Singapore a berth at the Paris Olympics.\nIn 2021, the 32-year-old had to endure heartbreak after narrowingly missing out on a spot at the Tokyo Games by less than a second not once, but twice during a qualifier.\nThe agony of coming so close made her question her commitment several times in the years after, so it was a huge relief when she finally did it.\nShe told The Sunday Times: “I came so close in 2021, and I sometimes go through the process of questioning ‘is it worth risking another three years to get here?’.\n“I know I will be far happier and more excited once I begin my preparations and race at Paris, but for now I feel relieved that the sacrifices I’ve made have paid off and shown my capabilities.”\nCompeting in the April 18-21 Asian canoe sprint Olympic qualifiers in Tokyo, Chen finished third (2min 6.129sec) in the women’s K1 500m race.\nChina’s Zhang Luxi and Uzbekistan’s Ekaterina Shubina were first and second in 2:02.328 and 2:04.043 respectively.\nKayakers were fighting for two Olympic quota places, up from one in the last qualifiers. China have used up all six women’s quota spots for the Paris Games.\nWith Chen’s quota spot, Singapore’s kayakers will end a 12-year absence at the Olympics – Geraldine Lee was the first from the country to compete in the sport (K1 500m) in London 2012. The Singapore Canoe Federation will reveal the selection criteria for the quota place at a later date.\nChen added: “It’s very difficult to put (the achievement) into words. To achieve your goals in a race and it hits you so suddenly, it’s almost overwhelming to come to terms with achieving a lifelong goal.”\nShe also revealed that she has made steady progress since the 2021 Asian Olympic qualifiers in Pattaya, where she missed out after finishing second and just 0.938 of a second behind Kazakhstan’s Natalya Sergeyeva in the K1 500m.\nShe went even more agonisingly close a day later in the K1 200m, with a mere 0.067sec standing between her and a ticket to the Tokyo Olympics.\nShe was third in 40.325sec, behind Kazakhstan’s Inna Klinova (40.123sec) and Japan’s Yuka Ono (40.258sec) – the spot went to Ono as Kazakhstan had already qualified.\nBut she has bounced back from that disappointment since, winning a silver in the K1 500m at the Hangzhou Asian Games in 2023.\nWith three months to go to the July 26-Aug 11 Paris Olympics, Chen is stepping up her preparations as she targets a top-16 finish.\nShe said: “A plan has been brewing in the background for some time with my coach, so hopefully everything will fall into place very quickly and seamlessly. We know exactly what I need to do and how we will do it. So it excites me to know we have a process and I’m confident it will fall into place in Paris.”\nChen’s coach David Smith told ST: “Watching her toil away with her drive and commitment has really motivated me as a coach... The level of commitment and determination she has shown through her career is beyond admirable, and it’s been a pleasure to be a part of her journey. To achieve the peaks of her career so late into her journey proves how determined and committed she is to being the best athlete she can be.”\nThe other Singaporeans who have qualified for the Olympics are: sprinter Shanti Pereira (women’s 200m); equestrienne Caroline Chew (individual dressage); fencer Amita Berthier (women’s foil); sailors Maximilian Maeder (kitefoiling) and Ryan Lo (men’s Laser); and swimmers Jonathan Tan (men’s 50m freestyle), Letitia Sim (women’s 100m breaststroke) and the women’s 4x100m medley relay team comprising Quah Ting Wen, Quah Jing Wen, Letitia and Levenia Sim.", "url": "https://www.straitstimes.com/sport/singapore-kayaker-stephenie-chen-qualifies-for-paris-olympics"}