{"authors": [], "date_download": "2024-10-12 14:01:31", "date_modify": "2024-10-12 14:01:31", "date_publish": "2024-07-21 23:49:20", "description": "Nadal saw his serve broken five times in the one-hour and 27-minute contest. Read more at straitstimes.com.", "filename": "sport_tennis_nadal-beaten-in-straight-sets-by-borges-in-bastad-final_1728741691.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/22/LYNXMPEK6K06F-1.jpg?VersionId=ym4u1auWDb9_9Z30vEtEYtRYjZx34xe4", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_nadal-beaten-in-straight-sets-by-borges-in-bastad-final_1728741691.html", "title": "Nadal beaten in straight sets by Borges in Bastad final", "title_page": "Nadal beaten in straight sets by Borges in Bastad final | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "BASTAD - Rafael Nadal suffered a setback in his Paris 2024 Olympics preparations on July 21 as he was beaten 6-3 6-2 in the Swedish Open final by Portuguese seventh seed Nuno Borges.\nThe 38-year-old Spaniard was playing his first title match since his 2022 French Open triumph, but saw his serve broken five times in the one-hour and 27-minute contest as Borges won his maiden tour final.\nMaking first appearance at the ATP Tour 250 event since winning the singles as a 19-year-old in 2005, Nadal was warming up for his bid for another Olympic medal at the Paris 2024 Games.\n\"Many congratulations to Nuno. You've been playing great during the whole week, so you deserve it more than anyone else here... It's always special winning a title,\" the 22-times Grand Slam champion said.\n\"I have been here for the week enjoying this amazing place. I really had fun on court, played some very long matches. Today wasn't my best day, but all the credit to Nuno. He played very well and it was so difficult for me, so well done.\"\nNadal missed almost all of 2023 with a hip problem and his comeback earlier this year was stalled by a muscle tear, before small physical issues affected his preparation for the French Open, where he suffered a first-round exit.\nThe record 14-times French Open winner then skipped Wimbledon to prepare for the Olympic tennis tournament, which will take place at Roland-Garros from July 27-Aug 4.\nNadal won an Olympic singles gold medal in Beijing in 2008 and a doubles gold in the 2016 Rio de Janeiro Olympics. He will team up with four-times major winner Carlos Alcaraz, 21, in the doubles at Paris 2024. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/nadal-beaten-in-straight-sets-by-borges-in-bastad-final"}