{"authors": [], "date_download": "2024-10-12 13:40:51", "date_modify": "2024-10-12 13:40:51", "date_publish": "2024-08-25 00:03:30", "description": "Yves Bissouma and Cristian Romero also score in an accomplished display by the home side. Read more at straitstimes.com.", "filename": "sport_football_son-brace-eases-tottenham-to-4-0-win-over-hapless-everton_1728740451.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/25/2024-08-24T142252Z727480242UP1EK8O13Y2PCRTRMADP3SOCCER-ENGLAND-TOT-EVE-REPORT.JPG?VersionId=3lrVZ8oYPYXwcjxuunv9cPXYPooStSYL", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_son-brace-eases-tottenham-to-4-0-win-over-hapless-everton_1728740451.html", "title": "Son Heung-min brace eases Tottenham to 4-0 win over hapless Everton", "title_page": "Son Heung-min brace eases Tottenham to 4-0 win over hapless Everton | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON - Goalkeeper Jordan Pickford’s error and Son Heung-min’s brace helped Tottenham Hotspur to a comprehensive 4-0 victory over hapless Everton in the Premier League on Aug 24.\nYves Bissouma and Cristian Romero were also among the goals as Tottenham eased to their first win of the campaign in a game they dominated against a visiting side who have conceded seven times in two games this season and are yet to score themselves.\nPickford carelessly miss-controlled a simple back pass in the first half, allowing Son to snatch the ball from him and score Tottenham’s second goal into an empty net, as the home side produced an accomplished display.\nEverton, without several first-choice defenders due to injury, were unable to put pressure on their hosts and manager Sean Dyche will be seeking a quick improvement when they host Bournemouth next week in what is already looking like an important game for his struggling side.\nTottenham manager Ange Postecoglou was left frustrated after they let a lead slip at Leicester City in the season opener, but they were in control of this match throughout.\n\"I think we thoroughly deserved it. We dominated and we felt we should have had three points last Monday (at Leicester),\" Tottenham midfielder James Maddison said.\n\"The performance was there on Monday. It was a case of not putting our chances away. It's important you try and put into practice what the manager wants. It's about us trusting him.\"\nBar set-pieces opportunities, Everton offered little attacking threat and the home side made them pay for poor defending.\nTottenham took the lead as Bissouma scored his first for the club when the ball fell to him on the edge of the box and he thrashed it home off the underside of the crossbar.\nThey doubled their advantage after Pickford was sloppy in controlling the ball on the wet surface and Son’s pace and anticipation of the error enabled him to score his first of the afternoon.\nEngland number one Pickford lifted his hand in apology to the Everton fans and teammates.\nTottenham appeared to take their foot off the gas after that, though they remained in control of the game, and it was not until the 70th minute they scored a third.\nRomero powered a header into the net from a corner as Pickford stood statuesque on his goalline when he might have come to collect the ball inside his six-yard box.\nSon added the fourth after a superb run from his own box by defender Micky van de Ven set up the South Korean to finish from a tight angle. REUTERS", "url": "https://www.straitstimes.com/sport/football/son-brace-eases-tottenham-to-4-0-win-over-hapless-everton"}