{"authors": ["Deepanraj Ganesan"], "date_download": "2024-10-12 13:28:16", "date_modify": "2024-10-12 13:28:16", "date_publish": "2024-07-27 17:52:40", "description": "The Emirates FA cup is now only on StarHub TV+ in Singapore Read more at straitstimes.com.", "filename": "sport_football_starhub-adds-fa-cup-to-its-football-offerings-for-the-new-season_1728739696.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/27/2024-05-25T162840Z824933775UP1EK5P19RQ04RTRMADP3SOCCER-ENGLAND-MCI-MUN-REPORT.JPG?VersionId=0kHRUZFa3uw9p5T.amBnYSzFOGI3BVa8", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_starhub-adds-fa-cup-to-its-football-offerings-for-the-new-season_1728739696.html", "title": "StarHub adds FA Cup to its football offerings for the new season", "title_page": "StarHub adds FA Cup to its football offerings for the new season | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – Football fans in Singapore will be able to make StarHub TV+ their one-stop platform for their football fix in the 2024-25 season following the telco’s announcement on July 26 that it has secured rights to broadcast the FA Cup.\nBroadcast rights for the English Premier League (EPL) returned to StarHub in 2022, when the company inked an exclusive six-year partnership with the league. Singtel TV was previously the official broadcaster here for 12 seasons.\nThe FA Cup, established in 1871 and is the oldest football competition in the world, was also previously available on Singtel TV’s Mio Sports channel.\nIn May, Manchester United who were huge underdogs, after an eighth-placed finish in the EPL, upset Manchester City 2-1 to win the FA Cup and denied their rivals from becoming the first English club to win the double in successive seasons.\nStarHub said in a media statement that the FA Cup will be live on Hub Sports 2 (Ch202) and that existing Sports+ customers will be able to enjoy the competition at no additional costs.\nWith its latest addition, StarHub customers can now watch matches from the Champions League, Europa League, the German Bundesliga, La Liga and Seria A on the same platform.\nUnder cross-carriage rules, the FA Cup will also be available to subscribers from Singtel TV who signed up for the EPL package.\nStarHub’s chief of consumer business group Johan Buse said: “The addition of the Emirates FA Cup to StarHub TV+ solidifies our position as the market leader in sports home entertainment, ensuring customers have access to a diverse range of top-tier sports action. At StarHub, we are committed to expanding our sports offerings and enhancing the viewing experience for our customers. With the broadcasting rights to premier sports events like the Premier League, UEFA Champions League, and now the Emirates FA Cup, we are proud to deliver a rich array of premium entertainment content.”\nAnna Yip, Deputy CEO, CEO Business Development, Singtel Singapore said in a statement: “We are disappointed at not having the broadcast rights to the new season of the FA Cup. Our customers are our top priority and we are currently working out the cross carriage arrangements with IMDA (Infocomm Media Development Authority) and the rights holder to provide access to the matches via Singtel TV. More details will be shared soon.”\nThe English football season will kick off on Aug 10 with the traditional Community Shield match between the FA Cup holders United and EPL champions City, which will also be on StarHub TV+.\nThe new EPL season kicks off on Aug 16 with United hosting Fulham.\nAligned with StarHub’s “Football For All” initiative to make football more accessible in Singapore, StarHub added in a media statement that it will continue to host complimentary live screenings of selected EPL matches at various locations for the upcoming season and remains dedicated to expanding these live screenings throughout the upcoming season.\nStarHub will also continue to collaborate with partners to bring exciting football events to Singapore, enhancing the local sports scene.", "url": "https://www.straitstimes.com/sport/football/starhub-adds-fa-cup-to-its-football-offerings-for-the-new-season"}