{"authors": [], "date_download": "2024-10-12 13:42:39", "date_modify": "2024-10-12 13:42:39", "date_publish": "2024-06-25 22:42:33", "description": "HAMBURG, Germany - Czech Republic may have to do without key striker Patrik Schick for their decisive last Euro 2024 Group E game against Turkey on Wednesday, coach Ivan Hasek said on the eve of the match. Read more at straitstimes.com.", "filename": "sport_football_czechs-sweat-on-schick-s-availability-for-turkey-game_1728740559.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/06/25/LYNXMPEK5O0NE-1.jpg?VersionId=H3rH5xeOux9RskCrjW6wLxzkys.U7igj", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_czechs-sweat-on-schick-s-availability-for-turkey-game_1728740559.html", "title": "Czechs sweat on Schick’s availability for Turkey game", "title_page": "Czechs sweat on Schick’s availability for Turkey game | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HAMBURG, Germany - Czech Republic may have to do without key striker Patrik Schick for their decisive last Euro 2024 Group E game against Turkey on Wednesday, coach Ivan Hasek said on the eve of the match.\nThe 28-year-old Schick, who was joint top scorer at Euro 2020, hobbled out of their last match against Georgia in Hamburg on Saturday with a calf injury and has not trained since.\n\"Patrik has been with the physios and doctors for the last two days. He wasn't training. He's getting better, but we will see tomorrow,\" Hasek told a press conference.\n\"Schick is a key player, one of the best scorers in Europe. But if he's not able to play, we need to replace him. And we have players who are able to replace him and they are ready and been working hard, added Hasek.\nSchick’s absence would be a serious blow to Czech hopes of progressing to the last 16. They lost to Portugal and were fortunate to avoid defeat by Georgia to earn a point.\nThat means the Czechs must win on Wednesday to stand any chance of progressing and Hasek said they wanted to play for those squad members who have not yet appeared at the tournament.\n\"There is a positive energy in the team. Some of the players have not played yet, not got that many opportunities and we want to win for them, mostly so that their chances of getting on the pitch and playing here remains,\" he said.\n\"I really have great trust in my team, they play as one man and I think we will show that on the pitch.\"\nIt will not be easy, however, against Turkey who would progress with a draw.\n\"Getting out of the group is success, not getting out is failure,\" Hasek said. \"We came here to get out of the group and advance into the knockout stage. Obviously, if we don't advance that will be a failure.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/czechs-sweat-on-schick-s-availability-for-turkey-game"}